[{"id": "1412.0709", "submitter": "Cameron Smith", "authors": "Cameron Smith, Raymond S. Puzio, Aviv Bergman", "title": "Hierarchical Network Structure Promotes Dynamical Robustness", "comments": "23 pages, 9 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE nlin.CD physics.data-an q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The relationship between network topology and system dynamics has significant\nimplications for unifying our understanding of the interplay among metabolic,\ngene-regulatory, and ecosystem network architecures. Here we analyze the\nstability and robustness of a large class of dynamics on such networks. We\ndetermine the probability distribution of robustness as a function of network\ntopology and show that robustness is classified by the number of links between\nmodules of the network. We also demonstrate that permutation of these modules\nis a fundamental symmetry of dynamical robustness. Analysis of these findings\nleads to the conclusion that the most robust systems have the most hierarchical\nstructure. This relationship provides a means by which evolutionary selection\nfor a purely dynamical phenomenon may shape network architectures across scales\nof the biological hierarchy.\n", "versions": [{"version": "v1", "created": "Mon, 1 Dec 2014 22:24:44 GMT"}, {"version": "v2", "created": "Tue, 16 Jun 2015 04:46:06 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Smith", "Cameron", ""], ["Puzio", "Raymond S.", ""], ["Bergman", "Aviv", ""]]}, {"id": "1412.0742", "submitter": "Hari Sivakumar", "authors": "Hari Sivakumar, Stephen R. Proulx and Jo\\~ao P. Hespanha", "title": "Modular decomposition and analysis of biological networks", "comments": "Journal / technical report, 43 pages, 17 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the decomposition of biochemical networks into\nfunctional modules that preserve their dynamic properties upon interconnection\nwith other modules, which permits the inference of network behavior from the\nproperties of its constituent modules. The modular decomposition method\ndeveloped here also has the property that any changes in the parameters of a\nchemical reaction only affect the dynamics of a single module. To illustrate\nour results, we define and analyze a few key biological modules that arise in\ngene regulation, enzymatic networks, and signaling pathways. We also provide a\ncollection of examples that demonstrate how the behavior of a biological\nnetwork can be deduced from the properties of its constituent modules, based on\nresults from control systems theory.\n", "versions": [{"version": "v1", "created": "Mon, 1 Dec 2014 23:55:17 GMT"}], "update_date": "2014-12-03", "authors_parsed": [["Sivakumar", "Hari", ""], ["Proulx", "Stephen R.", ""], ["Hespanha", "João P.", ""]]}, {"id": "1412.0986", "submitter": "Mor Nitzan", "authors": "Mor Nitzan, Yishai Shimoni, Oded Rosolio, Hanah Margalit, Ofer Biham", "title": "Stochastic analysis of bistability in coherent mixed feedback loops\n  combining transcriptional and post-transcriptional regulations", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.91.052706", "report-no": null, "categories": "q-bio.MN physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mixed feedback loops combining transcriptional and post-transcriptional\nregulations are common in cellular regulatory networks. They consist of two\ngenes, encoding a transcription factor and a small non-coding RNA (sRNA), which\nmutually regulate each other's expression. We present a theoretical and\nnumerical study of coherent mixed feedback loops of this type, in which both\nregulations are negative. Under suitable conditions, these feedback loops are\nexpected to exhibit bistability, namely two stable states, one dominated by the\ntranscriptional repressor and the other dominated by the sRNA. We use\ndeterministic methods based on rate equation models, in order to identify the\nrange of parameters in which bistability takes place. However, the\ndeterministic models do not account for the finite lifetimes of the bistable\nstates and the spontaneous, fluctuation-driven transitions between them.\nTherefore, we use stochastic methods to calculate the average lifetimes of the\ntwo states. It is found that these lifetimes strongly depend on rate\ncoefficients such as the transcription rates of the transcriptional repressor\nand the sRNA. In particular, we show that the fraction of time the system\nspends in the sRNA dominated state follows a monotonically decreasing sigmoid\nfunction of the transcriptional repressor transcription rate. The biological\nrelevance of these results is discussed in the context of such mixed feedback\nloops in {\\it Escherichia coli}.\n", "versions": [{"version": "v1", "created": "Tue, 2 Dec 2014 17:20:52 GMT"}], "update_date": "2015-06-11", "authors_parsed": [["Nitzan", "Mor", ""], ["Shimoni", "Yishai", ""], ["Rosolio", "Oded", ""], ["Margalit", "Hanah", ""], ["Biham", "Ofer", ""]]}, {"id": "1412.1013", "submitter": "Alberto Calderone Dr.", "authors": "Alberto Calderone", "title": "Assembling biological boolean networks using manually curated databases\n  and prediction algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the large quantity of information available, thorough researches in\nvarious biological databases are still needed in order to reconstruct and\nunderstand the steps that lead to known or new phenomena. By using\nprotein-protein interaction networks and algorithms to extract relevant\ninterconnections among proteins of interest, it is possible to assemble\nsubnetworks from global interactomes. Using these extracted networks it is\npossible to use algorithms to predict signal directions while activation and\ninhibition effects can be predicted using RNA interference screenings. The\nresult of this approach is the automatic generation of boolean networks. This\nway of modelling dynamical systems allows the discovery of steady states and\nthe prediction of stimuli response.\n", "versions": [{"version": "v1", "created": "Tue, 2 Dec 2014 18:36:09 GMT"}], "update_date": "2014-12-03", "authors_parsed": [["Calderone", "Alberto", ""]]}, {"id": "1412.2153", "submitter": "Yannis Pantazis", "authors": "Georgios Arampatzis and Markos A. Katsoulakis and Yannis Pantazis", "title": "Accelerated Sensitivity Analysis in High-Dimensional Stochastic Reaction\n  Networks", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0130825", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a two-step strategy for parametric sensitivity analysis for\nsuch systems is proposed, exploiting advantages and synergies between two\nrecently proposed sensitivity analysis methodologies for stochastic dynamics.\nThe first method performs sensitivity analysis of the stochastic dynamics by\nmeans of the Fisher Information Matrix on the underlying distribution of the\ntrajectories; the second method is a reduced-variance, finite-difference,\ngradient-type sensitivity approach relying on stochastic coupling techniques\nfor variance reduction. Here we demonstrate that these two methods can be\ncombined and deployed together by means of a new sensitivity bound which\nincorporates the variance of the quantity of interest as well as the Fisher\nInformation Matrix estimated from the first method. The first step of the\nproposed strategy labels sensitivities using the bound and screens out the\ninsensitive parameters in a controlled manner based also on the new sensitivity\nbound. In the second step of the proposed strategy, the finite-difference\nmethod is applied only for the sensitivity estimation of the (potentially)\nsensitive parameters that have not been screened out in the first step. Results\non an epidermal growth factor network with fifty parameters and on a protein\nhomeostasis with eighty parameters demonstrate that the proposed strategy is\nable to quickly discover and discard the insensitive parameters and in the\nremaining potentially sensitive parameters it accurately estimates the\nsensitivities. The new sensitivity strategy can be several times faster than\ncurrent state-of-the-art approaches that test all parameters, especially in\n\"sloppy\" systems. In particular, the computational acceleration is quantified\nby the ratio between the total number of parameters over the number of the\nsensitive parameters.\n", "versions": [{"version": "v1", "created": "Thu, 4 Dec 2014 15:40:06 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Arampatzis", "Georgios", ""], ["Katsoulakis", "Markos A.", ""], ["Pantazis", "Yannis", ""]]}, {"id": "1412.2155", "submitter": "Susan Khor", "authors": "Susan Khor", "title": "Protein residue networks from a local search perspective", "comments": "v5 has 74 pages, a correction in section 2.1, an expansion of\n  Appendix B and the addition of Appendix H. Only materials and results related\n  to sections 3.1 to 3.6 have been published in the journal article which has\n  the same title as this manuscript. Materials and results from section 3.7 and\n  section 4 are each expanded in other manuscripts, Journal of Complex Networks\n  (2015)", "journal-ref": "J Complex Netw (2016) 4 (2): 245-278", "doi": "10.1093/comnet/cnv014", "report-no": null, "categories": "q-bio.MN cs.CE cs.SI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We examined protein residue networks (PRNs) from a local search perspective\nto understand why PRNs are highly clustered when having short paths is\nimportant for protein functionality. We found that by adopting a local search\nperspective, this conflict between form and function is resolved as increased\nclustering actually helps to reduce path length in PRNs. Further, the paths\nfound via our EDS local search algorithm are more congruent with the\ncharacteristics of intra-protein communication. EDS identifies a subset of PRN\nedges called short-cuts that are distinct, have high usage, impacts EDS path\nlength, diversity and stretch, and are dominated by short-range contacts. The\nshort-cuts form a network (SCN) that increases in size and transitivity as a\nprotein folds. The structure of a SCN supports its function and formation, and\nthe function of a SCN influences its formation. Several significant differences\nin terms of SCN structure, function and formation is found between successful\nand unsuccessful MD trajectories. By connecting the static and the dynamic\naspects of PRNs, the protein folding process becomes a problem of graph\nformation with the purpose of forming suitable pathways within proteins.\n", "versions": [{"version": "v1", "created": "Thu, 4 Dec 2014 20:20:14 GMT"}, {"version": "v2", "created": "Wed, 17 Dec 2014 16:37:14 GMT"}, {"version": "v3", "created": "Wed, 8 Apr 2015 17:43:47 GMT"}, {"version": "v4", "created": "Mon, 1 Jun 2015 19:00:12 GMT"}, {"version": "v5", "created": "Mon, 30 Nov 2015 00:20:33 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Khor", "Susan", ""]]}, {"id": "1412.2390", "submitter": "Panagiotis Papasaikas", "authors": "Panagiotis Papasaikas, J. Ramon Tejedor, Luisa Vigevani and Juan\n  Valcarcel", "title": "Functional Splicing Network Reveals Extensive Regulatory Potential of\n  the Core Spliceosomal Machinery", "comments": "Main text 17 pages + Supplementary Information 23 pages v2 added\n  missing pdf metadata", "journal-ref": "MolCell. 2015 Jan 8;57(1):7-22", "doi": "10.1016/j.molcel.2014.10.030", "report-no": null, "categories": "q-bio.MN q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pre-mRNA splicing relies on the poorly understood dynamic interplay between\n>150 protein components of the spliceosome. The steps at which splicing can be\nregulated remain largely unknown. We systematically analyzed the effect of\nknocking down the components of the splicing machinery on alternative splicing\nevents relevant for cell proliferation and apoptosis and used this information\nto reconstruct a network of functional interactions. The network accurately\ncaptures known physical and functional associations and identifies new ones,\nrevealing remarkable regulatory potential of core spliceosomal components,\nrelated to the order and duration of their recruitment during spliceosome\nassembly. In contrast with standard models of regulation at early steps of\nsplice site recognition, factors involved in catalytic activation of the\nspliceosome display regulatory properties. The network also sheds light on the\nantagonism between hnRNP C and U2AF, and on targets of antitumor drugs, and can\nbe widely used to identify mechanisms of splicing regulation.\n", "versions": [{"version": "v1", "created": "Sun, 7 Dec 2014 19:45:42 GMT"}, {"version": "v2", "created": "Wed, 10 Dec 2014 14:57:32 GMT"}], "update_date": "2015-01-19", "authors_parsed": [["Papasaikas", "Panagiotis", ""], ["Tejedor", "J. Ramon", ""], ["Vigevani", "Luisa", ""], ["Valcarcel", "Juan", ""]]}, {"id": "1412.3353", "submitter": "Oriol G\\\"uell", "authors": "Oriol G\\\"uell and Francesc Sagu\\'es and M. \\'Angeles Serrano", "title": "Detecting the Escherichia coli metabolic backbone", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The heterogeneity of reaction fluxes present in a metabolic network within a\nsingle flux state can be exploited to construct the so-called backbone as a\nreduced version of metabolism. The backbone maintains all significant fluxes\nproducing or consuming metabolites while displaying a substantially decreased\nnumber of interconnections and, hence, it becomes a useful tool to extract\nprimary metabolic routes. Here, we disclose the metabolic backbone of\nEscherichia coli using the computationally predicted fluxes which maximize the\ngrowth rate in glucose minimal medium, and we compare it with the backbone of\nMycoplasma pneumoniae, a much simpler organism. We find that the central core\nin both backbones is mainly composed of reactions in ancient pathways, still\nplaying at present a key role in energy metabolism. In E. coli, the analysis of\nthe backbone reveals that the synthesis of nucleotides and the metabolism of\nlipids form smaller cores which rely critically on energy metabolism; but not\nconversely. At the same time, an analysis of the dependence of this backbone on\nmedia composition leads to the identification of pathways sensitive to\nenvironmental changes. The metabolic backbone of an organism is thus useful to\ntrace simultaneously both its evolution and adaptation fingerprints.\n", "versions": [{"version": "v1", "created": "Wed, 10 Dec 2014 16:15:39 GMT"}, {"version": "v2", "created": "Wed, 29 Apr 2015 16:29:26 GMT"}, {"version": "v3", "created": "Mon, 19 Oct 2015 15:37:40 GMT"}, {"version": "v4", "created": "Sun, 21 Feb 2016 18:59:59 GMT"}], "update_date": "2016-02-23", "authors_parsed": [["Güell", "Oriol", ""], ["Sagués", "Francesc", ""], ["Serrano", "M. Ángeles", ""]]}, {"id": "1412.3885", "submitter": "Yuriy Hulovatyy", "authors": "Yuriy Hulovatyy, Huili Chen, Tijana Milenkovic", "title": "Exploring the structure and function of temporal networks with dynamic\n  graphlets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI physics.soc-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the growing amount of available temporal real-world network data, an\nimportant question is how to efficiently study these data. One can simply model\na temporal network as either a single aggregate static network, or as a series\nof time-specific snapshots, each of which is an aggregate static network over\nthe corresponding time window. The advantage of modeling the temporal data in\nthese two ways is that one can use existing well established methods for static\nnetwork analysis to study the resulting aggregate network(s). Here, we develop\na novel approach for studying temporal network data more explicitly. We base\nour methodology on the well established notion of graphlets (subgraphs), which\nhave been successfully used in numerous contexts in static network research.\nHere, we take the notion of static graphlets to the next level and develop new\ntheory needed to allow for graphlet-based analysis of temporal networks. Our\nnew notion of dynamic graphlets is quite different than existing approaches for\ndynamic network analysis that are based on temporal motifs (statistically\nsignificant subgraphs). Namely, these approaches suffer from many limitations.\nFor example, they can only deal with subgraph structures of limited complexity.\nAlso, their major drawback is that their results heavily depend on the choice\nof a null network model that is required to evaluate the significance of a\nsubgraph. However, choosing an appropriate null network model is a non-trivial\ntask. Our dynamic graphlet approach overcomes the limitations of the existing\ntemporal motif-based approaches. At the same time, when we thoroughly evaluate\nthe ability of our new approach to characterize the structure and function of\nan entire temporal network or of individual nodes, we find that the dynamic\ngraphlet approach outperforms the static graphlet approach, which indicates\nthat accounting for temporal information helps.\n", "versions": [{"version": "v1", "created": "Fri, 12 Dec 2014 04:43:17 GMT"}], "update_date": "2014-12-15", "authors_parsed": [["Hulovatyy", "Yuriy", ""], ["Chen", "Huili", ""], ["Milenkovic", "Tijana", ""]]}, {"id": "1412.4225", "submitter": "Anatoly Sorokin", "authors": "Anatoly Sorokin, Oksana Sorokina, J. Douglas Armstrong", "title": "RKappa: Statistical sampling suite for Kappa models", "comments": "Hybrid Systems and Biology 2014, Vienna", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present RKappa, a framework for the development and analysis of rule-based\nmodels within a mature, statistically empowered R environment. The\ninfrastructure allows model editing, modification, parameter sampling,\nsimulation, statistical analysis and visualisation without leaving the R\nenvironment. We demonstrate its effectiveness through its application to Global\nSensitivity Analysis, exploring it in \"parallel\" and \"concurrent\"\nimplementations.\n  The pipeline was designed for high performance computing platforms and aims\nto facilitate analysis of the behaviour of large-scale systems with limited\nknowledge of exact mechanisms and respectively sparse availability of parameter\nvalues, and is illustrated here with two biological examples.\n  The package is available on github: https://github.com/lptolik/R4Kappa\n", "versions": [{"version": "v1", "created": "Sat, 13 Dec 2014 11:50:08 GMT"}], "update_date": "2014-12-16", "authors_parsed": [["Sorokin", "Anatoly", ""], ["Sorokina", "Oksana", ""], ["Armstrong", "J. Douglas", ""]]}, {"id": "1412.5257", "submitter": "Badal Joshi", "authors": "Badal Joshi and Anne Shiu", "title": "A survey of methods for deciding whether a reaction network is\n  multistationary", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Which reaction networks, when taken with mass-action kinetics, have the\ncapacity for multiple steady states? There is no complete answer to this\nquestion, but over the last 40 years various criteria have been developed that\ncan answer this question in certain cases. This work surveys these\ndevelopments, with an emphasis on recent results that connect the capacity for\nmultistationarity of one network to that of another. In this latter setting, we\nconsider a network $N$ that is embedded in a larger network $G$, which means\nthat $N$ is obtained from $G$ by removing some subsets of chemical species and\nreactions. This embedding relation is a significant generalization of the\nsubnetwork relation. For arbitrary networks, it is not true that if $N$ is\nembedded in $G$, then the steady states of $N$ lift to $G$. Nonetheless, this\ndoes hold for certain classes of networks; one such class is that of fully open\nnetworks. This motivates the search for embedding-minimal multistationary\nnetworks: those networks which admit multiple steady states but no proper,\nembedded networks admit multiple steady states. We present results about such\nminimal networks, including several new constructions of infinite families of\nthese networks.\n", "versions": [{"version": "v1", "created": "Wed, 17 Dec 2014 04:49:12 GMT"}, {"version": "v2", "created": "Sun, 19 Apr 2015 02:42:24 GMT"}, {"version": "v3", "created": "Thu, 20 Aug 2015 19:30:31 GMT"}], "update_date": "2015-08-21", "authors_parsed": [["Joshi", "Badal", ""], ["Shiu", "Anne", ""]]}, {"id": "1412.5693", "submitter": "Yougan Cheng", "authors": "Daniela Calvetti, Yougan Cheng, Erkki Somersalo", "title": "Energy Demand and Metabolite Partitioning in Spatially Lumped and\n  Distributed Models of Neuron-Astrocyte Complex", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The degrees of freedom of multi-compartment mathematical models for energy\nmetabolism of a neuron-astrocyte complex may offer a key to understand the\ndifferent ways in which the energetic needs of the brain are met. In this paper\nwe address the problem within a steady state framework and we use the\ntechniques of linear algebra to identify the degrees of freedom first in a\nlumped model, then in its extension to a spatially distributed case. The\ninterpretation of the degrees of freedom in metabolic terms, more specifically\nin terms of glucose and oxygen partitioning, is then leveraged to derive\nconstraints on the free parameters needed to guarantee that the model is\nenergetically feasible. We also demonstrate how the model can be used to\nestimate the stoichiometric energy needs of the cells as well as the household\nenergy based on observed oxidative cerebral metabolic rate (CMR) of glucose,\nand the glutamate cycling. Moreover, our analysis shows that in the lumped\nmodel the direction of lactate dehydrogenase (LDH) in the cells can be deduced\nfrom the glucose partitioning between the compartments. The extension of the\nlumped model into a spatially distributed multi-compartment setting that\nincludes diffusion fluxes from capillary to tissue increases the number of\ndegrees of freedom, requiring the use of statistical sampling techniques. The\nanalysis of distributed model reveals that some of the conclusions, e.g.,\nconcerning the LDH activity and glucose partitioning, based on a spatially\nlumped model may no longer hold.\n", "versions": [{"version": "v1", "created": "Thu, 18 Dec 2014 01:04:39 GMT"}], "update_date": "2014-12-19", "authors_parsed": [["Calvetti", "Daniela", ""], ["Cheng", "Yougan", ""], ["Somersalo", "Erkki", ""]]}, {"id": "1412.6346", "submitter": "Dominic Searson", "authors": "Dominic P. Searson, Mark J. Willis, Allen Wright", "title": "Reverse Engineering Chemical Reaction Networks from Time Series Data", "comments": "36 pages. In: Dehmer, M., Varmuza, K., Bonchev, D, ed. Statistical\n  Modelling of Molecular Descriptors in QSAR/QSPR. Weinheim, Germany: Wiley-VCH\n  Verlag GmbH, 2012, pp.327-348", "journal-ref": null, "doi": "10.1002/9783527645121.ch12", "report-no": null, "categories": "cs.NE q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The automated inference of physically interpretable (bio)chemical reaction\nnetwork models from measured experimental data is a challenging problem whose\nsolution has significant commercial and academic ramifications. It is\ndemonstrated, using simulations, how sets of elementary reactions comprising\nchemical reaction networks, as well as their rate coefficients, may be\naccurately recovered from non-equilibrium time series concentration data, such\nas that obtained from laboratory scale reactors. A variant of an evolutionary\nalgorithm called differential evolution in conjunction with least squares\ntechniques is used to search the space of reaction networks in order to infer\nboth the reaction network topology and its rate parameters. Properties of the\nstoichiometric matrices of trial networks are used to bias the search towards\nphysically realisable solutions. No other information, such as chemical\ncharacterisation of the reactive species is required, although where available\nit may be used to improve the search process.\n", "versions": [{"version": "v1", "created": "Fri, 19 Dec 2014 13:54:54 GMT"}], "update_date": "2014-12-22", "authors_parsed": [["Searson", "Dominic P.", ""], ["Willis", "Mark J.", ""], ["Wright", "Allen", ""]]}, {"id": "1412.6386", "submitter": "Pierre de Buyl", "authors": "Thomas Cokelaer, Julio Saez-Rodriguez", "title": "Using Python to Dive into Signalling Data with CellNOpt and BioServices", "comments": "Part of the Proceedings of the 7th European Conference on Python in\n  Science (EuroSciPy 2014), Pierre de Buyl and Nelle Varoquaux editors, (2014)", "journal-ref": null, "doi": null, "report-no": "euroscipy-proceedings2014-06", "categories": "cs.CE q-bio.MN", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Systems biology is an inter-disciplinary field that studies systems of\nbiological components at different scales, which may be molecules, cells or\nentire organism. In particular, systems biology methods are applied to\nunderstand functional deregulations within human cells (e.g., cancers). In this\ncontext, we present several python packages linked to CellNOptR (R package),\nwhich is used to build predictive logic models of signalling networks by\ntraining networks (derived from literature) to signalling (phospho-proteomic)\ndata. The first package (cellnopt.wrapper) is a wrapper based on RPY2 that\nallows a full access to CellNOptR functionalities within Python. The second one\n(cellnopt.core) was designed to ease the manipulation and visualisation of data\nstructures used in CellNOptR, which was achieved by using Pandas, NetworkX and\nmatplotlib. Systems biology also makes extensive use of web resources and\nservices. We will give an overview and status of BioServices, which allows one\nto access programmatically to web resources used in life science and how it can\nbe combined with CellNOptR.\n", "versions": [{"version": "v1", "created": "Fri, 19 Dec 2014 15:43:09 GMT"}], "update_date": "2014-12-22", "authors_parsed": [["Cokelaer", "Thomas", ""], ["Saez-Rodriguez", "Julio", ""]]}, {"id": "1412.7297", "submitter": "Aradhana Singh", "authors": "Alok Yadav and Sarika Jalan", "title": "Origin and implications of zero degeneracy in networks spectra", "comments": "5 pages, 3 figures", "journal-ref": null, "doi": "10.1063/1.4917286", "report-no": null, "categories": "cond-mat.dis-nn physics.soc-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spectra of real world networks exhibit properties which are different from\nthe random networks. One such property is the existence of a very high\ndegeneracy at zero eigenvalues. In this work, we provide possible reasons\nbehind occurrence of the zero degeneracy in various networks spectra.\nComparison of zero degeneracy in protein-protein interaction networks of six\ndifferent species and in their corresponding model networks sheds light in\nunderstanding the evolution of complex biological systems.\n", "versions": [{"version": "v1", "created": "Tue, 23 Dec 2014 09:51:42 GMT"}, {"version": "v2", "created": "Fri, 2 Jan 2015 04:36:08 GMT"}], "update_date": "2015-07-28", "authors_parsed": [["Yadav", "Alok", ""], ["Jalan", "Sarika", ""]]}, {"id": "1412.7386", "submitter": "Pietro  Hiram Guzzi", "authors": "Mario Cannataro, Pietro Hiram Guzzi, Marianna Milano, Pierangelo\n  Veltri", "title": "A web-based tool to Analyze Semantic Similarity Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.AI q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In computational biology, biological entities such as genes or proteins are\nusually annotated with terms extracted from Gene Ontology (GO). The functional\nsimilarity among terms of an ontology is evaluated by using Semantic Similarity\nMeasures (SSM). More recently, the extensive application of SSMs yielded to the\nSemantic Similarity Networks (SSNs). SSNs are edge-weighted graphs where the\nnodes are concepts (e.g. proteins) and each edge has an associated weight that\nrepresents the semantic similarity among related pairs of nodes. The analysis\nof SSNs may reveal biologically meaningful knowledge. For these aims, the need\nfor the introduction of tool able to manage and analyze SSN arises.\nConsequently we developed SSN-Analyzer a web based tool able to build and\npreprocess SSN. As proof of concept we demonstrate that community detection\nalgorithms applied to filtered (thresholded) networks, have better performances\nin terms of biological relevance of the results, with respect to the use of raw\nunfiltered networks.\n", "versions": [{"version": "v1", "created": "Sun, 21 Dec 2014 13:18:39 GMT"}], "update_date": "2014-12-24", "authors_parsed": [["Cannataro", "Mario", ""], ["Guzzi", "Pietro Hiram", ""], ["Milano", "Marianna", ""], ["Veltri", "Pierangelo", ""]]}, {"id": "1412.7767", "submitter": "Thibaud Taillefumier", "authors": "Thibaud Taillefumier and Ned S. Wingreen", "title": "Optimal census by quorum sensing", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1004238", "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quorum sensing is the regulation of gene expression in response to changes in\ncell density. To measure their cell density, bacterial populations produce and\ndetect diffusible molecules called autoinducers. Individual bacteria internally\nrepresent the external concentration of autoinducers via the level of monitor\nproteins. In turn, these monitor proteins typically regulate both their own\nproduction and the production of autoinducers, thereby establishing internal\nand external feedbacks. Here, we ask whether feedbacks can increase the\ninformation available to cells about their local density. We quantify available\ninformation as the mutual information between the abundance of a monitor\nprotein and the local cell density for biologically relevant models of quorum\nsensing. Using variational methods, we demonstrate that feedbacks can increase\ninformation transmission, allowing bacteria to resolve up to two additional\nranges of cell density when compared with bistable quorum-sensing systems. Our\nanalysis is relevant to multi-agent systems that track an external driver\nimplicitly via an endogenously generated signal.\n", "versions": [{"version": "v1", "created": "Wed, 24 Dec 2014 22:34:47 GMT"}, {"version": "v2", "created": "Wed, 1 Apr 2015 15:39:51 GMT"}], "update_date": "2017-04-12", "authors_parsed": [["Taillefumier", "Thibaud", ""], ["Wingreen", "Ned S.", ""]]}, {"id": "1412.8065", "submitter": "John Barton", "authors": "John P. Barton and Eduardo D. Sontag", "title": "Remarks on the energy costs of insulators in enzymatic cascades", "comments": "10 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The connection between optimal biological function and energy use, measured\nfor example by the rate of metabolite consumption, is a current topic of\ninterest in the systems biology literature which has been explored in several\ndifferent contexts. In [J. P. Barton and E. D. Sontag, Biophys. J. 104, 6\n(2013)], we related the metabolic cost of enzymatic futile cycles with their\ncapacity to act as insulators which facilitate modular interconnections in\nbiochemical networks. There we analyzed a simple model system in which a signal\nmolecule regulates the transcription of one or more target proteins by\ninteracting with their promoters. In this note, we consider the case of a\nprotein with an active and an inactive form, and whose activation is controlled\nby the signal molecule. As in the original case, higher rates of energy\nconsumption are required for better insulator performance.\n", "versions": [{"version": "v1", "created": "Sat, 27 Dec 2014 15:47:38 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Barton", "John P.", ""], ["Sontag", "Eduardo D.", ""]]}, {"id": "1412.8446", "submitter": "Jay Newby", "authors": "Jay Newby", "title": "Asymptotic and numerical methods for metastable events in stochastic\n  gene networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech math.PR q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A general class of stochastic gene expression models with self regulation is\nconsidered. One or more genes randomly switch between regulatory states, each\nhaving a different mRNA transcription rate. The gene or genes are self\nregulating when the proteins they produce affect the rate of switching between\nregulatory states. Under weak noise conditions, the deterministic forces are\nmuch stronger than fluctuations from gene switching and protein synthesis.\nMetastable transitions, such as bistable switching, can occur under weak noise\nconditions, causing dramatic shifts in the expression of a gene. A general tool\nused to describe metastability is the quasi stationary analysis (QSA). A large\ndeviation principle is derived so that the QSA can explicitly account for\nrandom gene switching without using an adiabatic limit or diffusion\napproximation, which are unreliable and inaccurate for metastable events.This\nallows the existing asymptotic and numerical methods that have been developed\nfor continuous Markov processes to be used to analyze the full model.\n", "versions": [{"version": "v1", "created": "Mon, 29 Dec 2014 20:18:34 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Newby", "Jay", ""]]}, {"id": "1412.8634", "submitter": "Niraj Kumar", "authors": "Niraj Kumar, Abhyudai Singh, and Rahul V. Kulkarni", "title": "Transcriptional bursting in gene expression: analytical results for\n  general stochastic models", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1004292", "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gene expression in individual cells is highly variable and sporadic, often\nresulting in the synthesis of mRNAs and proteins in bursts. Bursting in gene\nexpression is known to impact cell-fate in diverse systems ranging from latency\nin HIV-1 viral infections to cellular differentiation. It is generally assumed\nthat bursts are geometrically distributed and that they arrive according to a\nPoisson process. On the other hand, recent single-cell experiments provide\nevidence for complex burst arrival processes, highlighting the need for more\ngeneral stochastic models. To address this issue, we invoke a mapping between\ngeneral models of gene expression and systems studied in queueing theory to\nderive exact analytical expressions for the moments associated with\nmRNA/protein steady-state distributions. These moments are then used to derive\nexplicit conditions, based entirely on experimentally measurable quantities,\nthat determine if the burst distributions deviate from the geometric\ndistribution or if burst arrival deviates from a Poisson process. For\nnon-Poisson arrivals, we develop approaches for accurate estimation of burst\nparameters.\n", "versions": [{"version": "v1", "created": "Tue, 30 Dec 2014 14:09:45 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Kumar", "Niraj", ""], ["Singh", "Abhyudai", ""], ["Kulkarni", "Rahul V.", ""]]}]