[{"id": "1502.00793", "submitter": "Alessandro Filisetti Dr.", "authors": "Alessandro Filisetti, Marco Villani, Chiara Damiani, Alex Graudenzi,\n  Andrea Roli, Wim Hordijk, Roberto Serra", "title": "On RAF Sets and Autocatalytic Cycles in Random Reaction Networks", "comments": "pp 113-126", "journal-ref": "Advances in Artificial Life and Evolutionary Computation SE-10\n  (Vol. 445, pp. 113-126)", "doi": "10.1007/978-3-319-12745-3_10", "report-no": null, "categories": "nlin.AO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emergence of autocatalytic sets of molecules seems to have played an\nimportant role in the origin of life context. Although the possibility to\nreproduce this emergence in laboratory has received considerable attention,\nthis is still far from being achieved. In order to unravel some key properties\nenabling the emergence of structures potentially able to sustain their own\nexistence and growth, in this work we investigate the probability to observe\nthem in ensembles of random catalytic reaction networks characterized by\ndifferent structural properties. From the point of view of network topology, an\nautocatalytic set have been defined either in term of strongly connected\ncomponents (SCCs) or as reflexively autocatalytic and food-generated sets\n(RAFs). We observe that the average level of catalysis differently affects the\nprobability to observe a SCC or a RAF, highlighting the existence of a region\nwhere the former can be observed, whereas the latter cannot. This parameter\nalso affects the composition of the RAF, which can be further characterized\ninto linear structures, autocatalysis or SCCs. Interestingly, we show that the\ndifferent network topology (uniform as opposed to power-law catalysis systems)\ndoes not have a significantly divergent impact on SCCs and RAFs appearance,\nwhereas the proportion between cleavages and condensations seems instead to\nplay a role. A major factor that limits the probability of RAF appearance and\nthat may explain some of the difficulties encountered in laboratory seems to be\nthe presence of molecules which can accumulate without being substrate or\ncatalyst of any reaction.\n", "versions": [{"version": "v1", "created": "Tue, 3 Feb 2015 09:51:47 GMT"}], "update_date": "2015-02-04", "authors_parsed": [["Filisetti", "Alessandro", ""], ["Villani", "Marco", ""], ["Damiani", "Chiara", ""], ["Graudenzi", "Alex", ""], ["Roli", "Andrea", ""], ["Hordijk", "Wim", ""], ["Serra", "Roberto", ""]]}, {"id": "1502.01463", "submitter": "Wolfram Liebermeister", "authors": "Wolfram Liebermeister, Timo Lubitz, and Jens Hahn", "title": "SBtab - Conventions for structured data tables in Systems Biology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data tables in the form of spreadsheets or delimited text files are the most\nutilised data format in Systems Biology. However, they are often not\nsufficiently structured and lack clear naming conventions that would be\nrequired for modelling. We propose the SBtab format as an attempt to establish\nan easy-to-use table format that is both flexible and clearly structured. It\ncomprises defined table types for different kinds of data; syntax rules for\nusage of names, shortnames, and database identifiers used for annotation; and\nstandardised formulae for reaction stoichiometries. Predefined table types can\nbe used to define biochemical network models and the biochemical constants\ntherein. The user can also define own table types, adjusting SBtab to other\ntypes of data. Software code, tools, and further information can be found at\nwww.sbtab.net.\n", "versions": [{"version": "v1", "created": "Thu, 5 Feb 2015 08:53:46 GMT"}, {"version": "v2", "created": "Tue, 29 Sep 2015 04:29:42 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Liebermeister", "Wolfram", ""], ["Lubitz", "Timo", ""], ["Hahn", "Jens", ""]]}, {"id": "1502.01734", "submitter": "Alessandro Filisetti Dr.", "authors": "Marco Villani, Andrea Roli, Alessandro Filisetti, Marco Fiorucci,\n  Irene Poli, Roberto Serra", "title": "The search for candidate relevant subsets of variables in complex\n  systems", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we describe a method to identify \"relevant subsets\" of\nvariables, useful to understand the organization of a dynamical system. The\nvariables belonging to a relevant subset should have a strong integration with\nthe other variables of the same relevant subset, and a much weaker interaction\nwith the other system variables. On this basis, extending previous works on\nneural networks, an information-theoretic measure is introduced, i.e. the\nDynamical Cluster Index, in order to identify good candidate relevant subsets.\nThe method does not require any previous knowledge of the relationships among\nthe system variables, but relies on observations of their values in time. We\nshow its usefulness in several application domains, including: (i) random\nboolean networks, where the whole network is made of different subnetworks with\ndifferent topological relationships (independent or interacting subnetworks);\n(ii) leader-follower dynamics, subject to noise and fluctuations; (iii)\ncatalytic reaction networks in a flow reactor; (iv) the MAPK signaling pathway\nin eukaryotes. The validity of the method has been tested in cases where the\ndata are generated by a known dynamical model and the Dynamical Cluster Index\nmethod is applied in order to uncover significant aspects of its organization;\nhowever it is important to stress that it can also be applied to time series\ncoming from field data without any reference to a model. Given that it is based\non relative frequencies of sets of values, the method could be applied also to\ncases where the data are not ordered in time. Several indications to improve\nthe scope and effectiveness of the Dynamical Cluster Index to analyze the\norganization of complex systems are finally given.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jan 2015 10:09:53 GMT"}], "update_date": "2015-02-09", "authors_parsed": [["Villani", "Marco", ""], ["Roli", "Andrea", ""], ["Filisetti", "Alessandro", ""], ["Fiorucci", "Marco", ""], ["Poli", "Irene", ""], ["Serra", "Roberto", ""]]}, {"id": "1502.01768", "submitter": "Timothy Saunders", "authors": "Timothy E Saunders", "title": "Aggregation-fragmentation model of robust concentration gradient\n  formation", "comments": "9 pages, 5 figures", "journal-ref": "Physical Review E 91, 022704 (2015)", "doi": "10.1103/PhysRevE.91.022704", "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concentration gradients of signaling molecules are essential for patterning\nduring development and they have been observed in both unicellular and\nmulticellular systems. In subcellular systems, clustering of the signaling\nmolecule has been observed. We develop a theoretical model of cluster- mediated\nconcentration gradient formation based on the Becker-Doring equations of\naggregation- fragmentation processes. We show that such a mechanism produces\nrobust concentration gradients on realistic time and spatial scales so long as\nthe process of clustering does not significantly stabilize the signaling\nmolecule. Finally, we demonstrate that such a model is applicable to the pom1p\nsubcellular gradient in fission yeast.\n", "versions": [{"version": "v1", "created": "Fri, 6 Feb 2015 01:24:16 GMT"}], "update_date": "2015-02-09", "authors_parsed": [["Saunders", "Timothy E", ""]]}, {"id": "1502.02001", "submitter": "Hal Lbi2m", "authors": "Andr\\'es Ritter, Simon M Dittami (UMR7139), Sophie Goulitquer (SBR),\n  Juan A Correa, Catherine Boyen (LBI2M), Philippe Potin, Thierry Tonon (LBI2M)", "title": "Transcriptomic and metabolomic analysis of copper stress acclimation in\n  Ectocarpus siliculosus highlights signaling and tolerance mechanisms in brown\n  algae", "comments": null, "journal-ref": "BMC Plant Biology, BioMed Central, 2013, 14, pp.116", "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Brown algae are sessile macro-organisms of great ecological relevance in\ncoastal ecosystems. They evolved independently from land plants and other\nmulticellular lineages, and therefore hold several original ontogenic and\nmetabolic features. Most brown algae grow along the coastal zone where they\nface frequent environmental changes, including exposure to toxic levels of\nheavy metals such as copper (Cu). We carried out large-scale transcriptomic and\nmetabolomic analyses to decipher the short-term acclimation of the brown algal\nmodel E. siliculosus to Cu stress, and compared these data to results known for\nother abiotic stressors. This comparison demonstrates that Cu induces oxidative\nstress in E. siliculosus as illustrated by the transcriptomic overlap between\nCu and H2O2 treatments. The common response to Cu and H2O2 consisted in the\nactivation of the oxylipin and the repression of inositol signaling pathways,\ntogether with the regulation of genes coding for several\ntranscription-associated proteins. Concomitantly, Cu stress specifically\nactivated a set of genes coding for orthologs of ABC transporters, a P1B-type\nATPase, ROS detoxification systems such as a vanadium-dependent\nbromoperoxidase, and induced an increase of free fatty acid contents. Finally\nwe observed, as a common abiotic stress mechanism, the activation of autophagic\nprocesses on one hand and the repression of genes involved in nitrogen\nassimilation on the other hand. Comparisons with data from green plants\nindicate that some processes involved in Cu and oxidative stress response are\nconserved across these two distant lineages. At the same time the high number\nof yet uncharacterized brown alga-specific genes induced in response to copper\nstress underlines the potential to discover new components and molecular\ninteractions unique to these organisms. Of particular interest for future\nresearch is the potential cross-talk between reactive oxygen species (ROS)-,\nmyo-inositol-, and oxylipin signaling.\n", "versions": [{"version": "v1", "created": "Fri, 6 Feb 2015 19:35:55 GMT"}], "update_date": "2015-02-09", "authors_parsed": [["Ritter", "Andrés", "", "UMR7139"], ["Dittami", "Simon M", "", "UMR7139"], ["Goulitquer", "Sophie", "", "SBR"], ["Correa", "Juan A", "", "LBI2M"], ["Boyen", "Catherine", "", "LBI2M"], ["Potin", "Philippe", "", "LBI2M"], ["Tonon", "Thierry", "", "LBI2M"]]}, {"id": "1502.02594", "submitter": "David Hartich", "authors": "David Hartich, Andre C. Barato, Udo Seifert", "title": "Nonequilibrium sensing and its analogy to kinetic proofreading", "comments": "17 pages, 7 figures", "journal-ref": "New J. Phys. 17 (2015) 055026", "doi": "10.1088/1367-2630/17/5/055026", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a paradigmatic model of chemotaxis, we analyze the effect how a nonzero\naffinity driving receptors out of equilibrium affects sensitivity. This\naffinity arises whenever changes in receptor activity involve ATP hydrolysis.\nThe sensitivity integrated over a ligand concentration range is shown to be\nenhanced by the affinity, providing a measure of how much energy consumption\nimproves sensing. With this integrated sensitivity we can establish an\nintriguing analogy between sensing with nonequilibrium receptors and kinetic\nproofreading: the increase in integrated sensitivity is equivalent to the\ndecrease of the error in kinetic proofreading. The influence of the occupancy\nof the receptor on the phosphorylation and dephosphorylation reaction rates is\nshown to be crucial for the relation between integrated sensitivity and\naffinity. This influence can even lead to a regime where a nonzero affinity\ndecreases the integrated sensitivity, which corresponds to anti-proofreading.\n", "versions": [{"version": "v1", "created": "Mon, 9 Feb 2015 18:33:09 GMT"}, {"version": "v2", "created": "Thu, 28 May 2015 12:19:55 GMT"}], "update_date": "2015-05-29", "authors_parsed": [["Hartich", "David", ""], ["Barato", "Andre C.", ""], ["Seifert", "Udo", ""]]}, {"id": "1502.03011", "submitter": "Namiko Mitarai", "authors": "Namiko Mitarai, Szabolcs Semsey, Kim Sneppen", "title": "Dynamic competition between transcription initiation and repression:\n  Role of nonequilibrium steps in cell-to-cell heterogeneity", "comments": "5 pages, 3 fiugres. Figure and text updated", "journal-ref": "Phys. Rev. E 92, 022710 (2015)", "doi": "10.1103/PhysRevE.92.022710", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transcriptional repression may cause transcriptional noise by a competition\nbetween repressor and RNA polymerase binding. Although promoter activity is\noften governed by a single limiting step, we argue here that the size of the\nnoise strongly depends on whether this step is the initial equilibrium binding\nor one of the subsequent unidirectional steps. Overall, we show that\nnonequilibrium steps of transcription initiation systematically increase the\ncell-to-cell heterogeneity in bacterial populations. In particular, this allows\nalso weak promoters to give substantial transcriptional noise.\n", "versions": [{"version": "v1", "created": "Tue, 10 Feb 2015 17:43:53 GMT"}, {"version": "v2", "created": "Tue, 7 Apr 2015 16:37:56 GMT"}, {"version": "v3", "created": "Thu, 13 Aug 2015 14:57:13 GMT"}], "update_date": "2015-08-14", "authors_parsed": [["Mitarai", "Namiko", ""], ["Semsey", "Szabolcs", ""], ["Sneppen", "Kim", ""]]}, {"id": "1502.03188", "submitter": "Zvi Rosen", "authors": "Elizabeth Gross, Heather A. Harrington, Zvi Rosen, and Bernd Sturmfels", "title": "Algebraic Systems Biology: A Case Study for the Wnt Pathway", "comments": "24 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.AG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Steady state analysis of dynamical systems for biological networks give rise\nto algebraic varieties in high-dimensional spaces whose study is of interest in\ntheir own right. We demonstrate this for the shuttle model of the Wnt signaling\npathway. Here the variety is described by a polynomial system in 19 unknowns\nand 36 parameters. Current methods from computational algebraic geometry and\ncombinatorics are applied to analyze this model.\n", "versions": [{"version": "v1", "created": "Wed, 11 Feb 2015 03:44:19 GMT"}], "update_date": "2015-02-12", "authors_parsed": [["Gross", "Elizabeth", ""], ["Harrington", "Heather A.", ""], ["Rosen", "Zvi", ""], ["Sturmfels", "Bernd", ""]]}, {"id": "1502.03338", "submitter": "Janusz A. Holyst Prof.", "authors": "Piotr J. Gorski, Agnieszka Czaplicka, Janusz A. Holyst", "title": "Coevolution of Information Processing and Topology in Hierarchical\n  Adaptive Random Boolean Networks", "comments": "9 pages, 6 figures", "journal-ref": null, "doi": "10.1140/epjb/e2015-60530-6", "report-no": null, "categories": "physics.soc-ph cs.SI nlin.AO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random Boolean networks (RBNs) are frequently employed for modelling complex\nsystems driven by information processing, e.g. for gene regulatory networks\n(GRNs). Here we propose a hierarchical adaptive RBN (HARBN) as a system\nconsisting of distinct adaptive RBNs - subnetworks - connected by a set of\npermanent interlinks. Information measures and internal subnetworks topology of\nHARBN coevolve and reach steady-states that are specific for a given network\nstructure. We investigate mean node information, mean edge information as well\nas a mean node degree as functions of model parameters and demonstrate HARBN's\nability to describe complex hierarchical systems.\n", "versions": [{"version": "v1", "created": "Mon, 9 Feb 2015 18:11:16 GMT"}], "update_date": "2016-03-23", "authors_parsed": [["Gorski", "Piotr J.", ""], ["Czaplicka", "Agnieszka", ""], ["Holyst", "Janusz A.", ""]]}, {"id": "1502.03816", "submitter": "Virginia Dominguez", "authors": "Virginia Dom\\'inguez-Garc\\'ia, Simone Pigolotti and Miguel A. Mu\\~noz", "title": "Inherent directionality explains the lack of feedback loops in empirical\n  networks", "comments": null, "journal-ref": "Scientific Reports 4, 7497 (2014)", "doi": "10.1038/srep07497", "report-no": null, "categories": "q-bio.MN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the hypothesis that the relative abundance of feedback loops in\nmany empirical complex networks is severely reduced owing to the presence of an\ninherent global directionality. Aimed at quantifying this idea, we propose a\nsimple probabilistic model in which a free parameter $\\gamma$ controls the\ndegree of inherent directionality. Upon strengthening such directionality, the\nmodel predicts a drastic reduction in the fraction of loops which are also\nfeedback loops. To test this prediction, we extensively enumerated loops and\nfeedback loops in many empirical biological, ecological and socio-\ntechnological directed networks. We show that, in almost all cases, empirical\nnetworks have a much smaller fraction of feedback loops than network\nrandomizations. Quite remarkably, this empirical finding is quantitatively\nreproduced, for all loop lengths, by our model by fitting its only parameter\n$\\gamma$. Moreover, the fitted value of $\\gamma$ correlates quite well with\nanother direct measurement of network directionality, performed by means of a\nnovel algorithm. We conclude that the existence of an inherent network\ndirectionality provides a parsimonious quantitative explanation for the\nobserved lack of feedback loops in empirical networks.\n", "versions": [{"version": "v1", "created": "Thu, 12 Feb 2015 11:27:15 GMT"}], "update_date": "2015-02-16", "authors_parsed": [["Domínguez-García", "Virginia", ""], ["Pigolotti", "Simone", ""], ["Muñoz", "Miguel A.", ""]]}, {"id": "1502.04246", "submitter": "David Doty", "authors": "David Doty, David Soloveichik", "title": "Stable Leader Election in Population Protocols Requires Linear Time", "comments": "accepted to Distributed Computing special issue of invited papers\n  from DISC 2015; significantly revised proof structure and intuitive\n  explanations", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A population protocol *stably elects a leader* if, for all $n$, starting from\nan initial configuration with $n$ agents each in an identical state, with\nprobability 1 it reaches a configuration $\\mathbf{y}$ that is correct (exactly\none agent is in a special leader state $\\ell$) and stable (every configuration\nreachable from $\\mathbf{y}$ also has a single agent in state $\\ell$). We show\nthat any population protocol that stably elects a leader requires $\\Omega(n)$\nexpected \"parallel time\" --- $\\Omega(n^2)$ expected total pairwise interactions\n--- to reach such a stable configuration. Our result also informs the\nunderstanding of the time complexity of chemical self-organization by showing\nan essential difficulty in generating exact quantities of molecular species\nquickly.\n", "versions": [{"version": "v1", "created": "Sat, 14 Feb 2015 21:17:03 GMT"}, {"version": "v2", "created": "Sun, 22 Feb 2015 03:36:53 GMT"}, {"version": "v3", "created": "Tue, 18 Aug 2015 18:55:40 GMT"}, {"version": "v4", "created": "Sat, 20 Aug 2016 16:43:30 GMT"}], "update_date": "2016-08-23", "authors_parsed": [["Doty", "David", ""], ["Soloveichik", "David", ""]]}, {"id": "1502.04307", "submitter": "Peter O. Fedichev", "authors": "D. Podolskiy, I. Molodtcov, A. Zenin, V. Kogan, L. I. Menshikov, Vadim\n  N. Gladyshev, Robert J. Shmookler Reis, and P. O. Fedichev", "title": "Critical dynamics of gene networks is a mechanism behind ageing and\n  Gompertz law", "comments": "22 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.GN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although accumulation of molecular damage is suggested to be an important\nmolecular mechanism of aging, a quantitative link between the dynamics of\ndamage accumulation and mortality of species has so far remained elusive. To\naddress this question, we examine stability properties of a generic gene\nregulatory network (GRN) and demonstrate that many characteristics of aging and\nthe associated population mortality rate emerge as inherent properties of the\ncritical dynamics of gene regulation and metabolic levels. Based on the\nanalysis of age-dependent changes in gene-expression and metabolic profiles in\nDrosophila melanogaster, we explicitly show that the underlying GRNs are nearly\ncritical and inherently unstable. This instability manifests itself as aging in\nthe form of distortion of gene expression and metabolic profiles with age, and\ncauses the characteristic increase in mortality rate with age as described by a\nform of the Gompertz law. In addition, we explain late-life mortality\ndeceleration observed at very late ages for large populations. We show that\naging contains a stochastic component, related to accumulation of regulatory\nerrors in transcription/translation/metabolic pathways due to imperfection of\nsignaling cascades in the network and of responses to environmental factors. We\nalso establish that there is a strong deterministic component, suggesting\ngenetic control. Since mortality in humans, where it is characterized best, is\nstrongly associated with the incidence of age-related diseases, our findings\nsupport the idea that aging is the driving force behind the development of\nchronic human diseases.\n", "versions": [{"version": "v1", "created": "Sun, 15 Feb 2015 12:41:44 GMT"}, {"version": "v2", "created": "Wed, 23 Nov 2016 06:25:52 GMT"}], "update_date": "2016-11-24", "authors_parsed": [["Podolskiy", "D.", ""], ["Molodtcov", "I.", ""], ["Zenin", "A.", ""], ["Kogan", "V.", ""], ["Menshikov", "L. I.", ""], ["Gladyshev", "Vadim N.", ""], ["Reis", "Robert J. Shmookler", ""], ["Fedichev", "P. O.", ""]]}, {"id": "1502.04469", "submitter": "Peng Yang", "authors": "Jian-Ping Mei, Chee-Keong Kwoh, Peng Yang and Xiao-Li Li", "title": "Classification and its applications for drug-target interaction\n  identification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.MN q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Classification is one of the most popular and widely used supervised learning\ntasks, which categorizes objects into predefined classes based on known\nknowledge. Classification has been an important research topic in machine\nlearning and data mining. Different classification methods have been proposed\nand applied to deal with various real-world problems. Unlike unsupervised\nlearning such as clustering, a classifier is typically trained with labeled\ndata before being used to make prediction, and usually achieves higher accuracy\nthan unsupervised one.\n  In this paper, we first define classification and then review several\nrepresentative methods. After that, we study in details the application of\nclassification to a critical problem in drug discovery, i.e., drug-target\nprediction, due to the challenges in predicting possible interactions between\ndrugs and targets.\n", "versions": [{"version": "v1", "created": "Mon, 16 Feb 2015 09:17:40 GMT"}, {"version": "v2", "created": "Mon, 23 Feb 2015 02:11:57 GMT"}, {"version": "v3", "created": "Wed, 11 Mar 2015 15:57:38 GMT"}, {"version": "v4", "created": "Thu, 12 Mar 2015 02:05:46 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Mei", "Jian-Ping", ""], ["Kwoh", "Chee-Keong", ""], ["Yang", "Peng", ""], ["Li", "Xiao-Li", ""]]}, {"id": "1502.04512", "submitter": "Allen Tannenbaum", "authors": "Allen Tannenbaum, Chris Sander, Liangjia Zhu, Romeil Sandhu, Ivan\n  Kolesov, Eduard Reznik, Yasin Senbabaoglu, Tryphon Georgiou", "title": "Graph Curvature and the Robustness of Cancer Networks", "comments": "13 pages, 3 figures, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of studying properties of networks is manifest in diverse\nfields ranging from biology, engineering, physics, chemistry, neuroscience, and\nmedicine. The functionality of networks with regard to performance, throughput,\nreliability and robustness is strongly linked to the underlying geometric and\ntopological properties of the network and this is the focus of this paper,\nespecially as applied to certain biological networks. The fundamental\nmathematical abstraction of a network as a weighted graph brings to bear the\ntools of graph theory--a highly developed subject of mathematical research. But\nmore importantly, recently proposed geometric notions of curvature on very\ngeneral metric measure spaces allow us to utilize a whole new set of tools and\nideas that help quantify functionality and robustness of graphs. In particular,\nrobustness is closely connected to network entropy which, in turn, is very\nclosely related to curvature. We will see that there are a number of\nalternative notions of discrete curvature that are compatible with the\nclassical Riemannian definition, each having its own advantages and\ndisadvantages, and are relevant to networks of interest. We will concentrate on\nthe role of curvature for certain key cancer networks in order to\nquantitatively indicate their apparent functional robustness relative to their\nnormal counterparts.\n", "versions": [{"version": "v1", "created": "Mon, 16 Feb 2015 12:33:51 GMT"}, {"version": "v2", "created": "Wed, 25 Mar 2015 20:59:29 GMT"}], "update_date": "2015-03-27", "authors_parsed": [["Tannenbaum", "Allen", ""], ["Sander", "Chris", ""], ["Zhu", "Liangjia", ""], ["Sandhu", "Romeil", ""], ["Kolesov", "Ivan", ""], ["Reznik", "Eduard", ""], ["Senbabaoglu", "Yasin", ""], ["Georgiou", "Tryphon", ""]]}, {"id": "1502.04893", "submitter": "Thomas Kahle", "authors": "Carsten Conradi and Thomas Kahle", "title": "Detecting Binomiality", "comments": "14 pages, v2: Theorem 2.8 replaced by Example 2.8, v3: final version\n  as in Adv.Appl.Math", "journal-ref": "Adv.Appl.Math. 71 (2015) 52-67", "doi": "10.1016/j.aam.2015.08.004", "report-no": null, "categories": "math.CO math.AC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Binomial ideals are special polynomial ideals with many algorithmically and\ntheoretically nice properties. We discuss the problem of deciding if a given\npolynomial ideal is binomial. While the methods are general, our main\nmotivation and source of examples is the simplification of steady state\nequations of chemical reaction networks. For homogeneous ideals we give an\nefficient, Gr\\\"obner-free algorithm for binomiality detection, based on linear\nalgebra only. On inhomogeneous input the algorithm can only give a sufficient\ncondition for binomiality. As a remedy we construct a heuristic toolbox that\ncan lead to simplifications even if the given ideal is not binomial.\n", "versions": [{"version": "v1", "created": "Tue, 17 Feb 2015 13:50:23 GMT"}, {"version": "v2", "created": "Wed, 25 Feb 2015 18:52:16 GMT"}, {"version": "v3", "created": "Thu, 10 Sep 2015 12:18:43 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Conradi", "Carsten", ""], ["Kahle", "Thomas", ""]]}, {"id": "1502.07110", "submitter": "Gabor Szederkenyi", "authors": "Antonio A. Alonso and Gabor Szederkenyi", "title": "Uniqueness of feasible equilibria for mass action law (MAL) kinetic\n  systems", "comments": null, "journal-ref": "Journal of Process Control, 48: 41-71, 2016", "doi": "10.1016/j.jprocont.2016.10.002", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the relations among system parameters, uniqueness, and\nstability of equilibria, for kinetic systems given in the form of polynomial\nODEs. Such models are commonly used to describe the dynamics of nonnegative\nsystems, with a wide range of application fields such as chemistry, systems\nbiology, process modeling or even transportation systems. Using a flux-based\ndescription of kinetic models, a canonical representation of the set of all\npossible feasible equilibria is developed. The characterization is made in\nterms of strictly stable compartmental matrices to define the so-called family\nof solutions. Feasibility is imposed by a set of constraints, which are linear\non a log-transformed space of complexes, and relate to the kernel of a matrix,\nthe columns of which span the stoichiometric subspace. One particularly\ninteresting representation of these constraints can be expressed in terms of a\nclass of monotonous decreasing functions. This allows connections to be\nestablished with classical results in CRNT that relate to the existence and\nuniqueness of equilibria along positive stoichiometric compatibility classes.\nIn particular, monotonicity can be employed to identify regions in the set of\npossible reaction rate coefficients leading to complex balancing, and to\nconclude uniqueness of equilibria for a class of positive deficiency networks.\nThe latter result might support constructing an alternative proof of the\nwell-known deficiency one theorem. The developed notions and results are\nillustrated through examples.\n", "versions": [{"version": "v1", "created": "Wed, 25 Feb 2015 10:16:46 GMT"}, {"version": "v2", "created": "Thu, 10 Nov 2016 23:30:54 GMT"}], "update_date": "2016-11-14", "authors_parsed": [["Alonso", "Antonio A.", ""], ["Szederkenyi", "Gabor", ""]]}, {"id": "1502.07555", "submitter": "Daniel Merkle", "authors": "Jakob L. Andersen, Christoph Flamm, Daniel Merkle, Peter F. Stadler", "title": "Support for Eschenmoser's Glyoxylate Scenario", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A core topic of research in prebiotic chemistry is the search for plausible\nsynthetic routes that connect the building blocks of modern life such as\nsugars, nucleotides, amino acids, and lipids to \"molecular food sources\" that\nhave likely been abundant on Early Earth. In a recent contribution, Albert\nEschenmoser emphasised the importance of catalytic and autocatalytic cycles in\nestablishing such abiotic synthesis pathways. The accumulation of intermediate\nproducts furthermore provides additional catalysts that allow pathways to\nchange over time. We show here that generative models of chemical spaces based\non graph grammars make it possible to study such phenomena is a systematic\nmanner. In addition to repro- ducing the key steps of Eschenmoser's hypothesis\npaper, we discovered previously unexplored potentially autocatalytic pathways\nfrom HCN to glyoxylate. A cascading of autocatalytic cycles could efficiently\nre-route matter, distributed over the combinatorial complex network of HCN\nhydrolysation chemistry, towards a potential primordial metabolism. The\ngenerative approach also has it intrinsic limitations: the unsupervised\nexpansion of the chemical space remains infeasible due to the exponential\ngrowth of possible molecules and reactions between them. Here in particular the\ncombinatorial complexity of the HCN polymerisation and hydrolysation networks\nforms the computational bottleneck. As a consequence, guidance of the\ncomputational exploration by chemical experience is indispensable.\n", "versions": [{"version": "v1", "created": "Thu, 26 Feb 2015 14:02:25 GMT"}], "update_date": "2015-02-27", "authors_parsed": [["Andersen", "Jakob L.", ""], ["Flamm", "Christoph", ""], ["Merkle", "Daniel", ""], ["Stadler", "Peter F.", ""]]}, {"id": "1502.07969", "submitter": "Eli Bogart", "authors": "Eli Bogart and Christopher R. Myers", "title": "Multiscale metabolic modeling of C4 plants: connecting nonlinear\n  genome-scale models to leaf-scale metabolism in developing maize leaves", "comments": "57 pages, 14 figures; submitted to PLoS Computational Biology; source\n  code available at http://github.com/ebogart/fluxtools and\n  http://github.com/ebogart/multiscale_c4_source", "journal-ref": null, "doi": "10.1371/journal.pone.0151722", "report-no": null, "categories": "q-bio.MN q-bio.TO", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  C4 plants, such as maize, concentrate carbon dioxide in a specialized\ncompartment surrounding the veins of their leaves to improve the efficiency of\ncarbon dioxide assimilation. Nonlinear relationships between carbon dioxide and\noxygen levels and reaction rates are key to their physiology but cannot be\nhandled with standard techniques of constraint-based metabolic modeling. We\ndemonstrate that incorporating these relationships as constraints on reaction\nrates and solving the resulting nonlinear optimization problem yields realistic\npredictions of the response of C4 systems to environmental and biochemical\nperturbations. Using a new genome-scale reconstruction of maize metabolism, we\nbuild an 18000-reaction, nonlinearly constrained model describing mesophyll and\nbundle sheath cells in 15 segments of the developing maize leaf, interacting\nvia metabolite exchange, and use RNA-seq and enzyme activity measurements to\npredict spatial variation in metabolic state by a novel method that optimizes\ncorrelation between fluxes and expression data. Though such correlations are\nknown to be weak in general, here the predicted fluxes achieve high correlation\nwith the data, successfully capture the experimentally observed base-to-tip\ntransition between carbon-importing tissue and carbon-exporting tissue, and\ninclude a nonzero growth rate, in contrast to prior results from similar\nmethods in other systems. We suggest that developmental gradients may be\nparticularly suited to the inference of metabolic fluxes from expression data.\n", "versions": [{"version": "v1", "created": "Fri, 27 Feb 2015 17:00:21 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Bogart", "Eli", ""], ["Myers", "Christopher R.", ""]]}]