[{"id": "1604.00167", "submitter": "Wolfram Liebermeister", "authors": "Elad Noor, Avi Flamholz, Arren Bar-Even, Dan Davidi, Ron Milo, Wolfram\n  Liebermeister", "title": "The protein cost of metabolic fluxes: prediction from enzymatic rate\n  laws and cost minimization", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1005167", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bacterial growth depends crucially on metabolic fluxes, which are limited by\nthe cell's capacity to maintain metabolic enzymes. The necessary enzyme amount\nper unit flux is a major determinant of metabolic strategies both in evolution\nand bioengineering. It depends on enzyme parameters (such as kcat and KM\nconstants), but also on metabolite concentrations. Moreover, similar amounts of\ndifferent enzymes might incur different costs for the cell, depending on\nenzyme-specific properties such as protein size and half-life. Here, we\ndeveloped enzyme cost minimization (ECM), a scalable method for computing\nenzyme amounts that support a given metabolic flux at a minimal protein cost.\nThe complex interplay of enzyme and metabolite concentrations, e.g. through\nthermodynamic driving forces and enzyme saturation, would make it hard to solve\nthis optimization problem directly. By treating enzyme cost as a function of\nmetabolite levels, we formulated ECM as a numerically tractable, convex\noptimization problem. Its tiered approach allows for building models at\ndifferent levels of detail, depending on the amount of available data.\nValidating our method with measured metabolite and protein levels in E. coli\ncentral metabolism, we found typical prediction fold errors of 3.8 and 2.7,\nrespectively, for the two kinds of data. ECM can be used to predict enzyme\nlevels and protein cost in natural and engineered pathways, establishes a\ndirect connection between protein cost and thermodynamics, and provides a\nphysically plausible and computationally tractable way to include enzyme\nkinetics into constraint-based metabolic models, where kinetics have usually\nbeen ignored or oversimplified.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 08:48:32 GMT"}], "update_date": "2017-02-08", "authors_parsed": [["Noor", "Elad", ""], ["Flamholz", "Avi", ""], ["Bar-Even", "Arren", ""], ["Davidi", "Dan", ""], ["Milo", "Ron", ""], ["Liebermeister", "Wolfram", ""]]}, {"id": "1604.00828", "submitter": "Georg Meisl", "authors": "Georg Meisl, Xiaoting Yang, Christopher M. Dobson, Sara Linse and\n  Tuomas P. J. Knowles", "title": "A general reaction network unifies the aggregation behaviour of the\n  A$\\beta$42 peptide and its variants", "comments": null, "journal-ref": null, "doi": "10.1039/C7SC00215G", "report-no": null, "categories": "q-bio.MN q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The amyloid $\\beta$ peptide (A$\\beta$42), whose aggregation is associated\nwith Alzheimer's disease, is an amphiphatic peptide with a high propensity to\nself-assemble. A$\\beta$42 has a net negative charge at physiological pH and\nmodulations of intermolecular electrostatic interactions can significantly\nalter its aggregation behaviour. Variations in sequence and solution conditions\nlead to varied macroscopic behaviour, often resulting in a number of different\nmechanistic explanations for the aggregation of these closely related systems.\nHere we alter the electrostatic interactions governing the fibril aggregation\nkinetics by varying the ionic strength over an order of magnitude, which allows\nus to sample the space of different reaction mechanisms, and develop a minimal\nreaction network that explains the experimental kinetics under all the\ndifferent conditions. We find that an increase in the ionic strength leads to\nan increased rate of surface catalysed nucleation over fragmentation and\neventually to a saturation of this nucleation process. More generally, this\nreaction network connects previously separate systems, such as mutants of\nA$\\beta$42 and the wild type, on a continuous mechanistic landscape, thereby\nproviding a unified picture of the aggregation mechanism of A$\\beta$42 and the\nmeans of directly comparing the effects of intrinsic modifications of the\npeptide to those of simple electrostatic shielding.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 12:13:33 GMT"}], "update_date": "2020-08-25", "authors_parsed": [["Meisl", "Georg", ""], ["Yang", "Xiaoting", ""], ["Dobson", "Christopher M.", ""], ["Linse", "Sara", ""], ["Knowles", "Tuomas P. J.", ""]]}, {"id": "1604.00919", "submitter": "Benoit Girard", "authors": "Charles Thurat (ISIR), Steve N 'Guyen (LPPA, ISIR), Beno\\^it Girard\n  (ISIR)", "title": "Biomimetic race model of the loop between the superior colliculus and\n  the basal ganglia: Subcortical selection of saccade targets", "comments": null, "journal-ref": "Neural Networks, Elsevier, 2015, 67, pp.54-73", "doi": "10.1016/j.neunet.2015.02.004", "report-no": null, "categories": "q-bio.NC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Superior Colliculus, a laminar structure involved in the retinotopic\nmapping of the visual field, plays a cardinal role in the several cortical and\nsubcortical loops of the saccadic system. Although the selection of saccade\ntargets has long been thought to be the sole product of cortical processes, a\ngrowing body of evidence hints at the implication of the Superior Colliculus,\nfirstly by the lateral connections between the neurons of its maps, and\nsecondly by its interactions with the midbrain Basal Ganglia, already renowned\nfor their role in decision making. We propose a biomimetic population-coded\nrace model of selection based on a dynamic tecto-basal loop that reproduces the\nobserved ability of the Superior Colliculus to stochastically select between\nsimilar stimuli, the accuracy of this selection depending on the\ndiscriminability of the target and the distractors. Our model also offers an\nexplanation for the phenomenon of Remote Distractor Effect based on the lateral\nconnectivity within the Basal Ganglia circuitry rather than on lateral\ninhibitions within the collicular maps. Finally, we propose a role for the\nintermediate layers of the Superior Colliculus, as stochastic integrators\ndynamically gated by the selective disinhibition of the Basal Ganglia channels\nthat is consistent with the recorded activity profiles of these neurons.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2015 08:48:56 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Thurat", "Charles", "", "ISIR"], ["'Guyen", "Steve N", "", "LPPA, ISIR"], ["Girard", "Benoît", "", "ISIR"]]}, {"id": "1604.01210", "submitter": "Mirko Signorelli", "authors": "Mirko Signorelli, Veronica Vinciotti, Ernst C. Wit", "title": "NEAT: an efficient network enrichment analysis test", "comments": "The original version of the paper is freely available (Open Access)\n  from the editor's website\n  (https://bmcbioinformatics.biomedcentral.com/articles/10.1186/s12859-016-1203-6)", "journal-ref": "BMC Bioinformatics (2016), 17:352", "doi": "10.1186/s12859-016-1203-6", "report-no": null, "categories": "stat.AP q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network enrichment analysis is a powerful method, which allows to integrate\ngene enrichment analysis with the information on relationships between genes\nthat is provided by gene networks. Existing tests for network enrichment\nanalysis deal only with undirected networks, they can be computationally slow\nand are based on normality assumptions.\n  We propose NEAT, a test for network enrichment analysis. The test is based on\nthe hypergeometric distribution, which naturally arises as the null\ndistribution in this context. NEAT can be applied not only to undirected, but\nto directed and partially directed networks as well. Our simulations indicate\nthat NEAT is considerably faster than alternative resampling-based methods, and\nthat its capacity to detect enrichments is at least as good as the one of\nalternative tests. We discuss applications of NEAT to network analyses in yeast\nby testing for enrichment of the Environmental Stress Response target gene set\nwith GO Slim and KEGG functional gene sets, and also by testing for\nassociations between GO Slim categories themselves.\n  NEAT is a flexible and efficient test for network enrichment analysis that\naims to overcome some limitations of existing resampling-based tests. The\nmethod is implemented in the R package neat, which can be freely downloaded\nfrom CRAN (http://cran.r-project.org/package=neat).\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 10:21:16 GMT"}, {"version": "v2", "created": "Mon, 9 May 2016 15:33:38 GMT"}, {"version": "v3", "created": "Sat, 17 Sep 2016 20:15:46 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Signorelli", "Mirko", ""], ["Vinciotti", "Veronica", ""], ["Wit", "Ernst C.", ""]]}, {"id": "1604.01740", "submitter": "Vipin Vijayan", "authors": "Vipin Vijayan and Tijana Milenkovic", "title": "Multiple network alignment via multiMAGNA++", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network alignment (NA) aims to find a node mapping between molecular networks\nof different species that identifies topologically or functionally similar\nnetwork regions. Analogous to genomic sequence alignment, NA can be used to\ntransfer biological knowledge from well- to poorly-studied species between\naligned network regions. Pairwise NA (PNA) finds similar regions between two\nnetworks while multiple NA (MNA) can align more than two networks. We focus on\nMNA. Existing MNA methods aim to maximize total similarity over all aligned\nnodes (node conservation). Then, they evaluate alignment quality by measuring\nthe amount of conserved edges, but only after the alignment is constructed.\nDirectly optimizing edge conservation during alignment construction in addition\nto node conservation may result in superior alignments. Thus, we present a\nnovel MNA approach called multiMAGNA++ that can achieve this. Indeed,\nmultiMAGNA++ generally outperforms or is on par with the existing MNA methods,\nwhile often completing faster than the existing methods. That is, multiMAGNA++\nscales well to larger network data and can be parallelized effectively. During\nmethod evaluation, we also introduce new MNA quality measures to allow for more\ncomplete alignment characterization as well as more fair MNA method comparison\ncompared to using only the existing alignment quality measures.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 19:25:29 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Vijayan", "Vipin", ""], ["Milenkovic", "Tijana", ""]]}, {"id": "1604.02208", "submitter": "Jose Davila-Velderrain", "authors": "Luis F. M\\'endez-L\\'opez, Jose Davila-Velderrain, Christian\n  Enr\\'iquez-Olgu\\'in, Elisa Dom\\'inguez-H\\\"uttinger, Juan C. Martinez-Garcia,\n  Elena R Alvarez-Buylla", "title": "Dynamic network and epigenetic landscape model of a regulatory core\n  underlying spontaneous immortalization and epithelial carcinogenesis", "comments": "11 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tumorigenic transformation of human epithelial cells in vitro has been\ndescribed experimentally as the potential result of a process known as\nspontaneous immortalization. In this process a generic series of cell state\ntransitions occur in which normal epithelial cells acquire a senescent state,\nlater surpassed to attain first a mesenchymal state and then a final\nmesenchymal stem-like phenotype, with potential tumorigenic behavior. In this\npaper we integrate published data on the molecular components and interactions\nthat have been described as key regulators of such cell states and transitions.\nA large network, that is provided, is constructed and then reduced with the aim\nof recovering a minimal regulatory core incorporating the necessary and\nsufficient restrictions to recover the observed cell states and their generic\nprogression patterns in epithelial-mesenchymal transition. Data is formalized\ninto logical regulatory rules that govern the dynamics of each of the network's\ncomponents as a function of the states of its regulators. The proposed core\ngene regulatory network attains only three steady-state gene expression\nconfigurations that correspond to the profiles characteristic of normal\nepithelial, senescent, and mesenchymal stem-like cells. Interestingly,\nepigenetic landscape analyses of the uncovered network shows that it also\nrecovers the generic time-ordered transitions documented during tumorigenic\ntransformation in vitro of epithelial cells. The latter strongly correlate with\nthe patterns observed during the progressive pathological description of\nepithelial carcinogenesis in vivo.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 01:29:24 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Méndez-López", "Luis F.", ""], ["Davila-Velderrain", "Jose", ""], ["Enríquez-Olguín", "Christian", ""], ["Domínguez-Hüttinger", "Elisa", ""], ["Martinez-Garcia", "Juan C.", ""], ["Alvarez-Buylla", "Elena R", ""]]}, {"id": "1604.02623", "submitter": "Dhagash Mehta", "authors": "Heather A. Harrington, Dhagash Mehta, Helen M. Byrne, Jonathan D.\n  Hauenstein", "title": "Decomposing the parameter space of biological networks via a numerical\n  discriminant approach", "comments": "13 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.AG math.DS math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many systems in biology, physics and engineering can be described by systems\nof ordinary differential equation containing many parameters. When studying the\ndynamic behavior of these large, nonlinear systems, it is useful to identify\nand characterize the steady-state solutions as the model parameters vary, a\ntechnically challenging problem in a high-dimensional parameter landscape.\nRather than simply determining the number and stability of steady-states at\ndistinct points in parameter space, we decompose the parameter space into\nfinitely many regions, the steady-state solutions being consistent within each\ndistinct region. From a computational algebraic viewpoint, the boundary of\nthese regions is contained in the discriminant locus. We develop global and\nlocal numerical algorithms for constructing the discriminant locus and\nclassifying the parameter landscape. We showcase our numerical approaches by\napplying them to molecular and cell-network models.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 00:50:42 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Harrington", "Heather A.", ""], ["Mehta", "Dhagash", ""], ["Byrne", "Helen M.", ""], ["Hauenstein", "Jonathan D.", ""]]}, {"id": "1604.02733", "submitter": "Thibaud Taillefumier", "authors": "Thibaud Taillefumier, Anna Posfai, Yigal Meir and Ned S. Wingreen", "title": "Bacterial cartels at steady supply", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metagenomics has revealed hundreds of bacterial species in almost all\nmicrobiota. In a few well-studied cases, bacterial communities have been\nobserved to coordinate their metabolic fluxes. In principle, bacteria can\ndivide tasks to reap the benefits of specialization, as in human economies.\nHowever, the benefits and stability of an economy of bacterial specialists are\nfar from obvious. Here, we physically model the population dynamics of bacteria\nthat compete for steadily supplied resources. Importantly, we explicitly model\nthe metabolic fluxes yielding cellular biomass production under the constraint\nof a limited enzyme budget. In our framework, we find that population dynamics\ngenerally leads to the coexistence of different metabolic types, which satisfy\nan extended competitive exclusion principle (even allowing for adaptive\nmutation). We establish that these consortia act as cartels, whereby population\ndynamics pins down resource concentrations at values for which no other\nstrategy can invade. Finally, we propose that at steady supply, cartels of\ncompeting strategies automatically yield maximum biomass, thereby achieving a\ncollective optimum.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 21:01:53 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Taillefumier", "Thibaud", ""], ["Posfai", "Anna", ""], ["Meir", "Yigal", ""], ["Wingreen", "Ned S.", ""]]}, {"id": "1604.02919", "submitter": "Silvia Grigolon", "authors": "Silvia Grigolon, Francesca Di Patti, Andrea De Martino, Enzo Marinari", "title": "Noise Processing by MicroRNA-Mediated Circuits: the Incoherent\n  Feed-Forward Loop, Revisited", "comments": "25 pages (Main Text and Supplementary Information), 5 figures", "journal-ref": "Heliyon 2 (2016) e00095", "doi": "10.1016/j.heliyon.2016.e00095", "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The intrinsic stochasticity of gene expression is usually mitigated in higher\neukaryotes by post-transcriptional regulation channels that stabilise the\noutput layer, most notably protein levels. The discovery of small non-coding\nRNAs (miRNAs) in specific motifs of the genetic regulatory network has led to\nidentifying noise buffering as the possible key function they exert in\nregulation. Recent in vitro} and in silico studies have corroborated this\nhypothesis. It is however also known that miRNA-mediated noise reduction is\nhampered by transcriptional bursting in simple topologies. Here, using\nstochastic simulations validated by analytical calculations based on van\nKampen's expansion, we revisit the noise-buffering capacity of the\nmiRNA-mediated Incoherent Feed Forward Loop (IFFL), a small module that is\nwidespread in the gene regulatory networks of higher eukaryotes, in order to\naccount for the effects of intermittency in the transcriptional activity of the\nmodulator gene. We show that bursting considerably alters the circuit's ability\nto control static protein noise. By comparing with other regulatory\narchitectures, we find that direct transcriptional regulation significantly\noutperforms the IFFL in a broad range of kinetic parameters. This suggests\nthat, under pulsatile inputs, static noise reduction may be less important than\ndynamical aspects of noise and information processing in characterising the\nperformance of regulatory elements.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 12:42:53 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Grigolon", "Silvia", ""], ["Di Patti", "Francesca", ""], ["De Martino", "Andrea", ""], ["Marinari", "Enzo", ""]]}, {"id": "1604.03244", "submitter": "Guangyu Zhou", "authors": "Xiuli Ma, Guangyu Zhou, Jingjing Wang, Jian Peng, Jiawei Han", "title": "Complexes Detection in Biological Networks via Diversified Dense\n  Subgraphs Mining", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein-protein interaction (PPI) networks, providing a comprehensive\nlandscape of protein interacting patterns, enable us to explore biological\nprocesses and cellular components at multiple resolutions. For a biological\nprocess, a number of proteins need to work together to perform the job.\nProteins densely interact with each other, forming large molecular machines or\ncellular building blocks. Identification of such densely interconnected\nclusters or protein complexes from PPI networks enables us to obtain a better\nunderstanding of the hierarchy and organization of biological processes and\ncellular components. Most existing methods apply efficient graph clustering\nalgorithms on PPI networks, often failing to detect possible densely connected\nsubgraphs and overlapped subgraphs. Besides clustering-based methods, dense\nsubgraph enumeration methods have also been used, which aim to find all densely\nconnected protein sets. However, such methods are not practically tractable\neven on a small yeast PPI network, due to high computational complexity. In\nthis paper, we introduce a novel approximate algorithm to efficiently enumerate\nputative protein complexes from biological networks. The key insight of our\nalgorithm is that we do not need to enumerate all dense subgraphs. Instead we\nonly need to find a small subset of subgraphs that cover as many proteins as\npossible. The problem is formulated as finding a diverse set of dense\nsubgraphs, where we develop highly effective pruning techniques to guarantee\nefficiency. To handle large networks, we take a divide-and-conquer approach to\nspeed up the algorithm in a distributed manner. By comparing with existing\nclustering and dense subgraph-based algorithms on several human and yeast PPI\nnetworks, we demonstrate that our method can detect more putative protein\ncomplexes and achieves better prediction accuracy.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 04:39:28 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Ma", "Xiuli", ""], ["Zhou", "Guangyu", ""], ["Wang", "Jingjing", ""], ["Peng", "Jian", ""], ["Han", "Jiawei", ""]]}, {"id": "1604.03388", "submitter": "Daniele Cappelletti", "authors": "David F. Anderson, Daniele Cappelletti and Thomas G. Kurtz", "title": "Finite time distributions of stochastically modeled chemical systems\n  with absolute concentration robustness", "comments": null, "journal-ref": null, "doi": "10.1137/16M1070773", "report-no": null, "categories": "math.PR q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent research in both the experimental and mathematical communities has\nfocused on biochemical interaction systems that satisfy an \"absolute\nconcentration robustness\" (ACR) property. The ACR property was first discovered\nexperimentally when, in a number of different systems, the concentrations of\nkey system components at equilibrium were observed to be robust to the total\nconcentration levels of the system. Followup mathematical work focused on\ndeterministic models of biochemical systems and demonstrated how chemical\nreaction network theory can be utilized to explain this robustness. Later\nmathematical work focused on the behavior of this same class of reaction\nnetworks, though under the assumption that the dynamics were stochastic. Under\nthe stochastic assumption, it was proven that the system will undergo an\nextinction event with a probability of one so long as the system is\nconservative, showing starkly different long-time behavior than in the\ndeterministic setting. Here we consider a general class of stochastic models\nthat intersects with the class of ACR systems studied previously. We consider a\nspecific system scaling over compact time intervals and prove that in a limit\nof this scaling the distribution of the abundances of the ACR species converges\nto a certain product-form Poisson distribution whose mean is the ACR value of\nthe deterministic model. This result is in agreement with recent conjectures\npertaining to the behavior of ACR networks endowed with stochastic kinetics,\nand helps to resolve the conflicting theoretical results pertaining to\ndeterministic and stochastic models in this setting.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 13:07:40 GMT"}, {"version": "v2", "created": "Fri, 23 Sep 2016 14:08:22 GMT"}], "update_date": "2018-05-22", "authors_parsed": [["Anderson", "David F.", ""], ["Cappelletti", "Daniele", ""], ["Kurtz", "Thomas G.", ""]]}, {"id": "1604.03482", "submitter": "Somaye Hashemifar", "authors": "Somaye Hashemifar, Qixing Huang and Jinbo XU", "title": "Joint alignment of multiple protein-protein interaction networks via\n  convex optimization", "comments": "Accepted by Recomb 2016, in Journal of Computational Biology 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: High-throughput experimental techniques have been producing more\nand more protein-protein interaction (PPI) data. PPI network alignment greatly\nbenefits the understanding of evolutionary relationship among species, helps\nidentify conserved sub-networks and provides extra information for functional\nannotations. Although a few methods have been developed for multiple PPI\nnetwork alignment, the alignment quality is still far away from perfect and\nthus, new network alignment methods are needed. Result: In this paper, we\npresent a novel method, denoted as ConvexAlign, for joint alignment of multiple\nPPI networks by convex optimization of a scoring function composed of sequence\nsimilarity, topological score and interaction conservation score. In contrast\nto existing methods that generate multiple alignments in a greedy or\nprogressive manner, our convex method optimizes alignments globally and\nenforces consistency among all pairwise alignments, resulting in much better\nalignment quality. Tested on both synthetic and real data, our experimental\nresults show that ConvexAlign outperforms several popular methods in producing\nfunctionally coherent alignments. ConvexAlign even has a larger advantage over\nthe others in aligning real PPI networks. ConvexAlign also finds a few\nconserved complexes among 5 species which cannot be detected by the other\nmethods.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 17:07:16 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Hashemifar", "Somaye", ""], ["Huang", "Qixing", ""], ["XU", "Jinbo", ""]]}, {"id": "1604.03508", "submitter": "Andrew Eckford", "authors": "Peter J. Thomas and Andrew W. Eckford", "title": "Shannon Capacity of Signal Transduction for Multiple Independent\n  Receptors", "comments": "Accepted for presentation at the 2016 IEEE International Symposium on\n  Information Theory (ISIT)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyclic adenosine monophosphate (cAMP) is considered a model system for signal\ntransduction, the mechanism by which cells exchange chemical messages. Our\nprevious work calculated the Shannon capacity of a single cAMP receptor;\nhowever, a typical cell may have thousands of receptors operating in parallel.\nIn this paper, we calculate the capacity of a cAMP signal transduction system\nwith an arbitrary number of independent, indistinguishable receptors. By\nleveraging prior results on feedback capacity for a single receptor, we show\n(somewhat unexpectedly) that the capacity is achieved by an IID input\ndistribution, and that the capacity for n receptors is n times the capacity for\na single receptor.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 18:33:40 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Thomas", "Peter J.", ""], ["Eckford", "Andrew W.", ""]]}, {"id": "1604.03591", "submitter": "Jae Kyoung Kim", "authors": "Jae Kyoung Kim", "title": "Protein sequestration versus Hill-type repression in circadian clock\n  models", "comments": "31 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Circadian (~24hr) clocks are self-sustained endogenous oscillators with which\norganisms keep track of daily and seasonal time. Circadian clocks frequently\nrely on interlocked transcriptional- translational feedback loops to generate\nrhythms that are robust against intrinsic and extrinsic perturbations. To\ninvestigate the dynamics and mechanisms of the intracellular feedback loops in\ncircadian clocks, a number of mathematical models have been developed. The\nmajority of the models use Hill functions to describe transcriptional\nrepression in a way that is similar to the Goodwin model. Recently, a new class\nof models with protein sequestration-based repression has been introduced.\nHere, we discuss how this new class of models differs dramatically from those\nbased on Hill-type repression in several fundamental aspects: conditions for\nrhythm generation, robust network designs and the periods of coupled\noscillators. Consistently, these fundamental properties of circadian clocks\nalso differ among Neurospora, Drosophila, and mammals depending on their key\ntranscriptional repression mechanisms (Hill-type repression or protein\nsequestration). Based on both theoretical and experimental studies, this review\nhighlights the importance of careful modeling of transcriptional repression\nmechanisms in molecular circadian clocks.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 21:21:46 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Kim", "Jae Kyoung", ""]]}, {"id": "1604.03687", "submitter": "Robert Brijder", "authors": "Robert Brijder and David Doty and David Soloveichik", "title": "Democratic, Existential, and Consensus-Based Output Conventions in\n  Stable Computation by Chemical Reaction Networks", "comments": "16 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.DC cs.LO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that some natural output conventions for error-free computation in\nchemical reaction networks (CRN) lead to a common level of computational\nexpressivity. Our main results are that the standard consensus-based output\nconvention have equivalent computational power to (1) existence-based and (2)\ndemocracy-based output conventions. The CRNs using the former output convention\nhave only \"yes\" voters, with the interpretation that the CRN's output is yes if\nany voters are present and no otherwise. The CRNs using the latter output\nconvention define output by majority vote among \"yes\" and \"no\" voters.\n  Both results are proven via a generalized framework that simultaneously\ncaptures several definitions, directly inspired by a Petri net result of\nEsparza, Ganty, Leroux, and Majumder [CONCUR 2015]. These results support the\nthesis that the computational expressivity of error-free CRNs is intrinsic, not\nsensitive to arbitrary definitional choices.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 08:28:42 GMT"}, {"version": "v2", "created": "Mon, 10 Jul 2017 12:11:14 GMT"}], "update_date": "2017-07-11", "authors_parsed": [["Brijder", "Robert", ""], ["Doty", "David", ""], ["Soloveichik", "David", ""]]}, {"id": "1604.04643", "submitter": "Dorjsuren Battogtokh", "authors": "Dorjsuren Battogtokh and John J. Tyson", "title": "Comparison of Domain Nucleation Mechanisms in a Minimal Model of Shoot\n  Apical Meristem", "comments": "9 pages 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Existing mathematical models of the shoot apical meristem (SAM) explain\nnucleation and confinement of a stem cell domain by Turing's mechanism,\nassuming that the diffusion coefficients of the activator (WUSCHEL) and\ninhibitor (CLAVATA) are significantly different. As there is no evidence for\nthis assumption of differential diffusivity, we recently proposed a new\nmechanism based on a bistable switch model of the SAM. Here we study the\nbistable-switch mechanism in detail, demonstrating that it can be understood as\nlocalized switches of WUSHEL activity in individual cells driven by a\nnon-uniform field of a peptide hormone. By comparing domain formation by Turing\nand bistable-switch mechanisms on a cell network, we show that the latter does\nnot require the assumptions needed by the former, which are not supported by\nbiological evidences.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 21:09:45 GMT"}, {"version": "v2", "created": "Tue, 19 Apr 2016 03:15:51 GMT"}, {"version": "v3", "created": "Wed, 6 Dec 2017 19:00:02 GMT"}], "update_date": "2017-12-08", "authors_parsed": [["Battogtokh", "Dorjsuren", ""], ["Tyson", "John J.", ""]]}, {"id": "1604.05378", "submitter": "Narmada Herath", "authors": "Narmada Herath and Domitilla Del Vecchio", "title": "Model order reduction for Linear Noise Approximation using time-scale\n  separation (Extended Version)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we focus on model reduction of biomolecular systems with\nmultiple time-scales, modeled using the Linear Noise Approximation. Considering\nsystems where the Linear Noise Approximation can be written in singular\nperturbation form, with $\\epsilon$ as the singular perturbation parameter, we\nobtain a reduced order model that approximates the slow variable dynamics of\nthe original system. In particular, we show that, on a finite time-interval,\nthe first and second moments of the reduced system are within an\n$O(\\epsilon)$-neighborhood of the first and second moments of the slow variable\ndynamics of the original system. The approach is illustrated on an example of a\nbiomolecular system that exhibits time-scale separation.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 23:20:36 GMT"}, {"version": "v2", "created": "Sat, 24 Sep 2016 00:02:18 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Herath", "Narmada", ""], ["Del Vecchio", "Domitilla", ""]]}, {"id": "1604.06111", "submitter": "Lei Meng", "authors": "Lei Meng, Joseph Crawford, Aaron Striegel, Tijana Milenkovic", "title": "IGLOO: Integrating global and local biological network alignment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analogous to genomic sequence alignment, biological network alignment (NA)\naims to find regions of similarities between molecular networks (rather than\nsequences) of different species. NA can be either local (LNA) or global (GNA).\nLNA aims to identify highly conserved common subnetworks, which are typically\nsmall, while GNA aims to identify large common subnetworks, which are typically\nsuboptimally conserved. We recently showed that LNA and GNA yield complementary\nresults: LNA has high functional but low topological alignment quality, while\nGNA has high topological but low functional alignment quality. Thus, we propose\nIGLOO, a new approach that integrates GNA and LNA in hope to reconcile the two.\nWe evaluate IGLOO against state-of-the-art LNA (NetworkBLAST, NetAligner,\nAlignNemo, and AlignMCL) and GNA (GHOST, NETAL, GEDEVO, MAGNA++, WAVE, and\nL-GRAAL) methods. We show that IGLOO allows for a trade-off between topological\nand functional alignment quality better than the existing LNA and GNA methods\nconsidered in our study.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 20:05:49 GMT"}, {"version": "v2", "created": "Mon, 6 Jun 2016 01:24:12 GMT"}], "update_date": "2016-06-07", "authors_parsed": [["Meng", "Lei", ""], ["Crawford", "Joseph", ""], ["Striegel", "Aaron", ""], ["Milenkovic", "Tijana", ""]]}]