[{"id": "1703.00219", "submitter": "Andrea De Martino", "authors": "Daniele De Martino, Fabrizio Capuani, Andrea De Martino", "title": "Quantifying the entropic cost of cellular growth control", "comments": "3 pages", "journal-ref": "Phys. Rev. E 96, 010401 (2017)", "doi": "10.1103/PhysRevE.96.010401", "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn physics.bio-ph q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We quantify the amount of regulation required to control growth in living\ncells by a Maximum Entropy approach to the space of underlying metabolic states\ndescribed by genome-scale models. Results obtained for E. coli and human cells\nare consistent with experiments and point to different regulatory strategies by\nwhich growth can be fostered or repressed. Moreover we explicitly connect the\n`inverse temperature' that controls MaxEnt distributions to the growth\ndynamics, showing that the initial size of a colony may be crucial in\ndetermining how an exponentially growing population organizes the phenotypic\nspace.\n", "versions": [{"version": "v1", "created": "Wed, 1 Mar 2017 10:35:45 GMT"}], "update_date": "2017-07-19", "authors_parsed": [["De Martino", "Daniele", ""], ["Capuani", "Fabrizio", ""], ["De Martino", "Andrea", ""]]}, {"id": "1703.00748", "submitter": "Andrea De Martino", "authors": "Matteo Mori, Enzo Marinari, Andrea De Martino", "title": "A yield-cost tradeoff governs Escherichia coli's decision between\n  fermentation and respiration in carbon-limited growth", "comments": "13 pages (includes Supporting Text)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many microbial systems are known to actively reshape their proteomes in\nresponse to changes in growth conditions induced e.g. by nutritional stress or\nantibiotics. Part of the re-allocation accounts for the fact that, as the\ngrowth rate is limited by targeting specific metabolic activities, cells simply\nrespond by fine-tuning their proteome to invest more resources into the\nlimiting activity (i.e. by synthesizing more proteins devoted to it). However,\nthis is often accompanied by an overall re-organization of metabolism, aimed at\nimproving the growth yield under limitation by re-wiring resource through\ndifferent pathways. While both effects impact proteome composition, the latter\nunderlies a more complex systemic response to stress. By focusing on E. coli's\n`acetate switch', we use mathematical modeling and a re-analysis of empirical\ndata to show that the transition from a predominantly fermentative to a\npredominantly respirative metabolism in carbon-limited growth results from the\ntrade-off between maximizing the growth yield and minimizing its costs in terms\nof required the proteome share. In particular, E. coli's metabolic phenotypes\nappear to be Pareto-optimal for these objective functions over a broad range of\ndilutions.\n", "versions": [{"version": "v1", "created": "Thu, 2 Mar 2017 12:15:14 GMT"}], "update_date": "2017-03-03", "authors_parsed": [["Mori", "Matteo", ""], ["Marinari", "Enzo", ""], ["De Martino", "Andrea", ""]]}, {"id": "1703.00853", "submitter": "Daniele De Martino", "authors": "Daniele De Martino", "title": "The free lunch of a scale-free metabolism", "comments": "Comments are welcome", "journal-ref": "Phys. Rev. E 95, 062419 (2017)", "doi": "10.1103/PhysRevE.95.062419", "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work it is shown that scale free tails in metabolic flux\ndistributions inferred from realistic large scale models can be simply an\nartefact due to reactions involved in thermodynamically unfeasible cycles, that\nare unbounded by physical constraints and would be able to perform work without\nexpenditure of free energy. After correcting for thermodynamics, the metabolic\nspace scales meaningfully with the physical limiting factors, acquiring in turn\na richer multimodal structure potentially leading to symmetry breaking while\noptimizing for objective functions.\n", "versions": [{"version": "v1", "created": "Thu, 2 Mar 2017 16:50:33 GMT"}], "update_date": "2017-07-05", "authors_parsed": [["De Martino", "Daniele", ""]]}, {"id": "1703.01353", "submitter": "Tahir Yusufaly", "authors": "Tahir Yusufaly and James Q. Boedicker", "title": "Mapping quorum sensing onto neural networks to understand collective\n  decision making in heterogeneous microbial communities", "comments": null, "journal-ref": null, "doi": "10.1088/1478-3975/aa7c1e", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Microbial communities frequently communicate via quorum sensing (QS), where\ncells produce, secrete, and respond to a threshold level of an autoinducer (AI)\nmolecule, thereby modulating gene expression. However, the biology of QS\nremains incompletely understood in heterogeneous communities, where variant\nbacterial strains possess distinct QS systems that produce chemically unique\nAIs. AI molecules bind to 'cognate' receptors, but also to 'non-cognate'\nreceptors found in other strains, resulting in inter-strain crosstalk.\nUnderstanding these interactions is a prerequisite for deciphering the\nconsequences of crosstalk in real ecosystems, where multiple AIs are regularly\npresent in the same environment. As a step towards this goal, we map crosstalk\nin a heterogeneous community of variant QS strains onto an artificial neural\nnetwork model. This formulation allows us to systematically analyze how\ncrosstalk regulates the community's capacity for flexible decision making, as\nquantified by the Boltzmann entropy of all QS gene expression states of the\nsystem. In a mean-field limit of complete cross-inhibition between variant\nstrains, the model is exactly solvable, allowing for an analytical formula for\nthe number of variants that maximize capacity as a function of signal kinetics\nand activation parameters. An analysis of previous experimental results on the\nStaphylococcus aureus two-component Agr system indicates that the observed\ncombination of variant numbers, gene expression rates and threshold\nconcentrations lies near this critical regime of parameter space where capacity\npeaks. The results are suggestive of a potential evolutionary driving force for\ndiversification in certain QS systems.\n", "versions": [{"version": "v1", "created": "Fri, 3 Mar 2017 22:33:07 GMT"}], "update_date": "2017-08-02", "authors_parsed": [["Yusufaly", "Tahir", ""], ["Boedicker", "James Q.", ""]]}, {"id": "1703.01818", "submitter": "Daniele De Martino", "authors": "Daniele De Martino, Anna MC Andersson, Tobias Bergmiller, C\\u{a}lin C\n  Guet, Ga\\v{s}per Tka\\v{c}ik", "title": "Statistical mechanics for metabolic networks during steady-state growth", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": "10.1038/s41467-018-05417-9", "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Which properties of metabolic networks can be derived solely from\nstoichiometric information about the network's constituent reactions?\nPredictive results have been obtained by Flux Balance Analysis (FBA), by\npostulating that cells set metabolic fluxes within the allowed stoichiometry so\nas to maximize their growth. Here, we generalize this framework to single cell\nlevel using maximum entropy models from statistical physics. We define and\ncompute, for the core metabolism of Escherichia coli, a joint distribution over\nall fluxes that yields the experimentally observed growth rate. This solution,\ncontaining FBA as a limiting case, provides a better match to the measured\nfluxes in the wild type and several mutants. We find that E. coli metabolism is\nclose to, but not at, the optimality assumed by FBA. Moreover, our model makes\na wide range of predictions: (i) on flux variability, its regulation, and flux\ncorrelations across individual cells; (ii) on the relative importance of\nstoichiometric constraints vs. growth rate optimization; (iii) on quantitative\nscaling relations for singe-cell growth rate distributions. We validate these\nscaling predictions using data from individual bacterial cells grown in a\nmicrofluidic device at different sub-inhibitory antibiotic concentrations.\nUnder mild dynamical assumptions, fluctuation-response relations further\npredict the autocorrelation timescale in growth data and growth rate adaptation\ntimes following an environmental perturbation.\n", "versions": [{"version": "v1", "created": "Mon, 6 Mar 2017 11:34:45 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["De Martino", "Daniele", ""], ["Andersson", "Anna MC", ""], ["Bergmiller", "Tobias", ""], ["Guet", "Călin C", ""], ["Tkačik", "Gašper", ""]]}, {"id": "1703.01900", "submitter": "Jipeng Qiang", "authors": "Jipeng Qiang and Wei Ding and John Quackenbush and Ping Chen", "title": "Network-based Distance Metric with Application to Discover Disease\n  Subtypes in Cancer", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.IR q-bio.GN q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While we once thought of cancer as single monolithic diseases affecting a\nspecific organ site, we now understand that there are many subtypes of cancer\ndefined by unique patterns of gene mutations. These gene mutational data, which\ncan be more reliably obtained than gene expression data, help to determine how\nthe subtypes develop, evolve, and respond to therapies. Different from dense\ncontinuous-value gene expression data, which most existing cancer subtype\ndiscovery algorithms use, somatic mutational data are extremely sparse and\nheterogeneous, because there are less than 0.5\\% mutated genes in discrete\nvalue 1/0 out of 20,000 human protein-coding genes, and identical mutated genes\nare rarely shared by cancer patients.\n  Our focus is to search for cancer subtypes from extremely sparse and high\ndimensional gene mutational data in discrete 1 and 0 values using unsupervised\nlearning. We propose a new network-based distance metric. We project cancer\npatients' mutational profile into their gene network structure and measure the\ndistance between two patients using the similarity between genes and between\nthe gene vertexes of the patients in the network. Experimental results in\nsynthetic data and real-world data show that our approach outperforms the top\ncompetitors in cancer subtype discovery. Furthermore, our approach can identify\ncancer subtypes that cannot be detected by other clustering algorithms in real\ncancer data.\n", "versions": [{"version": "v1", "created": "Wed, 1 Mar 2017 02:09:50 GMT"}], "update_date": "2017-03-07", "authors_parsed": [["Qiang", "Jipeng", ""], ["Ding", "Wei", ""], ["Quackenbush", "John", ""], ["Chen", "Ping", ""]]}, {"id": "1703.02758", "submitter": "Araks Martirosyan", "authors": "Araks Martirosyan, Andrea De Martino, Andrea Pagnani, Enzo Marinari", "title": "ceRNA crosstalk stabilizes protein expression and affects the\n  correlation pattern of interacting proteins", "comments": null, "journal-ref": "Scientific Reports, 7:43673, Mar 7, 2017", "doi": "10.1038/srep43673", "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Gene expression is a noisy process and several mechanisms, both\ntranscriptional and posttranscriptional, can stabilize protein levels in cells.\nMuch work has focused on the role of miRNAs, showing in particular that\nmiRNA-mediated regulation can buffer expression noise for lowly expressed\ngenes. Here, using in silico simulations and mathematical modeling, we\ndemonstrate that miRNAs can exert a much broader influence on protein levels by\norchestrating competition-induced crosstalk between mRNAs. Most notably, we\nfind that miRNA-mediated cross-talk (i) can stabilize protein levels across the\nfull range of gene expression rates, and (ii) modifies the correlation pattern\nof co-regulated interacting proteins, changing the sign of correlations from\nnegative to positive. The latter feature may constitute a potentially robust\nsignature of the existence of RNA crosstalk induced by endogenous competition\nfor miRNAs in standard cellular conditions.\n", "versions": [{"version": "v1", "created": "Wed, 8 Mar 2017 09:32:29 GMT"}], "update_date": "2017-03-09", "authors_parsed": [["Martirosyan", "Araks", ""], ["De Martino", "Andrea", ""], ["Pagnani", "Andrea", ""], ["Marinari", "Enzo", ""]]}, {"id": "1703.03398", "submitter": "Wenping Cui", "authors": "Wenping Cui and Pankaj Mehta", "title": "Identifying feasible operating regimes for early T-cell recognition: The\n  speed, energy, accuracy trade-off in kinetic proofreading and adaptive\n  sorting", "comments": "14 pages, 8 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0202331", "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the immune system, T cells can quickly discriminate between foreign and\nself ligands with high accuracy. There is evidence that T-cells achieve this\nremarkable performance utilizing a network architecture based on a\ngeneralization of kinetic proofreading (KPR). KPR-based mechanisms actively\nconsume energy to increase the specificity beyond what is possible in\nequilibrium.An important theoretical question that arises is to understand the\ntrade-offs and fundamental limits on accuracy, speed, and dissipation (energy\nconsumption) in KPR and its generalization. Here, we revisit this question\nthrough numerical simulations where we simultaneously measure the speed,\naccuracy, and energy consumption of the KPR and adaptive sorting networks for\ndifferent parameter choices. Our simulations highlight the existence of a\n'feasible operating regime' in the speed-energy-accuracy plane where T-cells\ncan quickly differentiate between foreign and self ligands at reasonable energy\nexpenditure. We give general arguments for why we expect this feasible\noperating regime to be a generic property of all KPR-based biochemical networks\nand discuss implications for our understanding of the T cell receptor circuit.\n", "versions": [{"version": "v1", "created": "Thu, 9 Mar 2017 18:56:53 GMT"}, {"version": "v2", "created": "Thu, 4 May 2017 17:47:41 GMT"}, {"version": "v3", "created": "Thu, 16 Aug 2018 19:26:48 GMT"}], "update_date": "2018-08-20", "authors_parsed": [["Cui", "Wenping", ""], ["Mehta", "Pankaj", ""]]}, {"id": "1703.04194", "submitter": "Andrew Mugler", "authors": "Amir Erez, Tommy A. Byrd, Robert M. Vogel, Gr\\'egoire Altan-Bonnet,\n  Andrew Mugler", "title": "Universality of biochemical feedback and its application to immune cells", "comments": "11 pages, 7 figures", "journal-ref": "Phys. Rev. E 99, 022422 (2019)", "doi": "10.1103/PhysRevE.99.022422", "report-no": null, "categories": "physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We map a class of well-mixed stochastic models of biochemical feedback in\nsteady state to the mean-field Ising model near the critical point. The mapping\nprovides an effective temperature, magnetic field, order parameter, and heat\ncapacity that can be extracted from biological data without fitting or\nknowledge of the underlying molecular details. We demonstrate this procedure on\nfluorescence data from mouse T cells, which reveals distinctions between how\nthe cells respond to different drugs. We also show that the heat capacity\nallows inference of absolute molecule number from fluorescence intensity. We\nexplain this result in terms of the underlying fluctuations and demonstrate the\ngenerality of our work.\n", "versions": [{"version": "v1", "created": "Sun, 12 Mar 2017 23:08:12 GMT"}, {"version": "v2", "created": "Tue, 25 Jul 2017 01:58:00 GMT"}, {"version": "v3", "created": "Fri, 6 Oct 2017 19:51:28 GMT"}, {"version": "v4", "created": "Thu, 9 Aug 2018 17:09:42 GMT"}, {"version": "v5", "created": "Thu, 7 Feb 2019 01:45:46 GMT"}], "update_date": "2019-03-06", "authors_parsed": [["Erez", "Amir", ""], ["Byrd", "Tommy A.", ""], ["Vogel", "Robert M.", ""], ["Altan-Bonnet", "Grégoire", ""], ["Mugler", "Andrew", ""]]}, {"id": "1703.06496", "submitter": "Mona Arabzadeh", "authors": "Mona Arabzadeh, Morteza Saheb Zamani, Mehdi Sedighi, Sayed-Amir\n  Marashi", "title": "A Graph-Based Approach to Analyze Flux-Balanced Pathways in Metabolic\n  Networks", "comments": "23 pages, 7 figures, 2 tables", "journal-ref": "BioSystems,165,40--51,(2018)", "doi": "10.1016/j.biosystems.2017.12.001", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An Elementary Flux Mode (EFM) is a pathway with minimum set of reactions that\nare functional in steady-state constrained space. Due to the high computational\ncomplexity of calculating EFMs, different approaches have been proposed to find\nthese flux-balanced pathways. In this paper, an approach to find a subset of\nEFMs is proposed based on a graph data model. The given metabolic network is\nmapped to the graph model and decisions for reaction inclusion can be made\nbased on metabolites and their associated reactions. This notion makes the\napproach more convenient to categorize the output pathways. Implications of the\nproposed method on metabolic networks are discussed.\n", "versions": [{"version": "v1", "created": "Sun, 19 Mar 2017 19:37:51 GMT"}, {"version": "v2", "created": "Sun, 4 Feb 2018 14:19:11 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Arabzadeh", "Mona", ""], ["Zamani", "Morteza Saheb", ""], ["Sedighi", "Mehdi", ""], ["Marashi", "Sayed-Amir", ""]]}, {"id": "1703.06532", "submitter": "Chen Jia", "authors": "Chen Jia, Peng Xie, Min Chen, Michael Q. Zhang", "title": "Stochastic fluctuations can reveal the feedback signs of gene regulatory\n  networks at the single-molecule level", "comments": "13 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the relationship between spontaneous stochastic fluctuations\nand the topology of the underlying gene regulatory network is of fundamental\nimportance for the study of single-cell stochastic gene expression. Here by\nsolving the analytical steady-state distribution of the protein copy number in\na general kinetic model of stochastic gene expression with nonlinear feedback\nregulation, we reveal the relationship between stochastic fluctuations and\nfeedback topology at the single-molecule level, which provides novel insights\ninto how and to what extent a feedback loop can enhance or suppress molecular\nfluctuations. Based on such relationship, we also develop an effective method\nto extract the topological information of a gene regulatory network from\nsingle-cell gene expression data. The theory is demonstrated by numerical\nsimulations and, more importantly, validated quantitatively by single-cell data\nanalysis of a synthetic gene circuit integrated in human kidney cells.\n", "versions": [{"version": "v1", "created": "Sun, 19 Mar 2017 22:46:36 GMT"}, {"version": "v2", "created": "Tue, 30 May 2017 10:14:25 GMT"}, {"version": "v3", "created": "Mon, 24 Jul 2017 06:53:32 GMT"}, {"version": "v4", "created": "Tue, 24 Oct 2017 17:55:45 GMT"}], "update_date": "2017-10-25", "authors_parsed": [["Jia", "Chen", ""], ["Xie", "Peng", ""], ["Chen", "Min", ""], ["Zhang", "Michael Q.", ""]]}, {"id": "1703.07461", "submitter": "Francisco Javier Arag\\'on Artacho", "authors": "Masoud Ahookhosh, Francisco J. Arag\\'on Artacho, Ronan M.T. Fleming,\n  Phan T. Vuong", "title": "Local convergence of the Levenberg-Marquardt method under H\\\"{o}lder\n  metric subregularity", "comments": "30 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe and analyse Levenberg-Marquardt methods for solving systems of\nnonlinear equations. More specifically, we propose an adaptive formula for the\nLevenberg-Marquardt parameter and analyse the local convergence of the method\nunder H\\\"{o}lder metric subregularity of the function defining the equation and\nH\\\"older continuity of its gradient mapping. Further, we analyse the local\nconvergence of the method under the additional assumption that the\n\\L{}ojasiewicz gradient inequality holds. We finally report encouraging\nnumerical results confirming the theoretical findings for the problem of\ncomputing moiety conserved steady states in biochemical reaction networks. This\nproblem can be cast as finding a solution of a system of nonlinear equations,\nwhere the associated mapping satisfies the \\L{}ojasiewicz gradient inequality\nassumption.\n", "versions": [{"version": "v1", "created": "Tue, 21 Mar 2017 22:50:34 GMT"}, {"version": "v2", "created": "Tue, 7 Aug 2018 18:13:20 GMT"}, {"version": "v3", "created": "Thu, 21 Feb 2019 18:32:29 GMT"}], "update_date": "2019-02-22", "authors_parsed": [["Ahookhosh", "Masoud", ""], ["Artacho", "Francisco J. Aragón", ""], ["Fleming", "Ronan M. T.", ""], ["Vuong", "Phan T.", ""]]}, {"id": "1703.08934", "submitter": "Shizuo Kaji", "authors": "Adrien Faur\\'e, Shizuo Kaji", "title": "A circuit-preserving mapping from multilevel to Boolean dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many discrete models of biological networks rely exclusively on Boolean\nvariables and many tools and theorems are available for analysis of strictly\nBoolean models. However, multilevel variables are often required to account for\nthreshold effects, in which knowledge of the Boolean case does not generalise\nstraightforwardly. This motivated the development of conversion methods for\nmultilevel to Boolean models. In particular, Van Ham's method has been shown to\nyield a one-to-one, neighbour and regulation preserving dynamics, making it the\nde facto standard approach to the problem. However, Van Ham's method has\nseveral drawbacks: most notably, it introduces vast regions of \"non-admissible\"\nstates that have no counterpart in the multilevel, original model. This raises\nspecial difficulties for the analysis of interaction between variables and\ncircuit functionality, which is believed to be central to the understanding of\ndynamic properties of logical models. Here, we propose a new multilevel to\nBoolean conversion method, with software implementation. Contrary to Van Ham's,\nour method doesn't yield a one-to-one transposition of multilevel trajectories,\nhowever, it maps each and every Boolean state to a specific multilevel state,\nthus getting rid of the non-admissible regions and, at the expense of\n(apparently) more complicated, \"parallel\" trajectories. One of the prominent\nfeatures of our method is that it preserves dynamics and interaction of\nvariables in a certain manner. As a demonstration of the usability of our\nmethod, we apply it to construct a new Boolean counter-example to the\nwell-known conjecture that a local negative circuit is necessary to generate\nsustained oscillations. This result illustrates the general relevance of our\nmethod for the study of multilevel logical models.\n", "versions": [{"version": "v1", "created": "Mon, 27 Mar 2017 05:25:22 GMT"}, {"version": "v2", "created": "Mon, 8 May 2017 07:07:49 GMT"}], "update_date": "2017-05-09", "authors_parsed": [["Fauré", "Adrien", ""], ["Kaji", "Shizuo", ""]]}, {"id": "1703.10058", "submitter": "Srividya Iyer-Biswas", "authors": "Farshid Jafarpour, Michael Vennettilli, and Srividya Iyer-Biswas", "title": "Biological timekeeping in the presence of stochasticity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.soft cond-mat.stat-mech q-bio.CB q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Causal ordering of key events in the cell cycle is essential for proper\nfunctioning of an organism. Yet, it remains a mystery how a specific temporal\nprogram of events is maintained despite ineluctable stochasticity in the\nbiochemical dynamics which dictate timing of cellular events. We propose that\nif a change of cell fate is triggered by the {\\em time-integral} of the\nunderlying stochastic biochemical signal, rather than the original signal, then\na dramatic improvement in temporal specificity results. Exact analytical\nresults for stochastic models of hourglass-timers and pendulum-clocks, two\nimportant paradigms for biological timekeeping, elucidate how temporal\nspecificity is achieved through time-integration. En route, we introduce a\nnatural representation for time-integrals of stochastic processes, provide an\nanalytical prescription for evaluating corresponding first-passage-time\ndistributions, and uncover a mechanism by which a population of identical cells\ncan spontaneously bifurcate into subpopulations of early and late responders,\ndepending on hierarchy of timescales in the dynamics. Moreover, our approach\nreveals how time-integration of stochastic signals may be realized\nbiochemically, through a simple chemical reaction scheme.\n", "versions": [{"version": "v1", "created": "Tue, 28 Mar 2017 15:55:56 GMT"}], "update_date": "2017-03-30", "authors_parsed": [["Jafarpour", "Farshid", ""], ["Vennettilli", "Michael", ""], ["Iyer-Biswas", "Srividya", ""]]}, {"id": "1703.10307", "submitter": "Takashi Okada", "authors": "Takashi Okada and Atsushi Mochizuki", "title": "Sensitivity and Network Topology in Chemical Reaction Systems", "comments": "14 pages, 13 figures", "journal-ref": "Phys. Rev. E 96, 022322 (2017)", "doi": "10.1103/PhysRevE.96.022322", "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In living cells, biochemical reactions are catalyzed by specific enzymes and\nconnect to one another by sharing substrates and products, forming complex\nnetworks. In our previous studies, we established a framework determining the\nresponses to enzyme perturbations only from network topology, and then proved a\ntheorem, called the law of localization, explaining response patterns in terms\nof network topology. In this paper, we generalize these results to reaction\nnetworks with conserved concentrations, which allows us to study any reaction\nsystems. We also propose novel network characteristics quantifying robustness.\nWe compare E. coli metabolic network with randomly rewired networks, and find\nthat the robustness of the E. coli network is significantly higher than that of\nthe random networks.\n", "versions": [{"version": "v1", "created": "Thu, 30 Mar 2017 04:13:20 GMT"}, {"version": "v2", "created": "Tue, 5 Sep 2017 01:37:00 GMT"}], "update_date": "2017-09-06", "authors_parsed": [["Okada", "Takashi", ""], ["Mochizuki", "Atsushi", ""]]}, {"id": "1703.10958", "submitter": "Ushasi Roy", "authors": "Ushasi Roy and Manoj Gopalakrishnan", "title": "Ultrasensitivity and Fluctuations in the Barkai-Leibler Model of\n  Chemotaxis Receptors in {\\it Escherichia coli}", "comments": "Accepted in PLoS One", "journal-ref": null, "doi": "10.1371/journal.pone.0175309", "report-no": null, "categories": "physics.bio-ph cond-mat.soft cond-mat.stat-mech q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A stochastic version of the Barkai-Leibler model of chemotaxis receptors in\n{\\it E. coli} is studied here to elucidate the effects of intrinsic network\nnoise in their conformational dynamics. It was originally proposed to explain\nthe robust and near-perfect adaptation of {\\it E. coli} observed across a wide\nrange of spatially uniform attractant/repellent (ligand) concentrations. A\nreceptor is either active or inactive and can stochastically switch between the\ntwo states. Enzyme CheR methylates inactive receptors while CheB demethylates\nactive ones and the probability for it to be active depends on its level of\nmethylation and ligandation. A simple version of the model with two methylation\nsites per receptor (M=2) shows zero-order ultrasensitivity (ZOU) akin to the\nclassical 2-state model of covalent modification studied by Goldbeter and\nKoshland (GK). For extremely small and large ligand concentrations, the system\nreduces to two 2-state GK modules. A quantitative measure of the spontaneous\nfluctuations in activity (variance) estimated mathematically under linear noise\napproximation (LNA) is found to peak near the ZOU transition. The variance is a\nweak, non-monotonic and decreasing functions of ligand and receptor\nconcentrations. Gillespie simulations for M=2 show excellent agreement with\nanalytical results obtained under LNA. Numerical results for M=2, 3 and 4 show\nZOU in mean activity; the variance is found to be smaller for larger M. The\nmagnitude of receptor noise deduced from available experimental data is\nconsistent with our predictions. A simple analysis of the downstream signaling\npathway shows that this noise is large enough to have a beneficial effect on\nthe motility of the organism. The response of mean receptor activity to small\ntime-dependent changes in the external ligand concentration, computed within\nlinear response theory, is found to have a bilobe form.\n", "versions": [{"version": "v1", "created": "Fri, 31 Mar 2017 15:50:32 GMT"}], "update_date": "2017-07-05", "authors_parsed": [["Roy", "Ushasi", ""], ["Gopalakrishnan", "Manoj", ""]]}]