[{"id": "1704.01205", "submitter": "Wayne Hayes", "authors": "Wayne B. Hayes, Nil Mamano", "title": "SANA NetGO: A combinatorial approach to using Gene Ontology (GO) terms\n  to score network alignments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gene Ontology (GO) terms are frequently used to score alignments between\nprotein-protein interaction (PPI) networks. Methods exist to measure the GO\nsimilarity between two proteins in isolation, but pairs of proteins in a\nnetwork alignment are not isolated: each pairing is implicitly dependent upon\nevery other pairing via the alignment itself. Current methods fail to take into\naccount the frequency of GO terms across the networks, and attempt to account\nfor common GO terms in an ad hoc fashion by imposing arbitrary rules on when to\n\"allow\" GO terms based on their location in the GO hierarchy, rather than using\nreadily available frequency information in the PPI networks themselves. Here we\ndevelop a new measure, NetGO, that naturally weighs infrequent, informative GO\nterms more heavily than frequent, less informative GO terms, without requiring\narbitrary cutoffs. In particular, NetGO down-weights the score of frequent GO\nterms according to their frequency in the networks being aligned. This is a\nglobal measure applicable only to alignments, independent of pairwise GO\nmeasures, in the same sense that the edge-based EC or S3 scores are global\nmeasures of topological similarity independent of pairwise topological\nsimilarities. We demonstrate the superiority of NetGO by creating alignments of\npredetermined quality based on homologous pairs of nodes and show that NetGO\ncorrelates with alignment quality much better than any existing GO-based\nalignment measures. We also demonstrate that NetGO provides a measure of\ntaxonomic similarity between species, consistent with existing taxonomic\nmeasures--a feature not shared with existing GO-based network alignment\nmeasures. Finally, we re-score alignments produced by almost a dozen aligners\nfrom a previous study and show that NetGO does a better job than existing\nmeasures at separating good alignments from bad ones.\n", "versions": [{"version": "v1", "created": "Tue, 4 Apr 2017 22:22:37 GMT"}], "update_date": "2017-04-06", "authors_parsed": [["Hayes", "Wayne B.", ""], ["Mamano", "Nil", ""]]}, {"id": "1704.01221", "submitter": "Shawn Gu", "authors": "Shawn Gu, John Johnson, Fazle E. Faisal, Tijana Milenkovic", "title": "From homogeneous to heterogeneous network alignment via colored\n  graphlets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network alignment (NA) compares networks with the goal of finding a node\nmapping that uncovers highly similar (conserved) network regions. Existing NA\nmethods are homogeneous, i.e., they can deal only with networks containing\nnodes and edges of one type. Due to increasing amounts of heterogeneous network\ndata with nodes or edges of different types, we extend three recent\nstate-of-the-art homogeneous NA methods, WAVE, MAGNA++, and SANA, to allow for\nheterogeneous NA for the first time. We introduce several algorithmic\nnovelties. Namely, these existing methods compute homogeneous graphlet-based\nnode similarities and then find high-scoring alignments with respect to these\nsimilarities, while simultaneously maximizing the amount of conserved edges.\nInstead, we extend homogeneous graphlets to their heterogeneous counterparts,\nwhich we then use to develop a new measure of heterogeneous node similarity.\nAlso, we extend $S^3$, a state-of-the-art measure of edge conservation for\nhomogeneous NA, to its heterogeneous counterpart. Then, we find high-scoring\nalignments with respect to our heterogeneous node similarity and edge\nconservation measures. In evaluations on synthetic and real-world biological\nnetworks, our proposed heterogeneous NA methods lead to higher-quality\nalignments and better robustness to noise in the data than their homogeneous\ncounterparts. The software and data from this work is available upon request.\n", "versions": [{"version": "v1", "created": "Tue, 4 Apr 2017 23:49:48 GMT"}, {"version": "v2", "created": "Mon, 26 Feb 2018 20:48:45 GMT"}, {"version": "v3", "created": "Wed, 28 Mar 2018 19:24:12 GMT"}], "update_date": "2018-03-30", "authors_parsed": [["Gu", "Shawn", ""], ["Johnson", "John", ""], ["Faisal", "Fazle E.", ""], ["Milenkovic", "Tijana", ""]]}, {"id": "1704.01733", "submitter": "Manoj Gopalkrishnan", "authors": "Muppirala Viswa Virinchi, Abhishek Behera, Manoj Gopalkrishnan", "title": "A stochastic molecular scheme for an artificial cell to infer its\n  environment from partial observations", "comments": "12 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech cs.IT math.IT nlin.AO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion of entropy is shared between statistics and thermodynamics, and is\nfundamental to both disciplines. This makes statistical problems particularly\nsuitable for reaction network implementations. In this paper we show how to\nperform a statistical operation known as Information Projection or E projection\nwith stochastic mass-action kinetics. Our scheme encodes desired conditional\ndistributions as the equilibrium distributions of reaction systems. To our\nknowledge this is a first scheme to exploit the inherent stochasticity of\nreaction networks for information processing. We apply this to the problem of\nan artificial cell trying to infer its environment from partial observations.\n", "versions": [{"version": "v1", "created": "Thu, 6 Apr 2017 07:42:50 GMT"}], "update_date": "2017-04-07", "authors_parsed": [["Virinchi", "Muppirala Viswa", ""], ["Behera", "Abhishek", ""], ["Gopalkrishnan", "Manoj", ""]]}, {"id": "1704.02189", "submitter": "Steffen Waldherr", "authors": "Steffen Waldherr and Henning Lindhorst", "title": "Optimality in cellular storage via the Pontryagin Maximum Principle", "comments": "Accepted for 20th World Congress of the International Federation of\n  Automatic Control, Toulouse, France, 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an optimal control problem arising from a resource allocation\nproblem in cellular metabolism. A minimalistic model that describes the\nproduction of enzymatic vs. non-enzymatic biomass components from a single\nnutrient source is introduced. The basic growth modes with this model are\nlinear growth, where only the non-enzymatic component is produced, and\nexponential growth with only enzymatic components being produced. Using\nPontryagin's maximum principle, we derive the optimal growth trajectory\ndepending on the model's parameters. It turns out that depending on the\nparameters, either a single growth mode is optimal, or otherwise the optimal\nsolution is a concatenation of exponential growth with linear growth.\nImportantly, on the short time scale, the choice of growth mode depends only on\ncatalytic rate constants and biomass weights of the two component types,\nwhereas on longer time scales, where the nutrient amount becomes limiting, also\nthe yield coefficients play a role.\n", "versions": [{"version": "v1", "created": "Fri, 7 Apr 2017 11:22:45 GMT"}], "update_date": "2017-04-10", "authors_parsed": [["Waldherr", "Steffen", ""], ["Lindhorst", "Henning", ""]]}, {"id": "1704.02564", "submitter": "Yoshihiko Hasegawa", "authors": "Yoshihiko Hasegawa", "title": "Multi-dimensional biochemical information processing of dynamical\n  patterns", "comments": "12 pages, 7 figures", "journal-ref": "Phys. Rev. E 97, 022401 (2018)", "doi": "10.1103/PhysRevE.97.022401", "report-no": null, "categories": "physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cells receive signaling molecules by receptors and relay information via\nsensory networks so that they can respond properly depending on the type of\nsignal. Recent studies have shown that cells can extract multi-dimensional\ninformation from dynamical concentration patterns of signaling molecules. We\nherein study how biochemical systems can process multi-dimensional information\nembedded in dynamical patterns. We model the decoding networks by linear\nresponse functions, and optimize the functions with the calculus of variations\nto maximize the mutual information between patterns and output. We find that,\nwhen the noise intensity is lower, decoders with different linear response\nfunctions, i.e., distinct decoders, can extract much information. However, when\nthe noise intensity is higher, distinct decoders do not provide the maximum\namount of information. This indicates that, when transmitting information by\ndynamical patterns, embedding information in multiple patterns is not optimal\nwhen the noise intensity is very large. Furthermore, we explore the biochemical\nimplementations of these decoders using control theory and demonstrate that\nthese decoders can be implemented biochemically through the modification of\ncascade-type networks, which are prevalent in actual signaling pathways.\n", "versions": [{"version": "v1", "created": "Sun, 9 Apr 2017 06:03:31 GMT"}, {"version": "v2", "created": "Thu, 27 Apr 2017 04:53:13 GMT"}, {"version": "v3", "created": "Thu, 25 Jan 2018 14:19:22 GMT"}], "update_date": "2018-02-14", "authors_parsed": [["Hasegawa", "Yoshihiko", ""]]}, {"id": "1704.03353", "submitter": "Peter Kekenes-Huskey", "authors": "Bradley D. Stewart, Caitlin E. Scott, Thomas P. McCoy, Guo Yin, Florin\n  Despa, Sanda Despa, Peter M. Kekenes-Huskey", "title": "Characterization of amylin-induced calcium dysregulation in rat\n  ventricular cardiomyocytes", "comments": "22pages, 5 figures + supplemental data", "journal-ref": null, "doi": "10.1016/j.ceca.2017.11.006", "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hyperamylinemia, a condition characterized by above-normal blood levels of\nthe pancreas-derived peptide amylin, accompanies obesity and precedes type II\ndiabetes. Human amylin oligomerizes easily and can deposit in the pancreas,\nbrain, and heart, where they have been associated with calcium dysregulation.\nIn the heart, accumulating evidence suggests that human amylin oligomers form\nmodestly cation-selective, voltage-dependent ion channels that embed in the\ncell sarcolemma (SL). The oligomers increase membrane conductance in a\ndose-dependent manner, which is correlated with elevated cytosolic calcium\n(Ca2+). Our core hypothesis therefore is that non-selective inward Ca2+\nconduction afforded by human amylin oligomers increase cytosolic and\nsarcoplasmic reticulum (SR) Ca2+ load, which thereby magnifies intracellular\nCa2+ transients. Questions remain however regarding the mechanism of\namylin-induced Ca2+ dysregulation, including whether enhanced SL Ca2+ influx is\nsufficient to elevate cytosolic Ca2+ load, and if so, how might amplified Ca2+\ntransients perturb Ca2+-dependent cardiac pathways. To investigate these\nquestions, we modified a computational model of cardiomyocytes Ca2+ signaling\nto reflect experimentally-measured changes in SL membrane permeation and\ndecreased Sarcoplasmic/endoplasmic reticulum calcium ATPase (SERCA) function\nstemming from acute and transgenic human amylin peptide exposure. With this\nmodel, we confirmed the hypothesis that increasing SL permeation alone was\nsufficient to enhance Ca2+ transient amplitudes. Our model indicated that\namplified cytosolic transients are driven by increased Ca2+ loading of the\nsarcoplasmic reticulum and may contribute to the Ca2+-dependent activation of\ncalmodulin. These findings suggest that increased membrane permeation induced\nby deposition of amylin oligomers contributes to Ca2+ dysregulation in\npre-diabetes.\n", "versions": [{"version": "v1", "created": "Tue, 11 Apr 2017 15:22:45 GMT"}], "update_date": "2018-03-16", "authors_parsed": [["Stewart", "Bradley D.", ""], ["Scott", "Caitlin E.", ""], ["McCoy", "Thomas P.", ""], ["Yin", "Guo", ""], ["Despa", "Florin", ""], ["Despa", "Sanda", ""], ["Kekenes-Huskey", "Peter M.", ""]]}, {"id": "1704.05343", "submitter": "Yijie Wang", "authors": "Yijie Wang, Dong-Yeon Cho, Hangnoh Lee, Justin Fear, Brian Oliver, and\n  Teresa M Przytycka", "title": "NetREX: Network Rewiring using EXpression - Towards Context Specific\n  Regulatory Networks", "comments": "RECOMB 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding gene regulation is a fundamental step towards understanding of\nhow cells function and respond to environmental cues and perturbations. An\nimportant step in this direction is to infer the transcription factor-gene\nregulatory network (GRN). However gene regulatory networks are typically\nconstructed disregarding the fact that regulatory programs are conditioned on\ntissue type, developmental stage, sex, and other factors. Collecting multitude\nof features required for a reliable construction of GRNs such as physical\nfeatures and functional features for every context of interest is costly.\nTherefore we need methods that is able to use the knowledge of a\ncontext-agnostic network for construction of a context specific regulatory\nnetwork.\n  To address this challenge we developed a computational approach that uses\ncontext specific expression data and a GRN constructed in a different but\nrelated context to construct a context specific GRN. Our method, NetREX, is\ninspired by network component analysis that estimates TF activities and their\ninfluences on target genes given predetermined topology of a TF-gene network.\nTo predict a network under a different condition, NetREX removes the\nrestriction that the topology of the TF-gene network is fixed and allows for\nadding and removing edges to that network. To solve the corresponding\noptimization problem, we provide a general mathematical framework allowing use\nof the recently proposed PALM technique and develop a convergent algorithm.\n  We tested our NetREX on simulated data and subsequently applied it to gene\nexpression data in adult females from Drosophila deletion (DrosDel) panel. The\nnetworks predicted by NetREX showed higher biological consistency than\nalternative approaches. In addition, we used the list of recently identified\ntargets of the Doublesex (DSX) transcription factor to demonstrate the\npredictive power of our method.\n", "versions": [{"version": "v1", "created": "Tue, 18 Apr 2017 13:58:50 GMT"}, {"version": "v2", "created": "Mon, 24 Apr 2017 14:55:24 GMT"}], "update_date": "2017-04-25", "authors_parsed": [["Wang", "Yijie", ""], ["Cho", "Dong-Yeon", ""], ["Lee", "Hangnoh", ""], ["Fear", "Justin", ""], ["Oliver", "Brian", ""], ["Przytycka", "Teresa M", ""]]}, {"id": "1704.05628", "submitter": "Jae Kyoung Kim", "authors": "Jae Kyoung Kim, Grzegorz A. Rempala, Hye-Won Kang", "title": "Reduction for stochastic biochemical reaction networks with multiscale\n  conservations", "comments": "27 pages, 5 figures, This pre-print has been accepted for publication\n  in SIAM Multiscale Modeling & Simulation. The final copyedited version of\n  this paper will be available at https://www.siam.org/journals/mms.php", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.PR physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biochemical reaction networks frequently consist of species evolving on\nmultiple timescales. Stochastic simulations of such networks are often\ncomputationally challenging and therefore various methods have been developed\nto obtain sensible stochastic approximations on the timescale of interest. One\nof the rigorous and popular approaches is the multiscale approximation method\nfor continuous time Markov processes. In this approach, by scaling species\nabundances and reaction rates, a family of processes parameterized by a scaling\nparameter is defined. The limiting process of this family is then used to\napproximate the original process. However, we find that such approximations\nbecome inaccurate when combinations of species with disparate abundances either\nconstitute conservation laws or form virtual slow auxiliary species. To obtain\nmore accurate approximation in such cases, we propose here an appropriate\nmodification of the original method.\n", "versions": [{"version": "v1", "created": "Wed, 19 Apr 2017 06:49:59 GMT"}], "update_date": "2017-04-20", "authors_parsed": [["Kim", "Jae Kyoung", ""], ["Rempala", "Grzegorz A.", ""], ["Kang", "Hye-Won", ""]]}, {"id": "1704.06530", "submitter": "Qixia Yuan", "authors": "Andrzej Mizera and Jun Pang and Hongyang Qu and Qixia Yuan", "title": "Taming Asynchrony for Attractor Detection in Large Boolean Networks\n  (Technical Report)", "comments": "28 pages, version 3 (correct a mistake in Table 2)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.DC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Boolean networks is a well-established formalism for modelling biological\nsystems. A vital challenge for analysing a Boolean network is to identify all\nthe attractors. This becomes more challenging for large asynchronous Boolean\nnetworks, due to the asynchronous updating scheme. Existing methods are\nprohibited due to the well-known state-space explosion problem in large Boolean\nnetworks. In this paper, we tackle this challenge by proposing a SCC-based\ndecomposition method. We prove the correctness of our proposed method and\ndemonstrate its efficiency with two real-life biological networks.\n", "versions": [{"version": "v1", "created": "Thu, 20 Apr 2017 16:52:26 GMT"}, {"version": "v2", "created": "Wed, 7 Jun 2017 08:39:57 GMT"}, {"version": "v3", "created": "Tue, 13 Jun 2017 13:28:02 GMT"}], "update_date": "2017-06-14", "authors_parsed": [["Mizera", "Andrzej", ""], ["Pang", "Jun", ""], ["Qu", "Hongyang", ""], ["Yuan", "Qixia", ""]]}, {"id": "1704.06548", "submitter": "Jason T. L. Wang", "authors": "Yasser Abduallah, Turki Turki, Kevin Byron, Zongxuan Du, Miguel\n  Cervantes-Cervantes, Jason T. L. Wang", "title": "MapReduce Algorithms for Inferring Gene Regulatory Networks from\n  Time-Series Microarray Data Using an Information-Theoretic Approach", "comments": "19 pages, 5 figures", "journal-ref": "BioMed Research International, 2017", "doi": null, "report-no": null, "categories": "q-bio.MN cs.CE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gene regulation is a series of processes that control gene expression and its\nextent. The connections among genes and their regulatory molecules, usually\ntranscription factors, and a descriptive model of such connections, are known\nas gene regulatory networks (GRNs). Elucidating GRNs is crucial to understand\nthe inner workings of the cell and the complexity of gene interactions. To\ndate, numerous algorithms have been developed to infer gene regulatory\nnetworks. However, as the number of identified genes increases and the\ncomplexity of their interactions is uncovered, networks and their regulatory\nmechanisms become cumbersome to test. Furthermore, prodding through\nexperimental results requires an enormous amount of computation, resulting in\nslow data processing. Therefore, new approaches are needed to expeditiously\nanalyze copious amounts of experimental data resulting from cellular GRNs. To\nmeet this need, cloud computing is promising as reported in the literature.\nHere we propose new MapReduce algorithms for inferring gene regulatory networks\non a Hadoop cluster in a cloud environment. These algorithms employ an\ninformation-theoretic approach to infer GRNs using time-series microarray data.\nExperimental results show that our MapReduce program is much faster than an\nexisting tool while achieving slightly better prediction accuracy than the\nexisting tool.\n", "versions": [{"version": "v1", "created": "Wed, 15 Mar 2017 04:42:35 GMT"}], "update_date": "2017-04-24", "authors_parsed": [["Abduallah", "Yasser", ""], ["Turki", "Turki", ""], ["Byron", "Kevin", ""], ["Du", "Zongxuan", ""], ["Cervantes-Cervantes", "Miguel", ""], ["Wang", "Jason T. L.", ""]]}, {"id": "1704.07013", "submitter": "Himadri Samanta", "authors": "Himadri S. Samanta, Michael Hinczewski and D. Thirumalai", "title": "Optimal information transfer in enzymatic networks: A field theoretic\n  formulation", "comments": null, "journal-ref": "Phys. Rev. E 96, 012406 (2017)", "doi": "10.1103/PhysRevE.96.012406", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.soft math-ph math.MP q-bio.CB q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Signaling in enzymatic networks is typically triggered by environmental\nfluctuations, resulting in a series of stochastic chemical reactions, leading\nto corruption of the signal by noise. For example, information flow is\ninitiated by binding of extracellular ligands to receptors, which is\ntransmitted through a {cascade involving} kinase-phosphatase stochastic\nchemical reactions. For a class of such networks, we develop a general\nfield-theoretic approach in order to calculate the error in signal transmission\nas a function of an appropriate control variable. Application of the theory to\na simple push-pull network, a module in the kinase-phosphatase cascade,\nrecovers the exact results for error in signal transmission previously obtained\nusing umbral calculus (Phys. Rev. X., {\\bf 4}, 041017 (2014)). We illustrate\nthe generality of the theory by studying the minimal errors in noise reduction\nin a reaction cascade with two connected push-pull modules. Such a cascade\nbehaves as an effective {three-species} network with a pseudo intermediate. In\nthis case, optimal information transfer, resulting in the smallest square of\nthe error between the input and output, occurs with a time delay, which is\ngiven by the inverse of the decay rate of the pseudo intermediate. There are\nsubstantial deviations between simulations and predictions of the linear theory\nin error in signal propagation in an enzymatic push-pull network for a certain\nrange of parameters. Inclusion of second order perturbative corrections shows\nthat differences between simulations and theoretical predictions are minimized.\nOur study establishes that {a} field theoretic formulation {of} stochastic\nbiological {signaling offers} a systematic way to understand error propagation\nin networks of arbitrary complexity.\n", "versions": [{"version": "v1", "created": "Mon, 24 Apr 2017 01:25:57 GMT"}], "update_date": "2017-07-19", "authors_parsed": [["Samanta", "Himadri S.", ""], ["Hinczewski", "Michael", ""], ["Thirumalai", "D.", ""]]}, {"id": "1704.07291", "submitter": "Michael Margaliot", "authors": "Eyal Weiss and Michael Margaliot and Guy Even", "title": "Minimal Controllability of Conjunctive Boolean Networks is NP-Complete", "comments": null, "journal-ref": "Automatica 92 (2018): 56-62", "doi": "10.1016/j.automatica.2018.02.014", "report-no": null, "categories": "cs.DS cs.CC cs.SY math.OC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a conjunctive Boolean network (CBN) with $n$ state-variables, we\nconsider the problem of finding a minimal set of state-variables to directly\naffect with an input so that the resulting conjunctive Boolean control network\n(CBCN) is controllable. We give a necessary and sufficient condition for\ncontrollability of a CBCN; an $O(n^2)$-time algorithm for testing\ncontrollability; and prove that nonetheless the minimal controllability problem\nfor CBNs is NP-hard.\n", "versions": [{"version": "v1", "created": "Fri, 21 Apr 2017 04:26:23 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Weiss", "Eyal", ""], ["Margaliot", "Michael", ""], ["Even", "Guy", ""]]}, {"id": "1704.07722", "submitter": "Yutaka Hori", "authors": "Yuta Sakurai, Yutaka Hori", "title": "A Convex Approach to Steady State Moment Analysis for Stochastic\n  Chemical Reactions", "comments": null, "journal-ref": "Proceedings of the IEEE 56th Annual Conference on Decision and\n  Control, pp. 1206-1211, 2017", "doi": "10.1109/CDC.2017.8263820", "report-no": null, "categories": "q-bio.MN cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Model-based prediction of stochastic noise in biomolecular reactions often\nresorts to approximation with unknown precision. As a result, unexpected\nstochastic fluctuation causes a headache for the designers of biomolecular\ncircuits. This paper proposes a convex optimization approach to quantifying the\nsteady state moments of molecular copy counts with theoretical rigor. We show\nthat the stochastic moments lie in a convex semi-algebraic set specified by\nlinear matrix inequalities. Thus, the upper and the lower bounds of some\nmoments can be computed by a semidefinite program. Using a protein dimerization\nprocess as an example, we demonstrate that the proposed method can precisely\npredict the mean and the variance of the copy number of the monomer protein.\n", "versions": [{"version": "v1", "created": "Tue, 25 Apr 2017 14:49:42 GMT"}, {"version": "v2", "created": "Mon, 6 Aug 2018 05:53:59 GMT"}], "update_date": "2018-08-07", "authors_parsed": [["Sakurai", "Yuta", ""], ["Hori", "Yutaka", ""]]}, {"id": "1704.08087", "submitter": "Andrea De Martino", "authors": "Daniele De Martino, Andrea De Martino", "title": "Constraint-based inverse modeling of metabolic networks: a proof of\n  concept", "comments": "4 pages, comments welcome", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of inferring the probability distribution of flux\nconfigurations in metabolic network models from empirical flux data. For the\nsimple case in which experimental averages are to be retrieved, data are\ndescribed by a Boltzmann-like distribution ($\\propto e^{F/T}$) where $F$ is a\nlinear combination of fluxes and the `temperature' parameter $T\\geq 0$ allows\nfor fluctuations. The zero-temperature limit corresponds to a Flux Balance\nAnalysis scenario, where an objective function ($F$) is maximized. As a test,\nwe have inverse modeled, by means of Boltzmann learning, the catabolic core of\nEscherichia coli in glucose-limited aerobic stationary growth conditions.\nEmpirical means are best reproduced when $F$ is a simple combination of biomass\nproduction and glucose uptake and the temperature is finite, implying the\npresence of fluctuations. The scheme presented here has the potential to\ndeliver new quantitative insight on cellular metabolism. Our implementation is\nhowever computationally intensive, and highlights the major role that effective\nalgorithms to sample the high-dimensional solution space of metabolic networks\ncan play in this field.\n", "versions": [{"version": "v1", "created": "Wed, 26 Apr 2017 13:02:58 GMT"}], "update_date": "2017-04-27", "authors_parsed": [["De Martino", "Daniele", ""], ["De Martino", "Andrea", ""]]}, {"id": "1704.08544", "submitter": "Borislav Hristov", "authors": "Borislav H. Hristov and Mona Singh", "title": "Network-based coverage of mutational profiles reveals cancer genes", "comments": "RECOMB 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.AI q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A central goal in cancer genomics is to identify the somatic alterations that\nunderpin tumor initiation and progression. This task is challenging as the\nmutational profiles of cancer genomes exhibit vast heterogeneity, with many\nalterations observed within each individual, few shared somatically mutated\ngenes across individuals, and important roles in cancer for both frequently and\ninfrequently mutated genes. While commonly mutated cancer genes are readily\nidentifiable, those that are rarely mutated across samples are difficult to\ndistinguish from the large numbers of other infrequently mutated genes. Here,\nwe introduce a method that considers per-individual mutational profiles within\nthe context of protein-protein interaction networks in order to identify small\nconnected subnetworks of genes that, while not individually frequently mutated,\ncomprise pathways that are perturbed across (i.e., \"cover\") a large fraction of\nthe individuals. We devise a simple yet intuitive objective function that\nbalances identifying a small subset of genes with covering a large fraction of\nindividuals. We show how to solve this problem optimally using integer linear\nprogramming and also give a fast heuristic algorithm that works well in\npractice. We perform a large-scale evaluation of our resulting method, nCOP, on\n6,038 TCGA tumor samples across 24 different cancer types. We demonstrate that\nour approach nCOP is more effective in identifying cancer genes than both\nmethods that do not utilize any network information as well as state-of-the-art\nnetwork-based methods that aggregate mutational information across individuals.\nOverall, our work demonstrates the power of combining per-individual mutational\ninformation with interaction networks in order to uncover genes functionally\nrelevant in cancers, and in particular those genes that are less frequently\nmutated.\n", "versions": [{"version": "v1", "created": "Wed, 26 Apr 2017 15:47:57 GMT"}], "update_date": "2017-04-28", "authors_parsed": [["Hristov", "Borislav H.", ""], ["Singh", "Mona", ""]]}, {"id": "1704.08586", "submitter": "Taichi Haruna", "authors": "Taichi Haruna", "title": "Evolution of Activity-Dependent Adaptive Boolean Networks towards\n  Criticality: An Analytic Approach", "comments": "17 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose new activity-dependent adaptive Boolean networks inspired by the\ncis-regulatory mechanism in gene regulatory networks. We analytically show that\nour model can be solved for stationary in-degree distribution for a wide class\nof update rules by employing the annealed approximation of Boolean network\ndynamics and that evolved Boolean networks have a preassigned average\nsensitivity that can be set independently of update rules if certain conditions\nare satisfied. In particular, when it is set to 1, our theory predicts that the\nproposed network rewiring algorithm drives Boolean networks towards\ncriticality. We verify that these analytic results agree well with numerical\nsimulations for four representative update rules. We also discuss the\nrelationship between sensitivity of update rules and stationary in-degree\ndistributions and compare it with that in real-world gene regulatory networks.\n", "versions": [{"version": "v1", "created": "Thu, 27 Apr 2017 14:13:41 GMT"}, {"version": "v2", "created": "Thu, 7 Dec 2017 15:28:59 GMT"}], "update_date": "2017-12-08", "authors_parsed": [["Haruna", "Taichi", ""]]}, {"id": "1704.08633", "submitter": "Gabor Szederkenyi", "authors": "Bernadett \\'Acs and Gergely Szlobodnyik and G\\'abor Szederk\\'enyi", "title": "A computational approach to the structural analysis of uncertain kinetic\n  systems", "comments": "23 pages, 5 figures", "journal-ref": null, "doi": "10.1016/j.cpc.2018.03.002", "report-no": null, "categories": "math.DS math.NA q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A computation-oriented representation of uncertain kinetic systems is\nintroduced and analysed in this paper. It is assumed that the monomial\ncoefficients of the ODEs belong to a polytopic set, which defines a set of\ndynamical systems for an uncertain model. An optimization-based computation\nmodel is proposed for the structural analysis of uncertain models. It is shown\nthat the so-called dense realization containing the maximum number of reactions\n(directed edges) is computable in polynomial time, and it forms a\nsuper-structure among all the possible reaction graphs corresponding to an\nuncertain kinetic model, assuming a fixed set of complexes. The set of core\nreactions present in all reaction graphs of an uncertain model is also studied.\nMost importantly, an algorithm is proposed to compute all possible reaction\ngraph structures for an uncertain kinetic model.\n", "versions": [{"version": "v1", "created": "Thu, 27 Apr 2017 15:53:01 GMT"}], "update_date": "2018-05-23", "authors_parsed": [["Ács", "Bernadett", ""], ["Szlobodnyik", "Gergely", ""], ["Szederkényi", "Gábor", ""]]}, {"id": "1704.08889", "submitter": "Yoo Ah Kim", "authors": "Phuong Dao, Yoo-Ah Kim, Damian Wojtowicz, Sanna Madan, Roded Sharan,\n  and Teresa M. Przytycka", "title": "BeWith: A Between-Within Method to Discover Relationships between Cancer\n  Modules via Integrated Analysis of Mutual Exclusivity, Co-occurrence and\n  Functional Interactions", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1005695", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The analysis of the mutational landscape of cancer, including mutual\nexclusivity and co-occurrence of mutations, has been instrumental in studying\nthe disease. We hypothesized that exploring the interplay between\nco-occurrence, mutual exclusivity, and functional interactions between genes\nwill further improve our understanding of the disease and help to uncover new\nrelations between cancer driving genes and pathways. To this end, we designed a\ngeneral framework, BeWith, for identifying modules with different combinations\nof mutation and interaction patterns. We focused on three different settings of\nthe BeWith schema: (i) BeME-WithFun in which the relations between modules are\nenriched with mutual exclusivity while genes within each module are\nfunctionally related; (ii) BeME-WithCo which combines mutual exclusivity\nbetween modules with co-occurrence within modules; and (iii) BeCo-WithMEFun\nwhich ensures co-occurrence between modules while the within module relations\ncombine mutual exclusivity and functional interactions. We formulated the\nBeWith framework using Integer Linear Programming (ILP), enabling us to find\noptimally scoring sets of modules. Our results demonstrate the utility of\nBeWith in providing novel information about mutational patterns, driver genes,\nand pathways. In particular, BeME-WithFun helped identify functionally coherent\nmodules that might be relevant for cancer progression. In addition to finding\npreviously well-known drivers, the identified modules pointed to the importance\nof the interaction between NCOR and NCOA3 in breast cancer. Additionally, an\napplication of the BeME-WithCo setting revealed that gene groups differ with\nrespect to their vulnerability to different mutagenic processes, and helped us\nto uncover pairs of genes with potentially synergetic effects, including a\npotential synergy between mutations in TP53 and metastasis related DCC gene.\n", "versions": [{"version": "v1", "created": "Fri, 28 Apr 2017 12:08:12 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Dao", "Phuong", ""], ["Kim", "Yoo-Ah", ""], ["Wojtowicz", "Damian", ""], ["Madan", "Sanna", ""], ["Sharan", "Roded", ""], ["Przytycka", "Teresa M.", ""]]}]