[{"id": "1805.01098", "submitter": "Matthieu Vignes", "authors": "Olivia Angelin-Bonnet, Patrick J. Biggs and Matthieu Vignes", "title": "Gene regulatory networks: a primer in biological processes and\n  statistical modelling", "comments": "This chapter will appear in the forthcoming book \"Gene Regulatory\n  Networks: Methods and Protocols\", published by Springer Nature", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modelling gene regulatory networks not only requires a thorough understanding\nof the biological system depicted but also the ability to accurately represent\nthis system from a mathematical perspective. Throughout this chapter, we aim to\nfamiliarise the reader with the biological processes and molecular factors at\nplay in the process of gene expression regulation.We first describe the\ndifferent interactions controlling each step of the expression process, from\ntranscription to mRNA and protein decay. In the second section, we provide\nstatistical tools to accurately represent this biological complexity in the\nform of mathematical models. Amongst other considerations, we discuss the\ntopological properties of biological networks, the application of deterministic\nand stochastic frameworks and the quantitative modelling of regulation. We\nparticularly focus on the use of such models for the simulation of expression\ndata that can serve as a benchmark for the testing of network inference\nalgorithms.\n", "versions": [{"version": "v1", "created": "Thu, 3 May 2018 03:31:16 GMT"}], "update_date": "2018-05-04", "authors_parsed": [["Angelin-Bonnet", "Olivia", ""], ["Biggs", "Patrick J.", ""], ["Vignes", "Matthieu", ""]]}, {"id": "1805.01447", "submitter": "Bryan Daniels", "authors": "Bryan C. Daniels, Hyunju Kim, Douglas Moore, Siyu Zhou, Harrison\n  Smith, Bradley Karas, Stuart A. Kauffman, and Sara I. Walker", "title": "Logic and connectivity jointly determine criticality in biological gene\n  regulatory networks", "comments": "10 pages, 7 figures", "journal-ref": "Phys. Rev. Lett. 121, 138102 (2018)", "doi": "10.1103/PhysRevLett.121.138102", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The complex dynamics of gene expression in living cells can be\nwell-approximated using Boolean networks. The average sensitivity is a natural\nmeasure of stability in these systems: values below one indicate typically\nstable dynamics associated with an ordered phase, whereas values above one\nindicate chaotic dynamics. This yields a theoretically motivated adaptive\nadvantage to being near the critical value of one, at the boundary between\norder and chaos. Here, we measure average sensitivity for 66 publicly available\nBoolean network models describing the function of gene regulatory circuits\nacross diverse living processes. We find the average sensitivity values for\nthese networks are clustered around unity, indicating they are near critical.\nIn many types of random networks, mean connectivity <K> and the average\nactivity bias of the logic functions <p> have been found to be the most\nimportant network properties in determining average sensitivity, and by\nextension a network's criticality. Surprisingly, many of these gene regulatory\nnetworks achieve the near-critical state with <K> and <p> far from that\npredicted for critical systems: randomized networks sharing the local causal\nstructure and local logic of biological networks better reproduce their\ncritical behavior than controlling for macroscale properties such as <K> and\n<p> alone. This suggests the local properties of genes interacting within\nregulatory networks are selected to collectively be near-critical, and this\nnon-local property of gene regulatory network dynamics cannot be predicted\nusing the density of interactions alone.\n", "versions": [{"version": "v1", "created": "Thu, 3 May 2018 17:47:30 GMT"}], "update_date": "2018-10-03", "authors_parsed": [["Daniels", "Bryan C.", ""], ["Kim", "Hyunju", ""], ["Moore", "Douglas", ""], ["Zhou", "Siyu", ""], ["Smith", "Harrison", ""], ["Karas", "Bradley", ""], ["Kauffman", "Stuart A.", ""], ["Walker", "Sara I.", ""]]}, {"id": "1805.01506", "submitter": "Md Mehedi Hassan Onik", "authors": "Md Mehedi Hassan Onik, Shakhawat Ahmmed Nobin, Adnan Ferdous Ashrafi,\n  Tareque Mohmud Chowdhury", "title": "Prediction of a Gene Regulatory Network from Gene Expression Profiles\n  With Linear Regression and Pearson Correlation Coefficient", "comments": "In The 19Th International Conference On Computer And Information\n  Technology, North South University, Dhaka -1229, Bangladesh, 2016, P. 327", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.CE q-bio.MN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Reconstruction of gene regulatory networks is the process of identifying gene\ndependency from gene expression profile through some computation techniques. In\nour human body, though all cells pose similar genetic material but the\nactivation state may vary. This variation in the activation of genes helps\nresearchers to understand more about the function of the cells. Researchers get\ninsight about diseases like mental illness, infectious disease, cancer disease\nand heart disease from microarray technology, etc. In this study, a\ncancer-specific gene regulatory network has been constructed using a simple and\nnovel machine learning approach. In First Step, linear regression algorithm\nprovided us the significant genes those expressed themselves differently. Next,\nregulatory relationships between the identified genes has been computed using\nPearson correlation coefficient. Finally, the obtained results have been\nvalidated with the available databases and literatures. We can identify the hub\ngenes and can be targeted for the cancer diagnosis.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 01:44:43 GMT"}], "update_date": "2018-05-07", "authors_parsed": [["Onik", "Md Mehedi Hassan", ""], ["Nobin", "Shakhawat Ahmmed", ""], ["Ashrafi", "Adnan Ferdous", ""], ["Chowdhury", "Tareque Mohmud", ""]]}, {"id": "1805.01608", "submitter": "Matthieu Vignes", "authors": "Alex White and Matthieu Vignes", "title": "Causal Queries from Observational Data in Biological Systems via\n  Bayesian Networks: An Empirical Study in Small Networks", "comments": "This chapter will appear in the forthcoming book \"Gene Regulatory\n  Networks: Methods and Protocols\", published by Springer Nature", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological networks are a very convenient modelling and visualisation tool to\ndiscover knowledge from modern high-throughput genomics and postgenomics data\nsets. Indeed, biological entities are not isolated, but are components of\ncomplex multi-level systems. We go one step further and advocate for the\nconsideration of causal representations of the interactions in living\nsystems.We present the causal formalism and bring it out in the context of\nbiological networks, when the data is observational. We also discuss its\nability to decipher the causal information flow as observed in gene expression.\nWe also illustrate our exploration by experiments on small simulated networks\nas well as on a real biological data set.\n", "versions": [{"version": "v1", "created": "Fri, 4 May 2018 05:09:48 GMT"}], "update_date": "2018-05-07", "authors_parsed": [["White", "Alex", ""], ["Vignes", "Matthieu", ""]]}, {"id": "1805.02068", "submitter": "Matthias Lechner", "authors": "Alexandra G\\\"otz, Matthias Lechner, Andreas Mader, Benedikt von Bronk,\n  Erwin Frey, Madeleine Opitz", "title": "CsrA and its regulators control the time-point of ColicinE2 release in\n  Escherichia coli", "comments": null, "journal-ref": "Scientific Reports 8, 6537 (2018)", "doi": "10.1038/s41598-018-24699-z", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The bacterial SOS response is a cellular reaction to DNA damage, that, among\nother actions, triggers the expression of colicin - toxic bacteriocins in\nEscherichia coli that are released to kill close relatives competing for\nresources. However, it is largely unknown, how the complex network regulating\ntoxin expression controls the time-point of toxin release to prevent premature\nrelease of inefficient protein concentrations. Here, we study how different\nregulatory mechanisms affect production and release of the bacteriocin\nColicinE2 in Escherichia coli. Combining experimental and theoretical\napproaches, we demonstrate that the global carbon storage regulator CsrA\ncontrols the duration of the delay between toxin production and release and\nemphasize the importance of CsrA sequestering elements for the timing of\nColicinE2 release. In particular, we show that ssDNA originating from\nrolling-circle replication of the toxin-producing plasmid represents a yet\nunknown additional CsrA sequestering element, which is essential in the\nColicinE2-producing strain to enable toxin release by reducing the amount of\nfree CsrA molecules in the bacterial cell. Taken together, our findings show\nthat CsrA times ColicinE2 release and reveal a dual function for CsrA as an\nssDNA and mRNA-binding protein, introducing ssDNA as an important\npost-transcriptional gene regulatory element.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2018 15:12:45 GMT"}], "update_date": "2018-05-08", "authors_parsed": [["Götz", "Alexandra", ""], ["Lechner", "Matthias", ""], ["Mader", "Andreas", ""], ["von Bronk", "Benedikt", ""], ["Frey", "Erwin", ""], ["Opitz", "Madeleine", ""]]}, {"id": "1805.02411", "submitter": "Marinka Zitnik", "authors": "Marinka Zitnik and Rok Sosic and Jure Leskovec", "title": "Prioritizing network communities", "comments": null, "journal-ref": "Nature Communications, 9:2544, 2018", "doi": "10.1038/s41467-018-04948-5", "report-no": null, "categories": "cs.SI cs.LG q-bio.MN stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Uncovering modular structure in networks is fundamental for systems in\nbiology, physics, and engineering. Community detection identifies candidate\nmodules as hypotheses, which then need to be validated through experiments,\nsuch as mutagenesis in a biological laboratory. Only a few communities can\ntypically be validated, and it is thus important to prioritize which\ncommunities to select for downstream experimentation. Here we develop CRank, a\nmathematically principled approach for prioritizing network communities. CRank\nefficiently evaluates robustness and magnitude of structural features of each\ncommunity and then combines these features into the community prioritization.\nCRank can be used with any community detection method. It needs only\ninformation provided by the network structure and does not require any\nadditional metadata or labels. However, when available, CRank can incorporate\ndomain-specific information to further boost performance. Experiments on many\nlarge networks show that CRank effectively prioritizes communities, yielding a\nnearly 50-fold improvement in community prioritization.\n", "versions": [{"version": "v1", "created": "Mon, 7 May 2018 09:30:34 GMT"}, {"version": "v2", "created": "Mon, 28 May 2018 18:36:42 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Zitnik", "Marinka", ""], ["Sosic", "Rok", ""], ["Leskovec", "Jure", ""]]}, {"id": "1805.03108", "submitter": "Joseph Ramsey", "authors": "Joseph Ramsey and Bryan Andrews", "title": "FASK with Interventional Knowledge Recovers Edges from the Sachs Model", "comments": "13 pages, 21 figures, 2 tables, Technical Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report a procedure that, in one step from continuous data with minimal\npreparation, recovers the graph found by Sachs et al. \\cite{sachs2005causal},\nwith only a few edges different. The algorithm, Fast Adjacency Skewness (FASK),\nrelies on a mixture of linear reasoning and reasoning from the skewness of\nvariables; the Sachs data is a good candidate for this procedure since the\nskewness of the variables is quite pronounced. We review the ground truth model\nfrom Sachs et al. as well as some of the fluctuations seen in the protein\nabundances in the system, give the Sachs model and the FASK model, and perform\na detailed comparison. Some variation in hyper-parameters is explored, though\nthe main result uses values at or near the defaults learned from work modeling\nfMRI data.\n", "versions": [{"version": "v1", "created": "Sun, 6 May 2018 15:49:04 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Ramsey", "Joseph", ""], ["Andrews", "Bryan", ""]]}, {"id": "1805.03281", "submitter": "Tom Chou", "authors": "Bhaven Mistry, Maria R. D'Orsogna, Nicholas E. Webb, Benhur Lee, Tom\n  Chou", "title": "Quantifying the Sensitivity of HIV-1 Viral Entry to Receptor and\n  Coreceptor Expression", "comments": "13 pages, 12 figures", "journal-ref": "J. Phys. Chem. B, 2016, 120 (26), pp 6189-6199", "doi": "10.1021/acs.jpcb.6b02102", "report-no": null, "categories": "q-bio.QM q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Infection by many viruses begins with fusion of viral and cellular lipid\nmembranes, followed by entry of viral contents into the target cell and\nultimately, after many biochemical steps, integration of viral DNA into that of\nthe host cell. The early steps of membrane fusion and viral capsid entry are\nmediated by adsorption to the cell surface, and receptor and coreceptor\nbinding. HIV-1 specifically targets CD4+ helper T-cells of the human immune\nsystem and binds to the receptor CD4 and coreceptor CCR5 before fusion is\ninitiated. Previous experiments have been performed using a cell line\n(293-Affinofile) in which the expression of CD4 and CCR5 concentration were\nindependently controlled. After exposure to HIV-1 of various strains, the\nresulting infectivity was measured through the fraction of infected cells. To\ndesign and evaluate the effectiveness of drug therapies that target the\ninhibition of the entry processes, an accurate functional relationship between\nthe CD4/CCR5 concentrations and infectivity is desired in order to more\nquantitatively analyze experimental data. We propose three kinetic models\ndescribing the possible mechanistic processes involved in HIV entry and fit\ntheir predictions to infectivity measurements, contrasting and comparing\ndifferent outcomes. Our approach allows interpretation of the clustering of\ninfectivity of different strains of HIV-1 in the space of mechanistic kinetic\nparameters. Our model fitting also allows inference of nontrivial\nstoichiometries of receptor and coreceptor binding and provides a framework\nthrough which to quantitatively investigate the effectiveness of fusion\ninhibitors and neutralizing antibodies.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2018 20:56:21 GMT"}], "update_date": "2018-05-10", "authors_parsed": [["Mistry", "Bhaven", ""], ["D'Orsogna", "Maria R.", ""], ["Webb", "Nicholas E.", ""], ["Lee", "Benhur", ""], ["Chou", "Tom", ""]]}, {"id": "1805.03327", "submitter": "Marinka Zitnik", "authors": "Bo Wang, Armin Pourshafeie, Marinka Zitnik, Junjie Zhu, Carlos D.\n  Bustamante, Serafim Batzoglou, and Jure Leskovec", "title": "Network Enhancement: a general method to denoise weighted biological\n  networks", "comments": null, "journal-ref": "Nature Communications, 9:3108, 2018", "doi": "10.1038/s41467-018-05469-x", "report-no": null, "categories": "q-bio.MN cs.LG cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Networks are ubiquitous in biology where they encode connectivity patterns at\nall scales of organization, from molecular to the biome. However, biological\nnetworks are noisy due to the limitations of measurement technology and\ninherent natural variation, which can hamper discovery of network patterns and\ndynamics. We propose Network Enhancement (NE), a method for improving the\nsignal-to-noise ratio of undirected, weighted networks. NE uses a doubly\nstochastic matrix operator that induces sparsity and provides a closed-form\nsolution that increases spectral eigengap of the input network. As a result, NE\nremoves weak edges, enhances real connections, and leads to better downstream\nperformance. Experiments show that NE improves gene function prediction by\ndenoising tissue-specific interaction networks, alleviates interpretation of\nnoisy Hi-C contact maps from the human genome, and boosts fine-grained\nidentification accuracy of species. Our results indicate that NE is widely\napplicable for denoising biological networks.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2018 00:22:03 GMT"}, {"version": "v2", "created": "Fri, 1 Jun 2018 21:28:54 GMT"}], "update_date": "2018-08-16", "authors_parsed": [["Wang", "Bo", ""], ["Pourshafeie", "Armin", ""], ["Zitnik", "Marinka", ""], ["Zhu", "Junjie", ""], ["Bustamante", "Carlos D.", ""], ["Batzoglou", "Serafim", ""], ["Leskovec", "Jure", ""]]}, {"id": "1805.03794", "submitter": "Tan Vu Van", "authors": "Tan Van Vu and Yoshihiko Hasegawa", "title": "Diffusion-dynamics laws in stochastic reaction networks", "comments": "11 pages, 2 figures", "journal-ref": "Phys. Rev. E 99, 012416 (2019)", "doi": "10.1103/PhysRevE.99.012416", "report-no": null, "categories": "physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many biological activities are induced by cellular chemical reactions of\ndiffusing reactants. The dynamics of such systems can be captured by stochastic\nreaction networks. A recent numerical study has shown that diffusion can\nsignificantly enhance the fluctuations in gene regulatory networks. However,\nthe universal relation between diffusion and stochastic system dynamics remains\nveiled. Within the approximation of reaction-diffusion master equation (RDME),\nwe find general relation that the steady-state distribution in complex balanced\nnetworks is diffusion-independent. Here, complex balance is the nonequilibrium\ngeneralization of detailed balance. We also find that for a diffusion-included\nnetwork with a Poisson-like steady-state distribution, the diffusion can be\nignored at steady state. We then derive a necessary and sufficient condition\nfor networks holding such steady-state distributions. Moreover, we show that\nfor linear reaction networks the RDME reduces to the chemical master equation,\nwhich implies that the stochastic dynamics of networks is unaffected by\ndiffusion at any arbitrary time. Our findings shed light on the fundamental\nquestion of when diffusion can be neglected, or (if nonnegligible) its effects\non the stochastic dynamics of the reaction network.\n", "versions": [{"version": "v1", "created": "Thu, 10 May 2018 02:42:44 GMT"}, {"version": "v2", "created": "Tue, 28 Aug 2018 03:04:09 GMT"}, {"version": "v3", "created": "Thu, 17 Jan 2019 14:53:13 GMT"}], "update_date": "2019-01-18", "authors_parsed": [["Van Vu", "Tan", ""], ["Hasegawa", "Yoshihiko", ""]]}, {"id": "1805.04538", "submitter": "Michele Monti", "authors": "Michele Monti, David K. Lubensky and Pieter Rein ten Wolde", "title": "Theory of circadian metabolism", "comments": "17 Pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many organisms repartition their proteome in a circadian fashion in response\nto the daily nutrient changes in their environment. A striking example is\nprovided by cyanobacteria, which perform photosynthesis during the day to fix\ncarbon. These organisms not only face the challenge of rewiring their proteome\nevery 12 hours, but also the necessity of storing the fixed carbon in the form\nof glycogen to fuel processes during the night. In this manuscript, we extend\nthe framework developed by Hwa and coworkers (Scott et al., Science 330, 1099\n(2010)) for quantifying the relatinship between growth and proteome composition\nto circadian metabolism. We then apply this framework to investigate the\ncircadian metabolism of the cyanobacterium Cyanothece, which not only fixes\ncarbon during the day, but also nitrogen during the night, storing it in the\npolymer cyanophycin. Our analysis reveals that the need to store carbon and\nnitrogen tends to generate an extreme growth strategy, in which the cells\npredominantly grow during the day, as observed experimentally. This strategy\nmaximizes the growth rate over 24 hours, and can be quantitatively understood\nby the bacterial growth laws. Our analysis also shows that the slow relaxation\nof the proteome, arising from the slow growth rate, puts a severe constraint on\nimplementing this optimal strategy. Yet, the capacity to estimate the time of\nthe day, enabled by the circadian clock, makes it possible to anticipate the\ndaily changes in the environment and mount a response ahead of time. This\nsignificantly enhances the growth rate by counteracting the detrimental effects\nof the slow proteome relaxation.\n", "versions": [{"version": "v1", "created": "Fri, 11 May 2018 18:08:36 GMT"}], "update_date": "2018-05-15", "authors_parsed": [["Monti", "Michele", ""], ["Lubensky", "David K.", ""], ["Wolde", "Pieter Rein ten", ""]]}, {"id": "1805.05433", "submitter": "Joshua M. Deutsch", "authors": "J. M. Deutsch", "title": "Computational mechanisms in genetic regulation by RNA", "comments": "18 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolution of the genome has led to very sophisticated and complex\nregulation. Because of the abundance of non-coding RNA (ncRNA) in the cell,\ndifferent species will promiscuously associate with each other, suggesting\ncollective dynamics similar to artificial neural networks. Here we present a\nsimple mechanism allowing ncRNA to perform computations equivalent to neural\nnetwork algorithms such as Boltzmann machines and the Hopfield model. The\nquantities analogous to the neural couplings are the equilibrium constants\nbetween different RNA species. The relatively rapid equilibration of RNA\nbinding and unbinding is regulated by a slower process that degrades and\ncreates new RNA. The model requires that the creation rate for each species be\nan increasing function of the ratio of total to unbound RNA. Similar mechanisms\nhave already been found to exist experimentally for ncRNA regulation. With the\noverall concentration of RNA regulated, equilibrium constants can be chosen to\nstore many different patterns, or many different input-output relations. The\nnetwork is also quite insensitive to random mutations in equilibrium constants.\nTherefore one expects that this kind of mechanism will have a much higher\nmutation rate than ones typically regarded as being under evolutionary\nconstraint.\n", "versions": [{"version": "v1", "created": "Mon, 14 May 2018 20:39:02 GMT"}], "update_date": "2018-05-16", "authors_parsed": [["Deutsch", "J. M.", ""]]}, {"id": "1805.07098", "submitter": "Yutaka Hori", "authors": "Yuta Sakurai, Yutaka Hori", "title": "Bounding Transient Moments of Stochastic Chemical Reactions", "comments": null, "journal-ref": "IEEE Control Systems Letters, vol. 3, No. 2, pp. 290-295, 2019", "doi": "10.1109/LCSYS.2018.2869639", "report-no": null, "categories": "q-bio.QM cs.SY q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The predictive ability of stochastic chemical reactions is currently limited\nby the lack of closed form solutions to the governing chemical master equation.\nTo overcome this limitation, this paper proposes a computational method capable\nof predicting mathematically rigorous upper and lower bounds of transient\nmoments for reactions governed by the law of mass action. We first derive an\nequation that transient moments must satisfy based on the moment equation.\nAlthough this equation is underdetermined, we introduce a set of semidefinite\nconstraints known as moment condition to narrow the feasible set of the\nvariables in the equation. Using these conditions, we formulate a semidefinite\nprogram that efficiently and rigorously computes the bounds of transient moment\ndynamics. The proposed method is demonstrated with illustrative numerical\nexamples and is compared with related works to discuss advantages and\nlimitations.\n", "versions": [{"version": "v1", "created": "Fri, 18 May 2018 08:47:42 GMT"}, {"version": "v2", "created": "Tue, 22 May 2018 15:46:25 GMT"}, {"version": "v3", "created": "Mon, 6 Aug 2018 05:13:29 GMT"}, {"version": "v4", "created": "Sun, 6 Jan 2019 01:47:13 GMT"}], "update_date": "2019-01-08", "authors_parsed": [["Sakurai", "Yuta", ""], ["Hori", "Yutaka", ""]]}, {"id": "1805.07118", "submitter": "Leo Bronstein", "authors": "Leo Bronstein and Heinz Koeppl", "title": "Marginal process framework: A model reduction tool for Markov jump\n  processes", "comments": "16 pages, 5 figures; accepted for publication in Physical Review E", "journal-ref": "Physical Review E 97, 062147 (2018)", "doi": "10.1103/PhysRevE.97.062147", "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Markov jump process models have many applications across science. Often,\nthese models are defined on a state-space of product form and only one of the\ncomponents of the process is of direct interest. In this paper, we extend the\nmarginal process framework, which provides a marginal description of the\ncomponent of interest, to the case of fully coupled processes. We use entropic\nmatching to obtain a finite-dimensional approximation of the filtering\nequation, which governs the transition rates of the marginal process. The\nresulting equations can be seen as a combination of two projection operations\napplied to the full master equation, so that we obtain a principled model\nreduction framework. We demonstrate the resulting reduced description on the\ntotally asymmetric exclusion process. An important class of Markov jump\nprocesses are stochastic reaction networks, which have applications in chemical\nand biomolecular kinetics, ecological models and models of social networks. We\nobtain a particularly simple instantiation of the marginal process framework\nfor mass-action systems by using product-Poisson distributions for the\napproximate solution of the filtering equation. We investigate the resulting\napproximate marginal process analytically and numerically.\n", "versions": [{"version": "v1", "created": "Fri, 18 May 2018 09:58:19 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Bronstein", "Leo", ""], ["Koeppl", "Heinz", ""]]}, {"id": "1805.07512", "submitter": "Matt Thomson", "authors": "Audrey Huang, Benjamin Sheldan, David A. Sivak, Matt Thomson", "title": "Physically optimizing inference", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.stat-mech cond-mat.dis-nn physics.data-an q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data is scaling exponentially in fields ranging from genomics to neuroscience\nto economics. A central question is: can modern machine learning methods be\napplied to construct predictive models of natural systems like cells and brains\nbased on large data sets? In this paper, we examine how inference is impacted\nwhen training data is generated by the statistical behavior of a physical\nsystem, and hence outside direct control by the experimentalist. We develop an\ninformation-theoretic analysis for the canonical problem of spin-network\ninference. Our analysis reveals the essential role that the physical properties\nof the spin network and its environment play in determining the difficulty of\nthe underlying machine learning problem. Specifically, stochastic fluctuations\ndrive a system to explore a range of configurations providing `raw' information\nfor a learning algorithm to construct an accurate model; yet they also blur\nenergetic differences between network states and thereby degrade information.\nThis competition leads spin networks to generically have an intrinsic optimal\ntemperature at which stochastic spin fluctuations provide maximal information\nfor discriminating among competing models, maximizing inference efficiency. We\ndemonstrate a simple active learning protocol that optimizes network\ntemperature to boost inference efficiency and dramatically increases the\nefficiency of inference on a neural circuit reconstruction task. Our results\nreveal a fundamental link between physics and information and show how the\nphysical environment can be tuned to optimize the efficiency of machine\nlearning.\n", "versions": [{"version": "v1", "created": "Sat, 19 May 2018 04:30:01 GMT"}, {"version": "v2", "created": "Mon, 28 May 2018 06:20:34 GMT"}, {"version": "v3", "created": "Thu, 16 Aug 2018 17:00:51 GMT"}], "update_date": "2018-08-17", "authors_parsed": [["Huang", "Audrey", ""], ["Sheldan", "Benjamin", ""], ["Sivak", "David A.", ""], ["Thomson", "Matt", ""]]}, {"id": "1805.07768", "submitter": "Jorge Fernandez-de-Cossio-Diaz", "authors": "Jorge Fernandez-de-Cossio-Diaz, Roberto Mulet, Alexei Vazquez", "title": "Cell population heterogeneity driven by stochastic partition and growth\n  optimality", "comments": null, "journal-ref": null, "doi": "10.1038/s41598-019-45882-w", "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fundamental question in biology is how cell populations evolve into\ndifferent subtypes based on homogeneous processes at the single cell level.\nHere we show that population bimodality can emerge even when biological\nprocesses are homogenous at the cell level and the environment is kept\nconstant. Our model is based on the stochastic partitioning of a cell component\nwith an optimal copy number. We show that the existence of unimodal or bimodal\ndistributions depends on the variance of partition errors and the growth rate\ntolerance around the optimal copy number. In particular, our theory provides a\nconsistent explanation for the maintenance of aneuploid states in a population.\nThe proposed model can also be relevant for other cell components such as\nmitochondria and plasmids, whose abundances affect the growth rate and are\nsubject to stochastic partition at cell division.\n", "versions": [{"version": "v1", "created": "Sun, 20 May 2018 14:16:20 GMT"}, {"version": "v2", "created": "Sun, 29 Jul 2018 10:14:42 GMT"}, {"version": "v3", "created": "Wed, 19 Jun 2019 13:04:34 GMT"}], "update_date": "2019-07-01", "authors_parsed": [["Fernandez-de-Cossio-Diaz", "Jorge", ""], ["Mulet", "Roberto", ""], ["Vazquez", "Alexei", ""]]}, {"id": "1805.09497", "submitter": "Kazuhiro Takemoto", "authors": "Midori Iida, Kazuhiro Takemoto", "title": "A network biology-based approach to evaluating the effect of\n  environmental contaminants on human interactome and diseases", "comments": "35 pages, 12 figures", "journal-ref": "Ecotoxicology and Environmental Safety 160, 316-327 (2018)", "doi": "10.1016/j.ecoenv.2018.05.065", "report-no": null, "categories": "q-bio.MN physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Environmental contaminant exposure can pose significant risks to human\nhealth. Therefore, evaluating the impact of this exposure is of great\nimportance; however, it is often difficult because both the molecular mechanism\nof disease and the mode of action of the contaminants are complex. We used\nnetwork biology techniques to quantitatively assess the impact of environmental\ncontaminants on the human interactome and diseases with a particular focus on\nseven major contaminant categories: persistent organic pollutants (POPs),\ndioxins, polycyclic aromatic hydrocarbons (PAHs), pesticides,\nperfluorochemicals (PFCs), metals, and pharmaceutical and personal care\nproducts (PPCPs). We integrated publicly available data on toxicogenomics, the\ndiseasome, protein-protein interactions (PPIs), and gene essentiality and found\nthat a few contaminants were targeted to many genes, and a few genes were\ntargeted by many contaminants. The contaminant targets were hub proteins in the\nhuman PPI network, whereas the target proteins in most categories did not\ncontain abundant essential proteins. Generally, contaminant targets and\ndisease-associated proteins were closely associated with the PPI network, and\nthe closeness of the associations depended on the disease type and chemical\ncategory. Network biology techniques were used to identify environmental\ncontaminants with broad effects on the human interactome and\ncontaminant-sensitive biomarkers. Moreover, this method enabled us to quantify\nthe relationship between environmental contaminants and human diseases, which\nwas supported by epidemiological and experimental evidence. These methods and\nfindings have facilitated the elucidation of the complex relationship between\nenvironmental exposure and adverse health outcomes.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2018 03:43:37 GMT"}], "update_date": "2018-06-01", "authors_parsed": [["Iida", "Midori", ""], ["Takemoto", "Kazuhiro", ""]]}, {"id": "1805.10371", "submitter": "Polly Y. Yu", "authors": "Polly Y. Yu, Gheorghe Craciun", "title": "Mathematical Analysis of Chemical Reaction Systems", "comments": "17 pages, 7 figures, review", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of mathematical methods for the analysis of chemical reaction systems\nhas a very long history, and involves many types of models: deterministic\nversus stochastic, continuous versus discrete, and homogeneous versus spatially\ndistributed. Here we focus on mathematical models based on deterministic\nmass-action kinetics. These models are systems of coupled nonlinear\ndifferential equations on the positive orthant. We explain how mathematical\nproperties of the solutions of mass-action systems are strongly related to key\nproperties of the networks of chemical reactions that generate them, such as\nspecific versions of reversibility and feedback interactions.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2018 21:45:08 GMT"}], "update_date": "2018-05-29", "authors_parsed": [["Yu", "Polly Y.", ""], ["Craciun", "Gheorghe", ""]]}, {"id": "1805.10733", "submitter": "Keita Ashida Mr.", "authors": "Keita Ashida and Kotaro Oka", "title": "Stochastic thermodynamic limit on E. coli adaptation by Information\n  geometric approach", "comments": "6 pages, 4 figures", "journal-ref": null, "doi": "10.1016/j.bbrc.2018.11.115", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological systems process information under noisy environment. Sensory\nadaptation model of E. coli is suitable for investigation because of its\nsimplicity. To understand the adaptation processing quantitatively, stochastic\nthermodynamic approach has been attempted. Information processing can be\nassumed as state transition of a system that consists of signal transduction\nmolecules using thermodynamic approach, and efficiency can be measured as\nthermodynamic cost. Recently, using information geometry and stochastic\nthermodynamics, a relationship between speed of the transition and the\nthermodynamic cost has been investigated for a chemical reaction model. Here,\nwe introduce this approach to sensory adaptation model of E. coli, and examined\na relationship between adaptation speed and the thermodynamic cost, and\nefficiency of the adaptation speed. For increasing external noise level in\nstimulation, the efficiency decreased, but the efficiency was highly robust to\nexternal stimulation strength. Moreover, we demonstrated that there is the best\nnoise to achieve the adaptation in the aspect of thermodynamic efficiency. Our\nquantification method provides a framework to understand the adaptation speed\nand the thermodynamic cost for various biological systems.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2018 02:11:02 GMT"}, {"version": "v2", "created": "Wed, 4 Jul 2018 01:07:59 GMT"}, {"version": "v3", "created": "Mon, 13 Aug 2018 13:26:53 GMT"}, {"version": "v4", "created": "Tue, 20 Nov 2018 05:49:18 GMT"}, {"version": "v5", "created": "Mon, 26 Nov 2018 05:49:36 GMT"}, {"version": "v6", "created": "Wed, 5 Dec 2018 02:21:16 GMT"}, {"version": "v7", "created": "Sat, 13 Jul 2019 09:45:30 GMT"}], "update_date": "2019-07-16", "authors_parsed": [["Ashida", "Keita", ""], ["Oka", "Kotaro", ""]]}, {"id": "1805.11084", "submitter": "David K. Lubensky", "authors": "Alexander D. Golden, Joris Paijmans, and David K. Lubensky", "title": "Distinguishing Feedback Mechanisms in Clock Models", "comments": "Figure numbering and cross-references corrected in v2", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological oscillators are very diverse but can be classified based on\ndynamical motifs such as the types of feedback loops present. The S. Elongatus\ncircadian clock is a remarkable phosphorylation-based oscillator that can be\nreconstituted in vitro with only 3 different purified proteins: the clock\nproteins KaiA, KaiB, and KaiC. Despite a growing body of knowledge about the\nbiochemistry of the Kai proteins, basic questions about how their interactions\nlead to sustained oscillations remain unanswered. Here, we compare models of\nthis system that make opposing assumptions about whether KaiA sequestration\nintroduces a positive or a negative feedback loop. We find that the two\ndifferent feedback mechanisms can be distinguished experimentally by the\nintroduction of a protein that binds competitively with KaiA. Understanding the\ndynamical mechanism responsible for oscillations in the Kai system may shed\nlight on the broader question of what clock architectures have been selected by\nevolution and why.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2018 17:53:59 GMT"}, {"version": "v2", "created": "Tue, 5 Jun 2018 03:25:19 GMT"}], "update_date": "2018-06-06", "authors_parsed": [["Golden", "Alexander D.", ""], ["Paijmans", "Joris", ""], ["Lubensky", "David K.", ""]]}, {"id": "1805.12056", "submitter": "Marta Tyran-Kaminska", "authors": "Mateusz Falfus, Michael C. Mackey, Marta Tyran-Kaminska", "title": "The combined effects of Feller diffusion and\n  transcriptional/translational bursting in simple gene networks", "comments": "20 pages, corrected typos", "journal-ref": "Journal of Mathematical Analysis and Applications 470 (2019),\n  931-953", "doi": "10.1016/j.jmaa.2018.10.042", "report-no": "BCSim-2017-s07", "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a stochastic model of biosynthesis of proteins in generic bacterial\noperons. The stochasticity arises from two different processes, namely from\n`bursting' production of either mRNA and/or protein (in the\ntranscription/translation process) and from standard diffusive fluctuations.\nThe amount of protein follows the Feller diffusion, while the bursting\nintroduces random jumps between trajectories of the diffusion process. The\ncombined effect leads to a process commonly known as a diffusion process with\njumps. We study existence of invariant densities and the long time behavior of\ndistributions of the corresponding Markov process, proving asymptotic stability\nin the evolution of the density.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2018 16:17:14 GMT"}, {"version": "v2", "created": "Wed, 18 Jul 2018 14:58:23 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Falfus", "Mateusz", ""], ["Mackey", "Michael C.", ""], ["Tyran-Kaminska", "Marta", ""]]}, {"id": "1805.12077", "submitter": "Riccardo Rao", "authors": "Riccardo Rao and Massimiliano Esposito", "title": "Conservation Laws and Work Fluctuation Relations in Chemical Reaction\n  Networks", "comments": "revtex format: 30 pages (25 + 5 for appendices), 9 figures, 3 tables.\n  v2: published version", "journal-ref": "J. Chem. Phys. 149, 245101 (2018)", "doi": "10.1063/1.5042253", "report-no": null, "categories": "cond-mat.stat-mech q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We formulate a nonequilibrium thermodynamic description for open chemical\nreaction networks (CRN) described by a chemical master equation. The\ntopological properties of the CRN and its conservation laws are shown to play a\ncrucial role. They are used to decompose the entropy production into a\npotential change and two work contributions, the first due to time dependent\nchanges in the externally controlled chemostats concentrations and the second\ndue to flows maintained across the system by nonconservative forces. These two\nworks jointly satisfy a Jarzynski and Crooks fluctuation theorem. In absence of\nwork, the potential is minimized by the dynamics as the system relaxes to\nequilibrium and its equilibrium value coincides with the maximum entropy\nprinciple. A generalized Landauer's principle also holds: the minimal work\nneeded to create a nonequilibrium state is the relative entropy of that state\nto its equilibrium value reached in absence of any work.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2018 16:50:34 GMT"}, {"version": "v2", "created": "Fri, 11 Jan 2019 16:02:33 GMT"}], "update_date": "2019-01-14", "authors_parsed": [["Rao", "Riccardo", ""], ["Esposito", "Massimiliano", ""]]}, {"id": "1805.12253", "submitter": "Mahdi Imani", "authors": "Mahdi Imani, Roozbeh Dehghannasiri, Ulisses M. Braga-Neto, Edward R.\n  Dougherty", "title": "Sequential Experimental Design for Optimal Structural Intervention in\n  Gene Regulatory Networks Based on the Mean Objective Cost of Uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.SY stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scientists are attempting to use models of ever increasing complexity,\nespecially in medicine, where gene-based diseases such as cancer require better\nmodeling of cell regulation. Complex models suffer from uncertainty and\nexperiments are needed to reduce this uncertainty. Because experiments can be\ncostly and time-consuming it is desirable to determine experiments providing\nthe most useful information. If a sequence of experiments is to be performed,\nexperimental design is needed to determine the order. A classical approach is\nto maximally reduce the overall uncertainty in the model, meaning maximal\nentropy reduction. A recently proposed method takes into account both model\nuncertainty and the translational objective, for instance, optimal structural\nintervention in gene regulatory networks, where the aim is to alter the\nregulatory logic to maximally reduce the long-run likelihood of being in a\ncancerous state. The mean objective cost of uncertainty (MOCU) quantifies\nuncertainty based on the degree to which model uncertainty affects the\nobjective. Experimental design involves choosing the experiment that yields the\ngreatest reduction in MOCU. This paper introduces finite-horizon dynamic\nprogramming for MOCU-based sequential experimental design and compares it to\nthe greedy approach, which selects one experiment at a time without\nconsideration of the full horizon of experiments. A salient aspect of the paper\nis that it demonstrates the advantage of MOCU-based design over the widely used\nentropy-based design for both greedy and dynamic-programming strategies and\ninvestigates the effect of model conditions on the comparative performances.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2018 22:53:22 GMT"}], "update_date": "2018-06-01", "authors_parsed": [["Imani", "Mahdi", ""], ["Dehghannasiri", "Roozbeh", ""], ["Braga-Neto", "Ulisses M.", ""], ["Dougherty", "Edward R.", ""]]}]