[{"id": "1812.00620", "submitter": "Alan D. Rendall", "authors": "Hussein Obeid and Alan D. Rendall", "title": "The minimal model of Hahn for the Calvin cycle", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are many models of the Calvin cycle of photosynthesis in the\nliterature. When investigating the dynamics of these models one strategy is to\nlook at the simplest possible models in order to get the most detailed\ninsights. We investigate a minimal model of the Calvin cycle introduced by Hahn\nwhile he was pursuing this strategy. In a variant of the model not including\nphotorespiration it is shown that there exists exactly one positive steady\nstate and that this steady state is unstable. For generic initial data either\nall concentrations tend to infinity at lates times or all concentrations tend\nto zero at late times. In a variant including photorespiration it is shown that\nfor suitable values of the parameters of the model there exist two positive\nsteady states, one stable and one unstable. For generic initial data either the\nsolution tends to the stable steady state at late times or all concentrations\ntend to zero at late times. Thus we obtain rigorous proofs of mathematical\nstatements which together confirm the intuitive idea proposed by Hahn that\nphotorespiration can stabilize the operation of the Calvin cycle. In the case\nthat the concentrations tend to infinity we derive formulae for the leading\norder asymptotics using the Poincar\\'e compactification.\n", "versions": [{"version": "v1", "created": "Mon, 3 Dec 2018 09:25:37 GMT"}], "update_date": "2018-12-04", "authors_parsed": [["Obeid", "Hussein", ""], ["Rendall", "Alan D.", ""]]}, {"id": "1812.00818", "submitter": "Ronan M.T. Fleming Dr", "authors": "Masoud Ahookhosh, Ronan M.T. Fleming, Phan T. Vuong", "title": "Finding Zeros of H\\\"{o}lder Metrically Subregular Mappings via Globally\n  Convergent Levenberg-Marquardt Methods", "comments": "28 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present two globally convergent Levenberg-Marquardt methods for finding\nzeros of H\\\"{o}lder metrically subregular mappings that may have non-isolated\nzeros. The first method unifies the Levenberg- Marquardt direction and an\nArmijo-type line search, while the second incorporates this direction with a\nnonmonotone trust-region technique. For both methods, we prove the global\nconvergence to a first-order stationary point of the associated merit function.\nFurthermore, the worst-case global complexity of these methods are provided,\nindicating that an approximate stationary point can be computed in at most\n$\\mathcal{O}(\\varepsilon^{-2})$ function and gradient evaluations, for an\naccuracy parameter $\\varepsilon>0$. We also study the conditions for the\nproposed methods to converge to a zero of the associated mappings. Computing a\nmoiety conserved steady state for biochemical reaction networks can be cast as\nthe problem of finding a zero of a H\\\"{o}lder metrically subregular mapping. We\nreport encouraging numerical results for finding a zero of such mappings\nderived from real-world biological data, which supports our theoretical\nfoundations.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2018 18:15:09 GMT"}, {"version": "v2", "created": "Wed, 5 Dec 2018 01:24:25 GMT"}], "update_date": "2018-12-06", "authors_parsed": [["Ahookhosh", "Masoud", ""], ["Fleming", "Ronan M. T.", ""], ["Vuong", "Phan T.", ""]]}, {"id": "1812.01091", "submitter": "Bing Liu", "authors": "Bing Liu, Benjamin M. Gyori and P.S. Thiagarajan", "title": "Statistical Model Checking based Analysis of Biological Networks", "comments": "Accepted for Publication in Automated Reasoning for Systems Biology\n  and Medicine on 2018-09-18", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a framework for analyzing ordinary differential equation (ODE)\nmodels of biological networks using statistical model checking (SMC). A key\naspect of our work is the modeling of single-cell variability by assigning a\nprobability distribution to intervals of initial concentration values and\nkinetic rate constants. We propagate this distribution through the system\ndynamics to obtain a distribution over the set of trajectories of the ODEs.\nThis in turn opens the door for performing statistical analysis of the ODE\nsystem's behavior. To illustrate this we first encode quantitative data and\nqualitative trends as bounded linear time temporal logic (BLTL) formulas. Based\non this we construct a parameter estimation method using an SMC-driven\nevaluation procedure applied to the stochastic version of the behavior of the\nODE system. We then describe how this SMC framework can be generalized to\nhybrid automata by exploiting the given distribution over the initial states\nand the--much more sophisticated--system dynamics to associate a Markov chain\nwith the hybrid automaton. We then establish a strong relationship between the\nbehaviors of the hybrid automaton and its associated Markov chain.\nConsequently, we sample trajectories from the hybrid automaton in a way that\nmimics the sampling of the trajectories of the Markov chain. This enables us to\nverify approximately that the Markov chain meets a BLTL specification with high\nprobability. We have applied these methods to ODE based models of Toll-like\nreceptor signaling and the crosstalk between autophagy and apoptosis, as well\nas to systems exhibiting hybrid dynamics including the circadian clock pathway\nand cardiac cell physiology. We present an overview of these applications and\nsummarize the main empirical results. These case studies demonstrate that the\nour methods can be applied in a variety of practical settings.\n", "versions": [{"version": "v1", "created": "Mon, 3 Dec 2018 21:51:24 GMT"}], "update_date": "2018-12-05", "authors_parsed": [["Liu", "Bing", ""], ["Gyori", "Benjamin M.", ""], ["Thiagarajan", "P. S.", ""]]}, {"id": "1812.01252", "submitter": "Julio Augusto Freyre-Gonz\\'alez", "authors": "Adrian I. Campos-Gonz\\'alez and Julio A. Freyre-Gonz\\'alez", "title": "Evolutionary constraints on the complexity of genetic regulatory\n  networks allow predictions of the total number of genetic interactions", "comments": "28 pages, 5 figures, 12 pages supplementary information", "journal-ref": "Scientific Reports 9:3618 (2019)", "doi": "10.1038/s41598-019-39866-z", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genetic regulatory networks (GRNs) have been widely studied, yet there is a\nlack of understanding with regards to the final size and properties of these\nnetworks, mainly due to no network currently being complete. In this study, we\nanalyzed the distribution of GRN structural properties across a large set of\ndistinct prokaryotic organisms and found a set of constrained characteristics\nsuch as network density and number of regulators. Our results allowed us to\nestimate the number of interactions that complete networks would have, a\nvaluable insight that could aid in the daunting task of network curation,\nprediction, and validation. Using state-of-the-art statistical approaches, we\nalso provided new evidence to settle a previously stated controversy that\nraised the possibility of complete biological networks being random and\ntherefore attributing the observed scale-free properties to an artifact\nemerging from the sampling process during network discovery. Furthermore, we\nidentified a set of properties that enabled us to assess the consistency of the\nconnectivity distribution for various GRNs against different alternative\nstatistical distributions. Our results favor the hypothesis that highly\nconnected nodes (hubs) are not a consequence of network incompleteness.\nFinally, an interaction coverage computed for the GRNs as a proxy for\ncompleteness revealed that high-throughput based reconstructions of GRNs could\nyield biased networks with a low average clustering coefficient, showing that\nclassical targeted discovery of interactions is still needed.\n", "versions": [{"version": "v1", "created": "Tue, 4 Dec 2018 07:13:23 GMT"}, {"version": "v2", "created": "Mon, 21 Jan 2019 20:34:24 GMT"}], "update_date": "2019-03-13", "authors_parsed": [["Campos-González", "Adrian I.", ""], ["Freyre-González", "Julio A.", ""]]}, {"id": "1812.03353", "submitter": "Xiaoli Chen", "authors": "Xiaoli Chen, Fengyan Wu, Jinqiao Duan, J\\\"urgen Kurths, Xiaofan Li", "title": "Most probable dynamics of a genetic regulatory network under stable\n  L\\'evy noise", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Numerous studies have demonstrated the important role of noise in the\ndynamical behaviour of a complex system. The most probable trajectories of\nnonlinear systems under the influence of Gaussian noise have recently been\nstudied already. However, there has been only a few works that examine how most\nprobable trajectories in the two-dimensional system (MeKS network) are\ninfluenced under non-Gaussian stable L\\'evy noise. Therefore, we discuss the\nmost probable trajectories of a two-dimensional model depicting the competence\nbehaviour in B. subtilis under the influence of stable L\\'evy noise. On the\nbasis of the Fokker-Planck equation, we describe the noise-induced most\nprobable trajectories of the MeKS network from the low ComK protein\nconcentration (vegetative state) to the high ComK protein concentration\n(competence state) under stable L\\'evy noise. We demonstrate choices of the\nnon-Gaussianity index $\\alpha$ and the noise intensity $\\epsilon$ which\ngenerate the ComK protein escape from the low concentration to the high\nconcentration. We also reveal the optimal combination of both parameters\n$\\alpha$ and $\\epsilon$ making the tipping time shortest. Moreover, we find\nthat different initial concentrations around the low ComK protein concentration\nevolve to a metastable state, and provide the optimal $\\alpha$ and $\\epsilon$\nsuch that the distance between the deterministic competence state and the\nmetastable state is smallest.\n", "versions": [{"version": "v1", "created": "Sat, 8 Dec 2018 17:28:17 GMT"}], "update_date": "2018-12-11", "authors_parsed": [["Chen", "Xiaoli", ""], ["Wu", "Fengyan", ""], ["Duan", "Jinqiao", ""], ["Kurths", "Jürgen", ""], ["Li", "Xiaofan", ""]]}, {"id": "1812.04299", "submitter": "Ankit Gupta", "authors": "Patrik D\\\"urrenberger, Ankit Gupta, and Mustafa Khammash", "title": "A finite state projection method for steady-state sensitivity analysis\n  of stochastic reaction networks", "comments": "5 figures", "journal-ref": null, "doi": "10.1063/1.5085271", "report-no": null, "categories": "q-bio.QM math.PR q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the standard stochastic reaction network model where the dynamics is\ngiven by a continuous-time Markov chain over a discrete lattice. For such\nmodels, estimation of parameter sensitivities is an important problem, but the\nexisting computational approaches to solve this problem usually require\ntime-consuming Monte Carlo simulations of the reaction dynamics. Therefore\nthese simulation-based approaches can only be expected to work over finite\ntime-intervals, while it is often of interest in applications to examine the\nsensitivity values at the steady-state after the Markov chain has relaxed to\nits stationary distribution. The aim of this paper is to present a\ncomputational method for the estimation of steady-state parameter\nsensitivities, which instead of using simulations, relies on the recently\ndeveloped stationary Finite State Projection (sFSP) algorithm [J. Chem. Phys.\n147, 154101 (2017)] that provides an accurate estimate of the stationary\ndistribution at a fixed set of parameters. We show that sensitivity values at\nthese parameters can be estimated from the solution of a Poisson equation\nassociated with the infinitesimal generator of the Markov chain. We develop an\napproach to numerically solve the Poisson equation and this yields an efficient\nestimator for steady-state parameter sensitivities. We illustrate this method\nusing several examples.\n", "versions": [{"version": "v1", "created": "Tue, 11 Dec 2018 09:40:28 GMT"}], "update_date": "2019-05-01", "authors_parsed": [["Dürrenberger", "Patrik", ""], ["Gupta", "Ankit", ""], ["Khammash", "Mustafa", ""]]}, {"id": "1812.05623", "submitter": "Thomas P Wytock", "authors": "Thomas P. Wytock, Aretha Fiebig, Jonathan W. Willett, Julien Herrou,\n  Aleksandra Fergin, Adilson E. Motter, Sean Crosson", "title": "Experimental evolution of diverse Escherichia coli metabolic mutants\n  identifies genetic loci for convergent adaptation of growth rate", "comments": "40 pages, 10 figures, 7 tables. Supplemental Data available at the\n  journal website", "journal-ref": "PLoS genetics, 14(3), e1007284 (2018)", "doi": "10.1371/journal.pgen.1007284", "report-no": null, "categories": "q-bio.MN physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cell growth is determined by substrate availability and the cell's metabolic\ncapacity to assimilate substrates into building blocks. Metabolic genes that\ndetermine growth rate may interact synergistically or antagonistically, and can\naccelerate or slow growth, depending on the genetic background and\nenvironmental conditions. We evolved a diverse set of Escherichia coli\nsingle-gene deletion mutants with a spectrum of growth rates and identified\nmutations that generally increase growth rate. Despite the metabolic\ndifferences between parent strains, mutations that enhanced growth largely\nmapped to the core transcription machinery, including the $\\beta$ and $\\beta'$\nsubunits of RNA polymerase (RNAP) and the transcription elongation factor,\nNusA. The structural segments of RNAP that determine enhanced growth have been\npreviously implicated in antibiotic resistance and in the control of\ntranscription elongation and pausing. We further developed a computational\nframework to characterize how the transcriptional changes that occur upon\nacquisition of these mutations affect growth rate across strains. Our\nexperimental and computational results provide evidence for cases in which RNAP\nmutations shift the competitive balance between active transcription and gene\nsilencing. This study demonstrates that mutations in specific regions of RNAP\nare a convergent adaptive solution that can enhance the growth rate of cells\nfrom distinct metabolic states.\n", "versions": [{"version": "v1", "created": "Thu, 13 Dec 2018 19:00:02 GMT"}], "update_date": "2019-01-17", "authors_parsed": [["Wytock", "Thomas P.", ""], ["Fiebig", "Aretha", ""], ["Willett", "Jonathan W.", ""], ["Herrou", "Julien", ""], ["Fergin", "Aleksandra", ""], ["Motter", "Adilson E.", ""], ["Crosson", "Sean", ""]]}, {"id": "1812.05759", "submitter": "David Warne", "authors": "David J. Warne (1), Ruth E. Baker (2), Matthew J. Simpson (1) ((1)\n  Queensland University of Technology, (2) University of Oxford)", "title": "Simulation and inference algorithms for stochastic biochemical reaction\n  networks: from basic concepts to state-of-the-art", "comments": null, "journal-ref": null, "doi": "10.1098/rsif.2018.0943", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochasticity is a key characteristic of intracellular processes such as gene\nregulation and chemical signalling. Therefore, characterising stochastic\neffects in biochemical systems is essential to understand the complex dynamics\nof living things. Mathematical idealisations of biochemically reacting systems\nmust be able to capture stochastic phenomena. While robust theory exists to\ndescribe such stochastic models, the computational challenges in exploring\nthese models can be a significant burden in practice since realistic models are\nanalytically intractable. Determining the expected behaviour and variability of\na stochastic biochemical reaction network requires many probabilistic\nsimulations of its evolution. Using a biochemical reaction network model to\nassist in the interpretation of time course data from a biological experiment\nis an even greater challenge due to the intractability of the likelihood\nfunction for determining observation probabilities. These computational\nchallenges have been subjects of active research for over four decades. In this\nreview, we present an accessible discussion of the major historical\ndevelopments and state-of-the-art computational techniques relevant to\nsimulation and inference problems for stochastic biochemical reaction network\nmodels. Detailed algorithms for particularly important methods are described\nand complemented with MATLAB implementations. As a result, this review provides\na practical and accessible introduction to computational methods for stochastic\nmodels within the life sciences community.\n", "versions": [{"version": "v1", "created": "Fri, 14 Dec 2018 02:09:30 GMT"}, {"version": "v2", "created": "Wed, 30 Jan 2019 04:41:47 GMT"}], "update_date": "2019-03-04", "authors_parsed": [["Warne", "David J.", ""], ["Baker", "Ruth E.", ""], ["Simpson", "Matthew J.", ""]]}, {"id": "1812.06617", "submitter": "Martin Frasch", "authors": "M. Cao, J.W. MacDonald, H.L. Liu, M. Weaver, M. Cortes, L.D. Durosier,\n  P. Burns, G. Fecteau, A. Desrochers, J. Schulkin, M. C. Antonelli, R.A.\n  Bernier, M. Dorschner, T. K. Bammler, M.G. Frasch", "title": "Alpha7 nicotinic acetylcholine receptor signaling modulates ovine fetal\n  brain astrocytes transcriptome in response to endotoxin", "comments": "See also the accompanying repository on GitHub:\n  https://github.com/martinfrasch/astrocytes_RNAseq", "journal-ref": "Front. Immunol. 2019", "doi": "10.3389/fimmu.2019.01063", "report-no": null, "categories": "q-bio.GN q-bio.CB q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Neuroinflammation in utero may result in lifelong neurological disabilities.\nAstrocytes play a pivotal role, but the mechanisms are poorly understood. No\nearly postnatal treatment strategies exist to enhance neuroprotective potential\nof astrocytes. We hypothesized that agonism on alpha7 nicotinic acetylcholine\nreceptor (alpha7nAChR) in fetal astrocytes will augment their neuroprotective\ntranscriptome profile, while the antagonistic stimulation of alpha7nAChR will\nachieve the opposite. Using an in vivo - in vitro model of developmental\nprogramming of neuroinflammation induced by lipopolysaccharide (LPS), we\nvalidated this hypothesis in primary fetal sheep astrocytes cultures re-exposed\nto LPS in presence of a selective alpha7nAChR agonist or antagonist. Our RNAseq\nfindings show that a pro-inflammatory astrocyte transcriptome phenotype\nacquired in vitro by LPS stimulation is reversed with alpha7nAChR agonistic\nstimulation. Conversely, antagonistic alpha7nAChR stimulation potentiates the\npro-inflammatory astrocytic transcriptome phenotype. Furthermore, we conduct a\nsecondary transcriptome analysis against the identical alpha7nAChR experiments\nin fetal sheep primary microglia cultures and discuss the implications for\nneurodevelopment.\n", "versions": [{"version": "v1", "created": "Mon, 17 Dec 2018 05:05:09 GMT"}, {"version": "v2", "created": "Tue, 18 Dec 2018 03:30:09 GMT"}, {"version": "v3", "created": "Mon, 31 Dec 2018 00:41:00 GMT"}, {"version": "v4", "created": "Tue, 9 Apr 2019 05:43:30 GMT"}], "update_date": "2019-04-29", "authors_parsed": [["Cao", "M.", ""], ["MacDonald", "J. W.", ""], ["Liu", "H. L.", ""], ["Weaver", "M.", ""], ["Cortes", "M.", ""], ["Durosier", "L. D.", ""], ["Burns", "P.", ""], ["Fecteau", "G.", ""], ["Desrochers", "A.", ""], ["Schulkin", "J.", ""], ["Antonelli", "M. C.", ""], ["Bernier", "R. A.", ""], ["Dorschner", "M.", ""], ["Bammler", "T. K.", ""], ["Frasch", "M. G.", ""]]}, {"id": "1812.06760", "submitter": "Carlos Gershenson", "authors": "Omar K. Pineda, Hyobin Kim, and Carlos Gershenson", "title": "A Novel Antifragility Measure Based on Satisfaction and Its Application\n  to Random and Biological Boolean Networks", "comments": "15 pages, 7 figures", "journal-ref": "Complexity, 2019:10", "doi": "10.1155/2019/3728621", "report-no": null, "categories": "nlin.AO cond-mat.stat-mech cs.DM nlin.CG q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Antifragility is a property that enhances the capability of a system in\nresponse to external perturbations. Although the concept has been applied in\nmany areas, a practical measure of antifragility has not been developed yet.\nHere we propose a simply calculable measure of antifragility, based on the\nchange of \"satisfaction\" before and after adding perturbations, and apply it to\nrandom Boolean networks (RBNs). Using the measure, we found that ordered RBNs\nare the most antifragile. Also, we demonstrated that seven biological systems\nare antifragile. Our measure and results can be used in various applications of\nBoolean networks (BNs) including creating antifragile engineering systems,\nidentifying the genetic mechanism of antifragile biological systems, and\ndeveloping new treatment strategies for various diseases.\n", "versions": [{"version": "v1", "created": "Mon, 17 Dec 2018 13:40:39 GMT"}, {"version": "v2", "created": "Wed, 24 Apr 2019 15:33:26 GMT"}], "update_date": "2020-06-04", "authors_parsed": [["Pineda", "Omar K.", ""], ["Kim", "Hyobin", ""], ["Gershenson", "Carlos", ""]]}, {"id": "1812.08401", "submitter": "Thomas Ouldridge", "authors": "Rory A. Brittain, Nick S. Jones and Thomas E. Ouldridge", "title": "Biochemical Szilard engines for memory-limited inference", "comments": null, "journal-ref": null, "doi": "10.1088/1367-2630/ab2484", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.soft physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By developing and leveraging an explicit molecular realisation of a\nmeasurement-and-feedback-powered Szilard engine, we investigate the extraction\nof work from complex environments by minimal machines with finite capacity for\nmemory and decision-making. Living systems perform inference to exploit complex\nstructure, or correlations, in their environment, but the physical limits and\nunderlying cost/benefit trade-offs involved in doing so remain unclear. To\nprobe these questions, we consider a minimal model for a structured environment\n- a correlated sequence of molecules - and explore mechanisms based on extended\nSzilard engines for extracting the work stored in these non-equilibrium\ncorrelations. We consider systems limited to a single bit of memory making\nbinary 'choices' at each step. We demonstrate that increasingly complex\nenvironments allow increasingly sophisticated inference strategies to extract\nmore energy than simpler alternatives, and argue that optimal design of such\nmachines should also consider the energy reserves required to ensure robustness\nagainst fluctuations due to mistakes.\n", "versions": [{"version": "v1", "created": "Thu, 20 Dec 2018 07:43:39 GMT"}, {"version": "v2", "created": "Fri, 17 May 2019 10:18:20 GMT"}], "update_date": "2019-09-04", "authors_parsed": [["Brittain", "Rory A.", ""], ["Jones", "Nick S.", ""], ["Ouldridge", "Thomas E.", ""]]}, {"id": "1812.09538", "submitter": "Andrea De Martino", "authors": "Araks Martirosyan, Marco Del Giudice, Chiara Enrico Bena, Andrea\n  Pagnani, Carla Bosia, Andrea De Martino", "title": "Kinetic modelling of competition and depletion of shared miRNAs by\n  competing endogenous RNAs", "comments": "review article, 29 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-conding RNAs play a key role in the post-transcriptional regulation of\nmRNA translation and turnover in eukaryotes. miRNAs, in particular, interact\nwith their target RNAs through protein-mediated, sequence-specific binding,\ngiving rise to extended and highly heterogeneous miRNA-RNA interaction\nnetworks. Within such networks, competition to bind miRNAs can generate an\neffective positive coupling between their targets. Competing endogenous RNAs\n(ceRNAs) can in turn regulate each other through miRNA-mediated crosstalk.\nAlbeit potentially weak, ceRNA interactions can occur both dynamically,\naffecting e.g. the regulatory clock, and at stationarity, in which case ceRNA\nnetworks as a whole can be implicated in the composition of the cell's\nproteome. Many features of ceRNA interactions, including the conditions under\nwhich they become significant, can be unraveled by mathematical and in silico\nmodels. We review the understanding of the ceRNA effect obtained within such\nframeworks, focusing on the methods employed to quantify it, its role in the\nprocessing of gene expression noise, and how network topology can determine its\nreach.\n", "versions": [{"version": "v1", "created": "Sat, 22 Dec 2018 14:54:11 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Martirosyan", "Araks", ""], ["Del Giudice", "Marco", ""], ["Bena", "Chiara Enrico", ""], ["Pagnani", "Andrea", ""], ["Bosia", "Carla", ""], ["De Martino", "Andrea", ""]]}, {"id": "1812.09774", "submitter": "Tatjana Petrov", "authors": "Tatjana Petrov", "title": "Markov chain aggregation and its application to rule-based modelling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rule-based modelling allows to represent molecular interactions in a compact\nand natural way. The underlying molecular dynamics, by the laws of stochastic\nchemical kinetics, behaves as a continuous-time Markov chain. However, this\nMarkov chain enumerates all possible reaction mixtures, rendering the analysis\nof the chain computationally demanding and often prohibitive in practice. We\nhere describe how it is possible to efficiently find a smaller, aggregate\nchain, which preserves certain properties of the original one. Formal methods\nand lumpability notions are used to define algorithms for automated and\nefficient construction of such smaller chains (without ever constructing the\noriginal ones). We here illustrate the method on an example and we discuss the\napplicability of the method in the context of modelling large signalling\npathways.\n", "versions": [{"version": "v1", "created": "Sun, 23 Dec 2018 20:50:11 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Petrov", "Tatjana", ""]]}, {"id": "1812.10602", "submitter": "Zheng Zhao", "authors": "Zheng Zhao, Lei Xie, and Philip E. Bourne", "title": "Structural insights into characterizing binding sites in EGFR kinase\n  mutants", "comments": "32 pages, 7 figures", "journal-ref": "Journal of Chemical Information and Modeling, 2018", "doi": "10.1021/acs.jcim.8b00458", "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Over the last two decades epidermal growth factor receptor (EGFR) kinase has\nbecome an important target to treat non-small cell lung cancer (NSCLC).\nCurrently, three generations of EGFR kinase-targeted small molecule drugs have\nbeen FDA approved. They nominally produce a response at the start of treatment\nand lead to a substantial survival benefit for patients. However, long-term\ntreatment results in acquired drug resistance and further vulnerability to\nNSCLC. Therefore, novel EGFR kinase inhibitors that specially overcome acquired\nmutations are urgently needed. To this end, we carried out a comprehensive\nstudy of different EGFR kinase mutants using a structural systems pharmacology\nstrategy. Our analysis shows that both wild-type and mutated structures exhibit\nmultiple conformational states that have not been observed in solved crystal\nstructures. We show that this conformational flexibility accommodates diverse\ntypes of ligands with multiple types of binding modes. These results provide\ninsights for designing a new-generation of EGFR kinase inhibitor that combats\nacquired drug-resistant mutations through a multi-conformation-based drug\ndesign strategy.\n", "versions": [{"version": "v1", "created": "Thu, 27 Dec 2018 02:51:34 GMT"}], "update_date": "2018-12-31", "authors_parsed": [["Zhao", "Zheng", ""], ["Xie", "Lei", ""], ["Bourne", "Philip E.", ""]]}, {"id": "1812.11245", "submitter": "Gianmaria Falasco", "authors": "Gianmaria Falasco, Tommaso Cossetto, Emanuele Penocchio and\n  Massimiliano Esposito", "title": "Negative differential response in chemical reactions", "comments": "Main text and SI", "journal-ref": null, "doi": "10.1088/1367-2630/ab28be", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reaction currents in chemical networks usually increase when increasing their\ndriving affinities. But far from equilibrium the opposite can also happen. We\nfind that such negative differential response (NDR) occurs in reaction schemes\nof major biological relevance, namely, substrate inhibition and autocatalysis.\nWe do so by deriving the full counting statistics of two minimal representative\nmodels using large deviation methods. We argue that NDR implies the existence\nof optimal affinities that maximize the robustness against environmental and\nintrinsic noise at intermediate values of dissipation. An analogous behavior is\nfound in dissipative self-assembly, for which we identify the optimal working\nconditions set by NDR.\n", "versions": [{"version": "v1", "created": "Fri, 28 Dec 2018 23:32:03 GMT"}], "update_date": "2019-07-24", "authors_parsed": [["Falasco", "Gianmaria", ""], ["Cossetto", "Tommaso", ""], ["Penocchio", "Emanuele", ""], ["Esposito", "Massimiliano", ""]]}, {"id": "1812.11384", "submitter": "William Bialek", "authors": "Victoria Antonetti, William Bialek, Thomas Gregor, Gentian Muhaxheri,\n  Mariela Petkova, and Martin Scheeler", "title": "Precise spatial scaling in the early fly embryo", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The early fly embryo offers a relatively pure version of the problem of\nspatial scaling in biological pattern formation. Within three hours, a\n\"blueprint\" for the final segmented body plan of the animal is visible in\nstriped patterns of gene expression. We measure the positions of these stripes\nin an ensemble of 100+ embryos from a laboratory strain of Drosophila\nmelanogaster, under controlled conditions. These embryos vary in length by only\n4% (rms), yet stripes are positioned with 1% accuracy; precision and scaling of\nthe pattern are intertwined. We can see directly the variation of absolute\nstripe positions with length, and the precision is so high as to exclude\nalternatives, such as combinations of unscaled signals from the two ends of the\nembryo.\n", "versions": [{"version": "v1", "created": "Sat, 29 Dec 2018 15:38:52 GMT"}], "update_date": "2019-01-01", "authors_parsed": [["Antonetti", "Victoria", ""], ["Bialek", "William", ""], ["Gregor", "Thomas", ""], ["Muhaxheri", "Gentian", ""], ["Petkova", "Mariela", ""], ["Scheeler", "Martin", ""]]}, {"id": "1812.11405", "submitter": "Andreea Beica", "authors": "Andreea Beica, J\\'er\\^ome Feret, Tatjana Petrov", "title": "Tropical Abstraction of Biochemical Reaction Networks with Guarantees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biochemical molecules interact through modification and binding reactions,\ngiving raise to a combinatorial number of possible biochemical species. The\ntime-dependent evolution of concentrations of the species is commonly described\nby a system of coupled ordinary differential equations (ODEs). However, the\nanalysis of such high-dimensional, non-linear system of equations is often\ncomputationally expensive and even prohibitive in practice. The major challenge\ntowards reducing such models is providing the guarantees as to how the solution\nof the reduced model relates to that of the original model, while avoiding to\nsolve the original model. In this paper, we have designed and tested an\napproximation method for ODE models of biochemical reaction systems, in which\nthe guarantees are our major requirement. Borrowing from tropical analysis\ntechniques, dominance relations among terms of each species' ODE are exploited\nto simplify the original model, by neglecting the dominated terms. As the\ndominant subsystems can change during the system's dynamics, depending on which\nspecies dominate the others, several possible modes exist. Thus, simpler models\nconsisting of only the dominant subsystems can be assembled into hybrid,\npiecewise smooth models, which approximate the behavior of the initial system.\nBy combining the detection of dominated terms with symbolic bounds propagation,\nwe show how to approximate the original model by an assembly of simpler models,\nconsisting in ordinary differential equations that provide time-dependent lower\nand upper bounds for the concentrations of the initial models species. Our\nmethod provides sound interval bounds for the concentrations of the chemical\nspecies, and hence can serve to evaluate the faithfulness of\ntropicalization-based reduction heuristics for ODE models of biochemical\nreduction systems. The method is tested on several case studies.\n", "versions": [{"version": "v1", "created": "Sat, 29 Dec 2018 17:30:35 GMT"}, {"version": "v2", "created": "Thu, 21 Mar 2019 09:56:13 GMT"}], "update_date": "2019-03-22", "authors_parsed": [["Beica", "Andreea", ""], ["Feret", "Jérôme", ""], ["Petrov", "Tatjana", ""]]}, {"id": "1812.11627", "submitter": "Griffin Chure", "authors": "Rob Phillips, Nathan M. Belliveau, Griffin Chure, Hernan G. Garcia,\n  Manuel Razo-Mejia, Clarissa Scholes", "title": "Figure 1 Theory Meets Figure 2 Experiments in the Study of Gene\n  Expression", "comments": "55 pages, 27 figures, review article", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.MN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  It is tempting to believe that we now own the genome. The ability to read and\nre-write it at will has ushered in a stunning period in the history of science.\nNonetheless, there is an Achilles heel exposed by all of the genomic data that\nhas accrued: we still don't know how to interpret it. Many genes are subject to\nsophisticated programs of transcriptional regulation, mediated by DNA sequences\nthat harbor binding sites for transcription factors which can up- or\ndown-regulate gene expression depending upon environmental conditions. This\ngives rise to an input-output function describing how the level of expression\ndepends upon the parameters of the regulated gene { for instance, on the number\nand type of binding sites in its regulatory sequence. In recent years, the\nability to make precision measurements of expression, coupled with the ability\nto make increasingly sophisticated theoretical predictions, have enabled an\nexplicit dialogue between theory and experiment that holds the promise of\ncovering this genomic Achilles heel. The goal is to reach a predictive\nunderstanding of transcriptional regulation that makes it possible to calculate\ngene expression levels from DNA regulatory sequence. This review focuses on the\ncanonical simple repression motif to ask how well the models that have been\nused to characterize it actually work. We consider a hierarchy of increasingly\nsophisticated experiments in which the minimal parameter set learned at one\nlevel is applied to make quantitative predictions at the next. We show that\nthese careful quantitative dissections provide a template for a predictive\nunderstanding of the many more complex regulatory arrangements found across all\ndomains of life.\n", "versions": [{"version": "v1", "created": "Sun, 30 Dec 2018 23:06:51 GMT"}], "update_date": "2019-01-01", "authors_parsed": [["Phillips", "Rob", ""], ["Belliveau", "Nathan M.", ""], ["Chure", "Griffin", ""], ["Garcia", "Hernan G.", ""], ["Razo-Mejia", "Manuel", ""], ["Scholes", "Clarissa", ""]]}]