[{"id": "1904.01988", "submitter": "Christoph Zechner", "authors": "Lorenzo Duso and Christoph Zechner", "title": "Path mutual information for a class of biochemical reaction networks", "comments": "6 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Living cells encode and transmit information in the temporal dynamics of\nbiochemical components. Gaining a detailed understanding of the input-output\nrelationship in biological systems therefore requires quantitative measures\nthat capture the interdependence between complete time trajectories of\nbiochemical components. Mutual information provides such a measure but its\ncalculation in the context of stochastic reaction networks is associated with\nmathematical challenges. Here we show how to estimate the mutual information\nbetween complete paths of two molecular species that interact with each other\nthrough biochemical reactions. We demonstrate our approach using three simple\ncase studies.\n", "versions": [{"version": "v1", "created": "Wed, 3 Apr 2019 13:06:53 GMT"}], "update_date": "2019-04-04", "authors_parsed": [["Duso", "Lorenzo", ""], ["Zechner", "Christoph", ""]]}, {"id": "1904.02983", "submitter": "Elisenda Feliu", "authors": "Elisenda Feliu, Alan D. Rendall and Carsten Wiuf", "title": "A proof of unlimited multistability for phosphorylation cycles", "comments": null, "journal-ref": null, "doi": "10.1088/1361-6544/ab9a1e", "report-no": null, "categories": "q-bio.MN math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multiple futile cycle is a phosphorylation system in which a molecular\nsubstrate might be phosphorylated sequentially n times by means of an enzymatic\nmechanism. The system has been studied mathematically using reaction network\ntheory and ordinary differential equations. It is known that the system might\nhave at least as many as 2[n/2]+1 steady states (where [x] is the integer part\nof x) for particular choices of parameters. Furthermore, for the simple and\ndual futile cycles (n=1,2) the stability of the steady states has been\ndetermined in the sense that the only steady state of the simple futile cycle\nis globally stable, while there exist parameter values for which the dual\nfutile cycle admits two asymptotically stable and one unstable steady state.\nFor general n, evidence that the possible number of asymptotically stable\nsteady states increases with $n$ has been given, which has led to the\nconjecture that parameter values can be chosen such that [n/2]+1 out of\n2[n/2]+1 steady states are asymptotically stable and the remaining steady\nstates are unstable.\n  We prove this conjecture here by first reducing the system to a smaller one,\nfor which we find a choice of parameter values that give rise to a unique\nsteady state with multiplicity 2[n/2]+1. Using arguments from geometric\nsingular perturbation theory, and a detailed analysis of the centre manifold of\nthis steady state, we achieve the desired result.\n", "versions": [{"version": "v1", "created": "Fri, 5 Apr 2019 10:21:50 GMT"}], "update_date": "2020-10-28", "authors_parsed": [["Feliu", "Elisenda", ""], ["Rendall", "Alan D.", ""], ["Wiuf", "Carsten", ""]]}, {"id": "1904.03910", "submitter": "Peter Csermely", "authors": "Bence Agg, Andrea Csaszar, Mate Szalay-Beko, Daniel V. Veres, Reka\n  Mizsei, Peter Ferdinandy, Peter Csermely and Istvan A. Kovacs", "title": "The EntOptLayout Cytoscape plug-in for the efficient visualization of\n  major protein complexes in protein-protein interaction and signalling\n  networks", "comments": null, "journal-ref": "Bioinformatics 2019 35, 4490-4492", "doi": "10.1093/bioinformatics/btz257", "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn cs.CV physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Network visualizations of complex biological datasets usually\nresult in 'hairball' images, which do not discriminate network modules.\nResults: We present the EntOptLayout Cytoscape plug-in based on a recently\ndeveloped network representation theory. The plug-in provides an efficient\nvisualization of network modules, which represent major protein complexes in\nprotein-protein interaction and signalling networks. Importantly, the tool\ngives a quality score of the network visualization by calculating the\ninformation loss between the input data and the visual representation showing a\n3- to 25-fold improvement over conventional methods. Availability and\nimplementation: The plug-in (running on Windows, Linux, or Mac OS) and its\ntutorial (both in written and video forms) can be downloaded freely under the\nterms of the MIT license from: http://apps.cytoscape.org/apps/entoptlayout.\nSupplementary data are available at Bioinformatics online. Contact:\ncsermely.peter@med.semmelweis-univ.hu\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2019 09:35:20 GMT"}, {"version": "v2", "created": "Fri, 1 Nov 2019 11:47:10 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Agg", "Bence", ""], ["Csaszar", "Andrea", ""], ["Szalay-Beko", "Mate", ""], ["Veres", "Daniel V.", ""], ["Mizsei", "Reka", ""], ["Ferdinandy", "Peter", ""], ["Csermely", "Peter", ""], ["Kovacs", "Istvan A.", ""]]}, {"id": "1904.06514", "submitter": "Fabrizio Pucci Dr.", "authors": "Fabrizio Pucci, Alexander Schug", "title": "Shedding light on the dark matter of the biomolecular structural\n  universe: Progress in RNA 3D structure prediction", "comments": "14 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Structured RNA plays many functionally relevant roles in molecular life.\nStructural information, while required to understand the functional cycles in\ndetail, is challenging to gather. Computational methods promise to complement\nexperimental efforts by predicting three-dimensional RNA models. Here, we\nprovide a concise view of the state of the art methodologies with a focus on\nthe strengths and the weaknesses of the different approaches. Furthermore, we\nanalyzed the recent developments regarding the use of coevolutionary\ninformation and how it can boost the prediction performances. We finally\ndiscuss some open perspectives and challenges for the near future in the RNA\nstructural stability field.\n", "versions": [{"version": "v1", "created": "Sat, 13 Apr 2019 09:58:49 GMT"}], "update_date": "2019-04-16", "authors_parsed": [["Pucci", "Fabrizio", ""], ["Schug", "Alexander", ""]]}, {"id": "1904.06639", "submitter": "Takehiro Tottori", "authors": "Takehiro Tottori, Masashi Fujii, Shinya Kuroda", "title": "Robustness against additional noise in cellular information transmission", "comments": null, "journal-ref": "Phys. Rev. E 100, 042403 (2019)", "doi": "10.1103/PhysRevE.100.042403", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fluctuations in intracellular reactions (intrinsic noise) reduce the\ninformation transmitted from an extracellular input to a cellular response.\nHowever, recent studies have demonstrated that the decrease in the transmitted\ninformation with respect to extracellular input fluctuations (extrinsic noise)\nis smaller when the intrinsic noise is larger. Therefore, it has been suggested\nthat robustness against extrinsic noise increases with the level of the\nintrinsic noise. We call this phenomenon intrinsic noise-induced robustness\n(INIR). As previous studies on this phenomenon have focused on complex\nbiochemical reactions, the relation between INIR and the input--output of a\nsystem is unclear. Moreover, the mechanism of INIR remains elusive. In this\npaper, we address these questions by analyzing simple models. We first analyze\na model in which the input--output relation is linear. We show that the\nrobustness against extrinsic noise increases with the intrinsic noise,\nconfirming the INIR phenomenon. Moreover, the robustness against the extrinsic\nnoise is more strongly dependent on the intrinsic noise when the variance of\nthe intrinsic noise is larger than that of the input distribution. Next, we\nanalyze a threshold model in which the output depends on whether the input\nexceeds the threshold. When the threshold is equal to the mean of the input,\nINIR is realized, but when the threshold is much larger than the mean, the\nthreshold model exhibits stochastic resonance, and INIR is not always apparent.\nThe robustness against extrinsic noise and the transmitted information can be\ntraded off against one another in the linear model and the threshold model\nwithout stochastic resonance, whereas they can be simultaneously increased in\nthe threshold model with stochastic resonance.\n", "versions": [{"version": "v1", "created": "Sun, 14 Apr 2019 06:48:26 GMT"}, {"version": "v2", "created": "Thu, 2 May 2019 03:25:06 GMT"}, {"version": "v3", "created": "Thu, 3 Oct 2019 01:14:18 GMT"}], "update_date": "2019-10-09", "authors_parsed": [["Tottori", "Takehiro", ""], ["Fujii", "Masashi", ""], ["Kuroda", "Shinya", ""]]}, {"id": "1904.06973", "submitter": "Ali Jalilvand", "authors": "Ali Jalilvand, Behzad Akbari, Fatemeh Zare Mirakabad, Foad Ghaderi", "title": "Disease gene prioritization using network topological analysis from a\n  sequence based human functional linkage network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sequencing large number of candidate disease genes which cause diseases in\norder to identify the relationship between them is an expensive and\ntime-consuming task. To handle these challenges, different computational\napproaches have been developed. Based on the observation that genes associated\nwith similar diseases have a higher likelihood of interaction, a large class of\nthese approaches relay on analyzing the topological properties of biological\nnetworks. However, the incomplete and noisy nature of biological networks is\nknown as an important challenge in these approaches. In this paper, we propose\na two-step framework for disease gene prioritization: (1) construction of a\nreliable human FLN using sequence information and machine learning techniques,\n(2) prioritizing the disease gene relations based on the constructed FLN. On\nour framework, unlike other FLN based frameworks that using FLNs based on\nintegration of various low quality biological data, the sequence of proteins is\nused as the comprehensive data to construct a reliable initial network. In\naddition, the physicochemical properties of amino-acids are employed to\ndescribe the functionality of proteins. All in all, the proposed approach is\nevaluated and the results indicate the high efficiency and validity of the FLN\nin disease gene prioritization.\n", "versions": [{"version": "v1", "created": "Mon, 15 Apr 2019 11:39:11 GMT"}], "update_date": "2019-04-16", "authors_parsed": [["Jalilvand", "Ali", ""], ["Akbari", "Behzad", ""], ["Mirakabad", "Fatemeh Zare", ""], ["Ghaderi", "Foad", ""]]}, {"id": "1904.07780", "submitter": "Dongya Jia", "authors": "Dongya Jia, Xuefei Li, Federico Bocci, Shubham Tripathi, Youyuan Deng,\n  Mohit Kumar Jolly, Jose N. Onuchic, Herbert Levine", "title": "Quantifying cancer epithelial-mesenchymal plasticity and its association\n  with stemness and immune response", "comments": "50 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cancer cells can acquire a spectrum of stable hybrid epithelial/mesenchymal\n(E/M) states during epithelial-mesenchymal transition (EMT). Cells in these\nhybrid E/M phenotypes often combine epithelial and mesenchymal features and\ntend to migrate collectively commonly as small clusters. Such collectively\nmigrating cancer cells play a pivotal role in seeding metastases and their\npresence in cancer patients indicates an adverse prognostic factor. Moreover,\ncancer cells in hybrid E/M phenotypes tend to be more associated with stemness\nwhich endows them with tumor-initiation ability and therapy resistance. Most\nrecently, cells undergoing EMT have been shown to promote immune suppression\nfor better survival. A systematic understanding of the emergence of hybrid E/M\nphenotypes and the connection of EMT with stemness and immune suppression would\ncontribute to more effective therapeutic strategies. In this review, we first\ndiscuss recent efforts combining theoretical and experimental approaches to\nelucidate mechanisms underlying EMT multi-stability (i.e. the existence of\nmultiple stable phenotypes during EMT) and the properties of hybrid E/M\nphenotypes. Following we discuss non-cell-autonomous regulation of EMT by cell\ncooperation and extracellular matrix. Afterwards, we discuss various metrics\nthat can be used to quantify EMT spectrum. We further describe possible\nmechanisms underlying the formation of clusters of circulating tumor cells.\nLast but not least, we summarize recent systems biology analysis of the role of\nEMT in the acquisition of stemness and immune suppression.\n", "versions": [{"version": "v1", "created": "Tue, 16 Apr 2019 16:04:50 GMT"}], "update_date": "2019-04-17", "authors_parsed": [["Jia", "Dongya", ""], ["Li", "Xuefei", ""], ["Bocci", "Federico", ""], ["Tripathi", "Shubham", ""], ["Deng", "Youyuan", ""], ["Jolly", "Mohit Kumar", ""], ["Onuchic", "Jose N.", ""], ["Levine", "Herbert", ""]]}, {"id": "1904.08094", "submitter": "Atsushi Kamimura", "authors": "Atsushi Kamimura and Kunihiko Kaneko", "title": "Molecular Diversity and Network Complexity in Growing Protocells", "comments": "16 pages, 7 figures, submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A great variety of molecular components is encapsulated in cells. Each of\nthese components is replicated for cell reproduction. To address an essential\nrole of the huge diversity of cellular components, we study a model of\nprotocells that convert resources into catalysts with the aid of a catalytic\nreaction network. As the resources are limited, it is shown that diversity in\nintracellular components is increased to allow the use of diverse resources for\ncellular growth. Scaling relation is demonstrated between resource abundances\nand molecular diversity. We then study how the molecule species diversify and\ncomplex catalytic reaction networks develop through the evolutionary course. It\nis shown that molecule species first appear, at some generations, as parasitic\nones that do not contribute to replication of other molecules. Later, the\nspecies turn to be host species that support the replication of other species.\nWith this successive increase of host species, a complex joint network evolves.\nThe present study sheds new light on the origin of molecular diversity and\ncomplex reaction network at the primitive stage of a cell.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2019 06:02:19 GMT"}], "update_date": "2019-04-18", "authors_parsed": [["Kamimura", "Atsushi", ""], ["Kaneko", "Kunihiko", ""]]}, {"id": "1904.08216", "submitter": "Jakub J\\k{e}drak", "authors": "Jakub J\\k{e}drak, Maciej Kwiatkowski, and Anna Ochab-Marcinek", "title": "Exactly solvable model of gene expression in proliferating bacterial\n  cell population with stochastic protein bursts and protein partitioning", "comments": "14 pages, 4 figures, accepted in Physical Review E", "journal-ref": null, "doi": "10.1103/PhysRevE.99.042416", "report-no": null, "categories": "physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many of the existing stochastic models of gene expression contain the\nfirst-order decay reaction term that may describe active protein degradation or\ndilution. If the model variable is interpreted as the molecule number, and not\nconcentration, the decay term may also approximate the loss of protein\nmolecules due to cell division as a continuous degradation process. The seminal\nmodel of that kind leads to gamma distributions of protein levels, whose\nparameters are defined by the mean frequency of protein bursts and mean burst\nsize. However, such models (whether interpreted in terms of molecule numbers or\nconcentrations) do not correctly account for the noise due to protein\npartitioning between daughter cells.\n  We present an exactly solvable stochastic model of gene expression in cells\ndividing at random times, where we assume description in terms of molecule\nnumbers with a constant mean protein burst size. The model is based on a\npopulation balance equation supplemented with protein production in random\nbursts.\n  If protein molecules are partitioned equally between daughter cells, we\nobtain at steady state the analytical expressions for probability distributions\nsimilar in shape to gamma distribution, yet with quite different values of mean\nburst size and mean burst frequency than would result from fitting of the\nclassical continuous-decay model to these distributions. For random\npartitioning of protein molecules between daughter cells, we obtain the moment\nequations for the protein number distribution and thus the analytical formulas\nfor the squared coefficient of variation.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2019 12:09:53 GMT"}], "update_date": "2019-05-22", "authors_parsed": [["Jędrak", "Jakub", ""], ["Kwiatkowski", "Maciej", ""], ["Ochab-Marcinek", "Anna", ""]]}, {"id": "1904.08967", "submitter": "Daniele Cappelletti", "authors": "David F. Anderson, Daniele Cappelletti, and Jinsu Kim", "title": "Stochastically modeled weakly reversible reaction networks with a single\n  linkage class", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been known for nearly a decade that deterministically modeled reaction\nnetworks that are weakly reversible and consist of a single linkage class have\ntrajectories that are bounded from both above and below by positive constants\n(so long as the initial condition has strictly positive components). It is\nconjectured that the stochastically modeled analogs of these systems are\npositive recurrent. We prove this conjecture in the affirmative under the\nfollowing additional assumptions: (i) the system is binary and (ii) for each\nspecies, there is a complex (vertex in the associated reaction diagram) that is\na multiple of that species. To show this result, a new proof technique is\ndeveloped in which we study the recurrence properties of the $n-$step embedded\ndiscrete time Markov chain.\n", "versions": [{"version": "v1", "created": "Thu, 18 Apr 2019 18:29:11 GMT"}, {"version": "v2", "created": "Thu, 16 Jan 2020 15:36:03 GMT"}], "update_date": "2020-01-17", "authors_parsed": [["Anderson", "David F.", ""], ["Cappelletti", "Daniele", ""], ["Kim", "Jinsu", ""]]}, {"id": "1904.11583", "submitter": "David Anderson", "authors": "David F. Anderson, David Schnoerr, and Chaojie Yuan", "title": "Time-dependent product-form Poisson distributions for reaction networks\n  with higher order complexes", "comments": "Corrected an error in the proof of Lemma 2.1. Added examples and\n  images from simulation results", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that stochastically modeled reaction networks that are\ncomplex balanced admit a stationary distribution that is a product of Poisson\ndistributions. In this paper, we consider the following related question:\nsupposing that the initial distribution of a stochastically modeled reaction\nnetwork is a product of Poissons, under what conditions will the distribution\nremain a product of Poissons for all time? By drawing inspiration from Crispin\nGardiner's \"Poisson representation\" for the solution to the chemical master\nequation, we provide a necessary and sufficient condition for such a\nproduct-form distribution to hold for all time. Interestingly, the condition is\na dynamical \"complex-balancing\" for only those complexes that have multiplicity\ngreater than or equal to two (i.e. the higher order complexes that yield\nnon-linear terms to the dynamics). We term this new condition the \"dynamical\nand restricted complex balance\" condition (DR for short).\n", "versions": [{"version": "v1", "created": "Thu, 25 Apr 2019 20:58:10 GMT"}, {"version": "v2", "created": "Mon, 18 Nov 2019 17:11:32 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Anderson", "David F.", ""], ["Schnoerr", "David", ""], ["Yuan", "Chaojie", ""]]}, {"id": "1904.11633", "submitter": "Alicia Dickenstein", "authors": "Magal\\'i Giaroli, Rick Rischter, Mercedes P\\'erez Mill\\'an, Alicia\n  Dickenstein", "title": "Parameter regions that give rise to 2[n/2]+1 positive steady states in\n  the n-site phosphorylation system", "comments": "20 pages. The maple and SAGE files with our computations are\n  available at: http://mate.dm.uba.ar/~alidick/DGRPMFiles/", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.AG math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The distributive sequential n-site phosphorylation/dephosphorylation system\nis an important building block in networks of chemical reactions arising in\nmolecular biology, which has been intensively studied. In the nice paper of\nWang and Sontag (2008) it is shown that for certain choices of the reaction\nrate constants and total conservation constants, the system can have 2[n/2]+1\npositive steady states (that is, n+1 positive steady states for n even and n\npositive steady states for n odd). In this paper we give open parameter regions\nin the space of reaction rate constants and total conservation constants that\nensure these number of positive steady states, while assuming in the modeling\nthat roughly only 1/4 of the intermediates occur in the reaction mechanism.\nThis result is based on the general framework developed by Bihan, Dickenstein,\nand Giaroli (2018), which can be applied to other networks. We also describe\nhow to implement these tools to search for multistationarity regions in a\ncomputer algebra system and present some computer aided results.\n", "versions": [{"version": "v1", "created": "Fri, 26 Apr 2019 00:58:35 GMT"}], "update_date": "2019-04-29", "authors_parsed": [["Giaroli", "Magalí", ""], ["Rischter", "Rick", ""], ["Millán", "Mercedes Pérez", ""], ["Dickenstein", "Alicia", ""]]}]