[{"id": "2002.00731", "submitter": "Matej Trojak", "authors": "Matej Troj\\'ak, David \\v{S}afr\\'anek, Lubo\\v{s} Brim", "title": "Executable Biochemical Space for Specification and Analysis of\n  Biochemical Systems", "comments": "18 pages, 5 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0238838", "report-no": null, "categories": "q-bio.MN cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the second generation of a rule-based language called Biochemical\nSpace Language (BCSL) that combines the advantages of different approaches and\nthus makes an effort to overcome several problems with existing solutions. The\nkey aspect of the language is the level of abstraction it uses, which allows\nscalable and compact hierarchical specification of biochemical entities. This\nabstraction enables unique analysis techniques to reason about properties of\nmodels written in the language on the semantic and syntactic level.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2020 11:02:44 GMT"}], "update_date": "2021-01-27", "authors_parsed": [["Troják", "Matej", ""], ["Šafránek", "David", ""], ["Brim", "Luboš", ""]]}, {"id": "2002.00931", "submitter": "Christoph Zechner", "authors": "Lorenzo Duso and Christoph Zechner", "title": "Stochastic reaction networks in dynamic compartment populations", "comments": "9 pages, 3 figures, appendix included", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compartmentalization of biochemical processes underlies all biological\nsystems, from the organelle to the tissue scale. Theoretical models to study\nthe interplay between noisy reaction dynamics and compartmentalization are\nsparse, and typically very challenging to analyze computationally. Recent\nstudies have made progress towards addressing this problem in the context of\nconcrete biological systems but general approaches remain lacking. In this work\nwe propose a mathematical framework based on counting processes that allows us\nto study compartment populations with arbitrary interactions and internal\nbiochemistry. We provide an efficient description of the population dynamics in\nterms of differential equations which capture moments of the population and\ntheir variability. We demonstrate the relevance of our approach using several\ncase studies inspired by biological systems at different scales.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2020 18:21:52 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Duso", "Lorenzo", ""], ["Zechner", "Christoph", ""]]}, {"id": "2002.01289", "submitter": "Pietro  Hiram Guzzi", "authors": "Pietro Hiram Guzzi, Emanuel Salerno, Giuseppe Tradigo, and Pierangelo\n  Veltri", "title": "Extracting Dense and Connected Subgraphs in Dual Networks by Network\n  Alignment", "comments": null, "journal-ref": null, "doi": "10.1109/ACCESS.2020.3020924", "report-no": null, "categories": "cs.DS cs.SI q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of network based approaches to model and analyse large datasets is\ncurrently a growing research field. For instance in biology and medicine,\nnetworks are used to model interactions among biological molecules as well as\nrelations among patients. Similarly, data coming from social networks can be\ntrivially modelled by using graphs. More recently, the use of dual networks\ngained the attention of researchers. A dual network model uses a pair of graphs\nto model a scenario in which one of the two graphs is usually unweighted (a\nnetwork representing physical associations among nodes) while the other one is\nedge-weighted (a network representing conceptual associations among nodes). In\nthis paper we focus on the problem of finding the Densest Connected sub-graph\n(DCS) having the largest density in the conceptual network which is also\nconnected in the physical network. The problem is relevant but also\ncomputationally hard, therefore the need for introducing of novel algorithms\narises. We formalise the problem and then we map DCS into a graph alignment\nproblem. Then we propose a possible solution. A set of experiments is also\npresented to support our approach.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 14:10:50 GMT"}], "update_date": "2020-09-04", "authors_parsed": [["Guzzi", "Pietro Hiram", ""], ["Salerno", "Emanuel", ""], ["Tradigo", "Giuseppe", ""], ["Veltri", "Pierangelo", ""]]}, {"id": "2002.01571", "submitter": "Hyobin Kim", "authors": "Hyobin Kim, Stalin Mu\\~noz, Pamela Osuna, and Carlos Gershenson", "title": "Antifragility Predicts the Robustness and Evolvability of Biological\n  Networks through Multi-class Classification with a Convolutional Neural\n  Network", "comments": "22 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO cs.LG nlin.CG q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Robustness and evolvability are essential properties to the evolution of\nbiological networks. To determine if a biological network is robust and/or\nevolvable, it is required to compare its functions before and after mutations.\nHowever, this sometimes takes a high computational cost as the network size\ngrows. Here we develop a predictive method to estimate the robustness and\nevolvability of biological networks without an explicit comparison of\nfunctions. We measure antifragility in Boolean network models of biological\nsystems and use this as the predictor. Antifragility occurs when a system\nbenefits from external perturbations. By means of the differences of\nantifragility between the original and mutated biological networks, we train a\nconvolutional neural network (CNN) and test it to classify the properties of\nrobustness and evolvability. We found that our CNN model successfully\nclassified the properties. Thus, we conclude that our antifragility measure can\nbe used as a predictor of the robustness and evolvability of biological\nnetworks.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 22:52:28 GMT"}, {"version": "v2", "created": "Wed, 2 Sep 2020 10:33:00 GMT"}], "update_date": "2020-09-03", "authors_parsed": [["Kim", "Hyobin", ""], ["Muñoz", "Stalin", ""], ["Osuna", "Pamela", ""], ["Gershenson", "Carlos", ""]]}, {"id": "2002.01889", "submitter": "Tatjana Petrov", "authors": "Tatjana Petrov and Denis Repin", "title": "Automated Deep Abstractions for Stochastic Chemical Reaction Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Predicting stochastic cellular dynamics as emerging from the mechanistic\nmodels of molecular interactions is a long-standing challenge in systems\nbiology: low-level chemical reaction network (CRN) models give raise to a\nhighly-dimensional continuous-time Markov chain (CTMC) which is computationally\ndemanding and often prohibitive to analyse in practice. A recently proposed\nabstraction method uses deep learning to replace this CTMC with a discrete-time\ncontinuous-space process, by training a mixture density deep neural network\nwith traces sampled at regular time intervals (which can obtained either by\nsimulating a given CRN or as time-series data from experiment). The major\nadvantage of such abstraction is that it produces a computational model that is\ndramatically cheaper to execute, while preserving the statistical features of\nthe training data. In general, the abstraction accuracy improves with the\namount of training data. However, depending on a CRN, the overall quality of\nthe method -- the efficiency gain and abstraction accuracy -- will also depend\non the choice of neural network architecture given by hyper-parameters such as\nthe layer types and connections between them. As a consequence, in practice,\nthe modeller would have to take care of finding the suitable architecture\nmanually, for each given CRN, through a tedious and time-consuming\ntrial-and-error cycle. In this paper, we propose to further automatise deep\nabstractions for stochastic CRNs, through learning the optimal neural network\narchitecture along with learning the transition kernel of the abstract process.\nAutomated search of the architecture makes the method applicable directly to\nany given CRN, which is time-saving for deep learning experts and crucial for\nnon-specialists. We implement the method and demonstrate its performance on a\nnumber of representative CRNs with multi-modal emergent phenotypes.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2020 13:49:58 GMT"}], "update_date": "2020-02-06", "authors_parsed": [["Petrov", "Tatjana", ""], ["Repin", "Denis", ""]]}, {"id": "2002.03288", "submitter": "Xiang Zou", "authors": "Xiang Zou", "title": "A Thermodynamic Model for Active Ion Transport", "comments": "13 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Active ion transport is very critical for living cells to maintain and\nregular internal and external environment. It is known that adenosine\n5'-triphosphate (ATP) is a general energy source that applies bond energy for\npumps to overcome ion concentration gradient. In this study, we introduce a\nnovel thermodynamic model for active ion transport, which allows the pump to\nact as a 'Maxwell's demon', and also conforms to the second law of\nthermodynamics. Transport against the gradient is caused by the thermodynamic\nfluctuation with information recording in ATP stream. Besides, exhaustive\nexperiments about Na-K ATPase performed in the red cell ghost system are\nreviewed to verify this model, and all the results can support the solvable\ntheory about the working mechanism of demon pumps. Our findings indicate the\npossible role of ATP as an information carrier but not energy currency. The\nhigh-energy phosphate bonds can improve the efficiency of information recording\nin relevance to ion transport and may mainly convert to heat.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2020 05:28:05 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Zou", "Xiang", ""]]}, {"id": "2002.03410", "submitter": "Julie Jiang", "authors": "Julie Jiang, Li-Ping Liu, and Soha Hassoun", "title": "Learning graph representations of biochemical networks and its\n  application to enzymatic link prediction", "comments": "6 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The complete characterization of enzymatic activities between molecules\nremains incomplete, hindering biological engineering and limiting biological\ndiscovery. We develop in this work a technique, Enzymatic Link Prediction\n(ELP), for predicting the likelihood of an enzymatic transformation between two\nmolecules. ELP models enzymatic reactions catalogued in the KEGG database as a\ngraph. ELP is innovative over prior works in using graph embedding to learn\nmolecular representations that capture not only molecular and enzymatic\nattributes but also graph connectivity.\n  We explore both transductive (test nodes included in the training graph) and\ninductive (test nodes not part of the training graph) learning models. We show\nthat ELP achieves high AUC when learning node embeddings using both graph\nconnectivity and node attributes. Further, we show that graph embedding for\npredicting enzymatic links improves link prediction by 24% over\nfingerprint-similarity-based approaches. To emphasize the importance of graph\nembedding in the context of biochemical networks, we illustrate how graph\nembedding can also guide visualization.\n  The code and datasets are available through\nhttps://github.com/HassounLab/ELP.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2020 18:00:14 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Jiang", "Julie", ""], ["Liu", "Li-Ping", ""], ["Hassoun", "Soha", ""]]}, {"id": "2002.03586", "submitter": "Thomas Sturm", "authors": "Hamid Rahkooy and Thomas Sturm", "title": "First-Order Tests for Toricity", "comments": null, "journal-ref": "Proc. CASC 2020, LNCS 12291, pp.510-527, Springer 2020", "doi": "10.1007/978-3-030-60026-6_30", "report-no": null, "categories": "cs.SC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by problems arising with the symbolic analysis of steady state\nideals in Chemical Reaction Network Theory, we consider the problem of testing\nwhether the points in a complex or real variety with non-zero coordinates form\na coset of a multiplicative group. That property corresponds to Shifted\nToricity, a recent generalization of toricity of the corresponding polynomial\nideal. The key idea is to take a geometric view on varieties rather than an\nalgebraic view on ideals. Recently, corresponding coset tests have been\nproposed for complex and for real varieties. The former combine numerous\ntechniques from commutative algorithmic algebra with Gr\\\"obner bases as the\ncentral algorithmic tool. The latter are based on interpreted first-order logic\nin real closed fields with real quantifier elimination techniques on the\nalgorithmic side. Here we take a new logic approach to both theories, complex\nand real, and beyond. Besides alternative algorithms, our approach provides a\nunified view on theories of fields and helps to understand the relevance and\ninterconnection of the rich existing literature in the area, which has been\nfocusing on complex numbers, while from a scientific point of view the\n(positive) real numbers are clearly the relevant domain in chemical reaction\nnetwork theory. We apply prototypical implementations of our new approach to a\nset of 129 models from the BioModels repository.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2020 07:56:07 GMT"}], "update_date": "2020-10-22", "authors_parsed": [["Rahkooy", "Hamid", ""], ["Sturm", "Thomas", ""]]}, {"id": "2002.03640", "submitter": "Carla Bosia Dr", "authors": "Elsi Ferro, Chiara Enrico Bena, Silvia Grigolon, Carla Bosia", "title": "microRNA-mediated noise processing in cells: a fight or a game?", "comments": "10 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past decades microRNAs (miRNA) have much attracted the attention of\nresearchers at the interface between life and theoretical sciences for their\ninvolvement in post-transcriptional regulation and related diseases. Thanks to\nthe always more sophisticated experimental techniques, the role of miRNAs as\n\"noise processing units\" has been further elucidated and two main ways of miRNA\nnoise-control have emerged by combinations of theoretical and experimental\nstudies. While on one side miRNA were thought to buffer gene expression noise,\nit has recently been suggested that miRNA could also increase the cell-to-cell\nvariability of their targets. In this Mini Review, we focus on the miRNA role\nin noise processing and on the inference of the parameters defined by the\nrelated theoretical modelling.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2020 10:41:23 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Ferro", "Elsi", ""], ["Bena", "Chiara Enrico", ""], ["Grigolon", "Silvia", ""], ["Bosia", "Carla", ""]]}, {"id": "2002.04078", "submitter": "Ali Cakmak", "authors": "Ali Cakmak, M. Hasan Celik", "title": "Personalized Metabolic Analysis of Diseases", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The metabolic wiring of patient cells is altered drastically in many\ndiseases, including cancer. Understanding the nature of such changes may pave\nthe way for new therapeutic opportunities, as well as the development of\npersonalized treatment strategies for patients. In this paper, we propose an\nalgorithm, Metabolitics, which allows systems-level analysis of changes in the\nbiochemical network of cells in disease states. It enables the study of a\ndisease at both reaction- and pathway-level granularities for detailed and\nsummarized view of disease etiology. Metabolitics employs flux variability\nanalysis with an objective function which is dynamically built based on the\nbiofluid metabolomics measurements in a personalized manner. Moreover,\nMetabolitics builds classification models for each disease to diagnose patients\nand predict their subgroups based on the computed metabolic network changes. We\ndemonstrate the use of Metabolitics on three distinct diseases, namely, breast\ncancer, Crohn's disease, and colorectal cancer. Our results show that the\nconstructed supervised learning models successfully diagnose patients by\nf1-score of over 90% on the average. Besides, in addition to the confirmation\nof previously reported breast cancer associated pathways, we discovered that\nButanoate metabolism experiences significantly decreased activity, while\nArginine and Proline Metabolism is subject to significant increase in activity,\nwhich have not been reported before. Metabolitics is made available as a Python\npackage in pypi.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2020 20:34:45 GMT"}], "update_date": "2020-02-12", "authors_parsed": [["Cakmak", "Ali", ""], ["Celik", "M. Hasan", ""]]}, {"id": "2002.05748", "submitter": "Yasmine Ahmed", "authors": "Yasmine Ahmed, Cheryl Telmer, and Natasa Miskov-Zivanov", "title": "ACCORDION: Clustering and Selecting Relevant Data for Guided Network\n  Extension and Query Answering", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Querying new information from knowledge sources, in general, and published\nliterature, in particular, aims to provide precise and quick answers to\nquestions raised about a system under study. In this paper, we present\nACCORDION (Automated Clustering Conditional On Relating Data of Interactions tO\na Network), a novel tool and a methodology to enable efficient answering of\nbiological questions by automatically assembling new, or expanding existing\nmodels using published literature. Our approach integrates information\nextraction and clustering with simulation and formal analysis to allow for an\nautomated iterative process that includes assembling, testing and selecting the\nmost relevant models, given a set of desired system properties. We applied our\nmethodology to a model of the circuitry that con-trols T cell differentiation.\nTo evaluate our approach, we compare the model that we obtained, using our\nautomated model extension approach, with the previously published manually\nextended T cell differentiation model. Besides demonstrating automated and\nrapid reconstruction of a model that was previously built manually, ACCORDION\ncan assemble multiple models that satisfy desired properties. As such, it\nreplaces large number of tedious or even imprac-tical manual experiments and\nguides alternative hypotheses and interventions in biological systems.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2020 19:16:02 GMT"}, {"version": "v2", "created": "Tue, 12 May 2020 06:48:37 GMT"}], "update_date": "2020-05-13", "authors_parsed": [["Ahmed", "Yasmine", ""], ["Telmer", "Cheryl", ""], ["Miskov-Zivanov", "Natasa", ""]]}, {"id": "2002.07064", "submitter": "Michele Gentili", "authors": "Michele Gentili, Leonardo Martini, Manuela Petti, Lorenzo Farina and\n  Luca Becchetti", "title": "Biological Random Walks: integrating heterogeneous data in disease gene\n  prioritization", "comments": null, "journal-ref": "2019 IEEE Conference on Computational Intelligence in\n  Bioinformatics and Computational Biology (CIBCB), 2019, 1-8", "doi": "10.1109/CIBCB.2019.8791472", "report-no": null, "categories": "q-bio.MN cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work proposes a unified framework to leverage biological information in\nnetwork propagation-based gene prioritization algorithms. Preliminary results\non breast cancer data show significant improvements over state-of-the-art\nbaselines, such as the prioritization of genes that are not identified as\npotential candidates by interactome-based algorithms, but that appear to be\ninvolved in/or potentially related to breast cancer, according to a functional\nanalysis based on recent literature.\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2020 17:46:35 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Gentili", "Michele", ""], ["Martini", "Leonardo", ""], ["Petti", "Manuela", ""], ["Farina", "Lorenzo", ""], ["Becchetti", "Luca", ""]]}, {"id": "2002.08132", "submitter": "J\\'anos T\\'oth PhD", "authors": "Seyed Mahdi Shavarani and J\\'anos T\\'oth and B\\'ela Vizv\\'ari", "title": "How to generate species with positive concentrations for all positive\n  times?", "comments": "19 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a reaction (network) we are looking for minimal sets of species\nstarting from which all the species will have positive concentrations for all\npositive times in the domain of existence of the solution of the induced\nkinetic differential equation. We present three algorithms to solve the\nproblem. The first one essentially checks all the possible subsets of the sets\nof species. This can obviously work for only a few dozen species because of\ncombinatorial explosion. The second one is based on an integer programming\nreformulation of the problem. The third one walks around the state space of the\nproblem in a systematic way and produces all the minimal sets of the\nadvantageous initial species, and works also for large systems. All the\nalgorithms rely heavily on the concept of Volpert indices, used earlier for the\ndecomposition of overall reactions [Kov\\'acs \\textit{et al., Physical Chemistry\nChemical Physics} 2004, 6, 1236]. Relations to the permanence hypothesis,\npossible economic or medical uses of the solution of the problem are analyzed,\nand open problems are formulated at the end.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 12:25:35 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Shavarani", "Seyed Mahdi", ""], ["Tóth", "János", ""], ["Vizvári", "Béla", ""]]}, {"id": "2002.08501", "submitter": "Mark Byrne", "authors": "Mark Byrne", "title": "Simple post-translational circadian clock models from selective\n  sequestration", "comments": "8 pages, submitted to JBR", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.BM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is possible that there are post-translational circadian oscillators that\ncontinue functioning in the absence of negative feedback transcriptional\nrepression in many cell types from diverse organisms. Apart from the KaiABC\nsystem from cyanobacteria, the molecular components and interactions required\nto create in-vitro (\"test-tube\") circadian oscillations in different cell types\nare currently unknown. Inspired by the KaiABC system, I provide\n\"proof-of-principle\" mathematical models that a protein with 2 (or more)\nmodification sites which selectively sequesters an effector/cofactor molecule\ncan function as a circadian time-keeper. The 2-site mechanism can be\nimplemented using two relatively simple coupled non-linear ODEs in terms of\nsite occupancy; the models do not require overly special fine-tuning of\nparameters for generating stable limit cycle oscillations.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 00:02:24 GMT"}, {"version": "v2", "created": "Fri, 21 Feb 2020 05:03:42 GMT"}], "update_date": "2020-02-24", "authors_parsed": [["Byrne", "Mark", ""]]}, {"id": "2002.09062", "submitter": "Weiqi Ji", "authors": "Weiqi Ji and Sili Deng", "title": "Autonomous Discovery of Unknown Reaction Pathways from Data by Chemical\n  Reaction Neural Network", "comments": null, "journal-ref": "The Journal of Physical Chemistry A, 2021", "doi": "10.1021/acs.jpca.0c09316", "report-no": null, "categories": "q-bio.MN cs.LG physics.chem-ph stat.ML", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Chemical reactions occur in energy, environmental, biological, and many other\nnatural systems, and the inference of the reaction networks is essential to\nunderstand and design the chemical processes in engineering and life sciences.\nYet, revealing the reaction pathways for complex systems and processes is still\nchallenging due to the lack of knowledge of the involved species and reactions.\nHere, we present a neural network approach that autonomously discovers reaction\npathways from the time-resolved species concentration data. The proposed\nChemical Reaction Neural Network (CRNN), by design, satisfies the fundamental\nphysics laws, including the Law of Mass Action and the Arrhenius Law.\nConsequently, the CRNN is physically interpretable such that the reaction\npathways can be interpreted, and the kinetic parameters can be quantified\nsimultaneously from the weights of the neural network. The inference of the\nchemical pathways is accomplished by training the CRNN with species\nconcentration data via stochastic gradient descent. We demonstrate the\nsuccessful implementations and the robustness of the approach in elucidating\nthe chemical reaction pathways of several chemical engineering and biochemical\nsystems. The autonomous inference by the CRNN approach precludes the need for\nexpert knowledge in proposing candidate networks and addresses the curse of\ndimensionality in complex systems. The physical interpretability also makes the\nCRNN capable of not only fitting the data for a given system but also\ndeveloping knowledge of unknown pathways that could be generalized to similar\nchemical systems.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 23:36:46 GMT"}, {"version": "v2", "created": "Fri, 8 Jan 2021 22:18:36 GMT"}], "update_date": "2021-01-22", "authors_parsed": [["Ji", "Weiqi", ""], ["Deng", "Sili", ""]]}, {"id": "2002.09631", "submitter": "Alfonso Vivanco Lira", "authors": "A. Vivanco-Lira", "title": "Novel therapeutic targets in chronic myeloid leukaemia through a\n  discrete time discrete Markov chain model of BCR-ABL1 interactions", "comments": "32 pages, 1 table, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chronic Myeloid Leukaemia (CML) is a blood-derived proliferative disorder,\nwhich is highly associated to a translocation of chromosomes 9 and 22 or the\ncreation of Philadelphia chromosome Ph(+) cases, inducing the synthesis of a\nchimeric fusion protein, namely BCR-ABL1 (Breakpoint Cluster Region-Abelson 1\nchimeric protein), which is known for driving the pathophysiology of the\ndisease, however variants of CML are also recognized as CML Ph(-), these\nnonetheless account for a small percentage of the overall CML patients; posing\nthus the question whether BCR-ABL1 fusion protein is required for the whole of\nthe pathophysiology of CML. Hereof, through a stochastic description, a\ndiscrete time discrete Markov chain depicts the various protein-protein\ninteractions of BCR-ABL1 to better understand signalling pathways and\ntime-dependent evolution of these pathways, as well as to provide prospective\ntherapeutic protein targets to improve both the specificity of the treatment\nand the life-expectancy of the patients.\n", "versions": [{"version": "v1", "created": "Sat, 22 Feb 2020 05:29:04 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Vivanco-Lira", "A.", ""]]}, {"id": "2002.10567", "submitter": "Sarah Harvey", "authors": "S. E. Harvey, S. Lahiri, S. Ganguli", "title": "Universal energy accuracy tradeoffs in nonequilibrium cellular sensing", "comments": "For associated mp4 files, see\n  https://github.com/ganguli-lab/Energy_Accuracy_Tradeoff_Cellular_Sensing", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.CB q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We combine stochastic thermodynamics, large deviation theory, and information\ntheory to derive fundamental limits on the accuracy with which single cell\nreceptors can detect external concentrations. We show that if estimation is\nperformed by an ideal observer of the entire trajectory of receptor states,\nthen no energy consuming non-equilibrium receptor that can be divided into\nsignaling and non-signaling states can outperform an equilibrium two-state\nreceptor. Moreover, we derive an energy accuracy tradeoff for such general\nnon-equilibrium receptors when the estimation is performed by a simple observer\nof the duration the receptor is in signaling states. This tradeoff reveals that\nthe simple observer can only attain the performance of the ideal observer in\nthe limit of large receptor energy consumption and size. Our results generalize\nthe classic 1977 Berg-Purcell limit on cellular sensing along multiple\ndimensions, and yield a novel thermodynamic uncertainty relation for the time a\nphysical system spends in a pool of states.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2020 22:04:37 GMT"}, {"version": "v2", "created": "Tue, 1 Sep 2020 19:44:15 GMT"}], "update_date": "2020-09-03", "authors_parsed": [["Harvey", "S. E.", ""], ["Lahiri", "S.", ""], ["Ganguli", "S.", ""]]}, {"id": "2002.11612", "submitter": "Cecilia Hern\\'andez", "authors": "Daniel Inostroza, Cecilia Hern\\'andez, Diego Seco, Gonzalo Navarro,\n  and Alvaro Olivera-Nappa", "title": "Cell cycle and protein complex dynamics in discovering signaling\n  pathways", "comments": null, "journal-ref": "Journal of Bioinformatics and Computational Biology 2019", "doi": "10.1142/S0219720019500112", "report-no": null, "categories": "q-bio.MN cs.CE q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Signaling pathways are responsible for the regulation of cell processes, such\nas monitoring the external environment, transmitting information across\nmembranes, and making cell fate decisions. Given the increasing amount of\nbiological data available and the recent discoveries showing that many diseases\nare related to the disruption of cellular signal transduction cascades, in\nsilico discovery of signaling pathways in cell biology has become an active\nresearch topic in past years. However, reconstruction of signaling pathways\nremains a challenge mainly because of the need for systematic approaches for\npredicting causal relationships, like edge direction and activation/inhibition\namong interacting proteins in the signal flow. We propose an approach for\npredicting signaling pathways that integrates protein interactions, gene\nexpression, phenotypes, and protein complex information. Our method first finds\ncandidate pathways using a directed-edge-based algorithm and then defines a\ngraph model to include causal activation relationships among proteins, in\ncandidate pathways using cell cycle gene expression and phenotypes to infer\nconsistent pathways in yeast. Then, we incorporate protein complex coverage\ninformation for deciding on the final predicted signaling pathways. We show\nthat our approach improves the predictive results of the state of the art using\ndifferent ranking metrics.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2020 16:55:24 GMT"}, {"version": "v2", "created": "Mon, 6 Apr 2020 17:07:05 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Inostroza", "Daniel", ""], ["Hernández", "Cecilia", ""], ["Seco", "Diego", ""], ["Navarro", "Gonzalo", ""], ["Olivera-Nappa", "Alvaro", ""]]}, {"id": "2002.12693", "submitter": "Hamid Rahkooy", "authors": "Hamid Rahkooy and Ovidiu Radulescu and Thomas Sturm", "title": "A Linear Algebra Approach for Detecting Binomiality of Steady State\n  Ideals of Reversible Chemical Reaction Networks", "comments": null, "journal-ref": "Proc. CASC 2020, LNCS 12291, pp.492-509, Springer 2020", "doi": "10.1007/978-3-030-60026-6_29", "report-no": null, "categories": "cs.SC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by problems from Chemical Reaction Network Theory, we investigate\nwhether steady state ideals of reversible reaction networks are generated by\nbinomials. We take an algebraic approach considering, besides concentrations of\nspecies, also rate constants as indeterminates. This leads us to the concept of\nunconditional binomiality, meaning binomiality for all values of the rate\nconstants. This concept is different from conditional binomiality that applies\nwhen rate constant values or relations among rate constants are given. We start\nby representing the generators of a steady state ideal as sums of binomials,\nwhich yields a corresponding coefficient matrix. On these grounds we propose an\nefficient algorithm for detecting unconditional binomiality. That algorithm\nuses exclusively elementary column and row operations on the coefficient\nmatrix. We prove asymptotic worst case upper bounds on the time complexity of\nour algorithm. Furthermore, we experimentally compare its performance with\nother existing methods.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2020 13:07:53 GMT"}, {"version": "v2", "created": "Mon, 15 Jun 2020 17:03:58 GMT"}], "update_date": "2020-10-22", "authors_parsed": [["Rahkooy", "Hamid", ""], ["Radulescu", "Ovidiu", ""], ["Sturm", "Thomas", ""]]}]