[{"id": "2006.00018", "submitter": "Yipei Guo", "authors": "Yipei Guo and Ariel Amir", "title": "Stability of gene regulatory networks", "comments": "14 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.dis-nn q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Homeostasis of protein concentrations in cells is crucial for their proper\nfunctioning, and this requires concentrations (at their steady-state levels) to\nbe stable to fluctuations. Since gene expression is regulated by proteins such\nas transcription factors (TFs), the full set of proteins within the cell\nconstitutes a large system of interacting components. Here, we explore factors\naffecting the stability of this system by coupling the dynamics of mRNAs and\nprotein concentrations in a growing cell. We find that it is possible for\nprotein concentrations to become unstable if the regulation strengths or system\nsize becomes too large, and that other global structural features of the\nnetworks can dramatically enhance the stability of the system. In particular,\ngiven the same number of proteins, TFs, number of interactions, and regulation\nstrengths, a network that resembles a bipartite graph with a lower fraction of\ninteractions that target TFs has a higher chance of being stable. By scrambling\nthe $\\textit{E. coli.}$ transcription network, we find that the randomized\nnetwork with the same number of regulatory interactions is much more likely to\nbe unstable than the real network. These findings suggest that constraints\nimposed by system stability could have played a role in shaping the existing\nregulatory network during the evolutionary process. We also find that contrary\nto what one might expect from random matrix theory and what has been argued in\nthe literature, the degradation rate of mRNA does not affect whether the system\nis stable.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2020 18:06:03 GMT"}, {"version": "v2", "created": "Sun, 8 Nov 2020 03:55:09 GMT"}], "update_date": "2020-11-10", "authors_parsed": [["Guo", "Yipei", ""], ["Amir", "Ariel", ""]]}, {"id": "2006.00652", "submitter": "Areejit Samal", "authors": "R.P. Vivek-Ananth, Abhijit Rana, Nithin Rajan, Himansu S. Biswal,\n  Areejit Samal", "title": "In silico identification of potential natural product inhibitors of\n  human proteases key to SARS-CoV-2 infection", "comments": "51 pages, 7 Figures, 2 Tables, 4 SI Figures, SI Tables available upon\n  request from authors", "journal-ref": "Molecules 2020, 25(17), 3822", "doi": "10.3390/molecules25173822", "report-no": null, "categories": "q-bio.BM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Presently, there are no approved drugs or vaccines to treat COVID-19 which\nhas spread to over 200 countries and is responsible for over 3,65,000 deaths\nworldwide. Recent studies have shown that two human proteases, TMPRSS2 and\ncathepsin L, play a key role in host cell entry of SARS-CoV-2. Importantly,\ninhibitors of these proteases were shown to block SARS-CoV-2 infection. Here,\nwe perform virtual screening of 14010 phytochemicals produced by Indian\nmedicinal plants to identify natural product inhibitors of TMPRSS2 and\ncathepsin L. We built a homology model of TMPRSS2 as an experimentally\ndetermined structure is not available. AutoDock Vina was used to perform\nmolecular docking of phytochemicals against TMPRSS2 model structure and\ncathepsin L crystal structure. Potential phytochemical inhibitors were filtered\nby comparing their docked binding energies with those of known inhibitors of\nTMPRSS2 and cathepsin L. Further, the ligand binding site residues and\nnon-covalent protein-ligand interactions were used as an additional filter to\nidentify phytochemical inhibitors that either bind to or form interactions with\nresidues important for the specificity of the target proteases. We have\nidentified 96 inhibitors of TMPRSS2 and 9 inhibitors of cathepsin L among\nphytochemicals of Indian medicinal plants. The top inhibitors of TMPRSS2 are\nEdgeworoside C, Adlumidine and Qingdainone, and of cathepsin L is Ararobinol.\nInterestingly, several herbal sources of identified phytochemical inhibitors\nhave antiviral or anti-inflammatory use in traditional medicine. Further in\nvitro and in vivo testing is needed before clinical trials of the promising\nphytochemical inhibitors identified here.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2020 00:37:13 GMT"}], "update_date": "2020-09-02", "authors_parsed": [["Vivek-Ananth", "R. P.", ""], ["Rana", "Abhijit", ""], ["Rajan", "Nithin", ""], ["Biswal", "Himansu S.", ""], ["Samal", "Areejit", ""]]}, {"id": "2006.00700", "submitter": "Wuyue Yang", "authors": "Wuyue Yang, Liangrong Peng, Yi Zhu, Liu Hong", "title": "When Machine Learning Meets Multiscale Modeling in Chemical Reactions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the intrinsic complexity and nonlinearity of chemical reactions,\ndirect applications of traditional machine learning algorithms may face with\nmany difficulties. In this study, through two concrete examples with biological\nbackground, we illustrate how the key ideas of multiscale modeling can help to\nreduce the computational cost of machine learning a lot, as well as how machine\nlearning algorithms perform model reduction automatically in a time-scale\nseparated system. Our study highlights the necessity and effectiveness of an\nintegration of machine learning algorithms and multiscale modeling during the\nstudy of chemical reactions.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2020 03:56:47 GMT"}], "update_date": "2020-06-02", "authors_parsed": [["Yang", "Wuyue", ""], ["Peng", "Liangrong", ""], ["Zhu", "Yi", ""], ["Hong", "Liu", ""]]}, {"id": "2006.00986", "submitter": "Ke Yu", "authors": "Ke Yu, Shyam Visweswaran, Kayhan Batmanghelich", "title": "Semi-Supervised Hierarchical Drug Embedding in Hyperbolic Space", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.MN q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Learning accurate drug representation is essential for tasks such as\ncomputational drug repositioning and prediction of drug side-effects. A drug\nhierarchy is a valuable source that encodes human knowledge of drug relations\nin a tree-like structure where drugs that act on the same organs, treat the\nsame disease, or bind to the same biological target are grouped together.\nHowever, its utility in learning drug representations has not yet been\nexplored, and currently described drug representations cannot place novel\nmolecules in a drug hierarchy. Here, we develop a semi-supervised drug\nembedding that incorporates two sources of information: (1) underlying chemical\ngrammar that is inferred from molecular structures of drugs and drug-like\nmolecules (unsupervised), and (2) hierarchical relations that are encoded in an\nexpert-crafted hierarchy of approved drugs (supervised). We use the Variational\nAuto-Encoder (VAE) framework to encode the chemical structures of molecules and\nuse the knowledge-based drug-drug similarity to induce the clustering of drugs\nin hyperbolic space. The hyperbolic space is amenable for encoding hierarchical\nconcepts. Both quantitative and qualitative results support that the learned\ndrug embedding can accurately reproduce the chemical structure and induce the\nhierarchical relations among drugs. Furthermore, our approach can infer the\npharmacological properties of novel molecules by retrieving similar drugs from\nthe embedding space. We demonstrate that the learned drug embedding can be used\nto find new uses for existing drugs and to discover side-effects. We show that\nit significantly outperforms baselines in both tasks.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2020 14:46:31 GMT"}], "update_date": "2020-06-02", "authors_parsed": [["Yu", "Ke", ""], ["Visweswaran", "Shyam", ""], ["Batmanghelich", "Kayhan", ""]]}, {"id": "2006.01226", "submitter": "Fuhai Li", "authors": "Fuhai Li, Andrew P. Michelson, Randi Foraker, Ming Zhan, Philip R.O.\n  Payne", "title": "Repurposing drugs for COVID-19 based on transcriptional response of host\n  cells to SARS-CoV-2", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Coronavirus Disease 2019 (COVID-19) pandemic has infected over 10 million\npeople globally with a relatively high mortality rate. There are many\ntherapeutics undergoing clinical trials, but there is no effective vaccine or\ntherapy for treatment thus far. After affected by the Severe Acute Respiratory\nSyndrome Coronavirus 2 (SARS-CoV-2), molecular signaling of host cells plays\ncritical roles during the life cycle of SARS-CoV-2. Thus, it is significant to\nidentify the involved molecular signaling pathways within the host cells, and\ndrugs targeting these molecular signaling pathways could be potentially\neffective for COVID-19 treatment. In this study, we aimed to identify these\npotential molecular signaling pathways, and repurpose existing drugs as a\npotentially effective treatment of COVID-19 to facilitate the therapeutic\ndiscovery, based on the transcriptional response of host cells. We first\nidentified dysfunctional signaling pathways associated with the infection\ncaused SARS-CoV-2 in human lung epithelial cells through analysis of the\naltered gene expression profiles. In addition to the signaling pathway\nanalysis, the activated gene ontologies (GOs) and super gene ontologies were\nidentified. Signaling pathways and GOs such as MAPK, JNK, STAT, ERK, JAK-STAT,\nIRF7-NFkB signaling, and MYD88/CXCR6 immune signaling were particularly\nidentified. Based on the identified signaling pathways and GOs, a set of\npotentially effective drugs were repurposed by integrating the drug-target and\nreverse gene expression data resources. The dexamethasone was top-ranked in the\nprediction, which was the first reported drug to be able to significantly\nreduce the death rate of COVID-19 patients receiving respiratory support. The\nresults can be helpful to understand the associated molecular signaling\npathways within host cells, and facilitate the discovery of effective drugs for\nCOVID-19 treatment.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2020 19:56:18 GMT"}, {"version": "v2", "created": "Tue, 30 Jun 2020 02:18:22 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Li", "Fuhai", ""], ["Michelson", "Andrew P.", ""], ["Foraker", "Randi", ""], ["Zhan", "Ming", ""], ["Payne", "Philip R. O.", ""]]}, {"id": "2006.01968", "submitter": "T. M. Murali", "authors": "Jeffrey N. Law, Kyle Akers, Nure Tasnina, Catherine M. Della Santina,\n  Meghana Kshirsagar, Judith Klein-Seetharaman, Mark Crovella, Padmavathy\n  Rajagopalan, Simon Kasif, and T. M. Murali", "title": "Identifying Human Interactors of SARS-CoV-2 Proteins and Drug Targets\n  for COVID-19 using Network-Based Label Propagation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Motivated by the critical need to identify new treatments for COVID-19, we\npresent a genome-scale, systems-level computational approach to prioritize drug\ntargets based on their potential to regulate host-virus interactions or their\ndownstream signaling targets. We adapt and specialize network label propagation\nmethods to this end. We demonstrate that these techniques can predict\nhuman-SARS-CoV-2 protein interactors with high accuracy. The top-ranked\nproteins that we identify are enriched in host biological processes that are\npotentially coopted by the virus. We present cases where our methodology\ngenerates promising insights such as the potential role of HSPA5 in viral\nentry. We highlight the connection between endoplasmic reticulum stress, HSPA5,\nand anti-clotting agents. We identify tubulin proteins involved in ciliary\nassembly that are targeted by anti-mitotic drugs. Drugs that we discuss are\nalready undergoing clinical trials to test their efficacy against COVID-19. Our\nprioritized list of human proteins and drug targets is available as a general\nresource for biological and clinical researchers who are repositioning existing\nand approved drugs or developing novel therapeutics as anti-COVID-19 agents.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2020 22:47:37 GMT"}, {"version": "v2", "created": "Mon, 22 Jun 2020 15:21:19 GMT"}], "update_date": "2020-06-23", "authors_parsed": [["Law", "Jeffrey N.", ""], ["Akers", "Kyle", ""], ["Tasnina", "Nure", ""], ["Della Santina", "Catherine M.", ""], ["Kshirsagar", "Meghana", ""], ["Klein-Seetharaman", "Judith", ""], ["Crovella", "Mark", ""], ["Rajagopalan", "Padmavathy", ""], ["Kasif", "Simon", ""], ["Murali", "T. M.", ""]]}, {"id": "2006.02272", "submitter": "Jinsu Kim", "authors": "German Enciso, Radek Erban, Jinsu Kim", "title": "Identifiability of Stochastically Modelled Reaction Networks", "comments": "22 pages, 4 figures", "journal-ref": null, "doi": "10.1017/S0956792520000492", "report-no": null, "categories": "math.PR q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chemical reaction networks describe interactions between biochemical species.\nOnce an underlying reaction network is given for a biochemical system, the\nsystem dynamics can be modelled with various mathematical frameworks such as\ncontinuous time Markov processes. In this manuscript, the identifiability of\nthe underlying network structure with a given stochastic system dynamics is\nstudied. It is shown that some data types related to the associated stochastic\ndynamics can uniquely identify the underlying network structure as well as the\nsystem parameters. The accuracy of the presented network inference is\ninvestigated when given dynamical data is obtained via stochastic simulations.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jun 2020 13:42:30 GMT"}, {"version": "v2", "created": "Thu, 4 Jun 2020 14:16:09 GMT"}], "update_date": "2021-02-24", "authors_parsed": [["Enciso", "German", ""], ["Erban", "Radek", ""], ["Kim", "Jinsu", ""]]}, {"id": "2006.02304", "submitter": "Cui Su", "authors": "Cui Su and Jun Pang", "title": "A Dynamics-based Approach for the Target Control of Boolean Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.SY q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the target control problem of asynchronous Boolean networks, to\nidentify a set of nodes, the perturbation of which can drive the dynamics of\nthe network from any initial state to the desired steady state (or attractor).\nWe are particularly interested in temporary perturbations, which are applied\nfor sufficient time and then released to retrieve the original dynamics.\nTemporary perturbations have the apparent advantage of averting unforeseen\nconsequences, which might be induced by permanent perturbations. Despite the\ninfamous state-space explosion problem, in this work, we develop an efficient\nmethod to compute the temporary target control for a given target attractor of\na Boolean network. We apply our method to a number of real-life biological\nnetworks and compare its performance with the stable motif-based control method\nto demonstrate its efficacy and efficiency.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jun 2020 14:44:53 GMT"}], "update_date": "2020-06-04", "authors_parsed": [["Su", "Cui", ""], ["Pang", "Jun", ""]]}, {"id": "2006.02720", "submitter": "Lucia Marucci", "authors": "Lucia Marucci, Matteo Barberis, Jonathan Karr, Oliver Ray, Paul R.\n  Race, Miguel de Souza Andrade, Claire Grierson, Stefan Andreas Hoffmann,\n  Sophie Landon, Elibio Rech, Joshua Rees-Garbutt, Richard Seabrook, William\n  Shaw, Christopher Woods", "title": "Computer-aided whole-cell design: taking a holistic approach by\n  integrating synthetic with systems biology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Computer-aided design for synthetic biology promises to accelerate the\nrational and robust engineering of biological systems; it requires both\ndetailed and quantitative mathematical and experimental models of the processes\nto (re)design, and software and tools for genetic engineering and DNA assembly.\nUltimately, the increased precision in the design phase will have a dramatic\nimpact on the production of designer cells and organisms with bespoke functions\nand increased modularity. Computer-aided design strategies require quantitative\nrepresentations of cells, able to capture multiscale processes and link\ngenotypes to phenotypes. Here, we present a perspective on how whole-cell,\nmultiscale models could transform design-build-test-learn cycles in synthetic\nbiology. We show how these models could significantly aid in the design and\nlearn phases while reducing experimental testing by presenting case studies\nspanning from genome minimization to cell-free systems, and we discuss several\nchallenges for the realization of our vision. The possibility to describe and\nbuild in silico whole-cells offers an opportunity to develop increasingly\nautomatized, precise and accessible computer-aided design tools and strategies\nthroughout novel interdisciplinary collaborations.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2020 09:19:52 GMT"}], "update_date": "2020-06-05", "authors_parsed": [["Marucci", "Lucia", ""], ["Barberis", "Matteo", ""], ["Karr", "Jonathan", ""], ["Ray", "Oliver", ""], ["Race", "Paul R.", ""], ["Andrade", "Miguel de Souza", ""], ["Grierson", "Claire", ""], ["Hoffmann", "Stefan Andreas", ""], ["Landon", "Sophie", ""], ["Rech", "Elibio", ""], ["Rees-Garbutt", "Joshua", ""], ["Seabrook", "Richard", ""], ["Shaw", "William", ""], ["Woods", "Christopher", ""]]}, {"id": "2006.02772", "submitter": "Fabrizio Pucci Dr.", "authors": "Fabrizio Pucci, Philippe Bogaerts, Marianne Rooman", "title": "Modeling the molecular impact of SARS-CoV-2 infection on the\n  renin-angiotensin system", "comments": "22 pages, 5 figures. Revision 1 [section rearranged, typos fixed]", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  SARS-CoV-2 coronavirus infection is mediated by the binding of its spike\nprotein to the angiotensin-converting enzyme 2 (ACE2), which plays a pivotal\nrole in the renin-angiotensin system (RAS). The study of RAS dysregulation due\nto SARS-CoV-2 infection is fundamentally important for a better understanding\nof the pathogenic mechanisms and risk factors associated with COVID-19\ncoronavirus disease, and to design effective therapeutic strategies. In this\ncontext, we developed a mathematical model of RAS based on data regarding\nprotein and peptide concentrations; the model was tested on clinical data from\nhealthy normotensive and hypertensive individuals. We then used our model to\nanalyze the impact of SARS-CoV-2 infection on RAS, which we modeled through a\ndown-regulation of ACE2 as a function of viral load. We also used it to predict\nthe effect of RAS-targeting drugs, such as RAS-blockers, human recombinant\nACE2, and angiotensin 1-7 peptide, on COVID-19 patients; the model predicted an\nimprovement of the clinical outcome for some drugs and a worsening for others.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2020 11:04:47 GMT"}, {"version": "v2", "created": "Sat, 1 Aug 2020 21:51:33 GMT"}], "update_date": "2020-08-04", "authors_parsed": [["Pucci", "Fabrizio", ""], ["Bogaerts", "Philippe", ""], ["Rooman", "Marianne", ""]]}, {"id": "2006.03110", "submitter": "Giulia Fiscon", "authors": "Giulia Fiscon (1), Federica Conte (1), Lorenzo Farina (2), Paola Paci\n  (2) ((1) Institute for Systems Analysis and Computer Science Antonio Ruberti,\n  National Research Council, Rome, Italy, (2) Department of Computer, Control\n  and Management Engineering, Sapienza University of Rome, Italy)", "title": "SAveRUNNER: a network-based algorithm for drug repurposing and its\n  application to COVID-19", "comments": "42 pages, 9 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1008686", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The novelty of new human coronavirus COVID-19/SARS-CoV-2 and the lack of\neffective drugs and vaccines gave rise to a wide variety of strategies employed\nto fight this worldwide pandemic. Many of these strategies rely on the\nrepositioning of existing drugs that could shorten the time and reduce the cost\ncompared to de novo drug discovery. In this study, we presented a new\nnetwork-based algorithm for drug repositioning, called SAveRUNNER (Searching\noff-lAbel dRUg aNd NEtwoRk), which predicts drug-disease associations by\nquantifying the interplay between the drug targets and the disease-specific\nproteins in the human interactome via a novel network-based similarity measure\nthat prioritizes associations between drugs and diseases locating in the same\nnetwork neighborhoods. Specifically, we applied SAveRUNNER on a panel of 14\nselected diseases with a consolidated knowledge about their disease-causing\ngenes and that have been found to be related to COVID-19 for genetic\nsimilarity, comorbidity, or for their association to drugs tentatively\nrepurposed to treat COVID-19. Focusing specifically on SARS subnetwork, we\nidentified 282 repurposable drugs, including some the most rumored off-label\ndrugs for COVID-19 treatments, as well as a new combination therapy of 5 drugs,\nactually used in clinical practice. Furthermore, to maximize the efficiency of\nputative downstream validation experiments, we prioritized 24 potential\nanti-SARS-CoV repurposable drugs based on their network-based similarity\nvalues. These top-ranked drugs include ACE-inhibitors, monoclonal antibodies,\nand thrombin inhibitors. Finally, our findings were in-silico validated by\nperforming a gene set enrichment analysis, which confirmed that most of the\nnetwork-predicted repurposable drugs may have a potential treatment effect\nagainst human coronavirus infections.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2020 19:41:13 GMT"}, {"version": "v2", "created": "Mon, 22 Jun 2020 16:16:51 GMT"}, {"version": "v3", "created": "Fri, 26 Jun 2020 17:03:13 GMT"}], "update_date": "2021-06-09", "authors_parsed": [["Fiscon", "Giulia", ""], ["Conte", "Federica", ""], ["Farina", "Lorenzo", ""], ["Paci", "Paola", ""]]}, {"id": "2006.03286", "submitter": "Diego Oyarz\\'un", "authors": "Varshit Dusad, Denise Thiel, Mauricio Barahona, Hector C. Keun, Diego\n  A. Oyarz\\'un", "title": "Opportunities at the interface of network science and metabolic\n  modelling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Metabolism plays a central role in cell physiology because it provides the\nmolecular machinery for growth. At the genome-scale, metabolism is made up of\nthousands of reactions interacting with one another. Untangling this complexity\nis key to understand how cells respond to genetic, environmental, or\ntherapeutic perturbations. Here we discuss the roles of two complementary\nstrategies for the analysis of genome-scale metabolic models: Flux Balance\nAnalysis (FBA) and network science. While FBA estimates metabolic flux on the\nbasis of an optimisation principle, network approaches reveal emergent\nproperties of the global metabolic connectivity. We highlight how the\nintegration of both approaches promises to deliver insights on the structure\nand function of metabolic systems with wide-ranging implications in discovery\nscience, precision medicine and industrial biotechnology.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2020 08:09:27 GMT"}, {"version": "v2", "created": "Tue, 3 Nov 2020 20:42:56 GMT"}, {"version": "v3", "created": "Thu, 17 Dec 2020 23:18:31 GMT"}], "update_date": "2020-12-21", "authors_parsed": [["Dusad", "Varshit", ""], ["Thiel", "Denise", ""], ["Barahona", "Mauricio", ""], ["Keun", "Hector C.", ""], ["Oyarzún", "Diego A.", ""]]}, {"id": "2006.03735", "submitter": "Caroline Uhler", "authors": "Anastasiya Belyaeva, Louis Cammarata, Adityanarayanan Radhakrishnan,\n  Chandler Squires, Karren Dai Yang, G.V. Shivashankar, Caroline Uhler", "title": "Causal Network Models of SARS-CoV-2 Expression and Aging to Identify\n  Candidates for Drug Repurposing", "comments": null, "journal-ref": null, "doi": "10.1038/s41467-021-21056-z", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given the severity of the SARS-CoV-2 pandemic, a major challenge is to\nrapidly repurpose existing approved drugs for clinical interventions. While a\nnumber of data-driven and experimental approaches have been suggested in the\ncontext of drug repurposing, a platform that systematically integrates\navailable transcriptomic, proteomic and structural data is missing. More\nimportantly, given that SARS-CoV-2 pathogenicity is highly age-dependent, it is\ncritical to integrate aging signatures into drug discovery platforms. We here\ntake advantage of large-scale transcriptional drug screens combined with\nRNA-seq data of the lung epithelium with SARS-CoV-2 infection as well as the\naging lung. To identify robust druggable protein targets, we propose a\nprincipled causal framework that makes use of multiple data modalities. Our\nanalysis highlights the importance of serine/threonine and tyrosine kinases as\npotential targets that intersect the SARS-CoV-2 and aging pathways. By\nintegrating transcriptomic, proteomic and structural data that is available for\nmany diseases, our drug discovery platform is broadly applicable. Rigorous in\nvitro experiments as well as clinical trials are needed to validate the\nidentified candidate drugs.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2020 23:16:44 GMT"}], "update_date": "2021-04-28", "authors_parsed": [["Belyaeva", "Anastasiya", ""], ["Cammarata", "Louis", ""], ["Radhakrishnan", "Adityanarayanan", ""], ["Squires", "Chandler", ""], ["Yang", "Karren Dai", ""], ["Shivashankar", "G. V.", ""], ["Uhler", "Caroline", ""]]}, {"id": "2006.04181", "submitter": "Sona Vasudevan", "authors": "Takashi Kitani, Sushma C. Maddipatla, Ramya Madupuri, James N.\n  Baraniuk, Christopher Greco, Jonathan Hartman and Sona Vasudevan", "title": "In Search of Newer Targets for IBD: A Systems and a Network Medicine\n  Approach", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Introduction: Crohn's disease and ulcerative colitis, both under the umbrella\nof inflammatory bowel diseases (IBD), involve many distinct molecular\nprocesses. The difference in their molecular processes is studied by using the\ndifferent genes involved in each disease, and it is explored further for drug\ntargeting and drug repurposing. Methods: The initial set of genes was obtained\nby mining published literature and several curated databases. The identified\ngenes were then subject to Systems and Network analysis to reveal their\nmolecular processes and shed some light on their pathogenesis. Such\nmethodologies have identified newer targets and drugs that can be repurposed.\nResults: We use a Systems and Network Medicine approach to understand the\nmechanism of actions of genes involved in IBD. From an initial set of genes\nmined from literature and curated databases, we used the Multi-Steiner Tree\nalgorithm implemented within the CoVex systems medicine platform to expand each\ndisease module by incorporating candidate genes with significant connections to\nthe disease-related seed genes. Such expanded disease modules will identify a\nlarger set of potential targets and drugs. We used the Closeness Centrality\nalgorithm implemented within CoVex to search for newer targets and repurposable\ndrugs. Through a network medicine approach, we provide a mechanistic view of\nthe diseases and point to newer drugs and targets. Conclusion: We demonstrate\nthat the Systems and Network Medicine approach is a powerful way to understand\ndiseases and understand their mechanisms of action.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jun 2020 15:35:13 GMT"}, {"version": "v2", "created": "Tue, 11 May 2021 00:20:33 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Kitani", "Takashi", ""], ["Maddipatla", "Sushma C.", ""], ["Madupuri", "Ramya", ""], ["Baraniuk", "James N.", ""], ["Greco", "Christopher", ""], ["Hartman", "Jonathan", ""], ["Vasudevan", "Sona", ""]]}, {"id": "2006.06503", "submitter": "Margaret Cheung", "authors": "Yossi Eliaz, Francois Nedelec, Greg Morrison, Herbert Levine, Margaret\n  S. Cheung", "title": "Insights from Graph Theory on the Morphologies of Actomyosin Networks\n  with Multilinkers", "comments": "10 figures", "journal-ref": "Phys. Rev. E 102, 062420 (2020)", "doi": "10.1103/PhysRevE.102.062420", "report-no": null, "categories": "physics.bio-ph q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantifying the influence of microscopic details on the dynamics of\ndevelopment of the overall structure of a filamentous network is important in a\nnumber of biologically relevant contexts, but it is not obvious what order\nparameters can be used to adequately describe this complex process. In this\npaper, we investigated the role of multivalent actin-binding proteins (ABPs) in\nreorganizing actin filaments into higher-order complex networks via a computer\nmodel of semiflexible filaments. We characterize the importance of local\nconnectivity among actin filaments as well as the global features of actomyosin\nnetworks. We first map the networks into local graph representations and then,\nusing principles from network-theory order parameters, combine properties from\nthese representations to gain insight on the heterogeneous morphologies of\nactomyosin networks at a global level. We find that ABPs with a valency greater\nthan two promote filament bundles and large filament clusters to a much greater\nextent than bivalent multilinkers. We also show that active myosin-like motor\nproteins promote the formation of dendritic branches from a stalk of actin\nbundles. Our work motivates future studies to embrace network theory as a tool\nto characterize complex morphologies of actomyosin detected by experiments,\nleading to a quantitative understanding of the role of ABPs in manipulating the\nself-assembly of actin filaments into unique architectures that underlie the\nstructural scaffold of a cell relating to its mobility and shape.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2020 15:20:05 GMT"}, {"version": "v2", "created": "Fri, 12 Jun 2020 01:35:45 GMT"}, {"version": "v3", "created": "Mon, 15 Jun 2020 19:22:31 GMT"}, {"version": "v4", "created": "Fri, 16 Oct 2020 20:52:25 GMT"}], "update_date": "2021-01-04", "authors_parsed": [["Eliaz", "Yossi", ""], ["Nedelec", "Francois", ""], ["Morrison", "Greg", ""], ["Levine", "Herbert", ""], ["Cheung", "Margaret S.", ""]]}, {"id": "2006.06826", "submitter": "Ian Leifer", "authors": "Flaviano Morone, Ian Leifer, Hernan A. Makse", "title": "Fibration symmetries uncover the building blocks of biological networks", "comments": null, "journal-ref": "Proc Natl Acad Sci USA. 2020;117(15):83068314", "doi": "10.1073/pnas.1914628117", "report-no": null, "categories": "q-bio.MN physics.data-an q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A major ambition of systems science is to uncover the building blocks of any\nbiological network to decipher how cellular function emerges from their\ninteractions. Here, we introduce a graph representation of the information flow\nin these networks as a set of input trees, one for each node, which contains\nall pathways along which information can be transmitted in the network. In this\nrepresentation, we find remarkable symmetries in the input trees that\ndeconstruct the network into functional building blocks called fibers. Nodes in\na fiber have isomorphic input trees and thus process equivalent dynamics and\nsynchronize their activity. Each fiber can then be collapsed into a single\nrepresentative base node through an information-preserving transformation\ncalled 'symmetry fibration', introduced by Grothendieck in the context of\nalgebraic geometry. We exemplify the symmetry fibrations in gene regulatory\nnetworks and then show that they universally apply across species and domains\nfrom biology to social and infrastructure networks. The building blocks are\nclassified into topological classes of input trees characterized by integer\nbranching ratios and fractal golden ratios of Fibonacci sequences representing\ncycles of information. Thus, symmetry fibrations describe how complex networks\nare built from the bottom up to process information through the synchronization\nof their constitutive building blocks.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jun 2020 17:05:25 GMT"}], "update_date": "2020-06-15", "authors_parsed": [["Morone", "Flaviano", ""], ["Leifer", "Ian", ""], ["Makse", "Hernan A.", ""]]}, {"id": "2006.06987", "submitter": "Andrea Vandin", "authors": "Tabea Waizmann, Luca Bortolussi, Andrea Vandin, Mirco Tribastone", "title": "Improved estimations of stochastic chemical kinetics by finite state\n  expansion", "comments": "33 pages, 9 figures", "journal-ref": null, "doi": "10.1098/rspa.2020.0964", "report-no": null, "categories": "q-bio.MN cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic reaction networks are a fundamental model to describe interactions\nbetween species where random fluctuations are relevant. The master equation\nprovides the evolution of the probability distribution across the discrete\nstate space consisting of vectors of population counts for each species.\nHowever, since its exact solution is often elusive, several analytical\napproximations have been proposed. The deterministic rate equation (DRE) gives\na macroscopic approximation as a compact system of differential equations that\nestimate the average populations for each species, but it may be inaccurate in\nthe case of nonlinear interaction dynamics. Here we propose finite state\nexpansion (FSE), an analytical method mediating between the microscopic and the\nmacroscopic interpretations of a stochastic reaction network by coupling the\nmaster equation dynamics of a chosen subset of the discrete state space with\nthe mean population dynamics of the DRE. An algorithm translates a network into\nan expanded one where each discrete state is represented as a further distinct\nspecies. This translation exactly preserves the stochastic dynamics, but the\nDRE of the expanded network can be interpreted as a correction to the original\none. The effectiveness of FSE is demonstrated in models that challenge\nstate-of-the-art techniques due to intrinsic noise, multi-scale populations,\nand multi-stability.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2020 08:08:12 GMT"}, {"version": "v2", "created": "Fri, 3 Jul 2020 15:41:59 GMT"}, {"version": "v3", "created": "Mon, 14 Jun 2021 14:27:07 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Waizmann", "Tabea", ""], ["Bortolussi", "Luca", ""], ["Vandin", "Andrea", ""], ["Tribastone", "Mirco", ""]]}, {"id": "2006.07772", "submitter": "Manuel Razo-Mejia", "authors": "Muir J. Morrison, Manuel Razo-Mejia, and Rob Phillips", "title": "Reconciling Kinetic and Equilibrium Models of Bacterial Transcription", "comments": "4 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1008572", "report-no": null, "categories": "q-bio.SC q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The study of transcription remains one of the centerpieces of modern biology\nwith implications in settings from development to metabolism to evolution to\ndisease. Precision measurements using a host of different techniques including\nfluorescence and sequencing readouts have raised the bar for what it means to\nquantitatively understand transcriptional regulation. In particular our\nunderstanding of the simplest genetic circuit is sufficiently refined both\nexperimentally and theoretically that it has become possible to carefully\ndiscriminate between different conceptual pictures of how this regulatory\nsystem works. This regulatory motif, originally posited by Jacob and Monod in\nthe 1960s, consists of a single transcriptional repressor binding to a promoter\nsite and inhibiting transcription. In this paper, we show how seven distinct\nmodels of this so-called simple-repression motif, based both on equilibrium and\nkinetic thinking, can be used to derive the predicted levels of gene expression\nand shed light on the often surprising past success of the equilbrium models.\nThese different models are then invoked to confront a variety of different data\non mean, variance and full gene expression distributions, illustrating the\nextent to which such models can and cannot be distinguished, and suggesting a\ntwo-state model with a distribution of burst sizes as the most potent of the\nseven for describing the simple-repression motif.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jun 2020 02:28:56 GMT"}], "update_date": "2021-06-09", "authors_parsed": [["Morrison", "Muir J.", ""], ["Razo-Mejia", "Manuel", ""], ["Phillips", "Rob", ""]]}, {"id": "2006.08192", "submitter": "Jaroslav Albert", "authors": "Jaroslav Albert", "title": "Dimensionality reduction via path integration for computing mRNA\n  distributions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inherent stochasticity in gene expression leads to distributions of mRNA copy\nnumbers in a population of identical cells. These distributions are determined\nprimarily by the multitude of states of a gene promoter, each driving\ntranscription at a different rate. In an era where single-cell mRNA copy number\ndata are more and more available, there is an increasing need for fast\ncomputations of mRNA distributions. In this paper, we present a method for\ncomputing separate distributions for each species of mRNA molecules, i. e.\nmRNAs that have been either partially or fully processed post-transcription.\nThe method involves the integration over all possible realizations of promoter\nstates, which we cast into a set of linear ordinary differential equations of\ndimension $M\\times n_j$, where $M$ is the number of available promoter states\nand $n_j$ is the mRNA copy number of species $j$ up to which one wishes to\ncompute the probability distribution. This approach is superior to solving the\nMaster equation (ME) directly in two ways: a) the number of coupled\ndifferential equations in the ME approach is\n$M\\times\\Lambda_1\\times\\Lambda_2\\times ...\\times\\Lambda_L$, where $\\Lambda_j$\nis the cutoff for the probability of the $j^{\\text{th}}$ species of mRNA; and\nb) the ME must be solved up to the cutoffs $\\Lambda_j$, which are {\\it ad hoc}\nand must be selected {\\it a priori}. In our approach, the equation for the\nprobability to observe $n$ mRNAs of any species depends only on the the\nprobability of observing $n-1$ mRNAs of that species, thus yielding a correct\nprobability distribution up to an arbitrary $n$. To demonstrate the validity of\nour derivations, we compare our results with Gillespie simulations for ten\nrandomly selected system parameters.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2020 07:39:39 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Albert", "Jaroslav", ""]]}, {"id": "2006.08735", "submitter": "Abhishek Deshpande", "authors": "Yida Ding, Abhishek Deshpande, Gheorghe Craciun", "title": "Minimal invariant regions and minimal globally attracting regions for\n  toric differential inclusions", "comments": "29 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Toric differential inclusions occur as key dynamical systems in the context\nof the Global Attractor Conjecture. We introduce the notions of minimal\ninvariant regions and minimal globally attracting regions for toric\ndifferential inclusions. We describe a procedure for constructing explicitly\nthe minimal invariant and minimal globally attracting regions for\ntwo-dimensional toric differential inclusions. In particular, we obtain\ninvariant regions and globally attracting regions for two-dimensional weakly\nreversible or endotactic dynamical systems (even if they have time-dependent\nparameters).\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2020 20:14:13 GMT"}], "update_date": "2020-06-17", "authors_parsed": [["Ding", "Yida", ""], ["Deshpande", "Abhishek", ""], ["Craciun", "Gheorghe", ""]]}, {"id": "2006.08905", "submitter": "Masahito Ohue", "authors": "Masahito Ohue, Kento Aoyama, Yutaka Akiyama", "title": "High-performance cloud computing for exhaustive protein-protein docking", "comments": "11 pages, 2 figures, and 3 tables. To be published in in Proceedings\n  of The 26th International Conference on Parallel & Distributed Processing\n  Techniques and Applications (PDPTA'20), Transactions on Computational Science\n  and Computational Intelligence (Springer)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC q-bio.BM q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Public cloud computing environments, such as Amazon AWS, Microsoft Azure, and\nthe Google Cloud Platform, have achieved remarkable improvements in\ncomputational performance in recent years, and are also expected to be able to\nperform massively parallel computing. As the cloud enables users to use\nthousands of CPU cores and GPU accelerators casually, and various software\ntypes can be used very easily by cloud images, the cloud is beginning to be\nused in the field of bioinformatics. In this study, we ported the original\nprotein-protein interaction prediction (protein-protein docking) software,\nMEGADOCK, into Microsoft Azure as an example of an HPC cloud environment. A\ncloud parallel computing environment with up to 1,600 CPU cores and 960 GPUs\nwas constructed using four CPU instance types and two GPU instance types, and\nthe parallel computing performance was evaluated. Our MEGADOCK on Azure system\nshowed a strong scaling value of 0.93 for the CPU instance when H16 instance\nwith 100 instances were used compared to 50, and a strong scaling value of 0.89\nfor the GPU instance when NC24 instance with 20 were used compared to 5.\nMoreover, the results of the usage fee and total computation time supported\nthat using a GPU instance reduced the computation time of MEGADOCK and the\ncloud usage fee required for the computation. The developed environment\ndeployed on the cloud is highly portable, making it suitable for applications\nin which an on-demand and large-scale HPC environment is desirable.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2020 03:37:50 GMT"}], "update_date": "2020-06-17", "authors_parsed": [["Ohue", "Masahito", ""], ["Aoyama", "Kento", ""], ["Akiyama", "Yutaka", ""]]}, {"id": "2006.15777", "submitter": "Wagner F\\'avaro Dr.", "authors": "Nelson Duran and Wagner J. Favaro", "title": "Pyroptosis: Physiological roles in viral infection", "comments": "18 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": "2006.15777", "categories": "q-bio.TO q-bio.CB q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The current review focuses on important aspects of pyroptosis, such as\nmorphological features of inflammasomes, as well as on knowledge about\ncoronavirus infection mechanisms and the association between SARS-CoV-2\ninfection and cell pyroptosis. The application of immunomodulation therapies to\nCovid-19 patients is the most promising treatment under investigation nowadays.\nThe possibilities of assistance to help protecting patients from infections are\nalso addressed in the present study.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2020 02:12:16 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["Duran", "Nelson", ""], ["Favaro", "Wagner J.", ""]]}]