[{"id": "2008.00263", "submitter": "Francesco Bardozzo", "authors": "Francesco Bardozzo, Pietro Li\\`o, Roberto Tagliaferri", "title": "Signal metrics analysis of oscillatory patterns in bacterial multi-omic\n  networks", "comments": "8 pages, 5 figure, 3 algorithms, journal paper", "journal-ref": null, "doi": "10.1093/bioinformatics/btaa966", "report-no": null, "categories": "q-bio.MN cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: One of the branches of Systems Biology is focused on a deep\nunderstanding of underlying regulatory networks through the analysis of the\nbiomolecules oscillations and their interplay. Synthetic Biology exploits gene\nor/and protein regulatory networks towards the design of oscillatory networks\nfor producing useful compounds. Therefore, at different levels of application\nand for different purposes, the study of biomolecular oscillations can lead to\ndifferent clues about the mechanisms underlying living cells. It is known that\nnetwork-level interactions involve more than one type of biomolecule as well as\nbiological processes operating at multiple omic levels. Combining\nnetwork/pathway-level information with genetic information it is possible to\ndescribe well-understood or unknown bacterial mechanisms and organism-specific\ndynamics. Results: Network multi-omic integration has led to the discovery of\ninteresting oscillatory signals. Following the methodologies used in signal\nprocessing and communication engineering, a new methodology is introduced to\nidentify and quantify the extent of the multi-omic oscillations of the signal.\nNew signal metrics are designed to allow further biotechnological explanations\nand provide important clues about the oscillatory nature of the pathways and\ntheir regulatory circuits. Our algorithms designed for the analysis of\nmulti-omic signals are tested and validated on 11 different bacteria for\nthousands of multi-omic signals perturbed at the network level by different\nexperimental conditions. Information on the order of genes, codon usage, gene\nexpression, and protein molecular weight is integrated at three different\nfunctional levels. Oscillations show interesting evidence that network-level\nmulti-omic signals present a synchronized response to perturbations and\nevolutionary relations along with taxa.\n", "versions": [{"version": "v1", "created": "Sat, 1 Aug 2020 13:27:53 GMT"}], "update_date": "2020-11-30", "authors_parsed": [["Bardozzo", "Francesco", ""], ["Liò", "Pietro", ""], ["Tagliaferri", "Roberto", ""]]}, {"id": "2008.00687", "submitter": "Gennadi Glinsky", "authors": "Gennadi Glinsky", "title": "Genomics-guided drawing of malignant regulatory signatures revealed a\n  pivotal role of human stem cell-associated retroviral sequences (SCARS) and\n  functionally-active hESC enhancers", "comments": "6 figues; 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.MN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  From patients and physicians perspectives, the clinical definition of a tumor\nmalignant phenotype could be restricted to the early diagnosis of sub-types of\nmalignancies with the increased risk of existing therapy failure and high\nlikelihood of death from cancer. It is the viewpoint from which the\nunderstanding of malignant regulatory signatures is considered in this\ncontribution. Analyses from this perspective of experimental and clinical\nobservations revealed the pivotal role of human stem cell-associated retroviral\nsequences (SCARS) in the origin and pathophysiology of clinically-lethal\nmalignancies. SCARS represent evolutionary- and biologically-related family of\ngenomic regulatory sequences, the principal physiological function of which is\nto create and maintain the stemness phenotype during human preimplantation\nembryogenesis. SCARS expression must be silenced during cellular\ndifferentiation and SCARS activity remains silent in most\nterminally-differentiated human cells performing specialized functions in the\nhuman body. De-repression and sustained activation of SCARS result in\ndifferentiation-defective phenotypes, tissue- and organ-specific clinical\nmanifestations of which are diagnosed as pathological conditions defined by a\nconsensus of pathomorphological, molecular, and genetic examinations as the\nmalignant growth. Contemporary evidence are presented that high-fidelity\nmolecular signals of continuing activities of SCARS in association with genomic\nregulatory networks of thousands functionally-active enhancers triggering\nengagements of down-stream genetic loci may serve as both reliable diagnostic\ntools and druggable molecular targets readily amenable for diagnosis and\nefficient therapeutic management of clinically-lethal malignancies.\n", "versions": [{"version": "v1", "created": "Mon, 3 Aug 2020 07:34:59 GMT"}], "update_date": "2020-08-04", "authors_parsed": [["Glinsky", "Gennadi", ""]]}, {"id": "2008.01126", "submitter": "James Brunner", "authors": "James Brunner and Jacob Kim and Timothy Downing and Eric Mjolsness and\n  Kord M. Kober", "title": "A dynamical system model for predicting gene expression from the\n  epigenome", "comments": "16 pages, 7 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gene regulation is an important fundamental biological process. The\nregulation of gene expression is managed through a variety of methods including\nepigenetic processes (e.g., DNA methylation). Understanding the role of\nepigenetic changes in gene expression is a fundamental question of molecular\nbiology. Predictions of gene expression values from epigenetic data have\ntremendous research and clinical potential. Despite active research, studies to\ndate have focused on using statistical models to predict gene expression from\nmethylation data. In contrast, dynamical systems can be used to generate a\nmodel to predict gene expression using epigenetic data and a gene regulatory\nnetwork (GRN) which can also serve as a mechanistic hypothesis. Here we present\na novel stochastic dynamical systems model that predicts gene expression levels\nfrom methylation data of genes in a given GRN. We provide an evaluation of the\nmodel using real patient data and a GRN created from robust reference sources.\nSoftware for dataset preparation, model parameter fitting and prediction\ngeneration, and reporting are available at\n\\verb|https://github.com/kordk/stoch_epi_lib|.\n", "versions": [{"version": "v1", "created": "Mon, 3 Aug 2020 18:39:55 GMT"}, {"version": "v2", "created": "Fri, 12 Mar 2021 18:50:27 GMT"}, {"version": "v3", "created": "Fri, 28 May 2021 18:03:26 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Brunner", "James", ""], ["Kim", "Jacob", ""], ["Downing", "Timothy", ""], ["Mjolsness", "Eric", ""], ["Kober", "Kord M.", ""]]}, {"id": "2008.03846", "submitter": "Xiaoxian Tang", "authors": "Xiaoxian Tang and Hao Xu", "title": "Multistability of Small Reaction Networks", "comments": "23 pages, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.AG math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For three typical sets of small reaction networks (networks with two\nreactions, one irreversible and one reversible reaction, or two\nreversible-reaction pairs), we completely answer the challenging question: what\nis the smallest subset of all multistable networks such that any multistable\nnetwork outside of the subset contains either more species or more reactants\nthan any network in this subset?\n", "versions": [{"version": "v1", "created": "Mon, 10 Aug 2020 00:50:22 GMT"}, {"version": "v2", "created": "Thu, 28 Jan 2021 10:17:58 GMT"}], "update_date": "2021-01-29", "authors_parsed": [["Tang", "Xiaoxian", ""], ["Xu", "Hao", ""]]}, {"id": "2008.04218", "submitter": "Osama Amin Ph.D", "authors": "Osama Amin, Hayssam Dahrouj, Nojood Almayouf, Tareq Y. Al-Naffouri,\n  Basem Shihada and Mohamed-Slim Alouini", "title": "Viral Aerosol Concentration Characterization and Detection in Bounded\n  Environments", "comments": "29 pages, submitted to IEEE Transactions on Molecular, Biological,\n  and Multi-Scale Communications for the special issue \"Molecular\n  Communications for Diagnostics and Therapeutic Development of Infectious\n  Diseases\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.IT math.IT q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Viral spread has been intermittently threatening human life over time.\nCharacterizing the viral concentration and modelling the viral transmission\nare, therefore, considered major milestones for enhancing viral detection\ncapabilities. This paper addresses the problem of viral aerosol detection based\non the exhaled breath in a bounded environment, e.g., a bounded room. The paper\nmodels the exhaled breath as a cloud which is emitted through the room\ncontinuously, and analyzes the temporal-spatial virus concentration by\naccounting for partial absorption and reflection at each side of the room. The\npaper first derives a closed form expression of the temporal-spatial virus\nconcentration. It then considers the deployment of a receiver composed of an\nair sampler and a bio-sensor to detect the viral existence of a specific virus.\nWe, therefore, assess the detection capabilities of the proposed system via\nevaluating the viral miss-detection probability as a function of the sampling\nvolume and the detection time-instance at the receiver side. Our numerical\nsimulations verify the validity of the analytical results, and illustrate the\nability of the proposed system to detect viruses in indoor environments. The\nresults further characterize the impacts of several system parameters on the\nmiss-detection probability.\n", "versions": [{"version": "v1", "created": "Mon, 10 Aug 2020 15:49:03 GMT"}], "update_date": "2020-08-11", "authors_parsed": [["Amin", "Osama", ""], ["Dahrouj", "Hayssam", ""], ["Almayouf", "Nojood", ""], ["Al-Naffouri", "Tareq Y.", ""], ["Shihada", "Basem", ""], ["Alouini", "Mohamed-Slim", ""]]}, {"id": "2008.05377", "submitter": "Dokyoon Kim", "authors": "Yonghyun Nam, Jae-Seung Yun, Seung Mi Lee, Ji Won Park, Ziqi Chen,\n  Brian Lee, Anurag Verma, Xia Ning, Li Shen, Dokyoon Kim", "title": "Network reinforcement driven drug repurposing for COVID-19 by exploiting\n  disease-gene-drug associations", "comments": "4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently, the number of patients with COVID-19 has significantly increased.\nThus, there is an urgent need for developing treatments for COVID-19. Drug\nrepurposing, which is the process of reusing already-approved drugs for new\nmedical conditions, can be a good way to solve this problem quickly and\nbroadly. Many clinical trials for COVID-19 patients using treatments for other\ndiseases have already been in place or will be performed at clinical sites in\nthe near future. Additionally, patients with comorbidities such as diabetes\nmellitus, obesity, liver cirrhosis, kidney diseases, hypertension, and asthma\nare at higher risk for severe illness from COVID-19. Thus, the relationship of\ncomorbidity disease with COVID-19 may help to find repurposable drugs. To\nreduce trial and error in finding treatments for COVID-19, we propose building\na network-based drug repurposing framework to prioritize repurposable drugs.\nFirst, we utilized knowledge of COVID-19 to construct a disease-gene-drug\nnetwork (DGDr-Net) representing a COVID-19-centric interactome with components\nfor diseases, genes, and drugs. DGDr-Net consisted of 592 diseases, 26,681\nhuman genes and 2,173 drugs, and medical information for 18 common\ncomorbidities. The DGDr-Net recommended candidate repurposable drugs for\nCOVID-19 through network reinforcement driven scoring algorithms. The scoring\nalgorithms determined the priority of recommendations by utilizing graph-based\nsemi-supervised learning. From the predicted scores, we recommended 30 drugs,\nincluding dexamethasone, resveratrol, methotrexate, indomethacin, quercetin,\netc., as repurposable drugs for COVID-19, and the results were verified with\ndrugs that have been under clinical trials. The list of drugs via a data-driven\ncomputational approach could help reduce trial-and-error in finding treatment\nfor COVID-19.\n", "versions": [{"version": "v1", "created": "Wed, 12 Aug 2020 15:19:11 GMT"}], "update_date": "2020-08-13", "authors_parsed": [["Nam", "Yonghyun", ""], ["Yun", "Jae-Seung", ""], ["Lee", "Seung Mi", ""], ["Park", "Ji Won", ""], ["Chen", "Ziqi", ""], ["Lee", "Brian", ""], ["Verma", "Anurag", ""], ["Ning", "Xia", ""], ["Shen", "Li", ""], ["Kim", "Dokyoon", ""]]}, {"id": "2008.09225", "submitter": "Jiaxi Zhao", "authors": "Nicholas C. Lammers, Yang Joon Kim, Jiaxi Zhao, Hernan G. Garcia", "title": "A matter of time: Using dynamics and theory to uncover mechanisms of\n  transcriptional bursting", "comments": "41 pages, 4 figures, review article", "journal-ref": null, "doi": "10.1016/j.ceb.2020.08.001", "report-no": null, "categories": "q-bio.SC q-bio.CB q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eukaryotic transcription generally occurs in bursts of activity lasting\nminutes to hours; however, state-of-the-art measurements have revealed that\nmany of the molecular processes that underlie bursting, such as transcription\nfactor binding to DNA, unfold on timescales of seconds. This temporal\ndisconnect lies at the heart of a broader challenge in physical biology of\npredicting transcriptional outcomes and cellular decision-making from the\ndynamics of underlying molecular processes. Here, we review how new dynamical\ninformation about the processes underlying transcriptional control can be\ncombined with theoretical models that predict not only averaged transcriptional\ndynamics, but also their variability, to formulate testable hypotheses about\nthe molecular mechanisms underlying transcriptional bursting and control.\n", "versions": [{"version": "v1", "created": "Thu, 20 Aug 2020 23:17:44 GMT"}, {"version": "v2", "created": "Thu, 17 Dec 2020 21:11:54 GMT"}], "update_date": "2020-12-21", "authors_parsed": [["Lammers", "Nicholas C.", ""], ["Kim", "Yang Joon", ""], ["Zhao", "Jiaxi", ""], ["Garcia", "Hernan G.", ""]]}, {"id": "2008.09261", "submitter": "Yoshihisa Tanaka", "authors": "Yoshihisa Tanaka (1 and 2), Kako Higashihara (3), Mai Adachi Nakazawa\n  (3), Fumiyoshi Yamashita (1), Yoshinori Tamada (3), Yasushi Okuno (2 and 3)\n  ((1) Graduate School of Pharmaceutical Sciences, Kyoto University, (2) RIKEN\n  Cluster for Science, Technology and Innovation Hub, Medical Sciences\n  Innovation Hub Program, (3) Graduate School of Medicine, Kyoto University)", "title": "Dynamic change of gene-to-gene regulatory networks in response to\n  SARS-CoV-2 infection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The current pandemic of SARS-CoV-2 has caused extensive damage to society.\nThe characterization of SARS-CoV-2 profiles has been addressed by researchers\nglobally with the aim of resolving this disruptive crisis. This investigation\nprocess is indispensable for an understanding of how SARS-CoV-2 behaves in\nhuman host cells. However, little is known about the systematic molecular\nmechanisms involved in the effect of SARS-CoV-2 infection on human host cells.\nHere, we have presented gene-to-gene regulatory networks in response to\nSARS-CoV-2 using a Bayesian network. We examined the dynamic changes of the\nSARS-CoV-2-purturbated networks established by our proposed framework for gene\nnetwork analysis, revealing that interferon signaling gradually switches to the\nsubsequent inflammatory-cytokine signaling cascades. Furthermore, we have\nsucceeded in capturing a COVID-19 patient-specific network in which\ntransduction of these signalings is coincidently induced. This enabled us to\nexplore local regulatory systems influenced by SARS-CoV-2 in host cells more\nprecisely at an individual level. Our panel of network analyses has provided\nnew insight into SARS-CoV-2 research from the perspective of cellular systems.\n", "versions": [{"version": "v1", "created": "Fri, 21 Aug 2020 01:46:57 GMT"}], "update_date": "2020-08-24", "authors_parsed": [["Tanaka", "Yoshihisa", "", "1 and 2"], ["Higashihara", "Kako", "", "2 and 3"], ["Nakazawa", "Mai Adachi", "", "2 and 3"], ["Yamashita", "Fumiyoshi", "", "2 and 3"], ["Tamada", "Yoshinori", "", "2 and 3"], ["Okuno", "Yasushi", "", "2 and 3"]]}, {"id": "2008.09699", "submitter": "Georg Meisl", "authors": "Georg Meisl and Alexander J Dear and Thomas CT Michaels and Tuomas PJ\n  Knowles", "title": "Mechanism, scaling and rates of protein aggregation from in vivo\n  measurements", "comments": "27 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The formation and proliferation of protein aggregates play a central role in\na number of devastating neuro-degenerative diseases. Many experimental studies\nindicate that the ability of existing aggregates to replicate is a key property\nin generating their pathogenic effect across a range of diseases. However,\ngiven the complexity of the process in vivo, no principled general approach\ncurrently exists to obtain the rates of the fundamental steps that underlie\naggregate formation from measurements in living systems. In order to address\nthis challenge, here we present a general approach for analysing aggregation\nkinetics that considers broad classes of processes that can be described by a\nfamily of scaling solutions. Our approach is not limited only to fibrillar\naggregates, but applies to any aggregate shape. We show that the rates can\nreliably be extracted by fitting of a simple logistic function, even from\nexperimental data in living systems, and give a very general analytical\nexpression that relates the scaling of the exponential rate with monomer\nconcentration to the microscopic details of the underlying reaction. This\napproach can thus be used to infer the microscopic mechanism driving the\naggregation process from macroscopic measurements in complex systems.\n", "versions": [{"version": "v1", "created": "Fri, 21 Aug 2020 22:18:36 GMT"}], "update_date": "2020-08-25", "authors_parsed": [["Meisl", "Georg", ""], ["Dear", "Alexander J", ""], ["Michaels", "Thomas CT", ""], ["Knowles", "Tuomas PJ", ""]]}, {"id": "2008.09985", "submitter": "Alexander Belikov V", "authors": "Alexander V. Belikov, Andrey Rzhetsky and James Evans", "title": "Detecting signal from science:The structure of research communities and\n  prior knowledge improves prediction of genetic regulatory experiments", "comments": "61 pages, 20 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI physics.soc-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The explosive growth of scientists, scientific journals, articles and\nfindings in recent years exponentially increases the difficulty scientists face\nin navigating prior knowledge. This challenge is exacerbated by uncertainty\nabout the reproducibility of published findings. The availability of massive\ndigital archives, machine reading and extraction tools on the one hand, and\nautomated high-throughput experiments on the other, allow us to evaluate these\nchallenges at scale and identify novel opportunities for accelerating\nscientific advance. Here we demonstrate a Bayesian calculus that enables the\npositive prediction of robust, replicable scientific claims with findings\nautomatically extracted from published literature on gene interactions. We\nmatched these findings, filtered by science, with unfiltered gene interactions\nmeasured by the massive LINCS L1000 high-throughput experiment to identify and\ncounteract sources of bias. Our calculus is built on easily extracted\npublication meta-data regarding the position of a scientific claim within the\nweb of prior knowledge, and its breadth of support across institutions, authors\nand communities, revealing that scientifically focused but socially and\ninstitutionally independent research activity is most likely to replicate.\nThese findings recommend policies that go against the common practice of\nchanneling biomedical research funding into centralized research consortia and\ninstitutes rather than dispersing it more broadly. Our results demonstrate that\nrobust scientific findings hinge upon a delicate balance of shared focus and\nindependence, and that this complex pattern can be computationally exploited to\ndecode bias and predict the replicability of published findings. These insights\nprovide guidance for scientists navigating the research literature and for\nscience funders seeking to improve it.\n", "versions": [{"version": "v1", "created": "Sun, 23 Aug 2020 07:47:13 GMT"}], "update_date": "2020-08-25", "authors_parsed": [["Belikov", "Alexander V.", ""], ["Rzhetsky", "Andrey", ""], ["Evans", "James", ""]]}, {"id": "2008.10085", "submitter": "Leo Lopez", "authors": "L\\'eo Pio-Lopez, Alberto Valdeolivas, Laurent Tichit, \\'Elisabeth\n  Remy, Ana\\\"is Baudot", "title": "MultiVERSE: a multiplex and multiplex-heterogeneous network embedding\n  approach", "comments": "29 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network embedding approaches are gaining momentum to analyse a large variety\nof networks. Indeed, these approaches have demonstrated their efficiency for\ntasks such as community detection, node classification, and link prediction.\nHowever, very few network embedding methods have been specifically designed to\nhandle multiplex networks, i.e. networks composed of different layers sharing\nthe same set of nodes but having different types of edges. Moreover, to our\nknowledge, existing approaches cannot embed multiple nodes from\nmultiplex-heterogeneous networks, i.e. networks composed of several layers\ncontaining both different types of nodes and edges. In this study, we propose\nMultiVERSE, an extension of the VERSE method with Random Walks with Restart on\nMultiplex (RWR-M) and Multiplex-Heterogeneous (RWR-MH) networks. MultiVERSE is\na fast and scalable method to learn node embeddings from multiplex and\nmultiplex-heterogeneous networks. We evaluate MultiVERSE on several biological\nand social networks and demonstrate its efficiency. MultiVERSE indeed\noutperforms most of the other methods in the tasks of link prediction and\nnetwork reconstruction for multiplex network embedding, and is also efficient\nin the task of link prediction for multiplex-heterogeneous network embedding.\nFinally, we apply MultiVERSE to study rare disease-gene associations using link\nprediction and clustering. MultiVERSE is freely available on github at\nhttps://github.com/Lpiol/MultiVERSE.\n", "versions": [{"version": "v1", "created": "Sun, 23 Aug 2020 18:18:54 GMT"}, {"version": "v2", "created": "Tue, 5 Jan 2021 10:20:34 GMT"}], "update_date": "2021-01-06", "authors_parsed": [["Pio-Lopez", "Léo", ""], ["Valdeolivas", "Alberto", ""], ["Tichit", "Laurent", ""], ["Remy", "Élisabeth", ""], ["Baudot", "Anaïs", ""]]}, {"id": "2008.10404", "submitter": "Ralf Kircheis", "authors": "Ralf Kircheis (1), Emanuel Haasbach (2), Daniel Lueftenegger (1),\n  Willm T. Heyken (1), Matthias Ocker (3), and Oliver Planz (2) ((1) Virologik\n  GmbH, 91052 Erlangen, Germany (2) Institute of cell Biology and Immunology,\n  Eberhard Karls University Tuebingen, Germany, (3) Institute for Surgical\n  Research, Philipps University of Marburg, 35043 Marburg, Germany)", "title": "Potential of proteasome inhibitors to inhibit cytokine storm in critical\n  stage COVID-19 patients", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Patients infected with SARS-CoV-2 show a wide spectrum of clinical\nmanifestations ranging from mild febrile illness and cough up to acute\nrespiratory distress syndrome, multiple organ failure and death. Data from\npatients with severe clinical manifestations compared to patients with mild\nsymptoms indicate that highly dysregulated exuberant inflammatory responses\ncorrelate with severity of disease and lethality. Significantly elevated\ncytokine levels, i.e. cytokine storm, seem to play a central role in severity\nand lethality in COVID-19. We have previously shown that excessive cytokine\nrelease induced by highly pathogenic avian H5N1 influenza A virus was reduced\nby application of proteasome inhibitors. In the present study we present\nexperimental data of a central cellular pro-inflammatory signal pathways,\nNF-kappaB, in the context of published clinical data from COVID-19 patients and\ndevelop a hypothesis for a therapeutic approach aiming at the simultaneous\ninhibition of whole cascades of pro-inflammatory cytokines and chemokines via\nblocking the nuclear translocation of NF-kappaB by proteasome inhibitors. The\nsimultaneous inhibition of multiple cytokines/chemokines using clinically\napproved proteasome inhibitors is expected to have a higher therapeutic\npotential compared to single target approaches to prevent cascade (i.e.\ntriggering, synergistic, and redundant) effects of multiple induced cytokines\nand may provide an additional therapeutic option to be explored for treatment\nof critical stage COVID-19 patients.\n", "versions": [{"version": "v1", "created": "Mon, 24 Aug 2020 12:57:52 GMT"}], "update_date": "2020-08-25", "authors_parsed": [["Kircheis", "Ralf", ""], ["Haasbach", "Emanuel", ""], ["Lueftenegger", "Daniel", ""], ["Heyken", "Willm T.", ""], ["Ocker", "Matthias", ""], ["Planz", "Oliver", ""]]}, {"id": "2008.13741", "submitter": "Claus Kadelka", "authors": "Claus Kadelka and Benjamin Keilty and Reinhard Laubenbacher", "title": "Collectively canalizing Boolean functions", "comments": "15 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the mathematical properties of collectively canalizing\nBoolean functions, a class of functions that has arisen from applications in\nsystems biology. Boolean networks are an increasingly popular modeling\nframework for regulatory networks, and the class of functions studied here\ncaptures a key feature of biological network dynamics, namely that a subset of\none or more variables, under certain conditions, can dominate the value of a\nBoolean function, to the exclusion of all others. These functions have rich\nmathematical properties to be explored. The paper shows how the number and type\nof such sets influence a function's behavior and define a new measure for the\ncanalizing strength of any Boolean function. We further connect the concept of\ncollective canalization with the well-studied concept of the average\nsensitivity of a Boolean function. The relationship between Boolean functions\nand the dynamics of the networks they form is important in a wide range of\napplications beyond biology, such as computer science, and has been studied\nwith statistical and simulation-based methods. But the rich relationship\nbetween structure and dynamics remains largely unexplored, and this paper is\nintended as a contribution to its mathematical foundation.\n", "versions": [{"version": "v1", "created": "Mon, 31 Aug 2020 17:03:29 GMT"}, {"version": "v2", "created": "Mon, 5 Oct 2020 20:50:22 GMT"}], "update_date": "2020-10-07", "authors_parsed": [["Kadelka", "Claus", ""], ["Keilty", "Benjamin", ""], ["Laubenbacher", "Reinhard", ""]]}]