[{"id": "2011.02103", "submitter": "Bhanwar Lal Puniya", "authors": "Bhanwar Lal Puniya, Zhongyuan Zhao, Tomas Helikar", "title": "MADRID: a pipeline for MetAbolic Drug Repurposing IDentification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Summary: Human metabolic pathways offer numerous therapeutic targets to treat\ncomplex diseases such as autoimmunity and cancers. Metabolic modeling can help\npredict potential drug targets using in silico gene or reaction perturbations.\nHowever, systematic analyses of metabolic models require the integration of\ndifferent modeling methods. MADRID is an easy-to-use integrated pipeline for\ndeveloping metabolic models, running simulation, investigating gene inhibition\neffect on reactions, identifying repurposable drugs, and in fine predicting\ndrug targets. It can be installed as a Docker image and includes easy to use\nsteps in a jupyter notebook. Availability and implementation: The source code\nof the MADRID pipeline and Docker image are available at\nhttps://github.com/HelikarLab/MADRID.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2020 02:54:09 GMT"}], "update_date": "2020-11-05", "authors_parsed": [["Puniya", "Bhanwar Lal", ""], ["Zhao", "Zhongyuan", ""], ["Helikar", "Tomas", ""]]}, {"id": "2011.02534", "submitter": "Carlos Toscano-Ochoa", "authors": "Carlos Toscano-Ochoa, Jordi Garcia-Ojalvo", "title": "A tunable population timer in multicellular consortia", "comments": "11 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Processing time-dependent information requires cells to quantify the duration\nof past regulatory events and program the time span of future signals. At the\nsingle-cell level, timer mechanisms can be implemented with genetic circuits:\nsets of genes connected to achieve specific tasks. However, such systems are\ndifficult to implement in single cells due to saturation in molecular\ncomponents and stochasticity in the limited intracellular space. Multicellular\nimplementations, on the other hand, outsource some of the components of\ninformation-processing circuits to the extracellular space, and thereby might\nescape those constraints. Here we develop a theoretical framework, based on a\ntrilinear coordinate representation, to study the collective behavior of a\ncellular population composed of three cell types under stationary conditions.\nThis framework reveals that distributing different processes (in our case the\nproduction, detection and degradation of a time-encoding signal) across\ndistinct cell types enables the robust implementation of a multicellular timer.\nOur analysis also shows the circuit to be easily tunable by varying the\ncellular composition of the consortium.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2020 21:03:36 GMT"}, {"version": "v2", "created": "Sat, 13 Mar 2021 15:27:49 GMT"}], "update_date": "2021-03-16", "authors_parsed": [["Toscano-Ochoa", "Carlos", ""], ["Garcia-Ojalvo", "Jordi", ""]]}, {"id": "2011.02597", "submitter": "Paul Lang", "authors": "Paul F. Lang, Sungho Shin, Victor M. Zavala", "title": "SBML2Julia: interfacing SBML with efficient nonlinear Julia modelling\n  and solution tools for parameter optimization", "comments": "4 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Estimating model parameters from experimental observations is one\nof the key challenges in systems biology and can be computationally very\nexpensive. While the Julia programming language was recently developed as a\nhigh-level and high-performance language for scientific computing, systems\nbiologists have only started to realise its potential. For instance, we have\nrecently used Julia to cut down the optimization time of a microbial community\nmodel by a factor of 140. To facilitate access of the systems biology community\nto the efficient nonlinear solvers used for this optimisation, we developed\nSBML2Julia. SBML2Julia translates optimisation problems specified in SBML and\nTSV files (PEtab format) into Julia for Mathematical Programming (JuMP),\nexecutes the optimization and returns the results in tabular format.\n  Availability and implementation: SBML2Julia is freely available under the MIT\nlicense. It comes with a command line interface and Python API. Internally,\nSBML2Julia calls the Julia LTS release v1.0.5 for optimisation. All necessary\ndependencies can be pulled from Docker Hub\n(https://hub.docker.com/repository/docker/paulflang/sbml2julia). Source code\nand documentation are available at https://github.com/paulflang/SBML2Julia.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2020 00:44:51 GMT"}], "update_date": "2020-11-06", "authors_parsed": [["Lang", "Paul F.", ""], ["Shin", "Sungho", ""], ["Zavala", "Victor M.", ""]]}, {"id": "2011.03526", "submitter": "Camilo Rocha", "authors": "Camila Riccio, Jorge Finke, Camilo Rocha", "title": "Using Overlapping Communities and Network Structure for Identifying\n  Reduced Groups of Stress Responsive Genes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.LG cs.SI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper proposes a workflow to identify genes responding to a specific\ntreatment in an organism, such as abiotic stresses, a main cause of extensive\nagricultural production losses worldwide. On input RNA sequencing read counts\n(measured for genotypes under control and treatment conditions) and biological\nreplicates, it outputs a collection of characterized genes, potentially\nrelevant to treatment. Technically, the proposed approach is both a\ngeneralization and an extension of WGCNA; its main goal is to identify specific\nmodules in a network of genes after a sequence of normalization and filtering\nsteps. In this work, module detection is achieved by using Hierarchical Link\nClustering, which can recognize overlapping communities and thus have more\nbiological meaning given the overlapping regulatory domains of systems that\ngenerate co-expression. Additional steps and information are also added to the\nworkflow, where some networks in the intermediate steps are forced to be\nscale-free and LASSO regression is employed to select the most significant\nmodules of phenotypical responses to stress. Finally, the workflow is showcased\nwith a systematic study on rice (Oryza sativa), a major food source that is\nknown to be highly sensitive to salt stress: a total of 6 modules are detected\nas relevant in the response to salt stress in rice; these genes may act as\npotential targets for the improvement of salinity tolerance in rice cultivars.\nThe proposed workflow has the potential to ultimately reduce the search-space\nfor candidate genes responding to a specific treatment, which can considerably\noptimize the effort, time, and money invested by researchers in the\nexperimental validation of stress responsive genes.\n", "versions": [{"version": "v1", "created": "Fri, 23 Oct 2020 21:14:59 GMT"}], "update_date": "2020-11-09", "authors_parsed": [["Riccio", "Camila", ""], ["Finke", "Jorge", ""], ["Rocha", "Camilo", ""]]}, {"id": "2011.04354", "submitter": "Fedor Garbuzov", "authors": "F. E. Garbuzov, V. V. Gursky", "title": "Non-equilibrium model of short-range repression in gene transcription\n  regulation", "comments": null, "journal-ref": "Phys. Rev. E 104, 014407 (2021)", "doi": "10.1103/PhysRevE.104.014407", "report-no": null, "categories": "q-bio.MN q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transcription factors are proteins that regulate gene activity by activating\nor repressing gene transcription. A special class of transcriptional repressors\noperate via a short-range mechanism, making local DNA regions inaccessible to\nbinding by activators and, thus, providing an indirect repressive action on the\ntarget gene. This mechanism is commonly modeled assuming that the repressors\ninteract with the DNA under thermodynamic equilibrium. The equilibrium approach\nto short-range repression makes it necessary to neglect some configurations of\nthe gene regulatory region. We elaborate a more general non-equilibrium model\nof short-range repression using the graph formalism for transitions between\ngene states and apply analytical calculations to compare it with the\nequilibrium model in terms of the repression strength and expression noise. In\ncontrast to the equilibrium approach, the new model allows to separate two\nbasic mechanisms of short-range repression. The first mechanism is associated\nwith the recruiting of factors that mediate chromatin condensation, and the\nsecond one concerns the blocking of factors that mediate chromatin loosening.\nThe non-equilibrium model demonstrates better performance on previously\npublished gene expression data obtained for transcription factors controlling\nDrosophila development and, furthermore, predicts that the first repression\nmechanism is the most favorable in this system. The presented approach can be\nscaled to larger gene networks and can be used to infer specific modes and\nparameters of transcriptional regulation from gene expression data.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2020 11:38:13 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Garbuzov", "F. E.", ""], ["Gursky", "V. V.", ""]]}, {"id": "2011.04415", "submitter": "Fernando Antoneli Jr", "authors": "Jo\\~ao Luiz de Oliveira Madeira, Fernando Antoneli", "title": "Homeostasis in Networks with Multiple Input Nodes and Robustness in\n  Bacterial Chemotaxis", "comments": "59 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN math.DS physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A biological system is considered homeostatic when there is a regulated\nvariable that is maintained within a narrow range of values. A closely related\nnotion of adaptation can be defined as a process where a system initially\nresponds to a stimulus, but then returns to basal or near-basal levels of\nactivity after some period of time. Adaptation of the chemotaxis sensory\npathway of the bacterium Escherichia coli is essential for detecting chemicals\nover a wide range of background concentrations, ultimately allowing cells to\nswim towards sources of attractant and away from repellents. Since bacterial\nchemotaxis is a paradigm for adaptation or homeostasis, we use it as a model\nsystem to base the development of a general theory for the analysis of\nhomeostasis in coupled dynamical systems associated with input-output networks\nwith multiple input nodes. This theory allows one to define and classify\nhomeostasis types of a given network in a model independent fashion, in the\nsense that it depends only on the network topology and not on the specific\nmodel equations. Each homeostasis type represents a possible mechanism for\ngenerating homeostasis and is associated with a suitable subnetwork motif.\nWithin this framework it is also possible to formalize a notion of generic\nproperty of a coupled dynamical system, generalizing the notion of robustness.\nFinally, we apply our theory to a specific model of Escherichia coli chemotaxis\nand show that, from our abstract point of view, adaptation or homeostasis in\nthe model is caused by a mechanism that we called input counterweight. This new\nhomeostasis mechanism is generated by a balancing between the several input\nnodes of the network and requires the existence of at least two input nodes.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2020 21:28:51 GMT"}, {"version": "v2", "created": "Fri, 16 Apr 2021 17:06:03 GMT"}], "update_date": "2021-04-19", "authors_parsed": [["Madeira", "João Luiz de Oliveira", ""], ["Antoneli", "Fernando", ""]]}, {"id": "2011.06478", "submitter": "Andreas Kraemer", "authors": "Andreas Kr\\\"amer", "title": "Master regulators as order parameters of gene expression states", "comments": "11 pages, 3 figures", "journal-ref": "Phys. Rev. E 103, 012409 (2021)", "doi": "10.1103/PhysRevE.103.012409", "report-no": null, "categories": "q-bio.MN physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cell type-specific gene expression patterns are represented as memory states\nof a Hopfield neural network model. It is shown that order parameters of this\nmodel can be interpreted as concentrations of master transcription regulators\nthat form concurrent positive feedback loops with a large number of downstream\nregulated genes. The order parameter free energy then defines an epigenetic\nlandscape in which local minima correspond to stable cell states. The model is\napplied to gene expression data in the context of hematopoiesis.\n", "versions": [{"version": "v1", "created": "Thu, 12 Nov 2020 16:30:43 GMT"}], "update_date": "2021-01-27", "authors_parsed": [["Krämer", "Andreas", ""]]}, {"id": "2011.08902", "submitter": "Marisol Salgado-Albarran", "authors": "Marisol Salgado-Albarran, Erick I. Navarro-Delgado, Aylin Del\n  Moral-Morales, Nicolas Alcaraz, Jan Baumbach, Rodrigo Gonzalez-Barrios,\n  Ernesto Soto-Reyes", "title": "Comparative transcriptome analysis reveals key epigenetic targets in\n  SARS-CoV-2 infection", "comments": "33 pages, 2 tables, 5 figures, 4 supplementary figures", "journal-ref": null, "doi": "10.1038/s41540-021-00181-x", "report-no": null, "categories": "q-bio.MN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  COVID-19 is an infection caused by SARS-CoV-2 (Severe Acute Respiratory\nSyndrome coronavirus 2), which has caused a global outbreak. Current research\nefforts are focused on the understanding of the molecular mechanisms involved\nin SARS-CoV-2 infection in order to propose drug-based therapeutic options.\nTranscriptional changes due to epigenetic regulation are key host cell\nresponses to viral infection and have been studied in SARS-CoV and MERS-CoV;\nhowever, such changes are not fully described for SARS-CoV-2. In this study, we\nanalyzed multiple transcriptomes obtained from cell lines infected with\nMERS-CoV, SARS-CoV and SARS-CoV-2, and from COVID-19 patient-derived samples.\nUsing integrative analyses of gene co-expression networks and de-novo pathway\nenrichment, we characterize different gene modules and protein pathways\nenriched with Transcription Factors or Epifactors relevant for SARS-CoV-2\ninfection. We identified EP300, MOV10, RELA and TRIM25 as top candidates, and\nmore than 60 additional proteins involved in the epigenetic response during\nviral infection that have therapeutic potential. Our results show that\ntargeting the epigenetic machinery could be a feasible alternative to treat\nCOVID-19.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2020 19:40:19 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Salgado-Albarran", "Marisol", ""], ["Navarro-Delgado", "Erick I.", ""], ["Del Moral-Morales", "Aylin", ""], ["Alcaraz", "Nicolas", ""], ["Baumbach", "Jan", ""], ["Gonzalez-Barrios", "Rodrigo", ""], ["Soto-Reyes", "Ernesto", ""]]}, {"id": "2011.10529", "submitter": "Ali Abdi", "authors": "Iman Habibi, Effat S Emamian, Osvaldo Simeone and Ali Abdi", "title": "Computation capacities of a broad class of signaling networks are higher\n  than their communication capacities", "comments": "51 pages, 8 figures", "journal-ref": "Phys. Biol. 16 064001 (2019)", "doi": "10.1088/1478-3975/ab4345", "report-no": null, "categories": "q-bio.MN cs.IT math.IT q-bio.SC stat.CO", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Due to structural and functional abnormalities or genetic variations and\nmutations, there may be dysfunctional molecules within an intracellular\nsignaling network that do not allow the network to correctly regulate its\noutput molecules, such as transcription factors. This disruption in signaling\ninterrupts normal cellular functions and may eventually develop some\npathological conditions. In this paper, computation capacity of signaling\nnetworks is introduced as a fundamental limit on signaling capability and\nperformance of such networks. The computation capacity measures the maximum\nnumber of computable inputs, that is, the maximum number of input values for\nwhich the correct functional output values can be recovered from the erroneous\nnetwork outputs, when the network contains some dysfunctional molecules. This\ncontrasts with the conventional communication capacity that measures instead\nthe maximum number of input values that can be correctly distinguished based on\nthe erroneous network outputs.\n  The computation capacity is higher than the communication capacity, if the\nnetwork response function is not a one-to-one function of the input signals. By\nexplicitly incorporating the effect of signaling errors that result in the\nnetwork dysfunction, the computation capacity provides more information about\nthe network and its malfunction. Two examples of signaling networks are studied\nhere, one regulating caspase3 and another regulating NFkB, for which\ncomputation and communication capacities are analyzed. Higher computation\ncapacities are observed for both networks. One biological implication of this\nfinding is that signaling networks may have more capacity than that specified\nby the conventional communication capacity metric. The effect of feedback is\nalso studied. In summary, this paper reports findings on a new fundamental\nfeature of the signaling capability of cell signaling networks.\n", "versions": [{"version": "v1", "created": "Fri, 20 Nov 2020 17:59:02 GMT"}], "update_date": "2020-11-23", "authors_parsed": [["Habibi", "Iman", ""], ["Emamian", "Effat S", ""], ["Simeone", "Osvaldo", ""], ["Abdi", "Ali", ""]]}, {"id": "2011.10873", "submitter": "Andreas Buttensch\\\"on", "authors": "Andreas Buttensch\\\"on, Leah Edelstein-Keshet", "title": "Bridging from single to collective cell migration: A review of models\n  and links to experiments", "comments": "39 pages, 5 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1008411", "report-no": null, "categories": "q-bio.CB q-bio.MN q-bio.QM q-bio.TO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Mathematical and computational models can assist in gaining an understanding\nof cell behavior at many levels of organization. Here, we review models in the\nliterature that focus on eukaryotic cell motility at 3 size scales:\nintracellular signaling that regulates cell shape and movement, single cell\nmotility, and collective cell behavior from a few cells to tissues. We survey\nrecent literature to summarize distinct computational methods (phase-field,\npolygonal, Cellular Potts, and spherical cells). We discuss models that bridge\nbetween levels of organization, and describe levels of detail, both biochemical\nand geometric, included in the models. We also highlight links between models\nand experiments. We find that models that span the 3 levels are still in the\nminority.\n", "versions": [{"version": "v1", "created": "Sat, 21 Nov 2020 21:35:48 GMT"}], "update_date": "2021-01-27", "authors_parsed": [["Buttenschön", "Andreas", ""], ["Edelstein-Keshet", "Leah", ""]]}, {"id": "2011.10953", "submitter": "Tsvi Tlusty", "authors": "Albert Libchaber and Tsvi Tlusty", "title": "Walking droplets, swimming microbes: on memory in physics and life", "comments": null, "journal-ref": "Comptes Rendus. M\\'ecanique, 348 (2020) no. 6-7, pp. 545-554", "doi": "10.5802/crmeca.25", "report-no": null, "categories": "q-bio.PE physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Whirling and swerving, a bacterium is swimming in a test tube, foraging for\nfood. On the surface of a vibrating bath, a droplet starts walking. A certain\nsimilarity, but mostly dissimilarity, between the physical memory that emerges\nin Couder's droplet experiments and the biological memory of the bacterium is\nnoted. It serves as a starting point for a short perspective and speculation on\nthe multilevel, loopy memory of living matter.\n", "versions": [{"version": "v1", "created": "Sun, 22 Nov 2020 06:25:40 GMT"}], "update_date": "2020-11-24", "authors_parsed": [["Libchaber", "Albert", ""], ["Tlusty", "Tsvi", ""]]}, {"id": "2011.14994", "submitter": "Ugur Cetiner", "authors": "Ugur Cetiner and Jeremy Gunawardena", "title": "Reformulating non-equilibrium steady-states and generalised Hopfield\n  discrimination", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Markov processes are widely used to model stochastic systems in physics and\nbiology. Their steady-state (s.s.) probabilities are given in terms of their\ntransition rates by the Matrix-Tree theorem (MTT). The MTT uses spanning trees\nin a graph-theoretic representation of the system and reveals that, away from\nthermodynamic equilibrium, s.s. probabilities become globally dependent on all\ntransition rates and the resulting expressions grow super-exponentially in the\ngraph size. The overwhelming complexity and lack of thermodynamic insight have\nimpeded analysis, despite substantial progress elsewhere in non-equilibrium\nphysics. Assuming Arrhenius rates with vertex energies and edge barrier\nenergies, we show that the s.s. probability of vertex $i$ is proportional to\nthe average of $\\exp(-S(P))$, where $S(P)$ is the entropy generated along a\nminimal path, $P$, from $i$ to a reference vertex. The average is taken over a\nBoltzmann-like probability distribution on spanning trees, whose ``energies''\nare their total edge barrier energies. This reformulation offers a\nthermodynamic interpretation that smoothly generalises equilibrium statistical\nmechanics and it reorganises the expression complexity: the number of distinct\nminimal-path entropies depends on the number of edges where energy is expended,\nnot on graph size. We demonstrate the power of this reformulation by extending\nHopfield's analysis of discrimination by kinetic proofreading to any graph in\nwhich energy is expended at only one edge, for which we derive a general\nformula for the s.s. error ratio.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2020 16:59:50 GMT"}], "update_date": "2020-12-01", "authors_parsed": [["Cetiner", "Ugur", ""], ["Gunawardena", "Jeremy", ""]]}]