[{"id": "0807.1513", "submitter": "Jonathan Tapson", "authors": "J. Tapson, C. Jin, A. van Schaik, and R. Etienne-Cummings", "title": "A First-Order Non-Homogeneous Markov Model for the Response of Spiking\n  Neurons Stimulated by Small Phase-Continuous Signals", "comments": "Accepted for publication in Neural Computation", "journal-ref": "Neural Computation Volume 21 Issue 6 Pages 1554-1588 Year 2009", "doi": null, "report-no": null, "categories": "q-bio.NC cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a first-order non-homogeneous Markov model for the\ninterspike-interval density of a continuously stimulated spiking neuron. The\nmodel allows the conditional interspike-interval density and the stationary\ninterspike-interval density to be expressed as products of two separate\nfunctions, one of which describes only the neuron characteristics, and the\nother of which describes only the signal characteristics. This allows the use\nof this model to predict the response when the underlying neuron model is not\nknown or well determined. The approximation shows particularly clearly that\nsignal autocorrelations and cross-correlations arise as natural features of the\ninterspike-interval density, and are particularly clear for small signals and\nmoderate noise. We show that this model simplifies the design of spiking neuron\ncross-correlation systems, and describe a four-neuron mutual inhibition network\nthat generates a cross-correlation output for two input signals.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jul 2008 18:36:48 GMT"}], "update_date": "2012-08-15", "authors_parsed": [["Tapson", "J.", ""], ["Jin", "C.", ""], ["van Schaik", "A.", ""], ["Etienne-Cummings", "R.", ""]]}, {"id": "0807.2282", "submitter": "Arfan Ghani Mr.", "authors": "Arfan Ghani, Martin McGinnity, Liam Maguire, Jim Harkin", "title": "Hardware/Software Co-Design for Spike Based Recognition", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.AI cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The practical applications based on recurrent spiking neurons are limited due\nto their non-trivial learning algorithms. The temporal nature of spiking\nneurons is more favorable for hardware implementation where signals can be\nrepresented in binary form and communication can be done through the use of\nspikes. This work investigates the potential of recurrent spiking neurons\nimplementations on reconfigurable platforms and their applicability in temporal\nbased applications. A theoretical framework of reservoir computing is\ninvestigated for hardware/software implementation. In this framework, only\nreadout neurons are trained which overcomes the burden of training at the\nnetwork level. These recurrent neural networks are termed as microcircuits\nwhich are viewed as basic computational units in cortical computation. This\npaper investigates the potential of recurrent neural reservoirs and presents a\nnovel hardware/software strategy for their implementation on FPGAs. The design\nis implemented and the functionality is tested in the context of speech\nrecognition application.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jul 2008 23:44:47 GMT"}], "update_date": "2008-07-16", "authors_parsed": [["Ghani", "Arfan", ""], ["McGinnity", "Martin", ""], ["Maguire", "Liam", ""], ["Harkin", "Jim", ""]]}, {"id": "0807.2928", "submitter": "Guoshen Yu", "authors": "Guoshen Yu and Jean-Jacques Slotine", "title": "Visual Grouping by Neural Oscillators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed synchronization is known to occur at several scales in the brain,\nand has been suggested as playing a key functional role in perceptual grouping.\nState-of-the-art visual grouping algorithms, however, seem to give\ncomparatively little attention to neural synchronization analogies. Based on\nthe framework of concurrent synchronization of dynamic systems, simple networks\nof neural oscillators coupled with diffusive connections are proposed to solve\nvisual grouping problems. Multi-layer algorithms and feedback mechanisms are\nalso studied. The same algorithm is shown to achieve promising results on\nseveral classical visual grouping problems, including point clustering, contour\nintegration and image segmentation.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jul 2008 11:23:27 GMT"}], "update_date": "2008-07-21", "authors_parsed": [["Yu", "Guoshen", ""], ["Slotine", "Jean-Jacques", ""]]}]