[{"id": "1007.0057", "submitter": "Jue-Sam Chou", "authors": "Yalin Chen, Jue-Sam Chou*, Chun-Hui Huang", "title": "Comments on Five Smart Card Based Password Authentication Protocols", "comments": "4 pages,", "journal-ref": "(IJCSIS) International Journal of Computer Science and Information\n  Security, Vol. 8, No. 2, 2010", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we use the ten security requirements proposed by Liao et al.\nfor a smart card based authentication protocol to examine five recent work in\nthis area. After analyses, we found that the protocols of Juang et al.'s ,\nHsiang et al.'s, Kim et al.'s, and Li et al.'s all suffer from offline password\nguessing attack if the smart card is lost, and the protocol of Xu et al.'s is\nsubjected to an insider impersonation attack.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 02:22:16 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Chen", "Yalin", ""], ["Chou*", "Jue-Sam", ""], ["Huang", "Chun-Hui", ""]]}, {"id": "1007.0060", "submitter": "Jue-Sam Chou", "authors": "Yalin Chen, Jue-Sam Chou*, Chun-Hui Huang", "title": "Cryptanalysis on Four Two-Party Authentication Protocols", "comments": "5 pages", "journal-ref": "(IJCSIS) International Journal of Computer Science and Information\n  Security, Vol. 8, No. 2, 2010", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we analyze four authentication protocols of Bindu et al.,\nGoriparthi et al., Wang et al. and H\\\"olbl et al.. After investigation, we\nreveal several weaknesses of these schemes. First, Bindu et al.'s protocol\nsuffers from an insider impersonation attack if a malicious user obtains a lost\nsmart card. Second, both Goriparthi et al.'s and Wang et al.'s protocols cannot\nwithstand a DoS attack in the password change phase, i.e. an attacker can\ninvolve the phase to make user's password never be used in subsequent\nauthentications. Third, H\\\"olbl et al.'s protocol is vulnerable to an insider\nattack since a legal but malevolent user can deduce KGC's secret key.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 02:43:23 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Chen", "Yalin", ""], ["Chou*", "Jue-Sam", ""], ["Huang", "Chun-Hui", ""]]}, {"id": "1007.0087", "submitter": "Kumar Krishnan", "authors": "Krishnan Kumar, Nafeesa Begum J and V. Sumathy", "title": "A Novel Approach towards Cost Effective Region-Based Group Key Agreement\n  Protocol for Secure Group Communication", "comments": "10 pages,29 figures", "journal-ref": "(IJCSIS) International Journal of Computer Science and Information\n  Security, Vol. 8, No. 2, 2010", "doi": null, "report-no": "pkk-2010-02", "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This paper addresses an interesting security problem in wireless ad hoc\nnetworks: the Dynamic Group Key Agreement key establishment. For secure group\ncommunication in an Ad hoc network, a group key shared by all group members is\nrequired. This group key should be updated when there are membership changes\n(when the new member joins or current member leaves) in the group. In this\npaper, We propose a novel, secure, scalable and efficient Region-Based Group\nKey Agreement protocol (RBGKA) for ad-hoc networks. This is implemented by a\ntwo-level structure and a new scheme of group key update. The idea is to divide\nthe group into subgroups, each maintaining its subgroup keys using Group\nDiffie-Hellman (GDH) Protocol and links with other subgroups in a Tree\nstructure using Tree-based Group Diffie-Hellman (TGDH) protocol. By introducing\nregion-based approach, messages and key updates will be limited within subgroup\nand outer group; hence computation load is distributed among many hosts. Both\ntheoretical analysis and experimental results show that this Region-based key\nagreement protocol performs better for the key establishment problem in ad-hoc\nnetwork in terms of memory cost, computation cost and communication cost.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 07:03:17 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Kumar", "Krishnan", ""], ["J", "Nafeesa Begum", ""], ["Sumathy", "V.", ""]]}, {"id": "1007.0292", "submitter": "Ajay Prasad", "authors": "Ajay Prasad, G.K.Panda, A. Mitra, Arjun Singh, Deepak Gour", "title": "Applying l-Diversity in anonymizing collaborative social network", "comments": null, "journal-ref": "International Journal of Computer Science and Information Security\n  Year 2010 Vol: 8, Issue: 2 pages 324 - 329", "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To date publish of a giant social network jointly from different parties is\nan easier collaborative approach. Agencies and researchers who collect such\nsocial network data often have a compelling interest in allowing others to\nanalyze the data. In many cases the data describes relationships that are\nprivate and sharing the data in full can result in unacceptable disclosures.\nThus, preserving privacy without revealing sensitive information in the social\nnetwork is a serious concern. Recent developments for preserving privacy using\nanonymization techniques are focused on relational data only. Preserving\nprivacy in social networks against neighborhood attacks is an initiation which\nuses the definition of privacy called k-anonymity. k-anonymous social network\nstill may leak privacy under the cases of homogeneity and background knowledge\nattacks. To overcome, we find a place to use a new practical and efficient\ndefinition of privacy called ldiversity. In this paper, we take a step further\non preserving privacy in collaborative social network data with algorithms and\nanalyze the effect on the utility of the data for social network analysis.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2010 04:57:59 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Prasad", "Ajay", ""], ["Panda", "G. K.", ""], ["Mitra", "A.", ""], ["Singh", "Arjun", ""], ["Gour", "Deepak", ""]]}, {"id": "1007.0295", "submitter": "Ajay Prasad", "authors": "Ajay Prasad, Saurabh Singh Verma, Ashok Kumar Sharma", "title": "Certification Authority Monitored Multilevel and Stateful Policy Based\n  Authorization in Services Oriented Grids", "comments": null, "journal-ref": "Certification Authority Monitored Multilevel and Stateful Policy\n  Based Authorization in Services Oriented Grids, International Journal of\n  Security, (IJS), Volume (3) : Issue(4):48-64, 2009", "doi": null, "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Services oriented grids will be more prominent among other kinds of grids in\nthe present distributed environments. With the advent of online government\nservices the governmental grids will come up in huge numbers. Apart from common\nsecurity issues as in other grids, the authorization in service oriented grids\nfaces certain shortcomings and needs to be looked upon differently. The CMMS\nmodel presented here overcomes all these shortcomings and adds to the\nsimplicity of implementation because of its tight similarities with certain\ngovernment services and their functioning. The model is used to prototype a\nState Police Information Grid (SPIG). Small technological restructuring is\nrequired in PKIX and X.509 certificates.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2010 05:09:51 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Prasad", "Ajay", ""], ["Verma", "Saurabh Singh", ""], ["Sharma", "Ashok Kumar", ""]]}, {"id": "1007.0302", "submitter": "Irfan Syamsuddin", "authors": "Irfan Syamsuddin and Junseok Hwang", "title": "The Application of AHP Model to Guide Decision Makers: A Case Study of\n  E-banking Security", "comments": "5 pages", "journal-ref": null, "doi": "10.1109/ICCIT.2009.251", "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Changes in technology have resulted in new ways for bankers to deliver their\nservices to costumers. Electronic banking systems in various forms are the\nevidence of such advancement. However, information security threats also\nevolving along this trend. This paper proposes the application of Analytic\nHierarchy Process (AHP) methodology to guide decision makers in banking\nindustries to deal with information security policy. The model is structured\naccording aspects of information security policy in conjunction with\ninformation security elements. We found that cultural aspect is valued on the\ntop priority among other security aspects, while confidentiality is considered\nas the most important factor in terms of information security elements.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2010 05:52:33 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Syamsuddin", "Irfan", ""], ["Hwang", "Junseok", ""]]}, {"id": "1007.0408", "submitter": "Dario Freni", "authors": "Sergio Mascetti and Dario Freni and Claudio Bettini and X. Sean Wang\n  and Sushil Jajodia", "title": "Privacy in geo-social networks: proximity notification with untrusted\n  service providers and curious buddies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A major feature of the emerging geo-social networks is the ability to notify\na user when one of his friends (also called buddies) happens to be\ngeographically in proximity with the user. This proximity service is usually\noffered by the network itself or by a third party service provider (SP) using\nlocation data acquired from the users. This paper provides a rigorous\ntheoretical and experimental analysis of the existing solutions for the\nlocation privacy problem in proximity services. This is a serious problem for\nusers who do not trust the SP to handle their location data, and would only\nlike to release their location information in a generalized form to\nparticipating buddies. The paper presents two new protocols providing complete\nprivacy with respect to the SP, and controllable privacy with respect to the\nbuddies. The analytical and experimental analysis of the protocols takes into\naccount privacy, service precision, and computation and communication costs,\nshowing the superiority of the new protocols compared to those appeared in the\nliterature to date. The proposed protocols have also been tested in a full\nsystem implementation of the proximity service.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2010 17:25:51 GMT"}, {"version": "v2", "created": "Sat, 6 Nov 2010 12:57:26 GMT"}], "update_date": "2010-11-09", "authors_parsed": [["Mascetti", "Sergio", ""], ["Freni", "Dario", ""], ["Bettini", "Claudio", ""], ["Wang", "X. Sean", ""], ["Jajodia", "Sushil", ""]]}, {"id": "1007.0449", "submitter": "Jean-Claude Belfiore", "authors": "Jean-Claude Belfiore and Patrick Sole", "title": "Unimodular Lattices for the Gaussian Wiretap Channel", "comments": "6 pages, 9 figures, 2010 Information Theory Workshop, Dublin", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper, the authors introduced a lattice invariant called \"Secrecy\nGain\" which measures the confusion experienced by a passive eavesdropper on the\nGaussian Wiretap Channel. We study, here, the behavior of this invariant for\nunimodular lattices by using tools from Modular Forms and show that, for some\nfamilies of unimodular lattices, indexed by the dimension, the secrecy gain\nexponentially goes to infinity with the dimension.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2010 21:31:34 GMT"}], "update_date": "2010-07-06", "authors_parsed": [["Belfiore", "Jean-Claude", ""], ["Sole", "Patrick", ""]]}, {"id": "1007.0484", "submitter": "Blaine Nelson", "authors": "Blaine Nelson and Benjamin I. P. Rubinstein and Ling Huang and Anthony\n  D. Joseph and Steven J. Lee and Satish Rao and J. D. Tygar", "title": "Query Strategies for Evading Convex-Inducing Classifiers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classifiers are often used to detect miscreant activities. We study how an\nadversary can systematically query a classifier to elicit information that\nallows the adversary to evade detection while incurring a near-minimal cost of\nmodifying their intended malfeasance. We generalize the theory of Lowd and Meek\n(2005) to the family of convex-inducing classifiers that partition input space\ninto two sets one of which is convex. We present query algorithms for this\nfamily that construct undetected instances of approximately minimal cost using\nonly polynomially-many queries in the dimension of the space and in the level\nof approximation. Our results demonstrate that near-optimal evasion can be\naccomplished without reverse-engineering the classifier's decision boundary. We\nalso consider general lp costs and show that near-optimal evasion on the family\nof convex-inducing classifiers is generally efficient for both positive and\nnegative convexity for all levels of approximation if p=1.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jul 2010 09:04:44 GMT"}], "update_date": "2010-07-06", "authors_parsed": [["Nelson", "Blaine", ""], ["Rubinstein", "Benjamin I. P.", ""], ["Huang", "Ling", ""], ["Joseph", "Anthony D.", ""], ["Lee", "Steven J.", ""], ["Rao", "Satish", ""], ["Tygar", "J. D.", ""]]}, {"id": "1007.0619", "submitter": "Rahul Mukerjee", "authors": "Mausumi Bose and Rahul Mukerjee", "title": "Anti-Collusion Digital Fingerprinting Codes via Partially Cover-Free\n  Families", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Anti-collusion digital fingerprinting codes have been of significant current\ninterest in the context of deterring unauthorized use of multimedia content by\na coalition of users. In this article, partially cover-free families of sets\nare considered and these are employed to obtain such codes. Compared to the\nexisting methods of construction, our methods ensure gains in terms of\naccommodating more users and/or reducing the number of basis vectors.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jul 2010 05:51:05 GMT"}], "update_date": "2010-07-06", "authors_parsed": [["Bose", "Mausumi", ""], ["Mukerjee", "Rahul", ""]]}, {"id": "1007.0642", "submitter": "Andreas U. Schmidt", "authors": "Andreas U. Schmidt, Andreas Leicher, Yogendra Shah, Inhyok Cha", "title": "Tree-formed Verification Data for Trusted Platforms", "comments": "15 pages, 11 figures, v3: Reference added, v4: Revised, accepted for\n  publication in Computers and Security", "journal-ref": "Computers & Security 32 (2013) 19-35", "doi": "10.1016/j.cose.2012.09.004", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The establishment of trust relationships to a computing platform relies on\nvalidation processes. Validation allows an external entity to build trust in\nthe expected behaviour of the platform based on provided evidence of the\nplatform's configuration. In a process like remote attestation, the 'trusted'\nplatform submits verification data created during a start up process. These\ndata consist of hardware-protected values of platform configuration registers,\ncontaining nested measurement values, e.g., hash values, of loaded or started\ncomponents. Commonly, the register values are created in linear order by a\nhardware-secured operation. Fine-grained diagnosis of components, based on the\nlinear order of verification data and associated measurement logs, is not\noptimal. We propose a method to use tree-formed verification data to validate a\nplatform. Component measurement values represent leaves, and protected\nregisters represent roots of a hash tree. We describe the basic mechanism of\nvalidating a platform using tree-formed measurement logs and root registers and\nshow an logarithmic speed-up for the search of faults. Secure creation of a\ntree is possible using a limited number of hardware-protected registers and a\nsingle protected operation. In this way, the security of tree-formed\nverification data is maintained.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jul 2010 09:28:23 GMT"}, {"version": "v2", "created": "Fri, 16 Jul 2010 16:17:42 GMT"}, {"version": "v3", "created": "Thu, 19 Aug 2010 08:35:35 GMT"}, {"version": "v4", "created": "Thu, 18 Oct 2012 11:39:49 GMT"}], "update_date": "2013-01-24", "authors_parsed": [["Schmidt", "Andreas U.", ""], ["Leicher", "Andreas", ""], ["Shah", "Yogendra", ""], ["Cha", "Inhyok", ""]]}, {"id": "1007.0767", "submitter": "Wojciech Mazurczyk", "authors": "Wojciech Mazurczyk, Milosz Smolarczyk, Krzysztof Szczypiorski", "title": "Retransmission Steganography Applied", "comments": "5 pages, 6 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents experimental results of the implementation of network\nsteganography method called RSTEG (Retransmission Steganography). The main idea\nof RSTEG is to not acknowledge a successfully received packet to intentionally\ninvoke retransmission. The retransmitted packet carries a steganogram instead\nof user data in the payload field. RSTEG can be applied to many network\nprotocols that utilize retransmissions. We present experimental results for\nRSTEG applied to TCP (Transmission Control Protocol) as TCP is the most popular\nnetwork protocol which ensures reliable data transfer. The main aim of the\nperformed experiments was to estimate RSTEG steganographic bandwidth and\ndetectability by observing its influence on the network retransmission level.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jul 2010 20:37:57 GMT"}], "update_date": "2010-07-07", "authors_parsed": [["Mazurczyk", "Wojciech", ""], ["Smolarczyk", "Milosz", ""], ["Szczypiorski", "Krzysztof", ""]]}, {"id": "1007.0917", "submitter": "Bela Genge", "authors": "Gyula Farkas, Bela Genge, Piroska Haller", "title": "A Platform for Implementing Secure Wireless Ad Hoc Networks", "comments": "Proceedings of the 2nd conference on Recent Achievements in\n  Mechatronics, Automation, Computer Science and Robotics, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  We propose a new platform for implementing secure wireless ad hoc networks.\nOur proposal is based on a modular architecture, with the software stack\nconstructed directly on the Ethernet layer. Within our platform we use a new\nsecurity protocol that we designed to ensure mutual authentication between\nnodes and a secure key exchange. The correctness of the proposed security\nprotocol is ensured by Guttman's authentication tests.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2010 15:11:44 GMT"}], "update_date": "2010-07-07", "authors_parsed": [["Farkas", "Gyula", ""], ["Genge", "Bela", ""], ["Haller", "Piroska", ""]]}, {"id": "1007.0918", "submitter": "Jonathan Heusser", "authors": "Jonathan Heusser and Pasquale Malacaria", "title": "Quantifying Information Leak Vulnerabilities", "comments": "submitted, under review", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Leakage of confidential information represents a serious security risk.\nDespite a number of novel, theoretical advances, it has been unclear if and how\nquantitative approaches to measuring leakage of confidential information could\nbe applied to substantial, real-world programs. This is mostly due to the high\ncomplexity of computing precise leakage quantities. In this paper, we introduce\na technique which makes it possible to decide if a program conforms to a\nquantitative policy which scales to large state-spaces with the help of bounded\nmodel checking.\n  Our technique is applied to a number of officially reported information leak\nvulnerabilities in the Linux Kernel. Additionally, we also analysed\nauthentication routines in the Secure Remote Password suite and of a Internet\nMessage Support Protocol implementation. Our technique shows when there is\nunacceptable leakage; the same technique is also used to verify, for the first\ntime, that the applied software patches indeed plug the information leaks.\n  This is the first demonstration of quantitative information flow addressing\nsecurity concerns of real-world industrial programs.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2010 15:12:12 GMT"}], "update_date": "2010-07-07", "authors_parsed": [["Heusser", "Jonathan", ""], ["Malacaria", "Pasquale", ""]]}, {"id": "1007.1259", "submitter": "Michael Goodrich", "authors": "Michael T. Goodrich, Michael Mitzenmacher", "title": "Privacy-Preserving Access of Outsourced Data via Oblivious RAM\n  Simulation", "comments": "A more complete version of a paper appearing in the 38th\n  International Colloquium on Automata, Languages and Programming (ICALP) 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Suppose a client, Alice, has outsourced her data to an external storage\nprovider, Bob, because he has capacity for her massive data set, of size n,\nwhereas her private storage is much smaller--say, of size O(n^{1/r}), for some\nconstant r > 1. Alice trusts Bob to maintain her data, but she would like to\nkeep its contents private. She can encrypt her data, of course, but she also\nwishes to keep her access patterns hidden from Bob as well. We describe schemes\nfor the oblivious RAM simulation problem with a small logarithmic or\npolylogarithmic amortized increase in access times, with a very high\nprobability of success, while keeping the external storage to be of size O(n).\nTo achieve this, our algorithmic contributions include a parallel MapReduce\ncuckoo-hashing algorithm and an external-memory dataoblivious sorting\nalgorithm.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2010 23:21:31 GMT"}, {"version": "v2", "created": "Mon, 2 May 2011 23:41:14 GMT"}], "update_date": "2011-05-04", "authors_parsed": [["Goodrich", "Michael T.", ""], ["Mitzenmacher", "Michael", ""]]}, {"id": "1007.1473", "submitter": "Xinyu Xing", "authors": "Xinyu Xing, Jianxun Dang, Richard Han, Xue Liu, Shivakant Mishra", "title": "Intrusions into Privacy in Video Chat Environments: Attacks and\n  Countermeasures", "comments": "8 pages, submitted to WPES", "journal-ref": null, "doi": null, "report-no": "Technical Report CU-CS 1069-10", "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Video chat systems such as Chatroulette have become increasingly popular as a\nway to meet and converse one-on-one via video and audio with other users online\nin an open and interactive manner. At the same time, security and privacy\nconcerns inherent in such communication have been little explored. This paper\npresents one of the first investigations of the privacy threats found in such\nvideo chat systems, identifying three such threats, namely de-anonymization\nattacks, phishing attacks, and man-in-the-middle attacks. The paper further\ndescribes countermeasures against each of these attacks.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 21:38:54 GMT"}], "update_date": "2010-07-12", "authors_parsed": [["Xing", "Xinyu", ""], ["Dang", "Jianxun", ""], ["Han", "Richard", ""], ["Liu", "Xue", ""], ["Mishra", "Shivakant", ""]]}, {"id": "1007.1678", "submitter": "David Zuckerman", "authors": "David Zuckerman", "title": "Can Random Coin Flips Speed Up a Computer?", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This expository essay introduces randomness and computation to a lay\naudience.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2010 21:50:25 GMT"}], "update_date": "2010-07-13", "authors_parsed": [["Zuckerman", "David", ""]]}, {"id": "1007.2088", "submitter": "MinJi Kim", "authors": "MinJi Kim, Muriel Medard, Joao Barros", "title": "A Multi-hop Multi-source Algebraic Watchdog", "comments": "5 pages, 2 figures, to appear in IEEE ITW Dublin 2010", "journal-ref": null, "doi": "10.1109/CIG.2010.5592893", "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In our previous work \"An Algebraic Watchdog for Wireless Network Coding\", we\nproposed a new scheme in which nodes can detect malicious behaviors\nprobabilistically, police their downstream neighbors locally using overheard\nmessages; thus, provide a secure global \"self-checking network\". As the first\nbuilding block of such a system, we focused on a two-hop network, and presented\na graphical model to understand the inference process by which nodes police\ntheir downstream neighbors and to compute the probabilities of misdetection and\nfalse detection.\n  In this paper, we extend the Algebraic Watchdog to a more general network\nsetting, and propose a protocol in which we can establish \"trust\" in coded\nsystems in a distributed manner. We develop a graphical model to detect the\npresence of an adversarial node downstream within a general two-hop network.\nThe structure of the graphical model (a trellis) lends itself to well-known\nalgorithms, such as Viterbi algorithm, that can compute the probabilities of\nmisdetection and false detection. Using this as a building block, we generalize\nour scheme to multi-hop networks. We show analytically that as long as the\nmin-cut is not dominated by the Byzantine adversaries, upstream nodes can\nmonitor downstream neighbors and allow reliable communication with certain\nprobability. Finally, we present preliminary simulation results that support\nour analysis.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2010 12:43:04 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Kim", "MinJi", ""], ["Medard", "Muriel", ""], ["Barros", "Joao", ""]]}, {"id": "1007.2217", "submitter": "Qian Wang", "authors": "Qian Wang, Zesheng Chen, Chao Chen", "title": "Darknet-Based Inference of Internet Worm Temporal Characteristics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet worm attacks pose a significant threat to network security and\nmanagement. In this work, we coin the term Internet worm tomography as\ninferring the characteristics of Internet worms from the observations of\nDarknet or network telescopes that monitor a routable but unused IP address\nspace. Under the framework of Internet worm tomography, we attempt to infer\nInternet worm temporal behaviors, i.e., the host infection time and the worm\ninfection sequence, and thus pinpoint patient zero or initially infected hosts.\nSpecifically, we introduce statistical estimation techniques and propose method\nof moments, maximum likelihood, and linear regression estimators. We show\nanalytically and empirically that our proposed estimators can better infer worm\ntemporal characteristics than a naive estimator that has been used in the\nprevious work. We also demonstrate that our estimators can be applied to worms\nusing different scanning strategies such as random scanning and localized\nscanning.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2010 22:11:39 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Wang", "Qian", ""], ["Chen", "Zesheng", ""], ["Chen", "Chao", ""]]}, {"id": "1007.3046", "submitter": "Hao Chen", "authors": "Hao Chen", "title": "Strongly Resilient Non-Interactive Key Predistribution For Hierarchical\n  Networks", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Key establishment is the basic necessary tool in the network security, by\nwhich pairs in the network can establish shared keys for protecting their\npairwise communications. There have been some key agreement or predistribution\nschemes with the property that the key can be established without the\ninteraction (\\cite{Blom84,BSHKY92,S97}). Recently the hierarchical cryptography\nand the key management for hierarchical networks have been active topics(see\n\\cite{BBG05,GHKRRW08,GS02,HNZI02,HL02,Matt04}. ). Key agreement schemes for\nhierarchical networks were presented in \\cite{Matt04,GHKRRW08} which is based\non the Blom key predistribution scheme(Blom KPS, [1]) and pairing. In this\npaper we introduce generalized Blom-Blundo et al key predistribution schemes.\nThese generalized Blom-Blundo et al key predistribution schemes have the same\nsecurity functionality as the Blom-Blundo et al KPS. However different and\nrandom these KPSs can be used for various parts of the networks for enhancing\nthe resilience. We also presentkey predistribution schemes from a family\nhyperelliptic curves. These key predistribution schemes from different random\ncurves can be used for various parts of hierarchical networks. Then the\nnon-interactive, identity-based and dynamic key predistributon scheme based on\nthis generalized Blom-Blundo et al KPSs and hyperelliptic curve KPSs for\nhierarchical networks with the following properties are constructed.\n1)$O(A_KU)$ storage at each node in the network where $U$ is the expansion\nnumber and $A_K$ is the number of nodes at the $K$-th level of the hierarchical\nnetwork; 2)Strongly resilience to the compromising of arbitrary many leaf and\ninternal nodes; 3)Information theoretical security without random oracle.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2010 00:02:37 GMT"}], "update_date": "2010-07-20", "authors_parsed": [["Chen", "Hao", ""]]}, {"id": "1007.3568", "submitter": "Alexander Vardy", "authors": "Hessam Mahdavifar and Alexander Vardy", "title": "Achieving the Secrecy Capacity of Wiretap Channels Using Polar Codes", "comments": "16 pages, 5 figures, published in the IEEE Transactions on\n  Information Theory, vol. 57, no. 10, October 2011. arXiv admin note:\n  substantial text overlap with arXiv:1001.0210", "journal-ref": "IEEE Transactions on Information Theory, vol. 57, no. 10, October\n  2011", "doi": "10.1109/TIT.2011.2162275", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Suppose Alice wishes to send messages to Bob through a communication channel\nC_1, but her transmissions also reach an eavesdropper Eve through another\nchannel C_2. The goal is to design a coding scheme that makes it possible for\nAlice to communicate both reliably and securely. Reliability is measured in\nterms of Bob's probability of error in recovering the message, while security\nis measured in terms of the mutual information between the message and Eve's\nobservations. Wyner showed that the situation is characterized by a single\nconstant C_s, called the secrecy capacity, which has the following meaning: for\nall $\\epsilon > 0$, there exist coding schemes of rate $R \\ge C_s - \\epsilon$\nthat asymptotically achieve both the reliability and the security objectives.\nHowever, his proof of this result is based upon a nonconstructive random-coding\nargument. To date, despite a considerable research effort, the only case where\nwe know how to construct coding schemes that achieve secrecy capacity is when\nEve's channel C_2 is an erasure channel, or a combinatorial variation thereof.\n  Polar codes were recently invented by Arikan; they approach the capacity of\nsymmetric binary-input discrete memoryless channels with low encoding and\ndecoding complexity. Herein, we use polar codes to construct a coding scheme\nthat achieves the secrecy capacity of general wiretap channels. Our\nconstruction works for any instantiation of the wiretap channel model, as\noriginally defined by Wyner, as long as both C_1 and C_2 are symmetric and\nbinary-input. Moreover, we show how to modify our construction in order to\nachieve strong security, as defined by Maurer, while still operating at a rate\nthat approaches the secrecy capacity. In this case, we cannot guarantee that\nthe reliability condition will be satisfied unless the main channel C_1 is\nnoiseless, although we believe it can be always satisfied in practice.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2010 06:49:42 GMT"}, {"version": "v2", "created": "Sun, 25 Sep 2011 04:01:18 GMT"}], "update_date": "2011-10-05", "authors_parsed": [["Mahdavifar", "Hessam", ""], ["Vardy", "Alexander", ""]]}, {"id": "1007.3572", "submitter": "Victor Shcherbacov Alexei", "authors": "V.A. Shcherbacov", "title": "Quasigroups in cryptology", "comments": "31 pages", "journal-ref": "V.A. Shcherbacov, Quasigroups in cryptology, Computer Science\n  Journal of Moldova, vol.17, no. 2(50), 2009, 193-228", "doi": null, "report-no": null, "categories": "math.GR cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a review of some known published applications of quasigroups in\ncryptology.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2010 07:31:17 GMT"}], "update_date": "2010-07-22", "authors_parsed": [["Shcherbacov", "V. A.", ""]]}, {"id": "1007.3862", "submitter": "Chengqing Li", "authors": "Chengqing Li, Michael Z. Q. Chen and Kwok-Tung Lo", "title": "Breaking an image encryption algorithm based on chaos", "comments": "10 pages, 4 figures", "journal-ref": "International Journal of Bifurcation and Chaos, 21(7): 2067-2076,\n  2011", "doi": "10.1142/S0218127411029641", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a chaos-based image encryption algorithm called MCKBA (Modified\nChaotic-Key Based Algorithm) was proposed. This paper analyzes the security of\nMCKBA and finds that it can be broken with a differential attack, which\nrequires only four chosen plain-images. Performance of the attack is verified\nby experimental results. In addition, some defects of MCKBA, including\ninsensitivity with respect to changes of plain-image/secret key, are reported.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2010 12:01:21 GMT"}, {"version": "v2", "created": "Mon, 3 Oct 2016 13:18:43 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Li", "Chengqing", ""], ["Chen", "Michael Z. Q.", ""], ["Lo", "Kwok-Tung", ""]]}, {"id": "1007.4414", "submitter": "Mohammad Reza Sohizadeh Abyaneh", "authors": "Mohammad Reza Sohizadeh Abyaneh", "title": "On the Security of Non-Linear HB (NLHB) Protocol Against Passive Attack", "comments": "This paper is withdrwan due to duplication in DBLP site", "journal-ref": null, "doi": "10.1109/EUC.2010.86", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As a variant of the HB authentication protocol for RFID systems, which relies\non the complexity of decoding linear codes against passive attacks, Madhavan et\nal. presented Non-Linear HB(NLHB) protocol. In contrast to HB, NLHB relies on\nthe complexity of decoding a class of non-linear codes to render the passive\nattacks proposed against HB ineffective. In this paper, we show that passive\nattacks against HB protocol can still be applicable to NLHB and this protocol\ndoes not provide the desired security margin. In our attack, we first linearize\nthe non-linear part of NLHB to obtain a HB equivalent for NLHB, and then\nexploit the passive attack techniques proposed for the HB to evaluate the\nsecurity margin of NLHB. The results show that although NLHB's security margin\nis relatively higher than HB against similar passive attack techniques, it has\nbeen overestimated and, in contrary to what is claimed, NLHB is vulnerable to\npassive attacks against HB, especially when the noise vector in the protocol\nhas a low weight.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2010 10:13:21 GMT"}, {"version": "v2", "created": "Fri, 8 Oct 2010 10:58:44 GMT"}, {"version": "v3", "created": "Tue, 17 Jan 2012 18:33:44 GMT"}], "update_date": "2012-01-18", "authors_parsed": [["Abyaneh", "Mohammad Reza Sohizadeh", ""]]}, {"id": "1007.4606", "submitter": "Qingchun Zhao", "authors": "Qingchun Zhao and Hongxi Yin", "title": "Gbits/s physical-layer stream ciphers based on chaotic light", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We propose a novel high-speed stream cipher encryption scheme based on the\ntrue random key generated by a chaotic semiconductor laser. A 5-Gbits/s\nnon-return-to-zero plaintext is successfully encrypted and decrypted using this\ncryptography. The scheme can be applied in the areas of real-time high-speed\nphysical encryption.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jul 2010 01:58:33 GMT"}], "update_date": "2010-07-28", "authors_parsed": [["Zhao", "Qingchun", ""], ["Yin", "Hongxi", ""]]}, {"id": "1007.4857", "submitter": "Guanfeng Liang", "authors": "Guanfeng Liang and Nitin Vaidya", "title": "Short Note on Complexity of Multi-Value Byzantine Agreement", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Randomized algorithm that achieves multi-valued Byzantine agreement with high\nprobability, and achieves optimal complexity.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jul 2010 00:44:25 GMT"}], "update_date": "2010-07-29", "authors_parsed": [["Liang", "Guanfeng", ""], ["Vaidya", "Nitin", ""]]}]