[{"id": "1201.0410", "submitter": "Zhigang Cao", "authors": "Zhigang Cao and Xiaoguang Yang", "title": "A note on anti-coordination and social interactions", "comments": "7 pages", "journal-ref": null, "doi": "10.1007/s10878-012-9486-7", "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This note confirms a conjecture of [Bramoull\\'{e}, Anti-coordination and\nsocial interactions, Games and Economic Behavior, 58, 2007: 30-49]. The\nproblem, which we name the maximum independent cut problem, is a restricted\nversion of the MAX-CUT problem, requiring one side of the cut to be an\nindependent set. We show that the maximum independent cut problem does not\nadmit any polynomial time algorithm with approximation ratio better than\n$n^{1-\\epsilon}$, where $n$ is the number of nodes, and $\\epsilon$ arbitrarily\nsmall, unless P=NP. For the rather special case where each node has a degree of\nat most four, the problem is still MAXSNP-hard.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 01:42:20 GMT"}, {"version": "v2", "created": "Sun, 1 Apr 2012 04:26:19 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Cao", "Zhigang", ""], ["Yang", "Xiaoguang", ""]]}, {"id": "1201.2207", "submitter": "Janyl Jumadinova", "authors": "Janyl Jumadinova, Prithviraj Dasgupta", "title": "Multi-sensor Information Processing using Prediction Market-based Belief\n  Aggregation", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of information fusion from multiple sensors of\ndifferent types with the objective of improving the confidence of inference\ntasks, such as object classification, performed from the data collected by the\nsensors. We propose a novel technique based on distributed belief aggregation\nusing a multi-agent prediction market to solve this information fusion problem.\nTo monitor the improvement in the confidence of the object classification as\nwell as to dis-incentivize agents from misreporting information, we have\nintroduced a market maker that rewards the agents instantaneously as well as at\nthe end of the inference task, based on the quality of the submitted reports.\nWe have implemented the market maker's reward calculation in the form of a\nscoring rule and have shown analytically that it incentivizes truthful\nrevelation or accurate reporting by each agent. We have experimentally verified\nour technique for multi-sensor information fusion for an automated landmine\ndetection scenario. Our experimental results show that, for identical data\ndistributions and settings, using our information aggregation technique\nincreases the accuracy of object classification favorably as compared to two\nother commonly used techniques for information fusion for landmine detection.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2012 23:29:50 GMT"}], "update_date": "2012-01-12", "authors_parsed": [["Jumadinova", "Janyl", ""], ["Dasgupta", "Prithviraj", ""]]}, {"id": "1201.3667", "submitter": "Simon Kramer", "authors": "Simon Kramer", "title": "A Logic of Interactive Proofs (Formal Theory of Knowledge Transfer)", "comments": "added Appendix D; related to arXiv:1208.1842, arXiv:1208.5913, and\n  arXiv:1309.1328", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CR cs.DC cs.MA math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a logic of interactive proofs as a framework for an intuitionistic\nfoundation for interactive computation, which we construct via an interactive\nanalog of the Goedel-McKinsey-Tarski-Artemov definition of Intuitionistic Logic\nas embedded into a classical modal logic of proofs, and of the Curry-Howard\nisomorphism between intuitionistic proofs and typed programs. Our interactive\nproofs effectuate a persistent epistemic impact in their intended communities\nof peer reviewers that consists in the induction of the (propositional)\nknowledge of their proof goal by means of the (individual) knowledge of the\nproof with the interpreting reviewer. That is, interactive proofs effectuate a\ntransfer of propositional knowledge (knowable facts) via the transmission of\ncertain individual knowledge (knowable proofs) in multi-agent distributed\nsystems. In other words, we as a community can have the formal common knowledge\nthat a proof is that which if known to one of our peer members would induce the\nknowledge of its proof goal with that member. Last but not least, we prove\nnon-trivial interactive computation as definable within our simply typed\ninteractive Combinatory Logic to be nonetheless equipotent to non-interactive\ncomputation as defined by simply typed Combinatory Logic.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jan 2012 23:33:40 GMT"}, {"version": "v2", "created": "Thu, 23 Feb 2012 09:23:57 GMT"}, {"version": "v3", "created": "Thu, 14 Jun 2012 14:45:17 GMT"}, {"version": "v4", "created": "Fri, 19 Sep 2014 10:50:33 GMT"}, {"version": "v5", "created": "Tue, 5 Apr 2016 07:58:48 GMT"}, {"version": "v6", "created": "Tue, 8 Aug 2017 08:48:52 GMT"}], "update_date": "2017-08-09", "authors_parsed": [["Kramer", "Simon", ""]]}, {"id": "1201.3835", "submitter": "Neeraj Kumar Sharma", "authors": "Vibha Gaur, Neeraj Kumar Sharma, Punam Bedi", "title": "A Dynamic Model for Sharing Reputation of Sellers among Buyers for\n  Enhancing Trust in Agent Mediated e-market", "comments": "10 pages; International Journal of Computer Science Issues, Vol. 8,\n  Issue 6, Nov. 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.HC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reputation systems aim to reduce the risk of loss due to untrustworthy\nparticipants. This loss is aggravated by dishonest advisors trying to pollute\nthe e-market environment for their self-interest. A major task of a reputation\nsystem is to promote and encourage advisors who repeatedly respond with fair\nadvice and to apply an opinion filtering or honesty checking mechanism to\ndetect and resist dishonest advisors. This paper provides a dynamic approach to\ncompute the aggregated shared reputation component by filtering out unfair\nadvice and then generating the aggregated shared reputation value. The proposed\napproach is dynamic in nature as it is sensitive to the behaviour of advisors,\nvalue of the current transaction and encourages the cooperation among buyers as\nadvisors. It provides incentive to honest advisors in lieu of repeated sharing\nof honest opinion by increasing the weight of their opinion and by making the\nincrease in the reputation of honest advisors monotonically proportional to the\nvalue of a transaction.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 16:15:12 GMT"}], "update_date": "2012-01-19", "authors_parsed": [["Gaur", "Vibha", ""], ["Sharma", "Neeraj Kumar", ""], ["Bedi", "Punam", ""]]}, {"id": "1201.3880", "submitter": "Alain-J\\'er\\^ome Foug\\`eres", "authors": "Alain-J\\'er\\^ome Foug\\`eres", "title": "Modelling and simulation of complex systems: an approach based on\n  multi-level agents", "comments": "10 pages; IJCSI International Journal of Computer Science Issues,\n  Vol. 8, Issue 6, No 1, November 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A complex system is made up of many components with many interactions. So the\ndesign of systems such as simulation systems, cooperative systems or assistance\nsystems includes a very accurate modelling of interactional and communicational\nlevels. The agent-based approach provides an adapted abstraction level for this\nproblem. After having studied the organizational context and communicative\ncapacities of agentbased systems, to simulate the reorganization of a flexible\nmanufacturing, to regulate an urban transport system, and to simulate an\nepidemic detection system, our thoughts on the interactional level were\ninspired by human-machine interface models, especially those in \"cognitive\nengineering\". To provide a general framework for agent-based complex systems\nmodelling, we then proposed a scale of four behaviours that agents may adopt in\ntheir complex systems (reactive, routine, cognitive, and collective). To\ncomplete the description of multi-level agent models, which is the focus of\nthis paper, we illustrate our modelling and discuss our ongoing work on each\nlevel.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 19:02:11 GMT"}], "update_date": "2012-01-19", "authors_parsed": [["Fougères", "Alain-Jérôme", ""]]}, {"id": "1201.3881", "submitter": "Alain-J\\'er\\^ome Foug\\`eres", "authors": "Alain-J\\'er\\^ome Foug\\`eres", "title": "Agent-Based {\\mu}-Tools Integrated into a Co-Design Platform", "comments": "10 pages; IJCSI International Journal of Computer Science Issues,\n  Vol. 7, Issue 1, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.DC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present successively the proposition and the design of: 1)\n{\\mu}-tools adapted to collaborative activity of design, and 2) a multi-agent\nplatform adapted to innovative and distributed design of products or services.\nThis platform called PLACID (innovating and distributed design platform) must\nsupport applications of assistance to actors implies in a design process that\nwe have called {\\mu}-tools. {\\mu}-tools are developed with an aim of bringing\nassistance to Co-design. The use of the paradigm agent as well relates to the\nmodeling and the development of various layers of the platform, that those of\nthe human-computer interfaces. With these objectives, constraints are added to\nfacilitate the integration of new co-operative tools.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 19:08:23 GMT"}], "update_date": "2012-01-19", "authors_parsed": [["Fougères", "Alain-Jérôme", ""]]}, {"id": "1201.4565", "submitter": "Andr\\'e C. R. Martins", "authors": "Andr\\'e C. R. Martins", "title": "Discrete Opinion models as a limit case of the CODA model", "comments": "10 pages, 3 figures. arXiv admin note: substantial text overlap with\n  arXiv:0811.0113", "journal-ref": "AIP Conf. Proc. 1490, 212 (2012)", "doi": "10.1063/1.4759605", "report-no": null, "categories": "physics.soc-ph cs.MA cs.SI nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Opinion Dynamics models can be, for most of them, divided between discrete\nand continuous. They are used in different circumstances and the relationship\nbetween them is not clear. Here we will explore the relationship between a\nmodel where choices are discrete but opinions are a continuous function (the\nContinuous Opinions and Discrete Actions, CODA, model) and traditional discrete\nmodels. I will show that, when CODA is altered to include reasoning about the\ninfluence one agent can have on its own neighbors, agreement and disagreement\nno longer have the same importance. The limit when an agent considers itself to\nbe more and more influential will be studied and we will see that one recovers\ndiscrete dynamics, like those of the Voter model in that limit\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 15:11:51 GMT"}], "update_date": "2012-10-29", "authors_parsed": [["Martins", "André C. R.", ""]]}, {"id": "1201.4743", "submitter": "Iead Rezek", "authors": "Sreejith Das and Iead Rezek", "title": "Voting Power : A Generalised Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.CY cs.GT cs.MA stat.OT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines an area of Game Theory called Voting Power Theory. With\nthe adoption of a measure theoretic framework it argues that the many different\nindices and tools currently used for measuring voting power can be replaced by\njust three simple probabilities. The framework is sufficiently general to be\napplicable to every conceivable type of voting game, and every possible\ndecision rule.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2012 15:39:00 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Das", "Sreejith", ""], ["Rezek", "Iead", ""]]}, {"id": "1201.4999", "submitter": "Xiaodong Hu", "authors": "Xiaodong Hu, Seyed Hossein Hosseini Nazhad, Mitra Ganguly", "title": "A study of distributed QoS adapter in large-scale wireless networks", "comments": "This paper has been withdrawn by the author due to a wrong authorship", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Considering the comfortably establishing ad hoc networks, the use of this\ntype of network is increasing day to day. On the other side, it is predicted\nthat using multimedia applications will be more public in these network. As it\nis known, in contrary to best-effort flows, the transmission of multimedia\nflows in any network need support from QoS. However, the wireless ad hoc\nnetworks are severely affected by bandwidth, and establishing a QoS in these\nnetworks face problems. In this paper, we have proposed a thoroughly\ndistributed algorithm to support the QoS in ad hoc networks. This algorithm\nguarantees the QoS of the real-time applications vis-a-vis each other and\nbest-effort flows as well. The algorithm suggested in this paper dynamically\nregulates the Contention Window of the flows and serves the flows in terms of\ntheir requests QoS choosing the smallest CW in every node. This algorithm also\nuses the fixed and/or less stationary nodes for the transmission of real-time\nflows by increasing the QoS of the multimedia flows. This algorithm is\npreferred because it prioritizes the flows that are of the same class but have\nnot obtained favorite QoS compared to other flows of the same class in addition\nto classifying the flows in the network and offering better services to the\nclasses of higher priority. All this occur without the controlled packets\nforwarding and resource reserving and freeing method. We have proved the\ncorrectness of this algorithm using Markov's mathematical model.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 15:02:00 GMT"}, {"version": "v2", "created": "Thu, 15 Mar 2012 12:59:12 GMT"}], "update_date": "2012-03-16", "authors_parsed": [["Hu", "Xiaodong", ""], ["Nazhad", "Seyed Hossein Hosseini", ""], ["Ganguly", "Mitra", ""]]}, {"id": "1201.6322", "submitter": "Eyal Regev", "authors": "Eyal Regev, Yaniv Altshuler, Alfred M.Bruckstein", "title": "The Cooperative Cleaners Problem in Stochastic Dynamic Environments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the strengths and limitations of collaborative teams\nof simple agents. In particular, we discuss the efficient use of \"ant robots\"\nfor covering a connected region on the $Z^{2}$ grid, whose area is unknown in\nadvance and which expands stochastically. Specifically, we discuss the problem\nwhere an initial connected region of $S_0$ boundary tiles expand outward with\nprobability $p$ at every time step. On this grid region a group of $k$ limited\nand simple agents operate, in order to clean the unmapped and dynamically\nexpanding region. A preliminary version of this problem was discussed in\n[1],[2] involving a deterministic expansion of a region in the grid.In this\nwork we extend the model and examine cases where the spread of the region is\ndone stochastically, where each tile has some probability $p$ to expand, at\nevery time step. For this extended model we obtain an analytic probabilistic\nlower bounds for the minimal number of agents and minimal time required to\nenable a collaborative coverage of the expanding region, regardless of the\nalgorithm used and the robots' hardware and software specifications. In\naddition, we present an impossibility result, for a variety of regions that\nwould be impossible to completely clean, regardless of the algorithm used.\nFinally, we validate the analytic bounds using extensive empirical computer\nsimulation results.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 19:02:36 GMT"}], "update_date": "2012-01-31", "authors_parsed": [["Regev", "Eyal", ""], ["Altshuler", "Yaniv", ""], ["Bruckstein", "Alfred M.", ""]]}, {"id": "1201.6626", "submitter": "Tobias Jung", "authors": "Tobias Jung and Daniel Polani", "title": "Learning RoboCup-Keepaway with Kernels", "comments": null, "journal-ref": "JMLR Workshop and Conference Proceedings (1st Gaussian Processes\n  in Practice Workshop, 2006)", "doi": null, "report-no": null, "categories": "cs.AI cs.LG cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply kernel-based methods to solve the difficult reinforcement learning\nproblem of 3vs2 keepaway in RoboCup simulated soccer. Key challenges in\nkeepaway are the high-dimensionality of the state space (rendering conventional\ndiscretization-based function approximation like tilecoding infeasible), the\nstochasticity due to noise and multiple learning agents needing to cooperate\n(meaning that the exact dynamics of the environment are unknown) and real-time\nlearning (meaning that an efficient online implementation is required). We\nemploy the general framework of approximate policy iteration with\nleast-squares-based policy evaluation. As underlying function approximator we\nconsider the family of regularization networks with subset of regressors\napproximation. The core of our proposed solution is an efficient recursive\nimplementation with automatic supervised selection of relevant basis functions.\nSimulation results indicate that the behavior learned through our approach\nclearly outperforms the best results obtained earlier with tilecoding by Stone\net al. (2005).\n", "versions": [{"version": "v1", "created": "Tue, 31 Jan 2012 17:26:17 GMT"}], "update_date": "2012-02-01", "authors_parsed": [["Jung", "Tobias", ""], ["Polani", "Daniel", ""]]}]