[{"id": "1807.00078", "submitter": "Aamir Mahmood", "authors": "Aamir Mahmood, Muhammad Ikram Ashraf, Mikael Gidlund and Johan Torsner", "title": "Over-the-Air Time Synchronization for URLLC: Requirements, Challenges\n  and Possible Enablers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ultra-reliable and low-latency communications (URLLC) is an emerging feature\nin 5G and beyond wireless systems, which is introduced to support stringent\nlatency and reliability requirements of mission-critical industrial\napplications. In many potential applications, multiple sensors/actuators\ncollaborate and require isochronous operation with strict and bounded jitter,\ne.g., \\SI{1}{\\micro\\second}. To this end, network time synchronization becomes\ncrucial for real-time and isochronous communication between a controller and\nthe sensors/actuators. In this paper, we look at different applications in\nfactory automation and smart grids to reveal the requirements of device-level\ntime synchronization and the challenges in extending the high-granularity\ntiming information to the devices. Also, we identify the potential over-the-air\nsynchronization mechanisms in 5G radio interface, and discuss the needed\nenhancements to meet the jitter constraints of time-sensitive URLLC\napplications.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2018 22:19:15 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Mahmood", "Aamir", ""], ["Ashraf", "Muhammad Ikram", ""], ["Gidlund", "Mikael", ""], ["Torsner", "Johan", ""]]}, {"id": "1807.00108", "submitter": "Yongcai Wang", "authors": "Tianyuan Sun, Yongcai Wang, Deying Li, Wenping Chen, Zhaoquan Gu", "title": "Robust Component-based Network Localization with Noisy Range\n  Measurements", "comments": "9 pages, 15 figures, ICCCN 2018, Hangzhou, China", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Accurate and robust localization is crucial for wireless ad-hoc and sensor\nnetworks. Among the localization techniques, component-based methods advance\nthemselves for conquering network sparseness and anchor sparseness. But\ncomponent-based methods are sensitive to ranging noises, which may cause a huge\naccumulated error either in component realization or merging process. This\npaper presents three results for robust component-based localization under\nranging noises. (1) For a rigid graph component, a novel method is proposed to\nevaluate the graph's possible number of flip ambiguities under noises. In\nparticular, graph's \\emph{MInimal sepaRators that are neaRly cOllineaR\n(MIRROR)} is presented as the cause of flip ambiguity, and the number of\nMIRRORs indicates the possible number of flip ambiguities under noise. (2) Then\nthe sensitivity of a graph's local deforming regarding ranging noises is\ninvestigated by perturbation analysis. A novel Ranging Sensitivity Matrix (RSM)\nis proposed to estimate the node location perturbations due to ranging noises.\n(3) By evaluating component robustness via the flipping and the local deforming\nrisks, a Robust Component Generation and Realization (RCGR) algorithm is\ndeveloped, which generates components based on the robustness metrics. RCGR was\nevaluated by simulations, which showed much better noise resistance and\nlocating accuracy improvements than state-of-the-art of component-based\nlocalization algorithms.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jun 2018 02:12:42 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Sun", "Tianyuan", ""], ["Wang", "Yongcai", ""], ["Li", "Deying", ""], ["Chen", "Wenping", ""], ["Gu", "Zhaoquan", ""]]}, {"id": "1807.00128", "submitter": "Stefan Schmid", "authors": "Andrei-Alexandru Agape, Madalin Claudiu Danceanu, Rene Rydhof Hansen,\n  Stefan Schmid", "title": "Charting the Security Landscape of Programmable Dataplanes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Emerging programmable dataplanes will revamp communication networks, allowing\nprogrammers to reconfigure and tailor switches towards their need, in a\nprotocol-independent manner. While the community has articulated well the\nbenefits of such network architectures in terms of flexibility and performance,\nlittle is known today about the security implications. We in this position\npaper argue that the programmable dataplanes in general and P4 in particular\nintroduce an uncharted security landscape. In particular, we find that while\nsome existing security studies on traditional OpenFlow-based networks still\napply, P4 comes with several specific components and aspects which change the\nattack surface and introduce new challenges. We highlight several examples and\nprovide a first systematic security analysis.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jun 2018 05:53:14 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Agape", "Andrei-Alexandru", ""], ["Danceanu", "Madalin Claudiu", ""], ["Hansen", "Rene Rydhof", ""], ["Schmid", "Stefan", ""]]}, {"id": "1807.00207", "submitter": "Elahe Rezaei", "authors": "Elahe Rezaei, Hafez Eslami Manoochehri, Babak Hossein Khalaj", "title": "Multi-agent Learning for Cooperative Large-scale Caching Networks", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Caching networks are designed to reduce traffic load at backhaul links, by\nserving demands from edge-nodes. In the past decades, many studies have been\ndone to address the caching problem. However, in practice, finding an optimal\ncaching policy is still challenging due to dynamicity of traffic and\nscalability caused by complex impact of caching strategy chosen by each\nindividual cache on other parts of network. In this paper, we focus on cache\nplacement to optimize the performance metrics such as hit ratio in cooperative\nlarge-scale caching networks. Our proposed solution, cooperative multi-agent\nbased cache placement (CoM-Cache) is based on multi-agent reinforcement\nlearning framework and can seamlessly track the content popularity dynamics in\nan on-line fashion. CoM-Cache is enable to solve the problems over a spectrum\nfrom isolated to interconnected caches and is designed flexibly to fit any\ncaching networks. To deal with dimensionality issue, CoM-Cache exploits the\nproperty of locality of interactions among caches. The experimental results\nreport CoM-Cache outperforms base-line schemes, however at the expense of\nreasonable additional complexity.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jun 2018 17:12:27 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Rezaei", "Elahe", ""], ["Manoochehri", "Hafez Eslami", ""], ["Khalaj", "Babak Hossein", ""]]}, {"id": "1807.00324", "submitter": "Mohammad Shojafar", "authors": "Mohammad M. Tajiki, Mohammad Shojafar, Behzad Akbari, Stefano Salsano,\n  Mauro Conti, Mukesh Singhal", "title": "Joint Failure Recovery, Fault Prevention, and Energy-efficient Resource\n  Management for Real-time SFC in Fog-supported SDN", "comments": "24 pages, 10 figures, 3 tables, Computer Networks Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we focus on the problems of traffic engineering, failure\nrecovery, fault prevention, and Service Function Chain (SFC) with reliability\nand energy consumption constraints in Software Defined Networks (SDN). These\ntypes of deployments use Fog computing as an emerging paradigm to manage the\ndistributed small-size traffic flows passing through the SDN-enabled switches\n(possibly Fog Nodes). The main aim of this integration is to support service\ndelivery in real-time, failure recovery, and fault-awareness in an SFC context.\nFirstly, we present an architecture for Failure Recovery and Fault Prevention\ncalled FRFP; this is a multi-tier structure in which the real-time traffic\nflows pass through SDN-enabled switches to jointly decrease the network\nside-effects of flow rerouting and energy consumption of the Fog Nodes. We then\nmathematically formulate an optimization problem called the Optimal\nFog-Supported Energy-Aware SFC rerouting algorithm (OFES) and propose a\nnear-optimal heuristic called Heuristic OFES (HFES) to solve the corresponding\nproblem in polynomial time. In this way, the energy consumption and the\nreliability of the selected paths are optimized, while the Quality of Service\nconstraints are met and the network congestion is minimized. In a reliability\ncontext, the focus of this work is on fault prevention; however, since we use a\nreallocation technique, the proposed scheme can be used as a failure recovery\nscheme. We compare the performance of HFES and OFES in terms of power\nconsumption, average path length, fault probability, network side-effects, link\nutilization, and Fog Node utilization. Additionally, we analyze the\ncomputational complexity of HFES. We use a real-world network topology to\nevaluate our algorithm. The simulation results show that the heuristic\nalgorithm is applicable to large-scale networks.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jul 2018 12:31:45 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Tajiki", "Mohammad M.", ""], ["Shojafar", "Mohammad", ""], ["Akbari", "Behzad", ""], ["Salsano", "Stefano", ""], ["Conti", "Mauro", ""], ["Singhal", "Mukesh", ""]]}, {"id": "1807.00352", "submitter": "Mohamad Assaad", "authors": "Saad Kriouile, Mohamad Assaad, Maialen Larranaga", "title": "Asymptotically Optimal Delay-aware Scheduling in Queueing Systems", "comments": "journal paper, submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate a general delay-aware channel allocation\nproblem where the number of channels is less than that of users. Due to the\nproliferation of delay sensitive applications, the objective of our problem is\nchosen to be the minimization of the total average backlog queues of the\nnetwork in question. First, we show that our problem falls in the framework of\nRestless Bandit Problems (RBP), for which obtaining the optimal solution is\nknown to be out of reach. To circumvent this difficulty, we tackle the problem\nby adopting a Whittle index approach. To that extent, we employ a Lagrangian\nrelaxation of the original problem and prove it to be decomposable into\nmultiple one-dimensional independent subproblems. Afterwards, we provide\nstructural results on the optimal policy of each of the subproblems. More\nspecifically, we prove that a threshold policy is able to achieve the optimal\noperating point of the considered subproblem. Armed with that, we show the\nindexability of the subproblems and characterize the Whittle's indices which\nare the basis of our proposed heuristic. We then provide a rigorous\nmathematical proof that our policy is optimal in the infinitely many users\nregime. Finally, we provide numerical results that showcase the remarkable good\nperformance of our proposed policy and that corroborate the theoretical\nfindings.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jul 2018 16:26:49 GMT"}, {"version": "v2", "created": "Thu, 21 May 2020 14:54:13 GMT"}], "update_date": "2020-05-22", "authors_parsed": [["Kriouile", "Saad", ""], ["Assaad", "Mohamad", ""], ["Larranaga", "Maialen", ""]]}, {"id": "1807.00353", "submitter": "Suzhi Bi", "authors": "Wanran Xu, Suzhi Bi, Xiaohui Lin, and Juan Wang", "title": "Reusing Wireless Power Transfer for Backscatter-assisted Cooperation in\n  WPCN", "comments": "The paper has been accepted for publication in MLICOM 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a novel user cooperation method in a wireless powered\ncommunication network (WPCN), where a pair of closely located devices first\nharvest wireless energy from an energy node (EN) and then use the harvested\nenergy to transmit information to an access point (AP). In particular, we\nconsider the two energy-harvesting users exchanging their messages and then\ntransmitting cooperatively to the AP using space-time block codes.\nInterestingly, we exploit the short distance between the two users and allow\nthe information exchange to be achieved by energy-conserving backscatter\ntechnique. Meanwhile the considered backscatter-assisted method can effectively\nreuse wireless power transfer for simultaneous information exchange during the\nenergy harvesting phase. Specifically, we maximize the common throughput\nthrough optimizing the time allocation on energy and information transmission.\nSimulation results show that the proposed user cooperation scheme can\neffectively improve the throughput fairness compared to some representative\nbenchmark methods.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jul 2018 16:29:53 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Xu", "Wanran", ""], ["Bi", "Suzhi", ""], ["Lin", "Xiaohui", ""], ["Wang", "Juan", ""]]}, {"id": "1807.00464", "submitter": "Benjamin Sliwa", "authors": "Benjamin Sliwa and Nico Piatkowski and Marcus Haferkamp and Dennis\n  Dorn and Christian Wietfeld", "title": "Leveraging the Channel as a Sensor: Real-time Vehicle Classification\n  Using Multidimensional Radio-fingerprinting", "comments": null, "journal-ref": "2018 21st International Conference on Intelligent Transportation\n  Systems (ITSC)", "doi": "10.1109/ITSC.2018.8569391", "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Upcoming Intelligent Transportation Systems (ITSs) will transform roads from\nstatic resources to dynamic Cyber Physical Systems (CPSs) in order to satisfy\nthe requirements of future vehicular traffic in smart city environments.\nUp-to-date information serves as the basis for changing street directions as\nwell as guiding individual vehicles to a fitting parking slot. In this context,\nnot only abstract indicators like traffic flow and density are required, but\nalso data about mobility parameters and class information of individual\nvehicles. Consequently, accurate and reliable systems that are capable of\nproviding these kinds of information in real-time are highly demanded. In this\npaper, we present a system for classifying vehicles based on their\nradio-fingerprints which applies cutting-edge machine learning models and can\nbe non-intrusively installed into the existing road infrastructure in an ad-hoc\nmanner. In contrast to other approaches, it is able to provide accurate\nclassification results without causing privacy-violations or being vulnerable\nto challenging weather conditions. Moreover, it is a promising candidate for\nlarge-scale city deployments due to its cost-efficient installation and\nmaintenance properties. The proposed system is evaluated in a comprehensive\nfield evaluation campaign within an experimental live deployment on a German\nhighway, where it is able to achieve a binary classification success ratio of\nmore than 99% and an overall accuracy of 89.15% for a fine-grained\nclassification task with nine different classes.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jul 2018 05:17:15 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Sliwa", "Benjamin", ""], ["Piatkowski", "Nico", ""], ["Haferkamp", "Marcus", ""], ["Dorn", "Dennis", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1807.00471", "submitter": "Yuwei Xie", "authors": "Yuwei Xie, Hongwei Zhang, Pengfei Ren", "title": "Unified Scheduling for Predictable Communication Reliability in Cellular\n  Networks with D2D Links", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cellular networks with D2D links are increasingly being explored for\nmission-critical applications (e.g., real-time control and AR/VR) which require\npredictable communication reliability. Thus it is critical to control\ninterference among concurrent transmissions in a predictable manner to ensure\nthe required communication reliability. To this end, we propose a Unified\nCellular Scheduling (UCS) framework that, based on the Physical-Ratio-K (PRK)\ninterference model, schedules uplink, downlink, and D2D transmissions in a\nunified manner to ensure predictable communication reliability while maximizing\nchannel spatial reuse. UCS also provides a simple, effective approach to mode\nselection that maximizes the communication capacity for each involved\ncommunication pair. UCS effectively uses multiple channels for high throughput\nas well as resilience to channel fading and external interference. Leveraging\nthe availability of base stations (BSes) as well as high-speed, out-of-band\nconnectivity between BSes, UCS effectively orchestrates the functionalities of\nBSes and user equipment (UE) for light-weight control signaling and ease of\nincremental deployment and integration with existing cellular standards. We\nhave implemented UCS using the open-source, standards-compliant cellular\nnetworking platform OpenAirInterface. We have validated the OpenAirInterface\nimplementation using USRP B210 software-defined radios and lab deployment. We\nhave also evaluated UCS through high-fidelity, at-scale simulation studies; we\nobserve that UCS ensures predictable communication reliability while achieving\na higher channel spatial reuse rate than existing mechanisms, and that the\ndistributed UCS framework enables a channel spatial reuse rate statistically\nequal to that in the state-of-the-art centralized scheduling algorithm iOrder.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jul 2018 05:46:00 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Xie", "Yuwei", ""], ["Zhang", "Hongwei", ""], ["Ren", "Pengfei", ""]]}, {"id": "1807.00491", "submitter": "Lilian Besson", "authors": "R\\'emi Bonnefoi (IETR), Lilian Besson (IETR, SEQUEL, CRIStAL),\n  Christophe Moy (SCEE, IETR), Emilie Kaufmann (SEQUEL, CNRS, CRIStAL), Jacques\n  Palicot (IETR)", "title": "Multi-Armed Bandit Learning in IoT Networks: Learning helps even in\n  non-stationary settings", "comments": null, "journal-ref": "CROWNCOM 2017 - 12th EAI International Conference on Cognitive\n  Radio Oriented Wireless Networks, Sep 2017, Lisbon, Portugal.\n  http://crowncom.org/2017/", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Setting up the future Internet of Things (IoT) networks will require to\nsupport more and more communicating devices. We prove that intelligent devices\nin unlicensed bands can use Multi-Armed Bandit (MAB) learning algorithms to\nimprove resource exploitation. We evaluate the performance of two classical MAB\nlearning algorithms, UCB1 and Thompson Sampling, to handle the decentralized\ndecision-making of Spectrum Access, applied to IoT networks; as well as\nlearning performance with a growing number of intelligent end-devices. We show\nthat using learning algorithms does help to fit more devices in such networks,\neven when all end-devices are intelligent and are dynamically changing channel.\nIn the studied scenario, stochastic MAB learning provides a up to 16% gain in\nterm of successful transmission probabilities, and has near optimal performance\neven in non-stationary and non-i.i.d. settings with a majority of intelligent\ndevices.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jul 2018 07:04:43 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Bonnefoi", "Rémi", "", "IETR"], ["Besson", "Lilian", "", "IETR, SEQUEL, CRIStAL"], ["Moy", "Christophe", "", "SCEE, IETR"], ["Kaufmann", "Emilie", "", "SEQUEL, CNRS, CRIStAL"], ["Palicot", "Jacques", "", "IETR"]]}, {"id": "1807.00696", "submitter": "Boris Galkin Mr", "authors": "Boris Galkin, Jacek Kibi{\\l}da, Luiz A. DaSilva", "title": "Impact of UAV Antenna Configuration on Wireless Connectivity in Urban\n  Environments", "comments": "Under Submission. arXiv admin note: text overlap with\n  arXiv:1710.10807", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growing presence of UAVs has led operators to explore the issue of how to\nprovide wireless service to UAVs. The achieveable service quality will be\naffected by a number of factors, including the type of antenna that the UAVs\nare equipped with and whether to use existing cellular infrastructure or deploy\ndedicated ground stations to service these new user devices. In this paper we\nemploy stochastic geometry to carry out an analysis of the UAV coverage\nprobability that can be achieved with a network of dedicated ground stations\nusing a sub-6GHz technology such as LTE under different deployment conditions,\ngiven different types of UAV antennas. We provide analytical expressions for\nthe coverage probability; we also evaluate the performance of the GS network\nagainst the case where the UAVs are served by a typical terrestrial BS network.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2018 15:15:50 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Galkin", "Boris", ""], ["Kibiłda", "Jacek", ""], ["DaSilva", "Luiz A.", ""]]}, {"id": "1807.00851", "submitter": "Konstantinos Psychas", "authors": "Konstantinos Psychas, Javad Ghaderi", "title": "On Non-Preemptive VM Scheduling in the Cloud", "comments": "29 pages", "journal-ref": "POMACS, Volume 1, Issue 2, December 2017, Article No. 35", "doi": "10.1145/3154493", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of scheduling VMs (Virtual Machines) in a distributed\nserver platform, motivated by cloud computing applications. The VMs arrive\ndynamically over time to the system, and require a certain amount of resources\n(e.g. memory, CPU, etc) for the duration of their service. To avoid costly\npreemptions, we consider non-preemptive scheduling: Each VM has to be assigned\nto a server which has enough residual capacity to accommodate it, and once a VM\nis assigned to a server, its service \\textit{cannot} be disrupted (preempted).\nPrior approaches to this problem either have high complexity, require\nsynchronization among the servers, or yield queue sizes/delays which are\nexcessively large. We propose a non-preemptive scheduling algorithm that\nresolves these issues. In general, given an approximation algorithm to Knapsack\nwith approximation ratio $r$, our scheduling algorithm can provide $r\\beta$\nfraction of the throughput region for $\\beta < r$. In the special case of a\ngreedy approximation algorithm to Knapsack, we further show that this condition\ncan be relaxed to $\\beta<1$. The parameters $\\beta$ and $r$ can be tuned to\nprovide a tradeoff between achievable throughput, delay, and computational\ncomplexity of the scheduling algorithm. Finally extensive simulation results\nusing both synthetic and real traffic traces are presented to verify the\nperformance of our algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jul 2018 18:27:28 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Psychas", "Konstantinos", ""], ["Ghaderi", "Javad", ""]]}, {"id": "1807.00996", "submitter": "Boris Galkin Mr", "authors": "Boris Galkin and Luiz A. DaSilva", "title": "UAVs as Mobile Infrastructure: Addressing Battery Lifetime", "comments": "Under Submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unmanned aerial vehicles (UAVs) are expected to play an important role in\nnext generation cellular networks, acting as flying infrastructure which can\nserve ground users when regular infrastructure is overloaded or unavailable. As\nthese devices are expected to operate wirelessly they will rely on an internal\nbattery for their power supply, which will limit the amount of time they can\noperate over an area of interest before having to recharge. In this article, we\noutline three battery charging options that may be considered by a network\noperator and use simulations to demonstrate the performance impact of\nincorporating those options into a cellular network where UAV infrastructure\nprovides wireless service.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 07:06:02 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Galkin", "Boris", ""], ["DaSilva", "Luiz A.", ""]]}, {"id": "1807.01042", "submitter": "Benjamin Sliwa", "authors": "Benjamin Sliwa and Johannes Pillmann and Maximilian Kla{\\ss} and\n  Christian Wietfeld", "title": "Exploiting Map Topology Knowledge for Context-predictive Multi-interface\n  Car-to-cloud Communication", "comments": null, "journal-ref": "2018 IEEE 88th Vehicular Technology Conference (VTC-Fall)", "doi": "10.1109/VTCFall.2018.8690753", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While the automotive industry is currently facing a contest among different\ncommunication technologies and paradigms about predominance in the connected\nvehicles sector, the diversity of the various application requirements makes it\nunlikely that a single technology will be able to fulfill all given demands.\nInstead, the joint usage of multiple communication technologies seems to be a\npromising candidate that allows benefiting from characteristical strengths\n(e.g., using low latency direct communication for safety-related messaging).\nConsequently, dynamic network interface selection has become a field of\nscientific interest. In this paper, we present a cross-layer approach for\ncontext-aware transmission of vehicular sensor data that exploits mobility\ncontrol knowledge for scheduling the transmission time with respect to the\nanticipated channel conditions for the corresponding communication technology.\nThe proposed multi-interface transmission scheme is evaluated in a\ncomprehensive simulation study, where it is able to achieve significant\nimprovements in data rate and reliability.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 09:30:36 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Sliwa", "Benjamin", ""], ["Pillmann", "Johannes", ""], ["Klaß", "Maximilian", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1807.01093", "submitter": "Abbas Kiani", "authors": "Abbas Kiani, Nirwan Ansari, Abdallah Khreishah", "title": "Hierarchical Capacity Provisioning for Fog Computing", "comments": "Submitted to IEEE/ACM Transactions on Networking (June 2017)", "journal-ref": null, "doi": null, "report-no": "TR-ANL-2017-002", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of fog computing is centered around providing computation\nresources at the edge of network, thereby reducing the latency and improving\nthe quality of service. However, it is still desirable to investigate how and\nwhere at the edge of the network the computation capacity should be\nprovisioned. To this end, we propose a hierarchical capacity provisioning\nscheme. In particular, we consider a two-tier network architecture consisting\nof shallow and deep cloudlets and explore the benefits of hierarchical capacity\nbased on queueing analysis. Moreover, we explore two different network\nscenarios in which the network delay between the two tiers is negligible as\nwell as the case that the deep cloudlet is located somewhere deeper in the\nnetwork and thus the delay is significant. More importantly, we model the first\nnetwork delay scenario with bufferless shallow cloudlets as well as the second\nscenario with finite-size buffer shallow cloudlets, and formulate an\noptimization problem for each model. We also use stochastic ordering to solve\nthe optimization problem formulated for the first model and an upper bound\nbased technique is proposed for the second model. The performance of the\nproposed scheme is evaluated via simulations in which we show the accuracy of\nthe proposed upper bound technique as well as the queue length estimation\napproach for both randomly generated input and real trace data.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 11:37:09 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Kiani", "Abbas", ""], ["Ansari", "Nirwan", ""], ["Khreishah", "Abdallah", ""]]}, {"id": "1807.01147", "submitter": "Vaneet Aggarwal", "authors": "Abubakr Alabbasi and Vaneet Aggarwal and Tian Lan and Yu Xiang and\n  Moo-Ryong Ra and Yih-Farn R. Chen", "title": "FastTrack: Minimizing Stalls for CDN-based Over-the-top Video Streaming\n  Systems", "comments": "18 pages. arXiv admin note: text overlap with arXiv:1806.09466,\n  arXiv:1703.08348", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.MM cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traffic for internet video streaming has been rapidly increasing and is\nfurther expected to increase with the higher definition videos and IoT\napplications, such as 360 degree videos and augmented virtual reality\napplications. While efficient management of heterogeneous cloud resources to\noptimize the quality of experience is important, existing work in this problem\nspace often left out important factors. In this paper, we present a model for\ndescribing a today's representative system architecture for video streaming\napplications, typically composed of a centralized origin server and several CDN\nsites. Our model comprehensively considers the following factors: limited\ncaching spaces at the CDN sites, allocation of CDN for a video request, choice\nof different ports from the CDN, and the central storage and bandwidth\nallocation. With the model, we focus on minimizing a performance metric, stall\nduration tail probability (SDTP), and present a novel, yet efficient, algorithm\nto solve the formulated optimization problem. The theoretical bounds with\nrespect to the SDTP metric are also analyzed and presented. Our extensive\nsimulation results demonstrate that the proposed algorithms can significantly\nimprove the SDTP metric, compared to the baseline strategies. Small-scale video\nstreaming system implementation in a real cloud environment further validates\nour results.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jun 2018 10:24:28 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Alabbasi", "Abubakr", ""], ["Aggarwal", "Vaneet", ""], ["Lan", "Tian", ""], ["Xiang", "Yu", ""], ["Ra", "Moo-Ryong", ""], ["Chen", "Yih-Farn R.", ""]]}, {"id": "1807.01163", "submitter": "Ramy Amer Mr", "authors": "Ramy Amer, M. Majid Butt, Mehdi Bennis, and Nicola Marchetti", "title": "Inter-cluster Cooperation for Wireless D2D Caching Networks", "comments": "arXiv admin note: text overlap with arXiv:1708.07088", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proactive wireless caching and device to device (D2D) communication have\nemerged as promising techniques for enhancing users' quality of service and\nnetwork performance. In this paper, we propose a new architecture for D2D\ncaching with inter-cluster cooperation. We study a cellular network in which\nusers cache popular files and share them with other users either in their\nproximity via D2D communication or with remote users using cellular\ntransmission. We characterize the network average delay per request from a\nqueuing perspective. Specifically, we formulate the delay minimization problem\nand show that it is NP-hard. Furthermore, we prove that the delay minimization\nproblem is equivalent to the minimization of a non-increasing monotone\nsupermodular function subject to a uniform partition matroid constraint. A\ncomputationally efficient greedy algorithm is proposed which is proven to be\nlocally optimal within a factor 0.63 of the optimum. We analyze the average per\nrequest throughput for different caching schemes and conduct the scaling\nanalysis for the average sum throughput. We show how throughput scaling depends\non video content popularity when the number of files grows asymptotically\nlarge. Simulation results show a delay reduction of 45% to 80% compared to a\nD2D caching system without inter-cluster cooperation.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jul 2018 13:24:02 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Amer", "Ramy", ""], ["Butt", "M. Majid", ""], ["Bennis", "Mehdi", ""], ["Marchetti", "Nicola", ""]]}, {"id": "1807.01191", "submitter": "Kai Han", "authors": "Kai Han", "title": "Approximation Algorithms for Probabilistic Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the k-median and k-center problems in probabilistic graphs. We\nanalyze the hardness of these problems, and propose several algorithms with\nimproved approximation ratios compared with the existing proposals.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 13:53:53 GMT"}, {"version": "v2", "created": "Sat, 7 Jul 2018 03:40:14 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Han", "Kai", ""]]}, {"id": "1807.01242", "submitter": "EPTCS", "authors": "Alexios Lekidis (Aristotle University of Thessaloniki), Panagiotis\n  Katsaros (Aristotle University of Thessaloniki)", "title": "Model-Based Design of Energy-Efficient Applications for IoT Systems", "comments": "In Proceedings MeTRiD 2018, arXiv:1806.09330", "journal-ref": "EPTCS 272, 2018, pp. 24-38", "doi": "10.4204/EPTCS.272.3", "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A major challenge that is currently faced in the design of applications for\nthe Internet of Things (IoT) concerns with the optimal use of available energy\nresources given the battery lifetime of the IoT devices. The challenge is\nderived from the heterogeneity of the devices, in terms of their hardware and\nthe provided functionalities (e.g data processing/communication). In this\npaper, we propose a novel method for (i) characterizing the parameters that\ninfluence energy consumption and (ii) validating the energy consumption of IoT\ndevices against the system's energy-efficiency requirements (e.g. lifetime).\nOur approach is based on energy-aware models of the IoT application's design in\nthe BIP (Behavior, Interaction, Priority) component framework. This allows for\na detailed formal representation of the system's behavior and its subsequent\nvalidation, thus providing feedback for enhancements in the pre-deployment or\npre-production stages. We illustrate our approach through a Building Management\nSystem, using well-known IoT devices running the Contiki OS that communicate by\ndiverse IoT protocols (e.g. CoAP, MQTT). The results allow to derive tight\nbounds for the energy consumption in various device functionalities, as well as\nto validate lifetime requirements through Statistical Model Checking.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jun 2018 08:52:36 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Lekidis", "Alexios", "", "Aristotle University of Thessaloniki"], ["Katsaros", "Panagiotis", "", "Aristotle University of Thessaloniki"]]}, {"id": "1807.01372", "submitter": "Rusheng Zhang", "authors": "Rusheng Zhang, Bo Yu, Hariharan Krishnan", "title": "Simulation Study on Collaborative Content Distribution in Delay Tolerant\n  Vehicular Networks", "comments": "5 pages, 6 figures, accepted by RAFNET with VTC 2018 : 4th\n  International Workshop Research Advancements in Future Internet Architectures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern vehicles are equipped with more and more sophisticated computer\nmodules, which need to periodically download files from the cloud, such as\nsecurity certificates, digital maps, system firmwares, etc. Collaborative\ncontent distribution utilizes V2V communication to distribute large files\nacross the vehicular networks. It has the potential to significantly reduce the\ncost of cellular-based communication such as 4G LTE. In this report, we have\nconducted a simulation study to verify the feasibility of a hybrid cellular and\nV2V collaborative content distribution network. In our simulation, a small\nportion of the simulated vehicles download the file directly from the cloud via\ncellular communication, while other vehicles receive the file via collaborative\nV2V communications. Our simulation results show that, with only 1\\% of vehicles\nenabled with cellular communication, it takes less than 24 hours to distribute\na file to 90\\% of the vehicles in a metropolitan area, and around 48 to 72\nhours to distribute to 99\\%. The results are very promising for many\ndelay-tolerant content distribution applications in vehicular networks.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 20:59:13 GMT"}], "update_date": "2018-07-05", "authors_parsed": [["Zhang", "Rusheng", ""], ["Yu", "Bo", ""], ["Krishnan", "Hariharan", ""]]}, {"id": "1807.01388", "submitter": "Rusheng Zhang", "authors": "Rusheng Zhang, Frank Schmutz, Kyle Gerard, Aur\\'elien Pomini, Louis\n  Basseto, Ben Hassen Sami, Adhishree Jaiprakash, Inci Ozgunes, Abdulrahman\n  Alarifi, Hussam Aldossary, Issa Alkurtass, Omar Talabay, Areej Almohanna,\n  Shaha Alotaibi, Mansour AlSaleh, Ahmed Biyabani, Khaled Almohanna, Ozan\n  Tonguz", "title": "Increasing Traffic Flows with DSRC Technology: Field Trials and\n  Performance Evaluation", "comments": "5 pages, 9 figures, submitted to the 44th Annual Conference of the\n  IEEE Industrial Electronics Society (IECON 2018), special session of\n  Connected-and-Automated Vehicle Integration, Safety, and Environment Design,\n  on June 30, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As traffic congestion becomes a huge problem for most developing and\ndeveloped countries across the world, intelligent transportation systems (ITS)\nare becoming a hot topic that is attracting attention of researchers and the\ngeneral public alike. In this paper, we demonstrate a specific implementation\nof an ITS system whereby traffic lights are actuated by DSRC radios installed\nin vehicles. More specifically, we report the design of prototype of a\nDSRC-Actuated Traffic Lights (DSRC-ATL) system. It is shown that this system\ncan reduce the travel time and commute time significantly, especially during\nrush hours. Furthermore, the results reported in this paper do not assume or\nrequire all vehicles to be equipped with DSCR radios. Even with low penetration\nratios, e.g., when only 20% of all vehicles in a city are equipped with DSRC\nradios, the overall performance of the designed system is superior to the\ncurrent traffic control systems.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 22:42:13 GMT"}], "update_date": "2018-07-05", "authors_parsed": [["Zhang", "Rusheng", ""], ["Schmutz", "Frank", ""], ["Gerard", "Kyle", ""], ["Pomini", "Aurélien", ""], ["Basseto", "Louis", ""], ["Sami", "Ben Hassen", ""], ["Jaiprakash", "Adhishree", ""], ["Ozgunes", "Inci", ""], ["Alarifi", "Abdulrahman", ""], ["Aldossary", "Hussam", ""], ["Alkurtass", "Issa", ""], ["Talabay", "Omar", ""], ["Almohanna", "Areej", ""], ["Alotaibi", "Shaha", ""], ["AlSaleh", "Mansour", ""], ["Biyabani", "Ahmed", ""], ["Almohanna", "Khaled", ""], ["Tonguz", "Ozan", ""]]}, {"id": "1807.01464", "submitter": "Marco Giordani", "authors": "Marco Giordani, Andrea Zanella, Takamasa Higuchi, Onur Altintas,\n  Michele Zorzi", "title": "On the Feasibility of Integrating mmWave and IEEE 802.11p for V2V\n  Communications", "comments": "7 pages, 5 figures, 2 tables, accepted to the IEEE Connected and\n  Automated Vehicles Symposium (CAVS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, the millimeter wave (mmWave) band has been investigated as a means\nto support the foreseen extreme data rate demands of emerging automotive\napplications, which go beyond the capabilities of existing technologies for\nvehicular communications. However, this potential is hindered by the severe\nisotropic path loss and the harsh propagation of high-frequency channels.\nMoreover, mmWave signals are typically directional, to benefit from beamforming\ngain, and require frequent realignment of the beams to maintain connectivity.\nThese limitations are particularly challenging when considering\nvehicle-to-vehicle (V2V) transmissions, because of the highly mobile nature of\nthe vehicular scenarios, and pose new challenges for proper vehicular\ncommunication design. In this paper, we conduct simulations to compare the\nperformance of IEEE 802.11p and the mmWave technology to support V2V\nnetworking, aiming at providing insights on how both technologies can\ncomplement each other to meet the requirements of future automotive services.\nThe results show that mmWave-based strategies support ultra-high transmission\nspeeds, and IEEE 802.11p systems have the ability to guarantee reliable and\nrobust communications.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2018 07:09:10 GMT"}], "update_date": "2018-07-05", "authors_parsed": [["Giordani", "Marco", ""], ["Zanella", "Andrea", ""], ["Higuchi", "Takamasa", ""], ["Altintas", "Onur", ""], ["Zorzi", "Michele", ""]]}, {"id": "1807.01527", "submitter": "Jie Xu", "authors": "Jie Xu", "title": "Distributed super point cardinality estimation under sliding time window\n  for high speed network", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Super point is a special kind of host whose cardinality, the number of\ncontacting hosts in a certain period, is bigger than a threshold. Super point\ncardinality estimation plays important roles in network field. This paper\nproposes a super point cardinality estimation algorithm under sliding time\nwindow. To maintain the state of previous hosts with few updating operations, a\nnovel counter, asynchronous time stamp (AT), is proposed. For a sliding time\nwindow containing k time slices, AT only needs to be updated every k time\nslices at the cost of 1 more bit than a previous state-of-art counter which\nrequires $log_2(k+1)$ bits but updates every time slice. Fewer updating\noperations mean that more AT could be contained to acquire higher accuracy in\nreal-time. This paper also devises a novel reversible hash function scheme to\nrestore super point from a pool of AT. Experiments on several real-world\nnetwork traffic illustrate that the algorithm proposed in this paper could\ndetect super points and estimate their cardinalities under sliding time window\nin real time.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2018 11:53:46 GMT"}], "update_date": "2018-07-05", "authors_parsed": [["Xu", "Jie", ""]]}, {"id": "1807.01633", "submitter": "Rusheng Zhang", "authors": "Rusheng Zhang, Frank Schmutz, Kyle Gerard, Aur\\'elien Pomini, Louis\n  Basseto, Sami Ben Hassen, Akihiro Ishikawa, Inci Ozgunes, Ozan Tonguz", "title": "Virtual Traffic Lights: System Design and Implementation", "comments": "5 pages, 7 figures Accepted by Vehicular Technology Conference 2018\n  (2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traffic congestion is a daunting problem that is affecting the daily lives of\nbillions of people across the world. Recently, a promising new traffic control\nscheme known as Virtual Traffic Lights (VTL) has been proposed for mitigating\ntraffic congestion. VTL is an infrastructure free traffic control scheme that\nleverages the presence of Vehicle-to-Vehicle (V2V) communications. Such\ninfrastructure free scheme has several benefits, such as alleviating traffic\ncongestion; reducing the large cost of traffic lights and traffic control\nsystems; reducing carbon emission, etc. This paper reports a DSRC-based\nprototype design effort on VTL using Dedicated Short Range Communications\n(DSRC) technology. The experiments performed show the feasibility of\nimplementing VTL with DSRC technology. Preliminary results of the field tests\nconducted in Pittsburgh with vehicles using VTL equipment indicate that VTL is\ncapable of coordinating traffic at intersections and reducing the commute time\nof people.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2018 15:16:59 GMT"}], "update_date": "2018-07-05", "authors_parsed": [["Zhang", "Rusheng", ""], ["Schmutz", "Frank", ""], ["Gerard", "Kyle", ""], ["Pomini", "Aurélien", ""], ["Basseto", "Louis", ""], ["Hassen", "Sami Ben", ""], ["Ishikawa", "Akihiro", ""], ["Ozgunes", "Inci", ""], ["Tonguz", "Ozan", ""]]}, {"id": "1807.01645", "submitter": "Philipp H. Kindt", "authors": "Philipp H. Kindt, Sangyoung Park, Samarjit Chakraborty", "title": "Fast Collision Simulation for Cyclic Wireless Protocols", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With most modern smartphones supporting wireless protocols such as Bluetooth\nLow Energy (BLE) or ANT+, the number of networks are growing rapidly.\nTherefore, collisions among multiple networks need to be considered for\nchoosing the appropriate protocol parameters. With growing numbers of networks,\nsimulations for estimating the collision rate become computationally very\ncomplex and lengthy. The large simulation times therefore constitute a major\nlimitation in the analysis of complex cases. In this paper, we present a novel\nsimulation technique which can speed up collision simulations by one order of\nmagnitude in realistic situations. Whenever the transmission of a packet is\nsimulated, the cyclic nature of protocols like BLE is exploited to predict the\nnext packet that has a chance of colliding. All transmissions in between can be\nskipped without affecting the simulation results. Based on the transmission\nintervals of the networks, one can compute a certain shrinkage per cycle of the\ntime offset between their packets. Using this shrinkage and the current offset\nbetween the starting times of any two packets, our proposed simulation model\ncan accurately predict the next pair of packets that needs to be simulated.\nWhereas our proposed technique aims at the BLE protocol, the theory is generic\nand can be used for many other cyclic protocols such as ANT/ANT+ as well.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2018 15:41:54 GMT"}], "update_date": "2018-07-05", "authors_parsed": [["Kindt", "Philipp H.", ""], ["Park", "Sangyoung", ""], ["Chakraborty", "Samarjit", ""]]}, {"id": "1807.02009", "submitter": "Sanaa Sharafeddine", "authors": "Sanaa Sharafeddine and Rania Islambouli", "title": "On-Demand Deployment of Multiple Aerial Base Stations for Traffic\n  Offloading and Network Recovery", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unmanned aerial vehicles (UAVs) are being utilized for a wide spectrum of\napplications in wireless networks leading to attractive business opportunities.\nIn the case of abrupt disruption to existing cellular network operation or\ninfrastructure, e.g., due to an unexpected surge in user demand or a natural\ndisaster, UAVs can be deployed to provide instant recovery via temporary\nwireless coverage in designated areas. A major challenge is to determine\nefficiently how many UAVs are needed and where to position them in a relatively\nlarge 3D search space. To this end, we formulate the problem of 3D deployment\nof a fleet of UAVs as a mixed integer linear program, and present a greedy\napproach that mimics the optimal behavior assuming a grid composed of a finite\nset of possible UAV locations. In addition, we propose and evaluate a novel low\ncomplexity algorithm for multiple UAV deployment in a continuous 3D space,\nbased on an unsupervised learning technique that relies on the notion of\nelectrostatics with repulsion and attraction forces. We present performance\nresults for the proposed algorithm as a function of various system parameters\nand demonstrate its effectiveness compared to the close-to-optimal greedy\napproach and its superiority compared to recent related work from the\nliterature.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2018 13:56:58 GMT"}], "update_date": "2018-07-06", "authors_parsed": [["Sharafeddine", "Sanaa", ""], ["Islambouli", "Rania", ""]]}, {"id": "1807.02173", "submitter": "Mehdi Imani", "authors": "Mehdi Imani, Abolfazl Qiyasi, Nasrin Zarif, Maaruf Ali, Omekolsoom\n  Noshiri, Kimia Faramarzi, Hamid R. Arabnia, Majid Joudaki", "title": "A survey on subjecting electronic product code and non-ID objects to IP\n  identification", "comments": "112 references, 8 figures, 6 tables, Journal of Engineering Reports,\n  Wiley, 2020 (Open Access)", "journal-ref": "Engineering Reports. 2020;e12171", "doi": "10.1002/eng2.12171", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Over the last decade, both research on the Internet of Things (IoT) and\nreal-world IoT applications have grown exponentially. The IoT provides us with\nsmarter cities, intelligent homes, and generally more comfortable lives.\nHowever, the introduction of these devices has led to several new challenges\nthat must be addressed. One of the critical challenges facing interacting with\nIoT devices is to address billions of devices (things) around the world,\nincluding computers, tablets, smartphones, wearable devices, sensors, and\nembedded computers, and so on. This article provides a survey on subjecting\nElectronic Product Code and non-ID objects to IP identification for IoT\ndevices, including their advantages and disadvantages thereof. Different\nmetrics are here proposed and used for evaluating these methods. In particular,\nthe main methods are evaluated in terms of their: (i) computational overhead,\n(ii) scalability, (iii) adaptability, (iv) implementation cost, and (v) whether\napplicable to already ID-based objects and presented in tabular format.\nFinally, the article proves that this field of research will still be ongoing,\nbut any new technique must favorably offer the mentioned five evaluative\nparameters.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2018 20:27:23 GMT"}, {"version": "v2", "created": "Fri, 28 Dec 2018 10:18:23 GMT"}, {"version": "v3", "created": "Thu, 9 Apr 2020 10:22:16 GMT"}, {"version": "v4", "created": "Mon, 11 May 2020 19:18:07 GMT"}], "update_date": "2020-05-13", "authors_parsed": [["Imani", "Mehdi", ""], ["Qiyasi", "Abolfazl", ""], ["Zarif", "Nasrin", ""], ["Ali", "Maaruf", ""], ["Noshiri", "Omekolsoom", ""], ["Faramarzi", "Kimia", ""], ["Arabnia", "Hamid R.", ""], ["Joudaki", "Majid", ""]]}, {"id": "1807.02184", "submitter": "Hamed Rezaei", "authors": "Hamed Rezaei, Mojtaba Malekpourshahraki, Balajee Vamanan", "title": "Slytherin: Dynamic, Network-assisted Prioritization of Tail Packets in\n  Datacenter Networks", "comments": "9 pages, 10 figures, ICCCN'18", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Datacenter applications demand both low latency and high throughput; while\ninteractive applications (e.g., Web Search) demand low tail latency for their\nshort messages due to their partition-aggregate software architecture, many\ndata-intensive applications (e.g., Map-Reduce) require high throughput for long\nflows as they move vast amounts of data across the network. Recent proposals\nimprove latency of short flows and throughput of long flows by addressing the\nshortcomings of existing packet scheduling and congestion control algorithms,\nrespectively. We make the key observation that long tails in the Flow\nCompletion Times (FCT) of short flows result from packets that suffer\ncongestion at more than one switch along their paths in the network. Our\nproposal, Slytherin, specifically targets packets that suffered from congestion\nat multiple points and prioritizes them in the network. Slytherin leverages ECN\nmechanism which is widely used in existing datacenters to identify such tail\npackets and dynamically prioritizes them using existing priority queues. As\ncompared to existing state-of-the-art packet scheduling proposals, Slytherin\nachieves 18.6% lower 99th percentile flow completion times for short flows\nwithout any loss of throughput. Further, Slytherin drastically reduces 99th\npercentile queue length in switches by a factor of about 2x on average.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2018 21:21:06 GMT"}], "update_date": "2018-07-09", "authors_parsed": [["Rezaei", "Hamed", ""], ["Malekpourshahraki", "Mojtaba", ""], ["Vamanan", "Balajee", ""]]}, {"id": "1807.02205", "submitter": "Adib Rastegarnia", "authors": "Douglas Comer, Adib Rastegarnia", "title": "OSDF: An Intent-based Software Defined Network Programming Framework", "comments": "9 pages, accepted as a full paper in LCN 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Software Defined Networking (SDN) offers flexibility to program a network\nbased on a set of network requirements. Programming the networks using SDN is\nnot completely straightforward because a programmer must deal with low level\ndetails. To solve the problem, researchers proposed a set of network\nprogramming languages that provide a set of high level abstractions to hide low\nlevel hardware details. Most of the proposed languages provide abstractions\nrelated to packet processing and flows, and still require a programmer to\nspecify low-level match-action fields to configure and monitor a network.\nRecently, in an attempt to raise the level at which programmers work,\nresearchers have begun to investigate Intent-based, descriptive northbound\ninterfaces. The work is still in early stages, and further investigation is\nrequired before intent-based systems will be adopted by enterprise networks. To\nhelp achieve the goal of moving to an intent-based design, we propose an\nSDN-based network programming framework, the Open Software Defined Framework\n(OSDF). OSDF provides a high level Application Programming Interface (API) that\ncan be used by managers and network administrators to express network\nrequirements for applications and policies for multiple domains. OSDF also\nprovides a set of high level network operation services that handle common\nnetwork configuration, monitoring, and Quality of Service (QoS) provisioning.\nOSDF is equipped with a policy conflict management module to help a network\nadministrator detect and resolve policy conflicts. The paper shows how OSDF can\nbe used and explains application-based policies. Finally, the paper reports the\nresults of both testbed measurements and simulations that are used to evaluate\nthe framework from multiple perspectives, including functionality and\nperformance.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 00:27:00 GMT"}], "update_date": "2018-07-09", "authors_parsed": [["Comer", "Douglas", ""], ["Rastegarnia", "Adib", ""]]}, {"id": "1807.02237", "submitter": "Yao Zhang", "authors": "Changle Li, Yao Zhang, Tom H.Luan, Yuchuan Fu", "title": "Building Transmission Backbone for Highway Vehicular Networks: Framework\n  and Analysis", "comments": "14 pages; 14 figures; 5 tables", "journal-ref": "IEEE Transactions on Vehicular Technology, 2018", "doi": "10.1109/TVT.2018.2844471", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The highway vehicular ad hoc networks, where vehicles are wirelessly\ninter-connected, rely on the multi-hop transmissions for end-to-end\ncommunications. This, however, is severely challenged by the unreliable\nwireless connections, signal attenuation and channel contentions in the dynamic\nvehicular environment. To overcome the network dynamics, selecting appropriate\nrelays for end-to-end connections is important. Different from the previous\nefforts (\\emph{e.g.}, clustering and cooperative downloading), this paper\nexplores the existence of stable vehicles and propose building a stable\nmulti-hop transmission backbone network in the highway vehicular ad hoc\nnetwork. Our work is composed of three parts. Firstly, by analyzing the\nreal-world vehicle traffic traces, we observe that the large-size vehicles,\n\\emph{e.g.}, trucks, are typically stable with low variations of mobility and\nstable channel condition of low signal attenuation; this makes their\ninter-connections stable in both connection time and transmission rate.\nSecondly, by exploring the stable vehicles, we propose a distributed protocol\nto build a multi-hop backbone link for end-to-end transmissions, accordingly\nforming a two-tier network architecture in highway vehicular ad hoc networks.\nLastly, to show the resulting data performance, we develop a queueing analysis\nmodel to evaluate the end-to-end transmission delay and throughput.\n  Using extensive simulations, we show that the proposed transmission backbone\ncan significantly improve the reliability of multi-hop data transmissions with\nhigher throughput, less transmission interruptions and end-to-end delay.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 03:26:37 GMT"}], "update_date": "2018-07-09", "authors_parsed": [["Li", "Changle", ""], ["Zhang", "Yao", ""], ["Luan", "Tom H.", ""], ["Fu", "Yuchuan", ""]]}, {"id": "1807.02268", "submitter": "Guohao Lan", "authors": "Guohao Lan, Weitao Xu, Dong Ma, Sara Khalifa, Mahbub Hassan, and Wen\n  Hu", "title": "EnTrans:Leveraging Kinetic Energy Harvesting Signal for Transportation\n  Mode Detection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Monitoring the daily transportation modes of an individual provides useful\ninformation in many application domains, such as urban design, real-time\njourney recommendation, as well as providing location-based services. In\nexisting systems, accelerometer and GPS are the dominantly used signal sources\nfor transportation context monitoring which drain out the limited battery life\nof the wearable devices very quickly. To resolve the high energy consumption\nissue, in this paper, we present EnTrans, which enables transportation mode\ndetection by using only the kinetic energy harvester as an energy-efficient\nsignal source. The proposed idea is based on the intuition that the vibrations\nexperienced by the passenger during traveling with different transportation\nmodes are distinctive. Thus, voltage signal generated by the energy harvesting\ndevices should contain sufficient features to distinguish different\ntransportation modes. We evaluate our system using over 28 hours of data, which\nis collected by eight individuals using a practical energy harvesting\nprototype. The evaluation results demonstrate that EnTrans is able to achieve\nan overall accuracy over 92% in classifying five different modes while saving\nmore than 34% of the system power compared to conventional accelerometer-based\napproaches.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 06:14:21 GMT"}, {"version": "v2", "created": "Tue, 21 May 2019 20:08:55 GMT"}], "update_date": "2019-05-23", "authors_parsed": [["Lan", "Guohao", ""], ["Xu", "Weitao", ""], ["Ma", "Dong", ""], ["Khalifa", "Sara", ""], ["Hassan", "Mahbub", ""], ["Hu", "Wen", ""]]}, {"id": "1807.02307", "submitter": "Vincenzo Sciancalepore", "authors": "Vincenzo Sciancalepore and Faqir Zarrar Yousaf and Xavier Costa-Perez", "title": "z-TORCH: An Automated NFV Orchestration and Monitoring Solution", "comments": "Submitted to IEEE Transactions on Network and Service Management, 14\n  pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autonomous management and orchestration (MANO) of virtualized resources and\nservices, especially in large-scale Network Function Virtualization (NFV)\nenvironments, is a big challenge owing to the stringent delay and performance\nrequirements expected of a variety of network services. The\nQuality-of-Decisions (QoD) of a Management and Orchestration (MANO) system\ndepends on the quality and timeliness of the information received from the\nunderlying monitoring system. The data generated by monitoring systems is a\nsignificant contributor to the network and processing load of MANO systems,\nimpacting thus their performance. This raises a unique challenge: how to\njointly optimize the QoD of MANO systems while at the same minimizing their\nmonitoring loads at runtime? This is the main focus of this paper.\n  In this context, we propose a novel automated NFV orchestration solution,\nnamely z-TORCH (zero Touch Orchestration) that jointly optimizes the\norchestration and monitoring processes by exploiting machine-learning-based\ntechniques. The objective is to enhance the QoD of MANO systems achieving a\nnear-optimal placement of Virtualized Network Functions (VNFs) at minimum\nmonitoring costs.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 08:17:21 GMT"}], "update_date": "2018-07-09", "authors_parsed": [["Sciancalepore", "Vincenzo", ""], ["Yousaf", "Faqir Zarrar", ""], ["Costa-Perez", "Xavier", ""]]}, {"id": "1807.02311", "submitter": "Lifeng Wang", "authors": "Jingjing Zhao, Lifeng Wang, Kai-Kit Wong, Meixia Tao, and Toktam\n  Mahmoodi", "title": "Energy and Latency Control for Edge Computing in Dense V2X Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study focuses on edge computing in dense millimeter wave\nvehicle-to-everything (V2X) networks. A control problem is formulated to\nminimize the energy consumption under delay constraint resulting from vehicle\nmobility. A tractable algorithm is proposed to solve this problem by optimizing\nthe offloaded computing tasks and transmit power of vehicles and road side\nunits. The proposed dynamic solution can well coordinate the interference\nwithout requiring global channel state information, and makes a tradeoff\nbetween energy consumption and task computing latency.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 08:27:44 GMT"}, {"version": "v2", "created": "Fri, 23 Nov 2018 09:30:51 GMT"}], "update_date": "2018-11-26", "authors_parsed": [["Zhao", "Jingjing", ""], ["Wang", "Lifeng", ""], ["Wong", "Kai-Kit", ""], ["Tao", "Meixia", ""], ["Mahmoodi", "Toktam", ""]]}, {"id": "1807.02558", "submitter": "Ali Shahini", "authors": "Ali Shahini, Abbas Kiani, Nirwan Ansari", "title": "Energy Efficient Resource Allocation in EH-enabled CR Networks for IoT", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the rapid growth of Internet of Things (IoT) devices, the next\ngeneration mobile networks demand for more operating frequency bands. By\nleveraging the underutilized radio spectrum, the cognitive radio (CR)\ntechnology is considered as a promising solution for spectrum scarcity problem\nof IoT applications. In parallel with the development of CR techniques,\nWireless Energy Harvesting (WEH) is considered as one of the emerging\ntechnologies to eliminate the need of recharging or replacing the batteries for\nIoT and CR networks. To this end, we propose to utilize WEH for CR networks in\nwhich the CR devices are not only capable of sensing the available radio\nfrequencies in a collaborative manner but also harvesting the wireless energy\ntransferred by an Access Point (AP). More importantly, we design an\noptimization framework that captures a fundamental tradeoff between energy\nefficiency (EE) and spectral efficiency (SE) of the network. In particular, we\nformulate a Mixed Integer Nonlinear Programming (MINLP) problem that maximizes\nEE while taking into consideration of users' buffer occupancy, data rate\nfairness, energy causality constraints and interference constraints. We further\nprove that the proposed optimization framework is an NP-Hard problem. Thus, we\npropose a low complex heuristic algorithm, called INSTANT, to solve the\nresource allocation and energy harvesting optimization problem. The proposed\nalgorithm is shown to be capable of achieving near optimal solution with high\naccuracy while having polynomial complexity. The efficiency of our proposal is\nvalidated through well designed simulations.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 20:28:27 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Shahini", "Ali", ""], ["Kiani", "Abbas", ""], ["Ansari", "Nirwan", ""]]}, {"id": "1807.02564", "submitter": "Mohammed AL Zamil Prof.", "authors": "Mohammed AL Zamil and Samer Samarah", "title": "Applications of Data Mining Techniques for Vehicular Ad hoc Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the recent advances in vehicular ad hoc networks (VANETs), smart\napplications have been incorporating the data generated from these networks to\nprovide quality of life services. In this paper, we have proposed taxonomy of\ndata mining techniques that have been applied in this domain in addition to a\nclassification of these techniques. Our contribution is to highlight the\nresearch methodologies in the literature and allow for comparing among them\nusing different characteristics. The proposed taxonomy covers elementary data\nmining techniques such as: preprocessing, outlier detection, clustering, and\nclassification of data. In addition, it covers centralized, distributed,\noffline, and online techniques from the literature.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 08:41:18 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Zamil", "Mohammed AL", ""], ["Samarah", "Samer", ""]]}, {"id": "1807.02565", "submitter": "Rabe Arshad", "authors": "Rabe Arshad, Hesham ElSawy, Lutz Lampe, and Md. Jahangir Hossain", "title": "Handover Rate Characterization in 3D Ultra-Dense Heterogeneous Networks", "comments": "Submitted to IEEE TVT as a correspondence paper, April, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ultra-dense networks (UDNs) envision the massive deployment of heterogenous\nbase stations (BSs) to meet the desired traffic demands. Furthermore, UDNs are\nexpected to support the diverse devices e.g., personal mobile devices and\nunmanned ariel vehicles. User mobility and the resulting excessive changes in\nuser to BS associations in such highly dense networks may however nullify the\ncapacity gains foreseen through BS densification. Thus there exists a need to\nquantify the effect of user mobility in UDNs. In this article, we consider a\nthree-dimensional N-tier downlink network and determine the association\nprobabilities and inter/intra tier handover rates using tools from stochastic\ngeometry. In particular, we incorporate user and BSs' antenna heights into the\nmathematical analysis and study the impact of user height on the association\nand handover rate. The numerical trends show that the intra-tier handovers are\ndominant for the tiers with shortest relative elevation w.r.t. the user and\nthis dominance is more prominent when there exists a high discrepancy among the\ntiers' heights. However, biasing can be employed to balance the handover load\namong the network tiers.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2018 20:32:16 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Arshad", "Rabe", ""], ["ElSawy", "Hesham", ""], ["Lampe", "Lutz", ""], ["Hossain", "Md. Jahangir", ""]]}, {"id": "1807.02567", "submitter": "Tugba Erpek", "authors": "Tugba Erpek, Yalin E. Sagduyu, Yi Shi", "title": "Deep Learning for Launching and Mitigating Wireless Jamming Attacks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An adversarial machine learning approach is introduced to launch jamming\nattacks on wireless communications and a defense strategy is presented. A\ncognitive transmitter uses a pre-trained classifier to predict the current\nchannel status based on recent sensing results and decides whether to transmit\nor not, whereas a jammer collects channel status and ACKs to build a deep\nlearning classifier that reliably predicts the next successful transmissions\nand effectively jams them. This jamming approach is shown to reduce the\ntransmitter's performance much more severely compared with random or\nsensing-based jamming. The deep learning classification scores are used by the\njammer for power control subject to an average power constraint. Next, a\ngenerative adversarial network (GAN) is developed for the jammer to reduce the\ntime to collect the training dataset by augmenting it with synthetic samples.\nAs a defense scheme, the transmitter deliberately takes a small number of wrong\nactions in spectrum access (in form of a causative attack against the jammer)\nand therefore prevents the jammer from building a reliable classifier. The\ntransmitter systematically selects when to take wrong actions and adapts the\nlevel of defense to mislead the jammer into making prediction errors and\nconsequently increase its throughput.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 23:17:50 GMT"}, {"version": "v2", "created": "Thu, 13 Dec 2018 17:37:45 GMT"}], "update_date": "2018-12-14", "authors_parsed": [["Erpek", "Tugba", ""], ["Sagduyu", "Yalin E.", ""], ["Shi", "Yi", ""]]}, {"id": "1807.02593", "submitter": "Arash Shaghaghi", "authors": "Arash Shaghaghi, Salil S. Kanhere, Mohamed Ali Kaafar, Elisa Bertino,\n  Sanjay Jha", "title": "Gargoyle: A Network-based Insider Attack Resilient Framework for\n  Organizations", "comments": "Accepted to IEEE LCN 2018 as full paper, Pre-final version - slightly\n  different than the final version published by the conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  `Anytime, Anywhere' data access model has become a widespread IT policy in\norganizations making insider attacks even more complicated to model, predict\nand deter. Here, we propose Gargoyle, a network-based insider attack resilient\nframework against the most complex insider threats within a pervasive computing\ncontext. Compared to existing solutions, Gargoyle evaluates the trustworthiness\nof an access request context through a new set of contextual attributes called\nNetwork Context Attribute (NCA). NCAs are extracted from the network traffic\nand include information such as the user's device capabilities, security-level,\ncurrent and prior interactions with other devices, network connection status,\nand suspicious online activities. Retrieving such information from the user's\ndevice and its integrated sensors are challenging in terms of device\nperformance overheads, sensor costs, availability, reliability and\ntrustworthiness. To address these issues, Gargoyle leverages the capabilities\nof Software-Defined Network (SDN) for both policy enforcement and\nimplementation. In fact, Gargoyle's SDN App can interact with the network\ncontroller to create a `defence-in-depth' protection system. For instance,\nGargoyle can automatically quarantine a suspicious data requestor in the\nenterprise network for further investigation or filter out an access request\nbefore engaging a data provider. Finally, instead of employing simplistic\nbinary rules in access authorizations, Gargoyle incorporates Function-based\nAccess Control (FBAC) and supports the customization of access policies into a\nset of functions (e.g., disabling copy, allowing print) depending on the\nperceived trustworthiness of the context.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jul 2018 00:18:10 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Shaghaghi", "Arash", ""], ["Kanhere", "Salil S.", ""], ["Kaafar", "Mohamed Ali", ""], ["Bertino", "Elisa", ""], ["Jha", "Sanjay", ""]]}, {"id": "1807.02615", "submitter": "Amr Rizk", "authors": "Ronny Hans and Bj\\\"orn Richerzhagen and Amr Rizk and Ulrich Lampe and\n  Ralf Steinmetz and Sabrina Klos and Anja Klein", "title": "Little Boxes: A Dynamic Optimization Approach for Enhanced Cloud\n  Infrastructures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing demand for diverse, mobile applications with various degrees\nof Quality of Service requirements meets the increasing elasticity of on-demand\nresource provisioning in virtualized cloud computing infrastructures. This\npaper provides a dynamic optimization approach for enhanced cloud\ninfrastructures, based on the concept of cloudlets, which are located at\nhotspot areas throughout a metropolitan area. In conjunction, we consider\nclassical remote data centers that are rigid with respect to QoS but provide\nnearly abundant computation resources. Given fluctuating user demands, we\noptimize the cloudlet placement over a finite time horizon from a cloud\ninfrastructure provider's perspective. By the means of a custom tailed\nheuristic approach, we are able to reduce the computational effort compared to\nthe exact approach by at least three orders of magnitude, while maintaining a\nhigh solution quality with a moderate cost increase of 5.8% or less.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jul 2018 05:29:45 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Hans", "Ronny", ""], ["Richerzhagen", "Björn", ""], ["Rizk", "Amr", ""], ["Lampe", "Ulrich", ""], ["Steinmetz", "Ralf", ""], ["Klos", "Sabrina", ""], ["Klein", "Anja", ""]]}, {"id": "1807.02689", "submitter": "Soheil Abbasloo", "authors": "Soheil Abbasloo, Tong Li, Yang Xu, H. Jonathan Chao", "title": "Cellular Controlled Delay TCP (C2TCP)", "comments": "IFIP Networking Conference (IFIP Networking) and Workshops, 2018.\n  IEEE, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Cellular networks have special characteristics including highly variable\nchannels, fast fluctuating capacities, deep per user buffers, self-inflicted\nqueuing delays, radio uplink/downlink scheduling delays, etc. These\ndistinguishing properties make the problem of achieving low latency and high\nthroughput in cellular networks more challenging than in wired networks. That's\nwhy in this environment, TCP and its flavors, which are generally designed for\nwired networks, perform poorly.\n  To cope with these challenges, we present C2TCP, a flexible end-to-end\nsolution targeting interactive applications requiring high throughput and low\ndelay in cellular networks. C2TCP stands on top of loss-based TCP and brings it\ndelay sensitivity without requiring any network state profiling, channel\nprediction, or complicated rate adjustment mechanisms. The key idea behind\nC2TCP is to absorb dynamics of unpredictable cellular channels by investigating\nlocal minimum delay of packets in a moving time window and react to the\ncellular network's capacity changes very fast.\n  Through extensive trace-based evaluations using traces from five commercial\nLTE and 3G networks, we have compared performance of C2TCP with various TCP\nvariants, and state-of-the-art schemes including BBR, Verus, and Sprout.\nResults show that on average, C2TCP outperforms these schemes and achieves\nlower average and 95th percentile delay for packets.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jul 2018 16:45:37 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Abbasloo", "Soheil", ""], ["Li", "Tong", ""], ["Xu", "Yang", ""], ["Chao", "H. Jonathan", ""]]}, {"id": "1807.02827", "submitter": "Peizhao Hu", "authors": "Wei Yin, Peizhao Hu, Jadwiga Indulska, Marius Portmann, Ying Mao", "title": "MAC-Layer Rate Control for 802.11 Networks: Lesson Learned and Looking\n  Forward", "comments": "Submitted to Elseviser COMCOM", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rate control at the MAC-layer is one of the fundamental building blocks in\nmany wireless networks. Over the past two decades around thirty mechanisms have\nbeen proposed in the literature. Among them, there are mechanisms that make\nrate selection decisions based on sophisticated measurements of wireless link\nquality, and others that are based on straight-forward heuristics. Minstrel,\nfor example, is an elegant mechanism that has been adopted by hundreds of\nmillions of computers, yet, not much was known about its performance until\nrecently. The purpose of this paper is to provide a comprehensive survey and\nanalysis of existing solutions from the two fundamental aspects of rate control\n- metrics and algorithms. We also review how these solutions were evaluated and\ncompared against each other. Based on our detailed studies and observations, we\nshare important insights on future development of rate control mechanisms at\nthe MAC-layer. This discussion also takes into account the recent developments\nin wireless technologies and emerging applications, such as Internet-of-Things,\nand shows issues that need to be addressed in the design of new rate control\nmechanisms suitable for these technologies and applications.\n", "versions": [{"version": "v1", "created": "Sun, 8 Jul 2018 14:11:22 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Yin", "Wei", ""], ["Hu", "Peizhao", ""], ["Indulska", "Jadwiga", ""], ["Portmann", "Marius", ""], ["Mao", "Ying", ""]]}, {"id": "1807.02935", "submitter": "Stefan Schmid", "authors": "Chen Avin and Stefan Schmid", "title": "Toward Demand-Aware Networking: A Theory for Self-Adjusting Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The physical topology is emerging as the next frontier in an ongoing effort\nto render communication networks more flexible. While first empirical results\nindicate that these flexibilities can be exploited to reconfigure and optimize\nthe network toward the workload it serves and, e.g., providing the same\nbandwidth at lower infrastructure cost, only little is known today about the\nfundamental algorithmic problems underlying the design of reconfigurable\nnetworks. This paper initiates the study of the theory of demand-aware,\nself-adjusting networks. Our main position is that self-adjusting networks\nshould be seen through the lense of self-adjusting datastructures. Accordingly,\nwe present a taxonomy classifying the different algorithmic models of\ndemand-oblivious, fixed demand-aware, and reconfigurable demand-aware networks,\nintroduce a formal model, and identify objectives and evaluation metrics. We\nalso demonstrate, by examples, the inherent advantage of demand-aware networks\nover state-of-the-art demand-oblivious, fixed networks (such as expanders).\n", "versions": [{"version": "v1", "created": "Mon, 9 Jul 2018 04:10:49 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Avin", "Chen", ""], ["Schmid", "Stefan", ""]]}, {"id": "1807.03065", "submitter": "Ali Zibaeenejad Dr", "authors": "Hamed Rahimi, Ali Zibaeenejad, Ali Akbar Safavi", "title": "A Novel IoT Architecture based on 5G-IoT and Next Generation\n  Technologies", "comments": "7 pages, 1 figure, 1 table, submitted to IEEE Global Communications\n  Conference 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT) is a crucial component of Industry 4.0. Due to\ngrowing demands of customers, the current IoT architecture will not be reliable\nand responsive for next generation IoT applications and upcoming services. In\nthis paper, the next generation IoT architecture based on new technologies is\nproposed in which the requirements of future applications, services, and\ngenerated data are addressed. Particularly, this architecture consists of\nNano-chip, millimeter Wave (mmWave), Heterogeneous Networks (HetNet),\ndevice-todevice (D2D) communication, 5G-IoT, Machine-Type Communication (MTC),\nWireless Network Function virtualization (WNFV), Wireless Software Defined\nNetworks (WSDN), Advanced Spectrum Sharing and Interference Management\n(Advanced SSIM), Mobile Edge Computing (MEC), Mobile Cloud Computing (MCC),\nData Analytics and Big Data. This combination of technologies is able to\nsatisfy requirements of new applications. The proposed novel architecture is\nmodular, efficient, agile, scalable, simple, and it is able to satisfy the high\namount of data and application demands.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jul 2018 12:11:51 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Rahimi", "Hamed", ""], ["Zibaeenejad", "Ali", ""], ["Safavi", "Ali Akbar", ""]]}, {"id": "1807.03246", "submitter": "Mahdi Miraz", "authors": "Junaid Chaudhry, Kashif Saleem, Paul Haskell-Dowland, Mahdi H. Miraz", "title": "A Survey of Distributed Certificate Authorities in MANETs", "comments": null, "journal-ref": "Annals of Emerging Technologies in Computing (AETiC), Print ISSN:\n  2516-0281, Online ISSN: 2516-029X, pp. 11-18, Vol. 2, No. 3, 1st July 2018,\n  http://aetic.theiaer.org/archive/v2n3/p2.html", "doi": "10.33166/AETiC.2018.03.002", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A Certificate Authority (CA) provides the critical authentication and\nsecurity services for Public Key Infrastructure (PKI) which are used for the\nInternet and wired networks. In MANETs (wireless and ad hoc) there is an\ninability to offer a centralized CA to provide these security services. Recent\nresearch has looked to facilitate the use of CAs within MANETs through the use\nof a Distributed Certificate Authority (DCA) for wireless and ad hoc networks.\nThis paper presents a number of different types of DCA protocols and\ncategorizes them into groups based on their factors and specifications. The\npaper concludes by proposing the best DCA security services in terms of\nperformance and level of security.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jul 2018 06:25:23 GMT"}], "update_date": "2018-12-14", "authors_parsed": [["Chaudhry", "Junaid", ""], ["Saleem", "Kashif", ""], ["Haskell-Dowland", "Paul", ""], ["Miraz", "Mahdi H.", ""]]}, {"id": "1807.03362", "submitter": "Mohammad S Khan", "authors": "Anirudh Paranjothi, Mohammad S Khan and Mohammed Atiquzzaman", "title": "Hybrid-Vehcloud: An Obstacle Shadowing Approach for VANETs in Urban\n  Environment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Routing of messages in Vehicular Ad-hoc Networks (VANETs) is challenging due\nto obstacle shadowing regions with high vehicle densities, which leads to\nfrequent disconnection problems and blocks radio wave propagation between\nvehicles. Previous researchers used multi-hop, vehicular cloud or roadside\ninfrastructures to solve the routing issue among the vehicles, but they suffer\nfrom significant packet delays and frequent packet losses arising from obstacle\nshadowing. We proposed a vehicular cloud based hybrid technique called\nHybrid-Vehcloud to disseminate messages in obstacle shadowing regions, and\nmulti-hop technique to disseminate messages in non-obstacle shadowing regions.\nThe novelty of our approach lies in the fact that our proposed technique\ndynamically adapts between obstacle shadowing and non-obstacle shadowing\nregions. Simulation based performance analysis of Hybrid-Vehcloud showed\nimproved performance over Cloud-assisted Message Downlink Dissemination Scheme\n(CMDS), Cross-Layer Broadcast Protocol (CLBP) and Cloud-VANET schemes at high\nvehicle densities.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jul 2018 19:54:31 GMT"}], "update_date": "2018-07-11", "authors_parsed": [["Paranjothi", "Anirudh", ""], ["Khan", "Mohammad S", ""], ["Atiquzzaman", "Mohammed", ""]]}, {"id": "1807.03454", "submitter": "Jinfa Wang", "authors": "Jin-Fa Wang, Hai Zhao, Shuai-Zong Si, Hao Yu, Shuai Chao, Xuan He", "title": "Using Complex Network Theory for Temporal Locality in Network Traffic\n  Flows", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2019.04.203", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Monitoring the interaction behaviors of network traffic flows and detecting\nunwanted Internet applications and anomalous flows have become a challenging\nproblem, since many applications obfuscate their network traffic flow using\nunregistered port numbers or payload encryption. In this paper, the temporal\nlocality complex network model--TLCN is proposed as a way to monitor, analyze\nand visualize network traffic flows. TLCNs model the interaction behaviors of\nlarge-scale network traffic flows, where the nodes and the edges can be defined\nto represent different flow levels and flow interactions separately. Then, the\nstatistical characteristics and dynamic behaviors of the TLCNs are studied to\nrepresent TLCN's structure representing ability to the flow interactions.\nAccording to the analysis of TLCN statistical characteristics with different\nInternet applications, we found that the weak interaction flows prefer to form\nthe small-world TLCN and the strong interaction flows prefer to the scale-free\nTLCN. In the studies of anomaly behaviors of TLCNs, the network structure of\nattacked TLCNs can have a remarkable feature for three attack patterns, and the\nevolution of TLCNs exhibits a good consistency between TLCN structure and\nattack process. With the introduction of TLCNs, we are able to harness a wealth\nof tools and graph modeling techniques from a diverse set of disciplines.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 02:27:20 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Wang", "Jin-Fa", ""], ["Zhao", "Hai", ""], ["Si", "Shuai-Zong", ""], ["Yu", "Hao", ""], ["Chao", "Shuai", ""], ["He", "Xuan", ""]]}, {"id": "1807.03515", "submitter": "Rupali Bhati", "authors": "Mayank K. Pal, Rupali Bhati, Anil Sharma, Sanjit K. Kaul, Saket Anand\n  and P. B. Sujit", "title": "A Reinforcement Learning Approach to Jointly Adapt Vehicular\n  Communications and Planning for Optimized Driving", "comments": "7 pages, 7 figures; Accepted as a conference paper at IEEE ITSC 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.NI cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our premise is that autonomous vehicles must optimize communications and\nmotion planning jointly. Specifically, a vehicle must adapt its motion plan\nstaying cognizant of communications rate related constraints and adapt the use\nof communications while being cognizant of motion planning related restrictions\nthat may be imposed by the on-road environment. To this end, we formulate a\nreinforcement learning problem wherein an autonomous vehicle jointly chooses\n(a) a motion planning action that executes on-road and (b) a communications\naction of querying sensed information from the infrastructure. The goal is to\noptimize the driving utility of the autonomous vehicle. We apply the Q-learning\nalgorithm to make the vehicle learn the optimal policy, which makes the optimal\nchoice of planning and communications actions at any given time. We demonstrate\nthe ability of the optimal policy to smartly adapt communications and planning\nactions, while achieving large driving utilities, using simulations.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 08:00:22 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Pal", "Mayank K.", ""], ["Bhati", "Rupali", ""], ["Sharma", "Anil", ""], ["Kaul", "Sanjit K.", ""], ["Anand", "Saket", ""], ["Sujit", "P. B.", ""]]}, {"id": "1807.03537", "submitter": "Jasper Goseling", "authors": "Jasper Goseling and Osvaldo Simeone", "title": "Soft-TTL: Time-Varying Fractional Caching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Standard Time-to-Live (TTL) cache management prescribes the storage of entire\nfiles, or possibly fractions thereof, for a given amount of time after a\nrequest. As a generalization of this approach, this work proposes the storage\nof a time-varying, diminishing, fraction of a requested file. Accordingly, the\ncache progressively evicts parts of the file over an interval of time following\na request. The strategy, which is referred to as soft-TTL, is justified by the\nfact that traffic traces are often characterized by arrival processes that\ndisplay a decreasing, but non-negligible, probability of observing a request as\nthe time elapsed since the last request increases. An optimization-based\nanalysis of soft-TTL is presented, demonstrating the important role played by\nthe hazard function of the inter-arrival request process, which measures the\nlikelihood of observing a request as a function of the time since the most\nrecent request.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 09:13:22 GMT"}], "update_date": "2018-07-12", "authors_parsed": [["Goseling", "Jasper", ""], ["Simeone", "Osvaldo", ""]]}, {"id": "1807.03590", "submitter": "Qinghe Du", "authors": "Qinghe Du, Houbing Song, Xuejie Zhu", "title": "Social-Feature Enabled Communications among Devices towards Smart IoT\n  Community", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Future IoT is expected to get ubiquitous connection and access in a global\nscale. In the meantime, with the empowered communications capability for IoT\ndevices, IoT will evolve to be highly autonomous, even under the help from\ninfrastructure, and thus will gradually establish the smart IoT community. One\nof the major challenges imposed on the smart IoT communities is the\nsocialization of IoT communications, because massive IoT accesses make\ncentralized control very hard and also face the shortage of spectrum resources.\nTowards these issues, we in this article first present the overview and\ndiscussions on social features affecting connections among devices. Then, we\nmotivate studies on the statistical characteristics of social features for\nconnections among devices towards smart IoT. We further propose the queuing\nmodel under unified asymptotic analyses framework to characterize the\nstatistical social features, with emphases on typical social metrics such as\ncredit, reputation, centrality, etc. How to apply these features for network\noptimization is further suggested. Finally, we share our opinion on the open\nproblems of social-aware design towards future smart IoT.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 12:22:29 GMT"}], "update_date": "2018-07-11", "authors_parsed": [["Du", "Qinghe", ""], ["Song", "Houbing", ""], ["Zhu", "Xuejie", ""]]}, {"id": "1807.03921", "submitter": "Salvatore Talarico", "authors": "S. Talarico, M. C. Valenti, and M. Di Renzo", "title": "Outage Correlation in Finite and Clustered Wireless Networks", "comments": "7 pages, and 3 figures - in IEEE International Symposium on Personal,\n  Indoor and Mobile Radio Communications (PIMRC) 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Future wireless networks are expected to adopt many different network\ntechnologies and architectures that promise to greatly enhance data rate and\nprovide ubiquitous coverage for end users, all while enabling higher spectral\nefficiency. These benefits come with an increased risk of co-channel\ninterference and possible correlation in the aggregated interference, which\nimpacts the communication performance. This paper introduces a mathematical\nframework to quantify the spatial correlation of the interference in finite and\nclustered wireless networks with signals subject to Rayleigh fading.\nExpressions are derived for the correlation coefficient of the outage\nprobability when the interferers are located according to some of the most\ncommon point processes used in the literature to model the spatial distribution\nof the devices: binomial point process (i.e., relay networks with fixed users),\nPoisson point process (i.e., heterogeneous cellular networks), and Thomas point\nprocess (i.e., device-to-device networks).\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2018 01:46:48 GMT"}, {"version": "v2", "created": "Wed, 18 Jul 2018 04:12:34 GMT"}, {"version": "v3", "created": "Thu, 19 Jul 2018 22:00:48 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Talarico", "S.", ""], ["Valenti", "M. C.", ""], ["Di Renzo", "M.", ""]]}, {"id": "1807.03930", "submitter": "Haijian Sun", "authors": "Haijian Sun, Fuhui Zhou, Rose Qingyang Hu, Lajos Hanzo", "title": "Robust Beamforming Design in a NOMA Cognitive Radio Network Relying on\n  SWIPT", "comments": "This paper is submitted to IEEE Journal on Selected Areas in\n  Communications for possible publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a multiple-input single-output non-orthogonal multiple\naccess cognitive radio network relying on simultaneous wireless information and\npower transfer. A realistic non-linear energy harvesting model is applied and a\npower splitting architecture is adopted at each secondary user (SU). Since it\nis difficult to obtain perfect channel state information (CSI) in practice,\ninstead either a bounded or gaussian CSI error model is considered. Our robust\nbeamforming and power splitting ratio are jointly designed for two problems\nwith different objectives, namely that of minimizing the transmission power of\nthe cognitive base station and that of maximizing the total harvested energy of\nthe SUs, respectively. The optimization problems are challenging to solve,\nmainly because of the non-linear structure of the energy harvesting and CSI\nerrors models. We converted them into convex forms by using semi-definite\nrelaxation. For the minimum transmission power problem, we obtain the rank-2\nsolution under the bounded CSI error model, while for the maximum energy\nharvesting problem, a two-loop procedure using a one-dimensional search is\nproposed. Our simulation results show that the proposed scheme significantly\noutperforms its traditional orthogonal multiple access counterpart.\nFurthermore, the performance using the gaussian CSI error model is generally\nbetter than that using the bounded CSI error model.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2018 02:22:57 GMT"}], "update_date": "2018-07-12", "authors_parsed": [["Sun", "Haijian", ""], ["Zhou", "Fuhui", ""], ["Hu", "Rose Qingyang", ""], ["Hanzo", "Lajos", ""]]}, {"id": "1807.03983", "submitter": "Ovidiu Banias", "authors": "Daniel-Ioan Curiac, Florin Dragan, Ovidiu Banias and Daniel Iercan", "title": "A knowledge based system approach in securing distributed wireless\n  sensor networks", "comments": null, "journal-ref": "SCIENTIFIC BULLETIN of Politehnica University of Timisoara,\n  ROMANIA,Transactions on AUTOMATIC CONTROL and COMPUTER SCIENCE, Vol. 51 (65),\n  No. 4, 2006, ISSN 1224-600X", "doi": null, "report-no": null, "categories": "eess.SP cs.NI cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sensor networks technologies had proved their great practicability in the\nreal world, being just a matter of time until this kind of networks will be\nstandardized and used in the field. This paper presents a new approach to\nsecure the transmission of information in sensor networks and is based on a\ncombined hardware-software architecture using three components: a) a mechanism\nto provide sensor authentication and secret key distribution; b) AES\nsymmetrical encryption algorithm with predistributed keys; and c) an attack\ndetection stratagem using an expert system based on the prediction of the\nvalues provided by the sensors, followed by reducing the sensor trust\ncoefficient.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2018 08:04:17 GMT"}], "update_date": "2018-08-06", "authors_parsed": [["Curiac", "Daniel-Ioan", ""], ["Dragan", "Florin", ""], ["Banias", "Ovidiu", ""], ["Iercan", "Daniel", ""]]}, {"id": "1807.04087", "submitter": "Mahdi Miraz", "authors": "Zainab Alansari, Nor Badrul Anuar, Amirrudin Kamsin, Mohammad Riyaz\n  Belgaum, Jawdat Alshaer, Safeeullah Soomro and Mahdi H. Miraz", "title": "Internet of Things: Infrastructure, Architecture, Security and Privacy", "comments": null, "journal-ref": "proceedings of the IEEE International Conference on Computing,\n  Electronics & Communications Engineering 2018 (IEEE iCCECE '18), 16-17 August\n  2018, UK, Online ISBN: 978-1-5386-4904-6, E-ISBN:978-1-5386-4903-9, Published\n  by IEEE", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet of Things (IoT) is one of the emerging technologies of this century\nand its various aspects, such as the Infrastructure, Security, Architecture and\nPrivacy, play an important role in shaping the future of the digitalised world.\nInternet of Things devices are connected through sensors which have significant\nimpacts on the data and its security. In this research, we used IoT five\nlayered architecture of the Internet of Things to address the security and\nprivate issues of IoT enabled services and applications. Furthermore, a\ndetailed survey on Internet of Things infrastructure, architecture, security,\nand privacy of the heterogeneous objects were presented. The paper identifies\nthe major challenge in the field of IoT; one of them is to secure the data\nwhile accessing the objects through sensing machines. This research advocates\nthe importance of securing the IoT ecosystem at each layer resulting in an\nenhanced overall security of the connected devices as well as the data\ngenerated. Thus, this paper put forwards a security model to be utilised by the\nresearchers, manufacturers and developers of IoT devices, applications and\nservices.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2018 11:45:18 GMT"}], "update_date": "2018-07-12", "authors_parsed": [["Alansari", "Zainab", ""], ["Anuar", "Nor Badrul", ""], ["Kamsin", "Amirrudin", ""], ["Belgaum", "Mohammad Riyaz", ""], ["Alshaer", "Jawdat", ""], ["Soomro", "Safeeullah", ""], ["Miraz", "Mahdi H.", ""]]}, {"id": "1807.04114", "submitter": "Fernando Kuipers", "authors": "Meng Wang, Javier Santillan, Fernando Kuipers", "title": "ThingPot: an interactive Internet-of-Things honeypot", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Mirai Distributed Denial-of-Service (DDoS) attack exploited security\nvulnerabilities of Internet-of-Things (IoT) devices and thereby clearly\nsignalled that attackers have IoT on their radar. Securing IoT is therefore\nimperative, but in order to do so it is crucial to understand the strategies of\nsuch attackers. For that purpose, in this paper, a novel IoT honeypot called\nThingPot is proposed and deployed. Honeypot technology mimics devices that\nmight be exploited by attackers and logs their behavior to detect and analyze\nthe used attack vectors. ThingPot is the first of its kind, since it focuses\nnot only on the IoT application protocols themselves, but on the whole IoT\nplatform. A Proof-of-Concept is implemented with XMPP and a REST API, to mimic\na Philips Hue smart lighting system. ThingPot has been deployed for 1.5 months\nand through the captured data we have found five types of attacks and attack\nvectors against smart devices. The ThingPot source code is made available as\nopen source.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2018 13:09:25 GMT"}], "update_date": "2018-07-12", "authors_parsed": [["Wang", "Meng", ""], ["Santillan", "Javier", ""], ["Kuipers", "Fernando", ""]]}, {"id": "1807.04356", "submitter": "Bo Zhou", "authors": "Bo Zhou and Walid Saad", "title": "Joint Status Sampling and Updating for Minimizing Age of Information in\n  the Internet of Things", "comments": "34 pages, 7 figures. Accepted by IEEE Transactions on Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The effective operation of time-critical Internet of things (IoT)\napplications requires real-time reporting of fresh status information of\nunderlying physical processes. In this paper, a real-time IoT monitoring system\nis considered, in which the IoT devices sample a physical process with a\nsampling cost and send the status packet to a given destination with an\nupdating cost. This joint status sampling and updating process is designed to\nminimize the average age of information (AoI) at the destination node under an\naverage energy cost constraint at each device. This is formulated as an\ninfinite horizon average cost constrained Markov decision process (CMDP) and\ntransformed into an unconstrained MDP using a Lagrangian method. For the single\nIoT device case, the optimal policy for the CMDP is shown to be a randomized\nmixture of two deterministic policies for the unconstrained MDP, which is of\nthreshold type. Then, a structure-aware optimal algorithm to obtain the optimal\npolicy of the CMDP is proposed and the impact of the wireless channel dynamics\nis studied while demonstrating that channels having a larger mean channel gain\nand less scattering can achieve better AoI performance. For the case of\nmultiple IoT devices, a low-complexity distributed suboptimal policy is\nproposed with the updating control at the destination and the sampling control\nat each device. Then, an online learning algorithm is developed to obtain this\npolicy, which can be implemented at each IoT device and requires only the local\nknowledge and small signaling from the destination. The proposed learning\nalgorithm is shown to converge almost surely to the suboptimal policy.\nSimulation results show the structural properties of the optimal policy for the\nsingle IoT device case; and show that the proposed policy for multiple IoT\ndevices outperforms a zero-wait baseline policy, with average AoI reductions\nreaching up to 33%.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2018 21:21:08 GMT"}, {"version": "v2", "created": "Wed, 24 Jul 2019 14:14:44 GMT"}], "update_date": "2019-07-25", "authors_parsed": [["Zhou", "Bo", ""], ["Saad", "Walid", ""]]}, {"id": "1807.04449", "submitter": "Jonathan Scarlett", "authors": "Steffen Bondorf, Binbin Chen, Jonathan Scarlett, Haifeng Yu, and Yuda\n  Zhao", "title": "Cross-Sender Bit-Mixing Coding", "comments": "Published in the International Conference on Information Processing\n  in Sensor Networks (IPSN), 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scheduling to avoid packet collisions is a long-standing challenge in\nnetworking, and has become even trickier in wireless networks with multiple\nsenders and multiple receivers. In fact, researchers have proved that even {\\em\nperfect} scheduling can only achieve $\\mathbf{R} = O(\\frac{1}{\\ln N})$. Here\n$N$ is the number of nodes in the network, and $\\mathbf{R}$ is the {\\em medium\nutilization rate}. Ideally, one would hope to achieve $\\mathbf{R} = \\Theta(1)$,\nwhile avoiding all the complexities in scheduling. To this end, this paper\nproposes {\\em cross-sender bit-mixing coding} ({\\em BMC}), which does not rely\non scheduling. Instead, users transmit simultaneously on suitably-chosen slots,\nand the amount of overlap in different user's slots is controlled via coding.\nWe prove that in all possible network topologies, using BMC enables us to\nachieve $\\mathbf{R}=\\Theta(1)$. We also prove that the space and time\ncomplexities of BMC encoding/decoding are all low-order polynomials.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2018 07:27:56 GMT"}, {"version": "v2", "created": "Thu, 7 Mar 2019 08:52:23 GMT"}, {"version": "v3", "created": "Tue, 23 Apr 2019 04:05:26 GMT"}], "update_date": "2019-04-24", "authors_parsed": [["Bondorf", "Steffen", ""], ["Chen", "Binbin", ""], ["Scarlett", "Jonathan", ""], ["Yu", "Haifeng", ""], ["Zhao", "Yuda", ""]]}, {"id": "1807.04572", "submitter": "Ziyi Wang", "authors": "Zeqi Lai, Yong Cui, Ziyi Wang and Xiaoyu Hu", "title": "Immersion on the Edge: A Cooperative Framework for Mobile Immersive\n  Computing", "comments": "This poster has been accepted by the SIGCOMM in June 2018", "journal-ref": null, "doi": "10.1145/3234200.3234201", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Immersive computing (IC) technologies such as virtual reality and augmented\nreality are gaining tremendous popularity. In this poster, we present CoIC, a\nCooperative framework for mobile Immersive Computing. The design of CoIC is\nbased on a key insight that IC tasks among different applications or users\nmight be similar or redundant. CoIC enhances the performance of mobile IC\napplications by caching and sharing computation-intensive IC results on the\nedge. Our preliminary evaluation results on an AR application show that CoIC\ncan reduce the recognition and rendering latency by up to 52.28% and 75.86%\nrespectively on current mobile devices.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2018 12:32:59 GMT"}], "update_date": "2018-08-14", "authors_parsed": [["Lai", "Zeqi", ""], ["Cui", "Yong", ""], ["Wang", "Ziyi", ""], ["Hu", "Xiaoyu", ""]]}, {"id": "1807.04613", "submitter": "Kaushik Mondal", "authors": "Chen Avin, Kaushik Mondal, Stefan Schmid", "title": "Push-Down Trees: Optimal Self-Adjusting Complete Trees", "comments": "20 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a fundamental algorithmic problem related to the design of\ndemand-aware networks: networks whose topologies adjust toward the traffic\npatterns they serve, in an online manner. The goal is to strike a tradeoff\nbetween the benefits of such adjustments (shorter routes) and their costs\n(reconfigurations). In particular, we consider the problem of designing a\nself-adjusting tree network which serves single-source, multi-destination\ncommunication. The problem has interesting connections to self-adjusting\ndatastructures. We present two constant-competitive online algorithms for this\nproblem, one randomized and one deterministic. Our approach is based on a\nnatural notion of Most Recently Used (MRU) tree, maintaining a working set. We\nprove that the working set is a cost lower bound for any online algorithm, and\nthen present a randomized algorithm RANDOM-PUSH which approximates such an MRU\ntree at low cost, by pushing less recently used communication partners down the\ntree, along a random walk. Our deterministic algorithm MOVE-HALF does not\ndirectly maintain an MRU tree, but its cost is still proportional to the cost\nof an MRU tree, and also matches the working set lower bound.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2018 14:00:35 GMT"}, {"version": "v2", "created": "Sun, 5 Apr 2020 08:50:49 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Avin", "Chen", ""], ["Mondal", "Kaushik", ""], ["Schmid", "Stefan", ""]]}, {"id": "1807.04618", "submitter": "Niels Karowski", "authors": "Niels Karowski, Konstantin Miller", "title": "Proofs and Performance Evaluation of Greedy Multi-Channel Neighbor\n  Discovery Approaches", "comments": null, "journal-ref": null, "doi": null, "report-no": "TKN-18-0003", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The accelerating penetration of physical environments by objects with\ninformation processing and wireless communication capabilities requires\napproaches to find potential communication partners and discover services. In\nthe present work, we focus on passive discovery approaches in multi-channel\nwireless networks based on overhearing periodic beacon transmissions of\nneighboring devices which are otherwise agnostic to the discovery process. We\npropose a family of low-complexity algorithms that generate listening schedules\nguaranteed to discover all neighbors. The presented approaches simultaneously\ndepending on the beacon periods optimize the worst case discovery time, the\nmean discovery time, and the mean number of neighbors discovered until any\narbitrary in time. The presented algorithms are fully compatible with\ntechnologies such as IEEE 802.11 and IEEE 802.15.4. Complementing the proposed\nlow-complexity algorithms, we formulate the problem of computing discovery\nschedules that minimize the mean discovery time for arbitrary beacon periods as\nan integer linear problem. We study the performance of the proposed approaches\nanalytically, by means of numerical experiments, and by extensively simulating\nthem under realistic conditions. We observe that the generated listening\nschedules significantly - by up to factor 4 for the mean discovery time, and by\nup to 300% for the mean number of neighbors discovered until each point in time\n- outperform the Passive Scan, a discovery approach defined in the IEEE\n802.15.4 standard. Based on the gained insights, we discuss how the selection\nof the beacon periods influences the efficiency of the discovery process, and\nprovide recommendations for the design of systems and protocols.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2018 14:11:40 GMT"}, {"version": "v2", "created": "Tue, 17 Jul 2018 14:16:14 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Karowski", "Niels", ""], ["Miller", "Konstantin", ""]]}, {"id": "1807.04645", "submitter": "Nikolaos Pappas", "authors": "Nikolaos Pappas, Marios Kountouris", "title": "Stable Throughput Region of the Two-User Interference Channel", "comments": "arXiv admin note: text overlap with arXiv:1309.1333", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the two-user interference channel where two independent pairs\ncommunicate concurrently and investigate its stable throughput region. First,\nthe stability region is characterized for the general case, i.e., without any\nspecific consideration on the transmission and reception structures. Second, we\nexplore two different interference harnessing strategies at the receiver:\ntreating interference as noise and successive interference cancellation.\nFurthermore, we provide conditions for the convexity of the stability region\nand for which a certain receiver strategy leads to broader stability region.\nThe impact of multiple transmit antennas on the stability region is briefly\ndiscussed. Finally, we study the effect of random access on the stability\nregion of the two-user interference channel.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 20:57:01 GMT"}, {"version": "v2", "created": "Mon, 1 Oct 2018 16:42:36 GMT"}], "update_date": "2018-10-02", "authors_parsed": [["Pappas", "Nikolaos", ""], ["Kountouris", "Marios", ""]]}, {"id": "1807.05061", "submitter": "Akshay Raman", "authors": "Akshay Raman", "title": "Routing and Forwarding in nTorrent using ndnSIM", "comments": "6 pages, 13 figures. arXiv admin note: substantial text overlap with\n  arXiv:1804.05250", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BitTorrent is a popular communication protocol for peer-to-peer file sharing.\nIt uses a data-centric approach, wherein the data is decentralized and peers\nrequest each other for pieces of the file(s). Aspects of this process is\nsimilar to the Named Data Networking (NDN) architecture, but is realized\ncompletely at the application level on top of TCP/IP networking. nTorrent is a\npeer-to-peer file sharing application that is based on NDN. The goal of this\nproject is to port the application onto ndnSIM and illustrate the effects of\nrouting and forwarding.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 16:02:25 GMT"}], "update_date": "2018-07-16", "authors_parsed": [["Raman", "Akshay", ""]]}, {"id": "1807.05220", "submitter": "Niels Karowski", "authors": "Niels Karowski, Konstantin Miller, Adam Wolisz", "title": "Greedy Multi-Channel Neighbor Discovery", "comments": "arXiv admin note: text overlap with arXiv:1807.04618", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The accelerating penetration of physical environments by objects with\ninformation processing and wireless communication capabilities requires\napproaches to find potential communication partners and discover services. In\nthe present work, we focus on passive discovery approaches in multi-channel\nwireless networks based on overhearing periodic beacon transmissions of\nneighboring devices which are otherwise agnostic to the discovery process. We\npropose a family of low-complexity algorithms that generate listening schedules\nguaranteed to discover all neighbors. The presented approaches simultaneously\ndepending on the beacon periods optimize the worst case discovery time, the\nmean discovery time, and the mean number of neighbors discovered until any\narbitrary in time. The presented algorithms are fully compatible with\ntechnologies such as IEEE 802.11 and IEEE 802.15.4. Complementing the proposed\nlow-complexity algorithms, we formulate the problem of computing discovery\nschedules that minimize the mean discovery time for arbitrary beacon periods as\nan integer linear problem. We study the performance of the proposed approaches\nanalytically, by means of numerical experiments, and by extensively simulating\nthem under realistic conditions. We observe that the generated listening\nschedules significantly - by up to factor 4 for the mean discovery time, and by\nup to 300% for the mean number of neighbors discovered until each point in time\n- outperform the Passive Scan, a discovery approach defined in the IEEE\n802.15.4 standard. Based on the gained insights, we discuss how the selection\nof the beacon periods influences the efficiency of the discovery process, and\nprovide recommendations for the design of systems and protocols.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jul 2018 09:37:51 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Karowski", "Niels", ""], ["Miller", "Konstantin", ""], ["Wolisz", "Adam", ""]]}, {"id": "1807.05242", "submitter": "Ramakrishnan Durairajan", "authors": "Ramakrishnan Durairajan and Paul Barford and Joel Sommers and Walter\n  Willinger", "title": "GreyFiber: A System for Providing Flexible Access to Wide-Area\n  Connectivity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Access to fiber-optic connectivity in the Internet is traditionally offered\neither via lit circuits or dark fiber. Economic (capex vs. opex) and\noperational considerations (latency, capacity) dictate the choice between these\ntwo offerings, but neither may effectively address the specific needs of\nmodern-day enterprises or service providers over a range of use scenarios. In\nthis paper, we describe a new approach for fiber-optic connectivity in the\nInternet that we call GreyFiber. The core idea of GreyFiber is to offer\nflexible access to fiber-optic paths between end points (e.g., datacenters or\ncolocation facilities) over a range of timescales. We identify and discuss\noperational issues and systems challenges that need to be addressed to make\nGreyFiber a viable and realistic option for offering flexible access to\ninfrastructure (similar to cloud computing). We investigate the efficacy of\nGreyFiber with a prototype implementation deployed in the GENI and CloudLab\ntestbeds. Our scaling experiments show that 50 circuits can be provisioned\nwithin a minute. We also show that backup paths can be provisioned 28 times\nfaster than an OSPF-based solution during failure/maintenance events. Our\nexperiments also examine GreyFiber overhead demands and show that the time\nspent in circuit creation is dependent on the network infrastructure,\nindicating avenues for future improvements.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jul 2018 18:15:23 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Durairajan", "Ramakrishnan", ""], ["Barford", "Paul", ""], ["Sommers", "Joel", ""], ["Willinger", "Walter", ""]]}, {"id": "1807.05372", "submitter": "Suzhi Bi", "authors": "Yuan Zheng, Suzhi Bi, and Xiaohui Lin", "title": "Backscatter-assisted Relaying in Wireless Powered Communications Network", "comments": "This paper has been accepted by the International Conference on\n  Machine Learning and Intelligent Communications (MLICOM), Hangzhou, China,\n  July 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a novel cooperation method in a two-user wireless powered\ncommunication network (WPCN), in which one hybrid access point (HAP) broadcasts\nwireless energy to two distributed wireless devices (WDs), while the WDs use\nthe harvested energy to transmit their independent information to the HAP. To\ntackle the user unfairness problem caused by the near-far effect in WPCN, we\nallow the WD with the stronger WD-to-HAP channel to use part of its harvested\nenergy to help relay the other weaker user's information to the HAP. In\nparticular, we exploit the use of backscatter communication during the wireless\nenergy transfer phase such that the helping relay user can harvest energy and\nreceive the information from the weaker user simultaneously. We derive the\nmaximum common throughput performance by jointly optimizing the time duration\nand power allocations on wireless energy and information transmissions. Our\nsimulation results demonstrate that the backscatter-assisted cooperation scheme\ncan effectively improve the throughput fairness performance in WPCNs.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jul 2018 10:10:05 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Zheng", "Yuan", ""], ["Bi", "Suzhi", ""], ["Lin", "Xiaohui", ""]]}, {"id": "1807.05523", "submitter": "Dheryta Jaisinghani", "authors": "Dheryta Jaisinghani, Vinayak Naik, Sanjit K. Kaul, Rajesh Balan, and\n  Sumit Roy", "title": "Improving the Performance of WLANs by Reducing Unnecessary Active Scans", "comments": "14 pages, TMC, NCC, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of excessive and unnecessary active scans in heavily\nutilized WLANs during which low rate probe requests and responses are\nbroadcast. These management frames severely impact the goodput. Our analysis of\ntwo production WLANs reveals that lesser number of non-overlapping channels in\n$2.4$ GHz makes it more prone to the effects of increased probe frames than $5$\nGHz. We find that not only up to $90$% of probe responses carry redundant\ninformation but the probe traffic can be as high as $60$\\% of the management\ntraffic. Furthermore, active scanning severely impacts real-time applications\nat a client as it increases the latency by $91$ times.\n  We present a detailed analysis of the impact of active scans on an individual\nclient and the whole network. We discuss three ways to control the probe\ntraffic in production WLANs -- access point configurations, network planning,\nand client modification. Our proposals for access point configuration are in\nline with current WLAN deployments, better network planning is device agnostic\nin nature, and client modification reduces the average number of probe requests\nper client by up to $50$% without hampering the ongoing WiFi connection.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jul 2018 10:43:46 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Jaisinghani", "Dheryta", ""], ["Naik", "Vinayak", ""], ["Kaul", "Sanjit K.", ""], ["Balan", "Rajesh", ""], ["Roy", "Sumit", ""]]}, {"id": "1807.05652", "submitter": "Hao Wu", "authors": "Hao Wu, Hsu-Chun Hsiao, Daniele E. Asoni, Simon Scherrer, Adrian\n  Perrig, Yih-Chun Hu", "title": "CLEF: Limiting the Damage Caused by Large Flows in the Internet Core\n  (Technical Report)", "comments": "45 pages, 17th International Conference on Cryptology And Network\n  Security (CANS 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The detection of network flows that send excessive amounts of traffic is of\nincreasing importance to enforce QoS and to counter DDoS attacks. Large-flow\ndetection has been previously explored, but the proposed approaches can be used\non high-capacity core routers only at the cost of significantly reduced\naccuracy, due to their otherwise too high memory and processing overhead. We\npropose CLEF, a new large-flow detection scheme with low memory requirements,\nwhich maintains high accuracy under the strict conditions of high-capacity core\nrouters. We compare our scheme with previous proposals through extensive\ntheoretical analysis, and with an evaluation based on worst-case-scenario\nattack traffic. We show that CLEF outperforms previously proposed systems in\nsettings with limited memory.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2018 01:58:14 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Wu", "Hao", ""], ["Hsiao", "Hsu-Chun", ""], ["Asoni", "Daniele E.", ""], ["Scherrer", "Simon", ""], ["Perrig", "Adrian", ""], ["Hu", "Yih-Chun", ""]]}, {"id": "1807.05716", "submitter": "Dominique Vaufreydaz", "authors": "Viet-Cuong Ta, Trung-Kien Dao (MICA), Dominique Vaufreydaz\n  (PERVASIVE), Eric Castelli (PERVASIVE)", "title": "Smartphone-based user positioning in a multiple-user context with Wi-Fi\n  and Bluetooth", "comments": "International Conference on Indoor Positioning and Indoor Navigation\n  (IPIN), Sep 2018, Nantes, France", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a multiuser context, the Bluetooth data from the smartphone could give an\napproximation of the distance between users. Meanwhile, the Wi-Fi data can be\nused to calculate the user's position directly. However, both the Wi-Fi-based\nposition outputs and Bluetooth-based distances are affected by some degree of\nnoise. In our work, we propose several approaches to combine the two types of\noutputs for improving the tracking accuracy in the context of collaborative\npositioning. The two proposed approaches attempt to build a model for measuring\nthe errors of the Bluetooth output and Wi-Fi output. In a non-temporal\napproach, the model establishes the relationship in a specific interval of the\nBluetooth output and Wi-Fi output. In a temporal approach, the error\nmeasurement model is expanded to include the time component between users'\nmovement. To evaluate the performance of the two approaches, we collected the\ndata from several multiuser scenarios in indoor environment. The results show\nthat the proposed approaches could reach a distance error around 3.0m for 75\npercent of time, which outperforms the positioning results of the standard\nWi-Fi fingerprinting model.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2018 08:08:30 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Ta", "Viet-Cuong", "", "MICA"], ["Dao", "Trung-Kien", "", "MICA"], ["Vaufreydaz", "Dominique", "", "PERVASIVE"], ["Castelli", "Eric", "", "PERVASIVE"]]}, {"id": "1807.05805", "submitter": "Christos Liaskos K.", "authors": "Ageliki Tsioliaridou, Christos Liaskos, Sotiris Ioannidis", "title": "BitSurfing: Wireless Communications with Outsourced Symbol Generation", "comments": "Paper accepted for publication at IEEE CAMAD 2018 main track. Funded\n  by the European Union via the Horizon 2020: Future Emerging Topics call\n  (FETOPEN), grant EU736876, project VISORSURF (http://www.visorsurf.eu)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nano-IoT enables a wide range of ground-breaking technologies, but face\nimplementation challenges due to the extremity of the scale. Space restrictions\npose severe power supply considerations, to the point where just a few packet\ntransmissions are sufficient to deplete state-of-the-art supplies. In turn,\nthis translates to difficulties in developing efficient protocols even for\nbasic operations, such as addressing and routing. The present work proposes a\nnew network adapter architecture that can address these challenges. The\nBitSurfing adapter does not generate packets and, hence, abolishes the need for\nthe corresponding transmission circuitry and power consumption. Instead, it\nrelies on an external symbol generator. The BitSurfing adapter reads incoming\nsymbols, waiting for intended messages to appear in the symbol stream. A short\n(1-bit), low-energy pulse is then emitted to notify neighboring nodes.\nBitSurfing adapters are shown to exhibit perpetual (and even battery-less)\noperation, ability to operate without medium access control, while being\ncompletely transparent to applications. Moreover, their operation is\nevent-driven, allowing for clock-less implementations. The new adapters are\nevaluated in a simulated multi-hop nano-IoT network and are shown to offer\nnearly-perfect packet delivery rates and practically no collisions, under any\ncongestion level.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2018 11:49:38 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Tsioliaridou", "Ageliki", ""], ["Liaskos", "Christos", ""], ["Ioannidis", "Sotiris", ""]]}, {"id": "1807.06005", "submitter": "Mohamed Grissa", "authors": "Mohamed Grissa, Attila Yavuz, and Bechir Hamdaoui", "title": "An Efficient Technique for Protecting Location Privacy of Cooperative\n  Spectrum Sensing Users", "comments": "Published in: 2016 IEEE Conference on Computer Communications\n  Workshops (INFOCOM WKSHPS), 7 pages, 1 figure. arXiv admin note: text overlap\n  with arXiv:1806.00916", "journal-ref": null, "doi": "10.1109/INFCOMW.2016.7562209", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative spectrum sensing, despite its effectiveness in enabling dynamic\nspectrum access, suffers from location privacy threats, merely because\nsecondary users (SUs)' sensing reports that need to be shared with a fusion\ncenter to make spectrum availability decisions are highly correlated to the\nusers' locations. It is therefore important that cooperative spectrum sensing\nschemes be empowered with privacy-preserving capabilities so as to provide SUs\nwith incentives for participating in the sensing task. In this paper, we\npropose an efficient privacy-preserving protocol that uses an additional\narchitectural entity and makes use of various cryptographic mechanisms to\npreserve the location privacy of SUs while performing reliable and efficient\nspectrum sensing. We show that not only is our proposed scheme secure and more\nefficient than existing alternatives, but also achieves fault tolerance and is\nrobust against sporadic network topological changes.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jul 2018 16:42:31 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Grissa", "Mohamed", ""], ["Yavuz", "Attila", ""], ["Hamdaoui", "Bechir", ""]]}, {"id": "1807.06357", "submitter": "Hiroshi Watanabe Prof.", "authors": "Hiroshi Watanabe", "title": "Can Blockchain Protect Internet-of-Things?", "comments": "Typo fixed, Future Technology Conference 2017, Vancouver, Canada,\n  Nov. 29-30, 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Internet-of-Things, the number of connected devices is expected to be\nextremely huge, i.e., more than a couple of ten billion. It is however\nwell-known that the security for the Internet-of-Things is still open problem.\nIn particular, it is difficult to certify the identification of connected\ndevices and to prevent the illegal spoofing. It is because the conventional\nsecurity technologies have advanced for mainly protecting logical network and\nnot for physical network like the Internet-of-Things. In order to protect the\nInternet-of-Things with advanced security technologies, we propose a new\nconcept (datachain layer) which is a well-designed combination of physical chip\nidentification and blockchain. With a proposed solution of the physical chip\nidentification, the physical addresses of connected devices are uniquely\nconnected to the logical addresses to be protected by blockchain.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2018 11:34:44 GMT"}, {"version": "v2", "created": "Sun, 22 Jul 2018 16:30:00 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Watanabe", "Hiroshi", ""]]}, {"id": "1807.06458", "submitter": "Ferheen Ayaz", "authors": "Ferheen Ayaz, Khaled Rabie, Bamidele Adebisi", "title": "Analysis of Optimized Threshold with SLM based Blanking Non-Linearity\n  for Impulsive Noise Reduction in Power Line Communication Systems", "comments": "Accepted in 11th IEEE/IET International Symposium on Communication\n  Systems, Networks, and Digital Signal Processing. Consists of 6 pages and 5\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  High amplitude impulsive noise (IN) occurrence over power line channels\nseverely degrades the performance of Orthogonal Frequency Division Multiplexing\n(OFDM)systems. One of the simplest methods to reduce IN is to precede the OFDM\ndemodulator with a blanking non-linearity processor. In this respect, Selective\nMapping (SLM) applied to an OFDM signal before the transmitter does not only\nreduce Peak-to-Average Power Ratio (PAPR) but also increases the resulting\nSignal-to-Noise Ratio (SNR) when blanking nonlinearity is applied at the\nreceiver. This paper highlights another advantage of SLM based IN reduction,\nwhich is the reduced dependency on threshold used for blanking nonlinearity.\nThe simulation results show that the optimal threshold to achieve maximum SNR\nis found to be constant for phase vectors greater than or equal to 64 in the\nSLM scheme. If the optimized threshold calculation method is used, the output\nSNR with SLM OFDM will result in SNR gains of up to 8.6dB compared to the\nunmodified system, i.e. without implementing SLM. Moreover, by using SLM, we\nnot only get the advantage of low peak power, but also the need to calculate\noptimized threshold is eliminated, thereby reducing the additional computation.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2018 14:13:14 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Ayaz", "Ferheen", ""], ["Rabie", "Khaled", ""], ["Adebisi", "Bamidele", ""]]}, {"id": "1807.06508", "submitter": "Miguel Sepulcre", "authors": "Manuel Gonzalez-Martin, Miguel Sepulcre, Rafael Molina-Masegosa,\n  Javier Gozalvez", "title": "Analytical Models of the Performance of C-V2X Mode 4 Vehicular\n  Communications", "comments": null, "journal-ref": "IEEE Transactions on Vehicular Technology (Volume: 68, Issue: 2,\n  Feb. 2019)", "doi": "10.1109/TVT.2018.2888704", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The C-V2X or LTE-V standard has been designed to support V2X (Vehicle to\nEverything) communications. The standard is an evolution of LTE, and it has\nbeen published by the 3GPP in Release 14. This new standard introduces the\nC-V2X or LTE-V Mode 4 that is specifically designed for V2V communications\nusing the PC5 sidelink interface without any cellular infrastructure support.\nIn Mode 4, vehicles autonomously select and manage their radio resources. Mode\n4 is highly relevant since V2V safety applications cannot depend on the\navailability of infrastructure-based cellular coverage. This paper presents the\nfirst analytical models of the communication performance of C-V2X or LTE-V Mode\n4. In particular, the paper presents analytical models for the average PDR\n(Packet Delivery Ratio) as a function of the distance between transmitter and\nreceiver, and for the four different types of transmission errors that can be\nencountered in C-V2X Mode 4. The models are validated for a wide range of\ntransmission parameters and traffic densities. To this aim, this study compares\nthe results obtained with the analytical models to those obtained with a C-V2X\nMode 4 simulator implemented over Veins.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2018 15:42:04 GMT"}, {"version": "v2", "created": "Wed, 24 Oct 2018 09:56:08 GMT"}, {"version": "v3", "created": "Fri, 21 Dec 2018 16:30:13 GMT"}], "update_date": "2019-04-22", "authors_parsed": [["Gonzalez-Martin", "Manuel", ""], ["Sepulcre", "Miguel", ""], ["Molina-Masegosa", "Rafael", ""], ["Gozalvez", "Javier", ""]]}, {"id": "1807.06754", "submitter": "Junjie Tan", "authors": "Junjie Tan, Sa Xiao, Shiying Han, Ying-Chang Liang", "title": "A Learning-Based Coexistence Mechanism for LAA-LTE Based HetNets", "comments": "This paper has been presented in IEEE ICC 2018, Kansas City, MO, US.\n  To appear in Proc. IEEE ICC'18", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  License-assisted access LTE (LAA-LTE) has been proposed to deal with the\nintense contradiction between tremendous mobile traffic demands and crowded\nlicensed spectrums. In this paper, we investigate the coexistence mechanism for\nLAA-LTE based heterogenous networks (HetNets). A joint resource allocation and\nnetwork access problem is considered to maximize the normalized throughput of\nthe unlicensed band while guaranteeing the quality-of-service requirements of\nincumbent WiFi users. A two-level learning-based framework is proposed to solve\nthe problem by decomposing it into two subproblems. In the master level, a\nQ-learning based method is developed for the LAA-LTE system to determine the\nproper transmission time. In the slave one, a game-theory based learning method\nis adopted by each user to autonomously perform network access. Simulation\nresults demonstrate the effectiveness of the proposed solution.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jul 2018 03:23:28 GMT"}], "update_date": "2018-07-19", "authors_parsed": [["Tan", "Junjie", ""], ["Xiao", "Sa", ""], ["Han", "Shiying", ""], ["Liang", "Ying-Chang", ""]]}, {"id": "1807.06953", "submitter": "Joichi Ito", "authors": "Joichi Ito", "title": "Emergent Democracy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CY cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This essay argues that a new form of democracy - an \"Emergent Democracy\" -\nwill develop as a result of the use of Internet communication tools and\nplatforms such as blogs. The essay explores a variety of tools available and\nexplores the history of democracy, modern experiments with democracy and how\nthese tools might support democracy. The essay also explores concerns as these\nnew tools emerge. These issues include concerns such as privacy and the\nsocietally negative use of these tools by corporations, totalitarian regimes\nand terrorists.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jul 2018 17:53:20 GMT"}], "update_date": "2018-07-27", "authors_parsed": [["Ito", "Joichi", ""]]}, {"id": "1807.07028", "submitter": "Soheil Abbasloo", "authors": "Soheil Abbasloo, Yang Xu, H. Jonathan Chao", "title": "HyLine: a Simple and Practical Flow Scheduling for Commodity Datacenters", "comments": "IFIP Networking conference 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today's datacenter networks (DCNs) have been built upon multipath topologies\nwhere each path contains multiple links. However, flow scheduling schemes\nproposed to minimize flow completion times (FCT) in DCNs are based on\nalgorithms which are optimum or close-to-optimum only over single link.\nMoreover, most of these scheduling schemes seek either fully centralized\napproaches having overhead of communicating to a central entity or fully\ndistributed approaches requiring changes in the fabric. Motivated by these\nshortcomings, we present HyLine a simple scheduling design for commodity DCNs\nwhich is equipped with a joint load-balancing and flow scheduling (path-aware)\ndesign exploiting the multipath nature of DCNs. HyLine takes a hybrid approach\nand uses the global-awareness of centralized and agility of distributed\ntechniques without requiring any changes in the fabric. To that end, it\ndetermines a threshold margin identifying flows for which using centralized\napproach is beneficial. We have shown through extensive ns2 simulations that\ndespite HyLine's simplicity, it significantly outperforms existing schemes and\nachieves lower average and 99th percentile FCTs. For instance, compared to\nQjump-state-of-the-art practical scheme-and pFabric-one of the best performing\nflow scheduling schemes-HyLine reduces average FCT up to 68% and 31%,\nrespectively, under a production datacenter workload.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jul 2018 16:31:23 GMT"}], "update_date": "2018-07-19", "authors_parsed": [["Abbasloo", "Soheil", ""], ["Xu", "Yang", ""], ["Chao", "H. Jonathan", ""]]}, {"id": "1807.07230", "submitter": "Abdurrahman Fouda", "authors": "Abdurrahman Fouda, Ahmed S. Ibrahim, Ismail Guvenc and Monisha Ghosh", "title": "UAV-Based in-band Integrated Access and Backhaul for 5G Communications", "comments": "To be presented in the proceedings of VTC-Fall'18, Chicago, IL", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the concept of using unmanned aerial vehicles (UAVs) as drone\nbase stations for in-band Integrated Access and Backhaul (IB-IAB) scenarios for\n5G networks. We first present a system model for forward link transmissions in\nan IB-IAB multi-tier drone cellular network. We then investigate the key\nchallenges of this scenario and propose a framework that utilizes the flying\ncapabilities of the UAVs as the main degree of freedom to find the optimal\nprecoder design for the backhaul links, user-base station association, UAV 3D\nhovering locations, and power allocations. We discuss how the proposed\nalgorithm can be utilized to optimize the network performance in both large and\nsmall scales. Finally, we use an exhaustive search-based solution to\ndemonstrate the performance gains that can be achieved from the presented\nalgorithm in terms of the received signal to interference plus noise ratio\n(SINR) and overall network sum-rate.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2018 03:52:18 GMT"}], "update_date": "2018-07-20", "authors_parsed": [["Fouda", "Abdurrahman", ""], ["Ibrahim", "Ahmed S.", ""], ["Guvenc", "Ismail", ""], ["Ghosh", "Monisha", ""]]}, {"id": "1807.07301", "submitter": "Qiong Wu", "authors": "Qiong Wu, Shuzhen Nie, Pingyi Fan, Hanxu Liu, Fan Qiang and Zhengquan\n  Li", "title": "A Swarming Approach to Optimize the One-hop Delay in Smart Driving\n  Inter-platoon Communications", "comments": "published by sensors. Simulation codes are available online at\n  https://codeocean.com/2018/06/28/code-for-colon-a-swarming-approach-to", "journal-ref": "Sensors 2018, 18(10), 3307", "doi": "10.3390/s18103307", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a swarming approach and optimize the one-hop delay\nfor interplatoon communications through adjusting the minimum contention window\nsize of each backbone vehicle in two steps. In the first step, we first set a\nsmall enough average one-hop delay as the initial optimization goal and then\npropose a swarming approach to find a minimum average one-hop delay for\ninter-platoon communications through adjusting the minimum contention window of\neach backbone vehicle iteratively. In the second step, we first set the minimum\naverage one-hop delay found in the first step as the initial optimization goal\nand then adopt the swarming approach again to get the one-hop delay of each\nbackbone vehicle balance to the minimum average one-hop delay. The optimal\nminimum contention window sizes that get the one-hop delay of each backbone\nvehicle balance to the minimum average one-hop delay are obtained after the\nsecond step. The simulation results indicate that the one-hop delay is\noptimized and the other performance metrics including end-to-end delay, one-hop\nthroughput and transmission probability are presented by using the optimal\nminimum contention window sizes.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2018 08:57:46 GMT"}, {"version": "v2", "created": "Mon, 2 Nov 2020 12:01:05 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Wu", "Qiong", ""], ["Nie", "Shuzhen", ""], ["Fan", "Pingyi", ""], ["Liu", "Hanxu", ""], ["Qiang", "Fan", ""], ["Li", "Zhengquan", ""]]}, {"id": "1807.07422", "submitter": "Pietro Danzi", "authors": "Pietro Danzi, Anders E. Kal{\\o}r, \\v{C}edomir Stefanovi\\'c, Petar\n  Popovski", "title": "Delay and Communication Tradeoffs for Blockchain Systems with\n  Lightweight IoT Clients", "comments": "This paper has been submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emerging blockchain protocols provide a decentralized architecture that\nis suitable of supporting Internet of Things (IoT) interactions. However,\nkeeping a local copy of the blockchain ledger is infeasible for low-power and\nmemory-constrained devices. For this reason, they are equipped with lightweight\nsoftware implementations that only download the useful data structures, e.g.\nstate of accounts, from the blockchain network, when they are updated. In this\npaper, we consider and analyze a novel scheme, implemented by the nodes of the\nblockchain network, which aggregates the blockchain data in periodic updates\nand further reduces the communication cost of the connected IoT devices. We\nshow that the aggregation period should be selected based on the channel\nquality, the offered rate, and the statistics of updates of the useful data\nstructures. The results, obtained for the Ethereum protocol, illustrate the\nbenefits of the aggregation scheme in terms of a reduced duty cycle of the\ndevice, particularly for low signal-to-noise ratios, and the overall reduction\nof the amount of information transmitted in downlink (e.g., from the wireless\nbase station to the IoT device). A potential application of the proposed scheme\nis to let the IoT device request more information than actually needed, hence\nincreasing its privacy, while keeping the communication cost constant. In\nconclusion, our work is the first to provide rigorous guidelines for the design\nof lightweight blockchain protocols with wireless connectivity.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2018 13:47:03 GMT"}, {"version": "v2", "created": "Sun, 22 Jul 2018 19:56:43 GMT"}, {"version": "v3", "created": "Wed, 17 Oct 2018 07:19:31 GMT"}], "update_date": "2018-10-18", "authors_parsed": [["Danzi", "Pietro", ""], ["Kalør", "Anders E.", ""], ["Stefanović", "Čedomir", ""], ["Popovski", "Petar", ""]]}, {"id": "1807.07622", "submitter": "Rojin Aslani", "authors": "Rojin Aslani, Mehdi Rasti", "title": "Distributed Power Control Schemes for In-Band Full-Duplex Energy\n  Harvesting Wireless Networks", "comments": "11 pages, 8 figures", "journal-ref": "in IEEE Transactions on Wireless Communications, vol. 16, no. 8,\n  pp. 5233-5243, Aug. 2017", "doi": "10.1109/TWC.2017.2707086", "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies two power control problems in energy harvesting wireless\nnetworks where one hybrid base station (HBS) and all user equipments (UEs) are\noperating in in-band full-duplex mode. We consider minimizing the aggregate\npower subject to the quality of service requirement constraint, and maximizing\nthe aggregate throughput. We address these two problems by proposing two\ndistributed power control schemes for controlling the uplink transmit power by\nthe UEs and the downlink energy harvesting signal power by the HBS. In our\nproposed schemes, the HBS updates the downlink transmit power level of the\nenergy-harvesting signal so that each UE is enabled to harvest its required\nenergy for powering the operating circuit and transmitting its uplink\ninformation signal with the power level determined by the proposed schemes. We\nshow that our proposed power control schemes converge to their corresponding\nunique fixed points starting from any arbitrary initial transmit power. We will\nshow that our proposed schemes well address the stated problems, which is also\ndemonstrated by our extensive simulation results.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2018 19:40:43 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Aslani", "Rojin", ""], ["Rasti", "Mehdi", ""]]}, {"id": "1807.07818", "submitter": "Bal\\'azs Csan\\'ad Cs\\'aji", "authors": "Bal\\'azs Csan\\'ad Cs\\'aji, Zsolt Kem\\'eny, Gianfranco Pedone, Andr\\'as\n  Kuti, J\\'ozsef V\\'ancza", "title": "Wireless Multi-Sensor Networks for Smart Cities: A Prototype System with\n  Statistical Data Analysis", "comments": "9 pages, 8 figures, 3 tables, 27 references", "journal-ref": "IEEE Sensors Journal, Volume 17, Issue 23, 2017, pp. 7667-7676", "doi": "10.1109/JSEN.2017.2736785", "report-no": null, "categories": "cs.CY cs.LG cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As urbanization proceeds at an astonishing rate, cities have to continuously\nimprove their solutions that affect the safety, health and overall wellbeing of\ntheir residents. Smart city projects worldwide build on advanced sensor,\ninformation and communication technologies to help dealing with issues like air\npollution, waste management, traffic optimization, and energy efficiency. The\npaper reports about the prototype of a smart city initiative in Budapest which\napplies various sensors installed on the public lighting system and a\ncloud-based analytical module. While the installed wireless multi-sensor\nnetwork gathers information about a number of stressors, the module integrates\nand statistically processes the data. The module can handle inconsistent,\nmissing and noisy data and can extrapolate the measurements in time and space,\nnamely, it can create short-term forecasts and smoothed maps, both accompanied\nby reliability estimates. The resulting database uses geometric representations\nand can serve as an information centre for public services.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jul 2018 12:51:15 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Csáji", "Balázs Csanád", ""], ["Kemény", "Zsolt", ""], ["Pedone", "Gianfranco", ""], ["Kuti", "András", ""], ["Váncza", "József", ""]]}, {"id": "1807.07876", "submitter": "Amir Varasteh", "authors": "Amir Varasteh, Marilet De Andrade, Carmen Mas Machuca, Lena Wosinska,\n  and Wolfgang Kellerer", "title": "Power-Aware Virtual Network Function Placement and Routing using an\n  Abstraction Technique", "comments": "IEEE Global Communications Conference (GLOBECOM) 2018, Abu Dhabi, UAE", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Network Function Virtualization (NFV) is very promising for efficient\nprovisioning of network services and is attracting a lot of attention. NFV can\nbe implemented in commercial off-the-shelf servers or Physical Machines (PMs),\nand many network services can be offered as a sequence of Virtual Network\nFunctions (VNFs), known as VNF chains. Furthermore, many existing network\ndevices (e.g., switches) and collocated PMs are underutilized or\nover-provisioned, resulting in low power-efficiency. In order to achieve more\nenergy efficient systems, this work aims at designing the placement of VNFs\nsuch that the total power consumption in network nodes and PMs is minimized,\nwhile meeting the delay and capacity requirements of the foreseen demands.\nBased on existing switch and PM power models, we propose a Integer Linear\nProgramming (ILP) formulation to find the optimal solution. We also propose a\nheuristic based on the concept of Blocking Islands (BI), and a baseline\nheuristic based on the Betweenness Centrality (BC) property of the graph. Both\nheuristics and the ILP solutions have been compared in terms of total power\nconsumption, delay, demands acceptance rate, and computation time. Our\nsimulation results suggest that BI-based heuristic is superior compared with\nthe BC-based heuristic, and very close to the optimal solution obtained from\nthe ILP in terms of total power consumption and demands acceptance rate.\nCompared to the ILP, the proposed BI-based heuristic is significantly faster\nand results in 22% lower end-to-end delay, with a penalty of consuming 6% more\npower in average.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jul 2018 14:49:03 GMT"}, {"version": "v2", "created": "Mon, 30 Jul 2018 16:37:01 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Varasteh", "Amir", ""], ["De Andrade", "Marilet", ""], ["Machuca", "Carmen Mas", ""], ["Wosinska", "Lena", ""], ["Kellerer", "Wolfgang", ""]]}, {"id": "1807.08026", "submitter": "Dakshil Shah", "authors": "Dakshil Shah, Varshali Kumar", "title": "TCP SYN Cookie Vulnerability", "comments": "3 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  TCP SYN Cookies were implemented to mitigate against DoS attacks. It ensured\nthat the server did not have to store any information for half-open\nconnections. A SYN cookie contains all information required by the server to\nknow the request is valid. However, the usage of these cookies introduces a\nvulnerability that allows an attacker to guess the initial sequence number and\nuse that to spoof a connection or plant false logs.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jul 2018 20:51:32 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Shah", "Dakshil", ""], ["Kumar", "Varshali", ""]]}, {"id": "1807.08087", "submitter": "Shenghe Xu", "authors": "Shenghe Xu, Pei Liu, Sanjay Goyal and Shivendra S. Panwar", "title": "Capacity Analysis for Full Duplex Self-backhauled Small Cells", "comments": "Submitted to IEEE GLOBECOM 2018 FD workshop", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Full duplex (FD) communication enables simultaneous transmission and\nreception on the same frequency band. Though it has the potential of doubling\nthe throughput on isolated links, in reality, higher interference and\nasymmetric traffic demands in the uplink and downlink could significantly\nreduce the gains of FD operations. In this paper, we consider the application\nof FD operation in self-backhauled small cells, where multiple FD capable small\ncell base stations (SBS) are wirelessly backhauled by a FD capable macro-cell\nBS (MBS). To increase the capacity of the backhaul link, the MBS is equipped\nwith multiple antennas to enable space division multiple access (SDMA). A\nscheduling method using back-pressure algorithm and geometric programming is\nproposed for link selection and interference mitigation. Simulation results\nshow that with FD SDMA backhaul links, the proposed scheduler almost doubles\nthroughput under asymmetric traffic demand and various network conditions.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jul 2018 05:40:31 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Xu", "Shenghe", ""], ["Liu", "Pei", ""], ["Goyal", "Sanjay", ""], ["Panwar", "Shivendra S.", ""]]}, {"id": "1807.08088", "submitter": "Mark Eisen", "authors": "Mark Eisen, Clark Zhang, Luiz F. O. Chamon, Daniel D. Lee, Alejandro\n  Ribeiro", "title": "Learning Optimal Resource Allocations in Wireless Systems", "comments": null, "journal-ref": null, "doi": "10.1109/TSP.2019.2908906", "report-no": null, "categories": "cs.LG cs.NI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the design of optimal resource allocation policies in\nwireless communication systems which are generically modeled as a functional\noptimization problem with stochastic constraints. These optimization problems\nhave the structure of a learning problem in which the statistical loss appears\nas a constraint, motivating the development of learning methodologies to\nattempt their solution. To handle stochastic constraints, training is\nundertaken in the dual domain. It is shown that this can be done with small\nloss of optimality when using near-universal learning parameterizations. In\nparticular, since deep neural networks (DNN) are near-universal their use is\nadvocated and explored. DNNs are trained here with a model-free primal-dual\nmethod that simultaneously learns a DNN parametrization of the resource\nallocation policy and optimizes the primal and dual variables. Numerical\nsimulations demonstrate the strong performance of the proposed approach on a\nnumber of common wireless resource allocation problems.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jul 2018 06:00:36 GMT"}, {"version": "v2", "created": "Tue, 12 Mar 2019 21:08:40 GMT"}], "update_date": "2019-05-22", "authors_parsed": [["Eisen", "Mark", ""], ["Zhang", "Clark", ""], ["Chamon", "Luiz F. O.", ""], ["Lee", "Daniel D.", ""], ["Ribeiro", "Alejandro", ""]]}, {"id": "1807.08165", "submitter": "Joberto Martins Prof. Dr.", "authors": "Romildo Bezerra and Flavia Nascimento and Joberto Martins", "title": "On Computational Infraestruture Requirements to Smart and Autonomic\n  Cities Framework", "comments": "IEEE International Smart Cities Conference - ISC2-2015, Mexico - 6\n  pages", "journal-ref": null, "doi": "10.5281/zenodo.1318246", "report-no": null, "categories": "cs.NI cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Smart cities are an actual trend being pursued by research that,\nfundamentally, tries to improve city's management on behalf of a better human\nquality of live. This paper proposes a new autonomic complementary approach for\nsmart cities management. It is argued that smart city management systems with\nautonomic characteristics will improve and facilitate management\nfunctionalities in general. A framework is also presented as use case\nconsidering specific application scenarios like smart-health, smart-grid,\nsmart-environment and smart-streets.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jul 2018 14:57:49 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Bezerra", "Romildo", ""], ["Nascimento", "Flavia", ""], ["Martins", "Joberto", ""]]}, {"id": "1807.08315", "submitter": "Nicholas Mastronarde", "authors": "Nikhilesh Sharma, Nicholas Mastronarde, Jacob Chakareski", "title": "Accelerated Structure-Aware Reinforcement Learning for Delay-Sensitive\n  Energy Harvesting Wireless Sensors", "comments": "arXiv admin note: text overlap with arXiv:1803.09778", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate an energy-harvesting wireless sensor transmitting\nlatency-sensitive data over a fading channel. The sensor injects captured data\npackets into its transmission queue and relies on ambient energy harvested from\nthe environment to transmit them. We aim to find the optimal scheduling policy\nthat decides whether or not to transmit the queue's head-of-line packet at each\ntransmission opportunity such that the expected packet queuing delay is\nminimized given the available harvested energy. No prior knowledge of the\nstochastic processes that govern the channel, captured data, or harvested\nenergy dynamics are assumed, thereby necessitating the use of online learning\nto optimize the scheduling policy. We formulate this scheduling problem as a\nMarkov decision process (MDP) and analyze the structural properties of its\noptimal value function. In particular, we show that it is non-decreasing and\nhas increasing differences in the queue backlog and that it is non-increasing\nand has increasing differences in the battery state. We exploit this structure\nto formulate a novel accelerated reinforcement learning (RL) algorithm to solve\nthe scheduling problem online at a much faster learning rate, while limiting\nthe induced computational complexity. Our experiments demonstrate that the\nproposed algorithm closely approximates the performance of an optimal offline\nsolution that requires a priori knowledge of the channel, captured data, and\nharvested energy dynamics. Simultaneously, by leveraging the value function's\nstructure, our approach achieves competitive performance relative to a\nstate-of-the-art RL algorithm, at potentially orders of magnitude lower\ncomplexity. Finally, considerable performance gains are demonstrated over the\nwell-known and widely used Q-learning algorithm.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jul 2018 16:41:50 GMT"}, {"version": "v2", "created": "Sun, 5 May 2019 18:17:57 GMT"}], "update_date": "2019-05-07", "authors_parsed": [["Sharma", "Nikhilesh", ""], ["Mastronarde", "Nicholas", ""], ["Chakareski", "Jacob", ""]]}, {"id": "1807.08412", "submitter": "Jiangtian Nie", "authors": "Jiangtian Nie and Jun Luo and Zehui Xiong and Dusit Niyato and Ping\n  Wang", "title": "A Stackelberg Game Approach Towards Socially-Aware Incentive Mechanisms\n  for Mobile Crowdsensing (Online report)", "comments": "Submitted for possible journal publication. arXiv admin note: text\n  overlap with arXiv:1711.01050", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile crowdsensing has shown a great potential to address large-scale data\nsensing problems by allocating sensing tasks to pervasive mobile users. The\nmobile users will participate in a crowdsensing platform if they can receive\nsatisfactory reward. In this paper, to effectively and efficiently recruit\nsufficient number of mobile users, i.e., participants, we investigate an\noptimal incentive mechanism of a crowdsensing service provider. We apply a\ntwo-stage Stackelberg game to analyze the participation level of the mobile\nusers and the optimal incentive mechanism of the crowdsensing service provider\nusing backward induction. In order to motivate the participants, the incentive\nis designed by taking into account the social network effects from the\nunderlying mobile social domain. For example, in a crowdsensing-based road\ntraffic information sharing application, a user can get a better and accurate\ntraffic report if more users join and share their road information. We derive\nthe analytical expressions for the discriminatory incentive as well as the\nuniform incentive mechanisms. To fit into practical scenarios, we further\nformulate a Bayesian Stackelberg game with incomplete information to analyze\nthe interaction between the crowdsensing service provider and mobile users,\nwhere the social structure information (the social network effects) is\nuncertain. The existence and uniqueness of the Bayesian Stackelberg equilibrium\nare validated by identifying the best response strategies of the mobile users.\nNumerical results corroborate the fact that the network effects tremendously\nstimulate higher mobile participation level and greater revenue of the\ncrowdsensing service provider. In addition, the social structure information\nhelps the crowdsensing service provider to achieve greater revenue gain.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 03:03:27 GMT"}, {"version": "v2", "created": "Wed, 31 Oct 2018 08:10:30 GMT"}], "update_date": "2018-11-01", "authors_parsed": [["Nie", "Jiangtian", ""], ["Luo", "Jun", ""], ["Xiong", "Zehui", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""]]}, {"id": "1807.08426", "submitter": "Yuli Zhang", "authors": "Yuli Zhang, Yuhua Xu, Alagan Anpalagan, Qihui Wu, Yitao Xu, Youming\n  Sun, Shuo Feng, Yunpeng Luo", "title": "Context-aware Group Buying in Ultra-dense Small Cell Networks: Unity is\n  Strength", "comments": "8 pages, 4 figures, accepted by IEEE Wireless Communications on\n  2018/06/12", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ultra-dense small cell networks (SCNs) have been regarded as a promising\ntechnology to solve the data traffic explosion in future. However, the\ncomplicated relationships among large scale users and cells practically demand\na cooperative grouping mechanism to account for the shortage of resources in\nSCNs. Then, a group buying market mechanism provides a win-win situation and an\neffective resource allocation in the view of economics. With additional\ndecision information being provided, the context awareness enhances and\nimproves the group buying mechanism. In this article, we propose a\nContext-Aware Group Buying (CAGB) mechanism to allocate the resources in\nultra-dense SCNs. The feasibility, necessity, and effectiveness of CAGB are\nanalyzed first. Then, we introduce the group buying mechanism and some common\ncontext awareness. The relationship between context awareness and group buying\nis also analyzed. Some important technologies in SCNs are discussed in the view\nof CAGB, such as load balancing, spectrum management, and cooperative caching.\nThen, the graphical coalition formation games (CFGs) of CAGB are also presented\nto match the complicated network topologies in SCNs. Two CAGB-based use cases\nabout spectrum market and cooperative caching are presented. Finally, future\nresearch issues about context awareness, grouping mechanism, and buying\nmechanism are discussed.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 04:45:07 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Zhang", "Yuli", ""], ["Xu", "Yuhua", ""], ["Anpalagan", "Alagan", ""], ["Wu", "Qihui", ""], ["Xu", "Yitao", ""], ["Sun", "Youming", ""], ["Feng", "Shuo", ""], ["Luo", "Yunpeng", ""]]}, {"id": "1807.08615", "submitter": "Mohamed Selim", "authors": "Mohamed Y. Selim, Ahmad Alsharoa, Ahmed E. Kamal", "title": "Short-term and Long-term Cell Outage Compensation Using UAVs in 5G\n  Networks", "comments": "Globecom 2018 (6 pages, 3 figures, 3 tables, conference)", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of Unmanned Aerial Vehicles (UAVs) has gained interest in wireless\nnetworks for its many uses and advantages such as rapid deployment and\nmulti-purpose functionality. This is why wide deployment of UAVs has the\npotential to be integrated in the upcoming 5G standard. They can be used as\nflying base-stations, which can be deployed in case of ground Base-Stations\n(GBSs) failures. Such failures can be short-term or long-term. Based on the\ntype and duration of the failure, we propose a framework that uses drones or\nhelikites to mitigate GBS failures. Our proposed short-term and long-term cell\noutage compensation framework aims to mitigate the effect of the failure of any\nGBS in 5G networks. Within our framework, outage compensation is done with the\nassistance of sky BSs (UAVs). An optimization problem is formulated to jointly\nminimize communication power of the UAVs and maximize the minimum rates of the\nUsers' Equipment (UEs) affected by the failure. Also, the optimal placement of\nthe UAVs is determined. Simulation results show that the proposed framework\nguarantees the minimum quality of service for each UE in addition to minimizing\nthe UAVs' consumed energy.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2018 21:27:59 GMT"}, {"version": "v2", "created": "Wed, 25 Jul 2018 00:08:21 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Selim", "Mohamed Y.", ""], ["Alsharoa", "Ahmad", ""], ["Kamal", "Ahmed E.", ""]]}, {"id": "1807.08652", "submitter": "Albert Mestres Sugra\\~nes", "authors": "Albert Mestres, Eduard Alarc\\'on, Yusheng Ji, Albert Cabellos-Aparicio", "title": "Understanding the Modeling of Computer Network Delays using Neural\n  Networks", "comments": "7 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent trends in networking are proposing the use of Machine Learning (ML)\ntechniques for the control and operation of the network. In this context, ML\ncan be used as a computer network modeling technique to build models that\nestimate the network performance. Indeed, network modeling is a central\ntechnique to many networking functions, for instance in the field of\noptimization, in which the model is used to search a configuration that\nsatisfies the target policy. In this paper, we aim to provide an answer to the\nfollowing question: Can neural networks accurately model the delay of a\ncomputer network as a function of the input traffic? For this, we assume the\nnetwork as a black-box that has as input a traffic matrix and as output delays.\nThen we train different neural networks models and evaluate its accuracy under\ndifferent fundamental network characteristics: topology, size, traffic\nintensity and routing. With this, we aim to have a better understanding of\ncomputer network modeling with neural nets and ultimately provide practical\nguidelines on how such models need to be trained.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 14:49:45 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Mestres", "Albert", ""], ["Alarcón", "Eduard", ""], ["Ji", "Yusheng", ""], ["Cabellos-Aparicio", "Albert", ""]]}, {"id": "1807.08718", "submitter": "Yueyue Dai", "authors": "Yueyue Dai, Du Xu, Sabita Maharjan, and Yan Zhang", "title": "Joint Offloading and Resource Allocation in Vehicular Edge Computing and\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emergence of computation intensive on-vehicle applications poses a\nsignificant challenge to provide the required computation capacity and maintain\nhigh performance. Vehicular Edge Computing (VEC) is a new computing paradigm\nwith a high potential to improve vehicular services by offloading\ncomputation-intensive tasks to the VEC servers. Nevertheless, as the\ncomputation resource of each VEC server is limited, offloading may not be\nefficient if all vehicles select the same VEC server to offload their tasks. To\naddress this problem, in this paper, we propose offloading with resource\nallocation. We incorporate the communication and computation to derive the task\nprocessing delay. We formulate the problem as a system utility maximization\nproblem, and then develop a low-complexity algorithm to jointly optimize\noffloading decision and resource allocation. Numerical results demonstrate the\nsuperior performance of our Joint Optimization of Selection and Computation\n(JOSC) algorithm compared to state of the art solutions.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 16:57:27 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Dai", "Yueyue", ""], ["Xu", "Du", ""], ["Maharjan", "Sabita", ""], ["Zhang", "Yan", ""]]}, {"id": "1807.08829", "submitter": "Ziyi Wang", "authors": "Ziyi Wang, Yong Cui, and Zeqi Lai", "title": "A First Look at Mobile Intelligence: Architecture, Experimentation and\n  Challenges", "comments": "This paper has been accepted by the IEEE Network in May 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Artificial intelligence (AI) technology makes mobile devices become\nintelligent objects which can learn and act automatically. Although AI will\nbring great opportunities for mobile applications, little work has focused on\nthe architecture and the interaction with the cloud. In this article, we\npresent three existing architectures of mobile intelligence in detail and\nintroduce its broad application prospects. Furthermore, we conduct a series of\nexperiments to evaluate the performance of the prevalent commercial\napplications and intelligent frameworks. Our results show that there is a big\ngap between Quality of Experience (QoE) requirements and the status quo. So\nfar, we have seen only the tip of the iceberg. We pose issues and challenges to\nadvance the area of mobile intelligence and hope to pave the way for the\nforthcoming.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2018 11:29:01 GMT"}], "update_date": "2018-07-25", "authors_parsed": [["Wang", "Ziyi", ""], ["Cui", "Yong", ""], ["Lai", "Zeqi", ""]]}, {"id": "1807.08866", "submitter": "Beakal Gizachew Assefa Mr", "authors": "Beakal Gizachew Assefa and \\\"Oznur \\\"Ozkasap", "title": "A Survey of Energy Efficiency in SDN Software Based Methods and\n  Optimization Models", "comments": "17 double column pages, 3 figures, 6 tables", "journal-ref": "Journal of Network and Computer Applications 2019", "doi": "10.1016/j.jnca.2019.04.001", "report-no": "137", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Software Defined Networking (SDN) paradigm has the benefits of programmable\nnetwork elements by separating the control and the forwarding planes,\nefficiency through optimized routing and flexibility in network management. As\nthe energy costs contribute largely to the overall costs in networks, energy\nefficiency has become a significant design requirement for modern networking\nmechanisms. However, designing energy efficient solutions is non-trivial since\nthey need to tackle the trade-off between energy efficiency and network\nperformance. In this article, we address the energy efficiency capabilities\nthat can be utilized in the emerging SDN. We provide a comprehensive and novel\nclassification of software-based energy efficient solutions into subcategories\nof traffic aware, end system aware and rule placement. We propose general\noptimization models for each subcategory, and present the objective function,\nthe parameters and constraints to be considered in each model. Detailed\ninformation on the characteristics of state-of-the-art methods, their\nadvantages, drawbacks are provided. Hardware-based solutions used to enhance\nthe efficiency of switches are also described. Furthermore, we discuss the open\nissues and future research directions in the area of energy efficiency in SDN.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2018 00:47:14 GMT"}, {"version": "v2", "created": "Tue, 30 Jul 2019 12:19:45 GMT"}], "update_date": "2019-07-31", "authors_parsed": [["Assefa", "Beakal Gizachew", ""], ["Özkasap", "Öznur", ""]]}, {"id": "1807.08870", "submitter": "Jeferson Santiago da Silva", "authors": "Jeferson Santiago da Silva, Thibaut Stimpfling, Thomas Luinaud, Bachir\n  Fradj and Bochra Boughzala", "title": "One for All, All for One: A Heterogeneous Data Plane for Flexible P4\n  Processing", "comments": "Poster accepted for publication at the 1st P4 European Workshop\n  (P4EU), Cambridge, UK, September 24, 2018", "journal-ref": null, "doi": "10.1109/ICNP.2018.00063", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The P4 community has recently put significant effort to increase the\ndiversity of targets on which P4 programs can be implemented. These include\nfixed function and programmable ASICs, FPGAs, NICs, and CPUs. However, P4\nprograms are written according to the set of functionalities supported by the\ntarget for which they are compiled. For instance, a P4 program targeting a\nprogrammable ASIC cannot be extended with user-defined processing modules,\nwhich limits the flexibility and the abstraction of P4 programs.\n  To address these shortcomings, we propose a heterogeneous P4 programmable\ndata plane comprised of different targets that together appear as a single\nlogical unit. The proposed data plane broadens the range of functionalities\navailable to P4 programmers by combining the strength of each target. We\ndemonstrate the feasibility of the proposed P4 data plane by coupling an FPGA\nwith a soft switch which emulates a programmable ASIC. The proposed data plane\nis demonstrated with the implementation of a simplified L2 switch. The emulated\nASIC match-table capacity is extended by the FPGA by an order of magnitude.The\nFPGA also integrates a proprietary module using a P4 extern.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2018 01:03:45 GMT"}], "update_date": "2019-03-11", "authors_parsed": [["da Silva", "Jeferson Santiago", ""], ["Stimpfling", "Thibaut", ""], ["Luinaud", "Thomas", ""], ["Fradj", "Bachir", ""], ["Boughzala", "Bochra", ""]]}, {"id": "1807.09221", "submitter": "Ovidiu Banias", "authors": "Daniel-Ioan Curiac, Ovidiu Banias, Ioan Borza", "title": "Structural health monitoring with distributed wireless sensor networks", "comments": null, "journal-ref": "Instalatii pentru constructii si mediul ambiental, 2006", "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Sensor Networks(WSN) are a today technology with great\npracticability in the real world. We focus on describing WSN architecture,\nregarding usefulness in constructions like structural health monitoring and\nimportance, and advantages of using WSN in this domain\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 08:24:47 GMT"}], "update_date": "2018-08-06", "authors_parsed": [["Curiac", "Daniel-Ioan", ""], ["Banias", "Ovidiu", ""], ["Borza", "Ioan", ""]]}, {"id": "1807.09222", "submitter": "Ovidiu Banias", "authors": "Ovidiu Banias, Daniel-Ioan Curiac and Radu-Emil Precup", "title": "Sensor Networks Architecture for Vehicles and Pedestrians Traffic\n  Control", "comments": null, "journal-ref": "Scientific Bulletin of The Politehnica University of Timisoara,\n  Romania, Transactions on Automatic Control and Computer Science, vol. 51, no.\n  3, pp. 11-16, 2006", "doi": null, "report-no": null, "categories": "eess.SP cs.NI cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a sensor network based architecture for urban\ntraffic management, hierarchically structured on three layers: sensing,\nprocessing& aggregation and control. On proposed architecture we define traffic\ndecongestion methods for vehicles and also for pedestrians. Finally, we\npresented a case study on how traffic control can be implemented in a concrete\nsituation, based on the proposed architecture, pointing future directions of\ndevelopment.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2018 08:07:41 GMT"}], "update_date": "2018-08-06", "authors_parsed": [["Banias", "Ovidiu", ""], ["Curiac", "Daniel-Ioan", ""], ["Precup", "Radu-Emil", ""]]}, {"id": "1807.09325", "submitter": "Indrajit Saha", "authors": "Veeraruna Kavitha, Eitan Altman and Indrajit Saha", "title": "Controlling Packet Drops to Improve Freshness of information", "comments": "12 pages and 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many systems require frequent and regular updates of a certain information.\nThese updates have to be transferred regularly from the source to the\ndestination. We consider scenarios in which an old packet becomes completely\nobsolete, in the presence of a new packet. In this context, if a new packet\narrives at the source while it is transferring a packet, one needs to decide\nthe packet to be dropped. New packet has recent information, but might require\nmore time to transfer. Thus it is not clear as to which packet to be dis-\ncarded, and this is the main focus of the paper. Recently introduced\nperformance metrics, called average age of information (AAoI) and peak age of\ninformation (PAoI) of the information available at the destination, are the\nrelevant performance measures. These type of systems do not require storage\nbuffers, of size more than one, at the source queue. We consider single source\n/ multiple sources regularly updating information to a single destination\npossibly over wireless channels to derive optimal drop policies that optimize\nthe AAoI. We showed that the state independent (static) policies like dropping\nalways the old packets or dropping always the new packets is optimal in many\nscenarios, among an appropriate set of stationary Markov policies. We consider\nrelevant games when multiple sources compete. In many scenarios, the\nnon-cooperative solution almost minimizes the social objective, the sum of\nAAoIs of all the sources.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jul 2018 19:23:39 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Kavitha", "Veeraruna", ""], ["Altman", "Eitan", ""], ["Saha", "Indrajit", ""]]}, {"id": "1807.09332", "submitter": "Xianfu Chen", "authors": "Xianfu Chen and Pei Liu and Hang Liu and Celimuge Wu and Yusheng Ji", "title": "Multipath Transmission Scheduling in Millimeter Wave Cloud Radio Access\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Millimeter wave (mmWave) communications provide great potential for\nnext-generation cellular networks to meet the demands of fast-growing mobile\ndata traffic with plentiful spectrum available. However, in a mmWave cellular\nsystem, the shadowing and blockage effects lead to the intermittent\nconnectivity, and the handovers are more frequent. This paper investigates an\n``all-mmWave'' cloud radio access network (cloud-RAN), in which both the\nfronthaul and the radio access links operate at mmWave. To address the\nintermittent transmissions, we allow the mobile users (MUs) to establish\nmultiple connections to the central unit over the remote radio heads (RRHs).\nSpecifically, we propose a multipath transmission framework by leveraging the\n``all-mmWave'' cloud-RAN architecture, which makes decisions of the RRH\nassociation and the packet transmission scheduling according to the\ntime-varying network statistics, such that a MU experiences the minimum\nqueueing delay and packet drops. The joint RRH association and transmission\nscheduling problem is formulated as a Markov decision process (MDP). Due to the\nproblem size, a low-complexity online learning scheme is put forward, which\nrequires no a priori statistic information of network dynamics. Simulations\nshow that our proposed scheme outperforms the state-of-art baselines, in terms\nof average queue length and average packet dropping rate.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2018 06:53:49 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Chen", "Xianfu", ""], ["Liu", "Pei", ""], ["Liu", "Hang", ""], ["Wu", "Celimuge", ""], ["Ji", "Yusheng", ""]]}, {"id": "1807.09333", "submitter": "Amin Azari", "authors": "Amin Azari, Cicek Cavdar", "title": "Self-organized Low-power IoT Networks: A Distributed Learning Approach", "comments": "IEEE Globecom 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Enabling large-scale energy-efficient Internet-of-things (IoT) connectivity\nis an essential step towards realization of networked society. While legacy\nwide-area wireless systems are highly dependent on network-side coordination,\nthe level of consumed energy in signaling, as well as the expected increase in\nthe number of IoT devices, makes such centralized approaches infeasible in\nfuture. Here, we address this problem by self-coordination for IoT networks\nthrough learning from past communications. To this end, we first study\nlow-complexity distributed learning approaches applicable in IoT\ncommunications. Then, we present a learning solution to adapt communication\nparameters of devices to the environment for maximizing energy efficiency and\nreliability in data transmissions. Furthermore, leveraging tools from\nstochastic geometry, we evaluate the performance of proposed distributed\nlearning solution against the centralized coordination. Finally, we analyze the\ninterplay amongst energy efficiency, reliability of communications against\nnoise and interference over data channel, and reliability against adversarial\ninterference over data and feedback channels. The simulation results indicate\nthat compared to the state of the art approaches, both energy efficiency and\nreliability in IoT communications could be significantly improved using the\nproposed learning approach. These promising results, which are achieved using\nlightweight learning, make our solution favorable in many low-cost low-power\nIoT applications.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jul 2018 17:42:49 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Azari", "Amin", ""], ["Cavdar", "Cicek", ""]]}, {"id": "1807.09338", "submitter": "Vuk Marojevic", "authors": "Vuk Marojevic", "title": "C-V2X Security Requirements and Procedures: Survey and Research\n  Directions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 3rd Generation Partnership Project (3GPP) defines the first\nspecifications for cellular-based vehicle-to-everything (C-V2X) communications\nin Release 14. C-V2X extends LTE's device-to-device communication modes by\nadding two new modes of operation for vehicular systems in coverage and out of\ncoverage of an LTE base station, or eNB. The vehicle-to-vehicle (V2V)\ncommunication mode does not rely on the cellular infrastructure and the C-V2X\ndevices employ a distributed and sensing-based semi-persistent scheduling to\nschedule their packet transmissions. As a promising alternative to dedicated\nshort range communications, the security aspects of C-V2X need to be carefully\ndesigned and evaluated to ensure the availability and integrity of the service\nand data. This paper discusses possible threat scenarios, reviews the 3GPP\nspecifications and finds that, despite the safety-critical nature of C-V2X,\nonly few mechanisms and procedures have be specified to secure the system. We\ndiscuss emerging technologies and provide research directions to improve C-V2X\nsystem security and reliability and ensure their widespread adoption in\ncivilian and mission-critical communication contexts.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2018 20:31:03 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Marojevic", "Vuk", ""]]}, {"id": "1807.09339", "submitter": "Anna Philippou", "authors": "Panagiotis Kouvaros, Dimitris Kouzapas, Anna Philippou, Julius\n  Georgiou, Loukas Petrou, and Andreas Pitsillides", "title": "Formal Verification of a Programmable Hypersurface", "comments": "13 pages. The paper has been accepted at FMICS 2018 and will be\n  published by Springer", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A metasurface is a surface that consists of artificial material, called\nmetamaterial, with configurable electromagnetic properties. This paper presents\nwork in progress on the design and formal verification of a programmable\nmetasurface, the Hypersurface, as part of the requirements of the VISORSURF\nresearch program (HORIZON 2020 FET-OPEN). The Hypersurface design is concerned\nwith the development of a network of switch controllers that are responsible\nfor configuring the metamaterial. The design of the Hypersurface, however, has\ndemanding requirements that need to be delivered within a context of limited\nresources. This paper shares the experience of a rigorous design procedure for\nthe Hypersurface network, that involves iterations between designing a network\nand its protocols and the formal evaluation of each design. Formal evaluation\nhas provided results that, so far, drive the development team in a more robust\ndesign and overall aid in reducing the cost of the Hypersurface manufacturing.\nThis paper presents work in progress on the design and formal verification of a\nprogrammable Hypersurface as part of the requirements of the VISORSURF research\nprogramme (HORIZON 2020 FET-OPEN).\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2018 06:53:15 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Kouvaros", "Panagiotis", ""], ["Kouzapas", "Dimitris", ""], ["Philippou", "Anna", ""], ["Georgiou", "Julius", ""], ["Petrou", "Loukas", ""], ["Pitsillides", "Andreas", ""]]}, {"id": "1807.09343", "submitter": "Jin-Hee Cho Dr.", "authors": "Dilli P. Sharma, Dong Seong Kim, Seunghyun Yoon, Hyuk Lim, Jin-Hee\n  Cho, Terrence J. Moore", "title": "FRVM: Flexible Random Virtual IP Multiplexing in Software-Defined\n  Networks", "comments": null, "journal-ref": "IEEE TrustCom 2018", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network address shuffling is one of moving target defense (MTD) techniques\nthat can invalidate the address information attackers have collected based on\nthe current network IP configuration. We propose a software-defined\nnetworking-based MTD technique called Flexible Random Virtual IP Multiplexing,\nnamely FRVM, which aims to defend against network reconnaissance and scanning\nattacks. FRVM enables a host machine to have multiple, random, time-varying\nvirtual IP addresses, which are multiplexed to a real IP address of the host.\nMultiplexing or de-multiplexing event dynamically remaps all the virtual\nnetwork addresses of the hosts. Therefore, at the end of a multiplexing event,\nFRVM aims to make the attackers lose any knowledge gained through the\nreconnaissance and to disturb their scanning strategy. In this work, we analyze\nand evaluate our proposed FRVM in terms of the attack success probability under\nscanning attacks and target host discovery attacks.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jul 2018 20:14:24 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Sharma", "Dilli P.", ""], ["Kim", "Dong Seong", ""], ["Yoon", "Seunghyun", ""], ["Lim", "Hyuk", ""], ["Cho", "Jin-Hee", ""], ["Moore", "Terrence J.", ""]]}, {"id": "1807.09350", "submitter": "Xianfu Chen", "authors": "Xianfu Chen and Zhifeng Zhao and Celimuge Wu and Mehdi Bennis and Hang\n  Liu and Yusheng Ji and Honggang Zhang", "title": "Multi-Tenant Cross-Slice Resource Orchestration: A Deep Reinforcement\n  Learning Approach", "comments": "Accepted to IEEE JSAC, May 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  With the cellular networks becoming increasingly agile, a major challenge\nlies in how to support diverse services for mobile users (MUs) over a common\nphysical network infrastructure. Network slicing is a promising solution to\ntailor the network to match such service requests. This paper considers a\nsystem with radio access network (RAN)-only slicing, where the physical\ninfrastructure is split into slices providing computation and communication\nfunctionalities. A limited number of channels are auctioned across scheduling\nslots to MUs of multiple service providers (SPs) (i.e., the tenants). Each SP\nbehaves selfishly to maximize the expected long-term payoff from the\ncompetition with other SPs for the orchestration of channels, which provides\nits MUs with the opportunities to access the computation and communication\nslices. This problem is modelled as a stochastic game, in which the decision\nmakings of a SP depend on the global network dynamics as well as the joint\ncontrol policy of all SPs. To approximate the Nash equilibrium solutions, we\nfirst construct an abstract stochastic game with the local conjectures of\nchannel auction among the SPs. We then linearly decompose the per-SP Markov\ndecision process to simplify the decision makings at a SP and derive an online\nscheme based on deep reinforcement learning to approach the optimal abstract\ncontrol policies. Numerical experiments show significant performance gains from\nour scheme.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2018 11:26:49 GMT"}, {"version": "v2", "created": "Mon, 3 Jun 2019 08:05:32 GMT"}], "update_date": "2019-06-05", "authors_parsed": [["Chen", "Xianfu", ""], ["Zhao", "Zhifeng", ""], ["Wu", "Celimuge", ""], ["Bennis", "Mehdi", ""], ["Liu", "Hang", ""], ["Ji", "Yusheng", ""], ["Zhang", "Honggang", ""]]}, {"id": "1807.09464", "submitter": "Colas Le Guernic", "authors": "Julien Duchene (CALID, LAAS-TSF), Eric Alata (LAAS-TSF), Vincent\n  Nicomette (LAAS-TSF), Mohamed Ka\\^aniche (LAAS-TSF), Colas Le Guernic\n  (DGA.MI, TAMIS)", "title": "Specification-Based Protocol Obfuscation", "comments": null, "journal-ref": "2018 48th Annual IEEE/IFIP International Conference on Dependable\n  Systems and Networks (DSN), Jun 2018, Luxembourg City, France. IEEE, 2018", "doi": "10.1109/DSN.2018.00056", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new obfuscation technique of a communication protocol\nthat is aimed at making the reverse engineering of the protocol more complex.\nThe obfuscation is based on the transformation of protocol message format\nspecification. The obfuscating transformations are applied to the Abstract\nSyntax Tree (AST) representation of the messages and mainly concern the\nordering or aggregation of the AST nodes. The paper also presents the design of\na framework that implements the proposed obfuscation technique by automatically\ngenerating, from the specification of the message format, a library performing\nthe corresponding transformations. Finally, our framework is applied to two\nreal application protocols (Modbus and HTTP) to illustrate the relevance and\nefficiency of the proposed approach. Various metrics recorded from the\nexperiments show the significant increase of the complexity of the obfuscated\nprotocol binary compared to the non-obfuscated code. It is also shown that the\nexecution time and memory overheads remain acceptable for a practical\ndeployment of the approach in operation.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2018 07:49:25 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Duchene", "Julien", "", "CALID, LAAS-TSF"], ["Alata", "Eric", "", "LAAS-TSF"], ["Nicomette", "Vincent", "", "LAAS-TSF"], ["Kaâniche", "Mohamed", "", "LAAS-TSF"], ["Guernic", "Colas Le", "", "DGA.MI, TAMIS"]]}, {"id": "1807.09614", "submitter": "Ioannis Dimitriou", "authors": "Ioannis Dimitriou", "title": "On the analysis of partially homogeneous nearest-neighbour random walks\n  in the quarter plane", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work deals with the stationary analysis of two-dimensional partially\nhomogeneous nearest-neighbour random walks. Such type of random walks in the\nquarter plane are characterized by the fact that the one-step transition\nprobabilities are functions of the state-space. We show that its stationary\nbehavior is investigated by solving a finite system of linear equations, and a\nfunctional equation with the aid of the theory of Riemann(-Hilbert) boundary\nvalue problems. This work is strongly motivated by emerging applications in\nmultiple access systems as well as in the study of a general class of queueing\nsystems with state dependent parameters. A simple numerical illustration\nproviding useful information about a queue-aware multiple access system is also\npresented.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2018 10:05:10 GMT"}, {"version": "v2", "created": "Thu, 26 Jul 2018 07:06:57 GMT"}, {"version": "v3", "created": "Wed, 10 Jul 2019 10:23:26 GMT"}], "update_date": "2019-07-11", "authors_parsed": [["Dimitriou", "Ioannis", ""]]}, {"id": "1807.09680", "submitter": "Charith Perera", "authors": "Charith Perera", "title": "Rentable Internet of Things Infrastructure for Sensing as a Service\n  (S2aaS)", "comments": null, "journal-ref": "IEEE Internet of Things Newsletter July 2018", "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sensing as a Service (S2aaS) model [1] [2] is inspired by the traditional\nEverything as a service (XaaS) approaches [3]. It aims to better utilize the\nexisting Internet of Things (IoT) infrastructure. S2aaS vision aims to create\n'rentable infrastructure' where interested parties can gather IoT data by\npaying a fee for the infrastructure owners.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jul 2018 16:50:11 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Perera", "Charith", ""]]}, {"id": "1807.09701", "submitter": "Amir Varasteh", "authors": "Farzad Tashtarian, Ahmadreza Montazerolghaem, and Amir Varasteh", "title": "Distributed Lifetime Optimization in Wireless Sensor Networks using\n  Alternating Direction Method of Multipliers", "comments": "Accepted to be publushed in Wiley International Journal of\n  Communication Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the limited energy of sensor nodes in wireless sensor networks,\nextending the networks lifetime is a major challenge that can be formulated as\nan optimization problem. In this paper, we propose a distributed iterative\nalgorithm based on Alternating Direction Method of Multipliers (ADMM) with the\naim of maximizing sensor network lifetime. The features of this algorithm are\nuse of local information, low overhead of message passing, low computational\ncomplexity, fast convergence, and consequently reduced energy consumption. In\nthis study, we present the convergence results and the number of iterations\nrequired to achieve the stopping criterion. Furthermore, the impact of problem\nsize (number of sensor nodes) on the solution and constraints violation is\nstudied and finally, the proposed algorithm is compared to one of the\nwell-known subgradient-based algorithms.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2018 16:29:00 GMT"}, {"version": "v2", "created": "Mon, 30 Jul 2018 16:39:58 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Tashtarian", "Farzad", ""], ["Montazerolghaem", "Ahmadreza", ""], ["Varasteh", "Amir", ""]]}, {"id": "1807.09723", "submitter": "Ali Moin", "authors": "Ali Moin, Arno Thielens, Alvaro Araujo, Alberto\n  Sangiovanni-Vincentelli, Jan M. Rabaey", "title": "Adaptive Body Area Networks Using Kinematics and Biosignals", "comments": "Accepted for publication in IEEE Journal of Biomedical and Health\n  Informatics", "journal-ref": null, "doi": "10.1109/JBHI.2020.3003924", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The increasing penetration of wearable and implantable devices necessitates\nenergy-efficient and robust ways of connecting them to each other and to the\ncloud. However, the wireless channel around the human body poses unique\nchallenges such as a high and variable path-loss caused by frequent changes in\nthe relative node positions as well as the surrounding environment. An adaptive\nwireless body area network (WBAN) scheme is presented that reconfigures the\nnetwork by learning from body kinematics and biosignals. It has very low\noverhead since these signals are already captured by the WBAN sensor nodes to\nsupport their basic functionality. Periodic channel fluctuations in activities\nlike walking can be exploited by reusing accelerometer data and scheduling\npacket transmissions at optimal times. Network states can be predicted based on\nchanges in observed biosignals to reconfigure the network parameters in real\ntime. A realistic body channel emulator that evaluates the path-loss for\neveryday human activities was developed to assess the efficacy of the proposed\ntechniques. Simulation results show up to 41% improvement in packet delivery\nratio (PDR) and up to 27% reduction in power consumption by intelligent\nscheduling at lower transmission power levels. Moreover, experimental results\non a custom test-bed demonstrate an average PDR increase of 20% and 18% when\nusing our adaptive EMG- and heart-rate-based transmission power control\nmethods, respectively. The channel emulator and simulation code is made\npublicly available at https://github.com/a-moin/wban-pathloss.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2018 17:06:04 GMT"}, {"version": "v2", "created": "Thu, 8 Nov 2018 21:53:32 GMT"}, {"version": "v3", "created": "Wed, 24 Jun 2020 08:03:06 GMT"}], "update_date": "2020-06-25", "authors_parsed": [["Moin", "Ali", ""], ["Thielens", "Arno", ""], ["Araujo", "Alvaro", ""], ["Sangiovanni-Vincentelli", "Alberto", ""], ["Rabaey", "Jan M.", ""]]}, {"id": "1807.09749", "submitter": "Michail Fasoulakis", "authors": "Michail Fasoulakis, Apostolos Traganitis, Anthony Ephremides", "title": "Jamming in multiple independent Gaussian channels as a game", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of \\emph{jamming} in multiple independent \\emph{Gaussian\nchannels} as a zero-sum game. We show that in the unique Nash equilibrium of\nthe game the best-response strategy of the transmitter is the\n\\emph{waterfilling} to the sum of the jamming and the noise power in each\nchannel and the best-response strategy of the jammer is the \\emph{waterfilling}\nonly to the noise power.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2018 17:55:06 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Fasoulakis", "Michail", ""], ["Traganitis", "Apostolos", ""], ["Ephremides", "Anthony", ""]]}, {"id": "1807.10051", "submitter": "Katia  Jaffres-Runser", "authors": "Katia Jaffr\\`es-Runser and Gentian Jakllari", "title": "PCach: The Case for Pre-Caching your Mobile Data", "comments": "To appear as a 4p paper in the proceedings of the 43nd IEEE\n  Conference on Local Computer Networks (LCN), Chicago, USA, October 1-4, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We present PCach, a smartphone-based approach for relieving the congestion in\ncellular network resulting from the exponential growth in mobile data traffic.\nThe basic idea underlying PCach is simple: use WiFi to proactively cache\ncontent on the smartphone's memory, which otherwise would have been delivered\nthrough the cellular network. However, it leads to several challenging\nquestions, including how much mobile data actually flows through cellular\nnetworks, how much data can be pre-cached, and when and what to pre-cache. We\naddress these questions progressively using a thorough analysis of user data\ncollected from our purpose-built crowdsensing Android application, actively\nutilized by 45 users for periods dating back to July 2014. Our analysis shows\nthat the median smartphone user transfers 15% of their data via the cellular\nnetwork and that 80\\% of it can be pre-cached via WiFi. To capitalize on these\nresults, we draw on a careful analysis of the measurement data to introduce an\nalgorithm that can run stand-alone on off-the-shelf smartphones and predict\nwith good accuracy when and what to pre-cache.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jul 2018 10:19:04 GMT"}], "update_date": "2018-07-27", "authors_parsed": [["Jaffrès-Runser", "Katia", ""], ["Jakllari", "Gentian", ""]]}, {"id": "1807.10430", "submitter": "Francesco Malandrino", "authors": "K. Antevski, J. Mart\\'in-P\\'erez, Nuria Molner, C. F. Chiasserini, F.\n  Malandrino, P. Frangoudis, A. Ksentini, X. Li, J. SalvatLozano, R.\n  Mart\\'inez, I. Pascual, J. Mangues-Bafalluy, J. Baranda, B. Martini, M.\n  Gharbaoui", "title": "Resource Orchestration of 5G Transport Networks for Vertical Industries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The future 5G transport networks are envisioned to support a variety of\nvertical services through network slicing and efficient orchestration over\nmultiple administrative domains. In this paper, we propose an orchestrator\narchitecture to support vertical services to meet their diverse resource and\nservice requirements. We then present a system model for resource orchestration\nof transport networks as well as low-complexity algorithms that aim at\nminimizing service deployment cost and/or service latency. Importantly, the\nproposed model can work with any level of abstractions exposed by the\nunderlying network or the federated domains depending on their representation\nof resources.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 04:20:12 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Antevski", "K.", ""], ["Martín-Pérez", "J.", ""], ["Molner", "Nuria", ""], ["Chiasserini", "C. F.", ""], ["Malandrino", "F.", ""], ["Frangoudis", "P.", ""], ["Ksentini", "A.", ""], ["Li", "X.", ""], ["SalvatLozano", "J.", ""], ["Martínez", "R.", ""], ["Pascual", "I.", ""], ["Mangues-Bafalluy", "J.", ""], ["Baranda", "J.", ""], ["Martini", "B.", ""], ["Gharbaoui", "M.", ""]]}, {"id": "1807.10461", "submitter": "Nicolas Gastineau", "authors": "Nicolas Gastineau (Le2i), Wahabou Abdou (UBFC), Nader Mbarek (LaBRI),\n  Olivier Togni (Le2i)", "title": "Distributed leader election and computation of local identifiers for\n  programmable matter", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DM cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The context of this paper is programmable matter, which consists of a set of\ncomputational elements, called particles, in an infinite graph. The considered\ninfinite graphs are the square, triangular and king grids. Each particle\noccupies one vertex, can communicate with the adjacent particles, has the same\nclockwise direction and knows the local positions of neighborhood particles.\nUnder these assumptions, we describe a new leader election algorithm affecting\na variable to the particles, called the k-local identifier, in such a way that\nparticles at close distance have each a different k-local identifier. For all\nthe presented algorithms, the particles only need a O(1)-memory space.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 07:20:34 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Gastineau", "Nicolas", "", "Le2i"], ["Abdou", "Wahabou", "", "UBFC"], ["Mbarek", "Nader", "", "LaBRI"], ["Togni", "Olivier", "", "Le2i"]]}, {"id": "1807.10528", "submitter": "Stefano Angieri", "authors": "Stefano Angieri, Alberto Garc\\'ia-Mart\\'inez, Bingyang Liu, Zhiwei\n  Yan, Chuang Wang and Marcelo Bagnulo", "title": "An experiment in distributed Internet address management using\n  blockchains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The current system to manage the global pool of IP addresses is centralized\nin five transnational organizations, the Regional Internet Registries (RIRs).\nEach of these RIRs manage the address pool for a large number of countries.\nBecause the RIRs are private organizations, they are subject to the legal\nframework of the country where they are based. This configuration results in a\njurisdictional overflow from the legal framework of the countries where the RIR\nis based to all the countries that the RIRs are serving (the countries served\nby the RIRs de facto become subjects of the legal system of the country where\nthe RIR is hosted). The situation is aggravated by the deployment of new\nsecurity techniques such as the RPKI and BGPsec, that enable enforcement of\nallocations by the RIRs. In this paper we present InBlock, a blockchain-based\ndistributed governance body aimed to provide de-centralized management of IP\naddresses. InBlock also aims to fulfil the same objectives as the current IP\naddress allocation system, namely, uniqueness, fairness, conservation,\naggregation, registration and minimized overhead. InBlock is implemented as a\nDecentralized Autonomous Organization, i.e., as a set of blockchain's smart\ncontracts in Ethereum. Any entity may request an allocation of addresses to the\nInBlock registry by solely performing a (crypto)currency transfer to the\nInBlock. The fee required, along with the annual renewal fee, serves as a\nmechanism to deter stockpiling and other wasteful practices. As with any novel\ntechnology, there are many open questions about the usage of blockchains to\nbuild an IP address registry. For this reason, we believe that practical\nexperimentation is required in order to have hands-on experiences about such a\nsystem. We propose to conduct an experiment on distributed address management\nusing InBlock as a starting point to inform future directions in this area.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 10:51:15 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Angieri", "Stefano", ""], ["García-Martínez", "Alberto", ""], ["Liu", "Bingyang", ""], ["Yan", "Zhiwei", ""], ["Wang", "Chuang", ""], ["Bagnulo", "Marcelo", ""]]}, {"id": "1807.10617", "submitter": "Pete Pratt", "authors": "Pete Pratt, Carl P. Dettmann and Woon Hau Chin", "title": "Temporal connectivity in finite networks with non-uniform measures", "comments": "13 Pages - 4 figures", "journal-ref": "Phys. Rev. E 98, 052310 (2018)", "doi": "10.1103/PhysRevE.98.052310", "report-no": null, "categories": "cond-mat.dis-nn cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Soft Random Geometric Graphs (SRGGs) have been widely applied to various\nmodels including those of wireless sensor, communication, social and neural\nnetworks. SRGGs are constructed by randomly placing nodes in some space and\nmaking pairwise links probabilistically using a connection function that is\nsystem specific and usually decays with distance. In this paper we focus on the\napplication of SRGGs to wireless communication networks where information is\nrelayed in a multi hop fashion, although the analysis is more general and can\nbe applied elsewhere by using different distributions of nodes and/or\nconnection functions. We adopt a general non-uniform density which can model\nthe stationary distribution of different mobility models, with the interesting\ncase being when the density goes to zero along the boundaries. The global\nconnectivity properties of these non-uniform networks are likely to be\ndetermined by highly isolated nodes, where isolation can be caused by the\nspatial distribution or the local geometry (boundaries). We extend the analysis\nto temporal-spatial networks where we fix the underlying non-uniform\ndistribution of points and the dynamics are caused by the temporal variations\nin the link set, and explore the probability a node near the corner is isolated\nat time $T$. This work allows for insight into how non-uniformity (caused by\nmobility) and boundaries impact the connectivity features of temporal-spatial\nnetworks. We provide a simple method for approximating these probabilities for\na range of different connection functions and verify them against simulations.\nBoundary nodes are numerically shown to dominate the connectivity properties of\nthese finite networks with non-uniform measure.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 13:33:56 GMT"}], "update_date": "2018-12-05", "authors_parsed": [["Pratt", "Pete", ""], ["Dettmann", "Carl P.", ""], ["Chin", "Woon Hau", ""]]}, {"id": "1807.10699", "submitter": "Alessandro Bazzi", "authors": "Alessandro Bazzi, Giammarco Cecchini, Barbara M. Masini, Alberto\n  Zanella", "title": "Study of the Impact of PHY and MAC Parameters in 3GPP C-V2V Mode 4", "comments": null, "journal-ref": "IEEE Access, vol. 6, pp. 71685-71698, 2018", "doi": "10.1109/ACCESS.2018.2883401", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the latest years, 3GPP has added short range cellular-vehicle-to-anything\n(C-V2X) to the features of LTE and 5G in order to make vehicles, roadside\ndevices, and vulnerable users directly exchange information using the same\nchipset as for classical long range connections. C-V2X is based on the use of\nadvanced physical layer techniques and orthogonal resources, and one of the\nmain aspects affecting its performance is the way resources are allocated.\nAllocations can be either managed by the network or in a distributed way,\ndirectly by the nodes. The latter case, called Mode 4, is defined to manage\nthose situations where the network cannot be involved in the scheduling\nprocess, for example due to a lack of coverage, but could also be adopted in\norder to reduce the processing burden of eNodeB. An algorithm, defined in the\nstandards, makes nodes sense the medium and identify the best time-frequency\ncombination to allocate their messages. Focusing on C-V2V Mode 4, in this work\nwe analyze the parameters of the algorithm designed by 3GPP and their impact on\nthe system performance. Through simulations in different large scale scenarios,\nwe show that modifying some parameters have negligible effect, that the proper\nchoice of others can indeed improve the quality of service, and that a group of\nparameters allows to trade-off reliability with update delay. The provided\nresults can also be exploited to guide future work.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 15:49:24 GMT"}, {"version": "v2", "created": "Wed, 28 Nov 2018 21:34:09 GMT"}], "update_date": "2018-12-13", "authors_parsed": [["Bazzi", "Alessandro", ""], ["Cecchini", "Giammarco", ""], ["Masini", "Barbara M.", ""], ["Zanella", "Alberto", ""]]}, {"id": "1807.10736", "submitter": "Gao Zheng", "authors": "Gao Zheng, Anthony Tsiopoulos, Vasilis Friderikos", "title": "Dynamic Placement of VNF Chains for Proactive Caching in Mobile Edge\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Notwithstanding the significant research effort Network Function\nVirtualization (NFV) architectures received over the last few years little\nattention has been placed on optimizing proactive caching when considering it\nas a service chain. Since caching of popular content is envisioned to be one of\nthe key technologies in emerging 5G networks to increase network efficiency and\noverall end user perceived quality of service we explicitly consider in this\npaper the interplay and subsequent optimization of caching based VNF service\nchains. To this end, we detail a novel mathematical programming framework\ntailored to VNF caching chains and detail also a scale-free heuristic to\nprovide competitive solutions for large network instances since the problem\nitself can be seen as a variant of the classical NP-hard Uncapacitated Facility\nLocation (UFL) problem. A wide set of numerical investigations are presented\nfor characterizing the attainable system performance of the proposed schemes.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 17:13:45 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Zheng", "Gao", ""], ["Tsiopoulos", "Anthony", ""], ["Friderikos", "Vasilis", ""]]}, {"id": "1807.10747", "submitter": "Ertan Onur", "authors": "Doganalp Ergenc and Ertan Onur", "title": "CUPSMAN: Control User Plane Separation Based Routing in Ad-hoc Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Separation of user (data) plane from the control plane in networks helps\nscale resources independently, increase the quality of service and facilitate\nautonomy by employing software-defined networking techniques. Clustering\nintroduces hierarchy in ad hoc networks where control functions can be carried\nout by some designated cluster heads. It is also an effective solution to\nhandle challenges due to lack of centralized controllers and infrastructure in\nad-hoc networks. Clustered network topologies gain a significant amount of\nscalability and reliability in comparison to flat topologies. Different roles\nthat nodes have in a clustered network can be effectively used for routing as\nwell. In this paper, we propose a novel plane-separated routing algorithm,\nCluster-based Hybrid Routing Algorithm (CHRA). In CHRA, we take advantage of\nthe hierarchical clustered structure through control and user plane separation\n(CUPS) in mobile ad-hoc networks. In the cluster neighborhood with a particular\nsize, a link-state routing is used to minimize delay, control overhead, and\nalso utilize energy consumption. For facilitating the communication with\ndistant nodes, we form a routing backbone that is responsible for both control\nand data messages. The results show that CHRA outperforms its opponents in\nterms of fair energy consumption and end-to-end delay.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 17:52:58 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Ergenc", "Doganalp", ""], ["Onur", "Ertan", ""]]}, {"id": "1807.11023", "submitter": "Mohammed Ali Al-Garadi Dr", "authors": "Mohammed Ali Al-Garadi, Amr Mohamed, Abdulla Al-Ali, Xiaojiang Du,\n  Mohsen Guizani", "title": "A Survey of Machine and Deep Learning Methods for Internet of Things\n  (IoT) Security", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT) integrates billions of smart devices that can\ncommunicate with one another with minimal human intervention. It is one of the\nfastest developing fields in the history of computing, with an estimated 50\nbillion devices by the end of 2020. On the one hand, IoT play a crucial role in\nenhancing several real-life smart applications that can improve life quality.\nOn the other hand, the crosscutting nature of IoT systems and the\nmultidisciplinary components involved in the deployment of such systems\nintroduced new security challenges. Implementing security measures, such as\nencryption, authentication, access control, network security and application\nsecurity, for IoT devices and their inherent vulnerabilities is ineffective.\nTherefore, existing security methods should be enhanced to secure the IoT\nsystem effectively. Machine learning and deep learning (ML/DL) have advanced\nconsiderably over the last few years, and machine intelligence has transitioned\nfrom laboratory curiosity to practical machinery in several important\napplications. Consequently, ML/DL methods are important in transforming the\nsecurity of IoT systems from merely facilitating secure communication between\ndevices to security-based intelligence systems. The goal of this work is to\nprovide a comprehensive survey of ML /DL methods that can be used to develop\nenhanced security methods for IoT systems. IoT security threats that are\nrelated to inherent or newly introduced threats are presented, and various\npotential IoT system attack surfaces and the possible threats related to each\nsurface are discussed. We then thoroughly review ML/DL methods for IoT security\nand present the opportunities, advantages and shortcomings of each method. We\ndiscuss the opportunities and challenges involved in applying ML/DL to IoT\nsecurity. These opportunities and challenges can serve as potential future\nresearch directions.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jul 2018 08:58:38 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Al-Garadi", "Mohammed Ali", ""], ["Mohamed", "Amr", ""], ["Al-Ali", "Abdulla", ""], ["Du", "Xiaojiang", ""], ["Guizani", "Mohsen", ""]]}, {"id": "1807.11059", "submitter": "Simone Ferlin", "authors": "Simone Ferlin and Stepan Kucera and Holger Claussen and Ozgu Alay", "title": "MPTCP meets FEC: Supporting Latency-Sensitive Applications over\n  Heterogeneous Networks", "comments": "14 pages, 54 figures, IEEE/ACM Transactions on Networking", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past years, TCP has gone through numerous updates to provide\nperformance enhancement under diverse network conditions. However, with respect\nto losses, little can be achieved with legacy TCP detection and recovery\nmechanisms. Both fast retransmission and retransmission timeout take at least\none extra round trip time to perform, and this might significantly impact\nperformance of latency-sensitive applications, especially in lossy or high\ndelay networks. While forward error correction (FEC) is not a new initiative in\nthis direction, the majority of the approaches consider FEC inside the\napplication. In this paper, we design and implement a framework, where FEC is\nintegrated within TCP. Our main goal with this design choice is to enable\nlatency sensitive applications over TCP in high delay and lossy networks, but\nremaining application agnostic. We further incorporate this design into\nmultipath TCP (MPTCP), where we focus particularly on heterogeneous settings,\nconsidering the fact that TCP recovery mechanisms further escalate head-of-line\nblocking in multipath. We evaluate the performance of the proposed framework\nand show that such a framework can bring significant benefits compared to\nlegacy TCP and MPTCP for latency-sensitive real application traffic, such as\nvideo streaming and web services.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jul 2018 13:56:12 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Ferlin", "Simone", ""], ["Kucera", "Stepan", ""], ["Claussen", "Holger", ""], ["Alay", "Ozgu", ""]]}, {"id": "1807.11196", "submitter": "Carla Fabiana Chiasserini", "authors": "Claudio Casetti and Carla Fabiana Chiasserini and Nuria Molner and\n  Jorge Martin-Perez and Thomas Deiss and Cao-Thanh Phan and Farouk Messaoudi\n  and Giada Landi and Juan Brenes Baranzano", "title": "Arbitration Among Vertical Services", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A 5G network provides several service types, tailored to specific needs such\nas high bandwidth or low latency. On top of these communication services,\nverticals are enabled to deploy their own vertical services. These vertical\nservice instances compete for the resources of the underlying common\ninfrastructure. We present a resource arbitration approach that allows to\nhandle such resource conflicts on a high level and to provide guidance to\nlowerlevel orchestration components.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2018 07:09:12 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Casetti", "Claudio", ""], ["Chiasserini", "Carla Fabiana", ""], ["Molner", "Nuria", ""], ["Martin-Perez", "Jorge", ""], ["Deiss", "Thomas", ""], ["Phan", "Cao-Thanh", ""], ["Messaoudi", "Farouk", ""], ["Landi", "Giada", ""], ["Baranzano", "Juan Brenes", ""]]}, {"id": "1807.11253", "submitter": "Sadaf Zuhra Ms", "authors": "Sadaf ul Zuhra, Prasanna Chaporkar, Abhay Karandikar", "title": "Towards Optimal Grouping and Resource Allocation for Multicast Streaming\n  in LTE", "comments": "18 pages, Journal paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multimedia traffic is predicted to account for 82% of the total data traffic\nby the year 2020. With the increasing popularity of video streaming\napplications like YouTube, Netflix, Amazon Prime Video, popular video content\nis often required to be delivered to a large number of users simultaneously.\nMulticast transmission can be used for catering to such applications\nefficiently. The common content can be transmitted to the users on the same\nresources resulting in considerable resource conservation. This paper proposes\nvarious schemes for efficient grouping and resource allocation for multicast\ntransmission in LTE. The optimal grouping and resource allocation problems are\nshown to be NP-hard and so, we propose heuristic algorithms for both these\nproblems. We also formulate a Simulated Annealing based algorithm to\napproximate the optimal resource allocation for our problem. The LP-relaxation\nbased resource allocation proposed by us results in allocations very close to\nthe estimated optimal.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2018 09:37:24 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Zuhra", "Sadaf ul", ""], ["Chaporkar", "Prasanna", ""], ["Karandikar", "Abhay", ""]]}, {"id": "1807.11329", "submitter": "Yu Chen", "authors": "Seyed Yahya Nikouei, Yu Chen, Alexander Aved, Erik Blasch", "title": "EIQIS: Toward an Event-Oriented Indexable and Queryable Intelligent\n  Surveillance System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Edge computing provides the ability to link distributor users for multimedia\ncontent, while retaining the power of significant data storage and access at a\ncentralized computer. Two requirements of significance include: what\ninformation show be processed at the edge and how the content should be stored.\nAnswers to these questions require a combination of query-based search, access,\nand response as well as indexed-based processing, storage, and distribution. A\nmeasure of intelligence is not what is known, but is recalled, hence, future\nedge intelligence must provide recalled information for dynamic response. In\nthis paper, a novel event-oriented indexable and queryable intelligent\nsurveillance (EIQIS) system is introduced leveraging the on-site edge devices\nto collect the information sensed in format of frames and extracts useful\nfeatures to enhance situation awareness. The design principles are discussed\nand a preliminary proof-of-concept prototype is built that validated the\nfeasibility of the proposed idea.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2018 13:04:57 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Nikouei", "Seyed Yahya", ""], ["Chen", "Yu", ""], ["Aved", "Alexander", ""], ["Blasch", "Erik", ""]]}, {"id": "1807.11338", "submitter": "David M\\\"odinger", "authors": "David M\\\"odinger, Henning Kopp, Frank Kargl, Franz J. Hauck", "title": "A Flexible Network Approach to Privacy of Blockchain Transactions", "comments": "6 pages, 2018 IEEE 38th International Conference on Distributed\n  Computing Systems (ICDCS)", "journal-ref": null, "doi": "10.1109/ICDCS.2018.00153", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For preserving privacy, blockchains can be equipped with dedicated mechanisms\nto anonymize participants. However, these mechanism often take only the\nabstraction layer of blockchains into account whereas observations of the\nunderlying network traffic can reveal the originator of a transaction request.\nPrevious solutions either provide topological privacy that can be broken by\nattackers controlling a large number of nodes, or offer strong and\ncryptographic privacy but are inefficient up to practical unusability. Further,\nthere is no flexible way to trade privacy against efficiency to adjust to\npractical needs. We propose a novel approach that combines existing mechanisms\nto have quantifiable and adjustable cryptographic privacy which is further\nimproved by augmented statistical measures that prevent frequent attacks with\nlower resources. This approach achieves flexibility for privacy and efficency\nrequirements of different blockchain use cases.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2018 13:26:14 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Mödinger", "David", ""], ["Kopp", "Henning", ""], ["Kargl", "Frank", ""], ["Hauck", "Franz J.", ""]]}, {"id": "1807.11384", "submitter": "Andreas Weinand", "authors": "Andreas Weinand, Michael Karrenbauer, Hans D. Schotten", "title": "Security Solutions for Local Wireless Networks in Control Applications\n  based on Physical Layer Security", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Design of new wireless communication systems for industrial applications,\ne.g. control applications, is currently a hot research topic, as they deal as a\nkey enabler for more flexible solutions at a lower cost compared to systems\nbased on wired communication. However, one of their main drawbacks is, that\nthey provide a huge potential for miscellaneous cyber attacks due to the open\nnature of the wireless channel in combination with the huge economic potential\nthey are able to provide. Therefore, security measures need to be taken into\naccount for the design of such systems. Within this work, an approach for the\nsecurity architecture of local wireless systems with respect to the needs of\ncontrol applications is presented and discussed. Further, new security\nsolutions based on Physical Layer Security are introduced in order to overcome\nthe drawbacks of state of the art security technologies within that scope.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2018 15:01:59 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Weinand", "Andreas", ""], ["Karrenbauer", "Michael", ""], ["Schotten", "Hans D.", ""]]}, {"id": "1807.11607", "submitter": "Wolfgang Fink", "authors": "Tzyy-Juin Kao and Wolfgang Fink", "title": "Pareto-Optimization Framework for Automated Network-on-Chip Design", "comments": "25 pages (1.5 line spacing), 8 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.DC cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the advent of multi-core processors, network-on-chip design has been key\nin addressing network performances, such as bandwidth, power consumption, and\ncommunication delays when dealing with on-chip communication between the\nincreasing number of processor cores. As the numbers of cores increase, network\ndesign becomes more complex. Therefore, there is a critical need in soliciting\ncomputer aid in determining network configurations that afford optimal\nperformance given resources and design constraints. We propose a\nPareto-optimization framework that explores the space of possible network\nconfigurations to determine optimal network latencies, power consumption, and\nthe corresponding link allocations. For a given number of routers, average\nnetwork latency and power consumption as example performance objectives can be\ndisplayed in form of Pareto-optimal fronts, thus not only offering a design\ntool, but also enabling trade-off studies.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2018 23:22:46 GMT"}], "update_date": "2018-08-01", "authors_parsed": [["Kao", "Tzyy-Juin", ""], ["Fink", "Wolfgang", ""]]}, {"id": "1807.11621", "submitter": "Saeed Vahidian", "authors": "Saeed Vahidian, Sajad Hatamnia, and Benoit Champagne", "title": "On the Security Analysis of a Cooperative Incremental Relaying Protocol\n  in the Presence of an Active Eavesdropper", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Physical layer security offers an efficient means to decrease the risk of\nconfidential information leakage through wiretap links. In this paper, we\naddress the physical-layer security in a cooperative wireless subnetwork that\nincludes a source-destination pair and multiple relays, exchanging information\nin the presence of a malevolent eavesdropper. Specifically, the eavesdropper is\nactive in the network and transmits artificial noise (AN) with a\nmultiple-antenna transmitter to confound both the relays and the destination.\nWe first analyse the secrecy capacity of the direct source-to-destination\ntransmission in terms of intercept probability (IP) and secrecy outage\nprobability (SOP). A decode-and-forward incremental relaying (IR) protocol is\nthen introduced to improve reliability and security of communications in the\npresence of the active eavesdropper. Within this context, and depending on the\navailability of channel state information, three different schemes (one optimal\nand two sub-optimal) are proposed to select a trusted relay to improve the\nachievable secrecy rate. For each one of these schemes, and for both selection\nand maximum ratio combining at the destination and eavesdropper, we derive new\nand exact closed-form expressions for the IP and SOP. Our analysis and\nsimulation results demonstrate the superior performance of the proposed\nIR-based selection schemes for secure communication. They also confirm the\nexistence of a floor phenomenon for the SOP in the absence of AN.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2018 01:12:00 GMT"}, {"version": "v2", "created": "Mon, 14 Oct 2019 22:49:13 GMT"}], "update_date": "2019-10-21", "authors_parsed": [["Vahidian", "Saeed", ""], ["Hatamnia", "Sajad", ""], ["Champagne", "Benoit", ""]]}, {"id": "1807.11623", "submitter": "Zohreh Ovaisi", "authors": "Zohreh Ovaisi, Natasha Devroye, Hulya Seferoglu, Besma Smida, Daniela\n  Tuninetti", "title": "On Erasure Broadcast Channels with Hard Deadlines", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers packet scheduling over a broadcast channel with packet\nerasures to multiple receivers with different messages (multiple uni-cast) each\nwith possibly different hard deadline constraints. A novel metric is proposed\nand evaluated: the global deadline outage probability, which gives the\nprobability that the hard communication deadline is not met for at least one of\nthe receivers. The cut-set upper bound is derived and a scheduling policy is\nproposed to determine which receiver's packets should be sent in each time\nslot. This policy is shown to be optimal among all scheduling policies, i.e.,\nit achieves all boundary points of cut-set upper bounds when the transmitter\nknows the erasure patterns for all the receivers ahead of making the scheduling\ndecision. An expression for the global deadline outage probability is obtained\nfor two receivers and is plotted and interpreted for various system parameters.\nThese plots are not Monte-Carlo simulations, and hence the obtained expression\nmay be used in the design of future downlink broadcast networks. Future\nextensions to per-user deadline outage probabilities as well as to scenarios\nwith causal knowledge of the channel states are briefly discussed.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2018 01:26:05 GMT"}], "update_date": "2018-08-01", "authors_parsed": [["Ovaisi", "Zohreh", ""], ["Devroye", "Natasha", ""], ["Seferoglu", "Hulya", ""], ["Smida", "Besma", ""], ["Tuninetti", "Daniela", ""]]}, {"id": "1807.11861", "submitter": "Michael Eiselt", "authors": "Michael Eiselt, Annika Dochhan, Joerg-Peter Elbers", "title": "Data Center Interconnects at 400G and Beyond", "comments": "This project has received funding from the European Union Horizon\n  2020 research and innovation programme under grant agreement No 762055\n  (BlueSpace project) and from the German ministry of education and research\n  (BMBF) under contract 16KIS0477K (SENDATE Secure-DCI project)", "journal-ref": null, "doi": "10.1109/OECC.2018.8730011", "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current trends in Data Center Interconnectivity are considered in the light\nof increasing traffic and under the constraint of limited cost and power\nconsumption.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2018 15:12:39 GMT"}], "update_date": "2019-08-29", "authors_parsed": [["Eiselt", "Michael", ""], ["Dochhan", "Annika", ""], ["Elbers", "Joerg-Peter", ""]]}, {"id": "1807.11915", "submitter": "Adnan Aijaz", "authors": "Adnan Aijaz, Zaher Dawy, Nikolaos Pappas, Meryem Simsek, Sharief\n  Oteafy, Oliver Holland", "title": "Toward a Tactile Internet Reference Architecture: Vision and Progress of\n  the IEEE P1918.1 Standard", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The term Tactile Internet broadly refers to a communication network which is\ncapable of delivering control, touch, and sensing/actuation information in\nreal-time. The Tactile Internet is currently a topic of interest for various\nstandardization bodies. The emerging IEEE P1918.1 standards working group is\nfocusing on defining a framework for the Tactile Internet. The main objective\nof this article is to present a reference architecture for the Tactile Internet\nbased on the latest developments within the IEEE P1918.1 standard. The article\nprovides an in-depth treatment of various architectural aspects including the\nkey entities, the interfaces, the functional capabilities and the protocol\nstack. A case study has been presented as a manifestation of the architecture.\nPerformance evaluation demonstrates the impact of functional capabilities and\nthe underlying enablers on user-level utility pertaining to a generic Tactile\nInternet application.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2018 16:50:50 GMT"}], "update_date": "2018-08-01", "authors_parsed": [["Aijaz", "Adnan", ""], ["Dawy", "Zaher", ""], ["Pappas", "Nikolaos", ""], ["Simsek", "Meryem", ""], ["Oteafy", "Sharief", ""], ["Holland", "Oliver", ""]]}]