[{"id": "1001.0418", "submitter": "Vedran Kordic", "authors": "Junia Coutinho Anacleto and Aparecido Fabiano Pinatti de Carvalho", "title": "Improving Human-Computer Interaction by Developing Culture-sensitive\n  Applications based on Common Sense Knowledge", "comments": "Book: Human-Computer Interaction, New Developments The whole book can\n  be downloaded from http://www.sciyo.com", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The advent of Web 3.0, claiming for personalization in interactive systems\n(Lassila & Hendler, 2007), and the need for systems capable of interacting in a\nmore natural way in the future society flooded with computer systems and\ndevices (Harper et al., 2008) show that great advances in HCI should be done.\nThis chapter presents some contributions of LIA for the future of HCI,\ndefending that using common sense knowledge is a possibility for improving HCI,\nespecially because people assign meaning to their messages based on their\ncommon sense and, therefore, the use of this knowledge in developing user\ninterfaces can make them more intuitive to the end-user. Moreover, as common\nsense knowledge varies from group to group of people, it can be used for\ndeveloping applications capable of giving different feedback for different\ntarget groups, as the applications presented along this chapter illustrate,\nallowing, in this way, interface personalization taking into account cultural\nissues. For the purpose of using common sense knowledge in the development and\ndesign of computer systems, it is necessary to provide an architecture that\nallows it. This chapter presents LIAs approaches for common sense knowledge\nacquisition, representation and use, as well as for natural language\nprocessing, contributing with those ones who intent to get into this\nchallenging world to get started.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jan 2010 23:25:13 GMT"}], "update_date": "2010-01-05", "authors_parsed": [["Anacleto", "Junia Coutinho", ""], ["de Carvalho", "Aparecido Fabiano Pinatti", ""]]}, {"id": "1001.0420", "submitter": "Vedran Kordic", "authors": "Kikuo Asai", "title": "The Role of Head-Up Display in Computer- Assisted Instruction", "comments": "www.sciyo.com", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We investigated the role of HUDs in CAI. HUDs have been used in various\nsituations in daily lives by recent downsizing and cost down of the display\ndevices. CAI is one of the promising applications for HUDs. We have developed\nan HUD-based CAI system for effectively presenting instructions of the\nequipment in the transportable earth station. This chapter described HUDs in\nCAI from a viewpoint of human-computer interaction based on the development\nexperience.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jan 2010 23:42:53 GMT"}], "update_date": "2010-01-05", "authors_parsed": [["Asai", "Kikuo", ""]]}, {"id": "1001.0627", "submitter": "John Horton", "authors": "John Horton, Lydia Chilton", "title": "The Labor Economics of Paid Crowdsourcing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crowdsourcing is a form of \"peer production\" in which work traditionally\nperformed by an employee is outsourced to an \"undefined, generally large group\nof people in the form of an open call.\" We present a model of workers supplying\nlabor to paid crowdsourcing projects. We also introduce a novel method for\nestimating a worker's reservation wage--the smallest wage a worker is willing\nto accept for a task and the key parameter in our labor supply model. It shows\nthat the reservation wages of a sample of workers from Amazon's Mechanical Turk\n(AMT) are approximately log normally distributed, with a median wage of\n$1.38/hour. At the median wage, the point elasticity of extensive labor supply\nis 0.43. We discuss how to use our calibrated model to make predictions in\napplied work. Two experimental tests of the model show that many workers\nrespond rationally to offered incentives. However, a non-trivial fraction of\nsubjects appear to set earnings targets. These \"target earners\" consider not\njust the offered wage--which is what the rational model predicts--but also\ntheir proximity to earnings goals. Interestingly, a number of workers clearly\nprefer earning total amounts evenly divisible by 5, presumably because these\namounts make good targets.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jan 2010 20:55:50 GMT"}], "update_date": "2010-04-19", "authors_parsed": [["Horton", "John", ""], ["Chilton", "Lydia", ""]]}, {"id": "1001.0642", "submitter": "Bertrand David", "authors": "Bertrand David (LIESP), Chuantao Yin (LIESP), Ren\\'e Chalon (LIESP)", "title": "Contextual Mobile Learning Strongly Related to Industrial Activities:\n  Principles and Case Study", "comments": null, "journal-ref": "iJAC Journal, International Jouranl of Advanced Corporate Learning\n  2, 3 (2009) 12-20", "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  M-learning (mobile learning) can take various forms. We are interested in\ncontextualized M-learning, i.e. the training related to the situation\nphysically or logically localized. Contextualization and pervasivity are\nimportant aspects of our approach. We propose in particular MOCOCO principles\n(Mobility - COntextualisation - COoperation) using IMERA platform (Mobile\nInteraction in the Augmented Real Environment). We are studying various mobile\nlearning contexts related to professional activities, in order to master\nappliances (Installation, Use, Breakdown diagnostic and Repairing).\nContextualization, traceability and checking of execution of prescribed\noperations are based mainly on the use of RFID labels. Investigation of the\nappropriate training methods for this kind of learning situation, applying\nmainly a constructivist approach known as \"Just-in-time learning\", \"learning by\ndoing\", \"learning and doing\", constitutes an important topic of this project.\n  From an organizational point of view we are in perfect symbiosis with EPSS -\nElectronic Performance Support System [12] and our objective is to integrate\nlearning in professional activities in three ways: 1/ before work i.e. to learn\nabout coming actions, 2/ after work i.e. to learn about past actions to\nunderstand what happened and accumulate experience, 3/ during work i.e. to\nmaster the problem just-in-time\n", "versions": [{"version": "v1", "created": "Tue, 5 Jan 2010 07:32:01 GMT"}], "update_date": "2010-01-06", "authors_parsed": [["David", "Bertrand", "", "LIESP"], ["Yin", "Chuantao", "", "LIESP"], ["Chalon", "René", "", "LIESP"]]}, {"id": "1001.1172", "submitter": "John Horton", "authors": "John Horton", "title": "The Condition of the Turking Class: Are Online Employers Fair and\n  Honest?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online labor markets give people in poor countries direct access to buyers in\nrich countries. Economic theory and empirical evidence strongly suggest that\nthis kind of access improves human welfare. However, critics claim that abuses\nare endemic in these markets and that employers exploit unprotected, vulnerable\nworkers. I investigate part of this claim using a randomized, paired survey in\nwhich I ask workers in an online labor market (Amazon Mechanical Turk) how they\nperceive online employers and employers in their host country in terms of\nhonesty and fairness. I find that, on average, workers perceive the collection\nof online employers as slightly fairer and more honest than offline employers,\nthough the effect is not significant. Views are more polarized in the online\nemployer case, with more respondents having very positive views of the online\ncollection of employers.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jan 2010 22:09:26 GMT"}], "update_date": "2010-01-11", "authors_parsed": [["Horton", "John", ""]]}, {"id": "1001.1685", "submitter": "Jacek Gwizdka", "authors": "Jacek Gwizdka", "title": "Assessing Cognitive Load on Web Search Tasks", "comments": "Published in the special issue Hot Topic: Cognition and the Web", "journal-ref": "Ergonomics Open Journal 2, 2009, 114-123", "doi": null, "report-no": null, "categories": "cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assessing cognitive load on web search is useful for characterizing search\nsystem features and search tasks with respect to their demands on the\nsearcher's mental effort. It is also helpful for examining how individual\ndifferences among searchers (e.g. cognitive abilities) affect the search\nprocess. We examined cognitive load from the perspective of primary and\nsecondary task performance. A controlled web search study was conducted with 48\nparticipants. The primary task performance components were found to be\nsignificantly related to both the objective and the subjective task difficulty.\nHowever, the relationship between objective and subjective task difficulty and\nthe secondary task performance measures was weaker than expected. The results\nindicate that the dual-task approach needs to be used with caution.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jan 2010 16:15:29 GMT"}], "update_date": "2010-01-12", "authors_parsed": [["Gwizdka", "Jacek", ""]]}, {"id": "1001.2263", "submitter": "Rdv Ijcsis", "authors": "N. Kalyani, Dr K. V. N. Sunitha", "title": "Syllable Analysis to Build a Dictation System in Telugu language", "comments": "6 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS December 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 3, pp. 171-176, December 2009, USA", "doi": null, "report-no": "Volume 6, No. 3, ISSN 1947 5500", "categories": "cs.CL cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent decades, Speech interactive systems gained increasing importance.\nTo develop Dictation System like Dragon for Indian languages it is most\nimportant to adapt the system to a speaker with minimum training. In this paper\nwe focus on the importance of creating speech database at syllable units and\nidentifying minimum text to be considered while training any speech recognition\nsystem. There are systems developed for continuous speech recognition in\nEnglish and in few Indian languages like Hindi and Tamil. This paper gives the\nstatistical details of syllables in Telugu and its use in minimizing the search\nspace during recognition of speech. The minimum words that cover maximum\nsyllables are identified. This words list can be used for preparing a small\ntext which can be used for collecting speech sample while training the\ndictation system. The results are plotted for frequency of syllables and the\nnumber of syllables in each word. This approach is applied on the CIIL Mysore\ntext corpus which is of 3 million words.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jan 2010 18:51:08 GMT"}], "update_date": "2010-01-14", "authors_parsed": [["Kalyani", "N.", ""], ["Sunitha", "Dr K. V. N.", ""]]}, {"id": "1001.3150", "submitter": "Mauro Cherubini", "authors": "Mauro Cherubini, Rodrigo de Oliveira, Nuria Oliver, and Christian\n  Ferran", "title": "Gaze and Gestures in Telepresence: multimodality, embodiment, and roles\n  of collaboration", "comments": "Position paper, International Workshop New Frontiers in Telepresence\n  2010, part of CSCW2010, Savannah, GA, USA, 7th of February, 2010.\n  http://research.microsoft.com/en-us/events/nft2010/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a controlled experiment to further investigate the\nusefulness of gaze awareness and gesture recognition in the support of\ncollaborative work at a distance. We propose to redesign experiments conducted\nseveral years ago with more recent technology that would: a) enable to better\nstudy of the integration of communication modalities, b) allow users to freely\nmove while collaborating at a distance and c) avoid asymmetries of\ncommunication between collaborators.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jan 2010 21:17:38 GMT"}], "update_date": "2010-01-20", "authors_parsed": [["Cherubini", "Mauro", ""], ["de Oliveira", "Rodrigo", ""], ["Oliver", "Nuria", ""], ["Ferran", "Christian", ""]]}, {"id": "1001.3967", "submitter": "Grenville Croll", "authors": "David Colver", "title": "Spreadsheet good practice: is there any such thing?", "comments": "9 Pages, 3 Colour Figures. Referenced & Submitted by GJC in Jan 2010", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. (EuSpRIG) 2004 ISBN 1\n  902724 94 1", "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various techniques for developing spreadsheet models greatly improve the\nchance that the end result will not contain basic mechanical errors. However,\nfor every discipline in which a given technique is useful, there is likely to\nbe another in which the same technique works badly. As a result, the author\nurges that EuSpRIG does not succumb to internal or external pressures to\nchampion a particular set of \"best practices\", because no such set is optimal\nin all spreadsheet applications.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jan 2010 11:35:57 GMT"}], "update_date": "2010-01-25", "authors_parsed": [["Colver", "David", ""]]}, {"id": "1001.4104", "submitter": "Grenville Croll", "authors": "David Colver", "title": "Inclusion Analysis", "comments": "13 Pages, 10 Tables in Colour", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. 2007 177-189 ISBN\n  978-905617-58-6", "doi": null, "report-no": null, "categories": "cs.SE cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inclusion analysis is the name given by Operis to a black box testing\ntechnique that it has found to make the checking of key financial ratios\ncalculated by spreadsheet models quicker, easier and more likely to find\nomission errors than code inspection.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jan 2010 23:38:06 GMT"}], "update_date": "2010-01-26", "authors_parsed": [["Colver", "David", ""]]}, {"id": "1001.4107", "submitter": "Grenville Croll", "authors": "David Colver", "title": "Self-Checks In Spreadsheets: A Survey Of Current Practice", "comments": "7 Pages, 1 Table", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. (EuSpRIG) 2008 ISBN\n  978-905617-69-2", "doi": null, "report-no": null, "categories": "cs.SE cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A common application of spreadsheets is the development of models that\ndeliver projections of the future financial statements of companies established\nto pursue ventures that are subject to project financing. A survey of 11 such\nspreadsheets prepared by a range of organisations shows that the amount of\nself-testing included in such models ranges between one formula of testing for\neach three formulae of calculation, down to essentially no self-testing at all.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jan 2010 00:06:10 GMT"}], "update_date": "2010-01-26", "authors_parsed": [["Colver", "David", ""]]}, {"id": "1001.4293", "submitter": "Grenville Croll", "authors": "David Nixon, Mike O'Hara", "title": "Spreadsheet Auditing Software", "comments": "14 Pages, 5 Figures. All the comparisons are now out of date however\n  all the auditing software studied is still available for further historical\n  and comparative analysis. Minor Edits and referencing of the original paper\n  by GJC in Jan 2010. In memory of Mike O' Hara", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. (EuSpRIG) 2000 ISBN:1\n  86166 158 4", "doi": null, "report-no": null, "categories": "cs.SE cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is now widely accepted that errors in spreadsheets are both common and\npotentially dangerous. Further research has taken place to investigate how\nfrequently these errors occur, what impact they have, how the risk of\nspreadsheet errors can be reduced by following spreadsheet design guidelines\nand methodologies, and how effective auditing of a spreadsheet is in the\ndetection of these errors. However, little research exists to establish the\nusefulness of software tools in the auditing of spreadsheets. This paper\ndocuments and tests office software tools designed to assist in the audit of\nspreadsheets. The test was designed to identify the success of software tools\nin detecting different types of errors, to identify how the software tools\nassist the auditor and to determine the usefulness of the tools.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jan 2010 01:09:12 GMT"}], "update_date": "2010-01-26", "authors_parsed": [["Nixon", "David", ""], ["O'Hara", "Mike", ""]]}]