[{"id": "1204.0056", "submitter": "Heru Susanto", "authors": "Heru Susanto, Mohammad Nabil Almunawar, Yong Chee Tuan, Mehmet Sabih\n  Aksoy", "title": "I-SolFramework: An Integrated Solution Framework Six Layers Assessment\n  on Multimedia Information Security Architecture Policy Compliance", "comments": "International Journal of Electrical & Computer Sciences IJECS-IJENS\n  Vol: 12 No: 01 (126501-9494 IJECS-IJENS \\c{opyright} February 2012 IJENS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multimedia Information security becomes a important part for the\norganization's intangible assets. Level of confidence and stakeholder trusted\nare performance indicator as successes organization, it is imperative for\norganizations to use Information Security Management System (ISMS) to\neffectively manage their multimedia information assets. The main objective of\nthis paper is to Provide a novel practical framework approach to the\ndevelopment of ISMS, Called by the I-SolFramework, implemented in multimedia\ninformation security architecture (MISA), it divides a problem into six object\ndomains or six layers, namely organization,stakeholders, tool & technology,\npolicy, knowledge, and culture. In addition, this framework also introduced\nnovelty algorithm and mathematic models as measurement and assessment tools of\nMISA parameters.\n", "versions": [{"version": "v1", "created": "Sat, 31 Mar 2012 02:06:00 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Susanto", "Heru", ""], ["Almunawar", "Mohammad Nabil", ""], ["Tuan", "Yong Chee", ""], ["Aksoy", "Mehmet Sabih", ""]]}, {"id": "1204.1185", "submitter": "Michal Batko", "authors": "Petra Budikova, Michal Batko, Pavel Zezula", "title": "Query Language for Complex Similarity Queries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.IR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For complex data types such as multimedia, traditional data management\nmethods are not suitable. Instead of attribute matching approaches, access\nmethods based on object similarity are becoming popular. Recently, this\nresulted in an intensive research of indexing and searching methods for the\nsimilarity-based retrieval. Nowadays, many efficient methods are already\navailable, but using them to build an actual search system still requires\nspecialists that tune the methods and build the system manually. Several\nattempts have already been made to provide a more convenient high-level\ninterface in a form of query languages for such systems, but these are limited\nto support only basic similarity queries. In this paper, we propose a new\nlanguage that allows to formulate content-based queries in a flexible way,\ntaking into account the functionality offered by a particular search engine in\nuse. To ensure this, the language is based on a general data model with an\nabstract set of operations. Consequently, the language supports various\nadvanced query operations such as similarity joins, reverse nearest neighbor\nqueries, or distinct kNN queries, as well as multi-object and multi-modal\nqueries. The language is primarily designed to be used with the MESSIF\nframework for content-based searching but can be employed by other retrieval\nsystems as well.\n", "versions": [{"version": "v1", "created": "Thu, 5 Apr 2012 11:30:49 GMT"}], "update_date": "2012-04-06", "authors_parsed": [["Budikova", "Petra", ""], ["Batko", "Michal", ""], ["Zezula", "Pavel", ""]]}, {"id": "1204.1428", "submitter": "Tuan Tran Thai", "authors": "Tuan Tran Thai (DMIA), Emmanuel Lochin (DMIA), Jerome Lacan (DMIA)", "title": "Online multipath convolutional coding for real-time transmission", "comments": "Online multipath convolutional coding for real-time transmission\n  (2012)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most of multipath multimedia streaming proposals use Forward Error Correction\n(FEC) approach to protect from packet losses. However, FEC does not sustain\nwell burst of losses even when packets from a given FEC block are spread over\nmultiple paths. In this article, we propose an online multipath convolutional\ncoding for real-time multipath streaming based on an on-the-fly coding scheme\ncalled Tetrys. We evaluate the benefits brought out by this coding scheme\ninside an existing FEC multipath load splitting proposal known as Encoded\nMultipath Streaming (EMS). We demonstrate that Tetrys consistently outperforms\nFEC in both uniform and burst losses with EMS scheme. We also propose a\nmodification of the standard EMS algorithm that greatly improves the\nperformance in terms of packet recovery. Finally, we analyze different\nspreading policies of the Tetrys redundancy traffic between available paths and\nobserve that the longer propagation delay path should be preferably used to\ncarry repair packets.\n", "versions": [{"version": "v1", "created": "Fri, 6 Apr 2012 07:59:27 GMT"}], "update_date": "2012-04-09", "authors_parsed": [["Thai", "Tuan Tran", "", "DMIA"], ["Lochin", "Emmanuel", "", "DMIA"], ["Lacan", "Jerome", "", "DMIA"]]}, {"id": "1204.1868", "submitter": "Konstantinos Chorianopoulos", "authors": "Konstantinos Chorianopoulos", "title": "User-based key frame detection in social web video", "comments": "4 pages, 4 figures", "journal-ref": null, "doi": "10.1145/2382636.2382642", "report-no": null, "categories": "cs.MM cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Video search results and suggested videos on web sites are represented with a\nvideo thumbnail, which is manually selected by the video up-loader among three\nrandomly generated ones (e.g., YouTube). In contrast, we present a grounded\nuser-based approach for automatically detecting interesting key-frames within a\nvideo through aggregated users' replay interactions with the video player.\nPrevious research has focused on content-based systems that have the benefit of\nanalyzing a video without user interactions, but they are monolithic, because\nthe resulting video thumbnails are the same regardless of the user preferences.\nWe constructed a user interest function, which is based on aggregate video\nreplays, and analyzed hundreds of user interactions. We found that the local\nmaximum of the replaying activity stands for the semantics of information rich\nvideos, such as lecture, and how-to. The concept of user-based key-frame\ndetection could be applied to any video on the web, in order to generate a\nuser-based and dynamic video thumbnail in search results.\n", "versions": [{"version": "v1", "created": "Mon, 9 Apr 2012 12:23:36 GMT"}], "update_date": "2018-04-17", "authors_parsed": [["Chorianopoulos", "Konstantinos", ""]]}, {"id": "1204.2214", "submitter": "Bata Vasic Mr.", "authors": "Bata Vasic and Bane Vasic", "title": "Simplification Resilient LDPC-Coded Sparse-QIM Watermarking for\n  3D-Meshes", "comments": "Submitted, revised and Copyright transfered to IEEE Transactions on\n  Multimedia, October 9th 2012", "journal-ref": null, "doi": "10.1109/TMM.2013.2265673", "report-no": "MM-004273 - 11984709_File000000_225764737", "categories": "cs.MM cs.CG cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a blind watermarking scheme for 3-D meshes which combines sparse\nquantization index modulation (QIM) with deletion correction codes. The QIM\noperates on the vertices in rough concave regions of the surface thus ensuring\nimpeccability, while the deletion correction code recovers the data hidden in\nthe vertices which is removed by mesh optimization and/or simplification. The\nproposed scheme offers two orders of magnitude better performance in terms of\nrecovered watermark bit error rate compared to the existing schemes of similar\npayloads and fidelity constraints.\n", "versions": [{"version": "v1", "created": "Tue, 10 Apr 2012 16:41:33 GMT"}, {"version": "v2", "created": "Tue, 6 Nov 2012 18:04:51 GMT"}, {"version": "v3", "created": "Thu, 25 Jul 2013 17:25:32 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Vasic", "Bata", ""], ["Vasic", "Bane", ""]]}, {"id": "1204.2359", "submitter": "Saleh Omari", "authors": "Jaafer Al-Sabateen, Saleh Ali Alomari, Putra Sumari", "title": "An Overview of Video Allocation Algorithms for Flash-based SSD Storage\n  Systems", "comments": "6 pages, 2 figure, 3 algorithm, 3 table, (IJACSA) International\n  Journal of Advanced Computer Science and Applications, Vol. 3, No. 3, 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the fact that Solid State Disk (SSD) data storage media had offered a\nrevolutionary property storages community, but the unavailability of a\ncomprehensive allocation strategy in SSDs storage media, leads to consuming the\navailable space, random writing processes, time-consuming reading processes,\nand system resources consumption. In order to overcome these challenges, an\nefficient allocation algorithm is a desirable option. In this paper, we had\nexecuted an intensive investigation on the SSD-based allocation algorithms that\nhad been proposed by the knowledge community. An explanatory comparison had\nbeen made between these algorithms. We reviewed these algorithms in order to\nbuilding advanced knowledge armature that would help in inventing new\nallocation algorithms for this type of storage media.\n", "versions": [{"version": "v1", "created": "Wed, 11 Apr 2012 07:16:35 GMT"}], "update_date": "2012-04-12", "authors_parsed": [["Al-Sabateen", "Jaafer", ""], ["Alomari", "Saleh Ali", ""], ["Sumari", "Putra", ""]]}, {"id": "1204.2616", "submitter": "Gopalakrishnan Tr Nair", "authors": "T. R. Gopalakrishnan Nair, Suma V, Manas S", "title": "Genetic Algorithm to Make Persistent Security and Quality of Image in\n  Steganography from RS Analysis", "comments": "8 Pages, 4 Figures, Swarm Evolutionary and Memetric Computing\n  Conference (SEMCCO), Vishakhapatnam", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Retention of secrecy is one of the significant features during communication\nactivity. Steganography is one of the popular methods to achieve secret\ncommunication between sender and receiver by hiding message in any form of\ncover media such as an audio, video, text, images etc. Least significant bit\nencoding is the simplest encoding method used by many steganography programs to\nhide secret message in 24bit, 8bit colour images and grayscale images.\nSteganalysis is a method of detecting secret message hidden in a cover media\nusing steganography. RS steganalysis is one of the most reliable steganalysis\nwhich performs statistical analysis of the pixels to successfully detect the\nhidden message in an image. However, existing steganography method protects the\ninformation against RS steganalysis in grey scale images. This paper presents a\nsteganography method using genetic algorithm to protect against the RS attack\nin colour images. Stego image is divided into number of blocks. Subsequently,\nwith the implementation of natural evolution on the stego image using genetic\nalgorithm enables to achieve optimized security and image quality.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2012 04:43:08 GMT"}], "update_date": "2012-04-13", "authors_parsed": [["Nair", "T. R. Gopalakrishnan", ""], ["V", "Suma", ""], ["S", "Manas", ""]]}, {"id": "1204.3391", "submitter": "Zhao Chen Mr.", "authors": "Zhao Chen, Liuguo Yin, Mai Xu, and Jianhua Lu", "title": "Rateless Codes with Progressive Recovery for Layered Multimedia Delivery", "comments": null, "journal-ref": null, "doi": "10.1109/VTCFall.2012.6399047", "report-no": null, "categories": "cs.IT cs.MM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a novel approach, based on unequal error protection, to\nenhance rateless codes with progressive recovery for layered multimedia\ndelivery. With a parallel encoding structure, the proposed Progressive Rateless\ncodes (PRC) assign unequal redundancy to each layer in accordance with their\nimportance. Each output symbol contains information from all layers, and thus\nthe stream layers can be recovered progressively at the expected received\nratios of output symbols. Furthermore, the dependency between layers is\nnaturally considered. The performance of the PRC is evaluated and compared with\nsome related UEP approaches. Results show that our PRC approach provides better\nrecovery performance with lower overhead both theoretically and numerically.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 07:52:00 GMT"}, {"version": "v2", "created": "Wed, 13 Jun 2012 02:09:34 GMT"}], "update_date": "2017-08-16", "authors_parsed": [["Chen", "Zhao", ""], ["Yin", "Liuguo", ""], ["Xu", "Mai", ""], ["Lu", "Jianhua", ""]]}, {"id": "1204.3618", "submitter": "Mohammad Tofighi", "authors": "Mohammad Tofighi, Ali Ayremlou, Farokh Marvasti", "title": "Compensating Interpolation Distortion by Using New Optimized Modular\n  Method", "comments": "7 pages. Journal paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A modular method was suggested before to recover a band limited signal from\nthe sample and hold and linearly interpolated (or, in general, an\nnth-order-hold) version of the regular samples. In this paper a novel approach\nfor compensating the distortion of any interpolation based on modular method\nhas been proposed. In this method the performance of the modular method is\noptimized by adding only some simply calculated coefficients. This approach\ncauses drastic improvement in terms of signal-to-noise ratios with fewer\nmodules compared to the classical modular method. Simulation results clearly\nconfirm the improvement of the proposed method and also its superior robustness\nagainst additive noise.\n", "versions": [{"version": "v1", "created": "Fri, 13 Apr 2012 20:16:11 GMT"}], "update_date": "2012-05-15", "authors_parsed": [["Tofighi", "Mohammad", ""], ["Ayremlou", "Ali", ""], ["Marvasti", "Farokh", ""]]}, {"id": "1204.6321", "submitter": "Konstantinos Chorianopoulos", "authors": "Ioannis Leftheriotis, Chrysoula Gkonela, Konstantinos Chorianopoulos", "title": "Efficient Video Indexing on the Web: A System that Leverages User\n  Interactions with a Video Player", "comments": "9 pages, 3 figures, UCMedia 2010: 2nd International ICST Conference\n  on User Centric Media", "journal-ref": null, "doi": "10.1007/978-3-642-35145-7_16", "report-no": null, "categories": "cs.MM cs.DL cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a user-based video indexing method, that\nautomatically generates thumbnails of the most important scenes of an online\nvideo stream, by analyzing users' interactions with a web video player. As a\ntest bench to verify our idea we have extended the YouTube video player into\nthe VideoSkip system. In addition, VideoSkip uses a web-database (Google\nApplication Engine) to keep a record of some important parameters, such as the\ntiming of basic user actions (play, pause, skip). Moreover, we implemented an\nalgorithm that selects representative thumbnails. Finally, we populated the\nsystem with data from an experiment with nine users. We found that the\nVideoSkip system indexes video content by leveraging implicit users\ninteractions, such as pause and thirty seconds skip. Our early findings point\ntoward improvements of the web video player and its thumbnail generation\ntechnique. The VideSkip system could compliment content-based algorithms, in\norder to achieve efficient video-indexing in difficult videos, such as lectures\nor sports.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 20:00:20 GMT"}], "update_date": "2018-04-17", "authors_parsed": [["Leftheriotis", "Ioannis", ""], ["Gkonela", "Chrysoula", ""], ["Chorianopoulos", "Konstantinos", ""]]}]