[{"id": "1207.1032", "submitter": "Gordana Dodig Crnkovic", "authors": "Gordana Dodig-Crnkovic", "title": "Info-Computationalism and Philosophical Aspects of Research in\n  Information Sciences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The historical development has lead to the decay of Natural Philosophy which\nuntil 19th century included all of our knowledge about the physical world into\nthe growing multitude of specialized sciences. The focus on the in-depth\nenquiry disentangled from its broad context lead to the problem of loss of\ncommon world-view and impossibility of communication between specialist\nresearch fields because of different languages they developed in isolation. The\nneed for a new unifying framework is becoming increasingly apparent with the\ninformation technology enabling and intensifying the communication between\ndifferent research fields and knowledge communities. This time, not only\nnatural sciences, but also all of human knowledge is being integrated in a\nglobal network such as Internet with its diverse knowledge and language\ncommunities. Info-computationalism (ICON) as a synthesis of pancomputationalism\nand paninformationalism presents a unifying framework for understanding of\nnatural phenomena including living beings and their cognition, their ways of\nprocessing information and producing knowledge. Within ICON physical universe\nis understood as a network of computational processes on an informational\nstructure.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2012 05:54:51 GMT"}], "update_date": "2012-07-05", "authors_parsed": [["Dodig-Crnkovic", "Gordana", ""]]}, {"id": "1207.1033", "submitter": "Gordana Dodig Crnkovic", "authors": "Gordana Dodig-Crnkovic", "title": "Alan Turing's Legacy: Info-Computational Philosophy of Nature", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Alan Turing's pioneering work on computability, and his ideas on\nmorphological computing support Andrew Hodges' view of Turing as a natural\nphilosopher. Turing's natural philosophy differs importantly from Galileo's\nview that the book of nature is written in the language of mathematics (The\nAssayer, 1623). Computing is more than a language of nature as computation\nproduces real time physical behaviors. This article presents the framework of\nNatural Info-computationalism as a contemporary natural philosophy that builds\non the legacy of Turing's computationalism. Info-computationalism is a\nsynthesis of Informational Structural Realism (the view that nature is a web of\ninformational structures) and Natural Computationalism (the view that nature\nphysically computes its own time development). It presents a framework for the\ndevelopment of a unified approach to nature, with common interpretation of\ninanimate nature as well as living organisms and their social networks.\nComputing is understood as information processing that drives all the changes\non different levels of organization of information and can be modeled as\nmorphological computing on data sets pertinent to informational structures. The\nuse of infocomputational conceptualizations, models and tools makes possible\nfor the first time in history the study of complex selforganizing adaptive\nsystems, including basic characteristics and functions of living systems,\nintelligence, and cognition.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2012 05:55:24 GMT"}], "update_date": "2012-07-05", "authors_parsed": [["Dodig-Crnkovic", "Gordana", ""]]}, {"id": "1207.1034", "submitter": "Gordana Dodig Crnkovic", "authors": "Gordana Dodig-Crnkovic and Mark Burgin", "title": "Axiomatic Tools versus Constructive approach to Unconventional\n  Algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we analyze axiomatic issues of unconventional computations\nfrom a methodological and philosophical point of view. We explain how the new\nmodels of algorithms changed the algorithmic universe, making it open and\nallowing increased flexibility and creativity. However, the greater power of\nnew types of algorithms also brought the greater complexity of the algorithmic\nuniverse, demanding new tools for its study. That is why we analyze new\npowerful tools brought forth by the axiomatic theory of algorithms, automata\nand computation.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2012 05:56:03 GMT"}], "update_date": "2012-07-05", "authors_parsed": [["Dodig-Crnkovic", "Gordana", ""], ["Burgin", "Mark", ""]]}]