[{"id": "0912.0034", "submitter": "EPTCS", "authors": "Gabriel Ciobanu", "title": "Proceedings Third Workshop on Membrane Computing and Biologically\n  Inspired Process Calculi 2009", "comments": "In Memoriam Nadia Busi", "journal-ref": "EPTCS 11, 2009", "doi": "10.4204/EPTCS.11", "report-no": null, "categories": "cs.CE cs.DC cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the accepted papers at the third Workshop on Membrane\nComputing and Biologically Inspired Process Calculi, held in Bologna on 5th\nSeptember 2009. The papers are devoted to both membrane computing and\nbiologically inspired process calculi, as well as to other related formalisms.\nThe papers of this volume are selected by the programme committee due to their\nquality and relevance; they have defined an exciting programme highlighting\ninteresting problems and stimulating the search for novel ways of describing\nrelated biological phenomena. In addition, we had an invited talk given by Luca\nCardelli on a spatial process algebra for developmental biology. Membrane\nsystems were introduced as a class of distributed parallel computing devices\ninspired by the observation that any biological system is a complex\nhierarchical structure, with a flow of materials and information that underlies\ntheir functioning. The emphasis is on the computational properties of the\nmodel, and it makes use of automata, languages, and complexity theoretic tools.\nOn the other hand, certain calculi such as mobile ambients and brane calculi\nwork with similar notions (compartments, membranes). These calculi are used to\nmodel and analyze the various biological systems. The workshop on Membrane\nComputing and Biologically Inspired Process Calculi brings together researchers\nworking in these fields to present their recent work and discuss new ideas\nconcerning the formalisms, their properties and relationships.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2009 22:24:42 GMT"}], "update_date": "2009-12-02", "authors_parsed": [["Ciobanu", "Gabriel", ""]]}, {"id": "0912.0265", "submitter": "Gabriel Silva", "authors": "Marius Buibas, Diana Yu, Krystal Nizar, Gabriel A. Silva", "title": "Mapping the spatiotemporal dynamics of calcium signaling in cellular\n  neural networks using optical flow", "comments": "23 pages, 5 figures. Peer reviewed accepted version in press in\n  Annals of Biomedical Engineering", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.CV q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An optical flow gradient algorithm was applied to spontaneously forming net-\nworks of neurons and glia in culture imaged by fluorescence optical microscopy\nin order to map functional calcium signaling with single pixel resolution.\nOptical flow estimates the direction and speed of motion of objects in an image\nbetween subsequent frames in a recorded digital sequence of images (i.e. a\nmovie). Computed vector field outputs by the algorithm were able to track the\nspatiotemporal dynamics of calcium signaling pat- terns. We begin by briefly\nreviewing the mathematics of the optical flow algorithm, and then describe how\nto solve for the displacement vectors and how to measure their reliability. We\nthen compare computed flow vectors with manually estimated vectors for the\nprogression of a calcium signal recorded from representative astrocyte\ncultures. Finally, we applied the algorithm to preparations of primary\nastrocytes and hippocampal neurons and to the rMC-1 Muller glial cell line in\norder to illustrate the capability of the algorithm for capturing different\ntypes of spatiotemporal calcium activity. We discuss the imaging requirements,\nparameter selection and threshold selection for reliable measurements, and\noffer perspectives on uses of the vector data.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2009 21:17:53 GMT"}, {"version": "v2", "created": "Fri, 22 Jan 2010 17:13:08 GMT"}], "update_date": "2010-01-22", "authors_parsed": [["Buibas", "Marius", ""], ["Yu", "Diana", ""], ["Nizar", "Krystal", ""], ["Silva", "Gabriel A.", ""]]}, {"id": "0912.0549", "submitter": "Ralf-Michael Vetter", "authors": "R.-M. Vetter, W. Lennartz, J.-V. Peetz", "title": "Modular Workflow Engine for Distributed Services using Lightweight Java\n  Clients", "comments": "14 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we introduce the concept and the first implementation of a\nlightweight client-server-framework as middleware for distributed computing. On\nthe client side an installation without administrative rights or privileged\nports can turn any computer into a worker node. Only a Java runtime environment\nand the JAR files comprising the workflow client are needed. To connect all\nclients to the engine one open server port is sufficient. The engine submits\ndata to the clients and orchestrates their work by workflow descriptions from a\ncentral database. Clients request new task descriptions periodically, thus the\nsystem is robust against network failures. In the basic set-up, data up- and\ndownloads are handled via HTTP communication with the server. The performance\nof the modular system could additionally be improved using dedicated file\nservers or distributed network file systems.\n  We demonstrate the design features of the proposed engine in real-world\napplications from mechanical engineering. We have used this system on a compute\ncluster in design-of-experiment studies, parameter optimisations and robustness\nvalidations of finite element structures.\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2009 01:31:36 GMT"}], "update_date": "2009-12-04", "authors_parsed": [["Vetter", "R. -M.", ""], ["Lennartz", "W.", ""], ["Peetz", "J. -V.", ""]]}, {"id": "0912.0893", "submitter": "Achmad Benny Mutiara", "authors": "A.D.Astuti and A.B. Mutiara", "title": "Performance Analysis on Molecular Dynamics Simulation of Protein Using\n  GROMACS", "comments": "8 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Development of computer technology in chemistry, bring many application of\nchemistry. Not only the application to visualize the structure of molecule but\nalso to molecular dynamics simulation. One of them is Gromacs. Gromacs is an\nexample of molecular dynamics application developed by Groningen University.\nThis application is a non-commercial and able to work in the operating system\nLinux. The main ability of Gromacs is to perform molecular dynamics simulation\nand minimization energy. In this paper, the author discusses about how to work\nGromacs in molecular dynamics simulation of some protein. In the molecular\ndynamics simulation, Gromacs does not work alone. Gromacs interact with pymol\nand Grace. Pymol is an application to visualize molecule structure and Grace is\nan application in Linux to display graphs. Both applications will support\nanalysis of molecular dynamics simulation.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 16:47:24 GMT"}], "update_date": "2009-12-07", "authors_parsed": [["Astuti", "A. D.", ""], ["Mutiara", "A. B.", ""]]}, {"id": "0912.1015", "submitter": "Rdv Ijcsis", "authors": "Mrs. J. P. Rothe, Dr. A. K. Wadhwani, Dr. Mrs. S. Wadhwani", "title": "Short Term Load Forecasting Using Multi Parameter Regression", "comments": "4 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 303-306, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.NE cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Short Term Load forecasting in this paper uses input data dependent on\nparameters such as load for current hour and previous two hours, temperature\nfor current hour and previous two hours, wind for current hour and previous two\nhours, cloud for current hour and previous two hours. Forecasting will be of\nload demand for coming hour based on input parameters at that hour. In this\npaper we are using multiparameter regression method for forecasting which has\nerror within tolerable range. Algorithms implementing these forecasting\ntechniques have been programmed using MATLAB and applied to the case study.\nOther methodologies in this area are ANN, Fuzzy and Evolutionary Algorithms for\nwhich investigations are under process. Adaptive multiparameter regression for\nload forecasting, in near future will be possible.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2009 13:18:35 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Rothe", "Mrs. J. P.", ""], ["Wadhwani", "Dr. A. K.", ""], ["Wadhwani", "Dr. Mrs. S.", ""]]}, {"id": "0912.2381", "submitter": "Luis Nunez A", "authors": "R. Camacho, R. Chacon, G. Diaz, C. Guada, V. Hamar, H. Hoeger, A.\n  Melfo, L. A. Nunez, Y. Perez, C. Quintero, M. Rosales, R. Torrens, the LAGO\n  Collaboration", "title": "LAGOVirtual: A Collaborative Environment for the Large Aperture GRB\n  Observatory", "comments": "Second EELA-2 Conference Choroni, Venezuela, November 25th to 27th\n  2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE astro-ph.HE astro-ph.IM hep-ex", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the LAGOVirtual Project: an ongoing project to develop platform to\ncollaborate in the Large Aperture GRB Observatory (LAGO). This continental-wide\nobservatory is devised to detect high energy (around 100 GeV) component of\nGamma Ray Bursts, by using the single particle technique in arrays of Water\nCherenkov Detectors (WCD) at high mountain sites (Chacaltaya, Bolivia, 5300 m\na.s.l., Pico Espejo, Venezuela, 4750 m a.s.l., Sierra Negra, Mexico, 4650 m\na.s.l). This platform will allow LAGO collaboration to share data, and computer\nresources through its different sites. This environment has the possibility to\ngenerate synthetic data by simulating the showers through AIRES application and\nto store/preserve distributed data files collected by the WCD at the LAGO\nsites. The present article concerns the implementation of a prototype of\nLAGO-DR adapting DSpace, with a hierarchical structure (i.e. country,\ninstitution, followed by collections that contain the metadata and data files),\nfor the captured/simulated data. This structure was generated by using the\ncommunity, sub-community, collection, item model; available at the DSpace\nsoftware. Each member institution-country of the project has the appropriate\npermissions on the system to publish information (descriptive metadata and\nassociated data files). The platform can also associate multiple files to each\nitem of data (data from the instruments, graphics, postprocessed-data, etc.).\n", "versions": [{"version": "v1", "created": "Sat, 12 Dec 2009 00:09:58 GMT"}], "update_date": "2009-12-15", "authors_parsed": [["Camacho", "R.", ""], ["Chacon", "R.", ""], ["Diaz", "G.", ""], ["Guada", "C.", ""], ["Hamar", "V.", ""], ["Hoeger", "H.", ""], ["Melfo", "A.", ""], ["Nunez", "L. A.", ""], ["Perez", "Y.", ""], ["Quintero", "C.", ""], ["Rosales", "M.", ""], ["Torrens", "R.", ""], ["Collaboration", "the LAGO", ""]]}, {"id": "0912.2551", "submitter": "EPTCS", "authors": "Paolo Ballarini (CoSBi), Michele Forlin (CoSBi), Tommaso Mazza\n  (CoSBi), Davide Prandi (CoSBi)", "title": "Efficient Parallel Statistical Model Checking of Biochemical Networks", "comments": null, "journal-ref": "EPTCS 14, 2009, pp. 47-61", "doi": "10.4204/EPTCS.14.4", "report-no": null, "categories": "cs.CE cs.DC cs.LO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of verifying stochastic models of biochemical\nnetworks against behavioral properties expressed in temporal logic terms. Exact\nprobabilistic verification approaches such as, for example, CSL/PCTL model\nchecking, are undermined by a huge computational demand which rule them out for\nmost real case studies. Less demanding approaches, such as statistical model\nchecking, estimate the likelihood that a property is satisfied by sampling\nexecutions out of the stochastic model. We propose a methodology for\nefficiently estimating the likelihood that a LTL property P holds of a\nstochastic model of a biochemical network. As with other statistical\nverification techniques, the methodology we propose uses a stochastic\nsimulation algorithm for generating execution samples, however there are three\nkey aspects that improve the efficiency: first, the sample generation is driven\nby on-the-fly verification of P which results in optimal overall simulation\ntime. Second, the confidence interval estimation for the probability of P to\nhold is based on an efficient variant of the Wilson method which ensures a\nfaster convergence. Third, the whole methodology is designed according to a\nparallel fashion and a prototype software tool has been implemented that\nperforms the sampling/verification process in parallel over an HPC\narchitecture.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2009 23:33:01 GMT"}], "update_date": "2009-12-15", "authors_parsed": [["Ballarini", "Paolo", "", "CoSBi"], ["Forlin", "Michele", "", "CoSBi"], ["Mazza", "Tommaso", "", "CoSBi"], ["Prandi", "Davide", "", "CoSBi"]]}, {"id": "0912.3036", "submitter": "EPTCS", "authors": "Lubos Brim (Masaryk University), Jaco van de Pol (University of\n  Twente)", "title": "Proceedings 8th International Workshop on Parallel and Distributed\n  Methods in verifiCation", "comments": null, "journal-ref": "EPTCS 14, 2009", "doi": "10.4204/EPTCS.14", "report-no": null, "categories": "cs.LO cs.CE cs.DC cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 8th International Workshop on Parallel and Distributed Methods in\nverifiCation (PDMC 2009) took place on November 4, 2009 at the Eindhoven\nUniversity of Technology, in conjunction with Formal Methods 2009 and other\nrelated events for the first time under the heading of Formal Methods Week.\nThis volume contains the final workshop proceedings.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2009 23:38:09 GMT"}], "update_date": "2009-12-17", "authors_parsed": [["Brim", "Lubos", "", "Masaryk University"], ["van de Pol", "Jaco", "", "University of\n  Twente"]]}, {"id": "0912.3461", "submitter": "Susan Khor", "authors": "Susan Khor", "title": "Application of Graph Coloring to Biological Networks", "comments": null, "journal-ref": "IET Syst. Biol. -- May 2010 -- Volume 4, Issue 3, p.185-192", "doi": "10.1049/iet-syb.2009.0038", "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the application of graph coloring to biological networks,\nspecifically protein-protein interaction (PPI) networks. First, we find that\ngiven similar conditions (i.e. number of nodes, number of links, degree\ndistribution and clustering), fewer colors are needed to color disassortative\n(high degree nodes tend to connect to low degree nodes and vice versa) than\nassortative networks. Fewer colors create fewer independent sets which in turn\nimply higher concurrency potential for a network. Since PPI networks tend to be\ndisassortative, we suggest that in addition to functional specificity and\nstability proposed previously by Maslov and Sneppen (Science 296, 2002), the\ndisassortative nature of PPI networks may promote the ability of cells to\nperform multiple, crucial and functionally diverse tasks concurrently. Second,\nsince graph coloring is closely related to the presence of cliques in a graph,\nthe significance of node coloring information to the problem of identifying\nprotein complexes, i.e. dense subgraphs in a PPI network, is investigated. We\nfind that for PPI networks where 1% to 11% of nodes participate in at least one\nidentified protein complex, such as H. sapien (DIP20070219, DIP20081014 and\nHPRD070609), DSATUR (a well-known complete graph coloring algorithm) node\ncoloring information can improve the quality (homogeneity and separation) of\ninitial candidate complexes. This finding may help to improve existing protein\ncomplex detection methods, and/or suggest new methods.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2009 17:01:13 GMT"}], "update_date": "2010-05-25", "authors_parsed": [["Khor", "Susan", ""]]}, {"id": "0912.4991", "submitter": "Hamed Owladeghaffari O.Ghaffari", "authors": "Hamed.O.Ghaffari, Mamdou Fall and Erman.Evgin", "title": "Complexity Analysis of Unsaturated Flow in Heterogeneous Media Using a\n  Complex Network Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE physics.geo-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, we investigate the complexity of two-phase flow (air/water) in\na heterogeneous soil sample by using complex network theory, where the supposed\nporous media is non-deformable media, under the time-dependent gas pressure.\nBased on the different similarity measurements (i.e., correlation, Euclidean\nmetrics) over the emerged patterns from the evolution of saturation of\nnon-wetting phase of a multi-heterogeneous soil sample, the emerged complex\nnetworks are recognized. Understanding of the properties of complex networks\n(such degree distribution, mean path length, clustering coefficient) can be\nsupposed as a way to analysis of variation of saturation profiles structures\n(as the solution of finite element method on the coupled PDEs) where complexity\nis coming from the changeable connection and links between assumed nodes. Also,\nthe path of evolution of the supposed system will be illustrated on the state\nspace of networks either in correlation and Euclidean measurements. The results\nof analysis showed in a closed system the designed complex networks approach to\nsmall world network where the mean path length and clustering coefficient are\nlow and high, respectively. As another result, the evolution of macro -states\nof system (such mean velocity of air or pressure) can be scaled with\ncharacteristics of structure complexity of saturation. In other part, we tried\nto find a phase transition criterion based on the variation of non-wetting\nphase velocity profiles over a network which had been constructed over\ncorrelation distance.\n", "versions": [{"version": "v1", "created": "Sat, 26 Dec 2009 01:11:19 GMT"}, {"version": "v2", "created": "Tue, 10 Aug 2010 19:16:47 GMT"}], "update_date": "2010-08-11", "authors_parsed": [["Ghaffari", "Hamed. O.", ""], ["Fall", "Mamdou", ""], ["Evgin", "Erman.", ""]]}]