[{"id": "1303.0210", "submitter": "Aysajan Abidin", "authors": "Aysajan Abidin and Jan-{\\AA}ke Larsson", "title": "Direct Proof of Security of Wegman-Carter Authentication with Partially\n  Known Key", "comments": "15 pages", "journal-ref": "Quantum Information Processing, 13, 2155-2170, 2014", "doi": "10.1007/s11128-013-0641-6", "report-no": null, "categories": "cs.CR quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information-theoretically secure (ITS) authentication is needed in Quantum\nKey Distribution (QKD). In this paper, we study security of an ITS\nauthentication scheme proposed by Wegman & Carter, in the case of partially\nknown authentication key. This scheme uses a new authentication key in each\nauthentication attempt, to select a hash function from an Almost Strongly\nUniversal$_2$ hash function family. The partial knowledge of the attacker is\nmeasured as the trace distance between the authentication key distribution and\nthe uniform distribution; this is the usual measure in QKD. We provide direct\nproofs of security of the scheme, when using partially known key, first in the\ninformation-theoretic setting and then in terms of witness indistinguishability\nas used in the Universal Composability (UC) framework. We find that if the\nauthentication procedure has a failure probability $\\epsilon$ and the\nauthentication key has an $\\epsilon'$ trace distance to the uniform, then under\nITS, the adversary's success probability conditioned on an authentic\nmessage-tag pair is only bounded by $\\epsilon+|\\mT|\\epsilon'$, where $|\\mT|$ is\nthe size of the set of tags. Furthermore, the trace distance between the\nauthentication key distribution and the uniform increases to $|\\mT|\\epsilon'$\nafter having seen an authentic message-tag pair. Despite this, we are able to\nprove directly that the authenticated channel is indistinguishable from an\n(ideal) authentic channel (the desired functionality), except with probability\nless than $\\epsilon+\\epsilon'$. This proves that the scheme is\n($\\epsilon+\\epsilon'$)-UC-secure, without using the composability theorem.\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2013 16:19:31 GMT"}], "update_date": "2014-09-25", "authors_parsed": [["Abidin", "Aysajan", ""], ["Larsson", "Jan-Åke", ""]]}, {"id": "1303.0222", "submitter": "Saravanan Kumarasamy", "authors": "Saravanan kumarasamy, T. Stephen Thangaraj", "title": "A Pattern Recognition Approach To Secure Cipher Documents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Natural phenomena show that many creatures form large social groups and move\nin regular patterns. Previous In this paper, we first propose an efficient\ndistributed mining algorithm to jointly identify a group of moving objects and\ndiscover their movement patterns in wireless sensor networks. Afterward, we\npropose a compression algorithm, called 2P2D, which exploits the obtained group\nmovement patterns to reduce the amount of delivered data. The compression\nalgorithm includes a sequence merge and an entropy reduction phases. we\nformulate a Hit Item Replacement (HIR) problem and propose a Replace algorithm\nthat obtains the optimal solution. Moreover, we devise three replacement rules\nand derive the maximum compression ratio.\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2013 16:55:44 GMT"}], "update_date": "2013-03-04", "authors_parsed": [["kumarasamy", "Saravanan", ""], ["Thangaraj", "T. Stephen", ""]]}, {"id": "1303.0346", "submitter": "Hadi Ahmadi", "authors": "Hadi Ahmadi, Reihaneh Safavi-Naini", "title": "Secure Distance Bounding Verification using Physical-Channel Properties", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of distance bounding verification (DBV), where a\nproving party claims a distance and a verifying party ensures that the prover\nis within the claimed distance. Current approaches to \"secure\" distance\nestimation use signal's time of flight, which requires the verifier to have an\naccurate clock. We study secure DBV using physical channel properties as an\nalternative to time measurement. We consider a signal propagation environment\nthat attenuates signal as a function of distance, and then corrupts it by an\nadditive noise.\n  We consider three attacking scenarios against DBV, namely distance fraud\n(DFA), mafia fraud (MFA) and terrorist fraud (TFA) attacks. We show it is\npossible to construct efficient DBV protocols with DFA and MFA security, even\nagainst an unbounded adversary; on the other hand, it is impossible to design\nTFA-secure protocols without time measurement, even with a\ncomputationally-bounded adversary. We however provide a TFA-secure construction\nunder the condition that the adversary's communication capability is limited to\nthe bounded retrieval model (BRM). We use numerical analysis to examine the\ncommunication complexity of the introduced DBV protocols. We discuss our\nresults and give directions for future research.\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2013 03:52:27 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Ahmadi", "Hadi", ""], ["Safavi-Naini", "Reihaneh", ""]]}, {"id": "1303.0351", "submitter": "George Abraham", "authors": "Ramesh Babu, George Abraham, Kiransinh Borasia", "title": "A Review On Securing Distributed Systems Using Symmetric Key\n  Cryptography", "comments": "7 pages, 7 figures, 1 table, Journal", "journal-ref": "International Journal of Advances in Science and Technology, Vol.\n  4, No.4, 2012", "doi": null, "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This review is aimed to evaluate the importance of Symmetric Key Cryptography\nfor Security in Distributed Systems. Businesses around the world as well as\nresearch and other such areas rely heavily on distributed systems these days.\nHence, security is also a major concern due to the openness of the system. Out\nof the various available security measures, we, in this paper, concentrate in\ngeneral on the symmetric key cryptographic technique. We review two widely used\nand popular symmetric key cryptographic algorithms, viz. DES and AES. These two\nalgorithms are evaluated on the parameters such as key size, block size, number\nof iterations, etc.\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2013 04:40:00 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Babu", "Ramesh", ""], ["Abraham", "George", ""], ["Borasia", "Kiransinh", ""]]}, {"id": "1303.0356", "submitter": "Arunesh Sinha", "authors": "Jeremiah Blocki, Nicolas Christin, Anupam Datta, Ariel D. Procaccia,\n  Arunesh Sinha", "title": "Audit Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Effective enforcement of laws and policies requires expending resources to\nprevent and detect offenders, as well as appropriate punishment schemes to\ndeter violators. In particular, enforcement of privacy laws and policies in\nmodern organizations that hold large volumes of personal information (e.g.,\nhospitals, banks, and Web services providers) relies heavily on internal audit\nmechanisms. We study economic considerations in the design of these mechanisms,\nfocusing in particular on effective resource allocation and appropriate\npunishment schemes. We present an audit game model that is a natural\ngeneralization of a standard security game model for resource allocation with\nan additional punishment parameter. Computing the Stackelberg equilibrium for\nthis game is challenging because it involves solving an optimization problem\nwith non-convex quadratic constraints. We present an additive FPTAS that\nefficiently computes a solution that is arbitrarily close to the optimal\nsolution.\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2013 05:07:11 GMT"}, {"version": "v2", "created": "Tue, 5 Mar 2013 18:10:05 GMT"}], "update_date": "2013-03-06", "authors_parsed": [["Blocki", "Jeremiah", ""], ["Christin", "Nicolas", ""], ["Datta", "Anupam", ""], ["Procaccia", "Ariel D.", ""], ["Sinha", "Arunesh", ""]]}, {"id": "1303.0418", "submitter": "Dr Anwar Pasha Deshmukh", "authors": "Dr. Anwar Pasha Deshmukh and Dr. Riyazuddin Qureshi", "title": "Transparent Data Encryption -- Solution for Security of Database\n  Contents", "comments": "4 Pages 2 figures", "journal-ref": "International Journal of Advanced Computer Science and\n  Applications, Volume 2 No. 3, March 2011, pp 25-28. ISSN: 2156-5570(Online) &\n  ISSN: 2158-107X(Print)", "doi": null, "report-no": null, "categories": "cs.DB cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present study deals with Transparent Data Encryption which is a\ntechnology used to solve the problems of security of data. Transparent Data\nEncryption means encrypting databases on hard disk and on any backup media.\nPresent day global business environment presents numerous security threats and\ncompliance challenges. To protect against data thefts and frauds we require\nsecurity solutions that are transparent by design.\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2013 19:15:38 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Deshmukh", "Dr. Anwar Pasha", ""], ["Qureshi", "Dr. Riyazuddin", ""]]}, {"id": "1303.0459", "submitter": "M.M.A. Hashem", "authors": "Kawser Wazed Nafi, Tonny Shekha kar, Amjad Hossain and M.M.A Hashem", "title": "An Advanced Certain Trust Model Using Fuzzy Logic and Probabilistic\n  Logic theory", "comments": null, "journal-ref": "International Journal of Advanced Computer Science and\n  Applications (IJACSA), Vol. 3, No. 12, pp. 164-173, [ISSN: 2156-5570] (2012)", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Trustworthiness especially for service oriented system is very important\ntopic now a day in IT field of the whole world. Certain Trust Model depends on\nsome certain values given by experts and developers. Here, main parameters for\ncalculating trust are certainty and average rating. In this paper we have\nproposed an Extension of Certain Trust Model, mainly the representation portion\nbased on probabilistic logic and fuzzy logic. This extended model can be\napplied in a system like cloud computing, internet, website, e-commerce, etc.\nto ensure trustworthiness of these platforms. The model uses the concept of\nfuzzy logic to add fuzziness with certainty and average rating to calculate the\ntrustworthiness of a system more accurately. We have proposed two new\nparameters - trust T and behavioral probability P, which will help both the\nusers and the developers of the system to understand its present condition\neasily. The linguistic variables are defined for both T and P and then these\nvariables are implemented in our laboratory to verify the proposed trust model.\nWe represent the trustworthiness of test system for two cases of evidence value\nusing Fuzzy Associative Memory (FAM). We use inference rules and\ndefuzzification method for verifying the model.\n", "versions": [{"version": "v1", "created": "Sun, 3 Mar 2013 05:30:45 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Nafi", "Kawser Wazed", ""], ["kar", "Tonny Shekha", ""], ["Hossain", "Amjad", ""], ["Hashem", "M. M. A", ""]]}, {"id": "1303.0557", "submitter": "Jun Zhang", "authors": "Jun Zhang, Xinran Li and Fang-Wei Fu", "title": "Security Analysis on \"An Authentication Code Against Pollution Attacks\n  in Network Coding\"", "comments": "9 pages. arXiv admin note: text overlap with arXiv:0909.3146 by other\n  authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the security of the authentication code against pollution attacks\nin network coding given by Oggier and Fathi and show one way to remove one very\nstrong condition they required. Actually, we find a way to attack their\nauthentication scheme. In their scheme, they considered that if some malicious\nnodes in the network collude to make pollution in the network flow or make\nsubstitution attacks to other nodes, they thought these malicious nodes must\nsolve a system of linear equations to recover the secret parameters. Then they\nconcluded that their scheme is an unconditional secure scheme. Actually, note\nthat the authentication tag in the scheme of Oggier and Fathi is nearly linear\non the messages, so it is very easy for any malicious node to make pollution\nattack in the network flow, replacing the vector of any incoming edge by linear\ncombination of his incoming vectors whose coefficients have sum 1. And if the\ncoalition of malicious nodes can carry out decoding of the network coding, they\ncan easily make substitution attack to any other node even if they do not know\nany information of the private key of the node. Moreover, even if their scheme\ncan work fruitfully, the condition in their scheme $H\\leqslant M$ in a network\ncan be removed, where $H$ is the sum of numbers of the incoming edges at\nadversaries. Under the condition $H\\leqslant M$, $H$ may be large, so we need\nlarge parameter $M$ which increases the cost of computation a lot. On the other\nhand, the parameter $M$ can not be very large as it can not exceed the length\nof original messages.\n", "versions": [{"version": "v1", "created": "Sun, 3 Mar 2013 19:55:27 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Zhang", "Jun", ""], ["Li", "Xinran", ""], ["Fu", "Fang-Wei", ""]]}, {"id": "1303.0598", "submitter": "M.M.A. Hashem", "authors": "Kawser Wazed Nafi, Tonny Shekha Kar, Sayed Anisul Hoque and M. M. A.\n  Hashem", "title": "A Newer User Authentication, File encryption and Distributed Server\n  Based Cloud Computing Security Architecture", "comments": null, "journal-ref": "International Journal of Advanced Computer Science and\n  Applications (IJACSA), Vol. 3, No. 10, pp. 181-186, [ISSN: 2156-5570] (2012)", "doi": null, "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cloud computing platform gives people the opportunity for sharing\nresources, services and information among the people of the whole world. In\nprivate cloud system, information is shared among the persons who are in that\ncloud. For this, security or personal information hiding process hampers. In\nthis paper we have proposed new security architecture for cloud computing\nplatform. This ensures secure communication system and hiding information from\nothers. AES based file encryption system and asynchronous key system for\nexchanging information or data is included in this model. This structure can be\neasily applied with main cloud computing features, e.g. PaaS, SaaS and IaaS.\nThis model also includes onetime password system for user authentication\nprocess. Our work mainly deals with the security system of the whole cloud\ncomputing platform.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 04:19:15 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Nafi", "Kawser Wazed", ""], ["Kar", "Tonny Shekha", ""], ["Hoque", "Sayed Anisul", ""], ["Hashem", "M. M. A.", ""]]}, {"id": "1303.0707", "submitter": "Stefano Tomasin", "authors": "Augusto Ferrante, Nicola Laurenti, Chiara Masiero, Michele Pavon and\n  Stefano Tomasin", "title": "On the Achievable Error Region of Physical Layer Authentication\n  Techniques over Rayleigh Fading Channels", "comments": null, "journal-ref": "IEEE Transactions on Information Forensics and Security, Volume\n  10, Issue 5, 1 May 2015, Article number 7010914, Pages 941-952", "doi": "10.1109/TIFS.2015.2392565", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a physical layer message authentication procedure based on the comparison\nof channel estimates obtained from the received messages, we focus on an outer\nbound on the type I/II error probability region. Channel estimates are modelled\nas multivariate Gaussian vectors, and we assume that the attacker has only some\nside information on the channel estimate, which he does not know directly. We\nderive the attacking strategy that provides the tightest bound on the error\nregion, given the statistics of the side information. This turns out to be a\nzero mean, circularly symmetric Gaussian density whose correlation matrices may\nbe obtained by solving a constrained optimization problem. We propose an\niterative algorithm for its solution: Starting from the closed form solution of\na relaxed problem, we obtain, by projection, an initial feasible solution;\nthen, by an iterative procedure, we look for the fixed point solution of the\nproblem. Numerical results show that for cases of interest the iterative\napproach converges, and perturbation analysis shows that the found solution is\na local minimum.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 14:26:17 GMT"}, {"version": "v2", "created": "Fri, 18 Apr 2014 11:30:13 GMT"}], "update_date": "2016-10-05", "authors_parsed": [["Ferrante", "Augusto", ""], ["Laurenti", "Nicola", ""], ["Masiero", "Chiara", ""], ["Pavon", "Michele", ""], ["Tomasin", "Stefano", ""]]}, {"id": "1303.0857", "submitter": "Theodore Book", "authors": "Theodore Book, Adam Pridgen, Dan S. Wallach", "title": "Longitudinal Analysis of Android Ad Library Permissions", "comments": "Most 2013", "journal-ref": "Mobile Security Technologies (MoST), May 2013, San Francisco CA", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates changes over time in the behavior of Android ad\nlibraries. Taking a sample of 100,000 apps, we extract and classify the ad\nlibraries. By considering the release dates of the applications that use a\nspecific ad library version, we estimate the release date for the library, and\nthus build a chronological map of the permissions used by various ad libraries\nover time. We find that the use of most permissions has increased over the last\nseveral years, and that more libraries are able to use permissions that pose\nparticular risks to user privacy and security.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 21:13:04 GMT"}, {"version": "v2", "created": "Thu, 18 Apr 2013 22:32:24 GMT"}], "update_date": "2013-07-24", "authors_parsed": [["Book", "Theodore", ""], ["Pridgen", "Adam", ""], ["Wallach", "Dan S.", ""]]}, {"id": "1303.0910", "submitter": "George Abraham", "authors": "RA. K. Saravanaguru, George Abraham, Krishnakumar Ventakasubramanian,\n  Kiransinh Borasia", "title": "Securing Web Services Using XML Signature and XML Encryption", "comments": "6 pages, 8 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is aimed to evaluate the importance of XML Signature and XML\nEncryption in Web Service Security. In today's business scenario, organizations\nare investing huge amount of resources in Web Services. Web Service\nTransactions are done mainly through plain-text XML formats like SOAP and WSDL,\nhence hacking into them is not a tedious task. XML Signature and XML Encryption\nensure security to XML documents as well as retain the structure of documents,\nthereby making it easy to implement them. These two methods are evaluated on\nthe parameters of authentication, authorization, integration, confidentiality\nand non-repudiation.\n", "versions": [{"version": "v1", "created": "Tue, 5 Mar 2013 02:35:49 GMT"}], "update_date": "2013-03-06", "authors_parsed": [["Saravanaguru", "RA. K.", ""], ["Abraham", "George", ""], ["Ventakasubramanian", "Krishnakumar", ""], ["Borasia", "Kiransinh", ""]]}, {"id": "1303.0930", "submitter": "Jun Zhang", "authors": "Jun Zhang, Xinran Li and Fang-Wei Fu", "title": "An Authentication Scheme for Subspace Codes over Network Based on Linear\n  Codes", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network coding provides the advantage of maximizing the usage of network\nresources, and has great application prospects in future network\ncommunications. However, the properties of network coding also make the\npollution attack more serious. In this paper, we give an unconditional secure\nauthentication scheme for network coding based on a linear code $C$.\nSafavi-Naini and Wang gave an authentication code for multi-receivers and\nmultiple messages. We notice that the scheme of Safavi-Naini and Wang is\nessentially constructed with Reed-Solomon codes. And we modify their\nconstruction slightly to make it serve for authenticating subspace codes over\nlinear network. Also, we generalize the construction with linear codes. The\ngeneralization to linear codes has the similar advantages as generalizing\nShamir's secret sharing scheme to linear secret sharing sceme based on linear\ncodes. One advantage of this generalization is that for a fixed message space,\nour scheme allows arbitrarily many receivers to check the integrity of their\nown messages, while the scheme with Reed-Solomon codes has a constraint on the\nnumber of verifying receivers. Another advantage is that we introduce access\nstructure in the generalized scheme. Massey characterized the access structure\nof linear secret sharing scheme by minimal codewords in the dual code whose\nfirst component is 1. We slightly modify the definition of minimal codewords.\nLet $C$ be a $[V,k]$ linear code. For any coordinate $i\\in \\{1,2,\\cdots,V\\}$, a\ncodeword $\\vec{c}$ in $C$ is called minimal respect to $i$ if the codeword\n$\\vec{c}$ has component 1 at the $i$-th coordinate and there is no other\ncodeword whose $i$-th component is 1 with support strictly contained in that of\n$\\vec{c}$. Then the security of receiver $R_i$ in our authentication scheme is\ncharacterized by the minimal codewords respect to $i$ in the dual code\n$C^\\bot$.\n", "versions": [{"version": "v1", "created": "Tue, 5 Mar 2013 05:33:40 GMT"}], "update_date": "2013-03-06", "authors_parsed": [["Zhang", "Jun", ""], ["Li", "Xinran", ""], ["Fu", "Fang-Wei", ""]]}, {"id": "1303.1048", "submitter": "Sugata Sanyal", "authors": "Sugata Sanyal, Parthasarathy P. Iyer", "title": "Cloud Computing -- An Approach with Modern Cryptography", "comments": "4 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we are proposing an algorithm which uses AES technique of\n128/192/256 bit cipher key in encryption and decryption of data. AES provides\nhigh security as compared to other encryption techniques along with RSA. Cloud\ncomputing provides the customer with the requested services. It refers to\napplications and services that run on distributed network using virtualized\nresources and accessed by common IP and network standard. While providing data\nservices it is becoming important to provide security for data. In cloud\ncomputing keeping data secure is an important issue to be focused. Even though\nAES was designed for military purposes, now a days it is been commercially\nadopted worldwide as it can encrypt most confidential document, as well as it\ncan work in most restricted areas, and offers good defense against various\nattack techniques, and security level to protect data for next 2-3 decades.\n", "versions": [{"version": "v1", "created": "Tue, 5 Mar 2013 14:32:21 GMT"}], "update_date": "2013-03-06", "authors_parsed": [["Sanyal", "Sugata", ""], ["Iyer", "Parthasarathy P.", ""]]}, {"id": "1303.1417", "submitter": "Sugata Sanyal", "authors": "Sugata Sanyal, Parthasarathy P. Iyer", "title": "Inter-Cloud Data Security Strategies", "comments": "5 pages, 1 Table. arXiv admin note: text overlap with\n  arXiv:0907.2485, arXiv:0903.0694 by other authors without attribution", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing is a complex infrastructure of software, hardware,\nprocessing, and storage that is available as a service. Cloud computing offers\nimmediate access to large numbers of the world's most sophisticated\nsupercomputers and their corresponding processing power, interconnected at\nvarious locations around the world, proffering speed in the tens of trillions\nof computations per second. Information in databases and software scattered\naround the Internet. There are many service providers in the internet, we can\ncall each service as a cloud, each cloud service will exchange data with other\ncloud, so when the data is exchanged between the clouds, there exist the\nproblem of security. Security is an important issue for cloud computing, both\nin terms of legal compliance and user trust, and needs to be considered at\nevery phase of design. In contrast to traditional solutions, where the IT\nservices are under proper physical, logical and personnel controls, Cloud\nComputing moves the application software and databases to the large data\ncenters, where the management of the data and services may not be trustworthy.\nThis unique attribute, however, poses many new security challenges. Cloud\ncomputing seems to offer some incredible benefits for communicators.\n", "versions": [{"version": "v1", "created": "Wed, 6 Mar 2013 18:36:09 GMT"}], "update_date": "2013-03-07", "authors_parsed": [["Sanyal", "Sugata", ""], ["Iyer", "Parthasarathy P.", ""]]}, {"id": "1303.1697", "submitter": "Tino", "authors": "Avinash Bhujbal, Ashish Jagtap, Devendra Gurav, Tino Jameskutty", "title": "Secure Video Streaming Plug-In", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Video sharing sites like YouTube, Metacafe, Dailymotion, Vimeo, etc. provide\na platform for media content sharing among its users. Some of these videos are\ncopyright protected and restricted from being downloaded and saved. But users\ncan use various download managers or application programs to download and save\nthese videos. This affects the incoming traffic on these websites reducing\ntheir hit rate and consequently reducing their revenue. Adobe Flash Player is\nthe most commonly used player for watching online videos. It uses RTMP (Real\nTime Messaging Protocol) to stream audio, video and data over the Internet,\nbetween a Flash Player and Adobe Flash Media Server.Here, we propose a plug-in\nthat enables the site owner control over downloading of videos from such\nwebsite. The plug-in will be installed at the client side with the consent of\nthe user. When the video is being played this plug-in will send unique keys to\nthe media server. The server will continue streaming the video after verifying\nthe keys. Download managers or application programs will not be able to\ndownload the videos as they wont be able to create the unique keys that need to\nbe sent to the server.\n", "versions": [{"version": "v1", "created": "Thu, 7 Mar 2013 14:17:23 GMT"}], "update_date": "2013-03-08", "authors_parsed": [["Bhujbal", "Avinash", ""], ["Jagtap", "Ashish", ""], ["Gurav", "Devendra", ""], ["Jameskutty", "Tino", ""]]}, {"id": "1303.1882", "submitter": "Ibrahim Al Shourbaji H", "authors": "Ibrahim AlShourbaji", "title": "An Overview of Wireless Local Area Network (WLAN)", "comments": "8 pages, International Journal of Computer Science and Information\n  Security(IJCSIS), Vol. 11, No. 2, February 2013. arXiv admin note: text\n  overlap with arXiv:0710.4818 by other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Wireless Communication is an application of science and technology that has\ncome to be vital for modern existence. From the early radio and telephone to\ncurrent devices such as mobile phones and laptops, accessing the global network\nhas become the most essential and indispensable part of our lifestyle. Wireless\ncommunication is an ever developing field, and the future holds many\npossibilities in this area. One expectation for the future in this field is\nthat, the devices can be developed to support communication with higher data\nrates and more security. Research in this area suggests that a dominant means\nof supporting such communication capabilities will be through the use of\nWireless LANs. As the deployment of Wireless LAN increases well around the\nglobe, it is increasingly important for us to understand different technologies\nand to select the most appropriate one.\n  This paper provides a detailed study of the available wireless LAN\ntechnologies and the concerned issues, will give a brief description of what\nwireless LANs are, the need of Wireless LAN, History of wireless LAN,\nadvantages of Wireless Networks, with summarizing the related work on WLAN in\nacademic area, Wireless LAN technologies, some risks attacks against wireless\ntechnologies, suggesting some recommendations to protect wireless LAN network\nfrom attack, Finally we propose some research issues should be focused on in\nthe future.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2013 04:17:27 GMT"}], "update_date": "2013-05-06", "authors_parsed": [["AlShourbaji", "Ibrahim", ""]]}, {"id": "1303.1948", "submitter": "Phil Brooke", "authors": "Phillip J. Brooke and Richard F. Paige", "title": "The Value of User-Visible Internet Cryptography", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cryptographic mechanisms are used in a wide range of applications, including\nemail clients, web browsers, document and asset management systems, where\ntypical users are not cryptography experts. A number of empirical studies have\ndemonstrated that explicit, user-visible cryptographic mechanisms are not\nwidely used by non-expert users, and as a result arguments have been made that\ncryptographic mechanisms need to be better hidden or embedded in end-user\nprocesses and tools. Other mechanisms, such as HTTPS, have cryptography\nbuilt-in and only become visible to the user when a dialogue appears due to a\n(potential) problem. This paper surveys deployed and potential technologies in\nuse, examines the social and legal context of broad classes of users, and from\nthere, assesses the value and issues for those users.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2013 10:58:53 GMT"}], "update_date": "2013-03-11", "authors_parsed": [["Brooke", "Phillip J.", ""], ["Paige", "Richard F.", ""]]}, {"id": "1303.1998", "submitter": "Razvan Barbulescu", "authors": "Razvan Barbulescu (INRIA Nancy - Grand Est / LORIA)", "title": "Selecting polynomials for the Function Field Sieve", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Function Field Sieve algorithm is dedicated to computing discrete\nlogarithms in a finite field GF(q^n), where q is small an prime power. The\nscope of this article is to select good polynomials for this algorithm by\ndefining and measuring the size property and the so-called root and\ncancellation properties. In particular we present an algorithm for rapidly\ntesting a large set of polynomials. Our study also explains the behaviour of\ninseparable polynomials, in particular we give an easy way to see that the\nalgorithm encompass the Coppersmith algorithm as a particular case.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2013 14:10:21 GMT"}], "update_date": "2013-03-11", "authors_parsed": [["Barbulescu", "Razvan", "", "INRIA Nancy - Grand Est / LORIA"]]}, {"id": "1303.2017", "submitter": "Tunji Adebiyi", "authors": "A. Adebiyi, Johnnes Arreymbi and Chris Imafidon", "title": "Security Assessment of Software Design using Neural Network", "comments": "7 pages, 1 figure, 4 tables, (IJARAI) International Journal of\n  Advanced Research in Artificial Intelligence, Vol. 1(4), 2012, pp.1-7,\n  ISSN:2165-4069 (Online), ISSN:2165-4050 (Print)", "journal-ref": "(IJARAI) International Journal of Advanced Research in Artificial\n  Intelligence, Vol. 1(4), 2012, pp.1-7", "doi": null, "report-no": null, "categories": "cs.CR cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security flaws in software applications today has been attributed mostly to\ndesign flaws. With limited budget and time to release software into the market,\nmany developers often consider security as an afterthought. Previous research\nshows that integrating security into software applications at a later stage of\nsoftware development lifecycle (SDLC) has been found to be more costly than\nwhen it is integrated during the early stages. To assist in the integration of\nsecurity early in the SDLC stages, a new approach for assessing security during\nthe design phase by neural network is investigated in this paper. Our findings\nshow that by training a back propagation neural network to identify attack\npatterns, possible attacks can be identified from design scenarios presented to\nit. The result of performance of the neural network is presented in this paper.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2013 15:09:53 GMT"}], "update_date": "2013-03-11", "authors_parsed": [["Adebiyi", "A.", ""], ["Arreymbi", "Johnnes", ""], ["Imafidon", "Chris", ""]]}, {"id": "1303.2219", "submitter": "Boris Ryabko", "authors": "Boris Ryabko", "title": "The Vernam cipher is robust to small deviations from randomness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Vernam cipher (or one-time pad) has played an important rule in\ncryptography because it is a perfect secrecy system. For example, if an English\ntext (presented in binary system) $X_1 X_2 ... $ is enciphered according to the\nformula $Z_i = (X_i + Y_i) \\mod 2 $, where $Y_1 Y_2 ...$ is a key sequence\ngenerated by the Bernoulli source with equal probabilities of 0 and 1, anyone\nwho knows $Z_1 Z_2 ... $ has no information about $X_1 X_2 ... $ without the\nknowledge of the key $Y_1 Y_2 ...$. (The best strategy is to guess $X_1 X_2 ...\n$ not paying attention to $Z_1 Z_2 ... $.)\n  But what should one say about secrecy of an analogous method where the key\nsequence $Y_1 Y_2 ...$ is generated by the Bernoulli source with a small bias,\nsay, $P(0) = 0.49, $ $ P(1) = 0.51$? To the best of our knowledge, there are no\ntheoretical estimates for the secrecy of such a system, as well as for the\ngeneral case where $X_1 X_2 ... $ (the plaintext) and key sequence are\ndescribed by stationary ergodic processes. We consider the running-key ciphers\nwhere the plaintext and the key are generated by stationary ergodic sources and\nshow how to estimate the secrecy of such systems. In particular, it is shown\nthat, in a certain sense, the Vernam cipher is robust to small deviations from\nrandomness.\n", "versions": [{"version": "v1", "created": "Sat, 9 Mar 2013 15:12:46 GMT"}], "update_date": "2013-03-12", "authors_parsed": [["Ryabko", "Boris", ""]]}, {"id": "1303.2282", "submitter": "Xiyong Zhang", "authors": "Xiyong Zhang and Guangpu Gao", "title": "On the conjecture about the nonexistence of rotation symmetric bent\n  functions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we describe a different approach to the proof of the\nnonexistence of homogeneous rotation symmetric bent functions. As a result, we\nobtain some new results which support the conjecture made in this journal,\ni.e., there are no homogeneous rotation symmetric bent functions of degree >2.\nAlso we characterize homogeneous degree 2 rotation symmetric bent functions by\nusing GCD of polynomials.\n", "versions": [{"version": "v1", "created": "Sun, 10 Mar 2013 02:10:54 GMT"}], "update_date": "2013-03-12", "authors_parsed": [["Zhang", "Xiyong", ""], ["Gao", "Guangpu", ""]]}, {"id": "1303.2545", "submitter": "Marco Baldi", "authors": "Marco Baldi, Marco Bianchi, Franco Chiaraluce", "title": "Optimization of the parity-check matrix density in QC-LDPC code-based\n  McEliece cryptosystems", "comments": "10 pages, 4 figures. To be presented at IEEE ICC 2013 - Workshop on\n  Information Security over Noisy and Lossy Communication Systems. Copyright\n  transferred to IEEE", "journal-ref": null, "doi": "10.1109/ICCW.2013.6649325", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Low-density parity-check (LDPC) codes are one of the most promising families\nof codes to replace the Goppa codes originally used in the McEliece\ncryptosystem. In fact, it has been shown that by using quasi-cyclic low-density\nparity-check (QC-LDPC) codes in this system, drastic reductions in the public\nkey size can be achieved, while maintaining fixed security levels. Recently,\nsome proposals have appeared in the literature using codes with denser\nparity-check matrices, named moderate-density parity-check (MDPC) codes.\nHowever, the density of the parity-check matrices to be used in QC-LDPC\ncode-based variants of the McEliece cryptosystem has never been optimized. This\npaper aims at filling such gap, by proposing a procedure for selecting the\ndensity of the private parity-check matrix, based on the security level and the\ndecryption complexity. We provide some examples of the system parameters\nobtained through the proposed technique.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2013 15:16:21 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Baldi", "Marco", ""], ["Bianchi", "Marco", ""], ["Chiaraluce", "Franco", ""]]}, {"id": "1303.2654", "submitter": "Toni Stojanovski", "authors": "Toni Draganov Stojanovski, Ninoslav Marina", "title": "Secure Wireless Communications via Cooperative Transmitting", "comments": "Submitted for presentation at the 2013 IEEE International Symposium\n  on Information Theory, Istanbul, Turkey, July 2013", "journal-ref": null, "doi": "10.1155/2014/760175", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information theoretic secrecy is combined with cryptographic secrecy to\ncreate a secret-key exchange protocol for wireless networks. A network of\ntransmitters, which already have cryptographically secured channels between\nthem, cooperate to exchange a secret key with a new receiver at a random\nlocation, in the presence of passive eavesdroppers at unknown locations. Two\nspatial point processes: homogeneous Poisson process and independent uniformly\ndistributed points are used for the spatial distributions of transmitters and\neavesdroppers. We analyse the impact of the number of cooperating transmitters\nand the number of eavesdroppers on the area fraction where secure communication\nis possible. Upper bounds on the probability of existence of positive secrecy\nbetween the cooperating transmitters and the receiver are derived. The\ncloseness of the upper bounds to the real value is then estimated by means of\nnumerical simulations. Simulations also indicate that a deterministic spatial\ndistribution for the transmitters e.g. hexagonal and square lattices, increases\nthe probability of existence of positive secrecy capacity compared to the\nrandom spatial distributions. For the same number of friendly nodes,\ncooperative transmitting provides a dramatically larger secrecy region than\ncooperative jamming and cooperative relaying.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2013 20:53:43 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Stojanovski", "Toni Draganov", ""], ["Marina", "Ninoslav", ""]]}, {"id": "1303.2682", "submitter": "Blake Stacey", "authors": "Blake C. Stacey and Yaneer Bar-Yam", "title": "Principles of Security: Human, Cyber, and Biological", "comments": "report for the Chief of Naval Operations Strategic Studies Group,\n  June 2008; made public 28 February 2013", "journal-ref": null, "doi": null, "report-no": "New England Complex Systems Institute Report 2008-06-01", "categories": "cs.CR nlin.AO physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cybersecurity attacks are a major and increasing burden to economic and\nsocial systems globally. Here we analyze the principles of security in\ndifferent domains and demonstrate an architectural flaw in current\ncybersecurity. Cybersecurity is inherently weak because it is missing the\nability to defend the overall system instead of individual computers. The\ncurrent architecture enables all nodes in the computer network to communicate\ntransparently with one another, so security would require protecting every\ncomputer in the network from all possible attacks. In contrast, other systems\ndepend on system-wide protections. In providing conventional security, police\npatrol neighborhoods and the military secures borders, rather than defending\neach individual household. Likewise, in biology, the immune system provides\nsecurity against viruses and bacteria using primarily action at the skin,\nmembranes, and blood, rather than requiring each cell to defend itself. We\npropose applying these same principles to address the cybersecurity challenge.\nThis will require: (a) Enabling pervasive distribution of self-propagating\nsecurityware and creating a developer community for such securityware, and (b)\nModifying the protocols of internet routers to accommodate adaptive security\nsoftware that would regulate internet traffic. The analysis of the immune\nsystem architecture provides many other principles that should be applied to\ncybersecurity. Among these principles is a careful interplay of detection and\naction that includes evolutionary improvement. However, achieving significant\nsecurity gains by applying these principles depends strongly on remedying the\nunderlying architectural limitations.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2013 20:47:40 GMT"}], "update_date": "2013-03-13", "authors_parsed": [["Stacey", "Blake C.", ""], ["Bar-Yam", "Yaneer", ""]]}, {"id": "1303.2974", "submitter": "Ed Blakey", "authors": "Ed Blakey", "title": "Complexity-Style Resources in Cryptography", "comments": "21 pages. 4 figures. To appear in Information and Computation\n  (special issue on Information Security as a Resource)", "journal-ref": "Information and Computation, vol. 226, pp. 3 - 15, 2013", "doi": "10.1016/j.ic.2013.03.002", "report-no": null, "categories": "cs.CR cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Previously, the author has developed a framework within which to quantify and\ncompare the resources consumed during computational-especially unconventional\ncomputational-processes (adding to the familiar resources of run-time and\nmemory space such non-standard resources as precision and energy); it is\nnatural and beneficial in this framework to employ various complexity-theoretic\ntools and techniques. Here, we seek an analogous treatment not of computational\nprocesses but of cryptographic protocols and similar, so as to be able to apply\nthe existing arsenal of complexity-theoretic methods in new ways, in the\nderivation and verification of protocols in a wider, cryptographic context.\nAccordingly, we advocate a framework in which one may view as resources the\ncosts-which may be related to computation, communication, information\n(including side-channel information) or availability of primitives, for\nexample-incurred when executing cryptographic protocols, coin-tossing schemes,\netc. The ultimate aim is to formulate as a resource, and be able to analyse\ncomplexity-theoretically, the security of these protocols and schemes.\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2013 18:14:09 GMT"}], "update_date": "2013-04-17", "authors_parsed": [["Blakey", "Ed", ""]]}, {"id": "1303.3047", "submitter": "Miroslav Stampar", "authors": "Miroslav Stampar", "title": "Data Retrieval over DNS in SQL Injection Attacks", "comments": "7 pages, 3 figures, 1 table. Presented at PHDays 2012 security\n  conference, Moscow, Russia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DB cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes an advanced SQL injection technique where DNS resolution\nprocess is exploited for retrieval of malicious SQL query results. Resulting\nDNS requests are intercepted by attackers themselves at the controlled remote\nname server extracting valuable data. Open source SQL injection tool sqlmap has\nbeen adjusted to automate this task. With modifications done, attackers are\nable to use this technique for fast and low profile data retrieval, especially\nin cases where other standard ones fail.\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2013 22:09:05 GMT"}], "update_date": "2013-03-14", "authors_parsed": [["Stampar", "Miroslav", ""]]}, {"id": "1303.3071", "submitter": "Ankit Chaudhary", "authors": "S. Kumar, R. Sehgal, P. Singh, Ankit Chaudhary", "title": "Nepenthes Honeypots based Botnet Detection", "comments": "http://ojs.academypublisher.com/index.php/jait/article/view/jait0304215221", "journal-ref": "JAIT 3(4), 2012", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The numbers of the botnet attacks are increasing day by day and the detection\nof botnet spreading in the network has become very challenging. Bots are having\nspecific characteristics in comparison of normal malware as they are controlled\nby the remote master server and usually dont show their behavior like normal\nmalware until they dont receive any command from their master server. Most of\ntime bot malware are inactive, hence it is very difficult to detect. Further\nthe detection or tracking of the network of theses bots requires an\ninfrastructure that should be able to collect the data from a diverse range of\ndata sources and correlate the data to bring the bigger picture in view. In\nthis paper, we are sharing our experience of botnet detection in the private\nnetwork as well as in public zone by deploying the nepenthes honeypots. The\nautomated framework for malware collection using nepenthes and analysis using\nanti-virus scan are discussed. The experimental results of botnet detection by\nenabling nepenthes honeypots in network are shown. Also we saw that existing\nknown bots in our network can be detected.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2013 00:55:21 GMT"}], "update_date": "2013-03-14", "authors_parsed": [["Kumar", "S.", ""], ["Sehgal", "R.", ""], ["Singh", "P.", ""], ["Chaudhary", "Ankit", ""]]}, {"id": "1303.3251", "submitter": "Li Xiao", "authors": "Li Xiao, Xiang-Gen Xia, and Wenjie Wang", "title": "Multi-Stage Robust Chinese Remainder Theorem", "comments": "26 pages, 2 figures", "journal-ref": null, "doi": "10.1109/TSP.2014.2339798", "report-no": null, "categories": "cs.IT cs.CE cs.CR math.IT math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well-known that the traditional Chinese remainder theorem (CRT) is not\nrobust in the sense that a small error in a remainder may cause a large error\nin the reconstruction solution. A robust CRT was recently proposed for a\nspecial case when the greatest common divisor (gcd) of all the moduli is more\nthan 1 and the remaining integers factorized by the gcd of all the moduli are\nco-prime. In this special case, a closed-form reconstruction from erroneous\nremainders was proposed and a necessary and sufficient condition on the\nremainder errors was obtained. It basically says that the reconstruction error\nis upper bounded by the remainder error level $\\tau$ if $\\tau$ is smaller than\na quarter of the gcd of all the moduli. In this paper, we consider the robust\nreconstruction problem for a general set of moduli. We first present a\nnecessary and sufficient condition for the remainder errors for a robust\nreconstruction from erroneous remainders with a general set of muduli and also\na corresponding robust reconstruction method. This can be thought of as a\nsingle stage robust CRT. We then propose a two-stage robust CRT by grouping the\nmoduli into several groups as follows. First, the single stage robust CRT is\napplied to each group. Then, with these robust reconstructions from all the\ngroups, the single stage robust CRT is applied again across the groups. This is\nthen easily generalized to multi-stage robust CRT. Interestingly, with this\ntwo-stage robust CRT, the robust reconstruction holds even when the remainder\nerror level $\\tau$ is above the quarter of the gcd of all the moduli. In this\npaper, we also propose an algorithm on how to group a set of moduli for a\nbetter reconstruction robustness of the two-stage robust CRT in some special\ncases.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2013 19:02:36 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Xiao", "Li", ""], ["Xia", "Xiang-Gen", ""], ["Wang", "Wenjie", ""]]}, {"id": "1303.3262", "submitter": "Laszlo Kish", "authors": "Elias Gonzalez, Laszlo B. Kish, Robert Balog, Prasad Enjeti", "title": "Information theoretically secure, enhanced Johnson noise based key\n  distribution over the smart grid with switched filters", "comments": "polished, updated", "journal-ref": "PLoS ONE 8 (2013) e70206", "doi": "10.1371/journal.pone.0070206", "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We introduce a protocol with a reconfigurable filter system to create\nnon-overlapping single loops in the smart power grid for the realization of the\nKirchhoff-Law-Johnson-(like)-Noise secure key distribution system. The protocol\nis valid for one-dimensional radial networks (chain-like power line) which are\ntypical of the electricity distribution network between the utility and the\ncustomer. The speed of the protocol (the number of steps needed) versus grid\nsize is analyzed. When properly generalized, such a system has the potential to\nachieve unconditionally secure key distribution over the smart power grid of\narbitrary geometrical dimensions.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2013 01:51:08 GMT"}, {"version": "v2", "created": "Tue, 19 Mar 2013 17:08:01 GMT"}, {"version": "v3", "created": "Thu, 4 Apr 2013 18:57:10 GMT"}, {"version": "v4", "created": "Sat, 15 Jun 2013 15:57:41 GMT"}], "update_date": "2013-12-18", "authors_parsed": [["Gonzalez", "Elias", ""], ["Kish", "Laszlo B.", ""], ["Balog", "Robert", ""], ["Enjeti", "Prasad", ""]]}, {"id": "1303.3485", "submitter": "Ajay Kulkarni", "authors": "Ajay Kulkarni, Saurabh Kulkarni, Ketki Haridas, Aniket More", "title": "Proposed Video Encryption Algorithm v/s Other Existing Algorithms: A\n  Comparative Study", "comments": "Published with International Journal of Computer Applications (IJCA)\n  5 pages 4 images. arXiv admin note: text overlap with arXiv:1104.0800 by\n  other authors without attribution", "journal-ref": "International Journal of Computer Applications 65(1):1-5, March\n  2013", "doi": "10.5120/10885-5777", "report-no": null, "categories": "cs.CR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Securing multimedia data has become of utmost importance especially in the\napplications related to military purposes. With the rise in development in\ncomputer and internet technology, multimedia data has become the most\nconvenient method for military training. An innovative encryption algorithm for\nvideos compressed using H.264 was proposed to safely exchange highly\nconfidential videos. To maintain a balance between security and computational\ntime, the proposed algorithm shuffles the video frames along with the audio,\nand then AES is used to selectively encrypt the sensitive video codewords.\nUsing this approach unauthorized viewing of the video file can be prevented and\nhence this algorithm provides a high level of security. A comparative study of\nthe proposed algorithm with other existing algorithms has been put forward in\nthis paper to prove the effectiveness of the proposed algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2013 15:52:12 GMT"}], "update_date": "2013-03-17", "authors_parsed": [["Kulkarni", "Ajay", ""], ["Kulkarni", "Saurabh", ""], ["Haridas", "Ketki", ""], ["More", "Aniket", ""]]}, {"id": "1303.4078", "submitter": "George Grispos", "authors": "George Grispos, William Bradley Glisson and Tim Storer", "title": "Using Smartphones as a Proxy for Forensic Evidence contained in Cloud\n  Storage Services", "comments": "Paper appeared at the 46th Hawaii International Conference on System\n  Sciences (HICSS-46), 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud storage services such as Dropbox, Box and SugarSync have been embraced\nby both individuals and organizations. This creates an environment that is\npotentially conducive to security breaches and malicious activities. The\ninvestigation of these cloud environments presents new challenges for the\ndigital forensics community. It is anticipated that smartphone devices will\nretain data from these storage services. Hence, this research presents a\npreliminary investigation into the residual artifacts created on an iOS and\nAndroid device that has accessed a cloud storage service. The contribution of\nthis paper is twofold. First, it provides an initial assessment on the extent\nto which cloud storage data is stored on these client-side devices. This view\nacts as a proxy for data stored in the cloud. Secondly, it provides\ndocumentation on the artifacts that could be useful in a digital forensics\ninvestigation of cloud services.\n", "versions": [{"version": "v1", "created": "Sun, 17 Mar 2013 16:49:14 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Grispos", "George", ""], ["Glisson", "William Bradley", ""], ["Storer", "Tim", ""]]}, {"id": "1303.4155", "submitter": "Emiliano De Cristofaro", "authors": "Gregory Norcie, Emiliano De Cristofaro, Victoria Bellotti", "title": "Bootstrapping Trust in Online Dating: Social Verification of Online\n  Dating Profiles", "comments": "In Proceedings of Financial Cryptography and Data Security (FC)\n  Workshop on Usable Security (USEC), 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online dating is an increasingly thriving business which boasts\nbillion-dollar revenues and attracts users in the tens of millions.\nNotwithstanding its popularity, online dating is not impervious to worrisome\ntrust and privacy concerns raised by the disclosure of potentially sensitive\ndata as well as the exposure to self-reported (and thus potentially\nmisrepresented) information. Nonetheless, little research has, thus far,\nfocused on how to enhance privacy and trustworthiness. In this paper, we report\non a series of semi-structured interviews involving 20 participants, and show\nthat users are significantly concerned with the veracity of online dating\nprofiles. To address some of these concerns, we present the user-centered\ndesign of an interface, called Certifeye, which aims to bootstrap trust in\nonline dating profiles using existing social network data. Certifeye verifies\nthat the information users report on their online dating profile (e.g., age,\nrelationship status, and/or photos) matches that displayed on their own\nFacebook profile. Finally, we present the results of a 161-user Mechanical Turk\nstudy assessing whether our veracity-enhancing interface successfully reduced\nconcerns in online dating users and find a statistically significant trust\nincrease.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2013 04:36:33 GMT"}, {"version": "v2", "created": "Fri, 21 Jun 2013 00:20:19 GMT"}], "update_date": "2013-06-24", "authors_parsed": [["Norcie", "Gregory", ""], ["De Cristofaro", "Emiliano", ""], ["Bellotti", "Victoria", ""]]}, {"id": "1303.4262", "submitter": "James Alderman", "authors": "James Alderman and Jason Crampton", "title": "On the Use of Key Assignment Schemes in Authentication Protocols", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Key Assignment Schemes (KASs) have been extensively studied in the context of\ncryptographically-enforced access control, where derived keys are used to\ndecrypt protected resources. In this paper, we explore the use of KASs in\nentity authentication protocols, where we use derived keys to encrypt\nchallenges. This novel use of KASs permits the efficient authentication of an\nentity in accordance with an authentication policy by associating entities with\nsecurity labels representing specific services. Cryptographic keys are\nassociated with each security label and demonstrating knowledge of an\nappropriate key is used as the basis for authentication. Thus, by controlling\nthe distribution of such keys, restrictions may be efficiently placed upon the\ncircumstances under which an entity may be authenticated and the services to\nwhich they may gain access.\n  In this work, we explore how both standardized protocols and novel\nconstructions may be developed to authenticate entities as members of a group\nassociated to a particular security label, whilst protecting the long-term\nsecrets in the system. We also see that such constructions may allow for\nauthentication whilst preserving anonymity, and that by including a trusted\nthird party we can achieve the authentication of individual identities and\nauthentication based on timestamps without the need for synchronized clocks.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2013 14:32:26 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Alderman", "James", ""], ["Crampton", "Jason", ""]]}, {"id": "1303.4264", "submitter": "Wojciech Mazurczyk", "authors": "Pawel Kopiczko, Wojciech Mazurczyk, Krzysztof Szczypiorski", "title": "StegTorrent: a Steganographic Method for the P2P File Sharing Service", "comments": "7 pages, 7 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper proposes StegTorrent a new network steganographic method for the\npopular P2P file transfer service-BitTorrent. It is based on modifying the\norder of data packets in the peer-peer data exchange protocol. Unlike other\nexisting steganographic methods that modify the packets' order it does not\nrequire any synchronization. Experimental results acquired from prototype\nimplementation proved that it provides high steganographic bandwidth of up to\n270 b/s while introducing little transmission distortion and providing\ndifficult detectability.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2013 14:36:53 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Kopiczko", "Pawel", ""], ["Mazurczyk", "Wojciech", ""], ["Szczypiorski", "Krzysztof", ""]]}, {"id": "1303.4448", "submitter": "Brant Jones", "authors": "Rebecca E. Field and Brant C. Jones", "title": "Using carry-truncated addition to analyze add-rotate-xor hash algorithms", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a truncated addition operation on pairs of N-bit binary numbers\nthat interpolates between ordinary addition mod 2^N and bitwise addition in\n(Z/2Z)^N. We use truncated addition to analyze hash functions that are built\nfrom the bit operations add, rotate, and xor, such as Blake, Skein, and\nCubehash. Any ARX algorithm can be approximated by replacing ordinary addition\nwith truncated addition, and we define a metric on such algorithms which we\ncall the {\\bf sensitivity}. This metric measures the smallest approximation\nagreeing with the full algorithm a statistically useful portion of the time (we\nuse 0.1%). Because truncated addition greatly reduces the complexity of the\nnon-linear operation in ARX algorithms, the approximated algorithms are more\nsusceptible to both collision and pre-image attacks, and we outline a potential\ncollision attack explicitly. We particularize some of these observations to the\nSkein hash function.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2013 22:37:13 GMT"}], "update_date": "2013-03-20", "authors_parsed": [["Field", "Rebecca E.", ""], ["Jones", "Brant C.", ""]]}, {"id": "1303.4808", "submitter": "Jeroen Ooms", "authors": "Jeroen Ooms", "title": "The RAppArmor Package: Enforcing Security Policies in R Using Dynamic\n  Sandboxing on Linux", "comments": null, "journal-ref": "Journal of Statistical Software, Vol. 55, Issue 7, Nov 2013", "doi": null, "report-no": null, "categories": "cs.CR cs.MS stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing availability of cloud computing and scientific super computers\nbrings great potential for making R accessible through public or shared\nresources. This allows us to efficiently run code requiring lots of cycles and\nmemory, or embed R functionality into, e.g., systems and web services. However\nsome important security concerns need to be addressed before this can be put in\nproduction. The prime use case in the design of R has always been a single\nstatistician running R on the local machine through the interactive console.\nTherefore the execution environment of R is entirely unrestricted, which could\nresult in malicious behavior or excessive use of hardware resources in a shared\nenvironment. Properly securing an R process turns out to be a complex problem.\nWe describe various approaches and illustrate potential issues using some of\nour personal experiences in hosting public web services. Finally we introduce\nthe RAppArmor package: a Linux based reference implementation for dynamic\nsandboxing in R on the level of the operating system.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 01:57:36 GMT"}, {"version": "v2", "created": "Tue, 2 Apr 2013 17:53:41 GMT"}, {"version": "v3", "created": "Fri, 1 Nov 2013 17:53:22 GMT"}], "update_date": "2014-02-05", "authors_parsed": [["Ooms", "Jeroen", ""]]}, {"id": "1303.4814", "submitter": "Jaydip Sen", "authors": "Jaydip Sen", "title": "Security and Privacy Issues in Cloud Computing", "comments": "42 pages, 2 Figures, and 5 Tables. The book chapter is accepted for\n  publication and is expected to be published in the second half of 2013", "journal-ref": "Book Chapter in the book: \"Architectures and Protocols for Secure\n  Information Technology\", Ruiz-Martinez, Pereniguez-Garcia, and Marin-Lopez\n  (Eds.), IGI-Global, USA, 2013", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing transforms the way information technology (IT) is consumed\nand managed, promising improved cost efficiencies, accelerated innovation,\nfaster time-to-market, and the ability to scale applications on demand\n(Leighton, 2009). According to Gartner, while the hype grew exponentially\nduring 2008 and continued since, it is clear that there is a major shift\ntowards the cloud computing model and that the benefits may be substantial\n(Gartner Hype-Cycle, 2012). However, as the shape of the cloud computing is\nemerging and developing rapidly both conceptually and in reality, the\nlegal/contractual, economic, service quality, interoperability, security and\nprivacy issues still pose significant challenges. In this chapter, we describe\nvarious service and deployment models of cloud computing and identify major\nchallenges. In particular, we discuss three critical challenges: regulatory,\nsecurity and privacy issues in cloud computing. Some solutions to mitigate\nthese challenges are also proposed along with a brief presentation on the\nfuture trends in cloud computing deployment.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 02:24:14 GMT"}], "update_date": "2013-03-21", "authors_parsed": [["Sen", "Jaydip", ""]]}, {"id": "1303.4823", "submitter": "Paolo Gasti", "authors": "Alberto Compagno, Mauro Conti, Paolo Gasti and Gene Tsudik", "title": "Poseidon: Mitigating Interest Flooding DDoS Attacks in Named Data\n  Networking", "comments": "The IEEE Conference on Local Computer Networks (LCN 2013)", "journal-ref": null, "doi": "10.1109/LCN.2013.6761300", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Content-Centric Networking (CCN) is an emerging networking paradigm being\nconsidered as a possible replacement for the current IP-based host-centric\nInternet infrastructure. In CCN, named content becomes a first-class entity.\nCCN focuses on content distribution, which dominates current Internet traffic\nand is arguably not well served by IP. Named-Data Networking (NDN) is an\nexample of CCN. NDN is also an active research project under the NSF Future\nInternet Architectures (FIA) program. FIA emphasizes security and privacy from\nthe outset and by design. To be a viable Internet architecture, NDN must be\nresilient against current and emerging threats. This paper focuses on\ndistributed denial-of-service (DDoS) attacks; in particular we address interest\nflooding, an attack that exploits key architectural features of NDN. We show\nthat an adversary with limited resources can implement such attack, having a\nsignificant impact on network performance. We then introduce Poseidon: a\nframework for detecting and mitigating interest flooding attacks. Finally, we\nreport on results of extensive simulations assessing proposed countermeasure.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 03:11:00 GMT"}, {"version": "v2", "created": "Tue, 30 Jul 2013 15:59:14 GMT"}, {"version": "v3", "created": "Thu, 1 Aug 2013 19:21:43 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Compagno", "Alberto", ""], ["Conti", "Mauro", ""], ["Gasti", "Paolo", ""], ["Tsudik", "Gene", ""]]}, {"id": "1303.5157", "submitter": "Shihao Yan", "authors": "Shihao Yan, Nan Yang, Robert Malaney, and Jinhong Yuan", "title": "Transmit Antenna Selection with Alamouti Scheme in MIMO Wiretap Channels", "comments": "6 pages, 6 figures, submitted to GlobeCom 2013", "journal-ref": null, "doi": "10.1109/GLOCOM.2013.6831148", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new transmit antenna selection (TAS) scheme which\nprovides enhanced physical layer security in multiple-input multiple-output\n(MIMO) wiretap channels. The practical passive eavesdropping scenario we\nconsider is where channel state information (CSI) from the eavesdropper is not\navailable at the transmitter. Our new scheme is carried out in two steps.\nFirst, the transmitter selects the first two strongest antennas based on the\nfeedback from the receiver, which maximizes the instantaneous signal-to-noise\nratio (SNR) of the transmitter-receiver channel. Second, the Alamouti scheme is\nemployed at the selected antennas in order to perform data transmission. At the\nreceiver and the eavesdropper, maximal-ratio combining is applied in order to\nexploit the multiple antennas.We derive a new closed-form expression for the\nsecrecy outage probability in nonidentical Rayleigh fading, and using this\nresult, we then present the probability of non-zero secrecy capacity in closed\nform and the {\\epsilon}-outage secrecy capacity in numerical form. We\ndemonstrate that our proposed TAS-Alamouti scheme offers lower secrecy outage\nprobability than a single TAS scheme when the SNR of the transmitter-receiver\nchannel is above a specific value.\n", "versions": [{"version": "v1", "created": "Thu, 21 Mar 2013 04:16:20 GMT"}], "update_date": "2014-10-10", "authors_parsed": [["Yan", "Shihao", ""], ["Yang", "Nan", ""], ["Malaney", "Robert", ""], ["Yuan", "Jinhong", ""]]}, {"id": "1303.5226", "submitter": "Omar Khadir", "authors": "Omar Khadir", "title": "Algorithm for factoring some RSA and Rabin moduli", "comments": null, "journal-ref": "Journal of Discrete Mathematical Sciences and Cryptography (in\n  2008)", "doi": null, "report-no": null, "categories": "cs.CR math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a new efficient algorithm for factoring the RSA and\nthe Rabin moduli in the particular case when the difference between their two\nprime factors is bounded. As an extension, we also give some theoretical\nresults on factoring integers.\n", "versions": [{"version": "v1", "created": "Thu, 21 Mar 2013 11:02:55 GMT"}], "update_date": "2013-03-22", "authors_parsed": [["Khadir", "Omar", ""]]}, {"id": "1303.5972", "submitter": "Nilanjan  Dey", "authors": "Arijit Kumar Pal, Poulami Das, Nilanjan Dey", "title": "Odd-Even Embedding Scheme Based Modified Reversible Watermarking\n  Technique using Blueprint", "comments": "10 Pages, Figure 2, Table 1, FOSET, Academic Meet, Kolkata, India,\n  22-23 March 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Digital watermarking is a technique of information adding or information\nhiding in order to identify the owner of the data in multimedia content. It\nseems that a signal or digital image can permanently embed over another digital\ndata providing a good way to protect intellectual property from illegal\nreplication. The cover data that is transmitted through the internet hides the\nwatermark in a computer aided assertion method such that it becomes\nundetectable. Finally it stands as a hindrance over many operations without\nharming the embedded host document. Unfortunately, many owners of the digital\nmaterials such as images, text, audio and video are reluctant to the spreading\nof their documents on the web or other networked environment, because the ease\nof duplicating digital materials facilitates copyright violation. Digital media\ndistribution occurs through various channels. The cover data may or may not\nhold any relation with the watermark information. In the last two decades, a\nconsiderable amount of research has been done on the digital watermarking of\nmultimedia files such as audio, video, images and text. Different type of\nwatermarking algorithms has been proposed by the researchers to achieve high\nlevel of security and authenticity. In our proposed method, a modified\nreversible watermarking technique is introduced, which employs a blueprint\ngeneration of original image based on odd-even embedding methodology to yield\nlarge data hiding capacity, security as well as high watermarked quality. The\nexperimental results demonstrate that, no matter how much secret data is\nembedded, the watermarked quality is about 51dB in this proposed scheme.\n", "versions": [{"version": "v1", "created": "Sun, 24 Mar 2013 17:52:45 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Pal", "Arijit Kumar", ""], ["Das", "Poulami", ""], ["Dey", "Nilanjan", ""]]}, {"id": "1303.6782", "submitter": "Carlo Silva", "authors": "Carlo Marcelo Revoredo da Silva, Jose Lutiano Costa da Silva, Ricardo\n  Batista Rodrigues, Leandro Marques do Nascimento, Vinicius Cardoso Garcia", "title": "Systematic Mapping Study On Security Threats in Cloud Computing", "comments": "10 pages", "journal-ref": "(IJCSIS) International Journal of Computer Science and Information\n  Security, Vol. 11, No. 3, March 2013", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Today, Cloud Computing is rising strongly, presenting itself to the market by\nits main service models, known as IaaS, PaaS and SaaS, that offer advantages in\noperational investments by means of on-demand costs, where consumers pay by\nresources used. In face of this growth, security threats also rise,\ncompromising the Confidentiality, Integrity and Availability of the services\nprovided. Our work is a Systematic Mapping where we hope to present metrics\nabout publications available in literature that deal with some of the seven\nsecurity threats in Cloud Computing, based in the guide entitled \"Top Threats\nto Cloud Computing\" from the Cloud Security Alliance (CSA). In our research we\nidentified the more explored threats, distributed the results between fifteen\nSecurity Domains and identified the types of solutions proposed for the\nthreats. In face of those results, we highlight the publications that are\nconcerned to fulfill some standard of compliance.\n", "versions": [{"version": "v1", "created": "Wed, 27 Mar 2013 10:37:25 GMT"}], "update_date": "2013-03-28", "authors_parsed": [["da Silva", "Carlo Marcelo Revoredo", ""], ["da Silva", "Jose Lutiano Costa", ""], ["Rodrigues", "Ricardo Batista", ""], ["Nascimento", "Leandro Marques do", ""], ["Garcia", "Vinicius Cardoso", ""]]}, {"id": "1303.6905", "submitter": "Aleksey Tishin", "authors": "Andrey Bushev, Sergey Vlasenko, Ilya Glotov, Yuri Monakhov, Aleksey\n  Tishin", "title": "The development of the architecture of Distributed Network Intrusion\n  Detection System (D-NIDS)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the development of the architecture of Distributed\nNetwork Intrusion Detection System.\n", "versions": [{"version": "v1", "created": "Wed, 27 Mar 2013 17:38:47 GMT"}], "update_date": "2013-03-28", "authors_parsed": [["Bushev", "Andrey", ""], ["Vlasenko", "Sergey", ""], ["Glotov", "Ilya", ""], ["Monakhov", "Yuri", ""], ["Tishin", "Aleksey", ""]]}, {"id": "1303.7012", "submitter": "Abedelaziz  Mohaisen", "authors": "Abedelaziz Mohaisen and Omar Alrawi", "title": "Unveiling Zeus", "comments": "Accepted to SIMPLEX 2013 (a workshop held in conjunction with WWW\n  2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Malware family classification is an age old problem that many Anti-Virus (AV)\ncompanies have tackled. There are two common techniques used for\nclassification, signature based and behavior based. Signature based\nclassification uses a common sequence of bytes that appears in the binary code\nto identify and detect a family of malware. Behavior based classification uses\nartifacts created by malware during execution for identification. In this paper\nwe report on a unique dataset we obtained from our operations and classified\nusing several machine learning techniques using the behavior-based approach.\nOur main class of malware we are interested in classifying is the popular Zeus\nmalware. For its classification we identify 65 features that are unique and\nrobust for identifying malware families. We show that artifacts like file\nsystem, registry, and network features can be used to identify distinct malware\nfamilies with high accuracy---in some cases as high as 95%.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 00:11:54 GMT"}], "update_date": "2013-03-29", "authors_parsed": [["Mohaisen", "Abedelaziz", ""], ["Alrawi", "Omar", ""]]}, {"id": "1303.7075", "submitter": "Debajyoti Mukhopadhyay Prof.", "authors": "Debajyoti Mukhopadhyay, Gitesh Sonawane, Parth Sarthi Gupta, Sagar\n  Bhavsar, Vibha Mittal", "title": "Enhanced Security for Cloud Storage using File Encryption", "comments": "6 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing is a term coined to a network that offers incredible\nprocessing power, a wide array of storage space and unbelievable speed of\ncomputation. Social media channels, corporate structures and individual\nconsumers are all switching to the magnificent world of cloud computing. The\nflip side to this coin is that with cloud storage emerges the security issues\nof confidentiality, data integrity and data availability. Since the cloud is a\nmere collection of tangible super computers spread across the world,\nauthentication and authorization for data access is more than a necessity. Our\nwork attempts to overcome these security threats. The proposed methodology\nsuggests the encryption of the files to be uploaded on the cloud. The integrity\nand confidentiality of the data uploaded by the user is ensured doubly by not\nonly encrypting it but also providing access to the data only on successful\nauthentication.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 09:20:54 GMT"}], "update_date": "2013-03-29", "authors_parsed": [["Mukhopadhyay", "Debajyoti", ""], ["Sonawane", "Gitesh", ""], ["Gupta", "Parth Sarthi", ""], ["Bhavsar", "Sagar", ""], ["Mittal", "Vibha", ""]]}, {"id": "1303.7085", "submitter": "Othman Benammar", "authors": "Othman Benammar, Hicham Elasri, Abderrahim Sekkaki", "title": "Semantic Matching of Security Policies to Support Security Experts", "comments": "SECURWARE 2012 : The Sixth International Conference on Emerging\n  Security Information, Systems and Technologies", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Management of security policies has become increasingly difficult given the\nnumber of domains to manage, taken into consideration their extent and their\ncomplexity. Security experts has to deal with a variety of frameworks and\nspecification languages used in different domains that may belong to any Cloud\nComputing or Distributed Systems. This wealth of frameworks and languages make\nthe management task and the interpretation of the security policies so\ndifficult. Each approach provides its own conflict management method or tool,\nthe security expert will be forced to manage all these tools, which makes the\nfield maintenance and time consuming expensive. In order to hide this\ncomplexity and to facilitate some security experts tasks and automate the\nothers, we propose a security policies aligning based on ontologies process;\nthis process enables to detect and resolve security policies conflicts and to\nsupport security experts in managing tasks.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 10:40:23 GMT"}], "update_date": "2013-04-02", "authors_parsed": [["Benammar", "Othman", ""], ["Elasri", "Hicham", ""], ["Sekkaki", "Abderrahim", ""]]}, {"id": "1303.7328", "submitter": "EPTCS", "authors": "Mauricio Ayala-Rinc\\'on (Universidade de Bras\\'ilia), Maribel\n  Fern\\'andez (King's College London), Daniele Nantes-Sobrinho (Universidade de\n  Bras\\'ilia)", "title": "Elementary Deduction Problem for Locally Stable Theories with Normal\n  Forms", "comments": "In Proceedings LSFA 2012, arXiv:1303.7136", "journal-ref": "EPTCS 113, 2013, pp. 45-60", "doi": "10.4204/EPTCS.113.7", "report-no": null, "categories": "cs.LO cs.CC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an algorithm to decide the intruder deduction problem (IDP) for a\nclass of locally stable theories enriched with normal forms. Our result relies\non a new and efficient algorithm to solve a restricted case of higher-order\nassociative-commutative matching, obtained by combining the Distinct\nOccurrences of AC- matching algorithm and a standard algorithm to solve systems\nof linear Diophantine equations. A translation between natural deduction and\nsequent calculus allows us to use the same approach to decide the\n\\emphelementary deduction problem for locally stable theories. As an\napplication, we model the theory of blind signatures and derive an algorithm to\ndecide IDP in this context, extending previous decidability results.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2013 09:01:51 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Ayala-Rincón", "Mauricio", "", "Universidade de Brasília"], ["Fernández", "Maribel", "", "King's College London"], ["Nantes-Sobrinho", "Daniele", "", "Universidade de\n  Brasília"]]}, {"id": "1303.7397", "submitter": "Patrick Schweitzer", "authors": "Barbara Kordy, Ludovic Pi\\`etre-Cambac\\'ed\\`es, Patrick Schweitzer", "title": "DAG-Based Attack and Defense Modeling: Don't Miss the Forest for the\n  Attack Trees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the current state of the art on attack and defense\nmodeling approaches that are based on directed acyclic graphs (DAGs). DAGs\nallow for a hierarchical decomposition of complex scenarios into simple, easily\nunderstandable and quantifiable actions. Methods based on threat trees and\nBayesian networks are two well-known approaches to security modeling. However\nthere exist more than 30 DAG-based methodologies, each having different\nfeatures and goals. The objective of this survey is to present a complete\noverview of graphical attack and defense modeling techniques based on DAGs.\nThis consists of summarizing the existing methodologies, comparing their\nfeatures and proposing a taxonomy of the described formalisms. This article\nalso supports the selection of an adequate modeling technique depending on user\nrequirements.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2013 14:12:34 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Kordy", "Barbara", ""], ["Piètre-Cambacédès", "Ludovic", ""], ["Schweitzer", "Patrick", ""]]}, {"id": "1303.7435", "submitter": "Charles Riedel II", "authors": "Charles H. Bennett, C. Jess Riedel", "title": "On the security of key distribution based on Johnson-Nyquist noise", "comments": "4 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We point out that arguments for the security of Kish's noise-based\ncryptographic protocol have relied on an unphysical no-wave limit, which if\ntaken seriously would prevent any correlation from developing between the\nusers. We introduce a noiseless version of the protocol, also having illusory\nsecurity in the no-wave limit, to show that noise and thermodynamics play no\nessential role. Then we prove generally that classical electromagnetic\nprotocols cannot establish a secret key between two parties separated by a\nspacetime region perfectly monitored by an eavesdropper. We note that the\noriginal protocol of Kish is vulnerable to passive time-correlation attacks\neven in the quasi-static limit. Finally we show that protocols of this type can\nbe secure in practice against an eavesdropper with noisy monitoring equipment.\nIn this case the security is a straightforward consequence of Maurer and Wolf's\ndiscovery that key can be distilled by public discussion from correlated random\nvariables in a wide range of situations where the eavesdropper's noise is at\nleast partly independent from the users' noise.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2013 16:41:48 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Bennett", "Charles H.", ""], ["Riedel", "C. Jess", ""]]}, {"id": "1303.7457", "submitter": "Suraj Kumar Sukumar", "authors": "Suraj Sukumar", "title": "Computational Analysis of Modified Blom's Scheme", "comments": "12 pages. arXiv admin note: substantial text overlap with\n  arXiv:1103.5712 by other authors without attribution", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To achieve security in wireless networks, it is important to be able to\nencrypt and authenticate messages sent among sensor nodes. Due to resource\nconstraints, achieving such key agreement in wireless sensor networks in\nnontrivial. Blom's scheme is a symmetric key exchange protocol used in\ncryptography. In this paper, we propose a new key pre-distribution scheme by\nmodifying Blom's scheme which reduces the computational complexity as well as\nmemory usage.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2013 18:52:34 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Sukumar", "Suraj", ""]]}]