[{"id": "1406.0055", "submitter": "Salvatore Federico", "authors": "Ren\\'e Aid, Salvatore Federico, Huy\\^en Pham, Bertrand Villeneuve", "title": "Explicit investment rules with time-to-build and uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish explicit socially optimal rules for an irreversible investment\ndeci- sion with time-to-build and uncertainty. Assuming a price sensitive\ndemand function with a random intercept, we provide comparative statics and\neconomic interpreta- tions for three models of demand (arithmetic Brownian,\ngeometric Brownian, and the Cox-Ingersoll-Ross). Committed capacity, that is,\nthe installed capacity plus the in- vestment in the pipeline, must never drop\nbelow the best predictor of future demand, minus two biases. The discounting\nbias takes into account the fact that investment is paid upfront for future\nuse; the precautionary bias multiplies a type of risk aversion index by the\nlocal volatility. Relying on the analytical forms, we discuss in detail the\neconomic effects.\n", "versions": [{"version": "v1", "created": "Sat, 31 May 2014 08:30:24 GMT"}], "update_date": "2014-06-03", "authors_parsed": [["Aid", "René", ""], ["Federico", "Salvatore", ""], ["Pham", "Huyên", ""], ["Villeneuve", "Bertrand", ""]]}, {"id": "1406.0077", "submitter": "Johan Beumee", "authors": "Johan GB Beumee, Chris Cormack, Peyman Khorsand, Manish Patel", "title": "Path Diffusion, Part I", "comments": "28 pages, 10 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the position (state) distribution of the single step\nbinomial (multi-nomial) process on a discrete state / time grid under the\nassumption that the velocity process rather than the state process is\nMarkovian. In this model the particle follows a simple multi-step process in\nvelocity space which also preserves the proper state equation of motion. Many\nnumerical numerical examples of this process are provided. For a smaller grid\nthe probability construction converges into a correlated set of probabilities\nof hyperbolic functions for each velocity at each state point. It is shown that\nthe two dimensional process can be transformed into a Telegraph equation and\nvia transformation into a Klein-Gordon equation if the transition rates are\nconstant. In the last Section there is an example of multi-dimensional\nhyperbolic partial differential equation whose numerical average satisfies\nNewton's equation. There is also a momentum measure provided both for the\ntwo-dimensional case as for the multi-dimensional rate matrix.\n", "versions": [{"version": "v1", "created": "Sat, 31 May 2014 13:10:46 GMT"}], "update_date": "2014-06-03", "authors_parsed": [["Beumee", "Johan GB", ""], ["Cormack", "Chris", ""], ["Khorsand", "Peyman", ""], ["Patel", "Manish", ""]]}, {"id": "1406.0412", "submitter": "Gianluca Cassese", "authors": "Gianluca Cassese", "title": "Option Pricing in an Imperfect World", "comments": "The paper has been withdrawn because in the newer version it was\n  split into two different papers, each of which have been uploaded into Arxiv", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a model with no given probability measure, we consider asset pricing in\nthe presence of frictions and other imperfections and characterize the property\nof coherent pricing, a notion related to (but much weaker than) the no\narbitrage property. We show that prices are coherent if and only if the set of\npricing measures is non empty, i.e. if pricing by expectation is possible. We\nthen obtain a decomposition of coherent prices highlighting the role of\nbubbles. eventually we show that under very weak conditions the coherent\npricing of options allows for a very clear representation from which it is\npossible, as in the original work of Breeden and Litzenberger, to extract the\nimplied probability. Eventually we test this conclusion empirically via a new\nnon parametric approach.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2014 15:26:19 GMT"}, {"version": "v2", "created": "Fri, 27 Nov 2015 10:37:14 GMT"}, {"version": "v3", "created": "Fri, 9 Sep 2016 08:32:37 GMT"}], "update_date": "2016-09-12", "authors_parsed": [["Cassese", "Gianluca", ""]]}, {"id": "1406.0551", "submitter": "Zhaoxu Hou", "authors": "Alexander M.G. Cox, Zhaoxu Hou and Jan Obloj", "title": "Robust pricing and hedging under trading restrictions and the emergence\n  of local martingale models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the pricing of derivatives in a setting with trading\nrestrictions, but without any probabilistic assumptions on the underlying\nmodel, in discrete and continuous time. In particular, we assume that European\nput or call options are traded at certain maturities, and the forward price\nimplied by these option prices may be strictly decreasing in time. In discrete\ntime, when call options are traded, the short-selling restrictions ensure no\narbitrage, and we show that classical duality holds between the smallest\nsuper-replication price and the supremum over expectations of the payoff over\nall supermartingale measures. More surprisingly in the case where the only\nvanilla options are put options, we show that there is a duality gap. Embedding\nthe discrete time model into a continuous time setup, we make a connection with\n(strict) local-martingale models, and derive framework and results often seen\nin the literature on financial bubbles. This connection suggests a certain\nnatural interpretation of many existing results in the literature on financial\nbubbles.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2014 23:02:55 GMT"}, {"version": "v2", "created": "Mon, 8 Jun 2015 11:35:28 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Cox", "Alexander M. G.", ""], ["Hou", "Zhaoxu", ""], ["Obloj", "Jan", ""]]}, {"id": "1406.1936", "submitter": "Andrew Papanicolaou", "authors": "Andrew Papanicolaou", "title": "Stochastic Analysis Seminar on Filtering Theory", "comments": "94 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These notes were originally written for the Stochastic Analysis Seminar in\nthe Department of Operations Research and Financial Engineering at Princeton\nUniversity, in February of 2011. The seminar was attended and supported by\nmembers of the Research Training Group, with the author being partially\nsupported by NSF grant DMS-0739195.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jun 2014 22:50:05 GMT"}, {"version": "v2", "created": "Sat, 1 Oct 2016 17:46:14 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Papanicolaou", "Andrew", ""]]}, {"id": "1406.3716", "submitter": "Archil Gulisashvili", "authors": "Archil Gulisashvili and Josef Teichmann", "title": "The G\\\"{a}rtner-Ellis theorem, homogenization, and affine processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We obtain a first order extension of the large deviation estimates in the\nG\\\"{a}rtner-Ellis theorem. In addition, for a given family of measures, we find\na special family of functions having a similar Laplace principle expansion up\nto order one to that of the original family of measures. The construction of\nthe special family of functions mentioned above is based on heat kernel\nexpansions. Some of the ideas employed in the paper come from the theory of\naffine stochastic processes. For instance, we provide an explicit expansion\nwith respect to the homogenization parameter of the rescaled cumulant\ngenerating function in the case of a generic continuous affine process. We also\ncompute the coefficients in the homogenization expansion for the Heston model\nthat is one of the most popular stock price models with stochastic volatility.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jun 2014 11:15:26 GMT"}], "update_date": "2014-06-17", "authors_parsed": [["Gulisashvili", "Archil", ""], ["Teichmann", "Josef", ""]]}, {"id": "1406.4275", "submitter": "Takashi Kato", "authors": "Takashi Kato, Jun Sekine and Hiromitsu Yamamoto", "title": "A One-Factor Conditionally Linear Commodity Pricing Model under Partial\n  Information", "comments": "21 pages", "journal-ref": "Asia-Pacific Financial Markets, May 2014, Volume 21, Issue 2, pp\n  151-174", "doi": "10.1007/s10690-014-9182-y", "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A one-factor asset pricing model with an Ornstein--Uhlenbeck process as its\nstate variable is studied under partial information: the mean-reverting level\nand the mean-reverting speed parameters are modeled as hidden/unobservable\nstochastic variables. No-arbitrage pricing formulas for derivative securities\nwritten on a liquid asset and exponential utility indifference pricing formulas\nfor derivative securities written on an illiquid asset are presented. Moreover,\na conditionally linear filtering result is introduced to compute the\npricing/hedging formulas and the Bayesian estimators of the hidden variables.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2014 08:37:43 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Kato", "Takashi", ""], ["Sekine", "Jun", ""], ["Yamamoto", "Hiromitsu", ""]]}, {"id": "1406.4297", "submitter": "Tiziano De Angelis Dr", "authors": "Tiziano De Angelis, Salvatore Federico and Giorgio Ferrari", "title": "Optimal Boundary Surface for Irreversible Investment with Stochastic\n  Costs", "comments": "39 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines a Markovian model for the optimal irreversible investment\nproblem of a firm aiming at minimizing total expected costs of production. We\nmodel market uncertainty and the cost of investment per unit of production\ncapacity as two independent one-dimensional regular diffusions, and we consider\na general convex running cost function. The optimization problem is set as a\nthree-dimensional degenerate singular stochastic control problem.\n  We provide the optimal control as the solution of a Skorohod reflection\nproblem at a suitable boundary surface. Such boundary arises from the analysis\nof a family of two-dimensional parameter-dependent optimal stopping problems\nand it is characterized in terms of the family of unique continuous solutions\nto parameter-dependent nonlinear integral equations of Fredholm type.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2014 09:56:16 GMT"}, {"version": "v2", "created": "Thu, 19 Feb 2015 15:41:00 GMT"}, {"version": "v3", "created": "Sun, 8 Jan 2017 22:56:49 GMT"}], "update_date": "2017-01-10", "authors_parsed": [["De Angelis", "Tiziano", ""], ["Federico", "Salvatore", ""], ["Ferrari", "Giorgio", ""]]}, {"id": "1406.4301", "submitter": "Claudio Fontana", "authors": "Christa Cuchiero, Claudio Fontana, Alessandro Gnoatto", "title": "A general HJM framework for multiple yield curve modeling", "comments": "(40 pages, 4 figures)", "journal-ref": "Finance and Stochastics, 2016, vol. 20(2): 267-320", "doi": "10.1007/s00780-016-0291-5", "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general framework for modeling multiple yield curves which have\nemerged after the last financial crisis. In a general semimartingale setting,\nwe provide an HJM approach to model the term structure of multiplicative\nspreads between FRA rates and simply compounded OIS risk-free forward rates. We\nderive an HJM drift and consistency condition ensuring absence of arbitrage\nand, in addition, we show how to construct models such that multiplicative\nspreads are greater than one and ordered with respect to the tenor's length.\nWhen the driving semimartingale is specified as an affine process, we obtain a\nflexible Markovian structure. Finally, we show that the proposed framework\nallows to unify and extend several recent approaches to multiple yield curve\nmodeling.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2014 10:16:05 GMT"}, {"version": "v2", "created": "Thu, 7 May 2015 12:12:11 GMT"}], "update_date": "2016-05-05", "authors_parsed": [["Cuchiero", "Christa", ""], ["Fontana", "Claudio", ""], ["Gnoatto", "Alessandro", ""]]}, {"id": "1406.5414", "submitter": "Josef Teichmann", "authors": "Christa Cuchiero and Josef Teichmann", "title": "A convergence result for the Emery topology and a variant of the proof\n  of the fundamental theorem of asset pricing", "comments": "slightly extended version and list of references", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that \\emph{No unbounded profit with bounded risk} (NUPBR) implies\n\\emph{predictable uniform tightness} (P-UT), a boundedness property in the\nEmery topology which has been introduced by C. Stricker \\cite{S:85}. Combining\nthis insight with well known results from J. M\\'emin and L. S{\\l}ominski\n\\cite{MS:91} leads to a short variant of the proof of the fundamental theorem\nof asset pricing initially proved by F. Delbaen and W. Schachermayer\n\\cite{DS:94}. The results are formulated in the general setting of admissible\nportfolio wealth processes as laid down by Y. Kabanov in \\cite{kab:97}.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2014 15:02:21 GMT"}, {"version": "v2", "created": "Thu, 10 Jul 2014 13:49:43 GMT"}], "update_date": "2014-07-11", "authors_parsed": [["Cuchiero", "Christa", ""], ["Teichmann", "Josef", ""]]}, {"id": "1406.5646", "submitter": "Ahmet Goncu", "authors": "Ahmet Goncu", "title": "Statistical Arbitrage in the Black-Scholes Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this study we prove the existence of statistical arbitrage opportunities\nin the Black-Scholes framework by considering trading strategies that consists\nof borrowing from the risk free rate and taking a long position in the stock\nuntil it hits a deterministic barrier level. We derive analytical formulas for\nthe expected value, variance, and probability of loss for the discounted\ncumulative trading profits. No-statistical arbitrage condition is derived for\nthe Black-Scholes framework, which imposes a constraint on the Sharpe ratio of\nthe stock. Furthermore, we verify our theoretical results via extensive Monte\nCarlo simulations.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jun 2014 19:18:48 GMT"}, {"version": "v2", "created": "Fri, 18 Jul 2014 19:51:47 GMT"}, {"version": "v3", "created": "Tue, 29 Jul 2014 07:04:40 GMT"}, {"version": "v4", "created": "Sat, 30 Aug 2014 12:17:57 GMT"}], "update_date": "2014-09-02", "authors_parsed": [["Goncu", "Ahmet", ""]]}, {"id": "1406.6951", "submitter": "Luciano Campi", "authors": "Luciano Campi, Ismail Laachir, Claude Martini", "title": "Change of numeraire in the two-marginals martingale transport problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we apply change of numeraire techniques to the optimal\ntransport approach for computing model-free prices of derivatives in a two\nperiods model. In particular, we consider the optimal transport plan\nconstructed in \\cite{HobsonKlimmek2013} as well as the one introduced in\n\\cite{BeiglJuil} and further studied in \\cite{BrenierMartingale}. We show that,\nin the case of positive martingales, a suitable change of numeraire applied to\n\\cite{HobsonKlimmek2013} exchanges forward start straddles of type I and type\nII, so that the optimal transport plan in the subhedging problems is the same\nfor both types of options. Moreover, for \\cite{BrenierMartingale}'s\nconstruction, the right monotone transference plan can be viewed as a mirror\ncoupling of its left counterpart under the change of numeraire. An application\nto stochastic volatility models is also provided.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jun 2014 17:33:01 GMT"}, {"version": "v2", "created": "Mon, 30 Jun 2014 23:02:42 GMT"}, {"version": "v3", "created": "Mon, 1 Sep 2014 18:23:22 GMT"}, {"version": "v4", "created": "Tue, 1 Mar 2016 17:06:20 GMT"}], "update_date": "2016-03-02", "authors_parsed": [["Campi", "Luciano", ""], ["Laachir", "Ismail", ""], ["Martini", "Claude", ""]]}, {"id": "1406.7604", "submitter": "Xin Zhang", "authors": "Xiaoxiao Zheng and Xin Zhang", "title": "Optimal investment-reinsurance policy under a long-term perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we assume an insure is allowed to purchase proportional\nreinsurance and can invest his or her wealth into the financial market where a\nsavings account, stocks and bonds are available. Different from classical\noptimal investment and reinsurance problem, this paper studies the insurer's\nlong-term investment decision. Under this setting, our model consider the\ninterest risk and the inflation risk. Specifically, we suppose the interest\nrate follows a stochastic process, while price index is described by a\nclassical model. By solving Hamilton-Jacobi-Bellman equation, the closed-form\nexpression of the optimal policy is obtained. Further, we prove the\ncorresponding verification theorem without the usual Lipschitz condition. In\nthe end, numerical examples are made to illustrate the difference of the\noptimal polices under Ho-lee model and Vasicek model.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2014 04:57:02 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Zheng", "Xiaoxiao", ""], ["Zhang", "Xin", ""]]}, {"id": "1406.7606", "submitter": "Xin Zhang", "authors": "Xiaoxiao Zheng and Xin Zhang", "title": "Optimal Hybrid Dividend Strategy Under The Markovian Regime-Switching\n  Economy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the optimal dividend problem for a company. We\ndescribe the surplus process of the company by a diffusion model with regime\nswitching. The aim of the company is to choose a dividend policy to maximize\nthe expected total discounted payments until ruin. In this article, we consider\na hybrid dividend strategy, that is, the company is allowed to conduct\ncontinuous dividend strategy as well as impulsive dividend strategy. In\naddition, we consider the change of economy, which is characterized by a\nmarkovian regime-switching, and under the setting of two regimes, we solve the\nproblem and obtain the analytical solution for the value function.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2014 05:03:41 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Zheng", "Xiaoxiao", ""], ["Zhang", "Xin", ""]]}]