[{"id": "1501.00273", "submitter": "Luciano Campi", "authors": "Ren\\'e A\\\"id, Luciano Campi, Delphine Lautier", "title": "On the spot-futures no-arbitrage relations in commodity markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In commodity markets the convergence of futures towards spot prices, at the\nexpiration of the contract, is usually justified by no-arbitrage arguments. In\nthis article, we propose an alternative approach that relies on the expected\nprofit maximization problem of an agent, producing and storing a commodity\nwhile trading in the associated futures contracts. In this framework, the\nrelation between the spot and the futures prices holds through the\nwell-posedness of the maximization problem. We show that the futures price can\nstill be seen as the risk-neutral expectation of the spot price at maturity and\nwe propose an explicit formula for the forward volatility. Moreover, we provide\nan heuristic analysis of the optimal solution for the\nproduction/storage/trading problem, in a Markovian setting. This approach is\nparticularly interesting in the case of energy commodities, like electricity:\nthis framework indeed remains suitable for commodities characterized by\nstorability constraints, when standard no-arbitrage arguments cannot be safely\napplied.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jan 2015 12:19:39 GMT"}, {"version": "v2", "created": "Mon, 27 Apr 2015 15:19:03 GMT"}, {"version": "v3", "created": "Sat, 24 Feb 2018 17:59:04 GMT"}], "update_date": "2018-02-27", "authors_parsed": [["Aïd", "René", ""], ["Campi", "Luciano", ""], ["Lautier", "Delphine", ""]]}, {"id": "1501.00837", "submitter": "Alexander Schied", "authors": "Alexander Schied", "title": "On a class of generalized Takagi functions with linear pathwise\n  quadratic variation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.CA q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a class $\\mathscr{X}$ of continuous functions on $[0,1]$ that is\nof interest from two different perspectives. First, it is closely related to\nsets of functions that have been studied as generalizations of the Takagi\nfunction. Second, each function in $\\mathscr{X}$ admits a linear pathwise\nquadratic variation and can thus serve as an integrator in F\\\"ollmer's pathwise\nIt\\=o calculus. We derive several uniform properties of the class\n$\\mathscr{X}$. For instance, we compute the overall pointwise maximum, the\nuniform maximal oscillation, and the exact uniform modulus of continuity for\nall functions in $\\mathscr{X}$. Furthermore, we give an example of a pair\n$x,y\\in\\mathscr{X}$ such that the quadratic variation of the sum $x+y$ does not\nexist.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jan 2015 12:26:09 GMT"}, {"version": "v2", "created": "Thu, 8 Jan 2015 22:12:38 GMT"}, {"version": "v3", "created": "Tue, 7 Jul 2015 17:03:57 GMT"}, {"version": "v4", "created": "Tue, 4 Aug 2015 11:53:56 GMT"}, {"version": "v5", "created": "Thu, 13 Aug 2015 08:48:45 GMT"}], "update_date": "2015-08-14", "authors_parsed": [["Schied", "Alexander", ""]]}, {"id": "1501.00843", "submitter": "Ulrich Horst", "authors": "Ulrich Horst and Michael Paulsen", "title": "A law of large numbers for limit order books", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a stochastic model of a two-sided limit order book in terms of its\nkey quantities \\textit{best bid [ask] price} and the \\textit{standing buy\n[sell] volume density}. For a simple scaling of the discreteness parameters,\nthat keeps the expected volume rate over the considered price interval\ninvariant, we prove a limit theorem. The limit theorem states that, given\nregularity conditions on the random order flow, the key quantities converge in\nprobability to a tractable continuous limiting model. In the limit model the\nbuy and sell volume densities are given as the unique solution to first-order\nlinear hyperbolic PDEs, specified by the expected order flow parameters.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jan 2015 12:58:28 GMT"}], "update_date": "2015-01-06", "authors_parsed": [["Horst", "Ulrich", ""], ["Paulsen", "Michael", ""]]}, {"id": "1501.01954", "submitter": "Sergey Sosnovskiy", "authors": "Sergey Sosnovskiy", "title": "On financial applications of the two-parameter Poisson-Dirichlet\n  distribution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Capital distribution curve is defined as log-log plot of normalized stock\ncapitalizations ranked in descending order. The curve displays remarkable\nstability over periods of time.\n  Theory of exchangeable distributions on set partitions, developed for\npurposes of mathematical genetics and recently applied in non-parametric\nBayesian statistics, provides probabilistic-combinatorial approach for analysis\nand modeling of the capital distribution curve. Framework of the two-parameter\nPoisson-Dirichlet distribution contains rich set of methods and tools,\nincluding infinite-dimensional diffusion process.\n  The purpose of this note is to introduce framework of exchangeable\ndistributions on partitions in the financial context. In particular, it is\nshown that averaged samples from the Poisson-Dirichlet distribution provide\napproximation to the capital distribution curves in equity markets. This\nsuggests that the two-parameter model can be employed for modelling evolution\nof market weights and prices fluctuating in stochastic equilibrium.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jan 2015 20:54:50 GMT"}, {"version": "v2", "created": "Tue, 7 Jul 2015 19:57:36 GMT"}, {"version": "v3", "created": "Wed, 8 Jul 2015 19:54:56 GMT"}], "update_date": "2015-07-09", "authors_parsed": [["Sosnovskiy", "Sergey", ""]]}, {"id": "1501.02007", "submitter": "Marcelo Righi", "authors": "Marcelo Brutti Righi, Paulo Sergio Ceretta", "title": "Shortfall Deviation Risk: An alternative to risk measurement", "comments": null, "journal-ref": "Journal of Risk 19, 81-116, 2016", "doi": "10.21314/JOR.2016.349", "report-no": null, "categories": "q-fin.RM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the Shortfall Deviation Risk (SDR), a risk measure that represents\nthe expected loss that occurs with certain probability penalized by the\ndispersion of results that are worse than such an expectation. SDR combines\nExpected Shortfall (ES) and Shortfall Deviation (SD), which we also introduce,\ncontemplating two fundamental pillars of the risk concept, the probability of\nadverse events and the variability of an expectation, and considers extreme\nresults. We demonstrate that SD is a generalized deviation measure, whereas SDR\nis a coherent risk measure. We achieve the dual representation of SDR, and we\ndiscuss issues such as its representation by a weighted ES, acceptance sets,\nconvexity, continuity and the relationship with stochastic dominance.\nIllustrations with real and simulated data allow us to conclude that SDR offers\ngreater protection in risk measurement compared with VaR and ES, especially in\ntimes of significant turbulence in riskier scenarios.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jan 2015 23:54:07 GMT"}, {"version": "v2", "created": "Fri, 13 Mar 2015 23:11:23 GMT"}, {"version": "v3", "created": "Fri, 2 Oct 2015 19:23:15 GMT"}, {"version": "v4", "created": "Tue, 10 May 2016 15:22:27 GMT"}], "update_date": "2020-08-04", "authors_parsed": [["Righi", "Marcelo Brutti", ""], ["Ceretta", "Paulo Sergio", ""]]}, {"id": "1501.02750", "submitter": "Chris Kenyon", "authors": "Chris Kenyon and Andrew Green", "title": "Self-Financing Trading and the Ito-Doeblin Lemma", "comments": "3 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of the note is to remind readers on how self-financing works in\nQuantitative Finance. The authors have observed continuing uncertainty on this\nissue which may be because it lies exactly at the intersection of stochastic\ncalculus and finance. The concept of a self-financing trading strategy was\noriginally, and carefully, introduced in (Harrison and Kreps 1979) and expanded\nvery generally in (Harrison and Pliska 1981).\n", "versions": [{"version": "v1", "created": "Mon, 12 Jan 2015 18:47:16 GMT"}], "update_date": "2015-01-13", "authors_parsed": [["Kenyon", "Chris", ""], ["Green", "Andrew", ""]]}, {"id": "1501.03123", "submitter": "Andrea Meireles Rodrigues", "authors": "Laurence Carassus, Mikl\\'os R\\'asonyi, Andrea M. Rodrigues", "title": "Non-concave utility maximisation on the positive real axis in discrete\n  time", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We treat a discrete-time asset allocation problem in an arbitrage-free,\ngenerically incomplete financial market, where the investor has a possibly\nnon-concave utility function and wealth is restricted to remain non-negative.\nUnder easily verifiable conditions, we establish the existence of optimal\nportfolios.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jan 2015 19:31:27 GMT"}, {"version": "v2", "created": "Wed, 22 Apr 2015 14:51:28 GMT"}], "update_date": "2015-04-23", "authors_parsed": [["Carassus", "Laurence", ""], ["Rásonyi", "Miklós", ""], ["Rodrigues", "Andrea M.", ""]]}, {"id": "1501.03387", "submitter": "Francesco Caravenna", "authors": "Francesco Caravenna and Jacopo Corbetta", "title": "The asymptotic smile of a multiscaling stochastic volatility model", "comments": "36 pages, 3 figures. Final version, to appear in Stochastic Process.\n  Appl", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a stochastic volatility model which captures relevant stylized\nfacts of financial series, including the multi-scaling of moments. The\nvolatility evolves according to a generalized Ornstein-Uhlenbeck processes with\nsuper-linear mean reversion.\n  Using large deviations techniques, we determine the asymptotic shape of the\nimplied volatility surface in any regime of small maturity $t \\to 0$ or extreme\nlog-strike $|\\kappa| \\to \\infty$ (with bounded maturity). Even if the price has\ncontinuous paths, out-of-the-money implied volatility diverges for small\nmaturity, producing a very pronounced smile.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jan 2015 16:10:32 GMT"}, {"version": "v2", "created": "Mon, 31 Aug 2015 21:28:11 GMT"}, {"version": "v3", "created": "Wed, 5 Oct 2016 15:38:47 GMT"}, {"version": "v4", "created": "Thu, 6 Jul 2017 14:05:36 GMT"}], "update_date": "2017-07-07", "authors_parsed": [["Caravenna", "Francesco", ""], ["Corbetta", "Jacopo", ""]]}, {"id": "1501.04274", "submitter": "Constantinos Kardaras", "authors": "Ioannis Karatzas and Constantinos Kardaras", "title": "Optional Decomposition for continuous semimartingales under arbitrary\n  filtrations", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an elementary treatment of the Optional Decomposition Theorem for\ncontinuous semimartingales and general filtrations. This treatment does not\nassume the existence of equivalent local martingale measure(s), only that of\nstrictly positive local martingale deflator(s).\n", "versions": [{"version": "v1", "created": "Sun, 18 Jan 2015 09:17:04 GMT"}, {"version": "v2", "created": "Wed, 4 Feb 2015 19:50:50 GMT"}], "update_date": "2015-02-05", "authors_parsed": [["Karatzas", "Ioannis", ""], ["Kardaras", "Constantinos", ""]]}, {"id": "1501.04548", "submitter": "Rohini Kumar", "authors": "Rohini Kumar", "title": "Effect of Volatility Clustering on Indifference Pricing of Options by\n  Convex Risk Measures", "comments": "Applied Mathematical Finance, 2014", "journal-ref": null, "doi": "10.1080/1350486X.2014.949805", "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we look at the effect of volatility clustering on the risk\nindifference price of options described by Sircar and Sturm in their paper\n(Sircar, R., & Sturm, S. (2012). From smile asymptotics to market risk\nmeasures. Mathematical Finance. Advance online publication.\ndoi:10.1111/mafi.12015). The indifference price in their article is obtained by\nusing dynamic convex risk measures given by backward stochastic differential\nequations. Volatility clustering is modelled by a fast mean-reverting\nvolatility in a stochastic volatility model for stock price. Asymptotics of the\nindifference price of options and their corresponding implied volatility are\nobtained in this article, as the mean-reversion time approaches zero.\nCorrection terms to the asymptotic option price and implied volatility are also\nobtained.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jan 2015 16:45:32 GMT"}], "update_date": "2015-01-20", "authors_parsed": [["Kumar", "Rohini", ""]]}, {"id": "1501.06980", "submitter": "Masaaki Fukasawa", "authors": "Masaaki Fukasawa", "title": "Short-time at-the-money skew and rough fractional volatility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Black-Scholes implied volatility skew at the money of SPX options is\nknown to obey a power law with respect to the time-to-maturity. We construct a\nmodel of the underlying asset price process which is dynamically consistent to\nthe power law. The volatility process of the model is driven by a fractional\nBrownian motion with Hurst parameter less than half. The fractional Brownian\nmotion is correlated with a Brownian motion which drives the asset price\nprocess. We derive an asymptotic expansion of the implied volatility as the\ntime-to-maturity tends to zero. For this purpose we introduce a new approach to\nvalidate such an expansion, which enables us to treat more general models than\nin the literature. The local-stochastic volatility model is treated as well\nunder an essentially minimal regularity condition in order to show such a\nstandard model cannot be dynamically consistent to the power law.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jan 2015 03:11:10 GMT"}], "update_date": "2015-01-29", "authors_parsed": [["Fukasawa", "Masaaki", ""]]}, {"id": "1501.07473", "submitter": "Yannis Yatracos", "authors": "Yannis G. Yatracos", "title": "Information in stock prices and some consequences: A model-free approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The price of a stock will rarely follow the assumed model and a curious\ninvestor or a Regulatory Authority may wish to obtain a probability model the\nprices support. A risk neutral probability ${\\cal P}^*$ for the stock's price\nat time $T$ is determined in closed form from the prices before $T$ without\nassuming a price model. The findings indicate that ${\\cal P}^*$ may be a\nmixture. Under mild conditions on the prices the necessary and sufficient\ncondition to obtain ${\\cal P}^*$ is the coincidence at $T$ of the stock price\nranges assumed by the stock's trader and buyer. This result clarifies the\nrelation between market's informational efficiency and the arbitrage-free\noption pricing methodology. It also shows that in an incomplete market there\nare risk neutral probabilities not supported by each stock and their use can be\nlimited. ${\\cal P}^*$-price $C$ for the stock's European call option expiring\nat $T$ is obtained. Among other results it is shown for \"calm\" prices, like the\nlog-normal, that i) $C$ is the Black-Scholes-Merton price thus confirming its\nvalidity for various stock prices, ii) the buyer's price carries an\nexponentially increasing volatility premium and its difference with $C$\nprovides a measure of the market risk premium.\n", "versions": [{"version": "v1", "created": "Sat, 24 Jan 2015 19:27:57 GMT"}, {"version": "v2", "created": "Sat, 20 Jun 2015 22:25:47 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Yatracos", "Yannis G.", ""]]}, {"id": "1501.07480", "submitter": "Oliver Janke", "authors": "Oliver Janke and Qinghua Li", "title": "Portfolio Optimization under Shortfall Risk Constraint", "comments": "25 pages, Optimization, 2016", "journal-ref": "Optimization, 65(9), 1733-1755 (2016)", "doi": "10.1080/02331934.2016.1173693", "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper solves a utility maximization problem under utility-based\nshortfall risk constraint, by proposing an approach using Lagrange multiplier\nand convex duality. Under mild conditions on the asymptotic elasticity of the\nutility function and the loss function, we find an optimal wealth process for\nthe constrained problem and characterize the bi-dual relation between the\nrespective value functions of the constrained problem and its dual. This\napproach applies to both complete and incomplete markets. Moreover, the\nextension to more complicated cases is illustrated by solving the problem with\na consumption process added. Finally, we give an example of utility and loss\nfunctions in the Black-Scholes market where the solutions have explicit forms.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jan 2015 15:28:55 GMT"}, {"version": "v2", "created": "Thu, 12 Feb 2015 08:15:44 GMT"}, {"version": "v3", "created": "Tue, 2 Jun 2015 15:52:05 GMT"}, {"version": "v4", "created": "Wed, 20 Apr 2016 07:00:02 GMT"}], "update_date": "2016-06-28", "authors_parsed": [["Janke", "Oliver", ""], ["Li", "Qinghua", ""]]}, {"id": "1501.07504", "submitter": "Helio de Oliveira M.", "authors": "J.E. Wesen, V.VV. Vermehren and H.M. de Oliveira", "title": "Adaptive Filter Design for Stock Market Prediction Using a\n  Correlation-based Criterion", "comments": "Quantitative Finance? 9 pages, 9 figures, 1 table. Conference: XLIII\n  Simposio Brasileiro de Pesquisa Operacional, August 2011, Ubatuba-SP, Brazil", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-fin.GN q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a novel adaptive-filter approach for predicting assets on\nthe stock markets. Concepts are introduced here, which allow understanding this\nmethod and computing of the corresponding forecast. This approach is applied,\nas an example, through the prediction over the actual valuation of the PETR3\nshares (Petrobras ON) traded in the Brazilian Stock Market. The first-rate\nchoices of the window length and the number of filter coefficient are\nevaluated. This is done by observing the correlation between the predictor\nsignal and the actual course performed by the market in terms of both the\nwindow prevision length and filter coefficient values. It is shown that such\nadaptive predictors furnish, on the average, very substantial profit on the\ninvested amount.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jan 2015 16:41:33 GMT"}], "update_date": "2020-05-08", "authors_parsed": [["Wesen", "J. E.", ""], ["Vermehren", "V. VV.", ""], ["de Oliveira", "H. M.", ""]]}]