[{"id": "1506.00082", "submitter": "Yao Tung Huang", "authors": "Yao Tung Huang, Qingshuo Song, Harry Zheng", "title": "Weak Convergence of Path-Dependent SDEs in Basket CDS Pricing with\n  Contagion Risk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the computational aspects of the basket CDS pricing with\ncounterparty risk under a credit contagion model of multinames. This model\nenables us to capture the systematic volatility increases in the market\ntriggered by a particular bankruptcy. The drawback of this problem is its\nanalytical complication due to its path-dependent functional, which bears a\npotential failure in its convergence of numerical approximation under standing\nassumptions. In this paper we find sufficient conditions for the desired\nconvergence of the functionals associated with a class of path-dependent\nstochastic differential equations. The main ingredient is to identify the weak\nconvergence of the approximated solution to the underlying path-dependent\nstochastic differential equation.\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2015 07:19:08 GMT"}, {"version": "v2", "created": "Fri, 11 Dec 2015 01:09:42 GMT"}, {"version": "v3", "created": "Sun, 8 May 2016 15:01:30 GMT"}], "update_date": "2016-05-10", "authors_parsed": [["Huang", "Yao Tung", ""], ["Song", "Qingshuo", ""], ["Zheng", "Harry", ""]]}, {"id": "1506.00166", "submitter": "Bahman Angoshtari", "authors": "Bahman Angoshtari, Erhan Bayraktar, Virginia R. Young", "title": "Optimal Investment to Minimize the Probability of Drawdown", "comments": "To appear in Stochastics. Keywords: Optimal investment, stochastic\n  optimal control, probability of drawdown", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We determine the optimal investment strategy in a Black-Scholes financial\nmarket to minimize the so-called {\\it probability of drawdown}, namely, the\nprobability that the value of an investment portfolio reaches some fixed\nproportion of its maximum value to date. We assume that the portfolio is\nsubject to a payout that is a deterministic function of its value, as might be\nthe case for an endowment fund paying at a specified rate, for example, at a\nconstant rate or at a rate that is proportional to the fund's value.\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2015 21:12:14 GMT"}, {"version": "v2", "created": "Mon, 15 Feb 2016 18:07:26 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Angoshtari", "Bahman", ""], ["Bayraktar", "Erhan", ""], ["Young", "Virginia R.", ""]]}, {"id": "1506.00188", "submitter": "Daniel Schwarz", "authors": "Daniel C. Schwarz", "title": "Market Completion with Derivative Securities", "comments": null, "journal-ref": "Finance and Stochastics, 21(1), pp. 263-284, 2017", "doi": "10.1007/s00780-016-0317-z", "report-no": null, "categories": "q-fin.MF math.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $S^F$ be a $\\mathbb{P}$-martingale representing the price of a primitive\nasset in an incomplete market framework. We present easily verifiable\nconditions on model coefficients which guarantee the completeness of the market\nin which in addition to the primitive asset one may also trade a derivative\ncontract $S^B$. Both $S^F$ and $S^B$ are defined in terms of the solution $X$\nto a $2$-dimensional stochastic differential equation: $S^F_t = f(X_t)$ and\n$S^B_t:=\\mathbb{E}[g(X_1) | \\mathcal{F}_t]$. From a purely mathematical point\nof view we prove that every local martingale under $\\mathbb{P}$ can be\nrepresented as a stochastic integral with respect to the\n$\\mathbb{P}$-martingale $S := (S^F\\ S^B)$. Notably, in contrast to recent\nresults on the endogenous completeness of equilibria markets, our conditions\nallow the Jacobian matrix of $(f,g)$ to be singular everywhere on\n$\\mathbf{R}^2$. Hence they cover, as a special case, the prominent example of a\nstochastic volatility model being completed with a European call (or put)\noption.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 03:02:07 GMT"}], "update_date": "2017-01-10", "authors_parsed": [["Schwarz", "Daniel C.", ""]]}, {"id": "1506.00396", "submitter": "Takuji Arai", "authors": "Takuji Arai", "title": "Good deal bounds with convex constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the structure of good deal bounds, which are subintervals of a\nno-arbitrage pricing bound, for financial market models with convex constraints\nas an extension of Arai and Fukasawa (2014). The upper and lower bounds of a\ngood deal bound are naturally described by a convex risk measure. We call such\na risk measure a good deal valuation; and study its properties. We also discuss\nsuperhedging cost and Fundamental Theorem of Asset Pricing for convex\nconstrained markets.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2015 09:05:10 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Arai", "Takuji", ""]]}, {"id": "1506.00535", "submitter": "Moawia Alghalith", "authors": "Moawia Alghalith", "title": "New exact Taylor's expansions and simple solutions to PDEs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide new exact Taylor's series with fixed coefficients and without the\nremainder. We demonstrate the usefulness of this contribution by using it to\nobtain very simple solutions to (non-linear) PDEs. We also apply the method to\nthe portfolio model.\n", "versions": [{"version": "v1", "created": "Fri, 27 Mar 2015 14:29:53 GMT"}, {"version": "v2", "created": "Sun, 13 Sep 2015 15:53:59 GMT"}, {"version": "v3", "created": "Mon, 16 Nov 2015 23:19:47 GMT"}], "update_date": "2015-11-18", "authors_parsed": [["Alghalith", "Moawia", ""]]}, {"id": "1506.00806", "submitter": "Antoine Kornprobst", "authors": "Antoine Kornprobst, Raphael Douady", "title": "An Empirical Approach to Financial Crisis Indicators Based on Random\n  Matrices", "comments": "Added better graphics for the protective put strategy", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this work is to build financial crisis indicators based on\nspectral properties of the dynamics of market data. After choosing an optimal\nsize for a rolling window, the historical market data in this window is seen\nevery trading day as a random matrix from which a covariance and a correlation\nmatrix are obtained. The financial crisis indicators that we have built deal\nwith the spectral properties of these covariance and correlation matrices and\nthey are of two kinds. The first one is based on the Hellinger distance,\ncomputed between the distribution of the eigenvalues of the empirical\ncovariance matrix and the distribution of the eigenvalues of a reference\ncovariance matrix representing either a calm or agitated market. The idea\nbehind this first type of indicators is that when the empirical distribution of\nthe spectrum of the covariance matrix is deviating from the reference in the\nsense of Hellinger, then a crisis may be forthcoming. The second type of\nindicators is based on the study of the spectral radius and the trace of the\ncovariance and correlation matrices as a mean to directly study the volatility\nand correlations inside the market. The idea behind the second type of\nindicators is the fact that large eigenvalues are a sign of dynamic\ninstability. The predictive power of the financial crisis indicators in this\nframework is then demonstrated, in particular by using them as decision-making\ntools in a protective-put strategy.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 09:24:31 GMT"}, {"version": "v2", "created": "Mon, 31 Aug 2015 21:55:28 GMT"}, {"version": "v3", "created": "Mon, 31 Oct 2016 12:03:09 GMT"}, {"version": "v4", "created": "Thu, 9 Mar 2017 15:00:30 GMT"}, {"version": "v5", "created": "Sun, 13 Aug 2017 19:13:54 GMT"}, {"version": "v6", "created": "Fri, 8 Sep 2017 13:51:03 GMT"}], "update_date": "2017-09-11", "authors_parsed": [["Kornprobst", "Antoine", ""], ["Douady", "Raphael", ""]]}, {"id": "1506.01477", "submitter": "Takuji Arai", "authors": "Takuji Arai", "title": "Local risk-minimization for Barndorff-Nielsen and Shephard models with\n  volatility risk premium", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive representations of local risk-minimization of call and put options\nfor Barndorff-Nielsen and Shephard models: jump type stochastic volatility\nmodels whose squared volatility process is given by a non-Gaussian\nrnstein-Uhlenbeck process. The general form of Barndorff-Nielsen and Shephard\nmodels includes two parameters: volatility risk premium $\\beta$ and leverage\neffect $\\rho$. Arai and Suzuki (2015, arxiv:1503.08589) dealt with the same\nproblem under constraint $\\beta=-\\frac{1}{2}$. In this paper, we relax the\nrestriction on $\\beta$; and restrict $\\rho$ to $0$ instead. We introduce a\nMalliavin calculus under the minimal martingale measure to solve the problem.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2015 06:55:50 GMT"}], "update_date": "2015-06-05", "authors_parsed": [["Arai", "Takuji", ""]]}, {"id": "1506.01837", "submitter": "Tom Fischer Prof. Dr.", "authors": "Tom Fischer", "title": "No-Arbitrage Prices of Cash Flows and Forward Contracts as Choquet\n  Representations", "comments": "JEL Classification: G12, G13", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a market of deterministic cash flows, given as an additive, symmetric\nrelation of exchangeability on the finite signed Borel measures on the\nnon-negative real time axis, it is shown that the only arbitrage-free price\nfunctional that fulfills some additional mild requirements is the integral of\nthe unit zero-coupon bond prices with respect to the payment measures. For\nprobability measures, this is a Choquet representation, where the Dirac\nmeasures, as unit zero-coupon bonds, are the extreme points. Dropping one of\nthe requirements, the Lebesgue decomposition is used to construct\ncounterexamples, where the Choquet price formula does not hold despite of an\narbitrage-free market model. The concept is then extended to deterministic\nstreams of assets and currencies in general, yielding a valuation principle for\nforward markets. Under mild assumptions, it is shown that a foreign cash flow's\nworth in local currency is identical to the value of the cash flow in local\ncurrency for which the Radon-Nikodym derivative with respect to the foreign\ncash flow is the forward FX rate.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2015 09:34:24 GMT"}, {"version": "v2", "created": "Fri, 19 Jun 2015 14:28:56 GMT"}, {"version": "v3", "created": "Sat, 27 Jun 2015 15:22:15 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Fischer", "Tom", ""]]}, {"id": "1506.02074", "submitter": "Matthew Lorig", "authors": "Tim Leung, Matthew Lorig", "title": "Optimal Static Quadratic Hedging", "comments": "33 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a flexible framework for hedging a contingent claim by holding\nstatic positions in vanilla European calls, puts, bonds, and forwards. A\nmodel-free expression is derived for the optimal static hedging strategy that\nminimizes the expected squared hedging error subject to a cost constraint. The\noptimal hedge involves computing a number of expectations that reflect the\ndependence among the contingent claim and the hedging assets. We provide a\ngeneral method for approximating these expectations analytically in a general\nMarkov diffusion market. To illustrate the versatility of our approach, we\npresent several numerical examples, including hedging path-dependent options\nand options written on a correlated asset.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2015 21:43:59 GMT"}, {"version": "v2", "created": "Thu, 19 Nov 2015 00:16:57 GMT"}], "update_date": "2015-11-20", "authors_parsed": [["Leung", "Tim", ""], ["Lorig", "Matthew", ""]]}, {"id": "1506.04063", "submitter": "Gaoyue Guo", "authors": "Gaoyue Guo, Xiaolu Tan and Nizar Touzi", "title": "Optimal Skorokhod embedding under finitely-many marginal constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Skorokhod embedding problem aims to represent a given probability measure\non the real line as the distribution of Brownian motion stopped at a chosen\nstopping time. In this paper, we consider an extension of the optimal Skorokhod\nembedding problem to the case of finitely-many marginal constraints. Using the\nclassical convex duality approach together with the optimal stopping theory, we\nobtain the duality results which are formulated by means of probability\nmeasures on an enlarged space. We also relate these results to the problem of\nmartingale optimal transport under multiple marginal constraints.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 16:36:38 GMT"}, {"version": "v2", "created": "Wed, 3 Aug 2016 13:28:58 GMT"}], "update_date": "2016-08-04", "authors_parsed": [["Guo", "Gaoyue", ""], ["Tan", "Xiaolu", ""], ["Touzi", "Nizar", ""]]}, {"id": "1506.06608", "submitter": "Marco Maggis Doctor", "authors": "Matteo Burzoni, Marco Frittelli, Marco Maggis", "title": "Model-free Superhedging Duality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a model free discrete time financial market, we prove the superhedging\nduality theorem, where trading is allowed with dynamic and semi-static\nstrategies. We also show that the initial cost of the cheapest portfolio that\ndominates a contingent claim on every possible path $\\omega \\in \\Omega$, might\nbe strictly greater than the upper bound of the no-arbitrage prices. We\ntherefore characterize the subset of trajectories on which this duality gap\ndisappears and prove that it is an analytic set.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 13:59:40 GMT"}, {"version": "v2", "created": "Mon, 29 Jun 2015 10:03:41 GMT"}, {"version": "v3", "created": "Mon, 2 May 2016 13:39:53 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Burzoni", "Matteo", ""], ["Frittelli", "Marco", ""], ["Maggis", "Marco", ""]]}, {"id": "1506.06979", "submitter": "Dmitry Lesnik", "authors": "Dmitry Lesnik", "title": "Intrinsic Storage Valuation by Variational Analysis", "comments": "arXiv admin note: text overlap with arXiv:1011.1234", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC nlin.CD q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mathematical problem concerning intrinsic storage optimisation is\nformulated and solved by means of variational analysis. The solution, though\nobtained in implicit form, still sheds light on many important features of the\noptimal exercise strategy. It is shown how the solution depends on different\nconstraint types including carry cost and cycle constraint. Additionally, the\nrelationship between intrinsic and stochastic solutions is investigated. In\nparticular, we show that the optimal stochastic exercise decision is always\nclose to the intrinsic one.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 17:27:15 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Lesnik", "Dmitry", ""]]}, {"id": "1506.07163", "submitter": "Sergey Sosnovskiy", "authors": "Sergey Sosnovskiy", "title": "Market shape formation, statistical equilibrium and neutral evolution\n  theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical methods of population genetics and framework of exchangeability\nprovide a Markov chain model for analysis and interpretation of stochastic\nbehaviour of equity markets, explaining, in particular, market shape formation,\nstatistical equilibrium and temporal stability of market weights.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2015 19:58:00 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Sosnovskiy", "Sergey", ""]]}, {"id": "1506.07212", "submitter": "Rafael Frongillo", "authors": "Rafael Frongillo, Ian A. Kash", "title": "Elicitation Complexity of Statistical Properties", "comments": "This version fixes an error in the condition needed for the main\n  lower bound and adds an application to Range Value at Risk, along with a\n  substantial reorganization of the paper and numerous smaller changes. A\n  previous version appeared in Neural Information Processing Systems 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG math.OC math.ST q-fin.MF stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A property, or statistical functional, is said to be elicitable if it\nminimizes expected loss for some loss function. The study of which properties\nare elicitable sheds light on the capabilities and limitations of point\nestimation and empirical risk minimization. While recent work asks which\nproperties are elicitable, we instead advocate for a more nuanced question: how\nmany dimensions are required to indirectly elicit a given property? This number\nis called the elicitation complexity of the property. We lay the foundation for\na general theory of elicitation complexity, including several basic results\nabout how elicitation complexity behaves, and the complexity of standard\nproperties of interest. Building on this foundation, our main result gives\ntight complexity bounds for the broad class of Bayes risks. We apply these\nresults to several properties of interest, including variance, entropy, norms,\nand several classes of financial risk measures. We conclude with discussion and\nopen directions.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2015 23:22:05 GMT"}, {"version": "v2", "created": "Mon, 8 Oct 2018 00:45:54 GMT"}, {"version": "v3", "created": "Thu, 27 Aug 2020 20:42:55 GMT"}], "update_date": "2020-08-31", "authors_parsed": [["Frongillo", "Rafael", ""], ["Kash", "Ian A.", ""]]}, {"id": "1506.08127", "submitter": "Zorana Grbac", "authors": "David Criens, Kathrin Glau, Zorana Grbac", "title": "Martingale property of exponential semimartingales: a note on explicit\n  conditions and applications to financial models", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a collection of explicit sufficient conditions for the true\nmartingale property of a wide class of exponentials of semimartingales. We\nexpress the conditions in terms of semimartingale characteristics. This turns\nout to be very convenient in financial modeling in general. Especially it\nallows us to carefully discuss the question of well-definedness of\nsemimartingale Libor models, whose construction crucially relies on a sequence\nof measure changes.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2015 15:51:08 GMT"}, {"version": "v2", "created": "Thu, 11 Aug 2016 14:39:59 GMT"}], "update_date": "2016-08-12", "authors_parsed": [["Criens", "David", ""], ["Glau", "Kathrin", ""], ["Grbac", "Zorana", ""]]}, {"id": "1506.08408", "submitter": "David Landriault", "authors": "David Landriault, Bin Li, Hongzhong Zhang", "title": "On magnitude, asymptotics and duration of drawdowns for L\\'{e}vy models", "comments": "Published at http://dx.doi.org/10.3150/15-BEJ748 in the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2017, Vol. 23, No. 1, 432-458", "doi": "10.3150/15-BEJ748", "report-no": "IMS-BEJ-BEJ748", "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers magnitude, asymptotics and duration of drawdowns for\nsome L\\'{e}vy processes. First, we revisit some existing results on the\nmagnitude of drawdowns for spectrally negative L\\'{e}vy processes using an\napproximation approach. For any spectrally negative L\\'{e}vy process whose\nscale functions are well-behaved at $0+$, we then study the asymptotics of\ndrawdown quantities when the threshold of drawdown magnitude approaches zero.\nWe also show that such asymptotics is robust to perturbations of additional\npositive compound Poisson jumps. Finally, thanks to the asymptotic results and\nsome recent works on the running maximum of L\\'{e}vy processes, we derive the\nlaw of duration of drawdowns for a large class of L\\'{e}vy processes (with a\ngeneral spectrally negative part plus a positive compound Poisson structure).\nThe duration of drawdowns is also known as the \"Time to Recover\" (TTR) the\nhistorical maximum, which is a widely used performance measure in the fund\nmanagement industry. We find that the law of duration of drawdowns\nqualitatively depends on the path type of the spectrally negative component of\nthe underlying L\\'{e}vy process.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jun 2015 14:49:21 GMT"}, {"version": "v2", "created": "Fri, 30 Sep 2016 07:44:20 GMT"}], "update_date": "2016-10-03", "authors_parsed": [["Landriault", "David", ""], ["Li", "Bin", ""], ["Zhang", "Hongzhong", ""]]}, {"id": "1506.09184", "submitter": "Erhan Bayraktar", "authors": "Erhan Bayraktar and Song Yao", "title": "On the Robust Dynkin Game", "comments": "To appear in Annals of Applied Probability. Keywords: robust Dynkin\n  game, nonlinear expectation, dynamic programming principle, controls in weak\n  formulation, weak stability under pasting, martingale approach,\n  path-dependent stochastic differential equations with controls, optimal\n  triplet, optimal stopping with random maturity", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a robust Dynkin game over a set of mutually singular probabilities.\nWe first prove that for the conservative player of the game, her lower and\nupper value processes coincide (i.e. She has a value process $V $ in the game).\nSuch a result helps people connect the robust Dynkin game with second-order\ndoubly reflected backward stochastic differential equations. Also, we show that\nthe value process $V$ is a submartingale under an appropriately defined\nnonlinear expectations up to the first time $\\tau_*$ when $V$ meets the lower\npayoff process $L$. If the probability set is weakly compact, one can even find\nan optimal triplet. The mutual singularity of probabilities in causes major\ntechnical difficulties. To deal with them, we use some new methods including\ntwo approximations with respect to the set of stopping times. The mutual\nsingularity of probabilities causes major technical difficulties. To deal with\nthem, we use some new methods including two approximations with respect to the\nset of stopping times\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2015 18:08:10 GMT"}, {"version": "v2", "created": "Wed, 15 Jul 2015 00:06:40 GMT"}, {"version": "v3", "created": "Mon, 12 Sep 2016 01:22:36 GMT"}], "update_date": "2016-09-13", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Yao", "Song", ""]]}]