[{"id": "1507.00208", "submitter": "Alessandro Gnoatto", "authors": "Francesca Biagini, Alessandro Gnoatto, Maximilian H\\\"artel", "title": "The Long-Term Swap Rate and a General Analysis of Long-Term Interest\n  Rates", "comments": "29 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce here for the first time the long-term swap rate, characterised\nas the fair rate of an overnight indexed swap with infinitely many exchanges.\nFurthermore we analyse the relationship between the long-term swap rate, the\nlong-term yield, see Biagini et al. [2018], Biagini and H\\\"artel [2014], and El\nKaroui et al. [1997], and the long-term simple rate, considered in Brody and\nHughston [2016] as long-term discounting rate. We finally investigate the\nexistence of these long-term rates in two term structure methodologies, the\nFlesaker-Hughston model and the linear-rational model. A numerical example\nillustrates how our results can be used to estimate the non-optional component\nof a CoCo bond.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jul 2015 12:38:51 GMT"}, {"version": "v2", "created": "Tue, 18 Aug 2015 13:21:45 GMT"}, {"version": "v3", "created": "Mon, 24 Aug 2015 18:57:17 GMT"}, {"version": "v4", "created": "Thu, 24 Sep 2015 20:49:32 GMT"}, {"version": "v5", "created": "Sun, 16 Oct 2016 13:52:47 GMT"}, {"version": "v6", "created": "Fri, 14 Jun 2019 16:20:03 GMT"}], "update_date": "2019-06-17", "authors_parsed": [["Biagini", "Francesca", ""], ["Gnoatto", "Alessandro", ""], ["Härtel", "Maximilian", ""]]}, {"id": "1507.00294", "submitter": "Ramin Okhrati", "authors": "Ramin Okhrati and Uwe Schmock", "title": "It\\^o's formula for finite variation L\\'evy processes: The case of\n  non-smooth functions", "comments": null, "journal-ref": "Journal of Mathematical Analysis and Applications, 430, (2),\n  1163-1174 (2015)", "doi": "10.1016/j.jmaa.2015.05.025", "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extending It\\^o's formula to non-smooth functions is important both in theory\nand applications. One of the fairly general extensions of the formula, known as\nMeyer-It\\^o, applies to one dimensional semimartingales and convex functions.\nThere are also satisfactory generalizations of It\\^o's formula for diffusion\nprocesses where the Meyer-It\\^o assumptions are weakened even further. We study\na version of It\\^o's formula for multi-dimensional finite variation L\\'evy\nprocesses assuming that the underlying function is continuous and admits weak\nderivatives. We also discuss some applications of this extension, particularly\nin finance.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jul 2015 17:34:57 GMT"}], "update_date": "2015-07-02", "authors_parsed": [["Okhrati", "Ramin", ""], ["Schmock", "Uwe", ""]]}, {"id": "1507.00671", "submitter": "Marcel Nutz", "authors": "Mathias Beiglb\\\"ock, Marcel Nutz, Nizar Touzi", "title": "Complete Duality for Martingale Optimal Transport on the Line", "comments": "42 pages; forthcoming in 'Annals of Probability'", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimal transport between two probability measures on the real\nline, where the transport plans are laws of one-step martingales. A quasi-sure\nformulation of the dual problem is introduced and shown to yield a complete\nduality theory for general marginals and measurable reward (cost) functions:\nabsence of a duality gap and existence of dual optimizers. Both properties are\nshown to fail in the classical formulation. As a consequence of the duality\nresult, we obtain a general principle of cyclical monotonicity describing the\ngeometry of optimal transports.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jul 2015 17:32:17 GMT"}, {"version": "v2", "created": "Sun, 17 Apr 2016 22:00:31 GMT"}, {"version": "v3", "created": "Sun, 12 Jun 2016 22:41:08 GMT"}], "update_date": "2016-06-14", "authors_parsed": [["Beiglböck", "Mathias", ""], ["Nutz", "Marcel", ""], ["Touzi", "Nizar", ""]]}, {"id": "1507.02025", "submitter": "Ola Mahmoud", "authors": "Enrico G. De Giorgi and Ola Mahmoud", "title": "Diversification Preferences in the Theory of Choice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.MF q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Diversification represents the idea of choosing variety over uniformity.\nWithin the theory of choice, desirability of diversification is axiomatized as\npreference for a convex combination of choices that are equivalently ranked.\nThis corresponds to the notion of risk aversion when one assumes the\nvon-Neumann-Morgenstern expected utility model, but the equivalence fails to\nhold in other models. This paper studies axiomatizations of the concept of\ndiversification and their relationship to the related notions of risk aversion\nand convex preferences within different choice theoretic models. Implications\nof these notions on portfolio choice are discussed. We cover model-independent\ndiversification preferences, preferences within models of choice under risk,\nincluding expected utility theory and the more general rank-dependent expected\nutility theory, as well as models of choice under uncertainty axiomatized via\nChoquet expected utility theory. Remarks on interpretations of diversification\npreferences within models of behavioral choice are given in the conclusion.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jul 2015 04:54:08 GMT"}, {"version": "v2", "created": "Fri, 29 Apr 2016 11:02:28 GMT"}, {"version": "v3", "created": "Thu, 6 Oct 2016 07:54:47 GMT"}], "update_date": "2016-10-07", "authors_parsed": [["De Giorgi", "Enrico G.", ""], ["Mahmoud", "Ola", ""]]}, {"id": "1507.02974", "submitter": "Kasper Larsen", "authors": "Kasper Larsen, Tanawit Sae Sue", "title": "Radner equilibrium in incomplete Levy models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct continuous-time equilibrium models based on a finite number of\nexponential utility investors. The investors' income rates as well as the\nstock's dividend rate are governed by discontinuous Levy processes. Our main\nresult provides the equilibrium (i.e., bond and stock price dynamics) in\nclosed-form. As an application, we show that the equilibrium Sharpe ratio can\nbe increased and the equilibrium interest rate can be decreased\n(simultaneously) when the investors' income streams cannot be traded.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jul 2015 17:41:38 GMT"}, {"version": "v2", "created": "Mon, 13 Jul 2015 16:47:41 GMT"}], "update_date": "2015-07-14", "authors_parsed": [["Larsen", "Kasper", ""], ["Sue", "Tanawit Sae", ""]]}, {"id": "1507.05865", "submitter": "Dmitry Kramkov", "authors": "Dmitry Kramkov and Kim Weston", "title": "Muckenhoupt's $(A_p)$ condition and the existence of the optimal\n  martingale measure", "comments": "24 pages", "journal-ref": "Stochastic Processes and their Applications, 126(9), 2016, p.\n  2615-2633", "doi": "10.1016/j.spa.2016.02.012", "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the problem of optimal investment with utility function defined on\n$(0,\\infty)$, we formulate sufficient conditions for the dual optimizer to be a\nuniformly integrable martingale. Our key requirement consists of the existence\nof a martingale measure whose density process satisfies the probabilistic\nMuckenhoupt $(A_p)$ condition for the power $p=1/(1-a)$, where $a\\in (0,1)$ is\na lower bound on the relative risk-aversion of the utility function. We\nconstruct a counterexample showing that this $(A_p)$ condition is sharp.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jul 2015 15:08:29 GMT"}], "update_date": "2017-01-31", "authors_parsed": [["Kramkov", "Dmitry", ""], ["Weston", "Kim", ""]]}, {"id": "1507.06514", "submitter": "Amirhossein Sadoghi", "authors": "A. Sadoghi, J. Vecer", "title": "Optimum Liquidation Problem Associated with the Poisson Cluster Process", "comments": "46 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this research, we develop a trading strategy for the discrete-time optimal\nliquidation problem of large order trading with different market\nmicrostructures in an illiquid market. In this framework, the flow of orders\ncan be viewed as a point process with stochastic intensity. We model the price\nimpact as a linear function of a self-exciting dynamic process. We formulate\nthe liquidation problem as a discrete-time Markov Decision Processes, where the\nstate process is a Piecewise Deterministic Markov Process (PDMP). The numerical\nresults indicate that an optimal trading strategy is dependent on\ncharacteristics of the market microstructure. When no orders above certain\nvalue come the optimal solution takes offers in the lower levels of the limit\norder book in order to prevent not filling of orders and facing final inventory\ncosts.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2015 14:33:55 GMT"}, {"version": "v2", "created": "Fri, 25 Dec 2015 10:43:02 GMT"}], "update_date": "2015-12-29", "authors_parsed": [["Sadoghi", "A.", ""], ["Vecer", "J.", ""]]}, {"id": "1507.07214", "submitter": "Andrei Soklakov N", "authors": "Andrei N. Soklakov", "title": "One trade at a time -- unraveling the Equity Premium Puzzle", "comments": "21 pages, 4 figures", "journal-ref": "published as Supplementary materials for \"Economics of\n  Disagreement\", Entropy 22 (8), 860 (2020)", "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.EC q-fin.MF q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial markets provide a natural quantitative lab for understanding some\nof the most advanced human behaviours. Among them is the use of mathematical\ntools known as financial instruments. Besides money, the two most fundamental\nfinancial instruments are bonds and equities. More than 30 years ago Mehra and\nPrescott found the numerical performance of equities relative to government\nbonds could not be explained by consumption-based (mainstream) economic\ntheories. This empirical observation, known as the Equity Premium Puzzle, has\nbeen defying mainstream economics ever since. The recent financial crisis\nrevealed an even deeper need for understanding financial products. We show how\nunderstanding the rational nature of product design resolves the Equity Premium\nPuzzle. In doing so we obtain an experimentally tested theory of product\ndesign.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jul 2015 15:59:16 GMT"}, {"version": "v10", "created": "Mon, 31 Aug 2020 13:07:49 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2015 18:04:24 GMT"}, {"version": "v3", "created": "Tue, 27 Oct 2015 22:39:41 GMT"}, {"version": "v4", "created": "Mon, 29 Aug 2016 15:26:12 GMT"}, {"version": "v5", "created": "Sun, 11 Dec 2016 23:05:50 GMT"}, {"version": "v6", "created": "Sun, 28 May 2017 07:32:28 GMT"}, {"version": "v7", "created": "Sun, 18 Mar 2018 11:02:22 GMT"}, {"version": "v8", "created": "Mon, 28 May 2018 14:16:05 GMT"}, {"version": "v9", "created": "Wed, 1 Jul 2020 11:25:19 GMT"}], "update_date": "2020-09-01", "authors_parsed": [["Soklakov", "Andrei N.", ""]]}, {"id": "1507.07216", "submitter": "Andrei Soklakov N", "authors": "Andrei N. Soklakov", "title": "Model Risk Analysis via Investment Structuring", "comments": "11 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \"What are the origins of risks?\" and \"How material are they?\" -- these are\nthe two most fundamental questions of any risk analysis. Quantitative\nStructuring -- a technology for building financial products -- provides\neconomically meaningful answers for both of these questions. It does so by\nconsidering risk as an investment opportunity. The structure of the investment\nreveals the precise sources of risk and its expected performance measures\nmateriality. We demonstrate these capabilities of Quantitative Structuring\nusing a concrete practical example -- model risk in options on vol-targeted\nindices.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jul 2015 16:19:17 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2015 17:58:31 GMT"}], "update_date": "2015-07-29", "authors_parsed": [["Soklakov", "Andrei N.", ""]]}, {"id": "1507.08333", "submitter": "Tzu-Wei Yang", "authors": "Josselin Garnier, George Papanicolaou, Tzu-Wei Yang", "title": "A risk analysis for a system stabilized by a central agent", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We formulate and analyze a multi-agent model for the evolution of individual\nand systemic risk in which the local agents interact with each other through a\ncentral agent who, in turn, is influenced by the mean field of the local\nagents. The central agent is stabilized by a bistable potential, the only\nstabilizing force in the system. The local agents derive their stability only\nfrom the central agent. In the mean field limit of a large number of local\nagents we show that the systemic risk decreases when the strength of the\ninteraction of the local agents with the central agent increases. This means\nthat the probability of transition from one of the two stable quasi-equilibria\nto the other one decreases. We also show that the systemic risk increases when\nthe strength of the interaction of the central agent with the mean field of the\nlocal agents increases. Following the financial interpretation of such models\nand their behavior given in our previous paper (Garnier, Papanicolaou and Yang,\nSIAM J. Fin. Math. 4, 2013, 151-184), we may interpret the results of this\npaper in the following way. From the point of view of systemic risk, and while\nkeeping the perceived risk of the local agents approximately constant, it is\nbetter to strengthen the interaction of the local agents with the central agent\nthan the other way around.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2015 22:25:09 GMT"}, {"version": "v2", "created": "Mon, 17 Aug 2015 23:24:18 GMT"}], "update_date": "2015-08-19", "authors_parsed": [["Garnier", "Josselin", ""], ["Papanicolaou", "George", ""], ["Yang", "Tzu-Wei", ""]]}]