[{"id": "1603.00527", "submitter": "Christa Cuchiero", "authors": "Christa Cuchiero and Claudio Fontana and Alessandro Gnoatto", "title": "Affine multiple yield curve models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a general and tractable framework under which all multiple yield\ncurve modeling approaches based on affine processes, be it short rate, Libor\nmarket, or HJM modeling, can be consolidated. We model a numeraire process and\nmultiplicative spreads between Libor rates and simply compounded OIS rates as\nfunctions of an underlying affine process. Besides allowing for ordered spreads\nand an exact fit to the initially observed term structures, this general\nframework leads to tractable valuation formulas for caplets and swaptions and\nembeds all existing multi-curve affine models. The proposed approach also gives\nrise to new developments, such as a short rate type model driven by a Wishart\nprocess, for which we derive a closed-form pricing formula for caplets. The\nempirical performance of two specifications of our framework is illustrated by\ncalibration to market data.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2016 00:06:15 GMT"}, {"version": "v2", "created": "Tue, 7 Feb 2017 11:43:31 GMT"}], "update_date": "2017-02-08", "authors_parsed": [["Cuchiero", "Christa", ""], ["Fontana", "Claudio", ""], ["Gnoatto", "Alessandro", ""]]}, {"id": "1603.01288", "submitter": "Niushan Gao", "authors": "Niushan Gao, Foivos Xanthos", "title": "Option spanning beyond $L_p$-models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \\begin{abstract} The aim of this paper is to study the spanning power of\noptions in a static financial market that allows non-integrable assets. Our\nfindings extend and unify the results in [8,9,18] for $L_p$-models. We also\napply the spanning power properties to the pricing problem. In particular, we\nshow that prices on call and put options of a limited liability asset can be\nuniquely extended by arbitrage to all marketed contingent claims written on the\nasset.\n", "versions": [{"version": "v1", "created": "Thu, 3 Mar 2016 21:39:16 GMT"}, {"version": "v2", "created": "Thu, 29 Sep 2016 21:47:40 GMT"}], "update_date": "2016-10-03", "authors_parsed": [["Gao", "Niushan", ""], ["Xanthos", "Foivos", ""]]}, {"id": "1603.01865", "submitter": "Soumik Pal", "authors": "Soumik Pal", "title": "Exponentially concave functions and high dimensional stochastic\n  portfolio theory", "comments": "31 pages, 5 figures, minor editing", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the following problem in stochastic portfolio theory. Are there\nportfolios that are relative arbitrages with respect to the market portfolio\nover very short periods of time under realistic assumptions? We answer a\nslightly relaxed question affirmative in the following high dimensional sense,\nwhere dimension refers to the number of stocks being traded. Very roughly,\nsuppose that for every dimension we have a continuous semimartingale market\nsuch that (i) the vector of market weights in decreasing order has a stationary\nregularly varying tail with an index between $-1$ and $-1/2$ and (ii) zero is\nnot a limit point of the relative volatilities of the stocks. Then, given a\nprobability $\\eta < 1$ arbitrarily close to one, two arbitrarily small\n$\\epsilon, \\delta >0$, and an arbitrarily high positive amount $M$, for all\nhigh enough dimensions, it is possible to construct a functionally generated\nportfolio such that, with probability at least $\\eta$, its relative value with\nrespect to the market at time $\\delta$ is at least $M$, and never goes below\n$(1-\\epsilon)$ during $[0, \\delta]$. There are two phase transitions; if the\nindex of the tail is less than $-1$ or larger than $-1/2$. The construction\nuses properties of regular variation, high-dimensional convex geometry and\nconcentration of measure under Dirichlet distributions. We crucially use the\nnotion of $(K,N)$ convex functions introduced by Erbar, Kuwada, Sturm in the\ncontext of curvature-dimension conditions and Bochner's inequalities.\n", "versions": [{"version": "v1", "created": "Sun, 6 Mar 2016 20:08:43 GMT"}, {"version": "v2", "created": "Sat, 12 Mar 2016 02:49:34 GMT"}], "update_date": "2016-03-15", "authors_parsed": [["Pal", "Soumik", ""]]}, {"id": "1603.02867", "submitter": "Ari-Pekka Perkki\\\"o Mr.", "authors": "Teemu Pennanen and Ari-Pekka Perkki\\\"o", "title": "Convex duality in optimal investment and contingent claim valuation in\n  illiquid markets", "comments": "37 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies convex duality in optimal investment and contingent claim\nvaluation in markets where traded assets may be subject to nonlinear trading\ncosts and portfolio constraints. Under fairly general conditions, the dual\nexpressions decompose into tree terms, corresponding to the agent's risk\npreferences, trading costs and portfolio constraints, respectively. The dual\nrepresentations are shown to be valid when the market model satisfies an\nappropriate generalization of the no-arbitrage condition and the agent's\nutility function satisfies an appropriate generalization of asymptotic\nelasticity conditions. When applied to classical liquid market models or models\nwith bid-ask spreads, we recover well-known pricing formulas in terms of\nmartingale measures and consistent price systems. Building on the general\ntheory of convex stochastic optimization, we also derive optimality conditions\nin terms of an extended notion of a \"shadow price\".\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2016 12:38:30 GMT"}], "update_date": "2016-03-10", "authors_parsed": [["Pennanen", "Teemu", ""], ["Perkkiö", "Ari-Pekka", ""]]}, {"id": "1603.03198", "submitter": "Claudio Fontana", "authors": "Claudio Fontana and Thorsten Schmidt", "title": "General dynamic term structures under default risk", "comments": "minor changes, 31 pages. To appear in Stochastic Processes and their\n  Applications", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of modelling the term structure of defaultable bonds,\nunder minimal assumptions on the default time. In particular, we do not assume\nthe existence of a default intensity and we therefore allow for the possibility\nof default at predictable times. It turns out that this requires the\nintroduction of an additional term in the forward rate approach by Heath,\nJarrow and Morton (1992). This term is driven by a random measure encoding\ninformation about those times where default can happen with positive\nprobability. In this framework, we derive necessary and sufficient conditions\nfor a reference probability measure to be a local martingale measure for the\nlarge financial market of credit risky bonds, also considering general recovery\nschemes.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2016 09:42:41 GMT"}, {"version": "v2", "created": "Tue, 4 Apr 2017 13:25:15 GMT"}, {"version": "v3", "created": "Thu, 2 Nov 2017 11:56:37 GMT"}], "update_date": "2017-11-03", "authors_parsed": [["Fontana", "Claudio", ""], ["Schmidt", "Thorsten", ""]]}, {"id": "1603.03538", "submitter": "Ruimeng Hu", "authors": "Jean-Pierre Fouque and Ruimeng Hu", "title": "Asymptotic Optimal Strategy for Portfolio Optimization in a Slowly\n  Varying Stochastic Environment", "comments": "39pages, 3figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC math.PR q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the portfolio optimization problem with general\nutility functions and when the return and volatility of underlying asset are\nslowly varying. An asymptotic optimal strategy is provided within a specific\nclass of admissible controls under this problem setup. Specifically, we first\nestablish a rigorous first order approximation of the value function associated\nto a fixed zeroth order suboptimal trading strategy, which is given by the\nheuristic argument in [J.-P. Fouque, R. Sircar and T. Zariphopoulou, {\\it\nMathematical Finance}, 2016]. Then, we show that this zeroth order suboptimal\nstrategy is asymptotically optimal in a specific family of admissible trading\nstrategies. Finally, we show that our assumptions are satisfied by a particular\nfully solvable model.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2016 06:57:50 GMT"}, {"version": "v2", "created": "Mon, 7 Nov 2016 09:42:09 GMT"}], "update_date": "2016-11-08", "authors_parsed": [["Fouque", "Jean-Pierre", ""], ["Hu", "Ruimeng", ""]]}, {"id": "1603.03747", "submitter": "Ale\\v{s} \\v{C}ern\\'y", "authors": "Ale\\v{s} \\v{C}ern\\'y", "title": "Discrete-Time Quadratic Hedging of Barrier Options in Exponential\n  L\\'{e}vy Model", "comments": "19 pages", "journal-ref": "2016, in J. Kallsen and A. Papapantoleon (eds.), Advanced Modeling\n  in Mathematical Finance, 257-275, Springer", "doi": "10.1007/978-3-319-45875-5_12", "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine optimal quadratic hedging of barrier options in a discretely\nsampled exponential L\\'{e}vy model that has been realistically calibrated to\nreflect the leptokurtic nature of equity returns. Our main finding is that the\nimpact of hedging errors on prices is several times higher than the impact of\nother pricing biases studied in the literature.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2016 20:19:18 GMT"}], "update_date": "2018-08-10", "authors_parsed": [["Černý", "Aleš", ""]]}, {"id": "1603.04364", "submitter": "Jo\\\"el Bun", "authors": "Jo\\\"el Bun, Jean-Philippe Bouchaud, Marc Potters", "title": "On the overlaps between eigenvectors of correlated random matrices", "comments": "12 pages, 5 figures", "journal-ref": "Phys. Rev. E 98, 052145 (2018)", "doi": "10.1103/PhysRevE.98.052145", "report-no": null, "categories": "cond-mat.stat-mech physics.data-an q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We obtain general, exact formulas for the overlaps between the eigenvectors\nof large correlated random matrices, with additive or multiplicative noise.\nThese results have potential applications in many different contexts, from\nquantum thermalisation to high dimensional statistics. We find that the\noverlaps only depend on measurable quantities, and do not require the knowledge\nof the underlying \"true\" (noiseless) matrices. We apply our results to the case\nof empirical correlation matrices, that allow us to estimate reliably the width\nof the spectrum of the true correlation matrix, even when the latter is very\nclose to the identity. We illustrate our results on the example of stock\nreturns correlations, that clearly reveal a non trivial structure for the bulk\neigenvalues. We also apply our results to the problem of matrix denoising in\nhigh dimension.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2016 17:57:12 GMT"}, {"version": "v2", "created": "Sun, 23 Jul 2017 12:38:29 GMT"}], "update_date": "2018-12-05", "authors_parsed": [["Bun", "Joël", ""], ["Bouchaud", "Jean-Philippe", ""], ["Potters", "Marc", ""]]}, {"id": "1603.06312", "submitter": "Erhan Bayraktar", "authors": "Erhan Bayraktar and Yuchong Zhang", "title": "A rank based mean field game in the strong formulation", "comments": "Final version. To appear in Electronic Communications in Probability.\n  Keywords: Mean Field Games, competition/tournaments, common noise, rank\n  dependent interaction, non-local interaction, strong formulation", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss a natural game of competition and solve the corresponding mean\nfield game with \\emph{common noise} when agents' rewards are \\emph{rank\ndependent}. We use this solution to provide an approximate Nash equilibrium for\nthe finite player game and obtain the rate of convergence.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2016 02:26:10 GMT"}, {"version": "v2", "created": "Sat, 26 Mar 2016 19:56:08 GMT"}, {"version": "v3", "created": "Sat, 15 Oct 2016 04:08:34 GMT"}], "update_date": "2016-10-18", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Zhang", "Yuchong", ""]]}, {"id": "1603.06498", "submitter": "Peter Frentrup", "authors": "Dirk Becherer, Todor Bilarev, Peter Frentrup", "title": "Optimal Liquidation under Stochastic Liquidity", "comments": "Appeared in Finance and Stochastics as \"online first\". The final\n  publication is available at link.springer.com", "journal-ref": "Finance Stoch (2018), 22/1: 39-68", "doi": "10.1007/s00780-017-0346-2", "report-no": null, "categories": "math.PR math.OC q-fin.MF q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solve explicitly a two-dimensional singular control problem of finite fuel\ntype for infinite time horizon. The problem stems from the optimal liquidation\nof an asset position in a financial market with multiplicative and transient\nprice impact. Liquidity is stochastic in that the volume effect process, which\ndetermines the inter-temporal resilience of the market in spirit of Predoiu,\nShaikhet and Shreve (2011), is taken to be stochastic, being driven by own\nrandom noise. The optimal control is obtained as the local time of a diffusion\nprocess reflected at a non-constant free boundary. To solve the HJB variational\ninequality and prove optimality, we need a combination of probabilistic\narguments and calculus of variations methods, involving Laplace transforms of\ninverse local times for diffusions reflected at elastic boundaries.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2016 17:01:39 GMT"}, {"version": "v2", "created": "Sat, 7 May 2016 15:21:23 GMT"}, {"version": "v3", "created": "Thu, 20 Apr 2017 15:45:33 GMT"}, {"version": "v4", "created": "Thu, 2 Nov 2017 13:54:01 GMT"}], "update_date": "2019-06-27", "authors_parsed": [["Becherer", "Dirk", ""], ["Bilarev", "Todor", ""], ["Frentrup", "Peter", ""]]}, {"id": "1603.06825", "submitter": "Nikolai Dokuchaev", "authors": "Nikolai Dokuchaev", "title": "First Order BSPDEs in higher dimension for optimal control problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper studies the First Order BSPDEs (Backward Stochastic Partial\nDifferential Equations) suggested earlier for a case of multidimensional state\ndomain with a boundary. These equations represent analogs of\nHamilton-Jacobi-Bellman equations and allow to construct the value function for\nstochastic optimal control problems with unspecified dynamics where the\nunderlying processes do not necessarily satisfy stochastic differential\nequations of a known kind with a given structure. The problems considered arise\nin financial modelling.\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2016 15:17:32 GMT"}, {"version": "v2", "created": "Tue, 17 May 2016 05:39:22 GMT"}, {"version": "v3", "created": "Sun, 4 Dec 2016 13:32:02 GMT"}, {"version": "v4", "created": "Thu, 25 Oct 2018 06:52:27 GMT"}, {"version": "v5", "created": "Tue, 30 Oct 2018 16:00:13 GMT"}], "update_date": "2018-10-31", "authors_parsed": [["Dokuchaev", "Nikolai", ""]]}, {"id": "1603.07074", "submitter": "Tiexin Guo", "authors": "Tiexin Guo, Erxin Zhang, Mingzhi Wu, Bixuan Yang, George Yuan and\n  Xiaolin Zeng", "title": "On random convex analysis", "comments": "28 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.FA q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, based on the idea of randomizing space theory, random convex\nanalysis has been being developed in order to deal with the corresponding\nproblems in random environments such as analysis of conditional convex risk\nmeasures and the related variational problems and optimization problems. Random\nconvex analysis is convex analysis over random locally convex modules. Since\nrandom locally convex modules have the more complicated topological and\nalgebraic structures than ordinary locally convex spaces, establishing random\nconvex analysis will encounter harder mathematical challenges than classical\nconvex analysis so that there are still a lot of fundamentally important\nunsolved problems in random convex analysis. This paper is devoted to solving\nsome important theoretic problems. First, we establish the inferior limit\nbehavior of a proper lower semicontinuous $L^0$--convex function on a random\nlocally convex module endowed with the locally $L^0$--convex topology, which\nmakes perfect the Fenchel--Moreau duality theorem for such functions. Then, we\ninvestigate the relations among continuity, locally $L^0$--Lipschitzian\ncontinuity and almost surely sequent continuity of a proper $L^0$--convex\nfunction. And then, we establish the elegant relationships among\nsubdifferentiability, G\\^ateaux--differentiability and\nFr\\'ech\\'et--differentiability for a proper $L^0$--convex function defined on\nrandom normed modules. At last, based on the Ekeland's variational principle\nfor a proper lower semicontinuous $\\bar{L}^0$--valued function, we show that\n$\\varepsilon$--subdifferentials can be approximated by subdifferentials. We\nwould like to emphasize that the success of this paper lies in simultaneously\nconsidering the $(\\varepsilon, \\lambda)$--topology and the locally\n$L^0$--convex topology for a random locally convex module.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2016 06:06:50 GMT"}, {"version": "v2", "created": "Thu, 24 Mar 2016 05:40:57 GMT"}, {"version": "v3", "created": "Tue, 6 Dec 2016 16:05:37 GMT"}, {"version": "v4", "created": "Fri, 8 Sep 2017 05:31:25 GMT"}], "update_date": "2017-09-11", "authors_parsed": [["Guo", "Tiexin", ""], ["Zhang", "Erxin", ""], ["Wu", "Mingzhi", ""], ["Yang", "Bixuan", ""], ["Yuan", "George", ""], ["Zeng", "Xiaolin", ""]]}, {"id": "1603.07488", "submitter": "Frederic Vrins", "authors": "Fr\\'ed\\'eric Vrins and Monique Jeanblanc", "title": "Conic Martingales from Stochastic Integrals", "comments": "34 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce the concept of conic martingales}. This class\nrefers to stochastic processes having the martingale property, but that evolve\nwithin given (possibly time-dependent) boundaries. We first review some results\nabout the martingale property of solution to driftless stochastic differential\nequations. We then provide a simple way to construct and handle such processes.\nSpecific attention is paid to martingales in $[0,1]$. One of these martingales\nproves to be analytically tractable. It is shown that up to shifting and\nrescaling constants, it is the only martingale (with the trivial constant,\nBrownian motion and Geometric Brownian motion) having a separable coefficient\n$\\sigma(t,y)=g(t)h(y)$ and that can be obtained via a time-homogeneous mapping\nof Gaussian diffusions. The approach is exemplified to the modeling of\nstochastic conditional survival probabilities in the univariate (both\nconditional and unconditional to survival) and bivariate cases.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2016 09:08:30 GMT"}], "update_date": "2016-03-25", "authors_parsed": [["Vrins", "Frédéric", ""], ["Jeanblanc", "Monique", ""]]}, {"id": "1603.07615", "submitter": "Paul Kr\\\"uhner", "authors": "Julia Eisenberg, Paul Kr\\\"uhner", "title": "A Note on the Optimal Dividends Paid in a Foreign Currency", "comments": "8 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an insurance entity endowed with an initial capital and a surplus\nprocess modelled as a Brownian motion with drift. It is assumed that the\ncompany seeks to maximise the cumulated value of expected discounted dividends,\nwhich are declared or paid in a foreign currency. The currency fluctuation is\nmodelled as a L\\'evy process. We consider both cases: restricted and\nunrestricted dividend payments. It turns out that the value function and the\noptimal strategy can be calculated explicitly.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2016 15:07:17 GMT"}], "update_date": "2016-03-25", "authors_parsed": [["Eisenberg", "Julia", ""], ["Krühner", "Paul", ""]]}, {"id": "1603.08245", "submitter": "Johannes Ruf", "authors": "Ioannis Karatzas and Johannes Ruf", "title": "Trading Strategies Generated by Lyapunov Functions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Functional portfolio generation, initiated by E.R. Fernholz almost twenty\nyears ago, is a methodology for constructing trading strategies with controlled\nbehavior. It is based on very weak and descriptive assumptions on the\ncovariation structure of the underlying market model, and needs no estimation\nof model parameters. In this paper, the corresponding generating functions $G$\nare interpreted as Lyapunov functions for the vector process $\\mu(\\cdot)$ of\nmarket weights; that is, via the property that $G(\\mu(\\cdot))$ is a\nsupermartingale under an appropriate change of measure. This point of view\nunifies, generalizes, and simplifies several existing results, and allows the\nformulation of conditions under which it is possible to outperform the market\nportfolio over appropriate time-horizons. From a probabilistic point of view,\nthe present paper yields results concerning the interplay of stochastic\ndiscount factors and concave transformations of semimartingales on compact\ndomains.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2016 19:10:38 GMT"}], "update_date": "2016-03-29", "authors_parsed": [["Karatzas", "Ioannis", ""], ["Ruf", "Johannes", ""]]}, {"id": "1603.08289", "submitter": "Jiling Cao", "authors": "Jiling Cao, Teh Raihana Nazirah Roslan and Wenjun Zhang", "title": "Pricing variance swaps in a hybrid model of stochastic volatility and\n  interest rate with regime-switching", "comments": "16 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the problem of pricing discretely-sampled variance\nswaps based on a hybrid model of stochastic volatility and stochastic interest\nrate with regime-switching. Our modelling framework extends the Heston\nstochastic volatility model by including the CIR stochastic interest rate and\nmodel parameters that switch according to a continuous-time observable Markov\nchain process. A semi-closed form pricing formula for variance swaps is\nderived. The pricing formula is assessed through numerical implementations, and\nthe impact of including regime-switching on pricing variance swaps is also\ndiscussed.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2016 03:29:35 GMT"}], "update_date": "2016-03-29", "authors_parsed": [["Cao", "Jiling", ""], ["Roslan", "Teh Raihana Nazirah", ""], ["Zhang", "Wenjun", ""]]}, {"id": "1603.08828", "submitter": "Umut \\c{C}etin", "authors": "Umut \\c{C}etin", "title": "Financial equilibrium with asymmetric information and random horizon", "comments": "Few typos have been corrected", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study in detail and explicitly solve the version of Kyle's model\nintroduced in a specific case in \\cite{BB}, where the trading horizon is given\nby an exponentially distributed random time. The first part of the paper is\ndevoted to the analysis of time-homogeneous equilibria using tools from the\ntheory of one-dimensional diffusions. It turns out that such an equilibrium is\nonly possible if the final payoff is Bernoulli distributed as in \\cite{BB}. We\nshow in the second part that the signal of the market makers use in the general\ncase is a time-changed version of the one that they would have used had the\nfinal payoff had a Bernoulli distribution. In both cases we characterise\nexplicitly the equilibrium price process and the optimal strategy of the\ninformed trader. Contrary to the original Kyle model it is found that the\nreciprocal of market's depth, i.e. Kyle's lambda, is a uniformly integrable\nsupermartingale. While Kyle's lambda is a potential, i.e. converges to $0$, for\nthe Bernoulli distributed final payoff, its limit in general is different than\n$0$.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2016 16:17:18 GMT"}, {"version": "v2", "created": "Tue, 9 May 2017 13:36:40 GMT"}, {"version": "v3", "created": "Mon, 18 Sep 2017 14:47:28 GMT"}], "update_date": "2017-09-19", "authors_parsed": [["Çetin", "Umut", ""]]}, {"id": "1603.09030", "submitter": "Igor Cialenco", "authors": "Tomasz R. Bielecki and Igor Cialenco and Marcin Pitera", "title": "A survey of time consistency of dynamic risk measures and dynamic\n  performance measures in discrete time: LM-measure perspective", "comments": "arXiv admin note: substantial text overlap with arXiv:1409.7028", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we give a comprehensive overview of the time consistency\nproperty of dynamic risk and performance measures, focusing on a the discrete\ntime setup. The two key operational concepts used throughout are the notion of\nthe LM-measure and the notion of the update rule that, we believe, are the key\ntools for studying time consistency in a unified framework.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2016 03:29:35 GMT"}, {"version": "v2", "created": "Sun, 29 Jan 2017 19:19:27 GMT"}], "update_date": "2017-01-31", "authors_parsed": [["Bielecki", "Tomasz R.", ""], ["Cialenco", "Igor", ""], ["Pitera", "Marcin", ""]]}, {"id": "1603.09329", "submitter": "Jean-Francois Renaud", "authors": "Djilali Ait Aoudia, Jean-Fran\\c{c}ois Renaud", "title": "Pricing occupation-time options in a mixed-exponential jump-diffusion\n  model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this short paper, in order to price occupation-time options, such as\n(double-barrier) step options and quantile options, we derive various joint\ndistributions of a mixed-exponential jump-diffusion process and its occupation\ntimes of intervals.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2016 19:51:44 GMT"}], "update_date": "2016-03-31", "authors_parsed": [["Aoudia", "Djilali Ait", ""], ["Renaud", "Jean-François", ""]]}]