[{"id": "1604.00254", "submitter": "Alexander Lipton", "authors": "Russell Barker, Andrew Dickinson, Alex Lipton, Rajeev Virmani", "title": "Systemic Risks in CCP Networks", "comments": "15 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model for the credit and liquidity risks faced by clearing\nmembers of Central Counterparty Clearing houses (CCPs). This model aims to\ncapture the features of: gap risk; feedback between clearing member default,\nmarket volatility and margining requirements; the different risks faced by\nvarious types of market participant and the changes in margining requirements a\nclearing member faces as the system evolves. By considering the entire network\nof CCPs and clearing members, we investigate the distribution of losses to\ndefault fund contributions and contingent liquidity requirements for each\nclearing member; further, we identify wrong-way risks between defaults of\nclearing members and market turbulence.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 14:14:25 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Barker", "Russell", ""], ["Dickinson", "Andrew", ""], ["Lipton", "Alex", ""], ["Virmani", "Rajeev", ""]]}, {"id": "1604.00525", "submitter": "Michael Mania", "authors": "Michael Mania and Revaz Tevzadze", "title": "On regularity of primal and dual dynamic value functions related to\n  investment problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study regularity properties of the dynamic value functions of primal and\ndual problems of optimal investing for utility functions defined on the whole\nreal line. Relations between decomposition terms of value processes of primal\nand dual problems and between optimal solutions of basic and conditional\nutility maximization problems are established. These properties are used to\nshow that the value function satisfies a corresponding backward stochastic\npartial differential equation.\n  In the case of complete markets we give conditions on the utility function\nwhen this equation admits a solution.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2016 16:47:10 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Mania", "Michael", ""], ["Tevzadze", "Revaz", ""]]}, {"id": "1604.00596", "submitter": "Vladimir Vovk", "authors": "Vladimir Vovk", "title": "Getting rich quick with the Axiom of Choice", "comments": "21 pages. This version takes account of the feedback from reviewers", "journal-ref": "Finance and Stochastics (2017) 21:719-739", "doi": "10.1007/s00780-017-0336-4", "report-no": null, "categories": "q-fin.MF q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes new get-rich-quick schemes that involve trading in a\nfinancial security with a non-degenerate price path. For simplicity the\ninterest rate is assumed zero. If the price path is assumed continuous, the\ntrader can become infinitely rich immediately after it becomes non-constant (if\nit ever does). If it is assumed positive, he can become infinitely rich\nimmediately after reaching a point in time such that the variation of the log\nprice is infinite in any right neighbourhood of that point (whereas reaching a\npoint in time such that the variation of the log price is infinite in any left\nneighbourhood of that point is not sufficient). The practical value of these\nschemes is tempered by their use of the Axiom of Choice.\n", "versions": [{"version": "v1", "created": "Sun, 3 Apr 2016 05:46:36 GMT"}, {"version": "v2", "created": "Tue, 3 May 2016 10:25:13 GMT"}, {"version": "v3", "created": "Tue, 21 Mar 2017 08:23:18 GMT"}], "update_date": "2017-10-30", "authors_parsed": [["Vovk", "Vladimir", ""]]}, {"id": "1604.01447", "submitter": "Juan Manuel Romero", "authors": "Juan M. Romero and Ilse B. Zubieta-Mart\\'inez", "title": "Relativistic Quantum Finance", "comments": "9 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Employing the Klein-Gordon equation, we propose a generalized Black-Scholes\nequation. In addition, we found a limit where this generalized equation is\ninvariant under conformal transformations, in particular invariant under scale\ntransformations. In this limit, we show that the stock prices distribution is\ngiven by a Cauchy distribution, instead of a normal distribution.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 22:48:13 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Romero", "Juan M.", ""], ["Zubieta-Martínez", "Ilse B.", ""]]}, {"id": "1604.02269", "submitter": "David Hobson", "authors": "David Hobson and Anthony Neuberger", "title": "On the value of being American", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The virtue of an American option is that it can be exercised at any time.\nThis right is particularly valuable when there is model uncertainty. Yet almost\nall the extensive literature on American options assumes away model\nuncertainty. This paper quantifies the potential value of this flexibility by\nidentifying the supremum on the price of an American option when no model is\nimposed on the data, but rather any model is required to be consistent with a\nfamily of European call prices. The bound is enforced by a hedging strategy\ninvolving these call options which is robust to model error.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 08:14:02 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Hobson", "David", ""], ["Neuberger", "Anthony", ""]]}, {"id": "1604.02274", "submitter": "David Hobson", "authors": "David Hobson and Anthony Neuberger", "title": "More on hedging American options under model uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this note is to reconcile two different results concerning the\nmodel-free upper bound on the price of an American option, given a set of\nEuropean option prices. Neuberger (2007, `Bounds on the American option') and\nHobson and Neuberger (2016, `On the value of being American') argue that the\ncost of the cheapest super-replicating strategy is equal to the highest\nmodel-based price, where we search over all models which price correctly the\ngiven European options. Bayraktar, Huang and Zhou (2015, `On hedging American\noptions under model uncertainty', SIAM J. Financial Math ematics) argue that\nthe cost of the cheapest super-replicating strategy can strictly exceed the\nhighest model-based price. We show that the reason for the difference in\nconclusion is that Bayraktar et al do not search over a rich enough class of\nmodels.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 08:39:49 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Hobson", "David", ""], ["Neuberger", "Anthony", ""]]}, {"id": "1604.03042", "submitter": "Erhan Bayraktar", "authors": "Erhan Bayraktar and Christopher W. Miller", "title": "Distribution-Constrained Optimal Stopping", "comments": "Final version. To appear in Mathematical Finance", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solve the problem of optimal stopping of a Brownian motion subject to the\nconstraint that the stopping time's distribution is a given measure consisting\nof finitely-many atoms. In particular, we show that this problem can be\nconverted to a finite sequence of state-constrained optimal control problems\nwith additional states corresponding to the conditional probability of stopping\nat each possible terminal time. The proof of this correspondence relies on a\nnew variation of the dynamic programming principle for state-constrained\nproblems which avoids measurable selection. We emphasize that distribution\nconstraints lead to novel and interesting mathematical problems on their own,\nbut also demonstrate an application in mathematical finance to model-free\nsuperhedging with an outlook on volatility.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 17:39:10 GMT"}, {"version": "v2", "created": "Wed, 13 Apr 2016 00:12:05 GMT"}, {"version": "v3", "created": "Thu, 8 Dec 2016 20:18:57 GMT"}, {"version": "v4", "created": "Sun, 28 May 2017 01:12:54 GMT"}, {"version": "v5", "created": "Thu, 6 Jul 2017 17:26:23 GMT"}], "update_date": "2017-07-07", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Miller", "Christopher W.", ""]]}, {"id": "1604.03906", "submitter": "Erhan Bayraktar", "authors": "Erhan Bayraktar and Jiaqi Li", "title": "Stochastic Perron for Stochastic Target Problems", "comments": "Final version. To appear in the Journal of Optimization Theory and\n  Applications. Keywords: The stochastic target problem, stochastic Perron's\n  method, jump-diffusion processes, viscosity solutions, unbounded controls", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we adapt stochastic Perron's method to analyze a stochastic\ntarget problem with unbounded controls in a jump diffusion set-up. With this\nmethod, we construct a viscosity sub-solution and super-solution to the\nassociated Hamiltonian-Jacobi-Bellman (HJB) equations. Under comparison\nprinciples, uniqueness of the viscosity solutions holds and the value function\ncoincides with the unique solution in the parabolic interior. Since classical\ncontrol problems can be analyzed under the framework of stochastic target\nproblems (with unbounded controls), we use our results to generalize the\nresults in ArXiv:1212.2170 to problems with controlled jumps.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 18:36:03 GMT"}, {"version": "v2", "created": "Tue, 17 May 2016 14:30:33 GMT"}], "update_date": "2016-05-18", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Li", "Jiaqi", ""]]}, {"id": "1604.04608", "submitter": "Erhan Bayraktar", "authors": "Erhan Bayraktar and Zhou Zhou", "title": "Super-hedging American Options with Semi-static Trading Strategies under\n  Model Uncertainty", "comments": "Final version. To appear in the International Journal of Theoretical\n  and Applied Finance. Keywords: American options, super-hedging, model\n  uncertainty, semi-static trading strategies, randomized models", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the super-hedging price of an American option in a discrete-time\nmarket in which stocks are available for dynamic trading and European options\nare available for static trading. We show that the super-hedging price $\\pi$ is\ngiven by the supremum over the prices of the American option under randomized\nmodels. That is, $\\pi=\\sup_{(c_i,Q_i)_i}\\sum_ic_i\\phi^{Q_i}$, where $c_i \\in\n\\mathbb{R}_+$ and the martingale measure $Q^i$ are chosen such that $\\sum_i\nc_i=1$ and $\\sum_i c_iQ_i$ prices the European options correctly, and\n$\\phi^{Q_i}$ is the price of the American option under the model $Q_i$. Our\nresult generalizes the example given in ArXiv:1604.02274 that the highest model\nbased price can be considered as a randomization over models.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 19:28:36 GMT"}, {"version": "v2", "created": "Mon, 26 Jun 2017 20:38:50 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Zhou", "Zhou", ""]]}, {"id": "1604.04963", "submitter": "Brian Ward", "authors": "Brian Bulthuis and Julio Concha and Tim Leung and Brian Ward", "title": "Optimal Execution of Limit and Market Orders with Trade Director, Speed\n  Limiter, and Fill Uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimal execution of market and limit orders with permanent and\ntemporary price impacts as well as uncertainty in the filling of limit orders.\nOur continuous-time model incorporates a trade speed limiter and a trader\ndirector to provide better control on the trading rates. We formulate a\nstochastic control problem to determine the optimal dynamic strategy for trade\nexecution, with a quadratic terminal penalty to ensure complete liquidation. In\naddition, we identify conditions on the model parameters to ensure optimality\nof the controls and finiteness of the associated value functions. For\ncomparison, we also solve the schedule-following optimal execution problem that\npenalizes deviations from an order schedule. Numerical results are provided to\nillustrate the optimal market and limit orders over time.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 02:27:29 GMT"}, {"version": "v2", "created": "Sun, 22 May 2016 02:17:30 GMT"}, {"version": "v3", "created": "Thu, 6 Apr 2017 16:42:15 GMT"}, {"version": "v4", "created": "Mon, 10 Apr 2017 23:57:42 GMT"}, {"version": "v5", "created": "Wed, 12 Apr 2017 17:44:46 GMT"}], "update_date": "2017-04-13", "authors_parsed": [["Bulthuis", "Brian", ""], ["Concha", "Julio", ""], ["Leung", "Tim", ""], ["Ward", "Brian", ""]]}, {"id": "1604.05406", "submitter": "Wujiang Lou", "authors": "Wujiang Lou", "title": "Gap Risk KVA and Repo Pricing: An Economic Capital Approach in the\n  Black-Scholes-Merton Framework", "comments": "25 pages, 2 figures, Risk, November 2016, under the title of \"Gap\n  Risk KVA and Repo Pricing\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although not a formal pricing consideration, gap risk or hedging errors are\nthe norm of derivatives businesses. Starting with the gap risk during a margin\nperiod of risk of a repurchase agreement (repo), this article extends the\nBlack-Scholes-Merton option pricing framework by introducing a reserve capital\napproach to the hedging error's irreducible variability. An extended partial\ndifferential equation is derived with two new terms for expected gap loss and\neconomic capital charge, leading to the gap risk economic value adjustment and\ncapital valuation adjustment (KVA) respectively. Practical repo pricing\nformulae is obtained showing that the break-even repo rate decomposes into cost\nof fund and economic capital charge in KVA. At zero haircut, a one-year term\nrepo on main equities could command a capital charge as large as 50 basis\npoints for a 'BBB' rated borrower.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 02:09:05 GMT"}, {"version": "v2", "created": "Sun, 4 Sep 2016 15:04:45 GMT"}, {"version": "v3", "created": "Sat, 29 Oct 2016 16:41:09 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Lou", "Wujiang", ""]]}, {"id": "1604.05517", "submitter": "Xiaolu Tan", "authors": "Anna Aksamit and Shuoqing Deng and Jan Ob\\l\\'oj and Xiaolu Tan", "title": "Robust pricing--hedging duality for American options in discrete time\n  financial markets", "comments": "29 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate pricing-hedging duality for American options in discrete time\nfinancial models where some assets are traded dynamically and others, e.g. a\nfamily of European options, only statically. In the first part of the paper we\nconsider an abstract setting, which includes the classical case with a fixed\nreference probability measure as well as the robust framework with a\nnon-dominated family of probability measures. Our first insight is that by\nconsidering a (universal) enlargement of the space, we can see American options\nas European options and recover the pricing-hedging duality, which may fail in\nthe original formulation. This may be seen as a weak formulation of the\noriginal problem. Our second insight is that lack of duality is caused by the\nlack of dynamic consistency and hence a different enlargement with dynamic\nconsistency is sufficient to recover duality: it is enough to consider\n(fictitious) extensions of the market in which all the assets are traded\ndynamically. In the second part of the paper we study two important examples of\nrobust framework: the setup of Bouchard and Nutz (2015) and the martingale\noptimal transport setup of Beiglb\\\"ock et al. (2013), and show that our general\nresults apply in both cases and allow us to obtain pricing-hedging duality for\nAmerican options.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 11:03:36 GMT"}, {"version": "v2", "created": "Sun, 9 Apr 2017 19:50:00 GMT"}], "update_date": "2017-04-11", "authors_parsed": [["Aksamit", "Anna", ""], ["Deng", "Shuoqing", ""], ["Obłój", "Jan", ""], ["Tan", "Xiaolu", ""]]}, {"id": "1604.05584", "submitter": "Thai Nguyen", "authors": "Thai Nguyen", "title": "Optimal investment and consumption with downside risk constraint in\n  jump-diffusion models", "comments": "32 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper extends the results of the article [C. Kl\\\"{u}ppelberg and S. M.\nPergamenchtchikov. Optimal consumption and investment with bounded downside\nrisk for power utility functions. In Optimality and Risk: {\\it Modern Trends in\nMathematical Finance. The Kabanov Festschrift}, pages 133-169, 2009] to a\njump-diffusion setting. We show that under the assumption that only positive\njumps in the asset prices are allowed, the explicit optimal strategy can be\nfound in the subset of admissible strategies satisfying the same risk\nconstraint as in the pure diffusion setting. When negative jumps probably\nhappen, the regulator should be more conservative. In that case, we suggest to\nimpose on the investor's portfolio a stricter constraint which depends on the\nprobability of having negative jumps in the assets during the whole considered\nhorizon.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2016 23:38:17 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Nguyen", "Thai", ""]]}, {"id": "1604.06917", "submitter": "Rudi Sch\\\"afer", "authors": "Joachim Sicking, Thomas Guhr and Rudi Sch\\\"afer", "title": "Concurrent Credit Portfolio Losses", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of concurrent portfolio losses in two non-overlapping\ncredit portfolios. In order to explore the full statistical dependence\nstructure of such portfolio losses, we estimate their empirical pairwise\ncopulas. Instead of a Gaussian dependence, we typically find a strong asymmetry\nin the copulas. Concurrent large portfolio losses are much more likely than\nsmall ones. Studying the dependences of these losses as a function of portfolio\nsize, we moreover reveal that not only large portfolios of thousands of\ncontracts, but also medium-sized and small ones with only a few dozens of\ncontracts exhibit notable portfolio loss correlations. Anticipated\nidiosyncratic effects turn out to be negligible. These are troublesome insights\nnot only for investors in structured fixed-income products, but particularly\nfor the stability of the financial sector.\n", "versions": [{"version": "v1", "created": "Sat, 23 Apr 2016 15:20:34 GMT"}, {"version": "v2", "created": "Sun, 22 Jan 2017 17:00:29 GMT"}], "update_date": "2017-01-24", "authors_parsed": [["Sicking", "Joachim", ""], ["Guhr", "Thomas", ""], ["Schäfer", "Rudi", ""]]}, {"id": "1604.07690", "submitter": "Mikko Pakkanen", "authors": "Jani Lukkarinen, Mikko S. Pakkanen", "title": "Arbitrage without borrowing or short selling?", "comments": "14 pages, 1 figure, v2: minor revision, to appear in Mathematics and\n  Financial Economics", "journal-ref": "Mathematics and Financial Economics 2017, Vol. 11, No. 3, 263-274", "doi": "10.1007/s11579-016-0180-x", "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that a trader, who starts with no initial wealth and is not allowed\nto borrow money or short sell assets, is theoretically able to attain positive\nwealth by continuous trading, provided that she has perfect foresight of future\nasset prices, given by a continuous semimartingale. Such an arbitrage strategy\ncan be constructed as a process of finite variation that satisfies a seemingly\ninnocuous self-financing condition, formulated using a pathwise\nRiemann-Stieltjes integral. Our result exemplifies the potential intricacies of\nformulating economically meaningful self-financing conditions in continuous\ntime, when one leaves the conventional arbitrage-free framework.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 14:30:24 GMT"}, {"version": "v2", "created": "Sun, 2 Oct 2016 17:39:16 GMT"}], "update_date": "2017-05-16", "authors_parsed": [["Lukkarinen", "Jani", ""], ["Pakkanen", "Mikko S.", ""]]}, {"id": "1604.08070", "submitter": "Birgit Rudloff", "authors": "Birgit Rudloff", "title": "Convex Hedging in Incomplete Markets", "comments": null, "journal-ref": "Applied Mathematical Finance 14 (5), 437 - 452, 2007", "doi": "10.1080/13504860701352206", "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In incomplete financial markets not every contingent claim can be replicated\nby a self-financing strategy. The risk of the resulting shortfall can be\nmeasured by convex risk measures, recently introduced by F\\\"ollmer, Schied\n(2002). The dynamic optimization problem of finding a self-financing strategy\nthat minimizes the convex risk of the shortfall can be split into a static\noptimization problem and a representation problem. It follows that the optimal\nstrategy consists in superhedging the modified claim $\\widetilde{\\varphi}H$,\nwhere $H$ is the payoff of the claim and $\\widetilde{\\varphi}$ is the solution\nof the static optimization problem, the optimal randomized test.\n  In this paper, we will deduce necessary and sufficient optimality conditions\nfor the static problem using convex duality methods. The solution of the static\noptimization problem turns out to be a randomized test with a typical\n$0$-$1$-structure.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 13:56:28 GMT"}], "update_date": "2016-04-28", "authors_parsed": [["Rudloff", "Birgit", ""]]}, {"id": "1604.08224", "submitter": "Junjian Yang", "authors": "Yiqing Lin and Junjian Yang", "title": "Utility maximization problem with random endowment and transaction\n  costs: when wealth may become negative", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the problem of maximizing expected utility from the\nterminal wealth with proportional transaction costs and random endowment. In\nthe context of the existence of consistent price systems, we consider the\nduality between the primal utility maximization problem and the dual one, which\nis set up on the domain of finitely additive measures. In particular, we prove\nduality results for utility functions supporting possibly negative values.\nMoreover, we construct the shadow market by the dual optimal process and\nconsider the utility based pricing for random endowment.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 20:18:24 GMT"}, {"version": "v2", "created": "Mon, 5 Sep 2016 15:01:02 GMT"}], "update_date": "2016-09-06", "authors_parsed": [["Lin", "Yiqing", ""], ["Yang", "Junjian", ""]]}]