[{"id": "1807.01186", "submitter": "Wing Fung Chong", "authors": "Wing Fung Chong, Gechun Liang", "title": "Optimal investment and consumption with forward preferences and\n  uncertain parameters", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper solves the optimal investment and consumption strategies for a\nrisk-averse and ambiguity-averse agent in an incomplete financial market with\nmodel uncertainty. The market incompleteness arises from investment constraints\nof the agent, while the model uncertainty stems from drift and volatility\nprocesses for risky stocks in the financial market. The agent seeks her best\nand robust strategies via optimizing her robust forward investment and\nconsumption preferences. Her robust forward preferences and the associated\noptimal strategies are represented by solutions of ordinary differential\nequations, when there are both drift and volatility uncertainties, and infinite\nhorizon backward stochastic differential equations, coupled with ordinary\ndifferential equations, when there is only drift uncertainty.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 13:46:54 GMT"}, {"version": "v2", "created": "Fri, 28 Jun 2019 07:47:39 GMT"}], "update_date": "2019-07-01", "authors_parsed": [["Chong", "Wing Fung", ""], ["Liang", "Gechun", ""]]}, {"id": "1807.01428", "submitter": "Sebastian Jaimungal", "authors": "Alvaro Cartea, Luhui Gan, Sebastian Jaimungal", "title": "Trading Cointegrated Assets with Price Impact", "comments": "32 pages,4 figures, 11 tables. First appeared on SSRN Oct 2015 at\n  http://ssrn.com/abstract=2681309", "journal-ref": "Mathematical Finance, Forthcoming 2018", "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Executing a basket of co-integrated assets is an important task facing\ninvestors. Here, we show how to do this accounting for the informational\nadvantage gained from assets within and outside the basket, as well as for the\npermanent price impact of market orders (MOs) from all market participants, and\nthe temporary impact that the agent's MOs have on prices. The execution problem\nis posed as an optimal stochastic control problem and we demonstrate that,\nunder some mild conditions, the value function admits a closed-form solution,\nand prove a verification theorem. Furthermore, we use data of five stocks\ntraded in the Nasdaq exchange to estimate the model parameters and use\nsimulations to illustrate the performance of the strategy. As an example, the\nagent liquidates a portfolio consisting of shares in Intel Corporation (INTC)\nand Market Vectors Semiconductor ETF (SMH). We show that including the\ninformation provided by three additional assets, FARO Technologies (FARO),\nNetApp (NTAP) and Oracle Corporation (ORCL), considerably improves the\nstrategy's performance; for the portfolio we execute, it outperforms the\nmulti-asset version of Almgren-Chriss by approximately 4 to 4.5 basis points.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2018 02:13:02 GMT"}], "update_date": "2018-07-05", "authors_parsed": [["Cartea", "Alvaro", ""], ["Gan", "Luhui", ""], ["Jaimungal", "Sebastian", ""]]}, {"id": "1807.01785", "submitter": "Wei Wei", "authors": "Ken Seng Tan, Wei Wei, Xun Yu Zhou", "title": "Failure of Smooth Pasting Principle and Nonexistence of Equilibrium\n  Stopping Rules under Time-Inconsistency", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a time-inconsistent stopping problem in which the\ninconsistency arises from non-constant time preference rates. We show that the\nsmooth pasting principle, the main approach that has been used to construct\nexplicit solutions for conventional time-consistent optimal stopping problems,\nmay fail under time-inconsistency. Specifically, we prove that the smooth\npasting principle solves a time-inconsistent problem within the intra-personal\ngame theoretic framework if and only if a certain inequality on the model\nprimitives is satisfied. We show that the violation of this inequality can\nhappen even for very simple non-exponential discount functions. Moreover, we\ndemonstrate that the stopping problem does not admit any intra-personal\nequilibrium whenever the smooth pasting principle fails. The \"negative\" results\nin this paper caution blindly extending the classical approaches for\ntime-consistent stopping problems to their time-inconsistent counterparts.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2018 21:19:02 GMT"}, {"version": "v2", "created": "Mon, 18 Mar 2019 20:53:34 GMT"}, {"version": "v3", "created": "Wed, 4 Sep 2019 00:52:52 GMT"}], "update_date": "2019-09-05", "authors_parsed": [["Tan", "Ken Seng", ""], ["Wei", "Wei", ""], ["Zhou", "Xun Yu", ""]]}, {"id": "1807.01816", "submitter": "Gechun Liang", "authors": "Ying Hu, Gechun Liang, Shanjian Tang", "title": "Systems of ergodic BSDEs arising in regime switching forward performance\n  processes", "comments": "32 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce and solve a new type of quadratic backward stochastic\ndifferential equation systems defined in an infinite time horizon, called\n\\emph{ergodic BSDE systems}. Such systems arise naturally as candidate\nsolutions to characterize forward performance processes and their associated\noptimal trading strategies in a regime switching market. In addition, we\ndevelop a connection between the solution of the ergodic BSDE system and the\nlong-term growth rate of classical utility maximization problems, and use the\nergodic BSDE system to study the large time behavior of PDE systems with\nquadratic growth Hamiltonians.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2018 00:09:04 GMT"}, {"version": "v2", "created": "Tue, 10 Jul 2018 03:34:44 GMT"}, {"version": "v3", "created": "Wed, 5 Dec 2018 11:18:52 GMT"}, {"version": "v4", "created": "Thu, 25 Jun 2020 18:47:31 GMT"}], "update_date": "2020-06-29", "authors_parsed": [["Hu", "Ying", ""], ["Liang", "Gechun", ""], ["Tang", "Shanjian", ""]]}, {"id": "1807.01977", "submitter": "Marcelo Righi", "authors": "Marcelo Brutti Righi", "title": "A theory for combinations of risk measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study combinations of risk measures under no restrictive assumption on the\nset of alternatives. We develop and discuss results regarding the preservation\nof properties and acceptance sets for the combinations of risk measures. One of\nthe main results is the representation for resulting risk measures from the\nproperties of both alternative functionals and combination functions. To that,\nwe build on the development of a representation for arbitrary mixture of convex\nrisk measures. In this case, we obtain a penalty that recalls the notion of\ninf-convolution under theoretical measure integration. As an application, we\naddress the context of probability-based risk measurements for functionals on\nthe set of distribution functions. We develop results related to this specific\ncontext. We also explore features of individual interest generated by our\nframework, such as the preservation of continuity properties, the\nrepresentation of worst-case risk measures, stochastic dominance and\nelicitability. We also address model uncertainty measurement under our\nframework and propose a new class of measures for this task.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2018 12:57:47 GMT"}, {"version": "v2", "created": "Mon, 20 Aug 2018 19:05:17 GMT"}, {"version": "v3", "created": "Tue, 9 Oct 2018 19:02:40 GMT"}, {"version": "v4", "created": "Mon, 18 Mar 2019 18:39:10 GMT"}, {"version": "v5", "created": "Mon, 27 Jan 2020 22:05:05 GMT"}, {"version": "v6", "created": "Fri, 14 Aug 2020 13:04:25 GMT"}], "update_date": "2020-08-17", "authors_parsed": [["Righi", "Marcelo Brutti", ""]]}, {"id": "1807.02015", "submitter": "Mykhaylo Shkolnikov", "authors": "Sergey Nadtochiy, Mykhaylo Shkolnikov", "title": "Mean field systems on networks, with singular interaction through\n  hitting times", "comments": "37 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.AP math.GN q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Building on the line of work [DIRT15a], [DIRT15b], [NS17a], [DT17], [HLS18],\n[HS18] we continue the study of particle systems with singular interaction\nthrough hitting times. In contrast to the previous research, we (i) consider\nvery general driving processes and interaction functions, (ii) allow for\ninhomogeneous connection structures, and (iii) analyze a game in which the\nparticles determine their connections strategically. Hereby, we uncover two\ncompletely new phenomena. First, we characterize the \"times of fragility\" of\nsuch systems (e.g., the times when a macroscopic part of the population\ndefaults or gets infected simultaneously, or when the neuron cells\n\"synchronize\") explicitly in terms of the dynamics of the driving processes,\nthe current distribution of the particles' values, and the topology of the\nunderlying network (represented by its Perron-Frobenius eigenvalue). Second, we\nuse such systems to describe a dynamic credit-network game and show that, in\nequilibrium, the system regularizes: i.e., the times of fragility never occur,\nas the particles avoid them by adjusting their connections strategically. Two\nauxiliary mathematical results, useful in their own right, are uncovered during\nour investigation: a generalization of Schauder's fixed-point theorem for the\nSkorokhod space with the M1 topology, and the application of the max-plus\nalgebra to the equilibrium version of the network flow problem.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2018 14:16:04 GMT"}, {"version": "v2", "created": "Tue, 24 Sep 2019 22:00:13 GMT"}], "update_date": "2019-09-26", "authors_parsed": [["Nadtochiy", "Sergey", ""], ["Shkolnikov", "Mykhaylo", ""]]}, {"id": "1807.02227", "submitter": "David Goldberg", "authors": "David A. Goldberg and Yilun Chen", "title": "Beating the curse of dimensionality in options pricing and optimal\n  stopping", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.DS math.OC q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The fundamental problems of pricing high-dimensional path-dependent options\nand optimal stopping are central to applied probability and financial\nengineering. Modern approaches, often relying on ADP, simulation, and/or\nduality, have limited rigorous guarantees, which may scale poorly and/or\nrequire previous knowledge of basis functions. A key difficulty with many\napproaches is that to yield stronger guarantees, they would necessitate the\ncomputation of deeply nested conditional expectations, with the depth scaling\nwith the time horizon T.\n  We overcome this fundamental obstacle by providing an algorithm which can\ntrade-off between the guaranteed quality of approximation and the level of\nnesting required in a principled manner, without requiring a set of good basis\nfunctions. We develop a novel pure-dual approach, inspired by a connection to\nnetwork flows. This leads to a representation for the optimal value as an\ninfinite sum for which: 1. each term is the expectation of an elegant\nrecursively defined infimum; 2. the first k terms only require k levels of\nnesting; and 3. truncating at the first k terms yields an error of 1/k. This\nenables us to devise a simple randomized algorithm whose runtime is effectively\nindependent of the dimension, beyond the need to simulate sample paths of the\nunderlying process. Indeed, our algorithm is completely data-driven in that it\nonly needs the ability to simulate the original process, and requires no prior\nknowledge of the underlying distribution. Our method allows one to elegantly\ntrade-off between accuracy and runtime through a parameter epsilon controlling\nthe associated performance guarantee, with computational and sample complexity\nboth polynomial in T (and effectively independent of the dimension) for any\nfixed epsilon, in contrast to past methods typically requiring a complexity\nscaling exponentially in these parameters.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 02:53:45 GMT"}, {"version": "v2", "created": "Fri, 17 Aug 2018 18:47:02 GMT"}], "update_date": "2018-08-21", "authors_parsed": [["Goldberg", "David A.", ""], ["Chen", "Yilun", ""]]}, {"id": "1807.02243", "submitter": "Jian Sun", "authors": "Jian Sun", "title": "Generalization of Doob's Inequality and A Tighter Estimate on Look-back\n  Option Price", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this short note, we will strengthen the classic Doob's $L^p$ inequality\nfor sub-martingale processes. Because this inequality is of fundamental\nimportance to the theory of stochastic process, we believe this generalization\nwill find many interesting applications.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2018 03:41:40 GMT"}, {"version": "v2", "created": "Fri, 13 Jul 2018 05:39:55 GMT"}], "update_date": "2018-07-16", "authors_parsed": [["Sun", "Jian", ""]]}, {"id": "1807.02711", "submitter": "Zachary Feinstein", "authors": "Zachary Feinstein", "title": "Capital Regulation under Price Impacts and Dynamic Financial Contagion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct a continuous time model for price-mediated contagion\nprecipitated by a common exogenous stress to the banking book of all firms in\nthe financial system. In this setting, firms are constrained so as to satisfy a\nrisk-weight based capital ratio requirement. We use this model to find\nanalytical bounds on the risk-weights for assets as a function of the market\nliquidity. Under these appropriate risk-weights, we find existence and\nuniqueness for the joint system of firm behavior and the asset prices. We\nfurther consider an analytical bound on the firm liquidations, which allows us\nto construct exact formulas for stress testing the financial system with\ndeterministic or random stresses. Numerical case studies are provided to\ndemonstrate various implications of this model and analytical bounds.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jul 2018 19:11:29 GMT"}, {"version": "v2", "created": "Fri, 17 May 2019 02:10:16 GMT"}, {"version": "v3", "created": "Wed, 21 Aug 2019 21:05:58 GMT"}], "update_date": "2019-08-23", "authors_parsed": [["Feinstein", "Zachary", ""]]}, {"id": "1807.03229", "submitter": "Christa Cuchiero", "authors": "Christa Cuchiero, Martin Larsson, Sara Svaluto-Ferro", "title": "Probability measure-valued polynomial diffusions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a class of probability measure-valued diffusions, coined\npolynomial, of which the well-known Fleming--Viot process is a particular\nexample. The defining property of finite dimensional polynomial processes\nconsidered by Cuchiero et al. (2012) and Filipovic and Larsson (2016) is\ntransferred to this infinite dimensional setting. This leads to a\nrepresentation of conditional marginal moments via a finite dimensional linear\nPDE, whose spatial dimension corresponds to the degree of the moment. As a\nresult, the tractability of finite dimensional polynomial processes are\npreserved in this setting. We also obtain a representation of the corresponding\nextended generators, and prove well-posedness of the associated martingale\nproblems. In particular, uniqueness is obtained from the duality relationship\nwith the PDEs mentioned above.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jul 2018 15:28:42 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Cuchiero", "Christa", ""], ["Larsson", "Martin", ""], ["Svaluto-Ferro", "Sara", ""]]}, {"id": "1807.03813", "submitter": "Alexander Schied", "authors": "Xiangge Luo and Alexander Schied", "title": "Nash equilibrium for risk-averse investors in a market impact game with\n  transient price impact", "comments": null, "journal-ref": null, "doi": "10.1142/S238262662050001X", "report-no": null, "categories": "q-fin.TR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a market impact game for $n$ risk-averse agents that are\ncompeting in a market model with linear transient price impact and additional\ntransaction costs. For both finite and infinite time horizons, the agents aim\nto minimize a mean-variance functional of their costs or to maximize the\nexpected exponential utility of their revenues. We give explicit\nrepresentations for corresponding Nash equilibria and prove uniqueness in the\ncase of mean-variance optimization. A qualitative analysis of these Nash\nequilibria is conducted by means of numerical analysis.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 18:22:28 GMT"}, {"version": "v2", "created": "Mon, 17 Jun 2019 19:17:41 GMT"}], "update_date": "2020-10-30", "authors_parsed": [["Luo", "Xiangge", ""], ["Schied", "Alexander", ""]]}, {"id": "1807.03882", "submitter": "Martin Tegner", "authors": "Samuel N. Cohen and Martin Tegn\\'er", "title": "European Option Pricing with Stochastic Volatility models under\n  Parameter Uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider stochastic volatility models under parameter uncertainty and\ninvestigate how model derived prices of European options are affected. We let\nthe pricing parameters evolve dynamically in time within a specified region,\nand formalise the problem as a control problem where the control acts on the\nparameters to maximise/minimise the option value. Through a dual representation\nwith backward stochastic differential equations, we obtain explicit equations\nfor Heston's model and investigate several numerical solutions thereof. In an\nempirical study, we apply our results to market data from the S&P 500 index\nwhere the model is estimated to historical asset prices. We find that the\nconservative model-prices cover 98% of the considered market-prices for a set\nof European call options.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2018 21:49:31 GMT"}], "update_date": "2018-07-12", "authors_parsed": [["Cohen", "Samuel N.", ""], ["Tegnér", "Martin", ""]]}, {"id": "1807.04612", "submitter": "Laurence Carassus", "authors": "Julien Baptiste, Laurence Carassus and Emmanuel L\\'epinette", "title": "Pricing without martingale measure", "comments": "33 pages 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For several decades, the no-arbitrage (NA) condition and the martingale\nmeasures have played a major role in the financial asset's pricing theory. We\npropose a new approach for estimating the super-replication cost based on\nconvex duality instead of martingale measures duality: Our prices will be\nexpressed using Fenchel conjugate and bi-conjugate. The super-hedging problem\nleads endogenously to a weak condition of NA called Absence of Immediate Profit\n(AIP). We propose several characterizations of AIP and study the relation with\nthe classical notions of no-arbitrage. We also give some promising numerical\nillustrations.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2018 14:00:02 GMT"}, {"version": "v2", "created": "Fri, 10 May 2019 15:35:34 GMT"}], "update_date": "2019-05-13", "authors_parsed": [["Baptiste", "Julien", ""], ["Carassus", "Laurence", ""], ["Lépinette", "Emmanuel", ""]]}, {"id": "1807.05126", "submitter": "Andreas Sojmark", "authors": "Sean Ledger and Andreas Sojmark", "title": "At the Mercy of the Common Noise: Blow-ups in a Conditional\n  McKean--Vlasov Problem", "comments": "48 pages, 1 simulation, 2 figures, polished version of v4\n  (substantial revision with new results as compared to v2&3)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.AP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend a model of positive feedback and contagion in large mean-field\nsystems, by introducing a common source of noise driven by Brownian motion.\nAlthough the driving dynamics are continuous, the positive feedback effect can\nlead to `blow-up' phenomena whereby solutions develop jump-discontinuities. Our\nmain results are twofold and concern the conditional McKean--Vlasov formulation\nof the model. First and foremost, we show that there are global solutions to\nthis McKean--Vlasov problem, which can be realised as limit points of a\nmotivating particle system with common noise. Furthermore, we derive results on\nthe occurrence of blow-ups, thereby showing how these events can be triggered\nor prevented by the pathwise realisations of the common noise.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jul 2018 15:15:04 GMT"}, {"version": "v2", "created": "Tue, 31 Jul 2018 21:52:29 GMT"}, {"version": "v3", "created": "Thu, 16 May 2019 15:39:55 GMT"}, {"version": "v4", "created": "Thu, 11 Jun 2020 16:26:11 GMT"}, {"version": "v5", "created": "Fri, 12 Feb 2021 15:23:55 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Ledger", "Sean", ""], ["Sojmark", "Andreas", ""]]}, {"id": "1807.05396", "submitter": "Elisa Al\\`os Dr", "authors": "Elisa Al\\`os and Michael Coulon", "title": "On the optimal choice of strike conventions in exchange option pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important but rarely-addressed option pricing question is how to choose\nappropriate strikes for implied volatility inputs when pricing more exotic\nmulti-asset derivatives. By means of Malliavin Calculus we construct an optimal\nlog-linear strikevconvention for exchange options under stochastic volatility\nmodels. This novel approach allows us to minimize the difference between the\ncorresponding Margrabe computed price and the true option price. We show that\nthis optimal convention does not depend on the specific stochastic volatility\nmodel chosen. Numerical examples are given which provide strong support to the\nnew methodology.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jul 2018 13:21:38 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Alòs", "Elisa", ""], ["Coulon", "Michael", ""]]}, {"id": "1807.05448", "submitter": "Marek Rutkowski", "authors": "Tianyang Nie and Edward Kim and Marek Rutkowski", "title": "Arbitrage-Free Pricing of Game Options in Nonlinear Markets", "comments": "arXiv admin note: text overlap with arXiv:1804.10753", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal is to re-examine and extend the findings from the recent paper by\nDumitrescu, Quenez and Sulem (2017) who studied game options within the\nnonlinear arbitrage-free pricing approach developed in El Karoui and Quenez\n(1997). We consider the setup introduced in Kim, Nie and Rutkowski (2018) where\ncontracts of an American style were examined. We give a detailed study of\nunilateral pricing, hedging and exercising problems for the counterparties\nwithin a general nonlinear setup. We also present a BSDE approach, which is\nused to obtain more explicit results under suitable assumptions about solutions\nto doubly reflected BSDEs.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jul 2018 21:04:32 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Nie", "Tianyang", ""], ["Kim", "Edward", ""], ["Rutkowski", "Marek", ""]]}, {"id": "1807.05513", "submitter": "Lijun Bo", "authors": "Lijun Bo, Huafu Liao, Yongjin Wang", "title": "Optimal Credit Investment and Risk Control for an Insurer with\n  Regime-Switching", "comments": "30 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies an optimal investment and risk control problem for an\ninsurer with default contagion and regime-switching. The insurer in our model\nallocates his/her wealth across multi-name defaultable stocks and a riskless\nbond under regime-switching risk. Default events have an impact on the distress\nstate of the surviving stocks in the portfolio. The aim of the insurer is to\nmaximize the expected utility of the terminal wealth by selecting optimal\ninvestment and risk control strategies. We characterize the optimal trading\nstrategy of defaultable stocks and risk control for the insurer. By developing\na truncation technique, we analyze the existence and uniqueness of global\n(classical) solutions to the recursive HJB system. We prove the verification\ntheorem based on the (classical) solutions of the recursive HJB system.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jul 2018 08:39:45 GMT"}], "update_date": "2018-07-17", "authors_parsed": [["Bo", "Lijun", ""], ["Liao", "Huafu", ""], ["Wang", "Yongjin", ""]]}, {"id": "1807.05692", "submitter": "Rafa{\\l} {\\L}ochowski", "authors": "Lesiba Ch. Galane, Rafa{\\l} M. {\\L}ochowski and Farai J. Mhlanga", "title": "On SDEs with Lipschitz coefficients, driven by continuous, model-free\n  price paths", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using similar assumptions as in Revuz and Yor's book we prove the existence\nand uniqueness of the solutions of SDEs with Lipschitz coefficients, driven by\ncontinuous, model-free price paths. The main tool in our reasonings is a\nmodel-free version of the Burkholder-Davis-Gundy inequality for integrals\ndriven by model-free, continuous price paths.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2018 06:30:29 GMT"}, {"version": "v2", "created": "Thu, 19 Jul 2018 07:17:56 GMT"}, {"version": "v3", "created": "Fri, 20 Jul 2018 04:55:33 GMT"}, {"version": "v4", "created": "Sat, 29 Sep 2018 21:28:02 GMT"}, {"version": "v5", "created": "Sat, 16 Mar 2019 15:42:52 GMT"}], "update_date": "2019-03-19", "authors_parsed": [["Galane", "Lesiba Ch.", ""], ["Łochowski", "Rafał M.", ""], ["Mhlanga", "Farai J.", ""]]}, {"id": "1807.06449", "submitter": "Sina Yansori", "authors": "Tahir Choulli and Sina Yansori", "title": "Log-optimal portfolio without NFLVR: existence, complete\n  characterization, and duality", "comments": "arXiv admin note: text overlap with arXiv:1803.10128", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the log-optimal portfolio for a general semimartingale\nmodel. The most advanced literature on the topic elaborates existence and\ncharacterization of this portfolio under no-free-lunch-with-vanishing-risk\nassumption (NFLVR). There are many financial models violating NFLVR, while\nadmitting the log-optimal portfolio on the one hand. On the other hand, for\nfinancial markets under progressively enlargement of filtration, NFLVR remains\ncompletely an open issue, and hence the literature can be applied to these\nmodels. Herein, we provide a complete characterization of log-optimal portfolio\nand its associated optimal deflator, necessary and sufficient conditions for\ntheir existence, and we elaborate their duality as well without NFLVR.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jul 2018 02:03:47 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Choulli", "Tahir", ""], ["Yansori", "Sina", ""]]}, {"id": "1807.08081", "submitter": "Linlin Tian", "authors": "Linlin Tian, Xiaoyi Zhang", "title": "Optimal Dividend of Compound Poisson Process under a Stochastic Interest\n  Rate", "comments": "16 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we assume the insurance wealth process is driven by the\ncompound Poisson process. The discounting factor is modelled as a geometric\nBrownian motion at first and then as an exponential function of an integrated\nOrnstein-Uhlenbeck process. The objective is to maximize the cumulated value of\nexpected discounted dividends up to the time of ruin. We give an explicit\nexpression of the value function and the optimal strategy in the case of\ninterest rate following a geometric Brownian motion. For the case of the\nVasicek model, we explore some properties of the value function. Since we can\nnot find an explicit expression for the value function in the second case, we\nprove that the value function is the viscosity solution of the corresponding\nHJB equation.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jul 2018 03:55:39 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Tian", "Linlin", ""], ["Zhang", "Xiaoyi", ""]]}, {"id": "1807.08222", "submitter": "Andrew Papanicolaou", "authors": "Andrew Papanicolaou", "title": "Backward SDEs for Control with Partial Information", "comments": "Part of this research was performed while the author was visiting the\n  Institute for Pure and Applied Mathematics (IPAM), which is supported by the\n  National Science Foundation, Mathematical Finance (2018)", "journal-ref": null, "doi": "10.1111/mafi.12174", "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a non-Markov control problem arising in a financial\nmarket where asset returns depend on hidden factors. The problem is non-Markov\nbecause nonlinear filtering is required to make inference on these factors, and\nhence the associated dynamic program effectively takes the filtering\ndistribution as one of its state variables. This is of significant difficulty\nbecause the filtering distribution is a stochastic probability measure of\ninfinite dimension, and therefore the dynamic program has a state that cannot\nbe differentiated in the traditional sense. This lack of differentiability\nmeans that the problem cannot be solved using a Hamilton-Jacobi-Bellman (HJB)\nequation. This paper will show how the problem can be analyzed and solved using\nbackward stochastic differential equations (BSDEs), with a key tool being the\nproblem's dual formulation.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jul 2018 01:23:16 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Papanicolaou", "Andrew", ""]]}, {"id": "1807.10793", "submitter": "Rostislav Serota", "authors": "M. Dashti Moghaddam and R. A. Serota", "title": "Combined Mutiplicative-Heston Model for Stochastic Volatility", "comments": "10 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a model of stochastic volatility which combines features of the\nmultiplicative model for large volatilities and of the Heston model for small\nvolatilities. The steady-state distribution in this model is a Beta Prime and\nis characterized by the power-law behavior at both large and small\nvolatilities. We discuss the reasoning behind using this model as well as\nconsequences for our recent analyses of distributions of stock returns and\nrealized volatility.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2018 18:43:55 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Moghaddam", "M. Dashti", ""], ["Serota", "R. A.", ""]]}, {"id": "1807.11703", "submitter": "Yuri Kifer I", "authors": "Yuri Kifer", "title": "Shortfall Minimization for Game Options in Discrete Time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove existence of a self-financing strategy which minimizes shortfall for\ngame options in discrete time\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2018 08:51:20 GMT"}], "update_date": "2018-08-07", "authors_parsed": [["Kifer", "Yuri", ""]]}]