[{"id": "1809.00149", "submitter": "Tigran Atoyan", "authors": "Tigran Atoyan", "title": "Model-free trading and hedging with continuous price paths", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we provide a model-independent extension of the paradigm of\ndynamic hedging of derivative claims. We relate model-independent replication\nstrategies to local martingales having a closed form which we can characterise\nvia solutions of coupled PDEs. We provide a general framework and then apply it\nto a market with no traded claims, a market with an underlying asset and a\nconvex claim and a market with an underlying asset and a set of co-maturing\ncall options. The results encompass known examples of model-independent\nidentities and provide a methodology for deriving new identities.\n", "versions": [{"version": "v1", "created": "Sat, 1 Sep 2018 10:28:57 GMT"}, {"version": "v2", "created": "Sun, 7 Oct 2018 11:22:06 GMT"}], "update_date": "2018-10-09", "authors_parsed": [["Atoyan", "Tigran", ""]]}, {"id": "1809.00695", "submitter": "Marian Gidea", "authors": "Marian Gidea, Daniel Goldsmith, Yuri Katz, Pablo Roldan, Yonah Shmalo", "title": "Topological recognition of critical transitions in time series of\n  cryptocurrencies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.DS physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the time series of four major cryptocurrencies (Bitcoin, Ethereum,\nLitecoin, and Ripple) before the digital market crash at the end of 2017 -\nbeginning 2018. We introduce a methodology that combines topological data\nanalysis with a machine learning technique -- $k$-means clustering -- in order\nto automatically recognize the emerging chaotic regime in a complex system\napproaching a critical transition. We first test our methodology on the complex\nsystem dynamics of a Lorenz-type attractor, and then we apply it to the four\nmajor cryptocurrencies. We find early warning signals for critical transitions\nin the cryptocurrency markets, even though the relevant time series exhibit a\nhighly erratic behavior.\n", "versions": [{"version": "v1", "created": "Mon, 3 Sep 2018 19:27:48 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Gidea", "Marian", ""], ["Goldsmith", "Daniel", ""], ["Katz", "Yuri", ""], ["Roldan", "Pablo", ""], ["Shmalo", "Yonah", ""]]}, {"id": "1809.01972", "submitter": "Ulrich Horst", "authors": "Ulrich Horst and Xiaonyu Xia", "title": "Continuous viscosity solutions to linear-quadratic stochastic control\n  problems with singular terminal state constraint", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper establishes the existence of a unique nonnegative continuous\nviscosity solution to the HJB equation associated with a Markovian\nlinear-quadratic control problems with singular terminal state constraint and\npossibly unbounded cost coefficients. The existence result is based on a novel\ncomparison principle for semi-continuous viscosity sub- and supersolutions for\nPDEs with singular terminal value. Continuity of the viscosity solution is\nenough to carry out the verification argument.\n", "versions": [{"version": "v1", "created": "Thu, 6 Sep 2018 13:26:14 GMT"}, {"version": "v2", "created": "Thu, 27 Jun 2019 12:02:26 GMT"}, {"version": "v3", "created": "Tue, 28 Apr 2020 05:01:52 GMT"}], "update_date": "2020-04-29", "authors_parsed": [["Horst", "Ulrich", ""], ["Xia", "Xiaonyu", ""]]}, {"id": "1809.02245", "submitter": "Zhibai Zhang", "authors": "Peter Carr and Zhibai Zhang", "title": "Generalizing Geometric Brownian Motion", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To convert standard Brownian motion $Z$ into a positive process, Geometric\nBrownian motion (GBM) $e^{\\beta Z_t}, \\beta >0$ is widely used. We generalize\nthis positive process by introducing an asymmetry parameter $ \\alpha \\geq 0$\nwhich describes the instantaneous volatility whenever the process reaches a new\nlow. For our new process, $\\beta$ is the instantaneous volatility as prices\nbecome arbitrarily high. Our generalization preserves the positivity, constant\nproportional drift, and tractability of GBM, while expressing the instantaneous\nvolatility as a randomly weighted $L^2$ mean of $\\alpha$ and $\\beta$. The\nrunning minimum and relative drawup of this process are also analytically\ntractable. Letting $\\alpha = \\beta$, our positive process reduces to Geometric\nBrownian motion. By adding a jump to default to the new process, we introduce a\nnon-negative martingale with the same tractabilities. Assuming a security's\ndynamics are driven by these processes in risk neutral measure, we price\nseveral derivatives including vanilla, barrier and lookback options.\n", "versions": [{"version": "v1", "created": "Thu, 6 Sep 2018 23:01:27 GMT"}], "update_date": "2018-09-10", "authors_parsed": [["Carr", "Peter", ""], ["Zhang", "Zhibai", ""]]}, {"id": "1809.02362", "submitter": "Fabian Hornung", "authors": "Philipp Grohs, Fabian Hornung, Arnulf Jentzen, Philippe von\n  Wurstemberger", "title": "A proof that artificial neural networks overcome the curse of\n  dimensionality in the numerical approximation of Black-Scholes partial\n  differential equations", "comments": "124 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.LG math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Artificial neural networks (ANNs) have very successfully been used in\nnumerical simulations for a series of computational problems ranging from image\nclassification/image recognition, speech recognition, time series analysis,\ngame intelligence, and computational advertising to numerical approximations of\npartial differential equations (PDEs). Such numerical simulations suggest that\nANNs have the capacity to very efficiently approximate high-dimensional\nfunctions and, especially, such numerical simulations indicate that ANNs seem\nto admit the fundamental power to overcome the curse of dimensionality when\napproximating the high-dimensional functions appearing in the above named\ncomputational problems. There are also a series of rigorous mathematical\napproximation results for ANNs in the scientific literature. Some of these\nmathematical results prove convergence without convergence rates and some of\nthese mathematical results even rigorously establish convergence rates but\nthere are only a few special cases where mathematical results can rigorously\nexplain the empirical success of ANNs when approximating high-dimensional\nfunctions. The key contribution of this article is to disclose that ANNs can\nefficiently approximate high-dimensional functions in the case of numerical\napproximations of Black-Scholes PDEs. More precisely, this work reveals that\nthe number of required parameters of an ANN to approximate the solution of the\nBlack-Scholes PDE grows at most polynomially in both the reciprocal of the\nprescribed approximation accuracy $\\varepsilon > 0$ and the PDE dimension $d\n\\in \\mathbb{N}$ and we thereby prove, for the first time, that ANNs do indeed\novercome the curse of dimensionality in the numerical approximation of\nBlack-Scholes PDEs.\n", "versions": [{"version": "v1", "created": "Fri, 7 Sep 2018 09:03:55 GMT"}], "update_date": "2018-09-10", "authors_parsed": [["Grohs", "Philipp", ""], ["Hornung", "Fabian", ""], ["Jentzen", "Arnulf", ""], ["von Wurstemberger", "Philippe", ""]]}, {"id": "1809.03338", "submitter": "Juan-Fernando Ospina-Giraldo", "authors": "Juan Ospina", "title": "Pricing the Aunt Michaela Option with a Modified Black-Scholes Equation\n  with a Maturity Condition of Gamma Type", "comments": "9 pages. arXiv admin note: substantial text overlap with\n  arXiv:1508.03841", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using Maple, we compute a new exact series solution of a modified\nBlack-Scholes equation, recently proposed, for the case of the Aunt Michaela\noption with a maturity condition of gamma type. We show that the modified\nBlack-Scholes equation with the Aunt Michaela option is exactly solvable in\nterms of associated Laguerre polynomials or equivalently, in terms of Whittaker\nM functions. Finally, we make some numerical experiments with the analytical\nsolutions\n", "versions": [{"version": "v1", "created": "Thu, 6 Sep 2018 20:45:00 GMT"}], "update_date": "2018-09-11", "authors_parsed": [["Ospina", "Juan", ""]]}, {"id": "1809.03425", "submitter": "Yu-Sin Chang", "authors": "Yu-Sin Chang", "title": "Systemic Risk and the Dependence Structures", "comments": "41 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We propose a dynamic model of dependence structure between financial\ninstitutions within a financial system and we construct measures for dependence\nand financial instability. Employing Markov structures of joint credit\nmigrations, our model allows for contagious simultaneous jumps in credit\nratings and provides flexibility in modeling dependence structures. Another key\naspect is that the proposed measures consider the interdependence and reflect\nthe changing economic landscape as financial institutions evolve over time. In\nthe final part, we give several examples, where we study various dependence\nstructures and investigate their systemic instability measures. In particular,\nwe show that subject to the same pool of Markov chains, the simulated Markov\nstructures with distinct dependence structures generate different sequences of\nsystemic instability.\n", "versions": [{"version": "v1", "created": "Mon, 10 Sep 2018 16:05:33 GMT"}], "update_date": "2018-09-11", "authors_parsed": [["Chang", "Yu-Sin", ""]]}, {"id": "1809.03459", "submitter": "Wenpin Tang", "authors": "Xin Guo and Wenpin Tang and Renyuan Xu", "title": "A class of stochastic games and moving free boundary problems", "comments": "37 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.AP math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose and analyze a class of stochastic $N$-player games\nthat includes finite fuel stochastic games as a special case. We first derive\nsufficient conditions for the Nash equilibrium (NE) in the form of a\nverification theorem, which reveals an essential game component regarding the\ninteraction among players. It is an analytical representation of the\nconditional optimality condition for NEs, largely missing in the existing\nliterature on stochastic games. The derivation of NEs involves first solving a\nmulti-dimensional free boundary problem and then a Skorokhod problem, where the\nboundary is \"moving\" in that it depends on both the changes of the system and\nthe control strategies of other players. Finally, we reformulate NE strategies\nin the form of controlled rank-dependent stochastic differential equations.\n", "versions": [{"version": "v1", "created": "Mon, 10 Sep 2018 17:00:08 GMT"}, {"version": "v2", "created": "Mon, 17 Sep 2018 02:58:03 GMT"}, {"version": "v3", "created": "Mon, 10 Feb 2020 00:10:30 GMT"}, {"version": "v4", "created": "Wed, 12 Feb 2020 20:37:33 GMT"}], "update_date": "2020-02-14", "authors_parsed": [["Guo", "Xin", ""], ["Tang", "Wenpin", ""], ["Xu", "Renyuan", ""]]}, {"id": "1809.03641", "submitter": "Yu Feng Dr", "authors": "Yu Feng and Erik Schl\\\"ogl", "title": "Model Risk Measurement under Wasserstein Distance", "comments": null, "journal-ref": null, "doi": null, "report-no": "QFRC working paper 393", "categories": "q-fin.MF math.PR q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper proposes a new approach to model risk measurement based on the\nWasserstein distance between two probability measures. It formulates the\ntheoretical motivation resulting from the interpretation of fictitious\nadversary of robust risk management. The proposed approach accounts for\nequivalent and non-equivalent probability measures and incorporates the\neconomic reality of the fictitious adversary. It provides practically feasible\nresults that overcome the restriction of considering only models implying\nprobability measures equivalent to the reference model. The Wasserstein\napproach suits for various types of model risk problems, ranging from the\nsingle-asset hedging risk problem to the multi-asset allocation problem. The\nrobust capital market line, accounting for the correlation risk, is not\nachievable with other non-parametric approaches.\n", "versions": [{"version": "v1", "created": "Tue, 11 Sep 2018 00:33:54 GMT"}, {"version": "v2", "created": "Sat, 2 Mar 2019 06:41:40 GMT"}], "update_date": "2019-03-05", "authors_parsed": [["Feng", "Yu", ""], ["Schlögl", "Erik", ""]]}, {"id": "1809.04035", "submitter": "Jaehyuk Choi", "authors": "Jaehyuk Choi, Chenru Liu, Byoung Ki Seo", "title": "Hyperbolic normal stochastic volatility model", "comments": "26 pages, 4 figures, 5 tables", "journal-ref": "Journal of Futures Markets, 39(2):186-204, 2019", "doi": "10.1002/fut.21967", "report-no": null, "categories": "q-fin.MF stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For option pricing models and heavy-tailed distributions, this study proposes\na continuous-time stochastic volatility model based on an arithmetic Brownian\nmotion: a one-parameter extension of the normal stochastic alpha-beta-rho\n(SABR) model. Using two generalized Bougerol's identities in the literature,\nthe study shows that our model has a closed-form Monte-Carlo simulation scheme\nand that the transition probability for one special case follows Johnson's\n$S_U$ distribution---a popular heavy-tailed distribution originally proposed\nwithout stochastic process. It is argued that the $S_U$ distribution serves as\nan analytically superior alternative to the normal SABR model because the two\ndistributions are empirically similar.\n", "versions": [{"version": "v1", "created": "Tue, 11 Sep 2018 17:04:57 GMT"}], "update_date": "2019-01-10", "authors_parsed": [["Choi", "Jaehyuk", ""], ["Liu", "Chenru", ""], ["Seo", "Byoung Ki", ""]]}, {"id": "1809.04401", "submitter": "Ulrich Horst", "authors": "Guanxing Fu, Ulrich Horst", "title": "Mean-Field Leader-Follower Games with Terminal State Constraint", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze linear McKean-Vlasov forward-backward SDEs arising in\nleader-follower games with mean-field type control and terminal state\nconstraints on the state process. We establish an existence and uniqueness of\nsolutions result for such systems in time-weighted spaces as well as a\n{convergence} result of the solutions with respect to certain perturbations of\nthe drivers of both the forward and the backward component. The general results\nare used to solve a novel single-player model of portfolio liquidation under\nmarket impact with expectations feedback as well as a novel Stackelberg game of\noptimal portfolio liquidation with asymmetrically informed players.\n", "versions": [{"version": "v1", "created": "Wed, 12 Sep 2018 13:13:30 GMT"}], "update_date": "2018-09-13", "authors_parsed": [["Fu", "Guanxing", ""], ["Horst", "Ulrich", ""]]}, {"id": "1809.05947", "submitter": "Gordan Zitkovic", "authors": "Kim Weston and Gordan Zitkovic", "title": "An incomplete equilibrium with a stochastic annuity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove the global existence of an incomplete, continuous-time finite-agent\nRadner equilibrium in which exponential agents optimize their expected utility\nover both running consumption and terminal wealth. The market consists of a\ntraded annuity, and, along with unspanned income, the market is incomplete. Set\nin a Brownian framework, the income is driven by a multidimensional diffusion,\nand, in particular, includes mean-reverting dynamics.\n  The equilibrium is characterized by a system of fully coupled quadratic\nbackward stochastic differential equations, a solution to which is proved to\nexist under Markovian assumptions.\n", "versions": [{"version": "v1", "created": "Sun, 16 Sep 2018 20:21:33 GMT"}], "update_date": "2018-09-18", "authors_parsed": [["Weston", "Kim", ""], ["Zitkovic", "Gordan", ""]]}, {"id": "1809.06153", "submitter": "Zorana Grbac", "authors": "Zorana Grbac, David Krief, Peter Tankov", "title": "Long-time trajectorial large deviations for affine stochastic volatility\n  models and application to variance reduction for option pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work extends the variance reduction method for the pricing of possibly\npath-dependent derivatives, which was developed in (Genin and Tankov, 2016) for\nexponential L\\'evy models, to affine stochastic volatility models\n(Keller-Ressel, 2011). We begin by proving a pathwise large deviations\nprinciple for affine stochastic volatility models. We then apply a\ntime-dependent Esscher transform to the affine process and use Varadhan's\nlemma, in the fashion of (Guasoni and Robertson, 2008) and (Robertson, 2010),\nto approximate the problem of finding the Esscher measure that minimises the\nvariance of the Monte-Carlo estimator. We test the method on the Heston model\nwith and without jumps to demonstrate the numerical efficiency of the method.\n", "versions": [{"version": "v1", "created": "Mon, 17 Sep 2018 12:07:46 GMT"}], "update_date": "2018-09-18", "authors_parsed": [["Grbac", "Zorana", ""], ["Krief", "David", ""], ["Tankov", "Peter", ""]]}, {"id": "1809.06643", "submitter": "Erik Schlogl", "authors": "Mesias Alfeus, Martino Grasselli and Erik Schl\\\"ogl", "title": "A Consistent Stochastic Model of the Term Structure of Interest Rates\n  for Multiple Tenors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Explicitly taking into account the risk incurred when borrowing at a shorter\ntenor versus lending at a longer tenor (\"roll-over risk\"), we construct a\nstochastic model framework for the term structure of interest rates in which a\nfrequency basis (i.e. a spread applied to one leg of a swap to exchange one\nfloating interest rate for another of a different tenor in the same currency)\narises endogenously. This rollover risk consists of two components, a credit\nrisk component due to the possibility of being downgraded and thus facing a\nhigher credit spread when attempting to roll over short-term borrowing, and a\ncomponent reflecting the (systemic) possibility of being unable to roll over\nshort-term borrowing at the reference rate (e.g., LIBOR) due to an absence of\nliquidity in the market. The modelling framework is of \"reduced form\" in the\nsense that (similar to the credit risk literature) the source of credit risk is\nnot modelled (nor is the source of liquidity risk). However, the framework has\nmore structure than the literature seeking to simply model a different term\nstructure of interest rates for each tenor frequency, since relationships\nbetween rates for all tenor frequencies are established based on the modelled\nroll-over risk. We proceed to consider a specific case within this framework,\nwhere the dynamics of interest rate and roll-over risk are driven by a\nmultifactor Cox/Ingersoll/Ross-type process, show how such model can be\ncalibrated to market data, and used for relative pricing of interest rate\nderivatives, including bespoke tenor frequencies not liquidly traded in the\nmarket.\n", "versions": [{"version": "v1", "created": "Tue, 18 Sep 2018 11:12:57 GMT"}], "update_date": "2018-09-19", "authors_parsed": [["Alfeus", "Mesias", ""], ["Grasselli", "Martino", ""], ["Schlögl", "Erik", ""]]}, {"id": "1809.07516", "submitter": "Matteo Burzoni", "authors": "Erhan Bayraktar, Matteo Burzoni", "title": "On the quasi-sure superhedging duality with frictions", "comments": "Final version. To appear in Finance and Stochastics", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove the superhedging duality for a discrete-time financial market with\nproportional transaction costs under model uncertainty. Frictions are modeled\nthrough solvency cones as in the original model of [Kabanov, Y., Hedging and\nliquidation under transaction costs in currency markets. Fin. Stoch.,\n3(2):237-248, 1999] adapted to the quasi-sure setup of [Bouchard, B. and Nutz,\nM., Arbitrage and duality in nondominated discrete-time models. Ann. Appl.\nProbab., 25(2):823-859, 2015]. Our approach allows to remove the restrictive\nassumption of No Arbitrage of the Second Kind considered in [Bouchard, B.,\nDeng, S. and Tan, X., Super-replication with proportional transaction cost\nunder model uncertainty, Math. Fin., 29(3):837-860, 2019] and to show the\nduality under the more natural condition of No Strict Arbitrage. In addition,\nwe extend the results to models with portfolio constraints.\n", "versions": [{"version": "v1", "created": "Thu, 20 Sep 2018 07:56:55 GMT"}, {"version": "v2", "created": "Mon, 24 Jun 2019 12:09:52 GMT"}, {"version": "v3", "created": "Wed, 18 Sep 2019 17:41:03 GMT"}], "update_date": "2019-09-19", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Burzoni", "Matteo", ""]]}, {"id": "1809.07727", "submitter": "Andrey Itkin", "authors": "Peter Carr, Andrey Itkin", "title": "Geometric Local Variance Gamma model", "comments": "36 pages, 1 figure. arXiv admin note: text overlap with\n  arXiv:1802.09611", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes another extension of the Local Variance Gamma model\noriginally proposed by P. Carr in 2008, and then further elaborated on by Carr\nand Nadtochiy, 2017 (CN2017), and Carr and Itkin, 2018 (CI2018). As compared\nwith the latest version of the model developed in CI2018 and called the ELVG\n(the Expanded Local Variance Gamma model), here we provide two innovations.\nFirst, in all previous papers the model was constructed based on a Gamma\ntime-changed {\\it arithmetic} Brownian motion: with no drift in CI2017, and\nwith drift in CI2018, and the local variance to be a function of the spot level\nonly. In contrast, here we develop a {\\it geometric} version of this model with\ndrift. Second, in CN2017 the model was calibrated to option smiles assuming the\nlocal variance is a piecewise constant function of strike, while in CI2018 the\nlocal variance is a piecewise linear} function of strike. In this paper we\nconsider 3 piecewise linear models: the local variance as a function of strike,\nthe local variance as function of log-strike, and the local volatility as a\nfunction of strike (so, the local variance is a piecewise quadratic function of\nstrike). We show that for all these new constructions it is still possible to\nderive an ordinary differential equation for the option price, which plays a\nrole of Dupire's equation for the standard local volatility model, and,\nmoreover, it can be solved in closed form. Finally, similar to CI2018, we show\nthat given multiple smiles the whole local variance/volatility surface can be\nrecovered which does not require solving any optimization problem. Instead, it\ncan be done term-by-term by solving a system of non-linear algebraic equations\nfor each maturity which is fast.\n", "versions": [{"version": "v1", "created": "Wed, 19 Sep 2018 16:05:22 GMT"}, {"version": "v2", "created": "Tue, 25 Dec 2018 18:23:40 GMT"}], "update_date": "2018-12-31", "authors_parsed": [["Carr", "Peter", ""], ["Itkin", "Andrey", ""]]}, {"id": "1809.08200", "submitter": "Oleg Yu Vorobyev", "authors": "Oleg Yu. Vorobyev", "title": "Eventological H-theorem", "comments": "8 pages", "journal-ref": "Proc. of the VII All-Russian FAM Conf. on Financial and Actuarial\n  Mathematics and Related Fields. Krasnoyarsk, KSU (Oleg Vorobyev ed.), part 1,\n  2008, 51-58", "doi": null, "report-no": null, "categories": "q-fin.MF cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove the eventological $H$-theorem that complements the Boltzmann\nH-theorem from statistical mechanics and serves as a mathematical excuse\n(mathematically no less convincing than the Boltzmann H-theorem for the second\nlaw of thermodynamics) for what can be called \"the second law of eventology\",\nwhich justifies the application of Gibbs and \"anti-Gibbs\" distributions of sets\nof events minimizing relative entropy, as statistical models of the behavior of\na rational subject, striving for an equilibrium eventological choice between\nperception and activity in various spheres of her/his co-being.\n", "versions": [{"version": "v1", "created": "Wed, 19 Sep 2018 14:00:26 GMT"}], "update_date": "2018-09-24", "authors_parsed": [["Vorobyev", "Oleg Yu.", ""]]}, {"id": "1809.08262", "submitter": "Ting-Kam Leonard Wong", "authors": "Jin Ma, Ting-Kam Leonard Wong, Jianfeng Zhang", "title": "Time-consistent conditional expectation under probability distortion", "comments": "38 pages, 4 figures. To appear in Mathematics of Operations Research", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new notion of conditional nonlinear expectation under\nprobability distortion. Such a distorted nonlinear expectation is not\nsub-additive in general, so it is beyond the scope of Peng's framework of\nnonlinear expectations. A more fundamental problem when extending the distorted\nexpectation to a dynamic setting is time-inconsistency, that is, the usual\n\"tower property\" fails. By localizing the probability distortion and\nrestricting to a smaller class of random variables, we introduce a so-called\ndistorted probability and construct a conditional expectation in such a way\nthat it coincides with the original nonlinear expectation at time zero, but has\na time-consistent dynamics in the sense that the tower property remains valid.\nFurthermore, we show that in the continuous time model this conditional\nexpectation corresponds to a parabolic differential equation whose coefficient\ninvolves the law of the underlying diffusion. This work is the first step\ntowards a new understanding of nonlinear expectations under probability\ndistortion, and will potentially be a helpful tool for solving\ntime-inconsistent stochastic optimization problems.\n", "versions": [{"version": "v1", "created": "Fri, 21 Sep 2018 18:11:01 GMT"}, {"version": "v2", "created": "Sun, 15 Sep 2019 19:34:24 GMT"}, {"version": "v3", "created": "Wed, 30 Oct 2019 16:51:39 GMT"}, {"version": "v4", "created": "Wed, 5 Feb 2020 04:31:56 GMT"}, {"version": "v5", "created": "Thu, 25 Jun 2020 19:17:01 GMT"}], "update_date": "2020-06-29", "authors_parsed": [["Ma", "Jin", ""], ["Wong", "Ting-Kam Leonard", ""], ["Zhang", "Jianfeng", ""]]}, {"id": "1809.08960", "submitter": "Nikolai Dokuchaev", "authors": "Nikolai Dokuchaev", "title": "On a gap between rational annuitization price for producer and price for\n  customer", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper studies pricing of insurance products focusing on the pricing of\nannuities under uncertainty. This pricing problem is crucial for financial\ndecision making and was studied intensively, however, many open questions still\nremain. In particular, there is a so-called \"annuity puzzle\" related to certain\ninconsistency of existing financial theory with the empirical observations for\nthe annuities market. The paper suggests a pricing method based on the risk\nminimization such that both producer and customer seek to minimize the mean\nsquare hedging error accepted as a measure of risk. This leads to two different\nversions of the pricing problem: the selection of the annuity price given the\nrate of regular payments, and the selection of the rate of payments given the\nannuity price. It appears that solutions of these two problems are different.\nThis can contribute to explanation for the \"annuity puzzle\".\n", "versions": [{"version": "v1", "created": "Mon, 24 Sep 2018 14:16:48 GMT"}], "update_date": "2018-09-25", "authors_parsed": [["Dokuchaev", "Nikolai", ""]]}, {"id": "1809.09243", "submitter": "Yu-Jui Huang", "authors": "Yu-Jui Huang and Zhou Zhou", "title": "Strong and Weak Equilibria for Time-Inconsistent Stochastic Control in\n  Continuous Time", "comments": null, "journal-ref": "Mathematics of Operations Research, Vol. 46 (2021), Issue 2, pp\n  428-451", "doi": "10.1287/moor.2020.1066", "report-no": null, "categories": "math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new definition of continuous-time equilibrium controls is introduced. As\nopposed to the standard definition, which involves a derivative-type operation,\nthe new definition parallels how a discrete-time equilibrium is defined, and\nallows for unambiguous economic interpretation. The terms \"strong equilibria\"\nand \"weak equilibria\" are coined for controls under the new and the standard\ndefinitions, respectively. When the state process is a time-homogeneous\ncontinuous-time Markov chain, a careful asymptotic analysis gives complete\ncharacterizations of weak and strong equilibria. Thanks to Kakutani-Fan's\nfixed-point theorem, general existence of weak and strong equilibria is also\nestablished, under additional compactness assumption. Our theoretic results are\napplied to a two-state model under non-exponential discounting. In particular,\nwe demonstrate explicitly that there can be incentive to deviate from a weak\nequilibrium, which justifies the need for strong equilibria. Our analysis also\nprovides new results for the existence and characterization of discrete-time\nequilibria under infinite horizon.\n", "versions": [{"version": "v1", "created": "Mon, 24 Sep 2018 22:28:47 GMT"}, {"version": "v2", "created": "Tue, 22 Jan 2019 08:35:43 GMT"}, {"version": "v3", "created": "Mon, 12 Aug 2019 17:44:45 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Huang", "Yu-Jui", ""], ["Zhou", "Zhou", ""]]}, {"id": "1809.09268", "submitter": "Alexander Schied", "authors": "Paul Embrechts, Alexander Schied, Ruodu Wang", "title": "Robustness in the Optimization of Risk Measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.OC math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study issues of robustness in the context of Quantitative Risk Management\nand Optimization. We develop a general methodology for determining whether a\ngiven risk measurement related optimization problem is robust, which we call\n\"robustness against optimization\". The new notion is studied for various\nclasses of risk measures and expected utility and loss functions. Motivated by\npractical issues from financial regulation, special attention is given to the\ntwo most widely used risk measures in the industry, Value-at-Risk (VaR) and\nExpected Shortfall (ES). We establish that for a class of general optimization\nproblems, VaR leads to non-robust optimizers whereas convex risk measures\ngenerally lead to robust ones. Our results offer extra insight on the ongoing\ndiscussion about the comparative advantages of VaR and ES in banking and\ninsurance regulation. Our notion of robustness is conceptually different from\nthe field of robust optimization, to which some interesting links are derived.\n", "versions": [{"version": "v1", "created": "Tue, 25 Sep 2018 00:37:55 GMT"}, {"version": "v2", "created": "Sun, 11 Aug 2019 18:43:39 GMT"}, {"version": "v3", "created": "Thu, 11 Feb 2021 14:21:25 GMT"}], "update_date": "2021-02-12", "authors_parsed": [["Embrechts", "Paul", ""], ["Schied", "Alexander", ""], ["Wang", "Ruodu", ""]]}, {"id": "1809.09466", "submitter": "Imanol Perez Arribas", "authors": "Imanol Perez Arribas", "title": "Derivatives pricing using signature payoffs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce signature payoffs, a family of path-dependent derivatives that\nare given in terms of the signature of the price path of the underlying asset.\nWe show that these derivatives are dense in the space of continuous payoffs, a\nresult that is exploited to quickly price arbitrary continuous payoffs. This\napproach to pricing derivatives is then tested with European options, American\noptions, Asian options, lookback options and variance swaps. As we show,\nsignature payoffs can be used to price these derivatives with very high\naccuracy.\n", "versions": [{"version": "v1", "created": "Tue, 25 Sep 2018 13:30:12 GMT"}], "update_date": "2018-09-26", "authors_parsed": [["Arribas", "Imanol Perez", ""]]}, {"id": "1809.09588", "submitter": "David Criens", "authors": "David Criens", "title": "No Arbitrage in Continuous Financial Markets", "comments": "The article has been fully revised. To appear in \"Mathematics and\n  Financial Economics\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive integral tests for the existence and absence of arbitrage in a\nfinancial market with one risky asset which is either modeled as stochastic\nexponential of an Ito process or a positive diffusion with Markov switching. In\nparticular, we derive conditions for the existence of the minimal martingale\nmeasure. We also show that for Markov switching models the minimal martingale\nmeasure preserves the independence of the noise and we study how the minimal\nmartingale measure can be modified to change the structure of the switching\nmechanism. Our main mathematical tools are new criteria for the martingale and\nstrict local martingale property of certain stochastic exponentials.\n", "versions": [{"version": "v1", "created": "Tue, 25 Sep 2018 16:58:35 GMT"}, {"version": "v2", "created": "Wed, 17 Oct 2018 14:22:02 GMT"}, {"version": "v3", "created": "Thu, 22 Nov 2018 19:45:06 GMT"}, {"version": "v4", "created": "Fri, 26 Apr 2019 14:24:56 GMT"}, {"version": "v5", "created": "Wed, 12 Feb 2020 13:33:56 GMT"}], "update_date": "2020-02-13", "authors_parsed": [["Criens", "David", ""]]}, {"id": "1809.10123", "submitter": "Donghan Kim", "authors": "Ioannis Karatzas, Donghan Kim", "title": "Trading Strategies Generated Pathwise by Functions of Market Weights", "comments": "45 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Almost twenty years ago, E.R. Fernholz introduced portfolio generating\nfunctions which can be used to construct a variety of portfolios, solely in the\nterms of the individual companies' market weights. I. Karatzas and J. Ruf\nrecently developed another methodology for the functional construction of\nportfolios, which leads to very simple conditions for strong relative arbitrage\nwith respect to the market. In this paper, both of these notions of functional\nportfolio generation are generalized in a pathwise, probability-free setting;\nportfolio generating functions are substituted by path-dependent functionals,\nwhich involve the current market weights, as well as additional\nbounded-variation functions of past and present market weights. This\ngeneralization leads to a wider class of functionally-generated portfolios than\nwas heretofore possible, and yields improved conditions for outperforming the\nmarket portfolio over suitable time-horizons.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2018 17:07:46 GMT"}, {"version": "v2", "created": "Sat, 9 Mar 2019 20:45:53 GMT"}], "update_date": "2019-03-12", "authors_parsed": [["Karatzas", "Ioannis", ""], ["Kim", "Donghan", ""]]}, {"id": "1809.10256", "submitter": "Matthew Lorig", "authors": "Jimin Lin, Matthew Lorig", "title": "On Carr and Lee's correlation immunization strategy", "comments": "23 pages, 14 Figures, 4 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In their seminal work Carr and Lee (2008) show how to robustly price and\nreplicate a variety of claims written on the quadratic variation of a risky\nasset under the assumption that the asset's volatility process is independent\nof the Brownian motion that drives the asset's price. Additionally, they\npropose a correlation immunization strategy that minimizes the pricing and\nhedging error that results when the correlation between the risky asset's price\nand volatility is nonzero. In this paper, we show that the correlation\nimmunization strategy is the only strategy among the class of strategies\ndiscussed in Carr and Lee (2008) that results in real-valued hedging portfolios\nwhen the correlation between the asset's price and volatility is nonzero.\nAdditionally, we perform a number of Monte Carlo experiments to test the\neffectiveness of Carr and Lee's immunization strategy. Our results indicate\nthat the correlation immunization method is an effective means of reducing\npricing and hedging errors that result from nonzero correlation.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2018 22:32:24 GMT"}, {"version": "v2", "created": "Mon, 18 Mar 2019 18:17:53 GMT"}], "update_date": "2019-03-20", "authors_parsed": [["Lin", "Jimin", ""], ["Lorig", "Matthew", ""]]}, {"id": "1809.10566", "submitter": "Mark Whitmeyer", "authors": "Isaac M. Sonin and Mark Whitmeyer", "title": "Some Nontrivial Properties of a Formula for Compound Interest", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.GN q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the classical model of compound interest with a constant\nper-period payment and interest rate. We examine the outstanding balance\nfunction as well as the periodic payment function and show that the outstanding\nbalance function is not generally concave in the interest rate, but instead may\nbe initially convex on its domain and then concave.\n", "versions": [{"version": "v1", "created": "Thu, 27 Sep 2018 15:15:22 GMT"}], "update_date": "2018-09-28", "authors_parsed": [["Sonin", "Isaac M.", ""], ["Whitmeyer", "Mark", ""]]}, {"id": "1809.10716", "submitter": "Sascha Desmettre", "authors": "Nicole B\\\"auerle, Sascha Desmettre", "title": "Portfolio Optimization in Fractional and Rough Heston Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a fractional version of the Heston volatility model which is\ninspired by [16]. Within this model we treat portfolio optimization problems\nfor power utility functions. Using a suitable representation of the fractional\npart, followed by a reasonable approximation we show that it is possible to\ncast the problem into the classical stochastic control framework. This approach\nis generic for fractional processes. We derive explicit solutions and obtain as\na by-product the Laplace transform of the integrated volatility. In order to\nget rid of some undesirable features we introduce a new model for the rough\npath scenario which is based on the Marchaud fractional derivative. We provide\na numerical study to underline our results.\n", "versions": [{"version": "v1", "created": "Thu, 27 Sep 2018 18:37:52 GMT"}, {"version": "v2", "created": "Thu, 16 May 2019 11:59:16 GMT"}], "update_date": "2019-05-17", "authors_parsed": [["Bäuerle", "Nicole", ""], ["Desmettre", "Sascha", ""]]}, {"id": "1809.10955", "submitter": "Sascha Desmettre", "authors": "Sascha Desmettre", "title": "Change of Measure in the Heston Model given a violated Feller Condition", "comments": "I detected some wrong statements in this article so I withdraw it", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When dealing with Heston's stochastic volatility model, the change of measure\nfrom the subjective measure P to the objective measure Q is usually\ninvestigated under the assumption that the Feller condition is satisfied. This\npaper closes this gap in the literature by deriving sufficient conditions for\nthe existence of an equivalent (local) martingale measure in the Heston model\nwhen the Feller condition is violated. We also supplement the existing\nliterature by the case of a finite lifetime of the Laplace transform of the\nintegrated volatility process. Moreover, we deduce conditions for the stock\nprice process in the Heston model being a true martingale, regardless if the\nFeller condition is satisfied or not.\n", "versions": [{"version": "v1", "created": "Fri, 28 Sep 2018 10:42:16 GMT"}, {"version": "v2", "created": "Fri, 25 Oct 2019 19:17:42 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Desmettre", "Sascha", ""]]}]