[{"id": "1911.00386", "submitter": "Flavia Antonacci", "authors": "Flavia Antonacci and Cristina Costantini and Fernanda D'Ippoliti and\n  Marco Papi", "title": "Risk Neutral Valuation of Inflation-Linked Interest Rate Derivatives", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model for the joint evolution of European inflation, the\nEuropean Central Bank official interest rate and the short-term interest rate,\nin a stochastic, continuous time setting.\n  We derive the valuation equation for a contingent claim depending potentially\non all three factors. This valuation equation reduces to a finite number of\nCauchy problems for a degenerate parabolic PDE with non-local terms. We show\nthat the price of the contingent claim is the only viscosity solution of the\nvaluation equation.\n  We also provide an efficient numerical scheme to compute the price and\nimplement it in an example.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 14:04:02 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Antonacci", "Flavia", ""], ["Costantini", "Cristina", ""], ["D'Ippoliti", "Fernanda", ""], ["Papi", "Marco", ""]]}, {"id": "1911.00877", "submitter": "Matthieu Mariapragassam", "authors": "Alan Bain, Matthieu Mariapragassam, Christoph Reisinger", "title": "Calibration of Local-Stochastic and Path-Dependent Volatility Models to\n  Vanilla and No-Touch Options", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a generic calibration framework to both vanilla and no-touch\noptions for a large class of continuous semi-martingale models. The method\nbuilds upon the forward partial integro-differential equation (PIDE) derived in\nHambly et al. (2016), which allows fast computation of up-and-out call prices\nfor the complete set of strikes, barriers and maturities. It also utilises a\nnovel two-states particle method to estimate the Markovian projection of the\nvariance onto the spot and running maximum. We detail a step-by-step procedure\nfor a Heston-type local-stochastic volatility model with local vol-of-vol, as\nwell as two path-dependent volatility models where the local volatility\ncomponent depends on the running maximum. In numerical tests, we benchmark\nthese new models against standard models for a set of EURUSD market data, all\nthree models are seen to calibrate well within the market no-touch bid--ask.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2019 11:54:47 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Bain", "Alan", ""], ["Mariapragassam", "Matthieu", ""], ["Reisinger", "Christoph", ""]]}, {"id": "1911.01272", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "iCurrency?", "comments": "33 pages; a few trivial typos corrected, no other changes; to appear\n  in World Economics", "journal-ref": "World Economics 20(4) (2019) 151-175", "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss the idea of a purely algorithmic universal world iCurrency set\nforth in [Kakushadze and Liew, 2014] (https://ssrn.com/abstract=2542541) and\nexpanded in [Kakushadze and Liew, 2017] (https://ssrn.com/abstract=3059330) in\nlight of recent developments, including Libra. Is Libra a contender to become\niCurrency? Among other things, we analyze the Libra proposal, including the\nstability and volatility aspects, and discuss various issues that must be\naddressed. For instance, one cannot expect a cryptocurrency such as Libra to\ntrade in a narrow band without a robust monetary policy. The presentation in\nthe main text of the paper is intentionally nontechnical. It is followed by an\nextensive appendix with a mathematical description of the dynamics of\n(crypto)currency exchange rates in target zones, mechanisms for keeping the\nexchange rate from breaching the band, the role of volatility, etc.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2019 21:12:11 GMT"}, {"version": "v2", "created": "Tue, 12 Nov 2019 04:31:21 GMT"}], "update_date": "2020-01-29", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}, {"id": "1911.01700", "submitter": "Magnus Wiese", "authors": "Magnus Wiese, Lianjun Bai, Ben Wood, Hans Buehler", "title": "Deep Hedging: Learning to Simulate Equity Option Markets", "comments": null, "journal-ref": "NeurIPS 2019 Workshop on Robust AI in Financial Services: Data,\n  Fairness, Explainability, Trustworthiness, and Privacy", "doi": null, "report-no": null, "categories": "q-fin.CP cs.LG q-fin.MF q-fin.ST stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct realistic equity option market simulators based on generative\nadversarial networks (GANs). We consider recurrent and temporal convolutional\narchitectures, and assess the impact of state compression. Option market\nsimulators are highly relevant because they allow us to extend the limited\nreal-world data sets available for the training and evaluation of option\ntrading strategies. We show that network-based generators outperform classical\nmethods on a range of benchmark metrics, and adversarial training achieves the\nbest performance. Our work demonstrates for the first time that GANs can be\nsuccessfully applied to the task of generating multivariate financial time\nseries.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 10:23:39 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Wiese", "Magnus", ""], ["Bai", "Lianjun", ""], ["Wood", "Ben", ""], ["Buehler", "Hans", ""]]}, {"id": "1911.02194", "submitter": "Abootaleb Shirvani", "authors": "Abootaleb Shirvani, Svetlozar T. Rachev, and Frank J. Fabozzi", "title": "A Rational Finance Explanation of the Stock Predictability Puzzle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address one of the main puzzles in finance observed in the\nstock market by proponents of behavioral finance: the stock predictability\npuzzle. We offer a statistical model within the context of rational finance\nwhich can be used without relying on behavioral finance assumptions to model\nthe predictability of stock returns. We incorporate the predictability of stock\nreturns into the well-known Black-Scholes option pricing formula. Empirically,\nwe analyze the option and spot trader's market predictability of stock prices\nby defining a forward-looking measure which we call \"implied excess\npredictability\". The empirical results indicate the effect of option trader's\npredictability of stock returns on the price of stock options is an increasing\nfunction of moneyness, while this effect is decreasing for spot traders. These\nempirical results indicate potential asymmetric predictability of stock prices\nby spot and option traders. We show in pricing options with the strike price\nsignificantly higher or lower than the stock price, the predictability of the\nunderlying stock's return should be incorporated into the option pricing\nformula. In pricing options that have moneyness close to one, stock return\npredictability is not incorporated into the option pricing model because stock\nreturn predictability is the same for both types of traders. In other words,\nspot traders and option traders are equally informed about the future value of\nthe stock market in this case. Comparing different volatility measures, we find\nthat the difference between implied and realized variances or variance risk\npremium can potentially be used as a stock return predictor.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 04:15:17 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Shirvani", "Abootaleb", ""], ["Rachev", "Svetlozar T.", ""], ["Fabozzi", "Frank J.", ""]]}, {"id": "1911.02261", "submitter": "Damiano Rossello", "authors": "Christos E. Kountzakis, Damiano Rossello", "title": "Acceptability Indices of Performance for Bounded C\\`adl\\`ag Processes", "comments": "22 pages, 6 Figures, 2 Tables, 2 Appendixes", "journal-ref": null, "doi": "10.1080/17442508.2019.1687705", "report-no": null, "categories": "q-fin.MF q-fin.RM stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Indices of acceptability are well suited to frame the axiomatic features of\nmany performance measures, associated to terminal random cash flows.We extend\nthis notion to classes of c\\`adl\\`ag processes modelling cash flows over a\nfixed investment horizon.We provide a representation result for bounded paths.\nWe suggest an acceptability index based both on the static Average\nValue-at-Risk functional and the running minimum of the paths, which eventually\nrepresents a RAROC-type model. Some numerical comparisons clarify the magnitude\nof performance evaluation for processes.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 09:14:11 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Kountzakis", "Christos E.", ""], ["Rossello", "Damiano", ""]]}, {"id": "1911.02614", "submitter": "Christa Cuchiero", "authors": "Christa Cuchiero and Sara Svaluto-Ferro", "title": "Infinite dimensional polynomial processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce polynomial processes taking values in an arbitrary Banach space\n$B$ via their infinitesimal generator $L$ and the associated martingale\nproblem. We obtain two representations of the (conditional) moments in terms of\nsolutions of a system of ODEs on the truncated tensor algebra of dual\nrespectively bidual spaces. We illustrate how the well-known moment formulas\nfor finite dimensional or probability-measure valued polynomial processes can\nbe deduced in this general framework. As an application we consider polynomial\nforward variance curve models which appear in particular as Markovian lifts of\n(rough) Bergomi-type volatility models. Moreover, we show that the signature\nprocess of a $d$-dimensional Brownian motion is polynomial and derive its\nexpected value via the polynomial approach.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 20:11:48 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Cuchiero", "Christa", ""], ["Svaluto-Ferro", "Sara", ""]]}, {"id": "1911.04223", "submitter": "Torben Koch", "authors": "Torben Koch and Tiziano Vargiolu", "title": "Optimal Installation of Solar Panels with Price Impact: a Solvable\n  Singular Stochastic Control Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a price-maker company which generates electricity and sells it in\nthe spot market. The company can increase its level of installed power by\nirreversible installations of solar panels. In absence of the company's\neconomic activities, the spot electricity price evolves as an\nOrnstein-Uhlenbeck process, and therefore it has a mean-reverting behavior. The\ncurrent level of the company's installed power has a permanent impact on the\nelectricity price and affects its mean-reversion level. The company aims at\nmaximizing the total expected profits from selling electricity in the market,\nnet of the total expected proportional costs of installation. This problem is\nmodeled as a two-dimensional degenerate singular stochastic control problem in\nwhich the installation strategy is identified as the company's control\nvariable. We follow a guess-and-verify approach to solve the problem. We find\nthat the optimal installation strategy is triggered by a curve which separates\nthe waiting region, where it is not optimal to install additional panels, and\nthe installation region, where it is. Such a curve depends on the current level\nof the company's installed power, and is the unique strictly increasing\nfunction which solves a first-order ordinary differential equation (ODE).\nFinally, our study is complemented by a numerical analysis of the dependency of\nthe optimal installation strategy on the model's parameters.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 13:07:41 GMT"}], "update_date": "2019-11-12", "authors_parsed": [["Koch", "Torben", ""], ["Vargiolu", "Tiziano", ""]]}, {"id": "1911.05122", "submitter": "Moritz Vo{\\ss}", "authors": "Moritz Vo{\\ss}", "title": "A two-player price impact game", "comments": "41 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the competition of two strategic agents for liquidity in the\nbenchmark portfolio tracking setup of Bank, Soner, Voss (2017), both facing\ncommon aggregated temporary and permanent price impact \\`a la Almgren and\nChriss (2001). The resulting stochastic linear quadratic differential game with\nterminal state constraints allows for an explicitly available open-loop Nash\nequilibrium in feedback form. Our results reveal how the equilibrium strategies\nof the two players take into account the other agent's trading targets: either\nin an exploitative intent or by providing liquidity to the competitor,\ndepending on the ratio between temporary and permanent price impact. As a\nconsequence, different behavioral patterns can emerge as optimal in\nequilibrium. These insights complement existing studies in the literature on\npredatory trading models examined in the context of optimal portfolio\nliquidation problems.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 19:58:15 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Voß", "Moritz", ""]]}, {"id": "1911.05523", "submitter": "Luca De Gennaro Aquino", "authors": "Luca De Gennaro Aquino, Carole Bernard", "title": "Bounds on Multi-asset Derivatives via Neural Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using neural networks, we compute bounds on the prices of multi-asset\nderivatives given information on prices of related payoffs. As a main example,\nwe focus on European basket options and include information on the prices of\nother similar options, such as spread options and/or basket options on\nsubindices. We show that, in most cases, adding further constraints gives rise\nto bounds that are considerably tighter and discuss the maximizing/minimizing\ncopulas achieving such bounds. Our approach follows the literature on\nconstrained optimal transport and, in particular, builds on a recent paper by\nEckstein and Kupper (2019, Appl. Math. Optim.).\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 14:58:21 GMT"}, {"version": "v2", "created": "Tue, 3 Dec 2019 13:15:15 GMT"}, {"version": "v3", "created": "Mon, 13 Jan 2020 20:48:15 GMT"}, {"version": "v4", "created": "Thu, 16 Jan 2020 15:13:09 GMT"}, {"version": "v5", "created": "Fri, 28 Feb 2020 22:59:09 GMT"}, {"version": "v6", "created": "Sun, 1 Nov 2020 15:41:12 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Aquino", "Luca De Gennaro", ""], ["Bernard", "Carole", ""]]}, {"id": "1911.06159", "submitter": "Marcus Christiansen", "authors": "Marcus C. Christiansen, Boualem Djehiche", "title": "Nonlinear reserving and multiple contract modifications in life\n  insurance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Life insurance cash flows become reserve dependent when contract conditions\nare modified during the contract term on condition that actuarial equivalence\nis maintained. As a result, insurance cash flows and prospective reserves\ndepend on each other in a circular way, and it is a non-trivial problem to\nsolve that circularity and make cash flows and prospective reserves\nwell-defined. In Markovian models, the (stochastic) Thiele equation and the\nCantelli Theorem are the standard tools for solving the circularity issue and\nfor maintaining actuarial equivalence. This paper expands the stochastic Thiele\nequation and the Cantelli Theorem to non-Markovian frameworks and presents a\nrecursive scheme for the calculation of multiple contract modifications.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2019 14:59:59 GMT"}, {"version": "v2", "created": "Fri, 27 Mar 2020 14:28:56 GMT"}], "update_date": "2020-03-30", "authors_parsed": [["Christiansen", "Marcus C.", ""], ["Djehiche", "Boualem", ""]]}, {"id": "1911.08412", "submitter": "Indranil SenGupta", "authors": "Michael Roberts and Indranil SenGupta", "title": "Infinitesimal generators for two-dimensional L\\'evy process-driven\n  hypothesis testing", "comments": null, "journal-ref": null, "doi": "10.1007/s10436-019-00355-y", "report-no": null, "categories": "math.ST q-fin.MF stat.AP stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present the testing of four hypotheses on two streams of\nobservations that are driven by L\\'evy processes. This is applicable for\nsequential decision making on the state of two-sensor systems. In one case,\neach sensor receives or does not receive a signal obstructed by noise. In\nanother, each sensor receives data-driven by L\\'evy processes with large or\nsmall jumps. In either case, these give rise to four possibilities.\nInfinitesimal generators are presented and analyzed. Bounds for infinitesimal\ngenerators in terms of \\emph{super-solutions} and \\emph{sub-solutions} are\ncomputed. An application of this procedure for the stochastic model is also\npresented in relation to the financial market.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 16:26:44 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Roberts", "Michael", ""], ["SenGupta", "Indranil", ""]]}, {"id": "1911.10106", "submitter": "Alex S.L. Tse", "authors": "Alex S.L. Tse, Harry Zheng", "title": "Speculative Trading, Prospect Theory and Transaction Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF econ.GN q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A speculative agent with Prospect Theory preference chooses the optimal time\nto purchase and then to sell an indivisible risky asset as to maximize the\nexpected utility of the round-trip profit net of transaction costs. The\noptimization problem is formulated as a sequential optimal stopping problem and\nwe provide a complete characterization of the solution. Depending on the\npreference and market parameters as well as the initial price of the asset, the\noptimal strategy can be \"buy and hold\", \"buy low sell high\", \"buy high sell\nhigher\" or \"no trading\". Transaction costs do not necessarily curb speculative\ntrading. For example, while a large proportional transaction cost on sale can\nunambiguously suppress trading participation, introducing a fixed market entry\nfee will indeed encourage trading when the asset price level is high.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 16:08:46 GMT"}], "update_date": "2019-11-25", "authors_parsed": [["Tse", "Alex S. L.", ""], ["Zheng", "Harry", ""]]}, {"id": "1911.10149", "submitter": "Thomas Reitsam", "authors": "Francesca Biagini, Thomas Reitsam", "title": "Asset Price Bubbles in market models with proportional transaction costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study asset price bubbles in market models with proportional transaction\ncosts $\\lambda\\in (0,1)$ and finite time horizon $T$ in the setting of [49]. By\nfollowing [28], we define the fundamental value $F$ of a risky asset $S$ as the\nprice of a super-replicating portfolio for a position terminating in one unit\nof the asset and zero cash. We then obtain a dual representation for the\nfundamental value by using the super-replication theorem of [50]. We say that\nan asset price has a bubble if its fundamental value differs from the ask-price\n$(1+\\lambda)S$. We investigate the impact of transaction costs on asset price\nbubbles and show that our model intrinsically includes the birth of a bubble.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 17:17:41 GMT"}, {"version": "v2", "created": "Mon, 2 Dec 2019 13:52:35 GMT"}, {"version": "v3", "created": "Fri, 17 Jan 2020 18:02:30 GMT"}, {"version": "v4", "created": "Tue, 8 Dec 2020 14:50:53 GMT"}], "update_date": "2020-12-09", "authors_parsed": [["Biagini", "Francesca", ""], ["Reitsam", "Thomas", ""]]}, {"id": "1911.10972", "submitter": "Andrew Schaug", "authors": "Andrew Schaug and Harish Chandra", "title": "On unbiased simulations of stochastic bridges conditioned on extrema", "comments": "24 pages, 26 images", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic bridges are commonly used to impute missing data with a lower\nsampling rate to generate data with a higher sampling rate, while preserving\nkey properties of the dynamics involved in an unbiased way. While the\ngeneration of Brownian bridges and Ornstein-Uhlenbeck bridges is well\nunderstood, unbiased generation of such stochastic bridges subject to a given\nextremum has been less explored in the literature. After a review of known\nresults, we compare two algorithms for generating Brownian bridges constrained\nto a given extremum, one of which generalises to other diffusions. We further\napply this to generate unbiased Ornstein-Uhlenbeck bridges and unconstrained\nprocesses, both constrained to a given extremum, along with more tractable\nnumerical approximations of these algorithms. Finally, we consider the case of\ndrift, and applications to geometric Brownian motions.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 15:16:10 GMT"}, {"version": "v2", "created": "Thu, 28 Nov 2019 19:26:28 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Schaug", "Andrew", ""], ["Chandra", "Harish", ""]]}, {"id": "1911.11475", "submitter": "Will Hicks Mr", "authors": "Will Hicks", "title": "Closed Quantum Black-Scholes: Quantum Drift and the Heisenberg Equation\n  of Motion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we model a financial derivative price as an observable on the\nmarket state function. We apply geometric techniques to integrating the\nHeisenberg Equation of Motion. We illustrate how the non-commutative nature of\nthe model introduces quantum interference effects that can act as either a drag\nor a boost on the resulting return. The ultimate objective is to investigate\nthe nature of quantum drift in the Accardi-Boukas quantum Black-Scholes\nframework which involves modelling the financial market as a quantum\nobservable, and introduces randomness through the Hudson-Parthasarathy quantum\nstochastic calculus. In particular we aim to differentiate randomness that is\nintroduced through external noise (quantum stochastic calculus) and randomness\nthat is fundamental to a quantum system (Heisenberg Equation of Motion).\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 11:52:59 GMT"}, {"version": "v2", "created": "Thu, 5 Dec 2019 10:43:24 GMT"}, {"version": "v3", "created": "Fri, 24 Jan 2020 17:34:59 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Hicks", "Will", ""]]}, {"id": "1911.11501", "submitter": "Masaaki Fujii", "authors": "Masaaki Fujii", "title": "Probabilistic Approach to Mean Field Games and Mean Field Type Control\n  Problems with Multiple Populations", "comments": "Forthcoming in Minimax Theory and its Applications. 50 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we systematically investigate mean field games and mean field\ntype control problems with multiple populations using a coupled system of\nforward-backward stochastic differential equations of McKean-Vlasov type\nstemming from Pontryagin's stochastic maximum principle. Although the same cost\nfunctions as well as the coefficient functions of the state dynamics are shared\namong the agents within each population, they can be different population by\npopulation. We study the mean field limit for the three different situations;\n(i) every agent is non-cooperative; (ii) the agents within each population are\ncooperative; and (iii) the agents in some populations are cooperative but those\nin the other populations are not. We provide several sets of sufficient\nconditions for the existence of a mean field equilibrium for each of these\ncases. Furthermore, under appropriate conditions, we show that the mean field\nsolution to each of these problems actually provides an approximate Nash\nequilibrium for the corresponding game with a large but finite number of\nagents.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 13:03:55 GMT"}, {"version": "v2", "created": "Mon, 16 Dec 2019 06:02:13 GMT"}, {"version": "v3", "created": "Mon, 2 Nov 2020 02:37:13 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Fujii", "Masaaki", ""]]}, {"id": "1911.12231", "submitter": "Bernhard Hientzsch", "authors": "Bernhard Hientzsch", "title": "Introduction to Solving Quant Finance Problems with Time-Stepped FBSDE\n  and Deep Learning", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.CE q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this introductory paper, we discuss how quantitative finance problems\nunder some common risk factor dynamics for some common instruments and\napproaches can be formulated as time-continuous or time-discrete\nforward-backward stochastic differential equations (FBSDE) final-value or\ncontrol problems, how these final value problems can be turned into control\nproblems, how time-continuous problems can be turned into time-discrete\nproblems, and how the forward and backward stochastic differential equations\n(SDE) can be time-stepped. We obtain both forward and backward time-stepped\ntime-discrete stochastic control problems (where forward and backward indicate\nin which direction the Y SDE is time-stepped) that we will solve with\noptimization approaches using deep neural networks for the controls and\nstochastic gradient and other deep learning methods for the actual\noptimization/learning. We close with examples for the forward and backward\nmethods for an European option pricing problem. Several methods and approaches\nare new.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 15:45:06 GMT"}], "update_date": "2019-11-29", "authors_parsed": [["Hientzsch", "Bernhard", ""]]}, {"id": "1911.12596", "submitter": "Peiwan Wang", "authors": "Peiwan Wang, Lu Zong and Ye Ma", "title": "An Integrated Early Warning System for Stock Market Turbulence", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.EM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study constructs an integrated early warning system (EWS) that\nidentifies and predicts stock market turbulence. Based on switching ARCH\n(SWARCH) filtering probabilities of the high volatility regime, the proposed\nEWS first classifies stock market crises according to an indicator function\nwith thresholds dynamically selected by the two-peak method. A hybrid algorithm\nis then developed in the framework of a long short-term memory (LSTM) network\nto make daily predictions that alert turmoils. In the empirical evaluation\nbased on ten-year Chinese stock data, the proposed EWS yields satisfying\nresults with the test-set accuracy of $96.6\\%$ and on average $2.4$ days of the\nforewarned period. The model's stability and practical value in real-time\ndecision-making are also proven by the cross-validation and back-testing.\n", "versions": [{"version": "v1", "created": "Thu, 28 Nov 2019 08:52:19 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Wang", "Peiwan", ""], ["Zong", "Lu", ""], ["Ma", "Ye", ""]]}, {"id": "1911.12944", "submitter": "Hyungbin Park", "authors": "Hyungbin Park and Jonghwa Park", "title": "Pricing and hedging short-maturity Asian options in local volatility\n  models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses the short-maturity behavior of Asian option prices and\nhedging portfolios. We consider the risk-neutral valuation and the delta value\nof the Asian option having a H\\\"older continuous payoff function in a local\nvolatility model. The main idea of this analysis is that the local volatility\nmodel can be approximated by a Gaussian process at short maturity $T.$ By\ncombining this approximation argument with Malliavin calculus, we conclude that\nthe short-maturity behaviors of Asian option prices and the delta values are\napproximately expressed as those of their European counterparts with volatility\n$$\\sigma_{A}(T):=\\sqrt{\\frac{1}{T^3}\\int_0^T\\sigma^2(t,S_0)(T-t)^2\\,dt}\\,,$$\nwhere $\\sigma(\\cdot,\\cdot)$ is the local volatility function and $S_0$ is the\ninitial value of the stock. In addition, we show that the convergence rate of\nthe approximation is determined by the H\\\"older exponent of the payoff\nfunction. Finally, the short-maturity asymptotics of Asian call and put options\nare discussed from the viewpoint of the large deviation principle.\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2019 04:19:59 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Park", "Hyungbin", ""], ["Park", "Jonghwa", ""]]}, {"id": "1911.12969", "submitter": "Ulrich Horst", "authors": "Ulrich Horst and Wei Xu", "title": "The Microstructure of Stochastic Volatility Models with Self-Exciting\n  Jump Dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a general probabilistic framework within which we establish\nscaling limits for a class of continuous-time stochastic volatility models with\nself-exciting jump dynamics. In the scaling limit, the joint dynamics of asset\nreturns and volatility is driven by independent Gaussian white noises and two\nindependent Poisson random measures that capture the arrival of exogenous\nshocks and the arrival of self-excited shocks, respectively. Various\nwell-studied stochastic volatility models with and without self-exciting\nprice/volatility co-jumps are obtained as special cases under different scaling\nregimes. We analyze the impact of external shocks on the market dynamics,\nespecially their impact on jump cascades and show in a mathematically rigorous\nmanner that many small external shocks may tigger endogenous jump cascades in\nasset returns and stock price volatility.\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2019 06:45:27 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Horst", "Ulrich", ""], ["Xu", "Wei", ""]]}, {"id": "1911.13123", "submitter": "Jaehyuk Choi", "authors": "Jaehyuk Choi and Lixin Wu", "title": "The equivalent constant-elasticity-of-variance (CEV) volatility of the\n  stochastic-alpha-beta-rho (SABR) model", "comments": null, "journal-ref": "Journal of Economic Dynamics and Control, 128:104143, 2021", "doi": "10.1016/j.jedc.2021.104143", "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study presents new analytic approximations of the\nstochastic-alpha-beta-rho (SABR) model. Unlike existing studies that focus on\nthe equivalent Black-Scholes (BS) volatility, we instead derive the equivalent\nconstant-elasticity-of-variance (CEV) volatility. Our approach effectively\nreduces the approximation error in a way similar to the control variate method\nbecause the CEV model is the zero vol-of-vol limit of the SABR model. Moreover,\nthe CEV volatility approximation yields a finite value at a zero strike and\nthus conveniently leads to a small-time asymptotics for the mass at zero. The\nnumerical results compare favorably with the BS volatility approximations in\nterms of the approximation accuracy, small-strike volatility asymptotics, and\nno-arbitrage region.\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2019 14:36:31 GMT"}, {"version": "v2", "created": "Thu, 26 Dec 2019 14:10:12 GMT"}, {"version": "v3", "created": "Tue, 2 Jun 2020 09:29:04 GMT"}, {"version": "v4", "created": "Fri, 19 Feb 2021 00:22:07 GMT"}, {"version": "v5", "created": "Tue, 8 Jun 2021 14:38:22 GMT"}], "update_date": "2021-06-09", "authors_parsed": [["Choi", "Jaehyuk", ""], ["Wu", "Lixin", ""]]}, {"id": "1911.13300", "submitter": "Indranil SenGupta", "authors": "Indranil SenGupta, William Nganje, Erik Hanson", "title": "Refinements of Barndorff-Nielsen and Shephard model: an analysis of\n  crude oil price with machine learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.MF stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A commonly used stochastic model for derivative and commodity market analysis\nis the Barndorff-Nielsen and Shephard (BN-S) model. Though this model is very\nefficient and analytically tractable, it suffers from the absence of long range\ndependence and many other issues. For this paper, the analysis is restricted to\ncrude oil price dynamics. A simple way of improving the BN-S model with the\nimplementation of various machine learning algorithms is proposed. This refined\nBN-S model is more efficient and has fewer parameters than other models which\nare used in practice as improvements of the BN-S model. The procedure and the\nmodel show the application of data science for extracting a \"deterministic\ncomponent\" out of processes that are usually considered to be completely\nstochastic. Empirical applications validate the efficacy of the proposed model\nfor long range dependence.\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2019 18:57:09 GMT"}, {"version": "v2", "created": "Wed, 4 Mar 2020 17:41:25 GMT"}, {"version": "v3", "created": "Wed, 25 Mar 2020 15:04:01 GMT"}], "update_date": "2020-03-26", "authors_parsed": [["SenGupta", "Indranil", ""], ["Nganje", "William", ""], ["Hanson", "Erik", ""]]}]