[{"id": "2002.01528", "submitter": "Yan Dolinsky", "authors": "Yan Dolinsky", "title": "On Shortfall Risk Minimization for Game Options", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the existence of an optimal hedging strategy for the\nshortfall risk measure in the game options setup. We consider the continuous\ntime Black--Scholes (BS) model. Our first result says that in the case where\nthe game contingent claim (GCC) can be exercised only on a finite set of times,\nthere exists an optimal strategy. Our second and main result is an example\nwhich demonstrates that for the case where the GCC can be stopped on the all\ntime interval, optimal portfolio strategies need not always exist.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 20:42:35 GMT"}], "update_date": "2020-02-06", "authors_parsed": [["Dolinsky", "Yan", ""]]}, {"id": "2002.02604", "submitter": "Tao Chen", "authors": "Tomasz R. Bielecki, Tao Chen, Igor Cialenco", "title": "Time-inconsistent Markovian control problems under model uncertainty\n  with application to the mean-variance portfolio selection", "comments": "22 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a class of time-inconsistent terminal Markovian\ncontrol problems in discrete time subject to model uncertainty. We combine the\nconcept of the sub-game perfect strategies with the adaptive robust stochastic\nto tackle the theoretical aspects of the considered stochastic control problem.\nConsequently, as an important application of the theoretical results, by\napplying a machine learning algorithm we solve numerically the mean-variance\nportfolio selection problem under the model uncertainty.\n", "versions": [{"version": "v1", "created": "Fri, 7 Feb 2020 03:26:53 GMT"}, {"version": "v2", "created": "Wed, 9 Sep 2020 01:48:52 GMT"}], "update_date": "2020-09-10", "authors_parsed": [["Bielecki", "Tomasz R.", ""], ["Chen", "Tao", ""], ["Cialenco", "Igor", ""]]}, {"id": "2002.03286", "submitter": "Oleksii Mostovyi", "authors": "Sarah Boese, Tracy Cui, Samuel Johnston, Gianmarco Molino and Oleksii\n  Mostovyi", "title": "Stability and asymptotic analysis of the F\\\"ollmer-Schweizer\n  decomposition on a finite probability space", "comments": "17 pages, 3 figures. This paper is a part of an REU project conduced\n  in Summer 2019 at the University of Connecticut. Accepted in Involve", "journal-ref": "Involve 13 (2020) 607-623", "doi": "10.2140/involve.2020.13.607", "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  First, we consider the problem of hedging in complete binomial models. Using\nthe discrete-time F\\\"ollmer-Schweizer decomposition, we demonstrate the\nequivalence of the backward induction and sequential regression approaches.\nSecond, in incomplete trinomial models, we examine the extension of the\nsequential regression approach for approximation of contingent claims. Then, on\na finite probability space, we investigate stability of the discrete-time\nF\\\"ollmer-Schweizer decomposition with respect to perturbations of the stock\nprice dynamics and, finally, perform its asymptotic analysis under simultaneous\nperturbations of the drift and volatility of the underlying discounted stock\nprice process, where we prove stability and obtain explicit formulas for the\nleading order correction terms.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2020 05:18:08 GMT"}, {"version": "v2", "created": "Fri, 26 Jun 2020 18:51:25 GMT"}], "update_date": "2020-11-25", "authors_parsed": [["Boese", "Sarah", ""], ["Cui", "Tracy", ""], ["Johnston", "Samuel", ""], ["Molino", "Gianmarco", ""], ["Mostovyi", "Oleksii", ""]]}, {"id": "2002.03448", "submitter": "Sergey V. Lototsky", "authors": "Sergey Lototsky and Austin Pollok", "title": "Kelly Criterion: From a Simple Random Walk to L\\'{e}vy Processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The original Kelly criterion provides a strategy to maximize the long-term\ngrowth of winnings in a sequence of simple Bernoulli bets with an edge, that\nis, when the expected return on each bet is positive. The objective of this\nwork is to consider more general models of returns and the continuous time, or\nhigh frequency, limits of those models.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2020 21:19:03 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Lototsky", "Sergey", ""], ["Pollok", "Austin", ""]]}, {"id": "2002.04304", "submitter": "Marc Rohloff", "authors": "Marc Rohloff, Alexander Vogt", "title": "Timing Excess Returns A cross-universe approach to alpha", "comments": "23 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a simple model that uses time series momentum in order to\nconstruct strategies that systematically outperform their benchmark. The\nsimplicity of our model is elegant: We only require a benchmark time series and\nseveral related investable indizes, not requiring regression or other models to\nestimate our parameters. We find that our one size fits all approach delivers\nsignificant outperformance in both equity and bond markets while meeting the\nex-ante risk requirements, nearly doubling yearly returns vs. the MSCI World\nand Bloomberg Barclays Euro Aggregate Corporate Bond benchmarks in a long-only\nbacktest. We then combine both approaches into an absolute return strategy by\nbenchmarking vs. the Eonia Total Return Index and find significant\noutperformance at a sharpe ratio of 1.8. Furthermore, we demonstrate that our\nmodel delivers a benefit versus a static portfolio with fixed mean weights,\nshowing that timing of excess return momentum has a sizeable benefit vs. static\nallocations. This also applies to the passively investable equity factors,\nwhere we outperform a static factor exposure portfolio with statistical\nsignificance. Also, we show that our model delivers an alpha after deducting\ntransaction costs.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 10:56:17 GMT"}], "update_date": "2020-02-12", "authors_parsed": [["Rohloff", "Marc", ""], ["Vogt", "Alexander", ""]]}, {"id": "2002.04675", "submitter": "Ludovic Mathys", "authors": "Walter Farkas, Ludovic Mathys, Nikola Vasiljevi\\'c", "title": "Intra-Horizon Expected Shortfall and Risk Structure in Models with Jumps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present article deals with intra-horizon risk in models with jumps. Our\ngeneral understanding of intra-horizon risk is along the lines of the approach\ntaken in Boudoukh, Richardson, Stanton and Whitelaw (2004), Rossello (2008),\nBhattacharyya, Misra and Kodase (2009), Bakshi and Panayotov (2010), and\nLeippold and Vasiljevi\\'c (2019). In particular, we believe that quantifying\nmarket risk by strictly relying on point-in-time measures cannot be deemed a\nsatisfactory approach in general. Instead, we argue that complementing this\napproach by studying measures of risk that capture the magnitude of losses\npotentially incurred at any time of a trading horizon is necessary when dealing\nwith (m)any financial position(s). To address this issue, we propose an\nintra-horizon analogue of the expected shortfall for general profit and loss\nprocesses and discuss its key properties. Our intra-horizon expected shortfall\nis well-defined for (m)any popular class(es) of L\\'evy processes encountered\nwhen modeling market dynamics and constitutes a coherent measure of risk, as\nintroduced in Cheridito, Delbaen and Kupper (2004). On the computational side,\nwe provide a simple method to derive the intra-horizon risk inherent to popular\nL\\'evy dynamics. Our general technique relies on results for\nmaturity-randomized first-passage probabilities and allows for a derivation of\ndiffusion and single jump risk contributions. These theoretical results are\ncomplemented with an empirical analysis, where popular L\\'evy dynamics are\ncalibrated to S&P 500 index data and an analysis of the resulting intra-horizon\nrisk is presented.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 20:50:44 GMT"}, {"version": "v2", "created": "Sun, 17 Jan 2021 13:34:39 GMT"}], "update_date": "2021-01-19", "authors_parsed": [["Farkas", "Walter", ""], ["Mathys", "Ludovic", ""], ["Vasiljević", "Nikola", ""]]}, {"id": "2002.04832", "submitter": "Miklos Rasonyi Dr", "authors": "Bal\\'azs Gerencs\\'er and Mikl\\'os R\\'asonyi", "title": "Invariant measures for fractional stochastic volatility models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish that a large class of non-Markovian stochastic volatility models\nconverge to an invariant measure as time tends to infinity. Our arguments are\nbased on a novel coupling idea which is of interest on its own right.\n", "versions": [{"version": "v1", "created": "Wed, 12 Feb 2020 08:05:16 GMT"}], "update_date": "2020-02-13", "authors_parsed": [["Gerencsér", "Balázs", ""], ["Rásonyi", "Miklós", ""]]}, {"id": "2002.05143", "submitter": "Archil Gulisashvili", "authors": "Archil Gulisashvili", "title": "Time-inhomogeneous Gaussian stochastic volatility models: Large\n  deviations and super roughness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce time-inhomogeneous stochastic volatility models, in which the\nvolatility is described by a nonnegative function of a Volterra type continuous\nGaussian process that may have very rough sample paths. The main results\nobtained in the paper are sample path and small-noise large deviation\nprinciples for the log-price process in a time-inhomogeneous super rough\nGaussian model under very mild restrictions. We use these results to study the\nasymptotic behavior of binary barrier options, exit time probability functions,\nand call options.\n", "versions": [{"version": "v1", "created": "Wed, 12 Feb 2020 18:33:00 GMT"}, {"version": "v2", "created": "Wed, 18 Mar 2020 18:15:31 GMT"}, {"version": "v3", "created": "Sun, 12 Apr 2020 14:55:47 GMT"}, {"version": "v4", "created": "Mon, 25 May 2020 13:36:39 GMT"}, {"version": "v5", "created": "Sat, 13 Jun 2020 17:14:47 GMT"}, {"version": "v6", "created": "Wed, 24 Jun 2020 21:30:09 GMT"}, {"version": "v7", "created": "Mon, 13 Jul 2020 14:44:48 GMT"}, {"version": "v8", "created": "Wed, 30 Dec 2020 23:38:54 GMT"}], "update_date": "2021-01-01", "authors_parsed": [["Gulisashvili", "Archil", ""]]}, {"id": "2002.05571", "submitter": "Jan Kallsen", "authors": "S\\\"oren Christensen and Jan Kallsen and Matthias Lenga", "title": "Are American options European after all?", "comments": "45 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We call a given American option representable if there exists a European\nclaim which dominates the American payoff at any time and such that the values\nof the two options coincide in the continuation region of the American option.\nThis concept has interesting implications from a probabilistic, analytic,\nfinancial, and numeric point of view. Relying on methods from Jourdain and\nMartini (2001, 2002), Chrsitensen (2014) and convex duality, we make a first\nstep towards verifying representability of American options.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2020 15:35:23 GMT"}], "update_date": "2020-02-14", "authors_parsed": [["Christensen", "Sören", ""], ["Kallsen", "Jan", ""], ["Lenga", "Matthias", ""]]}, {"id": "2002.06253", "submitter": "Assaf Libman", "authors": "Assaf Libman", "title": "Polytopes associated with lattices of subsets and maximising expectation\n  of random variables", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present paper originated from a problem in Financial Mathematics\nconcerned with calculating the value of a European call option based on\nmultiple assets each following the binomial model. The model led to an\ninteresting family of polytopes $P(b)$ associated with the power-set\n$\\mathcal{L} = \\wp\\{1,\\dots,m\\}$ and parameterized by $b \\in \\mathbb{R}^m$,\neach of which is a collection of probability density function on $\\mathcal{L}$.\nFor each non-empty $P(b)$ there results a family of probability measures on\n$\\mathcal{L}^n$ and, given a function $F \\colon \\mathcal{L}^n \\to \\mathbb{R}$,\nour goal is to find among these probability measures one which maximises (resp.\nminimises) the expectation of $F$. In this paper we identify a family of such\nfunctions $F$, all of whose expectations are maximised (resp. minimised under\nsome conditions) by the same {\\em product} probability measure defined by a\ndistinguished vertex of $P(b)$ called the supervertex (resp. the subvertex).\nThe pay-offs of European call options belong to this family of functions.\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2020 21:35:42 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Libman", "Assaf", ""]]}, {"id": "2002.06405", "submitter": "Alexis Marchal", "authors": "Oksana Bashchenko and Alexis Marchal", "title": "Deep Learning for Asset Bubbles Detection", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.MF stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a methodology for detecting asset bubbles using a neural network.\nWe rely on the theory of local martingales in continuous-time and use a deep\nnetwork to estimate the diffusion coefficient of the price process more\naccurately than the current estimator, obtaining an improved detection of\nbubbles. We show the outperformance of our algorithm over the existing\nstatistical method in a laboratory created with simulated data. We then apply\nthe network classification to real data and build a zero net exposure trading\nstrategy that exploits the risky arbitrage emanating from the presence of\nbubbles in the US equity market from 2006 to 2008. The profitability of the\nstrategy provides an estimation of the economical magnitude of bubbles as well\nas support for the theoretical assumptions relied on.\n", "versions": [{"version": "v1", "created": "Sat, 15 Feb 2020 16:16:39 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Bashchenko", "Oksana", ""], ["Marchal", "Alexis", ""]]}, {"id": "2002.07561", "submitter": "Maren Diane Schmeck", "authors": "Annika Kemper, Maren D. Schmeck and Anna Kh. Balci", "title": "The Market Price of Risk for Delivery Periods: Pricing Swaps and Options\n  in Electricity Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In electricity markets, futures contracts typically function as a swap since\nthey deliver the underlying over a period of time. In this paper, we introduce\na market price for the delivery periods of electricity swaps, thereby opening\nan arbitrage-free pricing framework for derivatives based on these contracts.\nFurthermore, we use a weighted geometric averaging of an artificial geometric\nfutures price over the corresponding delivery period. Without any need for\napproximations, this averaging results in geometric swap price dynamics. Our\nframework allows for including typical features as the Samuelson effect,\nseasonalities, and stochastic volatility. In particular, we investigate the\npricing procedures for electricity swaps and options in line with Arismendi et\nal. (2016), Schneider and Tavin (2018), and Fanelli and Schmeck (2019). A\nnumerical study highlights the differences between these models depending on\nthe delivery period.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 13:53:15 GMT"}, {"version": "v2", "created": "Fri, 24 Apr 2020 09:53:13 GMT"}], "update_date": "2020-04-27", "authors_parsed": [["Kemper", "Annika", ""], ["Schmeck", "Maren D.", ""], ["Balci", "Anna Kh.", ""]]}, {"id": "2002.07741", "submitter": "P\\'al Andr\\'as Papp", "authors": "P\\'al Andr\\'as Papp, Roger Wattenhofer", "title": "Default Ambiguity: Finding the Best Solution to the Clearing Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.CC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study financial networks with debt contracts and credit default swaps\nbetween specific pairs of banks. Given such a financial system, we want to\ndecide which of the banks are in default, and how much of their liabilities\nthese defaulting banks can pay. There can easily be multiple different\nsolutions to this problem, leading to a situation of default ambiguity and a\nrange of possible solutions to implement for a financial authority.\n  In this paper, we study the general properties of the solution space of such\nfinancial systems, and analyze a wide range of reasonable objective functions\nfor selecting from the set of solutions. Examples of such objective functions\ninclude minimizing the number of defaulting banks, minimizing the amount of\nunpaid debt, maximizing the number of satisfied banks, maximizing the equity of\na specific bank, finding the most balanced distribution of equity, and many\nothers. We show that for all of these objective functions, it is not only\nNP-hard to find the optimal solution, but it is also NP-hard to approximate\nthis optimum: for each objective function, we show an inapproximability either\nto an $n^{1/2-\\epsilon}$ or to an $n^{1/4-\\epsilon}$ factor for any\n$\\epsilon>0$, with $n$ denoting the number of banks in the system. Thus even if\nan authority has clear criteria to select a solution in case of default\nambiguity, it is computationally intractable to find a solution that is\nreasonably good in terms of this criteria. We also show that our hardness\nresults hold in a wide range of different model variants.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 17:17:15 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Papp", "Pál András", ""], ["Wattenhofer", "Roger", ""]]}, {"id": "2002.08286", "submitter": "Kim Weston", "authors": "Eunjung Noh and Kim Weston", "title": "Price impact equilibrium with transaction costs and TWAP trading", "comments": "22 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove the existence of an equilibrium in a model with transaction costs\nand price impact where two agents are incentivized to trade towards a target.\nThe two types of frictions -- price impact and transaction costs -- lead the\nagents to two distinct changes in their optimal investment approach: price\nimpact causes agents to continuously trade in smaller amounts, while\ntransaction costs cause the agents to cease trading before the end of the\ntrading period. As the agents lose wealth because of transaction costs, the\nexchange makes a profit. We prove the existence of a strictly positive optimal\ntransaction cost from the exchange's perspective.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 16:59:34 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Noh", "Eunjung", ""], ["Weston", "Kim", ""]]}, {"id": "2002.08492", "submitter": "Alexandre Carbonneau", "authors": "Alexandre Carbonneau and Fr\\'ed\\'eric Godin", "title": "Equal Risk Pricing of Derivatives with Deep Hedging", "comments": "44 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a deep reinforcement learning approach to price and\nhedge financial derivatives. This approach extends the work of Guo and Zhu\n(2017) who recently introduced the equal risk pricing framework, where the\nprice of a contingent claim is determined by equating the optimally hedged\nresidual risk exposure associated respectively with the long and short\npositions in the derivative. Modifications to the latter scheme are considered\nto circumvent theoretical pitfalls associated with the original approach.\nDerivative prices obtained through this modified approach are shown to be\narbitrage-free. The current paper also presents a general and tractable\nimplementation for the equal risk pricing framework inspired by the deep\nhedging algorithm of Buehler et al. (2019). An $\\epsilon$-completeness measure\nallowing for the quantification of the residual hedging risk associated with a\nderivative is also proposed. The latter measure generalizes the one presented\nin Bertsimas et al. (2001) based on the quadratic penalty. Monte Carlo\nsimulations are performed under a large variety of market dynamics to\ndemonstrate the practicability of our approach, to perform benchmarking with\nrespect to traditional methods and to conduct sensitivity analyses.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 22:59:59 GMT"}, {"version": "v2", "created": "Sun, 7 Jun 2020 17:30:54 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Carbonneau", "Alexandre", ""], ["Godin", "Frédéric", ""]]}, {"id": "2002.08531", "submitter": "Wujiang Lou", "authors": "Wujiang Lou", "title": "The Fair Basis: Funding and capital in the reduced form framework", "comments": "23 pages, 4 figures, 3 tables", "journal-ref": "Risk, June 2019", "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF q-fin.RM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  A negative basis trade enters a long bond position and buys protection on the\nissuer of the bond through credit default swap (CDS), aiming at arbitrage\nprofit due to the bond-CDS basis. To classic reduced form model theorists, the\nexistence of the basis is an abnormality or merely liquidity noise. Such a\nview, however, fails to explain large basis trading losses incurred during the\nfinancial crisis. Employing a bond continuously hedged by CDS under a dynamic\nspread model with bond repo financing, we find that there is unhedged and\nunhedgeable residual jump to default risk that can't be diversified because of\ncredit correlation. An economic capital approach has to apply and a charge on\nthe use of capital follows. Together with the hedge funding cost, it allows us\nto better understand the basis's economics and to predict its fair level.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 02:05:35 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Lou", "Wujiang", ""]]}, {"id": "2002.08532", "submitter": "Wujiang Lou", "authors": "Wujiang Lou", "title": "Derivatives Discounting Explained", "comments": "38 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF q-fin.RM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Derivative pricing is about cash flow discounting at the riskfree rate. This\nteaching has lost its meaning post the financial crisis, due to the addition of\nextra value adjustments (XVA), which also made derivatives pricing and\nvaluation a very difficult task for investors. This article recovers a properly\ndefined discount rate that corresponds to different collateral and margin\nschemes. A binomial tree model is developed, enabling end-users to price in\ncounterparty default and funding risk. Coherent XVAs, if needed, naturally\nresult from decomposing the discount rate, and can be computed on the same\ntree.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 02:11:19 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Lou", "Wujiang", ""]]}, {"id": "2002.09215", "submitter": "Masaaki Fukasawa", "authors": "Masaaki Fukasawa", "title": "Volatility has to be rough", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  First, we give an asymptotic expansion of short-dated at-the-money implied\nvolatility that refines the preceding works and proves in particular that\nnon-rough volatility models are inconsistent to a power law of volatility skew.\nSecond, we show that given a power law of volatility skew in an option market,\na continuous price dynamics of the underlying asset with non-rough volatility\nadmits an arbitrage opportunity. The volatility therefore has to be rough in a\nviable market of the underlying asset of which the volatility skew obeys a\npower law.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 10:40:52 GMT"}], "update_date": "2020-02-24", "authors_parsed": [["Fukasawa", "Masaaki", ""]]}, {"id": "2002.09445", "submitter": "Oleksii Mostovyi", "authors": "Oleksii Mostovyi", "title": "Stability of the indirect utility process", "comments": "34 pages, preliminary version", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the dynamic stability of the indirect utility process\nassociated with a (possibly suboptimal) trading strategy under perturbations of\nthe market. Establishing the reverse conjugacy characterizations first, we\nprove continuity and first-order convergence of the indirect-utility process\nunder simultaneous perturbations of the finite variation and martingale parts\nof the return of the risky asset.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 17:51:36 GMT"}], "update_date": "2020-02-24", "authors_parsed": [["Mostovyi", "Oleksii", ""]]}, {"id": "2002.09881", "submitter": "Taurai Muvunza", "authors": "Taurai Muvunza", "title": "An $\\alpha$-Stable Approach to Modelling Highly Speculative Assets and\n  Cryptocurrencies", "comments": "LaTeX MikTex 2.9 Texworks, 13 pages, 10 figures (in total). Paper\n  presented at The 4th PKU-NUS International Conference in Quantitative Finance\n  and Economics, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the behaviour of cryptocurrencies' return data. Using return\ndata for bitcoin, ethereum and ripple which account for over 70% of the\ncyrptocurrency market, we demonstrate that $\\alpha$-stable distribution models\nhighly speculative cryptocurrencies more robustly compared to other heavy\ntailed distributions that are used in financial econometrics. We find that the\nMaximum Likelihood Method proposed by DuMouchel (1971) produces estimates that\nfit the cryptocurrency return data much better than the quantile based approach\nof McCulloch (1986) and sample characteristic method by Koutrouvelis (1980).\nThe empirical results show that the leptokurtic feature presented in\ncryptocurrencies' return data can be captured by an ${\\alpha}$-stable\ndistribution. This papers covers predominant literature in cryptocurrencies and\nstable distributions.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2020 10:27:05 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Muvunza", "Taurai", ""]]}, {"id": "2002.09911", "submitter": "Ludovic Mathys", "authors": "Walter Farkas, Ludovic Mathys", "title": "Geometric Step Options with Jumps. Parity Relations, PIDEs, and\n  Semi-Analytical Pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present article studies geometric step options in exponential L\\'evy\nmarkets. Our contribution is manifold and extends several aspects of the\ngeometric step option pricing literature. First, we provide symmetry and parity\nrelations and derive various characterizations for both European-type and\nAmerican-type geometric double barrier step options. In particular, we are able\nto obtain a jump-diffusion disentanglement for the early exercise premium of\nAmerican-type geometric double barrier step contracts and its\nmaturity-randomized equivalent as well as to characterize the diffusion and\njump contributions to these early exercise premiums separately by means of\npartial integro-differential equations and ordinary integro-differential\nequations. As an application of our characterizations, we derive\nsemi-analytical pricing results for (regular) European-type and American-type\ngeometric down-and-out step call options under hyper-exponential jump-diffusion\nmodels. Lastly, we use the latter results to discuss the early exercise\nstructure of geometric step options once jumps are added and to subsequently\nprovide an analysis of the impact of jumps on the price and hedging parameters\nof (European-type and American-type) geometric step contracts.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2020 14:21:22 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Farkas", "Walter", ""], ["Mathys", "Ludovic", ""]]}, {"id": "2002.10194", "submitter": "Len Patrick Dominic Garces", "authors": "Len Patrick Dominic M. Garces and Gerald H. L. Cheang", "title": "A Put-Call Transformation of the Exchange Option Problem under\n  Stochastic Volatility and Jump Diffusion Dynamics", "comments": "42 pages, 2 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We price European and American exchange options where the underlying asset\nprices are modelled using a Merton (1976) jump-diffusion with a common Heston\n(1993) stochastic volatility process. Pricing is performed under an equivalent\nmartingale measure obtained by setting the second asset yield process as the\nnumeraire asset, as suggested by Bjerskund and Stensland (1993). Such a choice\nfor the numeraire reduces the exchange option pricing problem, a\ntwo-dimensional problem, to pricing a call option written on the ratio of the\nyield processes of the two assets, a one-dimensional problem. The joint\ntransition density function of the asset yield ratio process and the\ninstantaneous variance process is then determined from the corresponding\nKolmogorov backward equation via integral transforms. We then determine\nintegral representations for the European exchange option price and the early\nexercise premium and state a linked system of integral equations that\ncharacterizes the American exchange option price and the associated early\nexercise boundary. Properties of the early exercise boundary near maturity are\nalso discussed.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2020 12:21:26 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Garces", "Len Patrick Dominic M.", ""], ["Cheang", "Gerald H. L.", ""]]}, {"id": "2002.10202", "submitter": "Len Patrick Dominic Garces", "authors": "Gerald H. L. Cheang and Len Patrick Dominic M. Garces", "title": "Representation of Exchange Option Prices under Stochastic Volatility\n  Jump-Diffusion Dynamics", "comments": "45 pages, 1 figure", "journal-ref": "Quantitative Finance 20(2), 291-310", "doi": "10.1080/14697688.2019.1655785", "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we provide representations of European and American exchange\noption prices under stochastic volatility jump-diffusion (SVJD) dynamics\nfollowing models by Merton (1976), Heston (1993), and Bates (1996). A\nRadon-Nikodym derivative process is also introduced to facilitate the shift\nfrom the objective market measure to other equivalent probability measures,\nincluding the equivalent martingale measure. Under the equivalent martingale\nmeasure, we derive the integro-partial differential equation that characterizes\nthe exchange option prices. We also derive representations of the European\nexchange option price using the change-of-numeraire technique proposed by Geman\net al. (1995) and the Fourier inversion formula derived by Caldana and Fusai\n(2013), and show that these two representations are comparable. Lastly, we show\nthat the American exchange option price can be decomposed into the price of the\nEuropean exchange option and an early exercise premium.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2020 12:32:17 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Cheang", "Gerald H. L.", ""], ["Garces", "Len Patrick Dominic M.", ""]]}, {"id": "2002.11865", "submitter": "Foivos Xanthos", "authors": "Massoomeh Rahsepar and Foivos Xanthos", "title": "On the extension property of dilatation monotone risk measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $\\mathcal{X}$ be a subset of $L^1$ that contains the space of simple\nrandom variables $\\mathcal{L}$ and $\\rho: \\mathcal{X} \\rightarrow\n(-\\infty,\\infty]$ a dilatation monotone functional with the Fatou property. In\nthis note, we show that $\\rho$ extends uniquely to a $\\sigma(L^1,\\mathcal{L})$\nlower semicontinuous and dilatation monotone functional $\\overline{\\rho}: L^1\n\\rightarrow (-\\infty,\\infty]$. Moreover, $\\overline{\\rho}$ preserves\nmonotonicity, (quasi)convexity, and cash-additivity of $\\rho$. Our findings\ncomplement recent extension results for quasiconvex law-invariant functionals\nproved in [17,20]. As an application of our results, we show that transformed\nnorm risk measures on Orlicz hearts admit a natural extension to $L^1$ that\nretains the robust representations obtained in [4,6].\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2020 01:03:00 GMT"}], "update_date": "2020-02-28", "authors_parsed": [["Rahsepar", "Massoomeh", ""], ["Xanthos", "Foivos", ""]]}, {"id": "2002.12857", "submitter": "Eunjung Noh", "authors": "Jin Ma and Eunjung Noh", "title": "Equilibrium Model of Limit Order Books: A Mean-field Game View", "comments": "32 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a continuous time equilibrium model of limit order\nbook (LOB) in which the liquidity dynamics follows a non-local, reflected\nmean-field stochastic differential equation (SDE) with evolving intensity.\nGeneralizing the basic idea of Ma et al. (2015), we argue that the frontier of\nthe LOB (e.g., the best asking price) is the value function of a mean-field\nstochastic control problem, as the limiting version of a Bertrand-type\ncompetition among the liquidity providers. With a detailed analysis on the\n$N$-seller static Bertrand game, we formulate a continuous time limiting\nmean-field control problem of the representative seller. We then validate the\ndynamic programming principle (DPP), and show that the value function is a\nviscosity solution of the corresponding Hamilton-Jacobi-Bellman (HJB) equation.\nWe argue that the value function can be used to obtain the equilibrium density\nfunction of the LOB, following the idea of Ma et al. (2015).\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2020 16:38:00 GMT"}, {"version": "v2", "created": "Mon, 2 Mar 2020 04:00:50 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Ma", "Jin", ""], ["Noh", "Eunjung", ""]]}]