[{"id": "2105.00844", "submitter": "Patrizia Semeraro", "authors": "Patrizia Semeraro", "title": "Multivariate tempered stable additive subordination for financial models", "comments": "31 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a class of multivariate tempered stable distributions and introduce\nthe associated class of tempered stable Sato subordinators. These Sato\nsubordinators are used to build additive inhomogeneous processes by\nsubordination of a multiparameter Brownian motion. The resulting process is\nadditive and time inhomogeneous. Furthermore, these processes are associated\nwith the distribution at unit time of a class of L\\'evy process with good fit\nproperties on fifinancial data. The main feature of the Sato subordinated\nBrownian motion is that it has time dependent correlation, whereas the L\\'evy\ncounterpart does not. We provide a numerical illustration of the correlation\ndynamics.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 13:33:01 GMT"}, {"version": "v2", "created": "Tue, 4 May 2021 07:20:09 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Semeraro", "Patrizia", ""]]}, {"id": "2105.00935", "submitter": "Johannes Wiesel", "authors": "Jan Obloj, Johannes Wiesel", "title": "Distributionally robust portfolio maximisation and marginal utility\n  pricing in discrete time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the optimal investment and marginal utility pricing problem of a\nrisk averse agent and quantify their exposure to a small amount of model\nuncertainty. Specifically, we compute explicitly the first-order sensitivity of\ntheir value function, optimal investment policy and marginal option prices to\nmodel uncertainty. The latter is understood as replacing a baseline model\n$\\mathbb{P}$ with an adverse choice from a small Wasserstein ball around\n$\\mathbb{P}$ in the space of probability measures. Our sensitivities are thus\nfully non-parametric. We show that the results entangle the baseline model\nspecification and the agent's risk attitudes. The sensitivities can behave in a\nnon-monotone way as a function of the baseline model's Sharpe's ratio, the\nrelative weighting of assets in an agent's portfolio can change and marginal\nprices can increase when an agent faces model uncertainty.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 15:11:10 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Obloj", "Jan", ""], ["Wiesel", "Johannes", ""]]}, {"id": "2105.01829", "submitter": "Xuedong He", "authors": "Xue Dong He and Xun Yu Zhou", "title": "Who Are I: Time Inconsistency and Intrapersonal Conflict and\n  Reconciliation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Time inconsistency is prevalent in dynamic choice problems: a plan of actions\nto be taken in the future that is optimal for an agent today may not be optimal\nfor the same agent in the future. If the agent is aware of this intra-personal\nconflict but unable to commit herself in the future to following the optimal\nplan today, the rational strategy for her today is to reconcile with her future\nselves, namely to correctly anticipate her actions in the future and then act\ntoday accordingly. Such a strategy is named intra-personal equilibrium and has\nbeen studied since as early as in the 1950s. A rigorous treatment in\ncontinuous-time settings, however, had not been available until a decade ago.\nSince then, the study on intra-personal equilibrium for time-inconsistent\nproblems in continuous time has grown rapidly. In this chapter, we review the\nclassical results and some recent development in this literature.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2021 02:04:02 GMT"}], "update_date": "2021-05-06", "authors_parsed": [["He", "Xue Dong", ""], ["Zhou", "Xun Yu", ""]]}, {"id": "2105.02325", "submitter": "Indranil SenGupta", "authors": "Nicholas Salmon and Indranil SenGupta", "title": "Fractional Barndorff-Nielsen and Shephard model: applications in\n  variance and volatility swaps, and hedging", "comments": "28 pages, 4 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce and analyze the fractional Barndorff-Nielsen and\nShephard (BN-S) stochastic volatility model. The proposed model is based upon\ntwo desirable properties of the long-term variance process suggested by the\nempirical data: long-term memory and jumps. The proposed model incorporates the\nlong-term memory and positive autocorrelation properties of fractional Brownian\nmotion with $H>1/2$, and the jump properties of the BN-S model. We find\narbitrage-free prices for variance and volatility swaps for this new model.\nBecause fractional Brownian motion is still a Gaussian process, we derive some\nnew expressions for the distributions of integrals of continuous Gaussian\nprocesses as we work towards an analytic expression for the prices of these\nswaps. The model is analyzed in connection to the quadratic hedging problem and\nsome related analytical results are developed. The amount of derivatives\nrequired to minimize a quadratic hedging error is obtained. Finally, we provide\nsome numerical analysis based on the VIX data. Numerical results show the\nefficiency of the proposed model compared to the Heston model and the classical\nBN-S model.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2021 21:00:26 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Salmon", "Nicholas", ""], ["SenGupta", "Indranil", ""]]}, {"id": "2105.03670", "submitter": "Wei Wei", "authors": "Hongyan Cai, Danhong Chen, Yunfei Peng and Wei Wei", "title": "On the Time-Inconsistent Deterministic Linear-Quadratic Control", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A fundamental theory of deterministic linear-quadratic (LQ) control is the\nequivalent relationship between control problems, two-point boundary value\nproblems and Riccati equations. In this paper, we extend the equivalence to a\ngeneral time-inconsistent deterministic LQ problem, where the inconsistency\narises from non-exponential discount functions. By studying the solvability of\nthe Riccati equation, we show the existence and uniqueness of the linear\nequilibrium for the time-inconsistent LQ problem.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2021 10:45:03 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Cai", "Hongyan", ""], ["Chen", "Danhong", ""], ["Peng", "Yunfei", ""], ["Wei", "Wei", ""]]}, {"id": "2105.04073", "submitter": "Masaaki Fukasawa", "authors": "Masaaki Fukasawa, Blanka Horvath and Peter Tankov", "title": "Hedging under rough volatility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this chapter we first briefly review the existing approaches to hedging in\nrough volatility models. Next, we present a simple but general result which\nshows that in a one-factor rough stochastic volatility model, any option may be\nperfectly hedged with a dynamic portfolio containing the underlying and one\nother asset such as a variance swap. In the final section we report the results\nof a back-test experiment using real data, where VIX options are hedged with a\nforward variance swap. In this experiment, using a rough volatility model\nallows to almost completely remove the bias and reduce the overall hedging\nerror by a factor of 27% compared to traditional diffusion-based models.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2021 02:16:27 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Fukasawa", "Masaaki", ""], ["Horvath", "Blanka", ""], ["Tankov", "Peter", ""]]}, {"id": "2105.05359", "submitter": "Masaaki Fukasawa", "authors": "Masaaki Fukasawa and Jim Gatheral", "title": "A rough SABR formula", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Following an approach originally suggested by Balland in the context of the\nSABR model, we derive an ODE that is satisfied by normalized volatility smiles\nfor short maturities under a rough volatility extension of the SABR model that\nextends also the rough Bergomi model. We solve this ODE numerically and further\npresent a very accurate approximation to the numerical solution that we dub the\nrough SABR formula.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 23:05:36 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Fukasawa", "Masaaki", ""], ["Gatheral", "Jim", ""]]}, {"id": "2105.06390", "submitter": "Iacopo Raffaelli", "authors": "Claude Martini, Iacopo Raffaelli", "title": "Revisiting the Implied Remaining Variance framework of Carr and Sun\n  (2014): Locally consistent dynamics and sandwiched martingales", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Implied volatility is at the very core of modern finance, notwithstanding\nstandard option pricing models continue to derive option prices starting from\nthe joint dynamics of the underlying asset price and the spot volatility. These\nmodels often cause difficulties: no closed formulas for prices, demanding\ncalibration techniques, unclear maps between spot and implied volatility.\nInspired by the practice of using implied volatility as quoting system for\noption prices, models for the joint dynamics of the underlying asset price and\nthe implied volatility have been proposed to replace standard option pricing\nmodels. Starting from Carr and Sun (2014), we develop a framework based on the\nImplied Remaining Variance where minimal conditions for absence of arbitrage\nare identified, and smile bubbles are dealt with. The key concepts arising from\nthe new IRV framework are those of locally consistent dynamics and sandwiched\nmartingale. Within the new IRV framework, the results of Schweizer and Wissel\n(2008b) are reformulated, while those of El Amrani, Jacquier and Martini (2021)\nare independently derived.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 16:13:57 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Martini", "Claude", ""], ["Raffaelli", "Iacopo", ""]]}, {"id": "2105.06607", "submitter": "Fengyi Yuan", "authors": "Zongxia Liang and Fengyi Yuan", "title": "Weak equilibriums for time-inconsistent stopping control problems", "comments": "27 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies time-inconsistent stopping control problems under general\nmulti-dimensional controlled diffusion model. We first formulate the\ntime-inconsistent stopping control problems and propose a formal definition of\ntheir equilibriums. This definition for equilibriums is consistent with the\nones in pure control/stopping problems and thus can be seen as nontrivial\nextension to the existing theory. We show that an admissible pair $(\\hat{u},C)$\nof control-stopping policy is equilibrium if and only if the axillary function\nassociated to it solves the extended Hamiltonian system. We provide almost\nequivalent conditions to the boundary term of this Hamiltonian system, which is\nbasically the celebrated smooth fitting principles. In this paper we further\nreformulate them and propose strong and weak smooth fitting principles. We also\ngive one concrete example that illustrates our theoretical results.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2021 01:28:54 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Liang", "Zongxia", ""], ["Yuan", "Fengyi", ""]]}, {"id": "2105.06654", "submitter": "Libo Li L.L", "authors": "Anna Aksamit, Libo Li, Marek Rutkowski", "title": "Generalized BSDEs with random time horizon in a progressively enlarged\n  filtration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study generalized backward stochastic differential equations (BSDEs) up to\na random time horizon $\\vartheta$, which is not a stopping time, under minimal\nassumptions regarding the properties of $\\vartheta$. In contrast to existing\nworks in this area, we do not impose specific assumptions on the random time\n$\\vartheta$ and we study the existence of solutions to BSDEs and reflected\nBSDEs with a random time horizon through the method of reduction. In addition,\nwe also examine BSDEs and reflected BSDEs with a l\\`adl\\`ag driver where the\ndriver is allowed to have a finite number of common jumps with the martingale\npart.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2021 05:57:45 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Aksamit", "Anna", ""], ["Li", "Libo", ""], ["Rutkowski", "Marek", ""]]}, {"id": "2105.07213", "submitter": "Giorgio Ferrari", "authors": "Haoyang Cao, Jodi Dianetti and Giorgio Ferrari", "title": "Stationary Discounted and Ergodic Mean Field Games of Singular Control", "comments": "28 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study stationary mean field games with singular controls in which the\nrepresentative player interacts with a long-time weighted average of the\npopulation through a discounted and an ergodic performance criterion. This\nclass of games finds natural applications in the context of optimal\nproductivity expansion in dynamic oligopolies. We prove existence and\nuniqueness of the mean field equilibria, which are completely characterized\nthrough nonlinear equations. Furthermore, we relate the mean field equilibria\nfor the discounted and the ergodic games by showing the validity of an Abelian\nlimit. The latter allows also to approximate Nash equilibria of - so far\nunexplored - symmetric N-player ergodic singular control games through the mean\nfield equilibrium of the discounted game. Numerical examples finally illustrate\nin a case study the dependency of the mean field equilibria with respect to the\nparameters of the games.\n", "versions": [{"version": "v1", "created": "Sat, 15 May 2021 12:30:24 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Cao", "Haoyang", ""], ["Dianetti", "Jodi", ""], ["Ferrari", "Giorgio", ""]]}, {"id": "2105.07524", "submitter": "Alessandra Cretarola", "authors": "Claudia Ceci, Katia Colaneri, Alessandra Cretarola", "title": "Optimal Reinsurance and Investment under Common Shock Dependence Between\n  Financial and Actuarial Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study optimal proportional reinsurance and investment strategies for an\ninsurance company which experiences both ordinary and catastrophic claims and\nwishes to maximize the expected exponential utility of its terminal wealth. We\npropose a model where the insurance framework is affected by environmental\nfactors, and aggregate claims and stock prices are subject to common shocks,\ni.e. drastic events such as earthquakes, extreme weather conditions, or even\npandemics, that have an immediate impact on the financial market and\nsimultaneously induce insurance claims. Using the classical stochastic control\napproach based on the Hamilton-Jacobi-Bellman equation, we provide a\nverification result for the value function via classical solutions to two\nbackward partial differential equations and characterize the optimal\nreinsurance and investment strategies. Finally, we make a comparison analysis\nto discuss the effect of common shock dependence.\n", "versions": [{"version": "v1", "created": "Sun, 16 May 2021 21:50:22 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Ceci", "Claudia", ""], ["Colaneri", "Katia", ""], ["Cretarola", "Alessandra", ""]]}, {"id": "2105.07915", "submitter": "Thomas Krabichler", "authors": "Thomas Krabichler, Marcus Wunsch", "title": "Hedging Goals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Goal-based investing is concerned with reaching a monetary investment goal by\na given deadline, which differs from mean-variance optimization in modern\nportfolio theory. In this article, we expand the close connection between\ngoal-based investing and option hedging that was originally discovered in\n[Bro99b] by allowing for varying degrees of investor risk aversion using lower\npartial moments of different orders. Moreover, we show that maximizing the\nprobability of reaching the goal (quantile hedging, cf. [FL99]) and minimizing\nthe expected shortfall (efficient hedging, cf. [FL00]) yield, in fact, the same\noptimal investment policy. Finally, we develop an innovative approach to\ngoal-based investing using methods of reinforcement learning, demonstrating its\nflexibility vis-\\`a-vis general market dynamics incorporating transaction\ncosts.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 14:55:16 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Krabichler", "Thomas", ""], ["Wunsch", "Marcus", ""]]}, {"id": "2105.09140", "submitter": "Matthieu Garcin", "authors": "Matthieu Garcin", "title": "Forecasting with fractional Brownian motion: a financial perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The fractional Brownian motion (fBm) extends the standard Brownian motion by\nintroducing some dependence between non-overlapping increments. Consequently,\nif one considers for example that log-prices follow an fBm, one can exploit the\nnon-Markovian nature of the fBm to forecast future states of the process and\nmake statistical arbitrages. We provide new insights into forecasting an fBm,\nby proposing theoretical formulas for accuracy metrics relevant to a systematic\ntrader, from the hit ratio to the expected gain and risk of a simple strategy.\nIn addition, we answer some key questions about optimizing trading strategies\nin the fBm framework: Which lagged increments of the fBm, observed in discrete\ntime, are to be considered? If the predicted increment is close to zero, up to\nwhich threshold is it more profitable not to invest? We also propose empirical\napplications on high-frequency FX rates, as well as on realized volatility\nseries, exploring the rough volatility concept in a forecasting perspective.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 13:59:52 GMT"}, {"version": "v2", "created": "Fri, 4 Jun 2021 08:26:11 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Garcin", "Matthieu", ""]]}, {"id": "2105.09276", "submitter": "Alessandro Gnoatto", "authors": "Giorgia Callegaro, Alessandro Gnoatto, Martino Grasselli", "title": "A Fully Quantization-based Scheme for FBSDEs", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a quantization-based numerical scheme for a family of decoupled\nFBSDEs. We simplify the scheme for the control in Pag\\`es and Sagna (2018) so\nthat our approach is fully based on recursive marginal quantization and does\nnot involve any Monte Carlo simulation for the computation of conditional\nexpectations. We analyse in detail the numerical error of our scheme and we\nshow through some examples the performance of the whole procedure, which proves\nto be very effective in view of financial applications.\n", "versions": [{"version": "v1", "created": "Fri, 7 May 2021 10:38:19 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Callegaro", "Giorgia", ""], ["Gnoatto", "Alessandro", ""], ["Grasselli", "Martino", ""]]}, {"id": "2105.10252", "submitter": "Andreas Krause", "authors": "Andreas Krause", "title": "A note on the CAPM with endogenously consistent market returns", "comments": "4 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.MF q-fin.PM q-fin.PR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  I demonstrate that with the market return determined by the equilibrium\nreturns of the CAPM, expected returns of an asset are affected by the risks of\nall assets jointly. Another implication is that the range of feasible market\nreturns will be limited and dependent on the distribution of weights in the\nmarket portfolio. A large and well diversified market with no dominating asset\nwill only return zero while a market dominated by a small number of assets will\nonly return the risk-free rate. In the limiting case of atomistic assets, we\nrecover the properties of the standard CAPM.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 10:09:58 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Krause", "Andreas", ""]]}, {"id": "2105.10623", "submitter": "Sebasti\\'an Ferrando", "authors": "Christian Bender, Sebastian Ferrando and Alfredo Gonzalez", "title": "Model-Free Finance and Non-Lattice Integration", "comments": "34 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Starting solely with a set of possible prices for a traded asset $S$ (in\ninfinite discrete time) expressed in units of a numeraire, we explain how to\nconstruct a Daniell type of integral representing prices of integrable\nfunctions depending on the asset. Such functions include the values of simple\ndynamic portfolios obtained by trading with $S$ and the numeraire. The space of\nelementary integrable functions, i.e. the said portfolio values, is not a\nvector lattice. It then follows that the integral is not classical, i.e. it is\nnot associated to a measure. The essential ingredient in constructing the\nintegral is a weak version of the no-arbitrage condition but here expressed in\nterms of properties of the trajectory space. We also discuss the continuity\nconditions imposed by Leinert (Archiv der Mathematik, 1982) and K\\\"onig\n(Mathematische Annalen, 1982) in the abstract theory of non-lattice integration\nfrom a financial point of view and establish some connections between these\ncontinuity conditions and the existence of martingale measures\n", "versions": [{"version": "v1", "created": "Sat, 22 May 2021 02:35:12 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Bender", "Christian", ""], ["Ferrando", "Sebastian", ""], ["Gonzalez", "Alfredo", ""]]}, {"id": "2105.12072", "submitter": "Sebasti\\'an Ferrando", "authors": "Christian Bender, Sebastian E. Ferrando and Alfredo L. Gonzalez", "title": "Conditional Non-Lattice Integration, Pricing and Superhedging", "comments": "44 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.MF", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Closely motivated by financial considerations, we develop an integration\ntheory which is not classical i.e. it is not necessarily associated to a\nmeasure. The base space, denoted by $\\mathcal{S}$ and called a trajectory\nspace, substitutes the set $\\Omega$ in probability theory and provides a\nfundamental structure via conditional subsets $\\mathcal{S}_{(S,j)}$ that allows\nthe definition of conditional integrals. The setting is a natural by-product of\nno arbitrage assumptions that are used to model financial markets and games of\nchance (in a discrete infinite time framework). The constructed conditional\nintegrals can be interpreted as required investments, at the conditioning node,\nfor hedging an integrable function, the latter characterized a.e. and in the\nlimit as we increase the number of portfolios used. The integral is not\nclassical due to the fact that the original vector space of portfolio payoffs\nis not a vector lattice. In contrast to a classical stochastic setting, where\nprice processes are associated to conditional expectations (with respect to\nrisk neutral measures), we uncover a theory where prices are naturally given by\nconditional non-lattice integrals. One could then study analogues of classical\nprobabilistic notions in such non-classical setting, the paper stops after\ndefining trajectorial martingales the study of which is deferred to future\nwork.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 16:51:27 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Bender", "Christian", ""], ["Ferrando", "Sebastian E.", ""], ["Gonzalez", "Alfredo L.", ""]]}, {"id": "2105.12087", "submitter": "Yudong Cao", "authors": "Javier Alcazar, Andrea Cadarso, Amara Katabarwa, Marta Mauri, Borja\n  Peropadre, Guoming Wang, Yudong Cao", "title": "Quantum algorithm for credit valuation adjustments", "comments": "23 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph q-fin.MF", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Quantum mechanics is well known to accelerate statistical sampling processes\nover classical techniques. In quantitative finance, statistical samplings arise\nbroadly in many use cases. Here we focus on a particular one of such use cases,\ncredit valuation adjustment (CVA), and identify opportunities and challenges\ntowards quantum advantage for practical instances. To improve the depths of\nquantum circuits for solving such problem, we draw on various heuristics that\nindicate the potential for significant improvement over well-known techniques\nsuch as reversible logical circuit synthesis. In minimizing the resource\nrequirements for amplitude amplification while maximizing the speedup gained\nfrom the quantum coherence of a noisy device, we adopt a recently developed\nBayesian variant of quantum amplitude estimation using engineered likelihood\nfunctions (ELF). We perform numerical analyses to characterize the prospect of\nquantum speedup in concrete CVA instances over classical Monte Carlo\nsimulations.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 17:11:20 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Alcazar", "Javier", ""], ["Cadarso", "Andrea", ""], ["Katabarwa", "Amara", ""], ["Mauri", "Marta", ""], ["Peropadre", "Borja", ""], ["Wang", "Guoming", ""], ["Cao", "Yudong", ""]]}, {"id": "2105.13320", "submitter": "Timothy DeLise", "authors": "Timothy DeLise", "title": "Neural Options Pricing", "comments": "9 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF cs.CE cs.LG q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This research investigates pricing financial options based on the traditional\nmartingale theory of arbitrage pricing applied to neural SDEs. We treat neural\nSDEs as universal It\\^o process approximators. In this way we can lift all\nassumptions on the form of the underlying price process, and compute\ntheoretical option prices numerically. We propose a variation of the SDE-GAN\napproach by implementing the Wasserstein distance metric as a loss function for\ntraining. Furthermore, it is conjectured that the error of the option price\nimplied by the learnt model can be bounded by the very Wasserstein distance\nmetric that was used to fit the empirical data.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2021 17:22:30 GMT"}], "update_date": "2021-05-28", "authors_parsed": [["DeLise", "Timothy", ""]]}, {"id": "2105.14325", "submitter": "Paolo Bartesaghi", "authors": "Paolo Bartesaghi, Gian Paolo Clemente and Rosanna Grassi", "title": "Clustering Coefficients in Weighted Undirected Multilayer Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph math.DG q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Complex systems in the real world are frequently characterized by entities\nconnected by relationships of different nature. These systems can be\nappropriately described by multilayer networks where the different relations\nbetween nodes can be conveniently expressed structuring the network through\ndifferent layers. To extend in a multilayer context the classical network\nindicators proposed for monolayer networks is an important issue. In this work\nwe study the incidence of triangular patterns expressed through the local\nclustering coefficient in a weighted undirected multilayer network. We provide\nnew local clustering coefficients for multilayer networks, looking at the\nnetwork from different perspectives depending on the node's position, as well\nas a global clustering coefficient for the whole network. We also prove that\nall the well-known expressions for clustering coefficients existing in the\nliterature, suitably extended to the multilayer framework, may be unified into\nour proposal, both in terms of tensors and supradjacency matrix. To show the\neffectiveness of the proposed measures, we study an application to the\nmultilayer temporal financial network based on the returns of the S&P100\nassets.\n", "versions": [{"version": "v1", "created": "Sat, 29 May 2021 15:17:33 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Bartesaghi", "Paolo", ""], ["Clemente", "Gian Paolo", ""], ["Grassi", "Rosanna", ""]]}]