[{"id": "1506.00001", "submitter": "Zhigang Lu", "authors": "Zhigang Lu and Hong Shen", "title": "A Security-assured Accuracy-maximised Privacy Preserving Collaborative\n  Filtering Recommendation Algorithm", "comments": "arXiv admin note: text overlap with arXiv:1505.07897", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The neighbourhood-based Collaborative Filtering is a widely used method in\nrecommender systems. However, the risks of revealing customers' privacy during\nthe process of filtering have attracted noticeable public concern recently.\nSpecifically, $k$NN attack discloses the target user's sensitive information by\ncreating $k$ fake nearest neighbours by non-sensitive information. Among the\ncurrent solutions against $k$NN attack, the probabilistic methods showed a\npowerful privacy preserving effect. However, the existing probabilistic methods\nneither guarantee enough prediction accuracy due to the global randomness, nor\nprovide assured security enforcement against $k$NN attack. To overcome the\nproblems of current probabilistic methods, we propose a novel approach,\nPartitioned Probabilistic Neighbour Selection, to ensure a required security\nguarantee while achieving the optimal prediction accuracy against $k$NN attack.\nIn this paper, we define the sum of $k$ neighbours' similarity as the accuracy\nmetric $\\alpha$, the number of user partitions, across which we select the $k$\nneighbours, as the security metric $\\beta$. Differing from the present methods\nthat globally selected neighbours, our method selects neighbours from each\ngroup with exponential differential privacy to decrease the magnitude of noise.\nTheoretical and experimental analysis show that to achieve the same security\nguarantee against $k$NN attack, our approach ensures the optimal prediction\naccuracy.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2015 01:20:42 GMT"}, {"version": "v2", "created": "Thu, 4 Jun 2015 01:00:31 GMT"}], "update_date": "2015-06-05", "authors_parsed": [["Lu", "Zhigang", ""], ["Shen", "Hong", ""]]}, {"id": "1506.00022", "submitter": "Xiaohan Zhao", "authors": "Xiaohan Zhao, Qingyun Liu, Lin Zhou, Haitao Zheng and Ben Y. Zhao", "title": "Graph Watermarks", "comments": "16 pages, 14 figures, full version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  From network topologies to online social networks, many of today's most\nsensitive datasets are captured in large graphs. A significant challenge facing\nowners of these datasets is how to share sensitive graphs with collaborators\nand authorized users, e.g. network topologies with network equipment vendors or\nFacebook's social graphs with academic collaborators. Current tools can provide\nlimited node or edge privacy, but require modifications to the graph that\nsignificantly reduce its utility.\n  In this work, we propose a new alternative in the form of graph watermarks.\nGraph watermarks are small graphs tailor-made for a given graph dataset, a\nsecure graph key, and a secure user key. To share a sensitive graph G with a\ncollaborator C, the owner generates a watermark graph W using G, the graph key,\nand C's key as input, and embeds W into G to form G'. If G' is leaked by C,its\nowner can reliably determine if the watermark W generated for C does in fact\nreside inside G', thereby proving C is responsible for the leak. Graph\nwatermarks serve both as a deterrent against data leakage and a method of\nrecourse after a leak. We provide robust schemes for creating, embedding and\nextracting watermarks, and use analysis and experiments on large, real graphs\nto show that they are unique and difficult to forge. We study the robustness of\ngraph watermarks against both single and powerful colluding attacker models,\nthen propose and empirically evaluate mechanisms to dramatically improve\nresilience.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2015 20:29:04 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Zhao", "Xiaohan", ""], ["Liu", "Qingyun", ""], ["Zhou", "Lin", ""], ["Zheng", "Haitao", ""], ["Zhao", "Ben Y.", ""]]}, {"id": "1506.00189", "submitter": "Benjamin Braun", "authors": "Benjamin A. Braun and Suman Jana and Dan Boneh", "title": "Robust and Efficient Elimination of Cache and Timing Side Channels", "comments": "15 pages, 10 figures, submitted to NDSS 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Timing and cache side channels provide powerful attacks against many\nsensitive operations including cryptographic implementations. Existing defenses\ncannot protect against all classes of such attacks without incurring\nprohibitive performance overhead. A popular strategy for defending against all\nclasses of these attacks is to modify the implementation so that the timing and\ncache access patterns of every hardware instruction is independent of the\nsecret inputs. However, this solution is architecture-specific, brittle, and\ndifficult to get right. In this paper, we propose and evaluate a robust\nlow-overhead technique for mitigating timing and cache channels. Our solution\nrequires only minimal source code changes and works across multiple\nlanguages/platforms. We report the experimental results of applying our\nsolution to protect several C, C++, and Java programs. Our results demonstrate\nthat our solution successfully eliminates the timing and cache side-channel\nleaks while incurring significantly lower performance overhead than existing\napproaches.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 03:12:14 GMT"}, {"version": "v2", "created": "Mon, 31 Aug 2015 15:25:52 GMT"}], "update_date": "2015-09-01", "authors_parsed": [["Braun", "Benjamin A.", ""], ["Jana", "Suman", ""], ["Boneh", "Dan", ""]]}, {"id": "1506.00242", "submitter": "Zhiwei Steven Wu", "authors": "Michael Kearns, Aaron Roth, Zhiwei Steven Wu, Grigory Yaroslavtsev", "title": "Privacy for the Protected (Only)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CR cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by tensions between data privacy for individual citizens, and\nsocietal priorities such as counterterrorism and the containment of infectious\ndisease, we introduce a computational model that distinguishes between parties\nfor whom privacy is explicitly protected, and those for whom it is not (the\ntargeted subpopulation). The goal is the development of algorithms that can\neffectively identify and take action upon members of the targeted subpopulation\nin a way that minimally compromises the privacy of the protected, while\nsimultaneously limiting the expense of distinguishing members of the two groups\nvia costly mechanisms such as surveillance, background checks, or medical\ntesting. Within this framework, we provide provably privacy-preserving\nalgorithms for targeted search in social networks. These algorithms are natural\nvariants of common graph search methods, and ensure privacy for the protected\nby the careful injection of noise in the prioritization of potential targets.\nWe validate the utility of our algorithms with extensive computational\nexperiments on two large-scale social network datasets.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 14:47:27 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Kearns", "Michael", ""], ["Roth", "Aaron", ""], ["Wu", "Zhiwei Steven", ""], ["Yaroslavtsev", "Grigory", ""]]}, {"id": "1506.00243", "submitter": "Hui Wang", "authors": "Hui Wang and Anthony TS Ho and Shujun Li", "title": "OR-Benchmark: An Open and Reconfigurable Digital Watermarking\n  Benchmarking Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Benchmarking digital watermarking algorithms is not an easy task because\ndifferent applications of digital watermarking often have very different sets\nof requirements and trade-offs between conflicting requirements. While there\nhave been some general-purpose digital watermarking benchmarking systems\navailable, they normally do not support complicated benchmarking tasks and\ncannot be easily reconfigured to work with different watermarking algorithms\nand testing conditions. In this paper, we propose OR-Benchmark, an open and\nhighly reconfigurable general-purpose digital watermarking benchmarking\nframework, which has the following two key features: 1) all the interfaces are\npublic and general enough to support all watermarking applications and\nbenchmarking tasks we can think of; 2) end users can easily extend the\nfunctionalities and freely configure what watermarking algorithms are tested,\nwhat system components are used, how the benchmarking process runs, and what\nresults should be produced. We implemented a prototype of this framework as a\nMATLAB software package and used it to benchmark a number of digital\nwatermarking algorithms involving two types of watermarks for content\nauthentication and self-restoration purposes. The benchmarking results\ndemonstrated the advantages of the proposed benchmarking framework, and also\ngave us some useful insights about existing image authentication and\nself-restoration watermarking algorithms which are an important but less\nstudied topic in digital watermarking.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 14:50:26 GMT"}, {"version": "v2", "created": "Fri, 5 Jun 2015 14:49:01 GMT"}], "update_date": "2015-06-08", "authors_parsed": [["Wang", "Hui", ""], ["Ho", "Anthony TS", ""], ["Li", "Shujun", ""]]}, {"id": "1506.00277", "submitter": "Mircea Andrecut Dr", "authors": "M. Andrecut", "title": "A Matrix Public Key Cryptosystem", "comments": "18 pages, C code included", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss a matrix public key cryptosystem and its numerical implementation.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 19:35:08 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Andrecut", "M.", ""]]}, {"id": "1506.00326", "submitter": "Joshua Joy", "authors": "Uichin Lee, Joshua Joy, Youngtae Noh", "title": "Secure Personal Content Networking over Untrusted Devices", "comments": null, "journal-ref": null, "doi": "10.1007/s11277-014-2093-4", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Securely sharing and managing personal content is a challenging task in\nmulti-device environments. In this paper, we design and implement a new\nplatform called Personal Content Networking (PCN). Our work is inspired by\nContent-Centric Networking (CCN) because we aim to enable access to personal\ncontent using its name instead of its location. The unique challenge of PCN is\nto support secure file operations such as replication, updates, and access\ncontrol over distributed untrusted devices. The primary contribution of this\nwork is the design and implementation of a secure content management platform\nthat supports secure updates, replications, and fine-grained content-centric\naccess control of files. Furthermore, we demonstrate its feasibility through a\nprototype implementation on the CCNx skeleton.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2015 02:06:21 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Lee", "Uichin", ""], ["Joy", "Joshua", ""], ["Noh", "Youngtae", ""]]}, {"id": "1506.00506", "submitter": "Emiliano De Cristofaro", "authors": "Muhammad Ikram and Lucky Onwuzurike and Shehroze Farooqi and Emiliano\n  De Cristofaro and Arik Friedman and Guillaume Jourjon and Mohammad Ali Kaafar\n  and M. Zubair Shafiq", "title": "Combating Fraud in Online Social Networks: Detecting Stealthy Facebook\n  Like Farms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As businesses increasingly rely on social networking sites to engage with\ntheir customers, it is crucial to understand and counter reputation\nmanipulation activities, including fraudulently boosting the number of Facebook\npage likes using like farms. To this end, several fraud detection algorithms\nhave been proposed and some deployed by Facebook that use graph co-clustering\nto distinguish between genuine likes and those generated by farm-controlled\nprofiles. However, as we show in this paper, these tools do not work well with\nstealthy farms whose users spread likes over longer timespans and like popular\npages, aiming to mimic regular users. We present an empirical analysis of the\ngraph-based detection tools used by Facebook and highlight their shortcomings\nagainst more sophisticated farms. Next, we focus on characterizing content\ngenerated by social networks accounts on their timelines, as an indicator of\ngenuine versus fake social activity. We analyze a wide range of features\nextracted from timeline posts, which we group into two main classes: lexical\nand non-lexical. We postulate and verify that like farm accounts tend to often\nre-share content, use fewer words and poorer vocabulary, and more often\ngenerate duplicate comments and likes compared to normal users. We extract\nrelevant lexical and non-lexical features and and use them to build a\nclassifier to detect like farms accounts, achieving significantly higher\naccuracy, namely, at least 99% precision and 93% recall.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2015 14:24:57 GMT"}, {"version": "v2", "created": "Wed, 2 Mar 2016 22:01:08 GMT"}, {"version": "v3", "created": "Mon, 9 May 2016 10:25:55 GMT"}], "update_date": "2016-05-10", "authors_parsed": [["Ikram", "Muhammad", ""], ["Onwuzurike", "Lucky", ""], ["Farooqi", "Shehroze", ""], ["De Cristofaro", "Emiliano", ""], ["Friedman", "Arik", ""], ["Jourjon", "Guillaume", ""], ["Kaafar", "Mohammad Ali", ""], ["Shafiq", "M. Zubair", ""]]}, {"id": "1506.00522", "submitter": "Benjamin Wesolowski", "authors": "Dimitar Jetchev and Benjamin Wesolowski", "title": "Horizontal isogeny graphs of ordinary abelian varieties and the discrete\n  logarithm problem", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fix an ordinary abelian variety defined over a finite field. The ideal class\ngroup of its endomorphism ring acts freely on the set of isogenous varieties\nwith same endomorphism ring, by complex multiplication. Any subgroup of the\nclass group, and generating set thereof, induces an isogeny graph on the orbit\nof the variety for this subgroup. We compute (under the Generalized Riemann\nHypothesis) some bounds on the norms of prime ideals generating it, such that\nthe associated graph has good expansion properties.\n  We use these graphs, together with a recent algorithm of Dudeanu, Jetchev and\nRobert for computing explicit isogenies in genus 2, to prove random\nself-reducibility of the discrete logarithm problem within the subclasses of\nprincipally polarizable ordinary abelian surfaces with fixed endomorphism ring.\nIn addition, we remove the heuristics in the complexity analysis of an\nalgorithm of Galbraith for explicitly computing isogenies between two elliptic\ncurves in the same isogeny class, and extend it to a more general setting\nincluding genus 2.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2015 14:59:16 GMT"}, {"version": "v2", "created": "Wed, 25 Jan 2017 12:19:41 GMT"}], "update_date": "2017-01-26", "authors_parsed": [["Jetchev", "Dimitar", ""], ["Wesolowski", "Benjamin", ""]]}, {"id": "1506.00720", "submitter": "Jun Zhang", "authors": "You-Qi Nie, Leilei Huang, Yang Liu, Frank Payne, Jun Zhang, and\n  Jian-Wei Pan", "title": "68 Gbps quantum random number generation by measuring laser phase\n  fluctuations", "comments": "14 pages, 5 figures. Accepted for publication in Review of Scientific\n  Instruments", "journal-ref": "Rev. Sci. Instrum. 86, 063105 (2015)", "doi": "10.1063/1.4922417", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The speed of a quantum random number generator is essential for practical\napplications, such as high-speed quantum key distribution systems. Here, we\npush the speed of a quantum random number generator to 68 Gbps by operating a\nlaser around its threshold level. To achieve the rate, not only high-speed\nphotodetector and high sampling rate are needed, but also a very stable\ninterferometer is required. A practical interferometer with active feedback\ninstead of common temperature control is developed to meet requirement of\nstability. Phase fluctuations of the laser are measured by the interferometer\nwith a photodetector, and then digitalized to raw random numbers with a rate of\n80 Gbps. The min-entropy of the raw data is evaluated by modeling the system\nand is used to quantify the quantum randomness of the raw data. The bias of the\nraw data caused by other signals, such as classical and detection noises, can\nbe removed by Toeplitz-matrix hashing randomness extraction. The final random\nnumbers can pass through the standard randomness tests. Our demonstration shows\nthat high-speed quantum random number generators are ready for practical usage.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 01:42:40 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Nie", "You-Qi", ""], ["Huang", "Leilei", ""], ["Liu", "Yang", ""], ["Payne", "Frank", ""], ["Zhang", "Jun", ""], ["Pan", "Jian-Wei", ""]]}, {"id": "1506.00794", "submitter": "Wenhao Wang", "authors": "Wenhao Wang", "title": "Notes on Rainbow Distinguished Point Method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  This paper clarifies the method described in our previous paper (DOI:\n978-3-319-02726-5\\_21), namely rainbow distinguished point method, and give\nrevised theoretical and experimental results which shows rainbow distinguished\npoint method behaves inferiorly to other time memory tradeoff methods.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 08:47:59 GMT"}, {"version": "v2", "created": "Wed, 3 Jun 2015 01:13:50 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Wang", "Wenhao", ""]]}, {"id": "1506.00930", "submitter": "Tiago Guerreiro", "authors": "Diogo Marques, Lu\\'is Carri\\c{c}o, Tiago Guerreiro", "title": "Assessing Inconspicuous Smartphone Authentication for Blind People", "comments": "4 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  As people store more personal data in their smartphones, the consequences of\nhaving it stolen or lost become an increasing concern. A typical\ncounter-measure to avoid this risk is to set up a secret code that has to be\nentered to unlock the device after a period of inactivity. However, for blind\nusers, PINs and passwords are inadequate, since entry 1) consumes a non-trivial\namount of time, e.g. using screen readers, 2) is susceptible to observation,\nwhere nearby people can see or hear the secret code, and 3) might collide with\nsocial norms, e.g. disrupting personal interactions. Tap-based authentication\nmethods have been presented and allow unlocking to be performed in a short time\nand support naturally occurring inconspicuous behavior (e.g. concealing the\ndevice inside a jacket) by being usable with a single hand. This paper presents\na study with blind users (N = 16) where an authentication method based on tap\nphrases is evaluated. Results showed the method to be usable and to support the\ndesired inconspicuity.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 15:40:32 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Marques", "Diogo", ""], ["Carriço", "Luís", ""], ["Guerreiro", "Tiago", ""]]}, {"id": "1506.00950", "submitter": "Zoltan Gingl", "authors": "Gergely Vadai, Robert Mingesz and Zoltan Gingl", "title": "Generalized Kirchhoff-Law-Johnson-Noise (KLJN) secure key exchange\n  system using arbitrary resistors", "comments": null, "journal-ref": "Scientific Reports 5, 13653 (2015)", "doi": "10.1038/srep13653", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Kirchhoff-Law-Johnson-Noise (KLJN) secure key exchange system has been\nintroduced as a simple, very low cost and efficient classical physical\nalternative to quantum key distribution systems. The ideal system uses only a\nfew electronic components - identical resistor pairs, switches and\ninterconnecting wires - to guarantee perfectly protected data transmission. We\nshow that a generalized KLJN system can provide unconditional security even if\nit is used with significantly less limitations. The more universal conditions\nease practical realizations considerably and support more robust protection\nagainst attacks. Our theoretical results are confirmed by numerical\nsimulations.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 16:34:36 GMT"}], "update_date": "2015-09-23", "authors_parsed": [["Vadai", "Gergely", ""], ["Mingesz", "Robert", ""], ["Gingl", "Zoltan", ""]]}, {"id": "1506.01256", "submitter": "Ndoundam Rene", "authors": "Rene Ndoundam, Stephane Gael Raymond Ekodeck", "title": "PDF Steganography based on Chinese Remainder Theorem", "comments": "29pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We propose different approaches of PDF files based steganography, essentially\nbased on the Chinese Remainder Theorem. Here, after a cover PDF document has\nbeen released from unnecessary A0, a secret message is hidden in it using one\nof the proposed approaches, making it invisible to common PDF readers, and the\nfile is then transmitted through a non-secure communication channel. Where each\nof our methods, ensure the condition that the number of inserted A0 is less\nthan the number of characters of the secret message s.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jun 2015 14:29:07 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Ndoundam", "Rene", ""], ["Ekodeck", "Stephane Gael Raymond", ""]]}, {"id": "1506.01414", "submitter": "Mark Scanlon", "authors": "Mark Scanlon, Jason Farina, M-Tahar Kechadi", "title": "Network investigation methodology for BitTorrent Sync: A Peer-to-Peer\n  based file synchronisation service", "comments": "in Computers and Security 2015", "journal-ref": null, "doi": "10.1016/j.cose.2015.05.003", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  High availability is no longer just a business continuity concern. Users are\nincreasingly dependant on devices that consume and produce data in ever\nincreasing volumes. A popular solution is to have a central repository which\neach device accesses after centrally managed authentication. This model of use\nis facilitated by cloud based file synchronisation services such as Dropbox,\nOneDrive, Google Drive and Apple iCloud. Cloud architecture allows the\nprovisioning of storage space with \"always-on\" access. Recent concerns over\nunauthorised access to third party systems and large scale exposure of private\ndata have made an alternative solution desirable. These events have caused\nusers to assess their own security practices and the level of trust placed in\nthird party storage services. One option is BitTorrent Sync, a cloudless\nsynchronisation utility provides data availability and redundancy. This utility\nreplicates files stored in shares to remote peers with access controlled by\nkeys and permissions. While lacking the economies brought about by scale,\ncomplete control over data access has made this a popular solution. The ability\nto replicate data without oversight introduces risk of abuse by users as well\nas difficulties for forensic investigators. This paper suggests a methodology\nfor investigation and analysis of the protocol to assist in the control of data\nflow across security perimeters.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jun 2015 21:21:41 GMT"}], "update_date": "2015-06-05", "authors_parsed": [["Scanlon", "Mark", ""], ["Farina", "Jason", ""], ["Kechadi", "M-Tahar", ""]]}, {"id": "1506.01449", "submitter": "Riad Wahby", "authors": "Sebastian Angel and Riad S. Wahby and Max Howald and Joshua B. Leners\n  and Michael Spilo and Zhen Sun and Andrew J. Blumberg and Michael Walfish", "title": "Defending against malicious peripherals with Cinch", "comments": "18 pages, 7 figures", "journal-ref": "Proc. USENIX Security (2016), 397--414", "doi": null, "report-no": null, "categories": "cs.OS cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Malicious peripherals designed to attack their host computers are a growing\nproblem. Inexpensive and powerful peripherals that attach to plug-and-play\nbuses have made such attacks easy to mount. Making matters worse, commodity\noperating systems lack coherent defenses, and users are often unaware of the\nscope of the problem. We present Cinch, a pragmatic response to this threat.\nCinch uses virtualization to attach peripheral devices to a logically separate,\nuntrusted machine, and includes an interposition layer between the untrusted\nmachine and the protected one. This layer regulates interaction with devices\naccording to user-configured policies. Cinch integrates with existing OSes,\nenforces policies that thwart real-world attacks, and has low overhead.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2015 02:11:27 GMT"}, {"version": "v2", "created": "Sat, 11 Jul 2015 02:03:44 GMT"}, {"version": "v3", "created": "Wed, 2 Mar 2016 14:17:15 GMT"}, {"version": "v4", "created": "Wed, 29 Jun 2016 20:42:04 GMT"}], "update_date": "2016-08-19", "authors_parsed": [["Angel", "Sebastian", ""], ["Wahby", "Riad S.", ""], ["Howald", "Max", ""], ["Leners", "Joshua B.", ""], ["Spilo", "Michael", ""], ["Sun", "Zhen", ""], ["Blumberg", "Andrew J.", ""], ["Walfish", "Michael", ""]]}, {"id": "1506.01739", "submitter": "Flavio Lombardi", "authors": "Roberto Battistoni, Roberto Di Pietro, Flavio Lombardi", "title": "CloRoFor: Cloud Robust Forensics", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The malicious alteration of machine time is a big challenge in computer\nforensics. Detecting such changes and reconstructing the actual timeline of\nevents is of paramount importance. However, this can be difficult since the\nattacker has many opportunities and means to hide such changes. In particular,\ncloud computing, host and guest machine time can be manipulated in various ways\nby an attacker. Guest virtual machines are especially vulnerable to attacks\ncoming from their (more privileged) host. As such, it is important to guarantee\nthe timeline integrity of both hosts and guests in a cloud, or at least to\nensure that the alteration of such timeline does not go undetected. In this\npaper we survey the issues related to host and guest machine time integrity in\nthe cloud. Further, we describe a novel architecture for host and guest time\nalteration detection and correction/resilience with respect to compromised\nhosts and guests. The proposed framework has been implemented on an especially\nbuilt simulator. Collected results are evaluated and discussed. Performance\nfigures show the feasibility of our proposal.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2015 22:12:31 GMT"}], "update_date": "2015-06-08", "authors_parsed": [["Battistoni", "Roberto", ""], ["Di Pietro", "Roberto", ""], ["Lombardi", "Flavio", ""]]}, {"id": "1506.01966", "submitter": "Marco Baldi", "authors": "Marco Baldi, Giacomo Ricciutelli, Nicola Maturo, Franco Chiaraluce", "title": "Performance assessment and design of finite length LDPC codes for the\n  Gaussian wiretap channel", "comments": "6 pages, 3 figures, IEEE ICC 2015 - Workshop on Wireless Physical\n  Layer Security", "journal-ref": null, "doi": "10.1109/ICCW.2015.7247218", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we study the reliability and secrecy performance achievable by\npractical LDPC codes over the Gaussian wiretap channel. While several works\nhave already addressed this problem in asymptotic conditions, i.e., under the\nhypothesis of codewords of infinite length, only a few approaches exist for the\nfinite length regime. We propose an approach to measure the performance of\npractical codes and compare it with that achievable in asymptotic conditions.\nMoreover, based on the secrecy metrics we adopt to achieve this target, we\npropose a code optimization algorithm which allows to design irregular LDPC\ncodes able to approach the ultimate performance limits even at moderately small\ncodeword lengths (in the order of 10000 bits).\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2015 16:51:13 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Baldi", "Marco", ""], ["Ricciutelli", "Giacomo", ""], ["Maturo", "Nicola", ""], ["Chiaraluce", "Franco", ""]]}, {"id": "1506.02071", "submitter": "Krzysztof Szczypiorski", "authors": "Jason Hiney, Tejas Dakve, Krzysztof Szczypiorski, Kris Gaj", "title": "Using Facebook for Image Steganography", "comments": "6 pages, 4 figures, 2 tables. Accepted to Fourth International\n  Workshop on Cyber Crime (IWCC 2015), co-located with 10th International\n  Conference on Availability, Reliability and Security (ARES 2015), Toulouse,\n  France, 24-28 August 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Because Facebook is available on hundreds of millions of desktop and mobile\ncomputing platforms around the world and because it is available on many\ndifferent kinds of platforms (from desktops and laptops running Windows, Unix,\nor OS X to hand held devices running iOS, Android, or Windows Phone), it would\nseem to be the perfect place to conduct steganography. On Facebook, information\nhidden in image files will be further obscured within the millions of pictures\nand other images posted and transmitted daily. Facebook is known to alter and\ncompress uploaded images so they use minimum space and bandwidth when displayed\non Facebook pages. The compression process generally disrupts attempts to use\nFacebook for image steganography. This paper explores a method to minimize the\ndisruption so JPEG images can be used as steganography carriers on Facebook.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2015 21:16:22 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Hiney", "Jason", ""], ["Dakve", "Tejas", ""], ["Szczypiorski", "Krzysztof", ""], ["Gaj", "Kris", ""]]}, {"id": "1506.02268", "submitter": "George Grispos", "authors": "George Grispos, William Bradley Glisson and Tim Storer", "title": "Recovering Residual Forensic Data from Smartphone Interactions with\n  Cloud Storage Providers", "comments": null, "journal-ref": "2015. In The Cloud Security Ecosystem, edited by Ryan Ko and\n  Kim-Kwang Raymond Choo, Syngress, Boston, Pages 347-382", "doi": "10.1016/B978-0-12-801595-7.00016-1", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a growing demand for cloud storage services such as Dropbox, Box,\nSyncplicity and SugarSync. These public cloud storage services can store\ngigabytes of corporate and personal data in remote data centres around the\nworld, which can then be synchronized to multiple devices. This creates an\nenvironment which is potentially conducive to security incidents, data breaches\nand other malicious activities. The forensic investigation of public cloud\nenvironments presents a number of new challenges for the digital forensics\ncommunity. However, it is anticipated that end-devices such as smartphones,\nwill retain data from these cloud storage services. This research investigates\nhow forensic tools that are currently available to practitioners can be used to\nprovide a practical solution for the problems related to investigating cloud\nstorage environments. The research contribution is threefold. First, the\nfindings from this research support the idea that end-devices which have been\nused to access cloud storage services can be used to provide a partial view of\nthe evidence stored in the cloud service. Second, the research provides a\ncomparison of the number of files which can be recovered from different\nversions of cloud storage applications. In doing so, it also supports the idea\nthat amalgamating the files recovered from more than one device can result in\nthe recovery of a more complete dataset. Third, the chapter contributes to the\ndocumentation and evidentiary discussion of the artefacts created from specific\ncloud storage applications and different versions of these applications on iOS\nand Android smartphones.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jun 2015 14:07:12 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Grispos", "George", ""], ["Glisson", "William Bradley", ""], ["Storer", "Tim", ""]]}, {"id": "1506.02294", "submitter": "Neil Zhenqiang Gong", "authors": "Neil Zhenqiang Gong and Mathias Payer and Reza Moazzezi and Mario\n  Frank", "title": "Forgery-Resistant Touch-based Authentication on Mobile Devices", "comments": "Accepted for publication by ASIACCS'16", "journal-ref": null, "doi": "10.1145/2897845.2897908", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile devices store a diverse set of private user data and have gradually\nbecome a hub to control users' other personal Internet-of-Things devices.\nAccess control on mobile devices is therefore highly important. The widely\naccepted solution is to protect access by asking for a password. However,\npassword authentication is tedious, e.g., a user needs to input a password\nevery time she wants to use the device. Moreover, existing biometrics such as\nface, fingerprint, and touch behaviors are vulnerable to forgery attacks.\n  We propose a new touch-based biometric authentication system that is passive\nand secure against forgery attacks. In our touch-based authentication, a user's\ntouch behaviors are a function of some random \"secret\". The user can\nsubconsciously know the secret while touching the device's screen. However, an\nattacker cannot know the secret at the time of attack, which makes it\nchallenging to perform forgery attacks even if the attacker has already\nobtained the user's touch behaviors. We evaluate our touch-based authentication\nsystem by collecting data from 25 subjects. Results are promising: the random\nsecrets do not influence user experience and, for targeted forgery attacks, our\nsystem achieves 0.18 smaller Equal Error Rates (EERs) than previous touch-based\nauthentication.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jun 2015 18:30:46 GMT"}, {"version": "v2", "created": "Tue, 15 Mar 2016 15:58:53 GMT"}], "update_date": "2019-11-26", "authors_parsed": [["Gong", "Neil Zhenqiang", ""], ["Payer", "Mathias", ""], ["Moazzezi", "Reza", ""], ["Frank", "Mario", ""]]}, {"id": "1506.02311", "submitter": "Krzysztof Szczypiorski", "authors": "Wojciech Fraczek, Krzysztof Szczypiorski", "title": "StegBlocks: ensuring perfect undetectability of network steganography", "comments": "6 pages, 1 figure, Accepted to Fourth International Workshop on Cyber\n  Crime (IWCC 2015), co-located with 10th International Conference on\n  Availability, Reliability and Security (ARES 2015), Toulouse, France, 24-28\n  August 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents StegBlocks, which defines a new concept for performing\nundetectable hidden communication. StegBlocks is a general approach for\nconstructing methods of network steganography. In StegBlocks, one has to\ndetermine objects with defined properties which will be used to transfer hidden\nmessages. The objects are dependent on a specific network protocol (or\napplication) used as a carrier for a given network steganography method.\nMoreover, the paper presents the approach to perfect undetectability of network\nsteganography, which was developed based on the rules of undetectability for\ngeneral steganography. The approach to undetectability of network steganography\nwas used to show the possibility of developing perfectly undetectable network\nsteganography methods using the StegBlocks concept.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jun 2015 20:46:27 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Fraczek", "Wojciech", ""], ["Szczypiorski", "Krzysztof", ""]]}, {"id": "1506.02354", "submitter": "Anish Prasad Shrestha Mr.", "authors": "Anish Prasad Shrestha and Kyung Sup Kwak", "title": "Secure Ad-hoc Routing Scheme", "comments": "There are some errors that needs to be fixed", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates on the problem of combining routing scheme and\nphysical layer security in multihop wireless networks with cooperative\ndiversity. We propose an ad-hoc natured hop-by-hop best secure relay selection\nin a multihop network with several relays and an eavesdropper at each hop which\nprovides a safe routing scheme to transmit confidential message from\ntransmitter to legitimate receiver. The selection is based on the instantaneous\nchannel conditions of relay and eavesdropper at each hop. A theoretical\nanalysis is performed to derive new closed form expressions for probability of\nnon-zero secrecy capacity along with the exact end to end secrecy outage\nprobability at a normalized secrecy rate. Furthermore, we provide the\nasymptotic expression to gain insights on the diversity gain.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2015 05:57:44 GMT"}, {"version": "v2", "created": "Thu, 19 Jul 2018 07:40:15 GMT"}], "update_date": "2018-07-20", "authors_parsed": [["Shrestha", "Anish Prasad", ""], ["Kwak", "Kyung Sup", ""]]}, {"id": "1506.02711", "submitter": "Douglas Stinson", "authors": "Maura B. Paterson and Douglas R. Stinson", "title": "Combinatorial Characterizations of Algebraic Manipulation Detection\n  Codes Involving Generalized Difference Families", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper provides a mathematical analysis of optimal algebraic manipulation\ndetection (AMD) codes. We prove several lower bounds on the success probability\nof an adversary and we then give some combinatorial characterizations of AMD\ncodes that meet the bounds with equality. These characterizations involve\nvarious types of generalized difference families. Constructing these difference\nfamilies is an interesting problem in its own right.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2015 22:08:35 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Paterson", "Maura B.", ""], ["Stinson", "Douglas R.", ""]]}, {"id": "1506.02717", "submitter": "Paul Kirchner", "authors": "Paul Kirchner and Pierre-Alain Fouque", "title": "An Improved BKW Algorithm for LWE with Applications to Cryptography and\n  Lattices", "comments": "CRYPTO 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DS cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the Learning With Errors problem and its binary\nvariant, where secrets and errors are binary or taken in a small interval. We\nintroduce a new variant of the Blum, Kalai and Wasserman algorithm, relying on\na quantization step that generalizes and fine-tunes modulus switching. In\ngeneral this new technique yields a significant gain in the constant in front\nof the exponent in the overall complexity. We illustrate this by solving p\nwithin half a day a LWE instance with dimension n = 128, modulus $q = n^2$,\nGaussian noise $\\alpha = 1/(\\sqrt{n/\\pi} \\log^2 n)$ and binary secret, using\n$2^{28}$ samples, while the previous best result based on BKW claims a time\ncomplexity of $2^{74}$ with $2^{60}$ samples for the same parameters. We then\nintroduce variants of BDD, GapSVP and UniqueSVP, where the target point is\nrequired to lie in the fundamental parallelepiped, and show how the previous\nalgorithm is able to solve these variants in subexponential time. Moreover, we\nalso show how the previous algorithm can be used to solve the BinaryLWE problem\nwith n samples in subexponential time $2^{(\\ln 2/2+o(1))n/\\log \\log n}$. This\nanalysis does not require any heuristic assumption, contrary to other algebraic\napproaches; instead, it uses a variant of an idea by Lyubashevsky to generate\nmany samples from a small number of samples. This makes it possible to\nasymptotically and heuristically break the NTRU cryptosystem in subexponential\ntime (without contradicting its security assumption). We are also able to solve\nsubset sum problems in subexponential time for density $o(1)$, which is of\nindependent interest: for such density, the previous best algorithm requires\nexponential time. As a direct application, we can solve in subexponential time\nthe parameters of a cryptosystem based on this problem proposed at TCC 2010.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2015 22:22:25 GMT"}, {"version": "v2", "created": "Mon, 15 Jun 2015 19:53:27 GMT"}, {"version": "v3", "created": "Mon, 22 Jun 2015 22:16:33 GMT"}, {"version": "v4", "created": "Mon, 29 Jun 2015 23:24:59 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Kirchner", "Paul", ""], ["Fouque", "Pierre-Alain", ""]]}, {"id": "1506.02742", "submitter": "Koji Nuida", "authors": "Shizuo Kaji, Toshiaki Maeno, Koji Nuida, Yasuhide Numata", "title": "Polynomial Expressions of Carries in p-ary Arithmetics", "comments": "(v2) Improved results and new observations (v3) The authors are\n  notified that our main theorem (Theorem 2) appears (by a different approach)\n  in [C. Sturtivant, G. S. Frandsen: Theoretical Computer Science 112 (1993)\n  291-309]. The authors would like to keep this preprint online for reference\n  purposes", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CR cs.IT math.IT math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that any $n$-variable function on a finite prime field of\ncharacteristic $p$ can be expressed as a polynomial over the same field with at\nmost $p^n$ monomials. However, it is not obvious to determine the polynomial\nfor a given concrete function. In this paper, we study the concrete polynomial\nexpressions of the carries in addition and multiplication of $p$-ary integers.\nFor the case of addition, our result gives a new family of symmetric\npolynomials, which generalizes the known result for the binary case $p = 2$\nwhere the carries are given by elementary symmetric polynomials. On the other\nhand, for the case of multiplication of $n$ single-digit integers, we give a\nsimple formula of the polynomial expression for the carry to the next digit\nusing the Bernoulli numbers, and show that it has only $(n+1)(p-1)/2 + 1$\nmonomials, which is significantly fewer than the worst-case number $p^n$ of\nmonomials for general functions. We also discuss applications of our results to\ncryptographic computation on encrypted data.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2015 01:26:24 GMT"}, {"version": "v2", "created": "Tue, 11 Aug 2015 05:35:32 GMT"}, {"version": "v3", "created": "Fri, 19 Feb 2016 01:20:04 GMT"}], "update_date": "2016-02-22", "authors_parsed": [["Kaji", "Shizuo", ""], ["Maeno", "Toshiaki", ""], ["Nuida", "Koji", ""], ["Numata", "Yasuhide", ""]]}, {"id": "1506.02820", "submitter": "Alexander Zeh", "authors": "Alexander Zeh, Markus Ulmschneider", "title": "Decoding of Repeated-Root Cyclic Codes up to New Bounds on Their Minimum\n  Distance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.DM math.CO math.IT math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The well-known approach of Bose, Ray-Chaudhuri and Hocquenghem and its\ngeneralization by Hartmann and Tzeng are lower bounds on the minimum distance\nof simple-root cyclic codes. We generalize these two bounds to the case of\nrepeated-root cyclic codes and present a syndrome-based burst error decoding\nalgorithm with guaranteed decoding radius based on an associated folded cyclic\ncode. Furthermore, we present a third technique for bounding the minimum\nHamming distance based on the embedding of a given repeated-root cyclic code\ninto a repeated-root cyclic product code. A second quadratic-time probabilistic\nburst error decoding procedure based on the third bound is outlined. Index\nTerms Bound on the minimum distance, burst error, efficient decoding, folded\ncode, repeated-root cyclic code, repeated-root cyclic product code\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2015 08:27:08 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Zeh", "Alexander", ""], ["Ulmschneider", "Markus", ""]]}, {"id": "1506.02954", "submitter": "Debayan Gupta", "authors": "Benjamin Mood, Debayan Gupta, Kevin Butler, Joan Feigenbaum", "title": "Reuse It Or Lose It: More Efficient Secure Computation Through Reuse of\n  Encrypted Values", "comments": "20 pages, shorter conference version published in Proceedings of the\n  2014 ACM SIGSAC Conference on Computer and Communications Security, Pages\n  582-596, ACM New York, NY, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two-party secure function evaluation (SFE) has become significantly more\nfeasible, even on resource-constrained devices, because of advances in\nserver-aided computation systems. However, there are still bottlenecks,\nparticularly in the input validation stage of a computation. Moreover, SFE\nresearch has not yet devoted sufficient attention to the important problem of\nretaining state after a computation has been performed so that expensive\nprocessing does not have to be repeated if a similar computation is done again.\nThis paper presents PartialGC, an SFE system that allows the reuse of encrypted\nvalues generated during a garbled-circuit computation. We show that using\nPartialGC can reduce computation time by as much as 96% and bandwidth by as\nmuch as 98% in comparison with previous outsourcing schemes for secure\ncomputation. We demonstrate the feasibility of our approach with two sets of\nexperiments, one in which the garbled circuit is evaluated on a mobile device\nand one in which it is evaluated on a server. We also use PartialGC to build a\nprivacy-preserving \"friend finder\" application for Android. The reuse of\nprevious inputs to allow stateful evaluation represents a new way of looking at\nSFE and further reduces computational barriers.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2015 15:18:48 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Mood", "Benjamin", ""], ["Gupta", "Debayan", ""], ["Butler", "Kevin", ""], ["Feigenbaum", "Joan", ""]]}, {"id": "1506.03032", "submitter": "Hui Xu", "authors": "Hui Xu, Yangfan Zhou, Michael R. Lyu", "title": "N-Version Obfuscation: Impeding Software Tampering Replication with\n  Program Diversity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tamper-resistance is a fundamental software security research area. Many\napproaches have been proposed to thwart specific procedures of tampering, e.g.,\nobfuscation and self-checksumming. However, to our best knowledge, none of them\ncan achieve theoretically tamper-resistance. Our idea is to impede the\nreplication of tampering via program diversification, and thus increasing the\ncomplexity to break the whole software system. To this end, we propose to\ndeliver same featured, but functionally nonequivalent software copies to\ndifferent machines. We formally define the problem as N-version obfuscation,\nand provide a viable means to solve the problem. Our evaluation result shows\nthat the time required for breaking a software system is linearly increased\nwith the number of software versions, which is O(n) complexity.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2015 10:10:47 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Xu", "Hui", ""], ["Zhou", "Yangfan", ""], ["Lyu", "Michael R.", ""]]}, {"id": "1506.03392", "submitter": "Stephanos Matsumoto", "authors": "Stephanos Matsumoto, Raphael M. Reischuk, Pawel Szalachowski, Tiffany\n  Hyun-Jin Kim, Adrian Perrig", "title": "Designing a Global Authentication Infrastructure", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of scaling authentication for naming, routing, and\nend-entity certification to a global environment in which authentication\npolicies and users' sets of trust roots vary widely. The current mechanisms for\nauthenticating names (DNSSEC), routes (BGPSEC), and end-entity certificates\n(TLS) do not support a coexistence of authentication policies, affect the\nentire Internet when compromised, cannot update trust root information\nefficiently, and do not provide users with the ability to make flexible trust\ndecisions. We propose a Scalable Authentication Infrastructure for\nNext-generation Trust (SAINT), which partitions the Internet into groups with\ncommon, local trust roots, and isolates the effects of a compromised trust\nroot. SAINT requires groups with direct routing connections to cross-sign each\nother for authentication purposes, allowing diverse authentication policies\nwhile keeping all entities globally verifiable. SAINT makes trust root\nmanagement a central part of the network architecture, enabling trust root\nupdates within seconds and allowing users to make flexible trust decisions.\nSAINT operates without a significant performance penalty and can be deployed\nalongside existing infrastructures.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jun 2015 16:55:22 GMT"}, {"version": "v2", "created": "Fri, 12 Jun 2015 18:52:50 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Matsumoto", "Stephanos", ""], ["Reischuk", "Raphael M.", ""], ["Szalachowski", "Pawel", ""], ["Kim", "Tiffany Hyun-Jin", ""], ["Perrig", "Adrian", ""]]}, {"id": "1506.03471", "submitter": "Guy Zyskind", "authors": "Guy Zyskind, Oz Nathan, Alex Pentland", "title": "Enigma: Decentralized Computation Platform with Guaranteed Privacy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A peer-to-peer network, enabling different parties to jointly store and run\ncomputations on data while keeping the data completely private. Enigma's\ncomputational model is based on a highly optimized version of secure\nmulti-party computation, guaranteed by a verifiable secret-sharing scheme. For\nstorage, we use a modified distributed hashtable for holding secret-shared\ndata. An external blockchain is utilized as the controller of the network,\nmanages access control, identities and serves as a tamper-proof log of events.\nSecurity deposits and fees incentivize operation, correctness and fairness of\nthe system. Similar to Bitcoin, Enigma removes the need for a trusted third\nparty, enabling autonomous control of personal data. For the first time, users\nare able to share their data with cryptographic guarantees regarding their\nprivacy.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jun 2015 20:34:12 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Zyskind", "Guy", ""], ["Nathan", "Oz", ""], ["Pentland", "Alex", ""]]}, {"id": "1506.03588", "submitter": "Siaw-Lynn Ng Dr", "authors": "Liqun Chen, Qin Li, Keith M.Martin, Siaw-Lynn Ng", "title": "Private reputation retrieval in public - a privacy-aware announcement\n  scheme for VANETs", "comments": "This paper is a preprint of a paper submitted to IET Information\n  Security and is subject to Institution of Engineering and Technology\n  Copyright. If accepted, the copy of record will be available at IET Digital\n  Library", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An announcement scheme is a system that facilitates vehicles to broadcast\nroad-related information in vehicular ad hoc networks (VANETs) in order to\nimprove road safety and efficiency. Here we propose a new cryptographic\nprimitive for public updating of reputation score based on the\nBoneh-Boyen-Shacham short group signature scheme. This allows private\nreputation score retrieval without a secure channel. Using this we devise a\nprivacy-aware announcement scheme using reputation systems which is reliable,\nauditable and robust.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 08:57:07 GMT"}, {"version": "v2", "created": "Wed, 18 May 2016 08:51:24 GMT"}], "update_date": "2016-05-19", "authors_parsed": [["Chen", "Liqun", ""], ["Li", "Qin", ""], ["Martin", "Keith M.", ""], ["Ng", "Siaw-Lynn", ""]]}, {"id": "1506.03681", "submitter": "Fatema Akhter", "authors": "Fatema Akhter", "title": "A Novel Approach for Image Steganography in Spatial Domain", "comments": null, "journal-ref": "Global Journal of Computer Science and Technology, Volume 13,\n  Issue 7, pp. 1-6 Year 2013", "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a new approach for hiding information in digital image in\nspatial domain. In this approach three bits of message is embedded in a pixel\nusing Lucas number system but only one bit plane is allowed for alternation.\nThe experimental results show that the proposed method has the larger capacity\nof embedding data, high peak signal to noise ratio compared to existing methods\nand is hardly detectable for steganolysis algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 14:05:45 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Akhter", "Fatema", ""]]}, {"id": "1506.03753", "submitter": "Udit Gupta", "authors": "Udit Gupta", "title": "Application of Multi factor authentication in Internet of Things domain", "comments": "6 pages, 1 table", "journal-ref": null, "doi": "10.5120/ijca2015905221", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Authentication forms the gateway to any secure system. Together with\nintegrity, confidentiality and authorization it helps in preventing any sort of\nintrusions into the system. Up until a few years back password based\nauthentication was the most common form of authentication to any secure\nnetwork. But with the advent of more sophisticated technologies this form of\nauthentication although still widely used has become insecure. Furthermore,\nwith the rise of 'Internet of Things' where the number of devices would grow\nmanifold it would be infeasible for user to remember innumerable passwords.\nTherefore, it's important to address this concern by devising ways in which\nmultiple forms of authentication would be required to gain access to any smart\ndevices and at the same time its usability would be high. In this paper, a\nmethodology is discussed as to what kind of authentication mechanisms could be\ndeployed in internet of things (IOT).\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 17:38:56 GMT"}, {"version": "v2", "created": "Sat, 20 Jun 2015 04:14:15 GMT"}], "update_date": "2015-10-28", "authors_parsed": [["Gupta", "Udit", ""]]}, {"id": "1506.03774", "submitter": "Oliver Kosut", "authors": "Jingwen Liang, Lalitha Sankar, Oliver Kosut", "title": "Vulnerability Analysis and Consequences of False Data Injection Attack\n  on Power System State Estimation", "comments": "9 pages, 7 figures. A version of this manuscript was submitted to the\n  IEEE Transactions on Power Systems", "journal-ref": null, "doi": "10.1109/TPWRS.2015.2504950", "report-no": null, "categories": "cs.SY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An unobservable false data injection (FDI) attack on AC state estimation (SE)\nis introduced and its consequences on the physical system are studied. With a\nfocus on understanding the physical consequences of FDI attacks, a bi-level\noptimization problem is introduced whose objective is to maximize the physical\nline flows subsequent to an FDI attack on DC SE. The maximization is subject to\nconstraints on both attacker resources (size of attack) and attack detection\n(limiting load shifts) as well as those required by DC optimal power flow (OPF)\nfollowing SE. The resulting attacks are tested on a more realistic non-linear\nsystem model using AC state estimation and ACOPF, and it is shown that, with an\nappropriately chosen sub-network, the attacker can overload transmission lines\nwith moderate shifts of load.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 18:51:40 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Liang", "Jingwen", ""], ["Sankar", "Lalitha", ""], ["Kosut", "Oliver", ""]]}, {"id": "1506.03830", "submitter": "Juan Manuel R. Mosso Sr.", "authors": "Juan Manuel R. Mosso", "title": "Ciberseguridad Inteligente", "comments": "21 pages, in Spanish", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet Economy has a strong dependency on cyberspace. This raises\nsecurity risk scenarios due to the increasing number of vulnerabilities and the\nincreased frequency and sophistication of cyber attacks, especially with the\nadvent of advanced threats of APT type. This paper presents a model of\nIntelligent Cybersecurity (ICS) for detect, deny, disrupt, degrade, deceive and\ndestroy enemy capabilities in cyberspace. This is achieved through the\nconceptual and technical development of a Capacity for Cyber Intelligence (CCI)\nwhich aims to interfere destructively C2 capabilities of the adversary,\npenetrating its decision loops with the speed necessary to displace him to a\nreactive posture. Finally, unlike the security models raised classically, the\nconcept of ICSI suggests that the advantage in the conflict can be obtained by\ndefense and not always by the attacker. As theoretical support, the \"Offensive\nSystem Reference Model\" (OSRM) is presented, which is used to think cyber\nconflict at all levels, from a perspective coordinated and synchronized with\nthe rest of the traditional forces under the present set; and a justification\nof the capacity from the modern perspective C2.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 20:44:15 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Mosso", "Juan Manuel R.", ""]]}, {"id": "1506.03950", "submitter": "Abhishek Bichhawat", "authors": "Abhishek Bichhawat, Vineet Rajani, Deepak Garg, Christian Hammer", "title": "Generalizing Permissive-Upgrade in Dynamic Information Flow Analysis", "comments": null, "journal-ref": null, "doi": "10.1145/2637113.2637116", "report-no": null, "categories": "cs.CR cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Preventing implicit information flows by dynamic program analysis requires\ncoarse approximations that result in false positives, because a dynamic monitor\nsees only the executed trace of the program. One widely deployed method is the\nno-sensitive-upgrade check, which terminates a program whenever a variable's\ntaint is upgraded (made more sensitive) due to a control dependence on tainted\ndata. Although sound, this method is restrictive, e.g., it terminates the\nprogram even if the upgraded variable is never used subsequently. To counter\nthis, Austin and Flanagan introduced the permissive-upgrade check, which allows\na variable upgrade due to control dependence, but marks the variable\n\"partially-leaked\". The program is stopped later if it tries to use the\npartially-leaked variable. Permissive-upgrade handles the dead-variable\nassignment problem and remains sound. However, Austin and Flanagan develop\npermissive-upgrade only for a two-point (low-high) security lattice and\nindicate a generalization to pointwise products of such lattices. In this\npaper, we develop a non-trivial and non-obvious generalization of\npermissive-upgrade to arbitrary lattices. The key difficulty lies in finding a\nsuitable notion of partial leaks that is both sound and permissive and in\ndeveloping a suitable definition of memory equivalence that allows an inductive\nproof of soundness.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 09:25:44 GMT"}, {"version": "v2", "created": "Tue, 16 Jun 2015 12:26:39 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Bichhawat", "Abhishek", ""], ["Rajani", "Vineet", ""], ["Garg", "Deepak", ""], ["Hammer", "Christian", ""]]}, {"id": "1506.04082", "submitter": "Aviv Ron", "authors": "Aviv Ron, Alexandra Shulman-Peleg and Emanuel Bronshtein", "title": "No SQL, No Injection? Examining NoSQL Security", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  NoSQL data storage systems have become very popular due to their scalability\nand ease of use. This paper examines the maturity of security measures for\nNoSQL databases, addressing their new query and access mechanisms. For example\nthe emergence of new query formats makes the old SQL injection techniques\nirrelevant, but are NoSQL databases immune to injection in general? The answer\nis NO. Here we present a few techniques for attacking NoSQL databases such as\ninjections and CSRF. We analyze the source of these vulnerabilities and present\nmethodologies to mitigate the attacks. We show that this new vibrant\ntechnological area lacks the security measures and awareness which have\ndeveloped over the years in traditional RDBMS SQL systems.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:57:15 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Ron", "Aviv", ""], ["Shulman-Peleg", "Alexandra", ""], ["Bronshtein", "Emanuel", ""]]}, {"id": "1506.04103", "submitter": "Nathaniel Fruchter", "authors": "Nathaniel Fruchter, Hsin Miao, Scott Stevenson and Rebecca Balebako", "title": "Variations in Tracking in Relation to Geographic Location", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Different countries have different privacy regulatory models. These models\nimpact the perspectives and laws surrounding internet privacy. However, little\nis known about how effective the regulatory models are when it comes to\nlimiting online tracking and advertising activity. In this paper, we propose a\nmethod for investigating tracking behavior by analyzing cookies and HTTP\nrequests from browsing sessions originating in different countries. We collect\nbrowsing data from visits to top websites in various countries that utilize\ndifferent regulatory models. We found that there are significant differences in\ntracking activity between different countries using several metrics. We also\nsuggest various ways to extend this study which may yield a more complete\nrepresentation of tracking from a global perspective.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:37:45 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Fruchter", "Nathaniel", ""], ["Miao", "Hsin", ""], ["Stevenson", "Scott", ""], ["Balebako", "Rebecca", ""]]}, {"id": "1506.04104", "submitter": "Georgios Kontaxis", "authors": "Georgios Kontaxis and Monica Chew", "title": "Tracking Protection in Firefox For Privacy and Performance", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015. Awarded Best Paper prize at workshop", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present Tracking Protection in the Mozilla Firefox web browser. Tracking\nProtection is a new privacy technology to mitigate invasive tracking of users'\nonline activity by blocking requests to tracking domains. We evaluate our\napproach and demonstrate a 67.5% reduction in the number of HTTP cookies set\nduring a crawl of the Alexa top 200 news sites. Since Firefox does not download\nand render content from tracking domains, Tracking Protection also enjoys\nperformance benefits of a 44% median reduction in page load time and 39%\nreduction in data usage in the Alexa top 200 news sites.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:41:32 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Kontaxis", "Georgios", ""], ["Chew", "Monica", ""]]}, {"id": "1506.04105", "submitter": "Marta Piekarska", "authors": "Marta Piekarska, Yun Zhou, Dominik Strohmeier and Alexander Raake", "title": "Because we care: Privacy Dashboard on Firefox OS", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present the Privacy Dashboard -- a tool designed to inform\nand empower the people using mobile devices, by introducing features such as\nRemote Privacy Protection, Backup, Adjustable Location Accuracy, Permission\nControl and Secondary-User Mode. We have implemented our solution on FirefoxOS\nand conducted user studies to verify the usefulness and usability of our tool.\nThe paper starts with a discussion of different aspects of mobile privacy, how\nusers perceive it and how much they are willing to give up for better\nusability. Then we describe the tool in detail, presenting what incentives\ndrove us to certain design decisions. During our studies we tried to understand\nhow users interact with the system and what are their priorities. We have\nverified our hypothesis, and the impact of the educational aspects on the\ndecisions about the privacy settings. We show that by taking a user-centric\ndevelopment of privacy extensions we can reduce the gap between protection and\nusability.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:43:34 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Piekarska", "Marta", ""], ["Zhou", "Yun", ""], ["Strohmeier", "Dominik", ""], ["Raake", "Alexander", ""]]}, {"id": "1506.04107", "submitter": "Istemi Ekin Akkus", "authors": "Istemi Ekin Akkus and Nicholas Weaver", "title": "The Case for a General and Interaction-based Third-party Cookie Policy", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The privacy implications of third-party tracking is a well-studied problem.\nRecent research has shown that besides data aggregators and behavioral\nadvertisers, online social networks also act as trackers via social widgets.\nExisting cookie policies are not enough to solve these problems, pushing users\nto employ blacklist-based browser extensions to prevent such tracking.\nUnfortunately, such approaches require maintaining and distributing blacklists,\nwhich are often too general and adversely affect non-tracking services for\nadvertisements and analytics. In this paper, we propose and advocate for a\ngeneral third-party cookie policy that prevents third-party tracking with\ncookies and preserves the functionality of social widgets without requiring a\nblacklist and adversely affecting non-tracking services. We implemented a\nproof-of-concept of our policy as browser extensions for Mozilla Firefox and\nGoogle Chrome. To date, our extensions have been downloaded about 11.8K times\nand have over 2.8K daily users combined.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:45:19 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Akkus", "Istemi Ekin", ""], ["Weaver", "Nicholas", ""]]}, {"id": "1506.04110", "submitter": "Amit Levy", "authors": "Amit Levy, Henry Corrigan-Gibbs and Dan Boneh", "title": "Stickler: Defending Against Malicious CDNs in an Unmodified Browser", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Website publishers can derive enormous performance benefits and cost savings\nby directing traffic to their sites through content distribution networks\n(CDNs). However, publishers who use CDNs today must trust their CDN not to\nmodify the site's JavaScript, CSS, images or other media en route to end users.\nA CDN that violates this trust could inject ads into websites, downsample media\nto save bandwidth or, worse, inject malicious JavaScript code to steal user\nsecrets it could not otherwise access. We present Stickler, a system for\nwebsite publishers that guarantees the end-to-end authenticity of content\nserved to end users while simultaneously allowing publishers to reap the\nbenefits of CDNs. Crucially, Stickler achieves these guarantees without\nrequiring modifications to the browser.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:47:19 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Levy", "Amit", ""], ["Corrigan-Gibbs", "Henry", ""], ["Boneh", "Dan", ""]]}, {"id": "1506.04111", "submitter": "Wei Wang", "authors": "Wei Wang and Kenneth Shirley", "title": "Breaking Bad: Detecting malicious domains using word segmentation", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, vulnerable hosts and maliciously registered domains have\nbeen frequently involved in mobile attacks. In this paper, we explore the\nfeasibility of detecting malicious domains visited on a cellular network based\nsolely on lexical characteristics of the domain names. In addition to using\ntraditional quantitative features of domain names, we also use a word\nsegmentation algorithm to segment the domain names into individual words to\ngreatly expand the size of the feature set. Experiments on a sample of\nreal-world data from a large cellular network show that using word segmentation\nimproves our ability to detect malicious domains relative to approaches without\nsegmentation, as measured by misclassification rates and areas under the ROC\ncurve. Furthermore, the results are interpretable, allowing one to discover\n(with little supervision or tuning required) which words are used most often to\nattract users to malicious domains. Such a lightweight approach could be\nperformed in near-real time when a device attempts to visit a domain. This\napproach can complement (rather than substitute) other more expensive and\ntime-consuming approaches to similar problems that use richer feature sets.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:48:50 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Wang", "Wei", ""], ["Shirley", "Kenneth", ""]]}, {"id": "1506.04112", "submitter": "Marcus Niemietz", "authors": "Marcus Niemietz and Joerg Schwenk", "title": "Owning Your Home Network: Router Security Revisited", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we investigate the Web interfaces of several DSL home routers\nthat can be used to manage their settings via a Web browser. Our goal is to\nchange these settings by using primary XSS and UI redressing attacks. This\nstudy evaluates routers from 10 different manufacturers (TP-Link, Netgear,\nHuawei, D-Link, Linksys, LogiLink, Belkin, Buffalo, Fritz!Box, and Asus). We\nwere able to circumvent the security of all of them. To demonstrate how all\ndevices are able to be attacked, we show how to do fast fingerprinting attacks.\nFurthermore, we provide countermeasures to make administration interfaces and\ntherefore the use of routers more secure.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:51:25 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Niemietz", "Marcus", ""], ["Schwenk", "Joerg", ""]]}, {"id": "1506.04113", "submitter": "Boris Rozenberg", "authors": "Mor Weiss, Boris Rozenberg and Muhammad Barham", "title": "Practical Solutions For Format-Preserving Encryption", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Format Preserving Encryption (FPE) schemes encrypt a plaintext into a\nciphertext while preserving its format (e.g., a valid social-security number is\nencrypted into a valid social-security number), thus allowing encrypted data to\nbe stored and used in the same manner as unencrypted data. Motivated by the\nalways-increasing use of cloud-computing and memory delegation, which require\npreserving both plaintext format and privacy, several FPE schemes for general\nformats have been previously suggested. However, current solutions are both\ninsecure and inefficient in practice. We propose an efficient FPE scheme with\noptimal security. Our scheme includes an efficient method of representing\ngeneral (complex) formats, and provides efficient encryption and decryption\nalgorithms that do not require an expensive set-up. During encryption, only\nformat-specific properties are preserved, while all message-specific properties\nremain hidden, thus guaranteeing data privacy. As experimental results show\nthat in many cases large formats domains cannot be encrypted efficiently, we\nextend our scheme to support large formats, by imposing a user-defined bound on\nthe maximal format size, thus obtaining a flexible security-efficiency tradeoff\nand the best possible security (under the size limitation).\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:53:38 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Weiss", "Mor", ""], ["Rozenberg", "Boris", ""], ["Barham", "Muhammad", ""]]}, {"id": "1506.04115", "submitter": "Griffin Boyce", "authors": "Paul Syverson and Griffin Boyce", "title": "Genuine onion: Simple, Fast, Flexible, and Cheap Website Authentication", "comments": "In Proceedings of the 9th Workshop on Web 2.0 Security and Privacy\n  (W2SP) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tor is a communications infrastructure widely used for unfettered and\nanonymous access to Internet websites. Tor is also used to access sites on the\n.onion virtual domain. The focus of .onion use and discussion has traditionally\nbeen on the offering of hidden services, services that separate their\nreachability from the identification of their IP addresses. We argue that Tor's\n.onion system can be used to provide an entirely separate benefit: basic\nwebsite authentication. We also argue that not only can onionsites provide\nwebsite authentication, but doing so is easy, fast, cheap, flexible and secure\nwhen compared to alternatives such as the standard use of TLS with\ncertificates.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 18:55:44 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Syverson", "Paul", ""], ["Boyce", "Griffin", ""]]}, {"id": "1506.04129", "submitter": "Igor Korkin", "authors": "Igor Korkin and Ivan Nesterov", "title": "Applying Memory Forensics to Rootkit Detection", "comments": "25 pages, 3 figures, 8 tables. Paper presented at the Proceedings of\n  the 9th annual Conference on Digital Forensics, Security and Law (CDFSL),\n  115-141, Richmond, VA, USA. (2014, May 28-29)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Volatile memory dump and its analysis is an essential part of digital\nforensics. Among a number of various software and hardware approaches for\nmemory dumping there are authors who point out that some of these approaches\nare not resilient to various anti-forensic techniques, and others that require\na reboot or are highly platform dependent. New resilient tools have certain\ndisadvantages such as low speed or vulnerability to rootkits which directly\nmanipulate kernel structures e.g. page tables. A new memory forensic system -\nMalware Analysis System for Hidden Knotty Anomalies (MASHKA) is described in\nthis paper. It is resilient to popular anti-forensic techniques. The system can\nbe used for doing a wide range of memory forensics tasks. This paper describes\nhow to apply the system for research and detection of kernel mode rootkits and\nalso presents analysis of the most popular anti-rootkit tools.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 19:45:55 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Korkin", "Igor", ""], ["Nesterov", "Ivan", ""]]}, {"id": "1506.04131", "submitter": "Igor Korkin", "authors": "Igor Korkin", "title": "Two Challenges of Stealthy Hypervisors Detection: Time Cheating and Data\n  Fluctuations", "comments": "25 pages, 7 figures, 8 tables. Paper presented at the Proceedings of\n  the 10th Annual Conference on Digital Forensics, Security and Law (CDFSL),\n  33-57, Daytona Beach, Florida, USA (2015, May 18-21)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR stat.AP stat.CO stat.OT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Hardware virtualization technologies play a significant role in cyber\nsecurity. On the one hand these technologies enhance security levels, by\ndesigning a trusted operating system. On the other hand these technologies can\nbe taken up into modern malware which is rather hard to detect. None of the\nexisting methods is able to efficiently detect a hypervisor in the face of\ncountermeasures such as time cheating, temporary self uninstalling, memory\nhiding etc. New hypervisor detection methods which will be described in this\npaper can detect a hypervisor under these countermeasures and even count\nseveral nested ones. These novel approaches rely on the new statistical\nanalysis of time discrepancies by examination of a set of instructions, which\nare unconditionally intercepted by a hypervisor. Reliability was achieved\nthrough the comprehensive analysis of the collected data despite its\nfluctuation. These offered methods were comprehensively assessed in both Intel\nand AMD CPUs.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 19:50:33 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Korkin", "Igor", ""]]}, {"id": "1506.04188", "submitter": "David Fern\\'andez-Duque", "authors": "Esteban Landerreche and David Fern\\'andez-Duque", "title": "A case study in almost-perfect security for unconditionally secure\n  communication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Russian cards problem, Alice, Bob and Cath draw $a$, $b$ and $c$\ncards, respectively, from a publicly known deck. Alice and Bob must then\ncommunicate their cards to each other without Cath learning who holds a single\ncard. Solutions in the literature provide weak security, where Cath does not\nknow with certainty who holds each card that is not hers, or perfect security,\nwhere Cath learns no probabilistic information about who holds any given card\nfrom Alice and Bob's exchange. We propose an intermediate notion, which we call\n$\\varepsilon$-strong security, where the probabilities perceived by Cath may\nonly change by a factor of $\\varepsilon$. We then show that a mild variant of\nthe so-called geometric strategy gives $\\varepsilon$-strong safety for\narbitrarily small $\\varepsilon$ and appropriately chosen values of $a,b,c$.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 21:56:49 GMT"}, {"version": "v2", "created": "Sun, 21 Jun 2015 05:02:23 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Landerreche", "Esteban", ""], ["Fernández-Duque", "David", ""]]}, {"id": "1506.04200", "submitter": "Konstantin Berlin", "authors": "Konstantin Berlin, David Slater, and Joshua Saxe", "title": "Malicious Behavior Detection using Windows Audit Logs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As antivirus and network intrusion detection systems have increasingly proven\ninsufficient to detect advanced threats, large security operations centers have\nmoved to deploy endpoint-based sensors that provide deeper visibility into\nlow-level events across their enterprises. Unfortunately, for many\norganizations in government and industry, the installation, maintenance, and\nresource requirements of these newer solutions pose barriers to adoption and\nare perceived as risks to organizations' missions.\n  To mitigate this problem we investigated the utility of agentless detection\nof malicious endpoint behavior, using only the standard build-in Windows audit\nlogging facility as our signal. We found that Windows audit logs, while\nemitting manageable sized data streams on the endpoints, provide enough\ninformation to allow robust detection of malicious behavior. Audit logs provide\nan effective, low-cost alternative to deploying additional expensive\nagent-based breach detection systems in many government and industrial\nsettings, and can be used to detect, in our tests, 83% percent of malware\nsamples with a 0.1% false positive rate. They can also supplement already\nexisting host signature-based antivirus solutions, like Kaspersky, Symantec,\nand McAfee, detecting, in our testing environment, 78% of malware missed by\nthose antivirus systems.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2015 00:02:36 GMT"}, {"version": "v2", "created": "Tue, 25 Aug 2015 16:59:49 GMT"}], "update_date": "2015-08-26", "authors_parsed": [["Berlin", "Konstantin", ""], ["Slater", "David", ""], ["Saxe", "Joshua", ""]]}, {"id": "1506.04265", "submitter": "Vineet Kumar", "authors": "Sinjan Chakraborty, Vineet Kumar", "title": "A Study and Implementation of RSA Cryptosystem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This project involves an implementation of the Rivest Shamir Adleman (RSA)\nencryption algorithm in C. It consists of generation of two random prime\nnumbers and a number co- prime to phi(n) also called euler toitent function.\nThese three are used to generate a public key and private key. The user has to\nenter a message which is encrypted by the public key. The algorithm also\ndecrypts the generated cipher text with the help of the private key and returns\nthe plain text message which was encrypted earlier.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2015 13:06:36 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Chakraborty", "Sinjan", ""], ["Kumar", "Vineet", ""]]}, {"id": "1506.04303", "submitter": "Deepjyoti Deka", "authors": "Deepjyoti Deka, Ross Baldick and Sriram Vishwanath", "title": "One Breaker is Enough: Hidden Topology Attacks on Power Grids", "comments": "5 pages, 5 figures, Accepted to the IEEE PES General Meeting 2015", "journal-ref": null, "doi": "10.1109/PESGM.2015.7286568", "report-no": null, "categories": "cs.CR math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A coordinated cyber-attack on grid meter readings and breaker statuses can\nlead to incorrect state estimation that can subsequently destabilize the grid.\nThis paper studies cyber-attacks by an adversary that changes breaker statuses\non transmission lines to affect the estimation of the grid topology. The\nadversary, however, is incapable of changing the value of any meter data and\ncan only block recorded measurements on certain lines from being transmitted to\nthe control center. The proposed framework, with limited resource requirements\nas compared to standard data attacks, thus extends the scope of cyber-attacks\nto grids secure from meter corruption. We discuss necessary and sufficient\nconditions for feasible attacks using a novel graph-coloring based analysis and\nshow that an optimal attack requires breaker status change at only ONE\ntransmission line. The potency of our attack regime is demonstrated through\nsimulations on IEEE test cases.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2015 18:20:50 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Deka", "Deepjyoti", ""], ["Baldick", "Ross", ""], ["Vishwanath", "Sriram", ""]]}, {"id": "1506.04319", "submitter": "J\\\"org-Volker Peetz", "authors": "A.-M. Leventi-Peetz and J.-V. Peetz", "title": "Generating and Exploring S-Box Multivariate Quadratic Equation Systems\n  with SageMath", "comments": "Ca. 16 pages, contains SageMath code listings; 2nd revised version\n  [Groebner basis treatment added; code output cut]; 3rd version [URL in\n  reference corrected]", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new method to derive Multivariate Quadratic equation systems (MQ) for the\ninput and output bit variables of a cryptographic S-box from its algebraic\nexpressions with the aid of the computer mathematics software system SageMath\nis presented. We consolidate the deficiency of previously presented MQ metrics,\nsupposed to quantify the resistance of S-boxes against algebraic attacks.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2015 20:23:55 GMT"}, {"version": "v2", "created": "Wed, 1 Feb 2017 18:31:05 GMT"}, {"version": "v3", "created": "Thu, 2 Feb 2017 11:58:30 GMT"}], "update_date": "2017-02-03", "authors_parsed": [["Leventi-Peetz", "A. -M.", ""], ["Peetz", "J. -V.", ""]]}, {"id": "1506.04391", "submitter": "Thomas Pasquier", "authors": "Thomas F. J.-M. Pasquier and Jatinder Singh and David Eyers and Jean\n  Bacon", "title": "CamFlow: Managed Data-sharing for Cloud Services", "comments": "14 pages, 8 figures", "journal-ref": null, "doi": "10.1109/TCC.2015.2489211", "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model of cloud services is emerging whereby a few trusted providers manage\nthe underlying hardware and communications whereas many companies build on this\ninfrastructure to offer higher level, cloud-hosted PaaS services and/or SaaS\napplications. From the start, strong isolation between cloud tenants was seen\nto be of paramount importance, provided first by virtual machines (VM) and\nlater by containers, which share the operating system (OS) kernel. Increasingly\nit is the case that applications also require facilities to effect isolation\nand protection of data managed by those applications. They also require\nflexible data sharing with other applications, often across the traditional\ncloud-isolation boundaries; for example, when government provides many related\nservices for its citizens on a common platform. Similar considerations apply to\nthe end-users of applications. But in particular, the incorporation of cloud\nservices within `Internet of Things' architectures is driving the requirements\nfor both protection and cross-application data sharing.\n  These concerns relate to the management of data. Traditional access control\nis application and principal/role specific, applied at policy enforcement\npoints, after which there is no subsequent control over where data flows; a\ncrucial issue once data has left its owner's control by cloud-hosted\napplications and within cloud-services. Information Flow Control (IFC), in\naddition, offers system-wide, end-to-end, flow control based on the properties\nof the data. We discuss the potential of cloud-deployed IFC for enforcing\nowners' dataflow policy with regard to protection and sharing, as well as\nsafeguarding against malicious or buggy software. In addition, the audit log\nassociated with IFC provides transparency, giving configurable system-wide\nvisibility over data flows. [...]\n", "versions": [{"version": "v1", "created": "Sun, 14 Jun 2015 13:20:42 GMT"}, {"version": "v2", "created": "Fri, 11 Sep 2015 12:30:26 GMT"}, {"version": "v3", "created": "Mon, 21 Dec 2015 15:35:09 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Pasquier", "Thomas F. J. -M.", ""], ["Singh", "Jatinder", ""], ["Eyers", "David", ""], ["Bacon", "Jean", ""]]}, {"id": "1506.04429", "submitter": "Stelios Erotokritou", "authors": "Yvo Desmedt and Stelios Erotokritou", "title": "Making Code Voting Secure against Insider Threats using Unconditionally\n  Secure MIX Schemes and Human PSMT Protocols", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Code voting was introduced by Chaum as a solution for using a possibly\ninfected-by-malware device to cast a vote in an electronic voting application.\nChaum's work on code voting assumed voting codes are physically delivered to\nvoters using the mail system, implicitly requiring to trust the mail system.\nThis is not necessarily a valid assumption to make - especially if the mail\nsystem cannot be trusted. When conspiring with the recipient of the cast\nballots, privacy is broken.\n  It is clear to the public that when it comes to privacy, computers and\n\"secure\" communication over the Internet cannot fully be trusted. This\nemphasizes the importance of using: (1) Unconditional security for secure\nnetwork communication. (2) Reduce reliance on untrusted computers.\n  In this paper we explore how to remove the mail system trust assumption in\ncode voting. We use PSMT protocols (SCN 2012) where with the help of visual\naids, humans can carry out $\\mod 10$ addition correctly with a 99\\% degree of\naccuracy. We introduce an unconditionally secure MIX based on the combinatorics\nof set systems.\n  Given that end users of our proposed voting scheme construction are humans we\n\\emph{cannot use} classical Secure Multi Party Computation protocols.\n  Our solutions are for both single and multi-seat elections achieving:\n\\begin{enumerate}[i)]\n  \\item An anonymous and perfectly secure communication network secure against\na $t$-bounded passive adversary used to deliver voting,\n  \\item The end step of the protocol can be handled by a human to evade the\nthreat of malware. \\end{enumerate} We do not focus on active adversaries.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jun 2015 19:07:51 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Desmedt", "Yvo", ""], ["Erotokritou", "Stelios", ""]]}, {"id": "1506.04502", "submitter": "Ndoundam Rene", "authors": "Fabrice P. Tachago, Stephane G. R. Ekodeck, Rene Ndoundam", "title": "Steganography and Broadcasting", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Informally, steganography is the process of exchanging a secret message\nbetween two communicating entities so that an eavesdropper may not know that a\nmessage has been sent. After a review of some steganographic systems, we found\nthat these systems have some defects. First, there are situations in which some\nconcealment algorithms do not properly hide a secret message. Second, to\nconceal one bit of a secret message, some ask at least five documents and make\nat least two sampling operations, thus increasing their run-times. Considering\nthe different ways to communicate with the receiver, we propose two\nsteganographic systems adapted to the email communication whose algorithms are\ndeterministic. To hide one bit of a secret message, our steganographic systems\nneed only one document and performs one sampling operation and therefore\nsignificantly reduces the run-time.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 07:58:51 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Tachago", "Fabrice P.", ""], ["Ekodeck", "Stephane G. R.", ""], ["Ndoundam", "Rene", ""]]}, {"id": "1506.04541", "submitter": "Deepjyoti Deka", "authors": "Deepjyoti Deka, Ross Baldick and Sriram Vishwanath", "title": "Optimal Data Attacks on Power Grids: Leveraging Detection & Measurement\n  Jamming", "comments": "8 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Meter measurements in the power grid are susceptible to manipulation by\nadversaries, that can lead to errors in state estimation. This paper presents a\ngeneral framework to study attacks on state estimation by adversaries capable\nof injecting bad-data into measurements and further, of jamming their\nreception. Through these two techniques, a novel `detectable jamming' attack is\ndesigned that changes the state estimation despite failing bad-data detection\nchecks. Compared to commonly studied `hidden' data attacks, these attacks have\nlower costs and a wider feasible operating region. It is shown that the entire\ndomain of jamming costs can be divided into two regions, with distinct\ngraph-cut based formulations for the design of the optimal attack. The most\nsignificant insight arising from this result is that the adversarial capability\nto jam measurements changes the optimal 'detectable jamming' attack design only\nif the jamming cost is less than half the cost of bad-data injection. A\npolynomial time approximate algorithm for attack vector construction is\ndeveloped and its efficacy in attack design is demonstrated through simulations\non IEEE test systems.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 10:23:44 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Deka", "Deepjyoti", ""], ["Baldick", "Ross", ""], ["Vishwanath", "Sriram", ""]]}, {"id": "1506.04549", "submitter": "Moritz Horsch", "authors": "Moritz Horsch, Andreas H\\\"ulsing, Johannes Buchmann", "title": "PALPAS - PAsswordLess PAssword Synchronization", "comments": "An extended abstract of this work appears in the proceedings of ARES\n  2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tools that synchronize passwords over several user devices typically store\nthe encrypted passwords in a central online database. For encryption, a\nlow-entropy, password-based key is used. Such a database may be subject to\nunauthorized access which can lead to the disclosure of all passwords by an\noffline brute-force attack. In this paper, we present PALPAS, a secure and\nuser-friendly tool that synchronizes passwords between user devices without\nstoring information about them centrally. The idea of PALPAS is to generate a\npassword from a high entropy secret shared by all devices and a random salt\nvalue for each service. Only the salt values are stored on a server but not the\nsecret. The salt enables the user devices to generate the same password but is\nstatistically independent of the password. In order for PALPAS to generate\npasswords according to different password policies, we also present a mechanism\nthat automatically retrieves and processes the password requirements of\nservices. PALPAS users need to only memorize a single password and the setup of\nPALPAS on a further device demands only a one-time transfer of few static data.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 11:01:04 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Horsch", "Moritz", ""], ["Hülsing", "Andreas", ""], ["Buchmann", "Johannes", ""]]}, {"id": "1506.04584", "submitter": "Lin Xu", "authors": "Zhihai Yang, Lin Xu, Zhongmin Cai", "title": "Re-scale AdaBoost for Attack Detection in Collaborative Filtering\n  Recommender Systems", "comments": "30 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collaborative filtering recommender systems (CFRSs) are the key components of\nsuccessful e-commerce systems. Actually, CFRSs are highly vulnerable to attacks\nsince its openness. However, since attack size is far smaller than that of\ngenuine users, conventional supervised learning based detection methods could\nbe too \"dull\" to handle such imbalanced classification. In this paper, we\nimprove detection performance from following two aspects. First, we extract\nwell-designed features from user profiles based on the statistical properties\nof the diverse attack models, making hard classification task becomes easier to\nperform. Then, refer to the general idea of re-scale Boosting (RBoosting) and\nAdaBoost, we apply a variant of AdaBoost, called the re-scale AdaBoost\n(RAdaBoost) as our detection method based on extracted features. RAdaBoost is\ncomparable to the optimal Boosting-type algorithm and can effectively improve\nthe performance in some hard scenarios. Finally, a series of experiments on the\nMovieLens-100K data set are conducted to demonstrate the outperformance of\nRAdaBoost comparing with some classical techniques such as SVM, kNN and\nAdaBoost.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 13:07:52 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Yang", "Zhihai", ""], ["Xu", "Lin", ""], ["Cai", "Zhongmin", ""]]}, {"id": "1506.04650", "submitter": "Prashanth Reddy", "authors": "B. Prashanth Reddy", "title": "Coding Side-Information for Implementing Cubic Transformation", "comments": "12 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the implementation of the cubic public-key\ntransformation, a public-key cryptographic scheme that requires sending of\nadditional side-information. A coding scheme for the side-information, based on\nthe residue number system, is presented. In the conventional one-to-one\nencryption mapping also, such coding can be used to send additional like that\nof watermarking, which could be used to detect man-in-the-middle attacks or\nused for authentication.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 16:14:07 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Reddy", "B. Prashanth", ""]]}, {"id": "1506.04832", "submitter": "Shweta Shinde", "authors": "Shweta Shinde, Zheng Leong Chua, Viswesh Narayanan, Prateek Saxena", "title": "Preventing Your Faults From Telling Your Secrets: Defenses Against\n  Pigeonhole Attacks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  New hardware primitives such as Intel SGX secure a user-level process in\npresence of an untrusted or compromised OS. Such \"enclaved execution\" systems\nare vulnerable to several side-channels, one of which is the page fault\nchannel. In this paper, we show that the page fault side-channel has sufficient\nchannel capacity to extract bits of encryption keys from commodity\nimplementations of cryptographic routines in OpenSSL and Libgcrypt --- leaking\n27% on average and up to 100% of the secret bits in many case-studies. To\nmitigate this, we propose a software-only defense that masks page fault\npatterns by determinising the program's memory access behavior. We show that\nsuch a technique can be built into a compiler, and implement it for a subset of\nC which is sufficient to handle the cryptographic routines we study. This\ndefense when implemented generically can have significant overhead of up to\n4000X, but with help of developer-assisted compiler optimizations, the overhead\nreduces to at most 29.22% in our case studies. Finally, we discuss scope for\nhardware-assisted defenses, and show one solution that can reduce overheads to\n6.77% with support from hardware changes.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2015 04:28:11 GMT"}, {"version": "v2", "created": "Tue, 12 Jan 2016 07:33:47 GMT"}], "update_date": "2016-01-13", "authors_parsed": [["Shinde", "Shweta", ""], ["Chua", "Zheng Leong", ""], ["Narayanan", "Viswesh", ""], ["Saxena", "Prateek", ""]]}, {"id": "1506.04931", "submitter": "Anjan Krishnamurthy", "authors": "Anjan K, Srinath N K, Jibi Abraham", "title": "Entropy Based Detection And Behavioral Analysis Of Hybrid Covert\n  Channeling Secured Communication", "comments": "15 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Covert channels is a vital setup in the analysing the strength of security in\na network.Covert Channel is illegitimate channelling over the secured channel\nand establishes a malicious conversation.The trapdoor set in such channels\nproliferates making covert channel sophisticated to detect their presence in\nnetwork firewall.This is due to the intricate covert scheme that enables to\nbuild robust covert channel over the network.From an attacker's perspective\nthis will ameliorate by placing multiple such trapdoors in different protocols\nin the rudimentary protocol stack. This leads to a unique scenario of Hybrid\nCovert Channel, where different covert channel trapdoors exist at the same\ninstance of time in same layer of protocol stack. For detection agents to\ndetect such event is complicated due to lack of knowledge over the different\ncovert schemes. To improve the knowledge of the detection engine to detect the\nhybrid covert channel scenario it is required to explore all possible\nclandestine mediums used in the formation of such channels. This can be\nexplored by different schemes available and their entropy impact on hybrid\ncovert channel. The environment can be composed of resources and subject under\nat-tack and subject which have initiated the attack (attacker). The paper sets\nitself an objective to understand the different covert schemes and the attack\nscenario (modelling) and possibilities of covert mediums along with metric for\ndetection.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2015 11:54:46 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["K", "Anjan", ""], ["K", "Srinath N", ""], ["Abraham", "Jibi", ""]]}, {"id": "1506.05017", "submitter": "Leandros Maglaras A", "authors": "Pavlos Basaras, Leandros Maglaras, Dimitrios Katsaros and Helge\n  Janicke", "title": "A Robust Eco-Routing Protocol Against Malicious Data in Vehicular\n  Networks", "comments": "8 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular networks have a diverse range of applications that vary from\nsafety, to traffic management and comfort. Vehicular communications (VC) can\nassist in the ecorouting of vehicles in order to reduce the overall mileage and\nCO2 emissions by the exchange of data among vehicle-entities. However, the\ntrustworthiness of these data is crucial as false information can heavily\naffect the performance of applications. Hence, the devising of mechanisms that\nreassure the integrity of the exchanged data is of utmost importance. In this\narticle we investigate how tweaked information originating from malicious nodes\ncan affect the performance of a real time eco routing mechanism that uses DSRC\ncommunications, namely ErouVe. We also develop and evaluate defense mechanisms\nthat exploit vehicular communications in order to filter out tweaked data. We\nprove that our proposed mechanisms can restore the performance of the ErouVe to\nnear its optimal operation and can be used as a basis for protecting other\nsimilar traffic management systems.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2015 16:13:02 GMT"}, {"version": "v2", "created": "Thu, 25 Jun 2015 17:36:22 GMT"}], "update_date": "2015-06-26", "authors_parsed": [["Basaras", "Pavlos", ""], ["Maglaras", "Leandros", ""], ["Katsaros", "Dimitrios", ""], ["Janicke", "Helge", ""]]}, {"id": "1506.05071", "submitter": "Sireesha Chiliveri", "authors": "C. Sireesha, G. Jyostna, P. Raghu Varan, and P. R. L. Eswari", "title": "PROP - Patronage of PHP Web Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  PHP is one of the most commonly used languages to develop web sites because\nof its simplicity, easy to learn and it can be easily embedded with any of the\ndatabases. A web developer with his basic knowledge developing an application\nwithout practising secure guidelines, improper validation of user inputs leads\nto various source code vulnerabilities. Logical flaws while designing,\nimplementing and hosting the web application causes work flow deviation\nattacks. In this paper, we are analyzing the complete behaviour of a web\napplication through static and dynamic analysis methodologies.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 11:08:05 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Sireesha", "C.", ""], ["Jyostna", "G.", ""], ["Varan", "P. Raghu", ""], ["Eswari", "P. R. L.", ""]]}, {"id": "1506.05073", "submitter": "Dorai Ashok S A", "authors": "Dorai Ashok Shanmugavel Anbalagan", "title": "Secure Shell (SSH): Public Key Authentication over Hypertext Transfer\n  Protocol (HTTP)", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Secure Shell (SSH) protocol requires all implementations to support public\nkey authentication method (\"publickey\") for authentication purposes, so web\napplications which provide a SSH client over the web browser need to support\n\"publickey\". However, restrictions in Hypertext Transfer Protocol (HTTP), such\nas same origin policy, and limited access to local resources, make it difficult\nto perform such authentications. In this document, a system to perform\n\"publickey\" authentication over HTTP is provided. It is ensured that no\ncompromise is made that would pose a security risk to SSH protocol.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 11:47:11 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Anbalagan", "Dorai Ashok Shanmugavel", ""]]}, {"id": "1506.05217", "submitter": "Mohsin Junaid", "authors": "Mohsin Junaid, Donggang Liu and David Kung", "title": "Dexteroid: Detecting Malicious Behaviors in Android Apps Using\n  Reverse-Engineered Life Cycle Models", "comments": null, "journal-ref": "Computers & Security, Volume 59,Pages 92-117, ISSN 0167-4048, June\n  2016", "doi": "10.1016/j.cose.2016.01.008", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The amount of Android malware has increased greatly during the last few\nyears. Static analysis is widely used in detecting such malware by analyzing\nthe code without execution. The effectiveness of current tools relies on the\napp model as well as the malware detection algorithm which analyzes the app\nmodel. If the model and/or the algorithm is inadequate, then sophisticated\nattacks that are triggered by specific sequences of events will not be\ndetected.\n  This paper presents a static analysis framework called Dexteroid, which uses\nreverse-engineered life cycle models to accurately capture the behaviors of\nAndroid components. Dexteroid systematically derives event sequences from the\nmodels, and uses them to detect attacks launched by specific ordering of\nevents. A prototype implementation of Dexteroid detects two types of attacks:\n(1) leakage of private information, and (2) sending SMS to premium-rate\nnumbers. A series of experiments are conducted on 1526 Google Play apps, 1259\nGenome Malware apps, and a suite of benchmark apps called DroidBench and the\nresults are compared with a state-of-the-art static analysis tool called\nFlowDroid. The evaluation results show that the proposed framework is effective\nand efficient in terms of precision, recall, and execution time.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2015 06:38:37 GMT"}, {"version": "v2", "created": "Fri, 8 Apr 2016 19:38:43 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Junaid", "Mohsin", ""], ["Liu", "Donggang", ""], ["Kung", "David", ""]]}, {"id": "1506.05247", "submitter": "Zhihai Yang", "authors": "Zhihai Yang", "title": "Defending Grey Attacks by Exploiting Wavelet Analysis in Collaborative\n  Filtering Recommender Systems", "comments": "16 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \"Shilling\" attacks or \"profile injection\" attacks have always major\nchallenges in collaborative filtering recommender systems (CFRSs). Many efforts\nhave been devoted to improve collaborative filtering techniques which can\neliminate the \"shilling\" attacks. However, most of them focused on detecting\npush attack or nuke attack which is rated with the highest score or lowest\nscore on the target items. Few pay attention to grey attack when a target item\nis rated with a lower or higher score than the average score, which shows a\nmore hidden rating behavior than push or nuke attack. In this paper, we present\na novel detection method to make recommender systems resistant to such attacks.\nTo characterize grey ratings, we exploit rating deviation of item to\ndiscriminate between grey attack profiles and genuine profiles. In addition, we\nalso employ novelty and popularity of item to construct rating series. Since it\nis difficult to discriminate between the rating series of attacker and genuine\nusers, we incorporate into discrete wavelet transform (DWT) to amplify these\ndifferences based on the rating series of rating deviation, novelty and\npopularity, respectively. Finally, we respectively extract features from rating\nseries of rating deviation-based, novelty-based and popularity-based by using\namplitude domain analysis method and combine all clustered results as our\ndetection results. We conduct a list of experiments on both the Book-Crossing\nand HetRec-2011 datasets in diverse attack models. Experimental results were\nincluded to validate the effectiveness of our approach in comparison with the\nbenchmarked methods.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2015 08:54:04 GMT"}, {"version": "v2", "created": "Fri, 19 Jun 2015 07:30:47 GMT"}], "update_date": "2015-06-22", "authors_parsed": [["Yang", "Zhihai", ""]]}, {"id": "1506.05285", "submitter": "Pablo Rauzy", "authors": "Pablo Rauzy, Sylvain Guilley, Zakaria Najm", "title": "Formally Proved Security of Assembly Code Against Power Analysis: A Case\n  Study on Balanced Logic", "comments": "Journal of Cryptographic Engineering, Springer, 2015", "journal-ref": null, "doi": "10.1007/s13389-015-0105-2", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In his keynote speech at CHES 2004, Kocher advocated that side-channel\nattacks were an illustration that formal cryptography was not as secure as it\nwas believed because some assumptions (e.g., no auxiliary information is\navailable during the computation) were not modeled. This failure is caused by\nformal methods' focus on models rather than implementations. In this paper we\npresent formal methods and tools for designing protected code and proving its\nsecurity against power analysis. These formal methods avoid the discrepancy\nbetween the model and the implementation by working on the latter rather than\non a high-level model. Indeed, our methods allow us (a) to automatically insert\na power balancing countermeasure directly at the assembly level, and to prove\nthe correctness of the induced code transformation; and (b) to prove that the\nobtained code is balanced with regard to a reasonable leakage model. We also\nshow how to characterize the hardware to use the resources which maximize the\nrelevancy of the model. The tools implementing our methods are then\ndemonstrated in a case study on an 8-bit AVR smartcard for which we generate a\nprovably protected present implementation that reveals to be at least 250 times\nmore resistant to CPA attacks.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2015 11:31:05 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Rauzy", "Pablo", ""], ["Guilley", "Sylvain", ""], ["Najm", "Zakaria", ""]]}, {"id": "1506.05506", "submitter": "Yuzo Maruyama", "authors": "Yuzo Maruyama, Ryoko Tone, Yasushi Asami", "title": "Noise Addition for Individual Records to Preserve Privacy and\n  Statistical Characteristics: Case Study of Real Estate Transaction Data", "comments": "16 pages; minor change in title; revised version", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new method of perturbing a major variable by adding noise such\nthat results of regression analysis are unaffected. The extent of the\nperturbation can be controlled using a single parameter, which eases an actual\nperturbation application. On the basis of results of a numerical experiment, we\nrecommend an appropriate value of the parameter that can achieve both\nsufficient perturbation to mask original values and sufficient coherence\nbetween perturbed and original data.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2015 22:08:37 GMT"}, {"version": "v2", "created": "Fri, 7 Aug 2015 01:17:11 GMT"}], "update_date": "2015-08-10", "authors_parsed": [["Maruyama", "Yuzo", ""], ["Tone", "Ryoko", ""], ["Asami", "Yasushi", ""]]}, {"id": "1506.05533", "submitter": "Kim-Kwang Raymond Choo", "authors": "Ben Martini, Quang Do, Kim-Kwang Raymond Choo", "title": "Mobile Cloud Forensics: An Analysis of Seven Popular Android Apps", "comments": "Book Chapter in Cloud Security Ecosystem (Syngress, an Imprint of\n  Elsevier), 2015", "journal-ref": null, "doi": "10.1016/B978-0-12-801595-7.00015-X", "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using the evidence collection and analysis methodology for Android devices\nproposed by Martini, Do and Choo, we examined and analyzed seven popular\nAndroid cloud-based apps. Firstly, we analyzed each app in order to see what\ninformation could be obtained from their private app storage and SD card\ndirectories. We collated the information and used it to aid our investigation\nof each app database files and AccountManager data. To complete our\nunderstanding of the forensic artefacts stored by apps we analyzed, we\nperformed further analysis on the apps to determine if the user authentication\ncredentials could be collected for each app based on the information gained in\nthe initial analysis stages. The contributions of this research include a\ndetailed description of artefacts, which are of general forensic interest, for\neach app analyzed.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2015 02:17:20 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Martini", "Ben", ""], ["Do", "Quang", ""], ["Choo", "Kim-Kwang Raymond", ""]]}, {"id": "1506.05944", "submitter": "Li Yang", "authors": "Chong Xiang, Li Yang", "title": "Indistinguishability and semantic security for quantum encryption scheme", "comments": "14 pages, no figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the definition of security for encryption scheme in quantum\ncontext. We systematically define the indistinguishability and semantic\nsecurity for quantum public-key and private-key encryption schemes, and for\ncomputational security, physical security and information-theoretic security.\nBased on our definition, we present a necessary and sufficient condition that\nleads to information-theoretic indistinguishability for quantum encryption\nscheme. The equivalence between the indistinguishability and semantic security\nof quantum encryption scheme is also proved.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 10:19:03 GMT"}], "update_date": "2015-06-22", "authors_parsed": [["Xiang", "Chong", ""], ["Yang", "Li", ""]]}, {"id": "1506.05980", "submitter": "Thomas Loruenser", "authors": "Thomas Loruenser, Charles Bastos Rodriguez, Denise Demirel, Simone\n  Fischer-Huebner, Thomas Gross, Thomas Langer, Mathieu des Noes, Henrich C.\n  Poehls, Boris Rozenberg and Daniel Slamanig", "title": "Towards a New Paradigm for Privacy and Security in Cloud Services", "comments": "To appear in 4th Cyber Security and Privacy EU Forum, CSP Forum 2015,\n  Revised Selected Papers", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The market for cloud computing can be considered as the major growth area in\nICT. However, big companies and public authorities are reluctant to entrust\ntheir most sensitive data to external parties for storage and processing. The\nreason for their hesitation is clear: There exist no satisfactory approaches to\nadequately protect the data during its lifetime in the cloud. The EU Project\nPrismacloud (Horizon 2020 programme; duration 2/2015-7/2018) addresses these\nchallenges and yields a portfolio of novel technologies to build security\nenabled cloud services, guaranteeing the required security with the strongest\nnotion possible, namely by means of cryptography. We present a new approach\ntowards a next generation of security and privacy enabled services to be\ndeployed in only partially trusted cloud infrastructures.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 12:52:28 GMT"}, {"version": "v2", "created": "Tue, 21 Jul 2015 22:32:34 GMT"}], "update_date": "2015-07-23", "authors_parsed": [["Loruenser", "Thomas", ""], ["Rodriguez", "Charles Bastos", ""], ["Demirel", "Denise", ""], ["Fischer-Huebner", "Simone", ""], ["Gross", "Thomas", ""], ["Langer", "Thomas", ""], ["Noes", "Mathieu des", ""], ["Poehls", "Henrich C.", ""], ["Rozenberg", "Boris", ""], ["Slamanig", "Daniel", ""]]}, {"id": "1506.06033", "submitter": "Milivoj Simeonovski", "authors": "Milivoj Simeonovski, Fabian Bendun, Muhammad Rizwan Asghar, Michael\n  Backes, Ninja Marnau, Peter Druschel", "title": "Oblivion: Mitigating Privacy Leaks by Controlling the Discoverability of\n  Online Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Search engines are the prevalently used tools to collect information about\nindividuals on the Internet. Search results typically comprise a variety of\nsources that contain personal information -- either intentionally released by\nthe person herself, or unintentionally leaked or published by third parties,\noften with detrimental effects on the individual's privacy. To grant\nindividuals the ability to regain control over their disseminated personal\ninformation, the European Court of Justice recently ruled that EU citizens have\na right to be forgotten in the sense that indexing systems, must offer them\ntechnical means to request removal of links from search results that point to\nsources violating their data protection rights. As of now, these technical\nmeans consist of a web form that requires a user to manually identify all\nrelevant links upfront and to insert them into the web form, followed by a\nmanual evaluation by employees of the indexing system to assess if the request\nis eligible and lawful.\n  We propose a universal framework Oblivion to support the automation of the\nright to be forgotten in a scalable, provable and privacy-preserving manner.\nFirst, Oblivion enables a user to automatically find and tag her disseminated\npersonal information using natural language processing and image recognition\ntechniques and file a request in a privacy-preserving manner. Second, Oblivion\nprovides indexing systems with an automated and provable eligibility mechanism,\nasserting that the author of a request is indeed affected by an online\nresource. The automated ligibility proof ensures censorship-resistance so that\nonly legitimately affected individuals can request the removal of corresponding\nlinks from search results. We have conducted comprehensive evaluations, showing\nthat Oblivion is capable of handling 278 removal requests per second, and is\nhence suitable for large-scale deployment.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 14:45:31 GMT"}], "update_date": "2015-06-22", "authors_parsed": [["Simeonovski", "Milivoj", ""], ["Bendun", "Fabian", ""], ["Asghar", "Muhammad Rizwan", ""], ["Backes", "Michael", ""], ["Marnau", "Ninja", ""], ["Druschel", "Peter", ""]]}, {"id": "1506.06114", "submitter": "Pritam Mukherjee", "authors": "Pritam Mukherjee, Jianwei Xie, Sennur Ulukus", "title": "Secure Degrees of Freedom of One-hop Wireless Networks with No\n  Eavesdropper CSIT", "comments": "Submitted to IEEE Transactions on Information Theory, June 2015", "journal-ref": null, "doi": "10.1109/TIT.2016.2618725", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider three channel models: the wiretap channel with $M$ helpers, the\n$K$-user multiple access wiretap channel, and the $K$-user interference channel\nwith an external eavesdropper, when no eavesdropper's channel state information\n(CSI) is available at the transmitters. In each case, we establish the optimal\nsum secure degrees of freedom (s.d.o.f.) by providing achievable schemes and\nmatching converses. We show that the unavailability of the eavesdropper's CSIT\ndoes not reduce the s.d.o.f. of the wiretap channel with helpers. However,\nthere is loss in s.d.o.f. for both the multiple access wiretap channel and the\ninterference channel with an external eavesdropper. In particular, we show that\nin the absence of eavesdropper's CSIT, the $K$-user multiple access wiretap\nchannel reduces to a wiretap channel with $(K-1)$ helpers from a sum s.d.o.f.\nperspective, and the optimal sum s.d.o.f. reduces from\n$\\frac{K(K-1)}{K(K-1)+1}$ to $\\frac{K-1}{K}$. For the interference channel with\nan external eavesdropper, the optimal sum s.d.o.f. decreases from\n$\\frac{K(K-1)}{2K-1}$ to $\\frac{K-1}{2}$ in the absence of the eavesdropper's\nCSIT. Our results show that the lack of eavesdropper's CSIT does not have a\nsignificant impact on the optimal s.d.o.f. for any of the three channel models,\nespecially when the number of users is large. This implies that physical layer\nsecurity can be made robust to the unavailability of eavesdropper CSIT at high\nsignal to noise ratio (SNR) regimes by careful modification of the achievable\nschemes as demonstrated in this paper.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 19:14:55 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Mukherjee", "Pritam", ""], ["Xie", "Jianwei", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1506.06162", "submitter": "Adam Smith", "authors": "Christian Borgs and Jennifer T. Chayes and Adam Smith", "title": "Private Graphon Estimation for Sparse Graphs", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.CR cs.DS stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We design algorithms for fitting a high-dimensional statistical model to a\nlarge, sparse network without revealing sensitive information of individual\nmembers. Given a sparse input graph $G$, our algorithms output a\nnode-differentially-private nonparametric block model approximation. By\nnode-differentially-private, we mean that our output hides the insertion or\nremoval of a vertex and all its adjacent edges. If $G$ is an instance of the\nnetwork obtained from a generative nonparametric model defined in terms of a\ngraphon $W$, our model guarantees consistency, in the sense that as the number\nof vertices tends to infinity, the output of our algorithm converges to $W$ in\nan appropriate version of the $L_2$ norm. In particular, this means we can\nestimate the sizes of all multi-way cuts in $G$.\n  Our results hold as long as $W$ is bounded, the average degree of $G$ grows\nat least like the log of the number of vertices, and the number of blocks goes\nto infinity at an appropriate rate. We give explicit error bounds in terms of\nthe parameters of the model; in several settings, our bounds improve on or\nmatch known nonprivate results.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 21:29:52 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Borgs", "Christian", ""], ["Chayes", "Jennifer T.", ""], ["Smith", "Adam", ""]]}, {"id": "1506.06332", "submitter": "Igor Semaev", "authors": "Igor Semaev", "title": "Experimental Study of DIGIPASS GO3 and the Security of Authentication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on the analysis of $6$-digit one-time passwords(OTP) generated by\nDIGIPASS GO3 we were able to reconstruct the synchronisation system of the\ntoken, the OTP generating algorithm and the verification protocol in details\nessential for an attack. The OTPs are more predictable than expected. A forgery\nattack is described. We argue the attack success probability is $8^{-5}$. That\nis much higher than $10^{-6}$ which may be expected if all the digits are\nindependent and uniformly distributed. Under natural assumptions even in a\nrelatively small bank or company with $10^4$ customers the number of\ncompromised accounts during a year may be more than $100$.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jun 2015 08:34:15 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Semaev", "Igor", ""]]}, {"id": "1506.06633", "submitter": "Maciej  Skorski", "authors": "Maciej Skorski", "title": "A New Approximate Min-Max Theorem with Applications in Cryptography", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel proof technique that can be applied to attack a broad\nclass of problems in computational complexity, when switching the order of\nuniversal and existential quantifiers is helpful. Our approach combines the\nstandard min-max theorem and convex approximation techniques, offering\nquantitative improvements over the standard way of using min-max theorems as\nwell as more concise and elegant proofs.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 14:39:05 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Skorski", "Maciej", ""]]}, {"id": "1506.06791", "submitter": "Mike Just", "authors": "Abigail Goldsteen, Tyrone Grandison, Mike Just, Larry Koved, Rohan\n  Malcolm, Sean Thorpe", "title": "Proceedings of the Ninth Workshop on Web 2.0 Security and Privacy (W2SP)\n  2015", "comments": "10 papers in the workshop proceedings (from 33 submissions: 30%\n  acceptance rate)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is the Proceedings of the Ninth Workshop on Web 2.0 Security and Privacy\n(W2SP) 2015, held in San Jose, CA, USA, on May 21, 2015. The workshop was held\nas part of the IEEE Computer Society Security and Privacy Workshops, in\nconjunction with the IEEE Symposium on Security and Privacy.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 21:09:37 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Goldsteen", "Abigail", ""], ["Grandison", "Tyrone", ""], ["Just", "Mike", ""], ["Koved", "Larry", ""], ["Malcolm", "Rohan", ""], ["Thorpe", "Sean", ""]]}, {"id": "1506.06987", "submitter": "Hans-Joachim Hof", "authors": "Hans-Joachim Hof", "title": "Towards Enhanced Usability of IT Security Mechanisms - How to Design\n  Usable IT Security Mechanisms Using the Example of Email Encryption", "comments": null, "journal-ref": "International Journal On Advances in Security, volume 6, number\n  1&2, pp. 78-87 ISSN 1942-2636, 2013", "doi": null, "report-no": null, "categories": "cs.CR cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, advanced security mechanisms exist to protect data, systems, and\nnetworks. Most of these mechanisms are effective, and security experts can\nhandle them to achieve a sufficient level of security for any given system.\nHowever, most of these systems have not been designed with focus on good\nusability for the average end user. Today, the average end user often struggles\nwith understanding and using security mecha-nisms. Other security mechanisms\nare simply annoying for end users. As the overall security of any system is\nonly as strong as the weakest link in this system, bad usability of IT security\nmechanisms may result in operating errors, resulting in inse-cure systems.\nBuying decisions of end users may be affected by the usability of security\nmechanisms. Hence, software provid-ers may decide to better have no security\nmechanism then one with a bad usability. Usability of IT security mechanisms is\none of the most underestimated properties of applications and sys-tems. Even IT\nsecurity itself is often only an afterthought. Hence, usability of security\nmechanisms is often the after-thought of an afterthought. This paper presents\nsome guide-lines that should help software developers to improve end user\nusability of security-related mechanisms, and analyzes com-mon applications\nbased on these guidelines. Based on these guidelines, the usability of email\nencryption is analyzed and an email encryption solution with increased\nusability is presented. The approach is based on an automated key and trust\nman-agement. The compliance of the proposed email encryption solution with the\npresented guidelines for usable security mechanisms is evaluated.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2015 13:34:36 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Hof", "Hans-Joachim", ""]]}, {"id": "1506.06990", "submitter": "Hans-Joachim Hof", "authors": "Alexander Schmidtke and Hans-Joachim Hof", "title": "Fighting Spam by Breaking the Econonmy of Advertisment by Unsolicited\n  Emails", "comments": null, "journal-ref": "in SECURWARE 2013, The Seventh International Conference on\n  Emerging Security Information, Systems and Technologies, pp. 96-101, ISBN\n  978-61208-298-1, August 2013", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unsolicited email (spam) is still a problem for users of the email service.\nEven though current email anti-spam solutions filter most spam emails, some\nspam emails still are delivered to the inbox of users. A special class of spam\nemails advertises websites, e.g., online dating sites or online pharmacies. The\nsuccess rate of this kind of advertisement is rather low, however, as sending\nan email does only involve minimal costs, even a very low success rate results\nin enough revenue such that this kind of advertisement pays off. The anti-spam\napproach presented in this paper aims on increasing the costs for websites that\nare advertised by spam emails and on lowering the revenues from spam. Costs can\nbe increased for a website by increasing traffic. Revenues can be decreased by\nmaking the website slow responding, hence some business gets lost. To increase\ncosts and decreased revenues a decentralized peer-to-peer coordination\nmechanism is used to have mail clients to agree on a start date and time for an\nanti-spam campaign. During a campaign, all clients that received spam emails\nadvertings a website send an opt-out request to this website. A huge number of\nopt-out requests results in increased traffic to this website and will likely\nresult in a slower responsibility of the website. The coordination mechanism\npresented in this paper is based on a peer-to-peer mechanisms and a so-called\nparanoid trust model to avoid manipulation by spammers. An implementation for\nthe Thunderbird email client exist. The anti-spam approach presented in this\npaper breaks the economy of spam, hence makes advertisement by unsolicited\nemails unattractive.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2015 13:39:40 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Schmidtke", "Alexander", ""], ["Hof", "Hans-Joachim", ""]]}, {"id": "1506.06996", "submitter": "Hans-Joachim Hof", "authors": "Rainer Falk and Steffen Fries and Hans-Joachim Hof", "title": "Secure Communication Using Electronic Identity Cards for Voice over IP\n  Communication, Home Energy Management, and eMobility", "comments": null, "journal-ref": "International Journal On Advances in Security, Vol. 3, No. 3 & 4,\n  ISSN 1942-2636, 2011", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using communication services is a common part of everyday life in a personal\nor business context. Communication services include Internet services like\nvoice services, chat service, and web 2.0 technologies (wikis, blogs, etc), but\nother usage areas like home energy management and eMobility are will be\nincreasingly tackled. Such communication services typically authenticate\nparticipants. For this identities of some kind are used to identify the\ncommunication peer to the user of a service or to the service itself. Calling\nline identification used in the Session Initiation Protocol (SIP) used for\nVoice over IP (VoIP) is just one example. Authentication and identification of\neCar users for accounting during charging of the eCar is another example. Also,\nfurther mechanisms rely on identities, e.g., whitelists defining allowed\ncommunication peers. Trusted identities prevent identity spoofing, hence are a\nbasic building block for the protection of communication. However, providing\ntrusted identities in a practical way is still a difficult problem and too\noften application specific identities are used, making identity handling a\nhassle. Nowadays, many countries introduced electronic identity cards, e.g.,\nthe German \"Elektronischer Personalausweis\" (ePA). As many German citizens will\npossess an ePA soon, it can be used as security token to provide trusted\nidentities. Especially new usage areas (like eMobility) should from the start\nbe based on the ubiquitous availability of trusted identities. This paper\ndescribes how identity cards can be integrated within three domains: home\nenergy management, vehicle-2-grid communication, and SIP-based voice over IP\ntelephony. In all three domains, identity cards are used to reliably identify\nusers and authenticate participants. As an example for an electronic identity\ncard, this paper focuses on the German ePA.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2015 13:47:37 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Falk", "Rainer", ""], ["Fries", "Steffen", ""], ["Hof", "Hans-Joachim", ""]]}, {"id": "1506.07055", "submitter": "Christoph Pohl", "authors": "Christoph Pohl and Hans-Joachim Hof", "title": "The All-Seeing Eye: A Massive-Multi-Sensor Zero-Configuration Intrusion\n  Detection System for Web Applications", "comments": "SECURWARE 2013 : The Seventh International Conference on Emerging\n  Security Information, Systems and Technologies", "journal-ref": "SECURWARE 2013 : The Seventh International Conference on Emerging\n  Security Information, Systems and Technologies,2013,66-71", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Timing attacks are a challenge for current intrusion detection solutions.\nTiming attacks are dangerous for web applications because they may leak\ninformation about side channel vulnerabilities. This paper presents a\nmassive-multi-sensor zero-configuration Intrusion Detection System that is\nespecially good at detecting timing attacks. Unlike current solutions, the\nproposed Intrusion Detection System uses a huge number of sensors for attack\ndetection. These sensors include sensors automatically inserted into web\napplication or into the frameworks used to build web applications. With this\napproach the Intrusion Detection System is able to detect sophisticated attacks\nlike timing attacks or other brute-force attacks with increased accuracy. The\nproposed massive-multi-sensor zero-configuration intrusion detection system\ndoes not need specific knowledge about the system to protect, hence it offers\nzero-configuration capability.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2015 15:46:37 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Pohl", "Christoph", ""], ["Hof", "Hans-Joachim", ""]]}, {"id": "1506.07167", "submitter": "Hans-Joachim Hof", "authors": "Hans-Joachim Hof", "title": "User-Centric IT Security - How to Design Usable Security Mechanisms", "comments": "arXiv admin note: substantial text overlap with arXiv:1506.06987", "journal-ref": "The Fifth International Conference on Advances in Human-oriented\n  and Personalized Mechanisms, Technologies, and Services (CENTRIC 2012), pp.\n  7-12, November 2012", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, advanced security mechanisms exist to protect data, systems, and\nnetworks. Most of these mechanisms are effective, and security experts can\nhandle them to achieve a sufficient level of security for any given system.\nHowever, most of these systems have not been designed with focus on good\nusability for the average end user. Today, the average end user often struggles\nwith understanding and using security mechanisms. Other security mechanisms are\nsimply annoying for end users. As the overall security of any system is only as\nstrong as the weakest link in this system, bad usability of IT security\nmechanisms may result in operating errors, resulting in insecure systems.\nBuying decisions of end users may be affected by the usability of security\nmechanisms. Hence software providers may decide to better have no security\nmechanism then one with a bad usability. Usability of IT security mechanisms is\none of the most underestimated properties of applications and systems. Even IT\nsecurity itself is often only an afterthought. Hence, usability of security\nmechanisms is often the afterthought of an afterthought. Software developers\nare missing guidelines on how to build security mechanisms with good usability\nfor end users. This paper presents some guidelines that should help software\ndevelopers to improve end user usability of security-related mechanisms, and\nanalyzes common applications based on these guidelines.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2015 13:43:23 GMT"}], "update_date": "2015-06-25", "authors_parsed": [["Hof", "Hans-Joachim", ""]]}, {"id": "1506.07269", "submitter": "David Gil", "authors": "David Leon Gil", "title": "Distribution of elliptic twins over fixed finite fields: Numerical\n  results", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report numerical results, and describe plans for future experiments,\nrelated to the number of prime-order curves and \"elliptic twin\" curves over the\nprimes P-224, P-256, and P-384 standardized by NIST for cryptographic\napplications. Although these results are not sufficient to confirm the formula\nof Shparlinski and Sutantyo 2014 over these fields, they strongly suggest (~99%\nprobability) that the NIST curve P-384 was not chosen from a uniform\ndistribution over prime-order curves.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2015 07:42:44 GMT"}, {"version": "v2", "created": "Thu, 13 Aug 2015 03:40:22 GMT"}, {"version": "v3", "created": "Thu, 10 Sep 2015 01:40:15 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Gil", "David Leon", ""]]}, {"id": "1506.07367", "submitter": "Thomas Nyman", "authors": "Brian McGillion, Tanel Dettenborn, Thomas Nyman, N. Asokan", "title": "Open-TEE - An Open Virtual Trusted Execution Environment", "comments": "Author's version of article to appear in 14th IEEE International\n  Conference on Trust, Security and Privacy in Computing and Communications,\n  TrustCom 2015, Helsinki, Finland, August 20-22, 2015", "journal-ref": null, "doi": "10.1109/Trustcom.2015.400", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hardware-based Trusted Execution Environments (TEEs) are widely deployed in\nmobile devices. Yet their use has been limited primarily to applications\ndeveloped by the device vendors. Recent standardization of TEE interfaces by\nGlobalPlatform (GP) promises to partially address this problem by enabling\nGP-compliant trusted applications to run on TEEs from different vendors.\nNevertheless ordinary developers wishing to develop trusted applications face\nsignificant challenges. Access to hardware TEE interfaces are difficult to\nobtain without support from vendors. Tools and software needed to develop and\ndebug trusted applications may be expensive or non-existent.\n  In this paper, we describe Open-TEE, a virtual, hardware-independent TEE\nimplemented in software. Open-TEE conforms to GP specifications. It allows\ndevelopers to develop and debug trusted applications with the same tools they\nuse for developing software in general. Once a trusted application is fully\ndebugged, it can be compiled for any actual hardware TEE. Through performance\nmeasurements and a user study we demonstrate that Open-TEE is efficient and\neasy to use. We have made Open- TEE freely available as open source.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2015 13:59:20 GMT"}, {"version": "v2", "created": "Tue, 30 Jun 2015 11:31:38 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["McGillion", "Brian", ""], ["Dettenborn", "Tanel", ""], ["Nyman", "Thomas", ""], ["Asokan", "N.", ""]]}, {"id": "1506.07466", "submitter": "Jie Ding", "authors": "Jie Ding, Abdelmadjid Bouabdallah, and Vahid Tarokh", "title": "Key Pre-Distributions From Graph-Based Block Designs", "comments": "This manuscript was submitted to the IEEE Sensors Journal on March\n  13, 2015", "journal-ref": null, "doi": "10.1109/JSEN.2015.2501429", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the development of wireless communication technologies which\nconsiderably contributed to the development of wireless sensor networks (WSN),\nwe have witnessed an ever-increasing WSN based applications which induced a\nhost of research activities in both academia and industry. Since most of the\ntarget WSN applications are very sensitive, security issue is one of the major\nchallenges in the deployment of WSN. One of the important building blocks in\nsecuring WSN is key management. Traditional key management solutions developed\nfor other networks are not suitable for WSN since WSN networks are resource\n(e.g. memory, computation, energy) limited. Key pre-distribution algorithms\nhave recently evolved as efficient alternatives of key management in these\nnetworks. In the key pre-distribution systems, secure communication is achieved\nbetween a pair of nodes either by the existence of a key allowing for direct\ncommunication or by a chain of keys forming a key-path between the pair. In\nthis paper, we propose methods which bring prior knowledge of network\ncharacteristics and application constraints into the design of key\npre-distribution schemes, in order to provide better security and connectivity\nwhile requiring less resources. Our methods are based on casting the prior\ninformation as a graph. Motivated by this idea, we also propose a class of\nquasi-symmetric designs referred here to as g-designs. These produce key\npre-distribution schemes that significantly improve upon the existing\nconstructions based on unital designs. We give some examples, and point out\nopen problems for future research.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2015 16:57:36 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Ding", "Jie", ""], ["Bouabdallah", "Abdelmadjid", ""], ["Tarokh", "Vahid", ""]]}, {"id": "1506.07739", "submitter": "Thomas Nyman", "authors": "Thomas Nyman, Brian McGillion, N. Asokan", "title": "On Making Emerging Trusted Execution Environments Accessible to\n  Developers", "comments": "Author's version of article to appear in 8th Internation Conference\n  of Trust & Trustworthy Computing, TRUST 2015, Heraklion, Crete, Greece,\n  August 24-26, 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  New types of Trusted Execution Environment (TEE) architectures like TrustLite\nand Intel Software Guard Extensions (SGX) are emerging. They bring new features\nthat can lead to innovative security and privacy solutions. But each new TEE\nenvironment comes with its own set of interfaces and programming paradigms,\nthus raising the barrier for entry for developers who want to make use of these\nTEEs. In this paper, we motivate the need for realizing standard TEE interfaces\non such emerging TEE architectures and show that this exercise is not\nstraightforward. We report on our on-going work in mapping GlobalPlatform\nstandard interfaces to TrustLite and SGX.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2015 13:11:34 GMT"}, {"version": "v2", "created": "Tue, 30 Jun 2015 10:49:29 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Nyman", "Thomas", ""], ["McGillion", "Brian", ""], ["Asokan", "N.", ""]]}, {"id": "1506.08503", "submitter": "Jeremy Kepner", "authors": "Jeremy Kepner, Vijay Gadepally, Braden Hancock, Peter Michaleas,\n  Elizabeth Michel, Mayank Varia", "title": "Parallel Vectorized Algebraic AES in MATLAB for Rapid Prototyping of\n  Encrypted Sensor Processing Algorithms and Database Analytics", "comments": "6 pages; accepted to IEEE High Performance Extreme Computing\n  Conference (HPEC) 2015", "journal-ref": null, "doi": "10.1109/HPEC.2015.7322470", "report-no": null, "categories": "cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing use of networked sensor systems and networked databases has\nled to an increased interest in incorporating encryption directly into sensor\nalgorithms and database analytics. MATLAB is the dominant tool for rapid\nprototyping of sensor algorithms and has extensive database analytics\ncapabilities. The advent of high level and high performance Galois Field\nmathematical environments allows encryption algorithms to be expressed\nsuccinctly and efficiently. This work leverages the Galois Field primitives\nfound the MATLAB Communication Toolbox to implement a mode of the Advanced\nEncrypted Standard (AES) based on first principals mathematics. The resulting\nimplementation requires 100x less code than standard AES implementations and\ndelivers speed that is effective for many design purposes. The parallel version\nachieves speed comparable to native OpenSSL on a single node and is sufficient\nfor real-time prototyping of many sensor processing algorithms and database\nanalytics.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 04:34:40 GMT"}], "update_date": "2016-06-21", "authors_parsed": [["Kepner", "Jeremy", ""], ["Gadepally", "Vijay", ""], ["Hancock", "Braden", ""], ["Michaleas", "Peter", ""], ["Michel", "Elizabeth", ""], ["Varia", "Mayank", ""]]}, {"id": "1506.08546", "submitter": "Andrea Miele", "authors": "Andrea Miele", "title": "Buffer overflow vulnerabilities in CUDA: a preliminary analysis", "comments": "12 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a preliminary study of buffer overflow vulnerabilities in CUDA\nsoftware running on GPUs. We show how an attacker can overrun a buffer to\ncorrupt sensitive data or steer the execution flow by overwriting function\npointers, e.g., manipulating the virtual table of a C++ object. In view of a\npotential mass market diffusion of GPU accelerated software this may be a major\nconcern.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 08:53:29 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Miele", "Andrea", ""]]}, {"id": "1506.08548", "submitter": "Lei Zhang", "authors": "Lei Zhang, Qianhong Wu, Josep Domingo-Ferrer, Bo Qin, Chuanyan Hu", "title": "On the Security of MTA-OTIBASs (Multiple-TA One-Time Identity-Based\n  Aggregate Signatures)", "comments": "4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In [3] the authors proposed a new aggregate signature scheme referred to as\nmultiple-TA (trusted authority) one-time identity-based aggregate signature\n(MTA-OTIBAS). Further, they gave a concrete MTA-OTIBAS scheme. We recall here\nthe definition of MTA-OTIBAS and the concrete proposed scheme. Then we prove\nthat our MTA-OTIBAS concrete scheme is existentially unforgeable against\nadaptively chosen-message attacks in the random oracle model under the co-CDH\nproblem assumption.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 08:55:49 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Zhang", "Lei", ""], ["Wu", "Qianhong", ""], ["Domingo-Ferrer", "Josep", ""], ["Qin", "Bo", ""], ["Hu", "Chuanyan", ""]]}, {"id": "1506.08565", "submitter": "Hendrik Vogt", "authors": "Hendrik Vogt and Zohaib Hassan Awan and Aydin Sezgin", "title": "Full-Duplex vs. Half-Duplex Secret-Key Generation", "comments": "Extended version, submitted to IEEE Transactions on Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Full-duplex (FD) communication is regarded as a key technology in future 5G\nand Internet of Things (IoT) systems. In addition to high data rate\nconstraints, the success of these systems depends on the ability to allow for\nconfidentiality and security. Secret-key agreement from reciprocal wireless\nchannels can be regarded as a valuable supplement for security at the physical\nlayer. In this work, we study the role of FD communication in conjunction with\nsecret-key agreement. We first introduce two complementary key generation\nmodels for FD and half-duplex (HD) settings and compare the performance by\nintroducing the key-reconciliation function. Furthermore, we study the impact\nof the so called probing-reconciliation trade-off, the role of a strong\neavesdropper and analyze the system in the high SNR regime. We show that under\ncertain conditions, the FD mode enforces a deteriorating impact on the\ncapabilities of the eavesdropper and offers several advantages in terms of\nsecret-key rate over the conventional HD setups. Our analysis reveals as an\ninteresting insight that perfect self-interference cancellation is not\nnecessary in order to obtain performance gains over the HD mode.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 09:53:01 GMT"}, {"version": "v2", "created": "Wed, 20 Jan 2016 13:50:01 GMT"}], "update_date": "2016-01-21", "authors_parsed": [["Vogt", "Hendrik", ""], ["Awan", "Zohaib Hassan", ""], ["Sezgin", "Aydin", ""]]}, {"id": "1506.08865", "submitter": "Charith Perera", "authors": "Charith Perera, Rajiv Ranjan, Lizhe Wang", "title": "End-to-End Privacy for Open Big Data Markets", "comments": "Accepted to be published in IEEE Cloud Computing Magazine: Special\n  Issue Cloud Computing and the Law", "journal-ref": null, "doi": "10.1109/MCC.2015.78", "report-no": null, "categories": "cs.CY cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The idea of an open data market envisions the creation of a data trading\nmodel to facilitate exchange of data between different parties in the Internet\nof Things (IoT) domain. The data collected by IoT products and solutions are\nexpected to be traded in these markets. Data owners will collect data using IoT\nproducts and solutions. Data consumers who are interested will negotiate with\nthe data owners to get access to such data. Data captured by IoT products will\nallow data consumers to further understand the preferences and behaviours of\ndata owners and to generate additional business value using different\ntechniques ranging from waste reduction to personalized service offerings. In\nopen data markets, data consumers will be able to give back part of the\nadditional value generated to the data owners. However, privacy becomes a\nsignificant issue when data that can be used to derive extremely personal\ninformation is being traded. This paper discusses why privacy matters in the\nIoT domain in general and especially in open data markets and surveys existing\nprivacy-preserving strategies and design techniques that can be used to\nfacilitate end to end privacy for open data markets. We also highlight some of\nthe major research challenges that need to be address in order to make the\nvision of open data markets a reality through ensuring the privacy of\nstakeholders.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 21:11:32 GMT"}, {"version": "v2", "created": "Fri, 23 Oct 2015 22:04:55 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Perera", "Charith", ""], ["Ranjan", "Rajiv", ""], ["Wang", "Lizhe", ""]]}, {"id": "1506.08953", "submitter": "Sufian Hameed", "authors": "Sufian Hameed and Usman Ali", "title": "On the Efficacy of Live DDoS Detection with Hadoop", "comments": null, "journal-ref": null, "doi": "10.1109/NOMS.2016.7502848", "report-no": null, "categories": "cs.CR cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed Denial of Service flooding attacks are one of the biggest\nchallenges to the availability of online services today. These DDoS attacks\noverwhelm the victim with huge volume of traffic and render it incapable of\nperforming normal communication or crashes it completely. If there are delays\nin detecting the flooding attacks, nothing much can be done except to manually\ndisconnect the victim and fix the problem. With the rapid increase of DDoS\nvolume and frequency, the current DDoS detection technologies are challenged to\ndeal with huge attack volume in reasonable and affordable response time.\n  In this paper, we propose HADEC, a Hadoop based Live DDoS Detection framework\nto tackle efficient analysis of flooding attacks by harnessing MapReduce and\nHDFS. We implemented a counter-based DDoS detection algorithm for four major\nflooding attacks (TCP-SYN, HTTP GET, UDP and ICMP) in MapReduce, consisting of\nmap and reduce functions. We deployed a testbed to evaluate the performance of\nHADEC framework for live DDoS detection. Based on the experiments we showed\nthat HADEC is capable of processing and detecting DDoS attacks in affordable\ntime.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2015 06:35:59 GMT"}], "update_date": "2017-11-30", "authors_parsed": [["Hameed", "Sufian", ""], ["Ali", "Usman", ""]]}, {"id": "1506.09074", "submitter": "Vincent Primault", "authors": "Vincent Primault, Sonia Ben Mokhtar and Lionel Brunie", "title": "Privacy-preserving Publication of Mobility Data with High Utility", "comments": "2015 35th IEEE International Conference on Distributed Computed\n  Systems", "journal-ref": null, "doi": "10.1109/ICDCS.2015.117", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An increasing amount of mobility data is being collected every day by\ndifferent means, e.g., by mobile phone operators. This data is sometimes\npublished after the application of simple anonymization techniques, which might\nlead to severe privacy threats. We propose in this paper a new solution whose\nnovelty is twofold. Firstly, we introduce an algorithm designed to hide places\nwhere a user stops during her journey (namely points of interest), by enforcing\na constant speed along her trajectory. Secondly, we leverage places where users\nmeet to take a chance to swap their trajectories and therefore confuse an\nattacker.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2015 13:13:47 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Primault", "Vincent", ""], ["Mokhtar", "Sonia Ben", ""], ["Brunie", "Lionel", ""]]}]