[{"id": "1306.1740", "submitter": "Pankaj Choudhary", "authors": "Pankaj Choudhary, Rajendra Aaseri and Nirmal Roberts", "title": "HTTPI Based Web Service Security over SOAP", "comments": "International Journal of Network Security & Its Applications (IJNSA),\n  Vol.5, No.3, May 2013", "journal-ref": "Choudhary, P., Aaseri, R., Roberts, N., (2013) \"HTTPI Based Web\n  Service Security over SOAP\", IJNSA, Vol.5, No.3, on pp. 55-66", "doi": "10.5121/ijnsa.2013.5306", "report-no": null, "categories": "cs.CR cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Now a days, a new family of web applications open applications, are emerging\n(e.g., Social Networking, News and Blogging). Generally, these open\napplications are non-confidential. The security needs of these applications are\nonly client/server authentication and data integrity. For securing these open\napplications, effectively and efficiently, HTTPI, a new transport protocol is\nproposed, which ensures the entire security requirements of open applications.\nBenefit of using the HTTPI is that it is economical in use, well-suited for\ncache proxies, like HTTP is, and provides security against many Internet\nattacks (Server Impersonation and Message Modification) like HTTPS does. In\nterms of performance HTTPI is very close to the HTTP, but much better than\nHTTPS. A Web service is a method of communication between two ends over the\nInternet. These web services are developed over XML and HTTP. Today, most of\nthe open applications use web services for most of their operations. For\nsecuring these web services, security design based on HTTPI is proposed. Our\nwork involves securing the web services over SOAP, based on the HTTPI. This\nsecure web service might be applicable for open applications, where\nauthentication and integrity is needed, but no confidentiality required. In our\npaper, we introduce a web service security model based on HTTPI protocol over\nSOAP and develop a preliminary implementation of this model. We also analyze\nthe performance of our approach through an experiment and show that our\nproposed approach provides higher throughput, lower average response time and\nlower response size than HTTPS based web service security approach.\n", "versions": [{"version": "v1", "created": "Fri, 7 Jun 2013 15:07:58 GMT"}], "update_date": "2013-06-10", "authors_parsed": [["Choudhary", "Pankaj", ""], ["Aaseri", "Rajendra", ""], ["Roberts", "Nirmal", ""]]}, {"id": "1306.2413", "submitter": "EPTCS", "authors": "Luca Bortolussi (University of Trieste, Italy), Herbert Wiklicky\n  (Imperial College, London, UK)", "title": "Proceedings 11th International Workshop on Quantitative Aspects of\n  Programming Languages and Systems", "comments": null, "journal-ref": "EPTCS 117, 2013", "doi": "10.4204/EPTCS.117", "report-no": null, "categories": "cs.LO cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantitative aspects of computation are important and sometimes essential in\ncharacterising the behavior and determining the properties of systems. They are\nrelated to the use of physical quantities (storage space, time, bandwidth,\netc.) as well as mathematical quantities (e.g. probability and measures for\nreliability, security and trust). Such quantities play a central role in\ndefining both the model of systems (architecture, language design, semantics)\nand the methodologies and tools for the analysis and verification of system\nproperties. The aim of this workshop is to discuss the explicit use of\nquantitative information such as time and probabilities either directly in the\nmodel or as a tool for the analysis of systems.\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2013 03:36:49 GMT"}, {"version": "v2", "created": "Wed, 14 Aug 2013 18:20:50 GMT"}], "update_date": "2013-08-15", "authors_parsed": [["Bortolussi", "Luca", "", "University of Trieste, Italy"], ["Wiklicky", "Herbert", "", "Imperial College, London, UK"]]}, {"id": "1306.2425", "submitter": "Shantanu Pathak", "authors": "Shantanu Pathak and Ranjani S", "title": "Ber Performance Analysis of WiMAX PHY Layer under different channel\n  conditions", "comments": "19 pages, 12 figures", "journal-ref": "International Journal of Information Sciences and Techniques\n  (IJIST) Vol.3, No.3, May 2013", "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper gives an introduction on the IEEE 802.16 standard WIMAX or\nWorldwide Interoperability for Microwave Access. The different parts give\ndetails on the architectural specifications of WiMAX networks and also on the\nworking principle of WiMAX networks including its services provided. It also\nprovides brief descriptions on its salient features of this technology and how\nit benefits the networking industry. A brief outline of the basic building\nblocks or equipment of WiMAX architecture is also provided. This paper also\nevaluates the simulation performance of IEEE 802.16 OFDM PHY layer. The\nStanford University Interim (SUI) channel model under varying parameters is\nselected for the wireless channel in the simulation. The performance\nmeasurements and analysis was done in simulation developed in MATLAB.\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2013 05:40:23 GMT"}], "update_date": "2013-06-12", "authors_parsed": [["Pathak", "Shantanu", ""], ["S", "Ranjani", ""]]}, {"id": "1306.3302", "submitter": "Leonid Yavits", "authors": "Leonid Yavits, Amir Morad, Ran Ginosar", "title": "The Effect of Communication and Synchronization on Amdahl Law in\n  Multicore Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work analyses the effects of sequential-to-parallel synchronization and\ninter-core communication on multicore performance, speedup and scaling. A\nmodification of Amdahl law is formulated, to reflect the finding that parallel\nspeedup is lower than originally predicted, due to these effects. In\napplications with high inter-core communication requirements, the workload\nshould be executed on a small number of cores, and applications of high\nsequential-to-parallel synchronization requirements may better be executed by\nthe sequential core, even when f, the Amdahl fraction of parallelization, is\nvery close to 1. To improve the scalability and performance speedup of a\nmulticore, it is as important to address the synchronization and connectivity\nintensities of parallel algorithms as their parallelization factor.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2013 06:20:44 GMT"}], "update_date": "2013-06-17", "authors_parsed": [["Yavits", "Leonid", ""], ["Morad", "Amir", ""], ["Ginosar", "Ran", ""]]}, {"id": "1306.3513", "submitter": "Zizhuo Wang", "authors": "Yuhang Liu and Zizhuo Wang", "title": "A Simple Policy for Multiple Queues with Size-Independent Service Times", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a service system with two Poisson arrival queues. A server\nchooses which queue to serve at each moment. Once a queue is served, all the\ncustomers will be served within a fixed amount of time. This model is useful in\nstudying airport shuttling or certain online computing systems. We propose a\nsimple yet optimal state-independent policy for this problem which is not only\neasy to implement, but also performs very well.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2013 20:55:54 GMT"}, {"version": "v2", "created": "Mon, 1 Jul 2013 18:59:31 GMT"}], "update_date": "2013-07-02", "authors_parsed": [["Liu", "Yuhang", ""], ["Wang", "Zizhuo", ""]]}, {"id": "1306.4773", "submitter": "Yuming Jiang", "authors": "Yuming Jiang", "title": "Performance Bounds for Multiclass FIFO in Communication Networks: A\n  Deterministic Case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiclass FIFO is used in communication networks such as in input-queueing\nrouters/switches and in wireless networks. For the concern of providing service\nguarantees in such networks, it is crucial to have analytical results, e.g.\nbounds, on the performance of multi-class FIFO. Surprisingly, there are few\nsuch results in the literature. This paper is devoted to filling the gap.\nSpecifically, a single hop deterministic case is studied, for which, delay and\nbacklog bounds are derived, in addition to guaranteed rate and service curve\ncharacterizations that may be exploited to extend the analysis to network\ncases.\n", "versions": [{"version": "v1", "created": "Thu, 20 Jun 2013 07:28:39 GMT"}], "update_date": "2013-06-21", "authors_parsed": [["Jiang", "Yuming", ""]]}]