[{"id": "1010.0201", "submitter": "Andrei A. Bulatov", "authors": "Andrei A. Bulatov (Simon Fraser University), Daniel Marx (Tel Aviv\n  University)", "title": "The complexity of global cardinality constraints", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 6, Issue 4 (October\n  27, 2010) lmcs:1025", "doi": "10.2168/LMCS-6(4:4)2010", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a constraint satisfaction problem (CSP) the goal is to find an assignment\nof a given set of variables subject to specified constraints. A global\ncardinality constraint is an additional requirement that prescribes how many\nvariables must be assigned a certain value. We study the complexity of the\nproblem CCSP(G), the constraint satisfaction problem with global cardinality\nconstraints that allows only relations from the set G. The main result of this\npaper characterizes sets G that give rise to problems solvable in polynomial\ntime, and states that the remaining such problems are NP-complete.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 16:34:32 GMT"}, {"version": "v2", "created": "Wed, 27 Oct 2010 09:53:55 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Bulatov", "Andrei A.", "", "Simon Fraser University"], ["Marx", "Daniel", "", "Tel Aviv\n  University"]]}, {"id": "1010.0225", "submitter": "Andreas Witzel", "authors": "Andreas Witzel", "title": "Characterizing perfect recall using next-step temporal operators in S5\n  and sub-S5 Epistemic Temporal Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We review the notion of perfect recall in the literature on interpreted\nsystems, game theory, and epistemic logic. In the context of Epistemic Temporal\nLogic (ETL), we give a (to our knowledge) novel frame condition for perfect\nrecall, which is local and can straightforwardly be translated to a defining\nformula in a language that only has next-step temporal operators. This frame\ncondition also gives rise to a complete axiomatization for S5 ETL frames with\nperfect recall. We then consider how to extend and consolidate the notion of\nperfect recall in sub-S5 settings, where the various notions discussed are no\nlonger equivalent.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 18:02:05 GMT"}, {"version": "v2", "created": "Mon, 14 Mar 2011 16:02:08 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Witzel", "Andreas", ""]]}, {"id": "1010.1066", "submitter": "Marc de Falco", "authors": "Marc de Falco (CNRS)", "title": "An Explicit Framework for Interaction Nets", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 6, Issue 4 (December\n  12, 2010) lmcs:1108", "doi": "10.2168/LMCS-6(4:6)2010", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interaction nets are a graphical formalism inspired by Linear Logic\nproof-nets often used for studying higher order rewriting e.g. \\Beta-reduction.\nTraditional presentations of interaction nets are based on graph theory and\nrely on elementary properties of graph theory. We give here a more explicit\npresentation based on notions borrowed from Girard's Geometry of Interaction:\ninteraction nets are presented as partial permutations and a composition of\nnets, the gluing, is derived from the execution formula. We then define\ncontexts and reduction as the context closure of rules. We prove strong\nconfluence of the reduction within our framework and show how interaction nets\ncan be viewed as the quotient of some generalized proof-nets.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 05:33:18 GMT"}, {"version": "v2", "created": "Mon, 13 Dec 2010 10:29:18 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["de Falco", "Marc", "", "CNRS"]]}, {"id": "1010.1139", "submitter": "Thomas Zeume", "authors": "Ahmet Kara, Thomas Schwentick and Thomas Zeume", "title": "Temporal Logics on Words with Multiple Data Values", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper proposes and studies temporal logics for attributed words, that is,\ndata words with a (finite) set of (attribute,value)-pairs at each position. It\nconsiders a basic logic which is a semantical fragment of the logic\n$LTL^\\downarrow_1$ of Demri and Lazic with operators for navigation into the\nfuture and the past. By reduction to the emptiness problem for data automata it\nis shown that this basic logic is decidable. Whereas the basic logic only\nallows navigation to positions where a fixed data value occurs, extensions are\nstudied that also allow navigation to positions with different data values.\nBesides some undecidable results it is shown that the extension by a certain\nUNTIL-operator with an inequality target condition remains decidable.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 12:46:33 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Kara", "Ahmet", ""], ["Schwentick", "Thomas", ""], ["Zeume", "Thomas", ""]]}, {"id": "1010.1602", "submitter": "Ist Inria Nancy Grand Est", "authors": "Johannes Faber, Carsten Ihlemann (MPII), Swen Jacobs (EPFL), Viorica\n  Sofronie-Stokkermans (MPII)", "title": "Automatic Verification of Parametric Specifications with Complex\n  Topologies", "comments": "The original publication is available at http://www.springerlink.com", "journal-ref": "Integrated Formal Methods - IFM 2010, Nancy : France (2010)", "doi": "10.1007/978-3-642-16265-7_12", "report-no": null, "categories": "cs.SE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The focus of this paper is on reducing the complexity in verification by\nexploiting modularity at various levels: in specification, in verification, and\nstructurally. For specifications, we use the modular language CSP-OZ-DC, which\nallows us to decouple verification tasks concerning data from those concerning\ndurations. At the verification level, we exploit modularity in theorem proving\nfor rich data structures and use this for invariant checking. At the structural\nlevel, we analyze possibilities for modular verification of systems consisting\nof various components which interact.We illustrate these ideas by automatically\nverifying safety properties of a case study from the European Train Control\nSystem standard, which extends previous examples by comprising a complex track\ntopology with lists of track segments and trains with different routes.\n", "versions": [{"version": "v1", "created": "Fri, 8 Oct 2010 06:08:02 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Faber", "Johannes", "", "MPII"], ["Ihlemann", "Carsten", "", "MPII"], ["Jacobs", "Swen", "", "EPFL"], ["Sofronie-Stokkermans", "Viorica", "", "MPII"]]}, {"id": "1010.1872", "submitter": "Silvio Ranise", "authors": "Silvio Ghilardi (Dipartimento di Scienze dell'Informazione, Univ.\n  degli Studi di Milano (Italy)), Silvio Ranise (FBK-Irst, Trento (Italy))", "title": "Backward Reachability of Array-based Systems by SMT solving: Termination\n  and Invariant Synthesis", "comments": "Accepted for publication in Logical Methods in Computer Science", "journal-ref": "Logical Methods in Computer Science, Volume 6, Issue 4 (December\n  21, 2010) lmcs:966", "doi": "10.2168/LMCS-6(4:10)2010", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The safety of infinite state systems can be checked by a backward\nreachability procedure. For certain classes of systems, it is possible to prove\nthe termination of the procedure and hence conclude the decidability of the\nsafety problem. Although backward reachability is property-directed, it can\nunnecessarily explore (large) portions of the state space of a system which are\nnot required to verify the safety property under consideration. To avoid this,\ninvariants can be used to dramatically prune the search space. Indeed, the\nproblem is to guess such appropriate invariants. In this paper, we present a\nfully declarative and symbolic approach to the mechanization of backward\nreachability of infinite state systems manipulating arrays by Satisfiability\nModulo Theories solving. Theories are used to specify the topology and the data\nmanipulated by the system. We identify sufficient conditions on the theories to\nensure the termination of backward reachability and we show the completeness of\na method for invariant synthesis (obtained as the dual of backward\nreachability), again, under suitable hypotheses on the theories. We also\npresent a pragmatic approach to interleave invariant synthesis and backward\nreachability so that a fix-point for the set of backward reachable states is\nmore easily obtained. Finally, we discuss heuristics that allow us to derive an\nimplementation of the techniques in the model checker MCMT, showing remarkable\nspeed-ups on a significant set of safety problems extracted from a variety of\nsources.\n", "versions": [{"version": "v1", "created": "Sat, 9 Oct 2010 21:04:26 GMT"}, {"version": "v2", "created": "Tue, 21 Dec 2010 21:56:57 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Ghilardi", "Silvio", "", "Dipartimento di Scienze dell'Informazione, Univ.\n  degli Studi di Milano"], ["Ranise", "Silvio", "", "FBK-Irst, Trento"]]}, {"id": "1010.2287", "submitter": "Omar Bataineh", "authors": "Omar I. Al-Bataineh and Ron van der Meyden", "title": "Abstraction for Epistemic Model Checking of Dining Cryptographers-based\n  Protocols", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper describes an abstraction for protocols that are based on multiple\nrounds of Chaum's Dining Cryptographers protocol. It is proved that the\nabstraction preserves a rich class of specifications in the logic of knowledge,\nincluding specifications describing what an agent knows about other agents'\nknowledge. This result can be used to optimize model checking of Dining\nCryptographers-based protocols, and applied within a methodology for\nknowledge-based program implementation and verification. Some case studies of\nsuch an application are given, for a protocol that uses the Dining\nCryptographers protocol as a primitive in an anonymous broadcast system.\nPerformance results are given for model checking knowledge-based specifications\nin the concrete and abstract models of this protocol, and some new conclusions\nabout the protocol are derived.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 02:45:37 GMT"}], "update_date": "2010-10-13", "authors_parsed": [["Al-Bataineh", "Omar I.", ""], ["van der Meyden", "Ron", ""]]}, {"id": "1010.2396", "submitter": "Matthias Schr\\\"oder", "authors": "Matthias Schroeder", "title": "N^N^N does not satisfy Normann's condition", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that the Kleene-Kreisel space $N^N^N$ does not satisfy Normann's\ncondition. A topological space $X$ is said to fulfil Normann's condition, if\nevery functionally closed subset of $X$ is an intersection of clopen sets. The\ninvestigation of this property is motivated by its strong relationship to a\nproblem in Computable Analysis. D. Normann has proved that in order to\nestablish non-coincidence of the extensional hierarchy and the intensional\nhierarchy of functionals over the reals it is enough to show that $N^N^N$ fails\nthe above condition.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 14:15:08 GMT"}], "update_date": "2010-10-13", "authors_parsed": [["Schroeder", "Matthias", ""]]}, {"id": "1010.2420", "submitter": "Nathanael Fijalkow", "authors": "Nathana\\\"el Fijalkow (LIAFA), Florian Horn (LIAFA)", "title": "The surprizing complexity of generalized reachability games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Games on graphs provide a natural and powerful model for reactive systems. In\nthis paper, we consider generalized reachability objectives, defined as\nconjunctions of reachability objectives. We first prove that deciding the\nwinner in such games is $\\PSPACE$-complete, although it is fixed-parameter\ntractable with the number of reachability objectives as parameter. Moreover, we\nconsider the memory requirements for both players and give matching upper and\nlower bounds on the size of winning strategies. In order to allow more\nefficient algorithms, we consider subclasses of generalized reachability games.\nWe show that bounding the size of the reachability sets gives two natural\nsubclasses where deciding the winner can be done efficiently.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 15:27:15 GMT"}, {"version": "v2", "created": "Fri, 3 Feb 2012 07:35:03 GMT"}], "update_date": "2012-02-06", "authors_parsed": [["Fijalkow", "Nathanaël", "", "LIAFA"], ["Horn", "Florian", "", "LIAFA"]]}, {"id": "1010.2595", "submitter": "Marie Ferbus-Zanda", "authors": "Marie Ferbus-Zanda (LIAFA)", "title": "Kolmogorov Complexity in perspective. Part II: Classification,\n  Information Processing and Duality", "comments": "43 pages", "journal-ref": "Synthese / Synth\\`ese (2010) 00", "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.IT math.IT physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey diverse approaches to the notion of information: from Shannon\nentropy to Kolmogorov complexity. Two of the main applications of Kolmogorov\ncomplexity are presented: randomness and classification. The survey is divided\nin two parts published in a same volume. Part II is dedicated to the relation\nbetween logic and information system, within the scope of Kolmogorov\nalgorithmic information theory. We present a recent application of Kolmogorov\ncomplexity: classification using compression, an idea with provocative\nimplementation by authors such as Bennett, Vitanyi and Cilibrasi. This stresses\nhow Kolmogorov complexity, besides being a foundation to randomness, is also\nrelated to classification. Another approach to classification is also\nconsidered: the so-called \"Google classification\". It uses another original and\nattractive idea which is connected to the classification using compression and\nto Kolmogorov complexity from a conceptual point of view. We present and unify\nthese different approaches to classification in terms of Bottom-Up versus\nTop-Down operational modes, of which we point the fundamental principles and\nthe underlying duality. We look at the way these two dual modes are used in\ndifferent approaches to information system, particularly the relational model\nfor database introduced by Codd in the 70's. This allows to point out diverse\nforms of a fundamental duality. These operational modes are also reinterpreted\nin the context of the comprehension schema of axiomatic set theory ZF. This\nleads us to develop how Kolmogorov's complexity is linked to intensionality,\nabstraction, classification and information system.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 08:35:24 GMT"}], "update_date": "2010-10-15", "authors_parsed": [["Ferbus-Zanda", "Marie", "", "LIAFA"]]}, {"id": "1010.2597", "submitter": "Marie Ferbus-Zanda", "authors": "Marie Ferbus-Zanda (LIAFA), Serge Grigorieff (LIAFA)", "title": "ASMs and Operational Algorithmic Completeness of Lambda Calculus", "comments": "37 pages", "journal-ref": "Lecture notes in computer science LNCS 6300 (2010) 00", "doi": null, "report-no": null, "categories": "cs.LO cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that lambda calculus is a computation model which can step by step\nsimulate any sequential deterministic algorithm for any computable function\nover integers or words or any datatype. More formally, given an algorithm above\na family of computable functions (taken as primitive tools, i.e., kind of\noracle functions for the algorithm), for every constant K big enough, each\ncomputation step of the algorithm can be simulated by exactly K successive\nreductions in a natural extension of lambda calculus with constants for\nfunctions in the above considered family. The proof is based on a fixed point\ntechnique in lambda calculus and on Gurevich sequential Thesis which allows to\nidentify sequential deterministic algorithms with Abstract State Machines. This\nextends to algorithms for partial computable functions in such a way that\nfinite computations ending with exceptions are associated to finite reductions\nleading to terms with a particular very simple feature.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 08:38:10 GMT"}], "update_date": "2010-10-15", "authors_parsed": [["Ferbus-Zanda", "Marie", "", "LIAFA"], ["Grigorieff", "Serge", "", "LIAFA"]]}, {"id": "1010.2826", "submitter": "EPTCS", "authors": "Meriem Ouederni (University of Malaga, Spain), Gwen Sala\\\"un (Grenoble\n  INP, INRIA-Grenoble, LIG)", "title": "Tau Be or not Tau Be? - A Perspective on Service Compatibility and\n  Substitutability", "comments": "In Proceedings WCSI 2010, arXiv:1010.2337", "journal-ref": "EPTCS 37, 2010, pp. 57-70", "doi": "10.4204/EPTCS.37.5", "report-no": null, "categories": "cs.SE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the main open research issues in Service Oriented Computing is to\npropose automated techniques to analyse service interfaces. A first problem,\ncalled compatibility, aims at determining whether a set of services (two in\nthis paper) can be composed together and interact with each other as expected.\nAnother related problem is to check the substitutability of one service with\nanother. These problems are especially difficult when behavioural descriptions\n(i.e., message calls and their ordering) are taken into account in service\ninterfaces. Interfaces should capture as faithfully as possible the service\nbehaviour to make their automated analysis possible while not exhibiting\nimplementation details. In this position paper, we choose Labelled Transition\nSystems to specify the behavioural part of service interfaces. In particular,\nwe show that internal behaviours (tau transitions) are necessary in these\ntransition systems in order to detect subtle errors that may occur when\ncomposing a set of services together. We also show that tau transitions should\nbe handled differently in the compatibility and substitutability problem: the\nformer problem requires to check if the compatibility is preserved every time a\ntau transition is traversed in one interface, whereas the latter requires a\nprecise analysis of tau branchings in order to make the substitution preserve\nthe properties (e.g., a compatibility notion) which were ensured before\nreplacement.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 05:16:24 GMT"}], "update_date": "2010-10-15", "authors_parsed": [["Ouederni", "Meriem", "", "University of Malaga, Spain"], ["Salaün", "Gwen", "", "Grenoble\n  INP, INRIA-Grenoble, LIG"]]}, {"id": "1010.3039", "submitter": "Maria Monks", "authors": "Maria Monks", "title": "Closure properties of predicates recognized by deterministic and\n  non-deterministic asynchronous automata", "comments": "22 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let A be a finite alphabet and let L contained in (A*)^n be an n-variable\nlanguage over A. We say that L is regular if it is the language accepted by a\nsynchronous n-tape finite state automaton, it is quasi-regular if it is\naccepted by an asynchronous n-tape automaton, and it is weakly regular if it is\naccepted by a non-deterministic asynchronous n-tape automaton. We investigate\nthe closure properties of the classes of regular, quasi-regular, and weakly\nregular languages under first-order logic, and apply these observations to an\nopen decidability problem in automatic group theory.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 22:27:45 GMT"}], "update_date": "2010-10-18", "authors_parsed": [["Monks", "Maria", ""]]}, {"id": "1010.3201", "submitter": "Marie Ferbus-Zanda", "authors": "Marie Ferbus-Zanda (LIAFA), Serge Grigorieff (LIAFA)", "title": "Kolmogorov Complexity in perspective. Part I: Information Theory and\n  Randomnes", "comments": "40 pages", "journal-ref": "Synthese / Synth\\`ese (2010) 00", "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey diverse approaches to the notion of information: from Shannon\nentropy to Kolmogorov complexity. Two of the main applications of Kolmogorov\ncomplexity are presented: randomness and classification. The survey is divided\nin two parts in the same volume. Part I is dedicated to information theory and\nthe mathematical formalization of randomness based on Kolmogorov complexity.\nThis last application goes back to the 60's and 70's with the work of\nMartin-L\\\"of, Schnorr, Chaitin, Levin, and has gained new impetus in the last\nyears.\n", "versions": [{"version": "v1", "created": "Fri, 15 Oct 2010 15:58:13 GMT"}], "update_date": "2010-10-20", "authors_parsed": [["Ferbus-Zanda", "Marie", "", "LIAFA"], ["Grigorieff", "Serge", "", "LIAFA"]]}, {"id": "1010.3674", "submitter": "Alban Ponse", "authors": "Jan A. Bergstra, A. Ponse, D.J.C. Staudt", "title": "Short-circuit logic", "comments": "59 pages, 7 tables, 3 figures; Daan Staudt is added as an extra\n  author; normal forms for FSCL are defined and completeness of its\n  axiomatization is proved", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Short-circuit evaluation denotes the semantics of propositional connectives\nin which the second argument is evaluated only if the first argument does not\nsuffice to determine the value of the expression. In programming, short-circuit\nevaluation is widely used, with sequential conjunction and disjunction as\nprimitive connectives.\n  A short-circuit logic is a variant of propositional logic (PL) that can be\ndefined with help of Hoare's conditional, a ternary connective comparable to\nif-then-else, and that implies all identities that follow from four basic\naxioms for the conditional and can be expressed in PL (e.g., axioms for\nassociativity of conjunction and double negation shift). In the absence of side\neffects, short-circuit evaluation characterizes PL. However, short-circuit\nevaluation admits the possibility to model side effects and gives rise to\nvarious different short-circuit logics. The first extreme case is FSCL (free\nshort-circuit logic), which characterizes the setting in which evaluation of\neach atom (propositional variable) can yield a side effect. The other extreme\ncase is MSCL (memorizing short-circuit logic), the most identifying variant we\ndistinguish below PL. In MSCL, only a very restricted type of side effects can\nbe modelled, while sequential conjunction is non-commutative. We provide\naxiomatizations for FSCL and MSCL.\n  Extending MSCL with one simple axiom yields SSCL (static short-circuit logic,\nor sequential PL), for which we also provide a completeness result. We briefly\ndiscuss two variants in between FSCL and MSCL, among which a logic that admits\ncontraction of atoms and of their negations.\n", "versions": [{"version": "v1", "created": "Mon, 18 Oct 2010 18:42:04 GMT"}, {"version": "v2", "created": "Mon, 29 Nov 2010 07:28:49 GMT"}, {"version": "v3", "created": "Mon, 27 Jun 2011 13:14:59 GMT"}, {"version": "v4", "created": "Tue, 12 Mar 2013 15:03:14 GMT"}], "update_date": "2013-03-13", "authors_parsed": [["Bergstra", "Jan A.", ""], ["Ponse", "A.", ""], ["Staudt", "D. J. C.", ""]]}, {"id": "1010.4422", "submitter": "Roberto Sebastiani", "authors": "Alberto Griggio (FBK-Irst, Trento, Italy), Thi Thieu Hoa Le (DISI,\n  University of Trento, Italy), Roberto Sebastiani (DISI, University of Trento,\n  Italy)", "title": "Efficient Interpolant Generation in Satisfiability Modulo Linear Integer\n  Arithmetic", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 8, Issue 3 (August 10,\n  2012) lmcs:1033", "doi": "10.2168/LMCS-8(3:3)2012", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of computing Craig interpolants in SAT and SMT has recently\nreceived a lot of interest, mainly for its applications in formal verification.\nEfficient algorithms for interpolant generation have been presented for some\ntheories of interest ---including that of equality and uninterpreted functions,\nlinear arithmetic over the rationals, and their combination--- and they are\nsuccessfully used within model checking tools. For the theory of linear\narithmetic over the integers (LA(Z)), however, the problem of finding an\ninterpolant is more challenging, and the task of developing efficient\ninterpolant generators for the full theory LA(Z) is still the objective of\nongoing research. In this paper we try to close this gap. We build on previous\nwork and present a novel interpolation algorithm for SMT(LA(Z)), which exploits\nthe full power of current state-of-the-art SMT(LA(Z)) solvers. We demonstrate\nthe potential of our approach with an extensive experimental evaluation of our\nimplementation of the proposed algorithm in the MathSAT SMT solver.\n", "versions": [{"version": "v1", "created": "Thu, 21 Oct 2010 10:54:34 GMT"}, {"version": "v2", "created": "Mon, 25 Jun 2012 15:13:02 GMT"}, {"version": "v3", "created": "Thu, 9 Aug 2012 08:07:17 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Griggio", "Alberto", "", "FBK-Irst, Trento, Italy"], ["Le", "Thi Thieu Hoa", "", "DISI,\n  University of Trento, Italy"], ["Sebastiani", "Roberto", "", "DISI, University of Trento,\n  Italy"]]}, {"id": "1010.4423", "submitter": "Dominik Steenken", "authors": "Dominik Steenken (1) and Heike Wehrheim (1) and Daniel Wonisch (1)\n  ((1) University of Paderborn)", "title": "Towards A Shape Analysis for Graph Transformation Systems", "comments": "17 pages, 7 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graphs and graph transformation systems are a frequently used modelling\ntechnique for a wide range of different domains, cover- ing areas as diverse as\nrefactorings, network topologies or reconfigurable software. Being a formal\nmethod, graph transformation systems lend themselves to a formal analysis. This\nhas inspired the development of various verification methods, in particular\nalso model checking tools. In this paper, we present a verification technique\nfor infinite-state graph transformation systems. The technique employs the\nabstraction principle used in shape analysis of programs, summarising possibly\ninfinitely many nodes thus giving shape graphs. The technique has been\nimplemented using the 3-valued logical foundations of standard shape analysis.\nWe exemplify the approach on an example from the railway domain.\n", "versions": [{"version": "v1", "created": "Thu, 21 Oct 2010 10:54:54 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Steenken", "Dominik", "", "University of Paderborn"], ["Wehrheim", "Heike", "", "University of Paderborn"], ["Wonisch", "Daniel", "", "University of Paderborn"]]}, {"id": "1010.4529", "submitter": "Jakub Michaliszyn", "authors": "Jerzy Marcinkowski, Jakub Michaliszyn", "title": "The Last Paper on the Halpern-Shoham Interval Temporal Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Halpern-Shoham logic is a modal logic of time intervals. Some effort has\nbeen put in last ten years to classify fragments of this beautiful logic with\nrespect to decidability of its satisfiability problem. We contribute to this\neffort by showing - what we believe is quite an unexpected result - that the\nlogic of subintervals, the fragment of the Halpern-Shoham where only the\noperator \"during\", or D, is allowed, is undecidable over discrete structures.\nThis is surprising as this logic is decidable over dense orders and its\nreflexive variant is known to be decidable over discrete structures.\n", "versions": [{"version": "v1", "created": "Thu, 21 Oct 2010 17:30:06 GMT"}], "update_date": "2010-10-22", "authors_parsed": [["Marcinkowski", "Jerzy", ""], ["Michaliszyn", "Jakub", ""]]}, {"id": "1010.4672", "submitter": "Antoine Girard", "authors": "Antoine Girard", "title": "Controller Synthesis for Safety and Reachability via Approximate\n  Bisimulation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.LO math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the problem of controller design using\napproximately bisimilar abstractions with an emphasis on safety and\nreachability specifications. We propose abstraction-based approaches to solve\nboth classes of problems. We start by synthesizing a controller for an\napproximately bisimilar abstraction. Then, using a concretization procedure, we\nobtain a controller for our initial system that is proved \"correct by design\".\nWe provide guarantees of performance by giving estimates of the distance of the\nsynthesized controller to the maximal (i.e the most permissive) safety\ncontroller or to the time-optimal reachability controller. Finally, we use the\npresented techniques combined with discrete approximately bisimilar\nabstractions of switched systems developed recently, for switching controller\nsynthesis.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 11:13:12 GMT"}, {"version": "v2", "created": "Thu, 16 Jun 2011 09:37:43 GMT"}], "update_date": "2011-06-17", "authors_parsed": [["Girard", "Antoine", ""]]}, {"id": "1010.4786", "submitter": "Luca Vigan\\`o", "authors": "Matteo Cristani and Erisa Karafili and Luca Vigan\\`o", "title": "Blocking Underhand Attacks by Hidden Coalitions (Extended Version)", "comments": "13 pages, short version in Proceedings of ICAART 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Similar to what happens between humans in the real world, in open multi-agent\nsystems distributed over the Internet, such as online social networks or wiki\ntechnologies, agents often form coalitions by agreeing to act as a whole in\norder to achieve certain common goals. However, agent coalitions are not always\na desirable feature of a system, as malicious or corrupt agents may collaborate\nin order to subvert or attack the system. In this paper, we consider the\nproblem of hidden coalitions, whose existence and the purposes they aim to\nachieve are not known to the system, and which carry out so-called underhand\nattacks. We give a first approach to hidden coalitions by introducing a\ndeterministic method that blocks the actions of potentially dangerous agents,\ni.e. possibly belonging to such coalitions. We also give a non-deterministic\nversion of this method that blocks the smallest set of potentially dangerous\nagents. We calculate the computational cost of our two blocking methods, and\nprove their soundness and completeness.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 19:37:21 GMT"}, {"version": "v2", "created": "Tue, 26 Oct 2010 12:55:08 GMT"}], "update_date": "2010-10-27", "authors_parsed": [["Cristani", "Matteo", ""], ["Karafili", "Erisa", ""], ["Viganò", "Luca", ""]]}, {"id": "1010.4953", "submitter": "Soumyadip Bandyopadhyay", "authors": "Soumyadip Bandyopadhyay", "title": "Equivalence Checking in Embedded Systems Design Verification using PRES+\n  model", "comments": "i want to replace the previous report, arXiv:1007.2131, by this\n  report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we focus on some aspects related to modeling and formal\nverification of embedded systems. Many models have been proposed to represent\nembedded systems. These models encompass a broad range of styles,\ncharacteristics, and application domains and include the extensions of finite\nstate machines, data flow graphs, communication processes and Petri nets. In\nthis report, we have used a PRES+ model (Petri net based Representation for\nEmbedded Systems) as an extension of classical Petri net model that captures\nconcurrency, timing behaviour of embedded systems; it allows systems to be\nrepresentative in different levels of abstraction and improves expressiveness\nby allowing the token to carry information. Modeling using PRES+, as discussed\nabove, may be convenient for specifying the input behaviour because it supports\nconcurrency. However, there is no equivalence checking method reported in the\nliterature for PRES+ models to the best of our knowledge. In contrast,\nequivalence checking of FSMD models exist. As a first step, therefore, we seek\nto devise an algorithm to translate PRES+ models to FSMD models and we seek to\nhand execute our algorithm on a real life example and we have to translate two\nversions of PRES+ models to FSMD models. Then using existing equivalence\nchecker we have checked the equivalence between two FSMD models.\n", "versions": [{"version": "v1", "created": "Sun, 24 Oct 2010 12:12:10 GMT"}], "update_date": "2010-10-26", "authors_parsed": [["Bandyopadhyay", "Soumyadip", ""]]}, {"id": "1010.5308", "submitter": "EPTCS", "authors": "Simon Bliudze, Roberto Bruni, Davide Grohmann, Alexandra Silva", "title": "Proceedings Third Interaction and Concurrency Experience: Guaranteed\n  Interaction", "comments": null, "journal-ref": "EPTCS 38, 2010", "doi": "10.4204/EPTCS.38", "report-no": null, "categories": "cs.LO cs.DC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 3rd Interaction and Concurrency\nExperience (ICE 2010) workshop, which was held in Amsterdam, Netherlands on\n10th of June 2010 as a satellite event of DisCoTec'10. Each year, the workshop\nfocuses on a specific topic: the topic of ICE 2010 was Guaranteed Interactions,\nby which we mean, for example, guaranteeing safety, reactivity, quality of\nservice or satisfaction of analysis hypotheses.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 03:39:19 GMT"}], "update_date": "2010-10-27", "authors_parsed": [["Bliudze", "Simon", ""], ["Bruni", "Roberto", ""], ["Grohmann", "Davide", ""], ["Silva", "Alexandra", ""]]}, {"id": "1010.5565", "submitter": "EPTCS", "authors": "Christian Lambertz (University of Mannheim), Mila Majster-Cederbaum\n  (University of Mannheim)", "title": "Port Protocols for Deadlock-Freedom of Component Systems", "comments": "In Proceedings ICE 2010, arXiv:1010.5308", "journal-ref": "EPTCS 38, 2010, pp. 7-11", "doi": "10.4204/EPTCS.38.3", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In component-based development, approaches for property verification exist\nthat avoid building the global system behavior of the component model.\nTypically, these approaches rely on the analysis of the local behavior of fixed\nsized subsystems of components. In our approach, we want to avoid not only the\nanalysis of the global behavior but also of the local behaviors of the\ncomponents. Instead, we consider very small parts of the local behaviors called\nport protocols that suffice to verify properties.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 05:04:07 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Lambertz", "Christian", "", "University of Mannheim"], ["Majster-Cederbaum", "Mila", "", "University of Mannheim"]]}, {"id": "1010.5566", "submitter": "EPTCS", "authors": "Marco Carbone (IT University of Copenhagen), S{\\o}ren Debois (IT\n  University of Copenhagen)", "title": "A Graphical Approach to Progress for Structured Communication in Web\n  Services", "comments": "In Proceedings ICE 2010, arXiv:1010.5308", "journal-ref": "EPTCS 38, 2010, pp. 13-27", "doi": "10.4204/EPTCS.38.4", "report-no": null, "categories": "cs.PL cs.LO cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a graphical representation of session invocation\ninterdependency in order to prove progress for the pi-calculus with sessions\nunder the usual session typing discipline. We show that those processes whose\nassociated dependency graph is acyclic can be brought to reduce. We call such\nprocesses transparent processes. Additionally, we prove that for well-typed\nprocesses where services contain no free names, such acyclicity is preserved by\nthe reduction semantics.\n  Our results encompass programs (processes containing neither free nor\nrestricted session channels) and higher-order sessions (delegation).\nFurthermore, we give examples suggesting that transparent processes constitute\na large enough class of processes with progress to have applications in modern\nsession-based programming languages for web services.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 05:04:12 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Carbone", "Marco", "", "IT University of Copenhagen"], ["Debois", "Søren", "", "IT\n  University of Copenhagen"]]}, {"id": "1010.5570", "submitter": "EPTCS", "authors": "Massimo Bartoletti (Dipartimento di Matematica e Informatica,\n  Universit\\`a degli Studi di Cagliari), Roberto Zunino (Dipartimento di\n  Ingegneria e Scienza dell'Informazione, Universit\\`a degli studi di Trento)", "title": "Primitives for Contract-based Synchronization", "comments": "In Proceedings ICE 2010, arXiv:1010.5308", "journal-ref": "EPTCS 38, 2010, pp. 67-82", "doi": "10.4204/EPTCS.38.8", "report-no": null, "categories": "cs.PL cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate how contracts can be used to regulate the interaction between\nprocesses. To do that, we study a variant of the concurrent constraints\ncalculus presented in [1], featuring primitives for multi-party synchronization\nvia contracts. We proceed in two directions. First, we exploit our primitives\nto model some contract-based interactions. Then, we discuss how several models\nfor concurrency can be expressed through our primitives. In particular, we\nencode the pi-calculus and graph rewriting.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 05:04:32 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Bartoletti", "Massimo", "", "Dipartimento di Matematica e Informatica,\n  Università degli Studi di Cagliari"], ["Zunino", "Roberto", "", "Dipartimento di\n  Ingegneria e Scienza dell'Informazione, Università degli studi di Trento"]]}, {"id": "1010.5571", "submitter": "EPTCS", "authors": "Matthieu Lemerre (CEA LIST), Vincent David (CEA LIST), Christophe\n  Aussagu\\`es (CEA LIST), Guy Vidal-Naquet (SUPELEC)", "title": "An Introduction to Time-Constrained Automata", "comments": "In Proceedings ICE 2010, arXiv:1010.5308", "journal-ref": "EPTCS 38, 2010, pp. 83-98", "doi": "10.4204/EPTCS.38.9", "report-no": null, "categories": "cs.LO cs.FL cs.OS cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present time-constrained automata (TCA), a model for hard real-time\ncomputation in which agents behaviors are modeled by automata and constrained\nby time intervals.\n  TCA actions can have multiple start time and deadlines, can be aperiodic, and\nare selected dynamically following a graph, the time-constrained automaton.\nThis allows expressing much more precise time constraints than classical\nperiodic or sporadic model, while preserving the ease of scheduling and\nanalysis.\n  We provide some properties of this model as well as their scheduling\nsemantics. We show that TCA can be automatically derived from source-code, and\noptimally scheduled on single processors using a variant of EDF. We explain how\ntime constraints can be used to guarantee communication determinism by\nconstruction, and to study when possible agent interactions happen.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 05:04:38 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Lemerre", "Matthieu", "", "CEA LIST"], ["David", "Vincent", "", "CEA LIST"], ["Aussaguès", "Christophe", "", "CEA LIST"], ["Vidal-Naquet", "Guy", "", "SUPELEC"]]}, {"id": "1010.5572", "submitter": "EPTCS", "authors": "Harsh Beohar (TU/e), Pieter Cuijpers (TU/e)", "title": "A theory of desynchronisable closed loop system", "comments": "In Proceedings ICE 2010, arXiv:1010.5308", "journal-ref": "EPTCS 38, 2010, pp. 99-114", "doi": "10.4204/EPTCS.38.10", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The task of implementing a supervisory controller is non-trivial, even though\ndifferent theories exist that allow automatic synthesis of these controllers in\nthe form of automata. One of the reasons for this discord is due to the\nasynchronous interaction between a plant and its controller in implementations,\nwhereas the existing supervisory control theories assume synchronous\ninteraction. As a consequence the implementation suffer from the so-called\ninexact synchronisation problem. In this paper we address the issue of inexact\nsynchronisation in a process algebraic setting, by solving a more general\nproblem of refinement. We construct an asynchronous closed loop system by\nintroducing a communication medium in a given synchronous closed loop system.\nOur goal is to find sufficient conditions under which a synchronous closed loop\nsystem is branching bisimilar to its corresponding asynchronous closed loop\nsystem.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 05:04:44 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Beohar", "Harsh", "", "TU/e"], ["Cuijpers", "Pieter", "", "TU/e"]]}, {"id": "1010.5665", "submitter": "Pritam Roy", "authors": "Pritam Roy, Paulo Tabuada, Rupak Majumdar", "title": "Safety-Guarantee Controller Synthesis for Cyber-Physical Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The verification and validation of cyber-physical systems is known to be a\ndifficult problem due to the different modeling abstractions used for control\ncomponents and for software components. A recent trend to address this\ndifficulty is to reduce the need for verification by adopting correct-by-design\nmethodologies. According to the correct-by-design paradigm, one seeks to\nautomatically synthesize a controller that can be refined into code and that\nenforces temporal specifications on the cyber-physical system. In this paper we\nconsider an instance of this problem where the specifications are given by a\nfragment of Linear Temporal Logic (LTL) and the physical environment is\ndescribed by a smooth differential equation. The contribution of this paper is\nto show that synthesis for cyber-physical systems is viable by considering a\nfragment of LTL that is expressive enough to describe interesting properties\nbut simple enough to avoid Safra's construction. We report on two examples\nillustrating a preliminary implementation of these techniques on the tool\nPESSOALTL.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 12:12:12 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Roy", "Pritam", ""], ["Tabuada", "Paulo", ""], ["Majumdar", "Rupak", ""]]}, {"id": "1010.6112", "submitter": "EPTCS", "authors": "Yu-Fang Chen (Academia Sinica, Taiwan), Ahmed Rezine (Uppsala\n  University, Sweden)", "title": "Proceedings 12th International Workshop on Verification of\n  Infinite-State Systems", "comments": null, "journal-ref": "EPTCS 39, 2010", "doi": "10.4204/EPTCS.39", "report-no": null, "categories": "cs.FL cs.CC cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of the INFINITY workshop is to provide a forum for researchers\ninterested in the development of formal methods and algorithmic techniques for\nthe analysis of systems with infinitely many states, and their application in\nautomated verification of complex software and hardware systems.\n", "versions": [{"version": "v1", "created": "Thu, 28 Oct 2010 23:39:56 GMT"}], "update_date": "2010-11-01", "authors_parsed": [["Chen", "Yu-Fang", "", "Academia Sinica, Taiwan"], ["Rezine", "Ahmed", "", "Uppsala\n  University, Sweden"]]}]