[{"id": "0912.0238", "submitter": "Sebastiano Vigna", "authors": "Sebastiano Vigna", "title": "Spectral Ranking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We sketch the history of spectral ranking, a general umbrella name for\ntechniques that apply the theory of linear maps (in particular, eigenvalues and\neigenvectors) to matrices that do not represent geometric transformations, but\nrather some kind of relationship between entities. Albeit recently made famous\nby the ample press coverage of Google's PageRank algorithm, spectral ranking\nwas devised more than a century ago, and has been studied in tournament\nranking, psychology, social sciences, bibliometrics, economy and choice theory.\nWe describe the contribution given by previous scholars in precise and modern\nmathematical terms: along the way, we show how to express in a general way\ndamped rankings, such as Katz's index, as dominant eigenvectors of perturbed\nmatrices, and then use results on the Drazin inverse to go back to the dominant\neigenvectors by a limit process. The result suggests a regularized definition\nof spectral ranking that yields for a general matrix a unique vector depending\non a boundary condition.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2009 19:35:39 GMT"}, {"version": "v10", "created": "Fri, 9 Aug 2013 14:01:58 GMT"}, {"version": "v11", "created": "Sat, 7 Sep 2013 17:18:38 GMT"}, {"version": "v12", "created": "Sat, 12 Oct 2013 10:45:57 GMT"}, {"version": "v13", "created": "Fri, 8 Nov 2013 11:37:33 GMT"}, {"version": "v14", "created": "Tue, 29 Sep 2015 21:26:47 GMT"}, {"version": "v15", "created": "Fri, 8 Feb 2019 11:01:34 GMT"}, {"version": "v2", "created": "Mon, 7 Dec 2009 08:23:10 GMT"}, {"version": "v3", "created": "Mon, 7 Dec 2009 23:30:17 GMT"}, {"version": "v4", "created": "Wed, 9 Dec 2009 16:53:20 GMT"}, {"version": "v5", "created": "Fri, 11 Dec 2009 16:37:26 GMT"}, {"version": "v6", "created": "Tue, 22 Dec 2009 01:14:01 GMT"}, {"version": "v7", "created": "Wed, 10 Mar 2010 11:24:23 GMT"}, {"version": "v8", "created": "Fri, 12 Nov 2010 16:19:25 GMT"}, {"version": "v9", "created": "Wed, 2 Mar 2011 14:57:02 GMT"}], "update_date": "2019-02-11", "authors_parsed": [["Vigna", "Sebastiano", ""]]}, {"id": "0912.0433", "submitter": "Arijit  Laha Ph.D.", "authors": "Arijit Laha", "title": "On the issues of building Information Warehouses", "comments": "ACM Comptute 2010, January 22-23, 2010, Bangalore, India", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.IR cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While performing knowledge-intensive tasks of professional nature, the\nknowledge workers need to access and process large volume of information. Apart\nfrom the quantity, they also require that the information received is of high\nquality in terms of authenticity and details. This, in turn, requires that the\ninformation delivered should also include argumentative support, exhibiting the\nreasoning process behind their development and provenance to indicate their\nlineage. In conventional document-centric practices for information management,\nsuch details are difficult to capture, represent/archive and retrieve/deliver.\nTo achieve such capability we need to re-think some core issues of information\nmanagement from the above requirements perspective. In this paper we develop a\nframework for comprehensive representation of information in archive, capturing\ninformational contents along with their context. We shall call it the\n\"Information Warehouse (IW)\" framework of information archival. The IW is a\nsignificant yet technologically realizable conceptual advancement which can\nsupport efficiently some interesting classes of applications which can be very\nuseful to the knowledge workers.\n", "versions": [{"version": "v1", "created": "Wed, 2 Dec 2009 15:16:27 GMT"}], "update_date": "2009-12-03", "authors_parsed": [["Laha", "Arijit", ""]]}, {"id": "0912.0913", "submitter": "Rdv Ijcsis", "authors": "Vincenza Carchiolo, Alessandro Longheu, Michele Malgeri, Giuseppe\n  Mangioni", "title": "Search for overlapped communities by parallel genetic algorithms", "comments": "6 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 113-118, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.IR cs.GL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last decade the broad scope of complex networks has led to a rapid\nprogress. In this area a particular interest has the study of community\nstructures. The analysis of this type of structure requires the formalization\nof the intuitive concept of community and the definition of indices of goodness\nfor the obtained results. A lot of algorithms has been presented to reach this\ngoal. In particular, an interesting problem is the search of overlapped\ncommunities and it is field seems very interesting a solution based on the use\nof genetic algorithms. The approach discusses in this paper is based on a\nparallel implementation of a genetic algorithm and shows the performance\nbenefits of this solution.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 20:54:07 GMT"}, {"version": "v2", "created": "Mon, 7 Dec 2009 11:09:29 GMT"}], "update_date": "2009-12-07", "authors_parsed": [["Carchiolo", "Vincenza", ""], ["Longheu", "Alessandro", ""], ["Malgeri", "Michele", ""], ["Mangioni", "Giuseppe", ""]]}, {"id": "0912.1005", "submitter": "Rdv Ijcsis", "authors": "Dr. G. Padmavathi, Dr. P. Subashini, Mr. M. Muthu Kumar and Suresh\n  Kumar Thakur", "title": "Performance analysis of Non Linear Filtering Algorithms for underwater\n  images", "comments": "7 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 232-238, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.MM cs.CV cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Image filtering algorithms are applied on images to remove the different\ntypes of noise that are either present in the image during capturing or\ninjected in to the image during transmission. Underwater images when captured\nusually have Gaussian noise, speckle noise and salt and pepper noise. In this\nwork, five different image filtering algorithms are compared for the three\ndifferent noise types. The performances of the filters are compared using the\nPeak Signal to Noise Ratio (PSNR) and Mean Square Error (MSE). The modified\nspatial median filter gives desirable results in terms of the above two\nparameters for the three different noise. Forty underwater images are taken for\nstudy.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2009 12:33:09 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Padmavathi", "Dr. G.", ""], ["Subashini", "Dr. P.", ""], ["Kumar", "Mr. M. Muthu", ""], ["Thakur", "Suresh Kumar", ""]]}, {"id": "0912.1010", "submitter": "Rdv Ijcsis", "authors": "Mohd Shahizan Othman, Lizawati Mi Yusuf, Juhana Salim", "title": "Web Document Analysis for Companies Listed in Bursa Malaysia", "comments": "6 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 275-280, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses a research on web document analysis for companies listed\non Bursa Malaysia which is the forerunner of financial and investment center in\nMalaysia. Data set used in this research are from the company web documents\nlisted in the Main Board and Second Board on Bursa Malaysia. This research has\nused the Web Resources Extraction System which was developed by the research\ngroup mainly to extract information for the web documents involved. Our\nresearch findings have shown that the level of website usage among the\ncompanies on Bursa Malaysia is still minimal. Furthermore, research has also\nfound that 60.02 percent of the image files are utilized making it the most\nused type of file in creating websites.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2009 12:58:43 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Othman", "Mohd Shahizan", ""], ["Yusuf", "Lizawati Mi", ""], ["Salim", "Juhana", ""]]}, {"id": "0912.1224", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff", "title": "The university-industry knowledge relationship: Analyzing patents and\n  the science base of technologies", "comments": null, "journal-ref": "Journal of the American Society for Information Science and\n  Technology, 55(11), 2004, 991-1001", "doi": null, "report-no": null, "categories": "cs.DL cs.CY cs.IR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Via the Internet, information scientists can obtain cost-free access to large\ndatabases in the hidden or deep web. These databases are often structured far\nmore than the Internet domains themselves. The patent database of the U.S.\nPatent and Trade Office is used in this study to examine the science base of\npatents in terms of the literature references in these patents.\nUniversity-based patents at the global level are compared with results when\nusing the national economy of the Netherlands as a system of reference. Methods\nfor accessing the on-line databases and for the visualization of the results\nare specified. The conclusion is that 'biotechnology' has historically\ngenerated a model for theorizing about university-industry relations that\ncannot easily be generalized to other sectors and disciplines.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2009 13:00:03 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Leydesdorff", "Loet", ""]]}, {"id": "0912.1294", "submitter": "Carlo Abi Chahine", "authors": "Carlo Abi Chahine (LITIS), Jean-Philippe Kotowicz (LITIS), Nathalie\n  Chaignaud (LITIS), Jean-Pierre P\\'ecuchet (LITIS)", "title": "Conception d'un outil d'aide \\`a l'indexation de ressources\n  p\\'edagogiques - Extraction automatique des th\\'ematiques et des mots-clefs\n  de documents UNIT", "comments": null, "journal-ref": "Environnements Informatiques pour l'Apprentissage Humain, Le Mans\n  : France (2009)", "doi": null, "report-no": null, "categories": "cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Indexing learning documents using the Learning Object Metadata (LOM) is often\ncarried out manually by archivists. Filling out the LOM fields is a long and\ndifficult task, requiring a complete reading and a full knowledge on the topic\ndealt within the document. In this paper, we present an innovative model and\nmethod to assist the archivists in finding the important concepts and keywords\nof a learning document. The application is performed using wikipedia's category\nlinks.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2009 19:43:08 GMT"}], "update_date": "2016-11-27", "authors_parsed": [["Chahine", "Carlo Abi", "", "LITIS"], ["Kotowicz", "Jean-Philippe", "", "LITIS"], ["Chaignaud", "Nathalie", "", "LITIS"], ["Pécuchet", "Jean-Pierre", "", "LITIS"]]}, {"id": "0912.1421", "submitter": "Carlo Abi Chahine", "authors": "Carlo Abi Chahine (LITIS), Nathalie Chaignaud (LITIS), Jean-Philippe\n  Kotowicz (LITIS), Jean-Pierre P\\'ecuchet (LITIS)", "title": "Context and Keyword Extraction in Plain Text Using a Graph\n  Representation", "comments": null, "journal-ref": "IEEE International Conference on Signal Image Technology and\n  Internet Based Systems, SITIS '08., Bali : Indonesia (2008)", "doi": null, "report-no": null, "categories": "cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Document indexation is an essential task achieved by archivists or automatic\nindexing tools. To retrieve relevant documents to a query, keywords describing\nthis document have to be carefully chosen. Archivists have to find out the\nright topic of a document before starting to extract the keywords. For an\narchivist indexing specialized documents, experience plays an important role.\nBut indexing documents on different topics is much harder. This article\nproposes an innovative method for an indexing support system. This system takes\nas input an ontology and a plain text document and provides as output\ncontextualized keywords of the document. The method has been evaluated by\nexploiting Wikipedia's category links as a termino-ontological resources.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2009 07:33:27 GMT"}], "update_date": "2009-12-09", "authors_parsed": [["Chahine", "Carlo Abi", "", "LITIS"], ["Chaignaud", "Nathalie", "", "LITIS"], ["Kotowicz", "Jean-Philippe", "", "LITIS"], ["Pécuchet", "Jean-Pierre", "", "LITIS"]]}, {"id": "0912.1828", "submitter": "Vishal Goyal", "authors": "Vu Thanh Nguyen", "title": "Using social annotation and web log to enhance search engine", "comments": "International Journal of Computer Science Issues, IJCSI Volume 6,\n  Issue 2, pp1-6, November 2009", "journal-ref": "V. T. NGUYEN, \"Using social annotation and web log to enhance\n  search engine\", International Journal of Computer Science Issues, IJCSI,\n  Volume 6, Issue 2, pp1-6, November 2009", "doi": null, "report-no": null, "categories": "cs.IR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Search services have been developed rapidly in social Internet. It can help\nweb users easily to find their documents. So that, finding a best method search\nis always an imagine. This paper would like introduce hybrid method of\nLPageRank algorithm and Social Sim Rank algorithm. LPageRank is the method\nusing link structure to rank priority of page. It doesn't care content of page\nand content of query. Therefore, we want to use benefit of social annotations\nto create the latent semantic association between queries and annotations. This\nmodel, we use algorithm SocialPageRank and LPageRank to enhance accuracy of\nsearch system. To experiment and evaluate the proposed of the new model, we\nhave used this model for Music Machine Website with their web logs.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2009 18:33:07 GMT"}], "update_date": "2009-12-10", "authors_parsed": [["Nguyen", "Vu Thanh", ""]]}, {"id": "0912.1829", "submitter": "Vishal Goyal", "authors": "Dang Tuan Nguyen and Ha Quy-Tinh Luong", "title": "Document Searching System based on Natural Language Query Processing for\n  Vietnam Open Courseware Library", "comments": "International Journal of Computer Science Issues, IJCSI Volume 6,\n  Issue 2, pp7-13, November 2009", "journal-ref": "D. T. NGUYEN and H. Q. LUONG, \"Document Searching System based on\n  Natural Language Query Processing for Vietnam Open Courseware Library\",\n  IJCSI, Volume 6, Issue 2, pp7-13, November 2009", "doi": null, "report-no": null, "categories": "cs.IR cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The necessary of buiding the searching system being able to support users\nexpressing their searching by natural language queries is very important and\nopens the researching direction with many potential. It combines the\ntraditional methods of information retrieval and the researching of Question\nAnswering (QA). In this paper, we introduce a searching system built by us for\nsearching courses on the Vietnam OpenCourseWare Program (VOCW). It can be\nconsidered as the first tool to be able to perform the user's Vietnamese\nquestions. The experiment results are rather good when we evaluate this system\non the precision\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2009 18:38:03 GMT"}], "update_date": "2009-12-10", "authors_parsed": [["Nguyen", "Dang Tuan", ""], ["Luong", "Ha Quy-Tinh", ""]]}, {"id": "0912.2307", "submitter": "Kadirvelu SivaKumar", "authors": "Jayanthi Manicassamy, P. Dhavachelvan", "title": "Rank Based Clustering For Document Retrieval From Biomedical Databases", "comments": null, "journal-ref": "IJCSE Volume 1 Issue 2 2009 111-115", "doi": null, "report-no": null, "categories": "cs.IR cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Now a day's, search engines are been most widely used for extracting\ninformation's from various resources throughout the world. Where, majority of\nsearches lies in the field of biomedical for retrieving related documents from\nvarious biomedical databases. Currently search engines lacks in document\nclustering and representing relativeness level of documents extracted from the\ndatabases. In order to overcome these pitfalls a text based search engine have\nbeen developed for retrieving documents from Medline and PubMed biomedical\ndatabases. The search engine has incorporated page ranking bases clustering\nconcept which automatically represents relativeness on clustering bases. Apart\nfrom this graph tree construction is made for representing the level of\nrelatedness of the documents that are networked together. This advance\nfunctionality incorporation for biomedical document based search engine found\nto provide better results in reviewing related documents based on relativeness.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 18:22:54 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Manicassamy", "Jayanthi", ""], ["Dhavachelvan", "P.", ""]]}, {"id": "0912.2311", "submitter": "Kadirvelu SivaKumar", "authors": "Jayanthi Manicassamy and P. Dhavachelvan", "title": "VirusPKT: A Search Tool For Assimilating Assorted Acquaintance For\n  Viruses", "comments": null, "journal-ref": "IJCSE Volume 1 Issue 3 2009 122-126", "doi": null, "report-no": null, "categories": "cs.IR q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Viruses utilize various means to circumvent the immune detection in the\nbiological systems. Several mathematical models have been investigated for the\ndescription of viral dynamics in the biological system of human and various\nother species. One common strategy for evasion and recognition of viruses is,\nthrough acquaintance in the systems by means of search engines. In this\nperspective a search tool have been developed to provide a wider comprehension\nabout the structure and other details on viruses which have been narrated in\nthis paper. This provides an adequate knowledge in evolution and building of\nviruses, its functions through information extraction from various websites.\nApart from this, tool aim to automate the activities associated with it in a\nself-maintainable, self-sustainable, proactive one which has been evaluated\nthrough analysis made and have been discussed in this paper.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 18:45:03 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Manicassamy", "Jayanthi", ""], ["Dhavachelvan", "P.", ""]]}, {"id": "0912.3882", "submitter": "Ismael Rafols", "authors": "Ismael Rafols, Alan L. Porter and Loet Leydesdorff", "title": "Science overlay maps: a new tool for research policy and library\n  management", "comments": "40 pages, 6 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel approach to visually locate bodies of research within the\nsciences, both at each moment of time and dynamically. This article describes\nhow this approach fits with other efforts to locally and globally map\nscientific outputs. We then show how these science overlay maps help benchmark,\nexplore collaborations, and track temporal changes, using examples of\nuniversities, corporations, funding agencies, and research topics. We address\nconditions of application, with their advantages, downsides and limitations.\nOverlay maps especially help investigate the increasing number of scientific\ndevelopments and organisations that do not fit within traditional disciplinary\ncategories. We make these tools accessible to help researchers explore the\nongoing socio-cognitive transformation of science and technology systems.\n", "versions": [{"version": "v1", "created": "Sat, 19 Dec 2009 10:33:16 GMT"}], "update_date": "2009-12-22", "authors_parsed": [["Rafols", "Ismael", ""], ["Porter", "Alan L.", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "0912.3957", "submitter": "William Jackson", "authors": "Dhiren R. Patel, Sidheshwar A. Khuba", "title": "Realization of Semantic Atom Blog", "comments": null, "journal-ref": "Journal of Computing, Volume 1, Issue 1, pp 34-38, December 2009", "doi": null, "report-no": null, "categories": "cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web blog is used as a collaborative platform to publish and share\ninformation. The information accumulated in the blog intrinsically contains the\nknowledge. The knowledge shared by the community of people has intangible value\nproposition. The blog is viewed as a multimedia information resource available\non the Internet. In a blog, information in the form of text, image, audio and\nvideo builds up exponentially. The multimedia information contained in an Atom\nblog does not have the capability, which is required by the software processes\nso that Atom blog content can be accessed, processed and reused over the\nInternet. This shortcoming is addressed by exploring OWL knowledge modeling,\nsemantic annotation and semantic categorization techniques in an Atom blog\nsphere. By adopting these techniques, futuristic Atom blogs can be created and\ndeployed over the Internet.\n", "versions": [{"version": "v1", "created": "Sun, 20 Dec 2009 02:13:10 GMT"}], "update_date": "2009-12-22", "authors_parsed": [["Patel", "Dhiren R.", ""], ["Khuba", "Sidheshwar A.", ""]]}, {"id": "0912.5235", "submitter": "Michael J. Kurtz", "authors": "Michael J. Kurtz, Alberto Accomazzi, Edwin Henneken, Giovanni Di\n  Milia, Carolyn S. Grant", "title": "Using Multipartite Graphs for Recommendation and Discovery", "comments": "To appear in ADASS XIX, ASP Conf Proc", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL cs.IR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Smithsonian/NASA Astrophysics Data System exists at the nexus of a dense\nsystem of interacting and interlinked information networks. The syntactic and\nthe semantic content of this multipartite graph structure can be combined to\nprovide very specific research recommendations to the scientist/user.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2009 17:05:13 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Kurtz", "Michael J.", ""], ["Accomazzi", "Alberto", ""], ["Henneken", "Edwin", ""], ["Di Milia", "Giovanni", ""], ["Grant", "Carolyn S.", ""]]}, {"id": "0912.5456", "submitter": "Thomas C. Schmidt", "authors": "Thomas C. Schmidt, Arne Hildebrand, Michael Engelhardt and Dagmar\n  Lange", "title": "From a Link Semantic to Semantic Links - Building Context in Educational\n  Hypermedia", "comments": "Summary of several conference articles", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modularization and granulation are key concepts in educational content\nmanagement, whereas teaching, learning and understanding require a discourse\nwithin thematic contexts. Even though hyperlinks and semantically typed\nreferences provide the context building blocks of hypermedia systems, elaborate\nconcepts to derive, manage and propagate such relations between content objects\nare not around at present. Based on Semantic Web standards, this paper makes\nseveral contributions to content enrichment. Work starts from harvesting\nmultimedia annotations in class-room recordings, and proceeds to deriving a\ndense educational semantic net between eLearning Objects decorated with\nextended LOM relations. Special focus is drawn on the processing of recorded\nspeech and on an Ontological Evaluation Layer that autonomously derives\nmeaningful inter-object relations. Further on, a semantic representation of\nhyperlinks is developed and elaborated to the concept of semantic link\ncontexts, an approach to manage a coherent rhetoric of linking. These solutions\nhave been implemented in the Hypermedia Learning Objects System (hylOs), our\neLearning content management system. hylOs is built upon the more general Media\nInformation Repository (MIR) and the MIR adaptive context linking environment\n(MIRaCLE), its linking extension. MIR is an open system supporting the\nstandards XML and JNDI. hylOs benefits from configurable information\nstructures, sophisticated access logic and high-level authoring tools like the\nWYSIWYG XML editor and its Instructional Designer.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2009 14:53:06 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Schmidt", "Thomas C.", ""], ["Hildebrand", "Arne", ""], ["Engelhardt", "Michael", ""], ["Lange", "Dagmar", ""]]}]