[{"id": "1106.0151", "submitter": "Mofreh Zaghloul", "authors": "Mofreh R. Zaghloul and Ahmed N. Ali", "title": "Algorithm 916: computing the Faddeyeva and Voigt functions", "comments": "27 pages, 5 tables, 9 figurs", "journal-ref": "ACM Transactions on Mathematical Software, Vol 38, No. 2, Article\n  15(2011),22 pages", "doi": null, "report-no": null, "categories": "cs.NA math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a MATLAB function for the numerical evaluation of the Faddeyeva\nfunction w(z). The function is based on a newly developed accurate algorithm.\nIn addition to its higher accuracy, the software provides a flexible accuracy\nvs efficiency trade-off through a controlling parameter that may be used to\nreduce accuracy and computational time and vice versa. Verification of the\nflexibility, reliability and superior accuracy of the algorithm is provided\nthrough comparison with standard algorithms available in other libraries and\nsoftware packages.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jun 2011 12:01:12 GMT"}, {"version": "v2", "created": "Sun, 23 Sep 2012 08:07:56 GMT"}], "update_date": "2012-09-25", "authors_parsed": [["Zaghloul", "Mofreh R.", ""], ["Ali", "Ahmed N.", ""]]}, {"id": "1106.0547", "submitter": "Mayer Humi", "authors": "Mayer Humi", "title": "A Modified EMD Algorithm and its Applications", "comments": "To be presented at \"The 2011 International Conference on Scientific\n  Computing (CSC'11)\" Las-Vegas Nevada July 17-21, 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The classical EMD algorithm has been used extensively in the literature to\ndecompose signals that contain nonlinear waves. However when a signal contain\ntwo or more frequencies that are close to one another the decomposition might\nfail. In this paper we propose a new formulation of this algorithm which is\nbased on the zero crossings of the signal and show that it performs well even\nwhen the classical algorithm fail. We address also the filtering properties and\nconvergence rate of the new algorithm versus the classical EMD algorithm. These\nproperties are compared then to those of the principal component algorithm\n(PCA). Finally we apply this algorithm to the detection of gravity waves in the\natmosphere.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jun 2011 01:41:03 GMT"}], "update_date": "2011-06-06", "authors_parsed": [["Humi", "Mayer", ""]]}, {"id": "1106.0785", "submitter": "Aiguo Xu Prof. Dr.", "authors": "Feng Chen, Aiguo Xu, Guangcai Zhang, Yingjun Li", "title": "Prandtl number effects in MRT Lattice Boltzmann models for shocked and\n  unshocked compressible fluids", "comments": "17 pages, 8 figures", "journal-ref": "Theoretical and Applied Mechanics Letters 1, 052004 (2011)", "doi": null, "report-no": null, "categories": "cond-mat.soft cs.NA nlin.CG physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For compressible fluids under shock wave reaction, we have proposed two\nMultiple-Relaxation-Time (MRT) Lattice Boltzmann (LB) models [F. Chen, et al,\nEPL \\textbf{90} (2010) 54003; Phys. Lett. A \\textbf{375} (2011) 2129.]. In this\npaper, we construct a new MRT Lattice Boltzmann model which is not only for the\nshocked compressible fluids, but also for the unshocked compressible fluids. To\nmake the model work for unshocked compressible fluids, a key step is to modify\nthe collision operators of energy flux so that the viscous coefficient in\nmomentum equation is consistent with that in energy equation even in the\nunshocked system. The unnecessity of the modification for systems under strong\nshock is analyzed. The model is validated by some well-known benchmark tests,\nincluding (i) thermal Couette flow, (ii) Riemann problem, (iii)\nRichtmyer-Meshkov instability. The first system is unshocked and the latter two\nare shocked. In all the three systems, the Prandtl numbers effects are checked.\nSatisfying agreements are obtained between new model results and analytical\nones or other numerical results.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jun 2011 03:14:32 GMT"}], "update_date": "2013-08-29", "authors_parsed": [["Chen", "Feng", ""], ["Xu", "Aiguo", ""], ["Zhang", "Guangcai", ""], ["Li", "Yingjun", ""]]}, {"id": "1106.1319", "submitter": "Xiaosheng Zhuang", "authors": "Gitta Kutyniok and Morteza Shahram and Xiaosheng Zhuang", "title": "ShearLab: A Rational Design of a Digital Parabolic Scaling Algorithm", "comments": "submitted to SIAM J. Multiscale Model. Simul", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.MS cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multivariate problems are typically governed by anisotropic features such as\nedges in images. A common bracket of most of the various directional\nrepresentation systems which have been proposed to deliver sparse\napproximations of such features is the utilization of parabolic scaling. One\nprominent example is the shearlet system. Our objective in this paper is\nthree-fold: We firstly develop a digital shearlet theory which is rationally\ndesigned in the sense that it is the digitization of the existing shearlet\ntheory for continuous data. This implicates that shearlet theory provides a\nunified treatment of both the continuum and digital realm. Secondly, we analyze\nthe utilization of pseudo-polar grids and the pseudo-polar Fourier transform\nfor digital implementations of parabolic scaling algorithms. We derive an\nisometric pseudo-polar Fourier transform by careful weighting of the\npseudo-polar grid, allowing exploitation of its adjoint for the inverse\ntransform. This leads to a digital implementation of the shearlet transform; an\naccompanying Matlab toolbox called ShearLab is provided. And, thirdly, we\nintroduce various quantitative measures for digital parabolic scaling\nalgorithms in general, allowing one to tune parameters and objectively improve\nthe implementation as well as compare different directional transform\nimplementations. The usefulness of such measures is exemplarily demonstrated\nfor the digital shearlet transform.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jun 2011 11:36:55 GMT"}], "update_date": "2011-06-08", "authors_parsed": [["Kutyniok", "Gitta", ""], ["Shahram", "Morteza", ""], ["Zhuang", "Xiaosheng", ""]]}, {"id": "1106.1325", "submitter": "Jakob Lemvig", "authors": "Gitta Kutyniok, Jakob Lemvig, Wang-Q Lim", "title": "Shearlets and Optimally Sparse Approximations", "comments": "in \"Shearlets: Multiscale Analysis for Multivariate Data\",\n  Birkh\\\"auser-Springer", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.FA cs.IT cs.NA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multivariate functions are typically governed by anisotropic features such as\nedges in images or shock fronts in solutions of transport-dominated equations.\nOne major goal both for the purpose of compression as well as for an efficient\nanalysis is the provision of optimally sparse approximations of such functions.\nRecently, cartoon-like images were introduced in 2D and 3D as a suitable model\nclass, and approximation properties were measured by considering the decay rate\nof the $L^2$ error of the best $N$-term approximation. Shearlet systems are to\ndate the only representation system, which provide optimally sparse\napproximations of this model class in 2D as well as 3D. Even more, in contrast\nto all other directional representation systems, a theory for compactly\nsupported shearlet frames was derived which moreover also satisfy this\noptimality benchmark. This chapter shall serve as an introduction to and a\nsurvey about sparse approximations of cartoon-like images by band-limited and\nalso compactly supported shearlet frames as well as a reference for the\nstate-of-the-art of this research field.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jun 2011 12:03:11 GMT"}, {"version": "v2", "created": "Fri, 5 Aug 2011 19:07:42 GMT"}], "update_date": "2011-08-08", "authors_parsed": [["Kutyniok", "Gitta", ""], ["Lemvig", "Jakob", ""], ["Lim", "Wang-Q", ""]]}, {"id": "1106.2176", "submitter": "Rio Yokota Dr.", "authors": "Rio Yokota and Lorena Barba", "title": "A Tuned and Scalable Fast Multipole Method as a Preeminent Algorithm for\n  Exascale Systems", "comments": null, "journal-ref": null, "doi": "10.1177/1094342011429952", "report-no": null, "categories": "cs.NA cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Among the algorithms that are likely to play a major role in future exascale\ncomputing, the fast multipole method (FMM) appears as a rising star. Our\nprevious recent work showed scaling of an FMM on GPU clusters, with problem\nsizes in the order of billions of unknowns. That work led to an extremely\nparallel FMM, scaling to thousands of GPUs or tens of thousands of CPUs. This\npaper reports on a a campaign of performance tuning and scalability studies\nusing multi-core CPUs, on the Kraken supercomputer. All kernels in the FMM were\nparallelized using OpenMP, and a test using 10^7 particles randomly distributed\nin a cube showed 78% efficiency on 8 threads. Tuning of the\nparticle-to-particle kernel using SIMD instructions resulted in 4x speed-up of\nthe overall algorithm on single-core tests with 10^3 - 10^7 particles. Parallel\nscalability was studied in both strong and weak scaling. The strong scaling\ntest used 10^8 particles and resulted in 93% parallel efficiency on 2048\nprocesses for the non-SIMD code and 54% for the SIMD-optimized code (which was\nstill 2x faster). The weak scaling test used 10^6 particles per process, and\nresulted in 72% efficiency on 32,768 processes, with the largest calculation\ntaking about 40 seconds to evaluate more than 32 billion unknowns. This work\nbuilds up evidence for our view that FMM is poised to play a leading role in\nexascale computing, and we end the paper with a discussion of the features that\nmake it a particularly favorable algorithm for the emerging heterogeneous and\nmassively parallel architectural landscape.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jun 2011 21:02:40 GMT"}, {"version": "v2", "created": "Sun, 16 Oct 2011 20:45:45 GMT"}], "update_date": "2012-10-30", "authors_parsed": [["Yokota", "Rio", ""], ["Barba", "Lorena", ""]]}, {"id": "1106.2327", "submitter": "Kalyana Babu Nakshatrala", "authors": "M. K. Mudunuru and K. B. Nakshatrala", "title": "A framework for coupled deformation-diffusion analysis with application\n  to degradation/healing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE math.NA physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the formulation and numerical implementation of a fully\ncoupled continuum model for deformation-diffusion in linearized elastic solids.\nThe mathematical model takes into account the effect of the deformation on the\ndiffusion process, and the affect of the transport of an inert chemical species\non the deformation of the solid. We then present a robust computational\nframework for solving the proposed mathematical model, which consists of\ncoupled non-linear partial differential equations. It should be noted that many\npopular numerical formulations may produce unphysical negative values for the\nconcentration, particularly, when the diffusion process is anisotropic. The\nviolation of the non-negative constraint by these numerical formulations is not\nmere numerical noise. In the proposed computational framework we employ a novel\nnumerical formulation that will ensure that the concentration of the diffusant\nbe always non-negative, which is one of the main contributions of this paper.\nRepresentative numerical examples are presented to show the robustness,\nconvergence, and performance of the proposed computational framework. Another\ncontribution of this paper is to systematically study the affect of transport\nof the diffusant on the deformation of the solid and vice-versa, and their\nimplication in modeling degradation/healing of materials. We show that the\ncoupled response is both qualitatively and quantitatively different from the\nuncoupled response.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jun 2011 18:16:07 GMT"}], "update_date": "2018-06-07", "authors_parsed": [["Mudunuru", "M. K.", ""], ["Nakshatrala", "K. B.", ""]]}, {"id": "1106.2407", "submitter": "Victor Blanco", "authors": "V. Blanco, S. El-Haj Ben-Ali and J. Puerto", "title": "A Semidefinite Programming approach for minimizing ordered weighted\n  averages of rational functions", "comments": "27 pages, 1 figure, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the problem of minimizing the ordered weighted average\n(or ordered median) function of finitely many rational functions over compact\nsemi-algebraic sets. Ordered weighted averages of rational functions are not,\nin general, neither rational functions nor the supremum of rational functions\nso that current results available for the minimization of rational functions\ncannot be applied to handle these problems. We prove that the problem can be\ntransformed into a new problem embedded in a higher dimension space where it\nadmits a convenient representation. This reformulation admits a hierarchy of\nSDP relaxations that approximates, up to any degree of accuracy, the optimal\nvalue of those problems. We apply this general framework to a broad family of\ncontinuous location problems showing that some difficult problems (convex and\nnon-convex) that up to date could only be solved on the plane and with\nEuclidean distance, can be reasonably solved with different $\\ell_p$-norms and\nin any finite dimension space. We illustrate this methodology with some\nextensive computational results on location problems in the plane and the\n3-dimension space.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jun 2011 09:54:00 GMT"}, {"version": "v2", "created": "Tue, 28 Jun 2011 21:28:19 GMT"}], "update_date": "2011-06-30", "authors_parsed": [["Blanco", "V.", ""], ["Ben-Ali", "S. El-Haj", ""], ["Puerto", "J.", ""]]}, {"id": "1106.3678", "submitter": "Man Chung Yeung", "authors": "Man-Chung Yeung", "title": "An introduction to ML(n)BiCGStab", "comments": "This paper introduces the three algorithms of the ML(n)BiCGStab\n  method for the solution of large, nonsymmetric liear systems. One of the\n  algorithms involves A-transpose in its implmentation. This paper will be\n  presented in the 33rd International Conference on Boundary Elements and other\n  Mesh Reduction Methods, 28-30 June 2011, New Forest, UK", "journal-ref": null, "doi": null, "report-no": "Report 11-06, Math Dept., UW", "categories": "math.NA cs.NA math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  ML(n)BiCGStab is a Krylov subspace method for the solution of large, sparse\nand non-symmetric linear systems. In theory, it is a method that lies between\nthe well-known BiCGStab and GMRES/FOM. In fact, when n = 1, ML(1)BiCGStab is\nBiCGStab and when n = N, ML(N)BiCGStab is GMRES/FOM where N is the size of the\nlinear system. Therefore, ML(n)BiCGStab is a bridge that connects the\nLanczos-based BiCGStab and the Arnoldi-based GMRES/FOM. In computation,\nML(n)BiCGStab can be much more stable and converge much faster than BiCGStab\nwhen a problem with ill-condition is solved. We have tested ML(n)BiCGStab on\nthe standard oil reservoir simulation test data called SPE9 and found that\nML(n)BiCGStab reduced the total computational time by more than 60% when\ncompared to BiCGStab. Tests made on the data from Matrix Market also support\nthe superiority of ML(n)BiCGStab over BiCGStab. Because of the O(N^2) storage\nrequirement in the full GMRES, one has to adopt a restart strategy to get the\nstorage under control when GMRES is implemented. In comparison, ML(n)BiCGStab\nis a method with only O(nN) storage requirement and therefore it does not need\na restart strategy. In this paper, we introduce ML(n)BiCGStab (in particular, a\nnew algorithm involving A-transpose), its relations to some existing methods\nand its implementations.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jun 2011 18:58:44 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Yeung", "Man-Chung", ""]]}, {"id": "1106.3694", "submitter": "Hugo Jim\\'enez-P\\'erez", "authors": "Hugo Jim\\'enez-P\\'erez and Jacques Laskar", "title": "A time-parallel algorithm for almost integrable Hamiltonian systems", "comments": "19 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a time-parallel algorithm for solving numerically almost\nintegrable Hamiltonian systems in action-angle coordinates. This algorithm is a\nrefinement of that introduced by Saha, Stadel and Tremaine in 1997 (SST97) for\nthe same type of problems. Our refined algorithm has a better convergence\nobtained from the use of derivatives of the perturbing term not considered in\nthe original SST97 algorithm. An advantage of this algorithm is its\nindependence of the step-size for the parallelized procedures which can be\nconsider as a particular case of the parareal scheme.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jun 2011 22:37:28 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Jiménez-Pérez", "Hugo", ""], ["Laskar", "Jacques", ""]]}, {"id": "1106.4426", "submitter": "Hans De Sterck", "authors": "Hans De Sterck", "title": "Steepest Descent Preconditioning for Nonlinear GMRES Optimization", "comments": "added comparisons with L-BFGS; added some references", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Steepest descent preconditioning is considered for the recently proposed\nnonlinear generalized minimal residual (N-GMRES) optimization algorithm for\nunconstrained nonlinear optimization. Two steepest descent preconditioning\nvariants are proposed. The first employs a line search, while the second\nemploys a predefined small step. A simple global convergence proof is provided\nfor the N-GMRES optimization algorithm with the first steepest descent\npreconditioner (with line search), under mild standard conditions on the\nobjective function and the line search processes. Steepest descent\npreconditioning for N-GMRES optimization is also motivated by relating it to\nstandard non-preconditioned GMRES for linear systems in the case of a quadratic\noptimization problem with symmetric positive definite operator. Numerical tests\non a variety of model problems show that the N-GMRES optimization algorithm is\nable to very significantly accelerate convergence of stand-alone steepest\ndescent optimization. Moreover, performance of steepest-descent preconditioned\nN-GMRES is shown to be competitive with standard nonlinear conjugate gradient\nand limited-memory Broyden-Fletcher-Goldfarb-Shanno methods for the model\nproblems considered. These results serve to theoretically and numerically\nestablish steepest-descent preconditioned N-GMRES as a general optimization\nmethod for unconstrained nonlinear optimization, with performance that appears\npromising compared to established techniques. In addition, it is argued that\nthe real potential of the N-GMRES optimization framework lies in the fact that\nit can make use of problem-dependent nonlinear preconditioners that are more\npowerful than steepest descent (or, equivalently, N-GMRES can be used as a\nsimple wrapper around any other iterative optimization process to seek\nacceleration of that process), and this potential is illustrated with a further\napplication example.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jun 2011 11:53:27 GMT"}, {"version": "v2", "created": "Sun, 24 Jul 2011 16:01:02 GMT"}], "update_date": "2011-07-26", "authors_parsed": [["De Sterck", "Hans", ""]]}, {"id": "1106.5273", "submitter": "L. A. Barba", "authors": "R. Yokota, L. A. Barba, T. Narumi, and K. Yasuoka", "title": "Petascale turbulence simulation using a highly parallel fast multipole\n  method on GPUs", "comments": null, "journal-ref": null, "doi": "10.1016/j.cpc.2012.09.011", "report-no": null, "categories": "cs.NA physics.comp-ph physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper reports large-scale direct numerical simulations of\nhomogeneous-isotropic fluid turbulence, achieving sustained performance of 1.08\npetaflop/s on gpu hardware using single precision. The simulations use a vortex\nparticle method to solve the Navier-Stokes equations, with a highly parallel\nfast multipole method (FMM) as numerical engine, and match the current record\nin mesh size for this application, a cube of 4096^3 computational points solved\nwith a spectral method. The standard numerical approach used in this field is\nthe pseudo-spectral method, relying on the FFT algorithm as numerical engine.\nThe particle-based simulations presented in this paper quantitatively match the\nkinetic energy spectrum obtained with a pseudo-spectral method, using a trusted\ncode. In terms of parallel performance, weak scaling results show the fmm-based\nvortex method achieving 74% parallel efficiency on 4096 processes (one gpu per\nmpi process, 3 gpus per node of the TSUBAME-2.0 system). The FFT-based spectral\nmethod is able to achieve just 14% parallel efficiency on the same number of\nmpi processes (using only cpu cores), due to the all-to-all communication\npattern of the FFT algorithm. The calculation time for one time step was 108\nseconds for the vortex method and 154 seconds for the spectral method, under\nthese conditions. Computing with 69 billion particles, this work exceeds by an\norder of magnitude the largest vortex method calculations to date.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jun 2011 22:05:59 GMT"}, {"version": "v2", "created": "Wed, 29 Aug 2012 18:47:50 GMT"}, {"version": "v3", "created": "Mon, 3 Sep 2012 19:51:02 GMT"}], "update_date": "2012-10-30", "authors_parsed": [["Yokota", "R.", ""], ["Barba", "L. A.", ""], ["Narumi", "T.", ""], ["Yasuoka", "K.", ""]]}]