[{"id": "0809.0874", "submitter": "Fionn Murtagh", "authors": "Fionn Murtagh", "title": "Between the Information Economy and Student Recruitment: Present\n  Conjuncture and Future Prospects", "comments": "18 pages, 4 figures", "journal-ref": "CEPIS UPGRADE, vol. IX, no. 5, pp. 56-64, Oct. 2008", "doi": null, "report-no": null, "categories": "cs.CY cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In university programs and curricula, in general we react to the need to meet\nmarket needs. We respond to market stimulus, or at least try to do so. Consider\nnow an inverted view. Consider our data and perspectives in university programs\nas reflecting and indeed presaging economic trends. In this article I pursue\nthis line of thinking. I show how various past events fit very well into this\nnew view. I provide explanation for why some technology trends happened as they\ndid, and why some current developments are important now.\n", "versions": [{"version": "v1", "created": "Thu, 4 Sep 2008 18:17:05 GMT"}], "update_date": "2008-12-21", "authors_parsed": [["Murtagh", "Fionn", ""]]}, {"id": "0809.4916", "submitter": "Christoph Schommer", "authors": "Christoph Schommer", "title": "16 Propositions to Reconsider the Organization of a Scientific Workshop", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Participating a scientific workshop is nowadays often an adventure because\nthe number of participants do seldom exceed the number of talks. A half-day\nworkshop is mostly finished at lunchtime, speakers are sometimes not present\nand unexcused, and a strict progression of the workshop offers little air for\ndiscussion. And when talks are re-scheduled on short notice in case that a\nspeech is dropped out, attaining guests definitely wonder why the presenter is\ntalking about something that does not match the previously announced talk. In\nthis respect, we believe that the organization of a workshop in the classical\nsense must be reconsidered. It is not enough of compelling the presenters to\npay the registration fee only and to let the participants being impassive or\ntaken away mentally. With this work, we address several propositions to become\nimplemented in the future workshop organization. With that, we hope to\ncontribute to the identification of scientific workshops as a place of\ninteraction.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 09:42:23 GMT"}], "update_date": "2008-09-30", "authors_parsed": [["Schommer", "Christoph", ""]]}]