[{"id": "0808.0518", "submitter": "Philipp Mayr", "authors": "Philipp Mayr, Vivien Petras", "title": "Building a terminology network for search: the KoMoHe project", "comments": "5 pages, 2 figure, Dublin Core Conference 2008", "journal-ref": null, "doi": "10.18452/1264", "report-no": null, "categories": "cs.DL cs.DB", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The paper reports about results on the GESIS-IZ project \"Competence Center\nModeling and Treatment of Semantic Heterogeneity\" (KoMoHe). KoMoHe supervised a\nterminology mapping effort, in which 'cross-concordances' between major\ncontrolled vocabularies were organized, created and managed. In this paper we\ndescribe the establishment and implementation of cross-concordances for search\nin a digital library (DL).\n", "versions": [{"version": "v1", "created": "Mon, 4 Aug 2008 22:11:45 GMT"}], "update_date": "2019-01-15", "authors_parsed": [["Mayr", "Philipp", ""], ["Petras", "Vivien", ""]]}, {"id": "0808.2083", "submitter": "Daniel Lemire", "authors": "Owen Kaser, Daniel Lemire, Kamel Aouiche", "title": "Histogram-Aware Sorting for Enhanced Word-Aligned Compression in Bitmap\n  Indexes", "comments": "To appear in proceedings of DOLAP 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bitmap indexes must be compressed to reduce input/output costs and minimize\nCPU usage. To accelerate logical operations (AND, OR, XOR) over bitmaps, we use\ntechniques based on run-length encoding (RLE), such as Word-Aligned Hybrid\n(WAH) compression. These techniques are sensitive to the order of the rows: a\nsimple lexicographical sort can divide the index size by 9 and make indexes\nseveral times faster. We investigate reordering heuristics based on computed\nattribute-value histograms. Simply permuting the columns of the table based on\nthese histograms can increase the sorting efficiency by 40%.\n", "versions": [{"version": "v1", "created": "Fri, 15 Aug 2008 03:14:55 GMT"}, {"version": "v2", "created": "Tue, 23 Sep 2008 02:54:59 GMT"}, {"version": "v3", "created": "Mon, 19 Jan 2009 15:22:33 GMT"}], "update_date": "2009-01-19", "authors_parsed": [["Kaser", "Owen", ""], ["Lemire", "Daniel", ""], ["Aouiche", "Kamel", ""]]}, {"id": "0808.3296", "submitter": "Stevan Harnad", "authors": "Stevan Harnad", "title": "Confirmation Bias and the Open Access Advantage: Some Methodological\n  Suggestions for the Davis Citation Study", "comments": "17 pages, 17 references, 1 table; comment on 0808.2428v1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Davis (2008) analyzes citations from 2004-2007 in 11 biomedical journals. 15%\nof authors paid to make them Open Access (OA). The outcome is a significant OA\ncitation Advantage, but a small one (21%). The author infers that the OA\nadvantage has been shrinking yearly, but the data suggest the opposite. Further\nanalyses are necessary:\n  (1) Not just author-choice (paid) OA but Free OA self-archiving needs to be\ntaken into account rather than being counted as non-OA.\n  (2) proportion of OA articles per journal per year needs to be reported and\ntaken into account.\n  (3) The Journal Impact Factor and the relation between the size of the OA\nAdvantage article 'citation-bracket' need to be taken into account.\n  (4) The sample-size for the highest-impact, largest-sample journal analyzed,\nPNAS, is restricted and excluded from some of the analyses. The full PNAS\ndataset is needed.\n  (5) The interaction between OA and time, 2004-2007, is based on retrospective\ndata from a June 2008 total cumulative citation count. The dates of both the\ncited articles and the citing articles need to be taken into account.\n  The author proposes that author self-selection bias for is the primary cause\nof the observed OA Advantage, but this study does not test this or of any of\nthe other potential causal factors. The author suggests that paid OA is not\nworth the cost, per extra citation. But with OA self-archiving both the OA and\nthe extra citations are free.\n", "versions": [{"version": "v1", "created": "Mon, 25 Aug 2008 03:36:14 GMT"}, {"version": "v2", "created": "Tue, 26 Aug 2008 17:09:08 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Harnad", "Stevan", ""]]}, {"id": "0808.3511", "submitter": "K. P. Unnikrishnan", "authors": "P.S. Sastry (Indian Institute of Science), and K.P. Unnikrishnan\n  (General Motors Research)", "title": "Conditional probability based significance tests for sequential patterns\n  in multi-neuronal spike trains", "comments": "35 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn cs.DB q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider the problem of detecting statistically significant\nsequential patterns in multi-neuronal spike trains. These patterns are\ncharacterized by ordered sequences of spikes from different neurons with\nspecific delays between spikes. We have previously proposed a data mining\nscheme to efficiently discover such patterns which are frequent in the sense\nthat the count of non-overlapping occurrences of the pattern in the data stream\nis above a threshold. Here we propose a method to determine the statistical\nsignificance of these repeating patterns and to set the thresholds\nautomatically. The novelty of our approach is that we use a compound null\nhypothesis that includes not only models of independent neurons but also models\nwhere neurons have weak dependencies. The strength of interaction among the\nneurons is represented in terms of certain pair-wise conditional probabilities.\nWe specify our null hypothesis by putting an upper bound on all such\nconditional probabilities. We construct a probabilistic model that captures the\ncounting process and use this to calculate the mean and variance of the count\nfor any pattern. Using this we derive a test of significance for rejecting such\na null hypothesis. This also allows us to rank-order different significant\npatterns. We illustrate the effectiveness of our approach using spike trains\ngenerated from a non-homogeneous Poisson model with embedded dependencies.\n", "versions": [{"version": "v1", "created": "Tue, 26 Aug 2008 13:28:43 GMT"}, {"version": "v2", "created": "Thu, 28 Aug 2008 02:15:45 GMT"}], "update_date": "2008-08-28", "authors_parsed": [["Sastry", "P. S.", "", "Indian Institute of Science"], ["Unnikrishnan", "K. P.", "", "General Motors Research"]]}]