[{"id": "0905.0363", "submitter": "Wojciech Mazurczyk", "authors": "Wojciech Mazurczyk, Milosz Smolarczyk, Krzysztof Szczypiorski", "title": "Hiding Information in Retransmissions", "comments": "12 pages, 12 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents a new steganographic method called RSTEG (Retransmission\nSteganography), which is intended for a broad class of protocols that utilises\nretransmission mechanisms. The main innovation of RSTEG is to not acknowledge a\nsuccessfully received packet in order to intentionally invoke retransmission.\nThe retransmitted packet carries a steganogram instead of user data in the\npayload field. RSTEG is presented in the broad context of network\nsteganography, and the utilisation of RSTEG for TCP (Transport Control\nProtocol) retransmission mechanisms is described in detail. Simulation results\nare also presented with the main aim to measure and compare the steganographic\nbandwidth of the proposed method for different TCP retransmission mechanisms as\nwell as to determine the influence of RSTEG on the network retransmissions\nlevel.\n", "versions": [{"version": "v1", "created": "Mon, 4 May 2009 12:18:32 GMT"}, {"version": "v2", "created": "Tue, 5 May 2009 07:08:03 GMT"}, {"version": "v3", "created": "Thu, 14 May 2009 20:58:34 GMT"}], "update_date": "2009-05-14", "authors_parsed": [["Mazurczyk", "Wojciech", ""], ["Smolarczyk", "Milosz", ""], ["Szczypiorski", "Krzysztof", ""]]}, {"id": "0905.0417", "submitter": "N. Prasanth Anthapadmanabhan", "authors": "N. Prasanth Anthapadmanabhan and Alexander Barg", "title": "Two-Level Fingerprinting Codes", "comments": "5 pages, 1 figure, Proc. 2009 IEEE International Symposium on\n  Information Theory (ISIT 2009), Seoul, Korea, June 28 - July 3, 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the notion of two-level fingerprinting and traceability codes.\nIn this setting, the users are organized in a hierarchical manner by\nclassifying them into various groups; for instance, by dividing the\ndistribution area into several geographic regions, and collecting users from\nthe same region into one group. Two-level fingerprinting and traceability codes\nhave the following property: As in traditional (one-level) codes, when given an\nillegal copy produced by a coalition of users, the decoder identifies one of\nthe guilty users if the coalition size is less than a certain threshold $t$.\nMoreover, even when the coalition is of a larger size $s$ $(> t)$, the decoder\nstill provides partial information by tracing one of the groups containing a\nguilty user.\n  We establish sufficient conditions for a code to possess the two-level\ntraceability property. In addition, we also provide constructions for two-level\nfingerprinting codes and characterize the corresponding set of achievable\nrates.\n", "versions": [{"version": "v1", "created": "Mon, 4 May 2009 16:26:27 GMT"}], "update_date": "2009-05-05", "authors_parsed": [["Anthapadmanabhan", "N. Prasanth", ""], ["Barg", "Alexander", ""]]}, {"id": "0905.0440", "submitter": "Willie Harrison", "authors": "Willie K Harrison and Steven W. McLaughlin", "title": "Tandem Coding and Cryptography on Wiretap Channels: EXIT Chart Analysis", "comments": "11 pages, 5 figures, accepted at 2009 IEEE International Symposium on\n  Information Theory (ISIT 2009)", "journal-ref": null, "doi": "10.1109/ISIT.2009.5205606", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional cryptography assumes an eavesdropper receives an error-free copy\nof the transmitted ciphertext. Wyner's wiretap channel model recognizes that at\nthe physical layer both the intended receiver and the passive eavesdropper\ninevitably receive an error-prone version of the transmitted message which must\nbe corrected prior to decryption. This paper considers the implications of\nusing both channel and cryptographic codes under the wiretap channel model in a\nway that enhances the \\emph{information-theoretic} security for the friendly\nparties by keeping the information transfer to the eavesdropper small. We\nconsider a secret-key cryptographic system with a linear feedback shift\nregister (LFSR)-based keystream generator and observe the mutual information\nbetween an LFSR-generated sequence and the received noise-corrupted ciphertext\nsequence under a known-plaintext scenario. The effectiveness of a noniterative\nfast correlation attack, which reduces the search time in a brute-force attack,\nis shown to be correlated with this mutual information. For an iterative fast\ncorrelation attack on this cryptographic system, it is shown that an EXIT chart\nand mutual information are very good predictors of decoding success and failure\nby a passive eavesdropper.\n", "versions": [{"version": "v1", "created": "Mon, 4 May 2009 17:54:18 GMT"}], "update_date": "2015-09-24", "authors_parsed": [["Harrison", "Willie K", ""], ["McLaughlin", "Steven W.", ""]]}, {"id": "0905.0794", "submitter": "Weiguo Zhang", "authors": "WeiGuo Zhang and GuoZhen Xiao", "title": "Constructions of Almost Optimal Resilient Boolean Functions on Large\n  Even Number of Variables", "comments": "14 pages, 2 tables", "journal-ref": "IEEE Transactions on Information Theory, vol. 55, no. 12, pp.\n  5822-5831, December 2009", "doi": "10.1109/TIT.2009.2032736", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, a technique on constructing nonlinear resilient Boolean\nfunctions is described. By using several sets of disjoint spectra functions on\na small number of variables, an almost optimal resilient function on a large\neven number of variables can be constructed. It is shown that given any $m$,\none can construct infinitely many $n$-variable ($n$ even), $m$-resilient\nfunctions with nonlinearity $>2^{n-1}-2^{n/2}$. A large class of highly\nnonlinear resilient functions which were not known are obtained. Then one\nmethod to optimize the degree of the constructed functions is proposed. Last,\nan improved version of the main construction is given.\n", "versions": [{"version": "v1", "created": "Wed, 6 May 2009 10:05:40 GMT"}, {"version": "v2", "created": "Thu, 6 Aug 2009 07:07:12 GMT"}, {"version": "v3", "created": "Sun, 25 Oct 2009 02:41:04 GMT"}, {"version": "v4", "created": "Tue, 27 Oct 2009 03:25:41 GMT"}, {"version": "v5", "created": "Wed, 4 Nov 2009 08:31:13 GMT"}], "update_date": "2009-11-18", "authors_parsed": [["Zhang", "WeiGuo", ""], ["Xiao", "GuoZhen", ""]]}, {"id": "0905.1307", "submitter": "Michael Goodrich", "authors": "Michael T. Goodrich, Roberto Tamassia, Jasminka Hasic", "title": "An Efficient Dynamic and Distributed RSA Accumulator", "comments": "Expanded version of a paper appearing in the 5th International\n  Information Security Conference (ISC)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how to use the RSA one-way accumulator to realize an efficient and\ndynamic authenticated dictionary, where untrusted directories provide\ncryptographically verifiable answers to membership queries on a set maintained\nby a trusted source. Our accumulator-based scheme for authenticated\ndictionaries supports efficient incremental updates of the underlying set by\ninsertions and deletions of elements. Also, the user can optimally verify in\nconstant time the authenticity of the answer provided by a directory with a\nsimple and practical algorithm. We have also implemented this scheme and we\ngive empirical results that can be used to determine the best strategy for\nsystems implementation with respect to resources that are available. This work\nhas applications to certificate revocation in public key infrastructure and\nend-to-end integrity of data collections published by third parties on the\nInternet.\n", "versions": [{"version": "v1", "created": "Fri, 8 May 2009 17:49:57 GMT"}], "update_date": "2009-05-11", "authors_parsed": [["Goodrich", "Michael T.", ""], ["Tamassia", "Roberto", ""], ["Hasic", "Jasminka", ""]]}, {"id": "0905.1362", "submitter": "Joaquin Garcia-Alfaro", "authors": "Stere Preda, Nora Cuppens-Boulahia, Frederic Cuppens, Joaquin\n  Garcia-Alfaro, and Laurent Toutain", "title": "Reliable Process for Security Policy Deployment", "comments": "12 pages", "journal-ref": "Proc. 2007 International Conference on Security and Cryptography\n  (Secrypt 2007), Barcelona, Spain, July 2007", "doi": null, "report-no": null, "categories": "cs.CR cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We focus in this paper on the problem of configuring and managing network\nsecurity devices, such as Firewalls, Virtual Private Network (VPN) tunnels, and\nIntrusion Detection Systems (IDSs). Our proposal is the following. First, we\nformally specify the security requirements of a given system by using an\nexpressive access control model. As a result, we obtain an abstract security\npolicy, which is free of ambiguities, redundancies or unnecessary details.\nSecond, we deploy such an abstract policy through a set of automatic\ncompilations into the security devices of the system. This proposed deployment\nprocess not only simplifies the security administrator's job, but also\nguarantees a resulting configuration free of anomalies and/or inconsistencies.\n", "versions": [{"version": "v1", "created": "Sat, 9 May 2009 01:37:47 GMT"}], "update_date": "2009-05-12", "authors_parsed": [["Preda", "Stere", ""], ["Cuppens-Boulahia", "Nora", ""], ["Cuppens", "Frederic", ""], ["Garcia-Alfaro", "Joaquin", ""], ["Toutain", "Laurent", ""]]}, {"id": "0905.1375", "submitter": "Yen-Wei Huang", "authors": "Yen-Wei Huang, Pierre Moulin", "title": "Saddle-point Solution of the Fingerprinting Capacity Game Under the\n  Marking Assumption", "comments": "5 pages, to appear in 2009 IEEE International Symposium on\n  Information Theory (ISIT 2009), Seoul, Korea, June 2009", "journal-ref": null, "doi": "10.1109/ISIT.2009.5205882", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a fingerprinting game in which the collusion channel is unknown. The\nencoder embeds fingerprints into a host sequence and provides the decoder with\nthe capability to trace back pirated copies to the colluders.\n  Fingerprinting capacity has recently been derived as the limit value of a\nsequence of maxmin games with mutual information as the payoff function.\nHowever, these games generally do not admit saddle-point solutions and are very\nhard to solve numerically. Here under the so-called Boneh-Shaw marking\nassumption, we reformulate the capacity as the value of a single two-person\nzero-sum game, and show that it is achieved by a saddle-point solution.\n  If the maximal coalition size is $k$ and the fingerprint alphabet is binary,\nwe derive equations that can numerically solve the capacity game for arbitrary\n$k$. We also provide tight upper and lower bounds on the capacity. Finally, we\ndiscuss the asymptotic behavior of the fingerprinting game for large $k$ and\npractical implementation issues.\n", "versions": [{"version": "v1", "created": "Sat, 9 May 2009 04:43:44 GMT"}], "update_date": "2010-11-05", "authors_parsed": [["Huang", "Yen-Wei", ""], ["Moulin", "Pierre", ""]]}, {"id": "0905.1385", "submitter": "Vit Niennattrakul", "authors": "Vit Niennattrakul, Chotirat Ann Ratanamahatana", "title": "Making Hand Geometry Verification System More Accurate Using Time Series\n  Representation with R-K Band Learning", "comments": "In Proceedings of 11th National Computer Science and Engineering\n  Conference (NCSEC 2007), Bangkok, Thailand, 19/11/2007. 8 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  At present, applications of biometrics are rapidly increasing due to\ninconveniences in using traditional passwords and physical keys. Hand geometry,\none of the most well-known biometrics, is implemented in many verification\nsystems with various feature extraction methods. In recent work, a hand\ngeometry verification system using time series conversion techniques and\nDynamic Time Warping (DTW) distance measure with Sakoe-Chiba band has been\nproposed. This system demonstrates many advantages, especially ease of\nimplementation and small storage space requirement using time series\nrepresentation. In this paper, we propose a novel hand geometry verification\nsystem that exploits DTW distance measure and R-K band learning to further\nimprove the system performance. Finally, our evaluation reveals that our\nproposed system outperforms the current system by a wide margin, in terms of\nFalse Acceptance Rate (FAR), False Rejection Rate (FRR), and Total Success Rate\n(TSR) at Equal Error Rate (EER).\n", "versions": [{"version": "v1", "created": "Sat, 9 May 2009 17:31:37 GMT"}], "update_date": "2009-05-12", "authors_parsed": [["Niennattrakul", "Vit", ""], ["Ratanamahatana", "Chotirat Ann", ""]]}, {"id": "0905.1778", "submitter": "Salah A. Aly", "authors": "Salah A. Aly, Ahmed E. Kamal", "title": "Encoding of Network Protection Codes Against Link and Node Failures Over\n  Finite Fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Link and node failures are common two fundamental problems that affect\noperational networks. Hence, protection of communication networks is essential\nto increase their reliability, performance, and operations. Much research work\nhas been done to protect against link and node failures, and to provide\nreliable solutions based on pre-defined provision or dynamic restoration of the\ndomain. In this paper we develop network protection strategies against multiple\nlink failures using network coding and joint capacities. In these strategies,\nthe source nodes apply network coding for their transmitted data to provide\nbackup copies for recovery at the receivers' nodes. Such techniques can be\napplied to optical, IP, and mesh networks. The encoding operations of\nprotection codes are defined over finite fields. Furthermore, the normalized\ncapacity of the communication network is given by $(n-t)/n$ in case of $t$ link\nfailures. In addition, a bound on the minimum required field size is derived.\n", "versions": [{"version": "v1", "created": "Tue, 12 May 2009 07:44:45 GMT"}], "update_date": "2009-06-30", "authors_parsed": [["Aly", "Salah A.", ""], ["Kamal", "Ahmed E.", ""]]}, {"id": "0905.2158", "submitter": "Emiliano De Cristofaro", "authors": "Emiliano De Cristofaro and Xuhua Ding and Gene Tsudik", "title": "Privacy-Preserving Querying in Sensor Networks", "comments": "Preliminary version of this paper appeared in the Proceedings of\n  ICCCN'09 under the same title", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Sensor Networks (WSNs) provide sensing and monitoring services by\nmeans of many tiny autonomous devices equipped with wireless radio\ntransceivers. As WSNs are deployed on a large-scale and/or on long-term basis,\nnot only traditional security but also privacy issues must be taken into\naccount. Furthermore, when network operators offer on-demand access to sensor\nmeasurements to their clients, query mechanisms should ideally leak neither\nclient interests nor query patterns. In this paper, we present a\nprivacy-preserving WSN query mechanism that uses standard cryptographic\ntechniques. Besides preventing unauthorized entities from accessing sensor\nreadings, it minimizes leakage of (potentially sensitive) information about\nusers' query targets and patterns.\n", "versions": [{"version": "v1", "created": "Wed, 13 May 2009 18:02:51 GMT"}], "update_date": "2009-05-14", "authors_parsed": [["De Cristofaro", "Emiliano", ""], ["Ding", "Xuhua", ""], ["Tsudik", "Gene", ""]]}, {"id": "0905.2177", "submitter": "Andreas Enge", "authors": "Andreas Enge (INRIA Bordeaux - Sud-Ouest), Pierrick Gaudry (INRIA\n  Lorraine - LORIA), Emmanuel Thom\\'e (INRIA Lorraine - LORIA)", "title": "An $L (1/3)$ Discrete Logarithm Algorithm for Low Degree Curves", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.AG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an algorithm for solving the discrete logarithm problem in\nJacobians of families of plane curves whose degrees in $X$ and $Y$ are low with\nrespect to their genera. The finite base fields $\\FF_q$ are arbitrary, but\ntheir sizes should not grow too fast compared to the genus. For such families,\nthe group structure and discrete logarithms can be computed in subexponential\ntime of $L_{q^g}(1/3, O(1))$. The runtime bounds rely on heuristics similar to\nthe ones used in the number field sieve or the function field sieve.\n", "versions": [{"version": "v1", "created": "Wed, 13 May 2009 19:43:15 GMT"}, {"version": "v2", "created": "Sun, 20 Dec 2009 17:24:45 GMT"}], "update_date": "2009-12-20", "authors_parsed": [["Enge", "Andreas", "", "INRIA Bordeaux - Sud-Ouest"], ["Gaudry", "Pierrick", "", "INRIA\n  Lorraine - LORIA"], ["Thomé", "Emmanuel", "", "INRIA Lorraine - LORIA"]]}, {"id": "0905.2449", "submitter": "Serguei Mokhov", "authors": "Serguei A. Mokhov", "title": "The Role of Self-Forensics in Vehicle Crash Investigations and Event\n  Reconstruction", "comments": "10 pages; preliminary version for CMRSC", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI cs.CR cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper further introduces and formalizes a novel concept of\nself-forensics for automotive vehicles, specified in the Forensic Lucid\nlanguage. We argue that self-forensics, with the forensics taken out of the\ncybercrime domain, is applicable to \"self-dissection\" of intelligent vehicles\nand hardware systems for automated incident and anomaly analysis and event\nreconstruction by the software with or without the aid of the engineering teams\nin a variety of forensic scenarios. We propose a formal design, requirements,\nand specification of the self-forensic enabled units (similar to blackboxes) in\nvehicles that will help investigation of incidents and also automated reasoning\nand verification of theories along with the events reconstruction in a formal\nmodel. We argue such an analysis is beneficial to improve the safety of the\npassengers and their vehicles, like the airline industry does for planes.\n", "versions": [{"version": "v1", "created": "Fri, 15 May 2009 00:08:02 GMT"}], "update_date": "2009-05-18", "authors_parsed": [["Mokhov", "Serguei A.", ""]]}, {"id": "0905.2977", "submitter": "Subhash Kak", "authors": "Subhash Kak", "title": "Cryptography for Multi-Located Parties", "comments": "7 pages; 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This note describes some cryptographic issues related to multi-located\nparties. In general, multi-located parties make it difficult for the\neavesdropper to mount the man-in-the-middle attack. Conversely, they make it\neasier to address problems such as joint encryption and error correction\ncoding. It is easier to implement the three-stage quantum cryptography\nprotocol.\n", "versions": [{"version": "v1", "created": "Mon, 18 May 2009 20:29:22 GMT"}], "update_date": "2009-05-20", "authors_parsed": [["Kak", "Subhash", ""]]}, {"id": "0905.3135", "submitter": "Ayan Mahalanobis", "authors": "Ayan Mahalanobis", "title": "The discrete logarithm problem in the group of non-singular circulant\n  matrices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The discrete logarithm problem is one of the backbones in public key\ncryptography. In this paper we study the discrete logarithm problem in the\ngroup of circulant matrices over a finite field. This gives rise to secure and\nfast public key cryptosystems.\n", "versions": [{"version": "v1", "created": "Tue, 19 May 2009 15:31:31 GMT"}, {"version": "v2", "created": "Mon, 21 Sep 2009 12:46:07 GMT"}], "update_date": "2009-09-21", "authors_parsed": [["Mahalanobis", "Ayan", ""]]}, {"id": "0905.4325", "submitter": "Masahiro Takeoka", "authors": "Donna Dodson, Mikio Fujiwara, Philippe Grangier, Masahito Hayashi,\n  Kentaro Imafuku, Ken-ichi Kitayama, Prem Kumar, Christian Kurtsiefer, Gaby\n  Lenhart, Norbert Luetkenhaus, Tsutomu Matsumoto, William J. Munro, Tsuyoshi\n  Nishioka, Momtchil Peev, Masahide Sasaki, Yutaka Sata, Atsushi Takada,\n  Masahiro Takeoka, Kiyoshi Tamaki, Hidema Tanaka, Yasuhiro Tokura, Akihisa\n  Tomita, Morio Toyoshima, Rodney van Meter, Atsuhiro Yamagishi, Yoshihisa\n  Yamamoto, Akihiro Yamamura", "title": "Updating Quantum Cryptography Report ver. 1", "comments": "74 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum cryptographic technology (QCT) is expected to be a fundamental\ntechnology for realizing long-term information security even against\nas-yet-unknown future technologies. More advanced security could be achieved\nusing QCT together with contemporary cryptographic technologies. To develop and\nspread the use of QCT, it is necessary to standardize devices, protocols, and\nsecurity requirements and thus enable interoperability in a multi-vendor,\nmulti-network, and multi-service environment. This report is a technical\nsummary of QCT and related topics from the viewpoints of 1) consensual\nestablishment of specifications and requirements of QCT for standardization and\ncommercialization and 2) the promotion of research and design to realize\nNew-Generation Quantum Cryptography.\n", "versions": [{"version": "v1", "created": "Wed, 27 May 2009 05:41:56 GMT"}], "update_date": "2009-09-30", "authors_parsed": [["Dodson", "Donna", ""], ["Fujiwara", "Mikio", ""], ["Grangier", "Philippe", ""], ["Hayashi", "Masahito", ""], ["Imafuku", "Kentaro", ""], ["Kitayama", "Ken-ichi", ""], ["Kumar", "Prem", ""], ["Kurtsiefer", "Christian", ""], ["Lenhart", "Gaby", ""], ["Luetkenhaus", "Norbert", ""], ["Matsumoto", "Tsutomu", ""], ["Munro", "William J.", ""], ["Nishioka", "Tsuyoshi", ""], ["Peev", "Momtchil", ""], ["Sasaki", "Masahide", ""], ["Sata", "Yutaka", ""], ["Takada", "Atsushi", ""], ["Takeoka", "Masahiro", ""], ["Tamaki", "Kiyoshi", ""], ["Tanaka", "Hidema", ""], ["Tokura", "Yasuhiro", ""], ["Tomita", "Akihisa", ""], ["Toyoshima", "Morio", ""], ["van Meter", "Rodney", ""], ["Yamagishi", "Atsuhiro", ""], ["Yamamoto", "Yoshihisa", ""], ["Yamamura", "Akihiro", ""]]}, {"id": "0905.4581", "submitter": "Piotr Bania", "authors": "Piotr Bania", "title": "Generic Unpacking of Self-modifying, Aggressive, Packed Binary Programs", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays most of the malware applications are either packed or protected.\nThis techniques are applied especially to evade signature based detectors and\nalso to complicate the job of reverse engineers or security analysts. The time\none must spend on unpacking or decrypting malware layers is often very long and\nin fact remains the most complicated task in the overall process of malware\nanalysis. In this report author proposes MmmBop as a relatively new concept of\nusing dynamic binary instrumentation techniques for unpacking and bypassing\ndetection by self-modifying and highly aggressive packed binary code. MmmBop is\nable to deal with most of the known and unknown packing algorithms and it is\nalso suitable to successfully bypass most of currently used anti-reversing\ntricks. This framework does not depend on any other 3rd party software and it\nis developed entirely in user mode (ring3). MmmBop supports the IA-32\narchitecture and it is targeted for Microsoft Windows XP, some of the further\ndeliberations will be referring directly to this operating system.\n", "versions": [{"version": "v1", "created": "Thu, 28 May 2009 09:08:17 GMT"}], "update_date": "2009-05-29", "authors_parsed": [["Bania", "Piotr", ""]]}, {"id": "0905.4850", "submitter": "Joaquin Garcia-Alfaro", "authors": "Joaquin Garcia-Alfaro, Guillermo Navarro-Arribas", "title": "A Survey on Cross-Site Scripting Attacks", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web applications are becoming truly pervasive in all kinds of business models\nand organizations. Today, most critical systems such as those related to health\ncare, banking, or even emergency response, are relying on these applications.\nThey must therefore include, in addition to the expected value offered to their\nusers, reliable mechanisms to ensure their security. In this paper, we focus on\nthe specific problem of cross-site scripting attacks against web applications.\nWe present a study of this kind of attacks, and survey current approaches for\ntheir prevention. Applicability and limitations of each proposal are also\ndiscussed.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2009 13:03:57 GMT"}], "update_date": "2009-06-01", "authors_parsed": [["Garcia-Alfaro", "Joaquin", ""], ["Navarro-Arribas", "Guillermo", ""]]}]