[{"id": "1807.03111", "submitter": "Rune Jacobsen H", "authors": "Egon Kidmose, Emad Ebeid, Rune Hylsberg Jacobsen", "title": "A Framework for Detecting and Translating User Behavior from Smart Meter\n  Data", "comments": "3 pages, 4 figures, Presented at SMART 2015: The Fourth International\n  Conference on Smart Systems, Devices and Technologies, ISBN:\n  978-1-61208-414-5. June 21-26, 2015, Brussels, Belgium", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The European adoption of smart electricity meters triggers the developments\nof new value-added service for smart energy and optimal consumption. Recently,\nseveral algorithms and tools have been built to analyze smart meter's data.\nThis paper introduces an open framework and prototypes for detecting and\npresenting user behavior from its smart meter power consumption data. The\nframework aims at presenting the detected user behavior in natural language\nreports. In order to validate the proposed framework, an experiment has been\nperformed and the results have been presented.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2018 10:03:44 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Kidmose", "Egon", ""], ["Ebeid", "Emad", ""], ["Jacobsen", "Rune Hylsberg", ""]]}, {"id": "1807.06006", "submitter": "Christos Liaskos K.", "authors": "Christos Liaskos, Ageliki Tsioliaridou, Sotiris Ioannidis", "title": "Towards a Circular Economy via Intelligent Metamaterials", "comments": "Accepted for publication at IEEE CAMAD 2018 Special Session on\n  Circular Economy. Partially funded by the European Union via the Horizon\n  2020: Future Emerging Topics call (FETOPEN), grant EU736876, project\n  VISORSURF (http://www.visorsurf.eu)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present study proposes the use of intelligent metasurfaces in the design\nof products, as enforcers of circular economy principles. Intelligent\nmetasurfaces can tune their physical properties (electromagnetic, acoustic,\nmechanical) by receiving software commands. When incorporated within products\nand spaces they can mitigate the resource waste caused by inefficient,\npartially optimized designs and security concerns. Thus, circular economy and\nfast-paced product design become compatible. The study begins by considering\nelectromagnetic metamaterials, and proposes a complete methodology for their\ndeployment. Finally, it is shown that the same principles can be extended to\nthe control of mechanical properties of objects, exemplary enabling the\nmicro-management of vibrations and heat, with unprecedented circular economy\npotential.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2018 09:37:35 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Liaskos", "Christos", ""], ["Tsioliaridou", "Ageliki", ""], ["Ioannidis", "Sotiris", ""]]}, {"id": "1807.09224", "submitter": "Pierre Augier", "authors": "Pierre Augier, Ashwin Vishnu Mohanan, Cyrille Bonamy", "title": "FluidDyn: a Python open-source framework for research and teaching in\n  fluid dynamics", "comments": null, "journal-ref": null, "doi": "10.5334/jors.237", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  FluidDyn is a project to foster open-science and open-source in the fluid\ndynamics community. It is thought of as a research project to channel\nopen-source dynamics, methods and tools to do science. We propose a set of\nPython packages forming a framework to study fluid dynamics with different\nmethods, in particular laboratory experiments (package fluidlab), simulations\n(packages fluidfft, fluidsim and fluidfoam) and data processing (package\nfluidimage). In the present article, we give an overview of the specialized\npackages of the project and then focus on the base package called fluiddyn,\nwhich contains common code used in the specialized packages. Packages fluidfft\nand fluidsim are described with greater detail in two companion papers, Mohanan\net al. (2018a,b). With the project FluidDyn, we demonstrate that specialized\nscientific code can be written with methods and good practices of the\nopen-source community. The Mercurial repositories are available in Bitbucket\n(https://bitbucket.org/fluiddyn/). All codes are documented using Sphinx and\nRead the Docs, and tested with continuous integration run on Bitbucket,\nPipelines and Travis. To improve the reuse potential, the codes are as modular\nas possible, leveraging the simple object-oriented programming model of Python.\nAll codes are also written to be highly efficient, using C++, Cython and\nPythran to speedup the performance of critical functions.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 10:04:39 GMT"}], "update_date": "2019-04-10", "authors_parsed": [["Augier", "Pierre", ""], ["Mohanan", "Ashwin Vishnu", ""], ["Bonamy", "Cyrille", ""]]}, {"id": "1807.09368", "submitter": "Jans Glagolevs", "authors": "Karlis Freivalds and Jans Glagolevs", "title": "Graph Compact Orthogonal Layout Algorithm", "comments": null, "journal-ref": "Freivalds K., Glagolevs J. (2014) Graph Compact Orthogonal Layout\n  Algorithm. In: Fouilhoux P., Gouveia L., Mahjoub A., Paschos V. (eds)\n  Combinatorial Optimization. ISCO 2014. Lecture Notes in Computer Science, vol\n  8596. Springer, Cham", "doi": "10.1007/978-3-319-09174-7_22", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There exist many orthogonal graph drawing algorithms that minimize edge\ncrossings or edge bends, however they produce unsatisfactory drawings in many\npractical cases. In this paper we present a grid-based algorithm for drawing\northogonal graphs with nodes of prescribed size. It distinguishes by creating\npleasant and compact drawings in relatively small running time. The main idea\nis to minimize the total edge length that implicitly minimizes crossings and\nmakes the drawing easy to comprehend. The algorithm is based on combining local\nand global improvements. Local improvements are moving each node to a new place\nand swapping of nodes. Global improvement is based on constrained quadratic\nprogramming approach that minimizes the total edge length while keeping node\nrelative positions.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2018 21:42:29 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Freivalds", "Karlis", ""], ["Glagolevs", "Jans", ""]]}, {"id": "1807.09590", "submitter": "Qingbei Guo", "authors": "Qingbei Guo, Yuan Zhang, Jaime Lloretz, Burak Kantarcix, Winston K.G.\n  Seah", "title": "A Localization Method Avoiding Flip Ambiguities for micro-UAVs with\n  Bounded Distance Measurement Errors", "comments": "14 pages, 8 figures, IEEE Transactions on Mobile Computing(Accepted)", "journal-ref": "Qingbei Guo, Yuan Zhang, Jaime Lloretz, Burak Kantarcix and\n  Winston K.G. Seah, A Localization Method Avoiding Flip Ambiguities for\n  micro-UAVs with Bounded Distance Measurement Errors, IEEE Transactions on\n  Mobile Computing, 2018", "doi": "10.1109/TMC.2018.2865462", "report-no": null, "categories": "eess.SP cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Localization is a fundamental function in cooperative control of micro\nunmanned aerial vehicles (UAVs), but is easily affected by flip ambiguities\nbecause of measurement errors and flying motions. This study proposes a\nlocalization method that can avoid the occurrence of flip ambiguities in\nbounded distance measurement errors and constrained flying motions; to\ndemonstrate its efficacy, the method is implemented on bilateration and\ntrilateration. For bilateration, an improved bi-boundary model based on the\nunit disk graph model is created to compensate for the shortage of distance\nconstraints, and two boundaries are estimated as the communication range\nconstraint. The characteristic of the intersections of the communication range\nand distance constraints is studied to present a unique localization criterion\nwhich can avoid the occurrence of flip ambiguities. Similarly, for\ntrilateration, another unique localization criterion for avoiding flip\nambiguities is proposed according to the characteristic of the intersections of\nthree distance constraints. The theoretical proof shows that these proposed\ncriteria are correct. A localization algorithm is constructed based on these\ntwo criteria. The algorithm is validated using simulations for different\nscenarios and parameters, and the proposed method is shown to provide excellent\nlocalization performance in terms of average estimated error. Our code can be\nfound at: https://github.com/QingbeiGuo/AFALA.git.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2018 01:25:51 GMT"}, {"version": "v2", "created": "Tue, 18 Sep 2018 10:35:39 GMT"}], "update_date": "2018-09-19", "authors_parsed": [["Guo", "Qingbei", ""], ["Zhang", "Yuan", ""], ["Lloretz", "Jaime", ""], ["Kantarcix", "Burak", ""], ["Seah", "Winston K. G.", ""]]}]