[{"id": "2006.00891", "submitter": "Olivier Carton", "authors": "Olivier Carton", "title": "Preservation of normality by unambiguous transducers", "comments": "arXiv admin note: substantial text overlap with arXiv:1904.09133", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider finite state non-deterministic but unambiguous transducers with\ninfinite inputs and infinite outputs, and we consider the property of Borel\nnormality of sequences of symbols. When these transducers are strongly\nconnected, and when the input is a Borel normal sequence, the output is a\nsequence in which every block has a frequency given by a weighted automaton\nover the rationals. We provide an algorithm that decides in cubic time whether\na unambiguous transducer preserves normality.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2020 08:32:31 GMT"}, {"version": "v2", "created": "Wed, 3 Jun 2020 08:45:23 GMT"}, {"version": "v3", "created": "Tue, 16 Jun 2020 12:02:37 GMT"}], "update_date": "2020-06-17", "authors_parsed": [["Carton", "Olivier", ""]]}, {"id": "2006.01236", "submitter": "Matteo Pradella", "authors": "Dino Mandrioli (1), Matteo Pradella (1 and 2), Stefano Crespi Reghizzi\n  (1 and 2) ((1) Politecnico di Milano, (2) CNR-IEIIT)", "title": "Aperiodicity, Star-freeness, and First-order Definability of Structured\n  Context-Free Languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A classic result in formal language theory is the equivalence among\nnoncounting, or aperiodic, regular languages, and languages defined through\nstar-free regular expressions, or first-order logic. Together with first-order\ncompleteness of linear temporal logic these results constitute a theoretical\nfoundation for model-checking algorithms. Extending these results to structured\nsubclasses of context-free languages, such as tree-languages did not work as\nsmoothly: for instance W. Thomas showed that there are star-free tree languages\nthat are counting. We show, instead, that investigating the same properties\nwithin the family of operator precedence languages leads to equivalences that\nperfectly match those on regular languages. The study of this old family of\ncontext-free languages has been recently resumed to enhance not only parsing\n(the original motivation of its inventor R. Floyd) but also to exploit their\nalgebraic and logic properties. We have been able to reproduce the classic\nresults of regular languages for this much larger class by going back to string\nlanguages rather than tree languages. Since operator precedence languages\nstrictly include other classes of structured languages such as visibly pushdown\nlanguages, the same results given in this paper hold as trivial corollary for\nthat family too.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2020 20:14:30 GMT"}, {"version": "v2", "created": "Mon, 31 May 2021 09:41:44 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Mandrioli", "Dino", "", "Politecnico di Milano"], ["Pradella", "Matteo", "", "1 and 2"], ["Reghizzi", "Stefano Crespi", "", "1 and 2"]]}, {"id": "2006.01903", "submitter": "Stefan Hoffmann", "authors": "Stefan Hoffmann", "title": "On a Class of Constrained Synchronization Problems in NP", "comments": "arXiv admin note: text overlap with arXiv:2005.05907", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The class of known constraint automata for which the constrained\nsynchronization problem is in NP all admit a special form. In this work, we\ntake a closer look at them. We characterize a wider class of constraint\nautomata that give constrained synchronization problems in NP, which\nencompasses all known problems in NP. We call these automata polycyclic\nautomata. The corresponding language class of polycyclic languages is\nintroduced. We show various characterizations and closure properties for this\nnew language class. We then give a criterion for NP-completeness and a\ncriterion for polynomial time solvability for polycyclic constraint languages.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2020 19:36:48 GMT"}], "update_date": "2020-06-04", "authors_parsed": [["Hoffmann", "Stefan", ""]]}, {"id": "2006.02316", "submitter": "Dmytro Savchuk", "authors": "Rostislav Grigorchuk and Dmytro Savchuk", "title": "Solenoid Maps, Automatic Sequences, Van Der Put Series, and Mealy-Moore\n  Automata", "comments": "33 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ring $\\mathbb Z_d$ of $d$-adic integers has a natural interpretation as\nthe boundary of a rooted $d$-ary tree $T_d$. Endomorphisms of this tree (i.e.\nsolenoid maps) are in one-to-one correspondence with 1-Lipschitz mappings from\n$\\mathbb Z_d$ to itself and automorphisms of $T_d$ constitute the group\n$\\mathrm{Isom}(\\mathbb Z_d)$. In the case when $d=p$ is prime, Anashin showed\nthat $f\\in\\mathrm{Lip}^1(\\mathbb Z_p)$ is defined by a finite Mealy automaton\nif and only if the reduced coefficients of its van der Put series constitute a\n$p$-automatic sequence over a finite subset of $\\mathbb Z_p\\cap\\mathbb Q$. We\ngeneralize this result to arbitrary integer $d\\geq 2$, describe the explicit\nconnection between the Moore automaton producing such sequence and the Mealy\nautomaton inducing the corresponding endomorphism. Along the process we produce\ntwo algorithms allowing to convert the Mealy automaton of an endomorphism to\nthe corresponding Moore automaton generating the sequence of the reduced van\nder Put coefficients of the induced map on $\\mathbb Z_d$ and vice versa. We\ndemonstrate examples of applications of these algorithms for the case when the\nsequence of coefficients is Thue-Morse sequence, and also for one of the\ngenerators of the standard automaton representation of the lamplighter group.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jun 2020 15:03:11 GMT"}], "update_date": "2020-06-04", "authors_parsed": [["Grigorchuk", "Rostislav", ""], ["Savchuk", "Dmytro", ""]]}, {"id": "2006.02715", "submitter": "Vincenzo Arceri", "authors": "Luca Negrini, Vincenzo Arceri, Pietro Ferrara, Agostino Cortesi", "title": "Twinning automata and regular expressions for string static analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we formalize and prove the soundness of Tarsis, a new abstract\ndomain based on the abstract interpretation theory that approximates string\nvalues through finite state automata. The main novelty of Tarsis is that it\nworks over an alphabet of strings instead of single characters. On the one\nhand, such approach requires a more complex and refined definition of the\nwidening operator, and the abstract semantics of string operators. On the other\nhand, it is in position to obtain strictly more precise results than than\nstate-of-the-art approaches. We implemented a prototype of Tarsis, and we\napplied it on some case studies taken from some of the most popular Java\nlibraries manipulating string values. The experimental results confirm that\nTarsis is in position to obtain strictly more precise results than existing\nanalyses.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2020 09:14:05 GMT"}], "update_date": "2020-06-05", "authors_parsed": [["Negrini", "Luca", ""], ["Arceri", "Vincenzo", ""], ["Ferrara", "Pietro", ""], ["Cortesi", "Agostino", ""]]}, {"id": "2006.03651", "submitter": "Ankur Mali", "authors": "John Stogin, Ankur Mali and C Lee Giles", "title": "Provably Stable Interpretable Encodings of Context Free Grammars in RNNs\n  with a Differentiable Stack", "comments": "20 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.FL stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Given a collection of strings belonging to a context free grammar (CFG) and\nanother collection of strings not belonging to the CFG, how might one infer the\ngrammar? This is the problem of grammatical inference. Since CFGs are the\nlanguages recognized by pushdown automata (PDA), it suffices to determine the\nstate transition rules and stack action rules of the corresponding PDA. An\napproach would be to train a recurrent neural network (RNN) to classify the\nsample data and attempt to extract these PDA rules. But neural networks are not\na priori aware of the structure of a PDA and would likely require many samples\nto infer this structure. Furthermore, extracting the PDA rules from the RNN is\nnontrivial. We build a RNN specifically structured like a PDA, where weights\ncorrespond directly to the PDA rules. This requires a stack architecture that\nis somehow differentiable (to enable gradient-based learning) and stable (an\nunstable stack will show deteriorating performance with longer strings). We\npropose a stack architecture that is differentiable and that provably exhibits\norbital stability. Using this stack, we construct a neural network that\nprovably approximates a PDA for strings of arbitrary length. Moreover, our\nmodel and method of proof can easily be generalized to other state machines,\nsuch as a Turing Machine.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2020 19:45:49 GMT"}, {"version": "v2", "created": "Wed, 10 Jun 2020 16:59:42 GMT"}, {"version": "v3", "created": "Thu, 11 Jun 2020 01:01:49 GMT"}], "update_date": "2020-06-12", "authors_parsed": [["Stogin", "John", ""], ["Mali", "Ankur", ""], ["Giles", "C Lee", ""]]}, {"id": "2006.03751", "submitter": "Samuel Huang", "authors": "Samuel Huang and Rance Cleaveland", "title": "Temporal-Logic Query Checking over Finite Data Streams", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a technique for inferring temporal-logic properties for\nsets of finite data streams. Such data streams arise in many domains, including\nserver logs, program testing, and financial and marketing data; temporal-logic\nformulas that are satisfied by all data streams in a set can provide insight\ninto the underlying dynamics of the system generating these streams. Our\napproach makes use of so-called Linear Temporal Logic (LTL) queries, which are\nLTL formulas containing a missing subformula and interpreted over finite data\nstreams. Solving such a query involves computing a subformula that can be\ninserted into the query so that the resulting grounded formula is satisfied by\nall data streams in the set. We describe an automaton-driven approach to\nsolving this query-checking problem and demonstrate a working implementation\nvia a pilot study.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jun 2020 01:36:12 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Huang", "Samuel", ""], ["Cleaveland", "Rance", ""]]}, {"id": "2006.04177", "submitter": "Jeffrey Shallit", "authors": "Jeffrey Shallit", "title": "Sumsets of Wythoff Sequences, Fibonacci Representation, and Beyond", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.FL math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $\\alpha = (1+\\sqrt{5})/2$ and define the lower and upper Wythoff\nsequences by $a_i = \\lfloor i \\alpha \\rfloor$, $b_i = \\lfloor i \\alpha^2\n\\rfloor$ for $i \\geq 1$. In a recent interesting paper, Kawsumarng et al.\nproved a number of results about numbers representable as sums of the form $a_i\n+ a_j$, $b_i + b_j$, $a_i + b_j$, and so forth. In this paper I show how to\nderive all of their results, using one simple idea and existing free software\ncalled Walnut. The key idea is that for each of their sumsets, there is a\nrelatively small automaton accepting the Fibonacci representation of the\nnumbers represented. I also show how the automaton approach can easily prove\nother results.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jun 2020 15:10:48 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Shallit", "Jeffrey", ""]]}, {"id": "2006.04652", "submitter": "Adriano Peron", "authors": "Laura Bozzelli, Alberto Molinari, Angelo Montanari, Adriano Peron,\n  Pietro Sala", "title": "Satisfiability and Model Checking for the Logic of Sub-Intervals under\n  the Homogeneity Assumption", "comments": "arXiv admin note: text overlap with arXiv:1901.03880", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The expressive power of interval temporal logics (ITLs) makes them really\nfascinating, and one of the most natural choices as specification and planning\nlanguage. However, for a long time, due to their high computational complexity,\nthey were considered not suitable for practical purposes. The recent discovery\nof several computationally well-behaved ITLs has finally changed the scenario.\nIn this paper, we investigate the finite satisfiability and model checking\nproblems for the ITL D featuring the sub-interval relation, under the\nhomogeneity assumption (that constrains a proposition letter to hold over an\ninterval if and only if it holds over all its points). First we prove that the\nsatisfiability problem for D, over finite linear orders, is PSPACE-complete;\nthen we show that its model checking problem, over finite Kripke structures, is\nPSPACE-complete as well. The paper enrich the set of tractable interval\ntemporal logics with a meaningful representative.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2020 14:56:08 GMT"}, {"version": "v2", "created": "Fri, 23 Jul 2021 13:39:36 GMT"}], "update_date": "2021-07-26", "authors_parsed": [["Bozzelli", "Laura", ""], ["Molinari", "Alberto", ""], ["Montanari", "Angelo", ""], ["Peron", "Adriano", ""], ["Sala", "Pietro", ""]]}, {"id": "2006.05275", "submitter": "Lorenzo Clemente", "authors": "Lorenzo Clemente", "title": "On the complexity of the universality and inclusion problems for\n  unambiguous context-free grammars (technical report)", "comments": "full technical report of a paper to appear in VPT 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the computational complexity of universality and inclusion problems\nfor unambiguous finite automata and context-free grammars. We observe that\nseveral such problems can be reduced to the universality problem for\nunambiguous context-free grammars. The latter problem has long been known to be\ndecidable and we propose a PSPACE algorithm that works by reduction to the\nzeroness problem of recurrence equations with convolution. We are not aware of\nany non-trivial complexity lower bounds. However, we show that computing the\ncoin-flip measure of an unambiguous context-free language, a quantitative\ngeneralisation of universality, is hard for the long-standing open problem\nSQRTSUM.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2020 14:04:46 GMT"}, {"version": "v2", "created": "Thu, 11 Jun 2020 05:38:02 GMT"}], "update_date": "2020-06-12", "authors_parsed": [["Clemente", "Lorenzo", ""]]}, {"id": "2006.06307", "submitter": "Jarkko Peltom\\\"aki", "authors": "Jarkko Peltom\\\"aki and Markus A. Whiteland", "title": "Avoiding abelian powers cyclically", "comments": "18 pages, 1 figure", "journal-ref": "Advances in Applied Mathematics, Vol. 121, 102095:1-22 (2020)", "doi": "10.1016/j.aam.2020.102095", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a new notion of cyclic avoidance of abelian powers. A finite word\n$w$ avoids abelian $N$-powers cyclically if for each abelian $N$-power of\nperiod $m$ occurring in the infinite word $w^\\omega$, we have $m \\geq |w|$. Let\n$\\mathcal{A}(k)$ be the least integer $N$ such that for all $n$ there exists a\nword of length $n$ over a $k$-letter alphabet that avoids abelian $N$-powers\ncyclically. Let $\\mathcal{A}_\\infty(k)$ be the least integer $N$ such that\nthere exist arbitrarily long words over a $k$-letter alphabet that avoid\nabelian $N$-powers cyclically.\n  We prove that $5 \\leq \\mathcal{A}(2) \\leq 8$, $3 \\leq \\mathcal{A}(3) \\leq 4$,\n$2 \\leq \\mathcal{A}(4) \\leq 3$, and $\\mathcal{A}(k) = 2$ for $k \\geq 5$.\nMoreover, we show that $\\mathcal{A}_\\infty(2) = 4$, $\\mathcal{A}_\\infty(3) =\n3$, and $\\mathcal{A}_\\infty(4) = 2$.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2020 10:15:09 GMT"}, {"version": "v2", "created": "Wed, 29 Jul 2020 18:46:36 GMT"}], "update_date": "2020-11-04", "authors_parsed": [["Peltomäki", "Jarkko", ""], ["Whiteland", "Markus A.", ""]]}, {"id": "2006.06837", "submitter": "Remi Geraud-Stewart", "authors": "\\'Eric Brier, R\\'emi G\\'eraud-Stewart, David Naccache, Alessandro\n  Pacco and Emanuele Troiani", "title": "Stuttering Conway Sequences Are Still Conway Sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A look-and-say sequence is obtained iteratively by reading off the digits of\nthe current value, grouping identical digits together: starting with 1, the\nsequence reads: 1, 11, 21, 1211, 111221, 312211, etc. (OEIS A005150). Starting\nwith any digit $d \\neq 1$ gives Conway's sequence: $d$, $1d$, $111d$, $311d$,\n$13211d$, etc. (OEIS A006715). Conway popularised these sequences and studied\nsome of their properties. In this paper we consider a variant subbed\n\"look-and-say again\" where digits are repeated twice. We prove that the\nlook-and-say again sequence contains only the digits $1, 2, 4, 6, d$, where $d$\nrepresents the starting digit. Such sequences decompose and the ratio of\nsuccessive lengths converges to Conway's constant. In fact, these properties\nresult from a commuting diagram between look-and-say again sequences and\n\"classical\" look-and-say sequences. Similar results apply to the \"look-and-say\nthree times\" sequence.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2020 21:30:39 GMT"}], "update_date": "2020-06-15", "authors_parsed": [["Brier", "Éric", ""], ["Géraud-Stewart", "Rémi", ""], ["Naccache", "David", ""], ["Pacco", "Alessandro", ""], ["Troiani", "Emanuele", ""]]}, {"id": "2006.07246", "submitter": "Remi Geraud-Stewart", "authors": "\\'Eric Brier and R\\'emi G\\'eraud-Stewart and David Naccache and\n  Alessandro Pacco and Emanuele Troiani", "title": "The Look-and-Say The Biggest Sequence Eventually Cycles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider a variant of Conway's sequence (OEIS A005150,\nA006715) defined as follows: the next term in the sequence is obtained by\nconsidering contiguous runs of digits, and rewriting them as $ab$ where $b$ is\nthe digit and $a$ is the maximum of $b$ and the run's length. We dub this the\n\"look-and-say the biggest\" (LSB) sequence. Conway's sequence is very similar\n($b$ is just the run's length). For any starting value except 22, Conway's\nsequence grows exponentially: the ration of lengths converges to a known\nconstant $\\lambda$. We show that LSB does not: for every starting value, LSB\neventually reaches a cycle. Furthermore, all cycles have a period of at most 9.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2020 14:59:50 GMT"}], "update_date": "2020-06-15", "authors_parsed": [["Brier", "Éric", ""], ["Géraud-Stewart", "Rémi", ""], ["Naccache", "David", ""], ["Pacco", "Alessandro", ""], ["Troiani", "Emanuele", ""]]}, {"id": "2006.07474", "submitter": "Lucas Mol", "authors": "James D. Currie and Lucas Mol", "title": "The undirected repetition threshold and undirected pattern avoidance", "comments": "arXiv admin note: substantial text overlap with arXiv:1904.10029", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a rational number $r$ such that $1<r\\leq 2$, an undirected $r$-power is a\nword of the form $xyx'$, where the word $x$ is nonempty, the word $x'$ is in\n$\\{x,x^R\\}$, and we have $|xyx'|/|xy|=r$. The undirected repetition threshold\nfor $k$ letters, denoted $\\mbox{URT}(k)$, is the infimum of the set of all $r$\nsuch that undirected $r$-powers are avoidable on $k$ letters. We first\ndemonstrate that $\\mbox{URT}(3)=\\tfrac{7}{4}$. Then we show that\n$\\mbox{URT}(k)\\geq \\tfrac{k-1}{k-2}$ for all $k\\geq 4$. We conjecture that\n$\\mbox{URT}(k)=\\tfrac{k-1}{k-2}$ for all $k\\geq 4$, and we confirm this\nconjecture for $k\\in\\{4,5,\\ldots,21\\}.$ We then consider related problems in\npattern avoidance; in particular, we find the undirected avoidability index of\nevery binary pattern. This is an extended version of a paper presented at WORDS\n2019, and it contains new and improved results.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2020 21:16:17 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Currie", "James D.", ""], ["Mol", "Lucas", ""]]}, {"id": "2006.08174", "submitter": "Dominique Lecomte", "authors": "Olivier Finkel (ELM), Dominique Lecomte (IMJ)", "title": "Some complete $\\omega$-powers of a one-counter language, for any Borel\n  class of finite rank", "comments": null, "journal-ref": "Archive for Mathematical Logic, Springer Verlag, In press", "doi": null, "report-no": null, "categories": "math.LO cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that, for any natural number n $\\ge$ 1, we can find a finite\nalphabet $\\Sigma$ and a finitary language L over $\\Sigma$ accepted by a\none-counter automaton, such that the $\\omega$-power L $\\infty$ := {w 0 w 1. ..\n$\\in$ $\\Sigma$ $\\omega$ | $\\forall$i $\\in$ $\\omega$ w i $\\in$ L} is $\\Pi$ 0\nn-complete. We prove a similar result for the class $\\Sigma$ 0 n .\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2020 07:02:23 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Finkel", "Olivier", "", "ELM"], ["Lecomte", "Dominique", "", "IMJ"]]}, {"id": "2006.08316", "submitter": "Achim Blumensath", "authors": "Achim Blumensath", "title": "Algebraic Language Theory for Eilenberg--Moore Algebras", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 17, Issue 2 (April 14,\n  2021) lmcs:7364", "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We develop an algebraic language theory based on the notion of an\nEilenberg--Moore algebra. In comparison to previous such frameworks the main\ncontribution is the support for algebras with infinitely many sorts and the\nconnection to logic in form of so-called `definable algebras'.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2020 12:17:41 GMT"}, {"version": "v2", "created": "Tue, 10 Nov 2020 14:25:13 GMT"}, {"version": "v3", "created": "Tue, 23 Feb 2021 10:23:20 GMT"}, {"version": "v4", "created": "Tue, 13 Apr 2021 13:15:28 GMT"}], "update_date": "2021-07-01", "authors_parsed": [["Blumensath", "Achim", ""]]}, {"id": "2006.09291", "submitter": "Leonardo Montecchi", "authors": "Leonardo Montecchi and Paolo Lollini and Andrea Bondavalli", "title": "Stochastic Activity Networks Templates: Supporting Variability in\n  Performability Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Model-based evaluation is extensively used to estimate performance and\nreliability of dependable systems. Traditionally, those systems were small and\nself-contained, and the main challenge for model-based evaluation has been the\nefficiency of the solution process. Recently, the problem of specifying and\nmaintaining complex models has increasingly gained attention, as modern systems\nare characterized by many components and complex interactions. Components share\nsimilarities, but also exhibit variations in their behavior due to different\nconfigurations or roles in the system. From the modeling perspective,\nvariations lead to replicating and altering a small set of base models multiple\ntimes. Variability is taken into account only informally, by defining a sample\nmodel and explaining its possible variations. In this paper we address the\nproblem of including variability in performability models, focusing on\nStochastic Activity Networks (SANs). We introduce the formal definition of\nStochastic Activity Networks Templates (SAN-T), a formalism based on SANs with\nthe addition of variability aspects. Differently from other approaches,\nparameters can also affect the structure of the model, like the number of cases\nof activities. We apply the SAN-T formalism to the modeling of the backbone\nnetwork of an environmental monitoring infrastructure. In particular, we show\nhow existing SAN models from the literature can be generalized using the newly\nintroduced formalism.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jun 2020 03:07:11 GMT"}, {"version": "v2", "created": "Wed, 13 Jan 2021 16:31:14 GMT"}], "update_date": "2021-01-14", "authors_parsed": [["Montecchi", "Leonardo", ""], ["Lollini", "Paolo", ""], ["Bondavalli", "Andrea", ""]]}, {"id": "2006.09485", "submitter": "Hussein Sibai", "authors": "Hussein Sibai and Sayan Mitra", "title": "Symmetry Abstractions for Hybrid Systems and their Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.FL cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A symmetry of a dynamical system is a map that transforms one trajectory to\nanother trajectory. We introduce a new type of abstraction for hybrid automata\nbased on symmetries. The abstraction combines different modes in a concrete\nautomaton A, whose trajectories are related by symmetries, into a single mode\nin the abstract automaton B. The abstraction sets the guard and reset of an\nabstract edge to be the union of the symmetry-transformed guards and resets of\nthe concrete edges. We establish the soundness of the abstraction using a\nforward simulation relation (FSR) and present several examples. Our abstraction\nresults in simpler automata, that are more amenable for formal analysis and\ndesign. We illustrate an application of this abstraction in making reachability\nanalysis faster and enabling unbounded time safety verification. We show how a\nfixed point of the reachable set computation of B can be used to answer\nreachability queries for A, even if the latter visits an infinite and unbounded\nsequences of modes. We present our implementation of the abstraction\nconstruction, the fixed point check, and the map that transforms abstract\nreachable sets to concrete ones in a software tool. Finally, we show the\nadvantage of our method over existing ones, and the different aspects of our\nabstraction, in a sequence of experiments including scenarios with linear and\nnonlinear agents following waypoints.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2020 19:54:23 GMT"}], "update_date": "2020-06-18", "authors_parsed": [["Sibai", "Hussein", ""], ["Mitra", "Sayan", ""]]}, {"id": "2006.10152", "submitter": "Lucas Mol", "authors": "Lucas Mol, Narad Rampersad, and Jeffrey Shallit", "title": "Extremal overlap-free and extremal $\\beta$-free binary words", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An overlap-free (or $\\beta$-free) word $w$ over a fixed alphabet $\\Sigma$ is\nextremal if every word obtained from $w$ by inserting a single letter from\n$\\Sigma$ at any position contains an overlap (or a factor of exponent at least\n$\\beta$, respectively). We find all lengths which admit an extremal\noverlap-free binary word. For every extended real number $\\beta$ such that\n$2^+\\leq\\beta\\leq 8/3$, we show that there are arbitrarily long extremal\n$\\beta$-free binary words.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2020 20:58:05 GMT"}], "update_date": "2020-06-19", "authors_parsed": [["Mol", "Lucas", ""], ["Rampersad", "Narad", ""], ["Shallit", "Jeffrey", ""]]}, {"id": "2006.10864", "submitter": "Haitham Khedr", "authors": "Haitham Khedr, James Ferlez, and Yasser Shoukry", "title": "PEREGRiNN: Penalized-Relaxation Greedy Neural Network Verifier", "comments": "10 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.FL stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural Networks (NNs) have increasingly apparent safety implications\ncommensurate with their proliferation in real-world applications: both\nunanticipated as well as adversarial misclassifications can result in fatal\noutcomes. As a consequence, techniques of formal verification have been\nrecognized as crucial to the design and deployment of safe NNs. In this paper,\nwe introduce a new approach to formally verify the most commonly considered\nsafety specifications for ReLU NNs -- i.e. polytopic specifications on the\ninput and output of the network. Like some other approaches, ours uses a\nrelaxed convex program to mitigate the combinatorial complexity of the problem.\nHowever, unique in our approach is the way we use a convex solver not only as a\nlinear feasibility checker, but also as a means of penalizing the amount of\nrelaxation allowed in solutions. In particular, we encode each ReLU by means of\nthe usual linear constraints, and combine this with a convex objective function\nthat penalizes the discrepancy between the output of each neuron and its\nrelaxation. This convex function is further structured to force the largest\nrelaxations to appear closest to the input layer; this provides the further\nbenefit that the most problematic neurons are conditioned as early as possible,\nwhen conditioning layer by layer. This paradigm can be leveraged to create a\nverification algorithm that is not only faster in general than competing\napproaches, but is also able to verify considerably more safety properties; we\nevaluated PEREGRiNN on a standard MNIST robustness verification suite to\nsubstantiate these claims.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2020 21:33:07 GMT"}, {"version": "v2", "created": "Sun, 18 Apr 2021 19:02:41 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Khedr", "Haitham", ""], ["Ferlez", "James", ""], ["Shoukry", "Yasser", ""]]}, {"id": "2006.11126", "submitter": "C\\'elia Cisternino", "authors": "\\'Emilie Charlier, C\\'elia Cisternino and Manon Stipulanti", "title": "Robustness of Pisot-regular sequences", "comments": "19 pages, 5 figures ; new revised version", "journal-ref": "Advances in Applied Mathematics 125 (2021) 102151", "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider numeration systems based on a $d$-tuple\n$\\mathbf{U}=(U_1,\\ldots,U_d)$ of sequences of integers and we define\n$(\\mathbf{U},\\mathbb{K})$-regular sequences through $\\mathbb{K}$-recognizable\nformal series, where $\\mathbb{K}$ is any semiring. We show that, for any\n$d$-tuple $\\mathbf{U}$ of Pisot numeration systems and any commutative semiring\n$\\mathbb{K}$, this definition does not depend on the greediness of the\n$\\mathbf{U}$-representations of integers. The proof is constructive and is\nbased on the fact that the normalization is realizable by a $2d$-tape finite\nautomaton. In particular, we use an ad hoc operation mixing a $2d$-tape\nautomaton and a $\\mathbb{K}$-automaton in order to obtain a new\n$\\mathbb{K}$-automaton.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2020 13:35:16 GMT"}, {"version": "v2", "created": "Wed, 6 Jan 2021 13:10:43 GMT"}], "update_date": "2021-01-07", "authors_parsed": [["Charlier", "Émilie", ""], ["Cisternino", "Célia", ""], ["Stipulanti", "Manon", ""]]}, {"id": "2006.11634", "submitter": "Remi Geraud-Stewart", "authors": "\\'Eric Brier and R\\'emi G\\'eraud-Stewart and David Naccache", "title": "A Fractional $3n+1$ Conjecture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce and discuss the sequence of \\emph{real numbers}\ndefined as $u_0 \\in \\mathbb R$ and $u_{n+1} = \\Delta(u_n)$ where\n\\begin{equation*} \\Delta(x) = \\begin{cases} \\frac{x}{2} &\\text{if }\n\\operatorname{frac}(x)<\\frac{1}{2} \\\\[4px] \\frac{3x+1}{2} & \\text{if }\n\\operatorname{frac}(x)\\geq\\frac{1}{2} \\end{cases} \\end{equation*} This sequence\nis reminiscent of the famous Collatz sequence, and seems to exhibit an\ninteresting behaviour. Indeed, we conjecture that iterating $\\Delta$ will\neventually either converge to zero, or loop over sequences of real numbers with\ninteger parts $1,2,4,7,11,18,9,4,7,3,5,9,4,7,11,18,9,4,7,3,6,3,1,2,4,7,3,6,3$.\n  We prove this conjecture for $u_0 \\in [0, 100]$. Extending the proof to\nlarger fixed values seems to be a matter of computing power. The authors pledge\nto offer a reward to the first person who proves or refutes the conjecture\ncompletely -- with a proof published in a serious refereed mathematical\nconference or journal.\n", "versions": [{"version": "v1", "created": "Sat, 20 Jun 2020 18:54:20 GMT"}], "update_date": "2020-06-23", "authors_parsed": [["Brier", "Éric", ""], ["Géraud-Stewart", "Rémi", ""], ["Naccache", "David", ""]]}, {"id": "2006.11898", "submitter": "Micha\\\"el Cadilhac", "authors": "Micha\\\"el Cadilhac, Dmitry Chistikov, Georg Zetzsche", "title": "Rational subsets of Baumslag-Solitar groups", "comments": "Long version of paper with same title appearing in ICALP'20", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the rational subset membership problem for Baumslag-Solitar\ngroups. These groups form a prominent class in the area of algorithmic group\ntheory, and they were recently identified as an obstacle for understanding the\nrational subsets of $\\text{GL}(2,\\mathbb{Q})$.\n  We show that rational subset membership for Baumslag-Solitar groups\n$\\text{BS}(1,q)$ with $q\\ge 2$ is decidable and PSPACE-complete. To this end,\nwe introduce a word representation of the elements of $\\text{BS}(1,q)$: their\npointed expansion (PE), an annotated $q$-ary expansion. Seeing subsets of\n$\\text{BS}(1,q)$ as word languages, this leads to a natural notion of\nPE-regular subsets of $\\text{BS}(1, q)$: these are the subsets of\n$\\text{BS}(1,q)$ whose sets of PE are regular languages. Our proof shows that\nevery rational subset of $\\text{BS}(1,q)$ is PE-regular.\n  Since the class of PE-regular subsets of $\\text{BS}(1,q)$ is well-equipped\nwith closure properties, we obtain further applications of these results. Our\nresults imply that (i) emptiness of Boolean combinations of rational subsets is\ndecidable, (ii) membership to each fixed rational subset of $\\text{BS}(1,q)$ is\ndecidable in logarithmic space, and (iii) it is decidable whether a given\nrational subset is recognizable. In particular, it is decidable whether a given\nfinitely generated subgroup of $\\text{BS}(1,q)$ has finite index.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jun 2020 20:13:17 GMT"}], "update_date": "2020-06-23", "authors_parsed": [["Cadilhac", "Michaël", ""], ["Chistikov", "Dmitry", ""], ["Zetzsche", "Georg", ""]]}, {"id": "2006.12207", "submitter": "Francesco Dolce", "authors": "Francesco Dolce and Edita Pelantov\\'a", "title": "On morphisms preserving palindromic richness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that each word of length $n$ contains at most $n+1$ distinct\npalindromes. A finite rich word is a word with maximal number of palindromic\nfactors. The definition of palindromic richness can be naturally extended to\ninfinite words. Sturmian words and Rote complementary symmetric sequences form\ntwo classes of binary rich words, while episturmian words and words coding\nsymmetric $d$-interval exchange transformations give us other examples on\nlarger alphabets. In this paper we look for morphisms of the free monoid, which\nallow to construct new rich words from already known rich words. We focus on\nmorphisms in Class $P_{ret}$. This class contains morphisms injective on the\nalphabet and satisfying a particular palindromicity property: for every\nmorphism $\\varphi$ in the class there exists a palindrome $w$ such that\n$\\varphi(a)w$ is a first complete return word to $w$ for each letter $a$. We\ncharacterize $P_{ret}$ morphisms which preserve richness over a binary\nalphabet. We also study marked $P_{ret}$ morphisms acting on alphabets with\nmore letters. In particular we show that every Arnoux-Rauzy morphism is\nconjugated to a morphism in Class $P_{ret}$ and that it preserves richness.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2020 13:01:15 GMT"}, {"version": "v2", "created": "Wed, 3 Mar 2021 10:49:46 GMT"}], "update_date": "2021-03-04", "authors_parsed": [["Dolce", "Francesco", ""], ["Pelantová", "Edita", ""]]}, {"id": "2006.12330", "submitter": "Utkan Gezer", "authors": "M. Utkan Gezer and A. C. Cem Say", "title": "Constant-Space, Constant-Randomness Verifiers with Arbitrarily Small\n  Error", "comments": null, "journal-ref": null, "doi": "10.1016/j.ic.2021.104744", "report-no": null, "categories": "cs.CC cs.FL", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We study the capabilities of probabilistic finite-state machines that act as\nverifiers for certificates of language membership for input strings, in the\nregime where the verifiers are restricted to toss some fixed nonzero number of\ncoins regardless of the input size. Say and Yakary{\\i}lmaz showed that the\nclass of languages that could be verified by these machines within an error\nbound strictly less than $1/2$ is precisely NL, but their construction yields\nverifiers with error bounds that are very close to $1/2$ for most languages in\nthat class when the definition of \"error\" is strengthened to include looping\nforever without giving a response. We characterize a subset of NL for which\nverification with arbitrarily low error is possible by these extremely weak\nmachines. It turns out that, for any $\\varepsilon>0$, one can construct a\nconstant-coin, constant-space verifier operating within error $\\varepsilon$ for\nevery language that is recognizable by a linear-time multi-head\nnondeterministic finite automaton (2nfa($k$)). We discuss why it is difficult\nto generalize this method to all of NL, and give a reasonably tight way to\nrelate the power of linear-time 2nfa($k$)'s to simultaneous time-space\ncomplexity classes defined in terms of Turing machines.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2020 15:16:42 GMT"}, {"version": "v2", "created": "Tue, 23 Mar 2021 13:15:54 GMT"}], "update_date": "2021-03-30", "authors_parsed": [["Gezer", "M. Utkan", ""], ["Say", "A. C. Cem", ""]]}, {"id": "2006.14164", "submitter": "Kuize Zhang", "authors": "Kuize Zhang", "title": "Detectability of labeled weighted automata over monoids", "comments": "52 pages, 21 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, by developing appropriate methods, we for the first time\nobtain characterization of four fundamental notions of detectability for\ngeneral labeled weighted automata over monoids (denoted by\n$\\mathcal{A}^{\\mathfrak{M}}$ for short), where the four notions are strong\n(periodic) detectability (SD and SPD) and weak (periodic) detectability (WD and\nWPD). Firstly, we formulate the notions of concurrent composition, observer,\nand detector for $\\mathcal{A}^{\\mathfrak{M}}$. Secondly, we use the concurrent\ncomposition to give an equivalent condition for SD, use the detector to give an\nequivalent condition for SPD, and use the observer to give equivalent\nconditions for WD and WPD, all for general $\\mathcal{A}^{\\mathfrak{M}}$ without\nany assumption. Thirdly, we prove that for a labeled weighted automaton over\nmonoid $(\\mathbb{Q}^k,+)$ (denoted by $\\mathcal{A}^{\\mathbb{Q}^k}$), its\nconcurrent composition, observer, and detector can be computed in NP,\n$2$-EXPTIME, and $2$-EXPTIME, respectively, by developing novel connections\nbetween $\\mathcal{A}^{\\mathbb{Q}^k}$ and the NP-complete exact path length\nproblem (proved by [Nyk\\\"{a}nen and Ukkonen, 2002]) and a subclass of\nPresburger arithmetic. As a result, we prove that for\n$\\mathcal{A}^{\\mathbb{Q}^k}$, SD can be verified in coNP, while SPD, WD, and\nWPD can be verified in $2$-EXPTIME. Particularly, for\n$\\mathcal{A}^{\\mathbb{Q}^k}$ in which from every state, a distinct state can be\nreached through some unobservable, instantaneous path, its detector can be\ncomputed in NP, and SPD can be verified in coNP. Finally, we prove that the\nproblems of verifying SD and SPD of deterministic $\\mathcal{A}^{\\mathbb{N}}$\nover monoid $(\\mathbb{N},+)$ are both NP-hard. The original methods developed\nin this paper will provide foundations for characterizing other fundamental\nproperties (e.g., diagnosability and opacity) in $\\mathcal{A}^{\\mathfrak{M}}$.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2020 04:13:19 GMT"}, {"version": "v2", "created": "Wed, 2 Dec 2020 15:06:04 GMT"}, {"version": "v3", "created": "Sun, 13 Dec 2020 11:12:13 GMT"}, {"version": "v4", "created": "Fri, 26 Feb 2021 10:36:59 GMT"}, {"version": "v5", "created": "Sat, 27 Mar 2021 19:24:38 GMT"}, {"version": "v6", "created": "Wed, 12 May 2021 10:31:59 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Zhang", "Kuize", ""]]}, {"id": "2006.15160", "submitter": "Josef Rukavicka", "authors": "Josef Rukavicka", "title": "Dissecting Power of a Finite Intersection of Context Free Languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $\\exp^{k,\\alpha}$ denote a tetration function defined as follows:\n$\\exp^{1,\\alpha}=2^{\\alpha}$ and $\\exp^{k+1,\\alpha}=2^{\\exp^{k,\\alpha}}$, where\n$k,\\alpha$ are positive integers. Let $\\Delta_n$ denote an alphabet with $n$\nletters. If $L\\subseteq\\Delta_n^*$ is an infinite language such that for each\n$u\\in L$ there is $v\\in L$ with $\\vert u\\vert<\\vert v\\vert\\leq\n\\exp^{k,\\alpha}\\vert u\\vert$ then we call $L$ a language with the \\emph{growth\nbounded by} $(k,\\alpha)$-tetration.\n  Given two infinite languages $L_1,L_2\\in \\Delta_n^*$, we say that $L_1$\n\\emph{dissects} $L_2$ if $\\vert L_1\\cap L_2\\vert=\\infty$ and\n$\\vert(\\Delta_n^*\\setminus L_1)\\cap L_2\\vert=\\infty$.\n  Given a context free language $L$, let $\\kappa(L)$ denote the size of the\nsmallest context free grammar $G$ that generates $L$. We define the size of a\ngrammar to be the total number of symbols on the right sides of all production\nrules.\n  Given positive integers $n,k$ with $k\\geq 2$, we show that there are context\nfree languages $L_1,L_2,\\dots, L_{3k-3}\\subseteq \\Delta^*_n$ with\n$\\kappa(L_i)\\leq 40 k$ such that if $\\alpha$ is a positive integer and\n$L\\subseteq\\Delta_n^*$ is an infinite language with the growth bounded by\n$(k,\\alpha)$-tetration then there is a regular language $M$ such that\n$M\\cap\\left(\\bigcap_{i=1}^{3k-3}L_i\\right)$ dissects $L$ and the minimal\ndeterministic finite automaton accepting $M$ has at most $k+\\alpha+3$ states.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2020 18:07:50 GMT"}, {"version": "v2", "created": "Wed, 2 Sep 2020 15:23:16 GMT"}], "update_date": "2020-09-03", "authors_parsed": [["Rukavicka", "Josef", ""]]}, {"id": "2006.15178", "submitter": "Stefan Hoffmann", "authors": "Stefan Hoffmann", "title": "State Complexity of Permutation and Related Decision Problems on\n  Alphabetical Pattern Constraints", "comments": "The 2nd version is a vast reworking of the 1st version. The results\n  were extended from the finite language to the larger class of APCs. The\n  material on the function h was removed. New material on decision problems,\n  namely variants of the inclusion and universality problem, added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the state complexity of the permutation operation, or the\ncommutative closure, on Alphabetical Pattern Constraints (APC). This class\ncorresponds to level $3/2$ of the Straubing-Th{\\'e}rien Hierarchy and includes\nthe finite, the piecewise-testable, or $\\mathcal J$-trivial, and the $\\mathcal\nR$-trivial and $\\mathcal L$-trivial languages. We give a sharp state complexity\nbound expressed in terms of the longest strings in the unary projection\nlanguages of an associated finite language and which is already sharp for the\nsubclass of finite languages. Additionally, for two subclasses, we give sharp\nbounds expressed in terms of the size of a recognizing input automaton and the\nsize of the alphabet. Lastly, we investigate the inclusion and universality\nproblem on APCs up to permutational equivalence, two problems known to be\nPSPACE-complete on APCs even for fixed alphabets in general, and show them to\nbe decidable in polynomial time for fixed alphabets in this case.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2020 19:10:22 GMT"}, {"version": "v2", "created": "Sun, 14 Mar 2021 13:53:58 GMT"}], "update_date": "2021-03-16", "authors_parsed": [["Hoffmann", "Stefan", ""]]}, {"id": "2006.16035", "submitter": "Dalcimar Casanova", "authors": "Kallil M. C. Zielinski and Marcelo Teixeira and Richardson Ribeiro and\n  Dalcimar Casanova", "title": "Concept and the implementation of a tool to convert industry 4.0\n  environments modeled as FSM to an OpenAI Gym wrapper", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.FL cs.SY eess.SY stat.ML", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Industry 4.0 systems have a high demand for optimization in their tasks,\nwhether to minimize cost, maximize production, or even synchronize their\nactuators to finish or speed up the manufacture of a product. Those challenges\nmake industrial environments a suitable scenario to apply all modern\nreinforcement learning (RL) concepts. The main difficulty, however, is the lack\nof that industrial environments. In this way, this work presents the concept\nand the implementation of a tool that allows us to convert any dynamic system\nmodeled as an FSM to the open-source Gym wrapper. After that, it is possible to\nemploy any RL methods to optimize any desired task. In the first tests of the\nproposed tool, we show traditional Q-learning and Deep Q-learning methods\nrunning over two simple environments.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2020 13:28:41 GMT"}], "update_date": "2020-06-30", "authors_parsed": [["Zielinski", "Kallil M. C.", ""], ["Teixeira", "Marcelo", ""], ["Ribeiro", "Richardson", ""], ["Casanova", "Dalcimar", ""]]}, {"id": "2006.16476", "submitter": "Cong Tian", "authors": "Cong Tian, Wensheng Wang, Zhenhua Duan", "title": "Making Streett Determinization Tight", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal determinization construction of Streett automata is an important\nresearch problem because it is indispensable in numerous applications such as\ndecision problems for tree temporal logics, logic games and system synthesis.\nThis paper presents a transformation from nondeterministic Streett automata\n(NSA) with $n$ states and $k$ Streett pairs to equivalent deterministic Rabin\ntransition automata (DRTA) with $n^{5n}(n!)^{n}$ states, $O(n^{n^2})$ Rabin\npairs for $k=\\omega(n)$ and $n^{5n}k^{nk}$ states, $O(k^{nk})$ Rabin pairs for\n$k=O(n)$. This improves the state of the art Streett determinization\nconstruction with $n^{5n}(n!)^{n+1}$ states, $O(n^2)$ Rabin pairs and\n$n^{5n}k^{nk}n!$ states, $O(nk)$ Rabin pairs, respectively. Moreover,\ndeterministic parity transition automata (DPTA) are obtained with\n$3(n(n+1)-1)!(n!)^{n+1}$ states, $2n(n+1)$ priorities for $k=\\omega(n)$ and\n$3(n(k+1)-1)!n!k^{nk}$ states, $2n(k+1)$ priorities for $k=O(n)$, which\nimproves the best construction with $n^{n}(k+1)^{n(k+1)}(n(k+1)-1)!$ states,\n$2n(k+1)$ priorities. Further, we prove a lower bound state complexity for\ndeterminization construction from NSA to deterministic Rabin (transition)\nautomata i.e. $n^{5n}(n!)^{n}$ for $k=\\omega(n)$ and $n^{5n}k^{nk}$ for\n$k=O(n)$, which matches the state complexity of the proposed determinization\nconstruction. Besides, we put forward a lower bound state complexity for\ndeterminization construction from NSA to deterministic parity (transition)\nautomata i.e. $2^{\\Omega(n^2 \\log n)}$ for $k=\\omega(n)$ and $2^{\\Omega(nk \\log\nnk)}$ for $k=O(n)$, which is the same as the state complexity of the proposed\ndeterminization construction in the exponent.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2020 02:17:23 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Tian", "Cong", ""], ["Wang", "Wensheng", ""], ["Duan", "Zhenhua", ""]]}, {"id": "2006.16645", "submitter": "Nathan Lhote", "authors": "Nathan Lhote", "title": "Pebble Minimization of Polyregular Functions", "comments": null, "journal-ref": null, "doi": "10.1145/3373718.3394804", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that a polyregular word-to-word function is regular if and only if\nits output size is at most linear in its input size. Moreover a polyregular\nfunction can be realized by: a transducer with two pebbles if and only if its\noutput has quadratic size in its input, a transducer with three pebbles if and\nonly if its output has cubic size in its input, etc. Moreover the\ncharacterization is decidable and, given a polyregular function, one can\ncompute a transducer realizing it with the minimal number of pebbles. We apply\nthe result to mso interpretations from words to words. We show that mso\ninterpretations of dimension k exactly coincide with k-pebble transductions.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2020 10:13:46 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Lhote", "Nathan", ""]]}, {"id": "2006.16711", "submitter": "\\v{S}t\\v{e}p\\'an Holub", "authors": "\\v{S}t\\v{e}p\\'an Holub and \\v{S}t\\v{e}p\\'an Starosta", "title": "Binary intersection formalized", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a reformulation and a formalization of the classical result by\nJuhani Karhum\\\"aki characterizing intersections of two languages of the form\n$\\{x,y\\}^*\\cap \\{u,v\\}^*$. We use the terminology of morphisms which allows to\nformulate the result in a shorter and more transparent way, and we formalize\nthe result in the proof assistant Isabelle/HOL.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2020 12:08:33 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Holub", "Štěpán", ""], ["Starosta", "Štěpán", ""]]}]