[{"id": "1611.00574", "submitter": "Fuyuan Zhang", "authors": "Fuyuan Zhang, Yongwang Zhao, David Sanan, Yang Liu, Alwen Tiu,\n  Shang-Wei Lin, Jun Sun", "title": "Compositional Reasoning for Shared-variable Concurrent Programs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scalable and automatic formal verification for concurrent systems is always\ndemanding. In this paper, we propose a verification framework to support\nautomated compositional reasoning for concurrent programs with shared\nvariables. Our framework models concurrent programs as succinct automata and\nsupports the verification of multiple important properties. Safety verification\nand simulations of succinct automata are parallel compositional, and safety\nproperties of succinct automata are preserved under refinements. We generate\nsuccinct automata from infinite state concurrent programs in an automated\nmanner. Furthermore, we propose the first automated approach to checking\nrely-guarantee based simulations between infinite state concurrent programs. We\nhave prototyped our algorithms and applied our tool to the verification of\nmultiple refinements.\n", "versions": [{"version": "v1", "created": "Wed, 2 Nov 2016 12:56:15 GMT"}, {"version": "v2", "created": "Mon, 26 Mar 2018 13:51:38 GMT"}], "update_date": "2018-03-28", "authors_parsed": [["Zhang", "Fuyuan", ""], ["Zhao", "Yongwang", ""], ["Sanan", "David", ""], ["Liu", "Yang", ""], ["Tiu", "Alwen", ""], ["Lin", "Shang-Wei", ""], ["Sun", "Jun", ""]]}, {"id": "1611.01296", "submitter": "Lo\\\"ic Paulev\\'e", "authors": "Thomas Chatain and Lo\\\"ic Paulev\\'e", "title": "Goal-Driven Unfolding of Petri Nets", "comments": "research report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unfoldings provide an efficient way to avoid the state-space explosion due to\ninterleavings of concurrent transitions when exploring the runs of a Petri net.\nThe theory of adequate orders allows one to define finite prefixes of\nunfoldings which contain all the reachable markings. In this paper we are\ninterested in reachability of a single given marking, called the goal. We\npropose an algorithm for computing a finite prefix of the unfolding of a 1-safe\nPetri net that preserves all minimal configurations reaching this goal. Our\nalgorithm combines the unfolding technique with on-the-fly model reduction by\nstatic analysis aiming at avoiding the exploration of branches which are not\nneeded for reaching the goal. We present some experimental results.\n", "versions": [{"version": "v1", "created": "Fri, 4 Nov 2016 09:41:33 GMT"}], "update_date": "2016-11-07", "authors_parsed": [["Chatain", "Thomas", ""], ["Paulevé", "Loïc", ""]]}, {"id": "1611.01696", "submitter": "Jackson Abascal", "authors": "Jackson Abascal, Lane A. Hemaspaandra, Shir Maimon, and Daniel Rubery", "title": "Closure and Nonclosure Properties of the Compressible and Rankable Sets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.FL math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rankable and compressible sets have been studied for more than a quarter\nof a century, ever since Allender [1] and Goldberg and Sipser [6] introduced\nthe formal study of polynomial-time ranking. Yet even after all that time,\nwhether the rankable and compressible sets are closed under the most important\nboolean and other operations remains essentially unexplored. The present paper\nstudies these questions for both polynomial-time and recursion-theoretic\ncompression and ranking, and for almost every case arrives at a Closed, a\nNot-Closed, or a Closed-Iff-Well-Known-Complexity-Classes-Collapse result for\nthe given operation. Even though compression and ranking classes are capturing\nsomething quite natural about the structure of sets, it turns out that they are\nquite fragile with respect to closure properties, and many fail to possess even\nthe most basic of closure properties. For example, we show that with respect to\nthe join (aka disjoint union) operation: the P-rankable sets are not closed,\nwhether the semistrongly P-rankable sets are closed is closely linked to\nwhether P = UP $\\cap$ coUP, and the strongly P-rankable sets are closed.\n", "versions": [{"version": "v1", "created": "Sat, 5 Nov 2016 20:31:58 GMT"}, {"version": "v2", "created": "Fri, 20 Oct 2017 14:50:46 GMT"}, {"version": "v3", "created": "Mon, 4 Dec 2017 03:44:04 GMT"}, {"version": "v4", "created": "Wed, 23 May 2018 21:37:30 GMT"}, {"version": "v5", "created": "Tue, 24 Jul 2018 20:56:20 GMT"}, {"version": "v6", "created": "Wed, 31 Oct 2018 00:28:13 GMT"}], "update_date": "2018-11-01", "authors_parsed": [["Abascal", "Jackson", ""], ["Hemaspaandra", "Lane A.", ""], ["Maimon", "Shir", ""], ["Rubery", "Daniel", ""]]}, {"id": "1611.01866", "submitter": "Giacomo Marciani", "authors": "Giacomo Marciani", "title": "Marciani Normal Form of context-free grammars", "comments": "preprint, 4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we prove the semidecidability of the problem of saying whether\nor not a context-free grammar generates a regular language. We introduce the\nnotion of context-free grammar in Marciani Normal Form. We prove that a\ncontext-free grammar in Marciani Normal Form always generates a regular\nlanguage.\n", "versions": [{"version": "v1", "created": "Mon, 7 Nov 2016 00:47:19 GMT"}], "update_date": "2016-11-08", "authors_parsed": [["Marciani", "Giacomo", ""]]}, {"id": "1611.03921", "submitter": "Ver\\'onica  Becher", "authors": "Ver\\'onica Becher and Olivier Carton and Pablo Ariel Heiber", "title": "Finite-state independence", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we introduce a notion of independence based on finite-state\nautomata: two infinite words are independent if no one helps to compress the\nother using one-to-one finite-state transducers with auxiliary input. We prove\nthat, as expected, the set of independent pairs of infinite words has Lebesgue\nmeasure 1. We show that the join of two independent normal words is normal.\nHowever, the independence of two normal words is not guaranteed if we just\nrequire that their join is normal. To prove this we construct a normal word\n$x_1x_2x_3\\ldots$ where $x_{2n}=x_n$ for every $n$.\n", "versions": [{"version": "v1", "created": "Sat, 12 Nov 2016 00:34:28 GMT"}, {"version": "v2", "created": "Sat, 4 Nov 2017 05:50:08 GMT"}], "update_date": "2017-11-07", "authors_parsed": [["Becher", "Verónica", ""], ["Carton", "Olivier", ""], ["Heiber", "Pablo Ariel", ""]]}, {"id": "1611.04580", "submitter": "Clelia De Felice", "authors": "Clelia De Felice", "title": "Some conjectures on codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Variable-length codes are the bases of the free submonoids of a free monoid.\nThere are some important longstanding open questions about the structure of\nfinite maximal codes. In this paper we discuss this conjectures and their\nrelations with factorizations of cyclic groups.\n", "versions": [{"version": "v1", "created": "Mon, 14 Nov 2016 20:59:04 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["De Felice", "Clelia", ""]]}, {"id": "1611.05831", "submitter": "John Maraist", "authors": "John Maraist", "title": "Generalized LR parsing and the shuffle operator", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We adapt Tomita's Generalized LR algorithm to languages generated by\ncontext-free grammars enriched with a shuffle operator. The change involves\nextensions to the underlying handle-finding finite automaton, construction of\nparser tables, and the necessary optimizations in constructing a deterministic\nparser. Our system is motivated by an application from artificial intelligence\nplan recognition. We argue for the correctness of the system, and discuss\nfuture extensions of this work.\n", "versions": [{"version": "v1", "created": "Thu, 17 Nov 2016 19:51:50 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Maraist", "John", ""]]}, {"id": "1611.06703", "submitter": "Jad Hamza", "authors": "Mika\\\"el Mayer, Jad Hamza", "title": "Optimal Test Sets for Context-Free Languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A test set for a formal language (set of strings) L is a subset T of L such\nthat for any two string homomorphisms f and g defined on L, if the restrictions\nof f and g on T are identical functions, then f and g are identical on the\nentire L. Previously, it was shown that there are context-free grammars for\nwhich smallest test sets are cubic in the size of the grammar, which gives a\nlower bound on tests set size. Existing upper bounds were higher degree\npolynomials; we here give the first algorithm to compute test sets of cubic\nsize for all context-free grammars, settling the gap between the upper and\nlower bound.\n", "versions": [{"version": "v1", "created": "Mon, 21 Nov 2016 10:02:02 GMT"}], "update_date": "2016-11-22", "authors_parsed": [["Mayer", "Mikaël", ""], ["Hamza", "Jad", ""]]}, {"id": "1611.06840", "submitter": "Luca Prigioniero", "authors": "Giovanna J. Lavado, Giovanni Pighizzini, Luca Prigioniero", "title": "Minimal and Reduced Reversible Automata", "comments": "Preliminary version presented at DCFS 2016 --- Descriptional\n  Complexity of Formal Systems, Bucharest, Romania, Jul 5-8, 2016", "journal-ref": "Lectures Notes in Computer Science, 9777, pp. 168---179, Springer,\n  2016", "doi": "10.1007/978-3-319-41114-9_13", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A condition characterizing the class of regular languages which have several\nnonisomorphic minimal reversible automata is presented. The condition concerns\nthe structure of the minimum automaton accepting the language under\nconsideration. It is also observed that there exist reduced reversible automata\nwhich are not minimal, in the sense that all the automata obtained by merging\nsome of their equivalent states are irreversible. Furthermore, a sufficient\ncondition for the existence of infinitely many reduced reversible automata\naccepting a same language is given. It is also proved that, when the language\nis accepted by a unique minimal reversible automaton (that does not necessarily\ncoincide with the minimum deterministic automaton), then no other reduced\nreversible automata accepting it can exist.\n", "versions": [{"version": "v1", "created": "Mon, 21 Nov 2016 15:38:32 GMT"}], "update_date": "2016-11-22", "authors_parsed": [["Lavado", "Giovanna J.", ""], ["Pighizzini", "Giovanni", ""], ["Prigioniero", "Luca", ""]]}, {"id": "1611.07812", "submitter": "Vincent Botbol", "authors": "Vincent Botbol, Emmanuel Chailloux, Tristan Le Gall", "title": "Static Analysis of Communicating Processes using Symbolic Transducers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general model allowing static analysis based on abstract\ninterpretation for systems of communicating processes. Our technique, inspired\nby Regular Model Checking, represents set of program states as lattice automata\nand programs semantics as symbolic transducers. This model can express dynamic\ncreation/destruction of processes and communications. Using the abstract\ninterpretation framework, we are able to provide a sound over-approximation of\nthe reachability set of the system thus allowing us to prove safety properties.\nWe implemented this method in a prototype that targets the MPI library for C\nprograms.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2016 14:25:58 GMT"}, {"version": "v2", "created": "Sun, 27 Nov 2016 20:43:01 GMT"}], "update_date": "2016-11-29", "authors_parsed": [["Botbol", "Vincent", ""], ["Chailloux", "Emmanuel", ""], ["Gall", "Tristan Le", ""]]}, {"id": "1611.08554", "submitter": "Fabian Reiter", "authors": "Fabian Reiter", "title": "Asynchronous Distributed Automata: A Characterization of the Modal\n  Mu-Fragment", "comments": "13 pages, 2 figures", "journal-ref": null, "doi": "10.4230/LIPIcs.ICALP.2017.100", "report-no": null, "categories": "cs.FL cs.DC cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We establish the equivalence between a class of asynchronous distributed\nautomata and a small fragment of least fixpoint logic, when restricted to\nfinite directed graphs. More specifically, the logic we consider is (a variant\nof) the fragment of the modal $\\mu$-calculus that allows least fixpoints but\nforbids greatest fixpoints. The corresponding automaton model uses a network of\nidentical finite-state machines that communicate in an asynchronous manner and\nwhose state diagram must be acyclic except for self-loops. Exploiting the\nconnection with logic, we also prove that the expressive power of those\nmachines is independent of whether or not messages can be lost.\n", "versions": [{"version": "v1", "created": "Fri, 25 Nov 2016 19:02:23 GMT"}, {"version": "v2", "created": "Mon, 6 Mar 2017 17:40:00 GMT"}], "update_date": "2018-05-18", "authors_parsed": [["Reiter", "Fabian", ""]]}, {"id": "1611.09017", "submitter": "Gabriele Fici", "authors": "P\\'eter Burcsi, Gabriele Fici, Zsuzsanna Lipt\\'ak, Frank Ruskey, Joe\n  Sawada", "title": "On Prefix Normal Words and Prefix Normal Forms", "comments": "To appear in Theoretical Computer Science", "journal-ref": "Theoretical Computer Science, 659: 1-13, 2017", "doi": "10.1016/j.tcs.2016.10.015", "report-no": null, "categories": "cs.DM cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A $1$-prefix normal word is a binary word with the property that no factor\nhas more $1$s than the prefix of the same length; a $0$-prefix normal word is\ndefined analogously. These words arise in the context of indexed binary jumbled\npattern matching, where the aim is to decide whether a word has a factor with a\ngiven number of $1$s and $0$s (a given Parikh vector). Each binary word has an\nassociated set of Parikh vectors of the factors of the word. Using prefix\nnormal words, we provide a characterization of the equivalence class of binary\nwords having the same set of Parikh vectors of their factors.\n  We prove that the language of prefix normal words is not context-free and is\nstrictly contained in the language of pre-necklaces, which are prefixes of\npowers of Lyndon words. We give enumeration results on $\\textit{pnw}(n)$, the\nnumber of prefix normal words of length $n$, showing that, for sufficiently\nlarge $n$, \\[ 2^{n-4 \\sqrt{n \\lg n}} \\le \\textit{pnw}(n) \\le 2^{n - \\lg n + 1}.\n\\]\n  For fixed density (number of $1$s), we show that the ordinary generating\nfunction of the number of prefix normal words of length $n$ and density $d$ is\na rational function. Finally, we give experimental results on\n$\\textit{pnw}(n)$, discuss further properties, and state open problems.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2016 08:18:50 GMT"}], "update_date": "2017-01-02", "authors_parsed": [["Burcsi", "Péter", ""], ["Fici", "Gabriele", ""], ["Lipták", "Zsuzsanna", ""], ["Ruskey", "Frank", ""], ["Sawada", "Joe", ""]]}, {"id": "1611.09318", "submitter": "Alfons Laarman", "authors": "Henning G\\\"unther and Alfons Laarman and Ana Sokolova and Georg\n  Weissenbacher", "title": "Dynamic Reductions for Model Checking Concurrent Software", "comments": "38 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Symbolic model checking of parallel programs stands and falls with effective\nmethods of dealing with the explosion of interleavings. We propose a dynamic\nreduction technique to avoid unnecessary interleavings. By extending Lipton's\noriginal work with a notion of bisimilarity, we accommodate dynamic\ntransactions, and thereby reduce dependence on the accuracy of static analysis,\nwhich is a severe bottleneck in other reduction techniques.\n  The combination of symbolic model checking and dynamic reduction techniques\nhas proven to be challenging in the past. Our generic reduction theorem\nnonetheless enables us to derive an efficient symbolic encoding, which we\nimplemented for IC3 and BMC. The experiments demonstrate the power of dynamic\nreduction on several case studies and a large set of SVCOMP benchmarks.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2016 20:11:49 GMT"}], "update_date": "2016-11-29", "authors_parsed": [["Günther", "Henning", ""], ["Laarman", "Alfons", ""], ["Sokolova", "Ana", ""], ["Weissenbacher", "Georg", ""]]}, {"id": "1611.09541", "submitter": "Jan Philipp W\\\"achter", "authors": "Daniele D'Angeli, Emanuele Rodaro, Jan Philipp W\\\"achter", "title": "On the Complexity of the Word Problem for Automaton Semigroups and\n  Automaton Groups", "comments": null, "journal-ref": "Advances in Applied Mathematics, Volume 90, September 2017, Pages\n  160-187, ISSN 0196-8858", "doi": "10.1016/j.aam.2017.05.008", "report-no": null, "categories": "cs.FL cs.CC math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the word problem for automaton semigroups and\nautomaton groups from a complexity point of view. As an intermediate concept\nbetween automaton semigroups and automaton groups, we introduce\nautomaton-inverse semigroups, which are generated by partial, yet invertible\nautomata. We show that there is an automaton-inverse semigroup and, thus, an\nautomaton semigroup with a PSPACE-complete word problem. We also show that\nthere is an automaton group for which the word problem with a single rational\nconstraint is PSPACE-complete. Additionally, we provide simpler constructions\nfor the uniform word problems of these classes. For the uniform word problem\nfor automaton groups (without rational constraints), we show NL-hardness.\nFinally, we investigate a question asked by Cain about a better upper bound for\nthe length of a word on which two distinct elements of an automaton semigroup\nmust act differently.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2016 09:52:40 GMT"}, {"version": "v2", "created": "Wed, 28 Jun 2017 08:45:08 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["D'Angeli", "Daniele", ""], ["Rodaro", "Emanuele", ""], ["Wächter", "Jan Philipp", ""]]}, {"id": "1611.09985", "submitter": "Jakub Konieczny", "authors": "Jakub Konieczny", "title": "Gowers norms for the Thue-Morse and Rudin-Shapiro sequences", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We estimate Gowers uniformity norms for some classical automatic sequences,\nsuch as the Thue-Morse and Rudin-Shapiro sequences. The methods can also be\nextended to other automatic sequences. As an application, we asymptotically\ncount arithmetic progressions in the set of integers $\\leq N$ where the\nThue-Morse (resp. Rudin-Shapiro) sequence takes the value $+1$.\n", "versions": [{"version": "v1", "created": "Wed, 30 Nov 2016 03:24:17 GMT"}, {"version": "v2", "created": "Fri, 24 Mar 2017 11:09:31 GMT"}], "update_date": "2017-03-27", "authors_parsed": [["Konieczny", "Jakub", ""]]}, {"id": "1611.10078", "submitter": "Witold Dyrka", "authors": "Witold Dyrka, Fran\\c{c}ois Coste, Olgierd Unold, {\\L}ukasz Culer,\n  Agnieszka Kaczmarek", "title": "How to measure the topological quality of protein grammars?", "comments": "The 13th International Conference on Grammatical Inference (ICGI\n  2016), Delft, The Netherlands, 5-7 Oct 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Context-free and context-sensitive formal grammars are often regarded as more\nappropriate to model proteins than regular level models such as finite state\nautomata and Hidden Markov Models. In theory, the claim is well founded in the\nfact that many biologically relevant interactions between residues of protein\nsequences have a character of nested or crossed dependencies. In practice,\nthere is hardly any evidence that grammars of higher expressiveness have an\nedge over old good HMMs in typical applications including recognition and\nclassification of protein sequences. This is in contrast to RNA modeling, where\nCFG power some of the most successful tools. There have been proposed several\nexplanations of this phenomenon. On the biology side, one difficulty is that\ninteractions in proteins are often less specific and more \"collective\" in\ncomparison to RNA. On the modeling side, a difficulty is the larger alphabet\nwhich combined with high complexity of CF and CS grammars imposes considerable\ntrade-offs consisting on information reduction or learning sub-optimal\nsolutions. Indeed, some studies hinted that CF level of expressiveness brought\nan added value in protein modeling when CF and regular grammars where\nimplemented in the same framework. However, there have been no systematic study\nof explanatory power provided by various grammatical models. The first step to\nthis goal is define objective criteria of such evaluation. Intuitively, a\ndecent explanatory grammar should generate topology, or the parse tree,\nconsistent with topology of the protein, or its secondary and/or tertiary\nstructure. In this piece of research we build on this intuition and propose a\nset of measures to compare topology of the parse tree of a grammar with\ntopology of the protein structure.\n", "versions": [{"version": "v1", "created": "Wed, 30 Nov 2016 10:20:54 GMT"}, {"version": "v2", "created": "Fri, 27 Jan 2017 10:52:44 GMT"}], "update_date": "2017-01-30", "authors_parsed": [["Dyrka", "Witold", ""], ["Coste", "François", ""], ["Unold", "Olgierd", ""], ["Culer", "Łukasz", ""], ["Kaczmarek", "Agnieszka", ""]]}, {"id": "1611.10212", "submitter": "Antonis Achilleos", "authors": "Luca Aceto, Antonis Achilleos, Adrian Francalanza, Anna\n  Ing\\'olfsd\\'ottir and S{\\ae}var \\\"Orn Kjartansson", "title": "Determinizing Monitors for HML with Recursion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the determinization of monitors for HML with recursion. We\ndemonstrate that every monitor is equivalent to a deterministic one, which is\nat most doubly exponential in size with respect to the original monitor. When\nmonitors are described as CCS-like processes, this doubly exponential bound is\noptimal. When (deterministic) monitors are described as finite automata (as\ntheir LTS), then they can be exponentially more succinct than their CCS process\nform.\n", "versions": [{"version": "v1", "created": "Wed, 30 Nov 2016 15:21:01 GMT"}], "update_date": "2016-12-01", "authors_parsed": [["Aceto", "Luca", ""], ["Achilleos", "Antonis", ""], ["Francalanza", "Adrian", ""], ["Ingólfsdóttir", "Anna", ""], ["Kjartansson", "Sævar Örn", ""]]}, {"id": "1611.10276", "submitter": "Benjam\\'in Bedregal Prof.", "authors": "Benjam\\'in Bedregal", "title": "Some Subclasses of Linear Languages based on Nondeterministic Linear\n  Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider the class of lambda-nondeterministic linear\nautomata as a model of the class of linear languages. As usual in other\nautomata models, lambda-moves do not increase the acceptance power. The main\ncontribution of this paper is to introduce the deterministic linear automata\nand even linear automata, i.e. the natural restriction of nondeterministic\nlinear automata for the deterministic and even linear language classes,\nrespectively. In particular, there are different, but not equivalents,\nproposals for the class of \"deterministic\" linear languages. We proved here\nthat the class of languages accepted by the deterministic linear automata are\nnot contained in any of the these classes and in fact they properly contain\nthese classes. Another, contribution is the generation of an infinite hierarchy\nof formal languages, going from the class of languages accepted by\ndeterministic linear automata and achieved, in the limit, the class of linear\nlanguages.\n", "versions": [{"version": "v1", "created": "Wed, 30 Nov 2016 17:32:11 GMT"}], "update_date": "2016-12-01", "authors_parsed": [["Bedregal", "Benjamín", ""]]}]