[{"id": "0706.3067", "submitter": "Evgeni Gabev E", "authors": "E. E. Gabev (1), Evgeni B. Gabev (2), E. E. Gabev Jr. (1), M. V.\n  Bogoeva (3) ((1) Institute of Experimental Pathology and Parasitology,\n  Bulgarian Academy of Sciences (2) Medical University, Sofia, Bulgaria, (3)\n  Institute of Zoology, Bulgarian Academy of Sciences, Sofia, Bulgaria)", "title": "Fitting analysis provides further evidence for eradication of hiv/aids\n  infection under combined liposome drug delivery treatment", "comments": "3 pages, 1 figure. Available at: http://www.geocities.com/hivaidsbg/", "journal-ref": "Drug Delivery Systems and Sciences (UK). 2003, volume 3, No 2, pp.\n  49-51", "doi": null, "report-no": null, "categories": "q-bio.TO", "license": null, "abstract": "  It is now evident that the commonly accepted strategy for treatment of\nHIV/AIDS by highly active antiretroviral therapy (HAART) will not lead to\neradication of HIV in a reasonable time. This is straightforward from the\ntypical exponential viral load decay upon treatment revealing initial\nconsiderable but incomplete reduction of plasma HIV RNA with subsequent low\nlevel HIV persistence even in patients on effective antiretroviral therapy.\nHere we show that the viral load follows a simple zero trend linear regression\nline under different treatment approach recently proposed by us. This\nunambiguously indicates a whole body HIV eradication in reasonable time.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2007 22:09:58 GMT"}], "update_date": "2007-06-22", "authors_parsed": [["Gabev", "E. E.", ""], ["Gabev", "Evgeni B.", ""], ["Gabev", "E. E.", "Jr."], ["Bogoeva", "M. V.", ""]]}, {"id": "0706.3678", "submitter": "Ioan Kosztin", "authors": "Cyrille Norotte, Francoise Marga, Adrian Neagu, Ioan Kosztin and Gabor\n  Forgacs (University of Missouri - Columbia)", "title": "Experimental confirmation of tissue liquidity based on the exact\n  solution of the Laplace equation", "comments": "4 pages, 3 figures, submitted to Phys. Rev. Lett", "journal-ref": null, "doi": "10.1209/0295-5075/81/46003", "report-no": null, "categories": "physics.bio-ph physics.flu-dyn q-bio.TO", "license": null, "abstract": "  The notion of tissue surface tension has provided a physical understanding of\nmorphogenetic phenomena such as tissue spreading or cell sorting. The\nmeasurement of tissue surface tension so far relied on strong approximations on\nthe geometric profile of a spherical droplet compressed between parallel\nplates. We solved the Laplace equation for this geometry and tested its\nsolution on true liquids and embryonic tissue fragments as well as\nmulticellular aggregates. The analytic solution provides the surface tension in\nterms of easily and accurately measurable geometric parameters. Experimental\nresults show that the various tissues and multicellular aggregates studied here\nare incompressible and, similarly to true liquids, possess effective surface\ntensions that are independent of the magnitude of the compressive force and the\nvolume of the droplet.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 17:24:21 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Norotte", "Cyrille", "", "University of Missouri - Columbia"], ["Marga", "Francoise", "", "University of Missouri - Columbia"], ["Neagu", "Adrian", "", "University of Missouri - Columbia"], ["Kosztin", "Ioan", "", "University of Missouri - Columbia"], ["Forgacs", "Gabor", "", "University of Missouri - Columbia"]]}, {"id": "0706.3693", "submitter": "Ioan Kosztin", "authors": "Elijah Flenner, Francoise Marga, Adrian Neagu, Ioan Kosztin and Gabor\n  Forgacs (University of Missouri - Columbia)", "title": "Relating Biophysical Properties Across Scales", "comments": "24 pages, 10 figures, To appear in Current Topics in Developmental\n  Biology", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph physics.comp-ph q-bio.CB q-bio.TO", "license": null, "abstract": "  A distinguishing feature of a multicellular living system is that it operates\nat various scales, from the intracellular to organismal. Very little is known\nat present on how tissue level properties are related to cell and subcellular\nproperties. Modern measurement techniques provide quantitative results at both\nthe intracellular and tissue level, but not on the connection between these. In\nthe present work we outline a framework to address this connection. We\nspecifically concentrate on the morphogenetic process of tissue fusion, by\nfollowing the coalescence of two contiguous multicellular aggregates. The time\nevolution of this process can accurately be described by the theory of viscous\nliquids. We also study fusion by Monte Carlo simulations and a novel Cellular\nParticle Dynamics (CPD) model, which is similar to the earlier introduced\nSubcellular Element Model (Newman, 2005). Using the combination of experiments,\ntheory and modeling we are able to relate the measured tissue level biophysical\nquantities to subcellular parameters. Our approach has validity beyond the\nparticular morphogenetic process considered here and provides a general way to\nrelate biophysical properties across scales.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 18:50:13 GMT"}], "update_date": "2007-06-26", "authors_parsed": [["Flenner", "Elijah", "", "University of Missouri - Columbia"], ["Marga", "Francoise", "", "University of Missouri - Columbia"], ["Neagu", "Adrian", "", "University of Missouri - Columbia"], ["Kosztin", "Ioan", "", "University of Missouri - Columbia"], ["Forgacs", "Gabor", "", "University of Missouri - Columbia"]]}]