[{"id": "0801.0654", "submitter": "Michael Welter", "authors": "Michael Welter, Katalin Bartha and Heiko Rieger", "title": "Hot spot formation in tumor vasculature during tumor growth in an\n  arterio-venous-network environment", "comments": "37 pages, 16 figures (full paper with higher resolution figures at\n  http://www.uni-saarland.de/fak7/rieger/Paper/JTB-welter2-subm.pdf)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": null, "abstract": "  Hot spots in tumors are regions of high vascular density in the center of the\ntumor and their analysis is an important diagnostic tool in cancer treatment.\nWe present a model for vascular remodeling in tumors predicting that the\nformation of hot spots correlates with local inhomogeneities of the original\narterio-venous vasculature of the healthy tissue. Probable locations for hot\nspots in the late stages of the tumor are locations of increased blood pressure\ngradients. The developing tumor vasculature is non-hierarchical but still\ncomplex displaying algebraically decaying density distributions.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jan 2008 11:22:49 GMT"}, {"version": "v2", "created": "Mon, 7 Jan 2008 11:13:47 GMT"}], "update_date": "2008-01-07", "authors_parsed": [["Welter", "Michael", ""], ["Bartha", "Katalin", ""], ["Rieger", "Heiko", ""]]}, {"id": "0801.3382", "submitter": "Jose Luis Toca-Herrera", "authors": "Veronica Saravia", "title": "Hepatocyte Aggregates: Methods of Preparation in the Microgravity\n  Simulating Bioreactor Use in Tissue Engineering", "comments": "MSc Thesis (Chemical Engineering Department, Rovira i Virgili\n  University, Spain) Supervisors: Dr. Petros Lenas and Dr. Jose L. Toca-Herrera\n  Pages:32, Figures:15", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": null, "abstract": "  Tissue Engineering concerns the three-dimensional cell growth so that\nbio-artificial tissues could be created and used for transplantation. The\nrecently expressed concerns from the Tissue Engineering research community for\na re-direction of the research activities necessitate the proposition of new\nmethodologies. We propose a methodology that has to do with the simulation in\nbioreactor systems of liver structures as are described in liver anatomy. I\nthis way the hepatocyte microenvironments that determine their function could\nbe re-created in vitro. The approach needs the use of hepatocyte aggregates as\nentities to load the bioreactor systems. A new bioreactor, the microgravity\nsimulating rotation bioreactor, has been used for the preparation of cell\naggregates. Microcontact printing has been used to produce a patterned\nsurfaces. They were tested adsorbing BSA proteins, and will be used in future\nfor the mmobilization of cell aggregates in order to gain further understanding\nof the role of cell heterogeneity in the cooperative behaviour of cells in\nvitro.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2008 14:40:33 GMT"}], "update_date": "2008-01-23", "authors_parsed": [["Saravia", "Veronica", ""]]}]