[{"id": "0809.1722", "submitter": "Alexandre Vidal", "authors": "Fr\\'ed\\'erique Cl\\'ement (INRIA Rocquencourt), Alexandre Vidal (INRIA\n  Rocquencourt)", "title": "Bifurcation-based parameter tuning in a model of the GnRH pulse and\n  surge generator", "comments": null, "journal-ref": "SIAM Journal on Applied Dynamical Systems 8, 4 (2009) 1591?1631", "doi": "10.1137/080732237", "report-no": null, "categories": "math.DS q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a model of the GnRH pulse and surge generator, with the\ndefinite aim of constraining the model GnRH output with respect to a\nphysiologically relevant list of specifications. The alternating pulse and\nsurge pattern of secretion results from the interaction between a GnRH\nsecreting system and a regulating system exhibiting fast-slow dynamics. The\nmechanisms underlying the behavior of the model are reminded from the study of\nthe Boundary-Layer System according to the \"dissection method\" principle. Using\nsingular perturbation theory, we describe the sequence of bifurcations\nundergone by the regulating (FitzHugh-Nagumo) system, encompassing the rarely\ninvestigated case of homoclinic connexion. Basing on pure dynamical\nconsiderations, we restrict the space of parameter search for the regulating\nsystem and describe a foliation of this restricted space, whose leaves define\nconstant duration ratios between the surge and the pulsatility phase in the\nwhole system. We propose an algorithm to fix the parameter values to also meet\nthe other prescribed ratios dealing with amplitude and frequency features of\nthe secretion signal. We finally apply these results to illustrate the dynamics\nof GnRH secretion in the ovine species and the rhesus monkey.\n", "versions": [{"version": "v1", "created": "Wed, 10 Sep 2008 07:29:35 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Clément", "Frédérique", "", "INRIA Rocquencourt"], ["Vidal", "Alexandre", "", "INRIA\n  Rocquencourt"]]}, {"id": "0809.2415", "submitter": "Remi Hackert", "authors": "R\\'emi Hackert (MAOAC), Ludovic Maes (MAOAC), Marc Herbin (MAOAC),\n  Anick Abourachid (MAOAC), P.A. Libourel (MAOAC)", "title": "Limb preference in the gallop of dogs and the half-bound of pikas on\n  flat ground", "comments": null, "journal-ref": "Laterality 13, 4 (2008) 310-319", "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During fast locomotion - gallop, half bound - of quadruped mammals, the\nground contact of the limbs in each pair do not alternate symmetrically.\nAnimals using such asymmetrical gait thus choose whether the left or the right\nlimb will contact the ground first, and this gives rise to limb preference.\nHere, we report that dogs (Mammalia, Carnivora) and pikas (Mammalia,\nLagomorpha) prefer one forelimb as trailing limb and use it as such almost\ntwice as often as the other. We also show that this choice depends on the\nindividual and is not a characteristic of the species, and that the strength of\nthe preference was not dependent on the animal's running speed.\n", "versions": [{"version": "v1", "created": "Sun, 14 Sep 2008 19:50:42 GMT"}], "update_date": "2008-09-16", "authors_parsed": [["Hackert", "Rémi", "", "MAOAC"], ["Maes", "Ludovic", "", "MAOAC"], ["Herbin", "Marc", "", "MAOAC"], ["Abourachid", "Anick", "", "MAOAC"], ["Libourel", "P. A.", "", "MAOAC"]]}]