[{"id": "1003.1872", "submitter": "Marc de Lussanet H.E.", "authors": "Marc H.E. de Lussanet and Jan W.M. Osse", "title": "An ancestral axial twist explains the contralateral forebrain and the\n  optic chiasm in vertebrates", "comments": "13 pages, 6 figures. A small correction is made (May 2014): see\n  footnote 2", "journal-ref": "Animal Biol., 62(2):193-216 (2012)", "doi": "10.1163/157075611X617102", "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Among the best-known facts of the brain are the contralateral visual,\nauditory, sensational, and motor mappings in the forebrain. How and why did\nthese evolve? The few theories to this question provide functional answers,\nsuch as better networks for visuomotor control. However, these theories\ncontradict the data, as discussed here. Instead we propose that a 90-deg\nleft-turn around the body-axis evolved in a common ancestor of all vertebrates.\nCompensatory migrations of the tissues during development restore body\nsymmetry. Eyes, nostrils and forebrain compensate in the direction of the turn,\nwhereas more caudal structures migrate in the opposite direction. As a result\nof these opposite migrations the forebrain becomes crossed and inverted with\nrespect to the rest of the nervous system. We show that these compensatory\nmigratory movements can indeed be observed in the zebrafish (Danio rerio) and\nthe chick (Gallus gallus). With a model we show how the axial twist hypothesis\npredicts that an optic chiasm should develop on the ventral side of the brain,\nwhereas the olfactory tract should be uncrossed. In addition, the hypothesis\nexplains the decussation of the trochlear nerve, why olfaction is non-crossed,\nwhy the cerebellar hemispheres represent the ipsilateral bodyside, why in\nsharks the forebrain halves each represent the ipsilateral eye, why the heart\nand other inner organs are asymmetric in the body. Due to the poor fossil\nrecord, the possible evolutionary scenarios remain speculative. Molecular\nevidence does support the hypothesis. The findings may throw new insight on the\nproblematic structure of the forebrain.\n", "versions": [{"version": "v1", "created": "Tue, 9 Mar 2010 13:53:19 GMT"}, {"version": "v2", "created": "Mon, 11 Jul 2011 19:28:58 GMT"}, {"version": "v3", "created": "Tue, 12 Jul 2011 07:17:50 GMT"}, {"version": "v4", "created": "Mon, 14 May 2012 07:23:39 GMT"}, {"version": "v5", "created": "Sat, 10 May 2014 13:24:05 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["de Lussanet", "Marc H. E.", ""], ["Osse", "Jan W. M.", ""]]}, {"id": "1003.1927", "submitter": "John Mayberry", "authors": "Rick Durrett, Jasmine Foo, Kevin Leder, John Mayberry, Franziska\n  Michor", "title": "Evolutionary dynamics of tumor progression with random fitness values", "comments": "33 pages, 2 Figures", "journal-ref": "Theoretical Population Biology, Volume 78, Issue 1, August 2010,\n  Pages 54-66", "doi": "10.1016/j.tpb.2010.05.001", "report-no": null, "categories": "math.PR q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most human tumors result from the accumulation of multiple genetic and\nepigenetic alterations in a single cell. Mutations that confer a fitness\nadvantage to the cell are known as driver mutations and are causally related to\ntumorigenesis. Other mutations, however, do not change the phenotype of the\ncell or even decrease cellular fitness. While much experimental effort is being\ndevoted to the identification of the different functional effects of individual\nmutations, mathematical modeling of tumor progression generally considers\nconstant fitness increments as mutations are accumulated. In this paper we\nstudy a mathematical model of tumor progression with random fitness increments.\nWe analyze a multi-type branching process in which cells accumulate mutations\nwhose fitness effects are chosen from a distribution. We determine the effect\nof the fitness distribution on the growth kinetics of the tumor. This work\ncontributes to a quantitative understanding of the accumulation of mutations\nleading to cancer phenotypes.\n", "versions": [{"version": "v1", "created": "Tue, 9 Mar 2010 16:42:21 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Durrett", "Rick", ""], ["Foo", "Jasmine", ""], ["Leder", "Kevin", ""], ["Mayberry", "John", ""], ["Michor", "Franziska", ""]]}, {"id": "1003.4756", "submitter": "Douady Stephane", "authors": "Etienne Couturier, Sylvain Courrech du Pont, St\\'ephane Douady", "title": "The filling law: a general framework for leaf shape diversity and its\n  consequences on folded leaves", "comments": "27 p., 28 fig., article", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO nlin.AO", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Leaves are packed in a bud in different ways, being flat, enrolled, or\nfolded, but always filling the whole bud volume. This {\\guillemotleft} filling\nlaw {\\guillemotright} has many consequences, in particular on the shape of\ngrowing folded leaves. This is shown here for different types of folding and\npacking. The folded volume is always part of an ellipsoid, with the veins on\nthe outside rounded face, and the lamina margin on an adaxial plane or axis.\nThe veins on the abaxial side protect the more fragile lamina. The first\ngeneral consequence of the folds is the presence of symmetries on the leaf\nshape, but also quantitative relationships between lobes and sinus sizes. For\nparticular geometries, the leaf lamina can be limited by lateral veins,\ncreating spoon-like lobes, or transverse cuts, creating asymmetrical wavy\nperimeters. A change in the packing between cultivars induces the corresponding\nchange in the leaf shape. Each particular case shows how pervasive are the\ngeometrical consequences of the filling law.\n", "versions": [{"version": "v1", "created": "Wed, 24 Mar 2010 21:26:25 GMT"}, {"version": "v2", "created": "Thu, 7 Oct 2010 20:06:13 GMT"}], "update_date": "2010-10-11", "authors_parsed": [["Couturier", "Etienne", ""], ["Pont", "Sylvain Courrech du", ""], ["Douady", "Stéphane", ""]]}, {"id": "1003.5953", "submitter": "Hailiang Wang", "authors": "Zhuang Liu, Scott Tabakman, Sarah Sherlock, Xiaolin Li, Zhuo Chen,\n  Kaili Jiang, Shoushan Fan and Hongjie Dai", "title": "Multiplexed five-color molecular imaging of cancer cells and tumor\n  tissues with carbon nanotube Raman tags in the near-infrared", "comments": "Published in Nano Research", "journal-ref": null, "doi": "10.1007/s12274-010-1025-1", "report-no": null, "categories": "cond-mat.mtrl-sci physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Single-walled carbon nanotubes (SWNTs) with five different C13/C12 isotope\ncompositions and well-separated Raman peaks have been synthesized and\nconjugated to five targeting ligands in order to impart molecular specificity.\nMultiplexed Raman imaging of live cells has been carried out by highly specific\nstaining of cells with a five-color mixture of SWNTs. Ex vivo multiplexed Raman\nimaging of tumor samples uncovers a surprising up-regulation of epidermal\ngrowth factor receptor (EGFR) on LS174T colon cancer cells from cell culture to\nin vivo tumor growth. This is the first time five-color multiplexed molecular\nimaging has been performed in the near-infrared (NIR) region under a single\nlaser excitation. Near zero interfering background of imaging is achieved due\nto the sharp Raman peaks unique to nanotubes over the low, smooth\nautofluorescence background of biological species.\n", "versions": [{"version": "v1", "created": "Wed, 31 Mar 2010 00:19:13 GMT"}], "update_date": "2010-04-01", "authors_parsed": [["Liu", "Zhuang", ""], ["Tabakman", "Scott", ""], ["Sherlock", "Sarah", ""], ["Li", "Xiaolin", ""], ["Chen", "Zhuo", ""], ["Jiang", "Kaili", ""], ["Fan", "Shoushan", ""], ["Dai", "Hongjie", ""]]}]