[{"id": "1111.1228", "submitter": "Vahid Rezania", "authors": "Vahid Rezania, Rebeccah E. Marsh, Dennis Coombe and Jack A. Tuszynski", "title": "A Physiologically-Based Flow Network Model for Hepatic Drug Elimination\n  I: Regular Lattice Lobule Model", "comments": "19 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a physiologically-based lattice model for the transport and\nmetabolism of drugs in the functional unit of the liver, called the lobule. In\ncontrast to earlier studies, we have emphasized the dominant role of convection\nin well-vascularized tissue with a given structure. Estimates of convective,\ndiffusive and reaction contributions are given. We have compared drug\nconcentration levels observed exiting the lobule with their predicted detailed\ndistribution inside the lobule, assuming that most often the former is\naccessible information while the latter is not.\n", "versions": [{"version": "v1", "created": "Fri, 4 Nov 2011 19:57:39 GMT"}], "update_date": "2011-11-07", "authors_parsed": [["Rezania", "Vahid", ""], ["Marsh", "Rebeccah E.", ""], ["Coombe", "Dennis", ""], ["Tuszynski", "Jack A.", ""]]}, {"id": "1111.1496", "submitter": "Ekaterina Nikitina G.", "authors": "E. Nikitina, L. Urazova, O. Churuksaeva", "title": "Dinamics of HPV Infection among Women with Cervical Lesions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A total of 293 women treated at Tomsk Cancer Research Institute were\nexamined. HPV type 16 had the highest incidence rate (45.0%) followed by HPV\n31-17,0%, HPV 56/33-15,0%, HPV 51/18/52-13,0%, HPV 58/35/39/45-7,0%, HPV\n59-5,0%. Persistent infection was detected in 35.7% of primarily HPV-positive\ncases (10 out of 28 patients), mainly in cervical cancer patients. Total number\nof primarily HPV-positive and HPV-negative patients with cervical cancer was\n95.0% and 5.0%, respectively. The corresponding values after the complex\ntreatment were 35.0% and 65.0%, respectively, pointing to the treatment\nefficiency.\n", "versions": [{"version": "v1", "created": "Mon, 7 Nov 2011 06:45:46 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Nikitina", "E.", ""], ["Urazova", "L.", ""], ["Churuksaeva", "O.", ""]]}, {"id": "1111.3126", "submitter": "Sergey Murik E", "authors": "Sergey E. Murik", "title": "Polarization Theory of Motivations, Emotions and Attention", "comments": "12 pages, 2 figures", "journal-ref": "Bulletin of Eastern-Siberian Scientific Center SB RAMS, 2005, No.\n  7, p.167-174 (in Russian)", "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  A new theory of motivations, emotions and attention is suggested, considering\nthem as functions of sensory systems. The theory connects neurophysiological\nmechanisms of mental phenomena with the change of metabolic and functional\nstate of perceptive neurons, which is reflected in the degree of polarization\nof a cell membrane.\n", "versions": [{"version": "v1", "created": "Mon, 14 Nov 2011 08:03:32 GMT"}], "update_date": "2011-11-15", "authors_parsed": [["Murik", "Sergey E.", ""]]}, {"id": "1111.3610", "submitter": "Jan Karbowski", "authors": "Jan Karbowski", "title": "Scaling of brain metabolism and blood flow in relation to capillary and\n  neural scaling", "comments": "paper plus supporting material plus figures", "journal-ref": "PLoS ONE 6(10): e26709 (2011)", "doi": "10.1371/journal.pone.0026709", "report-no": null, "categories": "q-bio.NC physics.bio-ph q-bio.CB q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Brain is one of the most energy demanding organs in mammals, and its total\nmetabolic rate scales with brain volume raised to a power of around 5/6. This\nvalue is significantly higher than the more common exponent 3/4 relating whole\nbody resting metabolism with body mass and several other physiological\nvariables in animals and plants. This article investigates the reasons for\nbrain allometric distinction on a level of its microvessels. Based on collected\nempirical data it is found that regional cerebral blood flow CBF across gray\nmatter scales with cortical volume $V$ as $CBF \\sim V^{-1/6}$, brain capillary\ndiameter increases as $V^{1/12}$, and density of capillary length decreases as\n$V^{-1/6}$. It is predicted that velocity of capillary blood is almost\ninvariant ($\\sim V^{\\epsilon}$), capillary transit time scales as $V^{1/6}$,\ncapillary length increases as $V^{1/6+\\epsilon}$, and capillary number as\n$V^{2/3-\\epsilon}$, where $\\epsilon$ is typically a small correction for medium\nand large brains, due to blood viscosity dependence on capillary radius. It is\nshown that the amount of capillary length and blood flow per cortical neuron\nare essentially conserved across mammals. These results indicate that geometry\nand dynamics of global neuro-vascular coupling have a proportionate character.\nMoreover, cerebral metabolic, hemodynamic, and microvascular variables scale\nwith allometric exponents that are simple multiples of 1/6, rather than 1/4,\nwhich suggests that brain metabolism is more similar to the metabolism of\naerobic than resting body. Relation of these findings to brain functional\nimaging studies involving the link between cerebral metabolism and blood flow\nis also discussed.\n", "versions": [{"version": "v1", "created": "Tue, 15 Nov 2011 19:01:36 GMT"}], "update_date": "2011-11-16", "authors_parsed": [["Karbowski", "Jan", ""]]}, {"id": "1111.5814", "submitter": "Thomas Risler", "authors": "Fabien Montel (1), Morgan Delarue (1), Jens Elgeti (1), Laurent\n  Malaquin (1), Markus Basan (1), Thomas Risler (1), Bernard Cabane (3),\n  Danijela Vignjevic (2), Jacques Prost (1 and 3), Giovanni Cappello (1) and\n  Jean-Fran\\c{c}ois Joanny (1)", "title": "Stress Clamp Experiments on Multicellular Tumor Spheroids", "comments": "5 pages, 4 figures", "journal-ref": "Phys. Rev. Lett. 107, 188102 (2011)", "doi": "10.1016/j.bpj.2011.11.1208", "report-no": null, "categories": "physics.bio-ph physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The precise role of the microenvironment on tumor growth is poorly\nunderstood. Whereas the tumor is in constant competition with the surrounding\ntissue, little is known about the mechanics of this interaction. Using a novel\nexperimental procedure, we study quantitatively the effect of an applied\nmechanical stress on the long-term growth of a spheroid cell aggregate. We\nobserve that a stress of 10 kPa is sufficient to drastically reduce growth by\ninhibition of cell proliferation mainly in the core of the spheroid. We compare\nthe results to a simple numerical model developed to describe the role of\nmechanics in cancer progression.\n", "versions": [{"version": "v1", "created": "Thu, 24 Nov 2011 16:44:22 GMT"}], "update_date": "2017-08-23", "authors_parsed": [["Montel", "Fabien", "", "1 and 3"], ["Delarue", "Morgan", "", "1 and 3"], ["Elgeti", "Jens", "", "1 and 3"], ["Malaquin", "Laurent", "", "1 and 3"], ["Basan", "Markus", "", "1 and 3"], ["Risler", "Thomas", "", "1 and 3"], ["Cabane", "Bernard", "", "1 and 3"], ["Vignjevic", "Danijela", "", "1 and 3"], ["Prost", "Jacques", "", "1 and 3"], ["Cappello", "Giovanni", ""], ["Joanny", "Jean-François", ""]]}, {"id": "1111.6636", "submitter": "Per Sebastian Skardal", "authors": "Per Sebastian Skardal, Alain Karma, and Juan G. Restrepo", "title": "Unidirectional Pinning and Hysteresis of Spatially Discordant Alternans\n  in Cardiac Tissue", "comments": "4 pages, 3 figures", "journal-ref": null, "doi": "10.1103/PhysRevLett.108.108103", "report-no": null, "categories": "nlin.PS math.DS physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatially discordant alternans is a widely observed pattern of voltage and\ncalcium signals in cardiac tissue that can precipitate lethal cardiac\narrhythmia. Using spatially coupled iterative maps of the beat-to-beat\ndynamics, we explore this pattern's dynamics in the regime of a\ncalcium-dominated period-doubling instability at the single cell level. We find\na novel nonlinear bifurcation associated with the formation of a discontinuous\njump in the amplitude of calcium alternans at nodal lines separating discordant\nregions. We show that this jump unidirectionally pins nodal lines by preventing\ntheir motion away from the pacing site following a pacing rate decrease, but\npermitting motion towards this site following a rate increase. This\nunidirectional pinning leads to strongly history-dependent nodal line motion\nthat is strongly arrhythmogenic.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2011 22:12:28 GMT"}, {"version": "v2", "created": "Wed, 11 Jan 2012 17:41:03 GMT"}], "update_date": "2012-03-09", "authors_parsed": [["Skardal", "Per Sebastian", ""], ["Karma", "Alain", ""], ["Restrepo", "Juan G.", ""]]}, {"id": "1111.6811", "submitter": "Waldemar Ulmer H", "authors": "W. Ulmer", "title": "Radiobiological investigations at tumor cell lines by exploiting\n  chrono-biological aspects of chronological dose distributions", "comments": "+In memory of W. Duechting, who departed in December, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.med-ph q-bio.TO", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Using 31P-NMR spectroscopy the chronological behavior of the ATP-metabolism\nof the tumor spheroids C3H-MA, 9L-Gliome and the mono-layer L1210 has been\nanalyzed via decrease of the {\\beta}-peak. All three cell lines show\ncharacteristic periods, and a homeostatic control cannot be recognized.\nEssential components of these periods are circadian (i.e. one day),\ncirca-semiseptan (i.e. 3.5 days) and circa-septan (i.e. one week). The\ndetermination of the survival fractions provides an optimum exploitation of\nradiation damages, when the ATP-concentration assumes a maximum value. This\noptimum is reached, when all three cycles exhibit the ATP maximum, which is\nonly possible by accounting for the circa-septan rhythm. The goal of this study\nis to elaborate an optimal fractionation scheme with regard to the irradiation\nof tumors.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2011 13:40:47 GMT"}, {"version": "v2", "created": "Wed, 30 Nov 2011 10:29:02 GMT"}, {"version": "v3", "created": "Sat, 10 Dec 2011 09:03:51 GMT"}], "update_date": "2011-12-13", "authors_parsed": [["Ulmer", "W.", ""]]}, {"id": "1111.6916", "submitter": "Nilima Nigam", "authors": "Marc Ryser, Svetlana V. Komarova, Nilima Nigam", "title": "The cellular dynamics of bone remodeling: a mathematical model", "comments": null, "journal-ref": "SIAM J. Appl. Math. 70, pp. 1899-1921", "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mechanical properties of vertebrate bone are largely determined by a\nprocess which involves the complex interplay of three different cell types.\nThis process is called {\\it bone remodeling}, and occurs asynchronously at\nmultiple sites in the mature skeleton. The cells involved are bone resorbing\nosteoclasts, bone matrix producing osteoblasts and mechanosensing osteocytes.\nThese cells communicate with each other by means of autocrine and paracrine\nsignaling factors and operate in complex entities, the so-called bone\nmulticellular units (BMU). To investigate the BMU dynamics in silico, we\ndevelop a novel mathematical model resulting in a system of nonlinear partial\ndifferential equations with time delays. The model describes the osteoblast and\nosteoclast populations together with the dynamics of the key messenger molecule\nRANKL and its decoy receptor OPG. Scaling theory is used to address parameter\nsensitivity and predict the emergence of pathological remodeling regimes. The\nmodel is studied numerically in one and two space dimensions using finite\ndifference schemes in space and explicit delay equation solvers in time. The\ncomputational results are in agreement with in vivo observations and provide\nnew insights into the role of the RANKL/OPG pathway in the spatial regulation\nof bone remodeling.\n", "versions": [{"version": "v1", "created": "Sun, 27 Nov 2011 21:43:03 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Ryser", "Marc", ""], ["Komarova", "Svetlana V.", ""], ["Nigam", "Nilima", ""]]}]