[{"id": "1204.1429", "submitter": "Andree-Aimee Toucas", "authors": "Pierre Badel (Cis-Ensmse, D2bm-Ensmse, Ifresis-Ensmse, Lcg-Ensm.Se),\n  St\\'ephane Avril (Cis-Ensmse, D2bm-Ensmse, Ifresis-Ensmse, Lcg-Ensm.Se),\n  Susan Lessner (Dcba), Michael A. Sutton (Dme-Usc)", "title": "Mechanical identification of layer-specific properties of mouse carotid\n  arteries using 3D-DIC and a hyperelastic anisotropic constitutive model", "comments": "PB-CMBBE-15.pdf", "journal-ref": "Computer Methods in Biomechanics and Biomedical Engineering 15, 1\n  (2012) 37-48", "doi": "10.1080/10255842.2011.586945", "report-no": null, "categories": "physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The role of mechanics is known to be of primary order in many arterial\ndiseases; however, determining mechanical properties of arteries remains a\nchallenge. This paper discusses the identifiability of the passive mechanical\nproperties of a mouse carotid artery, taking into account the orientation of\ncollagen fibres in the medial and adventitial layers. On the basis of 3D\ndigital image correlation measurements of the surface strain during an\ninflation/extension test, an inverse identification method is set up. It\ninvolves a 3D finite element mechanical model of the mechanical test and an\noptimisation algorithm. A two-layer constitutive model derived from the\nHolzapfel model is used, with five and then seven parameters. The\nfive-parameter model is successfully identified providing layer-specific fibre\nangles. The seven-parameter model is over parameterised, yet it is shown that\nadditional data from a simple tension test make the identification of refined\nlayer-specific data reliable.\n", "versions": [{"version": "v1", "created": "Fri, 6 Apr 2012 08:00:37 GMT"}], "update_date": "2012-04-09", "authors_parsed": [["Badel", "Pierre", "", "Cis-Ensmse, D2bm-Ensmse, Ifresis-Ensmse, Lcg-Ensm.Se"], ["Avril", "Stéphane", "", "Cis-Ensmse, D2bm-Ensmse, Ifresis-Ensmse, Lcg-Ensm.Se"], ["Lessner", "Susan", "", "Dcba"], ["Sutton", "Michael A.", "", "Dme-Usc"]]}, {"id": "1204.3809", "submitter": "Alicia Martinez-Gonzalez", "authors": "Alicia Mart\\'inez-Gonz\\'alez (1), Gabriel F. Calvo (2), Luis A.\n  P\\'erez Romasanta (3) and V\\'ictor M. P\\'erez-Garc\\'ia (1) ((1) Departamento\n  de Matem\\'aticas, E. T. S. I. Industriales and Instituto de Matem\\'atica\n  Aplicada a la Ciencia y la Ingenier\\'ia, Universidad de Castilla-La Mancha,\n  Ciudad Real, Spain, (2) Departamento de Matem\\'aticas, E. T. S. I. Caminos,\n  Canales y Puertos and Instituto de Matem\\'atica Aplicada a la Ciencia y la\n  Ingenier\\'ia, Universidad de Castilla-La Mancha, Ciudad Real, Spain, (3)\n  Servicio de Oncolog\\'ia Radioter\\'apica. Hospital General Universitario de\n  Ciudad Real, Ciudad Real, Spain)", "title": "Hypoxic Cell Waves around Necrotic Cores in Glioblastoma: A\n  Biomathematical Model and its Therapeutic Implications", "comments": "29 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Glioblastoma is a rapidly evolving high-grade astrocytoma that is\ndistinguished pathologically from lower grade gliomas by the presence of\nnecrosis and microvascular hiperplasia. Necrotic areas are typically surrounded\nby hypercellular regions known as \"pseudopalisades\" originated by local tumor\nvessel occlusions that induce collective cellular migration events. This leads\nto the formation of waves of tumor cells actively migrating away from central\nhypoxia. We present a mathematical model that incorporates the interplay among\ntwo tumor cell phenotypes, a necrotic core and the oxygen distribution. Our\nsimulations reveal the formation of a traveling wave of tumor cells that\nreproduces the observed histologic patterns of pseudopalisades. Additional\nsimulations of the model equations show that preventing the collapse of tumor\nmicrovessels leads to slower glioma invasion, a fact that might be exploited\nfor therapeutic purposes.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 14:58:16 GMT"}], "update_date": "2012-04-18", "authors_parsed": [["Martínez-González", "Alicia", ""], ["Calvo", "Gabriel F.", ""], ["Romasanta", "Luis A. Pérez", ""], ["Pérez-García", "Víctor M.", ""]]}, {"id": "1204.3928", "submitter": "Jan Karbowski", "authors": "Jan Karbowski", "title": "Approximate invariance of metabolic energy per synapse during\n  development in mammalian brains", "comments": "brain development, synaptogenesis, brain metabolism", "journal-ref": "PLoS ONE 7(3): e33425 (2012)", "doi": "10.1371/journal.pone.0033425", "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During mammalian development the cerebral metabolic rate correlates\nqualitatively with synaptogenesis, and both often exhibit bimodal temporal\nprofiles. Despite these non-monotonic dependencies, it is found based on\nempirical data for different mammals that regional metabolic rate per synapse\nis approximately conserved from birth to adulthood for a given species (with a\nslight deviation from this constancy for human visual and temporal cortices\nduring adolescence). A typical synapse uses about $(7\\pm 2)\\cdot 10^{3}$\nglucose molecules per second in primate cerebral cortex, and about 5 times of\nthat amount in cat and rat visual cortices. A theoretical model for brain\nmetabolic expenditure is used to estimate synaptic signaling and neural spiking\nactivity during development. It is found that synaptic efficacy is generally\ninversely correlated with average firing rate, and additionally, synapses\nconsume a bulk of metabolic energy, roughly $50-90 %$ during most of the\ndevelopmental process (except human temporal cortex $ < 50%$). Overall, these\nresults suggest a tight regulation of brain electrical and chemical activities\nduring the formation and consolidation of neural connections. This presumably\nreflects strong energetic constraints on brain development.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 21:51:34 GMT"}], "update_date": "2012-04-19", "authors_parsed": [["Karbowski", "Jan", ""]]}]