[{"id": "1205.0225", "submitter": "Ivan Rudskiy V", "authors": "Ivan V. Rudskiy, Nadejda V. Khodorova", "title": "Reconstruction of the 3D structure and developmental history of plant\n  cells and tissues", "comments": "15 pages, 10 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern spatial microscopy has provided developmental biology with powerful\nresearch tools. However, the recent significant technological breakthroughs\nhave inevitably led to technical \"bottlenecks\" for the application of the new\nprocedures to other tasks. We have developed a protocol for the 3D\nreconstruction of plant organelles and tissues from stacks of two-dimensional\nimages obtained by means of a wide range of electron transmission and light\nmicroscopy. This protocol can be applied to a large set of primary data: live,\nfixed or even paleobotanical material. For tissue reconstruction, we have also\ndeveloped a protocol of cell lineage tracing based on the geometrical\nproperties of plant cells. For the tissue sample consisting of $n$ cells, this\napproach allows the reconstruction of up to $n-1$ cell divisions from the\nprevious cell generations. Our protocol complements the limitations of clonal\nanalysis and recent real-time approaches of lineage tracing. It works well in\nthe case of tissues with directed and non-directed growth. Using these\nprotocols, the subcellular relations between the complex surface of plastids\nwith stromules and mitochondria in the tuber parenchyma cells in\n\\textit{Corydalis bracteata} have been revealed. Moreover, for the embryo\n($n=17$) and the seedling shoot apex ($n=208$) of \\textit{Calla palustris}, the\ncellular architecture and full cell genealogy of up to 15 cell generations have\nbeen reconstructed. Three relatively independent cell lineages with stem cells\nlocated at the surface of the shoot apex have been found. The possibility of\nusing a wide range of software, including open-source projects, is discussed.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2012 17:40:36 GMT"}], "update_date": "2012-05-02", "authors_parsed": [["Rudskiy", "Ivan V.", ""], ["Khodorova", "Nadejda V.", ""]]}, {"id": "1205.2012", "submitter": "Mohammadkarim Saeedghalati", "authors": "Mohammadkarim Saeedghalati, Abdolhossein Abbassian", "title": "The effect of temporal pattern of injury on disability in learning\n  networks", "comments": "Latex, 17 pages, 7 figures, 2 tables", "journal-ref": null, "doi": "10.3389/fncom.2015.00130", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How networks endure damage is a central issue in neural network research.\nThis includes temporal as well as spatial pattern of damage. Here, based on\nsome very simple models we study the difference between a slow-growing and\nacute damage and the relation between the size and rate of injury. Our result\nshows that in both a three-layer and a homeostasis model a slow-growing damage\nhas a decreasing effect on network disability as compared with a fast growing\none. This finding is in accord with clinical reports where the state of\npatients before and after the operation for slow-growing injuries is much\nbetter that those patients with acute injuries.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2012 15:19:49 GMT"}], "update_date": "2016-12-12", "authors_parsed": [["Saeedghalati", "Mohammadkarim", ""], ["Abbassian", "Abdolhossein", ""]]}, {"id": "1205.2440", "submitter": "Gerardo F. Goya", "authors": "S. Vranje\\v{s}-\\Djuri\\'c, M. Radovi\\'c, N. Nikoli\\'c, D. Jankovi\\'c,\n  G. F. Goya, T. E. Torres, M. P. Calatayud, I. J. Bruvera, M. R. Ibarra, V.\n  Spasojevi\\'c, B. Jancar and B. Anti\\'c", "title": "Novel multifunctional 90Y-labelled albumin magnetic microspheres for\n  cancer therapy", "comments": "27 pages, 9 figures, submitted to Acta Biomateriala", "journal-ref": "J. Mater. Chem., 2012,22, 24017-24025", "doi": "10.1039/c2jm35593k", "report-no": null, "categories": "q-bio.TO cond-mat.mtrl-sci physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present in vitro and in vivo studies of yttrium-90 (90Y)-labelled human\nserum albumin magnetic microspheres (HSAMMS) as multifunctional agent for\nbimodal radionuclide-hyperthermia cancer therapy. The HSAMMS were produced\nusing a modified emulsification-heat stabilization technique and contained\n10-nm magnetite nanoparticles coated with citric acid, distributed as\ninhomogeneous clusters within the albumin microspheres. The average particle\nsize of the complete HSAMMS was 20 (mu)m, and they exhibited superparamagnetic\nbehavior at room temperature. The stability of the 90^Y-labelled HSAMMS was\ninvestigated in vitro (in saline and human serum) and in vivo by analyzing\ntheir biodistribution in normal Wistar rats. The in vitro experiments revealed\nthe high stability of the labelled HSAMMS in saline and human serum after 72 h.\nFollowing the intravenous administration of the 90^Y-HSAMMS in rats, 88.81% of\nthe activity localizes in the lungs after 1 h, with 82.67% remaining after 72\nh. These data on 90Y-HSAMMS provide good evidence for their potential use in\nbimodal radionuclide-hyperthermia cancer therapy.\n", "versions": [{"version": "v1", "created": "Fri, 11 May 2012 06:55:42 GMT"}], "update_date": "2012-12-11", "authors_parsed": [["Vranješ-\\Djurić", "S.", ""], ["Radović", "M.", ""], ["Nikolić", "N.", ""], ["Janković", "D.", ""], ["Goya", "G. F.", ""], ["Torres", "T. E.", ""], ["Calatayud", "M. P.", ""], ["Bruvera", "I. J.", ""], ["Ibarra", "M. R.", ""], ["Spasojević", "V.", ""], ["Jancar", "B.", ""], ["Antić", "B.", ""]]}, {"id": "1205.5066", "submitter": "Jacob Oppenheim", "authors": "Jacob N. Oppenheim and Marcelo O. Magnasco", "title": "A Topological Phase Transition in the Scheidegger Model of River\n  Networks", "comments": "6 pages, 4 figures", "journal-ref": "Physical Review E, August 2012", "doi": "10.1103/PhysRevE.86.021134", "report-no": null, "categories": "q-bio.TO cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the canonical Scheidegger Model of river network morphology\nfor the case of convergent and divergent underlying topography, by embedding it\non a cone. We find two distinct phases corresponding to few, long basins and\nmany, short basins, respectively, separated by a singularity in number of\nbasins, indicating a phase transition. Quantifying basin shape through Hack's\nLaw $l\\sim a^h$ gives distinct values for the exponent $h$, providing a method\nof testing our hypotheses. The generality of our model suggests implications\nfor vascular morphology, in particular differing number and shapes of arterial\nand venous trees.\n", "versions": [{"version": "v1", "created": "Tue, 22 May 2012 22:21:44 GMT"}, {"version": "v2", "created": "Wed, 22 Aug 2012 14:02:22 GMT"}], "update_date": "2012-08-31", "authors_parsed": [["Oppenheim", "Jacob N.", ""], ["Magnasco", "Marcelo O.", ""]]}, {"id": "1205.5182", "submitter": "Philip Gerlee Dr", "authors": "Jacob G Scott and David Basanta and Alexander R.A. Anderson and Philip\n  Gerlee", "title": "A mathematical model of tumor self-seeding reveals secondary metastatic\n  deposits as drivers of primary tumor growth", "comments": "20 pages, 4 figures", "journal-ref": null, "doi": "10.1098/rsif.2013.0011", "report-no": null, "categories": "q-bio.TO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two models of circulating tumor cell (CTC) dynamics have been proposed to\nexplain the phenomenon of tumor 'self-seeding', whereby CTCs repopulate the\nprimary tumor and accelerate growth: Primary Seeding, where cells from a\nprimary tumor shed into the vasculature and return back to the primary\nthemselves; and Secondary Seeding, where cells from the primary first\nmetastasize in a secondary tissue and form microscopic secondary deposits,\nwhich then shed cells into the vasculature returning to the primary. These two\nmodels are difficult to distinguish experimentally, yet the differences between\nthem is of great importance to both our understanding of the metastatic process\nand also for designing methods of intervention. Therefore we developed a\nmathematical model to test the relative likelihood of these two phenomena in\nthe subset of tumours whose shed CTCs first encounter the lung capillary bed,\nand show that Secondary Seeding is several orders of magnitude more likely than\nPrimary seeding. We suggest how this difference could affect tumour evolution,\nprogression and therapy, and propose several possible methods of experimental\nvalidation.\n", "versions": [{"version": "v1", "created": "Wed, 23 May 2012 14:20:47 GMT"}, {"version": "v2", "created": "Thu, 4 Oct 2012 11:39:49 GMT"}, {"version": "v3", "created": "Mon, 25 Feb 2013 10:01:46 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Scott", "Jacob G", ""], ["Basanta", "David", ""], ["Anderson", "Alexander R. A.", ""], ["Gerlee", "Philip", ""]]}]