[{"id": "1207.1064", "submitter": "Michael Krahe", "authors": "Michael Krahe, Iris Wenzel, Kao-Nung Lin, Julia Fischer, Joseph\n  Goldmann, Markus K\\\"astner, and Claus F\\\"utterer", "title": "Fluctuations and differential contraction during regeneration of Hydra\n  vulgaris tissue toroids", "comments": "19 pages and 8 figures, submitted to New Journal of Physics", "journal-ref": "New J. Phys. 15 (2013) 035004", "doi": "10.1088/1367-2630/15/3/035004", "report-no": null, "categories": "physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We studied regenerating bilayered tissue toroids dissected from Hydra\nvulgaris polyps and relate our macroscopic observations to the dynamics of\nforce-generating mesoscopic cytoskeletal structures. Tissue fragments undergo a\nspecific toroid-spheroid folding process leading to complete regeneration\ntowards a new organism. The time scale of folding is too fast for biochemical\nsignalling or morphogenetic gradients which forced us to assume purely\nmechanical self-organization. The initial pattern selection dynamics was\nstudied by embedding toroids into hydro-gels allowing us to observe the\ndeformation modes over longer periods of time. We found increasing mechanical\nfluctuations which break the toroidal symmetry and discuss the evolution of\ntheir power spectra for various gel stiffnesses. Our observations are related\nto single cell studies which explain the mechanical feasibility of the folding\nprocess. In addition, we observed switching of cells from a tissue bound to a\nmigrating state after folding failure as well as in tissue injury.\n  We found a supra-cellular actin ring assembled along the toroid's inner edge.\nIts contraction can lead to the observed folding dynamics as we could confirm\nby finite element simulations. This actin ring in the inner cell layer is\nassembled by myosin- driven length fluctuations of supra-cellular\n{\\alpha}-actin structures (myonemes) in the outer cell-layer.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2012 17:46:43 GMT"}, {"version": "v2", "created": "Fri, 30 Nov 2012 12:00:38 GMT"}], "update_date": "2013-03-06", "authors_parsed": [["Krahe", "Michael", ""], ["Wenzel", "Iris", ""], ["Lin", "Kao-Nung", ""], ["Fischer", "Julia", ""], ["Goldmann", "Joseph", ""], ["Kästner", "Markus", ""], ["Fütterer", "Claus", ""]]}, {"id": "1207.1516", "submitter": "Edouard Hannezo", "authors": "Edouard Hannezo, Jean-Francois Joanny, Jacques Prost", "title": "Mechanical Instabilities of Biological Tubes", "comments": null, "journal-ref": "Phys. Rev. Lett. 109, 018101 (2012)", "doi": "10.1103/PhysRevLett.109.018101", "report-no": null, "categories": "physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study theoretically the shapes of biological tubes affected by various\npathologies. When epithelial cells grow at an uncontrolled rate, the negative\ntension produced by their division provokes a buckling instability. Several\nshapes are investigated : varicose, enlarged, sinusoidal or sausage-like, all\nof which are found in pathologies of tracheal, renal tubes or arteries. The\nfinal shape depends crucially on the mechanical parameters of the tissues :\nYoung modulus, wall-to-lumen ratio, homeostatic pressure. We argue that since\ntissues must be in quasistatic mechanical equilibrium, abnormal shapes convey\ninformation as to what causes the pathology. We calculate a phase diagram of\ntubular instabilities which could be a helpful guide for investigating the\nunderlying genetic regulation.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2012 04:19:53 GMT"}], "update_date": "2012-07-09", "authors_parsed": [["Hannezo", "Edouard", ""], ["Joanny", "Jean-Francois", ""], ["Prost", "Jacques", ""]]}, {"id": "1207.1891", "submitter": "Samrat Chatterjee", "authors": "Kamiya Tikoo, Shashank Mishr, V. Manivel, Kanury VS Rao, Parul\n  Tripathi and Sachin Sharma", "title": "Immunomodulatory role of an Ayurvedic formulation on imbalanced\n  immune-metabolics during inflammatory responses of obesity and pre-diabetic\n  disease", "comments": "16 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Obesity and related type 2 diabetes are associated with a low level chronic\ninflammatory state with disease status increasing at epidemic proportions\nworldwide. It is now universally accepted that the underlying\nimmune-inflammatory responses mediated within the adipose tissue in obesity are\ncentral to the development of disease. Once initiated, chronic inflammation\nassociated with obesity leads to the modulation of immune cell function. In the\npresent study we aimed to investigate the effect of an ayurvedic formulation\n(named as Kal-1, an abbreviation derived from the procuring source) on\ndiet-induced obesity and type II diabetes using C57BL/6J mice. The study was\nplanned into two groups using obese and pre-diabetic mouse model. The mice were\nfed on high-fat with increased diet and, different amounts (5, 20 and 75\n{\\mu}g) of Kal-1 were given with disease progression for 21 weeks in first\ngroup whereas mice were first put on the same diet for 21 weeks and then\ntreated with same amounts of Kal-1. A significant reduction in body weight and\nfat pads, fasting blood glucose levels, insulin levels and biochemical\nparameters like triglycerides and cholesterol were observed in obese and\ndiabetic mice+Kal-1 than control (lean) mice fed on low fat diet, though the\noptimum amounts of Kal-1 were 20 and 75 {\\mu}g in first and second group\nrespectively. A noteworthy immunological correction in important readouts viz.\nresistin, leptin, HMW adiponection and an array of pro- & anti-cytokines (IL-4,\nIL-10, IL-1{\\alpha}, IL-1{\\beta}, IL-4, IL-6, IL-10, TNF-{\\alpha} and MCP-1)\nwas also observed in both the groups with the mentioned amount of Kal-1. We\nconclude that Kal-1 has immunomodulatory potential for diet-induced obesity and\nassociated metabolic disorders.\n", "versions": [{"version": "v1", "created": "Sun, 8 Jul 2012 17:28:17 GMT"}], "update_date": "2012-07-10", "authors_parsed": [["Tikoo", "Kamiya", ""], ["Mishr", "Shashank", ""], ["Manivel", "V.", ""], ["Rao", "Kanury VS", ""], ["Tripathi", "Parul", ""], ["Sharma", "Sachin", ""]]}, {"id": "1207.2838", "submitter": "Takuya Okabe", "authors": "Takuya Okabe", "title": "Vascular phyllotaxis transition and an evolutionary mechanism of\n  phyllotaxis", "comments": null, "journal-ref": "Scientific Reports 5, 15358 (2015)", "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.TO", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Leaves of vascular plants are arranged regularly around stems, a phenomenon\nknown as phyllotaxis. A constant angle between two successive leaves is called\ndivergence angle. On the one side, the divergence angle $\\alpha_0$ of an\ninitial pattern of leaf primordia at a shoot apex is most commonly an\nirrational number of about 137.5 degrees, called limit divergence. On the other\nside, the divergence $\\alpha$ of a final pattern of leaf traces in the vascular\nsystem of a mature stem is expressed in terms of a sequence of rational\nnumbers, 1/2, 1/3, 2/5, 3/8, 5/13, 8/21, called phyllotactic fractions. The\nmathematical relationship between the initial divergence $\\alpha_0$, the final\ndivergence $\\alpha$, and the number of internodes traversed by the leaf traces\n$n_c$ is investigated by means of a theoretical model of vascular phyllotaxis.\nIt is shown that continuous changes of the trace length $n_c$ induce\ntransitions between the fractional orders in the vascular structure. The\nvascular phyllotaxis transition suggests an evolutionary mechanism for the\nphenomenon of phyllotaxis. To provide supporting evidence for the model and\nmechanism, available experimental results for fossil remains of Lepidodendron\nand the vascular structure of Linum and Populus are analyzed with the model.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2012 03:52:11 GMT"}], "update_date": "2017-07-19", "authors_parsed": [["Okabe", "Takuya", ""]]}, {"id": "1207.3289", "submitter": "Eric  Werner", "authors": "Eric Werner", "title": "The Origin, Evolution and Development of Bilateral Symmetry in\n  Multicellular Organisms", "comments": "29 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A computational theory and model of the ontogeny and development of bilateral\nsymmetry in multicellular organisms is presented. Understanding the origin and\nevolution of bilateral organisms requires an understanding of how bilateral\nsymmetry develops, starting from a single cell. Bilateral symmetric growth of a\nmulticellular organism from a single starter cell is explained as resulting\nfrom the opposite handedness and orientation along one axis in two daughter\nfounder cells that are in equivalent developmental control network states.\nSeveral methods of establishing the initial orientation of the daughter cells\n(including oriented cell division and cell signaling) are discussed. The\norientation states of the daughter cells are epigenetically inherited by their\nprogeny. This results in mirror development with the two founding daughter\ncells generating complementary mirror image multicellular morphologies. The end\nproduct is a bilateral symmetric organism. The theory gives a unified\nexplanation of diverse phenomena including symmetry breaking, situs inversus,\ngynandromorphs, inside-out growth, bilaterally symmetric cancers, and the\nrapid, punctuated evolution of bilaterally symmetric organisms in the Cambrian\nExplosion. The theory is supported by experimental results on early embryonic\ndevelopment. The theory makes precise testable predications.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jul 2012 16:06:35 GMT"}], "update_date": "2012-07-16", "authors_parsed": [["Werner", "Eric", ""]]}, {"id": "1207.3321", "submitter": "Riansares Arriazu PhD", "authors": "Andrea Redondo, Raquel Romero, Ana Lorenzo, Noelia Sanz, Esther\n  Dur\\'an, Beatriz Oltra, Jos\\'e Manuel Pozuelo, Luis Santamar\\'ia, and\n  Ri\\'ansares Arriazu", "title": "The effect of low doses of cadmium and zinc chloride on the Blood-Testis\n  Barrier of Sprague Dawley rats", "comments": "7 pages, 4 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Cadmium chloride is an environmental toxic that affects the male\nreproductive system. This study was directed 1) to evaluate whether long-term\noral exposures to low doses of Cd in rats causes morphological changes, 2) the\nimmunohistochemical TJ and AJ protein expression; and 3) to evidence that zinc\nexposure can modify Cd effects. Methods: Testis of normal rats and rats that\nhave received Cd or Cd+Zn in drinking water during 12 months did not show any\nmorphological change. Immunohistochemistry was used to identify BTB integrity,\nclaudin-1, ZO-1, N-Cadherin and {\\beta}-catenin were detected by\nimmunohistochemistry and IOD were measure. Results: No immunoexpression changes\nof claudin-1 and ZO-1 were observed. Cd + Zn group showed a significant\nincrease of IOD of N-Cadherin, and a significant decrease of {\\beta}-catenin\nand transferrin immunoexpression was observed. Conclusions: Ours findings\nshowed that the intake of low oral doses of cadmium chloride over a long time\nperiod of time did not cause morphological variation on rat testis. Neither\nalteration on BTB was found. Zinc chloride was able to strengthen TJ and AJ,\nand decrease transferrin.\n  Key words: Testis prostate, cadmium, zinc, TJ, AJ, immunohistochemistry\n", "versions": [{"version": "v1", "created": "Fri, 13 Jul 2012 18:16:33 GMT"}], "update_date": "2012-07-16", "authors_parsed": [["Redondo", "Andrea", ""], ["Romero", "Raquel", ""], ["Lorenzo", "Ana", ""], ["Sanz", "Noelia", ""], ["Durán", "Esther", ""], ["Oltra", "Beatriz", ""], ["Pozuelo", "José Manuel", ""], ["Santamaría", "Luis", ""], ["Arriazu", "Riánsares", ""]]}, {"id": "1207.3563", "submitter": "Joshua Chang", "authors": "Joshua C. Chang and K.C. Brennan and Dongdong He and Huaxiong Huang\n  and Robert M. Miura and Phillip L. Wilson and Jonathan J. Wylie", "title": "A mathematical model of the metabolic and perfusion effects on cortical\n  spreading depression", "comments": "17 pages including 9 figures, accepted by PLoS One", "journal-ref": "PLoS ONE 8(8) (2013)", "doi": "10.1371/journal.pone.0070469", "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cortical spreading depression (CSD) is a slow-moving ionic and metabolic\ndisturbance that propagates in cortical brain tissue. In addition to massive\ncellular depolarization, CSD also involves significant changes in perfusion and\nmetabolism -- aspects of CSD that had not been modeled and are important to\ntraumatic brain injury, subarachnoid hemorrhage, stroke, and migraine.\n  In this study, we develop a mathematical model for CSD where we focus on\nmodeling the features essential to understanding the implications of\nneurovascular coupling during CSD. In our model, the sodium-potassium--ATPase,\nmainly responsible for ionic homeostasis and active during CSD, operates at a\nrate that is dependent on the supply of oxygen. The supply of oxygen is\ndetermined by modeling blood flow through a lumped vascular tree with an\neffective local vessel radius that is controlled by the extracellular potassium\nconcentration. We show that during CSD, the metabolic demands of the cortex\nexceed the physiological limits placed on oxygen delivery, regardless of\nvascular constriction or dilation. However, vasoconstriction and vasodilation\nplay important roles in the propagation of CSD and its recovery. Our model\nreplicates the qualitative and quantitative behavior of CSD --\nvasoconstriction, oxygen depletion, extracellular potassium elevation,\nprolonged depolarization -- found in experimental studies.\n  We predict faster, longer duration CSD in vivo than in vitro due to the\ncontribution of the vasculature. Our results also help explain some of the\nvariability of CSD between species and even within the same animal. These\nresults have clinical and translational implications, as they allow for more\nprecise in vitro, in vivo, and in silico exploration of a phenomenon broadly\nrelevant to neurological disease.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2012 02:28:23 GMT"}, {"version": "v2", "created": "Sat, 15 Jun 2013 21:15:12 GMT"}], "update_date": "2020-06-05", "authors_parsed": [["Chang", "Joshua C.", ""], ["Brennan", "K. C.", ""], ["He", "Dongdong", ""], ["Huang", "Huaxiong", ""], ["Miura", "Robert M.", ""], ["Wilson", "Phillip L.", ""], ["Wylie", "Jonathan J.", ""]]}, {"id": "1207.3624", "submitter": "Eric  Werner", "authors": "Eric Werner", "title": "How to Grow an Organism Inside-Out: Evolution of an internal skeleton\n  from an external skeleton in bilateral organisms", "comments": "9 pages. Key Words: Metazoan evolution, inside-out growth, inside-out\n  development, internal skeleton, external skeleton, exoskeleton, bilateral\n  symmetry, developmental control networks, embryo genesis, cell orientation,\n  Cambrian Explosion", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An intriguing unanswered question about the evolution of bilateral animals\nwith internal skeletons is how an internal skeleton evolved in the first place.\nComputational modeling of the development of bilateral symmetric organisms\nsuggests an answer to this question. Our hypothesis is that an internal\nskeleton may have evolved from a bilaterally symmetric ancestor with an\nexternal skeleton. By growing the organism inside-out an external skeleton\nbecomes an internal skeleton. Our hypothesis is supported by a computational\ntheory of bilateral symmetry that allows us to model and simulate this process.\nInside-out development is achieved by an orientation switch. Given the\ndevelopment of two bilateral founder cells that generate a bilateral organism,\na mutation that reverses the internal mirror orientation of those bilateral\nfounder cells leads to inside-out development. The new orientation is\nepigenetically inherited by all progeny. A key insight is that each cell\ncontained in the newly evolved organism with the internal skeleton develops\naccording to the very same downstream developmental control network that\ndirects the development of its exoskeletal ancestor. The networks and their\ngenomes are are identical, but the interpretation is different because of the\ncell's inverted orientation. The result is inside-out bilateral symmetric\ndevelopment generating an inside-out organism with an internal skeleton.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2012 10:52:15 GMT"}], "update_date": "2012-07-17", "authors_parsed": [["Werner", "Eric", ""]]}, {"id": "1207.4617", "submitter": "Ri\\'ansares Arriazu PhD", "authors": "Esther Dur\\'an, and Ri\\'ansares Arriazu", "title": "Immunoexpression of Nm23: correlation with traditional prognostic\n  markers in breast carcinoma", "comments": "9 pages, 5 tables, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fifty cases of breast carcinoma were investigated for Nm23, LPA1, Ki67 and\np53 antigen expression, using immunohistochemical techniques. Correlation\nbetween markers was studied. Nm23 showed an inverse correlation with LPA1 and\nKi67, and positive with p53. Nm23/LPA1presented significant (p<0.001) negative\ncorrelation with p53, but not difference were observed with Ki67. It can be\nconcluded that: 1) Nm23 and LPA1 tend to be inversely correlated; 2) Nm23\ncorrelates positively with p53, regardless of tumour type and patient's\nhormonal status; 3) Nm23 shows a reverse trend in comparison with Ki67.\nHowever, more studies are needed to determinate if hormone receptors play some\nrole in the inverse relationship between Nm23-LPA1 and to know the tumour type\nimplication in these relationships.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2012 11:32:06 GMT"}], "update_date": "2012-07-20", "authors_parsed": [["Durán", "Esther", ""], ["Arriazu", "Riánsares", ""]]}, {"id": "1207.5704", "submitter": "Andr\\'es Chavarr\\'ia-Krauser", "authors": "Juliane Claus, Ansgar Bohmann, Andr\\'es Chavarr\\'ia-Krauser", "title": "Zinc Uptake and Radial Transport in Roots of Arabidopsis thaliana: A\n  Modelling Approach to Understand Accumulation", "comments": "Main text, 9 figures and one Supplemental file. Submitted to Annals\n  of Botany", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Zinc uptake in roots is believed to be mediated by ZIP (ZRT-, IRT-like\nProteins) transporters. Once inside the symplast, zinc is transported to the\npericycle, where it exits by means of HMA (Heavy Metal ATPase) transporters.\nThe combination of symplastic transport and spatial separation of influx and\nefflux produces a pattern in which zinc accumulates in the pericycle. Here,\nmathematical modelling was employed to study the importance of ZIP regulation,\nHMA abundance and symplastic transport in creation of the radial pattern of\nzinc in primary roots of Arabidopsis thaliana.\n  A comprehensive one-dimensional dynamic model of radial zinc transport in\nroots was developed and used to conduct simulations. The model accounts for the\nstructure of the root consisting of symplast and apoplast and includes effects\nof water flow, diffusion, and cross-membrane transport via transporters. It\nalso incorporates the radial geometry and varying porosity of root tissues, as\nwell as regulation of ZIP transporters.\n  Steady state patterns were calculated for various zinc concentrations in the\nmedium, water influx and HMA abundance. The experimentally observed zinc\ngradient was reproduced very well. Increase of HMA or decrease in water influx\nled to loss of the gradient. The dynamic behaviour for a change in medium\nconcentration and water influx was also simulated showing short adaptation\ntimes in the range of seconds to minutes. Slowing down regulation led to\noscillations in expression levels, suggesting the need for rapid regulation and\nexistence of buffering agents.\n  The model captures the experimental findings very well and confirms the\nhypothesis that low abundance of HMA4 produces a radial gradient in zinc\nconcentration. Surprisingly, transpiration was found to be also a key\nparameter. The model suggests that ZIP regulation takes place on a comparable\ntime scale as symplastic transport.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2012 14:07:37 GMT"}, {"version": "v2", "created": "Wed, 24 Oct 2012 14:13:53 GMT"}], "update_date": "2012-10-25", "authors_parsed": [["Claus", "Juliane", ""], ["Bohmann", "Ansgar", ""], ["Chavarría-Krauser", "Andrés", ""]]}, {"id": "1207.5956", "submitter": "Pawel Domagala", "authors": "Violetta Sulzyc-Bielicka, Pawel Domagala, Jolanta Hybiak, Anna\n  Majewicz-Broda, Krzysztof Safranow, Wenancjusz Domagala", "title": "Colorectal cancers differ in respect of PARP-1 protein expression", "comments": null, "journal-ref": "Polish Journal of Pathology 2012; 2: 87-92", "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent findings raise the possibility of PARP inhibitor therapy in colorectal\ncancers(CRCs). However, the extent of PARP-1 protein expression in clinical\nspecimens of CRC is not known. Using immunohistochemistry we assessed PARP-1\nprotein expression in tissue microarrays of 151 CRCs and its association with\nthe patient's age, sex, Astler-Coller stage, grade and site of the tumor. High\nPARP nuclear immunoreactivity was found in 68.2% (103/151) of all cases. In\nturn, 31.8% (48/151)of tumors showed low PARP expression, including 9 (6%)\nPARP-1 negative CRCs. There was a significant association of PARP-1 expression\nwith the site of CRC and Astler-Coller stage. A high PARP expression was noted\nin 79.1% of colon vs. 53.9% of rectal tumors (p = 0.001). The mean PARP-1 score\nwas 1.27 times higher in colon vs. rectal cancers (p = 0.009) and it was higher\nin stage B2 vs. stage C of CRCs (p = 0.018). In conclusion, the level of PARP-1\nprotein nuclear expression is associated with the tumor site and heterogeneous\nacross clinical specimens of CRC, with the majority of CRCs expressing a high\nlevel but minority - low or no PARP-1 expression. These findings may have a\nclinical significance because the assessment of PARP-1 expression in tumor\nsamples may improve selection of patients with CRC for PARP inhibitor therapy.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2012 11:34:29 GMT"}], "update_date": "2012-07-26", "authors_parsed": [["Sulzyc-Bielicka", "Violetta", ""], ["Domagala", "Pawel", ""], ["Hybiak", "Jolanta", ""], ["Majewicz-Broda", "Anna", ""], ["Safranow", "Krzysztof", ""], ["Domagala", "Wenancjusz", ""]]}]