[{"id": "1302.0395", "submitter": "Vitaly Vodyanoy", "authors": "T. Moore, I. Sorokulova, O. Pustovyy, L. Globa, D. Pascoe, M. Rudisill\n  and Vitaly Vodyanoy", "title": "Microscopic and thermodynamic evaluation of vesicles shed by\n  erythrocytes at elevated temperatures", "comments": "18 pages, 7 figures, Submitted to the Journal of Thermal Biology on\n  January 25, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Erythrocytes and vesicles shed by erythrocytes from human and rat blood were\ncollected and analyzed after temperature was elevated by physical exercise or\nby exposure to external heat. The images of erythrocytes and vesicles were\nanalyzed by the light microscopy system with spatial resolution of better than\n90 nm. The samples were observed in an aqueous environment and required no\nfreezing, dehydration, staining, shadowing, marking or any other manipulation.\nTemperature elevation, whether passive or through exercise, resulted in\nsignificant concentration increase of structurally transformed erythrocytes\n(echinocytes) and vesicles in blood. At temperature of 37 oC, mean vesicle\nconcentrations and diameters in human and rat blood were (1.50+-0.35)x10^6 and\n(1.4+-0.2)x10^6 vesicles/{\\mu}L, and 0.365+-0.065 and 0.436+-0.03 {\\mu}m,\nrespectively. It was estimated that 80% of all vesicles found in human blood\nare smaller than 0.4 {\\mu}m. Thermodynamic analysis of experimental and\nliterature data showed that erythrocyte transformation, vesicle release and\nother associated processes are driven by entropy with enthalpy-entropy\ncompensation. It is suggested that physical state of hydrated cell membrane is\nresponsible for the compensation. The increase of vesicle number related to\nelevated temperatures may be indicative of the heat stress level and serve as\ndiagnostic of erythrocyte stability and human performance.\n", "versions": [{"version": "v1", "created": "Sat, 2 Feb 2013 15:58:44 GMT"}, {"version": "v2", "created": "Tue, 5 Feb 2013 16:13:31 GMT"}], "update_date": "2013-02-06", "authors_parsed": [["Moore", "T.", ""], ["Sorokulova", "I.", ""], ["Pustovyy", "O.", ""], ["Globa", "L.", ""], ["Pascoe", "D.", ""], ["Rudisill", "M.", ""], ["Vodyanoy", "Vitaly", ""]]}, {"id": "1302.1067", "submitter": "Francesco Costanzo", "authors": "Francesco Costanzo and James G. Brasseur", "title": "The Invalidity of the Laplace Law for Biological Vessels and of\n  Estimating Elastic Modulus from Total Stress vs. Strain: a New Practical\n  Method", "comments": "34 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The quantification of the stiffness of tubular biological structures is often\nobtained, both in vivo and in vitro, as the slope of total transmural hoop\nstress plotted against hoop strain. Total hoop stress is typically estimated\nusing the \"Laplace law.\" We show that this procedure is fundamentally flawed\nfor two reasons: Firstly, the Laplace law predicts total stress incorrectly for\nbiological vessels. Furthermore, because muscle and other biological tissue are\nclosely volume-preserving, quantifications of elastic modulus require the\nremoval of the contribution to total stress from incompressibility. We show\nthat this hydrostatic contribution to total stress has a strong\nmaterial-dependent nonlinear response to deformation that is difficult to\npredict or measure. To address this difficulty, we propose a new practical\nmethod to estimate a mechanically viable modulus of elasticity that can be\napplied both in vivo and in vitro using the same measurements as current\nmethods, with care taken to record the reference state. To be insensitive to\nincompressibility, our method is based on shear stress rather than hoop stress,\nand provides a true measure of the elastic response without application of the\nLaplace law. We demonstrate the accuracy of our method using a mathematical\nmodel of tube inflation with multiple constitutive models. We also re-analyze\nan in vivo study from the gastro-intestinal literature that applied the\nstandard approach and concluded that a drug-induced change in elastic modulus\ndepended on the protocol used to distend the esophageal lumen. Our new method\nremoves this protocol-dependent inconsistency in the previous result.\n", "versions": [{"version": "v1", "created": "Tue, 5 Feb 2013 15:44:53 GMT"}], "update_date": "2013-02-06", "authors_parsed": [["Costanzo", "Francesco", ""], ["Brasseur", "James G.", ""]]}, {"id": "1302.3022", "submitter": "Michel Destrade", "authors": "Aisling Ni Annaidh, Karine Bruyere, Michel Destrade, Michael D.\n  Gilchrist, Melanie Ottenio", "title": "Characterising the Anisotropic Mechanical Properties of Excised Human\n  Skin", "comments": "23 pages", "journal-ref": "Journal of the Mechanical Behavior of Biomedical Materials, 5\n  (2012) 139-148", "doi": "10.1016/j.jmbbm.2011.08.016", "report-no": null, "categories": "q-bio.TO cond-mat.soft physics.bio-ph physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mechanical properties of skin are important for a number of applications\nincluding surgery, dermatology, impact biomechanics and forensic science. In\nthis study we have investigated the influence of location and orientation on\nthe deformation characteristics of 56 samples of excised human skin. Uniaxial\ntensile tests were carried out at a strain rate of 0.012s$^{-1}$ on skin from\nthe back. Digital Image Correlation was used for 2D strain measurement and a\nhistological examination of the dermis was also performed. The mean ultimate\ntensile strength (UTS) was 21.6$\\pm$8.4MPa, the mean failure strain 54$\\pm$17%,\nthe mean initial slope 1.18$\\pm$0.88MPa, the mean elastic modulus\n83.3$\\pm$34.9MPa and the mean strain energy was 3.6$\\pm$1.6MJ/m$^3$. A\nmultivariate analysis of variance has shown that these mechanical properties of\nskin are dependent upon the orientation of Langer lines (P$<$0.0001-P=0.046).\nThe location of specimens on the back was also found to have a significant\neffect on the UTS (P =0.0002), the elastic modulus (P=0.001) and the strain\nenergy (P=0.0052). The histological investigation concluded that there is a\ndefinite correlation between the orientation of Langer Lines and the preferred\norientation of collagen fibres in the dermis (P$<$0.001). The data obtained in\nthis study will provide essential information for those wishing to model the\nskin using a structural constitutive model.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2013 09:06:42 GMT"}], "update_date": "2013-02-14", "authors_parsed": [["Annaidh", "Aisling Ni", ""], ["Bruyere", "Karine", ""], ["Destrade", "Michel", ""], ["Gilchrist", "Michael D.", ""], ["Ottenio", "Melanie", ""]]}, {"id": "1302.3267", "submitter": "Mathew Wedel", "authors": "Mathew John Wedel", "title": "Postcranial pneumaticity in dinosaurs and the origin of the avian lung", "comments": "PhD dissertation, University of California, Berkeley, Department of\n  Integrative Biology, May 2007, 303 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In birds, diverticula of the lungs and air sacs pneumatize specific regions\nof the postcranial skeleton. Relationships among pulmonary components and\nskeletal regions they pneumatize allow inferences about pulmonary anatomy in\nnon-avian dinosaurs. Fossae, foramina and chambers in the postcranial skeletons\nof pterosaurs and saurischian dinosaurs are diagnostic for pneumaticity. In\nbasal saurischians only the cervical skeleton is pneumatized, by cervical air\nsacs. In more derived saurischians pneumatization of posterior dorsal, sacral,\nand caudal vertebrae indicates abdominal air sacs. Abdominal air sacs in\nsauropods are also indicated by a pneumatic hiatus (a gap in vertebral\npneumatization) in Haplocanthosaurus. Minimally, saurischians had dorsally\nattached diverticular lungs plus anterior and posterior air sacs, and all the\npulmonary prerequisites for flow-through lung ventilation like that of birds.\nPneumaticity reduced skeletal mass in saurischians. I propose the Air Space\nProportion (ASP) as a measure of proportional volume of air in pneumatic bones.\nThe mean ASP of a sample of sauropod and theropod vertebrae is 0.61, so on\naverage, air occupied more than half the volume of these vertebrae. In\nDiplodocus, pneumatization lightened the living animal by 7-10 percent, and\nthat does not include extraskeletal diverticula, air sacs, lungs, or trachea.\nIf all these air reservoirs included, the specific gravity of Diplodocus is\n0.80, higher than published values for birds but lower than those for squamates\nand crocodilians. Pneumatization of cervical vertebrae facilitated evolution of\nlong necks in sauropods. Necks longer than nine meters evolved at least four\ntimes, in mamenchisaurs, diplodocids, brachiosaurids, and titanosaurs.\nIncreases in the number of cervical vertebrae, their proportional lengths, and\ntheir internal complexity occurred in parallel in most of these lineages.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2013 22:41:44 GMT"}], "update_date": "2013-02-15", "authors_parsed": [["Wedel", "Mathew John", ""]]}, {"id": "1302.3832", "submitter": "Silvio Ferreira", "authors": "Leticia R Paiva, Hallan S Silva, Silvio C Ferreira and Marcelo L\n  Martins", "title": "Multiscale model for the effects of adaptive immunity suppression on the\n  viral therapy of cancer", "comments": "14 pages, 4 figures", "journal-ref": null, "doi": "10.1088/1478-3975/10/2/025005", "report-no": null, "categories": "q-bio.TO physics.bio-ph q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Oncolytic virotherapy - the use of viruses that specifically kill tumor cells\n- is an innovative and highly promising route for treating cancer. However, its\ntherapeutic outcomes are mainly impaired by the host immune response to the\nviral infection. In the present work, we propose a multiscale mathematical\nmodel to study how the immune response interferes with the viral oncolytic\nactivity. The model assumes that cytotoxic T cells can induce apoptosis in\ninfected cancer cells and that free viruses can be inactivated by neutralizing\nantibodies or cleared at a constant rate by the innate immune response. Our\nsimulations suggest that reprogramming the immune microenvironment in tumors\ncould substantially enhance the oncolytic virotherapy in immune-competent\nhosts. Viable routes to such reprogramming are either in situ virus-mediated\nimpairing of CD$8^+$ T cells motility or blockade of B and T lymphocytes\nrecruitment. Our theoretical results can shed light on the design of viral\nvectors or new protocols with neat potential impacts on the clinical practice.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2013 18:20:51 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Paiva", "Leticia R", ""], ["Silva", "Hallan S", ""], ["Ferreira", "Silvio C", ""], ["Martins", "Marcelo L", ""]]}, {"id": "1302.3861", "submitter": "Matthew Cobley", "authors": "Matthew James Cobley", "title": "The Flexibility and Musculature of the Ostrich Neck: Implications for\n  the Feeding Ecology and Reconstruction of the Sauropoda\n  (Dinosauria:Saurischia)", "comments": "MSc Thesis, University of Bristol, UK, Department of Earth Science.\n  71 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Sauropoda were the largest terrestrial animals ever to have lived on this\nplanet. As their nutritional requirements were so huge, their diet holds sway\nover the ecology of many Mesozoic herbivores. The diet of the sauropods is\nlimited by their feeding envelope, which in turn is governed by the posture and\nflexibility of their elongate necks. Yet the exact nature of the flexibility\nand posture of the neck has been a contentious issue. Previous studies have\nutilised computer models of dry bone, mechanical principles or the flexibility\nof the necks of extant animals. However, the effect of the musculature of the\nneck has yet to be investigated. Through measurements of the flexibility of the\nostrich neck after cumulative tissue removal, analyses of the muscle attachment\nsites of the ostrich and sauropods, and testing of the Osteological Neutral\nPose model, this study attempts to rectify this situation. The ostrich neck was\nshown to have three sections of flexibility; a slightly flexible anterior\nsection, a very flexible middle section and a stiff posterior section. The\nOsteological Neutral Pose did not show these sections, and was shown to\npotentially overestimate and underestimate flexibility. It was also found that\nthe inter-vertebral space could account for varying estimates of flexibility,\nand that sauropods would have proportionally more muscle mass at the base of\nthe neck in relation to the ostrich. Ultimately, it was shown that the tissues\nof the neck place the limits of flexibility, and that zygapophyseal overlap\ndoes not indicate the flexibility of the neck. Should the Osteological Neutral\nPose affect sauropod flexibility estimates in the same manner as that of the\nostrich (a general overestimate), then the sauropods would have a more limited\nfeeding envelope than previously thought, allowing for greater niche\npartitioning between groups.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2013 20:08:13 GMT"}], "update_date": "2013-02-18", "authors_parsed": [["Cobley", "Matthew James", ""]]}, {"id": "1302.4175", "submitter": "Michel Destrade", "authors": "Badar Rashid, Michel Destrade, Michael Gilchrist", "title": "A High Rate Tension Device for Characterizing Brain Tissue", "comments": "10 pages", "journal-ref": "Journal of Sports Engineering and Technology, 226 (2012) 170-176", "doi": "10.1177/1754337112436900", "report-no": null, "categories": "physics.bio-ph physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mechanical characterization of brain tissue at high loading velocities is\nvital for understanding and modeling Traumatic Brain Injury (TBI). The most\nsevere form of TBI is diffuse axonal injury (DAI) which involves damage to\nindividual nerve cells (neurons). DAI in animals and humans occurs at strains >\n10% and strain rates > 10/s. The mechanical properties of brain tissues at\nthese strains and strain rates are of particular significance, as they can be\nused in finite element human head models to accurately predict brain injuries\nunder different impact conditions. Existing conventional tensile testing\nmachines can only achieve maximum loading velocities of 500 mm/min, whereas the\nKolsky bar apparatus is more suitable for strain rates > 100/s. In this study,\na custom-designed high rate tension device is developed and calibrated to\nestimate the mechanical properties of brain tissue in tension at strain rates <\n90/s, while maintaining a uniform velocity. The range of strain can also be\nextended to 100% depending on the thickness of a sample. The same apparatus can\nbe used to characterize the dynamic behavior of skin and other soft biological\ntissues by using appropriately sized load cells with a capacity of 10 N and\nabove.\n", "versions": [{"version": "v1", "created": "Mon, 18 Feb 2013 07:57:46 GMT"}], "update_date": "2013-02-19", "authors_parsed": [["Rashid", "Badar", ""], ["Destrade", "Michel", ""], ["Gilchrist", "Michael", ""]]}, {"id": "1302.4313", "submitter": "Nicholas Parker", "authors": "N J Watson, R K Johal, Y Reinwald, L J White, A M Ghaemmaghami, S P\n  Morgan, F R A J Rose, M J W Povey and N G Parker", "title": "Post-processing of polymer foam tissue scaffolds with high power\n  ultrasound: a route to increased pore interconnectivity, pore size and fluid\n  transport", "comments": "14 pages, 7 figures", "journal-ref": "Materials Science and Engineering C, Volume 33, Pages 4825-4832\n  (2013)", "doi": "10.1016/j.msec.2013.07.046", "report-no": null, "categories": "cond-mat.soft q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We expose thick polymer foam tissue scaffolds to high power ultrasound and\nstudy its effect on the openness of the pore architecture and fluid transport\nthrough the scaffold. Our analysis is supported by measurements of fluid uptake\nduring insonification and imaging of the scaffold microstructure via x-ray\ncomputed tomography, scanning electron microscopy and acoustic microscopy. The\nultrasonic treatment is found to increase the mean pore size by over 10%. More\nstriking is the improvement in fluid uptake: for scaffolds with only 40% water\nuptake via standard immersion techniques, we can routinely achieve full\nsaturation of the scaffold over approximately one hour of exposure. These\ndesirable modifications occur with no loss of scaffold integrity and negligible\nmass loss, and are optimized when the ultrasound treatment is coupled to a\npre-wetting stage with ethanol. Our findings suggest that high power ultrasound\nis a highly targetted and efficient means to promote pore interconnectivity and\nfluid transport in thick foam tissue scaffolds.\n", "versions": [{"version": "v1", "created": "Mon, 18 Feb 2013 15:29:03 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Watson", "N J", ""], ["Johal", "R K", ""], ["Reinwald", "Y", ""], ["White", "L J", ""], ["Ghaemmaghami", "A M", ""], ["Morgan", "S P", ""], ["Rose", "F R A J", ""], ["Povey", "M J W", ""], ["Parker", "N G", ""]]}, {"id": "1302.4535", "submitter": "Michel Destrade", "authors": "Badar Rashid, Michel Destrade, Michael Gilchrist", "title": "Mechanical Characterization of Brain Tissue in Compression at Dynamic\n  Strain Rates", "comments": "31 pages", "journal-ref": "Journal of the Mechanical Behavior of Biomedical Materials, 10\n  (2012) 23-38", "doi": "10.1016/j.jmbbm.2012.01.022", "report-no": null, "categories": "physics.bio-ph physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traumatic brain injury (TBI) occurs when local mechanical load exceeds\ncertain tolerance levels for brain tissue. Extensive research has been done\npreviously for brain matter experiencing compression at quasistatic loading;\nhowever, limited data is available to model TBI under dynamic impact\nconditions. In this research, an experimental setup was developed to perform\nunconfined compression tests and stress relaxation tests at strain rates <\n90/s. The brain tissue showed a stiffer response with increasing strain rates,\nshowing that hyperelastic models are not adequate. Specifically, the\ncompressive nominal stress at 30% strain was 8.83 +/- 1.94, 12.8 +/- 3.10 and\n16.0 +/- 1.41 kPa (mean +/- SD) at strain rates of 30, 60 and 90/s,\nrespectively. Relaxation tests were also conducted at 10%-50% strain with the\naverage rise time of 10 ms, which can be used to derive time dependent\nparameters. Numerical simulations were performed using one-term Ogden model\nwith initial shear modulus mu_0 = 6.06 +/- 1.44, 9.44 +/- 2.427 and 12.64 +/-\n1.227 kPa (mean +/- SD) at strain rates of 30, 60 and 90/s, respectively. A\nseparate set of bonded and lubricated tests were also performed under the same\ntest conditions to estimate the friction coefficient mu, by adopting combined\nexperimental - computational approach. The values of mu were 0.1 +/- 0.03 and\n0.15 +/- 0.07 (mean +/- SD) at 30 and 90/s strain rates, respectively,\nindicating that pure slip conditions cannot be achieved in unconfined\ncompression tests even under fully lubricated test conditions. The material\nparameters obtained in this study will help to develop biofidelic human brain\nfinite element models, which can subsequently be used to predict brain injuries\nunder impact conditions.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2013 07:59:46 GMT"}], "update_date": "2013-02-20", "authors_parsed": [["Rashid", "Badar", ""], ["Destrade", "Michel", ""], ["Gilchrist", "Michael", ""]]}, {"id": "1302.5142", "submitter": "Mike Taylor", "authors": "Michael P. Taylor", "title": "Aspects of the history, anatomy, taxonomy and palaeobiology of sauropod\n  dinosaurs", "comments": "Ph.D dissertation, University of Portsmouth, UK, 2009. Consists of\n  five chapters each subsequently published as journal articles or book\n  chapters. 285 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Although the sauropod dinosaurs have been recognised for more than a hundred\nand sixty years, much remains to be discovered and understood about their\nfunctional anatomy and palaeobiology. Older taxa require revision and new taxa\nawait description. The characteristic long necks of sauropods are mechanically\nperplexing and their evolution is obscure. All these issues are addressed\nherein.\n  The genus Brachiosaurus is represented by the American type species B.\naltithorax and the better known African species B. brancai. However,\nexamination of the overlapping material shows 26 differences between the\nspecies. B. brancai must be removed from Brachiosaurus and referred to the\ngenus Giraffatitan, which has been previously proposed for it.\n  Xenoposeidon proneneukos is a new neosauropod from the Lower Cretaceous\nHastings Bed Group, known from a single partial dorsal vertebra. The excellent\npreservation of the Xenoposeidon holotype reveals six unique characters. The\ndistinctive morphology suggests that Xenoposeidon may represent a new sauropod\nfamily, extending sauropod disparity as well as bringing to four the number of\nsauropod families known from the Wealden.\n  A second new Early Cretaceous genus is also described, a titanosauriform from\nthe Ruby Ranch Member of the Cedar Mountain Formation, in Utah. This taxon is\nknown from at least two individuals, an adult and a juvenile, which together\nprovide vertebrae, ribs, a scapula, sternal plates and an ilium. The ilium is\nparticularly unusual, exhibiting five unique features.\n  The longest sauropod necks were five times as long as those of the next\nlongest terrestrial animals, and four separate lineages evolved necks exceeding\n10 m. Elongation was enabled by sheer size, vertebral pneumaticity and the\nrelative smallness of sauropod heads, despite aspects of cervical osteology\nthat are difficult to understand on mechanical first principles.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2013 23:12:21 GMT"}], "update_date": "2013-02-22", "authors_parsed": [["Taylor", "Michael P.", ""]]}]