[{"id": "1303.0040", "submitter": "Michel Destrade", "authors": "Badar Rashid, Michel Destrade, Michael Gilchrist", "title": "Temperature Effects on Brain Tissue in Compression", "comments": "arXiv admin note: text overlap with arXiv:1302.4535", "journal-ref": "Journal of the Mechanical Behavior of Biomedical Materials, 14\n  (2012) 113-118", "doi": "10.1016/j.jmbbm.2012.04.005", "report-no": null, "categories": "physics.med-ph physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extensive research has been carried out for at least 50 years to understand\nthe mechanical properties of brain tissue in order to understand the mechanisms\nof traumatic brain injury (TBI). The observed large variability in experimental\nresults may be due to the inhomogeneous nature of brain tissue and to the broad\nrange of test conditions. However, test temperature is also considered as one\nof the factors influencing the properties of brain tissue. In this research,\nthe mechanical properties of porcine brain have been investigated at 22C (room\ntemperature) and at 37C (body temperature) while maintaining a constant\npreservation temperature of approximately 4-5C. Unconfined compression tests\nwere performed at dynamic strain rates of 30 and 50/s using a custom made test\napparatus. There was no significant difference (p = 0.8559 - 0.9290) between\nthe average engineering stresses of the brain tissue at the two different\ntemperature conditions. The results of this study should help to understand the\nbehavior of brain tissue at different temperature conditions, particularly in\nunconfined compression tests.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2013 23:13:26 GMT"}], "update_date": "2013-03-04", "authors_parsed": [["Rashid", "Badar", ""], ["Destrade", "Michel", ""], ["Gilchrist", "Michael", ""]]}, {"id": "1303.2333", "submitter": "Bin Ao", "authors": "Zhitong Bing, Bin Ao, Yanan Zhang, Fengling Wang, Caiyong Ye, Jinpeng\n  He, Jintu Sun, Jie Xiong, Nan Ding, Xiao-fei Gao, Ji Qi, Sheng Zhang,\n  Guangming Zhou, Lei Yang", "title": "Warburg Effect due to Exposure to Different Types of Radiation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Cancer cells maintain a high level of aerobic glycolysis (the Warburg\neffect), which is associated with their rapid proliferation. Many studies have\nreported that the suppression of glycolysis and activation of oxidative\nphosphorylation can repress the growth of cancer cells through regulation of\nkey regulators. Whether Warburg effect of cancer cells could be switched by\nsome other environmental stimulus? Herein, we report an interesting phenomenon\nin which cells alternated between glycolysis and mitochondrial respiration\ndepending on the type of radiation they were exposed to. We observed enhanced\nglycolysis and mitochondrial respiration in HeLa cells exposed to 2-Gy X-ray\nand 2-Gy carbon ion radiation, respectively. This discovery may provide novel\ninsights for tumor therapy.\n", "versions": [{"version": "v1", "created": "Sun, 10 Mar 2013 15:47:57 GMT"}], "update_date": "2013-03-12", "authors_parsed": [["Bing", "Zhitong", ""], ["Ao", "Bin", ""], ["Zhang", "Yanan", ""], ["Wang", "Fengling", ""], ["Ye", "Caiyong", ""], ["He", "Jinpeng", ""], ["Sun", "Jintu", ""], ["Xiong", "Jie", ""], ["Ding", "Nan", ""], ["Gao", "Xiao-fei", ""], ["Qi", "Ji", ""], ["Zhang", "Sheng", ""], ["Zhou", "Guangming", ""], ["Yang", "Lei", ""]]}, {"id": "1303.2399", "submitter": "Ianis Matsoukas Ph.D", "authors": "Ianis G. Matsoukas, Andrea J. Massiah, Brian Thomas", "title": "Starch metabolism and antiflorigenic signals modulate the\n  juvenile-to-adult phase transition in Arabidopsis", "comments": null, "journal-ref": null, "doi": "10.1111/pce.12088", "report-no": null, "categories": "q-bio.BM q-bio.GN q-bio.MN q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The physiology and genetics underlying juvenility is poorly understood. Here\nwe exploit Arabidopsis as a system to understand the mechanisms that regulate\nfloral incompetence during juvenility. Using an experimental assay that allows\nthe length of juvenility to be estimated, and mutants impaired in different\npathways, we show that multiple inputs influence juvenility. Juvenile phase\nlengths of wild type (WT) accessions Col-0, Ler-0 and Ws-4 are shown to differ,\nwith Col-0 having the shortest and Ws-4 the longest length. Plants defective in\nsugar signalling [gin1-1, gin2-1, gin6 (abi4)] and floral repressor mutants\n[hst1, tfl1, tfl2 (lhp1)] showed shortened juvenile phase lengths, compared to\ntheir respective WTs. Mutants defective in starch anabolism (adg1-1, pgm1) and\ncatabolism (sex1, sex4, bam3) showed prolonged juvenile phase lengths compared\nto Col-0. Examination of diurnal metabolite changes in adg1-1 and sex1 mutants\nindicates that their altered juvenile phase length may be due to lack of starch\nturnover, which influences carbohydrate availability. In this article we\npropose a model in which a variety of signals including floral activators and\nrepressors modulate the juvenile-to-adult phase transition. The role of\ncarbohydrates may be in their capacity as nutrients, osmotic regulators,\nsignalling molecules and/ or through their interaction with phytohormonal\nnetworks.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2013 00:00:02 GMT"}], "update_date": "2013-03-12", "authors_parsed": [["Matsoukas", "Ianis G.", ""], ["Massiah", "Andrea J.", ""], ["Thomas", "Brian", ""]]}, {"id": "1303.2638", "submitter": "Kate Grieve", "authors": "Osnath Assayag, Kate Grieve, Bertrand Devaux, Fabrice Harms, Johan\n  Pallud, Fabrice Chretien, Claude Boccara, Pascale Varlet", "title": "Imaging of non tumorous and tumorous human brain tissue with full-field\n  optical coherence tomography", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.med-ph physics.optics q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A prospective study was performed on neurosurgical samples from 18 patients\nto evaluate the use of Full-Field Optical Coherence Tomography (FF-OCT) in\nbrain tumor diagnosis. FF-OCT captures en face slices of tissue samples at\n1\\mum resolution in 3D with a typical 200\\mum imaging depth. A 1cm2 specimen is\nscanned at a single depth and processed in about 5 minutes. This rapid imaging\nprocess is non-invasive and 30 requires neither contrast agent injection nor\ntissue preparation, which makes it particularly well suited to medical imaging\napplications. Temporal chronic epileptic parenchyma and brain tumors such as\nmeningiomas, low- grade and high-grade gliomas, and choroid plexus papilloma\nwere imaged. A subpopulation of neurons, myelin fibers and CNS vasculature were\nclearly identified. Cortex could be discriminated from white matter, but\nindividual glial cells as astrocytes (normal or reactive) or oligodendrocytes\nwere not observable. This study reports for the first time on the feasibility\nof using FF-OCT in a real-time manner as a label-free non-invasive imaging\ntechnique in an intra-operative neurosurgical clinical setting to assess\ntumorous glial and epileptic margins.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2013 19:41:37 GMT"}], "update_date": "2013-03-12", "authors_parsed": [["Assayag", "Osnath", ""], ["Grieve", "Kate", ""], ["Devaux", "Bertrand", ""], ["Harms", "Fabrice", ""], ["Pallud", "Johan", ""], ["Chretien", "Fabrice", ""], ["Boccara", "Claude", ""], ["Varlet", "Pascale", ""]]}, {"id": "1303.2935", "submitter": "Sergiy Popov", "authors": "Zoja Medjanik, Lyudmila Popova, Sergiy Popov", "title": "On Systemic Destruction of Human Locomotor System", "comments": "15 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Locomotor system disorders affect a vast majority of people at some time in\ntheir life bringing pain, functional limitations, social and economic\nimplications. Modern medicine cannot offer prevention and effective treatment\nfor most chronic musculoskeletal conditions, because their etiology and\npathogenesis are unknown. This is due to the lack of systemic understanding of\nthe locomotor system functioning in both healthy and unhealthy states. Here we\napply systems sciences to analyze the human locomotor system and develop a\ngeneral theory that reveals the systemic destructive process in the locomotor\nsystem, linking together all its disorders. The systemic destruction involves\nadaptation and self-organization processes in the locomotor system, whose side\neffects introduce a positive feedback loop with nervous and vascular\ndisturbances. Most chronic musculoskeletal conditions are just manifestations\nand consequences of this process. On the basis of our theoretical findings, we\ndeveloped the world's first technology that effectively counteracts the\nsystemic destruction and improves the locomotor system state at any age, also\npreventing problems in nervous and cardiovascular systems.\n", "versions": [{"version": "v1", "created": "Sun, 10 Mar 2013 15:05:51 GMT"}], "update_date": "2013-03-13", "authors_parsed": [["Medjanik", "Zoja", ""], ["Popova", "Lyudmila", ""], ["Popov", "Sergiy", ""]]}, {"id": "1303.3477", "submitter": "Danil Dobrynin", "authors": "Danil Dobrynin, Gregory Fridman, Gary Friedman and Alexander Fridman", "title": "Penetration Deep into Tissues of Reactive Oxygen Species Generated in\n  Floating-Electrode Dielectric Barrier Discharge (FE-DBD): in Vitro Agarose\n  Gel Model Mimicking an Open Wound", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph physics.plasm-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this manuscript we present an in vitro model based on agarose gel that can\nbe used to simulate a dirty, oily, bloody, and morphologically complex surface\nof, for example, an open wound. We show this models effectiveness in simulating\ndepth of penetration of reactive species generated in plasma deep into tissue\nof a rat and confirm the penetration depths with agarose gel model. We envision\nthat in the future such a model could be used to study plasma discharges (and\nother modalities) and minimize the use of live animals: plasma can be optimized\non the agarose gel wound model and then finally verified using an actual wound.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2013 15:29:16 GMT"}], "update_date": "2013-03-15", "authors_parsed": [["Dobrynin", "Danil", ""], ["Fridman", "Gregory", ""], ["Friedman", "Gary", ""], ["Fridman", "Alexander", ""]]}, {"id": "1303.4784", "submitter": "Matthew Wyczalkowski", "authors": "Matthew A. Wyczalkowski and Victor D. Varner and Larry A. Taber", "title": "Computational and Experimental Study of the Mechanics of Embryonic Wound\n  Healing", "comments": "32 pages, 13 figures", "journal-ref": null, "doi": "10.1016/j.bpj.2012.11.1764", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wounds in the embryo show a remarkable ability to heal quickly without\nleaving a scar. Previous studies have found that an actomyosin ring (\"purse\nstring\") forms around the wound perimeter and contracts to close the wound over\nthe course of several dozens of minutes. Here, we report experiments that\nreveal an even faster mechanism which remarkably closes wounds by more than 50%\nwithin the first 30 seconds. Circular and elliptical wounds (~100 um in size)\nwere made in the blastoderm of early chick embryos and allowed to heal, with\nwound area and shape characterized as functions of time. The closure rate\ndisplayed a biphasic behavior, with rapid constriction lasting about a minute,\nfollowed by a period of more gradual closure to complete healing. Fluorescent\nstaining suggests that both healing phases are driven by actomyosin\ncontraction, with relatively rapid contraction of fibers at cell borders within\na relatively thick ring of tissue (several cells wide) around the wound\nfollowed by slower contraction of a thin supracellular actomyosin ring along\nthe margin, consistent with a purse string mechanism. Finite-element modeling\nshowed that this idea is biophysically plausible, with relatively isotropic\ncontraction within the thick ring giving way to tangential contraction in the\nthin ring. In addition, consistent with experimental results, simulated\nelliptical wounds heal with little change in aspect ratio, and decreased\nmembrane tension can cause these wounds to open briefly before going on to\nheal. These results provide new insight into the healing mechanism in embryonic\nepithelia.\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2013 22:55:05 GMT"}, {"version": "v2", "created": "Wed, 4 Sep 2013 00:28:32 GMT"}, {"version": "v3", "created": "Fri, 6 Sep 2013 03:38:16 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Wyczalkowski", "Matthew A.", ""], ["Varner", "Victor D.", ""], ["Taber", "Larry A.", ""]]}]