[{"id": "1406.1446", "submitter": "Sebastien Benzekry", "authors": "S\\'ebastien Benzekry, Clare Lamont, Afshin Beheshti, Amanda Tracz,\n  John M.L. Ebos, Lynn Hlatky, Philip Hahnfeldt", "title": "Classical Mathematical Models for Description and Prediction of\n  Experimental Tumor Growth", "comments": "5 figures, 6 tables, 5 supplementary figures and 3 supplementary\n  tables", "journal-ref": "PLoS Comput Biol 10(8): e1003800 (2014)", "doi": "10.1371/journal.pcbi.1003800", "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite internal complexity, tumor growth kinetics follow relatively simple\nmacroscopic laws that have been quantified by mathematical models. To resolve\nthis further, quantitative and discriminant analyses were performed for the\npurpose of comparing alternative models for their abilities to describe and\npredict tumor growth. For this we used two in vivo experimental systems, an\nectopic syngeneic tumor (Lewis lung carcinoma) and an orthotopically\nxenografted human breast carcinoma. The goals were threefold: to 1) determine a\nstatistical model for description of the volume measurement error, 2) establish\nthe descriptive power of each model, using several goodness-of-fit metrics and\na study of parametric identifiability, and 3) assess the models ability to\nforecast future tumor growth.\n  Nine models were compared that included the exponential, power law, Gompertz\nand (generalized) logistic formalisms. The Gompertz and power law provided the\nmost parsimonious and parametrically identifiable description of the lung data,\nwhereas the breast data were best captured by the Gompertz and\nexponential-linear models. The latter also exhibited the highest predictive\npower for the breast tumor growth curves, with excellent prediction scores\n(greater than 80$\\%$) extending out as far as 12 days. In contrast, for the\nlung data, none of the models were able to achieve substantial prediction rates\n(greater than 70$\\%$) further than the next day data point. In this context,\nadjunction of a priori information on the parameter distribution led to\nconsiderable improvement of predictions.\n  These results not only have important implications for biological theories of\ntumor growth and the use of mathematical modeling in preclinical anti-cancer\ndrug investigations, but also may assist in defining how mathematical models\ncould serve as potential prognostic tools in the clinical setting.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2014 17:13:07 GMT"}, {"version": "v2", "created": "Thu, 10 Jul 2014 09:21:51 GMT"}], "update_date": "2014-09-02", "authors_parsed": [["Benzekry", "Sébastien", ""], ["Lamont", "Clare", ""], ["Beheshti", "Afshin", ""], ["Tracz", "Amanda", ""], ["Ebos", "John M. L.", ""], ["Hlatky", "Lynn", ""], ["Hahnfeldt", "Philip", ""]]}, {"id": "1406.1452", "submitter": "Sebastien Benzekry", "authors": "S\\'ebastien Benzekry, Alberto Gandolfi, Philip Hahnfeldt", "title": "Global Dormancy of Metastases Due to Systemic Inhibition of Angiogenesis", "comments": "5 figures, 2 tables", "journal-ref": "PLoS ONE 9(1): e84249", "doi": "10.1371/journal.pone.0084249", "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autopsy studies of adults dying of non-cancer causes have shown that\nvirtually all of us possess occult, cancerous lesions. This suggests that, for\nmost individuals, cancer will become dormant and not progress, while only in\nsome will it become symptomatic disease. Meanwhile, it was recently shown in\nanimal models that a tumor can produce both stimulators and inhibitors of its\nown blood supply. To explain the autopsy findings in light of the preclinical\nresearch data, we propose a mathematical model of cancer development at the\norganism scale describing a growing population of metastases, which, together\nwith the primary tumor, can exert a progressively greater level of systemic\nangiogenesis-inhibitory influence that eventually overcomes local angiogenesis\nstimulation to suppress the growth of all lesions. As a departure from modeling\nefforts to date, we look not just at signaling from and effects on the primary\ntumor, but integrate over this increasingly negative global signaling from all\nsources to track the development of total tumor burden. This in silico study of\nthe dynamics of the tumor/metastasis system identifies ranges of parameter\nvalues where mutual angio-inhibitory interactions within a population of tumor\nlesions could yield global dormancy, i.e., an organism-level homeostatic steady\nstate in total tumor burden. Given that mortality arises most often from\nmetastatic disease rather than growth of the primary per se, this finding may\nhave important therapeutic implications.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2014 17:28:27 GMT"}], "update_date": "2014-06-06", "authors_parsed": [["Benzekry", "Sébastien", ""], ["Gandolfi", "Alberto", ""], ["Hahnfeldt", "Philip", ""]]}, {"id": "1406.1701", "submitter": "Matthew Hubbard", "authors": "Nathan Kirk, Alan Benson, Christopher Goodyer, Matthew Hubbard", "title": "A computational study of the effects of remodelled electrophysiology and\n  mechanics on initiation of ventricular fibrillation in human heart failure", "comments": "20 pages, 8 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NA math.NA q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The study of pathological cardiac conditions such as arrhythmias, a major\ncause of mortality in heart failure, is becoming increasingly informed by\ncomputational simulation, numerically modelling the governing equations. This\ncan provide insight where experimental work is constrained by technical\nlimitations and/or ethical issues.\n  As the models become more realistic, the construction of efficient and\naccurate computational models becomes increasingly challenging. In particular,\nrecent developments have started to couple the electrophysiology models with\nmechanical models in order to investigate the effect of tissue deformation on\narrhythmogenesis, thus introducing an element of nonlinearity into the\nmathematical representation. This paper outlines a biophysically-detailed\ncomputational model of coupled electromechanical cardiac activity which uses\nthe finite element method to approximate both electrical and mechanical systems\non unstructured, deforming, meshes. An ILU preconditioner is applied to improve\nperformance of the solver.\n  This software is used to examine the role of electrophysiology, fibrosis and\nmechanical deformation on the stability of spiral wave dynamics in human\nventricular tissue by applying it to models of both healthy and failing tissue.\nThe latter was simulated by modifying (i) cellular electrophysiological\nproperties, to generate an increased action potential duration and altered\nintracellular calcium handling, and (ii) tissue-level properties, to simulate\nthe gap junction remodelling, fibrosis and increased tissue stiffness seen in\nheart failure. The resulting numerical experiments suggest that, for the chosen\nmathematical models of electrophysiology and mechanical response, introducing\ntissue level fibrosis can have a destabilising effect on the dynamics, while\nthe net effect of the electrophysiological remodelling stabilises the system.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jun 2014 15:10:04 GMT"}], "update_date": "2014-06-09", "authors_parsed": [["Kirk", "Nathan", ""], ["Benson", "Alan", ""], ["Goodyer", "Christopher", ""], ["Hubbard", "Matthew", ""]]}, {"id": "1406.2573", "submitter": "Dagmar Iber", "authors": "Britta Velten, Erkan Uenal and Dagmar Iber", "title": "Image-based Parameter Inference for Spatio-temporal models of\n  Organogenesis", "comments": "NOLTA 2014: 2014 Int'l Symposium on Nonlinear Theory & its\n  Applications, to be held in Luzern, Switzerland from September 14-18, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in imaging technology now provide us with detailed 3D data on gene\nexpression patterns in developing embryos. This information can be used to\nbuild predictive mathematical models of embryogenesis. Current modelling\napproaches are, however, limited by lack of methods to automatically infer the\nregulatory networks and the parameter values from the image-based information.\nHere we make a first step to the development of such methods. We use limb bud\ndevelopment as a model system. For a given regulatory network we developed a\ndecision tree based algorithm to automatically determine parameter values for\nwhich the model reproduces the expression patterns. Starting from this\nparameter set, local optimization was performed to further reduce the chosen\ngoodness-of-fit measure. This approach allowed us to recover the target\nexpression patterns, as judged by eye, and thus provides a first step towards\nthe automated inference of parameter values for a given regulatory network.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2014 14:55:19 GMT"}], "update_date": "2014-06-11", "authors_parsed": [["Velten", "Britta", ""], ["Uenal", "Erkan", ""], ["Iber", "Dagmar", ""]]}, {"id": "1406.4483", "submitter": "Yizhi Meng", "authors": "Junyi Wu, Gaojun Liu, Yi-Xian Qin, Yizhi Meng", "title": "Effect of low-intensity pulsed ultrasound on biocompatibility and\n  cellular uptake of chitosan-TPP nanoparticles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using low molecular weight chitosan nanoparticles (CNPs) prepared by an ionic\ngelation method, we report the effect of low-intensity pulsed ultrasound (US)\non cell viability and nanoparticle uptake in cultured murine pre-osteoblasts.\nParticle size and zeta potential are measured using Dynamic Light Scattering\n(DLS), and cell viability is evaluated using the MTS assay. Results show that\n30 min delivery of CNPs at 0.5 mg/mL is able to prevent loss of cell viability\ndue to either serum starvation or subsequent exposure to US (1 W/cm2 or 2\nW/cm2, up to 1 min). Additionally, flow cytometry data suggest that there is a\nclose association between cellular membrane integrity and the presence of CNPs\nwhen US at 2 W/cm2 is administered.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2014 19:12:58 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Wu", "Junyi", ""], ["Liu", "Gaojun", ""], ["Qin", "Yi-Xian", ""], ["Meng", "Yizhi", ""]]}, {"id": "1406.5234", "submitter": "Herculano Martinho", "authors": "Thiago Revers Dreyer, Adriano Felipe Perez Siqueira, Taciana Depra\n  Magrini, Marcilio Nichi, Mayra E. O. D. Assump\\c{c}\\~ao, Marcella Pecora\n  Milazzotto, Herculano da Silva Martinho", "title": "Low-level laser irradiation-induced changes in bovine spermatozoa", "comments": "21 pages, 2 figures, submitted to Journal of Biomedical Optics", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Some biochemical and metabolic characteristics of bovine sperm cells\nirradiated with low-level laser were probed and correlated to the irradiation\nparameters. Bovine spermatozoa were exposed to spatially filtered light from a\nHe-Ne laser (633 nm) with fluences from 150 to 600 mJ/cm2. General biochemical\nalterations were assessed by vibrational spectroscopy (micro-Fourier-Transform\nInfrared technique). The mitochondrial membrane potential was assessed by flow\ncytometry. Lipid peroxidation due to reactive oxygen species (ROS) production\nwas assessed by thiobarbituric acid reactive substances (TBARS) assay. Sperm\nmorphologic characteristics changes were probed by atomic force microscopy\n(AFM) technique. LLLI was able to induce, at different fluences, changes in\nlipid, DNA and protein contents. Moreover, LLLI also induced changes in TBARS\nproduction, suggesting an irradiation effect on lipid peroxidation. Acrosomal\nreaction induction evidences was found based on changes in protein structure\n(Amides I and II bands) and AFM characterization. The most interesting result,\nhowever, was the changes in methyl and DNA groups, which strongly suggests that\nLLLI can modify DNA methylation patterns, important for pregnancy\nestablishment. The observed changes in the above-cited parameters have direct\nimpact on sperm quality. The low-level laser irradiation has the potential to\nimprove the fertilizing capacity of bovine sperm cells.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2014 23:09:12 GMT"}], "update_date": "2014-06-23", "authors_parsed": [["Dreyer", "Thiago Revers", ""], ["Siqueira", "Adriano Felipe Perez", ""], ["Magrini", "Taciana Depra", ""], ["Nichi", "Marcilio", ""], ["Assumpção", "Mayra E. O. D.", ""], ["Milazzotto", "Marcella Pecora", ""], ["Martinho", "Herculano da Silva", ""]]}, {"id": "1406.6150", "submitter": "Saeed Ranjbar", "authors": "Saeed Ranjbar, Mersedeh Karvandi", "title": "Mathematical modeling applied to the left ventricle of heart", "comments": "15 pages, 6 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: How can mathematics help us to understand the mechanism of the\ncardiac motion? The best known approach is to take a mathematical model of the\nfibered structure, insert it into a more-or-less complex model of cardiac\narchitecture, and then study the resulting fibers of activation that propagate\nthrough the myocardium. In our paper, we have attempted to create a novel\nsoftware capable of demonstrate left ventricular (LV) model in normal hearts.\n  Method: Echocardiography was performed on 70 healthy volunteers. Data\nevaluated included: velocity (radial, longitudinal, rotational and vector\npoint), displacement (longitudinal and rotational), strain rate (longitudinal\nand circumferential) and strain (radial, longitudinal and circumferential) of\nall 16 LV myocardial segments. Using these data, force vectors of myocardial\nsamples were estimated by MATLAB software, interfaced in the echocardiograph\nsystem. Dynamic orientation contraction (through the cardiac cycle) of every\nindividual myocardial fiber could be created by adding together the sequential\nsteps of the multiple fragmented sectors of that fiber. This way we attempted\nto mechanically illustrate the global LV model.\n  Result: Our study shows that in normal cases myocardial fibers initiate from\nthe posterior basal region of the heart, continues through the LV free wall,\nreaches the septum, loops around the apex, ascends, and ends at the\nsuperior-anterior edge of LV.\n  Conclusion: We were able to define the whole LV myocardial model\nmathematically, by MATLAB software in normal subjects. This will enable\nphysicians to diagnose and follow up many cardiac diseases when this software\nis interfaced within echocardiographic machines.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2014 06:41:40 GMT"}], "update_date": "2014-06-25", "authors_parsed": [["Ranjbar", "Saeed", ""], ["Karvandi", "Mersedeh", ""]]}, {"id": "1406.6206", "submitter": "Anatolij Gelimson", "authors": "Anatolij Gelimson, Ramin Golestanian", "title": "Collective Dynamics of Dividing Chemotactic Cells", "comments": null, "journal-ref": "Phys. Rev. Lett. 114, 028101 (2015)", "doi": "10.1103/PhysRevLett.114.028101", "report-no": null, "categories": "q-bio.CB cond-mat.soft cond-mat.stat-mech q-bio.PE q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The large scale behaviour of a population of cells that grow and interact\nthrough the concentration field of the chemicals they secrete is studied using\ndynamical renormalization group methods. The combination of the effective\nlong-range chemotactic interaction and lack of number conservation leads to a\nrich variety of phase behaviour in the system, which includes a sharp\ntransition from a phase that has moderate (or controlled) growth and regulated\nchemical interactions to a phase with strong (or uncontrolled) growth and no\nchemical interactions. The transition point has nontrivial critical exponents.\nOur results might help shed light on the interplay between chemical signalling\nand growth in tissues and colonies, and in particular on the challenging\nproblem of cancer metastasis.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2014 11:26:14 GMT"}, {"version": "v2", "created": "Fri, 19 Dec 2014 12:25:04 GMT"}, {"version": "v3", "created": "Fri, 16 Jan 2015 11:20:29 GMT"}], "update_date": "2015-01-19", "authors_parsed": [["Gelimson", "Anatolij", ""], ["Golestanian", "Ramin", ""]]}, {"id": "1406.7257", "submitter": "Alexander S. Serov", "authors": "A.S. Serov, C. Salafia, M. Filoche, D.S. Grebenkov", "title": "Analytical theory of oxygen transfer in the human placenta", "comments": "Keywords: Diffusion-convection; Stream-tube placenta model; Optimal\n  villi density; Transport efficiency; Pathology diagnostics", "journal-ref": "J. Theor. Biol. 368 (2015), 133-44", "doi": "10.1016/j.jtbi.2014.12.016", "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an analytical approach to solving the diffusion-convection\nequations governing oxygen transport in the human placenta. We show that only\ntwo geometrical characteristics of a placental cross-section, villi density and\nthe effective villi radius, are needed to predict fetal oxygen uptake. We also\nidentify two combinations of physiological parameters that determine oxygen\nuptake in a given placenta: (i) the maximal oxygen inflow of a placentone if\nthere were no tissue blocking the flow, and (ii) the ratio of transit time of\nmaternal blood through the intervillous space to oxygen extraction time. We\nderive analytical formulas for fast and simple calculation of oxygen uptake and\nprovide two diagrams of efficiency of oxygen transport in an arbitrary\nplacental cross-section. We finally show that artificial perfusion experiments\nwith no-hemoglobin blood tend to give a two-orders-of-magnitude underestimation\nof the in vivo oxygen uptake and that the optimal geometry for such setup\nalters significantly. The theory allows one to adjust the results of artificial\nplacenta perfusion experiments to account for oxygen-hemoglobin dissociation.\nCombined with image analysis techniques, the presented model can give an\neasy-to-use tool for prediction of the human placenta efficiency.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2014 18:10:32 GMT"}, {"version": "v2", "created": "Fri, 17 Oct 2014 15:26:57 GMT"}, {"version": "v3", "created": "Wed, 4 Feb 2015 19:20:07 GMT"}], "update_date": "2015-02-05", "authors_parsed": [["Serov", "A. S.", ""], ["Salafia", "C.", ""], ["Filoche", "M.", ""], ["Grebenkov", "D. S.", ""]]}]