[{"id": "1501.00065", "submitter": "Alexandre Kabla", "authors": "Adrien Hallou, Joel Jennings and Alexandre Kabla", "title": "Cancer Metastasis: Collective Invasion in Heterogeneous Multicellular\n  Systems", "comments": "Supplementary information available online:\n  https://www.repository.cam.ac.uk/handle/1810/246529", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heterogeneity within tumour cell populations is associated with an increase\nin malignancy and appears to play an important role during cancer metastasis.\nUsing in silico experiments, we study the interplay between collective\nbehaviours and cell motility heterogeneities in a model system. Working with\ntumour spheroids that contain two non-proliferating cell populations of\ndifferent motile properties, we explore the conditions required for maximal\ninvasion into surrounding tissues. We show emerging spatial patterns of\ncellular organisation and invasion which are consistent with in vitro and in\nvivo observations. This demonstrates that mechanical interactions at the\ncellular level are sufficient to account for many of the observed morphologies\nof invasion and that heterogeneity in cell motility can be more important than\naverage mechanical properties in controlling the fate of large cell\npopulations.\n", "versions": [{"version": "v1", "created": "Wed, 31 Dec 2014 02:15:36 GMT"}], "update_date": "2015-01-05", "authors_parsed": [["Hallou", "Adrien", ""], ["Jennings", "Joel", ""], ["Kabla", "Alexandre", ""]]}, {"id": "1501.00421", "submitter": "Arianna Bianchi", "authors": "Arianna Bianchi, Kevin J. Painter, Jonathan A. Sherratt", "title": "A Mathematical Model for Lymphangiogenesis in Normal and Diabetic Wounds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several studies suggest that one possible cause of impaired wound healing is\nfailed or insufficient lymphangiogenesis, that is the formation of new\nlymphatic capillaries. Although many mathematical models have been developed to\ndescribe the formation of blood capillaries (angiogenesis) very few have been\nproposed for the regeneration of the lymphatic network. Moreover,\nlymphangiogenesis is markedly distinct from angiogenesis, occurring at\ndifferent times and in a different manner. Here a model of five ordinary\ndifferential equations is presented to describe the formation of lymphatic\ncapillaries following a skin wound. The variables represent different cell\ndensities and growth factor concentrations, and where possible the parameters\nare estimated from experimental and clinical data. The system is then solved\nnumerically and the results are compared with the available biological\nliterature. Finally, a parameter sensitivity analysis of the model is taken as\na starting point for suggesting new therapeutic approaches targeting the\nenhancement of lymphangiogenesis in diabetic wounds. The work provides a deeper\nunderstanding of the phenomenon in question, clarifying the main factors\ninvolved. In particular, the balance between TGF-$\\beta$ and VEGF levels,\nrather than their absolute values, is identified as crucial to effective\nlymphangiogenesis. In addition, the results indicate lowering the\nmacrophage-mediated activation of TGF-$\\beta$ and increasing the basal\nlymphatic endothelial cell growth rate, \\emph{inter alia}, as potential\ntreatments. It is hoped the findings of this paper may be considered in the\ndevelopment of future experiments investigating novel lymphangiogenic\ntherapies.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jan 2015 15:03:47 GMT"}], "update_date": "2015-01-05", "authors_parsed": [["Bianchi", "Arianna", ""], ["Painter", "Kevin J.", ""], ["Sherratt", "Jonathan A.", ""]]}, {"id": "1501.01338", "submitter": "Richard McMurtrey", "authors": "Richard J. McMurtrey", "title": "Patterned and Functionalized Nanofiber Scaffolds in Three-Dimensional\n  Hydrogel Constructs Enhance Neurite Outgrowth and Directional Control", "comments": null, "journal-ref": "J Neural Eng. 2014 Dec;11(6):066009", "doi": "10.1088/1741-2560/11/6/066009", "report-no": null, "categories": "q-bio.TO", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Neural tissue engineering holds incredible potential to restore functional\ncapabilities to damaged neural tissue. It was hypothesized that patterned and\nfunctionalized nanofiber scaffolds could control neurite direction and enhance\nneurite outgrowth. Aligned nanofibers were created according to a mathematical\nmodel and were shown to enable significant control over the direction of\nneurite outgrowth in both two-dimensional (2D) and three-dimensional (3D)\nneuronal cultures. Laminin-functionalized nanofibers in 3D hyaluronic acid (HA)\nhydrogels enabled significant alignment of neurites with nanofibers, enabled\nsignificant neurite tracking of nanofibers, and significantly increased the\ndistance over which neurites could extend. This work demonstrates the ability\nto create unique 3D neural tissue constructs using a combined system of\nhydrogel and nanofiber scaffolding. Importantly, patterned and\nbiofunctionalized nanofiber scaffolds that can control direction and increase\nlength of neurite outgrowth in three-dimensions hold much potential for neural\ntissue engineering. This approach offers advancements in the development of\nimplantable neural tissue constructs that enable control of neural development\nand reproduction of neuroanatomical pathways, with the ultimate goal being the\nachievement of functional neural regeneration.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jan 2015 00:16:22 GMT"}], "update_date": "2016-01-05", "authors_parsed": [["McMurtrey", "Richard J.", ""]]}, {"id": "1501.02010", "submitter": "Neelesh Patankar", "authors": "Wenjun Kou, Amneet Pal Singh Bhalla, Boyce E. Griffith, John E.\n  Pandolfino, Peter J. Kahrilas, Neelesh A. Patankar", "title": "A fully resolved active musculo-mechanical model for esophageal\n  transport", "comments": null, "journal-ref": "Journal of Computational Physics, Volume 298, 1 October 2015,\n  Pages 446-465", "doi": "10.1016/j.jcp.2015.05.049", "report-no": null, "categories": "physics.comp-ph cond-mat.soft q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Esophageal transport is a physiological process that mechanically transports\nan ingested food bolus from the pharynx to the stomach via the esophagus, a\nmulti-layered muscular tube. This process involves interactions between the\nbolus, the esophagus, and the neurally coordinated activation of the esophageal\nmuscles. In this work, we use an immersed boundary (IB) approach to simulate\nperistaltic transport in the esophagus. The bolus is treated as a viscous fluid\nthat is actively transported by the muscular esophagus, which is modeled as an\nactively contracting, fiber-reinforced tube. A simplified version of our model\nis verified by comparison to an analytic solution to the tube dilation problem.\nThree different complex models of the multi-layered esophagus, which differ in\ntheir activation patterns and the layouts of the mucosal layers, are then\nextensively tested. To our knowledge, these simulations are the first of their\nkind to incorporate the bolus, the multi-layered esophagus tube, and muscle\nactivation into an integrated model. Consistent with experimental observations,\nour simulations capture the pressure peak generated by the muscle activation\npulse that travels along the bolus tail. These fully resolved simulations\nprovide new insights into roles of the mucosal layers during bolus transport.\nIn addition, the information on pressure and the kinematics of the esophageal\nwall due to the coordination of muscle activation is provided, which may help\nrelate clinical data from manometry and ultrasound images to the underlying\nesophageal motor function.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jan 2015 00:12:44 GMT"}], "update_date": "2015-08-21", "authors_parsed": [["Kou", "Wenjun", ""], ["Bhalla", "Amneet Pal Singh", ""], ["Griffith", "Boyce E.", ""], ["Pandolfino", "John E.", ""], ["Kahrilas", "Peter J.", ""], ["Patankar", "Neelesh A.", ""]]}, {"id": "1501.02232", "submitter": "Domingo Tarzia", "authors": "Juan C. Reginato, Jorge L. Blengino and Domingo A. Tarzia", "title": "Analysis of the nutrient uptake by roots in fixed volume of soil as\n  predicted by fixed boundary, moving boundary and architectural models", "comments": "33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work examines the relevance of the one-dimensional models used to study\nthe influx and the cumulative uptake of nutrient by roots. The physical models\nstudied are the fixed boundary model (Barber and Cushman 1981) and an improved\nversion of our moving boundary model (Reginato et al. 2000). A weight averaged\nexpression to compute influx on root surface and a generalized formula to\nestimate the cumulative nutrient uptake are used. The moving boundary model\nproblem is solved by the adaptive finite element method. For comparison of\nsimulations of influx and cumulative uptake versus observed results six set of\ndata extracted from literature are used. For ions without limitations of\navailability fixed and moving boundary models produces similar results with\nsmall errors. Instead, to low concentrations, the fixed boundary model over\npredicts while the moving boundary model always produces better results mainly\nfor K. For the P uptake the moving boundary model produces better results only\nwhen the concentrations are very low and their predictions are comparable to\nthe obtained by a 3D-architectural model. The obtained improvements would\nexplain any failures of previous models for ions of low availability.\nTherefore, our model could be a simpler alternative due to its low\ncomputational burden.\n", "versions": [{"version": "v1", "created": "Mon, 22 Dec 2014 18:28:33 GMT"}], "update_date": "2015-01-12", "authors_parsed": [["Reginato", "Juan C.", ""], ["Blengino", "Jorge L.", ""], ["Tarzia", "Domingo A.", ""]]}, {"id": "1501.02254", "submitter": "Ognjen Arandjelovi\\'c PhD", "authors": "Ognjen Arandjelovic", "title": "A note on the capability profile - localized increase in force\n  production and its effect on overall resistance training performance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article I resolve formally the apparent paradox that arises in the\ncontext of the computational model of resistance exercise introduced in my\nprevious work. Contrary to intuition, the model seems to allow for a localized\nincrease in force production to degrade the ultimate exercise performance. I\nshow this not to be the case.\n", "versions": [{"version": "v1", "created": "Sat, 29 Nov 2014 11:19:25 GMT"}], "update_date": "2015-01-12", "authors_parsed": [["Arandjelovic", "Ognjen", ""]]}, {"id": "1501.02287", "submitter": "Boyce Griffith", "authors": "Vittoria Flamini and Abe DeAnda and Boyce E. Griffith", "title": "Immersed boundary-finite element model of fluid-structure interaction in\n  the aortic root", "comments": null, "journal-ref": null, "doi": "10.1007/s00162-015-0374-5", "report-no": null, "categories": "cs.CE math.NA q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has long been recognized that aortic root elasticity helps to ensure\nefficient aortic valve closure, but our understanding of the functional\nimportance of the elasticity and geometry of the aortic root continues to\nevolve as increasingly detailed in vivo imaging data become available. Herein,\nwe describe fluid-structure interaction models of the aortic root, including\nthe aortic valve leaflets, the sinuses of Valsalva, the aortic annulus, and the\nsinotubular junction, that employ a version of Peskin's immersed boundary (IB)\nmethod with a finite element (FE) description of the structural elasticity. We\ndevelop both an idealized model of the root with three-fold symmetry of the\naortic sinuses and valve leaflets, and a more realistic model that accounts for\nthe differences in the sizes of the left, right, and noncoronary sinuses and\ncorresponding valve cusps. As in earlier work, we use fiber-based models of the\nvalve leaflets, but this study extends earlier IB models of the aortic root by\nemploying incompressible hyperelastic models of the mechanics of the sinuses\nand ascending aorta using a constitutive law fit to experimental data from\nhuman aortic root tissue. In vivo pressure loading is accounted for by a\nbackwards displacement method that determines the unloaded configurations of\nthe root models. Our models yield realistic cardiac output at physiological\npressures, with low transvalvular pressure differences during forward flow,\nminimal regurgitation during valve closure, and realistic pressure loads when\nthe valve is closed during diastole. Further, results from high-resolution\ncomputations demonstrate that IB models of the aortic valve are able to produce\nessentially grid-converged dynamics at practical grid spacings for the\nhigh-Reynolds number flows of the aortic root.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jan 2015 23:00:57 GMT"}], "update_date": "2016-01-27", "authors_parsed": [["Flamini", "Vittoria", ""], ["DeAnda", "Abe", ""], ["Griffith", "Boyce E.", ""]]}, {"id": "1501.02526", "submitter": "Joshua Chang", "authors": "Joshua C. Chang and Robert M. Miura", "title": "Regulatory inhibition of biological tissue mineralization by calcium\n  phosphate through post-nucleation shielding by Fetuin-A", "comments": "Reverted to previous edition. This is the accepted manuscript", "journal-ref": "J. Chem. Phys. 144, 154906 (2016)", "doi": "10.1063/1.4946002", "report-no": null, "categories": "cond-mat.soft math.AP physics.bio-ph physics.chem-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In vertebrates, insufficient availability of calcium and phosphate ions in\nextracellular fluids leads to loss of bone density and neuronal\nhyper-excitability. To counteract this problem, calcium ions are present at\nhigh concentrations throughout body fluids -- at concentrations exceeding the\nsaturation point. This condition leads to the opposite situation where unwanted\nmineral sedimentation may occur. Remarkably, ectopic or out-of-place\nsedimentation into soft tissues is rare, in spite of the thermodynamic driving\nfactors. This fortunate fact is due to the presence of auto-regulatory proteins\nthat are found in abundance in bodily fluids. Yet, many important inflammatory\ndisorders such as atherosclerosis and osteoarthritis are associated with this\nundesired calcification. Hence, it is important to gain an understanding of the\nregulatory process and the conditions under which it can go awry. In this\nmanuscript, we adapt mean-field classical nucleation theory to the case of\nsurface-shielding in order to study the regulation of sedimentation of calcium\nphosphate salts in biological tissues through the mechanism of post-nuclear\nshielding of nascent mineral particles by binding proteins. We develop a\nmathematical description of this phenomenon using a countable system of\nhyperbolic partial differential equations. A critical concentration of\nregulatory protein is identified as a function of the physical parameters that\ndescribe the system.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jan 2015 03:02:15 GMT"}, {"version": "v2", "created": "Fri, 16 Jan 2015 20:37:17 GMT"}, {"version": "v3", "created": "Thu, 29 Jan 2015 21:31:34 GMT"}, {"version": "v4", "created": "Sat, 19 Dec 2015 03:38:18 GMT"}, {"version": "v5", "created": "Sun, 13 Mar 2016 20:16:00 GMT"}, {"version": "v6", "created": "Mon, 23 May 2016 21:06:20 GMT"}], "update_date": "2016-05-25", "authors_parsed": [["Chang", "Joshua C.", ""], ["Miura", "Robert M.", ""]]}, {"id": "1501.04605", "submitter": "Lee Altenberg", "authors": "Lee Altenberg", "title": "Statistical Problems in a Paper on Variation In Cancer Risk Among\n  Tissues, and New Discoveries", "comments": "7 pages, 4 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tomasetti and Vogelstein (2015) collected data on 31 different tissue types\nand found a correlation of 0.8 between the logarithms of the incidence of\ncancer (LCI), and the estimated number of stem cell divisions in those tissues\n(LSCD). Some of their conclusions however are statistically erroneous. Their\nexcess risk score, \"ERS\" (log10 LCI x log10 LSCD), is non-monotonic under a\nchange of time units for the rates, which renders meaningless the results\nderived from it, including a cluster of 22 \"R-tumor\" types for which they\nconclude, \"primary prevention measures are not likely to be very effective\".\nFurther, r = 0.8 is consistent with the three orders of magnitude variation in\nother unmeasured factors, leaving room for the possibility of primary\nprevention if such factors can be intervened upon. Further exploration of the\ndata reveals additional findings: (1) that LCI grows at approximately the\nsquare root of LSCD, which may provide a clue to the biology; (2) among\ndifferent possible combinations of the primary data, the one maximizing the\ncorrelations with LCI is almost precisely the formula used by Tomasetti and\nVogelstein to estimate LSCD, giving support to stem cell divisions as an\nindependent factor in carcinogenesis, while not excluding other such factors.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jan 2015 20:00:11 GMT"}], "update_date": "2015-01-20", "authors_parsed": [["Altenberg", "Lee", ""]]}, {"id": "1501.04732", "submitter": "Aditya Hernowo", "authors": "Aditya Tri Hernowo and R. Haryo Yudono", "title": "Strabismic syndromes and syndromic strabismus - a brief review", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strabismus can be found in association with congenital heart diseases, for\nexamples, in velocardiofacial (DiGeorge) syndrome, Down syndrome, mild\ndysmorphic features, in CHARGE association, Turner syndrome, Ullrich-Turner\nsyndrome, cardiofaciocutaneous syndrome.1-4 Some types of strabismus is\nheritable (e.g. infantile esotropia syndrome), particularly the ones associated\nwith multisystem disorders, e.g. Moebius syndrome, Prader-Willi syndrome,\ncraniofacial dysostoses, and mitochondrial myopathies.5 Due to the complexities\nthat a case of strabismus may pertain to, it is worthwhile to get to know more\nabout the strabismic syndromes and syndromic strabismus. This brief review -as\nits name implied- does not attempt to cover every angle of the syndromic\nconditions, but offers a refreshment on our knowledge about more prevalent\nstrabismus-related syndromes.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jan 2015 08:27:20 GMT"}], "update_date": "2015-01-21", "authors_parsed": [["Hernowo", "Aditya Tri", ""], ["Yudono", "R. Haryo", ""]]}, {"id": "1501.05003", "submitter": "Sarthok Sircar", "authors": "S. Sircar and A. J. Roberts", "title": "Ion mediated crosslink driven mucous swelling kinetics", "comments": "18 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO cond-mat.soft physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an experimentally guided, multi-phasic, multi-species ionic gel\nmodel to compare and make qualitative predictions on the rheology of mucus of\nhealthy individuals (Wild Type) versus those infected with Cystic Fibrosis. The\nmixture theory consists of the mucus (polymer phase) and water (solvent phase)\nas well as several different ions: H+, Na+ and Ca++. The model is linearized to\nstudy the hydration of spherically symmetric mucus gels and calibrated against\nthe experimental data of mucus diffusivities. Near equilibrium, the linearized\nform of the equation describing the radial size of the gel, reduces to the\nwell-known expression used in the kinetic theory of swelling hydrogels.\nNumerical studies reveal that the Donnan potential is the dominating mechanism\ndriving the mucus swelling/deswelling transition. However, the altered swelling\nkinetics of the Cystic Fibrosis infected mucus is not merely governed by the\nhydroelectric composition of the swelling media, but also due to the altered\nmovement of electrolytes as well as due to the defective properties of the\nmucin polymer network.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jan 2015 22:17:37 GMT"}], "update_date": "2015-01-22", "authors_parsed": [["Sircar", "S.", ""], ["Roberts", "A. J.", ""]]}, {"id": "1501.05006", "submitter": "Sarthok Sircar", "authors": "S. Sircar and J.N. Majumdar", "title": "Chapter 9 TISSUE ENGINEERING", "comments": "Book chapter: 17 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tissue Engineering (TE) is an interdisciplinary field dealing with the\nprinciples of engineering and life sciences toward the development of\nbiological substitutes that restore, maintain, or improve tissue function or a\nwhole organ. Currently, TE is emerging as an invaluable field of study and is\none of the most promising fields for the next century. The ultimate goal is to\ndevelop powerful new therapies for biological substitutes - that will\nsuccessfully restore the structural and functional disorders of human and\nanimal system.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jan 2015 22:33:41 GMT"}], "update_date": "2015-01-22", "authors_parsed": [["Sircar", "S.", ""], ["Majumdar", "J. N.", ""]]}, {"id": "1501.05035", "submitter": "Cristian Tomasetti", "authors": "Cristian Tomasetti and Bert Vogelstein", "title": "Musings on the theory that variation in cancer risk among tissues can be\n  explained by the number of divisions of normal stem cells", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.GN q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This manuscript has been written to address questions related to our recent\npublication (Science 347:78-81, 2015). We appreciate the many reactions to this\npaper that have been communicated to us, either privately or publicly. The\nfollowing addresses several of the most important statistical and technical\nissues related to our analysis and conclusions. Our responses to non-technical\nquestions are available at\nhttp://www.hopkinsmedicine.org/news/media/releases/bad_luck_of_random_mutations_plays_predominant_role_in_cancer_study_shows\n", "versions": [{"version": "v1", "created": "Wed, 21 Jan 2015 02:15:43 GMT"}, {"version": "v2", "created": "Wed, 4 Feb 2015 14:34:41 GMT"}, {"version": "v3", "created": "Wed, 16 Dec 2015 04:04:07 GMT"}, {"version": "v4", "created": "Wed, 17 Feb 2016 14:05:09 GMT"}], "update_date": "2016-02-18", "authors_parsed": [["Tomasetti", "Cristian", ""], ["Vogelstein", "Bert", ""]]}, {"id": "1501.05391", "submitter": "Aditya Hernowo", "authors": "Aditya T. Hernowo, Doety Prins, Heidi A. Baseler, Tina Plank, Andre\n  Gouws, Johanna M.M. Hooymans, Antony B. Morland, Mark W. Greenlee and Frans\n  W. Cornelissen", "title": "Morphometric analyses of the visual pathways in macular degeneration", "comments": "appears in Cortex (2013)", "journal-ref": null, "doi": "10.1016/j.cortex.2013.01.003", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Introduction. Macular degeneration (MD) causes central visual field loss.\nWhen field defects occur in both eyes and overlap, parts of the visual pathways\nare no longer stimulated. Previous reports have shown that this affects the\ngrey matter of the primary visual cortex, but possible effects on the preceding\nvisual pathway structures have not been fully established. Method. In this\nmulticentre study, we used high-resolution anatomical magnetic resonance\nimaging and voxel-based morphometry to investigate the visual pathway\nstructures up to the primary visual cortex of patients with age-related macular\ndegeneration (AMD) and juvenile macular degeneration (JMD). Results. Compared\nto age-matched healthy controls, in patients with JMD we found volumetric\nreductions in the optic nerves, the chiasm, the lateral geniculate bodies, the\noptic radiations and the visual cortex. In patients with AMD we found\nvolumetric reductions in the lateral geniculate bodies, the optic radiations\nand the visual cortex. An unexpected finding was that AMD, but not JMD, was\nassociated with a reduction in frontal white matter volume. Conclusion. MD is\nassociated with degeneration of structures along the visual pathways. A\nreduction in frontal white matter volume only present in the AMD patients may\nconstitute a neural correlate of previously reported association between AMD\nand mild cognitive impairment.\n  Keywords: macular degeneration - visual pathway - visual field - voxel-based\nmorphometry\n", "versions": [{"version": "v1", "created": "Thu, 22 Jan 2015 04:34:45 GMT"}], "update_date": "2015-01-23", "authors_parsed": [["Hernowo", "Aditya T.", ""], ["Prins", "Doety", ""], ["Baseler", "Heidi A.", ""], ["Plank", "Tina", ""], ["Gouws", "Andre", ""], ["Hooymans", "Johanna M. M.", ""], ["Morland", "Antony B.", ""], ["Greenlee", "Mark W.", ""], ["Cornelissen", "Frans W.", ""]]}, {"id": "1501.07077", "submitter": "Michael Deem", "authors": "Shubham Tripathi and Michael W. Deem", "title": "Hierarchy in Gene Expression is Predictive for Adult Acute Myeloid\n  Leukemia", "comments": "18 pages, 5 figures, to appear in Physical Biology", "journal-ref": null, "doi": "10.1088/1478-3975/12/1/016016", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cancer progresses with a change in the structure of the gene network in\nnormal cells. We define a measure of organizational hierarchy in gene networks\nof affected cells in adult acute myeloid leukemia (AML) patients. With a\nretrospective cohort analysis based on the gene expression profiles of 116\nacute myeloid leukemia patients, we find that the likelihood of future cancer\nrelapse and the level of clinical risk are directly correlated with the level\nof organization in the cancer related gene network. We also explore the\nvariation of the level of organization in the gene network with cancer\nprogression. We find that this variation is non-monotonic, which implies the\nfitness landscape in the evolution of AML cancer cells is nontrivial. We\nfurther find that the hierarchy in gene expression at the time of diagnosis may\nbe a useful biomarker in AML prognosis.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jan 2015 12:06:22 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Tripathi", "Shubham", ""], ["Deem", "Michael W.", ""]]}]