[{"id": "1503.00399", "submitter": "Hamidreza Badri", "authors": "Hamidreza Badri and Yoichi Watanabe and Kevin Leder", "title": "Robust and probabilistic optimization of dose schedules in radiotherapy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the effects of parameter uncertainty on the optimal radiation\nschedule in the context of the linear-quadratic model. Our interest arises from\nthe observation that if inter-patient variations in OAR and tumor sensitivities\nto radiation or sparing factor of the OAR are not accounted for during\nradiation scheduling, the performance of the therapy may be strongly degraded\nor the OAR may receive a substantially larger dose than the maximum threshold.\nThis paper proposes two radiation scheduling concepts to incorporate\ninter-patient variability into the scheduling optimization problem. The first\napproach is a robust formulation that formulates the problem as a conservative\nmodel that optimizes the worst case dose scheduling that may occur. The second\nmethod is a probabilistic approach, where the model parameters are given by a\nset of random variables. This formulation insures that our constraints are\nsatisfied with a given probability, and that our objective function achieves a\ndesired level with a stated probability. We used a transformation to reduce the\nresulting optimization problem to two dimensions. We showed that the optimal\nsolution lies on the boundary of the feasible region and we used a branch and\nbound algorithm to find the global optimal solution. We observed that if the\nnumber of fractions in the optimal conventional schedule is the same as the\nrobust and stochastic solutions, it is preferable to administer equal or\nsmaller total dose. In addition if there exist more (fewer) treatment sessions\nin the probabilistic or robust solution compared to the conventional schedule,\na reduction in total dose squared (total dose) will be expected. Finally, we\nperformed numerical experiments in the setting of head-and-neck tumors to\nreveal the effect of parameter uncertainty on optimal schedules and to evaluate\nthe sensitivity of the model to the choice of key model parameters.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2015 03:10:16 GMT"}, {"version": "v2", "created": "Wed, 3 Jun 2015 21:33:11 GMT"}], "update_date": "2015-06-05", "authors_parsed": [["Badri", "Hamidreza", ""], ["Watanabe", "Yoichi", ""], ["Leder", "Kevin", ""]]}, {"id": "1503.01233", "submitter": "Chloe Lerebours", "authors": "C. Lerebours, P. R. Buenzli, S. Scheiner, P. Pivonka", "title": "A multiscale mechanobiological model of bone remodelling predicts\n  site-specific bone loss in the femur during osteoporosis and mechanical\n  disuse", "comments": "25 pages, 10 figures", "journal-ref": "Biomech. Model. Mechanobiol. (2016) 15:43-67", "doi": "10.1007/s10237-015-0705-x", "report-no": null, "categories": "q-bio.TO physics.bio-ph physics.med-ph q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a multiscale mechanobiological model of bone remodelling to\ninvestigate the site-specific evolution of bone volume fraction across the\nmidshaft of a femur. The model includes hormonal regulation and biochemical\ncoupling of bone cell populations, the influence of the microstructure on bone\nturnover rate, and mechanical adaptation of the tissue. Both microscopic and\ntissue-scale stress/strain states of the tissue are calculated from macroscopic\nloads by a combination of beam theory and micromechanical homogenisation.\n  This model is applied to simulate the spatio-temporal evolution of a human\nmidshaft femur scan subjected to two deregulating circumstances: (i)\nosteoporosis and (ii) mechanical disuse. Both simulated deregulations led to\nendocortical bone loss, cortical wall thinning and expansion of the medullary\ncavity, in accordance with experimental findings. Our model suggests that these\nobservations are attributable to a large extent to the influence of the\nmicrostructure on bone turnover rate. Mechanical adaptation is found to help\npreserve intracortical bone matrix near the periosteum. Moreover, it leads to\nnon-uniform cortical wall thickness due to the asymmetry of macroscopic loads\nintroduced by the bending moment. The effect of mechanical adaptation near the\nendosteum can be greatly affected by whether the mechanical stimulus includes\nstress concentration effects or not.\n", "versions": [{"version": "v1", "created": "Wed, 4 Mar 2015 06:14:04 GMT"}], "update_date": "2016-05-13", "authors_parsed": [["Lerebours", "C.", ""], ["Buenzli", "P. R.", ""], ["Scheiner", "S.", ""], ["Pivonka", "P.", ""]]}, {"id": "1503.02019", "submitter": "William J. Tyler", "authors": "Jerel K. Mueller, Wynn Legon, and William J. Tyler", "title": "Analysis of Transcranial Focused Ultrasound Beam Profile Sensitivity for\n  Neuromodulation of the Human Brain", "comments": "32 pages, 14 figures, and 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objective. While ultrasound is largely established for use in diagnostic\nimaging and heating therapies, its application for neuromodulation is\nrelatively new and not well understood. The objective of the present study was\nto investigate issues related to interactions between focused acoustic beams\nand brain tissues to better understand possible limitations of transcranial\nultrasound for neuromodulation. Approach. A computational model of transcranial\nfocused ultrasound was constructed and validated against bench top experimental\ndata. The models were then incrementally extended to address and investigate a\nnumber of issues related to the use of ultrasound for neuromodulation. These\nincluded the effect of variations in skull geometry and gyral anatomy, as well\nas the effect of transmission across multiple tissue and media layers, such as\nscalp, skull, CSF, and gray/white matter on ultrasound insertion behavior. In\naddition, a sensitivity analysis was run to characterize the influence of\nacoustic properties of intracranial tissues. Finally, the heating associated\nwith ultrasonic stimulation waveforms designed for neuromodulation was modeled.\nMain results. Depending on factors such as acoustic frequency, the insertion\nbehavior of a transcranial focused ultrasound beam is only subtly influenced by\nthe geometry and acoustic properties of the underlying tissues. Significance.\nThese issues are critical for the refinement of device design and the overall\nadvancement of ultrasound methods for noninvasive neuromodulation.\n", "versions": [{"version": "v1", "created": "Fri, 6 Mar 2015 17:11:44 GMT"}], "update_date": "2015-03-09", "authors_parsed": [["Mueller", "Jerel K.", ""], ["Legon", "Wynn", ""], ["Tyler", "William J.", ""]]}, {"id": "1503.03331", "submitter": "Jorge Blengino", "authors": "J.L. Blengino Albrieu, J.C. Reginato, D.A. Tarzia", "title": "Modeling water uptake by a root system growing in a fixed soil volume", "comments": "To Appear in Applied mathematical modelling 23 pages, 10 figures", "journal-ref": null, "doi": "10.1016/j.apm.2014.11.042", "report-no": null, "categories": "physics.bio-ph physics.comp-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The water uptake by roots of plants is examined for an ideal situation, with\nan approximation that resembles plants growing in pots, meaning that the total\nsoil volume is fixed. We propose a coupled water uptake-root growth model. A\none-dimensional model for water flux and water uptake by a root system growing\nuniformly distributed in the soil is presented, and the Van Genuchten model for\nthe transport of water in soil is used. The governing equations are represented\nby a moving boundary model for which the root length, as a function of time, is\nprescribed. The solution of the model is obtained by front-fixing and finite\nelement methods. Model predictions for water uptake by a same plant growing in\nloam, silt and clay soils are obtained and compared. A sensitivity analysis to\ndetermine relative effects on water uptake when system parameters are changed\nis also presented and shows that the model and numerical method proposed are\nmore sensitive to the root growth rate than to the rest of the parameters. This\nsensitivity decreases along time, reaching its maximum at thirty days. A\ncomparison of this model with a fixed boundary model with and without root\ngrowth is also made. The results show qualitative differences from the\nbeginning of the simulations, and quantitative differences after ten days of\nsimulations.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2015 13:52:47 GMT"}], "update_date": "2015-03-12", "authors_parsed": [["Albrieu", "J. L. Blengino", ""], ["Reginato", "J. C.", ""], ["Tarzia", "D. A.", ""]]}, {"id": "1503.03853", "submitter": "John Simeon Biggins Dr", "authors": "Tuomas Tallinen, Jun Young Chung, John S. Biggins, L. Mahadevan", "title": "Gyrification from constrained cortical expansion", "comments": null, "journal-ref": "Proceedings of the National Academy of Sciences 111.35 (2014):\n  12667-12672", "doi": "10.1073/pnas.1406015111", "report-no": null, "categories": "physics.bio-ph cond-mat.soft nlin.PS q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The exterior of the mammalian brain - the cerebral cortex - has a conserved\nlayered structure whose thickness varies little across species. However,\nselection pressures over evolutionary time scales have led to cortices that\nhave a large surface area to volume ratio in some organisms, with the result\nthat the brain is strongly convoluted into sulci and gyri. Here we show that\nthe gyrification can arise as a nonlinear consequence of a simple mechanical\ninstability driven by tangential expansion of the gray matter constrained by\nthe white matter. A physical mimic of the process using a layered swelling gel\ncaptures the essence of the mechanism, and numerical simulations of the brain\ntreated as a soft solid lead to the formation of cusped sulci and smooth gyri\nsimilar to those in the brain. The resulting gyrification patterns are a\nfunction of relative cortical expansion and relative thickness (compared with\nbrain size), and are consistent with observations of a wide range of brains,\nranging from smooth to highly convoluted. Furthermore, this dependence on two\nsimple geometric parameters that characterize the brain also allows us to\nqualitatively explain how variations in these parameters lead to anatomical\nanomalies in such situations as polymicrogyria, pachygyria, and lissencephalia.\n", "versions": [{"version": "v1", "created": "Thu, 12 Mar 2015 19:38:03 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Tallinen", "Tuomas", ""], ["Chung", "Jun Young", ""], ["Biggins", "John S.", ""], ["Mahadevan", "L.", ""]]}, {"id": "1503.04591", "submitter": "Stefania Scarsoglio", "authors": "Matteo Anselmino, Stefania Scarsoglio, Carlo Camporeale, Andrea\n  Saglietto, Fiorenzo Gaita, Luca Ridolfi", "title": "Rate Control Management of Atrial Fibrillation: May a Mathematical Model\n  Suggest an Ideal Heart Rate?", "comments": "9 pages", "journal-ref": "PLoS ONE 10(3): e0119868, 2015", "doi": "10.1371/journal.pone.0119868", "report-no": null, "categories": "physics.med-ph physics.flu-dyn q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background. Despite the routine prescription of rate control therapy for\natrial fibrillation (AF), clinical evidence demonstrating a heart rate target\nis lacking. Aim of the present study was to run a mathematical model simulating\nAF episodes with a different heart rate (HR) to predict hemodynamic parameters\nfor each situation.\n  Methods. The lumped model, representing the pumping heart together with\nsystemic and pulmonary circuits, was run to simulate AF with HR of 50, 70, 90,\n110 and 130 bpm, respectively.\n  Results. Left ventricular pressure increased by 56.7%, from 33.92+-37.56 mmHg\nto 53.15+-47.56 mmHg, and mean systemic arterial pressure increased by 27.4%,\nfrom 82.66+-14.04 mmHg to 105.29+-7.63 mmHg, at the 50 and 130 bpm simulations,\nrespectively. Stroke volume (from 77.45+-8.5 to 39.09+-8.08 mL), ejection\nfraction (from 61.1+-4.4 to 39.32+-5.42%) and stroke work (SW, from 0.88+-0.04\nto 0.58+-0.09 J) decreased by 49.5, 35.6 and 34.2%, at the 50 and 130 bpm\nsimulations, respectively. In addition, oxygen consumption indexes (rate\npressure product, RPP, tension time index per minute, TTI/min, and pressure\nvolume area per minute, PVA/min) increased from the 50 to the 130 bpm\nsimulation, respectively, by 185.7% (from 5598+-1939 to 15995+-3219 mmHg/min),\n55.5% (from 2094+-265 to 3257+-301 mmHg s/min) and 102.4% (from 57.99+-17.9 to\n117.37+-25.96 J/min). In fact, left ventricular efficiency (SW/PVA) decreased\nfrom 80.91+-2.91% at 50 bpm to 66.43+-3.72% at the 130 bpm HR simulation.\n  Conclusion. Awaiting compulsory direct clinical evidences, the present\nmathematical model suggests that lower HRs during permanent AF relates to\nimproved hemodynamic parameters, cardiac efficiency, and lower oxygen\nconsumption.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2015 10:17:15 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Anselmino", "Matteo", ""], ["Scarsoglio", "Stefania", ""], ["Camporeale", "Carlo", ""], ["Saglietto", "Andrea", ""], ["Gaita", "Fiorenzo", ""], ["Ridolfi", "Luca", ""]]}, {"id": "1503.04669", "submitter": "Andrea Tosin", "authors": "Michiel Bertsch, Bruno Franchi, Norina Marcello, Maria Carla Tesi,\n  Andrea Tosin", "title": "Alzheimer's disease: a mathematical model for onset and progression", "comments": "19 pages, 10 figures, Math. Med. Biol., 2016", "journal-ref": "Math. Med. Biol., 34(2):193-214, 2017", "doi": "10.1093/imammb/dqw003", "report-no": null, "categories": "physics.bio-ph math.DS physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a mathematical model for the onset and progression\nof Alzheimer's disease based on transport and diffusion equations. We regard\nbrain neurons as a continuous medium, and structure them by their degree of\nmalfunctioning. Two different mechanisms are assumed to be relevant for the\ntemporal evolution of the disease: i) diffusion and agglomeration of soluble\npolymers of amyloid, produced by damaged neurons; ii) neuron-to-neuron\nprion-like transmission. We model these two processes by a system of\nSmoluchowski equations for the amyloid concentration, coupled to a kinetic-type\ntransport equation for the distribution function of the degree of\nmalfunctioning of neurons. The second equation contains an integral term\ndescribing the random onset of the disease as a jump process localised in\nparticularly sensitive areas of the brain. Our numerical simulations are in\ngood qualitative agreement with clinical images of the disease distribution in\nthe brain which vary from early to advanced stages.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2015 14:29:03 GMT"}, {"version": "v2", "created": "Fri, 19 Feb 2016 09:32:53 GMT"}], "update_date": "2017-06-06", "authors_parsed": [["Bertsch", "Michiel", ""], ["Franchi", "Bruno", ""], ["Marcello", "Norina", ""], ["Tesi", "Maria Carla", ""], ["Tosin", "Andrea", ""]]}, {"id": "1503.06159", "submitter": "Roman Bauer", "authors": "Roman Bauer, Marcus Kaiser and Elizabeth Stoll", "title": "A Computational Model Incorporating Neural Stem Cell Dynamics Reproduces\n  Glioma Incidence across the Lifespan in the Human Population", "comments": null, "journal-ref": "Bauer, Roman, Marcus Kaiser, and Elizabeth Stoll. \"A Computational\n  Model Incorporating Neural Stem Cell Dynamics Reproduces Glioma Incidence\n  across the Lifespan in the Human Population.\" PloS one 9.11 (2014): e111219", "doi": "10.1371/journal.pone.0111219", "report-no": null, "categories": "q-bio.CB physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Glioma is the most common form of primary brain tumor. Demographically, the\nrisk of occurrence increases until old age. Here we present a novel\ncomputational model to reproduce the probability of glioma incidence across the\nlifespan. Previous mathematical models explaining glioma incidence are framed\nin a rather abstract way, and do not directly relate to empirical findings. To\ndecrease this gap between theory and experimental observations, we incorporate\nrecent data on cellular and molecular factors underlying gliomagenesis. Since\nevidence implicates the adult neural stem cell as the likely cell-of-origin of\nglioma, we have incorporated empirically-determined estimates of neural stem\ncell number, cell division rate, mutation rate and oncogenic potential into our\nmodel. We demonstrate that our model yields results which match actual\ndemographic data in the human population. In particular, this model accounts\nfor the observed peak incidence of glioma at approximately 80 years of age,\nwithout the need to assert differential susceptibility throughout the\npopulation. Overall, our model supports the hypothesis that glioma is caused by\nrandomly-occurring oncogenic mutations within the neural stem cell population.\nBased on this model, we assess the influence of the (experimentally indicated)\ndecrease in the number of neural stem cells and increase of cell division rate\nduring aging. Our model provides multiple testable predictions, and suggests\nthat different temporal sequences of oncogenic mutations can lead to\ntumorigenesis. Finally, we conclude that four or five oncogenic mutations are\nsufficient for the formation of glioma.\n", "versions": [{"version": "v1", "created": "Fri, 20 Mar 2015 17:04:07 GMT"}], "update_date": "2015-03-23", "authors_parsed": [["Bauer", "Roman", ""], ["Kaiser", "Marcus", ""], ["Stoll", "Elizabeth", ""]]}, {"id": "1503.06206", "submitter": "Gennady Mishuris", "authors": "A.A. Koroleva, S.V. Rogosin, G.S. Mishuris", "title": "Analysis of the unilateral contact problem for biphasic cartilage layers\n  with an elliptic contact zone and accounting for the tangential displacements", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A three-dimensional unilateral contact problem for articular cartilage layers\nattached to subchondral bones shaped as elliptic paraboloids is considered in\nthe framework of the biphasic cartilage model. The main novelty of the study is\nin accounting not only for the normal (vertical), but also for tangential\nvertical (horisontal) displacements of the contacting surfaces. Exact general\nrelationships have been established between the contact approach and some\nintegral characteristics of the contact pressure, including the contact force.\nAsymptotic representations for the contact pressure integral characteristics\nare obtained in terms of the contact approach and some integral characteristics\nof the contact zone. The main result is represented by the first-order\napproximation problem.\n", "versions": [{"version": "v1", "created": "Tue, 17 Mar 2015 14:12:09 GMT"}], "update_date": "2015-03-23", "authors_parsed": [["Koroleva", "A. A.", ""], ["Rogosin", "S. V.", ""], ["Mishuris", "G. S.", ""]]}, {"id": "1503.07116", "submitter": "Bartlomiej Waclaw Dr", "authors": "Bartlomiej Waclaw, Ivana Bozic, Meredith E. Pittman, Ralph H. Hruban,\n  Bert Vogelstein, Martin A. Nowak", "title": "Spatial model predicts dispersal and cell turnover cause reduced\n  intra-tumor heterogeneity", "comments": "37 pages, 14 figures", "journal-ref": null, "doi": "10.1038/nature14971", "report-no": null, "categories": "q-bio.PE q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most cancers in humans are large, measuring centimeters in diameter, composed\nof many billions of cells. An equivalent mass of normal cells would be highly\nheterogeneous as a result of the mutations that occur during each cell\ndivision. What is remarkable about cancers is their homogeneity - virtually\nevery neoplastic cell within a large cancer contains the same core set of\ngenetic alterations, with heterogeneity confined to mutations that have emerged\nafter the last clonal expansions. How such clones expand within the\nspatially-constrained three dimensional architecture of a tumor, and come to\ndominate a large, pre-existing lesion, has never been explained. We here\ndescribe a model for tumor evolution that shows how short-range migration and\ncell turnover can account for rapid cell mixing inside the tumor. With it, we\nshow that even a small selective advantage of a single cell within a large\ntumor allows the descendants of that cell to replace the precursor mass in a\nclinically relevant time frame. We also demonstrate that the same mechanisms\ncan be responsible for the rapid onset of resistance to chemotherapy. Our model\nnot only provides novel insights into spatial and temporal aspects of tumor\ngrowth but also suggests that targeting short range cellular migratory activity\ncould have dramatic effects on tumor growth rates.\n", "versions": [{"version": "v1", "created": "Tue, 24 Mar 2015 17:22:54 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Waclaw", "Bartlomiej", ""], ["Bozic", "Ivana", ""], ["Pittman", "Meredith E.", ""], ["Hruban", "Ralph H.", ""], ["Vogelstein", "Bert", ""], ["Nowak", "Martin A.", ""]]}, {"id": "1503.07163", "submitter": "Thomas Michelitsch", "authors": "Jicun Wang-Michelitsch, Thomas Michelitsch (DALEMBERT)", "title": "Aging as a process of accumulation of Misrepairs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We recently introduced Misrepair-accumulation theory as an interpretation on\naging mechanism. For better understanding this theory, we discuss here in more\ndetails the new concept of Misrepair and the concept of accumulation of\nMisrepairs. I. Aging takes place uniquely on the systems that have a\nwell-defined structure: an organization of its sub-structures. Aging of a\nnon-living system is a result of accumulation of injuries (damage) of its\nstructure. II. A generalized concept of Misrepair is important for reaching to\na unified understanding of aging changes. In the situation of a severe injury,\nincorrect repair is a repair essential for maintaining structural integrity for\nincreasing the surviving chance of an organism. With the same mechanism as that\nin \"Misrepair of DNA\" , the term of \"Misrepair\" can be used for describing all\nkinds of incorrect repairs on different types of living structures, including\nmolecules, cells and tissues. A new concept of Misrepair is therefore proposed\nand defined as incorrect reconstruction of an injured living structure.\nMisrepair mechanism is beneficial for the survival of an organism, and it is\nessential for the survival of a species. III. Alteration of structure made by\nMisrepair is irreversible; therefore Misrepairs accumulate and disorganize\ngradually a structure, which appears as aging of it. Accumulation of Misrepairs\ntakes place on molecular, cellular and tissue levels respectively: on tissue\nlevel, it appears as disorganization of cells and extracellular matrixes\n(ECMs); on cellular level, it appears as deformation of cytoskeleton and change\nof cell shape; and on DNA, it appears as accumulation of DNA mutations and\nalteration of DNA sequence. An essential change in aging of an organism is an\nirreversible change of the spatial relationship between cells/ECMs in a tissue.\nIn conclusion, aging of an organism is a result of accumulation of Misrepairs\non tissue level.\n", "versions": [{"version": "v1", "created": "Tue, 24 Mar 2015 19:14:57 GMT"}, {"version": "v2", "created": "Thu, 2 Jun 2016 15:52:33 GMT"}, {"version": "v3", "created": "Tue, 3 Jan 2017 15:46:08 GMT"}], "update_date": "2017-01-04", "authors_parsed": [["Wang-Michelitsch", "Jicun", "", "DALEMBERT"], ["Michelitsch", "Thomas", "", "DALEMBERT"]]}]