[{"id": "1509.02377", "submitter": "Myung-Hwan Jung", "authors": "Myung-Hwan Jung, Jeong Chan Park", "title": "ERK/p38 MAPK inhibition reduces radio-resistance to pulsed proton beam\n  in breast cancer stem cells cells", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent studies have identified highly tumorigenic cells with stem cell-like\ncharacteristics in human cancers, termed cancer stem cells (CSCs). CSCs are\nresistant to conventional radiotherapy and chemotherapy owing to their high DNA\nrepair ability and oncogene overexpression. However, the mechanisms regulating\nCSC radio-resistance, particularly proton beam resistance, remain unclear. We\nisolated CSCs from the breast cancer cell lines MCF-7 and MDA-MB-231, which\nexpressed the characteristic breast CSC membrane protein markers\nCD44+/CD24-/low, and irradiated the CSCs with pulsed proton beams. We confirmed\nthat CSCs are resistant to pulsed proton beams and showed that treatment with\np38 and ERK inhibitors reduced CSC radioresistance. Based on these results,\nBCSC radio-resistance can be reduced during proton beam therapy by co-treatment\nwith ERK1/2 or p38 inhibitors, representing a novel approach for breast cancer\ntherapy.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jul 2015 03:52:41 GMT"}], "update_date": "2015-09-09", "authors_parsed": [["Jung", "Myung-Hwan", ""], ["Park", "Jeong Chan", ""]]}, {"id": "1509.02824", "submitter": "Mitchell Newberry", "authors": "Mitchell G Newberry, Daniel B Ennis, Van M Savage", "title": "Testing Foundations of Biological Scaling Theory Using Automated\n  Measurements of Vascular Networks", "comments": null, "journal-ref": "PLoS Comput Biol 11(8): e1004455", "doi": "10.1371/journal.pcbi.1004455", "report-no": null, "categories": "q-bio.TO q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Scientists have long sought to understand how vascular networks supply blood\nand oxygen to cells throughout the body. Recent work focuses on principles that\nconstrain how vessel size changes through branching generations from the aorta\nto capillaries and uses scaling exponents to quantify these changes. Prominent\nscaling theories predict that combinations of these exponents explain how\nmetabolic, growth, and other biological rates vary with body size.\nNevertheless, direct measurements of individual vessel segments have been\nlimited because existing techniques for measuring vasculature are invasive,\ntime consuming, and technically difficult. We developed software that extracts\nthe length, radius, and connectivity of in vivo vessels from contrast-enhanced\n3D Magnetic Resonance Angiography. Using data from 20 human subjects, we\ncalculated scaling exponents by four methods--two derived from local properties\nof branching junctions and two from whole-network properties. Although these\nmethods are often used interchangeably in the literature, we do not find\ngeneral agreement between these methods, particularly for vessel lengths.\nMeasurements for length of vessels also diverge from theoretical values, but\nthose for radius show stronger agreement. Our results demonstrate that vascular\nnetwork models cannot ignore certain complexities of real vascular systems and\nindicate the need to discover new principles regarding vessel lengths.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 15:59:57 GMT"}], "update_date": "2015-09-10", "authors_parsed": [["Newberry", "Mitchell G", ""], ["Ennis", "Daniel B", ""], ["Savage", "Van M", ""]]}, {"id": "1509.03513", "submitter": "Yuri Shestopaloff", "authors": "Yuri K. Shestopaloff and Ivo F. Sbalzarini", "title": "A Method for Modeling Growth of Organs and Transplants Based on the\n  General Growth Law: Application to the Liver in Dogs and Humans", "comments": "13 pages, 6 figures", "journal-ref": "PLoS ONE 2014, 9(6): e99275", "doi": "10.1371/journal.pone.0099275", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding biological phenomena requires a systemic approach that\nincorporates different mechanisms acting on different spatial and temporal\nscales, since in organisms the workings of all components, such as organelles,\ncells, and organs interrelate. This inherent interdependency between diverse\nbiological mechanisms, both on the same and on different scales, provides the\nfunctioning of an organism capable of maintaining homeostasis and physiological\nstability through numerous feedback loops. Thus, developing models of organisms\nand their constituents should be done within the overall systemic context of\nthe studied phenomena. We introduce such a method for modeling growth and\nregeneration of livers at the organ scale, considering it a part of the overall\nmulti-scale biochemical and biophysical processes of an organism. Our method is\nbased on the earlier discovered general growth law, postulating that any\nbiological growth process comprises a uniquely defined distribution of\nnutritional resources between maintenance needs and biomass production. Based\non this law, we introduce a liver growth model that allows to accurately\npredicting the growth of liver transplants in dogs and liver grafts in humans.\nUsing this model, we find quantitative growth characteristics, such as the time\npoint when the transition period after surgery is over and the liver resumes\nnormal growth, rates at which hepatocytes are involved in proliferation, etc.\nWe then use the model to determine and quantify otherwise unobservable\nmetabolic properties of livers.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2015 00:44:32 GMT"}], "update_date": "2015-09-14", "authors_parsed": [["Shestopaloff", "Yuri K.", ""], ["Sbalzarini", "Ivo F.", ""]]}, {"id": "1509.03516", "submitter": "Yuri Shestopaloff", "authors": "Yuri K. Shestopaloff", "title": "Method for finding metabolic properties based on the general growth law.\n  Liver examples. A General framework for biological modeling", "comments": "20 pages, 6 figures, 4 tables", "journal-ref": "PLoS ONE, 2014, 9(6): e99836", "doi": "10.1371/journal.pone.0099836", "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a method for finding metabolic parameters of cells, organs and\nwhole organisms, which is based on the earlier discovered general growth law.\nBased on the obtained results and analysis of available biological models, we\npropose a general framework for modeling biological phenomena and discuss how\nit can be used in Virtual Liver Network project. The foundational idea of the\nstudy is that growth of cells, organs, systems and whole organisms, besides\nbiomolecular machinery, is influenced by biophysical mechanisms acting at\ndifferent scale levels. In particular, the general growth law uniquely defines\ndistribution of nutritional resources between maintenance needs and biomass\nsynthesis at each phase of growth and at each scale level. We exemplify the\napproach considering metabolic properties of growing human and dog livers and\nliver transplants. A procedure for verification of obtained results has been\nintroduced too. We found that two examined dogs have high metabolic rates\nconsuming about 0.62 and 1 gram of nutrients per cubic centimeter of liver per\nday, and verified this using the proposed verification procedure. We also\nevaluated consumption rate of nutrients in human livers, determining it to be\nabout 0.088 gram of nutrients per cubic centimeter of liver per day for males,\nand about 0.098 for females. This noticeable difference can be explained by\nevolutionary development, which required females to have greater liver\nprocessing capacity to support pregnancy. We also found how much nutrients go\nto biomass synthesis and maintenance at each phase of liver and liver\ntransplant growth. Obtained results demonstrate that the proposed approach can\nbe used for finding metabolic characteristics of cells, organs, and whole\norganisms, which can further serve as important inputs for many applications in\nbiology (protein expression), biotechnology (synthesis of substances), and\nmedicine.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2015 01:02:25 GMT"}], "update_date": "2015-09-14", "authors_parsed": [["Shestopaloff", "Yuri K.", ""]]}, {"id": "1509.05640", "submitter": "Giuseppe Tronci", "authors": "M. Tarik Arafat, Giuseppe Tronci, Jie Yin, David J. Wood, Stephen J.\n  Russell", "title": "Biomimetic wet-stable fibres via wet spinning and diacid-based\n  crosslinking of collagen triple helices", "comments": "35 pages, 14 figures, 1 table, 1 scheme (manuscript accepted in\n  \"Polymer\")", "journal-ref": null, "doi": "10.1016/j.polymer.2015.09.037", "report-no": null, "categories": "physics.bio-ph physics.chem-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the limitations of electrospun collagen as bone-like fibrous structure\nis the potential collagen triple helix denaturation in the fibre state and the\ncorresponding inadequate wet stability even after crosslinking. Here, we have\ndemonstrated the feasibility of accomplishing wet-stable fibres by wet spinning\nand diacid-based crosslinking of collagen triple helices, whereby fibre ability\nto act as bone-mimicking mineralisation system has also been explored. Circular\ndichroism (CD) demonstrated nearly complete triple helix retention in resulting\nwet-spun fibres, and the corresponding chemically crosslinked fibres\nsuccessfully preserved their fibrous morphology following 1-week incubation in\nphosphate buffer solution (PBS). The presented novel diacid-based crosslinking\nroute imparted superior tensile modulus and strength to the resulting fibres\nindicating that covalent functionalization of distant collagen molecules is\nunlikely to be accomplished by current state-of-the-art carbodiimide-based\ncrosslinking. To mimic the constituents of natural bone extra cellular matrix\n(ECM), the crosslinked fibres were coated with carbonated hydroxyapatite (CHA)\nthrough biomimetic precipitation, resulting in an attractive biomaterial for\nguided bone regeneration (GBR), e.g. in bony defects of the maxillofacial\nregion.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 14:26:22 GMT"}], "update_date": "2015-09-21", "authors_parsed": [["Arafat", "M. Tarik", ""], ["Tronci", "Giuseppe", ""], ["Yin", "Jie", ""], ["Wood", "David J.", ""], ["Russell", "Stephen J.", ""]]}, {"id": "1509.06346", "submitter": "Annelies Lejon", "authors": "Annelies Lejon, Bert Mortier and Giovanni Samaey", "title": "Variance-reduced simulation of stochastic agent-based models for tumor\n  growth", "comments": "20 pages, 9 figures,2 movies", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a hybrid PDE/Monte Carlo technique for the variance reduced\nsimulation of an agent-based multiscale model for tumor growth. The variance\nreduction is achieved by combining a simulation of the stochastic agent-based\nmodel on the microscopic scale with a deterministic solution of a simplified\n(coarse) partial differential equation (PDE) on the macroscopic scale as a\ncontrol variable. We show that this technique is able to significantly reduce\nthe variance with only the (limited) additional computational cost associated\nwith the deterministic solution of the coarse PDE. We illustrate the\nperformance with numerical experiments in different regimes, both in the\navascular and vascular stage of tumor growth.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 19:11:01 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2015 06:34:32 GMT"}, {"version": "v3", "created": "Wed, 14 Oct 2015 12:52:36 GMT"}], "update_date": "2015-10-15", "authors_parsed": [["Lejon", "Annelies", ""], ["Mortier", "Bert", ""], ["Samaey", "Giovanni", ""]]}, {"id": "1509.07786", "submitter": "Francis Beaudry", "authors": "Raphael Santamaria, Marie-Chantal Giroux, Pascal Vachon and Francis\n  Beaudry", "title": "CYP3A Mediated Ketamine Metabolism is Severely Impaired in Liver S9\n  Fractions from Aging Sprague Dawley Rats", "comments": "16 pages, 1 table, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ketamine is widely used in veterinary medicine and in medicine. Ketamine is\nmetabolized to its active metabolite norketamine principally by liver CYP3A.\nDrug metabolism alterations during aging have severe consequences particularly\nin anesthesiology and very few studies on older animals were conducted for\nketamine. The objective of the present study is to assess the influence of\naging on CYP3A metabolism of ketamine. Liver S9 fractions from 3, 6, 12 and 18\nmonth old male Sprague Dawley rats were prepared and Michaelis-Menten\nparameters were determined for primary metabolic pathways. The derived maximum\nenzyme velocity (i.e. Vmax) suggests a rapid saturation of the CYP3A enzyme\nactive sites in liver S9 fractions of 18-month old rats. Observed Vmax for\nLiver S9 fractions from 3, 6 and 12 month old male Sprague Dawley rats were\n2.39 (+-0.23), 2.61 (+-0.18), and 2.07 (+-0.07) respectively compared to 0.68\n(+-0.02) for Liver S9 fractions from 18 month old male Sprague Dawley rats.\nInterestingly, we observed a 6 to 7 fold change in the derived Km when\ncomparing Liver S9 fractions from 18 month old male Sprague Dawley rats with\nLiver S9 fractions from younger rats. Our results suggest that rat CYP3A enzyme\nundergoes conformational changes with age particularly in our geriatric group\n(e.g. 18 month rats) leading significant decrease in the rate of formation of\nnorketamine. Moreover, our results strongly suggest a severe impairment of\nCYP3A ketamine mediated metabolism.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2015 16:49:23 GMT"}, {"version": "v2", "created": "Mon, 13 Jun 2016 16:08:22 GMT"}], "update_date": "2016-06-14", "authors_parsed": [["Santamaria", "Raphael", ""], ["Giroux", "Marie-Chantal", ""], ["Vachon", "Pascal", ""], ["Beaudry", "Francis", ""]]}, {"id": "1509.08573", "submitter": "Claudio  Oliveira", "authors": "Cl\\'audio L. N. Oliveira, Asc\\^anio D. Ara\\'ujo, Jason H. T. Bates,\n  Jos\\'e S. Andrade Jr., B\\'ela Suki", "title": "Entropy Production and the Pressure-Volume Curve of the Lung", "comments": null, "journal-ref": null, "doi": "10.3389/fphys.2016.00073", "report-no": null, "categories": "physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate analytically the production of entropy during a breathing\ncycle in healthy and diseased lungs. First, we calculate entropy production in\nhealthy lungs by applying the laws of thermodynamics to the well-known\ntranspulmonary pressure-volume ($P-V$) curves of the lung under the assumption\nthat lung tissue behaves as an entropy spring-like rubber. The bulk modulus,\n$B$, of the lung is also derived from these calculations. Second, we extend\nthis approach to elastic recoil disorders of the lung such as occur in\npulmonary fibrosis and emphysema. These diseases are characterized by\nparticular alterations in the $P-V$ relationship. For example, in fibrotic\nlungs $B$ increases monotonically with disease progression, while in emphysema\nthe opposite occurs. These diseases can thus be mimicked simply by making\nappropriate adjustments to the parameters of the $P-V$ curve. Using Clausius's\nformalism, we show that entropy production, $\\Delta S$, is related to the\nhysteresis area, $\\Delta A$, enclosed by the $P-V$ curve during a breathing\ncycle, namely, $\\Delta S=\\Delta A/T$, where $T$ is the body temperature.\nAlthough $\\Delta A$ is highly dependent on the disease, such formula applies to\nhealthy as well as diseased lungs, regardless of the disease stage. Finally, we\nuse {\\it ansatzs} to predict analytically the entropy produced by the fibrotic\nand emphysematous lungs.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2015 02:58:59 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Oliveira", "Cláudio L. N.", ""], ["Araújo", "Ascânio D.", ""], ["Bates", "Jason H. T.", ""], ["Andrade", "José S.", "Jr."], ["Suki", "Béla", ""]]}, {"id": "1509.08834", "submitter": "Cindy Grimm", "authors": "Ly Phan and Sandra Rugonyi and Cindy Grimm", "title": "Visualization techniques for the developing chicken heart", "comments": "Longer version of conference paper published in 11th International\n  Symposium on Visual Computing (December 2015)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a geometric surface parameterization algorithm and several\nvisualization techniques adapted to the problem of understanding the 4D\nperistaltic-like motion of the outflow tract (OFT) in an embryonic chick heart.\nWe illustrated the techniques using data from hearts under normal conditions\n(four embryos), and hearts in which blood flow conditions are altered through\nOFT banding (four embryos). The overall goal is to create quantitative measures\nof the temporal heart-shape change both within a single subject and between\nmultiple subjects. These measures will help elucidate how altering hemodynamic\nconditions changes the shape and motion of the OFT walls, which in turn\ninfluence the stresses and strains on the developing heart, causing it to\ndevelop differently. We take advantage of the tubular shape and periodic motion\nof the OFT to produce successively lower dimensional visualizations of the\ncardiac motion (e.g. curvature, volume, and cross-section) over time, and\nquantifications of such visualizations.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2015 16:31:57 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Phan", "Ly", ""], ["Rugonyi", "Sandra", ""], ["Grimm", "Cindy", ""]]}, {"id": "1509.08921", "submitter": "Giuseppe Tronci", "authors": "Xiangchen Qiao, Stephen J. Russell, Xuebin Yang, Giuseppe Tronci and\n  David J. Wood", "title": "Compositional and in Vitro Evaluation of Nonwoven Type I\n  Collagen/Poly-dl-lactic Acid Scaffolds for Bone Regeneration", "comments": "20 pages, 7 figures, 1 table", "journal-ref": "Journal of Functional Biomaterials 2015, 6, 667-686", "doi": "10.3390/jfb6030667", "report-no": null, "categories": "physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Poly-dl-lactic acid (PDLLA) was blended with type I collagen to attempt to\novercome the instantaneous gelation of electrospun collagen scaffolds in\nbiological environments. Scaffolds based on blends of type I collagen and PDLLA\nwere investigated for material stability in cell culture conditions (37\n{\\deg}C; 5% CO2) in which post-electrospinning glutaraldehyde crosslinking was\nalso applied. The resulting wet-stable webs were cultured with bone marrow\nstromal cells (HBMSC) for five weeks. Scanning electron microscopy (SEM),\nconfocal laser scanning microscopy (CLSM), Fourier transform infra-red\nspectroscopy (FTIR) and biochemical assays were used to characterise the\nscaffolds and the consequent cell-scaffold constructs. To investigate any\nelectrospinning-induced denaturation of collagen, identical PDLLA/collagen and\nPDLLA/gelatine blends were electrospun and their potential to promote\nosteogenic differentiation investigated. PDLLA/collagen blends with w/w ratios\nof 40/60, 60/40 and 80/20 resulted in satisfactory wet stabilities in a humid\nenvironment, although chemical crosslinking was essential to ensure long term\nmaterial cell culture. Scaffolds of PDLLA/collagen at a 60:40 weight ratio\nprovided the greatest stability over a five-week culture period. The\nPDLLA/collagen scaffolds promoted greater cell proliferation and osteogenic\ndifferentiation compared to HMBSCs seeded on the corresponding PDLLA/gelatine\nscaffolds, suggesting that any electrospinning-induced collagen denaturation\ndid not affect material biofunctionality within 5 weeks in vitro.\n", "versions": [{"version": "v1", "created": "Sun, 6 Sep 2015 15:47:27 GMT"}], "update_date": "2015-10-01", "authors_parsed": [["Qiao", "Xiangchen", ""], ["Russell", "Stephen J.", ""], ["Yang", "Xuebin", ""], ["Tronci", "Giuseppe", ""], ["Wood", "David J.", ""]]}]