[{"id": "1510.00537", "submitter": "Tom Shearer", "authors": "Tom Shearer", "title": "A new strain energy function for the hyperelastic modelling of ligaments\n  and tendons based on fascicle microstructure", "comments": null, "journal-ref": "Journal of Biomechanics 48 (2015) 290-297", "doi": "10.1016/j.jbiomech.2014.11.031", "report-no": null, "categories": "q-bio.TO cond-mat.soft", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A new strain energy function for the hyperelastic modelling of ligaments and\ntendons based on the geometrical arrangement of their fibrils is derived. The\ndistribution of the crimp angles of the fibrils is used to determine the\nstress-strain response of a single fascicle, and this stress-strain response is\nused to determine the form of the strain energy function, the parameters of\nwhich can all potentially be directly measured via experiments - unlike those\nof commonly used strain energy functions such as the Holzapfel-Gasser-Ogden\n(HGO) model, whose parameters are phenomenological. We compare the new model\nwith the HGO model and show that the new model gives a better match to existing\nstress-strain data for human patellar tendon than the HGO model, with the\naverage relative error in matching this data when using the new model being\n0.053 (compared with 0.57 when using the HGO model), and the average absolute\nerror when using the new model being 0.12 MPa (compared with 0.31 MPa when\nusing the HGO model).\n", "versions": [{"version": "v1", "created": "Fri, 2 Oct 2015 09:20:52 GMT"}], "update_date": "2015-10-05", "authors_parsed": [["Shearer", "Tom", ""]]}, {"id": "1510.00576", "submitter": "Tobias Galla", "authors": "Julie Eatock, Yen Ting Lin, Eugene T. Y. Chang, Tobias Galla, Richard\n  H. Clayton", "title": "Assessing Measures of Atrial Fibrillation Clustering via Stochastic\n  Models of Episode Recurrence and Disease Progression", "comments": "4 pages, 4 figures, submitted to Computing in Cardiology 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Atrial fibrillation (AF) is a leading cause of morbidity and mortality. AF\nprevalence increases with age, which is attributed to pathophysiological\nchanges that aid AF initiation and perpetuation. Current state-of-the-art\nmodels are only capable of simulating short periods of atrial activity at high\nspatial resolution, whilst the majority of clinical recordings are based on\ninfrequent temporal datasets of limited spatial resolution. Being able to\nestimate disease progression informed by both modelling and clinical data would\nbe of significant interest. In addition an analysis of the temporal\ndistribution of recorded fibrillation episodes AF density can provide insights\ninto recurrence patterns. We present an initial analysis of the AF density\nmeasure using a simplified idealised stochastic model of a binary time series\nrepresenting AF episodes. The future aim of this work is to develop robust\nclinical measures of progression which will be tested on models that generate\nlong-term synthetic data. These measures would then be of clinical interest in\ndeciding treatment strategies.\n", "versions": [{"version": "v1", "created": "Fri, 2 Oct 2015 12:29:21 GMT"}], "update_date": "2015-10-05", "authors_parsed": [["Eatock", "Julie", ""], ["Lin", "Yen Ting", ""], ["Chang", "Eugene T. Y.", ""], ["Galla", "Tobias", ""], ["Clayton", "Richard H.", ""]]}, {"id": "1510.01403", "submitter": "Radostin Simitev", "authors": "Mark Christie, Manasi Nandi, Yanika Borg, Valentina Carapella, Gary\n  Mirams, Philip Aston, Saziye Bayram, Radostin D. Simitev, Jennifer Siggers\n  and Buddhapriya Chakrabarti", "title": "Mathematical Modelling of Heart Rate Changes in the Mouse", "comments": "This is a report that summarises the outcomes from the UK MMSG NC3R's\n  Study Group meeting in London, 15th-18th April 2013 in response to a problem\n  entitled `Modelling heart rate changes in the mouse as a series of delayed,\n  weakly coupled oscillators', presented by MC and MN", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The CVS is composed of numerous interacting and dynamically regulated\nphysiological subsystems which each generate measurable periodic components\nsuch that the CVS can itself be presented as a system of weakly coupled\noscillators. The interactions between these oscillators generate a chaotic\nblood pressure waveform signal, where periods of apparent rhythmicity are\npunctuated by asynchronous behaviour. It is this variability which seems to\ncharacterise the normal state. We used a standard experimental data set for the\npurposes of analysis and modelling. Arterial blood pressure waveform data was\ncollected from conscious mice instrumented with radiotelemetry devices over\n$24$ hours, at a $100$ Hz and $1$ kHz time base. During a $24$ hour period,\nthese mice display diurnal variation leading to changes in the cardiovascular\nwaveform. We undertook preliminary analysis of our data using Fourier\ntransforms and subsequently applied a series of both linear and nonlinear\nmathematical approaches in parallel. We provide a minimalistic linear and\nnonlinear coupled oscillator model and employed spectral and Hilbert analysis\nas well as a phase plane analysis. This provides a route to a three way\nsynergistic investigation of the original blood pressure data by a combination\nof physiological experiments, data analysis viz. Fourier and Hilbert transforms\nand attractor reconstructions, and numerical solutions of linear and nonlinear\ncoupled oscillator models. We believe that a minimal model of coupled\noscillator models that quantitatively describes the complex physiological data\ncould be developed via such a method. Further investigations of each of these\ntechniques will be explored in separate publications.\n", "versions": [{"version": "v1", "created": "Tue, 6 Oct 2015 00:28:13 GMT"}], "update_date": "2015-10-07", "authors_parsed": [["Christie", "Mark", ""], ["Nandi", "Manasi", ""], ["Borg", "Yanika", ""], ["Carapella", "Valentina", ""], ["Mirams", "Gary", ""], ["Aston", "Philip", ""], ["Bayram", "Saziye", ""], ["Simitev", "Radostin D.", ""], ["Siggers", "Jennifer", ""], ["Chakrabarti", "Buddhapriya", ""]]}, {"id": "1510.01888", "submitter": "Steven Watterson", "authors": "Andrew Parton, Victoria McGilligan, Maurice OKane, Francina R Baldrick\n  and Steven Watterson", "title": "Computational Modelling of Atherosclerosis", "comments": "in Briefings in Bioinformatics (2015)", "journal-ref": null, "doi": "10.1093/bib/bbv081", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Atherosclerosis is one of the principle pathologies of cardiovascular disease\nwith blood cholesterol a significant risk factor. The World Health Organisation\nestimates that approximately 2.5 million deaths occur annually due to the risk\nfrom elevated cholesterol with 39% of adults worldwide at future risk.\nAtherosclerosis emerges from the combination of many dynamical factors,\nincluding haemodynamics, endothelial damage, innate immunity and sterol\nbiochemistry. Despite its significance to public health, the dynamics that\ndrive atherosclerosis remain poorly understood. As a disease that depends on\nmultiple factors operating on different length scales, the natural framework to\napply to atherosclerosis is mathematical and computational modelling. A\ncomputational model provides an integrated description of the disease and\nserves as an in silico experimental system from which we can learn about the\ndisease and develop therapeutic hypotheses. Although the work completed in this\narea to-date has been limited, there are clear signs that interest is growing\nand that a nascent field is establishing itself. This paper discusses the\ncurrent state of modelling in this area, bringing together many recent results\nfor the first time. We review the work that has been done, discuss its scope\nand highlight the gaps in our understanding that could yield future\nopportunities.\n", "versions": [{"version": "v1", "created": "Wed, 7 Oct 2015 10:55:22 GMT"}], "update_date": "2015-10-08", "authors_parsed": [["Parton", "Andrew", ""], ["McGilligan", "Victoria", ""], ["OKane", "Maurice", ""], ["Baldrick", "Francina R", ""], ["Watterson", "Steven", ""]]}, {"id": "1510.02323", "submitter": "Arianna Bianchi", "authors": "Arianna Bianchi, Konstantinos Syrigos, Georgios Lolas", "title": "Tumor-induced neoneurogenesis and perineural tumor growth: a\n  mathematical approach", "comments": "37 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Primary tumors infrequently lead to demise of cancer patients; instead,\nmortality and a significant degree of morbidity result from the growth of\nsecondary tumors in distant organs (metastasis). It is well-known that\nmalignant tumors induce the formation of a lymphatic and a blood vascular\nnetwork around themselves. A similar but far less studied process occurs in\nrelation to the nervous system and is referred to as \\emph{neoneurogenesis}; in\nfact, recent studies have demonstrated that tumors initiate their own\ninnervation. However, the relationship between tumor progression and the\nnervous system is still poorly understood. This process is most likely\nregulated by a multitude of factors in the tumor-nerve microenvironment and it\nis therefore important to study the interactions between the nervous system and\ntumor cells through mathematical/computational modelling: this may reveal the\nmost significant factors of the plethora of interacting elements regulating\nneoneurogenesis. The present work is a first attempt to model the\nneurobiological aspect of cancer development through a (simple) system of\ndifferential equations. The model confirms the experimental observations that a\ntumor is able to promote nerve formation/elongation around itself, and that\nhigh levels of nerve growth factor (NGF) and axon guidance molecules (AGMs) are\nrecorded in the presence of a tumor. Our results also reflect the observation\nthat high stress levels (represented by higher norepinephrine release by\nsympathetic nerves) contribute to tumor development and spread, indicating a\nmutually beneficial relationship between tumor cells and neurons. The model\npredictions suggest novel therapeutic strategies, aimed at blocking the stress\neffects on tumor growth and dissemination.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jul 2015 08:57:24 GMT"}], "update_date": "2015-10-09", "authors_parsed": [["Bianchi", "Arianna", ""], ["Syrigos", "Konstantinos", ""], ["Lolas", "Georgios", ""]]}, {"id": "1510.03119", "submitter": "Radostin Simitev", "authors": "Maryam Argungu, Saziye Bayram, Bindi Brook, Buddhapriya Chakrabarti,\n  Richard H Clayton, Donna M Daly, Rosemary J Dyson, Craig Holloway, Varun\n  Manhas, Shailesh Naire, Tom Shearer, Radostin D. Simitev", "title": "Modelling afferent nerve responses to bladder filling", "comments": "This report summarises the outcomes from a problem posed at the UK\n  MMSG NC3R's \\& POEMS Study Group meeting, 8--12 Sept 2014, Cambridge", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A sensation of fullness in the bladder is a regular experience, yet the\nmechanisms that act to generate this sensation remain poorly understood. This\nis an important issue because of the clinical problems that can result when\nthis system does not function properly. The aim of the study group activity was\nto develop mathematical models that describe the mechanics of bladder filling,\nand how stretch modulates the firing rate of afferent nerves. Several models\nwere developed, which were qualitatively consistent with experimental data\nobtained from a mouse model.\n", "versions": [{"version": "v1", "created": "Mon, 12 Oct 2015 01:21:55 GMT"}], "update_date": "2015-10-13", "authors_parsed": [["Argungu", "Maryam", ""], ["Bayram", "Saziye", ""], ["Brook", "Bindi", ""], ["Chakrabarti", "Buddhapriya", ""], ["Clayton", "Richard H", ""], ["Daly", "Donna M", ""], ["Dyson", "Rosemary J", ""], ["Holloway", "Craig", ""], ["Manhas", "Varun", ""], ["Naire", "Shailesh", ""], ["Shearer", "Tom", ""], ["Simitev", "Radostin D.", ""]]}, {"id": "1510.03194", "submitter": "Jicun Wang-Michelitsch", "authors": "Jicun Wang-Michelitsch, Thomas M. Michelitsch", "title": "The high osmotic pressure in a lens fiber as a driving force for the\n  development of senile cortical cataract", "comments": "8 pages, figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In lens cataract, the clouding change in lens leads to a decline of\ntransparency of part of the lens. There are three types of senile cataract:\ncortical cataract, nuclear cataract, and posterior/anterior sub-capsular\ncataract. The most common senile cataract is cortical cataract. For\nunderstanding cortical cataract, the pathology and the causing factors in\ncortical cataract are analyzed. The clouding change in senile cortical cataract\nbegins from the edge of the lens and develops progressively to lens centre. The\npathology of clouding change in cortical cataract is characterized by\ndisruption of some lens fibers, swelling of some other fibers, and deposition\nof water between fibers. Based on the property of a lens fiber, we propose here\na hypothesis on the mechanism of development of senile cortical cataract. I.\nCortical cataract is triggered by disruption of a cortical lens fiber as a\nresult of injury. The disrupted fiber will release water and crystallin\nproteins. II. Neighbor fibers can absorb this water due to high intracellular\nosmotic pressure (IOP) and become swollen. Swelling makes a fiber be stiff and\nhave increased risk to disrupt when it is curved during the accommodation of\nthe lens. These fibers will release water again when they disrupt, and the\nwater will make more local fibers swelling. In this way, the local fibers\nbecome swollen and then disrupt successively. III. The successive swellings and\ndisruptions of local fibers result in enlargement of a clouding change in lens.\nSince the fibers on the outer part of lens cortex have higher risk to be\ninjured than that in the inner part, a clouding change starts from the edge of\nthe lens. In conclusion, the progressive development of senile cortical\ncataract is a result of successive swellings and disruptions of local lens\nfibers, and this is driven by the high IOP in a lens fiber.\n", "versions": [{"version": "v1", "created": "Mon, 12 Oct 2015 09:23:09 GMT"}, {"version": "v2", "created": "Mon, 5 Feb 2018 11:07:55 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Wang-Michelitsch", "Jicun", ""], ["Michelitsch", "Thomas M.", ""]]}, {"id": "1510.05495", "submitter": "Oliver Gould Mr", "authors": "Oliver Gould, Amy Smart, Norman Ratcliffe, Ben de Lacy Costello", "title": "Canine Olfactory Differentiation of Cancer: A Review of the Literature", "comments": "Total of 23 pages including citations, with 1 embedded table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Numerous studies have attempted to demonstrate the olfactory ability of\ncanines to detect several common cancer types from human bodily fluids, breath\nand tissue. Canines have been reported to detect bladder cancer (sensitivity of\n0.63-0.73 and specificity of 0.64-0.92) and prostate cancer (sensitivity of\n0.91-0.99 and specificity of 0.91-0.97) from urine; breast cancer (sensitivity\nof 0.88 and specificity of 0.98) and lung cancer (sensitivity 0.56-0.99 and\nspecificity of 8.30-0.99) on breath and colorectal cancer from stools\n(sensitivity of 0.91-0.97 and specificity of 0.97-0.99). The quoted figures of\nsensitivity and specificity across differing studies demonstrate that in many\ncases results are variable from study to study; this raises questions about the\nreproducibility of methodology and study design which we have identified\nherein. Furthermore in some studies the controls used have resulted in\ndifferentiation of samples which are of limited use for clinical diagnosis.\nThese studies provide some evidence that cancer gives rise to different\nvolatile organic compounds (VOCs) compared to healthy samples. Whilst canine\ndetection may be unsuitable for clinical implementation they can, at least,\nprovide inspiration for more traditional laboratory investigations.\n", "versions": [{"version": "v1", "created": "Mon, 5 Oct 2015 15:32:06 GMT"}], "update_date": "2015-10-20", "authors_parsed": [["Gould", "Oliver", ""], ["Smart", "Amy", ""], ["Ratcliffe", "Norman", ""], ["Costello", "Ben de Lacy", ""]]}, {"id": "1510.05533", "submitter": "Zahra Karimaddini", "authors": "Dagmar Iber, Zahra Karimaddini, Erkan \\\"Unal", "title": "Image-based Modelling of Organogenesis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the major challenges in biology concerns the integration of data\nacross length and time scales into a consistent framework: how do macroscopic\nproperties and functionalities arise from the molecular regulatory networks -\nand how can they change as a result of mutations? Morphogenesis provides an\nexcellent model system to study how simple molecular networks robustly control\ncomplex processes on the macroscopic scale in spite of molecular noise, and how\nimportant functional variants can emerge from small genetic changes. Recent\nadvancements in 3D imaging technologies, computer algorithms, and computer\npower now allow us to develop and analyse increasingly realistic models of\nbiological control. Here we present our pipeline for image-based modeling that\nincludes the segmentation of images, the determination of displacement fields,\nand the solution of systems of partial differential equations (PDEs) on the\ngrowing, embryonic domains. The development of suitable mathematical models,\nthe data-based inference of parameter sets, and the evaluation of competing\nmodels are still challenging, and current approaches are discussed.\n", "versions": [{"version": "v1", "created": "Mon, 19 Oct 2015 15:31:58 GMT"}], "update_date": "2015-10-20", "authors_parsed": [["Iber", "Dagmar", ""], ["Karimaddini", "Zahra", ""], ["Ünal", "Erkan", ""]]}, {"id": "1510.07437", "submitter": "Stefania Scarsoglio", "authors": "Stefania Scarsoglio, Carlo Camporeale, Andrea Guala, Luca Ridolfi", "title": "Fluid dynamics of heart valves during atrial fibrillation: a lumped\n  parameter-based approach", "comments": "9 pages, 5 figures in Computer Methods in Biomechanics and Biomedical\n  Engineering, Published online: 13 Oct 2015", "journal-ref": null, "doi": "10.1080/10255842.2015.1094800", "report-no": null, "categories": "physics.flu-dyn physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Atrial fibrillation (AF) consequences on the heart valve dynamics are usually\nstudied along with a valvular disfunction or disease, since in medical\nmonitoring the two pathologies are often concomitant. Aim of the present work\nis to study, through a stochastic lumped-parameter approach, the basic fluid\ndynamics variations of heart valves, when only paroxysmal AF is present with\nrespect to the normal sinus rhythm (NSR) in absence of any valvular pathology.\nAmong the most common parameters interpreting the valvular function, the most\nuseful turns out to be the regurgitant volume. During AF both atrial valves do\nnot seem to worsen their performance, while the ventricular efficiency is\nremarkably reduced.\n", "versions": [{"version": "v1", "created": "Mon, 26 Oct 2015 11:03:55 GMT"}], "update_date": "2015-10-27", "authors_parsed": [["Scarsoglio", "Stefania", ""], ["Camporeale", "Carlo", ""], ["Guala", "Andrea", ""], ["Ridolfi", "Luca", ""]]}, {"id": "1510.08939", "submitter": "Peter D. Olmsted", "authors": "Chinmay Das and Peter D. Olmsted", "title": "The Physics of Stratum Corneum Lipid Membranes", "comments": "13 pages, from the Royal Society Discussion Meeting \"Soft Interfacial\n  Materials: from fundamentals to formulation\", 12-13 October 2015, London", "journal-ref": null, "doi": "10.1098/rsta.2015.0126", "report-no": null, "categories": "cond-mat.soft physics.bio-ph physics.chem-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Stratum Corneum (SC), the outermost layer of skin, comprises rigid\ncorneocytes (keratin filled dead cells) in a specialized lipid matrix. The\ncontinuous lipid matrix provides the main barrier against uncontrolled water\nloss and invasion of external pathogens. Unlike all other biological lipid\nmembranes (like intracellular organelles and plasma membranes), molecules in SC\nlipid matrix show small hydrophilic group and large variability in the length\nof the alkyl tails and in the numbers and positions of groups that are capable\nof forming hydrogen bonds. Molecular simulations provide a route for\nsystematically probing the effects of each of these differences separately. In\nthis article we present results from atomistic molecular dynamics of selected\nlipid bilayers and multilayers to probe the effect of these polydispersities.\nWe address the nature of the tail packing in the gel-like phase, the hydrogen\nbond network among head groups, the bending moduli expected for leaflets\ncomprising SC lipids, and the conformation of very long ceramide lipids (EOS)\nin multibilayer lipid assemblies.\n", "versions": [{"version": "v1", "created": "Thu, 29 Oct 2015 23:37:07 GMT"}, {"version": "v2", "created": "Tue, 12 Apr 2016 06:45:11 GMT"}], "update_date": "2016-09-28", "authors_parsed": [["Das", "Chinmay", ""], ["Olmsted", "Peter D.", ""]]}]