[{"id": "1701.00934", "submitter": "Gergely J Sz\\\"oll\\H{o}si", "authors": "Imre Der\\'enyi and Gergely J. Sz\\\"oll\\H{o}si", "title": "Hierarchical tissue organization as a general mechanism to limit the\n  accumulation of somatic mutations", "comments": "To appear in Nature Communications", "journal-ref": null, "doi": "10.1016/j.bpj.2016.11.1536", "report-no": null, "categories": "q-bio.TO q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  How can tissues generate large numbers of cells, yet keep the divisional load\n(the number of divisions along cell lineages) low in order to curtail the\naccumulation of somatic mutations and reduce the risk of cancer? To answer the\nquestion we consider a general model of hierarchically organized self-renewing\ntissues and show that the lifetime divisional load of such a tissue is\nindependent of the details of the cell differentiation processes, and depends\nonly on two structural and two dynamical parameters. Our results demonstrate\nthat a strict analytical relationship exists between two seemingly disparate\ncharacteristics of self-renewing tissues: divisional load and tissue\norganization. Most remarkably, we find that a sufficient number of\nprogressively slower dividing cell types can be almost as efficient in\nminimizing the divisional load, as non-renewing tissues. We argue that one of\nthe main functions of tissue-specific stem cells and differentiation\nhierarchies is the prevention of cancer.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2017 08:59:29 GMT"}], "update_date": "2017-04-05", "authors_parsed": [["Derényi", "Imre", ""], ["Szöllősi", "Gergely J.", ""]]}, {"id": "1701.01361", "submitter": "Christophe Gole", "authors": "Pau Atela and Christophe Gole", "title": "Rhombic Tilings and Primordia Fronts of Phyllotaxis", "comments": "33 pages, 10 pictures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO math.DS", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We introduce and study properties of phyllotactic and rhombic tilings on the\ncylin- der. These are discrete sets of points that generalize cylindrical\nlattices. Rhombic tilings appear as periodic orbits of a discrete dynamical\nsystem S that models plant pattern formation by stacking disks of equal radius\non the cylinder. This system has the advantage of allowing several disks at the\nsame level, and thus multi-jugate config- urations. We provide partial results\ntoward proving that the attractor for S is entirely composed of rhombic tilings\nand is a strongly normally attracting branched manifold and conjecture that\nthis attractor persists topologically in nearby systems. A key tool in\nunderstanding the geometry of tilings and the dynamics of S is the concept of\npri- mordia front, which is a closed ring of tangent disks around the cylinder.\nWe show how fronts determine the dynamics, including transitions of parastichy\nnumbers, and might explain the Fibonacci number of petals often encountered in\ncompositae.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2017 20:19:44 GMT"}], "update_date": "2017-01-06", "authors_parsed": [["Atela", "Pau", ""], ["Gole", "Christophe", ""]]}, {"id": "1701.04219", "submitter": "Stefania Scarsoglio", "authors": "Matteo Anselmino, Stefania Scarsoglio, Andrea Saglietto, Fiorenzo\n  Gaita, Luca Ridolfi", "title": "A Computational Study on the Relation between Resting Heart Rate and\n  Atrial Fibrillation Hemodynamics under Exercise", "comments": "15 pages, 4 figures, 5 tables", "journal-ref": "PLoS ONE, 12(1): e0169967, 2017", "doi": "10.1371/journal.pone.0169967", "report-no": null, "categories": "physics.med-ph physics.flu-dyn q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aims. Clinical data indicating a heart rate (HR) target during rate control\ntherapy for permanent atrial fibrillation (AF) and assessing its eventual\nrelationship with reduced exercise tolerance are lacking. The present study\naims at investigating the impact of resting HR on the hemodynamic response to\nexercise in permanent AF patients by means of a computational cardiovascular\nmodel.\n  Methods. The AF lumped-parameter model was run to simulate resting (1\nMetabolic Equivalent of Task-MET) and various exercise conditions (4 METs:\nbrisk walking; 6 METs: skiing; 8 METs: running), considering different resting\nHR (70 bpm for the slower resting HR-SHR simulations, and 100 bpm for the\nhigher resting HR-HHR simulations). To compare relative variations of\ncardiovascular variables upon exertion, the variation comparative index (VCI) -\nthe absolute variation between the exercise and the resting values in SHR\nsimulations referred to the absolute variation in HHR simulations -was\ncalculated at each exercise grade (VCI4, VCI6 and VCI8).\n  Results. Pulmonary venous pressure underwent a greater increase in HHR\ncompared to SHR simulations (VCI4 = 0.71, VCI6 = 0.73 and VCI8 = 0.77), while\nfor systemic arterial pressure the opposite is true (VCI4 = 1.15, VCI6 = 1.36,\nVCI8 = 1.56).\n  Conclusions. The computational findings suggest that a slower, with respect\nto a higher resting HR, might be preferable in permanent AF patients, since\nduring exercise pulmonary venous pressure undergoes a slighter increase and\nsystemic blood pressure reveals a more appropriate increase.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2017 09:55:42 GMT"}], "update_date": "2017-01-17", "authors_parsed": [["Anselmino", "Matteo", ""], ["Scarsoglio", "Stefania", ""], ["Saglietto", "Andrea", ""], ["Gaita", "Fiorenzo", ""], ["Ridolfi", "Luca", ""]]}, {"id": "1701.04989", "submitter": "Giuseppe Pontrelli", "authors": "Sean McGinty, David King, Giuseppe Pontrelli", "title": "Mathematical modelling of variable porosity coatings for controlled drug\n  release", "comments": null, "journal-ref": "Medical Engineering & Physics, vol. 45, pp. 51-60, 2017", "doi": "10.1016/j.medengphy.2017.04.006", "report-no": null, "categories": "physics.flu-dyn q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we investigate the extent to which variable porosity\ndrug-eluting coatings can provide better control over drug release than\ncoatings where the porosity is constant throughout. In particular, we aim to\nestablish the potential benefits of replacing a single-layer with a two-layer\ncoating of identical total thickness and initial drug mass. In our study, what\ndistinguishes the layers (other than their individual thickness and initial\ndrug loading) is the underlying microstructure, and in particular the effective\nporosity and the tortuosity of the material. We consider the effect on the drug\nrelease profile of varying the initial distribution of drug, the relative\nthickness of the layers and the relative resistance to diffusion offered by\neach layer's composition. Our results indicate that the contrast in properties\nof the two layers can be used as a means of better controlling the release, and\nthat the quantity of drug delivered in the early stages can be modulated by\nvarying the distribution of drug across the layers. We conclude that\nmicrostructural and loading differences between multi-layer variable porosity\ncoatings can be used to tune the properties of the coating materials to obtain\nthe desired drug release profile for a given application.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 09:24:23 GMT"}], "update_date": "2017-05-29", "authors_parsed": [["McGinty", "Sean", ""], ["King", "David", ""], ["Pontrelli", "Giuseppe", ""]]}, {"id": "1701.06267", "submitter": "Tae-Rin Lee", "authors": "Jiho Yang, Sung Sic Yoo, Tae-Rin Lee", "title": "Effect of fractional blood flow on plasma skimming in the\n  microvasculature", "comments": null, "journal-ref": "Phys. Rev. E 95, 040401 (2017)", "doi": "10.1103/PhysRevE.95.040401", "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although redistribution of red blood cells at bifurcated vessels is highly\ndependent on flow rate, it is still challenging to quantitatively express the\ndependency of flow rate in plasma skimming due to nonlinear cellular\ninteractions. We suggest a plasma skimming model that can involve the effect of\nfractional blood flow at each bifurcation point. For validating the new model,\nit is compared with \\textit{in vivo} data at single bifurcation points, as well\nas microvascular network systems. In the simulation results, the exponential\ndecay of plasma skimming parameter, $M$, along fractional flow rate shows the\nbest performance in both cases.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2017 05:20:56 GMT"}, {"version": "v2", "created": "Thu, 6 Apr 2017 05:50:31 GMT"}], "update_date": "2017-05-03", "authors_parsed": [["Yang", "Jiho", ""], ["Yoo", "Sung Sic", ""], ["Lee", "Tae-Rin", ""]]}, {"id": "1701.06656", "submitter": "Kei Fong Lam Dr", "authors": "Harald Garcke, Kei Fong Lam, Robert N\\\"urnberg and Emanuel Sitka", "title": "A multiphase Cahn-Hilliard-Darcy model for tumour growth with necrosis", "comments": "43 pages, 56 figures", "journal-ref": "Math. Models Methods Appl. Sci. 28 (2018) 525--577", "doi": "10.1142/S0218202518500148", "report-no": null, "categories": "math.AP q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive a Cahn-Hilliard-Darcy model to describe multiphase tumour growth\ntaking interactions with multiple chemical species into account as well as the\nsimultaneous occurrence of proliferating, quiescent and necrotic regions. Via a\ncoupling of the Cahn-Hilliard-Darcy equations to a system of reaction-diffusion\nequations a multitude of phenomena such as nutrient diffusion and consumption,\nangiogenesis, hypoxia, blood vessel growth, and inhibition by toxic agents,\nwhich are released for example by the necrotic cells, can be included. A new\nfeature of the modelling approach is that a volume-averaged velocity is used,\nwhich dramatically simplifies the resulting equations. With the help of\nformally matched asymptotic analysis we develop new sharp interface models.\nFinite element numerical computations are performed and in particular the\neffects of necrosis on tumour growth is investigated numerically.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2017 22:21:21 GMT"}], "update_date": "2019-11-01", "authors_parsed": [["Garcke", "Harald", ""], ["Lam", "Kei Fong", ""], ["Nürnberg", "Robert", ""], ["Sitka", "Emanuel", ""]]}, {"id": "1701.06781", "submitter": "Andrea De Martino", "authors": "Jorge Fernandez-de-Cossio-Diaz, Andrea De Martino, Roberto Mulet", "title": "Microenvironmental cooperation promotes early spread and bistability of\n  a Warburg-like phenotype", "comments": "14 pages", "journal-ref": "Scientific Reports 7, 3103 (2017)", "doi": "10.1038/s41598-017-03342-3", "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an in silico model for the initial spread of an aberrant\nphenotype with Warburg-like overflow metabolism within a healthy homeostatic\ntissue in contact with a nutrient reservoir (the blood), aimed at\ncharacterizing the role of the microenvironment for aberrant growth. Accounting\nfor cellular metabolic activity, competition for nutrients, spatial diffusion\nand their feedbacks on aberrant replication and death rates, we obtain a phase\nportrait where distinct asymptotic whole-tissue states are found upon varying\nthe tissue-blood turnover rate and the level of blood-borne primary nutrient.\nOver a broad range of parameters, the spreading dynamics is bistable as random\nfluctuations can impact the final state of the tissue. Such a behaviour turns\nout to be linked to the re-cycling of overflow products by non-aberrant cells.\nQuantitative insight on the overall emerging picture is provided by a spatially\nhomogeneous version of the model.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2017 09:27:46 GMT"}, {"version": "v2", "created": "Thu, 8 Jun 2017 12:10:34 GMT"}], "update_date": "2017-06-09", "authors_parsed": [["Fernandez-de-Cossio-Diaz", "Jorge", ""], ["De Martino", "Andrea", ""], ["Mulet", "Roberto", ""]]}, {"id": "1701.07100", "submitter": "Sebastian Streichan", "authors": "Sebastian J Streichan and Matthew F Lefebvre and Nicholas Noll and\n  Eric F Wieschaus and Boris I Shraiman", "title": "Quantification of myosin distribution predicts global morphogenetic flow\n  in the fly embryo", "comments": "15 total pages, with 9 total figures (7 pages main text with 4\n  figures and 8 pages SI text with 5 SI figures)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.CB q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During embryogenesis tissue layers continuously rearrange and fold into\nspecific shapes. Developmental biology identified patterns of gene expression\nand cytoskeletal regulation underlying local tissue dynamics, but how actions\nof multiple domains of distinct cell types coordinate to remodel tissues at the\norgan scale remains unclear. We use in toto light-sheet microscopy, automated\nimage analysis, and physical modeling to quantitatively investigate the link\nbetween kinetics of global tissue transformations and force generation patterns\nduring Drosophila gastrulation. We find embryo-scale shape changes are\nrepresented by a temporal sequence of three simple flow field configurations.\nEach phase is accompanied by a characteristic spatial myosin distribution,\nquantified in terms of a coarse-grained 'myosin tensor' that captures both\nconcentration and anisotropy. Our model assumes tissue flow is driven by stress\nproportional to the myosin tensor, and is effectively visco-elastic with two\nparameters that control 'irrotational' and 'divergence-less' components of the\nflow. With just three global parameters, this model achieves up to 90%\nagreement between predicted and measured flow. The analysis uncovers importance\nof a) spatial modulation of myosin distribution and b) long-range spreading of\nits effect due to mechanical interaction of cells. In particular, we find\ngermband extension phase is associated with the onset of effective areal\nincompressibility of the epithelium, which makes the relation of flow and\nmyosin forcing strongly non-local. Our analysis also revealed a new function\nfor basal myosin in generating a dorsally directed flow and, combined with\nmutant analysis, identified an unconventional control mechanism through twist\ndependent reduction of basal myosin levels on the ventral side. We conclude\nthat understanding morphogenetic flow requires a fundamentally global\nperspective.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2017 22:56:37 GMT"}], "update_date": "2017-01-26", "authors_parsed": [["Streichan", "Sebastian J", ""], ["Lefebvre", "Matthew F", ""], ["Noll", "Nicholas", ""], ["Wieschaus", "Eric F", ""], ["Shraiman", "Boris I", ""]]}, {"id": "1701.07379", "submitter": "Jose Vanterler Da Costa Sousa", "authors": "Jos\\'e Vanterler da Costa Sousa, Edmundo Capelas de Oliveira and Luiz\n  Alberto Magna", "title": "Fractional Calculus and the ESR test", "comments": "19 pages and 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a partial differential equation associated with a mathematical\nmodel describing the concentration of nutrients in blood which interferes\ndirectly on the erythrocyte sedimentation rate in the case of an average fluid\nvelocity equal to zero. Introducing the fractional derivative in the Caputo\nsense, we propose a time-fractional mathematical model which contains, as a\nparticular case, the model proposed by Sharma et al. Our main purpose is to\nobtain an analytic solution of this time-fractional partial differential\nequation in terms of the Mittag-Leffler function and Wright function.\n", "versions": [{"version": "v1", "created": "Thu, 29 Dec 2016 13:52:46 GMT"}], "update_date": "2017-01-27", "authors_parsed": [["Sousa", "José Vanterler da Costa", ""], ["de Oliveira", "Edmundo Capelas", ""], ["Magna", "Luiz Alberto", ""]]}, {"id": "1701.07823", "submitter": "Alessandro Musesti", "authors": "Giulia Giantesio and Alessandro Musesti", "title": "A continuum model of skeletal muscle tissue with loss of activation", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-319-73371-5_7", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a continuum model for the mechanical behavior of the skeletal\nmuscle tissue when its functionality is reduced due to aging. The loss of\nability of activating is typical of the geriatric syndrome called sarcopenia.\nThe material is described by a hyperelastic, polyconvex, transverse isotropic\nstrain energy function. The three material parameters appearing in the energy\nare fitted by least square optimization on experimental data, while\nincompressibility is assumed through a Lagrange multiplier representing the\nhydrostatic pressure. The activation of the muscle fibers, which is related to\nthe contraction of the sarcomere, is modeled by the so called active strain\napproach. The loss of performance of an elder muscle is then obtained by\nlowering of some percentage the active part of the stress. The model is\nimplemented numerically and the obtained results are discussed and graphically\nrepresented.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2017 10:58:48 GMT"}], "update_date": "2018-05-03", "authors_parsed": [["Giantesio", "Giulia", ""], ["Musesti", "Alessandro", ""]]}, {"id": "1701.08085", "submitter": "Giuseppe Longo", "authors": "Giuseppe Longo", "title": "The Biological Consequences of the Computational World: Mathematical\n  Reflections on Cancer Biology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The role of continua has been clear since antiquity in the mathematical\napproaches to physics, while discrete manifolds were brought to the limelight\nmostly by Quantum and Information Theories, in the XX century. We first recall\nhow theorizing and measuring radically change in physics when using discrete\nvs. continuous mathematical manifolds. It will follow that the reference to\ndiscrete structures and digital information is far from neutral in knowledge\nconstruction. In biology, in particular, the introduction of information as a\nnew observable on discrete data types has been promoting a dramatic\nreorganization of the tools for knowledge. We briefly analyze the origin and\nthe nature, then some consequences of the bias thus induced in life sciences,\nwith particular emphasis on research on cancer. We finally summarize new\ntheoretical frames that propose different directions as for the organizing\nprinciples for biological thinking and experimenting, including in cancer\nresearch. Cancer is now viewed as an organismal, tissue based issue, according\nto the perspective proposed in (Sonnenschein, Soto, 1999; Baker, 2015).\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2017 15:39:53 GMT"}, {"version": "v2", "created": "Sat, 1 Apr 2017 17:24:12 GMT"}], "update_date": "2017-04-04", "authors_parsed": [["Longo", "Giuseppe", ""]]}, {"id": "1701.08664", "submitter": "David Hukins FRSE", "authors": "David W.L. Hukins", "title": "Energy from food", "comments": "4 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Expressing the energy content of food as the heat energy released by its\ncombustion is potentially misleading. Food is used to produce adenosine\ntriphosphate (ATP). The free energy of conversion of ATP into adenosine\ndiphosphate is used directly for processes such as muscular contraction,\nwithout the need for intermediate heat production. The number of ATP molecules\nproduced depends on the task being performed and the fitness level of the\nperson performing the task, since both affect the extent to which aerobic and\nanaerobic respiration are involved. The digestion and metabolism of soluble\ncarbohydrates, complex carbohydrates and fats requires production of different\nenzymes. The information required to assess whether this affects the net ATP\nproduction by these different types of food does not appear to be available.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2017 15:55:11 GMT"}], "update_date": "2017-01-31", "authors_parsed": [["Hukins", "David W. L.", ""]]}]