[{"id": "1706.00247", "submitter": "Hossam Haick", "authors": "Inbar Nardi Agmon, Manal Abud, Ori Liran, Naomi Gai-Mo, Maya Ilouze,\n  Amir Onn, Jair Bar, Rossie Navon, Dekel Shlomi, Hossam Haick and Nir Peled", "title": "Exhaled Breath Analysis for Monitoring Response to Treatment in Advanced\n  Lung Cancer", "comments": null, "journal-ref": null, "doi": "10.1016/j.jtho.2016.02.017", "report-no": null, "categories": "q-bio.TO physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  INTRODUCTION: The Response Evaluation Criteria in Solid Tumors (RECIST) serve\nas the accepted standard to monitor treatment efficacy in lung cancer. However,\nthe time intervals between consecutive computerized tomography scans might be\ntoo long to allow early identification of treatment failure. This study\nexamines the use of breath sampling to monitor responses to anticancer\ntreatments in patients with advanced lung cancer. METHODS: A total of 143\nbreath samples were collected from 39 patients with advanced lung cancer. The\nexhaled breath signature, determined by gas chromatography/mass spectrometry\nand a nanomaterial-based array of sensors, was correlated with the response to\ntherapy assessed by RECIST: complete response, partial response, stable\ndisease, or progressive disease. RESULTS: Gas chromatography/mass spectrometry\nanalysis identified three volatile organic compounds as significantly\nindicating disease control (PR/stable disease), with one of them also\nsignificantly discriminating PR/stable disease from progressive disease. The\nnanoarray had the ability to monitor changes in tumor response across therapy,\nalso indicating any lack of further response to therapy. When one-sensor\nanalysis was used, 59% of the follow-up samples were identified correctly.\nThere was 85% success in monitoring disease control (stable disease/partial\nresponse). CONCLUSION: Breath analysis, using mainly the nanoarray, may serve\nas a surrogate marker for the response to systemic therapy in lung cancer. As a\nmonitoring tool, it can provide the oncologist with a quick bedside method of\nidentifying a lack of response to an anticancer treatment. This may allow\nquicker recognition than does the current RECIST analysis. Early recognition of\ntreatment failure could improve patient care.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jun 2017 10:35:03 GMT"}], "update_date": "2017-06-02", "authors_parsed": [["Agmon", "Inbar Nardi", ""], ["Abud", "Manal", ""], ["Liran", "Ori", ""], ["Gai-Mo", "Naomi", ""], ["Ilouze", "Maya", ""], ["Onn", "Amir", ""], ["Bar", "Jair", ""], ["Navon", "Rossie", ""], ["Shlomi", "Dekel", ""], ["Haick", "Hossam", ""], ["Peled", "Nir", ""]]}, {"id": "1706.00383", "submitter": "Dervis Vural", "authors": "Uryan Isik Can, Neerajha Nagarajan, Dervis Can Vural, Pinar Zorlutuna", "title": "Muscle-Cell-Based \"Living Diodes\"", "comments": null, "journal-ref": "Can UI, Nagarajan N, Vural DC, Zorlutuna P. Muscle-Cell-Based\n  \"Living Diodes\". Advanced Biosystems. 2017 Jan 1", "doi": null, "report-no": null, "categories": "q-bio.TO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new type of diode that is made entirely of electrically excitable muscle\ncells and nonexcitable fibroblast cells is designed, fabricated, and\ncharacterized. These two cell types in a rectangular pattern allow the signal\ninitiated on the excitable side to pass to the nonexcitable side, and not in\nthe opposite direction.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jun 2017 16:50:25 GMT"}], "update_date": "2017-06-02", "authors_parsed": [["Can", "Uryan Isik", ""], ["Nagarajan", "Neerajha", ""], ["Vural", "Dervis Can", ""], ["Zorlutuna", "Pinar", ""]]}, {"id": "1706.00935", "submitter": "Ricardo Guerrero", "authors": "R. Guerrero, C. Qin, O. Oktay, C. Bowles, L. Chen, R. Joules, R. Wolz,\n  M.C. Valdes-Hernandez, D.A. Dickie, J. Wardlaw and D. Rueckert", "title": "White matter hyperintensity and stroke lesion segmentation and\n  differentiation using convolutional neural networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The accurate assessment of White matter hyperintensities (WMH) burden is of\ncrucial importance for epidemiological studies to determine association between\nWMHs, cognitive and clinical data. The manual delineation of WMHs is tedious,\ncostly and time consuming. This is further complicated by the fact that other\npathological features (i.e. stroke lesions) often also appear as hyperintense.\nSeveral automated methods aiming to tackle the challenges of WMH segmentation\nhave been proposed, however cannot differentiate between WMH and strokes. Other\nmethods, capable of distinguishing between different pathologies in brain MRI,\nare not designed with simultaneous WMH and stroke segmentation in mind. In this\nwork we propose to use a convolutional neural network (CNN) that is able to\nsegment hyperintensities and differentiate between WMHs and stroke lesions.\nSpecifically, we aim to distinguish between WMH pathologies from those caused\nby stroke lesions due to either cortical, large or small subcortical infarcts.\nAs far as we know, this is the first time such differentiation task has\nexplicitly been proposed. The proposed fully convolutional CNN architecture, is\ncomprised of an analysis path, that gradually learns low and high level\nfeatures, followed by a synthesis path, that gradually combines and up-samples\nthe low and high level features into a class likelihood semantic segmentation.\nQuantitatively, the proposed CNN architecture is shown to outperform other well\nestablished and state-of-the-art algorithms in terms of overlap with manual\nexpert annotations. Clinically, the extracted WMH volumes were found to\ncorrelate better with the Fazekas visual rating score. Additionally, a\ncomparison of the associations found between clinical risk-factors and the WMH\nvolumes generated by the proposed method, were found to be in line with the\nassociations found with the expert-annotated volumes.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jun 2017 11:58:18 GMT"}, {"version": "v2", "created": "Tue, 2 Jan 2018 11:33:33 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Guerrero", "R.", ""], ["Qin", "C.", ""], ["Oktay", "O.", ""], ["Bowles", "C.", ""], ["Chen", "L.", ""], ["Joules", "R.", ""], ["Wolz", "R.", ""], ["Valdes-Hernandez", "M. C.", ""], ["Dickie", "D. A.", ""], ["Wardlaw", "J.", ""], ["Rueckert", "D.", ""]]}, {"id": "1706.01989", "submitter": "Anna Konstorum", "authors": "Anna Konstorum, Anthony T. Vella, Adam J. Adler, Reinhard Laubenbacher", "title": "Addressing current challenges in cancer immunotherapy with mathematical\n  and computational modeling", "comments": "Accepted for publication in the Journal of the Royal Society\n  Interface", "journal-ref": "Journal of the Royal Society Interface, 14 (131): 20170150 (2017)", "doi": "10.1098/rsif.2017.0150", "report-no": null, "categories": "q-bio.TO q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of cancer immunotherapy is to boost a patient's immune response to a\ntumor. Yet, the design of an effective immunotherapy is complicated by various\nfactors, including a potentially immunosuppressive tumor microenvironment,\nimmune-modulating effects of conventional treatments, and therapy-related\ntoxicities. These complexities can be incorporated into mathematical and\ncomputational models of cancer immunotherapy that can then be used to aid in\nrational therapy design. In this review, we survey modeling approaches under\nthe umbrella of the major challenges facing immunotherapy development, which\nencompass tumor classification, optimal treatment scheduling, and combination\ntherapy design. Although overlapping, each challenge has presented unique\nopportunities for modelers to make contributions using analytical and numerical\nanalysis of model outcomes, as well as optimization algorithms. We discuss\nseveral examples of models that have grown in complexity as more biological\ninformation has become available, showcasing how model development is a dynamic\nprocess interlinked with the rapid advances in tumor-immune biology. We\nconclude the review with recommendations for modelers both with respect to\nmethodology and biological direction that might help keep modelers at the\nforefront of cancer immunotherapy development.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 21:32:50 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Konstorum", "Anna", ""], ["Vella", "Anthony T.", ""], ["Adler", "Adam J.", ""], ["Laubenbacher", "Reinhard", ""]]}, {"id": "1706.02656", "submitter": "Matthias Merkel", "authors": "Matthias Merkel and Lisa Manning", "title": "A geometrically controlled rigidity transition in a model for confluent\n  3D tissues", "comments": "6 pages main text + 13 pages appendix, 3 main text figures + 6\n  appendix figures", "journal-ref": null, "doi": "10.1088/1367-2630/aaaa13", "report-no": null, "categories": "cond-mat.soft q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The origin of rigidity in disordered materials is an outstanding open problem\nin statistical physics. Previously, a class of 2D cellular models has been\nshown to undergo a rigidity transition controlled by a mechanical parameter\nthat specifies cell shapes. Here, we generalize this model to 3D and find a\nrigidity transition that is similarly controlled by the preferred surface area:\nthe model is solid-like below a dimensionless surface area of\n$s_0^\\ast\\approx5.413$, and fluid-like above this value. We demonstrate that,\nunlike jamming in soft spheres, residual stresses are necessary to create\nrigidity. These stresses occur precisely when cells are unable to obtain their\ndesired geometry, and we conjecture that there is a well-defined minimal\nsurface area possible for disordered cellular structures. We show that the\nbehavior of this minimal surface induces a linear scaling of the shear modulus\nwith the control parameter at the transition point, which is different from the\nscaling observed in particulate matter. The existence of such a minimal surface\nmay be relevant for biological tissues and foams, and helps explain why cell\nshapes are a good structural order parameter for rigidity transitions in\nbiological tissues.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 15:54:36 GMT"}, {"version": "v2", "created": "Thu, 7 Sep 2017 15:28:17 GMT"}, {"version": "v3", "created": "Fri, 8 Sep 2017 00:53:08 GMT"}, {"version": "v4", "created": "Sun, 22 Oct 2017 19:35:19 GMT"}], "update_date": "2018-03-14", "authors_parsed": [["Merkel", "Matthias", ""], ["Manning", "Lisa", ""]]}, {"id": "1706.02758", "submitter": "Saba Adabi", "authors": "Saba Adabi, Matin Hosseinzadeh, Shahryar Noei, Steven Daveluy, Anne\n  Clayton, Darius Mehregan, Silvia Conforto, Mohammadreza Nasiriavanaki", "title": "Universal in vivo Textural Model for Human Skin based on Optical\n  Coherence Tomograms", "comments": null, "journal-ref": "Nature Scientific Reports 17912 (2017)", "doi": "10.1038/s41598-017-17398-8", "report-no": null, "categories": "q-bio.TO physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently, diagnosis of skin diseases is based primarily on visual pattern\nrecognition skills and expertise of the physician observing the lesion. Even\nthough dermatologists are trained to recognize patterns of morphology, it is\nstill a subjective visual assessment. Tools for automated pattern recognition\ncan provide objective information to support clinical decision-making.\nNoninvasive skin imaging techniques provide complementary information to the\nclinician. In recent years, optical coherence tomography has become a powerful\nskin imaging technique. According to specific functional needs, skin\narchitecture varies across different parts of the body, as do the textural\ncharacteristics in OCT images. There is, therefore, a critical need to\nsystematically analyze OCT images from different body sites, to identify their\nsignificant qualitative and quantitative differences. Sixty-three optical and\ntextural features extracted from OCT images of healthy and diseased skin are\nanalyzed and in conjunction with decision-theoretic approaches used to create\ncomputational models of the diseases. We demonstrate that these models provide\nobjective information to the clinician to assist in the diagnosis of\nabnormalities of cutaneous microstructure, and hence, aid in the determination\nof treatment. Specifically, we demonstrate the performance of this methodology\non differentiating basal cell carcinoma (BCC) and squamous cell carcinoma (SCC)\nfrom healthy tissue.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 20:33:54 GMT"}, {"version": "v2", "created": "Fri, 18 Aug 2017 05:50:56 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Adabi", "Saba", ""], ["Hosseinzadeh", "Matin", ""], ["Noei", "Shahryar", ""], ["Daveluy", "Steven", ""], ["Clayton", "Anne", ""], ["Mehregan", "Darius", ""], ["Conforto", "Silvia", ""], ["Nasiriavanaki", "Mohammadreza", ""]]}, {"id": "1706.03366", "submitter": "Hua Cheng M.D.", "authors": "Hua Cheng", "title": "Short-term effect of hyperbaric exposure on Ventilation: A Control Study\n  of 12m-depth Single No-decompression Dive Experiment", "comments": "34 pages,5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Objective: To study to what extent or durations of ventilation effect in a\nsingle no-decompression dive of 12 meters to a diver. Methods: There are 29\nhealthy volunteers divers assigned into SCUBA diving of 12m-depth underwater\n(the Experimental Group, EG)and chamber dive under 2.2 ATA for 20min (the\nControl Group, CG) matched with the factors of the age,gender,BMI and Forced\nVital Capacity (FVC).Ventilation functions were measured by spirometer before\ndiving and in 1h and 24h of post-hyperbaric exposure. Used independent samples\nT tests to compare the differences between the EG and CG.Analyzed of variance\nthrough repeated measurement data of different time point before or after high\npressure exposure by SPSS 20.0. Results: The Inspiratory Reserve Volume(IRV)\nrises while the Expiratory Reserve Volume(ERV) falls significantly in 1h after\nhigh pressure release(p<0.05).So as with the Inspiratory Capacity (IC) and the\nVital Capacity (VC) increased accordingly. The Ratio of FEV1.0 to VC (FEV1.0%t)\nis higher in CG than EG (t=-2.189,p=0.033) due to the change of VC. But the\neffects did not last for 24 h after high pressure relief. Conclusions:\nVentilation is restricted during the 20min of hyperbaric exposure whether under\n12m-depth water or in a 2.2ATA hyperbaric chamber. But the effect recovered\nclose to normal within 24 h. But the effect recovered close to normal within 24\nh. The extent of restriction of underwater diving is larger than the dry air\nhyperbaric chamber dive. Higher water medium density, submerged compressing\nblood volume of lower limbs and raising inertia added by portable underwater\nbreathing apparatus all might be attributable to the ventilation effects.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jun 2017 16:02:31 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Cheng", "Hua", ""]]}, {"id": "1706.03375", "submitter": "Stefan Engblom", "authors": "Stefan Engblom Daniel B. Wilson and Ruth E. Baker", "title": "Scalable population-level modeling of biological cells incorporating\n  mechanics and kinetics in continuous time", "comments": null, "journal-ref": "Roy. Soc. Open Sci. 5(8), (2018)", "doi": "10.1098/rsos.180379", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The processes taking place inside the living cell are now understood to the\npoint where predictive computational models can be used to gain detailed\nunderstanding of important biological phenomena. A key challenge is to\nextrapolate this detailed knowledge of the individual cell to be able to\nexplain at the population level how cells interact and respond with each other\nand their environment. In particular, the goal is to understand how organisms\ndevelop, maintain and repair functional tissues and organs.\n  In this paper we propose a novel computational framework for modeling\npopulations of interacting cells. Our framework incorporates mechanistic,\nconstitutive descriptions of biomechanical properties of the cell population,\nand uses a coarse graining approach to derive individual rate laws that enable\npropagation of the population through time. Thanks to its multiscale nature,\nthe resulting simulation algorithm is extremely scalable and highly efficient.\nAs highlighted in our computational examples, the framework is also very\nflexible and may straightforwardly be coupled with continuous-time descriptions\nof biochemical signalling within, and between, individual cells.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jun 2017 16:27:06 GMT"}, {"version": "v2", "created": "Wed, 20 Sep 2017 15:16:08 GMT"}, {"version": "v3", "created": "Thu, 8 Mar 2018 14:00:41 GMT"}], "update_date": "2018-10-26", "authors_parsed": [["Wilson", "Stefan Engblom Daniel B.", ""], ["Baker", "Ruth E.", ""]]}, {"id": "1706.06763", "submitter": "Brodie Lawson", "authors": "Brodie A. J. Lawson, Christopher C. Drovandi, Nicole Cusimano, Pamela\n  Burrage, Blanca Rodriguez, Kevin Burrage", "title": "Unlocking datasets by calibrating populations of models to data density:\n  a study in atrial electrophysiology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The understanding of complex physical or biological systems nearly always\nrequires a characterisation of the variability that underpins these processes.\nIn addition, the data used to calibrate such models may also often exhibit\nconsiderable variability. A recent approach to deal with these issues has been\nto calibrate populations of models (POMs), that is multiple copies of a single\nmathematical model but with different parameter values. To date this\ncalibration has been limited to selecting models that produce outputs that fall\nwithin the ranges of the dataset, ignoring any trends that might be present in\nthe data. We present here a novel and general methodology for calibrating POMs\nto the distributions of a set of measured values in a dataset. We demonstrate\nthe benefits of our technique using a dataset from a cardiac atrial\nelectrophysiology study based on the differences in atrial action potential\nreadings between patients exhibiting sinus rhythm (SR) or chronic atrial\nfibrillation (cAF) and the Courtemanche--Ramirez--Nattel model for human atrial\naction potentials. Our approach accurately captures the variability inherent in\nthe experimental population, and allows us to identify the differences\nunderlying stratified data as well as the effects of drug block.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jun 2017 07:08:25 GMT"}], "update_date": "2017-06-22", "authors_parsed": [["Lawson", "Brodie A. J.", ""], ["Drovandi", "Christopher C.", ""], ["Cusimano", "Nicole", ""], ["Burrage", "Pamela", ""], ["Rodriguez", "Blanca", ""], ["Burrage", "Kevin", ""]]}, {"id": "1706.08797", "submitter": "Henri Gouin", "authors": "Henri Gouin (M2P2)", "title": "Continuum mechanics at nanoscale. A tool to study trees' watering and\n  recovery", "comments": "The paper is a review and overlap of my different papers about the\n  watering of trees as a mathematical development of my paper in The Journal of\n  Theoretical Biology. These results are presented together with new\n  researches: transfer of liquid water and vapour between xylem microtubes, an\n  explanation of ultrasounds generated in the watering network considered as\n  sound pipes, numerical calculations of flows in thin liquid films and of\n  Poiseuille flows in xylem microtubes, an estimation of the velocity for the\n  ascent of crude sap and of the recovery time of trees during the spring\n  period", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cohesion-tension theory expounds the crude sap ascent thanks to the\nnegative pressure generated by evaporation of water from leaves. Nevertheless,\ntrees pose multiple challenges and seem to live in unphysical conditions: the\nnegative pressure increases cavitation; it is possible to obtain a water\nequilibrium between connected parts where one is at a positive pressure and the\nother one is at negative pressure; no theory is able to satisfactorily account\nfor the refilling of vessels after embolism events. A theoretical form of our\npaper in the Journal of Theoretical Biology is proposed together with new\nresults: a continuum mechanics model of the disjoining pressure concept refers\nto the Derjaguin School of physical chemistry. A comparison between liquid\nbehaviour both in tight-filled microtubes and in liquid thin-films is offered\nwhen the pressure is negative in liquid bulks and is positive in liquid\nthin-films and vapour bulks. In embolized xylem microtubes, when the air-vapour\npocket pressure is greater than the air-vapour bulk pressure, a refilling flow\noccurs between the air-vapour domains to empty the air-vapour pockets although\nthe liquid-bulk pressure remains negative. The model has a limit of validity\ntaking the maximal size of trees into account. These results drop inkling that\nthe disjoining pressure is an efficient tool to study biological liquids in\ncontact with substrates at a nanoscale range.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jun 2017 11:52:25 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Gouin", "Henri", "", "M2P2"]]}, {"id": "1706.08836", "submitter": "Juan B Gutierrez", "authors": "Yi H. Yan, Diego M. Moncada, Elizabeth D. Trippe, Juan B. Gutierrez", "title": "Correlates of severity of disease in Macaca mulatta infected with\n  Plasmodium cynomolgi", "comments": "10 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Characterization of host responses associated with severe malaria through an\nintegrative approach is necessary to understand the dynamics of a\n\\textit{Plasmodium cynomolgi} infection. In this study, we conducted temporal\nimmune profiling, cytokine profiling and transcriptomic analysis of five\n\\textit{Macaca mulatta} infected with \\textit{P. cynomolgi}. This experiment\nresulted in two severe infections, and two mild infections. Our analysis\nreveals that differential transcriptional up-regulation of genes linked with\nresponse to pathogen-associated molecular pattern (PAMP) and pro-inflammatory\ncytokines is characteristic of hosts experiencing severe malaria. Furthermore,\nour analysis discovered associations of transcriptional differential regulation\nunique to severe hosts with specific cellular and cytokine responses. The\ncombined data provide a molecular and cellular basis for the development of\nsevere malaria during \\textit{P. cynomolgi} infection.\n", "versions": [{"version": "v1", "created": "Sun, 25 Jun 2017 16:19:18 GMT"}, {"version": "v2", "created": "Fri, 30 Jun 2017 02:34:25 GMT"}], "update_date": "2017-07-03", "authors_parsed": [["Yan", "Yi H.", ""], ["Moncada", "Diego M.", ""], ["Trippe", "Elizabeth D.", ""], ["Gutierrez", "Juan B.", ""]]}, {"id": "1706.09688", "submitter": "Ashwij Mayya", "authors": "Ashwij Mayya, Anuradha Banerjee, R. Rajesh", "title": "On role of matrix behavior in compressive fracture of bovine cortical\n  bone", "comments": "9 pages, 12 figures, research article", "journal-ref": "Phys. Rev. E 96, 053001 (2017)", "doi": "10.1103/PhysRevE.96.053001", "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In compressive fracture of dry plexiform bone, we examine the individual\nroles of overall mean porosity, the connectivity of the porosity network, and\nthe elastic as well as the failure properties of the non-porous matrix, using a\nrandom spring network model. Porosity network structure is shown to reduce the\ncompressive strength by upto 30%. However, the load bearing capacity increases\nwith increase in either of the matrix properties - elastic modulus or failure\nstrain threshold. To validate the porosity-based RSNM model with available\nexperimental data, bone-specific failure strain thresholds for the ideal matrix\nof similar elastic properties were estimated to be within 60% of each other.\nFurther, we observe the avalanche size exponents to be independent of the\nbone-dependent parameters as well as the structure of the porosity network.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 11:40:17 GMT"}], "update_date": "2017-11-22", "authors_parsed": [["Mayya", "Ashwij", ""], ["Banerjee", "Anuradha", ""], ["Rajesh", "R.", ""]]}]