[{"id": "1902.00018", "submitter": "Alexander Kaiser", "authors": "Alexander D. Kaiser, David M. McQueen, Charles S. Peskin", "title": "Modeling the Mitral Valve", "comments": null, "journal-ref": null, "doi": "10.1002/cnm.3240", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work is concerned with modeling and simulation of the mitral valve, one\nof the four valves in the human heart. The valve is composed of leaflets, the\nfree edges of which are supported by a system of chordae, which themselves are\nanchored to the papillary muscles inside the left ventricle. First, we examine\nvalve anatomy and present the results of original dissections. These display\nthe gross anatomy and information on fiber structure of the mitral valve. Next,\nwe build a model valve following a design-based methodology, meaning that we\nderive the model geometry and the forces that are needed to support a given\nload, and construct the model accordingly. We incorporate information from the\ndissections to specify the fiber topology of this model. We assume the valve\nachieves mechanical equilibrium while supporting a static pressure load. The\nsolution to the resulting differential equations determines the pressurized\nconfiguration of the valve model. To complete the model we then specify a\nconstitutive law based on a stress-strain relation consistent with experimental\ndata that achieves the necessary forces computed in previous steps. Finally,\nusing the immersed boundary method, we simulate the model valve in fluid in a\ncomputer test chamber. The model opens easily and closes without leak when\ndriven by physiological pressures over multiple beats. Further, its closure is\nrobust to driving pressures that lack atrial systole or are much lower or\nhigher than normal.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2019 18:40:13 GMT"}, {"version": "v2", "created": "Wed, 4 Sep 2019 20:24:40 GMT"}], "update_date": "2020-11-19", "authors_parsed": [["Kaiser", "Alexander D.", ""], ["McQueen", "David M.", ""], ["Peskin", "Charles S.", ""]]}, {"id": "1902.00728", "submitter": "Juan Mar\\'in", "authors": "Jorge A. Gonz\\'alez, M. Acanda, Z. Akhtar, D. Andrews, J. I. Azqueta,\n  E. Bass, A. Bellor\\'in, J. Couso, M\\'onica A. Garc\\'ia-\\~Nustes, Y. Infante,\n  S. Jim\\'enez, L. Lester, L. Maldonado, Juan F. Mar\\'in, L. Pineda, I.\n  Rodr\\'iguez, C. C. Tamayo, D. Valdes and L. V\\'azquez", "title": "New combinational therapies for cancer using modern statistical\n  mechanics", "comments": "35 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph nlin.AO q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a new dynamical system that describes tumor-host interaction.\nThe equation that describes the untreated tumor growth is based on\nnon-extensive statistical mechanics. Recently, this model has been shown to fit\nsuccessfully exponential, Gompertz, logistic, and power-law tumor growths. We\nhave been able to include as many hallmarks of cancer as possible. We study\nalso the dynamic response of cancer under therapy. Using our model, we can make\npredictions about the different outcomes when we change the parameters, and/or\nthe initial conditions. We can determine the importance of different factors to\ninfluence tumor growth. We discover synergistic therapeutic effects of\ndifferent treatments and drugs. Cancer is generally untreatable using\nconventional monotherapy. We consider conventional therapies, oncogene-targeted\ntherapies, tumor-suppressors gene-targeted therapies, immunotherapies,\nanti-angiogenesis therapies, virotherapy, among others. We need therapies with\nthe potential to target both tumor cells and the tumors' microenvironment.\nDrugs that target oncogenes and tumor-suppressor genes can be effective in the\ntreatment of some cancers. However, most tumors do reoccur. We have found that\nthe success of the new therapeutic agents can be seen when used in combination\nwith other cancer-cell-killing therapies. Our results have allowed us to design\na combinational therapy that can lead to the complete eradication of cancer.\n", "versions": [{"version": "v1", "created": "Sat, 2 Feb 2019 14:34:13 GMT"}], "update_date": "2019-02-05", "authors_parsed": [["González", "Jorge A.", ""], ["Acanda", "M.", ""], ["Akhtar", "Z.", ""], ["Andrews", "D.", ""], ["Azqueta", "J. I.", ""], ["Bass", "E.", ""], ["Bellorín", "A.", ""], ["Couso", "J.", ""], ["García-Ñustes", "Mónica A.", ""], ["Infante", "Y.", ""], ["Jiménez", "S.", ""], ["Lester", "L.", ""], ["Maldonado", "L.", ""], ["Marín", "Juan F.", ""], ["Pineda", "L.", ""], ["Rodríguez", "I.", ""], ["Tamayo", "C. C.", ""], ["Valdes", "D.", ""], ["Vázquez", "L.", ""]]}, {"id": "1902.04614", "submitter": "Melinda Liu Perkins", "authors": "Melinda Liu Perkins, Murat Arcak", "title": "A Spatial Filtering Approach to Biological Patterning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interactions between neighboring cells are essential for generating or\nrefining patterns in a number of biological systems. We propose a discrete\nfiltering approach to predict how networks of cells modulate spatially varying\ninput signals to produce more complicated or precise output signals. The\ninterconnections between cells determine the set of spatial modes that are\namplified or suppressed based on the coupling and internal dynamics of each\ncell, analogously to the way a traditional digital filter modifies the\nfrequency components of a discrete signal. We apply the framework to two\nsystems in developmental biology: the Notch-Delta interaction that shapes\n\\textit{Drosophila} wing veins and the Sox9/Bmp/Wnt network responsible for\ndigit formation in vertebrate limbs. The latter case study demonstrates that\nTuring-like patterns may occur even in the absence of instabilities. Results\nalso indicate that developmental biological systems may be inherently robust to\nboth correlated and uncorrelated noise sources. Our work shows that a spatial\nfrequency-based interpretation simplifies the process of predicting patterning\nin living organisms when both environmental influences and intercellular\ninteractions are present.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2019 23:32:13 GMT"}], "update_date": "2019-02-14", "authors_parsed": [["Perkins", "Melinda Liu", ""], ["Arcak", "Murat", ""]]}, {"id": "1902.05621", "submitter": "Saeed Ranjbar", "authors": "Ali Esmaeili and Saeed Ranjbar", "title": "A Revision of the Bernoulli Equation as a Controller of the Fick's\n  Diffusion Equation in Drug Delivery Modeling", "comments": "5 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical equations can be used as effectual tools in drug delivery\nsystems modeling and are also highly helpful to have a theoretical\nunderstanding of controlled drug release and diffusion mechanisms. In this\nstudy we aim to present a mathematical combination between the Bernoulli\nequation and the Fick's equation as a diffusion controller in drug delivery\nsystems. For this propose we have revised the Bernoulli equation as an\nadditional, controller and complementary method of the Fick's diffusion\nequation to detect the optimal delivery direction to control the diffusion\ndivergence of the drug carrier in vascular systems during the transportation\nprocess in biological tissues. Therefore, by utilizing the Bernoulli equation\nwe could determine the real direction by the route function f.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2019 13:49:21 GMT"}], "update_date": "2019-02-18", "authors_parsed": [["Esmaeili", "Ali", ""], ["Ranjbar", "Saeed", ""]]}, {"id": "1902.06130", "submitter": "Diane Genest", "authors": "Diane Genest (LIGM), Marc L\\'eonard, Jean Cousty (LIGM), No\\'emie De\n  Croz\\'e (RCO), Hugues Talbot (LIGM)", "title": "Atlas-based automated detection of swim bladder in Medaka embryo", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV eess.IV q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fish embryo models are increasingly being used both for the assessment of\nchemicals efficacy and potential toxicity. This article proposes a methodology\nto automatically detect the swim bladder on 2D images of Medaka fish embryos\nseen either in dorsal view or in lateral view. After embryo segmentation and\nfor each studied orientation, the method builds an atlas of a healthy embryo.\nThis atlas is then used to define the region of interest and to guide the swim\nbladder segmentation with a discrete globally optimal active contour.\nDescriptors are subsequently designed from this segmentation. An automated\nrandom forest clas-sifier is built from these descriptors in order to classify\nembryos with and without a swim bladder. The proposed method is assessed on a\ndataset of 261 images, containing 202 embryos with a swim bladder (where 196\nare in dorsal view and 6 are in lateral view) and 59 without (where 43 are in\ndorsal view and 16 are in lateral view). We obtain an average precision rate of\n95% in the total dataset following 5-fold cross-validation.\n", "versions": [{"version": "v1", "created": "Sat, 16 Feb 2019 17:30:53 GMT"}], "update_date": "2019-02-19", "authors_parsed": [["Genest", "Diane", "", "LIGM"], ["Léonard", "Marc", "", "LIGM"], ["Cousty", "Jean", "", "LIGM"], ["De Crozé", "Noémie", "", "RCO"], ["Talbot", "Hugues", "", "LIGM"]]}, {"id": "1902.06250", "submitter": "Anna M. Hagenston Hertle", "authors": "Anna M. Hagenston, Sara Ben Ayed, Hilmar Bading", "title": "Afferent Fiber Activity-Induced Cytoplasmic Calcium Signaling in\n  Parvalbumin-Positive Inhibitory Interneurons of the Spinal Cord Dorsal Horn", "comments": "15 pages including 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Neuronal calcium (Ca2+) signaling represents a molecular trigger for diverse\ncentral nervous system adaptations and maladaptions. The altered function of\ndorsal spinal inhibitory interneurons is strongly implicated in the mechanisms\nunderlying central sensitization in chronic pain. Surprisingly little is known,\nhowever, about the characteristics and consequences of Ca2+ signaling in these\ncells, including whether and how they are changed following a peripheral insult\nor injury and how such alterations might influence maladaptive pain plasticity.\nAs a first step towards clarifying the precise role of Ca2+ signaling in dorsal\nspinal inhibitory neurons for central sensitization, we established methods for\ncharacterizing Ca2+ signals in genetically defined populations of these cells.\nIn particular, we employed recombinant adeno-associated viral vectors to\ndeliver subcellularly targeted, genetically encoded Ca2+ indicators into\nparvalbumin-positive spinal inhibitory neurons. Using wide-field microscopy, we\nobserved both spontaneous and afferent fiber activity triggered Ca2+ signals in\nthese cells. We propose that these methods may be adapted in future studies for\nthe precise characterization and manipulation of Ca2+ signaling in diverse\nspinal inhibitory neuron subtypes, thereby enabling the clarification of its\nrole in the mechanisms underlying pain chronicity and opening the door for\npossibly novel treatment directions.\n", "versions": [{"version": "v1", "created": "Sun, 17 Feb 2019 12:32:50 GMT"}], "update_date": "2019-02-19", "authors_parsed": [["Hagenston", "Anna M.", ""], ["Ayed", "Sara Ben", ""], ["Bading", "Hilmar", ""]]}, {"id": "1902.06947", "submitter": "Davide Riccobelli", "authors": "Davide Riccobelli, Davide Ambrosi", "title": "Activation of a muscle as a mapping of stress-strain curves", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mathematical modeling of the contraction of a muscle is a crucial problem\nin biomechanics. Several different models of muscle activation exist in\nliterature. A possible approach to contractility is the so-called active\nstrain: it is based on a multiplicative decomposition of the deformation\ngradient into an active contribution, accounting for the muscle activation, and\nan elastic one, due to the passive deformation of the body.\n  We show that the active strain approach does not allow to recover the\nexperimental stress-stretch curve corresponding to a uniaxial deformation of a\nskeletal muscle, whatever the functional form of the strain energy. To overcome\nsuch difficulty, we introduce an alternative model, that we call mixture active\nstrain approach, where the muscle is composed of two different solid phases and\nonly one of them actively contributes to the active behavior of the muscle.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2019 08:38:55 GMT"}], "update_date": "2019-02-20", "authors_parsed": [["Riccobelli", "Davide", ""], ["Ambrosi", "Davide", ""]]}, {"id": "1902.08578", "submitter": "Igor Chernyavsky L.", "authors": "Alexander Erlich, Gareth A. Nye, Paul Brownbill, Oliver E. Jensen,\n  Igor L. Chernyavsky", "title": "Quantifying the impact of tissue metabolism on solute transport in\n  feto-placental microvascular networks", "comments": null, "journal-ref": "Interface Focus 9 (2019) 20190021", "doi": "10.1098/rsfs.2019.0021", "report-no": null, "categories": "q-bio.TO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The primary exchange units in the human placenta are terminal villi, in which\nfetal capillary networks are surrounded by a thin layer of villous tissue,\nseparating fetal from maternal blood. To understand how the complex spatial\nstructure of villi influences their function, we use an image-based theoretical\nmodel to study the effect of tissue metabolism on the transport of solutes from\nmaternal blood into the fetal circulation. For solute that is taken up under\nfirst-order kinetics, we show that the transition between flow-limited and\ndiffusion-limited transport depends on two new dimensionless parameters defined\nin terms of key geometric quantities, with strong solute uptake promoting\nflow-limited transport conditions. We present a simple algebraic approximation\nfor solute uptake rate as a function of flow conditions, metabolic rate and\nvillous geometry. For oxygen, accounting for nonlinear kinetics using\nphysiological parameter values, our model predicts that villous metabolism does\nnot significantly impact oxygen transfer to fetal blood, although the\npartitioning of fluxes between the villous tissue and the capillary network\ndepends strongly on the flow regime.\n", "versions": [{"version": "v1", "created": "Fri, 22 Feb 2019 17:47:30 GMT"}, {"version": "v2", "created": "Mon, 15 Apr 2019 16:29:57 GMT"}, {"version": "v3", "created": "Tue, 21 May 2019 19:40:06 GMT"}], "update_date": "2019-09-12", "authors_parsed": [["Erlich", "Alexander", ""], ["Nye", "Gareth A.", ""], ["Brownbill", "Paul", ""], ["Jensen", "Oliver E.", ""], ["Chernyavsky", "Igor L.", ""]]}, {"id": "1902.08871", "submitter": "Ricard Alert", "authors": "Carlos P\\'erez-Gonz\\'alez, Ricard Alert, Carles Blanch-Mercader,\n  Manuel G\\'omez-Gonz\\'alez, Tomasz Kolodziej, Elsa Bazelli\\`eres, Jaume\n  Casademunt, Xavier Trepat", "title": "Active wetting of epithelial tissues", "comments": null, "journal-ref": "Nat. Phys. 15, 79 (2019)", "doi": "10.1038/s41567-018-0279-5", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Development, regeneration and cancer involve drastic transitions in tissue\nmorphology. In analogy with the behavior of inert fluids, some of these\ntransitions have been interpreted as wetting transitions. The validity and\nscope of this analogy are unclear, however, because the active cellular forces\nthat drive tissue wetting have been neither measured nor theoretically\naccounted for. Here we show that the transition between 2D epithelial\nmonolayers and 3D spheroidal aggregates can be understood as an active wetting\ntransition whose physics differs fundamentally from that of passive wetting\nphenomena. By combining an active polar fluid model with measurements of\nphysical forces as a function of tissue size, contractility, cell-cell and\ncell-substrate adhesion, and substrate stiffness, we show that the wetting\ntransition results from the competition between traction forces and contractile\nintercellular stresses. This competition defines a new intrinsic lengthscale\nthat gives rise to a critical size for the wetting transition in tissues, a\nstriking feature that has no counterpart in classical wetting. Finally, we show\nthat active shape fluctuations are dynamically amplified during tissue\ndewetting. Overall, we conclude that tissue spreading constitutes a prominent\nexample of active wetting --- a novel physical scenario that may explain\nmorphological transitions during tissue morphogenesis and tumor progression.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2019 01:17:30 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Pérez-González", "Carlos", ""], ["Alert", "Ricard", ""], ["Blanch-Mercader", "Carles", ""], ["Gómez-González", "Manuel", ""], ["Kolodziej", "Tomasz", ""], ["Bazellières", "Elsa", ""], ["Casademunt", "Jaume", ""], ["Trepat", "Xavier", ""]]}, {"id": "1902.09308", "submitter": "Paulo Cabrita Ph.D.", "authors": "Paulo Cabrita", "title": "Holocrine Secretion and Kino Flow in Angiosperms: Their Role and\n  Physiological Advantages in Plant Defence Mechanisms", "comments": "69 pages, 7 figures, 2 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Kinos are plant exudates, rich in polyphenols, produced by several\nangiosperms in reaction to damage. They flow out of kino veins,\nschizolysigenous ducts composing an anatomically distinct continuous system of\ntangentially anastomosing lacunae produced by the vascular cambium, which\nencircle the plant. Kino is secreted holocrinously into the vein lumen by a\ncambiform epithelium lined by suberized cells that separate kino veins from the\nsurrounding axial parenchyma. A model describing kino flow in eucalypts is\npresented to investigate how vein distribution and structure, as well as kino\nholocrine loading, crystallization, and viscosity affect flow. Considering\nviscosity, vein anatomy, and a time-dependent holocrine loading of kino, the\nunsteady Stokes equation was applied. Qualitatively, kino flow is similar to\nresin flow. There is an increase in flow towards the vein open end, and both\npressure and flow depend on vein dimensions, kino properties and holocrine\nloading. However, kino veins present a much smaller specific resistance to flow\ncompared to resin ducts. Also, unlike resin loading in conifers, holocrine kino\nloading is not pressure-driven. The pressure and pressure gradient required to\ndrive an equally fast flow are smaller than what is observed on the resin ducts\nof conifers. These results agree with previous observations on some angiosperms\nand suggest that holocrinous gum flow may have lower metabolic energy costs;\nthus presenting physiological advantages and possibly constituting an\nevolutionary step of angiosperms in using internal secretory systems in plant\ndefence mechanisms compared to resin flow in conifers. Understanding of how\nthese physiological and morphological parameters affect kino flow might be\nuseful for selecting species and developing more sustainable and economically\nviable methods of tapping gum and gum resin in angiosperms.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2019 13:08:19 GMT"}, {"version": "v2", "created": "Tue, 26 May 2020 17:12:07 GMT"}], "update_date": "2020-05-27", "authors_parsed": [["Cabrita", "Paulo", ""]]}, {"id": "1902.09921", "submitter": "Xiaoming Liu", "authors": "Xiaoming Liu, Michael D. Chan, Xiaobo Zhou, Xiaohua Qian", "title": "Transparency guided ensemble convolutional neural networks for\n  stratification of pseudoprogression and true progression of glioblastoma\n  multiform", "comments": "14 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pseudoprogression (PsP) is an imitation of true tumor progression (TTP) in\npatients with glioblastoma multiform (GBM). Differentiating them is a\nchallenging and time-consuming task for radiologists. Although deep neural\nnetworks can automatically diagnose PsP and TTP, interpretability shortage is\nalways the heel of Achilles. To overcome these shortcomings and win the trust\nof physician, we propose a transparency guided ensemble convolutional neural\nnetwork to automatically stratify PsP and TTP on magnetic resonance imaging\n(MRI). A total of 84 patients with GBM are enrolled in the study. First, three\ntypical convolutional neutral networks (CNNs) -- VGG, ResNet and DenseNet --\nare trained to distinguish PsP and TTP on the dataset. Subsequently, we use the\nclass-specific gradient information from convolutional layers to highlight the\nimportant regions in MRI. Radiological experts are then recruited to select the\nmost lesion-relevant layer of each CNN. Finally, the selected layers are\nutilized to guide the construction of multi-scale ensemble CNN. The classified\naccuracy of the presented network is 90.20%, the promotion of specificity\nreaches more than 20%. The results demonstrate that network transparency and\nensemble can enhance the reliability and accuracy of CNNs. The presented\nnetwork is promising for the diagnosis of PsP and TTP.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2019 13:29:44 GMT"}], "update_date": "2019-02-27", "authors_parsed": [["Liu", "Xiaoming", ""], ["Chan", "Michael D.", ""], ["Zhou", "Xiaobo", ""], ["Qian", "Xiaohua", ""]]}]