[{"id": "1907.01092", "submitter": "Dumitru Trucu", "authors": "Robyn Shuttleworth and Dumitru Trucu", "title": "Multiscale dynamics of a heterotypic cancer cell population within a\n  fibrous extracellular matrix", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Local cancer cell invasion is a complex process involving many cellular and\ntissue interactions and is an important prerequisite for metastatic spread, the\nmain cause of cancer related deaths. Occurring over many different temporal and\nspatial scales, the first stage of local invasion is the secretion of\nmatrix-degrading enzymes (MDEs) and the resulting degradation of the\nextra-cellular matrix (ECM). This process creates space in which the cells can\ninvade and thus enlarge the tumour. As a tumour increases in malignancy, the\ncancer cells adopt the ability to mutate into secondary cell subpopulations\ngiving rise to a heterogeneous tumour. This new cell subpopulation often\ncarries higher invasive qualities and permits a quicker spread of the tumour.\nBuilding upon the recent multiscale modelling framework for cancer invasion\nwithin a fibrous ECM introduced in Shuttleworth and Trucu (2019), in this paper\nwe consider the process of local invasion by a heterotypic tumour consisting of\ntwo cancer cell populations mixed with a two-phase ECM. To that end, we address\nthe double feedback link between the tissue-scale cancer dynamics and the\ncell-scale molecular processes through the development of a two-part modelling\nframework that crucially incorporates the multiscale dynamic redistribution of\noriented fibres occurring within a two-phase extra-cellular matrix and combines\nthis with the multiscale leading edge dynamics exploring key matrix-degrading\nenzymes molecular processes along the tumour interface that drive the movement\nof the cancer boundary. The modelling framework will be accompanied by\ncomputational results that explore the effects of the underlying fibre network\non the overall pattern of cancer invasion.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jul 2019 23:02:19 GMT"}], "update_date": "2019-07-03", "authors_parsed": [["Shuttleworth", "Robyn", ""], ["Trucu", "Dumitru", ""]]}, {"id": "1907.01575", "submitter": "Dumitru Trucu", "authors": "Robyn Shuttleworth and Dumitru Trucu", "title": "Cell-scale degradation of peritumoural extracellular matrix fibre\n  network and its role within tissue-scale cancer invasion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Local cancer invasion of tissue is a complex, multiscale process which plays\nan essential role in tumour progression. Occurring over many different temporal\nand spatial scales, the first stage of invasion is the secretion of matrix\ndegrading enzymes (MDEs) by the cancer cells that consequently degrade the\nsurrounding extracellular matrix (ECM). This process is vital for creating\nspace in which the cancer cells can progress and it is driven by the activities\nof specific matrix metalloproteinases (MMPs). In this paper, we consider the\nkey role of two MMPs by developing further the novel two-part multiscale model\nintroduced in [33] to better relate at micro-scale the two micro-scale\nactivities that were considered there, namely, the micro-dynamics concerning\nthe continuous rearrangement of the naturally oriented ECM fibres within the\nbulk of the tumour and MDEs proteolytic micro-dynamics that take place in an\nappropriate cell-scale neighbourhood of the tumour boundary. Focussing\nprimarily on the activities of the membrane-tethered MT1-MMP and the soluble\nMMP-2 with the fibrous ECM phase, in this work we investigate the MT1-MMP/MMP-2\ncascade and its overall effect on tumour progression. To that end, we will\npropose a new multiscale modelling framework by considering the degradation of\nthe ECM fibres not only to take place at macro-scale in the bulk of the tumour\nbut also explicitly in the micro-scale neighbourhood of the tumour interface as\na consequence of the interactions with molecular fluxes of MDEs that exercise\ntheir spatial dynamics at the invasive edge of the tumour.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jul 2019 18:21:42 GMT"}], "update_date": "2019-07-04", "authors_parsed": [["Shuttleworth", "Robyn", ""], ["Trucu", "Dumitru", ""]]}, {"id": "1907.02590", "submitter": "Herculano Martinho", "authors": "Erika T. Sato, Neila Machado, Daniele R. Ara\\'ujo, Luciana C. Paulino\n  and Herculano Martinho", "title": "An Atomistic First-Principles Density Functional Theory Model for Single\n  Layer Dry \\textit{Stratum Corneum}", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many questions concerning the biophysical and physiological properties of\nskin are still open. Skin aging, permeability, dermal absorption, hydration and\ndrug transdermal delivery, are few examples of processes with its underlying\nmechanisms unveiled. In this work we present a first-principles density\nfunctional quantum atomistic model for single layer stratum corneum (SC) in\norder to contribute to unveil the molecular interactions behind the skin\nproperties at this scale. The molecular structure of SC was modeled by an\narchetype of its hygroscopic proteic portion inside of the corneocytes, the\nnatural moisturizing factor (NMF), coupled to glycerol molecules which\nrepresent the lipid fraction of SC. The vibrational spectra was calculated and\ncompared to Fourier-Transform Infrared Absorption spectroscopy (FTIR)\nexperimental data obtained on animal model of SC. We noticed that bands in the\nfingerprint region (800-1800 cm$^{-1}$) were correctly assigned. Moreover, our\ncalculations revealed the existence of two coupled vibration between hydroxyl\ngroup of lipid and NMF methylene (1120 and 1160 cm$^{-1}$), which are of\nspecial interest since they probe the lipid-amino acid coupling. The model was\nalso able to predict the shear modulus of dry SC in excellent agreement with\nthe reported value on literature. Others physical/chemical properties could be\ncalculated exploring the chemical accuracy and molecular resolution of our\nmodel. Research in dermatology, cosmetology, and biomedical engineering in the\nspecific topics of drug delivery and/or mechanical properties of skin are\nexamples of fields that would potentially take advantage of our approach.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jul 2019 20:57:32 GMT"}], "update_date": "2019-07-08", "authors_parsed": [["Sato", "Erika T.", ""], ["Machado", "Neila", ""], ["Araújo", "Daniele R.", ""], ["Paulino", "Luciana C.", ""], ["Martinho", "Herculano", ""]]}, {"id": "1907.02730", "submitter": "Koh Onimaru", "authors": "Koh Onimaru, Luciano Marcon", "title": "Systems biology approach to the origin of the tetrapod limb", "comments": "22 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  It is still not understood how similar genomic sequences have generated\ndiverse and spectacular forms during evolution. The difficulty to bridge\nphenotypes and genotypes stems from the complexity of multicellular systems,\nwhere thousands of genes and cells interact with each other providing\ndevelopmental non-linearity. To understand how diverse morphologies have\nevolved, it is essential to find ways to handle such complex systems. Here, we\nreview the fin-to-limb transition as a case study for the evolution of\nmulticellular systems. We first describe the historical perspective of\ncomparative studies between fins and limbs. Second, we introduce our approach\nthat combines mechanistic theory, computational modeling, and in vivo\nexperiments to provide a mechanical explanation for the morphological\ndifference between fish fins and tetrapod limbs. This approach helps resolve a\nlong-standing debate about anatomical homology between the skeletal elements of\nfins and limbs. We will conclude by proposing that due to the counter-intuitive\ndynamics of gene interactions, integrative approaches that combine computer\nmodeling, theory and experiments are essential to understand the evolution of\nmulticellular organisms.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jul 2019 09:03:15 GMT"}], "update_date": "2019-07-08", "authors_parsed": [["Onimaru", "Koh", ""], ["Marcon", "Luciano", ""]]}, {"id": "1907.02842", "submitter": "Tommaso Lorenzi", "authors": "Tommaso Lorenzi, Anna Marciniak-Czochra, Thomas Stiehl", "title": "A structured population model of clonal selection in acute leukemias\n  with multiple maturation stages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent progress in genetic techniques has shed light on the complex\nco-evolution of malignant cell clones in leukemias. However, several aspects of\nclonal selection still remain unclear. In this paper, we present a\nmulti-compartmental continuously structured population model of selection\ndynamics in acute leukemias, which consists of a system of coupled\nintegro-differential equations. Our model can be analysed in a more efficient\nway than classical models formulated in terms of ordinary differential\nequations. Exploiting the analytical tractability of this model, we investigate\nhow clonal selection is shaped by the self-renewal fraction and the\nproliferation rate of leukemic cells at different maturation stages. We\nintegrate analytical results with numerical solutions of a calibrated version\nof the model based on real patient data. In summary, our mathematical results\nformalise the biological notion that clonal selection is driven by the\nself-renewal fraction of leukemic stem cells and the clones that possess the\nhighest value of this parameter are ultimately selected. Moreover, we\ndemonstrate that the self-renewal fraction and the proliferation rate of\nnon-stem cells do not have a substantial impact on clonal selection. Taken\ntogether, our results indicate that interclonal variability in the self-renewal\nfraction of leukemic stem cells provides the necessary substrate for clonal\nselection to act upon.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jul 2019 14:11:08 GMT"}], "update_date": "2019-07-08", "authors_parsed": [["Lorenzi", "Tommaso", ""], ["Marciniak-Czochra", "Anna", ""], ["Stiehl", "Thomas", ""]]}, {"id": "1907.03005", "submitter": "Japan Patel", "authors": "Japan K. Patel, John J. Kuczek, and Richard Vasques", "title": "One-Way Coupled Tumor Response Model for\n  Combined-Hyperthermia-Radiotherapy Treatment with Anisotropic Scattering", "comments": "4 pages, 2 figures, submitted to ANS Winter Meeting and Expo. arXiv\n  admin note: substantial text overlap with arXiv:1905.10441", "journal-ref": "Transactions of the American Nuclear Society 121 (2019), 65-68", "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Therapies such as combined-hyperthermia-radiotherapy (CHR) take advantage of\nexcellent radiosensitization properties of hyperthermia and treat of tumors\nwith both radiation and heat. To appropriately model a CHR treatment, features\nlike tumor heating (heat transfer), dosimetry (radiation transport), and tumor\ndynamics (cell population dynamics) must be considered together. Our first\npaper on modeling such treatments introduced a one-way coupled model that could\nonly account for isotropic scattering of radiation. In the present work, we\nextend our transport model to incorporate anisotropic scattering.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jul 2019 18:47:33 GMT"}], "update_date": "2020-05-14", "authors_parsed": [["Patel", "Japan K.", ""], ["Kuczek", "John J.", ""], ["Vasques", "Richard", ""]]}, {"id": "1907.05195", "submitter": "Stephen Odaibo", "authors": "Stephen G. Odaibo", "title": "retina-VAE: Variationally Decoding the Spectrum of Macular Disease", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.LG q-bio.TO stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we seek a clinically-relevant latent code for representing the\nspectrum of macular disease. Towards this end, we construct retina-VAE, a\nvariational autoencoder-based model that accepts a patient profile vector\n(pVec) as input. The pVec components include clinical exam findings and\ndemographic information. We evaluate the model on a subspectrum of the retinal\nmaculopathies, in particular, exudative age-related macular degeneration,\ncentral serous chorioretinopathy, and polypoidal choroidal vasculopathy. For\nthese three maculopathies, a database of 3000 6-dimensional pVecs (1000 each)\nwas synthetically generated based on known disease statistics in the\nliterature. The database was then used to train the VAE and generate latent\nvector representations. We found training performance to be best for a\n3-dimensional latent vector architecture compared to 2 or 4 dimensional\nlatents. Additionally, for the 3D latent architecture, we discovered that the\nresulting latent vectors were strongly clustered spontaneously into one of 14\nclusters. Kmeans was then used only to identify members of each cluster and to\ninspect cluster properties. These clusters suggest underlying disease subtypes\nwhich may potentially respond better or worse to particular pharmaceutical\ntreatments such as anti-vascular endothelial growth factor variants. The\nretina-VAE framework will potentially yield new fundamental insights into the\nmechanisms and manifestations of disease. And will potentially facilitate the\ndevelopment of personalized pharmaceuticals and gene therapies.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jul 2019 13:49:25 GMT"}], "update_date": "2019-07-12", "authors_parsed": [["Odaibo", "Stephen G.", ""]]}, {"id": "1907.06124", "submitter": "Miguel Martin-Landrove", "authors": "Miguel Mart\\'in-Landrove, Francisco Torres-Hoyos and Antonio\n  Rueda-Toicen", "title": "Complexity of Brain Tumors", "comments": "11 pages, 2 columns, 9 figures", "journal-ref": null, "doi": "10.1016/j.physa.2019.122696", "report-no": null, "categories": "q-bio.TO physics.bio-ph physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tumor growth is a complex process characterized by uncontrolled cell\nproliferation and invasion of neighboring tissues. The understanding of these\nphenomena is of vital importance to establish appropriate diagnosis and\ntherapeutic strategy and starts with the evaluation of their complexity with\nsuitable descriptors, such as those produced by scaling analysis. In the\npresent work, scaling analysis is used for the extraction of dynamic parameters\nthat characterize tumor growth processes in brain tumors. The emphasis in the\nanalysis is on the assessment of general properties of tumor growth, such as\nthe Family-Vicsek ansatz, which includes a great variety of ballistic growth\nmodels. Results indicate in a definitive way that gliomas strictly behave as it\nis proposed by the ansatz, while benign tumors behave quite differently. As a\ncomplementary view, complex visibility networks derived from the tumor\ninterface support these results and its use is introduced as a possible\ndescriptor in the understanding of tumor growth dynamics.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jul 2019 20:28:38 GMT"}, {"version": "v2", "created": "Wed, 17 Jul 2019 03:27:55 GMT"}], "update_date": "2019-10-23", "authors_parsed": [["Martín-Landrove", "Miguel", ""], ["Torres-Hoyos", "Francisco", ""], ["Rueda-Toicen", "Antonio", ""]]}, {"id": "1907.06564", "submitter": "Shashank Subramanian", "authors": "Shashank Subramanian, Klaudius Scheufele, Miriam Mehl, George Biros", "title": "Where did the tumor start? An inverse solver with sparse localization\n  for tumor growth models", "comments": "24 pages, 8 figures", "journal-ref": null, "doi": "10.1088/1361-6420/ab649c", "report-no": null, "categories": "physics.med-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a numerical scheme for solving an inverse problem for parameter\nestimation in tumor growth models for glioblastomas, a form of aggressive\nprimary brain tumor. The growth model is a reaction-diffusion partial\ndifferential equation (PDE) for the tumor concentration. We use a\nPDE-constrained optimization formulation for the inverse problem. The unknown\nparameters are the reaction coefficient (proliferation), the diffusion\ncoefficient (infiltration), and the initial condition field for the tumor PDE.\nSegmentation of Magnetic Resonance Imaging (MRI) scans from a single time\nsnapshot drive the inverse problem where segmented tumor regions serve as\npartial observations of the tumor concentration. The precise time relative to\ntumor initiation is unknown, which poses an additional difficulty for\ninversion. We perform a frozen-coefficient spectral analysis and show that the\ninverse problem is severely ill-posed. We introduce a biophysically motivated\nregularization on the tumor initial condition. In particular, we assume that\nthe tumor starts at a few locations (enforced with a sparsity constraint) and\nthat the initial condition magnitude in the maximum norm equals one. We solve\nthe resulting optimization problem using an inexact quasi-Newton method\ncombined with a compressive sampling algorithm for the sparsity constraint. Our\nimplementation uses PETSc and AccFFT libraries. We conduct numerical\nexperiments on synthetic and clinical images to highlight the improved\nperformance of our solver over an existing solver that uses a two-norm\nregularization for the calibration parameters. The existing solver is unable to\nlocalize the initial condition. Our new solver can localize the initial\ncondition and recover infiltration and proliferation. In clinical datasets (for\nwhich the ground truth is unknown), our solver results in qualitatively\ndifferent solutions compared to the existing solver.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jul 2019 16:09:26 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Subramanian", "Shashank", ""], ["Scheufele", "Klaudius", ""], ["Mehl", "Miriam", ""], ["Biros", "George", ""]]}, {"id": "1907.06590", "submitter": "Vanessa Styles", "authors": "Joe Eyles, John F. King and Vanessa Styles", "title": "A tractable mathematical model for tissue growth", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using formal asymptotic methods we derive a free boundary problem\nrepresenting one of the simplest mathematical descriptions of the growth and\ndeath of a tumour or other biological tissue. The mathematical model takes the\nform of a closed interface evolving via forced mean curvature flow (together\nwith a `kinetic under-cooling' regularisation) where the forcing depends on the\nsolution of a PDE that holds in the domain enclosed by the interface. We\nperform linear stability analysis and derive a diffuse-interface approximation\nof the model. Finite-element discretisations of two closely related models are\npresented, together with computational results comparing the approximate\nsolutions.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jul 2019 11:41:23 GMT"}], "update_date": "2019-07-16", "authors_parsed": [["Eyles", "Joe", ""], ["King", "John F.", ""], ["Styles", "Vanessa", ""]]}, {"id": "1907.08277", "submitter": "Soroush Irandoust", "authors": "Soroush Irandoust and Sinan Muftu", "title": "The interplay between tissue healing and bone remodeling around\n  immediately loaded tooth replacement implants", "comments": null, "journal-ref": null, "doi": "10.1038/s41598-020-60735-7", "report-no": null, "categories": "q-bio.TO physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Long-term bone healing/adaptation after a dental implant treatment starts\nwith diffusion of mesenchymal stem cells to the fracture callus and their\nsubsequent differentiation. The healing phase is followed by the\nbone-remodeling phase. In this work, a mechano-regulatory cellular\ndifferentiation model was used to simulate tissue healing around an immediately\nloaded dental implant. All tissue types were modeled as poroelastic in the\nhealing phase. Material properties of the healing region were updated after\neach loading cycle for 30 cycles (days). The tissue distribution in the healed\nstate was then used as the initial condition for the remodeling phase during\nwhich regions healed into bone adapt their internal density with respect to a\nhomeostatic remodeling stimulus. The short- and long-term effects of\nmicro-motion on bone healing and remodeling were studied. Development of soft\ntissue was observed both in the coronal region due to high fluid velocity, and\non the vertical sides of the healing-callus due to high shear stress. In cases\nwith small implant micromotion, tissue between the implant threads\ndifferentiated into bone during the healing phase, but resorbed during\nremodeling. In cases with large implant micromotion, higher percentage of the\nhealing region differentiated into soft tissue resulting in less volume\navailable for bone remodeling. But, the remaining bone region developed higher\ndensity bone tissue. It was concluded that an optimal range of controlled\nmicromotion could be designed for a given implant in order to achieve the\ndesired functional properties.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jul 2019 20:45:39 GMT"}], "update_date": "2020-11-25", "authors_parsed": [["Irandoust", "Soroush", ""], ["Muftu", "Sinan", ""]]}, {"id": "1907.08711", "submitter": "Bernadette Stolz", "authors": "Helen M Byrne, Heather A Harrington, Ruth Muschel, Gesine Reinert,\n  Bernadette J Stolz, Ulrike Tillmann", "title": "Topological Methods for Characterising Spatial Networks: A Case Study in\n  Tumour Vasculature", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM math.AT math.DS q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding how the spatial structure of blood vessel networks relates to\ntheir function in healthy and abnormal biological tissues could improve\ndiagnosis and treatment for diseases such as cancer. New imaging techniques can\ngenerate multiple, high-resolution images of the same tissue region, and show\nhow vessel networks evolve during disease onset and treatment. Such\nexperimental advances have created an exciting opportunity for discovering new\nlinks between vessel structure and disease through the development of\nmathematical tools that can analyse these rich datasets. Here we explain how\ntopological data analysis (TDA) can be used to study vessel network structures.\nTDA is a growing field in the mathematical and computational sciences, that\nconsists of algorithmic methods for identifying global and multi-scale\nstructures in high-dimensional data sets that may be noisy and incomplete. TDA\nhas identified the effect of ageing on vessel networks in the brain and more\nrecently proposed to study blood flow and stenosis. Here we present preliminary\nwork which shows how TDA of spatial network structure can be used to\ncharacterise tumour vasculature.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jul 2019 22:21:21 GMT"}], "update_date": "2019-07-23", "authors_parsed": [["Byrne", "Helen M", ""], ["Harrington", "Heather A", ""], ["Muschel", "Ruth", ""], ["Reinert", "Gesine", ""], ["Stolz", "Bernadette J", ""], ["Tillmann", "Ulrike", ""]]}, {"id": "1907.09551", "submitter": "Stuart Newman", "authors": "Stuart A. Newman", "title": "Cell differentiation: what have we learned in 50 years?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I revisit two theories of cell differentiation in multicellular organisms\npublished a half-century ago, Stuart Kauffman's global gene regulatory dynamics\n(GGRD) model and Roy Britten's and Eric Davidson's modular gene regulatory\nnetwork (MGRN) model, in light of newer knowledge of mechanisms of gene\nregulation in the metazoans (animals). The two models continue to inform\nhypotheses and computational studies of differentiation of lineage-adjacent\ncell types. However, their shared notion (based on bacterial regulatory\nsystems) of gene switches and networks built from them, have constrained\nprogress in understanding the dynamics and evolution of differentiation. Recent\nwork has described unique write-read-rewrite chromatin-based expression\nencoding in eukaryotes, as well metazoan-specific processes of gene activation\nand silencing in condensed-phase, enhancer-recruiting regulatory hubs,\nemploying disordered proteins, including transcription factors, with\ncontext-dependent identities. These findings suggest an evolutionary scenario\nin which the origination of differentiation in animals, rather than depending\nexclusively on adaptive natural selection, emerged as a consequence of a type\nof multicellularity in which the novel metazoan gene regulatory apparatus was\nreadily mobilized to amplify and exaggerate inherent cell functions of\nunicellular ancestors. The plausibility of this hypothesis is illustrated by\nthe evolution of the developmental role of Grainyhead-like in the formation of\nepithelium.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jul 2019 20:10:19 GMT"}, {"version": "v2", "created": "Fri, 6 Sep 2019 20:08:20 GMT"}], "update_date": "2019-09-10", "authors_parsed": [["Newman", "Stuart A.", ""]]}, {"id": "1907.10319", "submitter": "Jean-Leon Maitre", "authors": "Markus Schliffka, Jean-L\\'eon Ma\\^itre", "title": "Stay hydrated: Basolateral fluids shaping tissues", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During development, embryos perform a mesmerizing choreography, which is\ncrucial for the correct shaping, positioning and function of all organs. The\ncellular properties powering animal morphogenesis have been the focus of much\nattention. On the other hand, much less consideration has been given to the\ninvisible engine constituted by the intercellular fluid. Cells are immersed in\nfluid, of which the composition and physical properties have a considerable\nimpact on development. In this review, we revisit recent studies from the\nperspective of the fluid, focusing on basolateral fluid compartments and taking\nthe early mouse and zebrafish embryos as models. These examples illustrate how\nthe hydration levels of tissues are spatio-temporally controlled and influence\nembryonic development.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2019 09:18:35 GMT"}], "update_date": "2019-07-25", "authors_parsed": [["Schliffka", "Markus", ""], ["Maître", "Jean-Léon", ""]]}, {"id": "1907.10452", "submitter": "Pierluigi Colli", "authors": "Pierluigi Colli, Gianni Gilardi, J\\\"urgen Sprekels", "title": "A distributed control problem for a fractional tumor growth model", "comments": "35 pages. Key words: Fractional operators, Cahn-Hilliard systems,\n  well-posedness, regularity, optimal control, necessary optimality conditions", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the authors study the distributed optimal control of a system\nof three evolutionary equations involving fractional powers of three\nselfadjoint, monotone, unbounded linear operators having compact resolvents.\nThe system is a generalization of a Cahn-Hilliard type phase field system\nmodeling tumor growth that goes back to Hawkins-Daarud et al. (Int. J. Numer.\nMath. Biomed. Eng. 28 (2012), 3-24). The aim of the control process, which\ncould be realized by either administering a drug or monitoring the nutrition,\nis to keep the tumor cell fraction under control while avoiding possible harm\nfor the patient. In contrast to previous studies, in which the occurring\nunbounded operators governing the diffusional regimes were all given by the\nLaplacian with zero Neumann boundary conditions, the operators may in our case\nbe different; more generally, we consider systems with fractional powers of the\ntype that were studied in the recent work Adv. Math. Sci. Appl. 28 (2019),\n343-375 (see arXiv:1906.10874), by the present authors. In the analysis, the\nFr\\'echet differentiability of the associated control-to-state operator is\nshown, by also establishing the existence of solutions to the associated\nadjoint system, and deriving the first-order necessary conditions of optimality\nfor a cost functional of tracking type.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2019 13:57:55 GMT"}], "update_date": "2019-07-25", "authors_parsed": [["Colli", "Pierluigi", ""], ["Gilardi", "Gianni", ""], ["Sprekels", "Jürgen", ""]]}, {"id": "1907.11178", "submitter": "Andr\\'es Dolinko", "authors": "Maria Fernanda DJonsiles, Gustavo Ernesto Galizzi, Andres Ezequiel\n  Dolinko, Mar\\'ia Victoria Novas, Esteban Ceriani Nakamurakare and Cecilia\n  Cristina Carmar\\'an", "title": "Optical study of laser biospeckle activity in leaves of Jatropha curcas\n  L. A noninvasive analysis of foliar endophyte colonization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.bio-ph physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently, the detection of endophytic fungi is determined mostly by invasive\nmethods, including direct isolation of fungal organismsfrom plant tissue in\ngrowth media, molecular detection of endophyticfungi DNA from plant material by\nPCR, or evaluation under microscopy techniques.In this work we explore the\npotential of laser biospeckle activity (LBSA) to be usedfor the detection of\nendophytic colonization of leaves of a promising energy crop, Jatropha curcas\nL. We compared the laser biospeckle activityof endophyte infected and\nuninfected J. curcas leaves. The differences between blade and veins (including\nmidrib) of the studied leaves was validated and growth parameters of the\nstudied plants were also analyzed using the normalized weigthed generalized\ndifferencescoefficient (nWGD). The obtained results showeda relationship\nbetween the endophytic burden of leaves and the LBS, suggesting that LSBA is a\nuseful tools to detect endophytic colonization in situ.Also, the increasedwater\nmovements inside leaves promoted by endophytic colonizationcould be explainby\nthe obtained data.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jul 2019 16:38:54 GMT"}], "update_date": "2019-07-26", "authors_parsed": [["DJonsiles", "Maria Fernanda", ""], ["Galizzi", "Gustavo Ernesto", ""], ["Dolinko", "Andres Ezequiel", ""], ["Novas", "María Victoria", ""], ["Nakamurakare", "Esteban Ceriani", ""], ["Carmarán", "Cecilia Cristina", ""]]}, {"id": "1907.11618", "submitter": "Guillermo Lorenzo", "authors": "Pierluigi Colli, Hector Gomez, Guillermo Lorenzo, Gabriela Marinoschi,\n  Alessandro Reali, and Elisabetta Rocca", "title": "Mathematical analysis and simulation study of a phase-field model of\n  prostate cancer growth with chemotherapy and antiangiogenic therapy effects", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP cs.CE q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cytotoxic chemotherapy is a common treatment for advanced prostate cancer.\nThese tumors are also known to rely on angiogenesis, i.e., the growth of local\nmicrovasculature via chemical signaling produced by the tumor. Thus, several\nclinical studies have been investigating antiangiogenic therapy for advanced\nprostate cancer, either as monotherapy or combined with standard cytotoxic\nprotocols. However, the complex genetic alterations promoting prostate cancer\ngrowth complicate the selection of the best chemotherapeutic approach for each\npatient's tumor. Here, we present a mathematical model of prostate cancer\ngrowth and chemotherapy that may enable physicians to test and design\npersonalized chemotherapeutic protocols in silico. We use the phase-field\nmethod to describe tumor growth, which we assume to be driven by a generic\nnutrient following reaction-diffusion dynamics. Tumor proliferation and\napoptosis (i.e., programmed cell death) can be parameterized with\nexperimentally-determined values. Cytotoxic chemotherapy is included as a term\ndownregulating tumor net proliferation, while antiangiogenic therapy is modeled\nas a reduction in intratumoral nutrient supply. Another equation couples the\ntumor phase field with the production of prostate-specific antigen, which is an\nextensively used prostate cancer biomarker. We prove the well-posedness of our\nmodel and we run a series of representative simulations using an isogeometric\nmethod to explore untreated tumor growth as well as the effects of cytotoxic\nchemotherapy and antiangiogenic therapy, both alone and combined. Our\nsimulations show that our model captures the growth morphologies of prostate\ncancer as well as common outcomes of cytotoxic and antiangiogenic mono and\ncombined therapy. Our model also reproduces the usual temporal trends in tumor\nvolume and prostate-specific antigen evolution observed in previous studies.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jul 2019 15:20:17 GMT"}], "update_date": "2019-07-29", "authors_parsed": [["Colli", "Pierluigi", ""], ["Gomez", "Hector", ""], ["Lorenzo", "Guillermo", ""], ["Marinoschi", "Gabriela", ""], ["Reali", "Alessandro", ""], ["Rocca", "Elisabetta", ""]]}, {"id": "1907.12975", "submitter": "Florian Kromp Dipl. Ing.", "authors": "Florian Kromp, Lukas Fischer, Eva Bozsaky, Inge Ambros, Wolfgang\n  Doerr, Sabine Taschner-Mandl, Peter Ambros, Allan Hanbury", "title": "Deep Learning architectures for generalized immunofluorescence based\n  nuclear image segmentation", "comments": "10 pages + 3 supplementary pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV q-bio.TO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Separating and labeling each instance of a nucleus (instance-aware\nsegmentation) is the key challenge in segmenting single cell nuclei on\nfluorescence microscopy images. Deep Neural Networks can learn the implicit\ntransformation of a nuclear image into a probability map indicating the class\nmembership of each pixel (nucleus or background), but the use of\npost-processing steps to turn the probability map into a labeled object mask is\nerror-prone. This especially accounts for nuclear images of tissue sections and\nnuclear images across varying tissue preparations. In this work, we aim to\nevaluate the performance of state-of-the-art deep learning architectures to\nsegment nuclei in fluorescence images of various tissue origins and sample\npreparation types without post-processing. We compare architectures that\noperate on pixel to pixel translation and an architecture that operates on\nobject detection and subsequent locally applied segmentation. In addition, we\npropose a novel strategy to create artificial images to extend the training\nset. We evaluate the influence of ground truth annotation quality, image scale\nand segmentation complexity on segmentation performance. Results show that\nthree out of four deep learning architectures (U-Net, U-Net with ResNet34\nbackbone, Mask R-CNN) can segment fluorescent nuclear images on most of the\nsample preparation types and tissue origins with satisfactory segmentation\nperformance. Mask R-CNN, an architecture designed to address instance aware\nsegmentation tasks, outperforms other architectures. Equal nuclear mean size,\nconsistent nuclear annotations and the use of artificially generated images\nresult in overall acceptable precision and recall across different tissues and\nsample preparation types.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2019 14:23:29 GMT"}], "update_date": "2019-07-31", "authors_parsed": [["Kromp", "Florian", ""], ["Fischer", "Lukas", ""], ["Bozsaky", "Eva", ""], ["Ambros", "Inge", ""], ["Doerr", "Wolfgang", ""], ["Taschner-Mandl", "Sabine", ""], ["Ambros", "Peter", ""], ["Hanbury", "Allan", ""]]}]