[{"id": "2004.01020", "submitter": "Lucas Da Costa Campos", "authors": "Lucas da Costa Campos, Raphael Hornung, Gerhard Gompper, Jens Elgeti,\n  Svenja Caspers", "title": "The role of thickness inhomogeneities in hierarchical cortical folding", "comments": "13 pages,10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.TO", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  For long it has been known that specific patterns of folding are necessary\nfor an optimally functioning brain. For instance, lissencephaly and\npolymicrogyria can lead to severe mental retardation, short life expectancy,\nepileptic seizures, and tetraplegia. The construction of a quantitative model\non how and why these folds appear is the first step in understanding the cause\nof these conditions. In recent years, there have been various attempts to\nunderstand and model the mechanisms of brain folding. Previous works have shown\nthat mechanical instabilities play a crucial role in the formation of brain\nfolds, and that the geometry of the fetal brain is one of the main factors in\ndictating the folding characteristics. However, modeling higher-order folding,\none of the main characteristics of the human brain, has not been fully tackled.\nThe effects of thickness inhomogeneity in the gyrogenesis of the mammalian\nbrain are studied through finite-element simulations of rectangular slabs. The\nslabs are divided into two distinct regions, where the outer layer mimics the\ngray matter, and the inner layer the underlying white matter. Differential\ngrowth is introduced by only growing the top layer. The brain tissue is modeled\nas a neo-Hookean hyperelastic material. Simulations are performed with both,\nhomogeneous and inhomogeneous cortical thickness. The homogeneous cortex is\nshown to fold into a single wavelength, as common for bilayered materials,\nwhile the inhomogeneous cortex folds into more complex conformations: In their\nearly stages of development, structures reminiscent of the deep sulci in the\nbrain are obtained. As the cortex continues to develop, secondary undulations,\nwhich are shallower and more variable than the structures obtained in earlier\ngyrification stage emerge, reproducing well-known characteristics of\nhigher-order folding in the mammalian, and particularly the human, brain.\n", "versions": [{"version": "v1", "created": "Thu, 2 Apr 2020 14:24:52 GMT"}], "update_date": "2020-04-03", "authors_parsed": [["Campos", "Lucas da Costa", ""], ["Hornung", "Raphael", ""], ["Gompper", "Gerhard", ""], ["Elgeti", "Jens", ""], ["Caspers", "Svenja", ""]]}, {"id": "2004.01399", "submitter": "Irina Mizeva", "authors": "Andrey Shmyrov, Alexey Mizev, Irina Mizeva and Anastasia Shmyrova", "title": "Electrostatic precipitation of exhaled particles for tensiometric\n  examination of pulmonary surfactant", "comments": "19 pages, 6 figures, submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objective: Collecting exhaled particles that represent small droplets of the\nalveolar lining fluid shows great promise as a tool for pulmonary surfactant\n(PS) sampling. For this purpose, we present a setup consisting of two modules,\nnamely, a module for droplet collecting, called an electrostatic aerosol\ntrapping (ESAT) system, and a measurement module for studying PS properties. We\nsuggest the way how to extract numerical values from the experimental data\nassociated with PS properties.\n  Methods: The operating principle of ESAT is based on the electrostatic\nprecipitation of exhaled particles. The native material was collected directly\non the water surface, where an accumulated adsorbed film of PS was examined\nwith tensiometric method. The modified capillary waves method adapted to study\nsmall volume samples was utilized. The efficiency of the setup was verified in\nthe experiments with healthy subjects.\n  Conclusion: The accumulation of PS components on the water surface in an\namount sufficient for tensiometric study was reported. It was shown how to\nextract the numerical values from the experimental data characterizing PS\nproperties.\n  Significance: The idea underlying the new concept used in this study may give\nimpetus to further development of point-of-care facilities for collecting PS\nsamples and for their express analysis.\n", "versions": [{"version": "v1", "created": "Fri, 3 Apr 2020 06:55:55 GMT"}], "update_date": "2020-04-06", "authors_parsed": [["Shmyrov", "Andrey", ""], ["Mizev", "Alexey", ""], ["Mizeva", "Irina", ""], ["Shmyrova", "Anastasia", ""]]}, {"id": "2004.04935", "submitter": "Deepak Modi", "authors": "Stacy Colaco, Karisma Chhabria, Domdatt Singh, Anshul Bhide, Neha\n  Singh, Abhishek Singh, Atahar Husein, Anuradha Mishra, Richa Sharma, Nancy\n  Ashary, Deepak Modi", "title": "A single-cell RNA expression map of coronavirus receptors and associated\n  factors in developing human embryos", "comments": "33 pages, 6 main figures, 3 main table, 2 supplementary figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To predict if developing human embryos are permissive to coronaviruses, we\nanalyzed publicly available single cell RNA-seq datasets of zygotes, 4-cell,\n8-cell, morula, inner cell mass, epiblast, primitive endoderm and trophectoderm\nfor the coronavirus receptors (ACE2, BSG, DPP4 and ANPEP), the Spike protein\ncleavage enzymes (TMPRSS2, CTSL). We also analyzed the presence of host genes\ninvolved in viral replication, the endosomal sorting complexes required for\ntransport (ESCRT) and SARS-Cov-2 interactions. The results reveal that ACE2,\nBSG, DPP4 and ANPEP are expressed in the cells of the zygote, to blastocyst\nincluding the trophectodermal lineage. ACE2, TMPRSS, BSG and CTSL are\nco-transcribed in a proportion of epiblast cells and most cells of the\ntrophectoderm. The embryonic and trophectodermal cells also express genes for\nproteins ESCRT, viral replication and those that interact with SARS-CoV-2. We\nidentified 1985 genes in epiblast and 1452 genes in the trophectoderm that are\nenriched in the ACE2 and TMPRSS2 co-expressing cells; 216 genes of these are\ncommon in both the cell types. These genes are associated with lipid\nmetabolism, lysosome, peroxisome and oxidative phosphorylation pathways.\nTogether our results suggest that developing human embryos could be permissive\nto coronavirus entry by both canonical and non-canonical mechanisms and they\nalso express the genes for proteins involved in viral endocytosis and\nreplication. This knowledge will be useful for evidence-based patient\nmanagement for IVF during the COVID-19 pandemic.\n", "versions": [{"version": "v1", "created": "Fri, 10 Apr 2020 08:02:33 GMT"}, {"version": "v2", "created": "Thu, 23 Jul 2020 20:18:09 GMT"}], "update_date": "2020-07-27", "authors_parsed": [["Colaco", "Stacy", ""], ["Chhabria", "Karisma", ""], ["Singh", "Domdatt", ""], ["Bhide", "Anshul", ""], ["Singh", "Neha", ""], ["Singh", "Abhishek", ""], ["Husein", "Atahar", ""], ["Mishra", "Anuradha", ""], ["Sharma", "Richa", ""], ["Ashary", "Nancy", ""], ["Modi", "Deepak", ""]]}, {"id": "2004.07342", "submitter": "Tahmineh Azizi", "authors": "Tahmineh Azizi, Robert Mugabi", "title": "Mathematical modeling of blood flow through arterial bifurcation", "comments": "9 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The blood vascular system consists of blood vessels such as arteries,\narterioles, capillaries and veins that convey blood throughout the body. The\npressure difference which exists between the ends of the vessels provides the\nliving force required to the flow of blood. In this study, we have used a model\nthat is appropriate for use with blood flow simulation applications. We study\nthe effect of decomposition of plaques and or tumour cells on the velocity\nprofile, pressure of the incompressible, Newtonian fluid. We consider two\ndifferent cases; vessels with bifurcation and without bifurcations and we\ndisplay all the results through using Commercial software COMSOL Multiphysics\n5.2.\n", "versions": [{"version": "v1", "created": "Tue, 31 Mar 2020 08:09:51 GMT"}, {"version": "v2", "created": "Mon, 20 Apr 2020 01:22:09 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Azizi", "Tahmineh", ""], ["Mugabi", "Robert", ""]]}, {"id": "2004.07549", "submitter": "Arik Yochelis", "authors": "Arik Yochelis", "title": "The nonlinear initiation of side--branching by\n  activator-inhibitor-substrate (Turing) morphogenesis", "comments": "7 pages, 5 figures", "journal-ref": "Chaos 31, 051102 (2021)", "doi": "10.1063/5.0050630", "report-no": null, "categories": "nlin.PS q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An understanding of the underlying mechanism of side--branching is paramount\nin controlling and/or therapeutically treating mammalian organs, such as lungs,\nkidneys, and glands. Motivated by an activator-inhibitor-substrate approach\nthat is conjectured to dominate the initiation of side--branching in pulmonary\nvascular pattern, I demonstrate a distinct transverse front instability in\nwhich new fingers grow out of an oscillatory breakup dynamics at the front\nline, without any typical length scale. These two features are attributed to\nunstable peak solutions in 1D that subcritically emanate from the Turing\nbifurcation and that exhibit repulsive interactions. The results are based on a\nbifurcation analysis and numerical simulations, and provide a potential\nstrategy toward developing a framework of side--branching also of other\nbiological systems, such as plant roots and cellular protrusions.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2020 09:33:32 GMT"}, {"version": "v2", "created": "Thu, 23 Apr 2020 19:43:34 GMT"}, {"version": "v3", "created": "Thu, 14 May 2020 17:25:46 GMT"}, {"version": "v4", "created": "Fri, 15 May 2020 15:51:50 GMT"}, {"version": "v5", "created": "Tue, 4 Aug 2020 13:24:11 GMT"}, {"version": "v6", "created": "Mon, 31 Aug 2020 18:41:51 GMT"}, {"version": "v7", "created": "Thu, 22 Apr 2021 05:41:31 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Yochelis", "Arik", ""]]}, {"id": "2004.07716", "submitter": "Nitish Nag", "authors": "Vaibhav Pandey, Nitish Nag, Ramesh Jain", "title": "Continuous Health Interface Event Retrieval", "comments": "ACM International Conference on Multimedia Retrieval 2020 (ICMR\n  2020), held in Dublin, Ireland from June 8-11, 2020", "journal-ref": "ICMR 2020: Proceedings of the 2020 International Conference on\n  Multimedia Retrieval, June 2020, Pages 486-494", "doi": "10.1145/3372278.3390705", "report-no": null, "categories": "cs.HC cs.CY q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Knowing the state of our health at every moment in time is critical for\nadvances in health science. Using data obtained outside an episodic clinical\nsetting is the first step towards building a continuous health estimation\nsystem. In this paper, we explore a system that allows users to combine events\nand data streams from different sources to retrieve complex biological events,\nsuch as cardiovascular volume overload. These complex events, which have been\nexplored in biomedical literature and which we call interface events, have a\ndirect causal impact on relevant biological systems. They are the interface\nthrough which the lifestyle events influence our health. We retrieve the\ninterface events from existing events and data streams by encoding domain\nknowledge using an event operator language.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2020 15:49:13 GMT"}], "update_date": "2020-06-24", "authors_parsed": [["Pandey", "Vaibhav", ""], ["Nag", "Nitish", ""], ["Jain", "Ramesh", ""]]}, {"id": "2004.08320", "submitter": "Vignayanandam Ravindernath Muddapu", "authors": "Vignayanandam R. Muddapu, Karthik Vijayakumar, Keerthiga Ramakrishnan,\n  V Srinivasa Chakravarthy", "title": "A Computational Model of Levodopa-Induced Toxicity in Substantia Nigra\n  Pars Compacta in Parkinson's Disease", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Parkinson's disease (PD) is caused by the progressive loss of dopaminergic\ncells in substantia nigra pars compacta (SNc). The root cause of this cell loss\nin PD is still not decisively elucidated. A recent line of thinking traces the\ncause of PD neurodegeneration to metabolic deficiency. Due to exceptionally\nhigh energy demand, SNc neurons exhibit a higher basal metabolic rate and\nhigher oxygen consumption rate, which results in oxidative stress. Recently, we\nhave suggested that the excitotoxic loss of SNc cells might be due to energy\ndeficiency occurring at different levels of neural hierarchy. Levodopa (LDOPA),\na precursor of dopamine, which is used as a symptom-relieving treatment for PD,\nleads to outcomes that are both positive and negative. Several researchers\nsuggested that LDOPA might be harmful to SNc cells due to oxidative stress. The\nrole of LDOPA in the course of PD pathogenesis is still debatable. We\nhypothesize that energy deficiency can lead to LDOPA-induced toxicity (LIT) in\ntwo ways: by promoting dopamine-induced oxidative stress and by exacerbating\nexcitotoxicity in SNc. We present a multiscale computational model of\nSNc-striatum system, which will help us in understanding the mechanism behind\nneurodegeneration postulated above and provides insights for developing\ndisease-modifying therapeutics. It was observed that SNc terminals are more\nvulnerable to energy deficiency than SNc somas. During LDOPA therapy, it was\nobserved that higher LDOPA dosage results in increased loss of somas and\nterminals in SNc. It was also observed that co-administration of LDOPA and\nglutathione (antioxidant) evades LDOPA-induced toxicity in SNc neurons. We show\nthat our proposed model was able to capture LDOPA-induced toxicity in SNc,\ncaused by energy deficiency.\n", "versions": [{"version": "v1", "created": "Wed, 1 Apr 2020 11:04:52 GMT"}], "update_date": "2020-04-20", "authors_parsed": [["Muddapu", "Vignayanandam R.", ""], ["Vijayakumar", "Karthik", ""], ["Ramakrishnan", "Keerthiga", ""], ["Chakravarthy", "V Srinivasa", ""]]}, {"id": "2004.08491", "submitter": "Saroj Jayasinghe", "authors": "Anuruddha Abeygunasekera and Saroj Jayasinghe", "title": "Is the anti-filarial drug diethylcarbamazine useful to treat COVID-19?", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The SARS-CoV-2 virus has resulted in a devastating pandemic of COVID-19.\nExploring compounds that could offer a breakthrough in treatment is the need of\nthe hour. Re-positioning cheap, freely available and safe drugs is a priority.\nThe paper proposes evidence for the potential use of diethylcarbamazine (DEC)\nin the treatment of COVID-19. DEC has inhibitory effects on arachidonic acid\nmetabolism to prostaglandins, little known anti-viral effects on animal\nretroviruses and demonstrated anti-inflammatory actions in animal models of\nlung inflammation indicating the need to explore this hypothesis further. We\nbelieve this is the first time DEC is being proposed to treat COVID-19.\n", "versions": [{"version": "v1", "created": "Sat, 18 Apr 2020 00:18:08 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Abeygunasekera", "Anuruddha", ""], ["Jayasinghe", "Saroj", ""]]}, {"id": "2004.08920", "submitter": "Talia Serseg", "authors": "Talia Serseg, Khedidja Benarous, Mohamed Yousfi", "title": "Hispidin and Lepidine E: two Natural Compounds and Folic acid as\n  Potential Inhibitors of 2019-novel coronavirus Main Protease (2019-nCoVMpro),\n  molecular docking and SAR study", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  2019-nCoV is a novel coronavirus was isolated and identified in 2019 in\nWuhan, China. On 17th February and according to world health organization, a\nnumber of 71 429 confirmed cases worldwide, among them 2162 new cases recorded\nin the last 24 hours. There is no drug or vaccine for human and animal\ncoronavirus. The inhibition of 3CL hydrolase enzyme provides a promising\ntherapeutic principle for developing treatments against CoViD-19. The 3CLpro\n(Mpro) known for involving in counteracting the host innate immune response.\nThis work presents the inhibitory effect of some natural compounds against 3CL\nhydrolase enzyme, and explain the main interactions in inhibitor-enzyme\ncomplex. Molecular docking study carried out using Autodock Vina. By screening\nseveral molecules, we identified three candidate agents that inhibit the main\nprotease of coronavirus. Hispidin, lepidine E, and folic acid bound tightly in\nthe enzyme, strong hydrogen bonds have been formed (1.69-1.80&[Aring]) with the\nactive site residues. This study provides a possible therapeutic strategy for\nCoViD-19.\n", "versions": [{"version": "v1", "created": "Sun, 19 Apr 2020 17:41:53 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Serseg", "Talia", ""], ["Benarous", "Khedidja", ""], ["Yousfi", "Mohamed", ""]]}, {"id": "2004.09639", "submitter": "Vasily Belov", "authors": "Takeshi Yamagiwa, Yong-Ming Yu, Yoshitaka Inoue, Vasily V. Belov,\n  Mikhail I. Papisov, Sadaki Inokuchi, Masao Kaneki, Morris F. White, Alan J.\n  Fischman, and Ronald G. Tompkins", "title": "Impairment of insulin-stimulated glucose utilization is associated with\n  burn-induced insulin resistance in mouse muscle by\n  hyperinsulinemic-isoglycemic clamp", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Burn-induced insulin resistance is associated with increased morbidity and\nmortality; however, the impact of burn injury on tissue-specific insulin\nsensitivity and its molecular mechanisms with consideration of insulin state\nremains unknown in rodent models. This study was designed to characterize a\nburn mouse model with tissue-specific insulin resistance under insulin clamp\nconditions. C57BL6/J mice were subjected to 30% full-thickness burn injury and\nunderwent the combination of hyperinsulinemic isoglycemicclamp (HIC) and\npositron emission tomography (PET). Hepatic glucose production (HGP) and\nperipheral glucose disappearance rate (Rd) were measured at different time\npoints up to 7 days post injury. Burned mice showed a significant fasting\nhypoglycemia and hypoinsulinemia (P < 0.01) on post-burn day (PBD) 3 and 7\nalong with significantly higher energy expenditure (P < 0.01). HICon PBD 3\ndemonstrated that burn injury induced systemic insulin resistance, resulting\nfrom a significant decrease in insulin-stimulated Rd (33.0 +/- 10.2 vs 68.3 +/-\n5.9 mg/kg/min; P < 0.05). In contrast, HGP of burned and sham mice was\ncomparable both in the basal and clamp period. PET on PBD 3 showed a lower\ninsulin-stimulated 18F-labeled 2-fluoro-2-deoxy-D-glucose uptake in the\nquadriceps of burned mice compared with sham-burned mice. Gastrocnemius muscle\nharvested from burned mice on PBD 3 showed decreased insulin-stimulated\ntyrosine phosphorylation of insulin receptor substrate-1 to 34.7% of that in\nsham-burn mice by immunoblotting analysis (P < 0.05). These findings suggest\nthat impaired insulin-stimulated Rd in skeletal muscle, not elevated HGP, plays\na role in the development of burn-induced insulin resistance in a mouse model.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2020 21:16:49 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Yamagiwa", "Takeshi", ""], ["Yu", "Yong-Ming", ""], ["Inoue", "Yoshitaka", ""], ["Belov", "Vasily V.", ""], ["Papisov", "Mikhail I.", ""], ["Inokuchi", "Sadaki", ""], ["Kaneki", "Masao", ""], ["White", "Morris F.", ""], ["Fischman", "Alan J.", ""], ["Tompkins", "Ronald G.", ""]]}, {"id": "2004.09666", "submitter": "Faisal Mahmood", "authors": "Ming Y. Lu, Drew F. K. Williamson, Tiffany Y. Chen, Richard J. Chen,\n  Matteo Barbieri and Faisal Mahmood", "title": "Data Efficient and Weakly Supervised Computational Pathology on Whole\n  Slide Images", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapidly emerging field of computational pathology has the potential to\nenable objective diagnosis, therapeutic response prediction and identification\nof new morphological features of clinical relevance. However, deep\nlearning-based computational pathology approaches either require manual\nannotation of gigapixel whole slide images (WSIs) in fully-supervised settings\nor thousands of WSIs with slide-level labels in a weakly-supervised setting.\nMoreover, whole slide level computational pathology methods also suffer from\ndomain adaptation and interpretability issues. These challenges have prevented\nthe broad adaptation of computational pathology for clinical and research\npurposes. Here we present CLAM - Clustering-constrained attention multiple\ninstance learning, an easy-to-use, high-throughput, and interpretable WSI-level\nprocessing and learning method that only requires slide-level labels while\nbeing data efficient, adaptable and capable of handling multi-class subtyping\nproblems. CLAM is a deep-learning-based weakly-supervised method that uses\nattention-based learning to automatically identify sub-regions of high\ndiagnostic value in order to accurately classify the whole slide, while also\nutilizing instance-level clustering over the representative regions identified\nto constrain and refine the feature space. In three separate analyses, we\ndemonstrate the data efficiency and adaptability of CLAM and its superior\nperformance over standard weakly-supervised classification. We demonstrate that\nCLAM models are interpretable and can be used to identify well-known and new\nmorphological features. We further show that models trained using CLAM are\nadaptable to independent test cohorts, cell phone microscopy images, and\nbiopsies. CLAM is a general-purpose and adaptable method that can be used for a\nvariety of different computational pathology tasks in both clinical and\nresearch settings.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2020 23:00:13 GMT"}, {"version": "v2", "created": "Fri, 22 May 2020 02:03:49 GMT"}], "update_date": "2020-05-25", "authors_parsed": [["Lu", "Ming Y.", ""], ["Williamson", "Drew F. K.", ""], ["Chen", "Tiffany Y.", ""], ["Chen", "Richard J.", ""], ["Barbieri", "Matteo", ""], ["Mahmood", "Faisal", ""]]}, {"id": "2004.09753", "submitter": "Seyedmehdi Abtahi", "authors": "SeyedMehdi Abtahi and Mojtaba Sharifi", "title": "Machine Learning Method Used to find Discrete and Predictive Treatment\n  of Cancer", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cancer is one of the most common diseases worldwide, posing a serious threat\nto human health and leading to the deaths of a large number of people. It was\nobserved during the drug administration in chemotherapy that immune cells,\ncancer cells and normal cells are killed or at least seriously injured and also\nin order to keep dosage of the drug at specific level in body, drug should be\ndelivered in specific time and dosage. Therefore, to address these problems, a\ndecision-making process is needed to identify the most appropriate treatment\nfor cancer cases which causes killing of cancer cells by considering the number\nof healthy cells that would be killed. Despite the latest technological\ndevelopments, the current methods need to be improved to suggest the most\noptimized a dose of the drug for tumor cells discretely. It is expected that\nour proposed ANFIS model be able to suggest the specialists the most optimum\ndose of the drug, which considers all key factors including cancer cells,\nimmune and health cells. The results of the simulations exhibit the high\naccuracy of the proposed intelligent controller during the treatment in\npredicting the behavior of all key factors and minimize the usage dose of the\ndrug with regard this significant point that the proposed controller gives\ndiscrete data for treatment which can fill the gap between engineering and\nmedical science.\n", "versions": [{"version": "v1", "created": "Tue, 21 Apr 2020 04:56:26 GMT"}, {"version": "v2", "created": "Mon, 13 Jul 2020 17:02:11 GMT"}, {"version": "v3", "created": "Sat, 15 Aug 2020 15:42:58 GMT"}, {"version": "v4", "created": "Tue, 18 Aug 2020 19:01:46 GMT"}], "update_date": "2020-08-20", "authors_parsed": [["Abtahi", "SeyedMehdi", ""], ["Sharifi", "Mojtaba", ""]]}, {"id": "2004.10117", "submitter": "Allison Koenecke", "authors": "Allison Koenecke, Michael Powell, Ruoxuan Xiong, Zhu Shen, Nicole\n  Fischer, Sakibul Huq, Adham M. Khalafallah, Marco Trevisan, P\\\"ar Sparen,\n  Juan J Carrero, Akihiko Nishimura, Brian Caffo, Elizabeth A. Stuart, Renyuan\n  Bai, Verena Staedtke, Nickolas Papadopoulos, Kenneth W. Kinzler, Bert\n  Vogelstein, Shibin Zhou, Chetan Bettegowda, Maximilian F. Konig, Brett Mensh,\n  Joshua T. Vogelstein, Susan Athey", "title": "Alpha-1 adrenergic receptor antagonists to prevent hyperinflammation and\n  death from lower respiratory tract infection", "comments": "24 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In severe viral pneumonia, including Coronavirus disease 2019 (COVID-19), the\nviral replication phase is often followed by hyperinflammation, which can lead\nto acute respiratory distress syndrome, multi-organ failure, and death. We\npreviously demonstrated that alpha-1 adrenergic receptor ($\\alpha_1$-AR)\nantagonists can prevent hyperinflammation (cytokine storm syndrome) in mice.\nHere, we conducted retrospective analyses in two cohorts of patients with acute\nrespiratory distress (ARD, n=18,547) and three cohorts with pneumonia\n(n=400,907). Federated across two ARD cohorts, we find that patients exposed to\n$\\alpha_1$-AR antagonists, as compared to unexposed patients, had a 34%\nrelative risk reduction for mechanical ventilation and death (OR=0.70,\np=0.021). We replicated these methods on three pneumonia cohorts, all with\nsimilar effects on both outcomes. All results were robust to sensitivity\nanalyses. These results highlight the urgent need for prospective trials\ntesting whether prophylactic use of $\\alpha_1$-AR antagonists ameliorates lower\nrespiratory tract infection-associated cytokine storm syndrome, as observed in\nCOVID-19.\n", "versions": [{"version": "v1", "created": "Tue, 21 Apr 2020 15:52:25 GMT"}, {"version": "v2", "created": "Mon, 27 Apr 2020 17:56:34 GMT"}, {"version": "v3", "created": "Wed, 6 May 2020 15:25:18 GMT"}, {"version": "v4", "created": "Tue, 12 May 2020 14:39:52 GMT"}, {"version": "v5", "created": "Wed, 13 May 2020 12:27:32 GMT"}, {"version": "v6", "created": "Tue, 4 Aug 2020 16:40:34 GMT"}, {"version": "v7", "created": "Wed, 9 Sep 2020 02:41:16 GMT"}], "update_date": "2020-09-10", "authors_parsed": [["Koenecke", "Allison", ""], ["Powell", "Michael", ""], ["Xiong", "Ruoxuan", ""], ["Shen", "Zhu", ""], ["Fischer", "Nicole", ""], ["Huq", "Sakibul", ""], ["Khalafallah", "Adham M.", ""], ["Trevisan", "Marco", ""], ["Sparen", "Pär", ""], ["Carrero", "Juan J", ""], ["Nishimura", "Akihiko", ""], ["Caffo", "Brian", ""], ["Stuart", "Elizabeth A.", ""], ["Bai", "Renyuan", ""], ["Staedtke", "Verena", ""], ["Papadopoulos", "Nickolas", ""], ["Kinzler", "Kenneth W.", ""], ["Vogelstein", "Bert", ""], ["Zhou", "Shibin", ""], ["Bettegowda", "Chetan", ""], ["Konig", "Maximilian F.", ""], ["Mensh", "Brett", ""], ["Vogelstein", "Joshua T.", ""], ["Athey", "Susan", ""]]}, {"id": "2004.11325", "submitter": "Sahar Rahbar", "authors": "Sahar Rahbar", "title": "Mathematical and Preclinical Investigation of Respiratory Sinus\n  Arrhythmia Effects on Cardiac Output", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Respiratory sinus arrhythmia (RSA) is heart rate variability in synchrony\nwith respiration although its functional significance not clear. The loss of\nsinus arrhythmia may indicate underlying heart failure or disease; therefore,\nthere would be a great advantage of knowing how it works and affects the\ncardio-respiratory system, especially by providing a mathematical model. To\nthis end, Windkessel model and cardiovascular partial differential equations\nare used to obtain cardiac output based on the elasticity of left ventricle,\nwhich is related to RSA. By solving the corresponding equations, it would be\npossible to propose a new model to predict the RSA effects on cardiac output.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2020 17:19:44 GMT"}], "update_date": "2020-04-24", "authors_parsed": [["Rahbar", "Sahar", ""]]}, {"id": "2004.12220", "submitter": "Karen Alim", "authors": "Jason Khadka, Jean-Daniel Julien, and Karen Alim", "title": "Feedback from tissue mechanics self-organizes efficient outgrowth of\n  plant organ", "comments": "16 pages, 8 figures, SI appended", "journal-ref": "Biophys. J. (2019) 117: 1995-2004", "doi": "10.1016/j.bpj.2019.10.019", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Plant organ outgrowth superficially appears like the continuous mechanical\ndeformation of a sheet of cells. Yet, how precisely cells as individual\nmechanical entities can act to morph a tissue reliably and efficiently into\nthree dimensions during outgrowth is still puzzling especially when cells are\ntightly connected as in plant tissue. In plants, the mechanics of cells within\na tissue is particularly well defined as individual cell growth is essentially\nthe mechanical yielding of cell-wall in response to internal turgor pressure.\nCell wall stiffness is controlled by biological signalling and, hence, cell\ngrowth is observed to respond to mechanical stresses building up within a\ntissue. What is the role of the mechanical feedback during morphing of tissue\nin three dimensions? Here, we develop a three dimensional vertex model to\ninvestigate tissue mechanics at the onset of organ outgrowth at the tip of a\nplant shoot. We find that organ height is primarily governed by the ratio of\ngrowth rates of faster growing cells initiating the organ to slower growing\ncells surrounding them. Remarkably, the outgrowth rate is higher when cells\ngrowth responds to the tissue-wide mechanical stresses. Our quantitative\nanalysis of simulation data shows that tissue mechanical feedback on cell\ngrowth can act via twofold mechanism. First, the feedback guides patterns of\ncellular growth. Second, the feedback modifies the stress patterns on the\ncells, consequently amplifying and propagating growth anisotropies. This\nmechanism may allow plants to grow organs efficiently out of the meristem by\nreorganizing the cellular growth rather than inflating growth rates.\n", "versions": [{"version": "v1", "created": "Sat, 25 Apr 2020 19:47:44 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Khadka", "Jason", ""], ["Julien", "Jean-Daniel", ""], ["Alim", "Karen", ""]]}, {"id": "2004.14290", "submitter": "Maria McGee", "authors": "Maria P McGee, Michael Morykwas, Mary Kerns, Anirudh Vashisht, Ashok N\n  Hegde and Louis Argenta", "title": "Interstitial cells and neurons respond to variations in hydration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dehydration and brain interstitial fluid alterations associate to cognitive\ndysfunction. We now explore whether changes in matrix hydration are a possible\ncommon signal for modulation of water-transfer rates and neuron function.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2020 12:40:19 GMT"}], "update_date": "2020-04-30", "authors_parsed": [["McGee", "Maria P", ""], ["Morykwas", "Michael", ""], ["Kerns", "Mary", ""], ["Vashisht", "Anirudh", ""], ["Hegde", "Ashok N", ""], ["Argenta", "Louis", ""]]}, {"id": "2004.14291", "submitter": "Victor M. Perez-Garcia", "authors": "V\\'ictor M. P\\'erez-Garc\\'ia, O. Le\\'on-Triana, M. Rosa, A.\n  P\\'erez-Mart\\'inez", "title": "CAR T cells for T-cell leukemias: Insights from mathematical models", "comments": null, "journal-ref": null, "doi": "10.1016/j.cnsns.2020.105684", "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Immunotherapy has the potential to change the way all cancer types are\ntreated and cured. Cancer immunotherapies use elements of the patient immune\nsystem to attack tumor cells. One of the most successful types of immunotherapy\nis CAR-T cells. This treatment works by extracting patient's T-cells and adding\nto them an antigen receptor allowing tumor cells to be recognized and targeted.\nThese new cells are called CAR-T cells and are re-infused back into the patient\nafter expansion in-vitro. This approach has been successfully used to treat\nB-cell malignancies (B-cell leukemias and lymphomas). However, its application\nto the treatment of T-cell leukemias faces several problems. One of these is\nfratricide, since the CAR-T cells target both tumor and other CAR-T cells. This\nleads to nonlinear dynamical phenomena amenable to mathematical modeling. In\nthis paper we construct a mathematical model describing the competition of\nCAR-T, tumor and normal T-cells and studied some basic properties of the model\nand its practical implications. Specifically, we found that the model\nreproduced the observed difficulties for in-vitro expansion of the therapeutic\ncells found in the laboratory. The mathematical model predicted that CAR-T cell\nexpansion in the patient would be possible due to the initial presence of a\nlarge number of targets. We also show that, in the context of our mathematical\napproach, CAR-T cells could control tumor growth but not eradicate the disease.\n", "versions": [{"version": "v1", "created": "Sun, 26 Apr 2020 15:57:49 GMT"}], "update_date": "2021-02-03", "authors_parsed": [["Pérez-García", "Víctor M.", ""], ["León-Triana", "O.", ""], ["Rosa", "M.", ""], ["Pérez-Martínez", "A.", ""]]}, {"id": "2004.14296", "submitter": "Senthilkumar Kadirvelu Dr", "authors": "Senthilkumar. K, Ruchika Lakshmanan, Mohamed Shafiuazama and Arun\n  Prasad.A", "title": "Therapeutic Management of Sacro-coccygeal compression in a Green Iguana\n  (Iguana iguana)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  In reptiles, especially during their early stage of life when reared under\ncaptive conditions, nutritional deficiencies are the most common problems\nreported in them affecting the spinal cord and the musculoskeletal system. More\noften green iguanas and snakes are very much vulnerable to it. Case\ndescription: A three and a half months old green iguana (Iguana iguana) was\nbrought to the Avian and Exotic Pet Unit, Madras Veterinary College with the\nhistory of dragging hind limbs and not passed faeces for the past four days.\nFindings, treatment and outcome: On examination of hind limbs, it was found\nthat perching reflex was absent and the abdomen was distended. It was\ntentatively diagnosed for hind limb paralysis but the radiological examination\nrevealed that the iguana was suffering from Sacro-coccygeal compression. The\ncondition could have been aggravated due to poor nutritional management also.\nIn order to reduce the pain, the iguana was treated with Meloxicam orally @ 0.1\nmg/kg for a week. In addition, it was successfully treated orally with\nmultivitamin syrup and calcium syrup simultaneously for a month. The iguana was\nsubjected to infrared therapy of 3 minutes for a period of one week. The\nreptile showed complete recovery without dragging its hind limb after 2 months.\nConclusion: It could be concluded that prompt intervention and dietary\nmanagement may be necessary for musculo-skeletal disorders in Iguana. .\n", "versions": [{"version": "v1", "created": "Sat, 11 Apr 2020 18:43:08 GMT"}], "update_date": "2020-04-30", "authors_parsed": [["K", "Senthilkumar.", ""], ["Lakshmanan", "Ruchika", ""], ["Shafiuazama", "Mohamed", ""], ["A", "Arun Prasad.", ""]]}, {"id": "2004.14297", "submitter": "Sebastian Dominguez", "authors": "D. S. Ryan, S. Dom\\'inguez, S. A. Ross, N. Nigam, J. M. Wakeling", "title": "The energy of muscle contraction. II. Transverse compression and work", "comments": "20 pages, 7 figures. Manuscript submitted to Frontiers in Physiology", "journal-ref": null, "doi": "10.3389/fphys.2020.538522", "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study we reproduced this compression-induced reduction in muscle\nforce through the use of a three-dimensional finite element model of\ncontracting muscle. The model used the principle of minimum total energy and\nallowed for the redistribution of energy through different strain\nenergy-densities; this allowed us to determine the importance of the strain\nenergy-densities to the transverse forces developed by the muscle. Furthermore,\nwe were able to study how external work done on the muscle by transverse\ncompression affects the internal work and strain-energy distribution of the\nmuscle.\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2020 06:18:27 GMT"}], "update_date": "2021-01-13", "authors_parsed": [["Ryan", "D. S.", ""], ["Domínguez", "S.", ""], ["Ross", "S. A.", ""], ["Nigam", "N.", ""], ["Wakeling", "J. M.", ""]]}, {"id": "2004.14298", "submitter": "Dayun Yan", "authors": "Dayun Yan, Qihui Wang, Manish Adhikari, Alisa Malyavko, Li Lin, Denis\n  B. Zolotukhin, Xiaoliang Yao, Megan Kirschner, Jonathan H. Sherman, Michael\n  Keidar", "title": "A New Physically Triggered Cell Death via Transbarrier Contactless Cold\n  Atmospheric Plasma Treatment of Cancer Cells", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For years, extensive efforts have been made to discover effective,\nnon-invasive anti-cancer therapies. Cold atmospheric plasma (CAP), is a near\nroom temperature ionized gas composed of reactive species, charged particles,\nneutral particles, and electrons. CAP also has several physical factors\nincluding thermal radiation, ultraviolet (UV) radiation, and electromagnetic\n(EM) waves. Most of the previously reported biological effects of CAP have\nrelied on direct contact between bulk plasma and cells, resulting in the\nchemical effects generally seen after CAP treatment. In this paper, we\ndemonstrate that the electromagnetic emission produced by CAP can lead to the\ndeath of B16F10 melanoma cancer cells via a transbarrier contactless method.\nWhen compared with the effect of reactive species, the effect of the physical\nfactors causes much greater growth inhibition. The physical-triggered growth\ninhibition is due to a new type of cell death, characterized by rapid leakage\nof bulk water from the cells, resulting in bubbles on the cell membrane, and\ncytoplasm shrinkage. The results of this study introduce a new possible\nmechanism of CAP induced cancer cell death and build a foundation for CAP to be\nused as a non-invasive cancer treatment in the future.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 18:10:43 GMT"}], "update_date": "2020-04-30", "authors_parsed": [["Yan", "Dayun", ""], ["Wang", "Qihui", ""], ["Adhikari", "Manish", ""], ["Malyavko", "Alisa", ""], ["Lin", "Li", ""], ["Zolotukhin", "Denis B.", ""], ["Yao", "Xiaoliang", ""], ["Kirschner", "Megan", ""], ["Sherman", "Jonathan H.", ""], ["Keidar", "Michael", ""]]}]