[{"id": "1403.0339", "submitter": "Vincenzo De Florio", "authors": "Vincenzo De Florio", "title": "On the Behavioral Interpretation of System-Environment Fit and\n  Auto-Resilience", "comments": "Draft submitted for publication in the Proceedings of the IEEE 2014\n  Conference on Norbert Wiener in the 21st Century", "journal-ref": null, "doi": "10.1109/NORBERT.2014.6893945", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Already 71 years ago Rosenblueth, Wiener, and Bigelow introduced the concept\nof the \"behavioristic study of natural events\" and proposed a classification of\nsystems according to the quality of the behaviors they are able to exercise. In\nthis paper we consider the problem of the resilience of a system when deployed\nin a changing environment, which we tackle by considering the behaviors both\nthe system organs and the environment mutually exercise. We then introduce a\npartial order and a metric space for those behaviors, and we use them to define\na behavioral interpretation of the concept of system-environment fit. Moreover\nwe suggest that behaviors based on the extrapolation of future environmental\nrequirements would allow systems to proactively improve their own\nsystem-environment fit and optimally evolve their resilience. Finally we\ndescribe how we plan to express a complex optimization strategy in terms of the\nconcepts introduced in this paper.\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2014 08:42:24 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["De Florio", "Vincenzo", ""]]}, {"id": "1403.1061", "submitter": "Nir Shlezinger", "authors": "Nir Shlezinger and Ron Dabora", "title": "Frequency-Shift Filtering for OFDM Signal Recovery in Narrowband Power\n  Line Communications", "comments": "Accepted to the ieee transactions on communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Power line communications (PLC) has been drawing considerable interest in\nrecent years due to the growing interest in smart grid implementation.\nSpecifically, network control and grid applications are allocated the frequency\nband of 0-500 kHz, commonly referred to as the narrowband PLC channel. This\nfrequency band is characterized by strong periodic noise which results in low\nsignal to noise ratio (SNR). In this work we propose a receiver which uses\nfrequency shift filtering to exploit the cyclostationary properties of both the\nnarrowband power line noise, as well as the information signal, digitally\nmodulated using orthogonal frequency division multiplexing. An adaptive\nimplementation for the proposed receiver is presented as well. The proposed\nreceiver is compared to existing receivers via analysis and simulation. The\nresults show that the receiver proposed in this work obtains a substantial\nperformance gain over previously proposed receivers, without requiring any\ncoordination with the transmitter.\n", "versions": [{"version": "v1", "created": "Wed, 5 Mar 2014 10:02:43 GMT"}], "update_date": "2014-03-06", "authors_parsed": [["Shlezinger", "Nir", ""], ["Dabora", "Ron", ""]]}, {"id": "1403.1923", "submitter": "Yue Zhang", "authors": "Yue Zhang, Wangdong Qi and Su Zhang", "title": "The Unambiguous Distance in a Phase-based Ranging System with Hopping\n  Frequencies", "comments": "6 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is a challenge to specify unambiguous distance (UD) in a phase-based\nranging system with hopping frequencies (PRSHF). In this letter, we propose to\ncharacterize the UD in a PRSHF by the probability that it takes on its maximum\nvalue. We obtain a very simple and elegant expression of the probability with\ngrowth estimation techniques from analytic number theory. It is revealed that\nthe UD in a PRSHF usually takes on the maximum value with as few as 10\nfrequencies in measurement, almost independent of the specific distribution of\navailable bandwidth.\n", "versions": [{"version": "v1", "created": "Sat, 8 Mar 2014 02:55:14 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Zhang", "Yue", ""], ["Qi", "Wangdong", ""], ["Zhang", "Su", ""]]}, {"id": "1403.3156", "submitter": "Joshi Kashyap Manoj", "authors": "Kashyap Joshi, Vipul Gohil", "title": "ARM 7 Based Controller Area Network for Accident Avoidance in\n  Automobiles", "comments": "6 pages, 6 figure , \"Published with International Journal of\n  Engineering Trends and Technology (IJETT)\". http://www.ijettjournal.org.\n  published by seventh sense. research group", "journal-ref": "IJETT,V9(2),61-65 March 2014. ISSN:2231-5381", "doi": "10.14445/22315381/IJETT-V9P212", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on requirements of modern vehicle, in- vehicle Controller Area Network\n(CAN) architecture has been implemented. In order to reduce point to point\nwiring harness in vehicle automation, CAN is suggested as a means for data\ncommunication within the vehicle environment. The benefits of CAN bus based\nnetwork over traditional point to point schemes will offer increased\nflexibility and expandability for future technology insertions.\n  This paper describes system which uses sensors to measure various parameters\nof the car like speed, distance from the other car, presence of alcohol in car\nand accidental change of lane and sends a warning signal to the driver if any\nof the parameter goes out of range to avoid accidents . In addition to this if\naccident occurs in any remote area then using bump sensor accident is detected\nand SMS is send immediately using GSM. A situation that provides a good example\nof how the system works is when a driver is about to change lanes, and there is\na car in his blind spot. The sensors will detect that car and inform the driver\nbefore he starts turning, preventing him from potentially getting into a\nserious accident.\n", "versions": [{"version": "v1", "created": "Thu, 13 Mar 2014 03:49:31 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Joshi", "Kashyap", ""], ["Gohil", "Vipul", ""]]}, {"id": "1403.3547", "submitter": "Rakesh Kumar Pandey", "authors": "Rakesh Kumar Pandey, Dilip Kumar", "title": "Distributed Transformer Monitoring System Based On Zigbee Technology", "comments": "3 Pages, 5 Figures, International Journal of Engineering Trends and\n  Technology (IJETT)-Volume4 Issue5-May (2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Distributed transformer networks remote monitoring system is developed and\nconstructed,for monitor and record the parameters like temperature, oil level\nstatus, of a distribution transformer.The system consists of a micro controller\nbased circuit,with solid-state components for handling sensors,power\nback-up,real time clock and data communication module which based on ZigBee\nprotocol.\n", "versions": [{"version": "v1", "created": "Fri, 14 Mar 2014 12:08:22 GMT"}], "update_date": "2014-03-17", "authors_parsed": [["Pandey", "Rakesh Kumar", ""], ["Kumar", "Dilip", ""]]}, {"id": "1403.4077", "submitter": "Vincenzo De Florio", "authors": "Vincenzo De Florio", "title": "Behavior, Organization, Substance: Three Gestalts of General Systems\n  Theory", "comments": "Paper appeared in the Proc. of the IEEE Conference \"Wiener in the\n  21st Century\". Companion paper of http://arxiv.org/abs/1403.0339", "journal-ref": null, "doi": "10.1109/NORBERT.2014.6893923", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The term gestalt, when used in the context of general systems theory, assumes\nthe value of \"systemic touchstone\", namely a figure of reference used to\ncategorize the properties or qualities of a set of systems. Typical gestalts\nused in biology are those based on anatomical or physiological characteristics,\nwhich correspond respectively to architectural and organizational design\nchoices in natural and artificial systems. In this paper we discuss three\ngestalts of general systems theory: behavior, organization, and substance,\nwhich refer respectively to the works of Wiener, Boulding, and Leibniz. Our\nmajor focus here is the system introduced by the latter. Through a discussion\nof some of the elements of the Leibnitian System, and by means of several novel\ninterpretations of those elements in terms of today's computer science, we\nhighlight the debt that contemporary research still has with this Giant among\nthe giant scholars of the past.\n", "versions": [{"version": "v1", "created": "Mon, 17 Mar 2014 12:13:49 GMT"}, {"version": "v2", "created": "Thu, 21 May 2015 08:09:19 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["De Florio", "Vincenzo", ""]]}, {"id": "1403.4512", "submitter": "Vilson Vieira da Silva Junior", "authors": "Vilson Vieira, Renato Fabbri, David Sbrissa, Luciano da Fontoura\n  Costa, Gonzalo Travieso", "title": "A Quantitative Approach to Painting Styles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.OH", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This research extends a method previously applied to music and\nphilosophy,representing the evolution of art as a time-series where relations\nlike dialectics are measured quantitatively. For that, a corpus of paintings of\n12 well-known artists from baroque and modern art is analyzed. A set of 93\nfeatures is extracted and the features which most contributed to the\nclassification of painters are selected. The projection space obtained provides\nthe basis to the analysis of measurements. This quantitative measures underlie\nrevealing observations about the evolution of painting styles, specially when\ncompared with other humanity fields already analyzed: while music evolved along\na master-apprentice tradition (high dialectics) and philosophy by opposition,\npainting presents another pattern: constant increasing skewness, low opposition\nbetween members of the same movement and opposition peaks in the transition\nbetween movements. Differences between baroque and modern movements are also\nobserved in the projected \"painting space\": while baroque paintings are\npresented as an overlapped cluster, the modern paintings present minor\noverlapping and are disposed more widely in the projection than the baroque\ncounterparts. This finding suggests that baroque painters shared aesthetics\nwhile modern painters tend to \"break rules\" and develop their own style.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2013 00:15:47 GMT"}], "update_date": "2014-03-19", "authors_parsed": [["Vieira", "Vilson", ""], ["Fabbri", "Renato", ""], ["Sbrissa", "David", ""], ["Costa", "Luciano da Fontoura", ""], ["Travieso", "Gonzalo", ""]]}, {"id": "1403.4702", "submitter": "Ritu Parasher", "authors": "Ritu Parasher", "title": "Load flow analysis of radial distribution network using linear data\n  structure", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distribution systems hold a very significant position in the power system\nsince it is the main point of link between bulk power and consumers. A planned\nand effective distribution network is the key to cope up with the ever\nincreasing demand for domestic, industrial and commercial load. The load-flow\nstudy of radial distribution network is of prime importance for effective\nplanning of load transfers. Power companies are interested in finding the most\nefficient configuration for minimization of real power loses and load balancing\namong distribution feeders to save energy and enhance the over all performance\nof distribution system.\n  This thesis presents a fast and efficient method for load-flow analysis of\nradial distribution networks. The proposed method is based on linear data\nstructure. The order of time and space complexity is reported here. There is\nsignificant saving in no. of steps execution. Using graph theory concept and\nexploiting multi-cores architecture, the proposed method for load flow can be\nfurther investigated for obtaining more optimized solutions.\n", "versions": [{"version": "v1", "created": "Wed, 19 Mar 2014 06:13:22 GMT"}], "update_date": "2014-03-20", "authors_parsed": [["Parasher", "Ritu", ""]]}, {"id": "1403.5864", "submitter": "Ying Long", "authors": "Ying Long and Yao Shen", "title": "Mapping parcel-level urban areas for a large geographical area", "comments": "21 pages, 9 figures, 3 tables", "journal-ref": null, "doi": "10.1080/00045608.2015.1095062", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As a vital indicator for measuring urban development, urban areas are\nexpected to be identified explicitly and conveniently with widely available\ndataset thereby benefiting the planning decisions and relevant urban studies.\nExisting approaches to identify urban areas normally based on mid-resolution\nsensing dataset, socioeconomic information (e.g. population density) generally\nassociate with low-resolution in space, e.g. cells with several square\nkilometers or even larger towns/wards. Yet, few of them pay attention to\ndefining urban areas with micro data in a fine-scaled manner with large extend\nscale by incorporating the morphological and functional characteristics. This\npaper investigates an automated framework to delineate urban areas in the\nparcel level, using increasingly available ordnance surveys for generating all\nparcels (or geo-units) and ubiquitous points of interest (POIs) for inferring\ndensity of each parcel. A vector cellular automata model was adopted for\nidentifying urban parcels from all generated parcels, taking into account\ndensity, neighborhood condition, and other spatial variables of each parcel. We\napplied this approach for mapping urban areas of all 654 Chinese cities and\ncompared them with those interpreted from mid-resolution remote sensing images\nand inferred by population density and road intersections. Our proposed\nframework is proved to be more straight-forward, time-saving and fine-scaled,\ncompared with other existing ones, and reclaim the need for consistency,\nefficiency and availability in defining urban areas with well-consideration of\nomnipresent spatial and functional factors across cities.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 06:39:17 GMT"}], "update_date": "2016-01-01", "authors_parsed": [["Long", "Ying", ""], ["Shen", "Yao", ""]]}, {"id": "1403.6919", "submitter": "Malini  P", "authors": "Harikrishnan.R, Shajna S. Hammed, P.Malini", "title": "Marine Buoy Location Finding and Tracking System for Linux Supporting\n  Mobiles", "comments": "3pages, 5figures", "journal-ref": "International Journal of Engineering Trends and Technology Volume\n  9 Number 8 - Mar 2014", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Marine buoy is an important part of underwater acoustic communication system.\nIt is of great significance to track and locate it. It is widely used in ocean\nenvironment three - dimensional monitoring, underwater multimedia\ncommunication, underwater mobile carrier navigation and positioning, marine\nresources detection, remote control of submarine topography mapping and\noffshore oil industry, data acquisition, etc. This paper describes the\napplication of the monitoring service of GPRS / GPS module at Marine buoy. It\ncan achieve real - time location of underwater acoustic communication devices\nand route tracking to avoid the loss of the device, as well as assist to\nretrieve the lost device.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 05:57:10 GMT"}], "update_date": "2014-03-28", "authors_parsed": [["R", "Harikrishnan.", ""], ["Hammed", "Shajna S.", ""], ["Malini", "P.", ""]]}, {"id": "1403.7872", "submitter": "Manzil Zaheer", "authors": "Chenjie Gu, Manzil Zaheer and Xin Li", "title": "Multiple-Population Moment Estimation: Exploiting Inter-Population\n  Correlation for Efficient Moment Estimation in Analog/Mixed-Signal Validation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Moment estimation is an important problem during circuit validation, in both\npre-Silicon and post-Silicon stages. From the estimated moments, the\nprobability of failure and parametric yield can be estimated at each circuit\nconfiguration and corner, and these metrics are used for design optimization\nand making product qualification decisions. The problem is especially difficult\nif only a very small sample size is allowed for measurement or simulation, as\nis the case for complex analog/mixed-signal circuits. In this paper, we propose\nan efficient moment estimation method, called Multiple-Population Moment\nEstimation (MPME), that significantly improves estimation accuracy under small\nsample size. The key idea is to leverage the data collected under different\ncorners/configurations to improve the accuracy of moment estimation at each\nindividual corner/configuration. Mathematically, we employ the hierarchical\nBayesian framework to exploit the underlying correlation in the data. We apply\nthe proposed method to several datasets including post-silicon measurements of\na commercial high-speed I/O link, and demonstrate an average error reduction of\nup to 2$\\times$, which can be equivalently translated to significant reduction\nof validation time and cost.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2014 05:23:09 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Gu", "Chenjie", ""], ["Zaheer", "Manzil", ""], ["Li", "Xin", ""]]}]