[{"id": "1010.2326", "submitter": "Moritz Heene Dr.", "authors": "Moritz Heene", "title": "A brief history of the Fail Safe Number in Applied Research", "comments": "8 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rosenthal's (1979) Fail-Safe-Number (FSN) is probably one of the best known\nstatistics in the context of meta-analysis aimed to estimate the number of\nunpublished studies in meta-analyses required to bring the meta-analytic mean\neffect size down to a statistically insignificant level. Already before\nScargle's (2000) and Schonemann & Scargle's (2008) fundamental critique on the\nclaimed stability of the basic rationale of the FSN approach, objections\nfocusing on the basic assumption of the FSN which treats the number of studies\nas unbiased with averaging null were expressed throughout the history of the\nFSN by different authors (Elashoff, 1978; Iyengar & Greenhouse, 1988a; 1988b;\nsee also Scargle, 2000). In particular, Elashoff's objection appears to be\nimportant because it was the very first critique pointing directly to the\ncentral problem of the FSN: \"R & R claim that the number of studies hidden in\nthe drawers would have to be 65,000 to achieve a mean effect size of zero when\ncombined with the 345 studies reviewed here. But surely, if we allowed the\nhidden studies to be negative, on the average no more than 345 hidden studies\nwould be necessary to obtain a zero mean effect size\" (p. 392). Thus, users of\nmeta-analysis could have been aware right from the beginning that something was\nwrong with the statistical reasoning of the FSN. In particular, from an applied\nresearch perspective, it is therefore of interest whether any of the\nfundamental objections on the FSN are reflected in standard handbooks on\nmeta-analysis as well as -and of course even more importantly- in meta-analytic\nstudies itself.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 09:15:45 GMT"}], "update_date": "2010-10-13", "authors_parsed": [["Heene", "Moritz", ""]]}]