[{"id": "1210.0756", "submitter": "Michael Golosovsky", "authors": "Michael Golosovsky and Sorin Solomon", "title": "Stochastic dynamical model of a growing network based on self-exciting\n  point process", "comments": "16 pages, 9 figures", "journal-ref": "Phys. Rev. Lett. 109, 098701 (2012)", "doi": "10.1103/PhysRevLett.109.098701", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.DL cs.SI stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We perform experimental verification of the preferential attachment model\nthat is commonly accepted as a generating mechanism of the scale-free complex\nnetworks. To this end we chose citation network of Physics papers and traced\ncitation history of 40,195 papers published in one year. Contrary to common\nbelief, we found that citation dynamics of the individual papers follows the\n\\emph{superlinear} preferential attachment, with the exponent $\\alpha=\n1.25-1.3$. Moreover, we showed that the citation process cannot be described as\na memoryless Markov chain since there is substantial correlation between the\npresent and recent citation rates of a paper. Basing on our findings we\nconstructed a stochastic growth model of the citation network, performed\nnumerical simulations based on this model and achieved an excellent agreement\nwith the measured citation distributions.\n", "versions": [{"version": "v1", "created": "Tue, 2 Oct 2012 12:57:46 GMT"}], "update_date": "2013-02-15", "authors_parsed": [["Golosovsky", "Michael", ""], ["Solomon", "Sorin", ""]]}, {"id": "1210.0962", "submitter": "Adam Kapelner", "authors": "Dana Chandler and Adam Kapelner", "title": "Breaking Monotony with Meaning: Motivation in Crowdsourcing Markets", "comments": "26 pages, 15 figures, 4 tables", "journal-ref": "Journal of Economic Behavior & Organization, 90, 2013, pp 123-133", "doi": "10.1016/j.jebo.2013.03.003", "report-no": null, "categories": "stat.OT cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We conduct the first natural field experiment to explore the relationship\nbetween the \"meaningfulness\" of a task and worker effort. We employed about\n2,500 workers from Amazon's Mechanical Turk (MTurk), an online labor market, to\nlabel medical images. Although given an identical task, we experimentally\nmanipulated how the task was framed. Subjects in the meaningful treatment were\ntold that they were labeling tumor cells in order to assist medical\nresearchers, subjects in the zero-context condition (the control group) were\nnot told the purpose of the task, and, in stark contrast, subjects in the\nshredded treatment were not given context and were additionally told that their\nwork would be discarded. We found that when a task was framed more\nmeaningfully, workers were more likely to participate. We also found that the\nmeaningful treatment increased the quantity of output (with an insignificant\nchange in quality) while the shredded treatment decreased the quality of output\n(with no change in quantity). We believe these results will generalize to other\nshort-term labor markets. Our study also discusses MTurk as an exciting\nplatform for running natural field experiments in economics.\n", "versions": [{"version": "v1", "created": "Wed, 3 Oct 2012 02:28:34 GMT"}], "update_date": "2013-05-23", "authors_parsed": [["Chandler", "Dana", ""], ["Kapelner", "Adam", ""]]}, {"id": "1210.1773", "submitter": "Mikkel Meyer Andersen", "authors": "Mikkel Meyer Andersen, Poul Svante Eriksen", "title": "Efficient Forward Simulation of Fisher-Wright Populations with\n  Stochastic Population Size and Neutral Single Step Mutations in Haplotypes", "comments": "17 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.CO q-bio.PE stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In both population genetics and forensic genetics it is important to know how\nhaplotypes are distributed in a population. Simulation of population dynamics\nhelps facilitating research on the distribution of haplotypes. In forensic\ngenetics, the haplotypes can for example consist of lineage markers such as\nshort tandem repeat loci on the Y chromosome (Y-STR). A dominating model for\ndescribing population dynamics is the simple, yet powerful, Fisher-Wright\nmodel. We describe an efficient algorithm for exact forward simulation of exact\nFisher-Wright populations (and not approximative such as the coalescent model).\nThe efficiency comes from convenient data structures by changing the\ntraditional view from individuals to haplotypes. The algorithm is implemented\nin the open-source R package 'fwsim' and is able to simulate very large\npopulations. We focus on a haploid model and assume stochastic population size\nwith flexible growth specification, no selection, a neutral single step\nmutation process, and self-reproducing individuals. These assumptions make the\nalgorithm ideal for studying lineage markers such as Y-STR.\n", "versions": [{"version": "v1", "created": "Fri, 5 Oct 2012 14:38:00 GMT"}], "update_date": "2012-10-08", "authors_parsed": [["Andersen", "Mikkel Meyer", ""], ["Eriksen", "Poul Svante", ""]]}, {"id": "1210.7225", "submitter": "Christian P. Robert", "authors": "Andrew Gelman (Columbia University) and Christian P. Robert\n  (University Paris-Dauphine and CREST)", "title": "The anti-Bayesian moment and its passing", "comments": "4 pages, to appear in The American Statistician as a reply to the\n  discussion", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT math.HO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present article is the reply to the discussion of our earlier \"Not only\ndefended but also applied\" (arXiv:1006.5366, to appear in The American\nStatistician) that arose from our memory of a particularly intemperate\nanti-Bayesian statement in Feller's beautiful and classic book on probability\ntheory. We felt that it was worth exploring the very extremeness of Feller's\nwords, along with similar anti-Bayesian remarks by others, in order to better\nunderstand the background underlying controversies that still exist regarding\nthe foundations of statistics. We thank the four discussants of our article for\ntheir contributions to our understanding of these controversies as they have\nexisted in the past and persist today.\n", "versions": [{"version": "v1", "created": "Fri, 26 Oct 2012 19:33:43 GMT"}], "update_date": "2012-10-29", "authors_parsed": [["Gelman", "Andrew", "", "Columbia University"], ["Robert", "Christian P.", "", "University Paris-Dauphine and CREST"]]}]