[{"id": "1301.0765", "submitter": "Kalman Ziha", "authors": "Kalman Ziha", "title": "Perceptive Statistical Variability Indicators", "comments": "12 pages, 7 pictures, 2 tables Originally written in MS Word .doc\n  forat", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concepts of variability and uncertainty, both epistemic and alleatory,\ncame from experience and coexist with different connotations. Therefore this\narticle attempts to express their relation by analytic means firstly setting\nsights on their differences and then on their common characteristics. Inspired\nwith the definition of average number of equally probable events based on\nentropy concept in probability theory, the article introduced two related\nperceptive statistical measures which indicate the same variability as the\nbasic probability distribution. First is the equivalent number of a\nhypothetical distribution with one sure and all the other impossible outcomes\nwhich indicates variability. Second is the appropriate equivalent number of a\nhypothetical distribution with all equal probabilities which indicates\ninvariability. The article interprets the common properties of variability and\nuncertainty on theoretical distributions and on ocean-wide wind wave\ndirectional properties by using the long term observations compiled in the\nGlobal Wave Statistics.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jan 2013 16:28:23 GMT"}, {"version": "v2", "created": "Mon, 14 Jan 2013 13:11:09 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Ziha", "Kalman", ""]]}, {"id": "1301.1277", "submitter": "Christian Kleiber", "authors": "Christian Kleiber", "title": "The generalized lognormal distribution and the Stieltjes moment problem", "comments": "12 pages, 1 figure", "journal-ref": "Journal of Theoretical Probability, 2014, Vol. 27, No. 4,\n  1167-1177", "doi": "10.1007/s10959-013-0477-0", "report-no": null, "categories": "math.PR stat.OT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper studies a Stieltjes-type moment problem defined by the generalized\nlognormal distribution, a heavy-tailed distribution with applications in\neconomics, finance and related fields. It arises as the distribution of the\nexponential of a random variable following a generalized error distribution,\nand hence figures prominently in the EGARCH model of asset price volatility.\nCompared to the classical lognormal distribution it has an additional shape\nparameter. It emerges that moment (in)determinacy depends on the value of this\nparameter: for some values, the distribution does not have finite moments of\nall orders, hence the moment problem is not of interest in these cases. For\nother values, the distribution has moments of all orders, yet it is\nmoment-indeterminate. Finally, a limiting case is supported on a bounded\ninterval, and hence determined by its moments. For those generalized lognormal\ndistributions that are moment-indeterminate Stieltjes classes of\nmoment-equivalent distributions are presented.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2013 17:37:50 GMT"}], "update_date": "2016-08-19", "authors_parsed": [["Kleiber", "Christian", ""]]}, {"id": "1301.3748", "submitter": "Bj\\\"orn Brembs", "authors": "Bj\\\"orn Brembs, Marcus Munaf\\`o", "title": "Deep Impact: Unintended consequences of journal rank", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph stat.OT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Most researchers acknowledge an intrinsic hierarchy in the scholarly journals\n('journal rank') that they submit their work to, and adjust not only their\nsubmission but also their reading strategies accordingly. On the other hand,\nmuch has been written about the negative effects of institutionalizing journal\nrank as an impact measure. So far, contributions to the debate concerning the\nlimitations of journal rank as a scientific impact assessment tool have either\nlacked data, or relied on only a few studies. In this review, we present the\nmost recent and pertinent data on the consequences of our current scholarly\ncommunication system with respect to various measures of scientific quality\n(such as utility/citations, methodological soundness, expert ratings or\nretractions). These data corroborate previous hypotheses: using journal rank as\nan assessment tool is bad scientific practice. Moreover, the data lead us to\nargue that any journal rank (not only the currently-favored Impact Factor)\nwould have this negative impact. Therefore, we suggest that abandoning journals\naltogether, in favor of a library-based scholarly communication system, will\nultimately be necessary. This new system will use modern information technology\nto vastly improve the filter, sort and discovery functions of the current\njournal system.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2013 16:32:52 GMT"}, {"version": "v2", "created": "Mon, 25 Mar 2013 12:32:44 GMT"}, {"version": "v3", "created": "Fri, 10 May 2013 12:10:06 GMT"}], "update_date": "2013-05-13", "authors_parsed": [["Brembs", "Björn", ""], ["Munafò", "Marcus", ""]]}, {"id": "1301.4628", "submitter": "Mohammad Jafari Jozani", "authors": "Mohammad Jafari Jozani and Nahid Jafari Tabrizi", "title": "Intrinsic posterior regret gamma-minimax estimation for the exponential\n  family of distributions", "comments": "16 pages", "journal-ref": null, "doi": "10.1214/13-EJS828", "report-no": null, "categories": "math.ST stat.ME stat.OT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In practice, it is desired to have estimates that are invariant under\nreparameterization. The invariance property of the estimators helps to\nformulate a unified solution to the underlying estimation problem. In robust\nBayesian analysis, a frequent criticism is that the optimal estimators are not\ninvariant under smooth reparameterizations. This paper considers the problem of\nposterior regret gamma-minimax (PRGM) estimation of the natural parameter of\nthe exponential family of distributions under intrinsic loss functions. We show\nthat under the class of Jeffrey's Conjugate Prior (JCP) distributions, PRGM\nestimators are invariant to smooth one-to-one reparameterizations. We apply our\nresults to several distributions and different classes of JCP, as well as the\nusual conjugate prior distributions. We observe that, in many cases, invariant\nPRGM estimators in the class of JCP distributions can be obtained by some\nmodifications of PRGM estimators in the usual class of conjugate priors.\n  Moreover, when the class of priors are convex or dependant on a\nhyper-parameter belonging to a connected set, we show that the PRGM estimator\nunder the intrinsic loss function could be Bayes with respect to a prior\ndistribution in the original prior class. Theoretical results are supplemented\nwith several examples and illustrations.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jan 2013 05:11:40 GMT"}], "update_date": "2014-04-24", "authors_parsed": [["Jozani", "Mohammad Jafari", ""], ["Tabrizi", "Nahid Jafari", ""]]}, {"id": "1301.7006", "submitter": "Michel Plantie", "authors": "Michel Crampes, Michel Planti\\'e", "title": "A Unified Community Detection, Visualization and Analysis method", "comments": "Submitted to Advances in Complex Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI physics.data-an physics.soc-ph stat.OT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Community detection in social graphs has attracted researchers' interest for\na long time. With the widespread of social networks on the Internet it has\nrecently become an important research domain. Most contributions focus upon the\ndefinition of algorithms for optimizing the so-called modularity function. In\nthe first place interest was limited to unipartite graph inputs and partitioned\ncommunity outputs. Recently bipartite graphs, directed graphs and overlapping\ncommunities have been investigated. Few contributions embrace at the same time\nthe three types of nodes. In this paper we present a method which unifies\ncommmunity detection for the three types of nodes and at the same time merges\npartitionned and overlapping communities. Moreover results are visualized in\nsuch a way that they can be analyzed and semantically interpreted. For\nvalidation we experiment this method on well known simple benchmarks. It is\nthen applied to real data in three cases. In two examples of photos sets with\ntagged people we reveal social networks. A second type of application is of\nparticularly interest. After applying our method to Human Brain Tractography\nData provided by a team of neurologists, we produce clusters of white fibers in\naccordance with other well known clustering methods. Moreover our approach for\nvisualizing overlapping clusters allows better understanding of the results by\nthe neurologist team. These last results open up the possibility of applying\ncommunity detection methods in other domains such as data analysis with\noriginal enhanced performances.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jan 2013 18:02:44 GMT"}, {"version": "v2", "created": "Wed, 30 Jan 2013 15:13:52 GMT"}, {"version": "v3", "created": "Thu, 31 Jan 2013 16:11:59 GMT"}, {"version": "v4", "created": "Fri, 1 Feb 2013 14:59:59 GMT"}, {"version": "v5", "created": "Fri, 15 Feb 2013 17:41:14 GMT"}, {"version": "v6", "created": "Tue, 25 Feb 2014 17:35:36 GMT"}], "update_date": "2014-02-26", "authors_parsed": [["Crampes", "Michel", ""], ["Plantié", "Michel", ""]]}]