[{"id": "1306.0364", "submitter": "Christian Kleiber", "authors": "Christian Kleiber", "title": "On moment indeterminacy of the Benini income distribution", "comments": "10 pages, 1 figure", "journal-ref": "Statistical Papers, 2013, Vol. 54, No. 4, 1121-1130", "doi": "10.1007/s00362-013-0535-9", "report-no": null, "categories": "stat.OT math.PR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The Benini distribution is a lognormal-like distribution generalizing the\nPareto distribution. Like the Pareto and the lognormal distributions it was\noriginally proposed for modeling economic size distributions, notably the size\ndistribution of personal income. This paper explores a probabilistic property\nof the Benini distribution, showing that it is not determined by the sequence\nof its moments although all the moments are finite. It also provides explicit\nexamples of distributions possessing the same set of moments. Related\ndistributions are briefly explored.\n", "versions": [{"version": "v1", "created": "Mon, 3 Jun 2013 11:37:35 GMT"}], "update_date": "2016-08-19", "authors_parsed": [["Kleiber", "Christian", ""]]}, {"id": "1306.3395", "submitter": "Joachim Kaldasch", "authors": "Joachim Kaldasch", "title": "Evolutionary Model of a Anonymous Consumer Durable Market", "comments": "preprint", "journal-ref": "Physica A 390(2011)2692 2715", "doi": null, "report-no": null, "categories": "q-fin.GN nlin.AO stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An analytic model is presented that considers the evolution of a market of\ndurable goods. The model suggests that after introduction goods spread always\naccording to a Bass diffusion. However, this phase will be followed by a\ndiffusion process for durable consumer goods governed by a\nvariation-selection-reproduction mechanism and the growth dynamics can be\ndescribed by a replicator equation. Describing the aggregate sales as the sum\nof first, multiple and replacement purchase the product life cycle can be\nderived. Replacement purchase causes periodic variations of the sales\ndetermined by the finite lifetime of the good (Juglar cycles). The model\nsuggests that both, Bass- and Gompertz diffusion may contribute to the product\nlife cycle of a consumer durable. The theory contains the standard equilibrium\nview of a market as a special case. It depends on the time scale, whether an\nequilibrium or evolutionary description is more appropriate. The evolutionary\nframework is used to derive also the size, growth rate and price distribution\nof manufacturing business units. It predicts that the size distribution of the\nbusiness units (products) is lognormal, while the growth rates exhibit a\nLaplace distribution. Large price deviations from the mean price are also\ngoverned by a Laplace distribution (fat tails). These results are in agreement\nwith empirical findings. The explicit comparison of the time evolution of\nconsumer durables with empirical investigations confirms the close relationship\nbetween price decline and Gompertz diffusion, while the product life cycle can\nbe described qualitatively for a long time period.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2013 13:43:40 GMT"}], "update_date": "2013-06-17", "authors_parsed": [["Kaldasch", "Joachim", ""]]}]