[{"id": "1307.4101", "submitter": "Jose Acacio de Barros", "authors": "J. Acacio de Barros", "title": "Decision Making for Inconsistent Expert Judgments Using Negative\n  Probabilities", "comments": "14 pages, revised version to appear in the Proceedings of the QI2013\n  (Quantum Interactions) conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT cs.AI math.ST quant-ph stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we provide a simple random-variable example of inconsistent\ninformation, and analyze it using three different approaches: Bayesian,\nquantum-like, and negative probabilities. We then show that, at least for this\nparticular example, both the Bayesian and the quantum-like approaches have less\nnormative power than the negative probabilities one.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jul 2013 20:53:57 GMT"}, {"version": "v2", "created": "Thu, 26 Sep 2013 03:47:47 GMT"}], "update_date": "2013-09-27", "authors_parsed": [["de Barros", "J. Acacio", ""]]}, {"id": "1307.6307", "submitter": "Lutz Bornmann Dr.", "authors": "Lutz Bornmann", "title": "Is there currently a scientific revolution in scientometrics?", "comments": "Accepted for publication in the Journal of the American Society for\n  Information Science and Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The author of this letter to the editor would like to set forth the argument\nthat scientometrics is currently in a phase in which a taxonomic change, and\nhence a revolution, is taking place. One of the key terms in scientometrics is\nscientific impact which nowadays is understood to mean not only the impact on\nscience but the impact on every area of society.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2013 06:41:35 GMT"}], "update_date": "2013-07-25", "authors_parsed": [["Bornmann", "Lutz", ""]]}, {"id": "1307.7498", "submitter": "Lutz Bornmann Dr.", "authors": "Lutz Bornmann, Werner Marx, Andreas Barth", "title": "The normalization of citation counts based on classification systems", "comments": "Accepted for publication in the journal publications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  If we want to assess whether the paper in question has had a particularly\nhigh or low citation impact compared to other papers, the standard practice in\nbibliometrics is to normalize citations in respect of the subject category and\npublication year. A number of proposals for an improved procedure in the\nnormalization of citation impact have been put forward in recent years. Against\nthe background of these proposals this study describes an ideal solution for\nthe normalization of citation impact: in a first step, the reference set for\nthe publication in question is collated by means of a classification scheme,\nwhere every publication is associated with a single principal research field or\nsubfield entry (e. g. via Chemical Abstracts sections) and a publication year.\nIn a second step, percentiles of citation counts are calculated for this set\nand used to assign the normalized citation impact score to the publications\n(and also to the publication in question).\n", "versions": [{"version": "v1", "created": "Mon, 29 Jul 2013 08:42:07 GMT"}], "update_date": "2013-07-30", "authors_parsed": [["Bornmann", "Lutz", ""], ["Marx", "Werner", ""], ["Barth", "Andreas", ""]]}]