[{"id": "1503.00481", "submitter": "Benedikt Fecher", "authors": "Benedikt Fecher, Sascha Friesike, Marcel Hebing, Stephanie Linek and\n  Armin Sauermann", "title": "A Reputation Economy: Results from an Empirical Survey on Academic Data\n  Sharing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL stat.OT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Academic data sharing is a way for researchers to collaborate and thereby\nmeet the needs of an increasingly complex research landscape. It enables\nresearchers to verify results and to pursuit new research questions with \"old\"\ndata. It is therefore not surprising that data sharing is advocated by funding\nagencies, journals, and researchers alike. We surveyed 2661 individual academic\nresearchers across all disciplines on their dealings with data, their\npublication practices, and motives for sharing or withholding research data.\nThe results for 1564 valid responses show that researchers across disciplines\nrecognise the benefit of secondary research data for their own work and for\nscientific progress as a whole-still they only practice it in moderation. An\nexplanation for this evidence could be an academic system that is not driven by\nmonetary incentives, nor the desire for scientific progress, but by individual\nreputation-expressed in (high ranked journal) publications. We label this\nsystem a Reputation Economy. This special economy explains our findings that\nshow that researchers have a nuanced idea how to provide adequate formal\nrecognition for making data available to others-namely data citations. We\nconclude that data sharing will only be widely adopted among research\nprofessionals if sharing pays in form of reputation. Thus, policy measures that\nintend to foster research collaboration need to understand academia as a\nreputation economy. Successful measures must value intermediate products, such\nas research data, more highly than it is the case now.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2015 10:54:56 GMT"}], "update_date": "2015-03-03", "authors_parsed": [["Fecher", "Benedikt", ""], ["Friesike", "Sascha", ""], ["Hebing", "Marcel", ""], ["Linek", "Stephanie", ""], ["Sauermann", "Armin", ""]]}, {"id": "1503.00781", "submitter": "Deborah Nolan", "authors": "Deborah Nolan and Jamis Perrett", "title": "Teaching and Learning Data Visualization: Ideas and Assignments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article discusses how to make statistical graphics a more prominent\nelement of the undergraduate statistics curricula. The focus is on several\ndifferent types of assignments that exemplify how to incorporate graphics into\na course in a pedagogically meaningful way. These assignments include having\nstudents deconstruct and reconstruct plots, copy masterful graphs, create\none-minute visual revelations, convert tables into `pictures', and develop\ninteractive visualizations with, e.g., the virtual earth as a plotting canvas.\nIn addition to describing the goals and details of each assignment, we also\ndiscuss the broader topic of graphics and key concepts that we think warrant\ninclusion in the statistics curricula. We advocate that more attention needs to\nbe paid to this fundamental field of statistics at all levels, from\nintroductory undergraduate through graduate level courses. With the rapid rise\nof tools to visualize data, e.g., Google trends, GapMinder, ManyEyes, and\nTableau, and the increased use of graphics in the media, understanding the\nprinciples of good statistical graphics, and having the ability to create\ninformative visualizations is an ever more important aspect of statistics\neducation.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2015 23:11:28 GMT"}], "update_date": "2015-03-04", "authors_parsed": [["Nolan", "Deborah", ""], ["Perrett", "Jamis", ""]]}, {"id": "1503.02188", "submitter": "Nicholas Horton", "authors": "Nicholas Jon Horton", "title": "Challenges and opportunities for statistics and statistical education:\n  looking back, looking forward", "comments": "In press: The American Statistician", "journal-ref": null, "doi": "10.1080/00031305.2015.1032435", "report-no": null, "categories": "stat.OT stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 175th anniversary of the ASA provides an opportunity to look back into\nthe past and peer into the future. What led our forebears to found the\nassociation? What commonalities do we still see? What insights might we glean\nfrom their experiences and observations? I will use the anniversary as a chance\nto reflect on where we are now and where we are headed in terms of statistical\neducation amidst the growth of data science. Statistics is the science of\nlearning from data. By fostering more multivariable thinking, building\ndata-related skills, and developing simulation-based problem solving, we can\nhelp to ensure that statisticians are fully engaged in data science and the\nanalysis of the abundance of data now available to us.\n", "versions": [{"version": "v1", "created": "Sat, 7 Mar 2015 16:46:59 GMT"}, {"version": "v2", "created": "Sun, 15 Mar 2015 13:06:33 GMT"}, {"version": "v3", "created": "Tue, 28 Apr 2015 14:51:44 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Horton", "Nicholas Jon", ""]]}, {"id": "1503.02780", "submitter": "Paul Smaldino", "authors": "Richard McElreath and Paul E. Smaldino", "title": "Replication, Communication, and the Population Dynamics of Scientific\n  Discovery", "comments": null, "journal-ref": "PLOS ONE 10(8): e0136088 (2015)", "doi": "10.1371/journal.pone.0136088", "report-no": null, "categories": "stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many published research results are false, and controversy continues over the\nroles of replication and publication policy in improving the reliability of\nresearch. Addressing these problems is frustrated by the lack of a formal\nframework that jointly represents hypothesis formation, replication,\npublication bias, and variation in research quality. We develop a mathematical\nmodel of scientific discovery that combines all of these elements. This model\nprovides both a dynamic model of research as well as a formal framework for\nreasoning about the normative structure of science. We show that replication\nmay serve as a ratchet that gradually separates true hypotheses from false, but\nthe same factors that make initial findings unreliable also make replications\nunreliable. The most important factors in improving the reliability of research\nare the rate of false positives and the base rate of true hypotheses, and we\noffer suggestions for addressing each. Our results also bring clarity to verbal\ndebates about the communication of research. Surprisingly, publication bias is\nnot always an obstacle, but instead may have positive impacts---suppression of\nnegative novel findings is often beneficial. We also find that communication of\nnegative replications may aid true discovery even when attempts to replicate\nhave diminished power. The model speaks constructively to ongoing debates about\nthe design and conduct of science, focusing analysis and discussion on precise,\ninternally consistent models, as well as highlighting the importance of\npopulation dynamics.\n", "versions": [{"version": "v1", "created": "Tue, 10 Mar 2015 06:17:46 GMT"}, {"version": "v2", "created": "Thu, 16 Apr 2015 20:51:00 GMT"}, {"version": "v3", "created": "Tue, 28 Jul 2015 18:01:23 GMT"}], "update_date": "2015-08-27", "authors_parsed": [["McElreath", "Richard", ""], ["Smaldino", "Paul E.", ""]]}, {"id": "1503.04620", "submitter": "Myoungwon Cho", "authors": "Myoung Won Cho", "title": "Two symmetry breaking mechanisms for the development of orientation\n  selectivity in a neural system", "comments": null, "journal-ref": null, "doi": "10.3938/jkps.67.1661", "report-no": null, "categories": "q-bio.NC stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Orientation selectivity is a remarkable feature of the neurons located in the\nprimary visual cortex. Provided that the visual neurons acquire orientation\nselectivity through activity-dependent Hebbian learning, the development\nprocess could be understood as a kind of symmetry breaking phenomenon in the\nview of physics. The key mechanisms of the development process are examined\nhere in a neural system. Found is that there are at least two different\nmechanisms which lead to the development of orientation selectivity through\nbreaking the radial symmetry in receptive fields. The first, a simultaneous\nsymmetry breaking mechanism, bases on the competition between neighboring\nneurons, and the second, a spontaneous one, bases on the nonlinearity in\ninteractions. It turns out that only the second mechanism leads to the\nformation of a columnar pattern which characteristics accord with those\nobserved in an animal experiment.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2015 12:26:04 GMT"}], "update_date": "2016-01-20", "authors_parsed": [["Cho", "Myoung Won", ""]]}, {"id": "1503.05570", "submitter": "Benjamin Baumer", "authors": "Ben Baumer", "title": "A Data Science Course for Undergraduates: Thinking with Data", "comments": "21 pages total including supplementary materials", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT cs.CY stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data science is an emerging interdisciplinary field that combines elements of\nmathematics, statistics, computer science, and knowledge in a particular\napplication domain for the purpose of extracting meaningful information from\nthe increasingly sophisticated array of data available in many settings. These\ndata tend to be non-traditional, in the sense that they are often live, large,\ncomplex, and/or messy. A first course in statistics at the undergraduate level\ntypically introduces students with a variety of techniques to analyze small,\nneat, and clean data sets. However, whether they pursue more formal training in\nstatistics or not, many of these students will end up working with data that is\nconsiderably more complex, and will need facility with statistical computing\ntechniques. More importantly, these students require a framework for thinking\nstructurally about data. We describe an undergraduate course in a liberal arts\nenvironment that provides students with the tools necessary to apply data\nscience. The course emphasizes modern, practical, and useful skills that cover\nthe full data analysis spectrum, from asking an interesting question to\nacquiring, managing, manipulating, processing, querying, analyzing, and\nvisualizing data, as well communicating findings in written, graphical, and\noral forms.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2015 20:05:24 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Baumer", "Ben", ""]]}, {"id": "1503.06201", "submitter": "Akin Osman Kazakci", "authors": "Akin Osman (CGS), Kazak\\c{c}i Mines (CGS)", "title": "Data Science as a New Frontier for Design", "comments": "International Conference on Engineering Design, Jul 2015, Milan,\n  Italy", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to contribute to the challenge of transferring\nknow-how, theories and methods from design research to the design processes in\ninformation science and technologies. More specifically, we shall consider a\ndomain, namely data-science, that is becoming rapidly a globally invested\nresearch and development axis with strong imperatives for innovation given the\ndata deluge we are currently facing. We argue that, in order to rise to the\ndata-related challenges that the society is facing, data-science initiatives\nshould ensure a renewal of traditional research methodologies that are still\nlargely based on trial-error processes depending on the talent and insights of\na single (or a restricted group of) researchers. It is our claim that design\ntheories and methods can provide, at least to some extent, the much-needed\nframework. We will use a worldwide data-science challenge organized to study a\ntechnical problem in physics, namely the detection of Higgs boson, as a use\ncase to demonstrate some of the ways in which design theory and methods can\nhelp in analyzing and shaping the innovation dynamics in such projects.\n", "versions": [{"version": "v1", "created": "Fri, 20 Mar 2015 19:31:09 GMT"}], "update_date": "2015-03-23", "authors_parsed": [["Osman", "Akin", "", "CGS"], ["Mines", "Kazakçi", "", "CGS"]]}, {"id": "1503.08019", "submitter": "Mohamad Kazem Shirani Faradonbeh", "authors": "Mohamad Kazem Shirani Faradonbeh, Ambuj Tewari, George Michailidis", "title": "Optimality of Fast Matching Algorithms for Random Networks with\n  Applications to Structural Controllability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.SY stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network control refers to a very large and diverse set of problems including\ncontrollability of linear time-invariant dynamical systems, where the objective\nis to select an appropriate input to steer the network to a desired state.\nThere are many notions of controllability, one of them being structural\ncontrollability, which is intimately connected to finding maximum matchings on\nthe underlying network topology. In this work, we study fast, scalable\nalgorithms for finding maximum matchings for a large class of random networks.\nFirst, we illustrate that degree distribution random networks are realistic\nmodels for real networks in terms of structural controllability. Subsequently,\nwe analyze a popular, fast and practical heuristic due to Karp and Sipser as\nwell as a simplification of it. For both heuristics, we establish asymptotic\noptimality and provide results concerning the asymptotic size of maximum\nmatchings for an extensive class of random networks.\n", "versions": [{"version": "v1", "created": "Fri, 27 Mar 2015 10:52:40 GMT"}, {"version": "v2", "created": "Thu, 24 Mar 2016 04:37:16 GMT"}], "update_date": "2016-03-25", "authors_parsed": [["Faradonbeh", "Mohamad Kazem Shirani", ""], ["Tewari", "Ambuj", ""], ["Michailidis", "George", ""]]}, {"id": "1503.08278", "submitter": "Stefano Favaro", "authors": "M. De Iorio, L.T. Elliott, S. Favaro, K. Adhikari, Y.W. Teh", "title": "Modeling population structure under hierarchical Dirichlet processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP stat.ME stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a Bayesian nonparametric model to infer population admixture,\nextending the Hierarchical Dirichlet Process to allow for correlation between\nloci due to Linkage Disequilibrium. Given multilocus genotype data from a\nsample of individuals, the model allows inferring classifying individuals as\nunadmixed or admixed, inferring the number of subpopulations ancestral to an\nadmixed population and the population of origin of chromosomal regions. Our\nmodel does not assume any specific mutation process and can be applied to most\nof the commonly used genetic markers. We present a MCMC algorithm to perform\nposterior inference from the model and discuss methods to summarise the MCMC\noutput for the analysis of population admixture. We demonstrate the performance\nof the proposed model in simulations and in a real application, using genetic\ndata from the EDAR gene, which is considered to be ancestry-informative due to\nwell-known variations in allele frequency as well as phenotypic effects across\nancestry. The structure analysis of this dataset leads to the identification of\na rare haplotype in Europeans.\n", "versions": [{"version": "v1", "created": "Sat, 28 Mar 2015 07:41:16 GMT"}], "update_date": "2015-03-31", "authors_parsed": [["De Iorio", "M.", ""], ["Elliott", "L. T.", ""], ["Favaro", "S.", ""], ["Adhikari", "K.", ""], ["Teh", "Y. W.", ""]]}, {"id": "1503.08653", "submitter": "Ali Akbar Jafari", "authors": "Saeid Tahmasebi and Ali Akbar Jafari", "title": "Exponentiated Extended Weibull-Power Series Class of Distributions", "comments": "Accepted for publication Ciencia e Natura Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a new class of distributions by compounding the\nexponentiated extended Weibull family and power series family. This\ndistribution contains several lifetime models such as the complementary\nextended Weibull-power series, generalized exponential-power series,\ngeneralized linear failure rate-power series, exponentiated Weibull-power\nseries, generalized modified Weibull-power series, generalized Gompertz-power\nseries and exponentiated extended Weibull distributions as special cases. We\nobtain several properties of this new class of distributions such as Shannon\nentropy, mean residual life, hazard rate function, quantiles and moments. The\nmaximum likelihood estimation procedure via a EM-algorithm is presented.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2015 12:27:28 GMT"}], "update_date": "2015-03-31", "authors_parsed": [["Tahmasebi", "Saeid", ""], ["Jafari", "Ali Akbar", ""]]}, {"id": "1503.09072", "submitter": "Alon Drory", "authors": "Alon Drory", "title": "Failure and Uses of Jaynes' Principle of Transformation Groups", "comments": "4 figures. Accepted for publication by Foundations of Physics", "journal-ref": "Found Phys (2015) 45: 439", "doi": "10.1007/s10701-015-9876-7", "report-no": null, "categories": "stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bertand's paradox is a fundamental problem in probability that casts doubt on\nthe applicability of the indifference principle by showing that it may yield\ncontradictory results, depending on the meaning assigned to \"randomness\".\nJaynes claimed that symmetry requirements (the principle of transformation\ngroups) solve the paradox by selecting a unique solution to the problem. I show\nthat this is not the case and that every variant obtained from the principle of\nindifference can also be obtained from Jaynes' principle of transformation\ngroups. This is because the same symmetries can be mathematically implemented\nin different ways, depending on the procedure of random selection that one\nuses. I describe a simple experiment that supports a result from symmetry\narguments, but the solution is different from Jaynes'. Jaynes' method is thus\nbest seen as a tool to obtain probability distributions when the principle of\nindifference is inconvenient, but it cannot resolve ambiguities inherent in the\nuse of that principle and still depends on explicitly defining the selection\nprocedure.\n", "versions": [{"version": "v1", "created": "Tue, 3 Feb 2015 12:41:45 GMT"}], "update_date": "2019-10-25", "authors_parsed": [["Drory", "Alon", ""]]}]