[{"id": "0706.0427", "submitter": "Jidong Zhong", "authors": "Jidong Zhong", "title": "Watermark Embedding and Detection", "comments": "PhD Dissertation (157 pages), Shanghai Jiaotong Universtiy, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": null, "abstract": "  The embedder and the detector (or decoder) are the two most important\ncomponents of the digital watermarking systems. Thus in this work, we discuss\nhow to design a better embedder and detector (or decoder). I first give a\nsummary of the prospective applications of watermarking technology and major\nwatermarking schemes in the literature. My review on the literature closely\ncenters upon how the side information is exploited at both embedders and\ndetectors. In Chapter 3, I explore the optimum detector or decoder according to\na particular probability distribution of the host signals. We found that the\nperformance of both multiplicative and additive spread spectrum schemes depends\non the shape parameter of the host signals. For spread spectrum schemes, the\nperformance of the detector or the decoder is reduced by the host interference.\nThus I present a new host-interference rejection technique for the\nmultiplicative spread spectrum schemes. Its embedding rule is tailored to the\noptimum detection or decoding rule. Though the host interference rejection\nschemes enjoy a big performance gain over the traditional spread spectrum\nschemes, their drawbacks that it is difficult for them to be implemented with\nthe perceptual analysis to achieve the maximum allowable embedding level\ndiscourage their use in real scenarios. Thus, in the last chapters of this\nwork, I introduce a double-sided technique to tackle this drawback. It differs\nfrom the host interference rejection schemes in that it utilizes but does not\nreject the host interference at its embedder. The perceptual analysis can be\neasily implemented in our scheme to achieve the maximum allowable level of\nembedding strength.\n", "versions": [{"version": "v1", "created": "Sat, 2 Jun 2007 05:37:34 GMT"}], "update_date": "2007-06-13", "authors_parsed": [["Zhong", "Jidong", ""]]}, {"id": "0706.0430", "submitter": "Shishir Nagaraja", "authors": "Shishir Nagaraja", "title": "Anonymity in the Wild: Mixes on unstructured networks", "comments": "published in Privacy Enhancing Technologies 2007, Ottawa", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": null, "abstract": "  As decentralized computing scenarios get ever more popular, unstructured\ntopologies are natural candidates to consider running mix networks upon. We\nconsider mix network topologies where mixes are placed on the nodes of an\nunstructured network, such as social networks and scale-free random networks.\nWe explore the efficiency and traffic analysis resistance properties of mix\nnetworks based on unstructured topologies as opposed to theoretically optimal\nstructured topologies, under high latency conditions. We consider a mix of\ndirected and undirected network models, as well as one real world case study --\nthe LiveJournal friendship network topology. Our analysis indicates that\nmix-networks based on scale-free and small-world topologies have, firstly,\nmix-route lengths that are roughly comparable to those in expander graphs;\nsecond, that compromise of the most central nodes has little effect on\nanonymization properties, and third, batch sizes required for warding off\nintersection attacks need to be an order of magnitude higher in unstructured\nnetworks in comparison with expander graph topologies.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2007 13:11:07 GMT"}], "update_date": "2007-06-05", "authors_parsed": [["Nagaraja", "Shishir", ""]]}, {"id": "0706.0447", "submitter": "Francois Rodier", "authors": "Fran\\c{c}ois Rodier (IML), Eric F\\'erard (GAATI)", "title": "Non lin\\'earit\\'e des fonctions bool\\'eennes donn\\'ees par des traces de\n  polyn\\^omes de degr\\'e binaire 3", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.CR cs.DM math.AG", "license": null, "abstract": "  Nous \\'etudions la non lin\\'earit\\'e des fonctions d\\'efinies sur F_{2^m}\no\\`u $m$ est un entier impair, associ\\'ees aux polyn\\^omes de degr\\'e 7 ou \\`a\ndes polyn\\^omes plus g\\'en\\'eraux.\n  -----\n  We study the nonlinearity of the functions defined on F_{2^m} where $m$ is an\nodd integer, associated to the polynomials of degree 7 or more general\npolynomials.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2007 14:37:29 GMT"}], "update_date": "2007-06-05", "authors_parsed": [["Rodier", "François", "", "IML"], ["Férard", "Eric", "", "GAATI"]]}, {"id": "0706.0502", "submitter": "Eugen Zalinescu", "authors": "Veronique Cortier, Michael Rusinovitch, Eugen Zalinescu", "title": "Relating two standard notions of secrecy", "comments": "29 pages, published in LMCS", "journal-ref": "Logical Methods in Computer Science, Volume 3, Issue 3 (July 6,\n  2007) lmcs:1093", "doi": "10.2168/LMCS-3(3:2)2007", "report-no": null, "categories": "cs.CR cs.LO", "license": null, "abstract": "  Two styles of definitions are usually considered to express that a security\nprotocol preserves the confidentiality of a data s. Reachability-based secrecy\nmeans that s should never be disclosed while equivalence-based secrecy states\nthat two executions of a protocol with distinct instances for s should be\nindistinguishable to an attacker. Although the second formulation ensures a\nhigher level of security and is closer to cryptographic notions of secrecy,\ndecidability results and automatic tools have mainly focused on the first\ndefinition so far.\n  This paper initiates a systematic investigation of the situations where\nsyntactic secrecy entails strong secrecy. We show that in the passive case,\nreachability-based secrecy actually implies equivalence-based secrecy for\ndigital signatures, symmetric and asymmetric encryption provided that the\nprimitives are probabilistic. For active adversaries, we provide sufficient\n(and rather tight) conditions on the protocol for this implication to hold.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2007 19:30:33 GMT"}, {"version": "v2", "created": "Fri, 6 Jul 2007 09:06:10 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Cortier", "Veronique", ""], ["Rusinovitch", "Michael", ""], ["Zalinescu", "Eugen", ""]]}, {"id": "0706.1019", "submitter": "Flavio Garcia", "authors": "Flavio D. Garcia, Peter van Rossum, and Ana Sokolova", "title": "Probabilistic Anonymity and Admissible Schedulers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": null, "abstract": "  When studying safety properties of (formal) protocol models, it is customary\nto view the scheduler as an adversary: an entity trying to falsify the safety\nproperty. We show that in the context of security protocols, and in particular\nof anonymizing protocols, this gives the adversary too much power; for\ninstance, the contents of encrypted messages and internal computations by the\nparties should be considered invisible to the adversary.\n  We restrict the class of schedulers to a class of admissible schedulers which\nbetter model adversarial behaviour. These admissible schedulers base their\ndecision solely on the past behaviour of the system that is visible to the\nadversary.\n  Using this, we propose a definition of anonymity: for all admissible\nschedulers the identity of the users and the observations of the adversary are\nindependent stochastic variables. We also develop a proof technique for typical\ncases that can be used to proof anonymity: a system is anonymous if it is\npossible to `exchange' the behaviour of two users without the adversary\n`noticing'.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2007 15:17:52 GMT"}], "update_date": "2007-06-08", "authors_parsed": [["Garcia", "Flavio D.", ""], ["van Rossum", "Peter", ""], ["Sokolova", "Ana", ""]]}, {"id": "0706.1755", "submitter": "Kirill Bolshakov", "authors": "Kirill Bolshakov (1), Elena Reshetova (1) ((1) Saint-Petersburg State\n  University of Aerospace Instrumentation)", "title": "FreeBSD Mandatory Access Control Usage for Implementing Enterprise\n  Security Policies", "comments": "6 pages, 3 figures, submitted to XI International Symposium \"Problems\n  of redundancy in information and control systems\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": null, "abstract": "  FreeBSD was one of the first widely deployed free operating systems to\nprovide mandatory access control. It supports a number of classic MAC models.\nThis tutorial paper addresses exploiting this implementation to enforce typical\nenterprise security policies of varying complexities.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2007 18:11:15 GMT"}], "update_date": "2007-06-13", "authors_parsed": [["Bolshakov", "Kirill", ""], ["Reshetova", "Elena", ""]]}, {"id": "0706.2010", "submitter": "Anne Broadbent", "authors": "Anne Broadbent and Alain Tapp", "title": "Information-theoretic security without an honest majority", "comments": "15 pages, to appear in Proceedings of ASIACRYPT 2007", "journal-ref": "Proceedings of ASIACRYPT 2007 pp. 410-426", "doi": "10.1007/978-3-540-76900-2_25", "report-no": null, "categories": "cs.CR", "license": null, "abstract": "  We present six multiparty protocols with information-theoretic security that\ntolerate an arbitrary number of corrupt participants. All protocols assume\npairwise authentic private channels and a broadcast channel (in a single case,\nwe require a simultaneous broadcast channel). We give protocols for veto, vote,\nanonymous bit transmission, collision detection, notification and anonymous\nmessage transmission. Not assuming an honest majority, in most cases, a single\ncorrupt participant can make the protocol abort. All protocols achieve\nfunctionality never obtained before without the use of either computational\nassumptions or of an honest majority.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2007 23:05:40 GMT"}], "update_date": "2016-01-06", "authors_parsed": [["Broadbent", "Anne", ""], ["Tapp", "Alain", ""]]}, {"id": "0706.2025", "submitter": "Sapon Tanachaiwiwat", "authors": "Sapon Tanachaiwiwat, Ahmed Helmy", "title": "On the Performance Evaluation of Encounter-based Worm Interactions Based\n  on Node Characteristics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": null, "abstract": "  An encounter-based network is a frequently disconnected wireless ad-hoc\nnetwork requiring nearby neighbors to store and forward data utilizing mobility\nand encounters over time. Using traditional approaches such as gateways or\nfirewalls for deterring worm propagation in encounter-based networks is\ninappropriate. Because this type of network is highly dynamic and has no\nspecific boundary, a distributed counter-worm mechanism is needed. We propose\nmodels for the worm interaction approach that relies upon automated beneficial\nworm generation to alleviate problems of worm propagation in such networks. We\nstudy and analyze the impact of key mobile node characteristics including node\ncooperation, immunization, on-off behavior on the worm propagations and\ninteractions. We validate our proposed model using extensive simulations. We\nalso find that, in addition to immunization, cooperation can reduce the level\nof worm infection. Furthermore, on-off behavior linearly impacts only timing\naspect but not the overall infection. Using realistic mobile network\nmeasurements, we find that encounters are non-uniform, the trends are\nconsistent with the model but the magnitudes are drastically different.\nImmunization seems to be the most effective in such scenarios. These findings\nprovide insight that we hope would aid to develop counter-worm protocols in\nfuture encounter-based networks.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2007 02:23:01 GMT"}], "update_date": "2007-06-15", "authors_parsed": [["Tanachaiwiwat", "Sapon", ""], ["Helmy", "Ahmed", ""]]}, {"id": "0706.2606", "submitter": "Christian Schaffner", "authors": "Serge Fehr, Christian Schaffner", "title": "Randomness Extraction via Delta-Biased Masking in the Presence of a\n  Quantum Attacker", "comments": "17 pages, v2: mainly editorial changes taking into account referee\n  comments", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR", "license": null, "abstract": "  Randomness extraction is of fundamental importance for information-theoretic\ncryptography. It allows to transform a raw key about which an attacker has some\nlimited knowledge into a fully secure random key, on which the attacker has\nessentially no information. Up to date, only very few randomness-extraction\ntechniques are known to work against an attacker holding quantum information on\nthe raw key. This is very much in contrast to the classical (non-quantum)\nsetting, which is much better understood and for which a vast amount of\ndifferent techniques are known and proven to work.\n  We prove a new randomness-extraction technique, which is known to work in the\nclassical setting, to be secure against a quantum attacker as well. Randomness\nextraction is done by XOR'ing a so-called delta-biased mask to the raw key. Our\nresult allows to extend the classical applications of this extractor to the\nquantum setting. We discuss the following two applications. We show how to\nencrypt a long message with a short key, information-theoretically secure\nagainst a quantum attacker, provided that the attacker has enough quantum\nuncertainty on the message. This generalizes the concept of entropically-secure\nencryption to the case of a quantum attacker. As second application, we show\nhow to do error-correction without leaking partial information to a quantum\nattacker. Such a technique is useful in settings where the raw key may contain\nerrors, since standard error-correction techniques may provide the attacker\nwith information on, say, a secret key that was used to obtain the raw key.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2007 14:16:02 GMT"}, {"version": "v2", "created": "Thu, 13 Dec 2007 09:19:49 GMT"}], "update_date": "2007-12-13", "authors_parsed": [["Fehr", "Serge", ""], ["Schaffner", "Christian", ""]]}, {"id": "0706.2888", "submitter": "James Harold Thomas", "authors": "James Harold Thomas", "title": "Variations on Kak's Three Stage Quantum Cryptography Protocol", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": null, "abstract": "  This paper introduces a variation on Kak's three-stage quanutm key\ndistribution protocol which allows for defence against the man in the middle\nattack. In addition, we introduce a new protocol, which also offers similar\nresiliance against such an attack.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2007 23:04:18 GMT"}], "update_date": "2007-06-21", "authors_parsed": [["Thomas", "James Harold", ""]]}, {"id": "0706.3076", "submitter": "Shiguo Lian", "authors": "Shiguo Lian, Zhongxuan Liu, Zhen Ren, Haila Wang", "title": "On the Performance of Joint Fingerprint Embedding and Decryption Scheme", "comments": "10 pages,9 figures. To be submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": null, "abstract": "  Till now, few work has been done to analyze the performances of joint\nfingerprint embedding and decryption schemes. In this paper, the security of\nthe joint fingerprint embedding and decryption scheme proposed by Kundur et al.\nis analyzed and improved. The analyses include the security against\nunauthorized customer, the security against authorized customer, the\nrelationship between security and robustness, the relationship between\nsecu-rity and imperceptibility and the perceptual security. Based these\nanalyses, some means are proposed to strengthen the system, such as multi-key\nencryp-tion and DC coefficient encryption. The method can be used to analyze\nother JFD schemes. It is expected to provide valuable information to design JFD\nschemes.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2007 02:44:44 GMT"}], "update_date": "2007-06-22", "authors_parsed": [["Lian", "Shiguo", ""], ["Liu", "Zhongxuan", ""], ["Ren", "Zhen", ""], ["Wang", "Haila", ""]]}, {"id": "0706.3146", "submitter": "Hao Hu", "authors": "Hao Hu, Steven Myers, Vittoria Colizza, Alessandro Vespignani", "title": "WiFi Epidemiology: Can Your Neighbors' Router Make Yours Sick?", "comments": "22 pages, 1 table, 4 figures", "journal-ref": "Proceedings of the National Academy of Sciences, vol. 106, no. 5,\n  1318-1323 (2009)", "doi": "10.1073/pnas.0811973106", "report-no": null, "categories": "cs.CR physics.soc-ph", "license": null, "abstract": "  In densely populated urban areas WiFi routers form a tightly interconnected\nproximity network that can be exploited as a substrate for the spreading of\nmalware able to launch massive fraudulent attack and affect entire urban areas\nWiFi networks. In this paper we consider several scenarios for the deployment\nof malware that spreads solely over the wireless channel of major urban areas\nin the US. We develop an epidemiological model that takes into consideration\nprevalent security flaws on these routers. The spread of such a contagion is\nsimulated on real-world data for geo-referenced wireless routers. We uncover a\nmajor weakness of WiFi networks in that most of the simulated scenarios show\ntens of thousands of routers infected in as little time as two weeks, with the\nmajority of the infections occurring in the first 24 to 48 hours. We indicate\npossible containment and prevention measure to limit the eventual harm of such\nan attack.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2007 19:36:21 GMT"}], "update_date": "2009-02-11", "authors_parsed": [["Hu", "Hao", ""], ["Myers", "Steven", ""], ["Colizza", "Vittoria", ""], ["Vespignani", "Alessandro", ""]]}, {"id": "0706.3305", "submitter": "Ayan Mahalanobis", "authors": "Ayan Mahalanobis", "title": "A simple generalization of the ElGamal cryptosystem to non-abelian\n  groups II", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is a study of the MOR cryptosystem using the special linear group over\nfinite fields. The automorphism group of the special linear group is analyzed\nfor this purpose. At our current state of knowledge, I show that the MOR\ncryptosystem has better security than the ElGamal cryptosystem over finite\nfields.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2007 10:28:28 GMT"}, {"version": "v2", "created": "Wed, 27 Jun 2007 16:41:57 GMT"}, {"version": "v3", "created": "Sat, 29 Dec 2007 21:36:10 GMT"}, {"version": "v4", "created": "Fri, 6 Mar 2009 19:09:55 GMT"}, {"version": "v5", "created": "Tue, 25 Jan 2011 04:57:52 GMT"}], "update_date": "2011-01-26", "authors_parsed": [["Mahalanobis", "Ayan", ""]]}, {"id": "0706.3752", "submitter": "Ruoheng Liu", "authors": "Ruoheng Liu, Yingbin Liang, H. Vincent Poor, and Predrag Spasojevic", "title": "Secure Nested Codes for Type II Wiretap Channels", "comments": "To appear in the Proceedings of the 2007 IEEE Information Theory\n  Workshop on Frontiers in Coding Theory, Lake Tahoe, CA, September 2-6, 2007", "journal-ref": null, "doi": "10.1109/ITW.2007.4313097", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": null, "abstract": "  This paper considers the problem of secure coding design for a type II\nwiretap channel, where the main channel is noiseless and the eavesdropper\nchannel is a general binary-input symmetric-output memoryless channel. The\nproposed secure error-correcting code has a nested code structure. Two secure\nnested coding schemes are studied for a type II Gaussian wiretap channel. The\nnesting is based on cosets of a good code sequence for the first scheme and on\ncosets of the dual of a good code sequence for the second scheme. In each case,\nthe corresponding achievable rate-equivocation pair is derived based on the\nthreshold behavior of good code sequences. The two secure coding schemes\ntogether establish an achievable rate-equivocation region, which almost covers\nthe secrecy capacity-equivocation region in this case study. The proposed\nsecure coding scheme is extended to a type II binary symmetric wiretap channel.\nA new achievable perfect secrecy rate, which improves upon the previously\nreported result by Thangaraj et al., is derived for this channel.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jun 2007 03:57:34 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Liu", "Ruoheng", ""], ["Liang", "Yingbin", ""], ["Poor", "H. Vincent", ""], ["Spasojevic", "Predrag", ""]]}, {"id": "0706.3812", "submitter": "Pierre Parrend", "authors": "Pierre Parrend (INRIA Rh\\^one-Alpes), St\\'ephane Fr\\'enot (INRIA\n  Rh\\^one-Alpes)", "title": "Java Components Vulnerabilities - An Experimental Classification\n  Targeted at the OSGi Platform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.OS", "license": null, "abstract": "  The OSGi Platform finds a growing interest in two different applications\ndomains: embedded systems, and applications servers. However, the security\nproperties of this platform are hardly studied, which is likely to hinder its\nuse in production systems. This is all the more important that the dynamic\naspect of OSGi-based applications, that can be extended at runtime, make them\nvulnerable to malicious code injection. We therefore perform a systematic audit\nof the OSGi platform so as to build a vulnerability catalog that intends to\nreference OSGi Vulnerabilities originating in the Core Specification, and in\nbehaviors related to the use of the Java language. Standard Services are not\nconsidered. To support this audit, a Semi-formal Vulnerability Pattern is\ndefined, that enables to uniquely characterize fundamental properties for each\nvulnerability, to include verbose description in the pattern, to reference\nknown security protections, and to track the implementation status of the\nproof-of-concept OSGi Bundles that exploit the vulnerability. Based on the\nanalysis of the catalog, a robust OSGi Platform is built, and recommendations\nare made to enhance the OSGi Specifications.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jun 2007 12:36:37 GMT"}, {"version": "v2", "created": "Wed, 27 Jun 2007 08:03:05 GMT"}, {"version": "v3", "created": "Fri, 27 Jul 2007 13:50:46 GMT"}], "update_date": "2011-11-10", "authors_parsed": [["Parrend", "Pierre", "", "INRIA Rhône-Alpes"], ["Frénot", "Stéphane", "", "INRIA\n  Rhône-Alpes"]]}, {"id": "0706.4035", "submitter": "Sapon Tanachaiwiwat", "authors": "Sapon Tanachaiwiwat, Ahmed Helmy", "title": "Encounter-based worms: Analysis and Defense", "comments": "Submitted to a journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": null, "abstract": "  Encounter-based network is a frequently-disconnected wireless ad-hoc network\nrequiring immediate neighbors to store and forward aggregated data for\ninformation disseminations. Using traditional approaches such as gateways or\nfirewalls for deterring worm propagation in encounter-based networks is\ninappropriate. We propose the worm interaction approach that relies upon\nautomated beneficial worm generation aiming to alleviate problems of worm\npropagations in such networks. To understand the dynamic of worm interactions\nand its performance, we mathematically model worm interactions based on major\nworm interaction factors including worm interaction types, network\ncharacteristics, and node characteristics using ordinary differential equations\nand analyze their effects on our proposed metrics. We validate our proposed\nmodel using extensive synthetic and trace-driven simulations. We find that, all\nworm interaction factors significantly affect the pattern of worm propagations.\nFor example, immunization linearly decreases the infection of susceptible nodes\nwhile on-off behavior only impacts the duration of infection. Using realistic\nmobile network measurements, we find that encounters are bursty, multi-group\nand non-uniform. The trends from the trace-driven simulations are consistent\nwith the model, in general. Immunization and timely deployment seem to be the\nmost effective to counter the worm attacks in such scenarios while cooperation\nmay help in a specific case. These findings provide insight that we hope would\naid to develop counter-worm protocols in future encounter-based networks.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2007 18:01:50 GMT"}], "update_date": "2007-06-28", "authors_parsed": [["Tanachaiwiwat", "Sapon", ""], ["Helmy", "Ahmed", ""]]}]