[{"id": "0804.0506", "submitter": "Gesualdo Scutari", "authors": "Gesualdo Scutari and Sergio Barbarossa", "title": "Distributed Consensus over Wireless Sensor Networks Affected by\n  Multipath Fading", "comments": "Paper submitted to IEEE Transactions on Signal Processing, August\n  2007. Revised November 30, 2007. Accepted January 14, 2008", "journal-ref": null, "doi": "10.1109/TSP.2008.924857", "report-no": null, "categories": "cs.DC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The design of sensor networks capable of reaching a consensus on a globally\noptimal decision test, without the need for a fusion center, is a problem that\nhas received considerable attention in the last years. Many consensus\nalgorithms have been proposed, with convergence conditions depending on the\ngraph describing the interaction among the nodes. In most works, the graph is\nundirected and there are no propagation delays. Only recently, the analysis has\nbeen extended to consensus algorithms incorporating propagation delays. In this\nwork, we propose a consensus algorithm able to converge to a globally optimal\ndecision statistic, using a wideband wireless network, governed by a fairly\nsimple MAC mechanism, where each link is a multipath, frequency-selective,\nchannel. The main contribution of the paper is to derive necessary and\nsufficient conditions on the network topology and sufficient conditions on the\nchannel transfer functions guaranteeing the exponential convergence of the\nconsensus algorithm to a globally optimal decision value, for any bounded delay\ncondition.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2008 09:22:41 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Scutari", "Gesualdo", ""], ["Barbarossa", "Sergio", ""]]}, {"id": "0804.0862", "submitter": "Mark Braverman", "authors": "Mark Braverman", "title": "On ad hoc routing with guaranteed delivery", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We point out a simple poly-time log-space routing algorithm in ad hoc\nnetworks with guaranteed delivery using universal exploration sequences.\n", "versions": [{"version": "v1", "created": "Sat, 5 Apr 2008 16:16:38 GMT"}], "update_date": "2008-04-08", "authors_parsed": [["Braverman", "Mark", ""]]}, {"id": "0804.1115", "submitter": "Oskar Sandberg", "authors": "Olof Mogren, Oskar Sandberg, Vilhelm Verendel and Devdatt Dubhashi", "title": "Adaptive Dynamics of Realistic Small-World Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Continuing in the steps of Jon Kleinberg's and others celebrated work on\ndecentralized search in small-world networks, we conduct an experimental\nanalysis of a dynamic algorithm that produces small-world networks. We find\nthat the algorithm adapts robustly to a wide variety of situations in realistic\ngeographic networks with synthetic test data and with real world data, even\nwhen vertices are uneven and non-homogeneously distributed.\n  We investigate the same algorithm in the case where some vertices are more\npopular destinations for searches than others, for example obeying power-laws.\nWe find that the algorithm adapts and adjusts the networks according to the\ndistributions, leading to improved performance. The ability of the dynamic\nprocess to adapt and create small worlds in such diverse settings suggests a\npossible mechanism by which such networks appear in nature.\n", "versions": [{"version": "v1", "created": "Mon, 7 Apr 2008 19:39:59 GMT"}], "update_date": "2008-04-08", "authors_parsed": [["Mogren", "Olof", ""], ["Sandberg", "Oskar", ""], ["Verendel", "Vilhelm", ""], ["Dubhashi", "Devdatt", ""]]}, {"id": "0804.1448", "submitter": "Vincent Garcia", "authors": "Vincent Garcia, Eric Debreuve and Michel Barlaud", "title": "Fast k Nearest Neighbor Search using GPU", "comments": "13 pages, 2figures, submitted to CVGPU 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.DC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The recent improvements of graphics processing units (GPU) offer to the\ncomputer vision community a powerful processing platform. Indeed, a lot of\nhighly-parallelizable computer vision problems can be significantly accelerated\nusing GPU architecture. Among these algorithms, the k nearest neighbor search\n(KNN) is a well-known problem linked with many applications such as\nclassification, estimation of statistical properties, etc. The main drawback of\nthis task lies in its computation burden, as it grows polynomially with the\ndata size. In this paper, we show that the use of the NVIDIA CUDA API\naccelerates the search for the KNN up to a factor of 120.\n", "versions": [{"version": "v1", "created": "Wed, 9 Apr 2008 10:06:15 GMT"}], "update_date": "2008-04-10", "authors_parsed": [["Garcia", "Vincent", ""], ["Debreuve", "Eric", ""], ["Barlaud", "Michel", ""]]}, {"id": "0804.1607", "submitter": "Sundhar Ram Srinivasan", "authors": "S. Sundhar Ram, V. V. Veeravalli, and A. Nedic", "title": "Distributed and Recursive Parameter Estimation in Parametrized Linear\n  State-Space Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a network of sensors deployed to sense a spatio-temporal field\nand estimate a parameter of interest. We are interested in the case where the\ntemporal process sensed by each sensor can be modeled as a state-space process\nthat is perturbed by random noise and parametrized by an unknown parameter. To\nestimate the unknown parameter from the measurements that the sensors\nsequentially collect, we propose a distributed and recursive estimation\nalgorithm, which we refer to as the incremental recursive prediction error\nalgorithm. This algorithm has the distributed property of incremental gradient\nalgorithms and the on-line property of recursive prediction error algorithms.\nWe study the convergence behavior of the algorithm and provide sufficient\nconditions for its convergence. Our convergence result is rather general and\ncontains as special cases the known convergence results for the incremental\nversions of the least-mean square algorithm. Finally, we use the algorithm\ndeveloped in this paper to identify the source of a gas-leak (diffusing source)\nin a closed warehouse and also report numerical simulations to verify\nconvergence.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2008 03:47:05 GMT"}, {"version": "v2", "created": "Sat, 12 Apr 2008 14:45:10 GMT"}], "update_date": "2008-04-12", "authors_parsed": [["Ram", "S. Sundhar", ""], ["Veeravalli", "V. V.", ""], ["Nedic", "A.", ""]]}, {"id": "0804.2191", "submitter": "Novella Bartolini", "authors": "N. Bartolini, T. Calamoneri, E. G. Fusco, A. Massini, S. Silvestri", "title": "Push & Pull: autonomous deployment of mobile sensors for a complete\n  coverage", "comments": "Technical Report. This paper has been published on Wireless Networks,\n  Springer. Animations and the complete code of the proposed algorithm are\n  available for download at the address:\n  http://www.dsi.uniroma1.it/~novella/mobile_sensors/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile sensor networks are important for several strategic applications\ndevoted to monitoring critical areas. In such hostile scenarios, sensors cannot\nbe deployed manually and are either sent from a safe location or dropped from\nan aircraft. Mobile devices permit a dynamic deployment reconfiguration that\nimproves the coverage in terms of completeness and uniformity.\n  In this paper we propose a distributed algorithm for the autonomous\ndeployment of mobile sensors called Push&Pull. According to our proposal,\nmovement decisions are made by each sensor on the basis of locally available\ninformation and do not require any prior knowledge of the operating conditions\nor any manual tuning of key parameters.\n  We formally prove that, when a sufficient number of sensors are available,\nour approach guarantees a complete and uniform coverage. Furthermore, we\ndemonstrate that the algorithm execution always terminates preventing movement\noscillations.\n  Numerous simulations show that our algorithm reaches a complete coverage\nwithin reasonable time with moderate energy consumption, even when the target\narea has irregular shapes. Performance comparisons between Push&Pull and one of\nthe most acknowledged algorithms show how the former one can efficiently reach\na more uniform and complete coverage under a wide range of working scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 14 Apr 2008 14:38:52 GMT"}, {"version": "v2", "created": "Thu, 26 Jun 2008 15:23:54 GMT"}, {"version": "v3", "created": "Tue, 29 Jul 2008 13:43:10 GMT"}, {"version": "v4", "created": "Thu, 29 Jan 2009 14:58:50 GMT"}], "update_date": "2009-01-29", "authors_parsed": [["Bartolini", "N.", ""], ["Calamoneri", "T.", ""], ["Fusco", "E. G.", ""], ["Massini", "A.", ""], ["Silvestri", "S.", ""]]}, {"id": "0804.3351", "submitter": "Cinzia Di Giusto", "authors": "Cinzia Di Giusto, Maurizio Gabbrielli, Maria Chiara Meo", "title": "On the Expressive Power of Multiple Heads in CHR", "comments": "v.6 Minor changes, new formulation of definitions, changed some\n  details in the proofs", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.DC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Constraint Handling Rules (CHR) is a committed-choice declarative language\nwhich has been originally designed for writing constraint solvers and which is\nnowadays a general purpose language. CHR programs consist of multi-headed\nguarded rules which allow to rewrite constraints into simpler ones until a\nsolved form is reached. Many empirical evidences suggest that multiple heads\naugment the expressive power of the language, however no formal result in this\ndirection has been proved, so far.\n  In the first part of this paper we analyze the Turing completeness of CHR\nwith respect to the underneath constraint theory. We prove that if the\nconstraint theory is powerful enough then restricting to single head rules does\nnot affect the Turing completeness of the language. On the other hand,\ndifferently from the case of the multi-headed language, the single head CHR\nlanguage is not Turing powerful when the underlying signature (for the\nconstraint theory) does not contain function symbols.\n  In the second part we prove that, no matter which constraint theory is\nconsidered, under some reasonable assumptions it is not possible to encode the\nCHR language (with multi-headed rules) into a single headed language while\npreserving the semantics of the programs. We also show that, under some\nstronger assumptions, considering an increasing number of atoms in the head of\na rule augments the expressive power of the language.\n  These results provide a formal proof for the claim that multiple heads\naugment the expressive power of the CHR language.\n", "versions": [{"version": "v1", "created": "Mon, 21 Apr 2008 16:21:43 GMT"}, {"version": "v2", "created": "Wed, 25 Mar 2009 19:49:25 GMT"}, {"version": "v3", "created": "Wed, 15 Apr 2009 16:29:03 GMT"}, {"version": "v4", "created": "Mon, 8 Feb 2010 18:22:39 GMT"}, {"version": "v5", "created": "Fri, 5 Nov 2010 21:19:52 GMT"}, {"version": "v6", "created": "Tue, 18 Jan 2011 11:03:53 GMT"}], "update_date": "2011-01-19", "authors_parsed": [["Di Giusto", "Cinzia", ""], ["Gabbrielli", "Maurizio", ""], ["Meo", "Maria Chiara", ""]]}, {"id": "0804.3417", "submitter": "Nicholas M. Ball", "authors": "Nicholas M. Ball (1), Robert J. Brunner (1 and 2), Adam D. Myers (1)\n  ((1) Department of Astronomy, University of Illinois at Urbana-Champaign, (2)\n  National Center for Supercomputing Applications, Urbana-Champaign)", "title": "Robust Machine Learning Applied to Terascale Astronomical Datasets", "comments": "11 pages, 2 figures, uses llncs.cls. To appear in the 9th LCI\n  International Conference on High-Performance Clustered Computing", "journal-ref": null, "doi": null, "report-no": "Not arXiv:0710.4482", "categories": "astro-ph cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present recent results from the LCDM (Laboratory for Cosmological Data\nMining; http://lcdm.astro.uiuc.edu) collaboration between UIUC Astronomy and\nNCSA to deploy supercomputing cluster resources and machine learning algorithms\nfor the mining of terascale astronomical datasets. This is a novel application\nin the field of astronomy, because we are using such resources for data mining,\nand not just performing simulations. Via a modified implementation of the NCSA\ncyberenvironment Data-to-Knowledge, we are able to provide improved\nclassifications for over 100 million stars and galaxies in the Sloan Digital\nSky Survey, improved distance measures, and a full exploitation of the simple\nbut powerful k-nearest neighbor algorithm. A driving principle of this work is\nthat our methods should be extensible from current terascale datasets to\nupcoming petascale datasets and beyond. We discuss issues encountered to-date,\nand further issues for the transition to petascale. In particular, disk I/O\nwill become a major limiting factor unless the necessary infrastructure is\nimplemented.\n", "versions": [{"version": "v1", "created": "Mon, 21 Apr 2008 21:58:18 GMT"}], "update_date": "2008-04-29", "authors_parsed": [["Ball", "Nicholas M.", "", "1 and 2"], ["Brunner", "Robert J.", "", "1 and 2"], ["Myers", "Adam D.", ""]]}, {"id": "0804.4039", "submitter": "Ioannis Chatzigiannakis", "authors": "Ioannis Chatzigiannakis, Georgios Giannoulis and Paul G. Spirakis", "title": "Energy and Time Efficient Scheduling of Tasks with Dependencies on\n  Asymmetric Multiprocessors", "comments": null, "journal-ref": null, "doi": null, "report-no": "RACTI-RU1-2008-10", "categories": "cs.DC cs.DS cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we study the problem of scheduling tasks with dependencies in\nmultiprocessor architectures where processors have different speeds. We present\nthe preemptive algorithm \"Save-Energy\" that given a schedule of tasks it post\nprocesses it to improve the energy efficiency without any deterioration of the\nmakespan. In terms of time efficiency, we show that preemptive scheduling in an\nasymmetric system can achieve the same or better optimal makespan than in a\nsymmetric system. Motivited by real multiprocessor systems, we investigate\narchitectures that exhibit limited asymmetry: there are two essentially\ndifferent speeds. Interestingly, this special case has not been studied in the\nfield of parallel computing and scheduling theory; only the general case was\nstudied where processors have $K$ essentially different speeds. We present the\nnon-preemptive algorithm ``Remnants'' that achieves almost optimal makespan. We\nprovide a refined analysis of a recent scheduling method. Based on this\nanalysis, we specialize the scheduling policy and provide an algorithm of $(3 +\no(1))$ expected approximation factor. Note that this improves the previous best\nfactor (6 for two speeds). We believe that our work will convince researchers\nto revisit this well studied scheduling problem for these simple, yet\nrealistic, asymmetric multiprocessor architectures.\n", "versions": [{"version": "v1", "created": "Fri, 25 Apr 2008 03:16:21 GMT"}, {"version": "v2", "created": "Fri, 6 Jun 2008 14:21:18 GMT"}], "update_date": "2008-06-09", "authors_parsed": [["Chatzigiannakis", "Ioannis", ""], ["Giannoulis", "Georgios", ""], ["Spirakis", "Paul G.", ""]]}, {"id": "0804.4590", "submitter": "Jean-Christophe Dubacq", "authors": "Heithem Abbes (LIPN, UTIC), Christophe C\\'erin (LIPN), Jean-Christophe\n  Dubacq (LIPN), Mohamed Jemni (UTIC)", "title": "\\'Etude de performance des syst\\`emes de d\\'ecouverte de ressources", "comments": "Publication on CDROM only", "journal-ref": "Dans Actes de Fribourg'2008 : Renpar'18 / SympA'2008 / CFSE'6 -\n  Renpar'18, Fribourg : Suisse (2008)", "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Desktop Grid offers solutions to overcome several challenges and to\nanswer increasingly needs of scientific computing. This technology consists\nmainly in exploiting PC resources, geographically dispersed, to treat time\nconsuming applications and/or important storage capacity requiring\napplications. However, as resources number increases, the need for scalability,\nself-organisation, dynamic reconfiguration, decentralization and performance\nbecomes more and more essential. In this context, this paper evaluates the\nscalability and performance of P2P tools for registering and discovering\nservices (Publish/Subscribe systems). Three protocols are used in this purpose:\nBonjour, Avahi and Pastry. We have studied the behaviour of these protocols\nrelated to two criteria: the elapsed time for registrations services and the\nneeded time to discover new services.\n", "versions": [{"version": "v1", "created": "Tue, 29 Apr 2008 11:51:19 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Abbes", "Heithem", "", "LIPN, UTIC"], ["Cérin", "Christophe", "", "LIPN"], ["Dubacq", "Jean-Christophe", "", "LIPN"], ["Jemni", "Mohamed", "", "UTIC"]]}, {"id": "0804.4815", "submitter": "Jukka Suomela", "authors": "Patrik Flor\\'een, Marja Hassinen, Petteri Kaski, Jukka Suomela", "title": "Tight local approximation results for max-min linear programs", "comments": "16 pages", "journal-ref": null, "doi": "10.1007/978-3-540-92862-1_2", "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a bipartite max-min LP, we are given a bipartite graph $\\myG = (V \\cup I\n\\cup K, E)$, where each agent $v \\in V$ is adjacent to exactly one constraint\n$i \\in I$ and exactly one objective $k \\in K$. Each agent $v$ controls a\nvariable $x_v$. For each $i \\in I$ we have a nonnegative linear constraint on\nthe variables of adjacent agents. For each $k \\in K$ we have a nonnegative\nlinear objective function of the variables of adjacent agents. The task is to\nmaximise the minimum of the objective functions. We study local algorithms\nwhere each agent $v$ must choose $x_v$ based on input within its\nconstant-radius neighbourhood in $\\myG$. We show that for every $\\epsilon>0$\nthere exists a local algorithm achieving the approximation ratio ${\\Delta_I (1\n- 1/\\Delta_K)} + \\epsilon$. We also show that this result is the best possible\n-- no local algorithm can achieve the approximation ratio ${\\Delta_I (1 -\n1/\\Delta_K)}$. Here $\\Delta_I$ is the maximum degree of a vertex $i \\in I$, and\n$\\Delta_K$ is the maximum degree of a vertex $k \\in K$. As a methodological\ncontribution, we introduce the technique of graph unfolding for the design of\nlocal approximation algorithms.\n", "versions": [{"version": "v1", "created": "Wed, 30 Apr 2008 12:54:34 GMT"}], "update_date": "2012-05-15", "authors_parsed": [["Floréen", "Patrik", ""], ["Hassinen", "Marja", ""], ["Kaski", "Petteri", ""], ["Suomela", "Jukka", ""]]}]