[{"id": "0901.1322", "submitter": "Erik Demaine", "authors": "Timothy G. Abbott, Erik D. Demaine, and Blaise Gassend", "title": "A Generalized Carpenter's Rule Theorem for Self-Touching Linkages", "comments": "20 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Carpenter's Rule Theorem states that any chain linkage in the plane can\nbe folded continuously between any two configurations while preserving the bar\nlengths and without the bars crossing. However, this theorem applies only to\nstrictly simple configurations, where bars intersect only at their common\nendpoints. We generalize the theorem to self-touching configurations, where\nbars can touch but not properly cross. At the heart of our proof is a new\ndefinition of self-touching configurations of planar linkages, based on an\nannotated configuration space and limits of nontouching configurations. We show\nthat this definition is equivalent to the previously proposed definition of\nself-touching configurations, which is based on a combinatorial description of\noverlapping features. Using our new definition, we prove the generalized\nCarpenter's Rule Theorem using a topological argument. We believe that our\ntopological methodology provides a powerful tool for manipulating many kinds of\nself-touching objects, such as 3D hinged assemblies of polygons and rigid\norigami. In particular, we show how to apply our methodology to extend to\nself-touching configurations universal reconfigurability results for open\nchains with slender polygonal adornments, and single-vertex rigid origami with\nconvex cones.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jan 2009 21:25:42 GMT"}], "update_date": "2009-06-03", "authors_parsed": [["Abbott", "Timothy G.", ""], ["Demaine", "Erik D.", ""], ["Gassend", "Blaise", ""]]}, {"id": "0901.1908", "submitter": "Pat Morin", "authors": "Sebastien Collette, Vida Dujmovic, John Iacono, Stefan Langerman, and\n  Pat Morin", "title": "Entropy, Triangulation, and Point Location in Planar Subdivisions", "comments": "19 pages, 4 figures, lots of formulas", "journal-ref": "ACM Transactions on Algorithms (TALG), Volume 8 Issue 3, July 2012\n  Article No. 29", "doi": "10.1145/2229163.2229173", "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A data structure is presented for point location in connected planar\nsubdivisions when the distribution of queries is known in advance. The data\nstructure has an expected query time that is within a constant factor of\noptimal. More specifically, an algorithm is presented that preprocesses a\nconnected planar subdivision G of size n and a query distribution D to produce\na point location data structure for G. The expected number of point-line\ncomparisons performed by this data structure, when the queries are distributed\naccording to D, is H + O(H^{2/3}+1) where H=H(G,D) is a lower bound on the\nexpected number of point-line comparisons performed by any linear decision tree\nfor point location in G under the query distribution D. The preprocessing\nalgorithm runs in O(n log n) time and produces a data structure of size O(n).\nThese results are obtained by creating a Steiner triangulation of G that has\nnear-minimum entropy.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jan 2009 23:39:46 GMT"}], "update_date": "2013-03-12", "authors_parsed": [["Collette", "Sebastien", ""], ["Dujmovic", "Vida", ""], ["Iacono", "John", ""], ["Langerman", "Stefan", ""], ["Morin", "Pat", ""]]}, {"id": "0901.3924", "submitter": "David Eppstein", "authors": "David Eppstein, Elena Mumford, Bettina Speckmann, and Kevin Verbeek", "title": "Area-Universal Rectangular Layouts", "comments": "19 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A rectangular layout is a partition of a rectangle into a finite set of\ninterior-disjoint rectangles. Rectangular layouts appear in various\napplications: as rectangular cartograms in cartography, as floorplans in\nbuilding architecture and VLSI design, and as graph drawings. Often areas are\nassociated with the rectangles of a rectangular layout and it might hence be\ndesirable if one rectangular layout can represent several area assignments. A\nlayout is area-universal if any assignment of areas to rectangles can be\nrealized by a combinatorially equivalent rectangular layout. We identify a\nsimple necessary and sufficient condition for a rectangular layout to be\narea-universal: a rectangular layout is area-universal if and only if it is\none-sided. More generally, given any rectangular layout L and any assignment of\nareas to its regions, we show that there can be at most one layout (up to\nhorizontal and vertical scaling) which is combinatorially equivalent to L and\nachieves a given area assignment. We also investigate similar questions for\nperimeter assignments. The adjacency requirements for the rectangles of a\nrectangular layout can be specified in various ways, most commonly via the dual\ngraph of the layout. We show how to find an area-universal layout for a given\nset of adjacency requirements whenever such a layout exists.\n", "versions": [{"version": "v1", "created": "Sun, 25 Jan 2009 22:07:47 GMT"}], "update_date": "2009-01-27", "authors_parsed": [["Eppstein", "David", ""], ["Mumford", "Elena", ""], ["Speckmann", "Bettina", ""], ["Verbeek", "Kevin", ""]]}]