[{"id": "1302.0210", "submitter": "Ming-Hung Chen", "authors": "Ming-Hung Chen, Shi-Chen Wang, and Cheng-Fu Chou", "title": "Deadline is not Enough: How to Achieve Importance-aware Server-centric\n  Data Centers via a Cross Layer Approach", "comments": "This version is finished on 2012/7/30. New versions which include\n  improved rate-based importance-aware protocol and DCTCP-based\n  importance-aware protocol are considered to be submitted before release", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today's datacenters face important challenges for providing low-latency\nhigh-quality interactive services to meet user's expectation. For improving the\napplication throughput, recent research works have embedded application\ndeadline information into design of network flow schedule to meet the latency\nrequirement. Here, arises a critical question: does application-level\nthroughput mean providing better quality service? We note that there are\nusually a set of semantic related responses (or flows) for answering a query;\nand, some responses are highly correlative with the query while others do not.\nThus, this observation motivates us to associate the importance of the contents\nwith the application flows (or responses) in order to enhance the service\nquality. We first model the application importance maximization problem in a\ngeneric network and in a server-centric network. Since both of them are too\ncomplicated to be deployed in the real world, we propose the importance-aware\ndelivery protocol, which is a distributed event-driven rate-based delivery\ncontrol protocol, for server-centric datacenter networks. The proposed protocol\nis able to make use of the multiple disjoin paths of server-centric network,\nand jointly consider flow importance, flow size, and deadline to maximize the\ngoodput of most-related semantic data of a query. Through real-data-based or\nsynthetic simulations, the results show that our proposed protocol\nsignificantly outperforms D3 and MPTCP in terms of the precision at K and the\nsum of application-level importance.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2013 15:44:26 GMT"}], "update_date": "2013-02-04", "authors_parsed": [["Chen", "Ming-Hung", ""], ["Wang", "Shi-Chen", ""], ["Chou", "Cheng-Fu", ""]]}, {"id": "1302.0234", "submitter": "Lin Wang", "authors": "Lin Wang, Antonio Fern\\'andez Anta, Fa Zhang, Chenying Hou and Zhiyong\n  Liu", "title": "Routing for Energy Minimization with Discrete Cost Functions", "comments": "14 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy saving is becoming an important issue in the design and use of\ncomputer networks. In this work we propose a problem that considers the use of\nrate adaptation as the energy saving strategy in networks. The problem is\nmodeled as an integral demand-routing problem in a network with discrete cost\nfunctions at the links. The discreteness of the cost function comes from the\ndifferent states (bandwidths) at which links can operate and, in particular,\nfrom the energy consumed at each state. This in its turn leads to the\nnon-convexity of the cost function, and thus adds complexity to solve this\nproblem. We formulate this routing problem as an integer program, and we show\nthat the general case of this problem is NP-hard, and even hard to approximate.\nFor the special case when the step ratio of the cost function is bounded, we\nshow that effective approximations can be obtained. Our main algorithm executes\ntwo processes in sequence: relaxation and rounding. The relaxation process\neliminates the non-convexity of the cost function, so that the problem is\ntransformed into a fractional convex program solvable in polynomial time. After\nthat, a randomized rounding process is used to get a feasible solution for the\noriginal problem. This algorithm provides a constant approximation ratio for\nuniform demands and an approximation ratio of $O(\\log^{\\beta-1} d)$ for\nnon-uniform demands, where $\\beta$ is a constant and $d$ is the largest demand.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2013 18:04:56 GMT"}], "update_date": "2013-02-04", "authors_parsed": [["Wang", "Lin", ""], ["Anta", "Antonio Fernández", ""], ["Zhang", "Fa", ""], ["Hou", "Chenying", ""], ["Liu", "Zhiyong", ""]]}, {"id": "1302.0320", "submitter": "Xingqin Lin", "authors": "Xingqin Lin and Harish Viswanathan", "title": "Dynamic Spectrum Refarming with Overlay for Legacy Devices", "comments": "12 pages, 14 figures, submitted to IEEE Transactions on Wireless\n  Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The explosive growth in data traffic is resulting in a spectrum crunch\nforcing many wireless network operators to look towards refarming their 2G\nspectrum and deploy more spectrally efficient Long Term Evolution (LTE)\ntechnology. However, mobile network operators face a challenge when it comes to\nspectrum refarming because 2G technologies such as Global System for Mobile\n(GSM) is still widely used for low bandwidth machine-to-machine (M2M) devices.\nM2M devices typically have long life cycles, e.g. smart meters, and it is\nexpensive to migrate these devices to newer technology since a truck roll will\ntypically be required to the site where a device is deployed. Furthermore, with\ncost of 2G modules several times less than that of LTE, even newly deployed M2M\ndevices tend to adopt 2G technology. Nevertheless, operators are keen to either\nforce their 2G M2M customers to migrate so that they can refarm the spectrum or\nset aside a portion of the 2G spectrum for continuing operating 2G and only\nrefarm the rest for LTE. In this paper we propose a novel solution to provide\nGSM connectivity within an LTE carrier through an efficient overlay by\nreserving a few physical resource blocks for GSM. With this approach, operators\ncan refarm their 2G spectrum to LTE efficiently while still providing some GSM\nconnectivity to their low data rate M2M customers. Furthermore, spectrum can be\ndynamically shared between LTE and GSM. An approach similar to that proposed in\nthis paper can also be applied for other narrow band technology overlays over\nLTE.\n", "versions": [{"version": "v1", "created": "Sat, 2 Feb 2013 00:16:17 GMT"}, {"version": "v2", "created": "Sat, 22 Jun 2013 04:14:01 GMT"}], "update_date": "2013-06-25", "authors_parsed": [["Lin", "Xingqin", ""], ["Viswanathan", "Harish", ""]]}, {"id": "1302.0707", "submitter": "Juhoon Kim", "authors": "Juhoon Kim, Nikolaos Chatzis, Matthias Siebke, Anja Feldmann", "title": "Tigers vs Lions: Towards Characterizing Solitary and Group User Behavior\n  in MMORPG", "comments": "Also appears as TU-Berlin technical report 2013-01, ISSN: 1436-9915", "journal-ref": null, "doi": null, "report-no": "2013-01 (ISSN: 1436-9915)", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The development of Internet technologies enables software developers to build\nvirtual worlds such as Massively Multi-Player Online Role-Playing Games\n(MMORPGs). The population of such games shows super-linear growing tendency. It\nis estimated that the number of Internet users subscribed in MMORPGs is more\nthan 22 million worldwide [1]. However, only little is known about the\ncharacteristics of traffic generated by such games as well as the behavior of\ntheir subscribers. In this paper, we characterize the traffic behavior of World\nof Warcraft, the most subscribed MMORPG in the world, by analyzing Internet\ntraffic data sets collected from a European tier-1 ISP in two different time\nperiods. We find that World of Warcraft is an influential application regarding\nthe time spent by users (1.76 and 4.17 Hours/day on average in our\nmeasurement), while its traffic share is comparatively low (< 1 %). In this\nrespect, we look at the World of Warcraft subscriber's gaming behavior by\ncategorizing them into two different types of users (solitary users and group\nusers) and compare these two groups in relation to the playing behavior\n(duration as the metric) and the in-game behavior (distance as the metric).\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2013 14:42:34 GMT"}], "update_date": "2013-02-05", "authors_parsed": [["Kim", "Juhoon", ""], ["Chatzis", "Nikolaos", ""], ["Siebke", "Matthias", ""], ["Feldmann", "Anja", ""]]}, {"id": "1302.0792", "submitter": "Edith Cohen", "authors": "Edith Cohen, Avinatan Hassidim, Haim Kaplan, Yishay Mansour, Danny\n  Raz, Yoav Tzur", "title": "Probe Scheduling for Efficient Detection of Silent Failures", "comments": "23 Pages, 3 figures, A partial version (without some of the proofs)\n  Performance Evaluation 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most discovery systems for silent failures work in two phases: a continuous\nmonitoring phase that detects presence of failures through probe packets and a\nlocalization phase that pinpoints the faulty element(s). This separation is\nimportant because localization requires significantly more resources than\ndetection and should be initiated only when a fault is present.\n  We focus on improving the efficiency of the detection phase, where the goal\nis to balance the overhead with the cost associated with longer failure\ndetection times. We formulate a general model which unifies the treatment of\nprobe scheduling mechanisms, stochastic or deterministic, and different cost\nobjectives - minimizing average detection time (SUM) or worst-case detection\ntime (MAX).\n  We then focus on two classes of schedules. {\\em Memoryless schedules} -- a\nsubclass of stochastic schedules which is simple and suitable for distributed\ndeployment. We show that the optimal memorlyess schedulers can be efficiently\ncomputed by convex programs (for SUM objectives) or linear programs (for MAX\nobjectives), and surprisingly perhaps, are guaranteed to have expected\ndetection times that are not too far off the (NP hard) stochastic optima. {\\em\nDeterministic schedules} allow us to bound the maximum (rather than expected)\ncost of undetected faults, but like stochastic schedules, are NP hard to\noptimize. We develop novel efficient deterministic schedulers with provable\napproximation ratios.\n  An extensive simulation study on real networks, demonstrates significant\nperformance gains of our memoryless and deterministic schedulers over previous\napproaches. Our unified treatment also facilitates a clear comparison between\ndifferent objectives and scheduling mechanisms.\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2013 18:43:50 GMT"}, {"version": "v2", "created": "Sun, 16 Jun 2013 06:51:12 GMT"}, {"version": "v3", "created": "Thu, 19 Jun 2014 08:52:07 GMT"}], "update_date": "2014-06-20", "authors_parsed": [["Cohen", "Edith", ""], ["Hassidim", "Avinatan", ""], ["Kaplan", "Haim", ""], ["Mansour", "Yishay", ""], ["Raz", "Danny", ""], ["Tzur", "Yoav", ""]]}, {"id": "1302.0891", "submitter": "Mouhamed Abdulla", "authors": "Mouhamed Abdulla and Yousef R. Shayan", "title": "Large-Scale Fading Behavior for a Cellular Network with Uniform Spatial\n  Distribution", "comments": "17 pages, 13 figures, 3 tables", "journal-ref": "Wiley's Wireless Communications and Mobile Computing Journal, pp.\n  1-17, Dec. 2014", "doi": "10.1002/WCM.2565", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large-scale fading (LSF) between interacting nodes is a fundamental element\nin radio communications, responsible for weakening the propagation, and thus\nworsening the service quality. Given the importance of channel-losses in\ngeneral, and the inevitability of random spatial geometry in real-life wireless\nnetworks, it was then natural to merge these two paradigms together in order to\nobtain an improved stochastical model for the LSF indicator. Therefore, in\nexact closed-form notation, we generically derived the LSF distribution between\na prepositioned reference base-station and an arbitrary node for a\nmulti-cellular random network model. In fact, we provided an explicit and\ndefinitive formulation that considered at once: the lattice profile, the users'\nrandom geometry, the effect of the far-field phenomenon, the path-loss\nbehavior, and the stochastic impact of channel scatters. The veracity and\naccuracy of the theoretical analysis were also confirmed through Monte Carlo\nsimulations.\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2013 22:34:44 GMT"}, {"version": "v2", "created": "Fri, 26 Dec 2014 03:27:44 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Abdulla", "Mouhamed", ""], ["Shayan", "Yousef R.", ""]]}, {"id": "1302.0897", "submitter": "G. Enrico Santagati", "authors": "G. Enrico Santagati, Tommaso Melodia, Laura Galluccio, and Sergio\n  Palazzo", "title": "Distributed MAC and Rate Adaptation for Ultrasonically Networked\n  Implantable Sensors", "comments": "9 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of miniaturized biomedical devices implanted in the human body and\nwirelessly internetworked is promising a significant leap forward in medical\ntreatment of many pervasive diseases. Recognizing the well-understood\nlimitations of traditional radio-frequency wireless communications in\ninterconnecting devices within the human body, in this paper we propose for the\nfirst time to develop network protocols for implantable devices based on\nultrasonic transmissions. We start off by assessing the feasibility of using\nultrasonic propagation in human body tissues and by deriving an accurate\nchannel model for ultrasonic intra-body communications. Then, we propose a new\nultrasonic transmission and multiple access technique, which we refer to as\nUltrasonic WideBand (UsWB). UsWB is based on the idea of transmitting\ninformation bits spread over very short pulses following a time-hopping\npattern. The short impulse duration results in limited reflection and\nscattering effects, and its low duty cycle reduces the thermal and mechanical\neffects, which are detrimental for human health. We then develop a multiple\naccess technique with distributed control to enable efficient simultaneous\naccess by interfering devices based on minimal and localized information\nexchange and on measurements at the receiver only. Finally, we demonstrate the\nperformance of UsWB through a multi-scale simulator that models the proposed\ncommunication system at the acoustic wave level, at the physical (bit) level,\nand at the network (packet) level.\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2013 23:00:54 GMT"}, {"version": "v2", "created": "Wed, 6 Feb 2013 01:16:29 GMT"}], "update_date": "2013-02-07", "authors_parsed": [["Santagati", "G. Enrico", ""], ["Melodia", "Tommaso", ""], ["Galluccio", "Laura", ""], ["Palazzo", "Sergio", ""]]}, {"id": "1302.0939", "submitter": "Jaydip Sen", "authors": "Jaydip Sen", "title": "Security and Privacy Issues in Wireless Mesh Networks: A Survey", "comments": "62 pages, 12 figures, 6 tables. This chapter is an extension of the\n  author's previous submission in arXiv submission: arXiv:1102.1226. There are\n  some text overlaps with the previous submission", "journal-ref": "Book Chapter in Wireless Networks and Security- Issues, Challenges\n  and Research Trends, Editors: Shafiullah Khan, Al-Sakib Khan Pathan.\n  Springer, 2013, pp. 189-27, February 2013", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This book chapter identifies various security threats in wireless mesh\nnetwork (WMN). Keeping in mind the critical requirement of security and user\nprivacy in WMNs, this chapter provides a comprehensive overview of various\npossible attacks on different layers of the communication protocol stack for\nWMNs and their corresponding defense mechanisms. First, it identifies the\nsecurity vulnerabilities in the physical, link, network, transport, application\nlayers. Furthermore, various possible attacks on the key management protocols,\nuser authentication and access control protocols, and user privacy preservation\nprotocols are presented. After enumerating various possible attacks, the\nchapter provides a detailed discussion on various existing security mechanisms\nand protocols to defend against and wherever possible prevent the possible\nattacks. Comparative analyses are also presented on the security schemes with\nregards to the cryptographic schemes used, key management strategies deployed,\nuse of any trusted third party, computation and communication overhead involved\netc. The chapter then presents a brief discussion on various trust management\napproaches for WMNs since trust and reputation-based schemes are increasingly\nbecoming popular for enforcing security in wireless networks. A number of open\nproblems in security and privacy issues for WMNs are subsequently discussed\nbefore the chapter is finally concluded.\n", "versions": [{"version": "v1", "created": "Tue, 5 Feb 2013 05:20:50 GMT"}], "update_date": "2013-02-06", "authors_parsed": [["Sen", "Jaydip", ""]]}, {"id": "1302.0965", "submitter": "Deepali Virmani", "authors": "Deepali Virmani, Tanu Sharma, Ritu Sharma", "title": "Adaptive Energy Aware Data Aggregation Tree for Wireless Sensor Networks", "comments": "12 pages, 8 figures, International Journal of Hybrid Information\n  Technology Vol. 6, No. 1, January, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To meet the demands of wireless sensor networks (WSNs) where data are usually\naggregated at a single source prior to transmitting to any distant user, there\nis a need to establish a tree structure inside to aggregate data. In this\npaper, an adaptive energy aware data aggregation tree (AEDT) is proposed. The\nproposed tree uses the maximum energy available node as the data aggregator\nnode. The tree incorporates sleep and awake technology where the communicating\nnode and the parent node are only in awake state rest all the nodes go to sleep\nstate saving the network energy and enhancing the network lifetime. When the\ntraffic load crosses the threshold value, then the packets are accepted\nadaptively according to the communication capacity of the parent node. The\nproposed tree maintains a memory table which stores the value of each selected\npath. Path selection is based on shortest path algorithm where the node with\nhighest available energy is always selected as forwarding node. By simulation\nresults, we show that our proposed tree enhances network lifetime minimizes\nenergy consumption and achieves good delivery ratio with reduced delay.\n", "versions": [{"version": "v1", "created": "Tue, 5 Feb 2013 09:05:29 GMT"}], "update_date": "2013-02-06", "authors_parsed": [["Virmani", "Deepali", ""], ["Sharma", "Tanu", ""], ["Sharma", "Ritu", ""]]}, {"id": "1302.1131", "submitter": "Charith Perera", "authors": "Charith Perera, Prem Jayaraman, Arkady Zaslavsky, Peter Christen,\n  Dimitrios Georgakopoulos", "title": "Dynamic Configuration of Sensors Using Mobile Sensor Hub in Internet of\n  Things Paradigm", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet of Things (IoT) envisions billions of sensors to be connected to the\nInternet. By deploying intelligent low-level computational devices such as\nmobile phones in-between sensors and cloud servers, we can reduce data\ncommunication with the use of intelligent processing such as fusing and\nfiltering sensor data, which saves significant amount of energy. This is also\nideal for real world sensor deployments where connecting sensors directly to a\ncomputer or to the Internet is not practical. Most of the leading IoT\nmiddleware solutions require manual and labour intensive tasks to be completed\nin order to connect a mobile phone to them. In this paper we present a mobile\napplication called Mobile Sensor Hub (MoSHub). It allows variety of different\nsensors to be connected to a mobile phone and send the data to the cloud\nintelligently reducing network communication. Specifically, we explore\ntechniques that allow MoSHub to be connected to cloud based IoT middleware\nsolutions autonomously. For our experiments, we employed Global Sensor Network\n(GSN) middleware to implement and evaluate our approach. Such automated\nconfiguration reduces significant amount of manual labour that need to be\nperformed by technical experts otherwise. We also evaluated different methods\nthat can be used to automate the configuration process.\n", "versions": [{"version": "v1", "created": "Tue, 5 Feb 2013 17:48:18 GMT"}], "update_date": "2013-02-06", "authors_parsed": [["Perera", "Charith", ""], ["Jayaraman", "Prem", ""], ["Zaslavsky", "Arkady", ""], ["Christen", "Peter", ""], ["Georgakopoulos", "Dimitrios", ""]]}, {"id": "1302.1409", "submitter": "Jamil Hamodi Mr.", "authors": "Jamil M. Hamodi and Ravindra C. Thool", "title": "Investigate The Performance Evaluation of IPTV over WiMAX Networks", "comments": "arXiv admin note: substantial text overlap with other internet\n  sources by other authors", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.5, No.1, January 2013", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deployment Video on Demand (VoD) over the next generation (WiMAX) has become\none of the intense interest subjects in the research these days, and is\nexpected to be the main revenue generators in the near future and the\nefficiency of video streaming over next generation 4G is the key to enabling\nthis. We are considering video streaming for real time video was coded by\ndifferent H.264.x codes (H.264/AVC, and SVC), and we consider an IP-Unicast to\ndeliver this streaming video over WiMAX. Our approach investigates the\nperformance evaluation of IPTV (VoD) over WiMAX networks. OPNET is used to\ninvestigate the performance of VoD over WiMAX. Results obtained from simulation\nindicate that SVC video codec is an appropriate video codec for video streaming\nover WiMAX.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2013 15:40:26 GMT"}], "update_date": "2016-01-13", "authors_parsed": [["Hamodi", "Jamil M.", ""], ["Thool", "Ravindra C.", ""]]}, {"id": "1302.1493", "submitter": "Abhishek Chanda", "authors": "Abhishek Chanda, Cedric Westphal", "title": "ContentFlow: Mapping Content to Flows in Software Defined Networks", "comments": "arXiv admin note: substantial text overlap with arXiv:1212.3341", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Information-Centric Networks place content as the narrow waist of the network\narchitecture. This allows to route based upon the content name, and not based\nupon the locations of the content consumer and producer. However, current\nInternet architecture does not support content routing at the network layer. We\npresent ContentFlow, an Information-Centric network architecture which supports\ncontent routing by mapping the content name to an IP flow, and thus enables the\nuse of OpenFlow switches to achieve content routing over a legacy IP\narchitecture. ContentFlow is viewed as an evolutionary step between the current\nIP networking architecture, and a full fledged ICN architecture. It supports\ncontent management, content caching and content routing at the network layer,\nwhile using a legacy OpenFlow infrastructure and a modified controller. In\nparticular, ContentFlow is transparent from the point of view of the client and\nthe server, and can be inserted in between with no modification at either end.\nWe have implemented ContentFlow and describe our implementation choices as well\nas the overall architecture specification. We evaluate the performance of\nContentFlow in our testbed.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2013 19:50:54 GMT"}, {"version": "v2", "created": "Thu, 7 Feb 2013 16:46:38 GMT"}], "update_date": "2013-02-08", "authors_parsed": [["Chanda", "Abhishek", ""], ["Westphal", "Cedric", ""]]}, {"id": "1302.1506", "submitter": "Hossein Shafiei", "authors": "H. Shafiei, A. Khonsari, H. Derakhshi, and P. Mousavi", "title": "Rate-Privacy in Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper introduces the concept of rate privacy in the context of wireless\nsensor networks. Our discussion reveals that the concept indeed is of a great\nimportance for the privacy preservation of such networks. As a result, we\npropose a buffering scheme to protect the rate from adversaries. Simulation\nresults verify the applicability of our approach.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2013 20:46:34 GMT"}], "update_date": "2013-02-07", "authors_parsed": [["Shafiei", "H.", ""], ["Khonsari", "A.", ""], ["Derakhshi", "H.", ""], ["Mousavi", "P.", ""]]}, {"id": "1302.1642", "submitter": "Adnan Ali", "authors": "Hussein A. Mohammed, Adnan Hussein Ali, Hawraa Jassim Mohammed", "title": "The Affects of Different Queuing Algorithms within the Router on QoS\n  VoIP application Using OPNET", "comments": null, "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.5, No.1, January 2013International Journal of Computer Networks", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Voice over Internet Protocol is a service from the Internet services that\nallows users to communicate with each other. Quality of Service is very\nsensitive to delay so that Voice over Internet Protocol needs it. The objective\nof this research is to study the effect of different queuing algorithms within\nthe router on Voice over Internet Protocol Quality of Service. In this work,\nsimulation tool OPNET Modeler is used to implement the proposed network (Voice\nover Internet Protocol Network). The proposed network is a private network for\na company that has two locations located at two different countries around the\nworld in order to simulate the communications within the same location as a\nlocal and the communications between two locations as a long distance and\nanalyze Voice over Internet Protocol Quality of Service through measuring the\nmajor factors that affect the Quality of Service for Voice over Internet\nProtocol according to international telecommunication union standards such as:\ndelay, jitter and packet loss. In this research, a comparison was carried out\nbetween different queue algorithms like First in First out (FIFO), Priority\nqueue and Weight Fair Queuing and it was found that Priority queue and Weight\nFair Queuing algorithms are the most appropriate to improve Voice over Internet\nProtocol Quality of Service .\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2013 04:57:00 GMT"}], "update_date": "2013-02-08", "authors_parsed": [["Mohammed", "Hussein A.", ""], ["Ali", "Adnan Hussein", ""], ["Mohammed", "Hawraa Jassim", ""]]}, {"id": "1302.1663", "submitter": "Joongheon Kim", "authors": "Joongheon Kim, Yafei Tian, Stefan Mangold, Andreas F. Molisch", "title": "Joint Scalable Coding and Routing for 60 GHz Real-Time Live HD Video\n  Streaming Applications", "comments": "This document will be submitted again after getting co-authors' more\n  feedback", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transmission of high-definition (HD) video is a promising application for 60\nGHz wireless links, since very high transmission rates (up to several Gbit/s)\nare possible. In particular we consider a sports stadium broadcasting system\nwhere signals from multiple cameras are transmitted to a central location. Due\nto the high pathloss of 60 GHz radiation over the large distances encountered\nin this scenario, the use of relays might be required. The current paper\nanalyzes the joint selection of the routes (relays) and the compression rates\nfrom the various sources for maximization of the overall video quality. We\nconsider three different scenarios: (i) each source transmits only to one relay\nand the relay can receive only one data stream, and (ii) each source can\ntransmit only to a single relay, but relays can aggregate streams from\ndifferent sources and forward to the destination, and (iii) the source can\nsplit its data stream into parallel streams, which can be transmitted via\ndifferent relays to the destination. For each scenario, we derive the\nmathematical formulations of the optimization problem and re-formulate them as\nconvex mixed-integer programming, which can guarantee optimal solutions.\nExtensive simulations demonstrate that high-quality transmission is possible\nfor at least ten cameras over distances of 300 m. Furthermore, optimization of\nthe video quality gives results that can significantly outperform algorithms\nthat maximize data rates.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2013 08:05:56 GMT"}, {"version": "v2", "created": "Fri, 8 Feb 2013 22:54:12 GMT"}, {"version": "v3", "created": "Tue, 12 Feb 2013 03:15:47 GMT"}], "update_date": "2013-02-13", "authors_parsed": [["Kim", "Joongheon", ""], ["Tian", "Yafei", ""], ["Mangold", "Stefan", ""], ["Molisch", "Andreas F.", ""]]}, {"id": "1302.1676", "submitter": "Deepali Virmani", "authors": "Deepali Virmani, Satbir Jain", "title": "Comparison of Proposed Data Dissemination Protocols for Sensor Networks\n  Using J-Sim", "comments": "8 pages, 9 figures", "journal-ref": null, "doi": "10.1109/IADCC.2009.4809182", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A distinguishing characteristic of wireless sensor networks is the\nopportunity to exploit characteristics of the application at lower layers. This\npaper reports on the results of a simulation comparison of proposed data\ndissemination protocols using the J-Sim simulator for the WSN protocols:\nForwarding Diffusion Data Dissemination(FDDDP), Decentralized Data\nDissemination(DDDP), Credit Broadcast Data Dissemination (CBDDP), Energy Aware\n& Geographical Data Dissemination (EAGDDP) .Our performance provides useful\ninsights for the network designer such as which protocols (and design choices)\nscale control traffic well, improve data delivery or reduce overall energy\nconsumption,improves routing overhead and maximizes the bandwidth utilization.\nThe static pre configuration of the cell size in DDDP, is one of the reasons\nwhy DDDP exhibits larger routing overhead than FDDDP by 74.2% on average.\nAlthough CBDDP produces approximately 94.6% smaller overhead than DDDP and\n90.7% smaller than FDDDP, because of statically configured amount credit CBDDP\ndelivers on average 7.5 times more of the redundant data packets than DDDP and\nFDDDP.EAGDDP improves the delivery by 80% on average and makes a balance of\nenergy consumption .We suggest that making these protocols truly self-learning\ncan significantly improve their performance.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2013 09:10:55 GMT"}], "update_date": "2013-02-08", "authors_parsed": [["Virmani", "Deepali", ""], ["Jain", "Satbir", ""]]}, {"id": "1302.1697", "submitter": "Luis Sanabria-Russo", "authors": "Luis Sanabria-Russo, Jaume Barcelo, Boris Bellalta", "title": "Fairness in Collision-Free WLANs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  CSMA/ECA is a contention protocol that makes it possible to construct a\ncollision-free schedule by using a deterministic backoff after successful\ntransmissions. In this paper, we further enhance the CSMA/ECA protocol with two\nproperties that allows to fairly accommodate a large number of contenders in a\ncollision-free schedule. The first property, called hysteresis, instructs the\ncontenders not to reset their contention window after successful transmissions.\nThanks to hysteresis, the protocol sustains a high throughput regardless of the\nnumber of contenders. The second property, called fair-share, preserves\nfairness when different nodes use different contention windows. We present\nsimulations results that evidence how these properties account for performance\ngains that go even further beyond CSMA/CA.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2013 10:31:08 GMT"}], "update_date": "2013-02-08", "authors_parsed": [["Sanabria-Russo", "Luis", ""], ["Barcelo", "Jaume", ""], ["Bellalta", "Boris", ""]]}, {"id": "1302.1756", "submitter": "Anastasios Kavoukis", "authors": "Anastasios Kavoukis, Salem Aljareh", "title": "Efficient time synchronized one-time password scheme to provide secure\n  wake-up authentication on wireless sensor networks", "comments": "International Journal Of Advanced Smart Sensor Network Systems\n  (IJASSN), Vol 3, No.1, January 2013\n  http://airccse.org/journal/ijassn/papers/3113ijassn01.pdf", "journal-ref": null, "doi": "10.5121/ijassn.2013.3101", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose Time Synchronized One-Time-Password scheme to\nprovide secure wake up authentication. The main constraint of wireless sensor\nnetworks is their limited power resource that prevents us from using radio\ntransmission over the network to transfer the passwords. On the other hand\ncomputation power consumption is insignificant when compared to the costs\nassociated with the power needed for transmitting the right set of keys. In\naddition to prevent adversaries from reading and following the timeline of the\nnetwork, we propose to encrypt the tokens using symmetric encryption to prevent\nreplay attacks.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2013 14:24:51 GMT"}], "update_date": "2013-02-08", "authors_parsed": [["Kavoukis", "Anastasios", ""], ["Aljareh", "Salem", ""]]}, {"id": "1302.1857", "submitter": "Hongjian Sun Dr", "authors": "Hongjian Sun and Bo Tan and Jing Jiang and John S. Thompson and\n  Arumugam Nallanathan and H. Vincent Poor", "title": "Relaying Technologies for Smart Grid Communications", "comments": "17 pages, 6 figures. This paper has been accepted to be published in\n  IEEE Wireless Communications", "journal-ref": "IEEE Wireless Communications, Dec 2012, 52-59", "doi": "10.1109/MWC.2012.6393518", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless technologies can support a broad range of smart grid applications\nincluding advanced metering infrastructure (AMI) and demand response (DR).\nHowever, there are many formidable challenges when wireless technologies are\napplied to the smart gird, e.g., the tradeoffs between wireless coverage and\ncapacity, the high reliability requirement for communication, and limited\nspectral resources. Relaying has emerged as one of the most promising candidate\nsolutions for addressing these issues. In this article, an introduction to\nvarious relaying strategies is presented, together with a discussion of how to\nimprove spectral efficiency and coverage in relay-based information and\ncommunications technology (ICT) infrastructure for smart grid applications.\nSpecial attention is paid to the use of unidirectional relaying, collaborative\nbeamforming, and bidirectional relaying strategies.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2013 20:46:15 GMT"}], "update_date": "2013-03-11", "authors_parsed": [["Sun", "Hongjian", ""], ["Tan", "Bo", ""], ["Jiang", "Jing", ""], ["Thompson", "John S.", ""], ["Nallanathan", "Arumugam", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1302.1913", "submitter": "Armin Banaei", "authors": "Armin Banaei and Costas N. Georghiades", "title": "On Randomized Sensing and Access Schemes in Wireless Ad-Hoc Cognitive\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past decade we have witnessed a rapid growth and development in\nwireless communication systems, to the point that conventional spectrum\nallocation policies may not be able to fulfill them all. Federal Communications\nCommission (FCC) licenses certain frequency segments to a particular user in a\nparticular geographic area. Industrial, Scientific and Medical (ISM) radio\nbands have also been envisioned for all other unlicensed user to share, as long\nas they follow certain power regulations. But with the recent boom in the\nwireless technologies, these open channels have become overcrowded with\neverything from wireless networks to wireless controllers.\n  Therefore, the regulatory and standardization agencies have been working on\nnew spectrum regulation policies for wireless communication systems. The\nunderlying idea is to let unlicensed users to use the licensed band as long as\nthey can guarantee low interference to the licensed users. Though seemingly\nsimple, sophisticated interference management protocols are needed to meet the\nexpected level of transparency accepted by licensed users. In this report we\nadopt the dynamic spectrum access approach to limit the interference to primary\nusers and analyze the performance of the cognitive MAC protocols based on\nrandomized sensing and access schemes.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2013 00:11:17 GMT"}], "update_date": "2013-02-11", "authors_parsed": [["Banaei", "Armin", ""], ["Georghiades", "Costas N.", ""]]}, {"id": "1302.1921", "submitter": "Shinichi Kuribayashi", "authors": "Shin-ichi Kuribayashi", "title": "Improving Quality of Service and Reducing Power Consumption with WAN\n  accelerator in Cloud Computing Environments", "comments": "12 pages, International Journal of Computer Networks & Communications\n  (IJCNC) Vol.5, No.1, January 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The widespread use of cloud computing services is expected to deteriorate a\nQuality of Service and toincrease the power consumption of ICT devices, since\nthe distance to a server becomes longer than before. Migration of virtual\nmachines over a wide area can solve many problems such as load balancing and\npower saving in cloud computing environments.\n  This paper proposes to dynamically apply WAN accelerator within the network\nwhen a virtual machine is moved to a distant center, in order to prevent the\ndegradation in performance after live migration of virtual machines over a wide\narea. mSCTP-based data transfer using different TCP connections before and\nafter migration is proposed in order to use a currently available WAN\naccelerator. This paper does not consider the performance degradation of live\nmigration itself. Then, this paper proposes to reduce the power consumption of\nICT devices, which consists of installing WAN accelerators as part of cloud\nresources actively and increasing the packet transfer rate of communication\nlink temporarily. It is demonstrated that the power consumption with WAN\naccelerator could be reduced to one-tenth of that without WAN accelerator.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2013 01:18:28 GMT"}], "update_date": "2013-02-11", "authors_parsed": [["Kuribayashi", "Shin-ichi", ""]]}, {"id": "1302.2168", "submitter": "Mingyue Ji", "authors": "Mingyue Ji, Giuseppe Caire and Andreas F. Molisch", "title": "Optimal Throughput-Outage Trade-off in Wireless One-Hop Caching Networks", "comments": "5 pages, 3 figures, to appear in ISIT 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a wireless device-to-device (D2D) network where the nodes have\ncached information from a library of possible files. Inspired by the current\ntrend in the standardization of the D2D mode for 4th generation wireless\nnetworks, we restrict to one-hop communication: each node place a request to a\nfile in the library, and downloads from some other node which has the requested\nfile in its cache through a direct communication link, without going through a\nbase station. We describe the physical layer communication through a simple\n\"protocol-model\", based on interference avoidance (independent set scheduling).\nFor this network we define the outage-throughput tradeoff problem and\ncharacterize the optimal scaling laws for various regimes where both the number\nof nodes and the files in the library grow to infinity.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2013 22:37:57 GMT"}, {"version": "v2", "created": "Wed, 22 May 2013 18:12:08 GMT"}], "update_date": "2013-05-23", "authors_parsed": [["Ji", "Mingyue", ""], ["Caire", "Giuseppe", ""], ["Molisch", "Andreas F.", ""]]}, {"id": "1302.2185", "submitter": "Evan Everett", "authors": "Evan Everett, Achaleshwar Sahai, Ashutosh Sabharwal", "title": "Passive Self-Interference Suppression for Full-Duplex Infrastructure\n  Nodes", "comments": "16 pages, Accepted by IEEE Transactions on Wireless Communication,\n  October 2013", "journal-ref": null, "doi": "10.1109/TWC.2013.010214.130226", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent research results have demonstrated the feasibility of full-duplex\nwireless communication for short-range links. Although the focus of the\nprevious works has been active cancellation of the self-interference signal, a\nmajority of the overall self-interference suppression is often due to passive\nsuppression, i.e., isolation of the transmit and receive antennas. We present a\nmeasurement-based study of the capabilities and limitations of three key\nmechanisms for passive self-interference suppression: directional isolation,\nabsorptive shielding, and cross-polarization. The study demonstrates that more\nthan 70 dB of passive suppression can be achieved in certain environments, but\nalso establishes two results on the limitations of passive suppression: (1)\nenvironmental reflections limit the amount of passive suppression that can be\nachieved, and (2) passive suppression, in general, increases the frequency\nselectivity of the residual self-interference signal. These results suggest two\ndesign implications: (1) deployments of full-duplex infrastructure nodes should\nminimize near-antenna reflectors, and (2) active cancellation in concatenation\nwith passive suppression should employ higher-order filters or per-subcarrier\ncancellation.\n", "versions": [{"version": "v1", "created": "Sat, 9 Feb 2013 01:18:31 GMT"}, {"version": "v2", "created": "Tue, 17 Dec 2013 02:09:42 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Everett", "Evan", ""], ["Sahai", "Achaleshwar", ""], ["Sabharwal", "Ashutosh", ""]]}, {"id": "1302.2206", "submitter": "Jamil Hamodi Mr.", "authors": "Jamil M. Hamodi, Ravindra C. Thool", "title": "Performance Evaluation of IPTV over WiMAX Networks Under Different\n  Terrain Environments", "comments": "arXiv admin note: substantial text overlap with arXiv:1302.1409, and\n  substantial text overlap with other internet sources by other authors", "journal-ref": "International Journal of Engineering Inventions, Volume 2, Issue 2\n  (January 2013) PP: 21-25", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deployment Video on Demand (VoD) over the next generation (WiMAX) has become\none of the intense interest subjects in the research these days, and is\nexpected to be the main revenue generators in the near future. In this paper,\nthe performance of Quilty of Service of video streaming (IPTV) over fixed\nmobile WiMax network is investigated under different terrain environments,\nnamely Free Space, Outdoor to Indoor and Pedestrian. OPNET is used to\ninvestigate the performance of VoD over WiMAX. Our findings analyzing different\nnetwork statistics such as packet lost, path loss, delay, network throughput.\n", "versions": [{"version": "v1", "created": "Sat, 9 Feb 2013 08:38:24 GMT"}], "update_date": "2016-01-13", "authors_parsed": [["Hamodi", "Jamil M.", ""], ["Thool", "Ravindra C.", ""]]}, {"id": "1302.2244", "submitter": "Jiping Xiong", "authors": "Jiping Xiong, Jian Zhao and Lei Chen", "title": "Efficient Data Gathering in Wireless Sensor Networks Based on Matrix\n  Completion and Compressive Sensing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gathering data in an energy efficient manner in wireless sensor networks is\nan important design challenge. In wireless sensor networks, the readings of\nsensors always exhibit intra-temporal and inter-spatial correlations.\nTherefore, in this letter, we use low rank matrix completion theory to explore\nthe inter-spatial correlation and use compressive sensing theory to take\nadvantage of intra-temporal correlation. Our method, dubbed MCCS, can\nsignificantly reduce the amount of data that each sensor must send through\nnetwork and to the sink, thus prolong the lifetime of the whole networks.\nExperiments using real datasets demonstrate the feasibility and efficacy of our\nMCCS method.\n", "versions": [{"version": "v1", "created": "Sat, 9 Feb 2013 16:34:00 GMT"}], "update_date": "2013-02-12", "authors_parsed": [["Xiong", "Jiping", ""], ["Zhao", "Jian", ""], ["Chen", "Lei", ""]]}, {"id": "1302.2247", "submitter": "Sourangsu Banerji", "authors": "Sourangsu Banerji, Rahul Singha Chowdhury", "title": "Wi-Fi & WiMAX: A Comparative Study", "comments": "5 pages, 4 figures, 1 table", "journal-ref": "Indian Journal of Engineering, Volume 2,Issue 5, March 2013", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Usually broadband wireless access networks are considered to be enterprise\nlevel networks providing us with more capacity as well as coverage. We have\nseen that in remote inaccessible areas wired networks are not at all cost\neffective. Wireless networking has offered us an alternative solution for such\nproblem of information access. They have definitely changed the way people\ncommunicate and share information among themselves by overcoming problems\nnowadays associated with distance and location. This paper provides a\ncomparison and technical analysis of alternatives for implementing last-mile\nwireless broadband services. It provides detailed technical differences between\n802.11 (Wi-FI) wireless networks with 802.16 (WiMAX), a new technology that\nsolves many of the difficulties in last-mile implementations.\n", "versions": [{"version": "v1", "created": "Sat, 9 Feb 2013 17:15:51 GMT"}, {"version": "v10", "created": "Mon, 29 Jul 2013 16:05:52 GMT"}, {"version": "v11", "created": "Sun, 9 Mar 2014 08:28:35 GMT"}, {"version": "v2", "created": "Tue, 19 Feb 2013 04:51:25 GMT"}, {"version": "v3", "created": "Sat, 9 Mar 2013 20:16:48 GMT"}, {"version": "v4", "created": "Thu, 6 Jun 2013 11:26:27 GMT"}, {"version": "v5", "created": "Sat, 22 Jun 2013 14:42:59 GMT"}, {"version": "v6", "created": "Sun, 30 Jun 2013 20:21:28 GMT"}, {"version": "v7", "created": "Fri, 5 Jul 2013 18:33:12 GMT"}, {"version": "v8", "created": "Fri, 12 Jul 2013 13:39:24 GMT"}, {"version": "v9", "created": "Sun, 21 Jul 2013 11:28:46 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Banerji", "Sourangsu", ""], ["Chowdhury", "Rahul Singha", ""]]}, {"id": "1302.2253", "submitter": "Jaydip Sen", "authors": "Jaydip Sen", "title": "Security and Privacy Challenges in Cognitive Wireless Sensor Networks", "comments": "36 pages, 4 figures, 2 tables. The book chapter is accepted for\n  publication in 2013", "journal-ref": "Book Chapter in Cognitive Radio Technology Applications for\n  Wireless and Mobile Ad hoc Networks, Natarajan Meghanathan and Y. B. Reddy\n  (Eds.), IGI-Global, USA, 2013", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs) have attracted a lot of interest in the\nresearch community due to their potential applicability in a wide range of\nreal-world practical applications. However, due to the distributed nature and\ntheir deployments in critical applications without human interventions and\nsensitivity and criticality of data communicated, these networks are vulnerable\nto numerous security and privacy threats that can adversely affect their\nperformance. These issues become even more critical in cognitive wireless\nsensor networks (CWSNs) in which the sensor nodes have the capabilities of\nchanging their transmission and reception parameters according to the radio\nenvironment under which they operate in order to achieve reliable and efficient\ncommunication and optimum utilization of the network resources. This chapter\npresents a comprehensive discussion on the security and privacy issues in CWSNs\nby identifying various security threats in these networks and various defense\nmechanisms to counter these vulnerabilities. Various types of attacks on CWSNs\nare categorized under different classes based on their natures and targets, and\ncorresponding to each attack class, appropriate security mechanisms are also\ndiscussed. Some critical research issues on security and privacy in CWSNs are\nalso identified.\n", "versions": [{"version": "v1", "created": "Sat, 9 Feb 2013 19:11:57 GMT"}], "update_date": "2013-02-12", "authors_parsed": [["Sen", "Jaydip", ""]]}, {"id": "1302.2577", "submitter": "Fotis Foukalas", "authors": "Fotis Foukalas, Lazaros Merakos", "title": "A Study on Spectral Efficiency of Physical Layer over Cognitive Radio", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the conclusive potential of cognitive radio for provisioning the\ndynamic and flexible spectrum/channel allocation, the research community should\nstudy the performance gain of physical layer over such a radio with cognition\ncapabilities. To this end, several mechanisms of physical layers such as\nadaptive modulation, multiple-input multiple output antennas; channel coding\nand/or combination of them should be studied. These studies should be\naccomplished in terms of spectral efficiency. Therefore, the gain of cognitive\nradio in wireless networks available into the market will be identified\npractically. Another issue under consideration should be the performance\nevaluation of cognitive radio assuming a cross-layer combination between the\ncognitive physical and the upper layers. To this direction, this paper presents\na study on spectral efficiency at the physical layer with cognitive\ncapabilities. In sequel, we study a cross-layer combination of physical layer\nwith upper layers in the same cognitive context. The performance gain of\ncognitive radio in such a physical layer is realized practically as well as a\nfew cross-layer design issues have been raised.\n", "versions": [{"version": "v1", "created": "Mon, 11 Feb 2013 19:26:17 GMT"}], "update_date": "2013-02-12", "authors_parsed": [["Foukalas", "Fotis", ""], ["Merakos", "Lazaros", ""]]}, {"id": "1302.2814", "submitter": "Boris Bellalta Dr.", "authors": "Jorge Infante and Boris Bellalta", "title": "Voice over IP in the WiFi Network business models: Will voice be a\n  killer application for WiFi Public Networks?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stunning growth of WiFi networks, together with the spreading of mobile\ntelephony and the increasing use of Voice over IP (VoIP) on top of Internet,\npose relevant questions on the application of WiFi networks to support VoIP\nservices that could be used as a complement and/or competition to the 2G/3G\ncellular networks. The paper explores the state of the art on the capability of\nWiFi networks to support voice services in a user itinerant context,\nidentifying actual and future strengths, weakness, opportunities and threats.\nFirst of all, the paper reviews the key aspects on the changing structure of\nthe voice market, dominated by a clear evolution to mobility, itinerancy and\nincreased use of VoIP-based services. The evolution of business models,\ncoverage for WiFi networks (hotspots, municipal networks, cooperative networks\nand) and user voice service use patterns are also analysed in order to asses\nthe potentialities for complementing or -in some scenarios- substitute the\ncellular networks.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2013 15:12:21 GMT"}], "update_date": "2013-02-13", "authors_parsed": [["Infante", "Jorge", ""], ["Bellalta", "Boris", ""]]}, {"id": "1302.2824", "submitter": "Florian Simatos", "authors": "Florian Simatos, Niek Bouman and Sem Borst", "title": "Lingering Issues in Distributed Scheduling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances have resulted in queue-based algorithms for medium access\ncontrol which operate in a distributed fashion, and yet achieve the optimal\nthroughput performance of centralized scheduling algorithms. However,\nfundamental performance bounds reveal that the \"cautious\" activation rules\ninvolved in establishing throughput optimality tend to produce extremely large\ndelays, typically growing exponentially in 1/(1-r), with r the load of the\nsystem, in contrast to the usual linear growth.\n  Motivated by that issue, we explore to what extent more \"aggressive\" schemes\ncan improve the delay performance. Our main finding is that aggressive\nactivation rules induce a lingering effect, where individual nodes retain\npossession of a shared resource for excessive lengths of time even while a\nmajority of other nodes idle. Using central limit theorem type arguments, we\nprove that the idleness induced by the lingering effect may cause the delays to\ngrow with 1/(1-r) at a quadratic rate. To the best of our knowledge, these are\nthe first mathematical results illuminating the lingering effect and\nquantifying the performance impact.\n  In addition extensive simulation experiments are conducted to illustrate and\nvalidate the various analytical results.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2013 15:41:25 GMT"}, {"version": "v2", "created": "Thu, 23 May 2013 11:14:34 GMT"}], "update_date": "2013-05-24", "authors_parsed": [["Simatos", "Florian", ""], ["Bouman", "Niek", ""], ["Borst", "Sem", ""]]}, {"id": "1302.3085", "submitter": "Chung Shue Chen", "authors": "I-Hong Hou, Chung Shue Chen (LINCS)", "title": "An Energy-Aware Protocol for Self-Organizing Heterogeneous LTE Systems", "comments": null, "journal-ref": null, "doi": "10.1109/JSAC.2013.130512", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the problem of self-organizing heterogeneous LTE systems.\nWe propose a model that jointly considers several important characteristics of\nheterogeneous LTE system, including the usage of orthogonal frequency division\nmultiple access (OFDMA), the frequency-selective fading for each link, the\ninterference among different links, and the different transmission capabilities\nof different types of base stations. We also consider the cost of energy by\ntaking into account the power consumption, including that for wireless\ntransmission and that for operation, of base stations and the price of energy.\nBased on this model, we aim to propose a distributed protocol that improves the\nspectrum efficiency of the system, which is measured in terms of the weighted\nproportional fairness among the throughputs of clients, and reduces the cost of\nenergy. We identify that there are several important components involved in\nthis problem. We propose distributed strategies for each of these components.\nEach of the proposed strategies requires small computational and\ncommunicational overheads. Moreover, the interactions between components are\nalso considered in the proposed strategies. Hence, these strategies result in a\nsolution that jointly considers all factors of heterogeneous LTE systems.\nSimulation results also show that our proposed strategies achieve much better\nperformance than existing ones.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2013 13:37:56 GMT"}], "update_date": "2013-07-30", "authors_parsed": [["Hou", "I-Hong", "", "LINCS"], ["Chen", "Chung Shue", "", "LINCS"]]}, {"id": "1302.3250", "submitter": "Jaewook Kwak", "authors": "Jaewook Kwak, Chul-Ho Lee, Do Young Eun", "title": "Exploiting the Past to Reduce Delay in CSMA Scheduling: A High-order\n  Markov Chain Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently several CSMA algorithms based on the Glauber dynamics model have\nbeen proposed for multihop wireless scheduling, as viable solutions to achieve\nthe throughput optimality, yet are simple to implement. However, their delay\nperformances still remain unsatisfactory, mainly due to the nature of the\nunderlying Markov chains that imposes a fundamental constraint on how the link\nstate can evolve over time. In this paper, we propose a new approach toward\nbetter queueing and delay performance, based on our observation that the\nalgorithm needs not be Markovian, as long as it can be implemented in a\ndistributed manner, achieve the same throughput optimality, while offering far\nbetter delay performance for general network topologies. Our approach hinges\nupon utilizing past state information observed by local link and then\nconstructing a high-order Markov chain for the evolution of the feasible link\nschedules. We show in theory and simulation that our proposed algorithm, named\ndelayed CSMA, adds virtually no additional overhead onto the existing\nCSMA-based algorithms, achieves the throughput optimality under the usual\nchoice of link weight as a function of local queue length, and also provides\nmuch better delay performance by effectively `de-correlating' the link state\nprocess (thus removing link starvation) under any arbitrary network topology.\nFrom our extensive simulations we observe that the delay under our algorithm\ncan be often reduced by a factor of 20 over a wide range of scenarios, compared\nto the standard Glauber-dynamics-based CSMA algorithm.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2013 21:39:34 GMT"}, {"version": "v2", "created": "Thu, 14 Mar 2013 22:54:53 GMT"}, {"version": "v3", "created": "Mon, 17 Jun 2013 02:26:33 GMT"}, {"version": "v4", "created": "Wed, 31 Jul 2013 17:30:58 GMT"}], "update_date": "2013-08-01", "authors_parsed": [["Kwak", "Jaewook", ""], ["Lee", "Chul-Ho", ""], ["Eun", "Do Young", ""]]}, {"id": "1302.3422", "submitter": "Zhe Wang", "authors": "Kai Hu, Zhe Wang, Baolin Yin", "title": "Baselining Network-Wide Traffic by Time-Frequency Constrained Stable\n  Principal Component Pursuit", "comments": "Accepted to AEU-International Journal of Electronics and\n  Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet traffic analysis is important to network management,and\nextracting the baseline traffic patterns is especially helpful for some\nsignificant network applications.In this paper, we study on the baseline\nproblem of the traffic matrix satisfying a refined traffic matrix decomposition\nmodel,since this model extends the assumption of the baseline traffic component\nto characterize its smoothness, and is more realistic than the existing traffic\nmatrix models. We develop a novel baseline scheme, named Stable Principal\nComponent Pursuit with Time-Frequency Constraints (SPCP-TFC), which extends the\nStable Principal Component Pursuit (SPCP) by applying new time-frequency\nconstraints. Then we design an efficient numerical algorithm for SPCP-TFC. At\nlast, we evaluate this baseline scheme through simulations, and show it has\nsuperior performance than the existing baseline schemes RBL and PCA.\n", "versions": [{"version": "v1", "created": "Thu, 14 Feb 2013 15:00:26 GMT"}, {"version": "v2", "created": "Wed, 27 Feb 2013 05:11:06 GMT"}, {"version": "v3", "created": "Mon, 3 Mar 2014 11:55:13 GMT"}, {"version": "v4", "created": "Fri, 26 Jun 2015 06:46:48 GMT"}], "update_date": "2015-06-29", "authors_parsed": [["Hu", "Kai", ""], ["Wang", "Zhe", ""], ["Yin", "Baolin", ""]]}, {"id": "1302.3440", "submitter": "Rachadi Abdeljalil", "authors": "Abdeljalil Rachadi, Mohamed Jedra and Noureddine Zahid", "title": "Self Avoiding Paths Routing Algorithm in Scale-Free Networks", "comments": "Published in Chaos: An Interdisciplinary Journal of Nonlinear Science", "journal-ref": "Chaos 23, 013114 (2013)", "doi": "10.1063/1.4790864", "report-no": null, "categories": "cs.NI physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a new routing algorithm called \"the Self Avoiding\nPaths Routing Algorithm\". Its application to traffic flow in scale-free\nnetworks shows a great improvement over the so called \"efficient routing\"\nprotocol while at the same time maintaining a relatively low average packet\ntravel time. It has the advantage of minimizing path overlapping throughout the\nnetwork in a self consistent manner with a relatively small number of\niterations by maintaining an equilibrated path distribution especially among\nthe hubs. This results in a significant shifting of the critical packet\ngeneration rate over which traffic congestion occurs, thus permitting the\nnetwork to sustain more information packets in the free flow state. The\nperformance of the algorithm is discussed both on a Bar\\'abasi-Albert (BA)\nnetwork and real autonomous system (AS) network data.\n", "versions": [{"version": "v1", "created": "Thu, 14 Feb 2013 15:47:29 GMT"}], "update_date": "2013-02-18", "authors_parsed": [["Rachadi", "Abdeljalil", ""], ["Jedra", "Mohamed", ""], ["Zahid", "Noureddine", ""]]}, {"id": "1302.3726", "submitter": "Aaron Potechin", "authors": "Aaron Potechin", "title": "Improved upper and lower bound techniques for monotone switching\n  networks for directed connectivity", "comments": "48 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we analyze the monotone space of complexity of directed\nconnectivity for a large class of input graphs $G$ using the switching network\nmodel. The upper and lower bounds we obtain are a significant generalization of\nprevious results and the proofs involve several completely new techniques and\nideas.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2013 11:04:14 GMT"}, {"version": "v2", "created": "Mon, 16 Dec 2013 01:18:24 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Potechin", "Aaron", ""]]}, {"id": "1302.3784", "submitter": "Supratim Deb Supratim Deb", "authors": "Supratim Deb, Pantelis Monogioudis, Jerzy Miernik, James P. Seymour", "title": "Algorithms for Enhanced Inter Cell Interference Coordination (eICIC) in\n  LTE HetNets", "comments": "Accepted to appear in IEEE/ACM Transactions on Networking", "journal-ref": null, "doi": "10.1109/TNET.2013.2246820", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The success of LTE Heterogeneous Networks (HetNets) with macro cells and pico\ncells critically depends on efficient spectrum sharing between high-power\nmacros and low-power picos. Two important challenges in this context are, {(i)}\ndetermining the amount of radio resources that macro cells should {\\em offer}\nto pico cells, and {(ii)} determining the association rules that decide which\nUEs should associate with picos. In this paper, we develop a novel algorithm to\nsolve these two coupled problems in a joint manner. Our algorithm has provable\nguarantee, and furthermore, it accounts for network topology, traffic load, and\nmacro-pico interference map. Our solution is standard compliant and can be\nimplemented using the notion of Almost Blank Subframes (ABS) and Cell Selection\nBias (CSB) proposed by LTE standards. We also show extensive evaluations using\nRF plan from a real network and discuss SON based eICIC implementation.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2013 15:43:30 GMT"}], "update_date": "2013-02-18", "authors_parsed": [["Deb", "Supratim", ""], ["Monogioudis", "Pantelis", ""], ["Miernik", "Jerzy", ""], ["Seymour", "James P.", ""]]}, {"id": "1302.4030", "submitter": "Jianwei Zhang", "authors": "Jianwei Zhang, Wei Xing, Yongchao Wang and Dongming Lu", "title": "Modeling and Performance Analysis of Pull-Based Live Streaming Schemes\n  in Peer-to-Peer Network", "comments": null, "journal-ref": "Computer Communications, vol. 40, pp. 22-32, Mar. 2014", "doi": "10.1016/j.comcom.2013.12.002", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent years mesh-based Peer-to-Peer live streaming has become a promising\nway for service providers to offer high-quality live video streaming service to\nInternet users. In this paper, we make a detailed study on modeling and\nperformance analysis of the pull-based P2P streaming systems. We establish the\nanalytical framework for the pull-based streaming schemes in P2P network, give\naccurate models of the chunk selection and peer selection strategies, and\norganize them into three categories, i.e., the chunk first scheme, the peer\nfirst scheme and the epidemic scheme. Through numerical performance evaluation,\nthe impacts of some important parameters, such as size of neighbor set, reply\nnumber, buffer size and so on are investigated. For the peer first and chunk\nfirst scheme, we show that the pull-based schemes do not perform as well as the\npush-based schemes when peers are limited to reply only one request in each\ntime slot. When the reply number increases, the pull-based streaming schemes\nwill reach close to optimal playout probability. As to the pull-based epidemic\nscheme, we find it has unexpected poor performance, which is significantly\ndifferent from the push-based epidemic scheme. Therefore we propose a simple,\nefficient and easily deployed push-pull scheme which can significantly improve\nthe playout probability.\n", "versions": [{"version": "v1", "created": "Sun, 17 Feb 2013 04:56:56 GMT"}], "update_date": "2014-02-06", "authors_parsed": [["Zhang", "Jianwei", ""], ["Xing", "Wei", ""], ["Wang", "Yongchao", ""], ["Lu", "Dongming", ""]]}, {"id": "1302.4046", "submitter": "Tejaswi Agarwal", "authors": "Tejaswi Agarwal and Mike A. Leonetti", "title": "Design and Implementation of an IP based authentication mechanism for\n  Open Source Proxy Servers in Interception Mode", "comments": "11 pages, Authenticating Clients in Transparent/ Interception Mode,\n  Squid Proxy Server", "journal-ref": "Advanced Computing: An International Journal, Vol 4, Number 1,\n  January 2013", "doi": "10.5121/acij.2013.4103", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proxy servers are being increasingly deployed at organizations for\nperformance benefits; however, there still exists drawbacks in ease of client\nauthentication in interception proxy mode mainly for Open Source Proxy Servers.\n  Technically, an interception mode is not designed for client authentication,\nbut implementation in certain organizations does require this feature. In this\npaper, we focus on the World Wide Web, highlight the existing transparent proxy\nauthentication mechanisms, its drawbacks and propose an authentication scheme\nfor transparent proxy users by using external scripts based on the clients\nInternet Protocol Address. This authentication mechanism has been implemented\nand verified on Squid-one of the most widely used HTTP Open Source Proxy\nServer.\n", "versions": [{"version": "v1", "created": "Sun, 17 Feb 2013 09:31:58 GMT"}], "update_date": "2013-02-19", "authors_parsed": [["Agarwal", "Tejaswi", ""], ["Leonetti", "Mike A.", ""]]}, {"id": "1302.4128", "submitter": "Supratim Deb Supratim Deb", "authors": "Avhishek Chatterjee, Supratim Deb, Kanthi Nagaraj, Vikram Srinivasan", "title": "Low Delay MAC Scheduling for Frequency-agile Multi-radio Wireless\n  Networks", "comments": "Accepted to appear in IEEE Journal on Selected Areas in Communication\n  (JSAC) - Cognitive Radio Series, 2013", "journal-ref": null, "doi": "10.1109/JSAC.2013.131106", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent trends suggest that cognitive radio based wireless networks will be\nfrequency agile and the nodes will be equipped with multiple radios capable of\ntuning across large swaths of spectrum. The MAC scheduling problem in such\nnetworks refers to making intelligent decisions on which communication links to\nactivate at which time instant and over which frequency band. The challenge in\ndesigning a low-complexity distributed MAC, that achieves low delay, is posed\nby two additional dimensions of cognitive radio networks: interference graphs\nand data rates that are frequency-band dependent, and explosion in number of\nfeasible schedules due to large number of available frequency-bands. In this\npaper, we propose MAXIMALGAIN MAC, a distributed MAC scheduler for frequency\nagile multi-band networks that simultaneously achieves the following: (i)\noptimal network-delay scaling with respect to the number of communicating\npairs, (ii) low computational complexity of O(log2(maximum degree of the\ninterference graphs)) which is independent of the number of frequency bands,\nnumber of radios per node, and overall size of the network, and (iii)\nrobustness, i.e., it can be adapted to a scenario where nodes are not\nsynchronized and control packets could be lost. Our proposed MAC also achieves\na throughput provably within a constant fraction (under isotropic propagation)\nof the maximum throughput. Due to a recent impossibility result, optimal\ndelay-scaling could only be achieved with some amount of throughput loss [30].\nExtensive simulations using OMNeT++ network simulator shows that, compared to a\nmulti-band extension of a state-of-art CSMA algorithm (namely, Q-CSMA), our\nasynchronous algorithm achieves a 2.5x? reduction in delay while achieving at\nleast 85% of the maximum achievable throughput. Our MAC algorithms are derived\nfrom a novel local search based technique.\n", "versions": [{"version": "v1", "created": "Sun, 17 Feb 2013 22:33:53 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Chatterjee", "Avhishek", ""], ["Deb", "Supratim", ""], ["Nagaraj", "Kanthi", ""], ["Srinivasan", "Vikram", ""]]}, {"id": "1302.4283", "submitter": "Hirley Alves", "authors": "Hirley Alves, Mehdi Bennis, Walid Saad, M\\'erouane Debbah and Matti\n  Latva-aho", "title": "On the Fly Self-Organized Base Station Placement", "comments": "This paper has been withdrawn because this isnt the final version of\n  the manuscript", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address the deployment of base stations (BSs) in a\none-dimensional network in which the users are randomly distributed.In order to\ntake into account the users' distribution to optimally place the BSs we\noptimize the uplink MMSE sum rate. Moreover, given a massive number of antennas\nat the BSs we propose a novel random matrix theory-based technique so as to\nobtain tight approximations for the MMSE sum rate in the uplink. We investigate\na cooperative (CP) scenario where the BSs jointly decode the messages and a\nnon-cooperative (NCP) scheme in which the BS can only decode its own users. Our\nresults show that the CP strategy considerably outperforms the NCP case.\nMoreover, we show that there exists a trade off in the BS deployment regarding\nthe position of each BS. Thus, through location games we can optimize the\nposition of each BS in order to maximize the system performance.\n", "versions": [{"version": "v1", "created": "Mon, 18 Feb 2013 14:20:04 GMT"}, {"version": "v2", "created": "Thu, 21 Feb 2013 09:28:43 GMT"}], "update_date": "2013-02-22", "authors_parsed": [["Alves", "Hirley", ""], ["Bennis", "Mehdi", ""], ["Saad", "Walid", ""], ["Debbah", "Mérouane", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1302.4474", "submitter": "Aditya Ramamoorthy", "authors": "Shurui Huang and Aditya Ramamoorthy", "title": "On the multiple unicast capacity of 3-source, 3-terminal directed\n  acyclic networks", "comments": "To appear in the IEEE/ACM Transactions on Networking", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the multiple unicast problem with three source-terminal pairs\nover directed acyclic networks with unit-capacity edges. The three $s_i-t_i$\npairs wish to communicate at unit-rate via network coding. The connectivity\nbetween the $s_i - t_i$ pairs is quantified by means of a connectivity level\nvector, $[k_1 k_2 k_3]$ such that there exist $k_i$ edge-disjoint paths between\n$s_i$ and $t_i$. In this work we attempt to classify networks based on the\nconnectivity level. It can be observed that unit-rate transmission can be\nsupported by routing if $k_i \\geq 3$, for all $i = 1, \\dots, 3$. In this work,\nwe consider, connectivity level vectors such that $\\min_{i = 1, \\dots, 3} k_i <\n3$. We present either a constructive linear network coding scheme or an\ninstance of a network that cannot support the desired unit-rate requirement,\nfor all such connectivity level vectors except the vector $[1~2~4]$ (and its\npermutations). The benefits of our schemes extend to networks with higher and\npotentially different edge capacities. Specifically, our experimental results\nindicate that for networks where the different source-terminal paths have a\nsignificant overlap, our constructive unit-rate schemes can be packed along\nwith routing to provide higher throughput as compared to a pure routing\napproach.\n", "versions": [{"version": "v1", "created": "Mon, 18 Feb 2013 22:31:40 GMT"}], "update_date": "2013-02-20", "authors_parsed": [["Huang", "Shurui", ""], ["Ramamoorthy", "Aditya", ""]]}, {"id": "1302.4656", "submitter": "Caihong Kai", "authors": "Caihong Kai and Shengli Zhang", "title": "Throughput Analysis of CSMA Wireless Networks with Finite Offered-load", "comments": "6 pages. arXiv admin note: text overlap with arXiv:1007.5255 by other\n  authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes an approximate method, equivalent access intensity (EAI),\nfor the throughput analysis of CSMA wireless networks in which links have\nfinite offered-load and their MAC-layer transmit buffers may be empty from time\nto time. Different from prior works that mainly considered the saturated\nnetwork, we take into account in our analysis the impacts of empty transmit\nbuffers on the interactions and dependencies among links in the network that is\nmore common in practice. It is known that the empty transmit buffer incurs\nextra waiting time for a link to compete for the channel airtime usage, since\nwhen it has no packet waiting for transmission, the link will not perform\nchannel competition. The basic idea behind EAI is that this extra waiting time\ncan be mapped to an equivalent \"longer\" backoff countdown time for the\nunsaturated link, yielding a lower link access intensity that is defined as the\nmean packet transmission time divided by the mean backoff countdown time. That\nis, we can compute the \"equivalent access intensity\" of an unsaturated link to\nincorporate the effects of the empty transmit buffer on its behavior of channel\ncompetition. Then, prior saturated ideal CSMA network (ICN) model can be\nadopted for link throughput computation. Specifically, we propose an iterative\nalgorithm, \"Compute-and-Compare\", to identify which links are unsaturated under\ncurrent offered-load and protocol settings, compute their \"equivalent access\nintensities\" and calculate link throughputs. Simulation shows that our\nalgorithm has high accuracy under various offered-load and protocol settings.\nWe believe the ability to identify unsaturated links and compute links\nthroughputs as established in this paper will serve an important first step\ntoward the design and optimization of general CSMA wireless networks with\noffered-load control.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2013 16:05:53 GMT"}], "update_date": "2013-02-20", "authors_parsed": [["Kai", "Caihong", ""], ["Zhang", "Shengli", ""]]}, {"id": "1302.4720", "submitter": "Maurizio Bocca Ph.D.", "authors": "Maurizio Bocca, Ossi Kaltiokallio, Neal Patwari, Suresh\n  Venkatasubramanian", "title": "Multiple Target Tracking with RF Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RF sensor networks are wireless networks that can localize and track people\n(or targets) without needing them to carry or wear any electronic device. They\nuse the change in the received signal strength (RSS) of the links due to the\nmovements of people to infer their locations. In this paper, we consider\nreal-time multiple target tracking with RF sensor networks. We perform radio\ntomographic imaging (RTI), which generates images of the change in the\npropagation field, as if they were frames of a video. Our RTI method uses RSS\nmeasurements on multiple frequency channels on each link, combining them with a\nfade level-based weighted average. We describe methods to adapt machine vision\nmethods to the peculiarities of RTI to enable real time multiple target\ntracking. Several tests are performed in an open environment, a one-bedroom\napartment, and a cluttered office environment. The results demonstrate that the\nsystem is capable of accurately tracking in real-time up to 4 targets in\ncluttered indoor environments, even when their trajectories intersect multiple\ntimes, without mis-estimating the number of targets found in the monitored\narea. The highest average tracking error measured in the tests is 0.45 m with\ntwo targets, 0.46 m with three targets, and 0.55 m with four targets.\n", "versions": [{"version": "v1", "created": "Mon, 11 Feb 2013 17:16:30 GMT"}], "update_date": "2013-02-20", "authors_parsed": [["Bocca", "Maurizio", ""], ["Kaltiokallio", "Ossi", ""], ["Patwari", "Neal", ""], ["Venkatasubramanian", "Suresh", ""]]}, {"id": "1302.4793", "submitter": "Seunghyun Lee", "authors": "Seunghyun Lee, Rui Zhang, Kaibin Huang", "title": "Opportunistic Wireless Energy Harvesting in Cognitive Radio Networks", "comments": "This is the longer version of a paper to appear in IEEE Transactions\n  on Wireless Communications", "journal-ref": null, "doi": "10.1109/TWC.2013.072613.130323", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless networks can be self-sustaining by harvesting energy from ambient\nradio-frequency (RF) signals. Recently, researchers have made progress on\ndesigning efficient circuits and devices for RF energy harvesting suitable for\nlow-power wireless applications. Motivated by this and building upon the\nclassic cognitive radio (CR) network model, this paper proposes a novel method\nfor wireless networks coexisting where low-power mobiles in a secondary\nnetwork, called secondary transmitters (STs), harvest ambient RF energy from\ntransmissions by nearby active transmitters in a primary network, called\nprimary transmitters (PTs), while opportunistically accessing the spectrum\nlicensed to the primary network. We consider a stochastic-geometry model in\nwhich PTs and STs are distributed as independent homogeneous Poisson point\nprocesses (HPPPs) and communicate with their intended receivers at fixed\ndistances. Each PT is associated with a guard zone to protect its intended\nreceiver from ST's interference, and at the same time delivers RF energy to STs\nlocated in its harvesting zone. Based on the proposed model, we analyze the\ntransmission probability of STs and the resulting spatial throughput of the\nsecondary network. The optimal transmission power and density of STs are\nderived for maximizing the secondary network throughput under the given\noutage-probability constraints in the two coexisting networks, which reveal key\ninsights to the optimal network design. Finally, we show that our analytical\nresult can be generally applied to a non-CR setup, where distributed wireless\npower chargers are deployed to power coexisting wireless transmitters in a\nsensor network.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2013 02:26:27 GMT"}, {"version": "v2", "created": "Fri, 12 Jul 2013 05:41:46 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Lee", "Seunghyun", ""], ["Zhang", "Rui", ""], ["Huang", "Kaibin", ""]]}, {"id": "1302.4882", "submitter": "Jaydip Sen", "authors": "Jaydip Sen", "title": "Detection of Cooperative Black Hole Attack in Wireless Ad Hoc Networks", "comments": "8 pages, 14 figures, 2 tables. This journal paper is an extended\n  version of the already published conference paper of the author which is\n  having arXiv identifier: arXiv:1111.0387. arXiv admin note: the majority of\n  this single-authored submission is identical to arXiv:1111.0387, co-authored\n  with two others", "journal-ref": "International Journal of Simulation,Systems,Science and\n  Technology. Vol 12, No 4, August 2011", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A mobile ad hoc network (MANET) is a collection of autonomous nodes that\ncommunicate with each other by forming a multi-hop radio network and\nmaintaining connections in a decentralized manner. Security remains a major\nchallenge for these networks due to their features of open medium, dynamically\nchanging topologies, reliance on cooperative algorithms, absence of centralized\nmonitoring points, and lack of clear lines of defense. Protecting the network\nlayer of a MANET from malicious attacks is an important and challenging\nsecurity issue, since most of the routing protocols for MANETs are vulnerable\nto various types of attacks. Ad hoc on-demand distance vector routing (AODV) is\na very popular routing algorithm. However, it is vulnerable to the well-known\nblack hole attack, where a malicious node falsely advertises good paths to a\ndestination node during the route discovery process but drops all packets in\nthe data forwarding phase. This attack becomes more severe when a group of\nmalicious nodes cooperate each other. The proposed mechanism does not apply any\ncryptographic primitives on the routing messages. Instead, it protects the\nnetwork by detecting and reacting to malicious activities of the nodes.\nSimulation results show that the scheme has a significantly high detection rate\nwith moderate network traffic overhead and computation overhead in the nodes.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2013 11:43:04 GMT"}], "update_date": "2013-02-21", "authors_parsed": [["Sen", "Jaydip", ""]]}, {"id": "1302.5173", "submitter": "EPTCS", "authors": "Helena Gruhn, Sabine Glesner", "title": "Towards a Formal Framework for Mobile, Service-Oriented Sensor-Actuator\n  Networks", "comments": "In Proceedings FESCA 2013, arXiv:1302.4780", "journal-ref": "EPTCS 108, 2013, pp. 49-62", "doi": "10.4204/EPTCS.108.4", "report-no": null, "categories": "cs.NI cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Service-oriented sensor-actuator networks (SOSANETs) are deployed in\nhealth-critical applications like patient monitoring and have to fulfill strong\nsafety requirements. However, a framework for the rigorous formal modeling and\nanalysis of SOSANETs does not exist. In particular, there is currently no\nsupport for the verification of correct network behavior after node failure or\nloss/addition of communication links. To overcome this problem, we propose a\nformal framework for SOSANETs. The main idea is to base our framework on the\n\\pi-calculus, a formally defined, compositional and well-established formalism.\nWe choose KLAIM, an existing formal language based on the \\pi-calculus as the\nfoundation for our framework. With that, we are able to formally model SOSANETs\nwith possible topology changes and network failures. This provides the basis\nfor our future work on prediction, analysis and verification of the network\nbehavior of these systems. Furthermore, we illustrate the real-life\napplicability of this approach by modeling and extending a use case scenario\nfrom the medical domain.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2013 03:59:54 GMT"}], "update_date": "2013-02-22", "authors_parsed": [["Gruhn", "Helena", ""], ["Glesner", "Sabine", ""]]}, {"id": "1302.5384", "submitter": "Beena Joy Chirayil", "authors": "Beena Joy Chirayil", "title": "Facilitating Machine to Machine (M2M) Communication using GSM Network", "comments": null, "journal-ref": "Published in the Proceedings of 2012 International Conference on\n  the Internet of Things (IoT), Wuxi; presented in M2M-CTS'12 Workshop", "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper a method to facilitate M2M communication using existing GSM\nnetworks is proposed - as M2M devices primarily use SMS as their data bearer,\nthe focus is on increasing the number of devices that can use the associated\nGSM signaling channels at a time. This is achieved by defining a new class of\nlow mobility, static M2M devices which use a modified physical layer control\nframe structure. The proposal is expected to aid a quick, reliable and\ncost-effective deployment of M2M devices in the existing GSM networks.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2013 19:38:05 GMT"}], "update_date": "2013-02-22", "authors_parsed": [["Chirayil", "Beena Joy", ""]]}, {"id": "1302.5414", "submitter": "Marco Chiesa", "authors": "Marco Chiesa, Gabriele Lospoto, Massimo Rimondini, and Giuseppe Di\n  Battista", "title": "Intra-Domain Pathlet Routing", "comments": "13 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internal routing inside an ISP network is the foundation for lots of services\nthat generate revenue from the ISP's customers. A fine-grained control of paths\ntaken by network traffic once it enters the ISP's network is therefore a\ncrucial means to achieve a top-quality offer and, equally important, to enforce\nSLAs. Many widespread network technologies and approaches (most notably, MPLS)\noffer limited (e.g., with RSVP-TE), tricky (e.g., with OSPF metrics), or no\ncontrol on internal routing paths. On the other hand, recent advances in the\nresearch community are a good starting point to address this shortcoming, but\nmiss elements that would enable their applicability in an ISP's network.\n  We extend pathlet routing by introducing a new control plane for internal\nrouting that has the following qualities: it is designed to operate in the\ninternal network of an ISP; it enables fine-grained management of network paths\nwith suitable configuration primitives; it is scalable because routing changes\nare only propagated to the network portion that is affected by the changes; it\nsupports independent configuration of specific network portions without the\nneed to know the configuration of the whole network; it is robust thanks to the\nadoption of multipath routing; it supports the enforcement of QoS levels; it is\nindependent of the specific data plane used in the ISP's network; it can be\nincrementally deployed and it can nicely coexist with other control planes.\nBesides formally introducing the algorithms and messages of our control plane,\nwe propose an experimental validation in the simulation framework OMNeT++ that\nwe use to assess the effectiveness and scalability of our approach.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2013 20:55:20 GMT"}, {"version": "v2", "created": "Mon, 4 Mar 2013 02:45:12 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Chiesa", "Marco", ""], ["Lospoto", "Gabriele", ""], ["Rimondini", "Massimo", ""], ["Di Battista", "Giuseppe", ""]]}, {"id": "1302.5442", "submitter": "Weisheng Si", "authors": "Weisheng Si", "title": "Are Yao Graph and Theta Graph Void Free?", "comments": "4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Greedy Forwarding algorithm is a widely-used routing algorithm for wireless\nnetworks. However, it can fail if network topologies (usually modeled by\ngeometric graphs) contain voids. Since Yao Graph and Theta Graph are two types\nof geometric graphs exploited to construct wireless network topologies, this\npaper studies whether these two types of graphs can contain voids.\nSpecifically, this paper shows that when the number of cones in a Yao Graph or\nTheta Graph is less than 6, Yao Graph and Theta Graph can have voids, but when\nthe number of cones equals or exceeds 6, Yao Graph and Theta Graph are free of\nvoids.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2013 22:09:08 GMT"}, {"version": "v2", "created": "Tue, 2 Jul 2013 23:04:20 GMT"}], "update_date": "2013-07-04", "authors_parsed": [["Si", "Weisheng", ""]]}, {"id": "1302.5734", "submitter": "Xun Gong", "authors": "Xun Gong, Mavis Rodrigues, Negar Kiyavash", "title": "Invisible Flow Watermarks for Channels with Dependent Substitution,\n  Deletion, and Bursty Insertion Errors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flow watermarks efficiently link packet flows in a network in order to thwart\nvarious attacks such as stepping stones. We study the problem of designing good\nflow watermarks. Earlier flow watermarking schemes mostly considered\nsubstitution errors, neglecting the effects of packet insertions and deletions\nthat commonly happen within a network. More recent schemes consider packet\ndeletions but often at the expense of the watermark visibility. We present an\ninvisible flow watermarking scheme capable of enduring a large number of packet\nlosses and insertions. To maintain invisibility, our scheme uses quantization\nindex modulation (QIM) to embed the watermark into inter-packet delays, as\nopposed to time intervals including many packets. As the watermark is injected\nwithin individual packets, packet losses and insertions may lead to watermark\ndesynchronization and substitution errors. To address this issue, we add a\nlayer of error-correction coding to our scheme. Experimental results on both\nsynthetic and real network traces demonstrate that our scheme is robust to\nnetwork jitter, packet drops and splits, while remaining invisible to an\nattacker.\n", "versions": [{"version": "v1", "created": "Fri, 22 Feb 2013 22:46:59 GMT"}, {"version": "v2", "created": "Fri, 14 Jun 2013 18:38:46 GMT"}], "update_date": "2013-06-17", "authors_parsed": [["Gong", "Xun", ""], ["Rodrigues", "Mavis", ""], ["Kiyavash", "Negar", ""]]}, {"id": "1302.5872", "submitter": "K. V. Rashmi", "authors": "K. V. Rashmi, Nihar B. Shah, Kannan Ramchandran", "title": "A Piggybacking Design Framework for Read-and Download-efficient\n  Distributed Storage Codes", "comments": "Extended version of ISIT 2013 submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new 'piggybacking' framework for designing distributed storage\ncodes that are efficient in data-read and download required during node-repair.\nWe illustrate the power of this framework by constructing classes of explicit\ncodes that entail the smallest data-read and download for repair among all\nexisting solutions for three important settings: (a) codes meeting the\nconstraints of being Maximum-Distance-Separable (MDS), high-rate and having a\nsmall number of substripes, arising out of practical considerations for\nimplementation in data centers, (b) binary MDS codes for all parameters where\nbinary MDS codes exist, (c) MDS codes with the smallest repair-locality. In\naddition, we employ this framework to enable efficient repair of parity nodes\nin existing codes that were originally constructed to address the repair of\nonly the systematic nodes. The basic idea behind our framework is to take\nmultiple instances of existing codes and add carefully designed functions of\nthe data of one instance to the other. Typical savings in data-read during\nrepair is 25% to 50% depending on the choice of the code parameters.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2013 05:20:03 GMT"}], "update_date": "2013-02-26", "authors_parsed": [["Rashmi", "K. V.", ""], ["Shah", "Nihar B.", ""], ["Ramchandran", "Kannan", ""]]}, {"id": "1302.5903", "submitter": "Arvind Viswanathan", "authors": "Arvind Viswanathan, Dr. Garimella Rama Murthy", "title": "Heterogeneous Dynamic Priority Scheduling in time critical applications:\n  Mobile Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the unlicensed band, the notion of primary user and secondary user (To\nimplement cognitive radio) is not explicit. By dynamic priority assignment we\npropose to implement cognitive radio in the unlicensed band. In time critical\nevents, the data which is most important, has to be given the time slots.\nWireless Sensor nodes in our case are considered to be mobile, and hence make\nit difficult to prioritize one over another. A node may be out of the reach of\nthe cluster head or base station by the time it is allotted a time slot and\nhence mobility is a constraint. With the data changing dynamically and factors\nsuch as energy and mobility, which are major constraints, assigning priority to\nthe nodes becomes difficult. In this paper, we have discussed about how\nWireless Sensor Networks are able to allocate priorities to nodes in the\nunlicensed band with multiple parameters being posed. We have done simulations\non NS-2 and have shown the implementation results.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2013 13:26:43 GMT"}, {"version": "v2", "created": "Sun, 3 Mar 2013 10:36:23 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Viswanathan", "Arvind", ""], ["Murthy", "Dr. Garimella Rama", ""]]}, {"id": "1302.5914", "submitter": "Ossi Kaltiokallio j", "authors": "Ossi Kaltiokallio, Maurizio Bocca and Neal Patwari", "title": "A Multi-Scale Spatial Model for RSS-based Device-Free Localization", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RSS-based device-free localization (DFL) monitors changes in the received\nsignal strength (RSS) measured by a network of static wireless nodes to locate\npeople without requiring them to carry or wear any electronic device. Current\nmodels assume that the spatial impact area, i.e., the area in which a person\naffects a link's RSS, has constant size. This paper shows that the spatial\nimpact area varies considerably for each link. Data from extensive experiments\nare used to derive a multi-scale spatial weight model that is a function of the\nfade level, i.e., the difference between the predicted and measured RSS, and of\nthe direction of RSS change. In addition, a measurement model is proposed which\ngives a probability of a person locating inside the derived spatial model for\neach given RSS measurement. A real-time radio tomographic imaging system is\ndescribed which uses channel diversity and the presented models. Experiments in\nan open indoor environment, in a typical one-bedroom apartment and in a\nthrough-wall scenario are conducted to determine the accuracy of the system. We\ndemonstrate that the new system is capable of localizing and tracking a person\nwith high accuracy (<0.30 m) in all the environments, without the need to\nchange the model parameters.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2013 15:18:26 GMT"}], "update_date": "2013-02-26", "authors_parsed": [["Kaltiokallio", "Ossi", ""], ["Bocca", "Maurizio", ""], ["Patwari", "Neal", ""]]}, {"id": "1302.5929", "submitter": "Ramchandra Mangrulkar", "authors": "R.S.Mangrulkar and Dr. Mohammad Atique", "title": "Performance Evaluation of Delay Tolerant Network in Heterogeneous Highly\n  Dense Mobile Environment", "comments": "15 pages,9 figures,16 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Delay tolerant network (DTN) is opportunistic network where each node\nsearches best opportunity to deliver the message called bundle to the\ndestination. DTN implements a store and forward message switching system by\nsimply introducing another new protocol layer called the Bundle Layer on top of\nthe transport layer. The bundle layer is responsible for storing and forwarding\nentire message in message segments called bundles between source node and\ndestination node. This paper evaluates the performance of delay tolerant\nnetwork layer in heterogeneous highly dense mobile node environment. The\nheterogeneous network is created with the help of stationary wired node and\nBase Station node by introducing dynamic dense Mobile node network. Mobile\nnodes are assigned with continuous mobility. Three parameters are suggested\n$\\Delta$, $\\Theta$ and $\\lambda$ to correlate the results obtained using\nrigorous simulation. Results show that after some threshold values, dense\nfeature about mobile node does not pretend the delay cause for delay tolerant\nnetwork packets. Also, increase in number of mobile node and number of File\nTransfer connection rarely change the overall performance of the delay tolerant\nnetwork.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2013 17:08:35 GMT"}], "update_date": "2013-02-26", "authors_parsed": [["Mangrulkar", "R. S.", ""], ["Atique", "Dr. Mohammad", ""]]}, {"id": "1302.5945", "submitter": "Javad Ghaderi", "authors": "Javad Ghaderi, Sem Borst, Phil Whiting", "title": "Queue-Based Random-Access Algorithms: Fluid Limits and Stability Issues", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use fluid limits to explore the (in)stability properties of wireless\nnetworks with queue-based random-access algorithms. Queue-based random-access\nschemes are simple and inherently distributed in nature, yet provide the\ncapability to match the optimal throughput performance of centralized\nscheduling mechanisms in a wide range of scenarios. Unfortunately, the type of\nactivation rules for which throughput optimality has been established, may\nresult in excessive queue lengths and delays. The use of more\naggressive/persistent access schemes can improve the delay performance, but\ndoes not offer any universal maximum-stability guarantees. In order to gain\nqualitative insight and investigate the (in)stability properties of more\naggressive/persistent activation rules, we examine fluid limits where the\ndynamics are scaled in space and time. In some situations, the fluid limits\nhave smooth deterministic features and maximum stability is maintained, while\nin other scenarios they exhibit random oscillatory characteristics, giving rise\nto major technical challenges. In the latter regime, more aggressive access\nschemes continue to provide maximum stability in some networks, but may cause\ninstability in others. Simulation experiments are conducted to illustrate and\nvalidate the analytical results.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2013 19:49:00 GMT"}], "update_date": "2013-02-26", "authors_parsed": [["Ghaderi", "Javad", ""], ["Borst", "Sem", ""], ["Whiting", "Phil", ""]]}, {"id": "1302.6156", "submitter": "Ankit Singla", "authors": "Ankit Singla, P. Brighten Godfrey, Kevin Fall, Gianluca Iannaccone,\n  and Sylvia Ratnasamy", "title": "Scalable Routing on Flat Names", "comments": "13 pages", "journal-ref": "Extends our ACM CoNEXT 2010 paper with proofs for the theoretical\n  results", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a protocol which routes on flat, location-independent\nidentifiers with guaranteed scalability and low stretch. Our design builds on\ntheoretical advances in the area of compact routing, and is the first to\nrealize these guarantees in a dynamic distributed setting.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2013 17:00:31 GMT"}], "update_date": "2013-02-26", "authors_parsed": [["Singla", "Ankit", ""], ["Godfrey", "P. Brighten", ""], ["Fall", "Kevin", ""], ["Iannaccone", "Gianluca", ""], ["Ratnasamy", "Sylvia", ""]]}, {"id": "1302.6274", "submitter": "Ibrahim Al Shourbaji H", "authors": "Ibrahim Al Shourbaji, Rafat AlAmeer", "title": "Wireless Intrusion Detection Systems(WIDS)", "comments": "6 pages,2 figures,World Science Publisher,Advances in Computer\n  Science and its Applications (ACSA),Vol. 2, No. 3,February 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The rapid proliferation of wireless networks and mobile computing\napplications has changed the landscape of network security,the wireless\nnetworks have changed the way business, organizations work and offered a new\nrange of possibilities and flexibilities; It is clear that wireless solutions\nare transforming the way we work and live. Employees are able to keep in touch\nwith their e-mail, calendar and employer from mobile devices, but on the other\nhands they introduced a new security threats appeared. While an attacker needs\nphysical access to a wired network in order to gain access to the network and\nto accomplish his goals, a wireless network allows anyone within its range to\npassively monitor the traffic or even start an attack,one of the\ncountermeasures that can be used is the intrusion detection systems in order to\nallow us to know both the threats affecting our wireless network and our system\nvulnerabilities in order to prevent those attackers, the IDS its main purpose\nis to manage the system and its operations and Its duty depends on .\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2013 23:07:24 GMT"}, {"version": "v2", "created": "Wed, 27 Feb 2013 20:09:56 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Shourbaji", "Ibrahim Al", ""], ["AlAmeer", "Rafat", ""]]}, {"id": "1302.6324", "submitter": "Shi Dong", "authors": "Dingding Zhou, Songling Chen, Shi Dong", "title": "Network traffic prediction based on ARFIMA model", "comments": "4 figures,5 tables,6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  ARFIMA is a time series forecasting model, which is an improved ARMA model,\nthe ARFIMA model proposed in this article is demonstrated and deduced in\ndetail. combined with network traffic of CERNET backbone and the ARFIMA\nmodel,the result shows that,compare to the ARMA model, the prediction\nefficiency and accuracy has increased significantly, and not susceptible to\nsampling.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2013 06:20:30 GMT"}], "update_date": "2013-02-27", "authors_parsed": [["Zhou", "Dingding", ""], ["Chen", "Songling", ""], ["Dong", "Shi", ""]]}, {"id": "1302.6602", "submitter": "Lamiaa Ibrahim Fattouh", "authors": "Lamiaa Fattouh Ibrahim, Manal Hamed Al Harbi", "title": "Using Modified Partitioning Around Medoids Clustering Technique in\n  Mobile Network Planning", "comments": "10 pages, 15 figures", "journal-ref": "International Journal of Computer Science Issues Volume 9, Issue\n  6, November 2012", "doi": null, "report-no": null, "categories": "cs.AI cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Every cellular network deployment requires planning and optimization in order\nto provide adequate coverage, capacity, and quality of service (QoS).\nOptimization mobile radio network planning is a very complex task, as many\naspects must be taken into account. With the rapid development in mobile\nnetwork we need effective network planning tool to satisfy the need of\ncustomers. However, deciding upon the optimum placement for the base stations\n(BS s) to achieve best services while reducing the cost is a complex task\nrequiring vast computational resource. This paper introduces the spatial\nclustering to solve the Mobile Networking Planning problem. It addresses\nantenna placement problem or the cell planning problem, involves locating and\nconfiguring infrastructure for mobile networks by modified the original\nPartitioning Around Medoids PAM algorithm. M-PAM (Modified Partitioning Around\nMedoids) has been proposed to satisfy the requirements and constraints. PAM\nneeds to specify number of clusters (k) before starting to search for the best\nlocations of base stations. The M-PAM algorithm uses the radio network planning\nto determine k. We calculate for each cluster its coverage and capacity and\ndetermine if they satisfy the mobile requirements, if not we will increase (k)\nand reapply algorithms depending on two methods for clustering. Implementation\nof this algorithm to a real case study is presented. Experimental results and\nanalysis indicate that the M-PAM algorithm when applying method two is\neffective in case of heavy load distribution, and leads to minimum number of\nbase stations, which directly affected onto the cost of planning the network.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2013 21:12:30 GMT"}], "update_date": "2013-02-28", "authors_parsed": [["Ibrahim", "Lamiaa Fattouh", ""], ["Harbi", "Manal Hamed Al", ""]]}, {"id": "1302.6646", "submitter": "Zhiqing Wei", "authors": "Zhiqing Wei, Qixun Zhang, Zhiyong Feng, Wei Li, and T. Aaron Gulliver", "title": "On the Construction of Radio Environment Maps for Cognitive Radio\n  Networks", "comments": "6 pages, 7 figures, IEEE WCNC conference", "journal-ref": null, "doi": "10.1109/WCNC.2013.6555304", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Radio Environment Map (REM) provides an effective approach to Dynamic\nSpectrum Access (DSA) in Cognitive Radio Networks (CRNs). Previous results on\nREM construction show that there exists a tradeoff between the number of\nmeasurements (sensors) and REM accuracy. In this paper, we analyze this\ntradeoff and determine that the REM error is a decreasing and convex function\nof the number of measurements (sensors). The concept of geographic entropy is\nintroduced to quantify this relationship. And the influence of sensor\ndeployment on REM accuracy is examined using information theory techniques. The\nresults obtained in this paper are applicable not only for the REM, but also\nfor wireless sensor network deployment.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2013 02:14:58 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Wei", "Zhiqing", ""], ["Zhang", "Qixun", ""], ["Feng", "Zhiyong", ""], ["Li", "Wei", ""], ["Gulliver", "T. Aaron", ""]]}, {"id": "1302.6974", "submitter": "M. Sadegh Talebi", "authors": "Marc Lelarge and Alexandre Proutiere and M. Sadegh Talebi", "title": "Spectrum Bandit Optimization", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of allocating radio channels to links in a wireless\nnetwork. Links interact through interference, modelled as a conflict graph\n(i.e., two interfering links cannot be simultaneously active on the same\nchannel). We aim at identifying the channel allocation maximizing the total\nnetwork throughput over a finite time horizon. Should we know the average radio\nconditions on each channel and on each link, an optimal allocation would be\nobtained by solving an Integer Linear Program (ILP). When radio conditions are\nunknown a priori, we look for a sequential channel allocation policy that\nconverges to the optimal allocation while minimizing on the way the throughput\nloss or {\\it regret} due to the need for exploring sub-optimal allocations. We\nformulate this problem as a generic linear bandit problem, and analyze it first\nin a stochastic setting where radio conditions are driven by a stationary\nstochastic process, and then in an adversarial setting where radio conditions\ncan evolve arbitrarily. We provide new algorithms in both settings and derive\nupper bounds on their regrets.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2013 20:01:24 GMT"}, {"version": "v2", "created": "Thu, 2 May 2013 09:47:33 GMT"}, {"version": "v3", "created": "Wed, 24 Jul 2013 16:08:13 GMT"}, {"version": "v4", "created": "Tue, 17 Feb 2015 11:30:13 GMT"}], "update_date": "2015-02-18", "authors_parsed": [["Lelarge", "Marc", ""], ["Proutiere", "Alexandre", ""], ["Talebi", "M. Sadegh", ""]]}, {"id": "1302.7028", "submitter": "Alexandre Fr\\'echette", "authors": "Alexandre Fr\\'echette, F. Bruce Shepherd, Marina K. Thottan, Peter J.\n  Winzer", "title": "Shortest Path versus Multi-Hub Routing in Networks with Uncertain Demand", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a class of robust network design problems motivated by the need to\nscale core networks to meet increasingly dynamic capacity demands. Past work\nhas focused on designing the network to support all hose matrices (all matrices\nnot exceeding marginal bounds at the nodes). This model may be too conservative\nif additional information on traffic patterns is available. Another extreme is\nthe fixed demand model, where one designs the network to support peak\npoint-to-point demands. We introduce a capped hose model to explore a broader\nrange of traffic matrices which includes the above two as special cases. It is\nknown that optimal designs for the hose model are always determined by\nsingle-hub routing, and for the fixed- demand model are based on shortest-path\nrouting. We shed light on the wider space of capped hose matrices in order to\nsee which traffic models are more shortest path-like as opposed to hub-like. To\naddress the space in between, we use hierarchical multi-hub routing templates,\na generalization of hub and tree routing. In particular, we show that by adding\npeak capacities into the hose model, the single-hub tree-routing template is no\nlonger cost-effective. This initiates the study of a class of robust network\ndesign (RND) problems restricted to these templates. Our empirical analysis is\nbased on a heuristic for this new hierarchical RND problem. We also propose\nthat it is possible to define a routing indicator that accounts for the\nstrengths of the marginals and peak demands and use this information to choose\nthe appropriate routing template. We benchmark our approach against other\nwell-known routing templates, using representative carrier networks and a\nvariety of different capped hose traffic demands, parameterized by the relative\nimportance of their marginals as opposed to their point-to-point peak demands.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2013 23:25:36 GMT"}], "update_date": "2013-03-01", "authors_parsed": [["Fréchette", "Alexandre", ""], ["Shepherd", "F. Bruce", ""], ["Thottan", "Marina K.", ""], ["Winzer", "Peter J.", ""]]}, {"id": "1302.7046", "submitter": "Kemal Davaslioglu Kemal Davaslioglu", "authors": "Kemal Davaslioglu and Ender Ayanoglu", "title": "Common Rate Maximization in Two-Layer Cellular Radio Systems", "comments": "6 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the common rate maximization problem in two-layer cellular\nnetworks where high-power and low-power base stations are colocated in the same\ngeographical area. Interference becomes a serious problem when two or more\nlayers are considered in the same network. For this purpose, power control in\nthe downlink needs to be used to limit the interference and to fully exploit\nthe benefits of additional layer deployments.We present an analytical framework\nto the common rate maximization problem both with and without maximum power\nconstraints and propose a heuristic algorithm. We present simulation results\nfor the proposed approaches in a two-layer network setup and observe a\nsignificant common rate increase compared to single-layer wireless networks.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2013 00:52:36 GMT"}], "update_date": "2013-03-01", "authors_parsed": [["Davaslioglu", "Kemal", ""], ["Ayanoglu", "Ender", ""]]}, {"id": "1302.7048", "submitter": "Kemal Davaslioglu Kemal Davaslioglu", "authors": "Kemal Davaslioglu and Ender Ayanoglu", "title": "Interference-Based Cell Selection in Heterogenous Networks", "comments": null, "journal-ref": null, "doi": "10.1109/ITA.2013.6502931", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heterogeneous cellular networks provide significant improvements in terms of\nincreased data rates and cell coverage, and offer reduced user rate starvation.\nHowever, there are important problems to be solved. In this paper, we identify\nthat the cell selection criterion is an important factor determining the user\nrates especially in the uplink transmissions and apply cell breathing to\ndetermine the user and base station assignments. We observe that the proposed\ninterference-based cell selection algorithm provides better load balancing\namong the base stations in the system to improve the uplink user rates. We\npresent the implementation steps in a typical LTE network and demonstrate the\nperformance improvements through simulations.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2013 01:00:50 GMT"}], "update_date": "2013-05-14", "authors_parsed": [["Davaslioglu", "Kemal", ""], ["Ayanoglu", "Ender", ""]]}, {"id": "1302.7289", "submitter": "Feng Yan", "authors": "Feng Yan and Anais Vergne and Philippe Martins and Laurent\n  Decreusefond", "title": "Homology-based Distributed Coverage Hole Detection in Wireless Sensor\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Homology theory provides new and powerful solutions to address the coverage\nproblems in wireless sensor networks (WSNs). They are based on algebraic\nobjects, such as Cech complex and Rips complex. Cech complex gives accurate\ninformation about coverage quality but requires a precise knowledge of the\nrelative locations of nodes. This assumption is rather strong and hard to\nimplement in practical deployments. Rips complex provides an approximation of\nCech complex. It is easier to build and does not require any knowledge of nodes\nlocation. This simplicity is at the expense of accuracy. Rips complex can not\nalways detect all coverage holes. It is then necessary to evaluate its\naccuracy. This work proposes to use the proportion of the area of undiscovered\ncoverage holes as performance criteria. Investigations show that it depends on\nthe ratio between communication and sensing radii of a sensor. Closed-form\nexpressions for lower and upper bounds of the accuracy are also derived. For\nthose coverage holes which can be discovered by Rips complex, a homology-based\ndistributed algorithm is proposed to detect them. Simulation results are\nconsistent with the proposed analytical lower bound, with a maximum difference\nof 0.5%. Upper bound performance depends on the ratio of communication and\nsensing radii. Simulations also show that the algorithm can localize about 99%\ncoverage holes in about 99% cases.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2013 19:17:33 GMT"}, {"version": "v2", "created": "Thu, 10 Jul 2014 07:52:04 GMT"}], "update_date": "2014-07-11", "authors_parsed": [["Yan", "Feng", ""], ["Vergne", "Anais", ""], ["Martins", "Philippe", ""], ["Decreusefond", "Laurent", ""]]}]