[{"id": "1607.00096", "submitter": "Ralph Holz", "authors": "Johann Schlamp, Ralph Holz, Quentin Jacquemart, Georg Carle, Ernst W.\n  Biersack", "title": "HEAP: Reliable Assessment of BGP Hijacking Attacks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The detection of BGP prefix hijacking attacks has been the focus of research\nfor more than a decade. However, state-of-the-art techniques fall short of\ndetecting more elaborate types of attack. To study such attacks, we devise a\nnovel formalization of Internet routing, and apply this model to routing\nanomalies in order to establish a comprehensive attacker model. We use this\nmodel to precisely classify attacks and to evaluate their impact and\ndetectability. We analyze the eligibility of attack tactics that suit an\nattacker's goals and demonstrate that related work mostly focuses on less\nimpactful kinds of attacks.\n  We further propose, implement and test the Hijacking Event Analysis Program\n(HEAP), a new approach to investigate hijacking alarms. Our approachis designed\nto seamlessly integrate with previous work in order to reduce the high rates of\nfalse alarms inherent to these techniques. We leverage several unique data\nsources that can reliably disprove malicious intent. First, we make use of an\nInternet Routing Registry to derive business or organisational relationships\nbetween the parties involved in an event. Second, we use a topology-based\nreasoning algorithm to rule out events caused by legitimate operational\npractice. Finally, we use Internet-wide network scans to identify\nSSL/TLS-enabled hosts, which helps to identify non-malicious events by\ncomparing public keys prior to and during an event. In our evaluation, we prove\nthe effectiveness of our approach, and show that day-to-day routing anomalies\nare harmless for the most part. More importantly, we use HEAP to assess the\nvalidity of publicly reported alarms. We invite researchers to interface with\nHEAP in order to cross-check and narrow down their hijacking alerts.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2016 02:05:15 GMT"}], "update_date": "2016-07-04", "authors_parsed": [["Schlamp", "Johann", ""], ["Holz", "Ralph", ""], ["Jacquemart", "Quentin", ""], ["Carle", "Georg", ""], ["Biersack", "Ernst W.", ""]]}, {"id": "1607.00117", "submitter": "Gianluca Stringhini", "authors": "Andreas Haslebacher, Jeremiah Onaolapo, Gianluca Stringhini", "title": "All Your Cards Are Belong To Us: Understanding Online Carding Forums", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Underground online forums are platforms that enable trades of illicit\nservices and stolen goods. Carding forums, in particular, are known for being\nfocused on trading financial information. However, little evidence exists about\nthe sellers that are present on carding forums, the precise types of products\nthey advertise, and the prices buyers pay. Existing literature mainly focuses\non the organisation and structure of the forums. Furthermore, studies on\ncarding forums are usually based on literature review, expert interviews, or\ndata from forums that have already been shut down. This paper provides\nfirst-of-its-kind empirical evidence on active forums where stolen financial\ndata is traded. We monitored 5 out of 25 discovered forums, collected posts\nfrom the forums over a three-month period, and analysed them quantitatively and\nqualitatively. We focused our analyses on products, prices, seller prolificacy,\nseller specialisation, and seller reputation.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2016 06:18:05 GMT"}, {"version": "v2", "created": "Tue, 24 Jan 2017 12:25:13 GMT"}], "update_date": "2017-01-25", "authors_parsed": [["Haslebacher", "Andreas", ""], ["Onaolapo", "Jeremiah", ""], ["Stringhini", "Gianluca", ""]]}, {"id": "1607.00133", "submitter": "Ilya Mironov", "authors": "Mart\\'in Abadi and Andy Chu and Ian Goodfellow and H. Brendan McMahan\n  and Ilya Mironov and Kunal Talwar and Li Zhang", "title": "Deep Learning with Differential Privacy", "comments": null, "journal-ref": "Proceedings of the 2016 ACM SIGSAC Conference on Computer and\n  Communications Security (ACM CCS), pp. 308-318, 2016", "doi": "10.1145/2976749.2978318", "report-no": null, "categories": "stat.ML cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning techniques based on neural networks are achieving remarkable\nresults in a wide variety of domains. Often, the training of models requires\nlarge, representative datasets, which may be crowdsourced and contain sensitive\ninformation. The models should not expose private information in these\ndatasets. Addressing this goal, we develop new algorithmic techniques for\nlearning and a refined analysis of privacy costs within the framework of\ndifferential privacy. Our implementation and experiments demonstrate that we\ncan train deep neural networks with non-convex objectives, under a modest\nprivacy budget, and at a manageable cost in software complexity, training\nefficiency, and model quality.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2016 07:29:10 GMT"}, {"version": "v2", "created": "Mon, 24 Oct 2016 11:59:40 GMT"}], "update_date": "2018-12-21", "authors_parsed": [["Abadi", "Martín", ""], ["Chu", "Andy", ""], ["Goodfellow", "Ian", ""], ["McMahan", "H. Brendan", ""], ["Mironov", "Ilya", ""], ["Talwar", "Kunal", ""], ["Zhang", "Li", ""]]}, {"id": "1607.00174", "submitter": "Michele Amoretti", "authors": "Giacomo Brambilla, Michele Amoretti, Francesco Medioli, Francesco\n  Zanichelli", "title": "Blockchain-based Proof of Location", "comments": "13 pages, 9 figures", "journal-ref": "2018 IEEE International Conference on Software Quality,\n  Reliability and Security Companion (QRS-C)", "doi": "10.1109/QRS-C.2018.00038", "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Location-Based Services (LBSs) build upon geographic information to provide\nusers with location-dependent functionalities. In such a context, it is\nparticularly important that geographic locations claimed by users are\ntrustworthy. Centralized verification approaches proposed in the last few years\nare not satisfactory, as they entail a high risk to the privacy of users. In\nthis paper, we present and evaluate a novel decentralized,\ninfrastructure-independent proof-of-location scheme based on blockchain\ntechnology. Our scheme guarantees both location trustworthiness and user\nprivacy preservation.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2016 09:35:28 GMT"}, {"version": "v2", "created": "Mon, 31 Jul 2017 16:25:44 GMT"}, {"version": "v3", "created": "Mon, 24 Feb 2020 14:16:19 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Brambilla", "Giacomo", ""], ["Amoretti", "Michele", ""], ["Medioli", "Francesco", ""], ["Zanichelli", "Francesco", ""]]}, {"id": "1607.00269", "submitter": "Zheng Wang", "authors": "Zheng Wang", "title": "Does Your DNS Recursion Really Time Out as Intended? A Timeout\n  Vulnerability of DNS Recursive Servers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Parallelization is featured by DNS recursive servers to do time-consuming\nrecursions on behalf on clients. As common DNS configurations, recursive\nservers should allow a reasonable timeout for each recursion which may take as\nlong as several seconds. However, it is proposed in this paper that recursion\nparallelization may be exploited by attackers to compromise the recursion\ntimeout mechanism for the purpose of DoS or DDoS attacks. Attackers can have\nrecursive servers drop early existing recursions in service by saturating\nrecursion parallelization. The key of the proposed attack model is to reliably\nprolong service times for any attacking queries. As means of prolong service\ntimes, serval techniques are proposed to effectively avoiding cache hit and\nprolonging overall latency of external DNS lookups respectively. The impacts of\nsaturated recursion parallelization on timeout are analytically provided. The\ntesting on BIND servers demonstrates that with carefully crafted queries, an\nattacker can use a low or moderate level of query load to successfully\noverwhelm a target recursive server from serving the legitimate clients.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jun 2016 18:36:22 GMT"}, {"version": "v2", "created": "Tue, 14 Feb 2017 02:54:21 GMT"}], "update_date": "2017-02-15", "authors_parsed": [["Wang", "Zheng", ""]]}, {"id": "1607.00307", "submitter": "K\\'evin Atighehchi", "authors": "Kevin Atighehchi", "title": "Optimal Tree Hash Modes: the Case of Trees Having their Leaves at All\n  the Levels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A recent work shows how we can optimize a tree based mode of operation for a\nhash function where the sizes of input message blocks and digest are the same,\nsubject to the constraint that the involved tree structure has all its leaves\nat the same depth. In this work, we show that we can further optimize the\nrunning time of such a mode by using a tree having leaves at all its levels. We\nmake the assumption that the input message block has a size a multiple of that\nof the digest and denote by $d$ the ratio block size over digest size. The\nrunning time is evaluated in terms of number of operations performed by the\nhash function, i.e. the number of calls to its underlying function. It turns\nout that a digest can be computed in $\\lceil \\log_{d+1} (l/2) \\rceil+2$\nevaluations of the underlying function using $\\lceil l/2 \\rceil$ processors,\nwhere $l$ is the number of blocks of the message. Other results of interest are\ndiscussed, such as the optimization of the parallel running time for a tree of\nrestricted height.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2016 16:34:02 GMT"}, {"version": "v10", "created": "Tue, 27 Jun 2017 12:35:41 GMT"}, {"version": "v2", "created": "Mon, 4 Jul 2016 18:07:26 GMT"}, {"version": "v3", "created": "Wed, 20 Jul 2016 15:57:27 GMT"}, {"version": "v4", "created": "Sat, 23 Jul 2016 17:55:27 GMT"}, {"version": "v5", "created": "Thu, 4 Aug 2016 13:59:02 GMT"}, {"version": "v6", "created": "Wed, 21 Sep 2016 17:10:50 GMT"}, {"version": "v7", "created": "Fri, 30 Sep 2016 13:27:23 GMT"}, {"version": "v8", "created": "Sun, 16 Oct 2016 16:21:33 GMT"}, {"version": "v9", "created": "Sat, 22 Apr 2017 12:46:23 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Atighehchi", "Kevin", ""]]}, {"id": "1607.00468", "submitter": "Mikio Fujiwara", "authors": "Mikio Fujiwara, Atsushi Waseda, Ryo Nojima, Shiho Moriai, Wakaha\n  Ogata, and Masahide Sasaki", "title": "Unbreakable distributed storage with quantum key distribution network\n  and password-authenticated secret sharing", "comments": "16 pages, 3 figures, and supplementary information, Scientific\n  Reports srep28988 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed storage plays an essential role in realizing robust and secure\ndata storage in a network over long periods of time. A distributed storage\nsystem consists of a data owner machine, multiple storage servers and channels\nto link them. In such a system, secret sharing scheme is widely adopted, in\nwhich secret data are split into multiple pieces and stored in each server. To\nreconstruct them, the data owner should gather plural pieces. Shamir's (k,\nn)-threshold scheme, in which the data are split into n pieces (shares) for\nstorage and at least k pieces of them must be gathered for reconstruction,\nfurnishes information theoretic security, that is, even if attackers could\ncollect shares of less than the threshold k, they cannot get any information\nabout the data, even with unlimited computing power. Behind this scenario,\nhowever, assumed is that data transmission and authentication must be perfectly\nsecure, which is not trivial in practice. Here we propose a totally information\ntheoretically secure distributed storage system based on a user-friendly\nsingle-password-authenticated secret sharing scheme and secure transmission\nusing quantum key distribution, and demonstrate it in the Tokyo metropolitan\narea.\n", "versions": [{"version": "v1", "created": "Sat, 2 Jul 2016 05:14:40 GMT"}], "update_date": "2016-07-05", "authors_parsed": [["Fujiwara", "Mikio", ""], ["Waseda", "Atsushi", ""], ["Nojima", "Ryo", ""], ["Moriai", "Shiho", ""], ["Ogata", "Wakaha", ""], ["Sasaki", "Masahide", ""]]}, {"id": "1607.00497", "submitter": "Wonsuk Choi", "authors": "Wonsuk Choi, Hyo Jin Jo, Samuel Woo, Ji Young Chun, Jooyoung Park, and\n  Dong Hoon Lee", "title": "Identifying ECUs Using Inimitable Characteristics of Signals in\n  Controller Area Networks", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last several decades, the automotive industry has come to incorporate\nthe latest Information and Communications (ICT) technology, increasingly\nreplacing mechanical components of vehicles with electronic components. These\nelectronic control units (ECUs) communicate with each other in an in-vehicle\nnetwork that makes the vehicle both safer and easier to drive. Controller Area\nNetworks (CANs) are the current standard for such high quality in-vehicle\ncommunication. Unfortunately, however, CANs do not currently offer protection\nagainst security attacks. In particular, they do not allow for message\nauthentication and hence are open to attacks that replay ECU messages for\nmalicious purposes. Applying the classic cryptographic method of message\nauthentication code (MAC) is not feasible since the CAN data frame is not long\nenough to include a sufficiently long MAC to provide effective authentication.\nIn this paper, we propose a novel identification method, which works in the\nphysical layer of an in-vehicle CAN network. Our method identifies ECUs using\ninimitable characteristics of signals enabling detection of a compromised or\nalien ECU being used in a replay attack. Unlike previous attempts to address\nsecurity issues in the in-vehicle CAN network, our method works by simply\nadding a monitoring unit to the existing network, making it deployable in\ncurrent systems and compliant with required CAN standards. Our experimental\nresults show that the bit string and classification algorithm that we utilized\nyielded more accurate identification of compromised ECUs than any other method\nproposed to date. The false positive rate is more than 2 times lower than the\nmethod proposed by P.-S. Murvay et al. This paper is also the first to identify\npotential attack models that systems should be able to detect.\n", "versions": [{"version": "v1", "created": "Sat, 2 Jul 2016 12:13:49 GMT"}], "update_date": "2016-07-05", "authors_parsed": [["Choi", "Wonsuk", ""], ["Jo", "Hyo Jin", ""], ["Woo", "Samuel", ""], ["Chun", "Ji Young", ""], ["Park", "Jooyoung", ""], ["Lee", "Dong Hoon", ""]]}, {"id": "1607.00729", "submitter": "Mohammed Shafiul Alam Khan", "authors": "Mohammed Shafiul Alam Khan, Chris J Mitchell", "title": "Retrofitting mutual authentication to GSM using RAND hijacking", "comments": "17 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As has been widely discussed, the GSM mobile telephony system only offers\nunilateral authentication of the mobile phone to the network; this limitation\npermits a range of attacks. While adding support for mutual authentication\nwould be highly beneficial, changing the way GSM serving networks operate is\nnot practical. This paper proposes a novel modification to the relationship\nbetween a Subscriber Identity Module (SIM) and its home network which allows\nmutual authentication without changing any of the existing mobile\ninfrastructure, including the phones; the only necessary changes are to the\nauthentication centres and the SIMs. This enhancement, which could be deployed\npiecemeal in a completely transparent way, not only addresses a number of\nserious vulnerabilities in GSM but is also the first proposal for enhancing GSM\nauthentication that possesses such transparency properties.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jul 2016 03:19:40 GMT"}, {"version": "v2", "created": "Tue, 5 Jul 2016 00:40:28 GMT"}], "update_date": "2016-07-06", "authors_parsed": [["Khan", "Mohammed Shafiul Alam", ""], ["Mitchell", "Chris J", ""]]}, {"id": "1607.00782", "submitter": "David Sanchez", "authors": "Malik Imran-Daud, David S\\'anchez and Alexandre Viejo", "title": "Privacy-driven Access Control in Social Networks by Means of Automatic\n  Semantic Annotation", "comments": null, "journal-ref": "Computer Communications 76: 12-25 (2016)", "doi": "10.1016/j.comcom.2016.01.001", "report-no": null, "categories": "cs.SI cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In online social networks (OSN), users quite usually disclose sensitive\ninformation about themselves by publishing messages. At the same time, they are\n(in many cases) unable to properly manage the access to this sensitive\ninformation due to the following issues: i) the rigidness of the access control\nmechanism implemented by the OSN, and ii) many users lack of technical\nknowledge about data privacy and access control. To tackle these limitations,\nin this paper, we propose a dynamic, transparent and privacy-driven access\ncontrol mechanism for textual messages published in OSNs. The notion of\nprivacy-driven is achieved by analyzing the semantics of the messages to be\npublished and, according to that, assessing the degree of sensitiveness of\ntheir contents. For this purpose, the proposed system relies on an automatic\nsemantic annotation mechanism that, by using knowledge bases and linguistic\ntools, is able to associate a meaning to the information to be published. By\nmeans of this annotation, our mechanism automatically detects the information\nthat is sensitive according to the privacy requirements of the publisher of\ndata, with regard to the type of reader that may access such data. Finally, our\naccess control mechanism automatically creates sanitized versions of the users'\npublications according to the type of reader that accesses them. As a result,\nour proposal, which can be integrated in already existing social networks,\nprovides an automatic, seamless and content-driven protection of user\npublications, which are coherent with her privacy requirements and the type of\nreaders that access them. Complementary to the system design, we also discuss\nthe feasibility of the system by illustrating it through a real example and\nevaluate its accuracy and effectiveness over standard approaches.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jul 2016 09:09:07 GMT"}], "update_date": "2016-07-05", "authors_parsed": [["Imran-Daud", "Malik", ""], ["Sánchez", "David", ""], ["Viejo", "Alexandre", ""]]}, {"id": "1607.00801", "submitter": "Gianluca Stringhini", "authors": "Martin Lazarov, Jeremiah Onaolapo, and Gianluca Stringhini", "title": "Honey Sheets: What Happens to Leaked Google Spreadsheets?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud-based documents are inherently valuable, due to the volume and nature\nof sensitive personal and business content stored in them. Despite the\nimportance of such documents to Internet users, there are still large gaps in\nthe understanding of what cybercriminals do when they illicitly get access to\nthem by for example compromising the account credentials they are associated\nwith. In this paper, we present a system able to monitor user activity on\nGoogle spreadsheets. We populated 5 Google spreadsheets with fake bank account\ndetails and fake funds transfer links. Each spreadsheet was configured to\nreport details of accesses and clicks on links back to us. To study how people\ninteract with these spreadsheets in case they are leaked, we posted unique\nlinks pointing to the spreadsheets on a popular paste site. We then monitored\nactivity in the accounts for 72 days, and observed 165 accesses in total. We\nwere able to observe interesting modifications to these spreadsheets performed\nby illicit accesses. For instance, we observed deletion of some fake bank\naccount information, in addition to insults and warnings that some visitors\nentered in some of the spreadsheets. Our preliminary results show that our\nsystem can be used to shed light on cybercriminal behavior with regards to\nleaked online documents.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jul 2016 09:46:18 GMT"}], "update_date": "2016-07-05", "authors_parsed": [["Lazarov", "Martin", ""], ["Onaolapo", "Jeremiah", ""], ["Stringhini", "Gianluca", ""]]}, {"id": "1607.00827", "submitter": "Stavros Nikolopoulos D.", "authors": "Stavros D. Nikolopoulos and Iosif Polenakis", "title": "Preventing Malware Pandemics in Mobile Devices by Establishing\n  Response-time Bounds", "comments": "13 pages, 33 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the propagation of a malicious software in a network of mobile\ndevices, which are moving in a specific city area, and establish time bounds\nfor the activation of a counter-measure, i.e., an antivirus or a cleaner in\norder to prevent pandemic. More precisely, given an initial infected population\n(mobile devices), we establish upper bounds on the time needed for a\ncounter-measure to take effect after infection (response-time), in order to\nprevent the rest susceptible devices to get infected. Thus, within a period of\ntime, we guarantee that not all the susceptible devices in the city get\ninfected and the infected ones get sanitized. In our work, we first propose a\nmalware propagation model along with a device mobility model and then,\nutilizing these models, we develop a simulator that we use to study the spread\nof malware in such networks. Finally, we provide experimental results for the\npandemic prevention taken by our simulator for various response-time intervals.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jul 2016 11:33:41 GMT"}], "update_date": "2016-07-05", "authors_parsed": [["Nikolopoulos", "Stavros D.", ""], ["Polenakis", "Iosif", ""]]}, {"id": "1607.00888", "submitter": "Alexander Semenov", "authors": "Ilya Otpuschennikov, Alexander Semenov, Irina Gribanova, Oleg Zaikin,\n  Stepan Kochemazov", "title": "Encoding Cryptographic Functions to SAT Using Transalg System", "comments": "Short variant of this paper was accepted to ECAI2016 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose the technology for constructing propositional\nencodings of discrete functions. It is aimed at solving inversion problems of\nconsidered functions using state-of-the-art SAT solvers. We implemented this\ntechnology in the form of the software system called Transalg, and used it to\nconstruct SAT encodings for a number of cryptanalysis problems. By applying SAT\nsolvers to these encodings we managed to invert several cryptographic\nfunctions. In particular, we used the SAT encodings produced by Transalg to\nconstruct the family of two-block MD5 collisions in which the first 10 bytes\nare zeros. Also we used Transalg encoding for the widely known A5/1 keystream\ngenerator to solve several dozen of its cryptanalysis instances in a\ndistributed computing environment. In the paper we compare in detail the\nfunctionality of Transalg with that of similar software systems.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jul 2016 13:57:35 GMT"}], "update_date": "2016-07-05", "authors_parsed": [["Otpuschennikov", "Ilya", ""], ["Semenov", "Alexander", ""], ["Gribanova", "Irina", ""], ["Zaikin", "Oleg", ""], ["Kochemazov", "Stepan", ""]]}, {"id": "1607.01341", "submitter": "Silvio Micali", "authors": "Jing Chen, Silvio Micali", "title": "Algorand", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A public ledger is a tamperproof sequence of data that can be read and\naugmented by everyone. Public ledgers have innumerable and compelling uses.\nThey can secure, in plain sight, all kinds of transactions ---such as titles,\nsales, and payments--- in the exact order in which they occur. Public ledgers\nnot only curb corruption, but also enable very sophisticated applications\n---such as cryptocurrencies and smart contracts. They stand to revolutionize\nthe way a democratic society operates. As currently implemented, however, they\nscale poorly and cannot achieve their potential.\n  Algorand is a truly democratic and efficient way to implement a public\nledger. Unlike prior implementations based on proof of work, it requires a\nnegligible amount of computation, and generates a transaction history that will\nnot \"fork\" with overwhelmingly high probability.\n  Algorand is based on (a novel and super fast) message-passing Byzantine\nagreement.\n  For concreteness, we shall describe Algorand only as a money platform.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2016 17:35:20 GMT"}, {"version": "v2", "created": "Fri, 15 Jul 2016 19:07:36 GMT"}, {"version": "v3", "created": "Mon, 1 Aug 2016 19:29:24 GMT"}, {"version": "v4", "created": "Wed, 24 Aug 2016 12:24:27 GMT"}, {"version": "v5", "created": "Mon, 3 Oct 2016 19:06:07 GMT"}, {"version": "v6", "created": "Fri, 11 Nov 2016 19:43:17 GMT"}, {"version": "v7", "created": "Wed, 16 Nov 2016 21:56:20 GMT"}, {"version": "v8", "created": "Tue, 23 May 2017 16:25:10 GMT"}, {"version": "v9", "created": "Fri, 26 May 2017 13:16:11 GMT"}], "update_date": "2017-05-29", "authors_parsed": [["Chen", "Jing", ""], ["Micali", "Silvio", ""]]}, {"id": "1607.01383", "submitter": "Karim Banawan", "authors": "Karim Banawan, Sennur Ulukus", "title": "MIMO Wiretap Channel under Receiver Side Power Constraints with\n  Applications to Wireless Power Transfer and Cognitive Radio", "comments": "Submitted to IEEE Transactions on Communications, September 2015.\n  Accepted for publication, July 2016", "journal-ref": null, "doi": "10.1109/TCOMM.2016.2593739", "report-no": null, "categories": "cs.IT cs.CR cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the multiple-input multiple-output (MIMO) wiretap channel under a\nminimum receiver-side power constraint in addition to the usual maximum\ntransmitter-side power constraint. This problem is motivated by energy\nharvesting communications with wireless energy transfer, where an added goal is\nto deliver a minimum amount of energy to a receiver in addition to delivering\nsecure data to another receiver. In this paper, we characterize the exact\nsecrecy capacity of the MIMO wiretap channel under transmitter and\nreceiver-side power constraints. We first show that solving this problem is\nequivalent to solving the secrecy capacity of the wiretap channel under a\ndouble-sided correlation matrix constraint on the channel input. We show the\nconverse by extending the channel enhancement technique to our case. We present\ntwo achievable schemes that achieve the secrecy capacity: the first achievable\nscheme uses a Gaussian codebook with a fixed mean, and the second achievable\nscheme uses artificial noise (or cooperative jamming) together with a Gaussian\ncodebook. The role of the mean or the artificial noise is to enable energy\ntransfer without sacrificing from the secure rate. This is the first instance\nof a channel model where either the use of a mean signal or the use of channel\nprefixing via artificial noise is strictly necessary for the MIMO wiretap\nchannel. We then extend our work to consider a maximum receiver-side power\nconstraint. This problem is motivated by cognitive radio applications, where an\nadded goal is to decrease the received signal energy (interference temperature)\nat a receiver. We further extend our results to: requiring receiver-side power\nconstraints at both receivers; considering secrecy constraints at both\nreceivers to study broadcast channels with confidential messages; and removing\nthe secrecy constraints to study the classical broadcast channel.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2016 19:49:39 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Banawan", "Karim", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1607.01471", "submitter": "Gaopeng Jian", "authors": "Gaopeng Jian, Rongquan Feng", "title": "Cryptanalysis and Improvement of an Improved Two Factor Authentication\n  Scheme for Telecare Medicine Information Systems", "comments": "After checking the manuscript again a crucial error was founded in\n  the section \" Security weaknesses of Amin et al.'s scheme\". In fact Amin et\n  al.'s scheme resists offline password guessing attacks but the manuscript\n  claims that it doesn't", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Telecare medical information systems (TMIS) aim to provide healthcare\nservices remotely. Efficient and secure mechanism for authentication and key\nagreement is required in order to guarantee the security and privacy of\npatients in TMIS.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2016 03:22:25 GMT"}, {"version": "v2", "created": "Fri, 30 Dec 2016 05:32:00 GMT"}], "update_date": "2017-01-02", "authors_parsed": [["Jian", "Gaopeng", ""], ["Feng", "Rongquan", ""]]}, {"id": "1607.01639", "submitter": "Blake Anderson", "authors": "Blake Anderson, Subharthi Paul, David McGrew", "title": "Deciphering Malware's use of TLS (without Decryption)", "comments": "15 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of TLS by malware poses new challenges to network threat detection\nbecause traditional pattern-matching techniques can no longer be applied to its\nmessages. However, TLS also introduces a complex set of observable data\nfeatures that allow many inferences to be made about both the client and the\nserver. We show that these features can be used to detect and understand\nmalware communication, while at the same time preserving the privacy of benign\nuses of encryption. These data features also allow for accurate malware family\nattribution of network communication, even when restricted to a single,\nencrypted flow.\n  To demonstrate this, we performed a detailed study of how TLS is used by\nmalware and enterprise applications. We provide a general analysis on millions\nof TLS encrypted flows, and a targeted study on 18 malware families composed of\nthousands of unique malware samples and ten-of-thousands of malicious TLS\nflows. Importantly, we identify and accommodate the bias introduced by the use\nof a malware sandbox. The performance of a malware classifier is correlated\nwith a malware family's use of TLS, i.e., malware families that actively evolve\ntheir use of cryptography are more difficult to classify.\n  We conclude that malware's usage of TLS is distinct from benign usage in an\nenterprise setting, and that these differences can be effectively used in rules\nand machine learning classifiers.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2016 14:38:08 GMT"}], "update_date": "2016-07-07", "authors_parsed": [["Anderson", "Blake", ""], ["Paul", "Subharthi", ""], ["McGrew", "David", ""]]}, {"id": "1607.01642", "submitter": "Chengqing Li", "authors": "Chengqing Li, Dongdong Lin, Jinhu L\\\"u", "title": "Cryptanalyzing an Image-Scrambling Encryption Algorithm of Pixel Bits", "comments": "7 pages", "journal-ref": "IEEE MultiMedia, vol. 24, no. 3, pp. 64-71, 2017", "doi": "10.1109/MMUL.2017.3051512", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Position scrambling (permutation) is widely used in multimedia encryption\nschemes and some international encryption standards, such as the Data\nEncryption Standard and the Advanced Encryption Standard. In this article, the\nauthors re-evaluate the security of a typical image-scrambling encryption\nalgorithm (ISEA). Using the internal correlation remaining in the cipher image,\nthey disclose important visual information of the corresponding plain image in\na ciphertext-only attack scenario. Furthermore, they found that the real\nscrambling domain--the position-scrambling scope of ISEA's scrambled\nelements--can be used to support an efficient known or chosen-plaintext attack\non it. Detailed experimental results have verified these points and demonstrate\nthat some advanced multimedia processing techniques can facilitate the\ncryptanalysis of multimedia encryption algorithms.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2016 14:39:45 GMT"}, {"version": "v2", "created": "Sun, 6 Aug 2017 06:23:57 GMT"}], "update_date": "2017-08-08", "authors_parsed": [["Li", "Chengqing", ""], ["Lin", "Dongdong", ""], ["Lü", "Jinhu", ""]]}, {"id": "1607.01797", "submitter": "Rotem Arnon-Friedman", "authors": "Rotem Arnon-Friedman, Renato Renner, and Thomas Vidick", "title": "Simple and tight device-independent security proofs", "comments": "Published version", "journal-ref": "SIAM Journal on Computing 48.1 (2019): 181-225", "doi": "10.1137/18M1174726", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Device-independent security is the gold standard for quantum cryptography:\nnot only is security based entirely on the laws of quantum mechanics, but it\nholds irrespective of any a priori assumptions on the quantum devices used in a\nprotocol, making it particularly applicable in a quantum-wary environment.\nWhile the existence of device-independent protocols for tasks such as\nrandomness expansion and quantum key distribution has recently been\nestablished, the underlying proofs of security remain very challenging, yield\nrather poor key rates, and demand very high-quality quantum devices, thus\nmaking them all but impossible to implement in practice.\n  We introduce a technique for the analysis of device-independent cryptographic\nprotocols. We provide a flexible protocol and give a security proof that\nprovides quantitative bounds that are asymptotically tight, even in the\npresence of general quantum adversaries. At a high level our approach amounts\nto establishing a reduction to the scenario in which the untrusted device\noperates in an identical and independent way in each round of the protocol.\nThis is achieved by leveraging the sequential nature of the protocol, and makes\nuse of a newly developed tool, the \"entropy accumulation theorem\" of Dupuis et\nal.\n  As concrete applications we give simple and modular security proofs for\ndevice-independent quantum key distribution and randomness expansion protocols\nbased on the CHSH inequality. For both tasks we establish essentially optimal\nasymptotic key rates and noise tolerance. In view of recent experimental\nprogress, which has culminated in loophole-free Bell tests, it is likely that\nthese protocols can be practically implemented in the near future.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2016 20:00:44 GMT"}, {"version": "v2", "created": "Tue, 17 Jan 2017 04:35:28 GMT"}, {"version": "v3", "created": "Tue, 26 Mar 2019 23:11:57 GMT"}], "update_date": "2019-03-28", "authors_parsed": [["Arnon-Friedman", "Rotem", ""], ["Renner", "Renato", ""], ["Vidick", "Thomas", ""]]}, {"id": "1607.01842", "submitter": "Barak Shani", "authors": "Steven D. Galbraith, Joel Laity and Barak Shani", "title": "Finding Significant Fourier Coefficients: Clarifications,\n  Simplifications, Applications and Limitations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DS cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ideas from Fourier analysis have been used in cryptography for the last three\ndecades. Akavia, Goldwasser and Safra unified some of these ideas to give a\ncomplete algorithm that finds significant Fourier coefficients of functions on\nany finite abelian group. Their algorithm stimulated a lot of interest in the\ncryptography community, especially in the context of `bit security'. This\nmanuscript attempts to be a friendly and comprehensive guide to the tools and\nresults in this field. The intended readership is cryptographers who have heard\nabout these tools and seek an understanding of their mechanics and their\nusefulness and limitations. A compact overview of the algorithm is presented\nwith emphasis on the ideas behind it. We show how these ideas can be extended\nto a `modulus-switching' variant of the algorithm. We survey some applications\nof this algorithm, and explain that several results should be taken in the\nright context. In particular, we point out that some of the most important bit\nsecurity problems are still open. Our original contributions include: a\ndiscussion of the limitations on the usefulness of these tools; an answer to an\nopen question about the modular inversion hidden number problem.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2016 23:54:40 GMT"}, {"version": "v2", "created": "Mon, 17 Oct 2016 02:15:41 GMT"}, {"version": "v3", "created": "Tue, 31 Jan 2017 13:21:49 GMT"}, {"version": "v4", "created": "Thu, 13 Dec 2018 15:26:07 GMT"}], "update_date": "2018-12-14", "authors_parsed": [["Galbraith", "Steven D.", ""], ["Laity", "Joel", ""], ["Shani", "Barak", ""]]}, {"id": "1607.02192", "submitter": "Ankur Taly", "authors": "Andres Erbsen, Asim Shankar, Ankur Taly", "title": "Distributed Authorization in Vanadium", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this tutorial, we present an authorization model for distributed systems\nthat operate with limited internet connectivity. Reliable internet access\nremains a luxury for a majority of the world's population. Even for those who\ncan afford it, a dependence on internet connectivity may lead to sub-optimal\nuser experiences. With a focus on decentralized deployment, we present an\nauthorization model that is suitable for scenarios where devices right next to\neach other (such as a sensor or a friend's phone) should be able to communicate\nsecurely in a peer-to-peer manner. The model has been deployed as part of an\nopen-source distributed application framework called Vanadium. As part of this\ntutorial, we survey some of the key ideas and techniques used in distributed\nauthorization, and explain how they are combined in the design of our model.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jul 2016 23:00:25 GMT"}, {"version": "v2", "created": "Mon, 5 Dec 2016 19:47:36 GMT"}], "update_date": "2016-12-06", "authors_parsed": [["Erbsen", "Andres", ""], ["Shankar", "Asim", ""], ["Taly", "Ankur", ""]]}, {"id": "1607.02225", "submitter": "EPTCS", "authors": "Gerg\\\"o Barany (CEA, LIST, Software Reliability Laboratory)", "title": "Hybrid Information Flow Analysis for Programs with Arrays", "comments": "In Proceedings VPT 2016, arXiv:1607.01835", "journal-ref": "EPTCS 216, 2016, pp. 5-23", "doi": "10.4204/EPTCS.216.1", "report-no": null, "categories": "cs.PL cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information flow analysis checks whether certain pieces of (confidential)\ndata may affect the results of computations in unwanted ways and thus leak\ninformation. Dynamic information flow analysis adds instrumentation code to the\ntarget software to track flows at run time and raise alarms if a flow policy is\nviolated; hybrid analyses combine this with preliminary static analysis.\n  Using a subset of C as the target language, we extend previous work on hybrid\ninformation flow analysis that handled pointers to scalars. Our extended\nformulation handles arrays, pointers to array elements, and pointer arithmetic.\nInformation flow through arrays of pointers is tracked precisely while arrays\nof non-pointer types are summarized efficiently.\n  A prototype of our approach is implemented using the Frama-C program analysis\nand transformation framework. Work on a full machine-checked proof of the\ncorrectness of our approach using Isabelle/HOL is well underway; we present the\nexisting parts and sketch the rest of the correctness argument.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jul 2016 05:30:24 GMT"}], "update_date": "2016-07-11", "authors_parsed": [["Barany", "Gergö", "", "CEA, LIST, Software Reliability Laboratory"]]}, {"id": "1607.02420", "submitter": "Maria Kyropoulou", "authors": "Aggelos Kiayias, Elias Koutsoupias, Maria Kyropoulou, and Yiannis\n  Tselekounis", "title": "Blockchain Mining Games", "comments": "Accepted to EC '16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the strategic considerations of miners participating in the\nbitcoin's protocol. We formulate and study the stochastic game that underlies\nthese strategic considerations. The miners collectively build a tree of blocks,\nand they are paid when they create a node (mine a block) which will end up in\nthe path of the tree that is adopted by all. Since the miners can hide newly\nmined nodes, they play a game with incomplete information. Here we consider two\nsimplified forms of this game in which the miners have complete information. In\nthe simplest game the miners release every mined block immediately, but are\nstrategic on which blocks to mine. In the second more complicated game, when a\nblock is mined it is announced immediately, but it may not be released so that\nother miners cannot continue mining from it. A miner not only decides which\nblocks to mine, but also when to release blocks to other miners. In both games,\nwe show that when the computational power of each miner is relatively small,\ntheir best response matches the expected behavior of the bitcoin designer.\nHowever, when the computational power of a miner is large, he deviates from the\nexpected behavior, and other Nash equilibria arise.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jul 2016 15:40:55 GMT"}], "update_date": "2016-07-11", "authors_parsed": [["Kiayias", "Aggelos", ""], ["Koutsoupias", "Elias", ""], ["Kyropoulou", "Maria", ""], ["Tselekounis", "Yiannis", ""]]}, {"id": "1607.02533", "submitter": "Alexey Kurakin", "authors": "Alexey Kurakin, Ian Goodfellow and Samy Bengio", "title": "Adversarial examples in the physical world", "comments": "14 pages, 6 figures. Demo available at https://youtu.be/zQ_uMenoBCk", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CR cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most existing machine learning classifiers are highly vulnerable to\nadversarial examples. An adversarial example is a sample of input data which\nhas been modified very slightly in a way that is intended to cause a machine\nlearning classifier to misclassify it. In many cases, these modifications can\nbe so subtle that a human observer does not even notice the modification at\nall, yet the classifier still makes a mistake. Adversarial examples pose\nsecurity concerns because they could be used to perform an attack on machine\nlearning systems, even if the adversary has no access to the underlying model.\nUp to now, all previous work have assumed a threat model in which the adversary\ncan feed data directly into the machine learning classifier. This is not always\nthe case for systems operating in the physical world, for example those which\nare using signals from cameras and other sensors as an input. This paper shows\nthat even in such physical world scenarios, machine learning systems are\nvulnerable to adversarial examples. We demonstrate this by feeding adversarial\nimages obtained from cell-phone camera to an ImageNet Inception classifier and\nmeasuring the classification accuracy of the system. We find that a large\nfraction of adversarial examples are classified incorrectly even when perceived\nthrough the camera.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jul 2016 21:12:11 GMT"}, {"version": "v2", "created": "Tue, 23 Aug 2016 22:57:31 GMT"}, {"version": "v3", "created": "Fri, 4 Nov 2016 20:34:37 GMT"}, {"version": "v4", "created": "Sat, 11 Feb 2017 00:39:39 GMT"}], "update_date": "2017-02-14", "authors_parsed": [["Kurakin", "Alexey", ""], ["Goodfellow", "Ian", ""], ["Bengio", "Samy", ""]]}, {"id": "1607.02562", "submitter": "Marco Rocchetto", "authors": "Marco Rocchetto and Nils Ole Tippenhauer", "title": "CPDY: Extending the Dolev-Yao Attacker with Physical-Layer Interactions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose extensions to the Dolev-Yao attacker model to make it suitable for\narguments about security of Cyber-Physical Systems. The Dolev-Yao attacker\nmodel uses a set of rules to define potential actions by an attacker with\nrespect to messages (i.e. information) exchanged between parties during a\nprotocol execution. As the traditional Dolev-Yao model considers only\ninformation (exchanged over a channel controlled by the attacker), the model\ncannot directly be used to argue about the security of cyber-physical systems\nwhere physical-layer interactions are possible. Our Dolev-Yao extension, called\ncyber-physical Dolev-Yao (CPDY) attacker model, allows additional orthogonal\ninteraction channels between the parties. In particular, such orthogonal\nchannels can be used to model physical-layer mechanical, chemical, or\nelectrical interactions between components. In addition, we discuss the\ninclusion of physical properties such as location or distance in the rule set.\nWe present an example set of additional rules for the Dolev-Yao attacker, using\nthose we are able to formally discover physical attacks that previously could\nonly be found by empirical methods or detailed physical process models.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jul 2016 02:45:15 GMT"}, {"version": "v2", "created": "Mon, 18 Jul 2016 04:35:14 GMT"}, {"version": "v3", "created": "Wed, 20 Jul 2016 02:49:14 GMT"}], "update_date": "2016-07-21", "authors_parsed": [["Rocchetto", "Marco", ""], ["Tippenhauer", "Nils Ole", ""]]}, {"id": "1607.02805", "submitter": "Joshua Joy", "authors": "Joshua Joy, Ciaran McGoldrick, Mario Gerla", "title": "Mobile Privacy-Preserving Crowdsourced Data Collection in the Smart City", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Smart cities rely on dynamic and real-time data to enable smart urban\napplications such as intelligent transport and epidemics detection. However,\nthe streaming of big data from IoT devices, especially from mobile platforms\nlike pedestrians and cars, raises significant privacy concerns.\n  Future autonomous vehicles will generate, collect and consume significant\nvolumes of data to be utilized in delivering safe and efficient transportation\nsolutions. The sensed data will, inherently, contain personally identifiable\nand attributable information - both external (other vehicles, environmental)\nand internal (driver, passengers, devices).\n  The autonomous vehicles are connected to the infrastructure cloud (e.g.,\nAmazon), the edge cloud, and also the mobile cloud (vehicle to vehicle).\nClearly these different entities must co-operate and interoperate in a timely\nfashion when routing and transferring the highly dynamic data. In order to\nmaximise the availability and utility of the sensed data, stakeholders must\nhave confidence that the data they transmit, receive, aggregate and reason on\nis appropriately secured and protected throughout. There are many different\nmetaphors for providing end-to-end security for data exchanges, but they\ncommonly require a management and control sidechannel.\n  This work proposes a scalable smart city privacy-preserving architecture\nnamed Authorized Analytics that enables each node (e.g. vehicle) to divulge\n(contextually) local privatised data. Authorized Analytics is shown to scale\ngracefully to IoT scope deployments.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jul 2016 01:59:37 GMT"}], "update_date": "2016-07-12", "authors_parsed": [["Joy", "Joshua", ""], ["McGoldrick", "Ciaran", ""], ["Gerla", "Mario", ""]]}, {"id": "1607.02982", "submitter": "Andrew Prout", "authors": "Andrew Prout, William Arcand, David Bestor, Bill Bergeron, Chansup\n  Byun, Vijay Gadepally, Matthew Hubbell, Michael Houle, Michael Jones, Peter\n  Michaleas, Lauren Milechin, Julie Mullen, Antonio Rosa, Siddharth Samsi,\n  Albert Reuther, Jeremy Kepner", "title": "Enhancing HPC Security with a User-Based Firewall", "comments": null, "journal-ref": null, "doi": "10.1109/HPEC.2016.7761641", "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  HPC systems traditionally allow their users unrestricted use of their\ninternal network. While this network is normally controlled enough to guarantee\nprivacy without the need for encryption, it does not provide a method to\nauthenticate peer connections. Protocols built upon this internal network must\nprovide their own authentication. Many methods have been employed to perform\nthis authentication. However, support for all of these methods requires the HPC\napplication developer to include support and the user to configure and enable\nthese services. The user-based firewall capability we have prototyped enables a\nset of rules governing connections across the HPC internal network to be put\ninto place using Linux netfilter. By using an operating system-level\ncapability, the system is not reliant on any developer or user actions to\nenable security. The rules we have chosen and implemented are crafted to not\nimpact the vast majority of users and be completely invisible to them.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jul 2016 14:44:01 GMT"}], "update_date": "2016-12-13", "authors_parsed": [["Prout", "Andrew", ""], ["Arcand", "William", ""], ["Bestor", "David", ""], ["Bergeron", "Bill", ""], ["Byun", "Chansup", ""], ["Gadepally", "Vijay", ""], ["Hubbell", "Matthew", ""], ["Houle", "Michael", ""], ["Jones", "Michael", ""], ["Michaleas", "Peter", ""], ["Milechin", "Lauren", ""], ["Mullen", "Julie", ""], ["Rosa", "Antonio", ""], ["Samsi", "Siddharth", ""], ["Reuther", "Albert", ""], ["Kepner", "Jeremy", ""]]}, {"id": "1607.02987", "submitter": "Georgios M. Nikolopoulos Ph. D", "authors": "Georgios M. Nikolopoulos and Thomas Brougham", "title": "Decision and function problems based on boson sampling", "comments": "Close to the version published in PRA", "journal-ref": "Phys. Rev. A 94, 012315 (2016)", "doi": "10.1103/PhysRevA.94.012315", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Boson sampling is a mathematical problem that is strongly believed to be\nintractable for classical computers, whereas passive linear interferometers can\nproduce samples efficiently. So far, the problem remains a computational\ncuriosity, and the possible usefulness of boson-sampling devices is mainly\nlimited to the proof of quantum supremacy. The purpose of this work is to\ninvestigate whether boson sampling can be used as a resource of decision and\nfunction problems that are computationally hard, and may thus have\ncryptographic applications. After the definition of a rather general\ntheoretical framework for the design of such problems, we discuss their\nsolution by means of a brute-force numerical approach, as well as by means of\nnon-boson samplers. Moreover, we estimate the sample sizes required for their\nsolution by passive linear interferometers, and it is shown that they are\nindependent of the size of the Hilbert space.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jul 2016 14:59:26 GMT"}], "update_date": "2019-07-04", "authors_parsed": [["Nikolopoulos", "Georgios M.", ""], ["Brougham", "Thomas", ""]]}, {"id": "1607.03140", "submitter": "Ruoxi Jia", "authors": "Ruoxi Jia, Roy Dong, S. Shankar Sastry, Costas J. Spanos", "title": "Privacy-Enhanced Architecture for Occupancy-based HVAC Control", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large-scale sensing and actuation infrastructures have allowed buildings to\nachieve significant energy savings; at the same time, these technologies\nintroduce significant privacy risks that must be addressed. In this paper, we\npresent a framework for modeling the trade-off between improved control\nperformance and increased privacy risks due to occupancy sensing. More\nspecifically, we consider occupancy-based HVAC control as the control objective\nand the location traces of individual occupants as the private variables.\nPrevious studies have shown that individual location information can be\ninferred from occupancy measurements. To ensure privacy, we design an\narchitecture that distorts the occupancy data in order to hide individual\noccupant location information while maintaining HVAC performance. Using mutual\ninformation between the individual's location trace and the reported occupancy\nmeasurement as a privacy metric, we are able to optimally design a scheme to\nminimize privacy risk subject to a control performance guarantee. We evaluate\nour framework using real-world occupancy data: first, we verify that our\nprivacy metric accurately assesses the adversary's ability to infer private\nvariables from the distorted sensor measurements; then, we show that control\nperformance is maintained through simulations of building operations using\nthese distorted occupancy readings.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jul 2016 20:25:03 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Jia", "Ruoxi", ""], ["Dong", "Roy", ""], ["Sastry", "S. Shankar", ""], ["Spanos", "Costas J.", ""]]}, {"id": "1607.03239", "submitter": "Martin Henze", "authors": "Martin Henze, Ren\\'e Hummen, Roman Matzutt, Klaus Wehrle", "title": "The SensorCloud Protocol: Securely Outsourcing Sensor Data to the Cloud", "comments": "19 pages, 1 figure, published as technical report of the Department\n  of Computer Science of RWTH Aachen University", "journal-ref": null, "doi": null, "report-no": "AIB-2016-06", "categories": "cs.NI cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing deployment of sensor networks, ranging from home networks to\nindustrial automation, leads to a similarly growing demand for storing and\nprocessing the collected sensor data. To satisfy this demand, the most\npromising approach to date is the utilization of the dynamically scalable,\non-demand resources made available via the cloud computing paradigm. However,\nprevalent security and privacy concerns are a huge obstacle for the outsourcing\nof sensor data to the cloud. Hence, sensor data needs to be secured properly\nbefore it can be outsourced to the cloud. When securing the outsourcing of\nsensor data to the cloud, one important challenge lies in the representation of\nsensor data and the choice of security measures applied to it. In this paper,\nwe present the SensorCloud protocol, which enables the representation of sensor\ndata and actuator commands using JSON as well as the encoding of the object\nsecurity mechanisms applied to a given sensor data item. Notably, we solely\nutilize mechanisms that have been or currently are in the process of being\nstandardized at the IETF to aid the wide applicability of our approach.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2016 06:49:14 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Henze", "Martin", ""], ["Hummen", "René", ""], ["Matzutt", "Roman", ""], ["Wehrle", "Klaus", ""]]}, {"id": "1607.03273", "submitter": "Emrah Akyol", "authors": "Kivanc Mihcak, Emrah Akyol, Tamer Basar, Cedric Langbort", "title": "Scalar Quadratic-Gaussian Soft Watermarking Games", "comments": "submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT cs.IT cs.MM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the zero-sum game problem of soft watermarking: The hidden\ninformation (watermark) comes from a continuum and has a perceptual value; the\nreceiver generates an estimate of the embedded watermark to minimize the\nexpected estimation error (unlike the conventional watermarking schemes where\nboth the hidden information and the receiver output are from a discrete finite\nset). Applications include embedding a multimedia content into another. We\nconsider in this paper the scalar Gaussian case and use expected mean-squared\ndistortion. We formulate the resulting problem as a zero-sum game between the\nencoder & receiver pair and the attacker. We show that for the lin- ear\nencoder, the optimal attacker is Gaussian-affine, derive the optimal system\nparameters in that case, and discuss the corresponding system behavior. We also\nprovide numerical results to gain further insight and understanding of the\nsystem behavior at optimality.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2016 09:09:49 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Mihcak", "Kivanc", ""], ["Akyol", "Emrah", ""], ["Basar", "Tamer", ""], ["Langbort", "Cedric", ""]]}, {"id": "1607.03417", "submitter": "Graeme Craig Jenkinson", "authors": "Brain Glass and Graeme Jenkinson and Yuqi Liu and M. Angela Sasse and\n  Frank Stajano", "title": "The usability canary in the security coal mine: A cognitive framework\n  for evaluation and design of usable authentication solutions", "comments": null, "journal-ref": null, "doi": "10.14722/eurousec.2016.23007", "report-no": null, "categories": "cs.HC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past 15 years, researchers have identified an increasing number of\nsecurity mechanisms that are so unusable that the intended users either\ncircumvent them or give up on a service rather than suffer the security. With\nhindsight, the reasons can be identified easily enough: either the security\ntask itself is too cumbersome and/or time-consuming, or it creates high\nfriction with the users` primary task. The aim of the research presented here\nis to equip designers who select and implement security mechanisms with a\nmethod for identifying the ``best fit`` security mechanism at the design stage.\nSince many usability problems have been identified with authentication, we\nfocus on ``best fit`` authentication, and present a framework that allows\nsecurity designers not only to model the workload associated with a particular\nauthentication method, but more importantly to model it in the context of the\nuser`s primary task. We draw on results from cognitive psychology to create a\nmethod that allows a designer to understand the impact of a particular\nauthentication method on user productivity and satisfaction. In a validation\nstudy using a physical mockup of an airline check-in kiosk, we demonstrate that\nthe model can predict user performance and satisfaction. Furthermore, design\nexperts suggested personalized order recommendations which were similar to our\nmodel`s predictions. Our model is the first that supports identification of a\nholistic fit between the task of user authentication and the context in which\nit is performed. When applied to new systems, we believe it will help designers\nunderstand the usability impact of their security choices and thus develop\nsolutions that maximize both.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2016 15:54:32 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Glass", "Brain", ""], ["Jenkinson", "Graeme", ""], ["Liu", "Yuqi", ""], ["Sasse", "M. Angela", ""], ["Stajano", "Frank", ""]]}, {"id": "1607.03450", "submitter": "Leandro Indrusiak", "authors": "Leandro Soares Indrusiak and James Harbin and Martha Johanna Sepulveda", "title": "Side-Channel Attack Resilience through Route Randomisation in Secure\n  Real-Time Networks-on-Chip", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security can be seen as an optimisation objective in NoC resource management,\nand as such poses trade-offs against other objectives such as real-time\nschedulability. In this paper, we show how to increase NoC resilience against a\nconcrete type of security attack, named side-channel attack, which exploit the\ncorrelation between specific non-functional properties (such as packet\nlatencies and routes, in the case of NoCs) to infer the functional behaviour of\nsecure applications. For instance, the transmission of a packet over a given\nlink of the NoC may hint on a cache miss, which can be used by an attacker to\nguess specific parts of a secret cryptographic key, effectively weakening it.\n  We therefore propose packet route randomisation as a mechanism to increase\nNoC resilience against side-channel attacks, focusing specifically on the\npotential impact of such an approach upon hard real-time systems, where\nschedulability is a vital design requirement. Using an evolutionary\noptimisation approach, we show how to effectively apply route randomisation in\nsuch a way that it can increase NoC security while controlling its impact on\nhard real-time performance guarantees. Extensive experimental evidence based on\nanalytical and simulation models supports our findings.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2016 18:04:46 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Indrusiak", "Leandro Soares", ""], ["Harbin", "James", ""], ["Sepulveda", "Martha Johanna", ""]]}, {"id": "1607.03629", "submitter": "Jean-Guillaume Dumas", "authors": "Jean-Guillaume Dumas (CASYS), Pascal Lafourcade (LIMOS), Jean-Baptiste\n  Orfila (CASYS), Maxime Puys (VERIMAG - IMAG)", "title": "Private Multi-party Matrix Multiplication and Trust Computations", "comments": "Pierangela Samarati. SECRYPT 2016 : 13th International Conference on\n  Security and Cryptography, Lisbonne, Portugal, 26--28 Juillet 2016. 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with distributed matrix multiplication. Each player owns\nonly one row of both matrices and wishes to learn about one distinct row of the\nproduct matrix, without revealing its input to the other players. We first\nimprove on a weighted average protocol, in order to securely compute a\ndot-product with a quadratic volume of communications and linear number of\nrounds. We also propose a protocol with five communication rounds, using a\nPaillier-like underlying homomorphic public key cryptosystem, which is secure\nin the semi-honest model or secure with high probability in the malicious\nadversary model. Using ProVerif, a cryptographic protocol verification tool, we\nare able to check the security of the protocol and provide a countermeasure for\neach attack found by the tool. We also give a randomization method to avoid\ncollusion attacks. As an application, we show that this protocol enables a\ndistributed and secure evaluation of trust relationships in a network, for a\nlarge class of trust evaluation schemes.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jul 2016 08:03:57 GMT"}], "update_date": "2016-07-14", "authors_parsed": [["Dumas", "Jean-Guillaume", "", "CASYS"], ["Lafourcade", "Pascal", "", "LIMOS"], ["Orfila", "Jean-Baptiste", "", "CASYS"], ["Puys", "Maxime", "", "VERIMAG - IMAG"]]}, {"id": "1607.03659", "submitter": "Bryan Ford", "authors": "Aaron Segal, Joan Feigenbaum, and Bryan Ford", "title": "Open, privacy-preserving protocols for lawful surveillance", "comments": "13 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The question of how government agencies can acquire actionable, useful\ninformation about legitimate but unknown targets without intruding upon the\nelectronic activity of innocent parties is extremely important. We address this\nquestion by providing experimental evidence that actionable, useful information\ncan indeed be obtained in a manner that preserves the privacy of innocent\nparties and that holds government agencies accountable. In particular, we\npresent practical, privacy-preserving protocols for two operations that\nlaw-enforcement and intelligence agencies have used effectively: set\nintersection and contact chaining. Experiments with our protocols suggest that\nprivacy-preserving contact chaining can perform a 3-hop privacy-preserving\ngraph traversal producing 27,000 ciphertexts in under two minutes. These\nciphertexts are usable in turn via privacy-preserving set intersection to\npinpoint potential unknown targets within a body of 150,000 total ciphertexts\nwithin 10 minutes, without exposing personal information about non-targets.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jul 2016 09:51:04 GMT"}], "update_date": "2016-07-14", "authors_parsed": [["Segal", "Aaron", ""], ["Feigenbaum", "Joan", ""], ["Ford", "Bryan", ""]]}, {"id": "1607.03854", "submitter": "John V Monaco", "authors": "John V. Monaco and Charles C. Tappert", "title": "The Partially Observable Hidden Markov Model and its Application to\n  Keystroke Dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT stat.ML", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The partially observable hidden Markov model is an extension of the hidden\nMarkov Model in which the hidden state is conditioned on an independent Markov\nchain. This structure is motivated by the presence of discrete metadata, such\nas an event type, that may partially reveal the hidden state but itself\nemanates from a separate process. Such a scenario is encountered in keystroke\ndynamics whereby a user's typing behavior is dependent on the text that is\ntyped. Under the assumption that the user can be in either an active or passive\nstate of typing, the keyboard key names are event types that partially reveal\nthe hidden state due to the presence of relatively longer time intervals\nbetween words and sentences than between letters of a word. Using five public\ndatasets, the proposed model is shown to consistently outperform other anomaly\ndetectors, including the standard HMM, in biometric identification and\nverification tasks and is generally preferred over the HMM in a Monte Carlo\ngoodness of fit test.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jul 2016 18:30:33 GMT"}, {"version": "v2", "created": "Tue, 23 Aug 2016 14:03:42 GMT"}, {"version": "v3", "created": "Mon, 29 Aug 2016 15:22:22 GMT"}, {"version": "v4", "created": "Wed, 21 Dec 2016 20:54:21 GMT"}, {"version": "v5", "created": "Tue, 11 Apr 2017 17:22:17 GMT"}, {"version": "v6", "created": "Fri, 17 Nov 2017 14:48:33 GMT"}, {"version": "v7", "created": "Mon, 20 Nov 2017 16:02:39 GMT"}], "update_date": "2017-11-21", "authors_parsed": [["Monaco", "John V.", ""], ["Tappert", "Charles C.", ""]]}, {"id": "1607.03946", "submitter": "Mordechai Guri", "authors": "Mordechai Guri, Ofer Hasson, Gabi Kedma, Yuval Elovici", "title": "VisiSploit: An Optical Covert-Channel to Leak Data through an Air-Gap", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, various out-of-band covert channels have been proposed that\ndemonstrate the feasibility of leaking data out of computers without the need\nfor network connectivity. The methods proposed have been based on different\ntype of electromagnetic, acoustic, and thermal emissions. However, optical\nchannels have largely been considered less covert: because they are visible to\nthe human eye and hence can be detected, they have received less attention from\nresearchers. In this paper, we introduce VisiSploit, a new type of optical\ncovert channel which, unlike other optical methods, is also stealthy. Our\nmethod exploits the limitations of human visual perception in order to\nunobtrusively leak data through a standard computer LCD display. Our\nexperiments show that very low contrast or fast flickering images which are\ninvisible to human subjects, can be recovered from photos taken by a camera.\nConsequentially, we show that malicious code on a compromised computer can\nobtain sensitive data (e.g., images, encryption keys, passwords), and project\nit onto a computer LCD screen, invisible and unbeknownst to users, allowing an\nattacker to reconstruct the data using a photo taken by a nearby (possibly\nhidden) camera. In order to demonstrate the feasibility of this type of attack\nand evaluate the channel's stealth, we conducted a battery of tests with 40\nhuman subjects. We also examined the channel's boundaries under various\nparameters, with different types of encoded objects, at several distances, and\nusing several kinds of cameras. Our results show that binary data can be leaked\nvia our covert channel. Further research and discussion may widen the scope of\nthis field beyond its current boundaries, yielding novel attack paradigms that\nexploit the subtle mechanisms of human visual perception.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jul 2016 22:13:18 GMT"}, {"version": "v2", "created": "Tue, 19 Jul 2016 13:37:18 GMT"}], "update_date": "2016-07-20", "authors_parsed": [["Guri", "Mordechai", ""], ["Hasson", "Ofer", ""], ["Kedma", "Gabi", ""], ["Elovici", "Yuval", ""]]}, {"id": "1607.04256", "submitter": "Birendra Chalise", "authors": "Chalise Birendra", "title": "Android Permission Model", "comments": "8 pages, 5 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent evolution on the smart phone technology has made its application\nmarket huge and less secure. Every single day large number of apps introduced\nin the android market (mostly on google play store) without any particular\ninspections which creates a lot of security issues and they remain unresolved.\nThere are a lot of recent and increasing security issues which are mostly\ncaused by the android apps. Mainly, the access of user data through the apps\nrelied on the users given permission to apps.So, it is always a big question\nthat how different apps on the android smart phones bypass the android\npermission model to have root access and how user data compromised or stolen by\nits apps. It is not startling that the Google Play Store has massive number of\nmalicious apps that may gain users attention to fall victim for one, but some\ntime it might be even worse than we thought. In this paper, we will look at the\nsecurity issues (i.e. rooting phone, malware bypassing and secondary storage)\nand how easy to get access to users phone by using its app.\n  Furthermore, I will discuss the android update mechanism and its\nfunctionalities as well as vulnerability to possible third party bypassing and\nroot access. Moreover, a key feature and source of the all possible access\nroute to android applications I will discuss an android permission model.\nFinally, I will first time present concept of the feature based development\nmodel implementing a feature based permission selections as a solution to\nandroid application system and describe the purposed Feature based permission\nmodel in detail how it is the solution for current security issues caused by\nintentional (evil coded) or unintentional (poorly coded) coding using android\npermission models.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jul 2016 19:31:10 GMT"}, {"version": "v2", "created": "Fri, 15 Jul 2016 13:16:36 GMT"}], "update_date": "2016-07-18", "authors_parsed": [["Birendra", "Chalise", ""]]}, {"id": "1607.04311", "submitter": "Nicholas Carlini", "authors": "Nicholas Carlini and David Wagner", "title": "Defensive Distillation is Not Robust to Adversarial Examples", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that defensive distillation is not secure: it is no more resistant to\ntargeted misclassification attacks than unprotected neural networks.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jul 2016 20:44:27 GMT"}], "update_date": "2016-07-18", "authors_parsed": [["Carlini", "Nicholas", ""], ["Wagner", "David", ""]]}, {"id": "1607.04421", "submitter": "Chris Mitchell", "authors": "Fatma AL Maqbali and Chris J Mitchell", "title": "Password Generators: Old Ideas and New", "comments": "This is the full version of a paper with the same title due to be\n  published in the proceedings of WISTP 2016 in September 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers password generators, i.e. systems designed to generate\nsite-specific passwords on demand. Such systems are an alternative to password\nmanagers. Over the last 15 years a range of password generator systems have\nbeen described. This paper proposes the first general model for such systems,\nand critically examines options for instantiating this model; options\nconsidered include all those previously proposed as part of existing schemes as\nwell as certain novel possibilities. The model enables a more objective and\nhigh-level assessment of the design of such systems; it has also been used to\nsketch a possible new scheme, AutoPass, intended to incorporate the best\nfeatures of the prior art whilst also addressing many of the most serious\nshortcomings of existing systems through the inclusion of novel features.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jul 2016 09:03:06 GMT"}], "update_date": "2016-07-18", "authors_parsed": [["Maqbali", "Fatma AL", ""], ["Mitchell", "Chris J", ""]]}, {"id": "1607.04629", "submitter": "Aronee Dasgupta Mr", "authors": "Aronee Dasgupta, Sahil Chakraborty, Astha Nachrani and Pritam Gajkumar\n  Shah", "title": "Lightweight Security Protocol for WiSense based Wireless Sensor Network", "comments": "5 pages, 4 figures, 2 tables. Published with International Journal of\n  Computer Applications (IJCA)", "journal-ref": "International Journal of Computer Applications 145(3):6-10, July\n  2016", "doi": "10.5120/ijca2016910172", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Sensor Networks have emerged as one of the leading technologies.\nThese networks are designed to monitor crucial environmental parameters of\nhumidity, temperature, wind speed, soil moisture content, UV index, sound, etc.\nand then transfer the required information to the base station. However,\nsecurity remains the key challenge of such networks as critical data is being\ntransferred. Most sensor nodes currently deployed have constraints on memory\nand processing power and hence operate without an efficient security protocol.\nHereby a protocol which is lightweight and is secure for wireless sensor\napplications is proposed.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jul 2016 19:46:36 GMT"}], "update_date": "2016-07-18", "authors_parsed": [["Dasgupta", "Aronee", ""], ["Chakraborty", "Sahil", ""], ["Nachrani", "Astha", ""], ["Shah", "Pritam Gajkumar", ""]]}, {"id": "1607.04789", "submitter": "Thijs Laarhoven", "authors": "Thijs Laarhoven", "title": "Sieving for closest lattice vectors (with preprocessing)", "comments": "23rd Conference on Selected Areas in Cryptography (SAC), 2016", "journal-ref": "23rd International Conference on Selected Areas in Cryptography\n  (SAC), pp. 523-542, 2016", "doi": "10.1007/978-3-319-69453-5_28", "report-no": null, "categories": "cs.CR cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lattice-based cryptography has recently emerged as a prime candidate for\nefficient and secure post-quantum cryptography. The two main hard problems\nunderlying its security are the shortest vector problem (SVP) and the closest\nvector problem (CVP). Various algorithms have been studied for solving these\nproblems, and for SVP, lattice sieving currently dominates in terms of the\nasymptotic time complexity: one can heuristically solve SVP in time\n$2^{0.292d}$ in high dimensions $d$ [BDGL'16]. Although several SVP algorithms\ncan also be used to solve CVP, it is not clear whether this also holds for\nheuristic lattice sieving methods. The best time complexity for CVP is\ncurrently $2^{0.377d}$ [BGJ'14].\n  In this paper we revisit sieving algorithms for solving SVP, and study how\nthese algorithms can be modified to solve CVP and its variants as well. Our\nfirst method is aimed at solving one problem instance and minimizes the overall\ntime complexity for a single CVP instance with a time complexity of\n$2^{0.292d}$. Our second method minimizes the amortized time complexity for\nseveral instances on the same lattice, at the cost of a larger preprocessing\ncost. We can solve the closest vector problem with preprocessing (CVPP) with\n$2^{0.636d}$ space and preprocessing, in $2^{0.136d}$ time, while the query\ncomplexity can even be reduced to $2^{\\epsilon d}$ at the cost of preprocessing\ntime and memory complexities of $(1/\\epsilon)^{O(d)}$.\n  For easier variants of CVP, such as approximate CVP and bounded distance\ndecoding (BDD), we further show how the preprocessing method achieves even\nbetter complexities. For instance, we can solve approximate CVPP with large\napproximation factors $k$ with polynomial-sized advice in polynomial time if $k\n= \\Omega(\\sqrt{d/\\log d})$, heuristically closing the gap between the\ndecision-CVPP result of [AR'04] and the search-CVPP result of [DRS'14].\n", "versions": [{"version": "v1", "created": "Sat, 16 Jul 2016 18:59:19 GMT"}], "update_date": "2019-10-04", "authors_parsed": [["Laarhoven", "Thijs", ""]]}, {"id": "1607.04811", "submitter": "James Christopher Foreman PhD", "authors": "James Christopher Foreman and Dheeraj Gurugubelli", "title": "Cyber Attack Surface Analysis of Advanced Metering Infrastructure", "comments": null, "journal-ref": "The Electricity Journal 28.1 (2015): 94-103", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyber attacks on critical infrastructure have been an issue of importance in\nindustry over the past several years, as well as a focus of academic research.\nCyber attacks of various types and magnitude have been on the rise targeted\nspecifically at power grids. A successful attack on the power grid could result\nin significant impacts including grid shutdown, cascading failures, damage to\nthe infrastructure, and potential harm to people. Power grid infrastructure are\ncritical in nature, they enable operations for residential, commercial,\nindustrial, and government users across critical infrastructure such as water,\ncommunication, banking, transportation, manufacturing, and more. The compromise\nof these operations introduces threats, which span from economic to public\nsafety. The Advanced Metering Infrastructure (AMI) is now being rapidly\ndeployed throughout the power grid, and is an enabling technology for smart\ngrid. Identifying the attack surface is a necessary step in achieving cyber\nsecurity in smart grids and AMI. The purpose of this paper is to quantify and\nexamine the cyber attack surface of AMI in order to lay the foundation for\nmitigating approaches to AMI cyber security.\n", "versions": [{"version": "v1", "created": "Sun, 17 Jul 2016 00:37:29 GMT"}], "update_date": "2016-07-19", "authors_parsed": [["Foreman", "James Christopher", ""], ["Gurugubelli", "Dheeraj", ""]]}, {"id": "1607.04950", "submitter": "Michael Wojnowicz", "authors": "Michael Wojnowicz, Glenn Chisholm, Matt Wolff, Xuan Zhao", "title": "Wavelet decomposition of software entropy reveals symptoms of malicious\n  code", "comments": "Post print of paper published in Journal of Innovation in Digital\n  Ecosystems. This corrects typos introduced during editing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sophisticated malware authors can sneak hidden malicious code into portable\nexecutable files, and this code can be hard to detect, especially if encrypted\nor compressed. However, when an executable file switches between code regimes\n(e.g. native, encrypted, compressed, text, and padding), there are\ncorresponding shifts in the file's representation as an entropy signal. In this\npaper, we develop a method for automatically quantifying the extent to which\npatterned variations in a file's entropy signal make it \"suspicious.\" In\nExperiment 1, we use wavelet transforms to define a Suspiciously Structured\nEntropic Change Score (SSECS), a scalar feature that quantifies the\nsuspiciousness of a file based on its distribution of entropic energy across\nmultiple levels of spatial resolution. Based on this single feature, it was\npossible to raise predictive accuracy on a malware detection task from 50.0% to\n68.7%, even though the single feature was applied to a heterogeneous corpus of\nmalware discovered \"in the wild.\" In Experiment 2, we describe how\nwavelet-based decompositions of software entropy can be applied to a parasitic\nmalware detection task involving large numbers of samples and features. By\nextracting only string and entropy features (with wavelet decompositions) from\nsoftware samples, we are able to obtain almost 99% detection of parasitic\nmalware with fewer than 1% false positives on good files. Moreover, the\naddition of wavelet-based features uniformly improved detection performance\nacross plausible false positive rates, both in a strings-only model (e.g., from\n80.90% to 82.97%) and a strings-plus-entropy model (e.g. from 92.10% to 94.74%,\nand from 98.63% to 98.90%). Overall, wavelet decomposition of software entropy\ncan be useful for machine learning models for detecting malware based on\nextracting millions of features from executable files.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2016 05:12:20 GMT"}, {"version": "v2", "created": "Fri, 2 Feb 2018 06:32:38 GMT"}], "update_date": "2018-02-05", "authors_parsed": [["Wojnowicz", "Michael", ""], ["Chisholm", "Glenn", ""], ["Wolff", "Matt", ""], ["Zhao", "Xuan", ""]]}, {"id": "1607.05024", "submitter": "Musheer Ahmad", "authors": "Musheer Ahmad and Hamed D AlSharari", "title": "Rotation-k Affine-Power-Affine-like Multiple Substitution-Boxes for\n  Secure Communication", "comments": "6 pages, IJARCS Journal paper", "journal-ref": "International Journal of Advanced Research in Computer Science 7\n  (3), 44-49, 2016", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Substitution boxes with thorough cryptographic strengths are essential for\nthe development of strong encryption systems. They are the only portions\ncapable of inducing nonlinearity in symmetric encryption systems. Bijective\nsubstitution boxes having both high nonlinearities and high algebraic\ncomplexities are the most desirable to thwart linear, differential and\nalgebraic attacks. In this paper, a method of constructing algebraically\ncomplex and cryptographically potent multiple substitution boxes is proposed.\nThe multiple substitution boxes are synthesized by applying the concept of\nrotation-k approach on the affine-power-affine structure. It is shown that the\nrotation-k approach inherits all the features of affine-power-affine structure.\nPerformance assessment of all the proposed substitution boxes is done against\nnonlinearity, strict avalanche criteria, bits independent criteria,\ndifferential probability, linear approximation probability and algebraic\ncomplexity. It has been found that the proposed substitution boxes have\noutstanding cryptographic characteristics and outperform the various recent\nsubstitution boxes.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2016 11:30:51 GMT"}], "update_date": "2016-07-19", "authors_parsed": [["Ahmad", "Musheer", ""], ["AlSharari", "Hamed D", ""]]}, {"id": "1607.05113", "submitter": "Nicolas Papernot", "authors": "Nicolas Papernot and Patrick McDaniel", "title": "On the Effectiveness of Defensive Distillation", "comments": "Technical Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report experimental results indicating that defensive distillation\nsuccessfully mitigates adversarial samples crafted using the fast gradient sign\nmethod, in addition to those crafted using the Jacobian-based iterative attack\non which the defense mechanism was originally evaluated.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2016 14:58:45 GMT"}], "update_date": "2016-07-19", "authors_parsed": [["Papernot", "Nicolas", ""], ["McDaniel", "Patrick", ""]]}, {"id": "1607.05171", "submitter": "Roger Piqueras Jover", "authors": "Roger Piqueras Jover", "title": "LTE security, protocol exploits and location tracking experimentation\n  with low-cost software radio", "comments": "Extended reports, analysis and results from \"LTE protocol exploits\"\n  presentation at ShmooCon 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The Long Term Evolution (LTE) is the latest mobile standard being implemented\nglobally to provide connectivity and access to advanced services for personal\nmobile devices. Moreover, LTE networks are considered to be one of the main\npillars for the deployment of Machine to Machine (M2M) communication systems\nand the spread of the Internet of Things (IoT). As an enabler for advanced\ncommunications services with a subscription count in the billions, security is\nof capital importance in LTE. Although legacy GSM (Global System for Mobile\nCommunications) networks are known for being insecure and vulnerable to rogue\nbase stations, LTE is assumed to guarantee confidentiality and strong\nauthentication. However, LTE networks are vulnerable to security threats that\ntamper availability, privacy and authentication. This manuscript, which\nsummarizes and expands the results presented by the author at ShmooCon 2016\n\\cite{jover2016lte}, investigates the insecurity rationale behind LTE protocol\nexploits and LTE rogue base stations based on the analysis of real LTE radio\nlink captures from the production network. Implementation results are discussed\nfrom the actual deployment of LTE rogue base stations, IMSI catchers and\nexploits that can potentially block a mobile device. A previously unknown\ntechnique to potentially track the location of mobile devices as they move from\ncell to cell is also discussed, with mitigations being proposed.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2016 16:37:14 GMT"}], "update_date": "2016-07-19", "authors_parsed": [["Jover", "Roger Piqueras", ""]]}, {"id": "1607.05229", "submitter": "Alberto Pedrouzo-Ulloa", "authors": "Alberto Pedrouzo-Ulloa, Juan Ram\\'on Troncoso-Pastoriza, Fernando\n  P\\'erez-Gonz\\'alez", "title": "Number Theoretic Transforms for Secure Signal Processing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multimedia contents are inherently sensitive signals that must be protected\nwhenever they are outsourced to an untrusted environment. This problem becomes\na challenge when the untrusted environment must perform some processing on the\nsensitive signals; a paradigmatic example is Cloud-based signal processing\nservices. Approaches based on Secure Signal Processing (SSP) address this\nchallenge by proposing novel mechanisms for signal processing in the encrypted\ndomain and interactive secure protocols to achieve the goal of protecting\nsignals without disclosing the sensitive information they convey.\n  This work presents a novel and comprehensive set of approaches and primitives\nto efficiently process signals in an encrypted form, by using Number Theoretic\nTransforms (NTTs) in innovative ways. This usage of NTTs paired with\nappropriate signal pre- and post-coding enables a whole range of easily\ncomposable signal processing operations comprising, among others, filtering,\ngeneralized convolutions, matrix-based processing or error correcting codes.\nThe main focus is on unattended processing, in which no interaction from the\nclient is needed; for implementation purposes, efficient lattice-based somewhat\nhomomorphic cryptosystems are used. We exemplify these approaches and evaluate\ntheir performance and accuracy, proving that the proposed framework opens up a\nwide variety of new applications for secured outsourced-processing of\nmultimedia contents.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2016 18:31:38 GMT"}, {"version": "v2", "created": "Mon, 29 Jan 2018 13:33:51 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Pedrouzo-Ulloa", "Alberto", ""], ["Troncoso-Pastoriza", "Juan Ramón", ""], ["Pérez-González", "Fernando", ""]]}, {"id": "1607.05244", "submitter": "Alberto Pedrouzo-Ulloa", "authors": "Alberto Pedrouzo-Ulloa, Juan Ram\\'on Troncoso-Pastoriza, Fernando\n  P\\'erez-Gonz\\'alez", "title": "On Ring Learning with Errors over the Tensor Product of Number Fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The \"Ring Learning with Errors\" (RLWE) problem was formulated as a variant of\nthe \"Learning with Errors\" (LWE) problem, with the purpose of taking advantage\nof an additional algebraic structure in the underlying considered lattices;\nthis enables improvements on the efficiency and cipher expansion on those\ncryptographic applications which were previously based on the LWE problem. In\nEurocrypt 2010, Lyubashevsky et al. introduced this hardness problem and showed\nits relation to some known hardness problems over lattices with a special\nstructure. In this work, we generalize these results and the problems presented\nby Lyubashevsky et al. to the more general case of multivariate rings,\nhighlighting the main differences with respect to the security proof for the\nRLWE counterpart. This hardness problem is denoted as \"Multivariate Ring\nLearning with Errors\" ($m$-RLWE or multivariate RLWE) and we show its relation\nto hardness problems over the tensor product of ideal lattices. Additionally,\nthe $m$-RLWE problem is more adequate than its univariate version for\ncryptographic applications dealing with multidimensional structures.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2016 19:21:21 GMT"}, {"version": "v2", "created": "Tue, 14 Nov 2017 09:46:29 GMT"}, {"version": "v3", "created": "Thu, 1 Feb 2018 22:21:45 GMT"}], "update_date": "2018-02-05", "authors_parsed": [["Pedrouzo-Ulloa", "Alberto", ""], ["Troncoso-Pastoriza", "Juan Ramón", ""], ["Pérez-González", "Fernando", ""]]}, {"id": "1607.05819", "submitter": "Delaram Kahrobaei", "authors": "Jonathan Gryak and Delaram Kahrobaei", "title": "The Status of Polycyclic Group-Based Cryptography: A Survey and Open\n  Problems", "comments": "Groups Complexity Cryptology - De Gruyter, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Polycyclic groups are natural generalizations of cyclic groups but with more\ncomplicated algorithmic properties. They are finitely presented and the word,\nconjugacy, and isomorphism decision problems are all solvable in these groups.\nMoreover, the non-virtually nilpotent ones exhibit an exponential growth rate.\nThese properties make them suitable for use in group-based cryptography, which\nwas proposed in 2004 by Eick and Kahrobaei. Since then, many cryptosystems have\nbeen created that employ polycyclic groups. These include key exchanges such as\nnon-commutative ElGamal, authentication schemes based on the twisted conjugacy\nproblem, and secret sharing via the word problem. In response, heuristic and\ndeterministic methods of cryptanalysis have been developed, including the\nlength-based and linear decomposition attacks. Despite these efforts, there are\nclasses of infinite polycyclic groups that remain suitable for cryptography.\nThe analysis of algorithms for search and decision problems in polycyclic\ngroups has also been developed. In addition to results for the aforementioned\nproblems we present those concerning polycyclic representations, group\nmorphisms, and orbit decidability. Though much progress has been made, many\nalgorithmic and complexity problems remain unsolved, we conclude with a number\nof them. Of particular interest is to show that cryptosystems using infinite\npolycyclic groups are resistant to cryptanalysis on a quantum computer.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jul 2016 04:30:22 GMT"}, {"version": "v2", "created": "Sat, 22 Oct 2016 01:53:44 GMT"}], "update_date": "2016-10-25", "authors_parsed": [["Gryak", "Jonathan", ""], ["Kahrobaei", "Delaram", ""]]}, {"id": "1607.05840", "submitter": "Isabel Wagner", "authors": "Isabel Wagner", "title": "Evaluating the Strength of Genomic Privacy Metrics", "comments": "27 pages, submitted to ACM Transaction on Privacy and Security", "journal-ref": "ACM Trans. Priv. Secur. 20, 1, Article 2 (January 2017), 34 pages", "doi": "10.1145/3020003", "report-no": null, "categories": "cs.CR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The genome is a unique identifier for human individuals. The genome also\ncontains highly sensitive information, creating a high potential for misuse of\ngenomic data (for example, genetic discrimination). In this paper, I\ninvestigated how genomic privacy can be measured in scenarios where an\nadversary aims to infer a person's genomic markers by constructing probability\ndistributions on the values of genetic variations. I measured the strength of\nprivacy metrics by requiring that metrics are monotonic with increasing\nadversary strength and uncovered serious problems with several existing metrics\ncurrently used to measure genomic privacy. I provide suggestions on metric\nselection, interpretation, and visualization, and illustrate the work flow\nusing a case study on Alzheimer's disease.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jul 2016 07:34:17 GMT"}], "update_date": "2017-01-12", "authors_parsed": [["Wagner", "Isabel", ""]]}, {"id": "1607.05868", "submitter": "Mohammad Khodaei", "authors": "Mohammad Khodaei and Panos Papadimitratos", "title": "Evaluating On-demand Pseudonym Acquisition Policies in Vehicular\n  Communication Systems", "comments": "6 pages, 7 figures, IoV-VoI'16", "journal-ref": null, "doi": "10.1145/2938681.2938684", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Standardization and harmonization efforts have reached a consensus towards\nusing a special-purpose Vehicular Public-Key Infrastructure (VPKI) in upcoming\nVehicular Communication (VC) systems. However, there are still several\ntechnical challenges with no conclusive answers; one such an important yet open\nchallenge is the acquisition of shortterm credentials, pseudonym: how should\neach vehicle interact with the VPKI, e.g., how frequently and for how long?\nShould each vehicle itself determine the pseudonym lifetime? Answering these\nquestions is far from trivial. Each choice can affect both the user privacy and\nthe system performance and possibly, as a result, its security. In this paper,\nwe make a novel systematic effort to address this multifaceted question. We\ncraft three generally applicable policies and experimentally evaluate the VPKI\nsystem performance, leveraging two large-scale mobility datasets. We consider\nthe most promising, in terms of efficiency, pseudonym acquisition policies; we\nfind that within this class of policies, the most promising policy in terms of\nprivacy protection can be supported with moderate overhead. Moreover, in all\ncases, this work is the first to provide tangible evidence that the\nstate-of-the-art VPKI can serve sizable areas or domain with modest computing\nresources.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jul 2016 09:02:01 GMT"}, {"version": "v2", "created": "Tue, 4 Jul 2017 14:57:07 GMT"}], "update_date": "2017-07-05", "authors_parsed": [["Khodaei", "Mohammad", ""], ["Papadimitratos", "Panos", ""]]}, {"id": "1607.05901", "submitter": "Ammar Neamah", "authors": "Ammar Ali Neamah", "title": "New Collisions to Improve Pollard's Rho Method of Solving the Discrete\n  Logarithm Problem on Elliptic Curves", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is true that different approaches have been utilised to accelerate the\ncomputation of discrete logarithm problem on elliptic curves with Pollard's Rho\nmethod. However, trapping in cycles fruitless will be obtained by using the\nrandom walks with Pollard's Rho. An efficient alternative approach that is\nbased on new collisions which are reliant on the values ai , bi to solve this\nproblem is proposed. This may requires less iterations than Pollard's Rho\noriginal in reaching collision. Thus, the performance of Pollard's Rho method\nis more efficiently because the improved method not only reduces the number of\nmathematical operations but these collisions can also applied on previous\nimprovements which reported in the literature.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jul 2016 10:23:46 GMT"}], "update_date": "2016-07-21", "authors_parsed": [["Neamah", "Ammar Ali", ""]]}, {"id": "1607.06141", "submitter": "Jonathan Ullman", "authors": "Lucas Kowalczyk, Tal Malkin, Jonathan Ullman, Mark Zhandry", "title": "Strong Hardness of Privacy from Weak Traitor Tracing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite much study, the computational complexity of differential privacy\nremains poorly understood. In this paper we consider the computational\ncomplexity of accurately answering a family $Q$ of statistical queries over a\ndata universe $X$ under differential privacy. A statistical query on a dataset\n$D \\in X^n$ asks \"what fraction of the elements of $D$ satisfy a given\npredicate $p$ on $X$?\" Dwork et al. (STOC'09) and Boneh and Zhandry (CRYPTO'14)\nshowed that if both $Q$ and $X$ are of polynomial size, then there is an\nefficient differentially private algorithm that accurately answers all the\nqueries, and if both $Q$ and $X$ are exponential size, then under a plausible\nassumption, no efficient algorithm exists.\n  We show that, under the same assumption, if either the number of queries or\nthe data universe is of exponential size, and the other has size at least\n$\\tilde{O}(n^7)$, then there is no differentially private algorithm that\nanswers all the queries. In both cases, the result is nearly quantitatively\ntight, since there is an efficient differentially private algorithm that\nanswers $\\tilde{\\Omega}(n^2)$ queries on an exponential size data universe, and\none that answers exponentially many queries on a data universe of size\n$\\tilde{\\Omega}(n^2)$.\n  Our proofs build on the connection between hardness results in differential\nprivacy and traitor-tracing schemes (Dwork et al., STOC'09; Ullman, STOC'13).\nWe prove our hardness result for a polynomial size query set (resp., data\nuniverse) by showing that they follow from the existence of a special type of\ntraitor-tracing scheme with very short ciphertexts (resp., secret keys), but\nvery weak security guarantees, and then constructing such a scheme.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jul 2016 22:31:10 GMT"}], "update_date": "2016-07-22", "authors_parsed": [["Kowalczyk", "Lucas", ""], ["Malkin", "Tal", ""], ["Ullman", "Jonathan", ""], ["Zhandry", "Mark", ""]]}, {"id": "1607.06255", "submitter": "Nima Namvar", "authors": "Nima Namvar, Walid Saad, Niloofar Bahadori, Brian Kelley", "title": "Jamming in the Internet of Things: A Game-Theoretic Perspective", "comments": "2016 IEEE Global Communications Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to its scale and largely interconnected nature, the Internet of Things\n(IoT) will be vulnerable to a number of security threats that range from\nphysical layer attacks to network layer attacks. In this paper, a novel\nanti-jamming strategy for OFDM-based IoT systems is proposed which enables an\nIoT controller to protect the IoT devices against a malicious radio jammer. The\ninteraction between the controller node and the jammer is modeled as a Colonel\nBlotto game with continuous and asymmetric resources in which the IoT\ncontroller, acting as defender, seeks to thwart the jamming attack by\ndistributing its power among the subcarries in a smart way to decrease the\naggregate bit error rate (BER) caused by the jammer. The jammer, on the other\nhand, aims at disrupting the system performance by allocating jamming power to\ndifferent frequency bands. To solve the game, an evolutionary algorithm is\nproposed which can find a mixed-strategy Nash equilibrium of the Blotto game.\nSimulation results show that the proposed algorithm enables the IoT controller\nto maintain the BER above an acceptable threshold, thereby preserving the IoT\nnetwork performance in the presence of malicious jamming.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2016 10:41:28 GMT"}], "update_date": "2016-07-22", "authors_parsed": [["Namvar", "Nima", ""], ["Saad", "Walid", ""], ["Bahadori", "Niloofar", ""], ["Kelley", "Brian", ""]]}, {"id": "1607.06377", "submitter": "James Christopher Foreman PhD", "authors": "James Christopher Foreman and Franklin Pacheco", "title": "Aggregation Architecture for Data Reduction and Privacy in Advanced\n  Metering Infrastructure", "comments": null, "journal-ref": "Innovative Smart Grid Technologies Conference-Latin America (ISGT\n  Latin America), 2017 IEEE PES", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advanced Metering Infrastructure (AMI) have rapidly become a topic of\ninternational interest as governments have sponsored their deployment for the\npurposes of utility service reliability and efficiency, e.g., water and\nelectricity conservation. Two problems plague such deployments. First is the\nprotection of consumer privacy. Second is the problem of huge amounts of data\nfrom such deployments. A new architecture is proposed to address these problems\nthrough the use of Aggregators, which incorporate temporary data buffering and\nthe modularization of utility grid analysis. These Aggregators are used to\ndeliver anonymized summary data to the central utility while preserving billing\nand automated connection services.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jul 2016 20:45:11 GMT"}], "update_date": "2018-05-10", "authors_parsed": [["Foreman", "James Christopher", ""], ["Pacheco", "Franklin", ""]]}, {"id": "1607.06619", "submitter": "Oliver Schranz", "authors": "Michael Backes, Sven Bugiel, Oliver Schranz, Philipp von\n  Styp-Rekowsky, Sebastian Weisgerber", "title": "ARTist: The Android Runtime Instrumentation and Security Toolkit", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present ARTist, a compiler-based application instrumentation solution for\nAndroid. ARTist is based on the new ART runtime and the on-device dex2oat\ncompiler of Android, which replaced the interpreter-based managed runtime (DVM)\nfrom Android version 5 onwards. Since dex2oat is yet uncharted, our approach\nrequired first and foremost a thorough study of the compiler suite's internals\nand in particular of the new default compiler backend Optimizing. We document\nthe results of this study in this paper to facilitate independent research on\nthis topic and exemplify the viability of ARTist by realizing two use cases.\nMoreover, given that seminal works like TaintDroid hitherto depend on the now\nabandoned DVM, we conduct a case study on whether taint tracking can be\nre-instantiated using a compiler-based instrumentation framework. Overall, our\nresults provide compelling arguments for preferring compiler-based\ninstrumentation over alternative bytecode or binary rewriting approaches.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2016 09:52:48 GMT"}], "update_date": "2016-07-25", "authors_parsed": [["Backes", "Michael", ""], ["Bugiel", "Sven", ""], ["Schranz", "Oliver", ""], ["von Styp-Rekowsky", "Philipp", ""], ["Weisgerber", "Sebastian", ""]]}, {"id": "1607.06709", "submitter": "Ricardo Morla", "authors": "Ricardo Morla", "title": "An initial study of the effect of pipelining in hiding HTTP/2.0 response\n  sizes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  HTTP response size is a well-known side channel attack. With the deployment\nof HTTP/2.0, response size attacks are generally dismissed with the argument\nthat pipelining and response multiplexing prevent eavesdroppers from finding\nout response sizes. Yet the extent to which pipelining and response\nmultiplexing actually hide HTTP response sizes has not been adequately\ninvestigated. In this paper we set out to help understand the effect of\npipelining in hiding the size of web objects on the Internet. We conduct an\nexperiment that provides browser-side HTTP response sizes and network-captured\nTLS record sizes and show how the model that we propose for estimating response\nsizes from TLS record sizes improves response matching and attack performance.\nIn this process we gather evidence on how different implementations of HTTP/2.0\nweb servers generate different side- channel information and the limited amount\nof pipelining and response multiplexing used on the Internet today.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2016 15:22:03 GMT"}], "update_date": "2016-07-25", "authors_parsed": [["Morla", "Ricardo", ""]]}, {"id": "1607.06891", "submitter": "Najmeh Miramirkhani", "authors": "Najmeh Miramirkhani, Oleksii Starov, Nick Nikiforakis", "title": "Dial One for Scam: A Large-Scale Analysis of Technical Support Scams", "comments": "This paper was published in NDSS 2017", "journal-ref": null, "doi": "10.14722/ndss.2017.23163", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In technical support scams, cybercriminals attempt to convince users that\ntheir machines are infected with malware and are in need of their technical\nsupport. In this process, the victims are asked to provide scammers with remote\naccess to their machines, who will then \"diagnose the problem\", before offering\ntheir support services which typically cost hundreds of dollars. Despite their\nconceptual simplicity, technical support scams are responsible for yearly\nlosses of tens of millions of dollars from everyday users of the web. In this\npaper, we report on the first systematic study of technical support scams and\nthe call centers hidden behind them. We identify malvertising as a major\nculprit for exposing users to technical support scams and use it to build an\nautomated system capable of discovering, on a weekly basis, hundreds of phone\nnumbers and domains operated by scammers. By allowing our system to run for\nmore than 8 months we collect a large corpus of technical support scams and use\nit to provide insights on their prevalence, the abused infrastructure, the\nillicit profits, and the current evasion attempts of scammers. Finally, by\nsetting up a controlled, IRB-approved, experiment where we interact with 60\ndifferent scammers, we experience first-hand their social engineering tactics,\nwhile collecting detailed statistics of the entire process. We explain how our\nfindings can be used by law-enforcing agencies and propose technical and\neducational countermeasures for helping users avoid being victimized by\ntechnical support scams.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jul 2016 04:57:16 GMT"}, {"version": "v2", "created": "Tue, 14 Mar 2017 18:36:58 GMT"}, {"version": "v3", "created": "Sun, 19 Mar 2017 18:25:32 GMT"}], "update_date": "2017-03-21", "authors_parsed": [["Miramirkhani", "Najmeh", ""], ["Starov", "Oleksii", ""], ["Nikiforakis", "Nick", ""]]}, {"id": "1607.06902", "submitter": "Zhe Jin", "authors": "Zhe Jin, Yen-Lung Lai, Andrew Beng Jin Teoh", "title": "Rank Correlation Measure: A Representational Transformation for\n  Biometric Template Protection", "comments": "6 pages, 5 figures, 2 tables, 1 algorithm", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite a variety of theoretical-sound techniques have been proposed for\nbiometric template protection, there is rarely practical solution that\nguarantees non-invertibility, cancellability, non-linkability and performance\nsimultaneously. In this paper, a ranking-based representational transformation\nis proposed for fingerprint templates. The proposed method transforms a\nreal-valued feature vector into index code such that the pairwise-order measure\nin the resultant codes are closely correlated with rank similarity measure.\nSuch a ranking based technique offers two major merits: 1) Resilient to\nnoises/perturbations in numeric values; and 2) Highly nonlinear embedding based\non partial order statistics. The former takes care of the accuracy performance\nmitigating numeric noises/perturbations while the latter offers strong\nnon-invertible transformation via nonlinear feature embedding from Euclidean to\nRank space that leads to toughness in inversion. The experimental results\ndemonstrate reasonable accuracy performance on benchmark FVC2002 and FVC2004\nfingerprint databases, thus confirm the proposition of the rank correlation.\nMoreover, the security and privacy analysis justify the strong capability\nagainst the existing major privacy attacks.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jul 2016 08:12:01 GMT"}], "update_date": "2016-07-26", "authors_parsed": [["Jin", "Zhe", ""], ["Lai", "Yen-Lung", ""], ["Teoh", "Andrew Beng Jin", ""]]}, {"id": "1607.06992", "submitter": "James Christopher Foreman PhD", "authors": "James Christopher Foreman", "title": "Architecture for Community-scale Critical Infrastructure Coordination\n  for Security and Resilience", "comments": null, "journal-ref": "Strategic Cyber Defense: A Multidisciplinary Perspective 48\n  (2017): 19", "doi": null, "report-no": null, "categories": "cs.CR cs.CY cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our Critical Infrastructure (CI) systems are, by definition, critical to the\nsafe and proper functioning of society. Nearly all of these systems utilize\nindustrial Process Control Systems (PCS) to provide clean water, reliable\nelectricity, critical manufacturing, and many other services within our\ncommunities - yet most of these PCS incorporate very little cyber-security\ncountermeasures. Cyber-attacks on CI are becoming an attractive target. While\nmany vendor solutions are starting to be deployed at CI sites, these solutions\nare largely based on network monitoring for intrusion detection. As such, they\nare not process-aware, nor do they account for inter dependencies among other\nCI sites in their community. What is proposed is an architecture for\ncoordinating all CI within a community, which defines characteristics to\nenhance its integration, its resilience to failure and attack, and its ultimate\nacceptance by CI operators.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jul 2016 02:52:48 GMT"}], "update_date": "2018-05-10", "authors_parsed": [["Foreman", "James Christopher", ""]]}, {"id": "1607.07040", "submitter": "Lei Yu", "authors": "Lei Yu, Houqiang Li, Weiping Li", "title": "Joint Source-Channel Secrecy Using Uncoded Schemes: Towards Secure\n  Source Broadcast", "comments": "This is a revised version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates a joint source-channel secrecy problem for the\nShannon cipher broadcast system. We suppose list secrecy is applied, i.e., a\nwiretapper is allowed to produce a list of reconstruction sequences and the\nsecrecy is measured by the minimum distortion over the entire list. For\ndiscrete communication cases, we propose a permutation-based uncoded scheme,\nwhich cascades a random permutation with a symbol-by-symbol mapping. Using this\nscheme, we derive an inner bound for the admissible region of secret key rate,\nlist rate, wiretapper distortion, and distortions of legitimate users. For the\nconverse part, we easily obtain an outer bound for the admissible region from\nan existing result. Comparing the outer bound with the inner bound shows that\nthe proposed scheme is optimal under certain conditions. Besides, we extend the\nproposed scheme to the scalar and vector Gaussian communication scenarios, and\ncharacterize the corresponding performance as well. For these two cases, we\nalso propose another uncoded scheme, orthogonal-transform-based scheme, which\nachieves the same performance as the permutation-based scheme. Interestingly,\nby introducing the random permutation or the random orthogonal transform into\nthe traditional uncoded scheme, the proposed uncoded schemes, on one hand,\nprovide a certain level of secrecy, and on the other hand, do not lose any\nperformance in terms of the distortions for legitimate users.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jul 2016 13:21:13 GMT"}, {"version": "v2", "created": "Fri, 13 Jan 2017 19:11:55 GMT"}, {"version": "v3", "created": "Sat, 22 Jul 2017 16:07:16 GMT"}], "update_date": "2017-07-25", "authors_parsed": [["Yu", "Lei", ""], ["Li", "Houqiang", ""], ["Li", "Weiping", ""]]}, {"id": "1607.07119", "submitter": "Tzonelih Hwang", "authors": "Shih-Min Hung and Sheng-Liang Hwang and Tzonelih Hwang and Shih-Hung\n  Kao", "title": "Multiparty Quantum Private Comparsion with Individually Dishonest Third\n  Parties for Strangers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study explores a new security problem existing in various\nstate-of-the-art quantum private comparison (QPC) protocols, where a malicious\nthird-party (TP) announces fake comparison (or intermediate) results. In this\ncase, the participants could eventually be led to a wrong direction and the QPC\nwill become fraudulent. In order to resolve this problem, a new level of\ntrustworthiness for TP is defined and a new QPC protocol is proposed, where a\nsecond TP is introduced to monitor the first one. Once a TP announces a fake\ncomparison (or intermediate) result, participants can detect the fraud\nimmediately. Besides, due to the introduction of the second TP, the proposed\nprotocol allows strangers to compare their secrets privately, whereas the\nstate-of-the-art QPCs require the involved clients to know each other before\nrunning the protocol.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jul 2016 01:01:11 GMT"}], "update_date": "2016-07-26", "authors_parsed": [["Hung", "Shih-Min", ""], ["Hwang", "Sheng-Liang", ""], ["Hwang", "Tzonelih", ""], ["Kao", "Shih-Hung", ""]]}, {"id": "1607.07489", "submitter": "Amit Kleinmann", "authors": "Amit Kleinmann and Avishai Wool", "title": "Automatic Construction of Statechart-Based Anomaly Detection Models for\n  Multi-Threaded Industrial Control Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traffic of Industrial Control System (ICS) between the Human Machine\nInterface (HMI) and the Programmable Logic Controller (PLC) is known to be\nhighly periodic. However, it is sometimes multiplexed, due to asynchronous\nscheduling. Modeling the network traffic patterns of multiplexed ICS streams\nusing Deterministic Finite Automata (DFA) for anomaly detection typically\nproduces a very large DFA, and a high false-alarm rate. We introduce a new\nmodeling approach that addresses this gap. Our Statechart DFA modeling includes\nmultiple DFAs, one per cyclic pattern, together with a DFA-selector that\nde-multiplexes the incoming traffic into sub-channels and sends them to their\nrespective DFAs. We demonstrate how to automatically construct the Statechart\nfrom a captured traffic stream. Our unsupervised learning algorithm builds a\nDiscrete-Time Markov Chain (DTMC) from the stream. Next it splits the symbols\ninto sets, one per multiplexed cycle, based on symbol frequencies and node\ndegrees in the DTMC graph. Then it creates a sub-graph for each cycle, and\nextracts Euler cycles for each sub-graph. The final Statechart is comprised of\none DFA per Euler cycle. The algorithms allow for non-unique symbols, that\nappear in more than one cycle, and also for symbols that appear more than once\nin a cycle. We evaluated our solution on traces from a production ICS using the\nSiemens S7-0x72 protocol. We also stress-tested our algorithms on a collection\nof synthetically-generated traces that simulated multiplexed ICS traces with\nvarying levels of symbol uniqueness and time overlap. The algorithms were able\nto split the symbols into sets with 99.6% accuracy. The resulting Statechart\nmodeled the traces with a low median false-alarm rate of 0.483%. In all but the\nmost extreme scenarios the Statechart model drastically reduced both the\nfalse-alarm rate and the learned model size in compare to a naive single-DFA\nmodel\n", "versions": [{"version": "v1", "created": "Mon, 25 Jul 2016 21:33:58 GMT"}], "update_date": "2016-07-27", "authors_parsed": [["Kleinmann", "Amit", ""], ["Wool", "Avishai", ""]]}, {"id": "1607.07501", "submitter": "Stuart Bradley", "authors": "Stuart Bradley", "title": "Realistic DNA De-anonymization using Phenotypic Prediction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are a number of vectors for attack when trying to link an individual to\na certain DNA sequence. Phenotypic prediction is one such vector; linking DNA\nto an individual based on their traits. Current approaches are not overly\neffective, due to a number of real world considerations. This report will\nimprove upon current phenotypic prediction, and suggest a number of methods for\ndefending against such an attack.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jul 2016 22:49:47 GMT"}], "update_date": "2016-07-27", "authors_parsed": [["Bradley", "Stuart", ""]]}, {"id": "1607.07656", "submitter": "Karim Emara", "authors": "Karim Emara, Wolfgang Woerndl, Johann Schlichter", "title": "Context-based Pseudonym Changing Scheme for Vehicular Adhoc Networks", "comments": "Extended version of a previous paper \"K. Emara, W. Woerndl, and J.\n  Schlichter, \"Poster: Context-Adaptive User-Centric Privacy Scheme for VANET,\"\n  in Proceedings of the 11th EAI International Conference on Security and\n  Privacy in Communication Networks, SecureComm'15. Dallas, TX, USA: Springer,\n  June 2015.\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular adhoc networks allow vehicles to share their information for safety\nand traffic efficiency. However, sharing information may threaten the driver\nprivacy because it includes spatiotemporal information and is broadcast\npublicly and periodically. In this paper, we propose a context-adaptive\npseudonym changing scheme which lets a vehicle decide autonomously when to\nchange its pseudonym and how long it should remain silent to ensure\nunlinkability. This scheme adapts dynamically based on the density of the\nsurrounding traffic and the user privacy preferences. We employ a multi-target\ntracking algorithm to measure privacy in terms of traceability in realistic\nvehicle traces. We use Monte Carlo analysis to estimate the quality of service\n(QoS) of a forward collision warning application when vehicles apply this\nscheme. According to the experimental results, the proposed scheme provides a\nbetter compromise between traceability and QoS than a random silent period\nscheme.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2016 12:03:31 GMT"}], "update_date": "2016-07-27", "authors_parsed": [["Emara", "Karim", ""], ["Woerndl", "Wolfgang", ""], ["Schlichter", "Johann", ""]]}, {"id": "1607.07720", "submitter": "J\\\"urgen Koslowski", "authors": "Roberto Vigo, Flemming Nielson, Hanne Riis Nielson (Technical\n  University of Denmark, Lyngby)", "title": "Discovering, quantifying, and displaying attacks", "comments": "LMCS SPECIAL ISSUE FORTE 2014", "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 4 (April 27,\n  2017) lmcs:2178", "doi": "10.2168/LMCS-12(4:5)2016", "report-no": null, "categories": "cs.CR cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the design of software and cyber-physical systems, security is often\nperceived as a qualitative need, but can only be attained quantitatively.\nEspecially when distributed components are involved, it is hard to predict and\nconfront all possible attacks. A main challenge in the development of complex\nsystems is therefore to discover attacks, quantify them to comprehend their\nlikelihood, and communicate them to non-experts for facilitating the decision\nprocess. To address this three-sided challenge we propose a protection analysis\nover the Quality Calculus that (i) computes all the sets of data required by an\nattacker to reach a given location in a system, (ii) determines the cheapest\nset of such attacks for a given notion of cost, and (iii) derives an attack\ntree that displays the attacks graphically. The protection analysis is first\ndeveloped in a qualitative setting, and then extended to quantitative settings\nfollowing an approach applicable to a great many contexts. The quantitative\nformulation is implemented as an optimisation problem encoded into\nSatisfiability Modulo Theories, allowing us to deal with complex cost\nstructures. The usefulness of the framework is demonstrated on a national-scale\nauthentication system, studied through a Java implementation of the framework.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2016 14:29:02 GMT"}, {"version": "v2", "created": "Wed, 19 Oct 2016 08:56:08 GMT"}], "update_date": "2018-03-30", "authors_parsed": [["Vigo", "Roberto", "", "Technical\n  University of Denmark, Lyngby"], ["Nielson", "Flemming", "", "Technical\n  University of Denmark, Lyngby"], ["Nielson", "Hanne Riis", "", "Technical\n  University of Denmark, Lyngby"]]}, {"id": "1607.07759", "submitter": "Sumegha Garg", "authors": "Sumegha Garg, Henry Yuen, Mark Zhandry", "title": "New security notions and feasibility results for authentication of\n  quantum data", "comments": "50 pages, QCrypt 2016 - 6th International Conference on Quantum\n  Cryptography, added a new lifting theorem that shows equivalence between a\n  weak form of authentication security and a stronger notion that considers\n  side information", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a new class of security definitions for authentication in the quantum\nsetting. These definitions capture and strengthen existing definitions of\nsecurity against quantum adversaries for both classical message authentication\ncodes (MACs) and well as full quantum state authentication schemes. The main\nfeature of our definitions is that they precisely characterize the effective\nbehavior of any adversary when the authentication protocol accepts, including\ncorrelations with the key. Our definitions readily yield a host of desirable\nproperties and interesting consequences; for example, our security definition\nfor full quantum state authentication implies that the entire secret key can be\nre-used if the authentication protocol succeeds.\n  Next, we present several protocols satisfying our security definitions. We\nshow that the classical Wegman-Carter authentication scheme with 3-universal\nhashing is secure against superposition attacks, as well as adversaries with\nquantum side information. We then present conceptually simple constructions of\nfull quantum state authentication.\n  Finally, we prove a lifting theorem which shows that, as long as a protocol\ncan securely authenticate the maximally entangled state, it can securely\nauthenticate any state, even those that are entangled with the adversary. Thus,\nthis shows that protocols satisfying a fairly weak form of authentication\nsecurity automatically satisfy a stronger notion of security (in particular,\nthe definition of Dupuis, et al (2012)).\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2016 15:43:06 GMT"}, {"version": "v2", "created": "Wed, 14 Sep 2016 01:19:37 GMT"}], "update_date": "2016-09-15", "authors_parsed": [["Garg", "Sumegha", ""], ["Yuen", "Henry", ""], ["Zhandry", "Mark", ""]]}, {"id": "1607.07824", "submitter": "Patrick Bas Dr", "authors": "Patrick Bas", "title": "Natural Steganography: cover-source switching for better steganography", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new steganographic scheme relying on the principle of\ncover-source switching, the key idea being that the embedding should switch\nfrom one cover-source to another. The proposed implementation, called Natural\nSteganography, considers the sensor noise naturally present in the raw images\nand uses the principle that, by the addition of a specific noise the\nsteganographic embedding tries to mimic a change of ISO sensitivity. The\nembedding methodology consists in 1) perturbing the image in the raw domain, 2)\nmodeling the perturbation in the processed domain, 3) embedding the payload in\nthe processed domain. We show that this methodology is easily tractable\nwhenever the processes are known and enables to embed large and undetectable\npayloads. We also show that already used heuristics such as synchronization of\nembedding changes or detectability after rescaling can be respectively\nexplained by operations such as color demosaicing and down-scaling kernels.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2016 18:02:44 GMT"}], "update_date": "2016-07-27", "authors_parsed": [["Bas", "Patrick", ""]]}, {"id": "1607.07841", "submitter": "Stijn Volckaert", "authors": "Stijn Volckaert, Bjorn De Sutter, Koen De Bosschere, Per Larsen", "title": "Multi-Variant Execution of Parallel Programs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-Variant Execution Environments (MVEEs) are a promising technique to\nprotect software against memory corruption attacks. They transparently execute\nmultiple, diversified variants (often referred to as replicae) of the software\nreceiving the same inputs. By enforcing and monitoring the lock-step execution\nof the replicae's system calls, and by deploying diversity techniques that\nprevent an attacker from simultaneously compromising multiple replicae, MVEEs\ncan block attacks before they succeed.\n  Existing MVEEs cannot handle non-trivial multi-threaded programs because\ntheir undeterministic behavior introduces benign system call inconsistencies in\nthe replicae, which trigger false positive detections and deadlocks in the\nMVEEs. This paper for the first time extends the generality of MVEEs to protect\nmulti-threaded software by means of secure and efficient synchronization\nreplication agents. On the PARSEC 2.1 parallel benchmarks running with four\nworker threads, our prototype MVEE incurs a run-time overhead of only 1.32x.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2016 19:02:15 GMT"}], "update_date": "2016-07-27", "authors_parsed": [["Volckaert", "Stijn", ""], ["De Sutter", "Bjorn", ""], ["De Bosschere", "Koen", ""], ["Larsen", "Per", ""]]}, {"id": "1607.07903", "submitter": "Ericsson Marin", "authors": "Ericsson Marin, Ahmad Diab and Paulo Shakarian", "title": "Product Offerings in Malicious Hacker Markets", "comments": "3 pages, 1 figure, 3 tables. Accepted for publication in IEEE\n  Intelligence and Security Informatics (ISI2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Marketplaces specializing in malicious hacking products - including malware\nand exploits - have recently become more prominent on the darkweb and deepweb.\nWe scrape 17 such sites and collect information about such products in a\nunified database schema. Using a combination of manual labeling and\nunsupervised clustering, we examine a corpus of products in order to understand\ntheir various categories and how they become specialized with respect to vendor\nand marketplace. This initial study presents how we effectively employed\nunsupervised techniques to this data as well as the types of insights we gained\non various categories of malicious hacking products.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2016 21:32:11 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Marin", "Ericsson", ""], ["Diab", "Ahmad", ""], ["Shakarian", "Paulo", ""]]}, {"id": "1607.07947", "submitter": "Juan Quiroz", "authors": "Min Yang Lee, Vahab Iranmanesh, Juan C. Quiroz", "title": "A New Approach to SMS Steganography using Mathematical Equations", "comments": "6 pages, International Conference on Computer Applications &\n  Technology, ICCAT 2015, November 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the era of Information Technology, cyber-crime has always been a worrying\nissue for online users. Phishing, social engineering, and third party attacks\nhave made people reluctant to share their personal information, even with\ntrusted entities. Messages that are sent via Short Message Service (SMS) are\neasily copied and hacked by using special software. To enforce the security of\nsending messages through mobile phones, one solution is SMS steganography. SMS\nSteganography is a technique that hides a secret message in the SMS. We propose\na new approach for SMS steganography that uses a mathematical equation as the\nstego media in order to transmit the data. With this approach, we can hide up\nto 35 characters (25%) of a secret message on a single SMS with maximum of 140\ncharacters.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 03:42:49 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Lee", "Min Yang", ""], ["Iranmanesh", "Vahab", ""], ["Quiroz", "Juan C.", ""]]}, {"id": "1607.08087", "submitter": "Suleiman Yerima", "authors": "Suleiman Y. Yerima, Sakir Sezer, Igor Muttik", "title": "Android Malware Detection: an Eigenspace Analysis Approach", "comments": "7 pages, 4 figures, conference", "journal-ref": null, "doi": "10.1109/SAI.2015.7237302", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The battle to mitigate Android malware has become more critical with the\nemergence of new strains incorporating increasingly sophisticated evasion\ntechniques, in turn necessitating more advanced detection capabilities. Hence,\nin this paper we propose and evaluate a machine learning based approach based\non eigenspace analysis for Android malware detection using features derived\nfrom static analysis characterization of Android applications. Empirical\nevaluation with a dataset of real malware and benign samples show that\ndetection rate of over 96% with a very low false positive rate is achievable\nusing the proposed method.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 13:37:54 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Yerima", "Suleiman Y.", ""], ["Sezer", "Sakir", ""], ["Muttik", "Igor", ""]]}, {"id": "1607.08101", "submitter": "Suleiman Yerima", "authors": "Feng Yao, Suleiman Y. Yerima, BooJoong Kang, Sakir Sezer", "title": "Event-Driven Implicit Authentication for Mobile Access Control", "comments": "8 pages, 9 figures, conference", "journal-ref": null, "doi": "10.1109/NGMAST.2015.47", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to protect user privacy on mobile devices, an event-driven implicit\nauthentication scheme is proposed in this paper. Several methods of utilizing\nthe scheme for recognizing legitimate user behavior are investigated. The\ninvestigated methods compute an aggregate score and a threshold in real-time to\ndetermine the trust level of the current user using real data derived from user\ninteraction with the device. The proposed scheme is designed to: operate\ncompletely in the background, require minimal training period, enable high user\nrecognition rate for implicit authentication, and prompt detection of abnormal\nactivity that can be used to trigger explicitly authenticated access control.\nIn this paper, we investigate threshold computation through standard deviation\nand EWMA (exponentially weighted moving average) based algorithms. The result\nof extensive experiments on user data collected over a period of several weeks\nfrom an Android phone indicates that our proposed approach is feasible and\neffective for lightweight real-time implicit authentication on mobile\nsmartphones.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 14:14:11 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Yao", "Feng", ""], ["Yerima", "Suleiman Y.", ""], ["Kang", "BooJoong", ""], ["Sezer", "Sakir", ""]]}, {"id": "1607.08149", "submitter": "Suleiman Yerima", "authors": "BooJoong Kang, Suleiman Y. Yerima, Kieran McLaughlin, Sakir Sezer", "title": "N-opcode Analysis for Android Malware Classification and Categorization", "comments": "7 pages, 8 figures, conference", "journal-ref": null, "doi": "10.1109/CyberSecPODS.2016.7502343", "report-no": null, "categories": "cs.CR cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Malware detection is a growing problem particularly on the Android mobile\nplatform due to its increasing popularity and accessibility to numerous third\nparty app markets. This has also been made worse by the increasingly\nsophisticated detection avoidance techniques employed by emerging malware\nfamilies. This calls for more effective techniques for detection and\nclassification of Android malware. Hence, in this paper we present an n-opcode\nanalysis based approach that utilizes machine learning to classify and\ncategorize Android malware. This approach enables automated feature discovery\nthat eliminates the need for applying expert or domain knowledge to define the\nneeded features. Our experiments on 2520 samples that were performed using up\nto 10-gram opcode features showed that an f-measure of 98% is achievable using\nthis approach.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 15:32:18 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Kang", "BooJoong", ""], ["Yerima", "Suleiman Y.", ""], ["McLaughlin", "Kieran", ""], ["Sezer", "Sakir", ""]]}, {"id": "1607.08166", "submitter": "Suleiman Yerima", "authors": "Mohammed K. Alzaylaee, Suleiman Y. Yerima, Sakir Sezer", "title": "DynaLog: An automated dynamic analysis framework for characterizing\n  Android applications", "comments": "2016 International Conference On Cyber Security And Protection Of\n  Digital Services (Cyber Security)", "journal-ref": null, "doi": "10.1109/CyberSecPODS.2016.7502337", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Android is becoming ubiquitous and currently has the largest share of the\nmobile OS market with billions of application downloads from the official app\nmarket. It has also become the platform most targeted by mobile malware that\nare becoming more sophisticated to evade state-of-the-art detection approaches.\nMany Android malware families employ obfuscation techniques in order to avoid\ndetection and this may defeat static analysis based approaches. Dynamic\nanalysis on the other hand may be used to overcome this limitation. Hence in\nthis paper we propose DynaLog, a dynamic analysis based framework for\ncharacterizing Android applications. The framework provides the capability to\nanalyse the behaviour of applications based on an extensive number of dynamic\nfeatures. It provides an automated platform for mass analysis and\ncharacterization of apps that is useful for quickly identifying and isolating\nmalicious applications. The DynaLog framework leverages existing open source\ntools to extract and log high level behaviours, API calls, and critical events\nthat can be used to explore the characteristics of an application, thus\nproviding an extensible dynamic analysis platform for detecting Android\nmalware. DynaLog is evaluated using real malware samples and clean applications\ndemonstrating its capabilities for effective analysis and detection of\nmalicious applications.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 16:01:11 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Alzaylaee", "Mohammed K.", ""], ["Yerima", "Suleiman Y.", ""], ["Sezer", "Sakir", ""]]}, {"id": "1607.08168", "submitter": "Philippe Lamontagne", "authors": "Fr\\'ed\\'eric Dupuis, Serge Fehr, Philippe Lamontagne and Louis Salvail", "title": "Adaptive Versus Non-Adaptive Strategies in the Quantum Setting with\n  Applications", "comments": "28 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove a general relation between adaptive and non-adaptive strategies in\nthe quantum setting, i.e., between strategies where the adversary can or cannot\nadaptively base its action on some auxiliary quantum side information. Our\nrelation holds in a very general setting, and is applicable as long as we can\ncontrol the bit-size of the side information, or, more generally, its\n\"information content\". Since adaptivity is notoriously difficult to handle in\nthe analysis of (quantum) cryptographic protocols, this gives us a very\npowerful tool: as long as we have enough control over the side information, it\nis sufficient to restrict ourselves to non-adaptive attacks.\n  We demonstrate the usefulness of this methodology with two examples. The\nfirst is a quantum bit commitment scheme based on 1-bit cut-and-choose. Since\nbit commitment implies oblivious transfer (in the quantum setting), and\noblivious transfer is universal for two-party computation, this implies the\nuniversality of 1-bit cut-and-choose, and thus solves the main open problem of\n[FKSZZ13]. The second example is a quantum bit commitment scheme proposed in\n1993 by Brassard et al. It was originally suggested as an unconditionally\nsecure scheme, back when this was thought to be possible. We partly restore the\nscheme by proving it secure in (a variant of) the bounded quantum storage\nmodel.\n  In both examples, the fact that the adversary holds quantum side information\nobstructs a direct analysis of the scheme, and we circumvent it by analyzing a\nnon-adaptive version, which can be done by means of known techniques, and\napplying our main result.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 16:08:53 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Dupuis", "Frédéric", ""], ["Fehr", "Serge", ""], ["Lamontagne", "Philippe", ""], ["Salvail", "Louis", ""]]}, {"id": "1607.08186", "submitter": "Suleiman Yerima", "authors": "Suleiman Y. Yerima, Sakir Sezer, Igor Muttik", "title": "Android Malware Detection Using Parallel Machine Learning Classifiers", "comments": "8th International Conference on Next Generation Mobile Applications,\n  Services and Technologies, (NGMAST), 10-14 Sept., 2014, Oxford, United\n  Kingdom", "journal-ref": null, "doi": "10.1109/NGMAST.2014.23", "report-no": null, "categories": "cs.CR cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile malware has continued to grow at an alarming rate despite on-going\nefforts towards mitigating the problem. This has been particularly noticeable\non Android due to its being an open platform that has subsequently overtaken\nother platforms in the share of the mobile smart devices market. Hence,\nincentivizing a new wave of emerging Android malware sophisticated enough to\nevade most common detection methods. This paper proposes and investigates a\nparallel machine learning based classification approach for early detection of\nAndroid malware. Using real malware samples and benign applications, a\ncomposite classification model is developed from parallel combination of\nheterogeneous classifiers. The empirical evaluation of the model under\ndifferent combination schemes demonstrates its efficacy and potential to\nimprove detection accuracy. More importantly, by utilizing several classifiers\nwith diverse characteristics, their strengths can be harnessed not only for\nenhanced Android malware detection but also quicker white box analysis by means\nof the more interpretable constituent classifiers.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 17:22:00 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Yerima", "Suleiman Y.", ""], ["Sezer", "Sakir", ""], ["Muttik", "Igor", ""]]}, {"id": "1607.08193", "submitter": "Charles Ci Wen Lim", "authors": "Charles Ci Wen Lim, Feihu Xu, George Siopsis, Eric Chitambar, Philip\n  G. Evans, Bing Qi", "title": "Loss-tolerant quantum secure positioning with weak laser sources", "comments": "11 pages, 3 figures. Partially based on an earlier work in\n  arXiv:1510.04891", "journal-ref": "Phys. Rev. A 94, 032315 (2016)", "doi": "10.1103/PhysRevA.94.032315", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum position verification (QPV) is the art of verifying the geographical\nlocation of an untrusted party. Recently, it has been shown that the widely\nstudied Bennett & Brassard 1984 (BB84) QPV protocol is insecure after the 3 dB\nloss point assuming local operations and classical communication (LOCC)\nadversaries. Here, we propose a time-reversed entanglement swapping QPV\nprotocol (based on measurement-device-independent quantum cryptography) that is\nhighly robust against quantum channel loss. First, assuming ideal qubit\nsources, we show that the protocol is secure against LOCC adversaries for any\nquantum channel loss, thereby overcoming the 3 dB loss limit. Then, we analyze\nthe security of the protocol in a more practical setting involving weak laser\nsources and linear optics. In this setting, we find that the security only\ndegrades by an additive constant and the protocol is able to verify positions\nup to 47 dB channel loss.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 17:43:12 GMT"}], "update_date": "2016-09-21", "authors_parsed": [["Lim", "Charles Ci Wen", ""], ["Xu", "Feihu", ""], ["Siopsis", "George", ""], ["Chitambar", "Eric", ""], ["Evans", "Philip G.", ""], ["Qi", "Bing", ""]]}, {"id": "1607.08228", "submitter": "Danfeng Zhang", "authors": "Danfeng Zhang and Daniel Kifer", "title": "LightDP: Towards Automating Differential Privacy Proofs", "comments": null, "journal-ref": null, "doi": "10.1145/3009837.3009884", "report-no": null, "categories": "cs.PL cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growing popularity and adoption of differential privacy in academic and\nindustrial settings has resulted in the development of increasingly\nsophisticated algorithms for releasing information while preserving privacy.\nAccompanying this phenomenon is the natural rise in the development and\npublication of incorrect algorithms, thus demonstrating the necessity of formal\nverification tools. However, existing formal methods for differential privacy\nface a dilemma: methods based on customized logics can verify sophisticated\nalgorithms but come with a steep learning curve and significant annotation\nburden on the programmers, while existing programming platforms lack expressive\npower for some sophisticated algorithms.\n  In this paper, we present LightDP, a simple imperative language that strikes\na better balance between expressive power and usability. The core of LightDP is\na novel relational type system that separates relational reasoning from privacy\nbudget calculations. With dependent types, the type system is powerful enough\nto verify sophisticated algorithms where the composition theorem falls short.\nIn addition, the inference engine of LightDP infers most of the proof details,\nand even searches for the proof with minimal privacy cost bound when multiple\nproofs exist. We show that LightDP verifies sophisticated algorithms with\nlittle manual effort.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 19:50:10 GMT"}, {"version": "v2", "created": "Mon, 17 Oct 2016 15:17:30 GMT"}, {"version": "v3", "created": "Fri, 9 Dec 2016 22:20:42 GMT"}], "update_date": "2016-12-13", "authors_parsed": [["Zhang", "Danfeng", ""], ["Kifer", "Daniel", ""]]}, {"id": "1607.08277", "submitter": "Christoph Ponikwar", "authors": "Christoph Ponikwar, Hans-Joachim Hof, Smriti Gopinath, Lars Wischhof", "title": "Beyond the Dolev-Yao Model: Realistic Application-Specific Attacker\n  Models for Applications Using Vehicular Communication", "comments": "The Tenth International Conference on Emerging Security Information,\n  Systems and Technologies - SECURWARE 2016, Nice, France, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent time, the standards for Vehicular Ad-hoc Networks (VANETs) and\nIntelligent Transportation Systems (ITSs) matured and scientific and industry\ninterest is high especially as autonomous driving gets a lot of media\nattention. Autonomous driving and other assistance systems for cars make heavy\nuse of VANETs to exchange information.They may provide more comfort, security\nand safety for drivers. However, it is of crucial importance for the user's\ntrust in these assistance systems that they could not be influenced by\nmalicious users. VANETs are likely attack vectors for such malicious users,\nhence application-specific security requirements must be considered during the\ndesign of applications using VANETs. In literature, many attacks on vehicular\ncommunication have been described but attacks on specific vehicular networking\napplications are often missing. This paper fills in this gap by describing\nstandardized vehicular networking applications, defining and extending previous\nattacker models, and using the resulting new models to characterize the\npossible attackers interested in the specific vehicular networking application.\nThe attacker models presented in this paper hopefully provide great benefit for\nthe scientific community and industry as they allow to compare security\nevaluations of different works, characterize attackers, their intentions and\nhelp to plan application-specific security controls for vehicular networking\napplications.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2016 22:23:59 GMT"}], "update_date": "2016-07-29", "authors_parsed": [["Ponikwar", "Christoph", ""], ["Hof", "Hans-Joachim", ""], ["Gopinath", "Smriti", ""], ["Wischhof", "Lars", ""]]}, {"id": "1607.08388", "submitter": "Jingwei Li", "authors": "Chuan Qin and Jingwei Li and Patrick P. C. Lee", "title": "The Design and Implementation of a Rekeying-aware Encrypted\n  Deduplication Storage System", "comments": null, "journal-ref": "ACM Transactions on Storage (2017)", "doi": "10.1145/3032966", "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rekeying refers to an operation of replacing an existing key with a new key\nfor encryption. It renews security protection, so as to protect against key\ncompromise and enable dynamic access control in cryptographic storage. However,\nit is non-trivial to realize efficient rekeying in encrypted deduplication\nstorage systems, which use deterministic content-derived encryption keys to\nallow deduplication on ciphertexts. We design and implement REED, a\nrekeying-aware encrypted deduplication storage system. REED builds on a\ndeterministic version of all-or-nothing transform (AONT), such that it enables\nsecure and lightweight rekeying, while preserving the deduplication capability.\nWe propose two REED encryption schemes that trade between performance and\nsecurity, and extend REED for dynamic access control. We implement a REED\nprototype with various performance optimization techniques and demonstrate how\nwe can exploit similarity to mitigate key generation overhead. Our trace-driven\ntestbed evaluation shows that our REED prototype maintains high performance and\nstorage efficiency.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 10:05:24 GMT"}, {"version": "v2", "created": "Mon, 19 Dec 2016 05:05:23 GMT"}], "update_date": "2017-04-13", "authors_parsed": [["Qin", "Chuan", ""], ["Li", "Jingwei", ""], ["Lee", "Patrick P. C.", ""]]}, {"id": "1607.08401", "submitter": "Federico Pintore", "authors": "Riccardo Longo, Federico Pintore, Giancarlo Rinaldo, Massimiliano Sala", "title": "On the security of the Blockchain Bix Protocol and Certificates", "comments": "16 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The BIX protocol is a blockchain-based protocol that allows distribution of\ncertificates linking a subject with his public key, hence providing a service\nsimilar to that of a PKI but without the need of a CA. In this paper we analyze\nthe security of the BIX protocol in a formal way, in four steps. First, we\nidentify formal security assumptions which are well-suited to this protocol.\nSecond, we present some attack scenarios against the BIX protocol. Third, we\nprovide a formal security proof that some of these attacks are not feasible\nunder our previously established assumptions. Finally, we show how another\nattack may be carried on.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 11:07:54 GMT"}], "update_date": "2016-07-29", "authors_parsed": [["Longo", "Riccardo", ""], ["Pintore", "Federico", ""], ["Rinaldo", "Giancarlo", ""], ["Sala", "Massimiliano", ""]]}, {"id": "1607.08438", "submitter": "Seong Joon Oh", "authors": "Seong Joon Oh, Rodrigo Benenson, Mario Fritz, Bernt Schiele", "title": "Faceless Person Recognition; Privacy Implications in Social Media", "comments": "Accepted to ECCV'16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.AI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As we shift more of our lives into the virtual domain, the volume of data\nshared on the web keeps increasing and presents a threat to our privacy. This\nworks contributes to the understanding of privacy implications of such data\nsharing by analysing how well people are recognisable in social media data. To\nfacilitate a systematic study we define a number of scenarios considering\nfactors such as how many heads of a person are tagged and if those heads are\nobfuscated or not. We propose a robust person recognition system that can\nhandle large variations in pose and clothing, and can be trained with few\ntraining samples. Our results indicate that a handful of images is enough to\nthreaten users' privacy, even in the presence of obfuscation. We show detailed\nexperimental results, and discuss their implications.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 13:10:27 GMT"}], "update_date": "2016-07-29", "authors_parsed": [["Oh", "Seong Joon", ""], ["Benenson", "Rodrigo", ""], ["Fritz", "Mario", ""], ["Schiele", "Bernt", ""]]}, {"id": "1607.08455", "submitter": "Shihui Fu", "authors": "Shihui Fu and Xiutao Feng", "title": "Further Results of the Cryptographic Properties on the Butterfly\n  Structures", "comments": "20 pages", "journal-ref": null, "doi": "10.13154/tosc.v2017.i2.228-249", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a new structure called butterfly introduced by Perrin et at. is\nattractive for that it has very good cryptographic properties: the differential\nuniformity is at most equal to 4 and algebraic degree is also very high when\nexponent $e=3$. It is conjecture that the nonlinearity is also optimal for\nevery odd $k$, which was proposed as a open problem. In this paper, we further\nstudy the butterfly structures and show that these structure with exponent\n$e=2^i+1$ have also very good cryptographic properties. More importantly, we\nprove in theory the nonlinearity is optimal for every odd $k$, which completely\nsolve the open problem. Finally, we study the butter structures with trivial\ncoefficient and show these butterflies have also optimal nonlinearity.\nFurthermore, we show that the closed butterflies with trivial coefficient are\nbijective as well, which also can be used to serve as a cryptographic\nprimitive.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 13:44:58 GMT"}, {"version": "v2", "created": "Sat, 30 Jul 2016 11:34:39 GMT"}], "update_date": "2017-12-11", "authors_parsed": [["Fu", "Shihui", ""], ["Feng", "Xiutao", ""]]}, {"id": "1607.08508", "submitter": "Brandon Wagner", "authors": "Brandon Wagner and Arun Sood", "title": "Economics of Resilient Cloud Services", "comments": "To appear in 1st IEEE International Workshop on Cyber Resilience\n  Economics, August 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer systems today must meet and maintain service availability,\nperformance, and security requirements. Each of these demands requires\nredundancy and some form of isolation. When service requirements are\nimplemented separately, the system architecture cannot easily share common\ncomponents of redundancy and isolation. We will present these service traits\ncollectively as cyber resilience with a system called Self Cleansing Intrusion\nTolerance or SCIT. Further, we will demonstrate that SCIT provides an effective\nresilient cloud implementation making cost effective utilization of cloud\nexcess capacity and economies of scale. Lastly, we will introduce the notion of\nserverless applications utilizing AWS Lambda and how a stateless architecture\ncan drastically reduce operational costs by utilizing cloud function services.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 15:47:43 GMT"}], "update_date": "2016-07-29", "authors_parsed": [["Wagner", "Brandon", ""], ["Sood", "Arun", ""]]}, {"id": "1607.08554", "submitter": "Fang Liu", "authors": "Fang Liu", "title": "Statistical Properties of Sanitized Results from Differentially Private\n  Laplace Mechanism with Univariate Bounding Constraints", "comments": null, "journal-ref": "Transactions on Data Privacy, 2019, 12(3): 169 - 195", "doi": null, "report-no": null, "categories": "stat.ME cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protection of individual privacy is a common concern when releasing and\nsharing data and information. Differential privacy (DP) formalizes privacy in\nprobabilistic terms without making assumptions about the background knowledge\nof data intruders, and thus provides a robust concept for privacy protection.\nPractical applications of DP involve development of differentially private\nmechanisms to generate sanitized results at a pre-specified privacy budget. For\nthe sanitization of statistics with publicly known bounds such as proportions\nand correlation coefficients, the bounding constraints will need to be\nincorporated in the differentially private mechanisms. There has been little\nwork on examining the consequences of the bounding constraints on the accuracy\nof sanitized results and the statistical inferences of the population\nparameters based on the sanitized results. In this paper, we formalize the\ndifferentially private truncated and boundary inflated truncated (BIT)\nprocedures for releasing statistics with publicly known bounding constraints.\nThe impacts of the truncated and BIT Laplace procedures on the statistical\naccuracy and validity of sanitized statistics are evaluated both theoretically\nand empirically via simulation studies.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 18:13:25 GMT"}, {"version": "v2", "created": "Mon, 31 Oct 2016 17:41:23 GMT"}, {"version": "v3", "created": "Sun, 13 Aug 2017 04:22:25 GMT"}, {"version": "v4", "created": "Mon, 12 Mar 2018 01:39:21 GMT"}, {"version": "v5", "created": "Sun, 26 May 2019 20:08:44 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Liu", "Fang", ""]]}, {"id": "1607.08583", "submitter": "Eric Nunes", "authors": "Eric Nunes, Ahmad Diab, Andrew Gunn, Ericsson Marin, Vineet Mishra,\n  Vivin Paliath, John Robertson, Jana Shakarian, Amanda Thart, Paulo Shakarian", "title": "Darknet and Deepnet Mining for Proactive Cybersecurity Threat\n  Intelligence", "comments": "6 page paper accepted to be presented at IEEE Intelligence and\n  Security Informatics 2016 Tucson, Arizona USA September 27-30, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present an operational system for cyber threat intelligence\ngathering from various social platforms on the Internet particularly sites on\nthe darknet and deepnet. We focus our attention to collecting information from\nhacker forum discussions and marketplaces offering products and services\nfocusing on malicious hacking. We have developed an operational system for\nobtaining information from these sites for the purposes of identifying emerging\ncyber threats. Currently, this system collects on average 305 high-quality\ncyber threat warnings each week. These threat warnings include information on\nnewly developed malware and exploits that have not yet been deployed in a\ncyber-attack. This provides a significant service to cyber-defenders. The\nsystem is significantly augmented through the use of various data mining and\nmachine learning techniques. With the use of machine learning models, we are\nable to recall 92% of products in marketplaces and 80% of discussions on forums\nrelating to malicious hacking with high precision. We perform preliminary\nanalysis on the data collected, demonstrating its application to aid a security\nexpert for better threat analysis.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 19:30:04 GMT"}], "update_date": "2016-08-02", "authors_parsed": [["Nunes", "Eric", ""], ["Diab", "Ahmad", ""], ["Gunn", "Andrew", ""], ["Marin", "Ericsson", ""], ["Mishra", "Vineet", ""], ["Paliath", "Vivin", ""], ["Robertson", "John", ""], ["Shakarian", "Jana", ""], ["Thart", "Amanda", ""], ["Shakarian", "Paulo", ""]]}, {"id": "1607.08634", "submitter": "Jorge Luis Rivero Jlrivero", "authors": "Jorge Luis Rivero P\\'erez and Bernardete Ribeiro", "title": "Attribute Learning for Network Intrusion Detection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network intrusion detection is one of the most visible uses for Big Data\nanalytics. One of the main problems in this application is the constant rise of\nnew attacks. This scenario, characterized by the fact that not enough labeled\nexamples are available for the new classes of attacks is hardly addressed by\ntraditional machine learning approaches. New findings on the capabilities of\nZero-Shot learning (ZSL) approach makes it an interesting solution for this\nproblem because it has the ability to classify instances of unseen classes. ZSL\nhas inherently two stages: the attribute learning and the inference stage. In\nthis paper we propose a new algorithm for the attribute learning stage of ZSL.\nThe idea is to learn new values for the attributes based on decision trees\n(DT). Our results show that based on the rules extracted from the DT a better\ndistribution for the attribute values can be found. We also propose an\nexperimental setup for the evaluation of ZSL on network intrusion detection\n(NID).\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 20:36:37 GMT"}], "update_date": "2016-08-01", "authors_parsed": [["Pérez", "Jorge Luis Rivero", ""], ["Ribeiro", "Bernardete", ""]]}, {"id": "1607.08774", "submitter": "Roberto Garrido", "authors": "Roberto Garrido-Pelaz, Lorena Gozalez-Manzano, Sergio Pastrana", "title": "Shall we collaborate? A model to analyse the benefits of information\n  sharing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, both the amount of cyberattacks and their sophistication have\nconsiderably increased, and their prevention is of concern of most of\norganizations. Cooperation by means of information sharing is a promising\nstrategy to address this problem, but unfortunately it poses many challenges.\nIndeed, looking for a win-win environment is not straightforward and\norganizations are not properly motivated to share information. This work\npresents a model to analyse the benefits and drawbacks of information sharing\namong organizations that presents a certain level of dependency. The proposed\nmodel applies functional dependency network analysis to emulate attacks\npropagation and game theory for information sharing management. We present a\nsimulation framework implementing the model that allows for testing different\nsharing strategies under several network and attack settings. Experiments using\nsimulated environments show how the proposed model provides insights on which\nconditions and scenarios are beneficial for information sharing.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jul 2016 11:56:16 GMT"}], "update_date": "2016-08-01", "authors_parsed": [["Garrido-Pelaz", "Roberto", ""], ["Gozalez-Manzano", "Lorena", ""], ["Pastrana", "Sergio", ""]]}]