[{"id": "0704.1158", "submitter": "Bernardo Huberman", "authors": "Fang Wu and Bernardo A. Huberman", "title": "Novelty and Collective Attention", "comments": null, "journal-ref": null, "doi": "10.1073/pnas.0704916104", "report-no": null, "categories": "cs.CY cs.IR physics.soc-ph", "license": null, "abstract": "  The subject of collective attention is central to an information age where\nmillions of people are inundated with daily messages. It is thus of interest to\nunderstand how attention to novel items propagates and eventually fades among\nlarge populations. We have analyzed the dynamics of collective attention among\none million users of an interactive website -- \\texttt{digg.com} -- devoted to\nthousands of novel news stories. The observations can be described by a\ndynamical model characterized by a single novelty factor. Our measurements\nindicate that novelty within groups decays with a stretched-exponential law,\nsuggesting the existence of a natural time scale over which attention fades.\n", "versions": [{"version": "v1", "created": "Mon, 9 Apr 2007 22:02:29 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Wu", "Fang", ""], ["Huberman", "Bernardo A.", ""]]}, {"id": "0704.1676", "submitter": "Kristina Lerman", "authors": "Kristina Lerman, Anon Plangprasopchok and Chio Wong", "title": "Personalizing Image Search Results on Flickr", "comments": "12 pages, submitted to AAAI07 workshop on Intelligent Information\n  Personalization", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.AI cs.CY cs.DL cs.HC", "license": null, "abstract": "  The social media site Flickr allows users to upload their photos, annotate\nthem with tags, submit them to groups, and also to form social networks by\nadding other users as contacts. Flickr offers multiple ways of browsing or\nsearching it. One option is tag search, which returns all images tagged with a\nspecific keyword. If the keyword is ambiguous, e.g., ``beetle'' could mean an\ninsect or a car, tag search results will include many images that are not\nrelevant to the sense the user had in mind when executing the query. We claim\nthat users express their photography interests through the metadata they add in\nthe form of contacts and image annotations. We show how to exploit this\nmetadata to personalize search results for the user, thereby improving search\nperformance. First, we show that we can significantly improve search precision\nby filtering tag search results by user's contacts or a larger social network\nthat includes those contact's contacts. Secondly, we describe a probabilistic\nmodel that takes advantage of tag information to discover latent topics\ncontained in the search results. The users' interests can similarly be\ndescribed by the tags they used for annotating their images. The latent topics\nfound by the model are then used to personalize search results by finding\nimages on topics that are of interest to the user.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2007 23:31:04 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Lerman", "Kristina", ""], ["Plangprasopchok", "Anon", ""], ["Wong", "Chio", ""]]}, {"id": "0704.2902", "submitter": "Stefan Pohl", "authors": "Stefan Pohl, Filip Radlinski and Thorsten Joachims", "title": "Recommending Related Papers Based on Digital Library Access Records", "comments": "2 pages, 3 postscript figures, to appear in proceedings of JCDL'07,\n  additional and more detailed results can be found in arXiv:0704.2963v1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR", "license": null, "abstract": "  An important goal for digital libraries is to enable researchers to more\neasily explore related work. While citation data is often used as an indicator\nof relatedness, in this paper we demonstrate that digital access records (e.g.\nhttp-server logs) can be used as indicators as well. In particular, we show\nthat measures based on co-access provide better coverage than co-citation, that\nthey are available much sooner, and that they are more accurate for recent\npapers.\n", "versions": [{"version": "v1", "created": "Mon, 23 Apr 2007 16:51:40 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Pohl", "Stefan", ""], ["Radlinski", "Filip", ""], ["Joachims", "Thorsten", ""]]}, {"id": "0704.2963", "submitter": "Stefan Pohl", "authors": "Stefan Pohl", "title": "Using Access Data for Paper Recommendations on ArXiv.org", "comments": "73 pages, 31 figures, Master's Thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR", "license": null, "abstract": "  This thesis investigates in the use of access log data as a source of\ninformation for identifying related scientific papers. This is done for\narXiv.org, the authority for publication of e-prints in several fields of\nphysics.\n  Compared to citation information, access logs have the advantage of being\nimmediately available, without manual or automatic extraction of the citation\ngraph. Because of that, a main focus is on the question, how far user behavior\ncan serve as a replacement for explicit meta-data, which potentially might be\nexpensive or completely unavailable. Therefore, we compare access, content, and\ncitation-based measures of relatedness on different recommendation tasks. As a\nfinal result, an online recommendation system has been built that can help\nscientists to find further relevant literature, without having to search for\nthem actively.\n", "versions": [{"version": "v1", "created": "Mon, 23 Apr 2007 15:52:47 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Pohl", "Stefan", ""]]}, {"id": "0704.3316", "submitter": "Ciro Cattuto", "authors": "Ciro Cattuto, Andrea Baldassarri, Vito D. P. Servedio, Vittorio Loreto", "title": "Vocabulary growth in collaborative tagging systems", "comments": "6 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cond-mat.stat-mech cs.CY physics.data-an", "license": null, "abstract": "  We analyze a large-scale snapshot of del.icio.us and investigate how the\nnumber of different tags in the system grows as a function of a suitably\ndefined notion of time. We study the temporal evolution of the global\nvocabulary size, i.e. the number of distinct tags in the entire system, as well\nas the evolution of local vocabularies, that is the growth of the number of\ndistinct tags used in the context of a given resource or user. In both cases,\nwe find power-law behaviors with exponents smaller than one. Surprisingly, the\nobserved growth behaviors are remarkably regular throughout the entire history\nof the system and across very different resources being bookmarked. Similar\nsub-linear laws of growth have been observed in written text, and this\nqualitative universality calls for an explanation and points in the direction\nof non-trivial cognitive processes in the complex interaction patterns\ncharacterizing collaborative tagging.\n", "versions": [{"version": "v1", "created": "Wed, 25 Apr 2007 07:47:40 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Cattuto", "Ciro", ""], ["Baldassarri", "Andrea", ""], ["Servedio", "Vito D. P.", ""], ["Loreto", "Vittorio", ""]]}, {"id": "0704.3359", "submitter": "Alex Smola J", "authors": "Quoc Le and Alexander Smola", "title": "Direct Optimization of Ranking Measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.AI", "license": null, "abstract": "  Web page ranking and collaborative filtering require the optimization of\nsophisticated performance measures. Current Support Vector approaches are\nunable to optimize them directly and focus on pairwise comparisons instead. We\npresent a new approach which allows direct optimization of the relevant loss\nfunctions. This is achieved via structured estimation in Hilbert spaces. It is\nmost related to Max-Margin-Markov networks optimization of multivariate\nperformance measures. Key to our approach is that during training the ranking\nproblem can be viewed as a linear assignment problem, which can be solved by\nthe Hungarian Marriage algorithm. At test time, a sort operation is sufficient,\nas our algorithm assigns a relevance score to every (document, query) pair.\nExperiments show that the our algorithm is fast and that it works very well.\n", "versions": [{"version": "v1", "created": "Wed, 25 Apr 2007 12:36:55 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Le", "Quoc", ""], ["Smola", "Alexander", ""]]}, {"id": "0704.3635", "submitter": "Fulufhelo Vincent Nelwamondo", "authors": "Fulufhelo Vincent Nelwamondo and Tshilidzi Marwala", "title": "Rough Sets Computations to Impute Missing Data", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.IR", "license": null, "abstract": "  Many techniques for handling missing data have been proposed in the\nliterature. Most of these techniques are overly complex. This paper explores an\nimputation technique based on rough set computations. In this paper,\ncharacteristic relations are introduced to describe incompletely specified\ndecision tables.It is shown that the basic rough set idea of lower and upper\napproximations for incompletely specified decision tables may be defined in a\nvariety of different ways. Empirical results obtained using real data are given\nand they provide a valuable and promising insight to the problem of missing\ndata. Missing data were predicted with an accuracy of up to 99%.\n", "versions": [{"version": "v1", "created": "Thu, 26 Apr 2007 22:22:45 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Nelwamondo", "Fulufhelo Vincent", ""], ["Marwala", "Tshilidzi", ""]]}]