[{"id": "1708.00329", "submitter": "Arindam Pal", "authors": "Arindam Pal and Sushmita Ruj", "title": "A Graph Analytics Framework for Ranking Authors, Papers and Venues", "comments": "International Workshop on Mining and Learning with Graphs, ACM KDD\n  2016. arXiv admin note: text overlap with arXiv:1501.04894", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A lot of scientific works are published in different areas of science,\ntechnology, engineering and mathematics. It is not easy, even for experts, to\njudge the quality of authors, papers and venues (conferences and journals). An\nobjective measure to assign scores to these entities and to rank them is very\nuseful. Although, several metrics and indexes have been proposed earlier, they\nsuffer from various problems. In this paper, we propose a graph-based analytics\nframework to assign scores and to rank authors, papers and venues. Our\nalgorithm considers only the link structures of the underlying graphs. It does\nnot take into account other aspects, such as the associated texts and the\nreputation of these entities. In the limit of large number of iterations, the\nsolution of the iterative equations gives the unique entity scores. This\nframework can be easily extended to other interdependent networks.\n", "versions": [{"version": "v1", "created": "Sun, 30 Jul 2017 16:32:39 GMT"}], "update_date": "2017-08-04", "authors_parsed": [["Pal", "Arindam", ""], ["Ruj", "Sushmita", ""]]}, {"id": "1708.00578", "submitter": "Muaz Niazi", "authors": "Bisma S. Khan, Muaz A. Niazi", "title": "Emerging Topics in Internet Technology: A Complex Networks Approach", "comments": "5 pages, 4 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Communication networks, in general, and internet technology, in particular,\nis a fast-evolving area of research. While it is important to keep track of\nemerging trends in this domain, it is such a fast-growing area that it can be\nvery difficult to keep track of literature. The problem is compounded by the\nfast-growing number of citation databases. While other databases are gradually\nindexing a large set of reliable content, currently the Web of Science\nrepresents one of the most highly valued databases. Research indexed in this\ndatabase is known to highlight key advancements in any domain. In this paper,\nwe present a Complex Network-based analytical approach to analyze recent data\nfrom the Web of Science in communication networks. Taking bibliographic records\nfrom the recent period of 2014 to 2017, we model and analyze complex\nscientometric networks. Using bibliometric coupling applied over complex\ncitation data we present answers to co-citation patterns of documents,\nco-occurrence patterns of terms, as well as the most influential articles,\namong others, We also present key pivot points and intellectual turning points.\nComplex network analysis of the data demonstrates a considerably high level of\ninterest in two key clusters labeled descriptively as \"social networks\" and\n\"computer networks\". In addition, key themes in highly cited literature were\nclearly identified as \"communication networks,\" \"social networks,\" and \"complex\nnetworks\".\n", "versions": [{"version": "v1", "created": "Wed, 2 Aug 2017 02:30:50 GMT"}], "update_date": "2017-08-03", "authors_parsed": [["Khan", "Bisma S.", ""], ["Niazi", "Muaz A.", ""]]}, {"id": "1708.00977", "submitter": "Muaz Niazi", "authors": "Bisma S. Khan, Muaz A. Niazi", "title": "Network Community Detection: A Review and Visual Survey", "comments": "39 pages, 17 figures, 24 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CC cs.DL cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Community structure is an important area of research. It has received a\nconsiderable attention from the scientific community. Despite its importance,\none of the key problems in locating information about community detection is\nthe diverse spread of related articles across various disciplines. To the best\nof our knowledge, there is no current comprehensive review of recent literature\nwhich uses a scientometric analysis using complex networks analysis covering\nall relevant articles from the Web of Science (WoS). Here we present a visual\nsurvey of key literature using CiteSpace. The idea is to identify emerging\ntrends besides using network techniques to examine the evolution of the domain.\nTowards that end, we identify the most influential, central, as well as active\nnodes using scientometric analyses. We examine authors, key articles, cited\nreferences, core subject categories, key journals, institutions, as well as\ncountries. The exploration of the scientometric literature of the domain\nreveals that Yong Wang is a pivot node with the highest centrality.\nAdditionally, we have observed that Mark Newman is the most highly cited author\nin the network. We have also identified that the journal, \"Reviews of Modern\nPhysics\" has the strongest citation burst. In terms of cited documents, an\narticle by Andrea Lancichinetti has the highest centrality score. We have also\ndiscovered that the origin of the key publications in this domain is from the\nUnited States. Whereas Scotland has the strongest and longest citation burst.\nAdditionally, we have found that the categories of \"Computer Science\" and\n\"Engineering\" lead other categories based on frequency and centrality\nrespectively.\n", "versions": [{"version": "v1", "created": "Thu, 3 Aug 2017 02:57:35 GMT"}], "update_date": "2017-08-04", "authors_parsed": [["Khan", "Bisma S.", ""], ["Niazi", "Muaz A.", ""]]}, {"id": "1708.01387", "submitter": "Takahiro Kawamura", "authors": "Takahiro Kawamura, Yasuhiro Yamashita, Katsuji Matsumura", "title": "Research Activity Classification based on Time Series Bibliometrics", "comments": null, "journal-ref": "Proceedings of 21st International Conference on Science and\n  Technology Indicators (STI 2016), pp. 1456-1460 (2016)", "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bibliometrics such as the number of papers and times cited are often used to\ncompare researchers based on specific criteria. The criteria, however, are\ndifferent in each research domain and are set by empirical laws. Moreover,\nthere are arguments, such that the simple sum of metric values works to the\nadvantage of elders. Therefore, this paper attempts to constitute features from\ntime series data of bibliometrics, and then classify the researchers according\nto the features. In detail, time series patterns are extracted from\nbibliographic data sets, and then a model to classify whether the researchers\nare \"distinguished\" or not is created by a machine learning technique. The\nexperiments achieved an F-measure of 80.0% in the classification of 114\nresearchers in two research domains based on the data sets of Japan Science and\nTechnology Agency and Elsevier's Scopus. In the future, we will conduct\nverification on a number of researchers in several domains, and then make use\nof discovering \"distinguished\" researchers, who are not widely known.\n", "versions": [{"version": "v1", "created": "Fri, 4 Aug 2017 06:03:03 GMT"}], "update_date": "2017-08-07", "authors_parsed": [["Kawamura", "Takahiro", ""], ["Yamashita", "Yasuhiro", ""], ["Matsumura", "Katsuji", ""]]}, {"id": "1708.01658", "submitter": "Christian Bailey", "authors": "Christian Bailey, Bharat Kale, Jamieson Walker, Harish Varma Siravuri,\n  Hamed Alhoori, Micheal E. Papka", "title": "Exploring Features for Predicting Policy Citations", "comments": "2 pages, accepted to JCDL '17", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study we performed an initial investigation and evaluation of\naltmetrics and their relationship with public policy citation of research\npapers. We examined methods for using altmetrics and other data to predict\nwhether a research paper is cited in public policy and applied receiver\noperating characteristic curve on various feature groups in order to evaluate\ntheir potential usefulness. From the methods we tested, classifying based on\ntweet count provided the best results, achieving an area under the ROC curve of\n0.91.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 18:31:15 GMT"}], "update_date": "2017-08-08", "authors_parsed": [["Bailey", "Christian", ""], ["Kale", "Bharat", ""], ["Walker", "Jamieson", ""], ["Siravuri", "Harish Varma", ""], ["Alhoori", "Hamed", ""], ["Papka", "Micheal E.", ""]]}, {"id": "1708.01859", "submitter": "Michael Golosovsky", "authors": "Michael Golosovsky", "title": "Power-law citation distributions are not scale-free", "comments": "30 pages, 12 figures", "journal-ref": "Phys. Rev. E 96, 032306 (2017)", "doi": "10.1103/PhysRevE.96.032306", "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze time evolution of statistical distributions of citations to\nscientific papers published in one year. While these distributions can be\nfitted by a power-law dependence we find that they are nonstationary and the\nexponent of the power law fit decreases with time and does not come to\nsaturation. We attribute the nonstationarity of citation distributions to\ndifferent longevity of the low-cited and highly-cited papers. By measuring\ncitation trajectories of papers we found that citation careers of the low-cited\npapers come to saturation after 10-15 years while those of the highly-cited\npapers continue to increase indefinitely: the papers that exceed some citation\nthreshold become runaways. Thus, we show that although citation distribution\ncan look as a power-law, it is not scale-free and there is a hidden dynamic\nscale associated with the onset of runaways. We compare our measurements to our\nrecently developed model of citation dynamics based on\ncopying/redirection/triadic closure and find explanations to our empirical\nobservations.\n", "versions": [{"version": "v1", "created": "Sun, 6 Aug 2017 08:05:23 GMT"}], "update_date": "2017-09-13", "authors_parsed": [["Golosovsky", "Michael", ""]]}, {"id": "1708.02214", "submitter": "Qing Ping", "authors": "Qing Ping, Chaomei Chen", "title": "LitStoryTeller: An Interactive System for Visual Exploration of\n  Scientific Papers Leveraging Named entities and Comparative Sentences", "comments": "Accepted at the 16th International Conference On Scientometrics &\n  Informetrics (ISSI 2017). Please include ISSI 2017 in any citations", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CL cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present study proposes LitStoryTeller, an interactive system for visually\nexploring the semantic structure of a scientific article. We demonstrate how\nLitStoryTeller could be used to answer some of the most fundamental research\nquestions, such as how a new method was built on top of existing methods, based\non what theoretical proof and experimental evidences. More importantly,\nLitStoryTeller can assist users to understand the full and interesting story a\nscientific paper, with a concise outline and important details. The proposed\nsystem borrows a metaphor from screen play, and visualizes the storyline of a\nscientific paper by arranging its characters (scientific concepts or\nterminologies) and scenes (paragraphs/sentences) into a progressive and\ninteractive storyline. Such storylines help to preserve the semantic structure\nand logical thinking process of a scientific paper. Semantic structures, such\nas scientific concepts and comparative sentences, are extracted using existing\nnamed entity recognition APIs and supervised classifiers, from a scientific\npaper automatically. Two supplementary views, ranked entity frequency view and\nentity co-occurrence network view, are provided to help users identify the\n\"main plot\" of such scientific storylines. When collective documents are ready,\nLitStoryTeller also provides a temporal entity evolution view and entity\ncommunity view for collection digestion.\n", "versions": [{"version": "v1", "created": "Mon, 7 Aug 2017 17:32:56 GMT"}, {"version": "v2", "created": "Fri, 8 Sep 2017 19:04:17 GMT"}, {"version": "v3", "created": "Tue, 12 Sep 2017 14:06:54 GMT"}], "update_date": "2017-09-13", "authors_parsed": [["Ping", "Qing", ""], ["Chen", "Chaomei", ""]]}, {"id": "1708.03889", "submitter": "Sven Hug", "authors": "Lutz Bornmann, Robin Haunschild, Sven E. Hug", "title": "Visualizing the context of citations referencing papers published by\n  Eugene Garfield: A new type of keyword co-occurrence analysis", "comments": null, "journal-ref": null, "doi": "10.1007/s11192-017-2591-8", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During Eugene Garfield's (EG's) lengthy career as information scientist, he\npublished about 1,500 papers. In this study, we use the impressive oeuvre of EG\nto introduce a new type of bibliometric networks: keyword co-occurrences\nnetworks based on the context of citations, which are referenced in a certain\npaper set (here: the papers published by EG). The citation context is defined\nby the words which are located around a specific citation. We retrieved the\ncitation context from Microsoft Academic. To interpret and compare the results\nof the new network type, we generated two further networks: co-occurrence\nnetworks which are based on title and abstract keywords from (1) EG's papers\nand (2) the papers citing EG's publications. The comparison of the three\nnetworks suggests that papers of EG and citation contexts of papers citing EG\nare semantically more closely related to each other than to titles and\nabstracts of papers citing EG. This result accords with the use of citations in\nresearch evaluation that is based on the premise that citations reflect the\ncognitive influence of the cited on the citing publication.\n", "versions": [{"version": "v1", "created": "Sun, 13 Aug 2017 11:16:28 GMT"}], "update_date": "2019-08-06", "authors_parsed": [["Bornmann", "Lutz", ""], ["Haunschild", "Robin", ""], ["Hug", "Sven E.", ""]]}, {"id": "1708.03986", "submitter": "Rong Gong", "authors": "Rong Gong, Rafael Caro Repetto, Xavier Serra", "title": "Creating an A Cappella Singing Audio Dataset for Automatic Jingju\n  Singing Evaluation Research", "comments": "4th International Digital Libraries for Musicology workshop (DLfM\n  2017), Shanghai, China", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SD cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The data-driven computational research on automatic jingju (also known as\nBeijing or Peking opera) singing evaluation lacks a suitable and comprehensive\na cappella singing audio dataset. In this work, we present an a cappella\nsinging audio dataset which consists of 120 arias, accounting for 1265 melodic\nlines. This dataset is also an extension our existing CompMusic jingju corpus.\nBoth professional and amateur singers were invited to the dataset recording\nsessions, and the most common jingju musical elements have been covered. This\ndataset is also accompanied by metadata per aria and melodic line annotated for\nautomatic singing evaluation research purpose. All the gathered data is openly\navailable online.\n", "versions": [{"version": "v1", "created": "Mon, 14 Aug 2017 01:43:13 GMT"}], "update_date": "2017-08-15", "authors_parsed": [["Gong", "Rong", ""], ["Repetto", "Rafael Caro", ""], ["Serra", "Xavier", ""]]}, {"id": "1708.04442", "submitter": "Robin Haunschild", "authors": "Lutz Bornmann, Robin Haunschild, and Loet Leydesdorff", "title": "Reference Publication Year Spectroscopy (RPYS) of Eugene Garfield's\n  publications", "comments": "16 pages, 3 tables, and 3 figures", "journal-ref": null, "doi": "10.1007/s11192-017-2608-3", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Which studies, theories, and ideas have influenced Eugene Garfield's\nscientific work? Recently, the method reference publication year spectroscopy\n(RPYS) has been introduced, which can be used to answer this and related\nquestions. Since then, several studies have been published dealing with the\nhistorical roots of research fields and scientists. The program CRExplorer\n(http://www.crexplorer.net) was specifically developed for RPYS. In this study,\nwe use this program to investigate the historical roots of Eugene Garfield's\noeuvre.\n", "versions": [{"version": "v1", "created": "Tue, 15 Aug 2017 09:15:24 GMT"}], "update_date": "2017-12-08", "authors_parsed": [["Bornmann", "Lutz", ""], ["Haunschild", "Robin", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "1708.05435", "submitter": "Slobodan Vucetic", "authors": "Slobodan Vucetic, Ashis Kumar Chanda, Shanshan Zhang, Tian Bai,\n  Aniruddha Maiti", "title": "Faculty citation measures are highly correlated with peer assessment of\n  computer science doctoral programs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study relationship between peer assessment of quality of U.S. Computer\nScience (CS) doctoral programs and objective measures of research strength of\nthose programs. In Fall 2016 we collected Google Scholar citation data for\n4,352 tenure-track CS faculty from 173 U.S. universities. The citations are\nmeasured by the t10 index, which represents the number of citations received by\nthe 10th highest cited paper of a faculty. To measure the research strength of\na CS doctoral program we use 2 groups of citation measures. The first group of\nmeasures averages t10 of faculty in a program. Pearson correlation of those\nmeasures with the peer assessment of U.S. CS doctoral programs published by the\nU.S. News in 2014 is as high as 0.890. The second group of measures counts the\nnumber of well cited faculty in a program. Pearson correlation of those\nmeasures with the peer assessment is as high as 0.909. By combining those two\ngroups of measures using linear regression, we create the Scholar score whose\nPearson correlation with the peer assessment is 0.933 and which explains 87.2%\nof the variance in the peer assessment. Our evaluation shows that the highest\n62 ranked CS doctoral programs by the U.S. News peer assessment are much higher\ncorrelated with the Scholar score than the next 57 ranked programs, indicating\nthe deficiencies of peer assessment of less-known CS programs. Our results also\nindicate that university reputation might have a sizeable impact on peer\nassessment of CS doctoral programs. To promote transparency, the raw data and\nthe codes used in this study are made available to research community at\nhttp://www.dabi.temple.edu/~vucetic/CSranking/.\n", "versions": [{"version": "v1", "created": "Thu, 17 Aug 2017 20:46:28 GMT"}], "update_date": "2017-08-21", "authors_parsed": [["Vucetic", "Slobodan", ""], ["Chanda", "Ashis Kumar", ""], ["Zhang", "Shanshan", ""], ["Bai", "Tian", ""], ["Maiti", "Aniruddha", ""]]}, {"id": "1708.05790", "submitter": "Corren McCoy", "authors": "Corren G. McCoy, Michael L. Nelson, Michele C. Weigle", "title": "University Twitter Engagement: Using Twitter Followers to Rank\n  Universities", "comments": "14 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine and rank a set of 264 U.S. universities extracted from the\nNational Collegiate Athletic Association (NCAA) Division I membership and\nglobal lists published in U.S. News, Times Higher Education, Academic Ranking\nof World Universities, and Money Magazine. Our University Twitter Engagement\n(UTE) rank is based on the friend and extended follower network of primary and\naffiliated secondary Twitter accounts referenced on a university's home page.\nIn rank-to-rank comparisons we observed a significant, positive rank\ncorrelation ({\\tau}=0.6018) between UTE and an aggregate reputation ranking\nwhich indicates that UTE could be a viable proxy for ranking atypical\ninstitutions normally excluded from traditional lists. In addition, we\nsignificantly reduce the cost of data collection needed to rank each\ninstitution by using only web-based artifacts and a publicly accessible Twitter\napplication programming interface (API).\n", "versions": [{"version": "v1", "created": "Sat, 19 Aug 2017 01:33:28 GMT"}], "update_date": "2017-08-22", "authors_parsed": [["McCoy", "Corren G.", ""], ["Nelson", "Michael L.", ""], ["Weigle", "Michele C.", ""]]}, {"id": "1708.05872", "submitter": "Muaz Niazi", "authors": "Muaz A. Niazi, Amir Hussain", "title": "Agent-based computing from multi-agent systems to agent-based Models: a\n  visual survey", "comments": "30 pages, 11 figures, 9 tables", "journal-ref": "Scientometrics 89.2 (2011): 479", "doi": "10.1007/s11192-011-0468-9", "report-no": null, "categories": "cs.SI cs.AI cs.DL cs.MA nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agent-Based Computing is a diverse research domain concerned with the\nbuilding of intelligent software based on the concept of \"agents\". In this\npaper, we use Scientometric analysis to analyze all sub-domains of agent-based\ncomputing. Our data consists of 1,064 journal articles indexed in the ISI web\nof knowledge published during a twenty year period: 1990-2010. These were\nretrieved using a topic search with various keywords commonly used in\nsub-domains of agent-based computing. In our proposed approach, we have\nemployed a combination of two applications for analysis, namely Network\nWorkbench and CiteSpace - wherein Network Workbench allowed for the analysis of\ncomplex network aspects of the domain, detailed visualization-based analysis of\nthe bibliographic data was performed using CiteSpace. Our results include the\nidentification of the largest cluster based on keywords, the timeline of\npublication of index terms, the core journals and key subject categories. We\nalso identify the core authors, top countries of origin of the manuscripts\nalong with core research institutes. Finally, our results have interestingly\nrevealed the strong presence of agent-based computing in a number of\nnon-computing related scientific domains including Life Sciences, Ecological\nSciences and Social Sciences.\n", "versions": [{"version": "v1", "created": "Sat, 19 Aug 2017 16:35:04 GMT"}], "update_date": "2017-08-22", "authors_parsed": [["Niazi", "Muaz A.", ""], ["Hussain", "Amir", ""]]}, {"id": "1708.06242", "submitter": "Pablo Dorta-Gonzalez", "authors": "Pablo Dorta-Gonz\\'alez, Yolanda Santana-Jim\\'enez", "title": "Prevalence and citation advantage of gold open access in the subject\n  areas of the Scopus database", "comments": "32 pages, 2 figures, 7 tables, 3 annex", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The potential benefit of open access (OA) in relation to citation impact has\nbeen discussed in the literature in depth. The methodology used to test the OA\ncitation advantage includes comparing OA vs. non-OA journal impact factors and\ncitations of OA versus non-OA articles published in the same non-OA journals.\nHowever, one problem with many studies is that they are small -restricted to a\ndiscipline or set of journals-. Moreover, conclusions are not entirely\nconsistent among research areas and 'early view' and 'selection bias' have been\nsuggested as possible explications. In the present paper, an analysis of gold\nOA from across all areas of research -the 27 subject areas of the Scopus\ndatabase- is realized. As a novel contribution, this paper takes a\njournal-level approach to assessing the OA citation advantage, whereas many\nothers take a paper-level approach. Data were obtained from Scimago Lab, sorted\nusing Scopus database, and tagged as OA/non-OA using the DOAJ list. Jointly\nwith the OA citation advantage, the OA prevalence as well as the differences\nbetween access types (OA vs. non-OA) in production and referencing are tested.\nA total of 3,737 OA journals (16.8%) and 18,485 non-OA journals (83.2%)\npublished in 2015 are considered. As the main conclusion, there is no\ngeneralizable gold OA citation advantage at journal level.\n", "versions": [{"version": "v1", "created": "Mon, 21 Aug 2017 14:18:40 GMT"}, {"version": "v2", "created": "Mon, 11 Sep 2017 11:34:51 GMT"}], "update_date": "2017-09-12", "authors_parsed": [["Dorta-González", "Pablo", ""], ["Santana-Jiménez", "Yolanda", ""]]}, {"id": "1708.06524", "submitter": "Muaz Niazi", "authors": "Amir Hussain, Muaz A. Niazi", "title": "Towards a Formal, Visual Framework of Emergent Cognitive Development of\n  Scholars", "comments": "24 pages, 8 figures", "journal-ref": "Cognitive Computation 6.1 (2014): 113-124", "doi": "10.1007/s12559-013-9219-y", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the cognitive evolution of researchers as they progress in the\nacademia is an important but complex problem, a problem belonging to a class of\nproblems, which often require the development of models for gaining further\nunderstanding in the intricacies of the domain. The research question that we\naddress in this paper is how to effectively model this temporal cognitive\nmental development of prolific researchers. Our proposed solution to this\nproblem is based on noting that the academic progression and notability of a\nresearcher are linked with a progressive increase in the citation count for the\nscholar's refereed publications quantified using indices such as the Hirsch\nindex. In other words, we propose the use of yearly cognitive increment of a\nscholar's cognition to be quantifiable using a function of the scholar's\ncitation index, thereby considering the index as an indicator of the discrete\napproximation of the scholar's cognitive development. Using validated\nagent-based modeling, a paradigm presented as part of our previous work i.e.\nCognitive Agent-based Computing framework, we present both formal as well as\nvisual agent-based complex network representations for this cognitive evolution\nin the form of a Temporal Cognitive Level Network (TCLN) model. As a proof of\nthe effectiveness of this approach, we demonstrate validation of the model\nusing historic data of citations.\n", "versions": [{"version": "v1", "created": "Tue, 22 Aug 2017 07:47:12 GMT"}], "update_date": "2017-08-23", "authors_parsed": [["Hussain", "Amir", ""], ["Niazi", "Muaz A.", ""]]}, {"id": "1708.07890", "submitter": "Chrisovaladis Malesios", "authors": "Chrisovalantis Malesios", "title": "Some variations on the standard theoretical models for the h-index: A\n  comparative analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are various mathematical models proposed in the recent literature for\nestimating the h-index through bibliometric measures, such as number of\narticles (P) and citations received (C). These models have been previously\nempirically tested assuming a mathematical model and predetermining the models\nparameter values at some fixed constant. Here, by adopting a statistical\nmodelling view I investigate alternative distributions commonly used for this\ntype of point data. I also show that the typical assumptions for the parameters\nof the h-index mathematical models in such representations are not always\nrealistic, with more suitable specifications being favorable. Prediction of the\nhindex is also demonstrated.\n", "versions": [{"version": "v1", "created": "Fri, 25 Aug 2017 21:14:54 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Malesios", "Chrisovalantis", ""]]}, {"id": "1708.07893", "submitter": "Chrisovaladis Malesios", "authors": "C. Malesios and S. Psarakis", "title": "Comparison of the h-index for Different Fields of Research Using\n  Bootstrap Methodology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important disadvantage of the h-index is that typically it cannot take\ninto account the specific field of research of a researcher. Usually sample\npoint estimates of the average and median h-index values for the various fields\nare reported that are highly variable and dependent of the specific samples and\nit would be useful to provide confidence intervals of prediction accuracy. In\nthis paper we apply the non-parametric bootstrap technique for constructing\nconfidence intervals for the h-index for different fields of research. In this\nway no specific assumptions about the distribution of the empirical hindex are\nrequired as well as no large samples since that the methodology is based on\nresampling from the initial sample. The results of the analysis showed\nimportant differences between the various fields. The performance of the\nbootstrap intervals for the mean and median h-index for most fields seems to be\nrather satisfactory as revealed by the performed simulation.\n", "versions": [{"version": "v1", "created": "Fri, 25 Aug 2017 21:24:09 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Malesios", "C.", ""], ["Psarakis", "S.", ""]]}, {"id": "1708.08063", "submitter": "Abhisek Ukil", "authors": "Abhisek Ukil", "title": "Carnot Efficiency of Publication", "comments": "2 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes publication efficiency in terms of Hirsch-index or\nh-index and total citations, with an analogy to the Carnot efficiency used in\nthermodynamics. Such publication efficiency, with typical value of 30%, can be\nutilized to normalize the research output judgment, favoring quality outputs in\nreduced quantity, which is currently lacking in many discipline.\n", "versions": [{"version": "v1", "created": "Sun, 27 Aug 2017 08:13:06 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Ukil", "Abhisek", ""]]}, {"id": "1708.08138", "submitter": "Chrisovaladis Malesios", "authors": "M. Schreiber, C.C. Malesios, and S. Psarakis", "title": "Categorizing Hirsch Index Variants", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Utilizing the Hirsch index h and some of its variants for an exploratory\nfactor analysis we discuss whether one of the most important Hirsch-type\nindices, namely the g-index comprises information about not only the size of\nthe productive core but also the impact of the papers in the core. We also\nstudy the effect of logarithmic and square-root transformation of the data\nutilized in the factor analysis. To demonstrate our approach we use a real data\nexample analysing the citation records of 26 physicists compiled from the Web\nof Science.\n", "versions": [{"version": "v1", "created": "Sun, 27 Aug 2017 20:59:26 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Schreiber", "M.", ""], ["Malesios", "C. C.", ""], ["Psarakis", "S.", ""]]}, {"id": "1708.08335", "submitter": "Ulrich Z\\\"ulicke", "authors": "K. W. Higham, M. Governale, A. B. Jaffe, U. Z\\\"ulicke", "title": "Unraveling the dynamics of growth, aging and inflation for citations to\n  scientific articles from specific research fields", "comments": "13 pages, 6 figures, Elsevier style, v2: revised version to appear in\n  J. Informetrics", "journal-ref": "Journal of Informetrics 11, 1190 (2017)", "doi": "10.1016/j.joi.2017.10.004", "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the time evolution of citations acquired by articles from journals\nof the American Physical Society (PRA, PRB, PRC, PRD, PRE and PRL). The\nobserved change over time in the number of papers published in each journal is\nconsidered an exogenously caused variation in citability that is accounted for\nby a normalization. The appropriately inflation-adjusted citation rates are\nfound to be separable into a preferential-attachment-type growth kernel and a\npurely obsolescence-related (i.e., monotonously decreasing as a function of\ntime since publication) aging function. Variations in the empirically extracted\nparameters of the growth kernels and aging functions associated with different\njournals point to research-field-specific characteristics of citation intensity\nand knowledge flow. Comparison with analogous results for the citation dynamics\nof technology-disaggregated cohorts of patents provides deeper insight into the\nbasic principles of information propagation as indicated by citing behavior.\n", "versions": [{"version": "v1", "created": "Fri, 18 Aug 2017 05:38:40 GMT"}, {"version": "v2", "created": "Mon, 16 Oct 2017 08:39:44 GMT"}], "update_date": "2017-11-06", "authors_parsed": [["Higham", "K. W.", ""], ["Governale", "M.", ""], ["Jaffe", "A. B.", ""], ["Zülicke", "U.", ""]]}, {"id": "1708.08423", "submitter": "Robert B. Allen", "authors": "Robert B. Allen", "title": "Rich Semantic Models and Knowledgebases for Highly-Structured Scientific\n  Communication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rather than using text for scientific research reports, we have proposed\ndeveloping highly-structured reports with rich semantic models. In this paper,\nwe consider detailed structures for the components of research reports using a\nmodeling framework based on a rigorous upper ontology. For instance, we\nconsider the use of structured descriptions of Research Designs to support\nevaluation of internal and external validity. In addition, collections of\nhighly-structured scientific research reports would be the key component of a\nset of evolving and interlocking highly-structured scientific knowledgebases.\n", "versions": [{"version": "v1", "created": "Mon, 28 Aug 2017 17:10:16 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Allen", "Robert B.", ""]]}, {"id": "1708.08446", "submitter": "Suzanne Dumouchel", "authors": "Suzanne Dumouchel (Huma-Num)", "title": "How the notion of ACCESS guides the organization of a European research\n  infrastructure: the example of DARIAH", "comments": null, "journal-ref": "Digital Humanities 2017, Aug 2017, Montr\\'eal, Canada", "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This contribution will show how Access play a strong role in the creation and\nstructuring of DARIAH, a European Digital Research Infrastructure in Arts and\nHumanities.To achieve this goal, this contribution will develop the concept of\nAccess from five examples: Interdisciplinarity point of view, Manage\ncontradiction between national and international perspectives, Involve\ndifferent communities (not only researchers stakeholders), Manage tools and\nservices, Develop and use new collaboration tools. We would like to demonstrate\nthat speaking about Access always implies a selection, a choice, even in the\nperspective of \"Open Access\".\n", "versions": [{"version": "v1", "created": "Mon, 28 Aug 2017 07:47:35 GMT"}], "update_date": "2017-08-30", "authors_parsed": [["Dumouchel", "Suzanne", "", "Huma-Num"]]}, {"id": "1708.08669", "submitter": "Arnaud Gaudinat", "authors": "Arnaud Gaudinat, Jonas Beausire, Megan Fuss, Elisa Banfi, Julien\n  Gobeill, Patrick Ruch", "title": "Global picture of OAI-PMH repositories through the analysis of 6 key\n  open archive meta-catalogs", "comments": "22 pages, 7 tables, 9 figures, submission process", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By the end of the late 90's the Open Archives Initiative needed direction to\ninsure its improvement and thus, created the Open Archives Initiative Protocol\nfor Metadata Harvesting (OAI-PMH) standard. The movement showed a rise in\npopularity, followed by a decline then a relative stabilization. This process\nwas essentially a way to ensure the viability of open archive repositories.\nHowever, a meta-catalog containing an ensemble of repositories was never\nestablished, which lead to confusion of what could be found in said catalogs.\n  This study ultimately aims to find out what repository content can be found\nand where with the use of the 6 key meta-catalogs. Although they undoubtedly\nhave numerous limitations pertaining to the available data, this article seeks\nto compare the common data in each meta-catalog and estimates which\nrepositories are found within them (with approx. less than 1% in common within\nthe 6 meta-catalog).\n  Decisively, this paper identifies the need to collate this data (with a total\nof 42.3% OAI-PMH repositories specific to each meta-catalog) and improve\ncurrent search tools, hence portraying the benefits of a comprehensible single\nunifying meta-catalog for end users.\n", "versions": [{"version": "v1", "created": "Tue, 29 Aug 2017 09:54:17 GMT"}], "update_date": "2017-08-30", "authors_parsed": [["Gaudinat", "Arnaud", ""], ["Beausire", "Jonas", ""], ["Fuss", "Megan", ""], ["Banfi", "Elisa", ""], ["Gobeill", "Julien", ""], ["Ruch", "Patrick", ""]]}, {"id": "1708.09193", "submitter": "Tobias Kuhn", "authors": "Tobias Kuhn, Egon Willighagen, Chris Evelo, N\\'uria Queralt-Rosinach,\n  Emilio Centeno and Laura I. Furlong", "title": "Reliable Granular References to Changing Linked Data", "comments": "In Proceedings of the 16th International Semantic Web Conference\n  (ISWC) 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Nanopublications are a concept to represent Linked Data in a granular and\nprovenance-aware manner, which has been successfully applied to a number of\nscientific datasets. We demonstrated in previous work how we can establish\nreliable and verifiable identifiers for nanopublications and sets thereof.\nFurther adoption of these techniques, however, was probably hindered by the\nfact that nanopublications can lead to an explosion in the number of triples\ndue to auxiliary information about the structure of each nanopublication and\nrepetitive provenance and metadata. We demonstrate here that this significant\noverhead disappears once we take the version history of nanopublication\ndatasets into account, calculate incremental updates, and allow users to deal\nwith the specific subsets they need. We show that the total size and overhead\nof evolving scientific datasets is reduced, and typical subsets that\nresearchers use for their analyses can be referenced and retrieved efficiently\nwith optimized precision, persistence, and reliability.\n", "versions": [{"version": "v1", "created": "Wed, 30 Aug 2017 09:30:54 GMT"}], "update_date": "2017-08-31", "authors_parsed": [["Kuhn", "Tobias", ""], ["Willighagen", "Egon", ""], ["Evelo", "Chris", ""], ["Queralt-Rosinach", "Núria", ""], ["Centeno", "Emilio", ""], ["Furlong", "Laura I.", ""]]}, {"id": "1708.09326", "submitter": "Peter Stockinger", "authors": "Peter Stockinger (PLIDAM EA 4514, Inalco, ESCOM)", "title": "The PCI Ontology", "comments": null, "journal-ref": null, "doi": "10.13140/2.1.1180.5129", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, an ontology for the description and indexing of the contents\nof audiovisual resources will be presented. The concerned domain of reference\n(or: knowledge domain) is the cultural heritage of minorities and indigenous\npeople, hence the name or title of this ontology, PCI ontology (standing for\nthe French \"Patrimoine Culturel de Minorit\\'es et Peuples Indig\\`enes\").\n", "versions": [{"version": "v1", "created": "Wed, 26 Jul 2017 11:09:01 GMT"}], "update_date": "2017-08-31", "authors_parsed": [["Stockinger", "Peter", "", "PLIDAM EA 4514, Inalco, ESCOM"]]}, {"id": "1708.09734", "submitter": "Muaz Niazi", "authors": "Kamran Farooq, Bisma S Khan, Muaz A Niazi, Stephen J Leslie, Amir\n  Hussain", "title": "Clinical Decision Support Systems: A Visual Survey", "comments": "27 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Clinical Decision Support Systems (CDSS) form an important area of research.\nIn spite of its importance, it is difficult for researchers to evaluate the\ndomain primarily because of a considerable spread of relevant literature in\ninterdisciplinary domains. Previous surveys of CDSS have examined the domain\nfrom the perspective of individual disciplines. However, to the best of our\nknowledge, no visual scientometric survey of CDSS has previously been conducted\nwhich provides a broader spectrum of the domain with a horizon covering\nmultiple disciplines. While traditional systematic literature surveys focus on\nanalyzing literature using arbitrary results, visual surveys allow for the\nanalysis of domains by using complex network-based analytical models. In this\npaper, we present a detailed visual survey of CDSS literature using important\npapers selected from highly cited sources in the Thomson Reuters web of\nscience. We analyze the entire set of relevant literature indexed in the Web of\nScience database. Our key results include the discovery of the articles which\nhave served as key turning points in literature. Additionally, we have\nidentified highly cited authors and the key country of origin of top\npublications. We also present the Universities with the strongest citation\nbursts. Finally, our network analysis has also identified the key journals and\nsubject categories both in terms of centrality and frequency. It is our belief\nthat this paper will thus serve as an important role for researchers as well as\nclinical practitioners interested in identifying key literature and resources\nin the domain of clinical decision support.\n", "versions": [{"version": "v1", "created": "Sun, 20 Aug 2017 03:38:35 GMT"}], "update_date": "2017-09-01", "authors_parsed": [["Farooq", "Kamran", ""], ["Khan", "Bisma S", ""], ["Niazi", "Muaz A", ""], ["Leslie", "Stephen J", ""], ["Hussain", "Amir", ""]]}, {"id": "1708.09794", "submitter": "Nihar Shah", "authors": "Nihar B. Shah, Behzad Tabibian, Krikamol Muandet, Isabelle Guyon,\n  Ulrike von Luxburg", "title": "Design and Analysis of the NIPS 2016 Review Process", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.LG cs.SI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural Information Processing Systems (NIPS) is a top-tier annual conference\nin machine learning. The 2016 edition of the conference comprised more than\n2,400 paper submissions, 3,000 reviewers, and 8,000 attendees. This represents\na growth of nearly 40% in terms of submissions, 96% in terms of reviewers, and\nover 100% in terms of attendees as compared to the previous year. The massive\nscale as well as rapid growth of the conference calls for a thorough quality\nassessment of the peer-review process and novel means of improvement. In this\npaper, we analyze several aspects of the data collected during the review\nprocess, including an experiment investigating the efficacy of collecting\nordinal rankings from reviewers. Our goal is to check the soundness of the\nreview process, and provide insights that may be useful in the design of the\nreview process of subsequent conferences.\n", "versions": [{"version": "v1", "created": "Thu, 31 Aug 2017 16:09:33 GMT"}, {"version": "v2", "created": "Mon, 23 Apr 2018 18:22:09 GMT"}], "update_date": "2018-04-25", "authors_parsed": [["Shah", "Nihar B.", ""], ["Tabibian", "Behzad", ""], ["Muandet", "Krikamol", ""], ["Guyon", "Isabelle", ""], ["von Luxburg", "Ulrike", ""]]}]