[{"id": "1204.0163", "submitter": "Zhigang Cao", "authors": "Zhigang Cao, Haoyu Gao, Xinglong Qu, Mingmin Yang, Xiaoguang Yang", "title": "Fashion, Cooperation, and Social Interactions", "comments": "21 pages, 12 figures", "journal-ref": "PLoS ONE 8(1): e49441. 2013", "doi": "10.1371/journal.pone.0049441", "report-no": null, "categories": "cs.MA cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fashion plays such a crucial rule in the evolution of culture and society\nthat it is regarded as a second nature to the human being. Also, its impact on\neconomy is quite nontrivial. On what is fashionable, interestingly, there are\ntwo viewpoints that are both extremely widespread but almost opposite:\nconformists think that what is popular is fashionable, while rebels believe\nthat being different is the essence. Fashion color is fashionable in the first\nsense, and Lady Gaga in the second. We investigate a model where the population\nconsists of the afore-mentioned two groups of people that are located on social\nnetworks (a spatial cellular automata network and small-world networks). This\nmodel captures two fundamental kinds of social interactions (coordination and\nanti-coordination) simultaneously, and also has its own interest to game\ntheory: it is a hybrid model of pure competition and pure cooperation. This is\ntrue because when a conformist meets a rebel, they play the zero sum matching\npennies game, which is pure competition. When two conformists (rebels) meet,\nthey play the (anti-) coordination game, which is pure cooperation. Simulation\nshows that simple social interactions greatly promote cooperation: in most\ncases people can reach an extraordinarily high level of cooperation, through a\nselfish, myopic, naive, and local interacting dynamic (the best response\ndynamic). We find that degree of synchronization also plays a critical role,\nbut mostly on the negative side. Four indices, namely cooperation degree,\naverage satisfaction degree, equilibrium ratio and complete ratio, are defined\nand applied to measure people's cooperation levels from various angles. Phase\ntransition, as well as emergence of many interesting geographic patterns in the\ncellular automata network, is also observed.\n", "versions": [{"version": "v1", "created": "Sun, 1 Apr 2012 04:40:26 GMT"}, {"version": "v2", "created": "Sun, 29 Apr 2012 05:42:23 GMT"}, {"version": "v3", "created": "Thu, 18 Oct 2012 23:33:06 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Cao", "Zhigang", ""], ["Gao", "Haoyu", ""], ["Qu", "Xinglong", ""], ["Yang", "Mingmin", ""], ["Yang", "Xiaoguang", ""]]}, {"id": "1204.0168", "submitter": "Wen Dong", "authors": "Wen Dong, Katherine A. Heller and Alex Sandy Pentland", "title": "Modeling Infection with Multi-agent Dynamics", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-642-29047-3_21", "report-no": null, "categories": "stat.AP cs.MA cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Developing the ability to comprehensively study infections in small\npopulations enables us to improve epidemic models and better advise individuals\nabout potential risks to their health. We currently have a limited\nunderstanding of how infections spread within a small population because it has\nbeen difficult to closely track an infection within a complete community. The\npaper presents data closely tracking the spread of an infection centered on a\nstudent dormitory, collected by leveraging the residents' use of cellular\nphones. The data are based on daily symptom surveys taken over a period of four\nmonths and proximity tracking through cellular phones. We demonstrate that\nusing a Bayesian, discrete-time multi-agent model of infection to model\nreal-world symptom reports and proximity tracking records gives us important\ninsights about infec-tions in small populations.\n", "versions": [{"version": "v1", "created": "Sun, 1 Apr 2012 05:24:32 GMT"}, {"version": "v2", "created": "Sat, 11 Oct 2014 13:44:06 GMT"}], "update_date": "2014-10-14", "authors_parsed": [["Dong", "Wen", ""], ["Heller", "Katherine A.", ""], ["Pentland", "Alex Sandy", ""]]}, {"id": "1204.0634", "submitter": "Gildas Morvan", "authors": "Gildas Morvan and Daniel Jolly", "title": "Multi-level agent-based modeling with the Influence Reaction principle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the specification and the implementation of multi-level\nagent-based models, using a formal model, IRM4MLS (an Influence Reaction Model\nfor Multi-Level Simulation), based on the Influence Reaction principle.\nProposed examples illustrate forms of top-down control in (multi-level)\nmulti-agent based-simulations.\n", "versions": [{"version": "v1", "created": "Tue, 3 Apr 2012 09:27:26 GMT"}], "update_date": "2012-04-04", "authors_parsed": [["Morvan", "Gildas", ""], ["Jolly", "Daniel", ""]]}, {"id": "1204.1581", "submitter": "Sara Maalal Mrs", "authors": "Sara Maalal and Malika Addou", "title": "A new approach of designing Multi-Agent Systems", "comments": "10 pages, 12 figures, A practical application of a method of\n  designing multi-agent systems based on the AUML language and the MDA approach\n  at \"the 4th IEEE Workshop on Information Technologies and Communication\n  (WOTIC'11)\", Casablanca, 13 - 15 October 2011, International Journal of\n  Advanced Computer Science and Applications(IJACSA) Volume 2 No. 11 November\n  2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agent technology is a software paradigm that permits to implement large and\ncomplex distributed applications. In order to assist analyzing, conception and\ndevelopment or implementation phases of multi-agent systems, we've tried to\npresent a practical application of a generic and scalable method of a MAS with\na component-oriented architecture and agent-based approach that allows MDA to\ngenerate source code from a given model. We've designed on AUML the class\ndiagrams as a class meta-model of different agents of a MAS. Then we generated\nthe source code of the models developed using an open source tool called\nAndroMDA. This agent-based and evolutive approach enhances the modularity and\ngenericity developments and promotes their reusability in future developments.\nThis property distinguishes our design methodology of existing methodologies in\nthat it is constrained by any particular agent-based model while providing a\nlibrary of generic models\n", "versions": [{"version": "v1", "created": "Sat, 7 Apr 2012 00:10:33 GMT"}], "update_date": "2012-04-10", "authors_parsed": [["Maalal", "Sara", ""], ["Addou", "Malika", ""]]}, {"id": "1204.3495", "submitter": "Piotr Ka\\'zmierczak", "authors": "Sjur Dyrkolbotn, Piotr Ka\\'zmierczak, Erik Parmann and Truls Pedersen", "title": "No big deal: introducing roles to reduce the size of ATL models", "comments": "Accepted for presentation at LAMAS 2012 workshop on June 5, 2012 in\n  Valencia, Spain", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the following paper we present a new semantics for the well-known\nstrategic logic ATL. It is based on adding roles to concurrent game structures,\nthat is at every state, each agent belongs to exactly one role, and the role\nspecifies what actions are available to him at that state. We show advantages\nof the new semantics, analyze model checking complexity and prove equivalence\nbetween standard ATL semantics and our new approach.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 14:21:50 GMT"}], "update_date": "2012-04-17", "authors_parsed": [["Dyrkolbotn", "Sjur", ""], ["Kaźmierczak", "Piotr", ""], ["Parmann", "Erik", ""], ["Pedersen", "Truls", ""]]}, {"id": "1204.3946", "submitter": "Bernard Chazelle", "authors": "Bernard Chazelle", "title": "The Dynamics of Influence Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO cs.MA cs.SI math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Influence systems form a large class of multiagent systems designed to model\nhow influence, broadly defined, spreads across a dynamic network. We build a\ngeneral analytical framework which we then use to prove that, while sometimes\nchaotic, influence dynamics of the diffusive kind is almost always\nasymptotically periodic. Besides resolving the dynamics of a popular family of\nmultiagent systems, the other contribution of this work is to introduce a new\ntype of renormalization-based bifurcation analysis for multiagent systems.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 23:55:45 GMT"}, {"version": "v2", "created": "Tue, 24 Jul 2012 00:45:31 GMT"}], "update_date": "2012-07-25", "authors_parsed": [["Chazelle", "Bernard", ""]]}, {"id": "1204.4116", "submitter": "Benjamin Kuipers", "authors": "Benjamin Kuipers", "title": "An existing, ecologically-successful genus of collectively intelligent\n  artificial creatures", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/57", "categories": "cs.SI cs.AI cs.MA physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  People sometimes worry about the Singularity [Vinge, 1993; Kurzweil, 2005],\nor about the world being taken over by artificially intelligent robots. I\nbelieve the risks of these are very small. However, few people recognize that\nwe already share our world with artificial creatures that participate as\nintelligent agents in our society: corporations. Our planet is inhabited by two\ndistinct kinds of intelligent beings --- individual humans and corporate\nentities --- whose natures and interests are intimately linked. To co-exist\nwell, we need to find ways to define the rights and responsibilities of both\nindividual humans and corporate entities, and to find ways to ensure that\ncorporate entities behave as responsible members of society.\n", "versions": [{"version": "v1", "created": "Wed, 18 Apr 2012 16:02:59 GMT"}], "update_date": "2012-04-19", "authors_parsed": [["Kuipers", "Benjamin", ""]]}, {"id": "1204.4427", "submitter": "Lotfi Bouzguenda", "authors": "Lotfi Bouzguenda, Manel Turki", "title": "Coupling Clinical Decision Support System with Computerized Prescriber\n  Order Entry and their Dynamic Plugging in the Medical Workflow System", "comments": "International Conference on Information Technology and e-services,\n  ICITeS'12, IEEE, March 24-26,Sousse-Tunisia, 2012", "journal-ref": null, "doi": "10.1109/ICITeS.2012.6216631", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work deals with coupling Clinical Decision Support System (CDSS) with\nComputerized Prescriber Order Entry (CPOE) and their dynamic plugging in the\nmedical Workflow Management System (WfMS). First, in this paper we argue some\nexisting CDSS representative of the state of the art in order to emphasize\ntheir inability to deal with coupling with CPOE and medical WfMS. The\nmulti-agent technology is at the basis of our proposition since (i) it provides\nnatural abstractions to deal with distribution, heterogeneity and autonomy\nwhich are inherent to the previous systems (CDSS, CPOE and medical WfMS), and\n(ii) it introduces powerful concepts such as organizations, goals and roles\nuseful to describe in details the coordination of the different components\ninvolved in these systems. In this paper, we also propose a Multi-Agent System\n(MAS) to support the coupling CDSS with CPOE. Finally, we show how we integrate\nthe proposed MAS in the medical workflow management system which is also based\non collaborating agents\n", "versions": [{"version": "v1", "created": "Thu, 19 Apr 2012 18:24:11 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Bouzguenda", "Lotfi", ""], ["Turki", "Manel", ""]]}, {"id": "1204.5213", "submitter": "Bart de Keijzer", "authors": "Bart de Keijzer and Tomas B. Klos and Yingqian Zhang", "title": "Solving Weighted Voting Game Design Problems Optimally: Representations,\n  Synthesis, and Enumeration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the inverse power index problem for weighted voting games: the\nproblem of finding a weighted voting game in which the power of the players is\nas close as possible to a certain target distribution. Our goal is to find\nalgorithms that solve this problem exactly. Thereto, we study various\nsubclasses of simple games, and their associated representation methods. We\nsurvey algorithms and impossibility results for the synthesis problem, i.e.,\nconverting a representation of a simple game into another representation.\n  We contribute to the synthesis problem by showing that it is impossible to\ncompute in polynomial time the list of ceiling coalitions (also known as\nshift-maximal losing coalitions) of a game from its list of roof coalitions\n(also known as shift-minimal winning coalitions), and vice versa.\n  Then, we proceed by studying the problem of enumerating the set of weighted\nvoting games. We present first a naive algorithm for this, running in doubly\nexponential time. Using our knowledge of the synthesis problem, we then improve\non this naive algorithm, and we obtain an enumeration algorithm that runs in\nquadratic exponential time (that is, O(2^(n^2) p(n)) for a polynomial p).\nMoreover, we show that this algorithm runs in output-polynomial time, making it\nthe best possible enumeration algorithm up to a polynomial factor.\n  Finally, we propose an exact anytime algorithm for the inverse power index\nproblem that runs in exponential time. This algorithm is straightforward and\ngeneral: it computes the error for each game enumerated, and outputs the game\nthat minimizes this error. By the genericity of our approach, our algorithm can\nbe used to find a weighted voting game that optimizes any exponential time\ncomputable function. We implement our algorithm for the case of the normalized\nBanzhaf index, and we perform experiments in order to study performance and\nerror convergence.\n", "versions": [{"version": "v1", "created": "Mon, 23 Apr 2012 21:35:00 GMT"}, {"version": "v2", "created": "Tue, 5 Jun 2012 14:57:18 GMT"}, {"version": "v3", "created": "Mon, 1 Jul 2013 11:58:03 GMT"}], "update_date": "2013-07-02", "authors_parsed": [["de Keijzer", "Bart", ""], ["Klos", "Tomas B.", ""], ["Zhang", "Yingqian", ""]]}, {"id": "1204.5399", "submitter": "Arthur Carvalho", "authors": "Arthur Carvalho and Kate Larson", "title": "A Consensual Linear Opinion Pool", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important question when eliciting opinions from experts is how to\naggregate the reported opinions. In this paper, we propose a pooling method to\naggregate expert opinions. Intuitively, it works as if the experts were\ncontinuously updating their opinions in order to accommodate the expertise of\nothers. Each updated opinion takes the form of a linear opinion pool, where the\nweight that an expert assigns to a peer's opinion is inversely related to the\ndistance between their opinions. In other words, experts are assumed to prefer\nopinions that are close to their own opinions. We prove that such an updating\nprocess leads to consensus, \\textit{i.e.}, the experts all converge towards the\nsame opinion. Further, we show that if rational experts are rewarded using the\nquadratic scoring rule, then the assumption that they prefer opinions that are\nclose to their own opinions follows naturally. We empirically demonstrate the\nefficacy of the proposed method using real-world data.\n", "versions": [{"version": "v1", "created": "Tue, 24 Apr 2012 15:12:34 GMT"}, {"version": "v2", "created": "Wed, 3 Apr 2013 23:57:08 GMT"}, {"version": "v3", "created": "Tue, 9 Apr 2013 21:49:06 GMT"}], "update_date": "2013-04-11", "authors_parsed": [["Carvalho", "Arthur", ""], ["Larson", "Kate", ""]]}, {"id": "1204.5780", "submitter": "Elliot Anshelevich", "authors": "Elliot Anshelevich, Onkar Bhardwaj, and Martin Hoefer", "title": "Friendship, Altruism, and Reward Sharing in Stable Matching and\n  Contribution Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study stable matching problems in networks where players are embedded in a\nsocial context, and may incorporate friendship relations or altruism into their\ndecisions. Each player is a node in a social network and strives to form a good\nmatch with a neighboring player. We consider the existence, computation, and\ninefficiency of stable matchings from which no pair of players wants to\ndeviate. When the benefits from a match are the same for both players, we show\nthat incorporating the well-being of other players into their matching\ndecisions significantly decreases the price of stability, while the price of\nanarchy remains unaffected. Furthermore, a good stable matching achieving the\nprice of stability bound always exists and can be reached in polynomial time.\nWe extend these results to more general matching rewards, when players matched\nto each other may receive different utilities from the match. For this more\ngeneral case, we show that incorporating social context (i.e., \"caring about\nyour friends\") can make an even larger difference, and greatly reduce the price\nof anarchy. We show a variety of existence results, and present upper and lower\nbounds on the prices of anarchy and stability for various matching utility\nstructures. Finally, we extend most of our results to network contribution\ngames, in which players can decide how much effort to contribute to each\nincident edge, instead of simply choosing a single node to match with.\n", "versions": [{"version": "v1", "created": "Wed, 25 Apr 2012 21:48:45 GMT"}], "update_date": "2012-04-27", "authors_parsed": [["Anshelevich", "Elliot", ""], ["Bhardwaj", "Onkar", ""], ["Hoefer", "Martin", ""]]}, {"id": "1204.5796", "submitter": "EPTCS", "authors": "Jeremy Bryans (Newcastle University), John Fitzgerald (Newcastle\n  University)", "title": "Proceedings Third Workshop on Formal Aspects of Virtual Organisations", "comments": null, "journal-ref": "EPTCS 83, 2012", "doi": "10.4204/EPTCS.83", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 3rd International Workshop on\nFormal Aspects of Virtual Organisations (FAVO 2011). The workshop was held in\nSao Paulo, Brazil on October 18th, 2011 as a satellite event to the 12th IFIP\nWorking Conference on Virtual Enterprises (PRO-VE'11). The FAVO workshop aims\nto provide a forum for researchers interested in the application of formal\ntechniques in the design and analysis of Virtual Organisations.\n", "versions": [{"version": "v1", "created": "Thu, 26 Apr 2012 00:16:19 GMT"}], "update_date": "2012-04-27", "authors_parsed": [["Bryans", "Jeremy", "", "Newcastle University"], ["Fitzgerald", "John", "", "Newcastle\n  University"]]}, {"id": "1204.6089", "submitter": "EPTCS", "authors": "Frank Hilbert (Institute of Construction Informatics Dresden\n  University of Technology Dresden, Germany), Raimar J. Scherer (Institute of\n  Construction Informatics Dresden University of Technology Dresden, Germany),\n  Larissa Araujo (Engineering School of Sao Carlos University of Sao Paulo Sao\n  Paulo, Brazil)", "title": "Multi-model-based Access Control in Construction Projects", "comments": "In Proceedings FAVO 2011, arXiv:1204.5796", "journal-ref": "EPTCS 83, 2012, pp. 1-9", "doi": "10.4204/EPTCS.83.1", "report-no": null, "categories": "cs.MA cs.CE cs.CY cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During the execution of large scale construction projects performed by\nVirtual Organizations (VO), relatively complex technical models have to be\nexchanged between the VO members. For linking the trade and transfer of these\nmodels, a so-called multi-model container format was developed. Considering the\ndifferent skills and tasks of the involved partners, it is not necessary for\nthem to know all the models in every technical detailing. Furthermore, the\nmodel size can lead to a delay in communication. In this paper an approach is\npresented for defining model cut-outs according to the current project context.\nDynamic dependencies to the project context as well as static dependencies on\nthe organizational structure are mapped in a context-sensitive rule. As a\nresult, an approach for dynamic filtering of multi-models is obtained which\nensures, together with a filtering service, that the involved VO members get a\nsimplified view of complex multi-models as well as sufficient permissions\ndepending on their tasks.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 00:34:00 GMT"}], "update_date": "2012-04-30", "authors_parsed": [["Hilbert", "Frank", "", "Institute of Construction Informatics Dresden\n  University of Technology Dresden, Germany"], ["Scherer", "Raimar J.", "", "Institute of\n  Construction Informatics Dresden University of Technology Dresden, Germany"], ["Araujo", "Larissa", "", "Engineering School of Sao Carlos University of Sao Paulo Sao\n  Paulo, Brazil"]]}, {"id": "1204.6090", "submitter": "EPTCS", "authors": "Sebastian Bab (TU Berlin), Nadim Sarrouh (TU Berlin)", "title": "Towards a Formal Model of Privacy-Sensitive Dynamic Coalitions", "comments": "In Proceedings FAVO 2011, arXiv:1204.5796", "journal-ref": "EPTCS 83, 2012, pp. 10-21", "doi": "10.4204/EPTCS.83.2", "report-no": null, "categories": "cs.MA cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of dynamic coalitions (also virtual organizations) describes the\ntemporary interconnection of autonomous agents, who share information or\nresources in order to achieve a common goal. Through modern technologies these\ncoalitions may form across company, organization and system borders. Therefor\nquestions of access control and security are of vital significance for the\narchitectures supporting these coalitions.\n  In this paper, we present our first steps to reach a formal framework for\nmodeling and verifying the design of privacy-sensitive dynamic coalition\ninfrastructures and their processes. In order to do so we extend existing\ndynamic coalition modeling approaches with an access-control-concept, which\nmanages access to information through policies. Furthermore we regard the\nprocesses underlying these coalitions and present first works in formalizing\nthese processes. As a result of the present paper we illustrate the usefulness\nof the Abstract State Machine (ASM) method for this task. We demonstrate a\nformal treatment of privacy-sensitive dynamic coalitions by two example ASMs\nwhich model certain access control situations. A logical consideration of these\nASMs can lead to a better understanding and a verification of the ASMs\naccording to the aspired specification.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 00:34:18 GMT"}], "update_date": "2012-04-30", "authors_parsed": [["Bab", "Sebastian", "", "TU Berlin"], ["Sarrouh", "Nadim", "", "TU Berlin"]]}, {"id": "1204.6091", "submitter": "EPTCS", "authors": "Stephan Reiff-Marganiec (University of Leicester)", "title": "A structured approach to VO reconfigurations through Policies", "comments": "In Proceedings FAVO 2011, arXiv:1204.5796", "journal-ref": "EPTCS 83, 2012, pp. 22-31", "doi": "10.4204/EPTCS.83.3", "report-no": null, "categories": "cs.MA cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the strength of Virtual Organisations is their ability to dynamically\nand rapidly adapt in response to changing environmental conditions. Dynamic\nadaptability has been studied in other system areas as well and system\nmanagement through policies has crystallized itself as a very prominent\nsolution in system and network administration. However, these areas are often\nconcerned with very low-level technical aspects. Previous work on the APPEL\npolicy language has been aimed at dynamically adapting system behaviour to\nsatisfy end-user demands and - as part of STPOWLA - APPEL was used to adapt\nworkflow instances at runtime. In this paper we explore how the ideas of APPEL\nand STPOWLA can be extended from workflows to the wider scope of Virtual\nOrganisations. We will use a Travel Booking VO as example.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 00:34:19 GMT"}], "update_date": "2012-04-30", "authors_parsed": [["Reiff-Marganiec", "Stephan", "", "University of Leicester"]]}, {"id": "1204.6552", "submitter": "Rajesh Chitnis", "authors": "Rajesh Chitnis, MohammadTaghi Hajiaghayi, Jonathan Katz, Koyel\n  Mukherjee", "title": "A Game-Theoretic Model Motivated by the DARPA Network Challenge", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a game-theoretic model to analyze events similar to\nthe 2009 \\emph{DARPA Network Challenge}, which was organized by the Defense\nAdvanced Research Projects Agency (DARPA) for exploring the roles that the\nInternet and social networks play in incentivizing wide-area collaborations.\nThe challenge was to form a group that would be the first to find the locations\nof ten moored weather balloons across the United States. We consider a model in\nwhich $N$ people (who can form groups) are located in some topology with a\nfixed coverage volume around each person's geographical location. We consider\nvarious topologies where the players can be located such as the Euclidean\n$d$-dimension space and the vertices of a graph. A balloon is placed in the\nspace and a group wins if it is the first one to report the location of the\nballoon. A larger team has a higher probability of finding the balloon, but we\nassume that the prize money is divided equally among the team members. Hence\nthere is a competing tension to keep teams as small as possible.\n  \\emph{Risk aversion} is the reluctance of a person to accept a bargain with\nan uncertain payoff rather than another bargain with a more certain, but\npossibly lower, expected payoff. In our model we consider the \\emph{isoelastic}\nutility function derived from the Arrow-Pratt measure of relative risk\naversion. The main aim is to analyze the structures of the groups in Nash\nequilibria for our model. For the $d$-dimensional Euclidean space ($d\\geq 1$)\nand the class of bounded degree regular graphs we show that in any Nash\nEquilibrium the \\emph{richest} group (having maximum expected utility per\nperson) covers a constant fraction of the total volume.\n", "versions": [{"version": "v1", "created": "Mon, 30 Apr 2012 05:38:46 GMT"}, {"version": "v2", "created": "Wed, 30 Jan 2013 05:02:06 GMT"}], "update_date": "2013-01-31", "authors_parsed": [["Chitnis", "Rajesh", ""], ["Hajiaghayi", "MohammadTaghi", ""], ["Katz", "Jonathan", ""], ["Mukherjee", "Koyel", ""]]}, {"id": "1204.6638", "submitter": "Jung-Hun Yang", "authors": "Jung-Hun Yang, Dick Ettema, Koen Frenken", "title": "Modelling the emergence of spatial patterns of economic activity", "comments": "Conference Proceeding in European Regional Science Association,\n  Liverpool, England, August, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.SI physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding how spatial configurations of economic activity emerge is\nimportant when formulating spatial planning and economic policy. A simple model\nwas proposed by Simon, who assumed that firms grow at a rate proportional to\ntheir size, and that new divisions of firms with certain probabilities relocate\nto other firms or to new centres of economic activity. Simon's model produces\nrealistic results in the sense that the sizes of economic centres follow a Zipf\ndistribution, which is also observed in reality. It lacks realism in the sense\nthat mechanisms such as cluster formation, congestion (defined as an overly\nhigh density of the same activities) and dependence on the spatial distribution\nof external parties (clients, labour markets) are ignored.\n  The present paper proposed an extension of the Simon model that includes both\ncentripetal and centrifugal forces. Centripetal forces are included in the\nsense that firm divisions are more likely to settle in locations that offer a\nhigher accessibility to other firms. Centrifugal forces are represented by an\naversion of a too high density of activities in the potential location. The\nmodel is implemented as an agent-based simulation model in a simplified spatial\nsetting. By running both the Simon model and the extended model, comparisons\nare made with respect to their effects on spatial configurations. To this end a\nseries of metrics are used, including the rank-size distribution and indices of\nthe degree of clustering and concentration.\n", "versions": [{"version": "v1", "created": "Mon, 30 Apr 2012 13:58:47 GMT"}], "update_date": "2012-05-01", "authors_parsed": [["Yang", "Jung-Hun", ""], ["Ettema", "Dick", ""], ["Frenken", "Koen", ""]]}]