[{"id": "1312.0045", "submitter": "Hossein Shokri Ghadikolaei", "authors": "Hossein Shokri-Ghadikolaei, Ioannis Glaropoulos, Viktoria Fodor, Carlo\n  Fischione, Konstantinos Dimou", "title": "Energy Efficient Spectrum Sensing and Handoff Strategies in Cognitive\n  Radio Networks", "comments": "7 pages, 5 figures, submitted to IEEE Commun. Mag", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.ET cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The limited spectrum resources and dramatic growth of high data rate\ncommunications have motivated opportunistic spectrum access using the promising\nconcept of cognitive radio networks. Although this concept has emerged\nprimarily to enhance spectrum utilization, the importance of energy consumption\nposes new challenges, because energy efficiency and communication performance\ncan be at odds. In this paper, the existing approaches to energy efficiency\nspectrum sensing and handoff are classified. The tradeoff between energy\nconsumption and throughput is established as function of the numerous design\nparameters of cognitive radio networks, both in the case of local and of\ncooperative spectrum sensing. It is argued that a number of important aspects\nstill needs to be researched, such as fairness, dynamic behavior, reactive and\nproactive schemes for energy efficiency.\n", "versions": [{"version": "v1", "created": "Sat, 30 Nov 2013 00:28:44 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Shokri-Ghadikolaei", "Hossein", ""], ["Glaropoulos", "Ioannis", ""], ["Fodor", "Viktoria", ""], ["Fischione", "Carlo", ""], ["Dimou", "Konstantinos", ""]]}, {"id": "1312.0133", "submitter": "Liang Wang", "authors": "Liang Wang, Suzan Bayhan, Jussi Kangasharju", "title": "Effects of Cooperation Policy and Network Topology on Performance of\n  In-Network Caching", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We model the cooperation policy with only two parameters -- search radius $r$\nand number of copies in the network $N_{copy}$. These two parameters represent\nthe range of cooperation and tolerance of duplicates. We show how cooperation\npolicy impacts content distribution, and further illustrate the relation\nbetween content popularity and topological properties. Our work leads many\nimplications on how to take advantage of topological properties in in-network\ncaching strategy design.\n", "versions": [{"version": "v1", "created": "Sat, 30 Nov 2013 17:57:38 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Wang", "Liang", ""], ["Bayhan", "Suzan", ""], ["Kangasharju", "Jussi", ""]]}, {"id": "1312.0229", "submitter": "Federico Boccardi", "authors": "Federico Boccardi, Robert W. Heath Jr., Angel Lozano, Thomas L.\n  Marzetta, Petar Popovski", "title": "Five Disruptive Technology Directions for 5G", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  New research directions will lead to fundamental changes in the design of\nfuture 5th generation (5G) cellular networks. This paper describes five\ntechnologies that could lead to both architectural and component disruptive\ndesign changes: device-centric architectures, millimeter Wave, Massive-MIMO,\nsmarter devices, and native support to machine-2-machine. The key ideas for\neach technology are described, along with their potential impact on 5G and the\nresearch challenges that remain.\n", "versions": [{"version": "v1", "created": "Sun, 1 Dec 2013 14:55:07 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Boccardi", "Federico", ""], ["Heath", "Robert W.", "Jr."], ["Lozano", "Angel", ""], ["Marzetta", "Thomas L.", ""], ["Popovski", "Petar", ""]]}, {"id": "1312.0333", "submitter": "Hangguan Shan", "authors": "Hangguan Shan, Zhifeng Ni, Weihua Zhuang, Aiping Huang, and Wei Wang", "title": "State Transition Analysis of Time-Frequency Resource Conversion-based\n  Call Admission Control for LTE-Type Cellular Network", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To address network congestion stemmed from traffic generated by advanced user\nequipments, in [1] we propose a novel network resource allocation strategy,\ntime-frequency resource conversion (TFRC), via exploiting user behavior, a\nspecific kind of context information. Considering an LTE-type cellular network,\na call admission control policy called double-threshold guard channel policy is\nproposed there to facilitate the implementation of TFRC. In this report, we\npresent state transition analysis of this TFRC-based call admission control\npolicy for an LTE-type cellular network. Overall, there are five categories of\nevents that can trigger a transition of the system state: 1) a new call\narrival; 2) a handoff user arrival; 3) a handoff user departure; 4) a call\ntermination; and 5) a periodic time-frequency resource conversion. We analyze\nthem case by case in this report and the validation of the analysis has been\nprovided in [1].\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 05:41:12 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Shan", "Hangguan", ""], ["Ni", "Zhifeng", ""], ["Zhuang", "Weihua", ""], ["Huang", "Aiping", ""], ["Wang", "Wei", ""]]}, {"id": "1312.0466", "submitter": "Serguei Mokhov", "authors": "Serguei A. Mokhov", "title": "Intensional Cyberforensics", "comments": "412 pages, 94 figures, 18 tables, 19 algorithms and listings; PhD\n  thesis; v2 corrects some typos and refs; also available on Spectrum at\n  http://spectrum.library.concordia.ca/977460/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC cs.LO cs.NI cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work focuses on the application of intensional logic to cyberforensic\nanalysis and its benefits and difficulties are compared with the\nfinite-state-automata approach. This work extends the use of the intensional\nprogramming paradigm to the modeling and implementation of a cyberforensics\ninvestigation process with backtracing of event reconstruction, in which\nevidence is modeled by multidimensional hierarchical contexts, and proofs or\ndisproofs of claims are undertaken in an eductive manner of evaluation. This\napproach is a practical, context-aware improvement over the finite state\nautomata (FSA) approach we have seen in previous work. As a base implementation\nlanguage model, we use in this approach a new dialect of the Lucid programming\nlanguage, called Forensic Lucid, and we focus on defining hierarchical contexts\nbased on intensional logic for the distributed evaluation of cyberforensic\nexpressions. We also augment the work with credibility factors surrounding\ndigital evidence and witness accounts, which have not been previously modeled.\nThe Forensic Lucid programming language, used for this intensional\ncyberforensic analysis, formally presented through its syntax and operational\nsemantics. In large part, the language is based on its predecessor and\ncodecessor Lucid dialects, such as GIPL, Indexical Lucid, Lucx, Objective\nLucid, and JOOIP bound by the underlying intensional programming paradigm.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 14:16:48 GMT"}, {"version": "v2", "created": "Fri, 7 Mar 2014 19:06:53 GMT"}], "update_date": "2014-03-10", "authors_parsed": [["Mokhov", "Serguei A.", ""]]}, {"id": "1312.0499", "submitter": "Christoph Neumann", "authors": "Nicolas Le Scouarnec, Christoph Neumann, Gilles Straub", "title": "Cache policies for cloud-based systems: To keep or not to keep", "comments": "Proceedings of IEEE International Conference on Cloud Computing 2014\n  (CLOUD 14)", "journal-ref": null, "doi": "10.1109/CLOUD.2014.11", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study cache policies for cloud-based caching. Cloud-based\ncaching uses cloud storage services such as Amazon S3 as a cache for data items\nthat would have been recomputed otherwise. Cloud-based caching departs from\nclassical caching: cloud resources are potentially infinite and only paid when\nused, while classical caching relies on a fixed storage capacity and its main\nmonetary cost comes from the initial investment. To deal with this new context,\nwe design and evaluate a new caching policy that minimizes the overall cost of\na cloud-based system. The policy takes into account the frequency of\nconsumption of an item and the cloud cost model. We show that this policy is\neasier to operate, that it scales with the demand and that it outperforms\nclassical policies managing a fixed capacity.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 16:21:25 GMT"}, {"version": "v2", "created": "Thu, 24 Apr 2014 08:05:14 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Scouarnec", "Nicolas Le", ""], ["Neumann", "Christoph", ""], ["Straub", "Gilles", ""]]}, {"id": "1312.0522", "submitter": "Brett Kaufman", "authors": "Brett Kaufman and Jorma Lilleberg and Behnaam Aazhang", "title": "Analog Baseband Cancellation for Full-Duplex: An Experiment Driven\n  Analysis", "comments": "22 pages, 12 figures, submitted to IEEE JSAC special issue on\n  Full-Duplex", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent wireless testbed implementations have proven that full-duplex\ncommunication is in fact possible and can outperform half-duplex systems. Many\nof these implementations modify existing half-duplex systems to operate in\nfull-duplex. To realize the full potential of full-duplex, radios need to be\ndesigned with self-interference in mind. In our work, we use a novel patch\nantenna prototype in an experimental setup to characterize the\nself-interference channel between transmit and receive radios. We derive an\nequivalent analytical baseband model and propose analog baseband cancellation\ntechniques to complement the RF cancellation provided by the patch antenna\nprototype. Our results show that a wide bandwidth, moderate isolation scheme\nachieves up to 2.4 bps/Hz higher achievable rate than a narrow bandwidth, high\nisolation scheme. Furthermore, the analog baseband cancellation yields a\n10-10,000 improvement in BER over RF only cancellation.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 17:25:03 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Kaufman", "Brett", ""], ["Lilleberg", "Jorma", ""], ["Aazhang", "Behnaam", ""]]}, {"id": "1312.0629", "submitter": "Abdul Razaque", "authors": "Fatma Almajadub, Abdul Razaque and Eman Abdel Fattah", "title": "Stream Control Transmission Protocol (SCTP): Robust and Efficient for\n  Data Centre Applications", "comments": "05 PAGES AND 08 FIGURES", "journal-ref": null, "doi": null, "report-no": "A156", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to rapid advancement in modern technology, as one of the major concerns\nis the stability of business. The organizations depend on their systems to\nprovide robust and faster processing of information for their operations.\nEfficient data centers are key sources to handle these operations. If the\norganizational system is not fully functional, the performance of organization\nmay be impaired or clogged completely. With the developments of real-time\napplications into data centers for data communications, there is a need to use\nan alternative of the standard TCP protocol to provide reliable data transfer.\nStream Control Transmission Protocol (SCTP) consists of several well built-in\ncharacteristics that make it capable to work efficiently with real-time\napplications. In this paper, we evaluate an optimized version of STCP. The\noptimized version of SCTP is tested against a non optimized version of STCP and\nTCP in a data center environment. Simulations of the protocols are carried\nusing NS2 simulator\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 21:15:54 GMT"}], "update_date": "2013-12-04", "authors_parsed": [["Almajadub", "Fatma", ""], ["Razaque", "Abdul", ""], ["Fattah", "Eman Abdel", ""]]}, {"id": "1312.0720", "submitter": "Tao Zhao", "authors": "Tao Zhao and Pengkun Yang and Huimin Pan and Ruichen Deng and Sheng\n  Zhou and Zhisheng Niu", "title": "Software Defined Radio Implementation of Signaling Splitting in\n  Hyper-Cellular Network", "comments": "4 pages, 4 figures, accepted by the Second Workshop of Software Radio\n  Implementation Forum (SRIF 2013)", "journal-ref": null, "doi": "10.1145/2491246.2491258", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the design and implementation of signaling splitting\nscheme in hyper-cellular network on a software defined radio platform.\nHyper-cellular network is a novel architecture of future mobile communication\nsystems in which signaling and data are decoupled at the air interface to\nmitigate the signaling overhead and allow energy efficient operation of base\nstations. On an open source software defined radio platform, OpenBTS, we\ninvestigate the feasibility of signaling splitting for GSM protocol and\nimplement a novel system which can prove the proposed concept. Standard GSM\nhandsets can camp on the network with the help of signaling base station, and\ndata base station will be appointed to handle phone calls on demand. Our work\ninitiates the systematic approach to study hyper-cellular concept in real\nwireless environment with both software and hardware implementations.\n", "versions": [{"version": "v1", "created": "Tue, 3 Dec 2013 07:41:15 GMT"}], "update_date": "2013-12-04", "authors_parsed": [["Zhao", "Tao", ""], ["Yang", "Pengkun", ""], ["Pan", "Huimin", ""], ["Deng", "Ruichen", ""], ["Zhou", "Sheng", ""], ["Niu", "Zhisheng", ""]]}, {"id": "1312.0825", "submitter": "Sheng Cai", "authors": "Sheng Cai, Mayank Bakshi, Sidharth Jaggi, Minghua Chen", "title": "FRANTIC: A Fast Reference-based Algorithm for Network Tomography via\n  Compressive Sensing", "comments": "Submitted to IEEE Transactions on Communications. A preliminary\n  version of this paper will be presented at the 6th International Conference\n  on Communication System & Networks (COMSNETS) - 2014. A poster based on this\n  work was also presented at International Symposium on Information Theory 2013", "journal-ref": null, "doi": "10.1109/COMSNETS.2014.6734865", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of link and node delay estimation in undirected networks\nwhen at most k out of n links or nodes in the network are congested. Our\napproach relies on end-to-end measurements of path delays across pre-specified\npaths in the network. We present a class of algorithms that we call FRANTIC.\nThe FRANTIC algorithms are motivated by compressive sensing; however, unlike\ntraditional compressive sensing, the measurement design here is constrained by\nthe network topology and the matrix entries are constrained to be positive\nintegers. A key component of our design is a new compressive sensing algorithm\nSHO-FA-INT that is related to the prior SHO-FA algorithm for compressive\nsensing, but unlike SHO-FA, the matrix entries here are drawn from the set of\nintegers {0, 1, ..., M}. We show that O(k log n /log M) measurements suffice\nboth for SHO-FA-INT and FRANTIC. Further, we show that the computational\ncomplexity of decoding is also O(k log n/log M) for each of these algorithms.\nFinally, we look at efficient constructions of the measurement operations\nthrough Steiner Trees.\n", "versions": [{"version": "v1", "created": "Tue, 3 Dec 2013 13:57:02 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Cai", "Sheng", ""], ["Bakshi", "Mayank", ""], ["Jaggi", "Sidharth", ""], ["Chen", "Minghua", ""]]}, {"id": "1312.0883", "submitter": "Sugata Sanyal", "authors": "Antonio Hernandez Coarasa, Prusayon Nintanavongsa, Sugata Sanyal,\n  Kaushik R. Chowdhury", "title": "Impact of Mobile Transmitter Sources on Radio Frequency Wireless Energy\n  Harvesting", "comments": "5 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless energy harvesting sensor networks constitute a new paradigm, where\nthe motes deployed in the field are no longer constrained by the limited\nbattery resource, but are able to re-charge themselves through directed\nelectromagnetic energy transfer. The energy sources, which we call actors, are\nmobile and move along pre-decided patterns while radiating an appropriate level\nof energy, sufficient enough to charge the sensors at an acceptable rate. This\nis the first work that investigates the impact of energy transfer, especially\nconcerning the energy gain in the sensors, the energy spent by the actors, and\nthe overall lifetime in the resulting mobile sensor-actor networks. We propose\ntwo event-specific mobility models, where the events occur at the centers of a\nVoronoi tessellation, and the actors move along either (i)the edges of the\nVoronoi cells, or (ii) directly from one event center to another. We undertake\na comprehensive simulation based study using traces obtained from our\nexperimental energy harvesting circuits powering Mica2 motes. Our results\nreveal several non-intuitive outcomes, and provide guidelines on which mobility\nmodel may be adopted based on the distribution of the events and actors.\n", "versions": [{"version": "v1", "created": "Tue, 3 Dec 2013 17:22:38 GMT"}], "update_date": "2013-12-04", "authors_parsed": [["Coarasa", "Antonio Hernandez", ""], ["Nintanavongsa", "Prusayon", ""], ["Sanyal", "Sugata", ""], ["Chowdhury", "Kaushik R.", ""]]}, {"id": "1312.0910", "submitter": "Derek Groen", "authors": "Derek Groen, Steven Rieder and Simon Portegies Zwart", "title": "MPWide: a light-weight library for efficient message passing over wide\n  area networks", "comments": "accepted by the Journal Of Open Research Software, 13 pages, 4\n  figures, 1 table", "journal-ref": "Journal of Open Research Software 1(1):e9, 2013", "doi": "10.5334/jors.ah", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We present MPWide, a light weight communication library which allows\nefficient message passing over a distributed network. MPWide has been designed\nto connect application running on distributed (super)computing resources, and\nto maximize the communication performance on wide area networks for those\nwithout administrative privileges. It can be used to provide message-passing\nbetween application, move files, and make very fast connections in\nclient-server environments. MPWide has already been applied to enable\ndistributed cosmological simulations across up to four supercomputers on two\ncontinents, and to couple two different bloodflow simulations to form a\nmultiscale simulation.\n", "versions": [{"version": "v1", "created": "Tue, 3 Dec 2013 19:17:57 GMT"}], "update_date": "2014-01-06", "authors_parsed": [["Groen", "Derek", ""], ["Rieder", "Steven", ""], ["Zwart", "Simon Portegies", ""]]}, {"id": "1312.0984", "submitter": "Matthias W\\\"ahlisch", "authors": "Heiner Perrey, Martin Landsmann, Osman Ugus, Thomas C. Schmidt,\n  Matthias W\\\"ahlisch", "title": "TRAIL: Topology Authentication in RPL", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The IPv6 Routing Protocol for Low-Power and Lossy Networks (RPL) was recently\nintroduced as the new routing standard for the Internet of Things. Although RPL\ndefines basic security modes, it remains vulnerable to topological attacks\nwhich facilitate blackholing, interception, and resource exhaustion. We are\nconcerned with analyzing the corresponding threats and protecting future RPL\ndeployments from such attacks.\n  Our contributions are twofold. First, we analyze the state of the art, in\nparticular the protective scheme VeRA and present two new rank order attacks as\nwell as extensions to mitigate them. Second, we derive and evaluate TRAIL, a\ngeneric scheme for topology authentication in RPL. TRAIL solely relies on the\nbasic assumptions of RPL that (1) the root node serves as a trust anchor and\n(2) each node interconnects to the root as part of a hierarchy. Using proper\nreachability tests, TRAIL scalably and reliably identifies any topological\nattacker without strong cryptographic efforts.\n", "versions": [{"version": "v1", "created": "Tue, 3 Dec 2013 23:46:08 GMT"}, {"version": "v2", "created": "Tue, 15 Dec 2015 21:42:07 GMT"}], "update_date": "2016-08-08", "authors_parsed": [["Perrey", "Heiner", ""], ["Landsmann", "Martin", ""], ["Ugus", "Osman", ""], ["Schmidt", "Thomas C.", ""], ["Wählisch", "Matthias", ""]]}, {"id": "1312.0994", "submitter": "Martin Reisslein", "authors": "Anu Mercian, Michael P. McGarry, Martin Reisslein", "title": "Impact of Report Message Scheduling (RMS) in 1G/10G EPON and GPON\n  (Extended Version)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A wide array of dynamic bandwidth allocation (DBA) mechanisms have recently\nbeen proposed for improving bandwidth utilization and reducing idle times and\npackets delays in passive optical networks (PONs). The DBA evaluation studies\ncommonly assumed that the report message for communicating the bandwidth\ndemands of the distributed optical network units (ONUs) to the central optical\nline terminal (OLT) is scheduled for the end of an ONU's upstream transmission,\nafter the ONU's payload data transmissions. In this article, we conduct a\ndetailed investigation of the impact of the report message scheduling (RMS),\neither at the beginning (i.e., before the pay load data) or the end of an ONU\nupstream transmission on PON performance. We analytically characterize the\nreduction in channel idle time with reporting at the beginning of an upstream\ntransmission compared to reporting at the end. Our extensive simulation\nexperiments consider both the Ethernet Passive Optical Networking (EPON)\nstandard and the Gigabit PON (GPON) standard. We find that for DBAs with\noffline sizing and scheduling of ONU upstream transmission grants at the end of\na polling cycle, which processes requests from all ONUs, reporting at the\nbeginning gives substantial reductions of mean packet delay at high loads. For\nhigh-performing DBAs with online grant sizing and scheduling, which immediately\nprocesses individual ONU requests, or interleaving of ONUs groups, both\nreporting at the beginning or end give essentially the same average packet\ndelays.\n", "versions": [{"version": "v1", "created": "Wed, 4 Dec 2013 00:29:47 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["Mercian", "Anu", ""], ["McGarry", "Michael P.", ""], ["Reisslein", "Martin", ""]]}, {"id": "1312.1378", "submitter": "Florin Coras", "authors": "Florin Coras and Jordi Domingo-Pascual and Darrel Lewis and Albert\n  Cabellos-Aparicio", "title": "An Analytical Model for Loc/ID Mappings Caches", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concerns regarding the scalability of the inter-domain routing have\nencouraged researchers to start elaborating a more robust Internet\narchitecture. While consensus on the exact form of the solution is yet to be\nfound, the need for a semantic decoupling of a node's location and identity is\ngenerally accepted as a promising way forward. However, this typically requires\nthe use of caches that store temporal bindings between the two namespaces, to\navoid hampering router packet forwarding speeds. In this article, we propose a\nmethodology for an analytical analysis of cache performance that relies on the\nworking-set theory. We first identify the conditions that network traffic must\ncomply with for the theory to be applicable and then develop a model that\npredicts average cache miss rates relying on easily measurable traffic\nparameters. We validate the result by emulation, using real packet traces\ncollected at the egress points of a campus and an academic network. To prove\nits versatility, we extend the model to consider cache polluting user traffic\nand observe that simple, low intensity attacks drastically reduce performance,\nwhereby manufacturers should either overprovision router memory or implement\nmore complex cache eviction policies.\n", "versions": [{"version": "v1", "created": "Wed, 4 Dec 2013 23:01:56 GMT"}, {"version": "v2", "created": "Fri, 6 Dec 2013 11:20:35 GMT"}], "update_date": "2013-12-09", "authors_parsed": [["Coras", "Florin", ""], ["Domingo-Pascual", "Jordi", ""], ["Lewis", "Darrel", ""], ["Cabellos-Aparicio", "Albert", ""]]}, {"id": "1312.1397", "submitter": "Andrew Clark", "authors": "Phillip Lee, Andrew Clark, Linda Bushnell, and Radha Poovendran", "title": "A Passivity Framework for Modeling and Mitigating Wormhole Attacks on\n  Networked Control Systems", "comments": "35 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Networked control systems consist of distributed sensors and actuators that\ncommunicate via a wireless network. The use of an open wireless medium and\nunattended deployment leaves these systems vulnerable to intelligent\nadversaries whose goal is to disrupt the system performance. In this paper, we\nstudy the wormhole attack on a networked control system, in which an adversary\nestablishes a link between two distant regions of the network by using either\nhigh-gain antennas, as in the out-of-band wormhole, or colluding network nodes\nas in the in-band wormhole. Wormholes allow the adversary to violate the timing\nconstraints of real-time control systems by delaying or dropping packets, and\ncannot be detected using cryptographic mechanisms alone. We study the impact of\nthe wormhole attack on the network flows and delays and introduce a\npassivity-based control-theoretic framework for modeling the wormhole attack.\nWe develop this framework for both the in-band and out-of-band wormhole attacks\nas well as complex, hereto-unreported wormhole attacks consisting of arbitrary\ncombinations of in-and out-of band wormholes. We integrate existing mitigation\nstrategies into our framework, and analyze the throughput, delay, and stability\nproperties of the overall system. Through simulation study, we show that, by\nselectively dropping control packets, the wormhole attack can cause\ndisturbances in the physical plant of a networked control system, and\ndemonstrate that appropriate selection of detection parameters mitigates the\ndisturbances due to the wormhole while satisfying the delay constraints of the\nphysical system.\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 00:45:35 GMT"}], "update_date": "2013-12-06", "authors_parsed": [["Lee", "Phillip", ""], ["Clark", "Andrew", ""], ["Bushnell", "Linda", ""], ["Poovendran", "Radha", ""]]}, {"id": "1312.1437", "submitter": "Subodh Pudasaini", "authors": "Subodh Pudasaini, Seokjoo Shin", "title": "Initial Ranging for Prioritized Network Entry in IEEE 802.16 Network", "comments": "15 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prioritized network entry is desirable for establishing preferential network\nconnectivity for the higher priority users when different priority users exist\nover a given network. In line with such desirability, we propose a simple but\nefficient priority differentiated initial ranging mechanism considering an\nOrthogonal Frequency Division Multiple Access (OFDMA) based IEEE 802.16\nnetwork. In the proposed mechanism, we introduce an approach that integrates an\nexplicit CDMA-ranging code reservation scheme with a Ranging Slot Selection\nWindow (RSSW) differentiation scheme. Simulation results are provided to\ncharacterize the performance of the proposed mechanism.\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 05:31:19 GMT"}], "update_date": "2013-12-06", "authors_parsed": [["Pudasaini", "Subodh", ""], ["Shin", "Seokjoo", ""]]}, {"id": "1312.1658", "submitter": "Anais Vergne", "authors": "Ana\\\"is Vergne (LTCI), Laurent Decreusefond (LTCI), Philippe Martins\n  (LTCI)", "title": "Random Abstract Simplicial Complexes Reduction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.NI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random abstract simplicial complex representation provides a mathematical\ndescription of wireless networks and their topology. In order to reduce the\nenergy consumption in this type of network, we intend to reduce the number of\nnetwork nodes without modifying neither the connectivity nor the coverage of\nthe network. In this paper, we present a reduction algorithm that lower the\nnumber of points of an abstract simplicial complex in an optimal order while\nmaintaining its topology. Then, we study the complexity of such an algorithm\nfor a network simulated by a binomial point process and represented by a\nVietoris-Rips complex.\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 19:54:55 GMT"}, {"version": "v2", "created": "Fri, 21 Mar 2014 18:55:08 GMT"}, {"version": "v3", "created": "Mon, 4 Sep 2017 14:47:15 GMT"}], "update_date": "2017-09-05", "authors_parsed": [["Vergne", "Anaïs", "", "LTCI"], ["Decreusefond", "Laurent", "", "LTCI"], ["Martins", "Philippe", "", "LTCI"]]}, {"id": "1312.1664", "submitter": "Anais Vergne", "authors": "Ana\\\"is Vergne (INRIA Sophia Antipolis / INRIA Saclay - Ile de\n  France), Laurent Decreusefond (LTCI), Philippe Martins (LTCI)", "title": "Simplicial Homology for Future Cellular Networks", "comments": null, "journal-ref": null, "doi": "10.1109/TMC.2014.2360389", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simplicial homology is a tool that provides a mathematical way to compute the\nconnectivity and the coverage of a cellular network without any node location\ninformation. In this article, we use simplicial homology in order to not only\ncompute the topology of a cellular network, but also to discover the clusters\nof nodes still with no location information. We propose three algorithms for\nthe management of future cellular networks. The first one is a frequency\nauto-planning algorithm for the self-configuration of future cellular networks.\nIt aims at minimizing the number of planned frequencies while maximizing the\nusage of each one. Then, our energy conservation algorithm falls into the\nself-optimization feature of future cellular networks. It optimizes the energy\nconsumption of the cellular network during off-peak hours while taking into\naccount both coverage and user traffic. Finally, we present and discuss the\nperformance of a disaster recovery algorithm using determinantal point\nprocesses to patch coverage holes.\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 20:02:21 GMT"}, {"version": "v2", "created": "Sat, 22 Mar 2014 09:20:10 GMT"}, {"version": "v3", "created": "Wed, 6 Aug 2014 15:53:35 GMT"}, {"version": "v4", "created": "Thu, 11 Sep 2014 14:08:49 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Vergne", "Anaïs", "", "INRIA Sophia Antipolis / INRIA Saclay - Ile de\n  France"], ["Decreusefond", "Laurent", "", "LTCI"], ["Martins", "Philippe", "", "LTCI"]]}, {"id": "1312.1719", "submitter": "Daniel Talayco", "authors": "Pat Bosshart, Dan Daly, Martin Izzard, Nick McKeown, Jennifer Rexford,\n  Cole Schlesinger, Dan Talayco, Amin Vahdat, George Varghese, David Walker", "title": "Programming Protocol-Independent Packet Processors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  P4 is a high-level language for programming protocol-independent packet\nprocessors. P4 works in conjunction with SDN control protocols like OpenFlow.\nIn its current form, OpenFlow explicitly specifies protocol headers on which it\noperates. This set has grown from 12 to 41 fields in a few years, increasing\nthe complexity of the specification while still not providing the flexibility\nto add new headers. In this paper we propose P4 as a strawman proposal for how\nOpenFlow should evolve in the future. We have three goals: (1)\nReconfigurability in the field: Programmers should be able to change the way\nswitches process packets once they are deployed. (2) Protocol independence:\nSwitches should not be tied to any specific network protocols. (3) Target\nindependence: Programmers should be able to describe packet-processing\nfunctionality independently of the specifics of the underlying hardware. As an\nexample, we describe how to use P4 to configure a switch to add a new\nhierarchical label.\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 22:19:21 GMT"}, {"version": "v2", "created": "Sun, 2 Mar 2014 19:01:24 GMT"}, {"version": "v3", "created": "Thu, 15 May 2014 22:04:21 GMT"}], "update_date": "2014-05-19", "authors_parsed": [["Bosshart", "Pat", ""], ["Daly", "Dan", ""], ["Izzard", "Martin", ""], ["McKeown", "Nick", ""], ["Rexford", "Jennifer", ""], ["Schlesinger", "Cole", ""], ["Talayco", "Dan", ""], ["Vahdat", "Amin", ""], ["Varghese", "George", ""], ["Walker", "David", ""]]}, {"id": "1312.1920", "submitter": "Rui Meireles", "authors": "Carlos Ameixieira, Andr\\'e Cardote, Filipe Neves, Rui Meireles, Susana\n  Sargento, Lu\\'is Coelho, Jo\\~ao Afonso, Bruno Areias, Eduardo Mota, Rui\n  Costa, Ricardo Matos, Jo\\~ao Barros", "title": "HarborNet: A Real-World Testbed for Vehicular Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a real-world testbed for research and development in vehicular\nnetworking that has been deployed successfully in the sea port of Leix\\~oes in\nPortugal. The testbed allows for cloud-based code deployment, remote network\ncontrol and distributed data collection from moving container trucks, cranes,\ntow boats, patrol vessels and roadside units, thereby enabling a wide range of\nexperiments and performance analyses. After describing the testbed architecture\nand its various modes of operation, we give concrete examples of its use and\noffer insights on how to build effective testbeds for wireless networking with\nmoving vehicles.\n", "versions": [{"version": "v1", "created": "Fri, 6 Dec 2013 16:53:26 GMT"}], "update_date": "2013-12-09", "authors_parsed": [["Ameixieira", "Carlos", ""], ["Cardote", "André", ""], ["Neves", "Filipe", ""], ["Meireles", "Rui", ""], ["Sargento", "Susana", ""], ["Coelho", "Luís", ""], ["Afonso", "João", ""], ["Areias", "Bruno", ""], ["Mota", "Eduardo", ""], ["Costa", "Rui", ""], ["Matos", "Ricardo", ""], ["Barros", "João", ""]]}, {"id": "1312.1957", "submitter": "Wei Bao", "authors": "Wei Bao and Ben Liang", "title": "Uplink Interference Analysis for Two-tier Cellular Networks with Diverse\n  Users under Random Spatial Patterns", "comments": "To appear in the IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-tier architecture improves the spatial reuse of radio spectrum in\ncellular networks, but it introduces complicated heterogeneity in the spatial\ndistribution of transmitters, which brings new challenges in interference\nanalysis. In this work, we present a stochastic geometric model to evaluate the\nuplink interference in a two-tier network considering multi-type users and base\nstations. Each type of tier-1 users and tier-2 base stations are modeled as\nindependent homogeneous Poisson point processes, and tier-2 users are modeled\nas locally non-homogeneous clustered Poisson point processes centered at tier-2\nbase stations. By applying a superposition-aggregation-superposition approach,\nwe quantify the interference at both tiers. Our model is also able to capture\nthe impact of two types of exclusion regions, where either tier-2 base stations\nor tier-2 users are restricted in order to avoid cross-tier interference. As an\nimportant application of this analytical model, an intensity planning scenario\nis investigated, in which we aim to maximize the total income of the network\noperator with respect to the intensities of tier-2 cells, under constraints on\nthe outage probabilities of tier-1 and tier-2 users. The result of our\ninterference analysis suggests that this maximization can be converted to a\nstandard convex optimization problem. Finally, numerical studies further\ndemonstrate the correctness of our analysis.\n", "versions": [{"version": "v1", "created": "Fri, 6 Dec 2013 18:44:19 GMT"}, {"version": "v2", "created": "Sun, 26 Oct 2014 19:52:57 GMT"}], "update_date": "2014-10-28", "authors_parsed": [["Bao", "Wei", ""], ["Liang", "Ben", ""]]}, {"id": "1312.1961", "submitter": "Christian  Lavault", "authors": "Marc Bui (CHART), Franck Butelle (LIPN), Christian Lavault (LIPN)", "title": "A Distributed Algorithm for Constructing a Minimum Diameter Spanning\n  Tree", "comments": "Comments: 11 pages LaTeX, 2 figures; International Journal with\n  referees article; New version (full paper design): results added in Section\n  2.2 and 2.2; typos removed", "journal-ref": "Journal of Parallel and Distributed Computing 64, 5 (2004) 571-577", "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new algorithm, which solves the problem of distributively\nfinding a minimum diameter spanning tree of any (non-negatively) real-weighted\ngraph $G = (V,E,\\omega)$. As an intermediate step, we use a new, fast,\nlinear-time all-pairs shortest paths distributed algorithm to find an absolute\ncenter of $G$. The resulting distributed algorithm is asynchronous, it works\nfor named asynchronous arbitrary networks and achieves $\\mathcal{O}(|V|)$ time\ncomplexity and $\\mathcal{O}\\left(|V|\\,|E|\\right)$\n", "versions": [{"version": "v1", "created": "Fri, 6 Dec 2013 19:04:02 GMT"}, {"version": "v2", "created": "Wed, 11 Dec 2013 08:09:33 GMT"}], "update_date": "2013-12-12", "authors_parsed": [["Bui", "Marc", "", "CHART"], ["Butelle", "Franck", "", "LIPN"], ["Lavault", "Christian", "", "LIPN"]]}, {"id": "1312.1973", "submitter": "Lorenzo Maggi", "authors": "Lorenzo Maggi, Francesco De Pellegrini", "title": "Not Always Sparse: Flooding Time in Partially Connected Mobile Ad Hoc\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study mobile ad hoc wireless networks using the notion of\nevolving connectivity graphs. In such systems, the connectivity changes over\ntime due to the intermittent contacts of mobile terminals. In particular, we\nare interested in studying the expected flooding time when full connectivity\ncannot be ensured at each point in time. Even in this case, due to finite\ncontact times durations, connected components may appear in the connectivity\ngraph. Hence, this represents the intermediate case between extreme cases of\nfully mobile ad hoc networks and fully static ad hoc networks. By using a\ngeneralization of edge-Markovian graphs, we extend the existing models based on\nsparse scenarios to this intermediate case and calculate the expected flooding\ntime. We also propose bounds that have reduced computational complexity.\nFinally, numerical results validate our models.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2013 16:24:51 GMT"}], "update_date": "2013-12-09", "authors_parsed": [["Maggi", "Lorenzo", ""], ["De Pellegrini", "Francesco", ""]]}, {"id": "1312.2030", "submitter": "Hui Zhou", "authors": "Hui Zhou, Donglin Hu, Saketh Anuma Reddy, Shiwen Mao, and Prathima\n  Agrawal", "title": "On Cell Association and Scheduling Policies in Femtocell Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Femtocells are recognized effective for improving network coverage and\ncapacity, and reducing power consumption due to the reduced range of wireless\ntransmissions. Although highly appealing, a plethora of challenging problems\nneed to be addressed for fully harvesting its potential. In this paper, we\ninvestigate the problem of cell association and service scheduling in femtocell\nnetworks. In addition to the general goal of offloading macro base station\n(MBS) traffic, we also aim to minimize the latency of service requested by\nusers, while considering both open and closed access strategies. We show the\ncell association problem is NP-hard, and propose several near-optimal solution\nalgorithms for assigning users to base stations (BS), including a sequential\nfixing algorithm, a rounding approximation algorithm, a greedy approximation\nalgorithm, and a randomized algorithm. For the service scheduling problem, we\ndevelop an optimal algorithm to minimize the average waiting time for the users\nassociated with the same BS. The proposed algorithms are analyzed with respect\nto performance bounds, approximation ratios, and optimality, and are evaluated\nwith simulations.\n", "versions": [{"version": "v1", "created": "Fri, 6 Dec 2013 22:14:34 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Zhou", "Hui", ""], ["Hu", "Donglin", ""], ["Reddy", "Saketh Anuma", ""], ["Mao", "Shiwen", ""], ["Agrawal", "Prathima", ""]]}, {"id": "1312.2052", "submitter": "Kiran Sree Pokkuluri Prof", "authors": "Pokkuluri Kiran Sree, Inampudi Ramesh Babu", "title": "Power-Aware Hybrid Intrusion Detection System (PHIDS) using Cellular\n  Automata in Wireless AdHoc Networks", "comments": null, "journal-ref": "WSEAS TRANSACTIONS on COMPUTERS,Issue 11, Volume 7, November\n  2008,ISSN: 1109-2750", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adhoc wireless network with their changing topology and distributed nature\nare more prone to intruders. The network monitoring functionality should be in\noperation as long as the network exists with nil constraints. The efficiency of\nan Intrusion detection system in the case of an adhoc network is not only\ndetermined by its dynamicity in monitoring but also in its flexibility in\nutilizing the available power in each of its nodes. In this paper we propose a\nhybrid intrusion detection system, based on a power level metric for potential\nadhoc hosts, which is used to determine the duration for which a particular\nnode can support a network monitoring node. Power aware hybrid intrusion\ndetection system focuses on the available power level in each of the nodes and\ndetermines the network monitors. Power awareness in the network results in\nmaintaining power for network monitoring, with monitors changing often, since\nit is an iterative power optimal solution to identify nodes for distributed\nagent based intrusion detection. The advantage that this approach entails is\nthe inherent flexibility it provides, by means of considering only fewer nodes\nfor reestablishing network monitors. The detection of intrusions in the network\nis done with the help of Cellular Automat CA. The CAs classify a packet routed\nthrough the network either as normal or an intrusion. The use of CAs enable in\nthe identification of already occurred intrusions as well as new intrusions.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 02:44:05 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Sree", "Pokkuluri Kiran", ""], ["Babu", "Inampudi Ramesh", ""]]}, {"id": "1312.2062", "submitter": "Debajit Sensarma", "authors": "Debajit Sensarma and Koushik Majumder", "title": "A Novel Hierarchical Ant based QoS aware Intelligent Routing Scheme for\n  MANETS", "comments": "15 pages, 7 figures. arXiv admin note: text overlap with\n  arXiv:1308.2762", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.5, No.6, November 2013", "doi": "10.5121/ijcnc.2013.5614", "report-no": null, "categories": "cs.NI cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MANET is a collection of mobile devices with no centralized control and no\npre-existing infrastructures. Due to the nodal mobility, supporting QoS during\nrouting in this type of networks is a very challenging task. To tackle this\ntype of overhead many routing algorithms with clustering approach have been\nproposed. Clustering is an effective method for resource management regarding\nnetwork performance, routing protocol design, QoS etc. Most of the flat network\narchitecture contains homogeneous capacity of nodes but in real time nodes are\nwith heterogeneous capacity and transmission power. Hierarchical routing\nprovides routing through this kind of heterogeneous nodes. Here, routes can be\nrecorded hierarchically, across clusters to increase routing flexibility.\nBesides this, it increases scalability and robustness of routes. In this paper,\na novel ant based QoS aware routing is proposed on a three level hierarchical\ncluster based topology in MANET which will be more scalable and efficient\ncompared to flat architecture and will give better throughput.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 05:56:18 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Sensarma", "Debajit", ""], ["Majumder", "Koushik", ""]]}, {"id": "1312.2091", "submitter": "Songyang Wang", "authors": "Songyang Wang, Ruyi Ma", "title": "Name: A Naming Mechanism for Delay/Disruption-Tolerant Network", "comments": "11 pages, 9 figures", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.5, No.6, November 2013", "doi": "10.5121/ijcnc.2013.5615", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the design and implementation of the naming mechanism\n(NAME), a resource discovery and service location approach for\nDelay/Disruption-Tolerant Network (DTN). First discuss the architecture of NAME\nmainly including Name Knowledge Base, Name Dissemination, Name Resolution and\nName-based Routing. In the design and implementation of NAME, we introduce the\nsimple namespecifiers to describe name, the name-tree for name storage and the\nefficient predicate-based routing algorithm. Future work is finally discussed\nfor completing NAME and providing APIs for abundant applications.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 13:04:31 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Wang", "Songyang", ""], ["Ma", "Ruyi", ""]]}, {"id": "1312.2108", "submitter": "Geetanjali Chellani", "authors": "Geetanjali Chellani, Anshuman Kalla", "title": "A Review: Study of Handover Performance in Mobile IP", "comments": null, "journal-ref": null, "doi": "10.5121/ijcnc.2013.5608", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Mobile Internet Protocol (Mobile IP) is an extension to the Internet\nProtocol proposed by the Internet Engineering Task Force (IETF) that addresses\nthe mobility issues. In order to support un-interrupted services and seamless\nmobility of nodes across the networks (and/or sub-networks) with permanent IP\naddresses, handover is performed in mobile IP enabled networks. Handover in\nmobile IP is source cause of performance degradation as it results in increased\nlatency and packet loss during handover. Other issues like scalability issues,\nordered packet delivery issues, control plane management issues etc are also\nadversely affected by it. The paper provides a constructive survey by\nclassifying, discussing and comparing different handover techniques that have\nbeen proposed so far, for enhancing the performance during handovers. Finally\nsome general solutions that have been used to solve handover related problems\nare briefly discussed.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 16:26:01 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Chellani", "Geetanjali", ""], ["Kalla", "Anshuman", ""]]}, {"id": "1312.2175", "submitter": "Sugata Sanyal", "authors": "Bibhas Roy, Suman Banik, Parthi Dey, Sugata Sanyal, Nabendu Chaki", "title": "Ant Colony based Routing for Mobile Ad-Hoc Networks towards Improved\n  Quality of Services", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Ad Hoc Network (MANET) is a dynamic multihop wireless network which is\nestablished by a set of mobile nodes on a shared wireless channel. One of the\nmajor issues in MANET is routing due to the mobility of the nodes. Routing\nmeans the act of moving information across an internet work from a source to a\ndestination. When it comes to MANET, the complexity increases due to various\ncharacteristics like dynamic topology, time varying QoS requirements, limited\nresources and energy etc. QoS routing plays an important role for providing QoS\nin wireless ad hoc networks. The most complex issue in this kind of networks is\nto find a path between the communication end points satisfying QoS requirement\nfor the user. Nature-inspired algorithms (swarm intelligence) such as ant\ncolony optimization ACO)algorithms have shown to be a good technique for\ndeveloping routing algorithms for MANETs.\n  In this paper, a new QoS algorithm for mobile ad hoc network has been\nproposed. The proposed algorithm combines the idea of Ant Colony Optimization\n(ACO) with Optimized Link State Routing (OLSR) protocol to identify multiple\nstable paths between source and destination nodes.\n", "versions": [{"version": "v1", "created": "Sun, 8 Dec 2013 04:55:06 GMT"}, {"version": "v2", "created": "Tue, 10 Dec 2013 16:04:13 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Roy", "Bibhas", ""], ["Banik", "Suman", ""], ["Dey", "Parthi", ""], ["Sanyal", "Sugata", ""], ["Chaki", "Nabendu", ""]]}, {"id": "1312.2177", "submitter": "Mahdi Zamani", "authors": "Mahdi Zamani and Mahnush Movahedi", "title": "Machine Learning Techniques for Intrusion Detection", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": "UNM-48066-F13", "categories": "cs.CR cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An Intrusion Detection System (IDS) is a software that monitors a single or a\nnetwork of computers for malicious activities (attacks) that are aimed at\nstealing or censoring information or corrupting network protocols. Most\ntechniques used in today's IDS are not able to deal with the dynamic and\ncomplex nature of cyber attacks on computer networks. Hence, efficient adaptive\nmethods like various techniques of machine learning can result in higher\ndetection rates, lower false alarm rates and reasonable computation and\ncommunication costs. In this paper, we study several such schemes and compare\ntheir performance. We divide the schemes into methods based on classical\nartificial intelligence (AI) and methods based on computational intelligence\n(CI). We explain how various characteristics of CI techniques can be used to\nbuild efficient IDS.\n", "versions": [{"version": "v1", "created": "Sun, 8 Dec 2013 06:56:21 GMT"}, {"version": "v2", "created": "Sat, 9 May 2015 06:07:35 GMT"}], "update_date": "2015-05-12", "authors_parsed": [["Zamani", "Mahdi", ""], ["Movahedi", "Mahnush", ""]]}, {"id": "1312.2188", "submitter": "Fotis Foukalas", "authors": "F.Foukalas, G.T.Karetsos and P.Chatzimisios", "title": "Cross-layer Design of CSMA/CA with Spectrum Sensing for Cognitive Radio\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We devise a cross-layer design (CLD) of carrier sensing multiple access with\ncollision avoidance (CSMA/CA) at the medium access control (MAC) layer with\nspectrum sensing (SpSe) at the physical layer for cognitive radio networks\n(CRNs). The proposed CLD relies on a Markov chain model with a state pair\ncontaining both the SpSe and the CSMA/CA with exponential backoff from which we\nderive the transmission and collision probabilities. Due to the 2-dimensions of\nCSMA/CA model with exponential backoff, the resulted Markov chain is obtained\nwith 3-dimensions. Simulation and numerical results are derived and illustrated\nhighlighting the impact of SpSe in CSMA/CA with exponential backoff. The\nobtained results could be used as performance criteria to evaluate the\nperformance of specific CRNs when they are deployed in a distributed\ncoordination fashion that is prone to collisions.\n", "versions": [{"version": "v1", "created": "Sun, 8 Dec 2013 10:00:33 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Foukalas", "F.", ""], ["Karetsos", "G. T.", ""], ["Chatzimisios", "P.", ""]]}, {"id": "1312.2225", "submitter": "Amor Lazzez Dr.", "authors": "Amor Lazzez", "title": "VoIP Technology: Security Issues Analysis", "comments": "9 pages", "journal-ref": "International Journal of Emerging Trends & Technology in Computer\n  Science (IJETTCS), Volume 2, Issue 4, July-August 2013", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Voice over IP (VoIP) is the technology allowing voice and multimedia\ntransmissions as data packets over a private or a public IP network. Thanks to\nthe benefits that it may provide, the VoIP technology is increasingly\nattracting attention and interest in the industry. Actually, VoIP allows\nsignificant benefits for customers and communication services providers such as\ncost savings, rich media service, phone and service portability, mobility, and\nthe integration with other applications. Nevertheless, the deployment of the\nVoIP technology encounters many challenges such as architecture complexity,\ninteroperability issues, QoS issues, and security concerns. Among these\ndisadvantages, VoIP security issues are becoming more serious because\ntraditional security devices, protocols, and architectures cannot adequately\nprotect VoIP systems from recent intelligent attacks. The aim of this paper is\ncarry out a deep analysis of the security concerns of the VoIP technology.\nFirstly, we present a brief overview about the VoIP technology. Then, we\ndiscuss security attacks and vulnerabilities related to VoIP protocols and\ndevices. After that, we talk about the security profiles of the VoIP protocols,\nand we present the main security components designed to help the deployment of\na reliable and secured VoIP systems.\n", "versions": [{"version": "v1", "created": "Sun, 8 Dec 2013 15:07:24 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Lazzez", "Amor", ""]]}, {"id": "1312.2241", "submitter": "Mohammad Noormohammadpour", "authors": "Mohammad Noormohammadpour, Mohammad Javad Salehi, Seyed Mohammad\n  Asghari Pari, Babak Hossein Khalaj, Hamidreza Bagheri, Marcos Katz", "title": "ABMQ: An Agent-Based Modeler and Simulator for Self-Organization in\n  MANETs using Qt", "comments": "6 pages, 8 figures, conference paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agent-Based Modeling and Simulation (ABMS) is a simple and yet powerful\nmethod for simulation of interactions among individual agents. Using ABMS,\ndifferent phenomena can be modeled and simulated without spending additional\ntime on unnecessary complexities. Although ABMS is well-matured in many\ndifferent fields such as economic, social, and natural phenomena, it has not\nreceived much attention in the context of mobile ad-hoc networks (MANETs). In\nthis paper, we present ABMQ, a powerful Agent-Based platform suitable for\nmodeling and simulation of self-organization in wireless networks, and\nparticularly MANETs. By utilizing the unique potentials of Qt Application\nFramework, ABMQ provides the ability to easily model and simulate\nself-organizing algorithms, and then reuse the codes and models developed\nduring simulation process for building real third-party applications for\nseveral desktop and mobile platforms, which substantially decreases the\ndevelopment time and cost, and prevents probable bugs that can happen as a\nresult of rewriting codes.\n", "versions": [{"version": "v1", "created": "Sun, 8 Dec 2013 18:46:25 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Noormohammadpour", "Mohammad", ""], ["Salehi", "Mohammad Javad", ""], ["Pari", "Seyed Mohammad Asghari", ""], ["Khalaj", "Babak Hossein", ""], ["Bagheri", "Hamidreza", ""], ["Katz", "Marcos", ""]]}, {"id": "1312.2466", "submitter": "Brett Kaufman", "authors": "Brett Kaufman and Jorma Lilleberg and Behnaam Aazhang", "title": "An Analog Baseband Approach for Designing Full-Duplex Radios", "comments": "5 pages, 8 figures, to appear in 2013 Asilomar Conference proceedings", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent wireless testbed implementations have proven that full-duplex\ncommunication is in fact possible and can outperform half-duplex systems. Many\nof these implementations modify existing half-duplex systems to operate in\nfull-duplex. To realize the full potential of full-duplex, radios need to be\ndesigned with self-interference in mind. In our work, we use an experimental\nsetup with a patch antenna prototype to characterize the self-interference\nchannel between two radios. In doing so, we form an analytical model to design\nanalog baseband cancellation techniques. We show that our cancellation scheme\ncan provide up to 10 dB improved signal strength, 2.5 bps/Hz increase in rate,\nand a 10,000 improvement in BER as compared to the RF only cancellation\nprovided by the patch antenna.\n", "versions": [{"version": "v1", "created": "Mon, 9 Dec 2013 15:28:08 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Kaufman", "Brett", ""], ["Lilleberg", "Jorma", ""], ["Aazhang", "Behnaam", ""]]}, {"id": "1312.2581", "submitter": "Amor Lazzez Dr.", "authors": "Amor Lazzez, Thabet Slimani", "title": "Deployment of VoIP Technology: QoS Concerns", "comments": "8 pages, 3 figures", "journal-ref": "International Journal of Advanced Research in Computer and\n  Communication Engineering (IJARCCE), Vol. 2, Issue 9, September 2013", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Voice over IP (VoIP) is an emerging communication service allowing voice\ntransmission over a private or a public IP network. VoIP allows significant\nbenefits for customers and service providers including cost savings, phone and\nservice portability, mobility, and the integration with other applications.\nNevertheless, the deployment of the VoIP technology encounters many challenges\nsuch as interoperability issues, security issues, and QoS concerns. Among these\ndisadvantages, QoS issues are considered the most serious due to the QoS\nproblems that may arise on IP networks, and the stringent QoS requirements of\nvoice traffic. The aim of this paper is carry out a deep analysis of the QoS\nconcerns of the VoIP technology. Firstly, we present a brief overview about the\nVoIP technology. Then, we discuss the QoS issues related to the use of the IP\nnetworking technology for voice traffic transmission. After that, we present\nthe QoS concerns related voice clarity. Finally, we present the QoS mechanisms\nproposed to make the IP technology able to support voice traffic QoS\nrequirements in terms of voice clarity, voice packet delay, packet delay\nvariation, and packet loss.\n", "versions": [{"version": "v1", "created": "Sun, 8 Dec 2013 15:47:35 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Lazzez", "Amor", ""], ["Slimani", "Thabet", ""]]}, {"id": "1312.2625", "submitter": "Carlton Thompson", "authors": "Carlton A. Thompson, Haniph A. Latchman, Nathan Angelacos, Bharath\n  Kumar Pareek", "title": "A Distributed IP-Based Telecommunication System using SIP", "comments": "16 pages, 10 figures", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.5, No.6, November 2013", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Voice over Internet Protocol (VoIP) technologies are integral to modern\ntelecommunications because of their advanced features, flexibility, and\neconomic benefits. Internet Service Providers initially promoted these\ntechnologies by providing low cost local and international calling. At present,\nthere is also a great deal of interest in using IP-based technologies to\nreplace traditional small and large office telephone systems that use\ntraditional PBXs (Private Branch eXchange). Unfortunately, the large majority\nof the emerging VoIP based office telephone systems have followed the\ncentralized design of traditional public and private telephone systems in which\nall the intelligence in the system is at the core, with quite expensive\nhardware and software components and appropriate redundancy for adequate levels\nof reliability. In this paper, it is argued that a centralized model for an\nIP-based telecommunications system fails to exploit the full capabilities of\nInternet-inspired communications and that, very simple, inexpensive, elegant\nand flexible solutions are possible by deliberately avoiding the centralized\napproach. This paper describes the design, philosophy and implementation of a\nprototype for a fully distributed IP-based Telecommunication System (IPTS) that\nprovides the essential feature set for office and home telecommunications,\nincluding IP-based long-distance and local calling, and with the support for\nvideo as well as data and text. The prototype system was implemented with an\nInternet-inspired distributed design using open source software, with\nappropriate customizations and configurations.\n", "versions": [{"version": "v1", "created": "Mon, 9 Dec 2013 22:51:57 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Thompson", "Carlton A.", ""], ["Latchman", "Haniph A.", ""], ["Angelacos", "Nathan", ""], ["Pareek", "Bharath Kumar", ""]]}, {"id": "1312.2806", "submitter": "Susumu Matsumae", "authors": "Susumu Matsumae, Fukuhito Ooshita", "title": "Hierarchical Low Power Consumption Technique with Location Information\n  for Sensor Networks", "comments": "6 pages, 9 figures, 2 tables", "journal-ref": "International Journal of Advanced Computer Science and\n  Applications(IJACSA), Volume 4 Issue 4, 2013", "doi": "10.14569/IJACSA.2013.040412", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the wireless sensor networks composed of battery-powered sensor nodes, one\nof the main issues is how to save power consumption at each node. The usual\napproach to this problem is to activate only necessary nodes (e.g., those nodes\nwhich compose a backbone network), and to put other nodes to sleep. One such\nalgorithm using location information is GAF (Geographical Adaptive Fidelity),\nand the GAF is enhanced to HGAF (Hierarchical Geographical Adaptive Fidelity).\nIn this paper, we show that we can further improve the energy efficiency of\nHGAF by modifying the manner of dividing sensor-field. We also provide a\ntheoretical bound on this problem.\n", "versions": [{"version": "v1", "created": "Tue, 10 Dec 2013 14:13:08 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Matsumae", "Susumu", ""], ["Ooshita", "Fukuhito", ""]]}, {"id": "1312.2813", "submitter": "Susumu Matsumae", "authors": "Susumu Matsumae", "title": "Energy-Efficient Cell Partition of 3D Space for Sensor Networks with\n  Location Information", "comments": "14 pages, 9 figures, 2 tables", "journal-ref": "International Journal of Network Protocols and Algorithms, Vol. 1,\n  No. 2 (2009)", "doi": "10.5296/npa.v1i2.270", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the wireless sensor networks composed of battery-powered sensor nodes, one\nof the main issues is how to save power consumption on each node. The usual\napproach to this problem is to activate only necessary nodes (e.g., those nodes\nwhich compose a backbone network), and to put other nodes to sleep. One such\nalgorithm using location information is GAF (Geographical Adaptive Fidelity),\nand GAF is enhanced to HGAF (Hierarchical Geographical Adaptive Fidelity). In\nthis paper, we study the energy-efficient partition of a 3 dimensional sensor\nfield into cells. Further, we give a theoretical upper bound on cell size for\nthis problem.\n", "versions": [{"version": "v1", "created": "Tue, 10 Dec 2013 14:34:44 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Matsumae", "Susumu", ""]]}, {"id": "1312.2884", "submitter": "Muhammad Usman  Sheikh", "authors": "Muhammad Usman Sheikh, Jukka Lempiainen", "title": "Advanced Antenna Techniques and High Order Sectorization with Novel\n  Network Tessellation for Enhancing Macro Cell Capacity in DC-HSDPA Network", "comments": "20 pages, 18 Figures, and 5 Tables", "journal-ref": "International Journal of Wireless and Mobile Networks (IJWMN).\n  Vol.5, No.5, October 2013", "doi": "10.5121/ijwmn.2013.5505", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile operators commonly use macro cells with traditional wide beam antennas\nfor wider coverage in the cell, but future capacity demands cannot be achieved\nby using them only. It is required to achieve maximum practical capacity from\nmacro cells by employing higher order sectorization and by utilizing all\npossible antenna solutions including smart antennas. This paper presents\nenhanced tessellation for 6-sector sites and proposes novel layout for\n12-sector sites. The main target of this paper is to compare the performance of\nconventional wide beam antenna, switched beam smart antenna, adaptive beam\nantenna and different network layouts in terms of offering better received\nsignal quality and user throughput. Splitting macro cell into smaller micro or\npico cells can improve the capacity of network, but this paper highlights the\nimportance of higher order sectorization and advance antenna techniques to\nattain high Signal to Interference plus Noise Ratio (SINR), along with improved\nnetwork capacity. Monte Carlo simulations at system level were done for Dual\nCell High Speed Downlink Packet Access (DC-HSDPA) technology with multiple\n(five) users per Transmission Time Interval (TTI) at different Intersite\nDistance (ISD). The obtained results validate and estimate the gain of using\nsmart antennas and higher order sectorization with proposed network layout.\n", "versions": [{"version": "v1", "created": "Tue, 10 Dec 2013 17:19:28 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Sheikh", "Muhammad Usman", ""], ["Lempiainen", "Jukka", ""]]}, {"id": "1312.3295", "submitter": "Vijay S Rao", "authors": "Chayan Sarkar, Vijay S. Rao, R. Venkatesha Prasad", "title": "No-Sense: Sense with Dormant Sensors", "comments": "Accepted for publication in IEEE Twentieth National Conference on\n  Communications (NCC-2014)", "journal-ref": null, "doi": "10.1109/NCC.2014.6811303", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs) have enabled continuous monitoring of an area\nof interest (body, room, region, etc.) while eliminating expensive wired\ninfrastructure. Typically in such applications, wireless sensor nodes report\nthe sensed values to a sink node, where the information is required for the\nend-user. WSNs also provide the flexibility to the end-user for choosing\nseveral parameters for the monitoring application. For example, placement of\nsensors, frequency of sensing and transmission of those sensed data. Over the\nyears, the advancement in embedded technology has led to increased processing\npower and memory capacity of these battery powered devices. However, batteries\ncan only supply limited energy, thus limiting the lifetime of the network. In\norder to prolong the lifetime of the deployment, various efforts have been made\nto improve the battery technologies and also reduce the energy consumption of\nthe sensor node at various layers in the networking stack. Of all the\noperations in the network stack, wireless data transmission and reception have\nfound to consume most of the energy. Hence many proposals found in the\nliterature target reducing them through intelligent schemes like power control,\nreducing retransmissions, etc. In this article we propose a new framework\ncalled Virtual Sensing Framework (VSF), which aims to sufficiently satisfy\napplication requirements while conserving energy at the sensor nodes.\n", "versions": [{"version": "v1", "created": "Wed, 11 Dec 2013 20:03:22 GMT"}, {"version": "v2", "created": "Sun, 15 Dec 2013 09:51:26 GMT"}, {"version": "v3", "created": "Mon, 27 Jan 2014 10:36:32 GMT"}, {"version": "v4", "created": "Thu, 6 Feb 2014 17:18:35 GMT"}], "update_date": "2016-07-25", "authors_parsed": [["Sarkar", "Chayan", ""], ["Rao", "Vijay S.", ""], ["Prasad", "R. Venkatesha", ""]]}, {"id": "1312.3420", "submitter": "Xinyu Lei", "authors": "Xinyu Lei, Xiaofeng Liao, Yonghong Xiong", "title": "Group Key Agreement Protocol for MANETs Based on HSK Scheme", "comments": "9 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we first provide a spanning tree (ST)-based centralized group\nkey agreement protocol for unbalanced mobile Ad Hoc networks (MANETs). Based on\nthe centralized solution, a local spanning tree (LST)-based distributed\nprotocol for general MANETs is subsequently presented. Both protocols follow\nthe basic features of the HSK scheme: 1) H means that a hybrid approach, which\nis the combination of key agreement and key distribution via symmetric\nencryption, is exploited; 2) S indicates that a ST or LSTs are adopted to form\na connected network topology; and 3) K implies that the extended Kruskal\nalgorithm is employed to handle dynamic events. It is shown that the HSK scheme\nis a uniform approach to handle the initial key establishment process as well\nas all kinds of dynamic events in group key agreement protocol for MANETs.\nAdditionally, the extended Kruskal algorithm enables to realize the reusability\nof the precomputed secure links to reduce the overhead. Moreover, some other\naspects, such as the network topology connectivity and security, are well\nanalyzed.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 08:52:03 GMT"}], "update_date": "2013-12-13", "authors_parsed": [["Lei", "Xinyu", ""], ["Liao", "Xiaofeng", ""], ["Xiong", "Yonghong", ""]]}, {"id": "1312.3455", "submitter": "Hong Xu", "authors": "Shuhao Liu, Hong Xu, Zhiping Cai", "title": "Low Latency Datacenter Networking: A Short Survey", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Datacenters are the cornerstone of the big data infrastructure supporting\nnumerous online services. The demand for interactivity, which significantly\nimpacts user experience and provider revenue, is translated into stringent\ntiming requirements for flows in datacenter networks. Thus low latency\nnetworking is becoming a major concern of both industry and academia.\n  We provide a short survey of recent progress made by the networking community\nfor low latency datacenter networks. We propose a taxonomy to categorize\nexisting work based on four main techniques, reducing queue length,\naccelerating retransmissions, prioritizing mice flows, and exploiting\nmulti-path. Then we review select papers, highlight the principal ideas, and\ndiscuss their pros and cons. We also present our perspectives of the research\nchallenges and opportunities, hoping to aspire more future work in this space.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 11:50:23 GMT"}, {"version": "v2", "created": "Thu, 31 Jul 2014 08:36:28 GMT"}], "update_date": "2014-08-01", "authors_parsed": [["Liu", "Shuhao", ""], ["Xu", "Hong", ""], ["Cai", "Zhiping", ""]]}, {"id": "1312.3692", "submitter": "Bao Lam Hoai", "authors": "Hoai Bao Lam, Tai Tan Phan, Long Huynh Vuong, Hiep Xuan Huynh, Bernard\n  Pottier", "title": "Designing a brown planthoppers surveillance network based on wireless\n  sensor network approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new approach for monitoring brown planthoppers (BPH)\nswarms using a surveillance network at provincial scale. The topology of this\nnetwork is identified to a wireless sensor network (WSN), where each node is a\nreal light trap and each edge describes the influence between two nodes,\nallowing gathering BPH information. Different communication ranges are\nevaluated to choose a suitable network. The experiments are performed on the\nlight traps surveillance network of Hau Giang province, a typical rice province\nin the Mekong Delta region of Vietnam.\n", "versions": [{"version": "v1", "created": "Fri, 13 Dec 2013 02:41:16 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Lam", "Hoai Bao", ""], ["Phan", "Tai Tan", ""], ["Vuong", "Long Huynh", ""], ["Huynh", "Hiep Xuan", ""], ["Pottier", "Bernard", ""]]}, {"id": "1312.3702", "submitter": "Zolfa Zeinalpour-Yazdi", "authors": "Zolfa Zeinalpour-Yazdi and Shirin Jalali", "title": "Outage Analysis of Uplink Two-tier Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Employing multi-tier networks is among the most promising approaches to\naddress the rapid growth of the data demand in cellular networks. In this\npaper, we study a two-tier uplink cellular network consisting of femtocells and\na macrocell. Femto base stations, and femto and macro users are assumed to be\nspatially deployed based on independent Poisson point processes. We consider an\nopen access assignment policy, where each macro user based on the ratio between\nits distances from its nearest femto access point (FAP) and from the macro base\nstation (MBS) is assigned to either of them. By tuning the threshold, this\npolicy allows controlling the coverage areas of FAPs. For a fixed threshold,\nfemtocells coverage areas depend on their distances from the MBS; Those closest\nto the fringes will have the largest coverage areas. Under this open-access\npolicy, ignoring the additive noise, we derive analytical upper and lower\nbounds on the outage probabilities of femto users and macro users that are\nsubject to fading and path loss. We also study the effect of the distance from\nthe MBS on the outage probability experienced by the users of a femtocell. In\nall cases, our simulation results comply with our analytical bounds.\n", "versions": [{"version": "v1", "created": "Fri, 13 Dec 2013 04:50:51 GMT"}, {"version": "v2", "created": "Tue, 5 Aug 2014 16:21:10 GMT"}], "update_date": "2014-08-06", "authors_parsed": [["Zeinalpour-Yazdi", "Zolfa", ""], ["Jalali", "Shirin", ""]]}, {"id": "1312.3766", "submitter": "Matteo Cesana", "authors": "Nicola Basilico, Nicola Gatti, Luca Goffredi, Matteo Cesana", "title": "Beaconing-Aware Optimal Policies for Two-Hop Routing in Multi-Class\n  Delay Tolerant Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Delay Tolerant Networks (DTNs), two-hop routing compromises energy versus\ndelay more conveniently than epidemic routing. Literature provides\ncomprehensive results on optimal routing policies for mobile nodes with\nhomogeneous mobility, often neglecting signaling costs. Routing policies are\ncustomarily computed by means of fluid approximation techniques, which assure\nsolutions to be optimal only when the number of nodes is infinite, while they\nprovide a coarse approximation otherwise. This work addresses heterogeneous\nmobility patterns and multiple wireless transmission technologies; moreover, we\nexplicitly consider the beaconing/signaling costs to support routing and the\npossibility for nodes to discard packets after a local time. We theoretically\ncharacterize the optimal policies by deriving their formal properties. Such\nanalysis is leveraged to define two algorithmic approaches which allow to trade\noff optimality with computational efficiency. Theoretical bounds on the\napproximation guarantees of the proposed algorithms are derived. We then\nexperimentally evaluated them in realistic scenarios of multi-class DTNs.\n", "versions": [{"version": "v1", "created": "Fri, 13 Dec 2013 10:50:10 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Basilico", "Nicola", ""], ["Gatti", "Nicola", ""], ["Goffredi", "Luca", ""], ["Cesana", "Matteo", ""]]}, {"id": "1312.3847", "submitter": "Qi Qi", "authors": "Qi Qi, Yufei Cao", "title": "Cloud Service-Aware Location Update in Mobile Cloud Computing", "comments": "11 pages, 11 figures, journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile devices are becoming the primary platforms for many users who always\nroam around when accessing the cloud computing services. From this, the cloud\ncomputing is integrated into the mobile environment by introducing a new\nparadigm, mobile cloud computing. In the context of mobile computing, the\nbattery life of mobile device is limited, and it is important to balance the\nmobility performance and energy consumption. Fortunately, cloud services\nprovide both opportunities and challenges for mobility management. Taking the\nactivities of cloud services accessing into consideration, we propose a\nservice-aware location update mechanism, which can detect the presence and\nlocation of the mobile device without traditional periodic registration update.\nAnalytic model and simulation are developed to investigate the new mechanism.\nThe results demonstrate that the service-aware location update management can\nreduce the location update times and handoff signaling, which can efficiently\nsave power consumption for mobile devices.\n", "versions": [{"version": "v1", "created": "Fri, 13 Dec 2013 15:53:34 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Qi", "Qi", ""], ["Cao", "Yufei", ""]]}, {"id": "1312.3961", "submitter": "Avik Sengupta", "authors": "Avik Sengupta, Ravi Tandon, T. Charles Clancy", "title": "Fundamental Limits of Caching with Secure Delivery", "comments": null, "journal-ref": "IEEE Transactions on Information Forensics and Security, 02\n  December 2014", "doi": "10.1109/TIFS.2014.2375553", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Caching is emerging as a vital tool for alleviating the severe capacity\ncrunch in modern content-centric wireless networks. The main idea behind\ncaching is to store parts of popular content in end-users' memory and leverage\nthe locally stored content to reduce peak data rates. By jointly designing\ncontent placement and delivery mechanisms, recent works have shown order-wise\nreduction in transmission rates in contrast to traditional methods. In this\nwork, we consider the secure caching problem with the additional goal of\nminimizing information leakage to an external wiretapper. The fundamental cache\nmemory vs. transmission rate trade-off for the secure caching problem is\ncharacterized. Rather surprisingly, these results show that security can be\nintroduced at a negligible cost, particularly for large number of files and\nusers. It is also shown that the rate achieved by the proposed caching scheme\nwith secure delivery is within a constant multiplicative factor from the\ninformation-theoretic optimal rate for almost all parameter values of practical\ninterest.\n", "versions": [{"version": "v1", "created": "Fri, 13 Dec 2013 21:36:08 GMT"}, {"version": "v2", "created": "Mon, 17 Feb 2014 16:39:58 GMT"}, {"version": "v3", "created": "Thu, 11 Dec 2014 03:56:16 GMT"}], "update_date": "2014-12-12", "authors_parsed": [["Sengupta", "Avik", ""], ["Tandon", "Ravi", ""], ["Clancy", "T. Charles", ""]]}, {"id": "1312.4016", "submitter": "Yongcai Wang", "authors": "Xiongfeng Geng, Yongcai Wang, Haoran Feng, Zhoufeng Chen", "title": "Hybrid Radio-map for Noise Tolerant Wireless Indoor Localization", "comments": "6 pages, 11th IEEE International Conference on Networking, Sensing\n  and Control, April 7-9, 2014, Miami, FL, USA", "journal-ref": null, "doi": "10.1109/ICNSC.2014.6819631", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In wireless networks, radio-map based locating techniques are commonly used\nto cope the complex fading feature of radio signal, in which a radio-map is\nbuilt by calibrating received signal strength (RSS) signatures at training\nlocations in the offline phase. However, in severe hostile environments, such\nas in ship cabins where severe shadowing, blocking and multi-path fading\neffects are posed by ubiquitous metallic architecture, even radio-map cannot\ncapture the dynamics of RSS. In this paper, we introduced multiple feature\nradio-map location method for severely noisy environments. We proposed to add\nlow variance signature into radio map. Since the low variance signatures are\ngenerally expensive to obtain, we focus on the scenario when the low variance\nsignatures are sparse. We studied efficient construction of multi-feature\nradio-map in offline phase, and proposed feasible region narrowing down and\nparticle based algorithm for online tracking. Simulation results show the\nremarkably performance improvement in terms of positioning accuracy and\nrobustness against RSS noises than the traditional radio-map method.\n", "versions": [{"version": "v1", "created": "Sat, 14 Dec 2013 08:03:58 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Geng", "Xiongfeng", ""], ["Wang", "Yongcai", ""], ["Feng", "Haoran", ""], ["Chen", "Zhoufeng", ""]]}, {"id": "1312.4071", "submitter": "Srinjoy Ganguly Mr.", "authors": "Srinjoy Ganguly, Arpita Chakraborty and Mrinal Kanti Naskar", "title": "A Trust-based Framework for Congestion-aware Energy Efficient Routing in\n  Wireless Multimedia Sensor Networks", "comments": "5 pages, 3 figures and 0 tables. Poster Paper at the Student Research\n  Symposium of the International Conference on High Performance Computing\n  (HiPC), 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new era in wireless sensor network technology has been ushered in through\nthe introduction of multimedia sensor networks, which has a major bottleneck in\nthe form of network congestion. Congestion occurs when resources are in high\ndemand during the active period while the data processing and transmission\nspeeds lag behind the speed of the incoming traffic. This may disrupt normal\nnetwork operations by buffer overflow, packet loss, increased latency,\nexcessive energy consumption and even worse, a collapse of the entire\noperation. In this paper we propose a novel Trust Integrated Congestion-aware\nEnergy Efficient Routing algorithm (TCEER) in which the potential of a node is\ncomputed using its trust value, congestion status, residual energy, distance\nfrom the current packet-forwarding node and the distance from the base station\nusing a Fuzzy Logic Controller. The source node selects the node of highest\npotential in its one hop radio range for data transmission. Hop by hop data\nrouting from source to base station is obtained which is light-weight as well\nas energy-efficient. Finally, the merits of the proposed scheme are discussed\nby comparing it with the existing protocols and the study shows promising\nimprovements in network performance.\n", "versions": [{"version": "v1", "created": "Sat, 14 Dec 2013 17:49:43 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Ganguly", "Srinjoy", ""], ["Chakraborty", "Arpita", ""], ["Naskar", "Mrinal Kanti", ""]]}, {"id": "1312.4077", "submitter": "Srinjoy Ganguly Mr.", "authors": "Arpita Chakraborty, Srinjoy Ganguly, Mrinal Kanti Naskar and Anupam\n  Karmakar", "title": "A Trust Based Congestion Aware Hybrid Ant Colony Optimization Algorithm\n  for Energy Efficient Routing in Wireless Sensor Networks (TC-ACO)", "comments": "6 pages, 5 figures and 2 tables (Conference Paper)", "journal-ref": "Proceedings of the IEEE International Conference on Advanced\n  Computing (ICoAC)-2013, pp.XX-XX,Chennai, India, 18 - 20 December (2013)", "doi": "10.1109/ICoAC.2013.6921940", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Congestion is a problem of paramount importance in resource constrained\nWireless Sensor Networks, especially for large networks, where the traffic\nloads exceed the available capacity of the resources. Sensor nodes are prone to\nfailure and the misbehavior of these faulty nodes creates further congestion.\nThe resulting effect is a degradation in network performance, additional\ncomputation and increased energy consumption, which in turn decreases network\nlifetime. Hence, the data packet routing algorithm should consider congestion\nas one of the parameters, in addition to the role of the faulty nodes and not\nmerely energy efficient protocols. Unfortunately most of the researchers have\ntried to make the routing schemes energy efficient without considering\ncongestion factor and the effect of the faulty nodes. In this paper we have\nproposed a congestion aware, energy efficient, routing approach that utilizes\nAnt Colony Optimization algorithm, in which faulty nodes are isolated by means\nof the concept of trust. The merits of the proposed scheme are verified through\nsimulations where they are compared with other protocols.\n", "versions": [{"version": "v1", "created": "Sat, 14 Dec 2013 18:41:22 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Chakraborty", "Arpita", ""], ["Ganguly", "Srinjoy", ""], ["Naskar", "Mrinal Kanti", ""], ["Karmakar", "Anupam", ""]]}, {"id": "1312.4082", "submitter": "Asma Mesmoudi", "authors": "Asma Mesmoudi, Mohammed Feham and Nabila Labraoui", "title": "Wireless sensor networks localization algorithms: a comprehensive survey", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs) have recently gained a lot of attention by\nscientific community. Small and inexpensive devices with low energy consumption\nand limited computing resources are increasingly being adopted in different\napplication scenarios including environmental monitoring, target tracking and\nbiomedical health monitoring. In many such applications, node localization is\ninherently one of the system parameters. Localization process is necessary to\nreport the origin of events, routing and to answer questions on the network\ncoverage,assist group querying of sensors. In general, localization schemes are\nclassified into two broad categories: range-based and range-free. However, it\nis difficult to classify hybrid solutions as range-based or range-free. In this\npaper we make this classification easy, where range-based schemes and\nrange-free schemes are divided into two types: fully schemes and hybrid\nschemes. Moreover, we compare the most relevant localization algorithms and\ndiscuss the future research directions for wireless sensor networks\nlocalization schemes.\n", "versions": [{"version": "v1", "created": "Sat, 14 Dec 2013 20:07:34 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Mesmoudi", "Asma", ""], ["Feham", "Mohammed", ""], ["Labraoui", "Nabila", ""]]}, {"id": "1312.4177", "submitter": "Congduc Pham", "authors": "Congduc Pham and Mamour Diop and Ousmane Thiare", "title": "Selecting source image sensor nodes based on 2-hop information to\n  improve image transmissions to mobile robot sinks in search \\& rescue\n  operations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider Robot-assisted Search $\\&$ Rescue operations enhanced with some\nfixed image sensor nodes capable of capturing and sending visual information to\na robot sink. In order to increase the performance of image transfer from image\nsensor nodes to the robot sinks we propose a 2-hop neighborhood\ninformation-based cover set selection to determine the most relevant image\nsensor nodes to activate. Then, in order to be consistent with our proposed\napproach, a multi-path extension of Greedy Perimeter Stateless Routing (called\nT-GPSR) wherein routing decisions are also based on 2-hop neighborhood\ninformation is proposed. Simulation results show that our proposal reduces\npacket losses, enabling fast packet delivery and higher visual quality of\nreceived images at the robot sink.\n", "versions": [{"version": "v1", "created": "Sun, 15 Dec 2013 18:25:14 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Pham", "Congduc", ""], ["Diop", "Mamour", ""], ["Thiare", "Ousmane", ""]]}, {"id": "1312.4179", "submitter": "B P S Sahoo", "authors": "Satyajit Rath, B. P. S. Sahoo, S. K. Pandey and D. P. Sandha", "title": "Multi-Parameter Decision Support with Data Transmission over GSM/GPRS\n  Network: a Case Study of Landslide Monitoring", "comments": "6 pages, 2 figures, MODSOLVE 2013. Rath, Satyajit, et al.\n  \"Multi-Parameter Decision Support with Data Transmission over GSM/GPRS\n  Network: a Case Study of Landslide Monitoring.\" in: Proceedings of MODSOLVE\n  2013, CSIR-NISCAIR, New Delhi, India. May 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The planet Earth has hundreds of impact events, with some occurrences causing\nboth in terms of human casualty as well as economic losses. Such attitudes of\nearth pushed the frontiers to develop innovative monitoring strategies for the\nearth system. To make that real, although, will require coherent and real-time\ndata by observing the earth behavior contiguously. Wireless Sensor Network\n(WSN) appears to be the best suitable infrastructure to sense environmental\nparameters of our interests. In this event of earth observation, another\nimportant issue is the monitoring system with high level of precision. There\nare different types of sensors to measure the behavioral aspects of earth. The\nsensors integrated with WSN, provide an accurate and contiguous data for\nanalysis and interpretation. This paper briefly addresses earth observation and\nareas of critical importance to people and society. A case study has also been\ncarried out for disaster like Landslide in the North Eastern region of India.\nApplication software has been developed for the said study for online data\nacquisition and analysis with pre-disaster early warning system. The system\nmonitors the changing geotechnical condition of this region using various\ngeo-technical sensors like Rain gauge, In-place Inclinometer, Tilt-meter,\nPiezo-meter and Crack meter. This paper also touches upon the aspects of data\ntransmission over Global System for Mobile Communication (GSM) / General Packet\nRadio Service (GPRS) to a remote data center.\n", "versions": [{"version": "v1", "created": "Sun, 15 Dec 2013 18:45:27 GMT"}, {"version": "v2", "created": "Mon, 28 Jul 2014 05:13:49 GMT"}, {"version": "v3", "created": "Fri, 1 Aug 2014 07:32:17 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Rath", "Satyajit", ""], ["Sahoo", "B. P. S.", ""], ["Pandey", "S. K.", ""], ["Sandha", "D. P.", ""]]}, {"id": "1312.4207", "submitter": "Wei Chen", "authors": "Wei Chen, Nikos Deligiannis, Yiannis Andreopoulos, Ian J. Wassell", "title": "On the Energy Self-Sustainability of IoT via Distributed Compressed\n  Sensing", "comments": "China Communications (in preprint)", "journal-ref": "China Communications, Volume: 17, Issue 12, 2020", "doi": "10.23919/JCC.2020.12.003", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper advocates the use of the distributed compressed sensing (DCS)\nparadigm to deploy energy harvesting (EH) Internet of Thing (IoT) devices for\nenergy self-sustainability. We consider networks with signal/energy models that\ncapture the fact that both the collected signals and the harvested energy of\ndifferent devices can exhibit correlation. We provide theoretical analysis on\nthe performance of both the classical compressive sensing (CS) approach and the\nproposed distributed CS (DCS)-based approach to data acquisition for EH IoT.\nMoreover, we perform an in-depth comparison of the proposed DCS-based approach\nagainst the distributed source coding (DSC) system. These performance\ncharacterizations and comparisons embody the effect of various system phenomena\nand parameters including signal correlation, EH correlation, network size, and\nenergy availability level. Our results unveil that, the proposed approach\noffers significant increase in data gathering capability with respect to the\nCS-based approach, and offers a substantial reduction of the mean-squared error\ndistortion with respect to the DSC system.\n", "versions": [{"version": "v1", "created": "Sun, 15 Dec 2013 23:28:47 GMT"}, {"version": "v2", "created": "Thu, 13 Mar 2014 16:04:23 GMT"}, {"version": "v3", "created": "Sat, 31 Jan 2015 15:24:33 GMT"}, {"version": "v4", "created": "Fri, 11 Sep 2020 00:54:27 GMT"}], "update_date": "2021-01-28", "authors_parsed": [["Chen", "Wei", ""], ["Deligiannis", "Nikos", ""], ["Andreopoulos", "Yiannis", ""], ["Wassell", "Ian J.", ""]]}, {"id": "1312.4634", "submitter": "Sharul Agrawal", "authors": "Sharul Agrawal, Mr. Ravi Prakash and Prof. Zunnun Narmawala", "title": "Implementation of WSN which can simultaneously monitor Temperature\n  conditions and control robot for positional accuracy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sensor networks and robots are both quickly evolving fields, the union of two\nfields seems inherently symbiotic. Collecting data from stationary sensors can\nbe time consuming task and thus can be automated by adding wireless\ncommunication capabilities to the sensors. This proposed project takes\nadvantage of wireless sensor networks in remote handling environment which can\nsend signals over far distances by using a mesh topology, transfers the data\nwirelessly and also consumes low power. In this paper a testbed is created for\nwireless sensor network using custom build sensor nodes for temperature\nmonitoring in labs and to control a robot moving in another lab. The two\ntemperature sensor nodes used here consists of a Arduino microcontroller and\nXBee wireless communication module based on IEEE 802.15.4 standard while the\nrobot has inherent FPGA board as a processing unit with xbee module connected\nvia Rs-2332 cable for serial communication between zigbee device and FPGA. A\nsimple custom packet is designed so that uniformity is maintained while\ncollection of data from temperature nodes and a moving robot and passing to a\nremote terminal. The coordinator Zigbee is connected to remote terminal (PC)\nthrough its USB port where Graphical user interface (GUI) can be run to monitor\nTemperature readings and position of Robot dynamically and save those readings\nin database.\n", "versions": [{"version": "v1", "created": "Tue, 17 Dec 2013 04:15:13 GMT"}], "update_date": "2013-12-18", "authors_parsed": [["Agrawal", "Sharul", ""], ["Prakash", "Mr. Ravi", ""], ["Narmawala", "Prof. Zunnun", ""]]}, {"id": "1312.4921", "submitter": "Sundeep Rangan", "authors": "Mustafa Riza Akdeniz, Yuanpeng Liu, Mathew K. Samimi, Shu Sun, Sundeep\n  Rangan, Theodore S. Rappaport, Elza Erkip", "title": "Millimeter Wave Channel Modeling and Cellular Capacity Evaluation", "comments": "15 pages, 13 figures. arXiv admin note: substantial text overlap with\n  arXiv:1304.3963", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the severe spectrum shortage in conventional cellular bands, millimeter\nwave (mmW) frequencies between 30 and 300 GHz have been attracting growing\nattention as a possible candidate for next-generation micro- and picocellular\nwireless networks. The mmW bands offer orders of magnitude greater spectrum\nthan current cellular allocations and enable very high-dimensional antenna\narrays for further gains via beamforming and spatial multiplexing. This paper\nuses recent real-world measurements at 28 and 73 GHz in New York City to derive\ndetailed spatial statistical models of the channels and uses these models to\nprovide a realistic assessment of mmW micro- and picocellular networks in a\ndense urban deployment. Statistical models are derived for key channel\nparameters including the path loss, number of spatial clusters, angular\ndispersion and outage. It is found that, even in highly non-line-of-sight\nenvironments, strong signals can be detected 100 m to 200 m from potential cell\nsites, potentially with multiple clusters to support spatial multiplexing.\nMoreover, a system simulation based on the models predicts that mmW systems can\noffer an order of magnitude increase in capacity over current state-of-the-art\n4G cellular networks with no increase in cell density from current urban\ndeployments.\n", "versions": [{"version": "v1", "created": "Tue, 17 Dec 2013 19:58:25 GMT"}, {"version": "v2", "created": "Sat, 11 Jan 2014 20:34:28 GMT"}, {"version": "v3", "created": "Fri, 25 Apr 2014 20:49:14 GMT"}], "update_date": "2014-04-29", "authors_parsed": [["Akdeniz", "Mustafa Riza", ""], ["Liu", "Yuanpeng", ""], ["Samimi", "Mathew K.", ""], ["Sun", "Shu", ""], ["Rangan", "Sundeep", ""], ["Rappaport", "Theodore S.", ""], ["Erkip", "Elza", ""]]}, {"id": "1312.5080", "submitter": "Wolfgang John", "authors": "Wolfgang John, Kostas Pentikousis, George Agapiou, Eduardo Jacob,\n  Mario Kind, Antonio Manzalini, Fulvio Risso, Dimitri Staessens, Rebecca\n  Steinert, and Catalin Meirosu", "title": "Research Directions in Network Service Chaining", "comments": "Presented at the 2013 \"Software Defined Networking for Future\n  Networks and Services\" (SDN4FNS) conference in Trento, Italy\n  (http://sites.ieee.org/sdn4fns/). Will be published in the SDN4FNS\n  proceedings at IEEE", "journal-ref": null, "doi": "10.1109/SDN4FNS.2013.6702549", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Service Chaining (NSC) is a service deployment concept that promises\nincreased flexibility and cost efficiency for future carrier networks. NSC has\nreceived considerable attention in the standardization and research communities\nlately. However, NSC is largely undefined in the peer-reviewed literature. In\nfact, a literature review reveals that the role of NSC enabling technologies is\nup for discussion, and so are the key research challenges lying ahead. This\npaper addresses these topics by motivating our research interest towards\nadvanced dynamic NSC and detailing the main aspects to be considered in the\ncontext of carrier-grade telecommunication networks. We present design\nconsiderations and system requirements alongside use cases that illustrate the\nadvantages of adopting NSC. We detail prominent research challenges during the\ntypical lifecycle of a network service chain in an operational\ntelecommunications network, including service chain description, programming,\ndeployment, and debugging, and summarize our security considerations. We\nconclude this paper with an outlook on future work in this area.\n", "versions": [{"version": "v1", "created": "Wed, 18 Dec 2013 10:14:50 GMT"}], "update_date": "2014-02-14", "authors_parsed": [["John", "Wolfgang", ""], ["Pentikousis", "Kostas", ""], ["Agapiou", "George", ""], ["Jacob", "Eduardo", ""], ["Kind", "Mario", ""], ["Manzalini", "Antonio", ""], ["Risso", "Fulvio", ""], ["Staessens", "Dimitri", ""], ["Steinert", "Rebecca", ""], ["Meirosu", "Catalin", ""]]}, {"id": "1312.5109", "submitter": "E. T. Tchao", "authors": "E. Affum, E.T. Tchao, K. Diawuo, K. Agyekum", "title": "Wideband Parameters Analysis and Validation for Indoor radio Channel at\n  60/70/80GHz for Gigabit Wireless Communication employing Isotropic, Horn and\n  Omni directional Antenna", "comments": "International Journal of Advanced Computer Science and\n  Applications(IJACSA), Volume 4 Issue 6, 2013", "journal-ref": null, "doi": "10.14569/IJACSA.2013.040638", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, applications of millimeter (mm) waves for high-speed broadband\nwireless local area network communication systems in indoor environment are\nincreasingly gaining recognition as it provides gigabit-speed wireless\ncommunications with carrier-class performances over distances of a mile or more\ndue to spectrum availability and wider bandwidth requirements. Collectively\nreferred to as E-Band, the millimeter wave wireless technology present the\npotential to offer bandwidth delivery comparable to that of fiber optic, but\nwithout the financial and logistic challenges of deploying fiber. This paper\ninvestigates the wideband parameters using the ray tracing technique for indoor\npropagation systems with rms delay spread for Omnidirectional and Horn Antennas\nfor Bent Tunnel at 80GHz. The results obtained were 2.03 and 1.95 respectively,\nbesides, the normalized received power with 0:55fix10^8 excess delay at 70GHz\nfor Isotropic Antenna was at 0.97.\n", "versions": [{"version": "v1", "created": "Wed, 18 Dec 2013 12:30:18 GMT"}], "update_date": "2016-11-25", "authors_parsed": [["Affum", "E.", ""], ["Tchao", "E. T.", ""], ["Diawuo", "K.", ""], ["Agyekum", "K.", ""]]}, {"id": "1312.5480", "submitter": "Maurizio Bocca Ph.D.", "authors": "Maurizio Bocca, Anh Luong, Neal Patwari, Thomas Schmid", "title": "Dial It In: Rotating RF Sensors to Enhance Radio Tomography", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A radio tomographic imaging (RTI) system uses the received signal strength\n(RSS) measured by RF sensors in a static wireless network to localize people in\nthe deployment area, without having them to carry or wear an electronic device.\nThis paper addresses the fact that small-scale changes in the position and\norientation of the antenna of each RF sensor can dramatically affect imaging\nand localization performance of an RTI system. However, the best placement for\na sensor is unknown at the time of deployment. Improving performance in a\ndeployed RTI system requires the deployer to iteratively \"guess-and-retest\",\ni.e., pick a sensor to move and then re-run a calibration experiment to\ndetermine if the localization performance had improved or degraded. We present\nan RTI system of servo-nodes, RF sensors equipped with servo motors which\nautonomously \"dial it in\", i.e., change position and orientation to optimize\nthe RSS on links of the network. By doing so, the localization accuracy of the\nRTI system is quickly improved, without requiring any calibration experiment\nfrom the deployer. Experiments conducted in three indoor environments\ndemonstrate that the servo-nodes system reduces localization error on average\nby 32% compared to a standard RTI system composed of static RF sensors.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 11:05:58 GMT"}], "update_date": "2013-12-20", "authors_parsed": [["Bocca", "Maurizio", ""], ["Luong", "Anh", ""], ["Patwari", "Neal", ""], ["Schmid", "Thomas", ""]]}, {"id": "1312.5551", "submitter": "Ashok P", "authors": "A.M Nirmala, P. Subramaniam, A. Anusha priya, M. Ravi", "title": "Enriched Performance on Wireless Sensor Network using Fuzzy based\n  Clustering Technique", "comments": "In this paper fuzzy logic concept hybrid with wireless sensor\n  networking and include 5 figures and 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The wireless sensor networks combines sensing, computation, and communication\ninto a single small device. These devices depend on battery power and may be\nplaced in hostile environments replacing them becomes a tedious task. Thus\nimproving the energy of these networks becomes important. Clustering in\nwireless sensor network looks several challenges such as selection of an\noptimal group of sensor nodes as cluster, optimum selection of cluster head,\nenergy balanced optimal strategy for rotating the role of cluster head in a\ncluster, maintaining intra and inter cluster connectivity and optimal data\nrouting in the network.\n  In this paper, we study a protocol supporting an energy efficient clustering,\ncluster head selection and data routing method to extend the lifetime of sensor\nnetwork. Simulation results demonstrate that the proposed protocol prolongs\nnetwork lifetime due to the use of efficient clustering, cluster head selection\nand data routing. The results of simulation show that at the end of some\ncertain part of running the EECS and Fuzzy based clustering algorithm increases\nthe number of alive nodes comparing with the LEACH and HEED methods and this\ncan lead to an increase in sensor network lifetime. By using the EECS method\nthe total number of messages received at base station is increased when\ncompared with LEACH and HEED methods. The Fuzzy based clustering method\ncompared with the K-Means Clustering by means of iteration count and time taken\nto die first node in wireless sensor network, as the result shows that the\nfuzzy based clustering method perform well than kmeans clustering methods.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 14:00:22 GMT"}], "update_date": "2013-12-20", "authors_parsed": [["Nirmala", "A. M", ""], ["Subramaniam", "P.", ""], ["priya", "A. Anusha", ""], ["Ravi", "M.", ""]]}, {"id": "1312.5555", "submitter": "Ramy Ali", "authors": "Ramy E. Ali, Karim G. Seddik, Mohammed Nafie, and Fadel F. Digham", "title": "A Pricing-Based Cooperative Spectrum Sharing Stackelberg Game", "comments": "7 pages. IEEE, WiOpt 2014", "journal-ref": null, "doi": "10.1109/WIOPT.2014.6850303", "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of cooperative spectrum sharing among a primary user\n(PU) and multiple secondary users (SUs) under quality of service (QoS)\nconstraints. The SUs network is controlled by the PU through a relay which gets\na revenue for amplifying and forwarding the SUs signals to their respective\ndestinations. The relay charges each SU a different price depending on its\nreceived signal-to-interference and-noise ratio (SINR). The relay can control\nthe SUs network and maximize any desired PU utility function. The PU utility\nfunction represents its rate, which is affected by the SUs access, and its\ngained revenue to allow the access of the SUs. The SU network can be formulated\nas a game in which each SU wants to maximize its utility function; the problem\nis formulated as a Stackelberg game. Finally, the problem of maximizing the\nprimary utility function is solved through three different approaches, namely,\nthe optimal, the heuristic and the suboptimal algorithms.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 14:09:10 GMT"}, {"version": "v2", "created": "Sun, 23 Mar 2014 17:07:27 GMT"}, {"version": "v3", "created": "Fri, 28 Mar 2014 14:10:47 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Ali", "Ramy E.", ""], ["Seddik", "Karim G.", ""], ["Nafie", "Mohammed", ""], ["Digham", "Fadel F.", ""]]}, {"id": "1312.5739", "submitter": "Jedidiah Crandall", "authors": "Roya Ensafi, Jeffrey Knockel, Geoffrey Alexander, and Jedidiah R.\n  Crandall", "title": "Detecting Intentional Packet Drops on the Internet via TCP/IP Side\n  Channels: Extended Version", "comments": "This is the extended version of a paper from the 2014 Passive and\n  Active Measurements Conference (PAM), March 10th-11th, 2014, Los Angeles,\n  California", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a method for remotely detecting intentional packet drops on the\nInternet via side channel inferences. That is, given two arbitrary IP addresses\non the Internet that meet some simple requirements, our proposed technique can\ndiscover packet drops (e.g., due to censorship) between the two remote\nmachines, as well as infer in which direction the packet drops are occurring.\nThe only major requirements for our approach are a client with a global IP\nIdentifier (IPID) and a target server with an open port. We require no special\naccess to the client or server. Our method is robust to noise because we apply\nintervention analysis based on an autoregressive-moving-average (ARMA) model.\nIn a measurement study using our method featuring clients from multiple\ncontinents, we observed that, of all measured client connections to Tor\ndirectory servers that were censored, 98% of those were from China, and only\n0.63% of measured client connections from China to Tor directory servers were\nnot censored. This is congruent with current understandings about global\nInternet censorship, leading us to conclude that our method is effective.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 20:56:51 GMT"}], "update_date": "2013-12-20", "authors_parsed": [["Ensafi", "Roya", ""], ["Knockel", "Jeffrey", ""], ["Alexander", "Geoffrey", ""], ["Crandall", "Jedidiah R.", ""]]}, {"id": "1312.5794", "submitter": "Dong Min Kim", "authors": "Dong Min Kim, Young Ju Hwang, Seong-Lyun Kim, Gwang-Ja Jin, Bong-Soo\n  Kim", "title": "Random Basketball Routing for ZigBee based Sensor Networks", "comments": null, "journal-ref": "in Proc. IEEE APWCS 2007, Hsinchu, Taiwan, August, 2007", "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random basketball routing (BR) \\cite {Hwang} is a simple protocol that\nintegrates MAC and multihop routing in a cross-layer optimized manner. Due to\nits lightness and performance, BR would be quite suitable for sensor networks,\nwhere communication nodes are usually simple devices. In this paper, we\ndescribe how we implemented BR in a ZigBee-based (IEEE 802.15.4) sensor\nnetwork. In \\cite{Hwang}, it is verified that BR takes advantages of dynamic\nenvironments (in particular, node mobility), however, here we focus on how BR\nworks under static situations. For implementation purposes, we add some\nfeatures such as destination RSSI measuring and loop-free procedure, to the\noriginal BR. With implemented testbed, we compare the performance of BR with\nthat of the simplified AODV with CSMA/CA. The result is that BR has merits in\nterms of number of hops to traverse the network. Considering the simple\nstructure of BR and its possible energy-efficiency, we can conclude that BR can\nbe a good candidate for sensor networks both under dynamic- and static\nenvironments.\n", "versions": [{"version": "v1", "created": "Fri, 20 Dec 2013 02:35:38 GMT"}], "update_date": "2013-12-23", "authors_parsed": [["Kim", "Dong Min", ""], ["Hwang", "Young Ju", ""], ["Kim", "Seong-Lyun", ""], ["Jin", "Gwang-Ja", ""], ["Kim", "Bong-Soo", ""]]}, {"id": "1312.5892", "submitter": "Florian Schmidt", "authors": "Florian Schmidt, David Orlea, Klaus Wehrle", "title": "Support for Error Tolerance in the Real-Time Transport Protocol", "comments": "18 pages, 9 figures, published as technical report of the Department\n  of Computer Science of RWTH Aachen University", "journal-ref": null, "doi": null, "report-no": "AIB-2013-19", "categories": "cs.NI cs.IT cs.OS math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Streaming applications often tolerate bit errors in their received data well.\nThis is contrasted by the enforcement of correctness of the packet headers and\npayload by network protocols. We investigate a solution for the Real-time\nTransport Protocol (RTP) that is tolerant to errors by accepting erroneous\ndata. It passes potentially corrupted stream data payloads to the codecs. If\nerrors occur in the header, our solution recovers from these by leveraging the\nknown state and expected header values for each stream. The solution is fully\nreceiver-based and incrementally deployable, and as such requires neither\nsupport from the sender nor changes to the RTP specification. Evaluations show\nthat our header error recovery scheme can recover from almost all errors, with\nvirtually no erroneous recoveries, up to bit error rates of about 10%.\n", "versions": [{"version": "v1", "created": "Fri, 20 Dec 2013 11:11:54 GMT"}], "update_date": "2013-12-23", "authors_parsed": [["Schmidt", "Florian", ""], ["Orlea", "David", ""], ["Wehrle", "Klaus", ""]]}, {"id": "1312.6057", "submitter": "Jeffrey Wildman", "authors": "Jeffrey Wildman and Pedro H J Nardelli and Matti Latva-aho and Steven\n  Weber", "title": "On the Joint Impact of Beamwidth and Orientation Error on Throughput in\n  Directional Wireless Poisson Networks", "comments": "14 pages, 9 figures. Submitted on 2013-12-20 to IEEE Transactions on\n  Wireless Communications. Accepted on 2014-06-03 to IEEE Transactions on\n  Wireless Communications", "journal-ref": "IEEE Trans. Wireless Commun. (Vol. 13, Issue. 12, Pp. 7072--7085,\n  Dec. 2014)", "doi": "10.1109/TWC.2014.2331055", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a model for capturing the effects of beam misdirection on\ncoverage and throughput in a directional wireless network using stochastic\ngeometry. In networks employing ideal sector antennas without sidelobes, we\nfind that concavity of the orientation error distribution is sufficient to\nprove monotonicity and quasi-concavity (both with respect to antenna beamwidth)\nof spatial throughput and transmission capacity, respectively. Additionally, we\nidentify network conditions that produce opposite extremal choices in beamwidth\n(absolutely directed versus omni-directional) that maximize the two related\nthroughput metrics. We conclude our paper with a numerical exploration of the\nrelationship between mean orientation error, throughput-maximizing beamwidths,\nand maximum throughput, across radiation patterns of varied complexity.\n", "versions": [{"version": "v1", "created": "Fri, 20 Dec 2013 17:51:54 GMT"}, {"version": "v2", "created": "Thu, 12 Jun 2014 23:29:46 GMT"}], "update_date": "2015-01-06", "authors_parsed": [["Wildman", "Jeffrey", ""], ["Nardelli", "Pedro H J", ""], ["Latva-aho", "Matti", ""], ["Weber", "Steven", ""]]}, {"id": "1312.6501", "submitter": "Thomas Sandholm", "authors": "Thomas Sandholm, Boris Magnusson, Bjorn A. Johnsson", "title": "On-Demand WebRTC Tunneling in Restricted Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present the implementation of a WebRTC gateway service that\ncan forward ad-hoc RTP data plane traffic from a browser on one local network\nto a browser on another local network. The advantage compared to the existing\nIETF STUN (RFC 5389), TURN (RFC 5766) and ICE (RFC 5245) protocols is that it\ndoes not require a public host and port mapping for each participating local\nhost, and it works with more restrictive firewall policies. WebRTC implements\nICE which combines STUN and TURN probes to automatically find the best\nconnection between two peers who want to communicate. In corporate networks,\nsimple hole punching and NAT traversal techniques typically do not work, e.g.\nbecause of symmetric NATs. Dynamic allocation of ports on an external 3rd party\nrelay service is also typically blocked on restricted hosts. In our use case,\ndoctors at hospitals can only access port 80 through the hospital firewall on\nexternal machines, and they need to communicate with patients who are typically\nbehind a NAT in a local WiFi network. VPN solutions only work for staff but not\nbetween patients and staff. Our solution solves this problem by redirecting all\nWebRTC traffic through a gateway service on the local network that has a secure\ntunnel established with a public gateway. The public gateway redirects traffic\nfrom multiple concurrent streams securely between local gateway services that\nconnect to it. The local gateways also communicate with browsers on their local\nnetwork to mimic a direct browser-to-browser connection without having to\nchange the browser runtime. We have demonstrated that this technique works well\nwithin the hospital network and arbitrary patient networks, without the need\nfor any individual host configuration. In our evaluation we show that the\nlatency overhead is 18-20 ms for each concurrent stream added to the same\ngateway service.\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2013 10:02:27 GMT"}], "update_date": "2013-12-24", "authors_parsed": [["Sandholm", "Thomas", ""], ["Magnusson", "Boris", ""], ["Johnsson", "Bjorn A.", ""]]}, {"id": "1312.6552", "submitter": "Feng Xia", "authors": "Feng Xia, Li Liu, Jie Li, Jianhua Ma, Athanasios V. Vasilakos", "title": "Socially-Aware Networking: A Survey", "comments": "accepted. IEEE Systems Journal, 2013", "journal-ref": null, "doi": "10.1109/JSYST.2013.2281262", "report-no": null, "categories": "cs.SI cs.NI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The widespread proliferation of handheld devices enables mobile carriers to\nbe connected at anytime and anywhere. Meanwhile, the mobility patterns of\nmobile devices strongly depend on the users' movements, which are closely\nrelated to their social relationships and behaviors. Consequently, today's\nmobile networks are becoming increasingly human centric. This leads to the\nemergence of a new field which we call socially-aware networking (SAN). One of\nthe major features of SAN is that social awareness becomes indispensable\ninformation for the design of networking solutions. This emerging paradigm is\napplicable to various types of networks (e.g. opportunistic networks, mobile\nsocial networks, delay tolerant networks, ad hoc networks, etc) where the users\nhave social relationships and interactions. By exploiting social properties of\nnodes, SAN can provide better networking support to innovative applications and\nservices. In addition, it facilitates the convergence of human society and\ncyber physical systems. In this paper, for the first time, to the best of our\nknowledge, we present a survey of this emerging field. Basic concepts of SAN\nare introduced. We intend to generalize the widely-used social properties in\nthis regard. The state-of-the-art research on SAN is reviewed with focus on\nthree aspects: routing and forwarding, incentive mechanisms and data\ndissemination. Some important open issues with respect to mobile social sensing\nand learning, privacy, node selfishness and scalability are discussed.\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2013 14:10:54 GMT"}], "update_date": "2013-12-24", "authors_parsed": [["Xia", "Feng", ""], ["Liu", "Li", ""], ["Li", "Jie", ""], ["Ma", "Jianhua", ""], ["Vasilakos", "Athanasios V.", ""]]}, {"id": "1312.6721", "submitter": "Charith Perera", "authors": "Charith Perera, Prem Prakash Jayaraman, Arkady Zaslavsky, Peter\n  Christen, Dimitrios Georgakopoulos", "title": "Sensor Discovery and Configuration Framework for The Internet of Things\n  Paradigm", "comments": "6 pages. arXiv admin note: substantial text overlap with\n  arXiv:1311.2134", "journal-ref": "Proceedings of the IEEE World Forum on Internet of Things\n  (WF-IoT), Seoul, Korea, March, 2014", "doi": "10.1109/WF-IoT.2014.6803127", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet of Things (IoT) will comprise billions of devices that can sense,\ncommunicate, compute and potentially actuate. The data generated by the\nInternet of Things are valuable and have the potential to drive innovative and\nnovel applications. The data streams coming from these devices will challenge\nthe traditional approaches to data management and contribute to the emerging\nparadigm of big data. One of the most challenging tasks before collecting and\nprocessing data from these devices (e.g. sensors) is discovering and\nconfiguring the sensors and the associated data streams. In this paper, we\npropose a tool called SmartLink that can be used to discover and configure\nsensors. Specifically, SmartLink, is capable of discovering sensors deployed in\na particular location despite their heterogeneity (e.g. different communication\nprotocols, communication sequences, capabilities). SmartLink establishes the\ndirect communication between the sensor hardware and cloud-based IoT\nmiddleware. We address the challenge of heterogeneity using a plugin\narchitecture. Our prototype tool is developed on the Android platform. We\nevaluate the significance of our approach by discovering and configuring 52\ndifferent types of Libelium sensors.\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2013 23:40:46 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Perera", "Charith", ""], ["Jayaraman", "Prem Prakash", ""], ["Zaslavsky", "Arkady", ""], ["Christen", "Peter", ""], ["Georgakopoulos", "Dimitrios", ""]]}, {"id": "1312.6740", "submitter": "Feng Xia", "authors": "Feng Xia, Ching-Hsien Hsu, Xiaojing Liu, Fangwei Ding, Wei Zhang", "title": "The Power of Smartphones", "comments": "accepted; Multimedia Systems, 2013. arXiv admin note: text overlap\n  with arXiv:1201.0219", "journal-ref": null, "doi": "10.1007/s00530-013-0337-x", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Smartphones have been shipped with multiple wireless network interfaces in\norder to meet their diverse communication and networking demands. However, as\nsmartphones increasingly rely on wireless network connections to realize more\nfunctions, the demand of energy has been significantly increased, which has\nbecome the limit for people to explore smartphones' real power. In this paper,\nwe first review typical smartphone computing systems, energy consumption of\nsmartphone, and state-of-the-art techniques of energy saving for smartphones.\nThen we propose a location-assisted Wi-Fi discovery scheme, which discovers the\nnearest Wi-Fi network access points (APs) by using the user's location\ninformation. This allows the user to switch to the Wi-Fi interface in an\nintelligent manner when he/she arrives at the nearest Wi-Fi network AP. Thus we\ncan meet the user's bandwidth needs and provide the best connectivity.\nAdditionally, it avoids the long periods in idle state and greatly reduces the\nnumber of unnecessary Wi-Fi scans on the mobile device. Our experiments and\nsimulations demonstrate that our scheme effectively saves energy for\nsmartphones integrated with Wi-Fi and cellular interfaces.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 02:18:40 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Xia", "Feng", ""], ["Hsu", "Ching-Hsien", ""], ["Liu", "Xiaojing", ""], ["Ding", "Fangwei", ""], ["Zhang", "Wei", ""]]}, {"id": "1312.6805", "submitter": "Feng Xia", "authors": "Lin Feng, Tie Qiu, Zhenlong Sun, Feng Xia, Yu Zhou", "title": "A Coverage Strategy for Wireless Sensor Networks in a Three-dimensional\n  Environment", "comments": "accepted. Int. J. Ad Hoc and Ubiquitous Computing, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coverage is one of the fundamental issues in wireless sensor networks (WSNs).\nIt reflects the ability of WSNs to detect the fields of interest. In a real\nsensor networks application, the detection area is always non-ideal and the\nterrain of the detection area is often more complex in applications of\nthree-dimensional sensor networks. Consequently, many of the existing coverage\nstrategies cannot be directly applied to three-dimensional spaces. This paper\npresents a new coverage strategy for the three-dimensional sensor networks.\nSensor nodes are uniformly distributed. The cost factor is utilized to\nconstruct the perceived probability and the classical watershed algorithm after\nthe transformation of points from the three-dimensional space to the\ntwo-dimensional plane using the dimensionality reduction method, which can\nmaintain the topology characteristic of the non-linear terrain. The detection\nprobability in the optimal breath path is used as the measure to evaluate the\ncoverage. Simulation results indicate that the proposed strategy can determine\nthe coverage with fewer nodes, while achieving the coverage requirements of the\nnetworks.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 12:17:37 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Feng", "Lin", ""], ["Qiu", "Tie", ""], ["Sun", "Zhenlong", ""], ["Xia", "Feng", ""], ["Zhou", "Yu", ""]]}, {"id": "1312.6823", "submitter": "Feng Xia", "authors": "Tie Qiu, Yanhong Ding, Feng Xia, Honglian Ma", "title": "A Search Strategy of Level-Based Flooding for the Internet of Things", "comments": null, "journal-ref": "Sensors, 2012, 12(8):10163-10195", "doi": "10.3390/s120810163", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the query problem in the Internet of Things (IoT).\nFlooding is an important query strategy. However, original flooding is prone to\ncause heavy network loads. To address this problem, we propose a variant of\nflooding, called Level-Based Flooding (LBF). With LBF, the whole network is\ndivided into several levels according to the distances (i.e., hops) between the\nsensor nodes and the sink node. The sink node knows the level information of\neach node. Query packets are broadcast in the network according to the levels\nof nodes. Upon receiving a query packet, sensor nodes decide how to process it\naccording to the percentage of neighbors that have processed it. When the\ntarget node receives the query packet, it sends its data back to the sink node\nvia random walk. We show by extensive simulations that the performance of LBF\nin terms of cost and latency is much better than that of original flooding, and\nLBF can be used in IoT of different scales.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 14:26:39 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Qiu", "Tie", ""], ["Ding", "Yanhong", ""], ["Xia", "Feng", ""], ["Ma", "Honglian", ""]]}, {"id": "1312.6827", "submitter": "Feng Xia", "authors": "Weifeng Sun, Feng Xia, Jianhua Ma, Tong Fu, Yu Sun", "title": "An Optimal ODAM-Based Broadcast Algorithm for Vehicular Ad-Hoc Networks", "comments": null, "journal-ref": "KSII Transactions on Internet and Information Systems, 6(12):\n  3257-3274, 2012", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Broadcast routing has become an important research field for vehicular ad-hoc\nnetworks (VANETs) recently. However, the packet delivery rate is generally low\nin existing VANET broadcast routing protocols. Therefore, the design of an\nappropriate broadcast protocol based on the features of VANET has become a\ncrucial part of the development of VANET. This paper analyzes the disadvantage\nof existing broadcast routing protocols in VANETs, and proposes an improved\nalgorithm (namely ODAM-C) based on the ODAM (Optimized Dissemination of Alarm\nMessages) protocol. The ODAM-C algorithm improves the packet delivery rate by\ntwo mechanisms based on the forwarding features of ODAM. The first\ndistance-based mechanism reduces the possibility of packet loss by considering\nthe angles between source nodes, forwarding nodes and receiving nodes. The\nsecond mechanism increases the redundancy of forwarding nodes to guarantee the\npacket success delivery ratio. We show by analysis and simulations that the\nproposed algorithm can improve packet delivery rate for vehicular networks\ncompared against two widely-used existing protocols.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 14:35:25 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Sun", "Weifeng", ""], ["Xia", "Feng", ""], ["Ma", "Jianhua", ""], ["Fu", "Tong", ""], ["Sun", "Yu", ""]]}, {"id": "1312.6829", "submitter": "Feng Xia", "authors": "Tie Qiu, Yu Zhou, Feng Xia, Naigao Jin, Lin Feng", "title": "A Localization Strategy Based on N-times Trilateral Centroid with Weight", "comments": "International Journal of Communication Systems, 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Localization based on received signal strength indication (RSSI) is a low\ncost and low complexity technology, and it is widely applied in distance-based\nlocalization of wireless sensor networks (WSNs). Error of existed localization\ntechnologies is significant. This paper presents the N-times trilateral\ncentroid weighted localization algorithm (NTCWLA), which can reduce the error\nconsiderably. Considering the instability of RSSI, we use the weighted average\nof many RSSIs as current RSSI. To improve the accuracy we select a number of\n(no less than three) reliable beacon nodes to increase the localization times.\nThen we calculate the distances between reliable beacon nodes and the mobile\nnode using an empirical formula. The mobile node is located N times using the\ntrilateral centroid algorithm. Finally, we take the weighted average of the\nfiltered reference coordinates as the mobile node's coordinates. We conduct\nexperiments with the STM32W108 chip which supports IEEE 802.15.4. The results\nshow that the proposed algorithm performs better than the trilateral centroid\nalgorithm.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 14:43:35 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Qiu", "Tie", ""], ["Zhou", "Yu", ""], ["Xia", "Feng", ""], ["Jin", "Naigao", ""], ["Feng", "Lin", ""]]}, {"id": "1312.6833", "submitter": "Feng Xia", "authors": "Haifeng Liu, Feng Xia, Zhuo Yang, and Yang Cao", "title": "An Energy-Efficient Localization Strategy for Smartphones", "comments": null, "journal-ref": "Computer Science and Information Systems, Vol.8, No.4, 1117-1128,\n  2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, smartphones have become prevalent. Much attention is being\npaid to developing and making use of mobile applications that require position\ninformation. The Global Positioning System (GPS) is a very popular localization\ntechnique used by these applications because of its high accuracy. However, GPS\nincurs an unacceptable energy consumption, which severely limits the use of\nsmartphones and reduces the battery lifetime. Then an urgent requirement for\nthese applications is a localization strategy that not only provides enough\naccurate position information to meet users' need but also consumes less\nenergy. In this paper, we present an energy-efficient localization strategy for\nsmartphone applications. On one hand, it can dynamically estimate the next\nlocalization time point to avoid unnecessary localization operations. On the\nother hand, it can also automatically select the energy-optimal localization\nmethod. We evaluate the strategy through a series of simulations. Experimental\nresults show that it can significantly reduce the localization energy\nconsumption of smartphones while ensuring a good satisfaction degree.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 15:00:53 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Liu", "Haifeng", ""], ["Xia", "Feng", ""], ["Yang", "Zhuo", ""], ["Cao", "Yang", ""]]}, {"id": "1312.6837", "submitter": "Feng Xia", "authors": "Feng Xia, Alexey Vinel, Ruixia Gao, Linqiang Wang, Tie Qiu", "title": "Evaluating IEEE 802.15.4 for Cyber-Physical Systems", "comments": null, "journal-ref": "EURASIP Journal on Wireless Communications and Networking, Volume\n  2011, Article ID 596397, 2011", "doi": "10.1155/2011/596397", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With rapid advancements in sensing, networking, and computing technologies,\nrecent years have witnessed the emergence of cyber-physical systems (CPS) in a\nbroad range of application domains. CPS is a new class of engineered systems\nthat features the integration of computation, communications, and control. In\ncontrast to general-purpose computing systems, many cyber-physical applications\nare safety-cricial. These applications impose considerable requirements on\nquality of service (QoS) of the employed networking infrastruture. Since IEEE\n802.15.4 has been widely considered as a suitable protocol for CPS over\nwireless sensor and actuator networks, it is of vital importance to evaluate\nits performance extensively. Serving for this purpose, this paper will analyze\nthe performance of IEEE 802.15.4 standard operating in different modes\nrespectively. Extensive simulations have been conducted to examine how network\nQoS will be impacted by some critical parameters. The results are presented and\nanalyzed, which provide some useful insights for network parameter\nconfiguration and optimization for CPS design.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 15:09:09 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Xia", "Feng", ""], ["Vinel", "Alexey", ""], ["Gao", "Ruixia", ""], ["Wang", "Linqiang", ""], ["Qiu", "Tie", ""]]}, {"id": "1312.6911", "submitter": "Tianqing Zhou", "authors": "Tianqing Zhou, Yongming Huang, and Luxi Yang", "title": "QoS-Aware User Association for Load Balancing in Heterogeneous Cellular\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To solve the problem that the low capacity in hot-spots and coverage holes of\nconventional cellular networks, the base stations (BSs) having lower transmit\npower are deployed to form heterogeneous cellular networks (HetNets). However,\nbecause of these introduced disparate power BSs, the user distributions among\nthem looked fairly unbalanced if an appropriate user association scheme hasn't\nbeen provided. For effectively tackling this problem, we jointly consider the\nload of each BS and user's achievable rate instead of only utilizing the latter\nwhen designing an association algorithm, and formulate it as a network-wide\nweighted utility maximization problem. Note that, the load mentioned above\nrelates to the amount of required subbands decided by actual rate requirements,\ni.e., QoS, but the number of associated users, thus it can reflect user's\nactual load level. As for the proposed problem, we give a maximum probability\n(max-probability) algorithm by relaxing variables as well as a low-complexity\ndistributed algorithm with a near-optimal solution that provides a theoretical\nperformance guarantee. Experimental results show that, compared with the\nassociation strategy advocated by Ye, our strategy has a speeder convergence\nrate, a lower call blocking probability and a higher load balancing level.\n", "versions": [{"version": "v1", "created": "Wed, 25 Dec 2013 02:59:54 GMT"}, {"version": "v2", "created": "Mon, 30 Dec 2013 10:52:14 GMT"}, {"version": "v3", "created": "Sat, 4 Jan 2014 14:38:38 GMT"}], "update_date": "2014-01-07", "authors_parsed": [["Zhou", "Tianqing", ""], ["Huang", "Yongming", ""], ["Yang", "Luxi", ""]]}, {"id": "1312.6918", "submitter": "Chin Keong Ho", "authors": "Chin Keong Ho, Di Yuan, Sumei Sun", "title": "Data Offloading in Load Coupled Networks: A Utility Maximization\n  Framework", "comments": "12 pages, accepted for publication in IEEE Transactions on Wireless\n  Communications", "journal-ref": null, "doi": "10.1109/TWC.2014.021214.130809", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a general framework for the problem of data offloading in a\nheterogeneous wireless network, where some demand of cellular users is served\nby a complementary network. The complementary network is either a small-cell\nnetwork that shares the same resources as the cellular network, or a WiFi\nnetwork that uses orthogonal resources. For a given demand served in a cellular\nnetwork, the load, or the level of resource usage, of each cell depends in a\nnon-linear manner on the load of other cells due to the mutual coupling of\ninterference seen by one another. With load coupling, we optimize the demand to\nbe served in the cellular or the complementary networks, so as to maximize a\nutility function. We consider three representative utility functions that\nbalance, to varying degrees, the revenue from serving the users vs the user\nfairness. We establish conditions for which the optimization problem has a\nfeasible solution and is convex, and hence tractable to numerical computations.\nFinally, we propose a strategy with theoretical justification to constrain the\nload to some maximum value, as required for practical implementation. Numerical\nstudies are conducted for both under-loaded and over-loaded networks.\n", "versions": [{"version": "v1", "created": "Wed, 25 Dec 2013 04:24:26 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Ho", "Chin Keong", ""], ["Yuan", "Di", ""], ["Sun", "Sumei", ""]]}, {"id": "1312.6936", "submitter": "Sadeque Khan", "authors": "Arifa Ferdousi, Farhana Enam, Sadeque Reza Khan", "title": "The performance evaluation of IEEE 802.16 physical layer in the basis of\n  bit error rate considering reference channel models", "comments": "International Journal on Cybernetics & Informatics (IJCI) Vol.2,\n  No.4, August 2013", "journal-ref": null, "doi": "10.5121/ijci.2013.2403", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fixed Broadband Wireless Access is a promising technology which can offer\nhigh speed data rate from transmitting end to customer end which can offer high\nspeed text, voice, and video data. IEEE 802.16 WirelessMAN is a standard that\nspecifies medium access control layer and a set of PHY layer to fixed and\nmobile BWA in broad range of frequencies and it supports equipment\nmanufacturers due to its robust performance in multipath environment.\nConsequently WiMAX forum has adopted this version to develop the network world\nwide. In this paper the performance of IEEE 802.16 OFDM PHY Layer has been\ninvestigated by using the simulation model in Matlab. The Stanford University\nInterim (SUI) channel models are selected for the performance evaluation of\nthis standard. The Ideal Channel estimation is considered in this work and the\nperformance evaluation is observed in the basis of BER.\n", "versions": [{"version": "v1", "created": "Wed, 25 Dec 2013 07:00:29 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Ferdousi", "Arifa", ""], ["Enam", "Farhana", ""], ["Khan", "Sadeque Reza", ""]]}, {"id": "1312.7126", "submitter": "Ali Cherif Moussa", "authors": "Ali Cherif Moussa and Faraoun Mohamed Kamel", "title": "Link Quality and MAC-Overhead aware Predictive Preemptive Routing\n  Protocol for Mobile Ad hoc Network", "comments": "10 pages, 19 figures. arXiv admin note: text overlap with\n  arXiv:0907.5441 by other authors", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 10,\n  Issue 5, No 2, September 2013 ISSN (Print): 1694-0814 | ISSN (Online):\n  1694-0784", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Ad Hoc networks, route failure may occur due to less received power,\nmobility, congestion and node failures. Many approaches have been proposed in\nliterature to solve this problem, where a node predicts pre-emptively the route\nfailure that occurs with the less received power. However, this approach\nencounters some difficulties, especially in scenario without mobility where\nroute failures may arise. In this paper, we propose an improvement of AODV\nprotocol called LO-PPAODV (Link Quality and MAC-Overhead aware Predictive\nPreemptive AODV). This protocol is based on new metric combine more routing\nmetrics (Link Quality, MAC Overhead) between each node and one hop neighbor.\nAlso we propose a cross-layer networking mechanism to distinguish between both\nsituations, failures due to congestion or mobility, and consequently avoiding\nunnecessary route repair process. The LO-PPAODV was implemented using NS-2. The\nsimulation results show that our approach improves the overall performance of\nthe network. It reduces the average end to end delay, the routing overhead, MAC\nerrors and route errors, and increases the packet delivery fraction of the\nnetwork.\n", "versions": [{"version": "v1", "created": "Thu, 26 Dec 2013 16:10:24 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Moussa", "Ali Cherif", ""], ["Kamel", "Faraoun Mohamed", ""]]}, {"id": "1312.7152", "submitter": "Miguel Freitas", "authors": "Miguel Freitas", "title": "twister - a P2P microblogging platform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new microblogging architecture based on peer-to-peer\nnetworks overlays. The proposed platform is comprised of three mostly\nindependent overlay networks. The first provides distributed user registration\nand authentication and is based on the Bitcoin protocol. The second one is a\nDistributed Hash Table (DHT) overlay network providing key/value storage for\nuser resources and tracker location for the third network. The last network is\na collection of possibly disjoint \"swarms\" of followers, based on the\nBittorrent protocol, which can be used for efficient near-instant notification\ndelivery to many users. By leveraging from existing and proven technologies,\ntwister provides a new microblogging platform offering security, scalability\nand privacy features. A mechanism provides incentive for entities that\ncontribute processing time to run the user registration network, rewarding such\nentities with the privilege of sending a single unsolicited (\"promoted\")\nmessage to the entire network. The number of unsolicited messages per day is\ndefined in order to not upset users.\n", "versions": [{"version": "v1", "created": "Thu, 26 Dec 2013 22:02:00 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Freitas", "Miguel", ""]]}, {"id": "1312.7187", "submitter": "Hiroshi Saito", "authors": "Hiroshi Saito", "title": "Analysis of Geometric Disaster Evaluation Model for Physical Networks", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A geometric model of a physical network affected by a disaster is proposed\nand analyzed using integral geometry (geometric probability). This analysis\nprovides a theoretical method of evaluating performance metrics, such as the\nprobability of maintaining connectivity, and a network design rule that can\nmake the network robust against disasters.\n  The proposed model is of when the disaster area is much larger than the part\nof the network in which we are interested. Performance metrics, such as the\nprobability of maintaining connectivity, are explicitly given by linear\nfunctions of the perimeter length of convex hulls determined by physical\nroutes. The derived network design rule includes the following. (1) Reducing\nthe convex hull of the physical route reduces the expected number of nodes that\ncannot connect to the destination. (2) The probability of maintaining the\nconnectivity of two nodes on a loop cannot be changed by changing the physical\nroute of that loop. (3) The effect of introducing a loop is identical to that\nof a single physical route implemented by the straight-line route.\n", "versions": [{"version": "v1", "created": "Fri, 27 Dec 2013 04:34:31 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Saito", "Hiroshi", ""]]}, {"id": "1312.7201", "submitter": "Gao Juntao", "authors": "Juntao Gao and Yulong Shen and Xiaohong Jiang and Osamu Takahashi and\n  Norio Shiratori", "title": "End-to-End Delay Modeling for Mobile Ad Hoc Networks: A\n  Quasi-Birth-and-Death Approach", "comments": "28 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the fundamental end-to-end delay performance in mobile ad hoc\nnetworks (MANETs) is of great importance for supporting Quality of Service\n(QoS) guaranteed applications in such networks. While upper bounds and\napproximations for end-to-end delay in MANETs have been developed in\nliterature, which usually introduce significant errors in delay analysis, the\nmodeling of exact end-to-end delay in MANETs remains a technical challenge.\nThis is partially due to the highly dynamical behaviors of MANETs, but also due\nto the lack of an efficient theoretical framework to capture such dynamics.\nThis paper demonstrates the potential application of the powerful\nQuasi-Birth-and-Death (QBD) theory in tackling the challenging issue of exact\nend-to-end delay modeling in MANETs. We first apply the QBD theory to develop\nan efficient theoretical framework for capturing the complex dynamics in\nMANETs. We then show that with the help of this framework, closed form models\ncan be derived for the analysis of exact end-to-end delay and also per node\nthroughput capacity in MANETs. Simulation and numerical results are further\nprovided to illustrate the efficiency of these QBD theory-based models as well\nas our theoretical findings.\n", "versions": [{"version": "v1", "created": "Fri, 27 Dec 2013 07:18:12 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Gao", "Juntao", ""], ["Shen", "Yulong", ""], ["Jiang", "Xiaohong", ""], ["Takahashi", "Osamu", ""], ["Shiratori", "Norio", ""]]}, {"id": "1312.7442", "submitter": "Jamil Hamodi Mr.", "authors": "Jamil Hamodi, Khaled Salah, Ravindra Thool", "title": "Evaluating the Performance of IPTV over Fixed WiMAX", "comments": "9 Pages, 9 Figures. arXiv admin note: substantial text overlap with\n  other internet sources by other authors", "journal-ref": "International Journal of Computer Applications 84(6):35-43,\n  December 2013. Published by Foundation of Computer Science, New York, USA", "doi": "10.5120/14582-2812", "report-no": null, "categories": "cs.MM cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  IEEE specifies different modulation techniques for WiMAX; namely, BPSK, QPSK,\n16 QAM and 64 QAM. This paper studies the performance of Internet Protocol\nTelevision (IPTV) over Fixed WiMAX system considering different combinations of\ndigital modulation. The performance is studied taking into account a number of\nkey system parameters which include the variation in the video coding,\npath-loss, scheduling service classes different rated codes in FEC channel\ncoding. The performance study was conducted using OPNET simulation. The\nperformance is studied in terms of packet lost, packet jitter delay, end-to-end\ndelay, and network throughput. Simulation results show that higher order\nmodulation and coding schemes (namely, 16 QAM and 64 QAM) yield better\nperformance than that of QPSK.\n", "versions": [{"version": "v1", "created": "Sat, 28 Dec 2013 15:19:09 GMT"}], "update_date": "2016-01-13", "authors_parsed": [["Hamodi", "Jamil", ""], ["Salah", "Khaled", ""], ["Thool", "Ravindra", ""]]}, {"id": "1312.7513", "submitter": "Kobi Cohen", "authors": "Kobi Cohen and Amir Leshem", "title": "Distributed Game Theoretic Optimization and Management of Multichannel\n  ALOHA Networks", "comments": "34 pages, 6 figures, accepted for publication in the IEEE/ACM\n  Transactions on Networking, part of this work was presented at IEEE CAMSAP\n  2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of distributed rate maximization in multi-channel ALOHA networks\nis considered. First, we study the problem of constrained distributed rate\nmaximization, where user rates are subject to total transmission probability\nconstraints. We propose a best-response algorithm, where each user updates its\nstrategy to increase its rate according to the channel state information and\nthe current channel utilization. We prove the convergence of the algorithm to a\nNash equilibrium in both homogeneous and heterogeneous networks using the\ntheory of potential games. The performance of the best-response dynamic is\nanalyzed and compared to a simple transmission scheme, where users transmit\nover the channel with the highest collision-free utility. Then, we consider the\ncase where users are not restricted by transmission probability constraints.\nDistributed rate maximization under uncertainty is considered to achieve both\nefficiency and fairness among users. We propose a distributed scheme where\nusers adjust their transmission probability to maximize their rates according\nto the current network state, while maintaining the desired load on the\nchannels. We show that our approach plays an important role in achieving the\nNash bargaining solution among users. Sequential and parallel algorithms are\nproposed to achieve the target solution in a distributed manner. The\nefficiencies of the algorithms are demonstrated through both theoretical and\nsimulation results.\n", "versions": [{"version": "v1", "created": "Sun, 29 Dec 2013 09:39:35 GMT"}, {"version": "v2", "created": "Fri, 22 May 2015 07:58:52 GMT"}], "update_date": "2015-05-25", "authors_parsed": [["Cohen", "Kobi", ""], ["Leshem", "Amir", ""]]}, {"id": "1312.7645", "submitter": "Rob van Glabbeek", "authors": "Ansgar Fehnker, Rob van Glabbeek, Peter H\\\"ofner, Annabelle McIver,\n  Marius Portmann and Wee Lum Tan", "title": "A Process Algebra for Wireless Mesh Networks used for Modelling,\n  Verifying and Analysing AODV", "comments": null, "journal-ref": null, "doi": null, "report-no": "Technical Report 5513, NICTA, 2013", "categories": "cs.NI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose AWN (Algebra for Wireless Networks), a process algebra tailored to\nthe modelling of Mobile Ad hoc Network (MANET) and Wireless Mesh Network (WMN)\nprotocols. It combines novel treatments of local broadcast, conditional unicast\nand data structures.\n  In this framework we present a rigorous analysis of the Ad hoc On-Demand\nDistance Vector (AODV) protocol, a popular routing protocol designed for MANETs\nand WMNs, and one of the four protocols currently standardised by the IETF\nMANET working group.\n  We give a complete and unambiguous specification of this protocol, thereby\nformalising the RFC of AODV, the de facto standard specification, given in\nEnglish prose. In doing so, we had to make non-evident assumptions to resolve\nambiguities occurring in that specification. Our formalisation models the exact\ndetails of the core functionality of AODV, such as route maintenance and error\nhandling, and only omits timing aspects.\n  The process algebra allows us to formalise and (dis)prove crucial properties\nof mesh network routing protocols such as loop freedom and packet delivery. We\nare the first to provide a detailed proof of loop freedom of AODV. In contrast\nto evaluations using simulation or model checking, our proof is generic and\nholds for any possible network scenario in terms of network topology, node\nmobility, etc. Due to ambiguities and contradictions the RFC specification\nallows several interpretations; we show for more than 5000 of them whether they\nare loop free or not, thereby demonstrating how the reasoning and proofs can\nrelatively easily be adapted to protocol variants.\n  Using our formal and unambiguous specification, we find shortcomings of AODV\nthat affect performance, e.g. the establishment of non-optimal routes, and some\nroutes not being found at all. We formalise improvements in the same process\nalgebra; carrying over the proofs is again easy.\n", "versions": [{"version": "v1", "created": "Mon, 30 Dec 2013 07:18:04 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Fehnker", "Ansgar", ""], ["van Glabbeek", "Rob", ""], ["Höfner", "Peter", ""], ["McIver", "Annabelle", ""], ["Portmann", "Marius", ""], ["Tan", "Wee Lum", ""]]}, {"id": "1312.7660", "submitter": "Md. Amir Khusru  Akhtar Prof.", "authors": "Md. Amir Khusru Akhtar, G. Sahoo", "title": "Humanistic approach in mobile ad hoc network: HAMANET", "comments": "16 pages, 6 figures, 8 tables. arXiv admin note: substantial text\n  overlap with arXiv:1311.3172", "journal-ref": "Third International Conference on Computer Science & Information\n  Technology (CCSIT 2013), Bangalore, India. CS & IT - CSCP, Vol. 3, No. 6, pp.\n  1-12, Feb 2013", "doi": "10.5121/csit.2013.3601", "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human society is a complex and most organized networks, in which many\ncommunities have different cultural livelihood. The creation/formation of one\nor more communities within a society and the way of associations can be mapped\nto MANET. By involving human characteristics and behavior, surely it would pave\na new way, for further development. In this paper we have presented a new\napproach called \"HAMANET\" which is not only robust and secure but it certainly\nmeets the challenges of MANET (such as name resolution, address allocation and\nauthentication). Our object oriented design defines a service in terms of Arts,\nCulture, and Machine. The 'Art' is the smallest unit of work (defined as an\ninterface), the 'Culture' is the integration/assembling of one or more Arts\n(defined as a class) and finally the 'Machine' which is an instance of a\nCulture that defines a service. The grouping of the communicable Machines of\nthe same Culture forms a 'Community'. We have used the term 'Society' for MANET\nconsisting of one or more communities and modeled using humanistic approach. We\nhave compared our design with GloMoSim and proposed the implementation of file\ntransfer service using the said approach. Our approach gives better results in\nterms of implementation of the basic services, security, reliability,\nthroughput, extensibility, scalability etc.\n", "versions": [{"version": "v1", "created": "Mon, 30 Dec 2013 09:24:06 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Akhtar", "Md. Amir Khusru", ""], ["Sahoo", "G.", ""]]}, {"id": "1312.7685", "submitter": "Oshri Naparstek", "authors": "Oshri Naparstek (Student Member, IEEE) and Amir Leshem (Senior Member,\n  IEEE)", "title": "Fully distributed optimal channel assignment for open spectrum access", "comments": null, "journal-ref": null, "doi": "10.1109/TSP.2013.2285512", "report-no": null, "categories": "cs.DC cs.IT cs.NI math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we address the problem of fully distributed assignment of users\nto sub-bands such that the sum-rate of the system is maximized. We introduce a\nmodified auction algorithm that can be applied in a fully distributed way using\nan opportunistic CSMA assignment scheme and is $\\epsilon$ optimal. We analyze\nthe expected time complexity of the algorithm and suggest a variant to the\nalgorithm that has lower expected complexity. We then show that in the case of\ni.i.d Rayleigh channels a simple greedy scheme is asymptotically optimal as\n$\\SNR$ increases or as the number of users is increased to infinity. We\nconclude by providing simulated results of the suggested algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 30 Dec 2013 11:43:16 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Naparstek", "Oshri", "", "Student Member, IEEE"], ["Leshem", "Amir", "", "Senior Member,\n  IEEE"]]}, {"id": "1312.7844", "submitter": "Felix Ming Fai Wong", "authors": "Felix Ming Fai Wong, Carlee Joe-Wong, Sangtae Ha, Zhenming Liu, Mung\n  Chiang", "title": "Mind Your Own Bandwidth: An Edge Solution to Peak-hour Broadband\n  Congestion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by recent increases in network traffic, we propose a decentralized\nnetwork edge-based solution to peak-hour broadband congestion that incentivizes\nusers to moderate their bandwidth demands to their actual needs. Our solution\nis centered on smart home gateways that allocate bandwidth in a two-level\nhierarchy: first, a gateway purchases guaranteed bandwidth from the Internet\nService Provider (ISP) with virtual credits. It then self-limits its bandwidth\nusage and distributes the bandwidth among its apps and devices according to\ntheir relative priorities. To this end, we design a credit allocation and\nredistribution mechanism for the first level, and implement our gateways on\ncommodity wireless routers for the second level. We demonstrate our system's\neffectiveness and practicality with theoretical analysis, simulations and\nexperiments on real traffic. Compared to a baseline equal sharing algorithm,\nour solution significantly improves users' overall satisfaction and yields a\nfair allocation of bandwidth across users.\n", "versions": [{"version": "v1", "created": "Mon, 30 Dec 2013 20:06:57 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Wong", "Felix Ming Fai", ""], ["Joe-Wong", "Carlee", ""], ["Ha", "Sangtae", ""], ["Liu", "Zhenming", ""], ["Chiang", "Mung", ""]]}]