[{"id": "1310.0263", "submitter": "Noam Zeilberger", "authors": "Paul-Andr\\'e Melli\\`es and Noam Zeilberger", "title": "Type refinement and monoidal closed bifibrations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of_refinement_ in type theory is a way of reconciling the\n\"intrinsic\" and the \"extrinsic\" meanings of types. We begin with a rigorous\nanalysis of this concept, settling on the simple conclusion that the\ntype-theoretic notion of \"type refinement system\" may be identified with the\ncategory-theoretic notion of \"functor\". We then use this correspondence to give\nan equivalent type-theoretic formulation of Grothendieck's definition of\n(bi)fibration, and extend this to a definition of_monoidal closed\nbifibrations_, which we see as a natural space in which to study the properties\nof proofs and programs. Our main result is a representation theorem for strong\nmonads on a monoidal closed fibration, describing sufficient conditions for a\nmonad to be isomorphic to a continuations monad \"up to pullback\".\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 12:13:52 GMT"}], "update_date": "2013-10-02", "authors_parsed": [["Melliès", "Paul-André", ""], ["Zeilberger", "Noam", ""]]}, {"id": "1310.0576", "submitter": "Christian Retor\\'e", "authors": "Roberto Bonato and Christian Retor\\'e", "title": "Learning Lambek grammars from proof frames", "comments": "A revised version will appear in a volume in honour of Lambek 90th\n  birthday", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In addition to their limpid interface with semantics, categorial grammars\nenjoy another important property: learnability. This was first noticed by\nBuskowsky and Penn and further studied by Kanazawa, for Bar-Hillel categorial\ngrammars.\n  What about Lambek categorial grammars? In a previous paper we showed that\nproduct free Lambek grammars where learnable from structured sentences, the\nstructures being incomplete natural deductions. These grammars were shown to be\nunlearnable from strings by Foret and Le Nir. In the present paper we show that\nLambek grammars, possibly with product, are learnable from proof frames that\nare incomplete proof nets.\n  After a short reminder on grammatical inference \\`a la Gold, we provide an\nalgorithm that learns Lambek grammars with product from proof frames and we\nprove its convergence. We do so for 1-valued also known as rigid Lambek\ngrammars with product, since standard techniques can extend our result to\n$k$-valued grammars. Because of the correspondence between cut-free proof nets\nand normal natural deductions, our initial result on product free Lambek\ngrammars can be recovered.\n  We are sad to dedicate the present paper to Philippe Darondeau, with whom we\nstarted to study such questions in Rennes at the beginning of the millennium,\nand who passed away prematurely.\n  We are glad to dedicate the present paper to Jim Lambek for his 90 birthday:\nhe is the living proof that research is an eternal learning process.\n", "versions": [{"version": "v1", "created": "Wed, 2 Oct 2013 06:06:02 GMT"}], "update_date": "2013-10-03", "authors_parsed": [["Bonato", "Roberto", ""], ["Retoré", "Christian", ""]]}, {"id": "1310.0605", "submitter": "Jean-Guillaume Dumas", "authors": "Jean-Guillaume Dumas (LJK), Dominique Duval (LJK), Jean-Claude Reynaud\n  (RC)", "title": "Patterns for computational effects arising from a monad or a comonad", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents equational-based logics for proving first order\nproperties of programming languages involving effects. We propose two dual\ninference system patterns that can be instanciated with monads or comonads in\norder to be used for proving properties of different effects. The first pattern\nprovides inference rules which can be interpreted in the Kleisli category of a\nmonad and the coKleisli category of the associated comonad. In a dual way, the\nsecond pattern provides inference rules which can be interpreted in the\ncoKleisli category of a comonad and the Kleisli category of the associated\nmonad. The logics combine a 3-tier effect system for terms consisting of pure\nterms and two other kinds of effects called 'constructors/observers' and\n'modifiers', and a 2-tier system for 'up-to-effects' and 'strong' equations.\nEach pattern provides generic rules for dealing with any monad (respectively\ncomonad), and it can be extended with specific rules for each effect. The paper\npresents two use cases: a language with exceptions (using the standard monadic\nsemantics), and a language with state (using the less standard comonadic\nsemantics). Finally, we prove that the obtained inference system for states is\nHilbert-Post complete.\n", "versions": [{"version": "v1", "created": "Wed, 2 Oct 2013 07:22:06 GMT"}, {"version": "v2", "created": "Mon, 14 Oct 2013 18:50:12 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Dumas", "Jean-Guillaume", "", "LJK"], ["Duval", "Dominique", "", "LJK"], ["Reynaud", "Jean-Claude", "", "RC"]]}, {"id": "1310.0709", "submitter": "Hayato Takahashi", "authors": "Hayato Takahashi", "title": "Generalization of van Lambalgen's theorem and blind randomness for\n  conditional probabilities", "comments": "The previous version was presented at CCR2013. The current version is\n  submitted to special issue of CCR2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.IT cs.LO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generalization of the Lambalgen's theorem is studied with the notion of\nHippocratic (blind) randomness without assuming computability of conditional\nprobabilities. In [Bauwence 2014], a counter-example for the generalization of\nLambalgen's theorem is shown when the conditional probability is not\ncomputable. In this paper, it is shown that (i) finiteness of martingale for\nblind randomness, (ii) classification of two blind randomness by likelihood\nratio test, (iii) sufficient conditions for the generalization of the\nLambalgen's theorem, and (iv) an example that satisfies the Lambalgen's theorem\nbut the conditional probabilities are not computable for all random parameters.\n", "versions": [{"version": "v1", "created": "Sun, 29 Sep 2013 09:14:50 GMT"}, {"version": "v2", "created": "Mon, 15 Dec 2014 16:35:55 GMT"}, {"version": "v3", "created": "Tue, 16 Dec 2014 23:42:22 GMT"}, {"version": "v4", "created": "Tue, 30 Dec 2014 17:18:45 GMT"}, {"version": "v5", "created": "Fri, 16 Jan 2015 14:38:50 GMT"}], "update_date": "2015-01-19", "authors_parsed": [["Takahashi", "Hayato", ""]]}, {"id": "1310.0768", "submitter": "Matteo Mio", "authors": "Matteo Mio", "title": "Upper-Expectation Bisimilarity and Real-valued Modal Logics", "comments": "Preprint", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several notions of bisimulation relations for probabilistic non-deterministic\ntransition systems have been considered in the literature. We consider a novel\ntesting-based behavioral equivalence called upper-expectation bisimilarity and\ndevelop its theory using standard results from linear algebra and functional\nanalysis. We show that, for a wide class of systems, our new notion coincides\nwith Segala's convex bisimilarity. We develop logical characterizations in\nterms of expressive probabilistic modal mu-calculi and a novel real-valued\nmodal logic. We prove that upper-expectation bisimilarity is a congruence for\nthe wide family of process algebras specified following the probabilistic GSOS\nrule format.\n", "versions": [{"version": "v1", "created": "Wed, 2 Oct 2013 17:03:08 GMT"}], "update_date": "2013-10-03", "authors_parsed": [["Mio", "Matteo", ""]]}, {"id": "1310.0794", "submitter": "Jean-Guillaume Dumas", "authors": "Jean-Guillaume Dumas (LJK), Dominique Duval (LJK), Burak Ekici (LJK),\n  Damien Pous (LIP)", "title": "Formal verification in Coq of program properties involving the global\n  state effect", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The syntax of an imperative language does not mention explicitly the state,\nwhile its denotational semantics has to mention it. In this paper we present a\nframework for the verification in Coq of properties of programs manipulating\nthe global state effect. These properties are expressed in a proof system which\nis close to the syntax, as in effect systems, in the sense that the state does\nnot appear explicitly in the type of expressions which manipulate it. Rather,\nthe state appears via decorations added to terms and to equations. In this\nsystem, proofs of programs thus present two aspects: properties can be verified\n{\\em up to effects} or the effects can be taken into account. The design of our\nCoq library consequently reflects these two aspects: our framework is centered\naround the construction of two inductive and dependent types, one for terms up\nto effects and one for the manipulation of decorations.\n", "versions": [{"version": "v1", "created": "Wed, 2 Oct 2013 18:52:45 GMT"}, {"version": "v2", "created": "Mon, 14 Oct 2013 06:24:12 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Dumas", "Jean-Guillaume", "", "LJK"], ["Duval", "Dominique", "", "LJK"], ["Ekici", "Burak", "", "LJK"], ["Pous", "Damien", "", "LIP"]]}, {"id": "1310.0967", "submitter": "Marco Bardoscia", "authors": "Marco Bardoscia, Daniel Nagaj, Antonello Scardicchio", "title": "The SAT-UNSAT transition in the adversarial SAT problem", "comments": "13 pages, 8 figures", "journal-ref": "Phys. Rev. E 89, 032128 (2014)", "doi": "10.1103/PhysRevE.89.032128", "report-no": null, "categories": "cs.CC cond-mat.dis-nn cond-mat.stat-mech cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adversarial SAT (AdSAT) is a generalization of the satisfiability (SAT)\nproblem in which two players try to make a boolean formula true (resp. false)\nby controlling their respective sets of variables. AdSAT belongs to a higher\ncomplexity class in the polynomial hierarchy than SAT and therefore the nature\nof the critical region and the transition are not easily paralleled to those of\nSAT and worth of independent study. AdSAT also provides an upper bound for the\ntransition threshold of the quantum satisfiability problem (QSAT). We present a\ncomplete algorithm for AdSAT, show that 2-AdSAT is in $\\mathbf{P}$, and then\nstudy two stochastic algorithms (simulated annealing and its improved variant)\nand compare their performances in detail for 3-AdSAT. Varying the density of\nclauses $\\alpha$ we find a sharp SAT-UNSAT transition at a critical value whose\nupper bound is $\\alpha_c \\lesssim 1.5$, thus providing a much stricter upper\nbound for the QSAT transition than those previously found.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2013 13:03:20 GMT"}, {"version": "v2", "created": "Wed, 11 Dec 2013 05:28:38 GMT"}, {"version": "v3", "created": "Fri, 7 Mar 2014 19:07:59 GMT"}], "update_date": "2014-04-02", "authors_parsed": [["Bardoscia", "Marco", ""], ["Nagaj", "Daniel", ""], ["Scardicchio", "Antonello", ""]]}, {"id": "1310.1016", "submitter": "Barnaby D Martin", "authors": "Barnaby D. Martin (Middlesex University, UK.), Hubie Chen (Universidad\n  del Pais Vasco and IKERBASQUE, Basque Foundation of Science), Florent R.\n  Madelaine (Universit\\'e d'Auvergne)", "title": "Quantified Constraints and Containment Problems", "comments": "This paper is a considerably expanded journal version of a LICS 2008\n  paper of the same title together with the most significant parts of a CP 2012\n  paper from the latter two authors", "journal-ref": "Logical Methods in Computer Science, Volume 11, Issue 3 (September\n  11, 2015) lmcs:1585", "doi": "10.2168/LMCS-11(3:9)2015", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The quantified constraint satisfaction problem $\\mathrm{QCSP}(\\mathcal{A})$\nis the problem to decide whether a positive Horn sentence, involving nothing\nmore than the two quantifiers and conjunction, is true on some fixed structure\n$\\mathcal{A}$. We study two containment problems related to the QCSP. Firstly,\nwe give a combinatorial condition on finite structures $\\mathcal{A}$ and\n$\\mathcal{B}$ that is necessary and sufficient to render\n$\\mathrm{QCSP}(\\mathcal{A}) \\subseteq \\mathrm{QCSP}(\\mathcal{B})$. We prove\nthat $\\mathrm{QCSP}(\\mathcal{A}) \\subseteq \\mathrm{QCSP}(\\mathcal{B})$, that is\nall sentences of positive Horn logic true on $\\mathcal{A}$ are true on\n$\\mathcal{B}$, iff there is a surjective homomorphism from\n$\\mathcal{A}^{|A|^{|B|}}$ to $\\mathcal{B}$. This can be seen as improving an\nold result of Keisler that shows the former equivalent to there being a\nsurjective homomorphism from $\\mathcal{A}^\\omega$ to $\\mathcal{B}$. We note\nthat this condition is already necessary to guarantee containment of the\n$\\Pi_2$ restriction of the QCSP, that is $\\Pi_2$-$\\mathrm{CSP}(\\mathcal{A})\n\\subseteq \\Pi_2$-$\\mathrm{CSP}(\\mathcal{B})$. The exponent's bound of\n${|A|^{|B|}}$ places the decision procedure for the model containment problem\nin non-deterministic double-exponential time complexity. We further show the\nexponent's bound $|A|^{|B|}$ to be close to tight by giving a sequence of\nstructures $\\mathcal{A}$ together with a fixed $\\mathcal{B}$, $|B|=2$, such\nthat there is a surjective homomorphism from $\\mathcal{A}^r$ to $\\mathcal{B}$\nonly when $r \\geq |A|$. Secondly, we prove that the entailment problem for\npositive Horn fragment of first-order logic is decidable. That is, given two\nsentences $\\varphi$ and $\\psi$ of positive Horn, we give an algorithm that\ndetermines whether $\\varphi \\rightarrow \\psi$ is true in all structures\n(models). Our result is in some sense tight, since we show that the entailment\nproblem for positive first-order logic (i.e. positive Horn plus disjunction) is\nundecidable. In the final part of the paper we ponder a notion of Q-core that\nis some canonical representative among the class of templates that engender the\nsame QCSP. Although the Q-core is not as well-behaved as its better known\ncousin the core, we demonstrate that it is still a useful notion in the realm\nof QCSP complexity classifications.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2013 15:52:27 GMT"}, {"version": "v2", "created": "Tue, 26 May 2015 14:11:33 GMT"}, {"version": "v3", "created": "Thu, 10 Sep 2015 06:59:56 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Martin", "Barnaby D.", "", "Middlesex University, UK."], ["Chen", "Hubie", "", "Universidad\n  del Pais Vasco and IKERBASQUE, Basque Foundation of Science"], ["Madelaine", "Florent R.", "", "Université d'Auvergne"]]}, {"id": "1310.1316", "submitter": "Andr \\`e Frochaux", "authors": "Andr\\'e Frochaux, Nicole Schweikardt", "title": "A note on monadic datalog on unranked trees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the article 'Recursive queries on trees and data trees' (ICDT'13),\nAbiteboul et al., asked whether the containment problem for monadic datalog\nover unordered unranked labeled trees using the child relation and the\ndescendant relation is decidable. This note gives a positive answer to this\nquestion, as well as an overview of the relative expressive power of monadic\ndatalog on various representations of unranked trees.\n", "versions": [{"version": "v1", "created": "Fri, 4 Oct 2013 15:21:25 GMT"}], "update_date": "2013-10-07", "authors_parsed": [["Frochaux", "André", ""], ["Schweikardt", "Nicole", ""]]}, {"id": "1310.1500", "submitter": "Abhinav Aggarwal", "authors": "Abhinav Aggarwal and Padam Kumar", "title": "A theory of function-induced-orders to study recursion termination", "comments": "Not relevant anymore", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Termination property of functions is an important issue in computability\ntheory. In this paper, we show that repeated iterations of a function can\ninduce an order amongst the elements of its domain set. Hasse diagram of the\nposet, thus obtained, is shown to look like a forest of trees, with a possible\nbase set and a generator set (defined in the paper). Isomorphic forests may\narise for different functions and equivalences classes are, thus, formed. Based\non this analysis, a study of the class of deterministically terminating\nfunctions is presented, in which the existence of a Self-Ranking Program, which\ncan prove its own termination, and a Universal Terminating Function, from which\nevery other terminating function can be derived, is conjectured.\n", "versions": [{"version": "v1", "created": "Sat, 5 Oct 2013 17:42:54 GMT"}, {"version": "v2", "created": "Tue, 15 Aug 2017 20:15:06 GMT"}], "update_date": "2017-08-17", "authors_parsed": [["Aggarwal", "Abhinav", ""], ["Kumar", "Padam", ""]]}, {"id": "1310.1622", "submitter": "Alexis Bernadet", "authors": "Alexis Bernadet (\\'Ecole Polytechnique, France), St\\'ephane Jean\n  Lengrand (CNRS and \\'Ecole Polytechnique, France)", "title": "Non-idempotent intersection types and strong normalisation", "comments": "46 pages", "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (October\n  10, 2013) lmcs:939", "doi": "10.2168/LMCS-9(4:3)2013", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a typing system with non-idempotent intersection types, typing a\nterm syntax covering three different calculi: the pure {\\lambda}-calculus, the\ncalculus with explicit substitutions {\\lambda}S, and the calculus with explicit\nsubstitutions, contractions and weakenings {\\lambda}lxr. In each of the three\ncalculi, a term is typable if and only if it is strongly normalising, as it is\nthe case in (many) systems with idempotent intersections. Non-idempotency\nbrings extra information into typing trees, such as simple bounds on the\nlongest reduction sequence reducing a term to its normal form. Strong\nnormalisation follows, without requiring reducibility techniques. Using this,\nwe revisit models of the {\\lambda}-calculus based on filters of intersection\ntypes, and extend them to {\\lambda}S and {\\lambda}lxr. Non-idempotency\nsimplifies a methodology, based on such filter models, that produces modular\nproofs of strong normalisation for well-known typing systems (e.g. System F).\nWe also present a filter model by means of orthogonality techniques, i.e. as an\ninstance of an abstract notion of orthogonality model formalised in this paper\nand inspired by classical realisability. Compared to other instances based on\nterms (one of which rephrases a now standard proof of strong normalisation for\nthe {\\lambda}-calculus), the instance based on filters is shown to be better at\nproving strong normalisation results for {\\lambda}S and {\\lambda}lxr. Finally,\nthe bounds on the longest reduction sequence, read off our typing trees, are\nrefined into an exact measure, read off a specific typing tree (called\nprincipal); in each of the three calculi, a specific reduction sequence of such\nlength is identified. In the case of the {\\lambda}-calculus, this complexity\nresult is, for longest reduction sequences, the counterpart of de Carvalho's\nresult for linear head-reduction sequences.\n", "versions": [{"version": "v1", "created": "Sun, 6 Oct 2013 19:39:09 GMT"}, {"version": "v2", "created": "Wed, 9 Oct 2013 18:17:17 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Bernadet", "Alexis", "", "École Polytechnique, France"], ["Lengrand", "Stéphane Jean", "", "CNRS and École Polytechnique, France"]]}, {"id": "1310.1763", "submitter": "Ugo Dal Lago", "authors": "Ugo Dal Lago, Giulio Pellitta", "title": "Complexity Analysis in Presence of Control Operators and Higher-Order\n  Functions (Long Version)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A polarized version of Girard, Scedrov and Scott's Bounded Linear Logic is\nintroduced and its normalization properties studied. Following Laurent, the\nlogic naturally gives rise to a type system for the lambda-mu-calculus, whose\nderivations reveal bounds on the time complexity of the underlying term. This\nis the first example of a type system for the lambda-mu-calculus guaranteeing\ntime complexity bounds for typable programs.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 12:55:05 GMT"}], "update_date": "2013-10-08", "authors_parsed": [["Lago", "Ugo Dal", ""], ["Pellitta", "Giulio", ""]]}, {"id": "1310.1767", "submitter": "Ranko Lazic", "authors": "Ranko Lazic", "title": "The reachability problem for vector addition systems with a stack is not\n  elementary", "comments": "Informal presentation, 6th International Workshop on Reachability\n  Problems (RP), Bordeaux, September 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By adapting the iterative yardstick construction of Stockmeyer, we show that\nthe reachability problem for vector addition systems with a stack does not have\nelementary complexity. As a corollary, the same lower bound holds for the\nsatisfiability problem for a two-variable first-order logic on trees in which\nunbounded data may label only leaf nodes. Whether the two problems are\ndecidable remains an open question.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 13:00:07 GMT"}], "update_date": "2013-10-08", "authors_parsed": [["Lazic", "Ranko", ""]]}, {"id": "1310.2031", "submitter": "Lars Birkedal", "authors": "Lars Birkedal (IT University of Copenhagen), Ale\\v{s} Bizjak (Aarhus\n  University, Denmark), Jan Schwinghammer (Saarland University)", "title": "Step-Indexed Relational Reasoning for Countable Nondeterminism", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (October\n  15, 2013) lmcs:940", "doi": "10.2168/LMCS-9(4:4)2013", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Programming languages with countable nondeterministic choice are\ncomputationally interesting since countable nondeterminism arises when modeling\nfairness for concurrent systems. Because countable choice introduces\nnon-continuous behaviour, it is well-known that developing semantic models for\nprogramming languages with countable nondeterminism is challenging. We present\na step-indexed logical relations model of a higher-order functional programming\nlanguage with countable nondeterminism and demonstrate how it can be used to\nreason about contextually defined may- and must-equivalence. In earlier\nstep-indexed models, the indices have been drawn from {\\omega}. Here the\nstep-indexed relations for must-equivalence are indexed over an ordinal greater\nthan {\\omega}.\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2013 08:14:54 GMT"}, {"version": "v2", "created": "Thu, 10 Oct 2013 13:31:50 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Birkedal", "Lars", "", "IT University of Copenhagen"], ["Bizjak", "Aleš", "", "Aarhus\n  University, Denmark"], ["Schwinghammer", "Jan", "", "Saarland University"]]}, {"id": "1310.2143", "submitter": "Lo\\\"ig Jezequel", "authors": "Javier Esparza, Lo\\\"ig Jezequel and Stefan Schwoon", "title": "Computation of Summaries Using Net Unfoldings", "comments": "Extended version of our FSTTCS 2013 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the following summarization problem: given a parallel composition\nA=A1||...||An of labelled transition systems communicating with the environment\nthrough a distinguished component Ai, efficiently compute a summary Si such\nthat E||A and E||Si are trace-equivalent for every environment E. While Si can\nbe computed using elementary automata theory, the resulting algorithm suffers\nfrom the state-explosion problem. We present a new, simple but subtle algorithm\nbased on net unfoldings, a partial-order semantics, give some experimental\nresults using an implementation on top of MOLE, and show that our algorithm can\nhandle divergences and compute weighted summaries with minor modifications.\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2013 14:15:33 GMT"}], "update_date": "2013-10-09", "authors_parsed": [["Esparza", "Javier", ""], ["Jezequel", "Loïg", ""], ["Schwoon", "Stefan", ""]]}, {"id": "1310.2320", "submitter": "Tahiry  Rabehaja", "authors": "Annabelle McIver and Tahiry Rabehaja and Georg Struth", "title": "An Event Structure Model for Probabilistic Concurrent Kleene Algebra", "comments": "Submitted and accepted for LPAR19 (2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a new true-concurrent model for probabilistic concurrent Kleene\nalgebra. The model is based on probabilistic event structures, which combines\nideas from Katoen's work on probabilistic concurrency and Varacca's\nprobabilistic prime event structures. The event structures are compared with a\ntrue-concurrent version of Segala's probabilistic simulation. Finally, the\nalgebraic properties of the model are summarised to the extent that they can be\nused to derive techniques such as probabilistic rely/guarantee inference rules.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2013 01:10:38 GMT"}], "update_date": "2013-10-10", "authors_parsed": [["McIver", "Annabelle", ""], ["Rabehaja", "Tahiry", ""], ["Struth", "Georg", ""]]}, {"id": "1310.2338", "submitter": "Jean-Guillaume Dumas", "authors": "Jean-Guillaume Dumas (LJK), Dominique Duval (LJK), Burak Ekici (LJK),\n  Jean-Claude Reynaud (RC)", "title": "Certified proofs in programs involving exceptions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exception handling is provided by most modern programming languages. It\nallows to deal with anomalous or exceptional events which require special\nprocessing. In computer algebra, exception handling is an efficient way to\nimplement the dynamic evaluation paradigm: for instance, in linear algebra,\ndynamic evaluation can be used for applying programs which have been written\nfor matrices with coefficients in a field to matrices with coefficients in a\nring. Thus, a proof system for computer algebra should include a treatement of\nexceptions, which must rely on a careful description of a semantics of\nexceptions. The categorical notion of monad can be used for formalizing the\nraising of exceptions: this has been proposed by Moggi and implemented in\nHaskell. In this paper, we provide a proof system for exceptions which involves\nboth raising and handling, by extending Moggi's approach. Moreover, the core\npart of this proof system is dual to a proof system for side effects in\nimperative languages, which relies on the categorical notion of comonad. Both\nproof systems are implemented in the Coq proof assistant.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2013 04:34:08 GMT"}, {"version": "v2", "created": "Mon, 14 Oct 2013 06:23:24 GMT"}, {"version": "v3", "created": "Thu, 13 Mar 2014 19:54:03 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Dumas", "Jean-Guillaume", "", "LJK"], ["Duval", "Dominique", "", "LJK"], ["Ekici", "Burak", "", "LJK"], ["Reynaud", "Jean-Claude", "", "RC"]]}, {"id": "1310.2346", "submitter": "Vincenzo Marra", "authors": "Stefano Aguzzoli and Vincenzo Marra", "title": "Two principles in many-valued logic", "comments": "11 pages. Manuscript submitted to H\\'ajek's Festschrift", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classically, two propositions are logically equivalent precisely when they\nare true under the same logical valuations. Also, two logical valuations are\ndistinct if, and only if, there is a formula that is true according to one\nvaluation, and false according to the other. By a real-valued logic we mean a\nmany-valued logic in the sense of Petr H\\'ajek that is complete with respect to\na subalgebra of truth values of a BL-algebra given by a continuous triangular\nnorm on [0, 1]. Abstracting the two foregoing properties from classical logic\nleads us to two principles that a real-valued logic may or may not satisfy. We\nprove that the two principles are sufficient to characterise {\\L}ukasiewicz and\nG\\\"odel logic, to within extensions. We also prove that, under the additional\nassumption that the set of truth values be closed in the Euclidean topology of\n[0,1], the two principles also afford a characterisation of Product logic.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2013 04:59:06 GMT"}], "update_date": "2013-10-10", "authors_parsed": [["Aguzzoli", "Stefano", ""], ["Marra", "Vincenzo", ""]]}, {"id": "1310.2431", "submitter": "Louise Dennis Dr", "authors": "Louise A. Dennis, Michael Fisher, Nicholas K. Lincoln, Alexei Lisitsa,\n  and Sandor M. Veres", "title": "Practical Verification of Decision-Making in Agent-Based Autonomous\n  Systems", "comments": "Submitted to Journal of Automated Software Engineering", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a verification methodology for analysing the decision-making\ncomponent in agent-based hybrid systems. Traditionally hybrid automata have\nbeen used to both implement and verify such systems, but hybrid automata based\nmodelling, programming and verification techniques scale poorly as the\ncomplexity of discrete decision-making increases making them unattractive in\nsituations where complex logical reasoning is required. In the programming of\ncomplex systems it has, therefore, become common to separate out logical\ndecision-making into a separate, discrete, component. However, verification\ntechniques have failed to keep pace with this development. We are exploring\nagent-based logical components and have developed a model checking technique\nfor such components which can then be composed with a separate analysis of the\ncontinuous part of the hybrid system. Among other things this allows program\nmodel checkers to be used to verify the actual implementation of the\ndecision-making in hybrid autonomous systems.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2013 11:14:37 GMT"}], "update_date": "2013-10-10", "authors_parsed": [["Dennis", "Louise A.", ""], ["Fisher", "Michael", ""], ["Lincoln", "Nicholas K.", ""], ["Lisitsa", "Alexei", ""], ["Veres", "Sandor M.", ""]]}, {"id": "1310.2491", "submitter": "Radu Grigore", "authors": "Mikolas Janota, Radu Grigore, Joao Marques-Silva", "title": "On QBF Proofs and Preprocessing", "comments": "LPAR 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  QBFs (quantified boolean formulas), which are a superset of propositional\nformulas, provide a canonical representation for PSPACE problems. To overcome\nthe inherent complexity of QBF, significant effort has been invested in\ndeveloping QBF solvers as well as the underlying proof systems. At the same\ntime, formula preprocessing is crucial for the application of QBF solvers. This\npaper focuses on a missing link in currently-available technology: How to\nobtain a certificate (e.g. proof) for a formula that had been preprocessed\nbefore it was given to a solver? The paper targets a suite of commonly-used\npreprocessing techniques and shows how to reconstruct certificates for them. On\nthe negative side, the paper discusses certain limitations of the\ncurrently-used proof systems in the light of preprocessing. The presented\ntechniques were implemented and evaluated in the state-of-the-art QBF\npreprocessor bloqqer.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2013 14:23:27 GMT"}], "update_date": "2013-10-10", "authors_parsed": [["Janota", "Mikolas", ""], ["Grigore", "Radu", ""], ["Marques-Silva", "Joao", ""]]}, {"id": "1310.2527", "submitter": "Maxime Amblard", "authors": "Maxime Amblard (INRIA Nancy - Grand Est / LORIA, MSH Lorraine)", "title": "Treating clitics with minimalist grammars", "comments": "The 11th conference on Formal Grammar, Malaga : Spain (2006)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an extension of Stabler's version of clitics treatment for a wider\ncoverage of the French language. For this, we present the lexical entries\nneeded in the lexicon. Then, we show the recognition of complex syntactic\nphenomena as (left and right) dislo- cation, clitic climbing over modal and\nextraction from determiner phrase. The aim of this presentation is the\nsyntax-semantic interface for clitics analyses in which we will stress on\nclitic climbing over verb and raising verb.\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2013 17:19:06 GMT"}], "update_date": "2013-10-10", "authors_parsed": [["Amblard", "Maxime", "", "INRIA Nancy - Grand Est / LORIA, MSH Lorraine"]]}, {"id": "1310.2797", "submitter": "Josef Urban", "authors": "Cezary Kaliszyk and Josef Urban", "title": "Lemma Mining over HOL Light", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.DL cs.LG cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large formal mathematical libraries consist of millions of atomic inference\nsteps that give rise to a corresponding number of proved statements (lemmas).\nAnalogously to the informal mathematical practice, only a tiny fraction of such\nstatements is named and re-used in later proofs by formal mathematicians. In\nthis work, we suggest and implement criteria defining the estimated usefulness\nof the HOL Light lemmas for proving further theorems. We use these criteria to\nmine the large inference graph of all lemmas in the core HOL Light library,\nadding thousands of the best lemmas to the pool of named statements that can be\nre-used in later proofs. The usefulness of the new lemmas is then evaluated by\ncomparing the performance of automated proving of the core HOL Light theorems\nwith and without such added lemmas.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 12:53:04 GMT"}], "update_date": "2013-10-11", "authors_parsed": [["Kaliszyk", "Cezary", ""], ["Urban", "Josef", ""]]}, {"id": "1310.2805", "submitter": "Josef Urban", "authors": "Cezary Kaliszyk and Josef Urban", "title": "MizAR 40 for Mizar 40", "comments": null, "journal-ref": "J. Automated Reasoning 55(3): 245-256 (2015)", "doi": "10.1007/s10817-015-9330-8", "report-no": null, "categories": "cs.AI cs.DL cs.LG cs.LO cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As a present to Mizar on its 40th anniversary, we develop an AI/ATP system\nthat in 30 seconds of real time on a 14-CPU machine automatically proves 40% of\nthe theorems in the latest official version of the Mizar Mathematical Library\n(MML). This is a considerable improvement over previous performance of large-\ntheory AI/ATP methods measured on the whole MML. To achieve that, a large suite\nof AI/ATP methods is employed and further developed. We implement the most\nuseful methods efficiently, to scale them to the 150000 formulas in MML. This\nreduces the training times over the corpus to 1-3 seconds, allowing a simple\npractical deployment of the methods in the online automated reasoning service\nfor the Mizar users (MizAR).\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 13:24:07 GMT"}], "update_date": "2017-04-13", "authors_parsed": [["Kaliszyk", "Cezary", ""], ["Urban", "Josef", ""]]}, {"id": "1310.3032", "submitter": "Antti Kuusisto", "authors": "Antti Kuusisto", "title": "A Double Team Semantics for Generalized Quantifiers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a semantics for first-order logic with generalized quantifiers\nbased on double teams. We also define and investigate a notion of a generalized\natom. Such atoms can be used in order to define extensions of first-order logic\nwith a team-based semantics. We also define a game semantics and compare it\nwith the double team semantics.\n", "versions": [{"version": "v1", "created": "Fri, 11 Oct 2013 07:04:11 GMT"}, {"version": "v10", "created": "Tue, 30 Jun 2015 17:56:42 GMT"}, {"version": "v11", "created": "Thu, 9 Jul 2015 19:32:24 GMT"}, {"version": "v12", "created": "Mon, 11 Jan 2016 21:01:49 GMT"}, {"version": "v13", "created": "Thu, 14 Jan 2016 21:23:13 GMT"}, {"version": "v14", "created": "Thu, 10 Mar 2016 20:58:02 GMT"}, {"version": "v15", "created": "Thu, 31 Mar 2016 19:49:07 GMT"}, {"version": "v16", "created": "Thu, 14 Apr 2016 23:50:28 GMT"}, {"version": "v17", "created": "Sun, 16 Oct 2016 19:57:15 GMT"}, {"version": "v18", "created": "Mon, 17 Apr 2017 21:38:33 GMT"}, {"version": "v19", "created": "Thu, 31 Aug 2017 14:36:08 GMT"}, {"version": "v2", "created": "Sun, 2 Mar 2014 20:02:14 GMT"}, {"version": "v3", "created": "Thu, 20 Mar 2014 19:44:07 GMT"}, {"version": "v4", "created": "Wed, 2 Apr 2014 16:45:39 GMT"}, {"version": "v5", "created": "Mon, 4 Aug 2014 17:05:55 GMT"}, {"version": "v6", "created": "Fri, 22 Aug 2014 19:00:45 GMT"}, {"version": "v7", "created": "Thu, 19 Feb 2015 19:04:02 GMT"}, {"version": "v8", "created": "Sun, 21 Jun 2015 18:38:44 GMT"}, {"version": "v9", "created": "Wed, 24 Jun 2015 02:15:19 GMT"}], "update_date": "2017-09-01", "authors_parsed": [["Kuusisto", "Antti", ""]]}, {"id": "1310.3195", "submitter": "Manfred Kufleitner", "authors": "Martin Huschenbett and Manfred Kufleitner", "title": "Ehrenfeucht-Fraisse Games on Omega-Terms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fragments of first-order logic over words can often be characterized in terms\nof finite monoids or finite semigroups. Usually these algebraic descriptions\nyield decidability of the question whether a given regular language is\ndefinable in a particular fragment. An effective algebraic characterization can\nbe obtained from identities of so-called omega-terms. In order to show that a\ngiven fragment satisfies some identity of omega-terms, one can use\nEhrenfeucht-Fraisse games on word instances of the omega-terms. The resulting\nproofs often require a significant amount of book-keeping with respect to the\nconstants involved. In this paper we introduce Ehrenfeucht-Fraisse games on\nomega-terms. To this end we assign a labeled linear order to every omega-term.\nOur main theorem shows that a given fragment satisfies some identity of\nomega-terms if and only if Duplicator has a winning strategy for the game on\nthe resulting linear orders. This allows to avoid the book-keeping. As an\napplication of our main result, we show that one can decide in exponential time\nwhether all aperiodic monoids satisfy some given identity of omega-terms,\nthereby improving a result of McCammond (Int. J. Algebra Comput., 2001).\n", "versions": [{"version": "v1", "created": "Fri, 11 Oct 2013 16:57:22 GMT"}], "update_date": "2013-10-14", "authors_parsed": [["Huschenbett", "Martin", ""], ["Kufleitner", "Manfred", ""]]}, {"id": "1310.3609", "submitter": "Sean Sedwards", "authors": "Axel Legay, Sean Sedwards and Louis-Marie Traonouez", "title": "Scalable Verification of Markov Decision Processes", "comments": "V4: FMDS version, 12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC cs.LG cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Markov decision processes (MDP) are useful to model concurrent process\noptimisation problems, but verifying them with numerical methods is often\nintractable. Existing approximative approaches do not scale well and are\nlimited to memoryless schedulers. Here we present the basis of scalable\nverification for MDPSs, using an O(1) memory representation of\nhistory-dependent schedulers. We thus facilitate scalable learning techniques\nand the use of massively parallel verification.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 09:50:49 GMT"}, {"version": "v2", "created": "Mon, 10 Feb 2014 13:17:58 GMT"}, {"version": "v3", "created": "Tue, 11 Feb 2014 07:31:27 GMT"}, {"version": "v4", "created": "Wed, 17 Sep 2014 11:07:09 GMT"}], "update_date": "2014-09-18", "authors_parsed": [["Legay", "Axel", ""], ["Sedwards", "Sean", ""], ["Traonouez", "Louis-Marie", ""]]}, {"id": "1310.3656", "submitter": "Tomasz Brengos", "authors": "Tomasz Brengos (Faculty of Mathematics and Information Sciences,\n  Warsaw University of Technology)", "title": "Weak bisimulation for coalgebras over order enriched monads", "comments": "44 pages", "journal-ref": "Logical Methods in Computer Science, Volume 11, Issue 2 (June 25,\n  2015) lmcs:1574", "doi": "10.2168/LMCS-11(2:14)2015", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper introduces the notion of a weak bisimulation for coalgebras whose\ntype is a monad satisfying some extra properties. In the first part of the\npaper we argue that systems with silent moves should be modelled\ncoalgebraically as coalgebras whose type is a monad. We show that the visible\nand invisible part of the functor can be handled internally inside a monadic\nstructure. In the second part we introduce the notion of an ordered saturation\nmonad, study its properties, and show that it allows us to present two\napproaches towards defining weak bisimulation for coalgebras and compare them.\nWe support the framework presented in this paper by two main examples of\nmodels: labelled transition systems and simple Segala systems.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 12:39:47 GMT"}, {"version": "v2", "created": "Sun, 23 Feb 2014 11:23:10 GMT"}, {"version": "v3", "created": "Wed, 16 Jul 2014 17:20:43 GMT"}, {"version": "v4", "created": "Thu, 12 Mar 2015 14:15:12 GMT"}, {"version": "v5", "created": "Wed, 24 Jun 2015 10:18:20 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Brengos", "Tomasz", "", "Faculty of Mathematics and Information Sciences,\n  Warsaw University of Technology"]]}, {"id": "1310.3945", "submitter": "Vincenzo Ciancia", "authors": "Vincenzo Ciancia and Matteo Sammartino", "title": "A decidable class of (nominal) omega-regular languages over an infinite\n  alphabet", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a class of languages of infinite words over infinite alphabets, and\nthe corresponding automata. The automata used for recognition are a\ngeneralisation of deterministic Muller automata to the setting of nominal sets.\nRemarkably, the obtained languages are determined by their ultimately periodic\nfragments, as in the classical case. Closure under complement, union and\nintersection, and decidability of emptiness and equivalence are preserved by\nthe generalisation. This is shown by using finite representations of the\n(otherwise infinite-state) defined class of automata.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2013 08:04:57 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Ciancia", "Vincenzo", ""], ["Sammartino", "Matteo", ""]]}, {"id": "1310.3971", "submitter": "Giovanni Birolo", "authors": "Giovanni Birolo", "title": "A Monadic Framework for Interactive Realizability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a new presentation of interactive realizability with a more explicit\nsyntax.\n  Interactive realizability is a realizability semantics that extends the\nCurry-Howard correspondence to (sub-)classical logic, more precisely to\nfirst-order intuitionistic arithmetic (Heyting Arithmetic) extended by the law\nof the excluded middle restricted to simply existential formulas, a system\nmotivated by its applications in proof mining.\n  Monads can be used to structure functional programs by providing a clean and\nmodular way to include impure features in purely functional languages. We\nexpress interactive realizers by means of an abstract framework that applies\nthe monadic approach used in functional programming to modified realizability,\nin order to obtain more \"relaxed\" realizability notions that are suitable to\nclassical logic. In particular we use a combination of the state and exception\nmonads in order to capture the learning-from-mistakes nature of interactive\nrealizers at the syntactic level.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2013 09:00:00 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Birolo", "Giovanni", ""]]}, {"id": "1310.4019", "submitter": "EPTCS", "authors": "Marco Carbone (ITU, Denmark), Ivan Lanese (University of\n  Bologna/INRIA, Italy), Alberto Lluch Lafuente (IMT Institute for Advanced\n  Studies Lucca, Italy), Ana Sokolova (University of Salzburg, Austria)", "title": "Proceedings 6th Interaction and Concurrency Experience", "comments": null, "journal-ref": "EPTCS 131, 2013", "doi": "10.4204/EPTCS.131", "report-no": null, "categories": "cs.PL cs.DC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of ICE 2013, the 6th Interaction and\nConcurrency Experience workshop, which was held in Florence, Italy on the 6th\nof June 2013 as a satellite event of DisCoTec 2013. The ICE procedure for paper\nselection allows PC members to interact, anonymously, with authors. During the\nreview phase, each submitted paper is published on a Wiki and associated with a\ndiscussion forum whose access is restricted to the authors and to all the PC\nmembers not declaring a conflict of interests. The PC members post comments and\nquestions that the authors reply to. Each paper was reviewed by three PC\nmembers, and altogether 6 papers were accepted for publication. We were proud\nto host two invited talks, Davide Sangiorgi and Filippo Bonchi, whose abstracts\nare included in this volume together with the regular papers. The workshop also\nfeatured a brief announcement of an already published paper.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2013 12:04:04 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Carbone", "Marco", "", "ITU, Denmark"], ["Lanese", "Ivan", "", "University of\n  Bologna/INRIA, Italy"], ["Lafuente", "Alberto Lluch", "", "IMT Institute for Advanced\n  Studies Lucca, Italy"], ["Sokolova", "Ana", "", "University of Salzburg, Austria"]]}, {"id": "1310.4106", "submitter": "Marino Miculan", "authors": "Marino Miculan, Marco Peressotti", "title": "Weak bisimulations for labelled transition systems weighted over\n  semirings", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Weighted labelled transition systems are LTSs whose transitions are given\nweights drawn from a commutative monoid. WLTSs subsume a wide range of LTSs,\nproviding a general notion of strong (weighted) bisimulation. In this paper we\nextend this framework towards other behavioural equivalences, by considering\nsemirings of weights. Taking advantage of this extra structure, we introduce a\ngeneral notion of weak weighted bisimulation. We show that weak weighted\nbisimulation coincides with the usual weak bisimulations in the cases of\nnon-deterministic and fully-probabilistic systems; moreover, it naturally\nprovides a definition of weak bisimulation also for kinds of LTSs where this\nnotion is currently missing (such as, stochastic systems). Finally, we provide\na categorical account of the coalgebraic construction of weak weighted\nbisimulation; this construction points out how to port our approach to other\nequivalences based on different notion of observability.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2013 16:29:55 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Miculan", "Marino", ""], ["Peressotti", "Marco", ""]]}, {"id": "1310.4306", "submitter": "Tom Hirschowitz", "authors": "Clovis Eberhart (LAMA), Tom Hirschowitz (LAMA), Thomas Seiller (LAMA,\n  IRISA / INRIA Rennes)", "title": "Fully-abstract concurrent games for pi", "comments": "20 pages, submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a semantics for Milner's pi-calculus, with three main novelties.\nFirst, it provides a fully-abstract model for fair testing equivalence, whereas\nprevious semantics covered variants of bisimilarity and the may and must\ntesting equivalences. Second, it is based on reduction semantics, whereas\nprevious semantics were based on labelled transition systems. Finally, it has a\nstrong game semantical flavor in the sense of Hyland-Ong and Nickau. Indeed,\nour model may both be viewed as an innocent presheaf semantics and as a\nconcurrent game semantics.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2013 09:49:12 GMT"}], "update_date": "2013-10-17", "authors_parsed": [["Eberhart", "Clovis", "", "LAMA"], ["Hirschowitz", "Tom", "", "LAMA"], ["Seiller", "Thomas", "", "LAMA,\n  IRISA / INRIA Rennes"]]}, {"id": "1310.4310", "submitter": "Joelle Despeyroux", "authors": "Kaustuv Chaudhuri (INRIA Saclay - Ile de France), Joelle Despeyroux", "title": "A Hybrid Linear Logic for Constrained Transition Systems with\n  Applications to Molecular Biology", "comments": null, "journal-ref": "N&deg; RR-402942 (2013)", "doi": null, "report-no": "RR-402942", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linear implication can represent state transitions, but real transition\nsystems operate under temporal, stochastic or probabilistic constraints that\nare not directly representable in ordinary linear logic. We propose a general\nmodal extension of intuitionistic linear logic where logical truth is indexed\nby constraints and hybrid connectives combine constraint reasoning with logical\nreasoning. The logic has a focused cut-free sequent calculus that can be used\nto internalize the rules of particular constrained transition systems; we\nillustrate this with an adequate encoding of the synchronous stochastic\npi-calculus. We also present some preliminary experiments of direct encoding of\nbiological systems in the logic.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2013 09:51:16 GMT"}], "update_date": "2013-10-17", "authors_parsed": [["Chaudhuri", "Kaustuv", "", "INRIA Saclay - Ile de France"], ["Despeyroux", "Joelle", ""]]}, {"id": "1310.4367", "submitter": "Artur Je\\.z", "authors": "Artur Je\\.z", "title": "Context unification is in PSPACE", "comments": "27 pages, submitted, small notation changes and small improvements\n  over the previous text", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Contexts are terms with one `hole', i.e. a place in which we can substitute\nan argument. In context unification we are given an equation over terms with\nvariables representing contexts and ask about the satisfiability of this\nequation. Context unification is a natural subvariant of second-order\nunification, which is undecidable, and a generalization of word equations,\nwhich are decidable, at the same time. It is the unique problem between those\ntwo whose decidability is uncertain (for already almost two decades). In this\npaper we show that the context unification is in PSPACE. The result holds under\na (usual) assumption that the first-order signature is finite.\n  This result is obtained by an extension of the recompression technique,\nrecently developed by the author and used in particular to obtain a new PSPACE\nalgorithm for satisfiability of word equations, to context unification. The\nrecompression is based on performing simple compression rules (replacing pairs\nof neighbouring function symbols), which are (conceptually) applied on the\nsolution of the context equation and modifying the equation in a way so that\nsuch compression steps can be in fact performed directly on the equation,\nwithout the knowledge of the actual solution.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2013 13:17:49 GMT"}, {"version": "v2", "created": "Fri, 8 Nov 2013 15:08:17 GMT"}], "update_date": "2013-11-11", "authors_parsed": [["Jeż", "Artur", ""]]}, {"id": "1310.4571", "submitter": "EPTCS", "authors": "Eduard Baranov (Ecole Polytechnique F\\'ed\\'erale de Lausanne,\n  Switzerland), Simon Bliudze (Ecole Polytechnique F\\'ed\\'erale de Lausanne,\n  Switzerland)", "title": "Extended Connectors: Structuring Glue Operators in BIP", "comments": "In Proceedings ICE 2013, arXiv:1310.4019", "journal-ref": "EPTCS 131, 2013, pp. 20-35", "doi": "10.4204/EPTCS.131.3", "report-no": null, "categories": "cs.LO cs.PL cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on a variation of the BIP operational semantics using the offer\npredicate introduced in our previous work, we extend the algebras used to model\nglue operators in BIP to encompass priorities. This extension uses the Algebra\nof Causal Interaction Trees, T(P), as a pivot: existing transformations\nautomatically provide the extensions for the Algebra of Connectors. We then\nextend the axiomatisation of T(P), since the equivalence induced by the new\noperational semantics is weaker than that induced by the interaction semantics.\nThis extension leads to canonical normal forms for all structures and to a\nsimplification of the algorithm for the synthesis of connectors from Boolean\ncoordination constraints.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2013 03:47:49 GMT"}], "update_date": "2013-10-18", "authors_parsed": [["Baranov", "Eduard", "", "Ecole Polytechnique Fédérale de Lausanne,\n  Switzerland"], ["Bliudze", "Simon", "", "Ecole Polytechnique Fédérale de Lausanne,\n  Switzerland"]]}, {"id": "1310.4572", "submitter": "EPTCS", "authors": "Xian Xu (East China University of Science and Technology, Shanghai,\n  China P.R.)", "title": "On Context Bisimulation for Parameterized Higher-order Processes", "comments": "In Proceedings ICE 2013, arXiv:1310.4019", "journal-ref": "EPTCS 131, 2013, pp. 37-51", "doi": "10.4204/EPTCS.131.5", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies context bisimulation for higher-order processes, in the\npresence of parameterization (viz. abstraction). We show that the extension of\nhigher-order processes with process parameterization retains the\ncharacterization of context bisimulation by a much simpler form of bisimulation\ncalled normal bisimulation (viz. they are coincident), in which universal\nquantifiers are eliminated; whereas it is not the same with name\nparameterization. These results clarify further the bisimulation theory of\nhigher-order processes, and also shed light on the essential distinction\nbetween the two kinds of parameterization.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2013 03:47:57 GMT"}], "update_date": "2013-10-18", "authors_parsed": [["Xu", "Xian", "", "East China University of Science and Technology, Shanghai,\n  China P.R."]]}, {"id": "1310.4573", "submitter": "EPTCS", "authors": "Julien Lange (University of Leicester, UK), Alceste Scalas (University\n  of Cagliari, Italy)", "title": "Choreography Synthesis as Contract Agreement", "comments": "In Proceedings ICE 2013, arXiv:1310.4019", "journal-ref": "EPTCS 131, 2013, pp. 52-67", "doi": "10.4204/EPTCS.131.6", "report-no": null, "categories": "cs.LO cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a formal model for distributed systems, where each participant\nadvertises its requirements and obligations as behavioural contracts, and where\nmultiparty sessions are started when a set of contracts allows to synthesise a\nchoreography. Our framework is based on the CO2 calculus for contract-oriented\ncomputing, and borrows concepts and results from the session type literature.\n  It supports sessions where the number of participants is not determined\nbeforehand, and keeps CO2's ability to rule out participants that are culpable\nif contracts are not fulfilled at runtime. We show that we have progress and\nsession fidelity in CO2, as a result of the honesty of participants - i.e.,\ntheir ability to always adhere to their contracts.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2013 03:48:09 GMT"}], "update_date": "2013-10-18", "authors_parsed": [["Lange", "Julien", "", "University of Leicester, UK"], ["Scalas", "Alceste", "", "University\n  of Cagliari, Italy"]]}, {"id": "1310.4574", "submitter": "EPTCS", "authors": "Kyriakos Poyias (University of Leicester, UK), Emilio Tuosto\n  (University of Leicester, UK)", "title": "On Recovering from Run-time Misbehaviour in ADR", "comments": "In Proceedings ICE 2013, arXiv:1310.4019", "journal-ref": "EPTCS 131, 2013, pp. 68-84", "doi": "10.4204/EPTCS.131.7", "report-no": null, "categories": "cs.SE cs.DC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a monitoring mechanism for recording the evolution of systems\nafter certain computations, maintaining the history in a tree-like structure.\nTechnically, we develop the monitoring mechanism in a variant of ADR (after\nArchitectural Design Rewriting), a rule-based formal framework for modelling\nthe evolution of architectures of systems.\n  The hierarchical nature of ADR allows us to take full advantage of the\ntree-like structure of the monitoring mechanism. We exploit this mechanism to\nformally define new rewriting mechanisms for ADR reconfiguration rules. Also,\nby monitoring the evolution we propose a way of identifying which part of a\nsystem has been affected when unexpected run-time behaviours emerge. Moreover,\nwe propose a methodology to suggest reconfigurations that could potentially\nlead the system in a non-erroneous state.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2013 03:48:22 GMT"}], "update_date": "2013-10-18", "authors_parsed": [["Poyias", "Kyriakos", "", "University of Leicester, UK"], ["Tuosto", "Emilio", "", "University of Leicester, UK"]]}, {"id": "1310.4756", "submitter": "Andreas Wotzlaw", "authors": "Andreas Wotzlaw, Alexander van der Grinten, Ewald Speckenmeyer", "title": "Effectiveness of pre- and inprocessing for CDCL-based SAT solving", "comments": "9 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Applying pre- and inprocessing techniques to simplify CNF formulas both\nbefore and during search can considerably improve the performance of modern SAT\nsolvers. These algorithms mostly aim at reducing the number of clauses,\nliterals, and variables in the formula. However, to be worthwhile, it is\nnecessary that their additional runtime does not exceed the runtime saved\nduring the subsequent SAT solver execution. In this paper we investigate the\nefficiency and the practicability of selected simplification algorithms for\nCDCL-based SAT solving. We first analyze them by means of their expected impact\non the CNF formula and SAT solving at all. While testing them on real-world and\ncombinatorial SAT instances, we show which techniques and combinations of them\nyield a desirable speedup and which ones should be avoided.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2013 15:49:32 GMT"}], "update_date": "2013-10-18", "authors_parsed": [["Wotzlaw", "Andreas", ""], ["van der Grinten", "Alexander", ""], ["Speckenmeyer", "Ewald", ""]]}, {"id": "1310.4938", "submitter": "Andreas Wotzlaw", "authors": "Andreas Wotzlaw and Ravi Coote", "title": "A Logic-based Approach for Recognizing Textual Entailment Supported by\n  Ontological Background Knowledge", "comments": "25 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the architecture and the evaluation of a new system for\nrecognizing textual entailment (RTE). In RTE we want to identify automatically\nthe type of a logical relation between two input texts. In particular, we are\ninterested in proving the existence of an entailment between them. We conceive\nour system as a modular environment allowing for a high-coverage syntactic and\nsemantic text analysis combined with logical inference. For the syntactic and\nsemantic analysis we combine a deep semantic analysis with a shallow one\nsupported by statistical models in order to increase the quality and the\naccuracy of results. For RTE we use logical inference of first-order employing\nmodel-theoretic techniques and automated reasoning tools. The inference is\nsupported with problem-relevant background knowledge extracted automatically\nand on demand from external sources like, e.g., WordNet, YAGO, and OpenCyc, or\nother, more experimental sources with, e.g., manually defined presupposition\nresolutions, or with axiomatized general and common sense knowledge. The\nresults show that fine-grained and consistent knowledge coming from diverse\nsources is a necessary condition determining the correctness and traceability\nof results.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 08:10:32 GMT"}], "update_date": "2013-10-21", "authors_parsed": [["Wotzlaw", "Andreas", ""], ["Coote", "Ravi", ""]]}, {"id": "1310.5011", "submitter": "Inge Bethke", "authors": "Jan A. Bergstra and Inge Bethke and Alban Ponse", "title": "Equations for formally real meadows", "comments": "24 pages, 14 tables, revised, new Theorem 3.7", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.RA cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the signatures $\\Sigma_m=(0,1,-,+, \\cdot, \\ ^{-1})$ of meadows\nand $(\\Sigma_m, {\\mathbf s})$ of signed meadows. We give two complete\naxiomatizations of the equational theories of the real numbers with respect to\nthese signatures. In the first case, we extend the axiomatization of\nzero-totalized fields by a single axiom scheme expressing formal realness; the\nsecond axiomatization presupposes an ordering. We apply these completeness\nresults in order to obtain complete axiomatizations of the complex numbers.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 13:25:29 GMT"}, {"version": "v2", "created": "Wed, 29 Jan 2014 13:39:53 GMT"}, {"version": "v3", "created": "Tue, 11 Feb 2014 11:51:15 GMT"}, {"version": "v4", "created": "Tue, 13 Jan 2015 09:04:41 GMT"}], "update_date": "2015-01-14", "authors_parsed": [["Bergstra", "Jan A.", ""], ["Bethke", "Inge", ""], ["Ponse", "Alban", ""]]}, {"id": "1310.5043", "submitter": "Manfred Kufleitner", "authors": "Manfred Kufleitner and Tobias Walter", "title": "One Quantifier Alternation in First-Order Logic with Modular Predicates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adding modular predicates yields a generalization of first-order logic FO\nover words. The expressive power of FO[<,MOD] with order comparison $x<y$ and\npredicates for $x \\equiv i \\mod n$ has been investigated by Barrington,\nCompton, Straubing and Therien. The study of FO[<,MOD]-fragments was initiated\nby Chaubard, Pin and Straubing. More recently, Dartois and Paperman showed that\ndefinability in the two-variable fragment FO2[<,MOD] is decidable. In this\npaper we continue this line of work.\n  We give an effective algebraic characterization of the word languages in\nSigma2[<,MOD]. The fragment Sigma2 consists of first-order formulas in prenex\nnormal form with two blocks of quantifiers starting with an existential block.\nIn addition we show that Delta2[<,MOD], the largest subclass of Sigma2[<,MOD]\nwhich is closed under negation, has the same expressive power as two-variable\nlogic FO2[<,MOD]. This generalizes the result FO2[<] = Delta2[<] of Therien and\nWilke to modular predicates. As a byproduct, we obtain another decidable\ncharacterization of FO2[<,MOD].\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 14:52:22 GMT"}, {"version": "v2", "created": "Thu, 17 Apr 2014 08:44:04 GMT"}, {"version": "v3", "created": "Tue, 1 Jul 2014 14:28:10 GMT"}], "update_date": "2014-07-02", "authors_parsed": [["Kufleitner", "Manfred", ""], ["Walter", "Tobias", ""]]}, {"id": "1310.5363", "submitter": "Apoloniusz Tyszka", "authors": "Apoloniusz Tyszka", "title": "MuPAD codes which implement limit-computable functions that cannot be\n  bounded by any computable function", "comments": "16 pages, Theorem 1 strengthened", "journal-ref": "Annals of Computer Science and Information Systems, vol. 2, pp.\n  623-629 (2014)", "doi": "10.15439/2014F91", "report-no": null, "categories": "cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a positive integer n, let f(n) denote the smallest non-negative integer b\nsuch that for each system S \\subseteq {x_k=1,x_i+x_j=x_k,x_i*x_j=x_k: i,j,k \\in\n{1,...,n}} with a solution in non-negative integers x_1,...,x_n, there exists a\nsolution of S in {0,...,b}^n. We prove that the function f is strictly\nincreasing and dominates all computable functions. We present an infinite loop\nin MuPAD which takes as input a positive integer n and returns a non-negative\ninteger on each iteration. Let g(n,m) denote the number returned on the m-th\niteration, if n is taken as input. Then, g(n,m) \\leq m-1, 0=g(n,1)<1=g(n,2)\n\\leq g(n,3) \\leq g(n,4) \\leq ... and\ng(n,f(n))<f(n)=g(n,f(n)+1)=g(n,f(n)+2)=g(n,f(n)+3)=....\n  A MuPAD code constructed on another principle contains a repeat-until loop\nand implements a limit-computable function \\xi: N-->N that cannot be bounded by\nany computable function. This code takes as input a non-negative integer n,\nimmediately returns 0, and computes a system S of polynomial equations. If the\nloop terminates for S, then the next instruction is executed and returns\n\\xi(n).\n", "versions": [{"version": "v1", "created": "Sun, 20 Oct 2013 19:33:20 GMT"}, {"version": "v10", "created": "Wed, 19 Feb 2014 23:34:43 GMT"}, {"version": "v11", "created": "Mon, 24 Feb 2014 02:37:35 GMT"}, {"version": "v12", "created": "Tue, 11 Mar 2014 02:12:02 GMT"}, {"version": "v13", "created": "Sat, 22 Mar 2014 07:31:51 GMT"}, {"version": "v14", "created": "Wed, 26 Mar 2014 02:48:27 GMT"}, {"version": "v15", "created": "Mon, 7 Apr 2014 00:58:28 GMT"}, {"version": "v16", "created": "Tue, 15 Apr 2014 00:18:37 GMT"}, {"version": "v17", "created": "Wed, 21 May 2014 13:23:58 GMT"}, {"version": "v2", "created": "Mon, 28 Oct 2013 01:07:32 GMT"}, {"version": "v3", "created": "Tue, 26 Nov 2013 22:37:00 GMT"}, {"version": "v4", "created": "Sun, 8 Dec 2013 19:37:24 GMT"}, {"version": "v5", "created": "Thu, 12 Dec 2013 00:29:48 GMT"}, {"version": "v6", "created": "Fri, 10 Jan 2014 01:56:15 GMT"}, {"version": "v7", "created": "Mon, 20 Jan 2014 02:30:24 GMT"}, {"version": "v8", "created": "Tue, 28 Jan 2014 03:00:39 GMT"}, {"version": "v9", "created": "Thu, 13 Feb 2014 20:31:19 GMT"}], "update_date": "2014-10-09", "authors_parsed": [["Tyszka", "Apoloniusz", ""]]}, {"id": "1310.5572", "submitter": "Klaus Weihrauch", "authors": "Robert Rettinger (University of Hagen), Klaus Weihrauch (University of\n  Hagen)", "title": "Products of effective topological spaces and a uniformly computable\n  Tychonoff Theorem", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (November\n  14, 2013) lmcs:1053", "doi": "10.2168/LMCS-9(4:14)2013", "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is a fundamental study in computable analysis. In the framework\nof Type-2 effectivity, TTE, we investigate computability aspects on finite and\ninfinite products of effective topological spaces. For obtaining uniform\nresults we introduce natural multi-representations of the class of all\neffective topological spaces, of their points, of their subsets and of their\ncompact subsets. We show that the binary, finite and countable product\noperations on effective topological spaces are computable. For spaces with\nnon-empty base sets the factors can be retrieved from the products. We study\ncomputability of the product operations on points, on arbitrary subsets and on\ncompact subsets. For the case of compact sets the results are uniformly\ncomputable versions of Tychonoff's Theorem (stating that every Cartesian\nproduct of compact spaces is compact) for both, the cover multi-representation\nand the \"minimal cover\" multi-representation.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 14:40:33 GMT"}, {"version": "v2", "created": "Wed, 13 Nov 2013 09:59:51 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Rettinger", "Robert", "", "University of Hagen"], ["Weihrauch", "Klaus", "", "University of\n  Hagen"]]}, {"id": "1310.5590", "submitter": "Miha E. Habi\\v{c}", "authors": "Miha E. Habi\\v{c}", "title": "Cardinal-Recognizing Infinite Time Turing Machines", "comments": "10 pages, presented at 2013 Computability in Europe conference", "journal-ref": "The Nature of Computation. Logic, Algorithms, Applications. 9th\n  Conference on Computability in Europe, CiE 2013, Milan, Italy. pp 231-240", "doi": "10.1007/978-3-642-39053-1_27", "report-no": null, "categories": "math.LO cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a model of infinitary computation which enhances the infinite\ntime Turing machine model slightly but in a natural way by giving the machines\nthe capability of detecting cardinal stages of computation. The computational\nstrength with respect to ITTMs is determined to be precisely that of the strong\nhalting problem and the nature of the new characteristic ordinals (clockable,\nwritable, etc.) is explored.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 15:14:38 GMT"}], "update_date": "2013-10-22", "authors_parsed": [["Habič", "Miha E.", ""]]}, {"id": "1310.5656", "submitter": "Dimiter Skordev", "authors": "Dimiter Skordev (Sofia University, Faculty of Mathematics and\n  Informatics, Sofia, Bulgaria)", "title": "Approximation systems for functions in topological and in metric spaces", "comments": "21 pages, published in Logical Methods in Computer Science", "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (November\n  20, 2013) lmcs:890", "doi": "10.2168/LMCS-9(4:15)2013", "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A notable feature of the TTE approach to computability is the representation\nof the argument values and the corresponding function values by means of\ninfinitistic names. Two ways to eliminate the using of such names in certain\ncases are indicated in the paper. The first one is intended for the case of\ntopological spaces with selected indexed denumerable bases. Suppose a partial\nfunction is given from one such space into another one whose selected base has\na recursively enumerable index set, and suppose that the intersection of base\nopen sets in the first space is computable in the sense of Weihrauch-Grubba.\nThen the ordinary TTE computability of the function is characterized by the\nexistence of an appropriate recursively enumerable relation between indices of\nbase sets containing the argument value and indices of base sets containing the\ncorresponding function value.This result can be regarded as an improvement of a\nresult of Korovina and Kudinov. The second way is applicable to metric spaces\nwith selected indexed denumerable dense subsets. If a partial function is given\nfrom one such space into another one, then, under a semi-computability\nassumption concerning these spaces, the ordinary TTE computability of the\nfunction is characterized by the existence of an appropriate recursively\nenumerable set of quadruples. Any of them consists of an index of element from\nthe selected dense subset in the first space, a natural number encoding a\nrational bound for the distance between this element and the argument value, an\nindex of element from the selected dense subset in the second space and a\nnatural number encoding a rational bound for the distance between this element\nand the function value. One of the examples in the paper indicates that the\ncomputability of real functions can be characterized in a simple way by using\nthe first way of elimination of the infinitistic names.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 17:42:33 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2013 09:20:16 GMT"}, {"version": "v3", "created": "Thu, 21 Nov 2013 09:24:54 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Skordev", "Dimiter", "", "Sofia University, Faculty of Mathematics and\n  Informatics, Sofia, Bulgaria"]]}, {"id": "1310.5714", "submitter": "Massimo Lauria", "authors": "Massimo Lauria", "title": "Short $\\mathsf{Res}^*(\\mathsf{polylog})$ refutations if and only if\n  narrow $\\mathsf{Res}$ refutations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note we show that any $k$-CNF which can be refuted by a\nquasi-polynomial $\\mathsf{Res}^*(\\mathsf{polylog})$ refutation has a \"narrow\"\nrefutation in $\\mathsf{Res}$ (i.e., of poly-logarithmic width). We also show\nthe converse implication: a narrow Resolution refutation can be simulated by a\nshort $\\mathsf{Res}^*(\\mathsf{polylog})$ refutation.\n  The author does not claim priority on this result. The technical part of this\nnote bears similarity with the relation between $d$-depth Frege refutations and\ntree-like $d+1$-depth Frege refutations outlined in (Kraj\\'i\\v{c}ek 1994,\nJournal of Symbolic Logic 59, 73). Part of it had already been specialized to\n$\\mathsf{Res}$ and $\\mathsf{Res}(k)$ in (Esteban et al. 2004, Theor. Comput.\nSci. 321, 347).\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 20:03:40 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Lauria", "Massimo", ""]]}, {"id": "1310.5916", "submitter": "Matteo Bianchi", "authors": "Matteo Bianchi", "title": "A temporal semantics for Nilpotent Minimum logic", "comments": "19 pages, 2 tables", "journal-ref": null, "doi": "10.1016/j.ijar.2013.10.007", "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In [Ban97] a connection among rough sets (in particular, pre-rough algebras)\nand three-valued {\\L}ukasiewicz logic {\\L}3 is pointed out. In this paper we\npresent a temporal like semantics for Nilpotent Minimum logic NM ([Fod95,\nEG01]), in which the logic of every instant is given by {\\L}3: a completeness\ntheorem will be shown. This is the prosecution of the work initiated in [AGM08]\nand [ABM09], in which the authors construct a temporal semantics for the\nmany-valued logics of G\\\"odel ([G\\\"od32], [Dum59]) and Basic Logic ([H\\'aj98]).\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 13:45:50 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Bianchi", "Matteo", ""]]}, {"id": "1310.6176", "submitter": "J\\\"urgen Koslowski", "authors": "Giovanni Bernardi, Matthew Hennessy", "title": "Using higher-order contracts to model session types", "comments": "Added definitions of m-closed terms, of 'dual', and a discussion to\n  show the problems of the complement function", "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 2 (June 29,\n  2016) lmcs:1642", "doi": "10.2168/LMCS-12(2:10)2016", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Session types are used to describe and structure interactions between\nindependent processes in distributed systems. Higher-order types are needed in\norder to properly structure delegation of responsibility between processes.\n  In this paper we show that higher-order web-service contracts can be used to\nprovide a fully-abstract model of recursive higher-order session types. The\nmodel is set-theoretic, in the sense that the meaning of a contract is given in\nterms of the set of contracts with which it complies.\n  The proof of full-abstraction depends on a novel notion of the complement of\na contract. This in turn gives rise to an alternative to the type duality\ncommonly used in systems for type-checking session types. We believe that the\nnotion of complement captures more faithfully the behavioural intuition\nunderlying type duality.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 10:41:12 GMT"}, {"version": "v2", "created": "Fri, 25 Oct 2013 10:44:42 GMT"}, {"version": "v3", "created": "Wed, 4 Dec 2013 18:09:41 GMT"}, {"version": "v4", "created": "Sat, 23 May 2015 15:19:23 GMT"}, {"version": "v5", "created": "Fri, 29 Apr 2016 08:39:19 GMT"}, {"version": "v6", "created": "Tue, 28 Jun 2016 18:48:23 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Bernardi", "Giovanni", ""], ["Hennessy", "Matthew", ""]]}, {"id": "1310.6323", "submitter": "Burkhard C. Schipper", "authors": "Rineke Verbrugge", "title": "Logic in the Lab", "comments": "2 pages, Plenary talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p4", "categories": "cs.AI cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This file summarizes the plenary talk on laboratory experiments on logic at\nthe TARK 2013 - 14th Conference on Theoretical Aspects of Rationality and\nKnowledge.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 18:34:56 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Verbrugge", "Rineke", ""]]}, {"id": "1310.6382", "submitter": "Burkhard C. Schipper", "authors": "Burkhard C. Schipper", "title": "TARK 2013 - Proceedings of the 14. Conference on Theoretical Aspects of\n  Rationality and Knowledge", "comments": "Chennai, India, January 7 - 9, 2013, 27 articles, ISBN:\n  978-0-615-74716-3, http://www.tark.org/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The biannual TARK conferences bring together researchers from a wide variety\nof fields sharing a common interest in reasoning about rationality and\nknowledge. The impact of this tradition, going back to 1986, is apparent in\nmany of today's research trends and in the growth of an intellectual community\nbeyond traditional disciplinary boundaries. This volume documents the 14th TARK\nconference, held at the Institute of Mathematical Sciences, Chennai, India on\nJanuary 7 to 9, 2013. It includes 18 contributed talks, 8 poster presentations,\nand 3 invited talks given at the conference. Like earlier volumes in this\nseries, it gives a sense of the state of the art in studies of knowledge and\nrationality in areas such as game theory, decision theory, belief revision,\nlanguage analysis, and computation. It should be of value to researchers,\nteachers, and students.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 20:30:22 GMT"}], "update_date": "2013-10-25", "authors_parsed": [["Schipper", "Burkhard C.", ""]]}, {"id": "1310.6405", "submitter": "Burkhard C. Schipper", "authors": "Gabrielle Anderson, Matthew Collinson, David Pym", "title": "Utility-based Decision-making in Distributed Systems Modelling", "comments": "11 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p8", "categories": "cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a calculus of resources and processes as a basis for modelling\ndecision-making in multi-agent systems. The calculus represents the regulation\nof agents' choices using utility functions that take account of context.\nAssociated with the calculus is a (Hennessy Milner-style) context sensitive\nmodal logic of state. As an application, we show how a notion of `trust domain'\ncan be defined for multi-agent systems.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:02:08 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Anderson", "Gabrielle", ""], ["Collinson", "Matthew", ""], ["Pym", "David", ""]]}, {"id": "1310.6406", "submitter": "Burkhard C. Schipper", "authors": "Guillaume Aucher, Francois Schwarzentruber", "title": "On the Complexity of Dynamic Epistemic Logic", "comments": "10 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p19", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although Dynamic Epistemic Logic (DEL) is an influential logical framework\nfor representing and reasoning about information change, little is known about\nthe computational complexity of its associated decision problems. In fact, we\nonly know that for public announcement logic, a fragment of DEL, the\nsatisfiability problem and the model-checking problem are respectively\nPSPACE-complete and in P. We contribute to fill this gap by proving that for\nthe DEL language with event models, the model-checking problem is,\nsurprisingly, PSPACE-complete. Also, we prove that the satisfiability problem\nis NEXPTIME-complete. In doing so, we provide a sound and complete tableau\nmethod deciding the satisfiability problem.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:03:27 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Aucher", "Guillaume", ""], ["Schwarzentruber", "Francois", ""]]}, {"id": "1310.6407", "submitter": "Burkhard C. Schipper", "authors": "Ido Ben-Zvi, Yoram Moses", "title": "The Shape of Reactive Coordination Tasks", "comments": "10 pages, Contributed talk presented at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p29", "categories": "cs.LO cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the interaction between knowledge, time and coordination\nin systems in which timing information is available. Necessary conditions are\ngiven for the causal structure in coordination problems consisting of\norchestrating a set of actions in a manner that satisfies a variety of temporal\nordering assumptions. Results are obtained in two main steps: A specification\nof coordination is shown to require epistemic properties, and the causal\nstructure required to obtain these properties is characterised via \"knowledge\ngain\" theorems. A new causal structure called a centibroom structure is\npresented, generalising previous causal structures for this model. It is shown\nto capture coordination tasks in which a sequence of clusters of events is\nperformed in linear order, while within each cluster all actions must take\nplace simultaneously. This form of coordination is shown to require the agents\nto gain a nested common knowledge of particular facts, which in turn requires a\ncentibroom. Altogether, the results presented provide a broad view of the\ncausal shape underlying partially ordered coordinated actions. This, in turn,\nprovides insight into and can enable the design of efficient solutions to the\ncoordination tasks in question.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:04:15 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Ben-Zvi", "Ido", ""], ["Moses", "Yoram", ""]]}, {"id": "1310.6408", "submitter": "Burkhard C. Schipper", "authors": "Adam Bjorndahl, Joseph Y. Halpern, Rafael Pass", "title": "Language-based Games", "comments": "10 pages, Contributed talk presented at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p39", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce language-based games, a generalization of psychological games\n[6] that can also capture reference-dependent preferences [7]. The idea is to\nextend the domain of the utility function to situations, maximal consistent\nsets in some language. The role of the underlying language in this framework is\nthus particularly critical. Of special interest are languages that can express\nonly coarse beliefs [9]. Despite the expressive power of the approach, we show\nthat it can describe games in a simple, natural way. Nash equilibrium and\nrationalizability are generalized to this setting; Nash equilibrium is shown\nnot to exist in general, while the existence of rationalizable strategies is\nproved under mild conditions.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:05:01 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Bjorndahl", "Adam", ""], ["Halpern", "Joseph Y.", ""], ["Pass", "Rafael", ""]]}, {"id": "1310.6409", "submitter": "Burkhard C. Schipper", "authors": "Katarina Britz, Ivan Varzinczak", "title": "Defeasible Modalities", "comments": "12 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p49", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nonmonotonic logics are usually characterized by the presence of some notion\nof 'conditional' that fails monotonicity. Research on nonmonotonic logics is\ntherefore largely concerned with the defeasibility of argument forms and the\nassociated normality (or abnormality) of its constituents. In contrast,\ndefeasible modes of inference aim to formalize the defeasible aspects of modal\nnotions such as actions, obligations and knowledge. In this work we enrich the\nstandard possible worlds semantics with a preference ordering on worlds in\nKripke models. The resulting family of modal logics allow for the elegant\nexpression of defeasible modalities. We also propose a tableau calculus which\nis sound and complete with respect to our preferential semantics.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:05:39 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Britz", "Katarina", ""], ["Varzinczak", "Ivan", ""]]}, {"id": "1310.6410", "submitter": "Burkhard C. Schipper", "authors": "Hans van Ditmarsch, Tim French, Fernando R. Velazquez-Quesada, Yi N.\n  Wang", "title": "Knowledge, Awareness, and Bisimulation", "comments": "10 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p61", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We compare different epistemic notions in the presence of awareness of\npropositional variables: the logics of implicit knowledge (in which explicit\nknowledge is definable), explicit knowledge, and speculative knowledge.\nDifferent notions of bisimulation are suitable for these logics. We provide\ncorrespondence between bisimulation and modal equivalence on image-finite\nmodels for these logics. The logic of speculative knowledge is equally\nexpressive as the logic of explicit knowledge, and the logic of implicit\nknowledge is more expressive than both. We also provide axiomatizations for the\nthree logics -- only the one for speculative knowledge is novel. Then we move\nto the study of dynamics by recalling action models incorporating awareness. We\nshow that any conceivable change of knowledge or awareness can be modelled in\nthis setting, we give a complete axiomatization for the dynamic logic of\nimplicit knowledge. The dynamic versions of all three logics are, surprising,\nequally expressive.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:06:16 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["van Ditmarsch", "Hans", ""], ["French", "Tim", ""], ["Velazquez-Quesada", "Fernando R.", ""], ["Wang", "Yi N.", ""]]}, {"id": "1310.6411", "submitter": "Burkhard C. Schipper", "authors": "Eduardo Espinosa-Avila, Francisco Hernandez-Quiroz", "title": "Bounded rationality in a dynamic alternate game", "comments": "7 pages, Contributed talk presented at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p71", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  From the standpoint of game theory, dominoes is a game that has not received\nmuch attention (specially the variety known as draw). It is usually thought\nthat this game is already solved, given general results in game theory.\nHowever, the determination of equilibria is not feasible for the general case\nbecause of the well known problem of node explosion in the tree expressing the\ngame. We propose a new model based in limited forecast as a kind of bounded\nrationality for dynamic alternate games.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:06:50 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Espinosa-Avila", "Eduardo", ""], ["Hernandez-Quiroz", "Francisco", ""]]}, {"id": "1310.6414", "submitter": "Burkhard C. Schipper", "authors": "Yannai A. Gonczarowski, Yoram Moses", "title": "Timely Common Knowledge", "comments": "15 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p79", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coordinating activities at different sites of a multi-agent system typically\nimposes epistemic constraints on the participants. Specifying explicit bounds\non the relative times at which actions are performed induces combined temporal\nand epistemic constraints on when agents can perform their actions. This paper\ncharacterises the interactive epistemic state that arises when actions must\nmeet particular temporal constraints. The new state, called timely common\nknowledge, generalizes common knowledge, as well as other variants of common\nknowledge. While known variants of common knowledge are defined in terms of a\nfixed point of an epistemic formula, timely common knowledge is defined in\nterms of a vectorial fixed point of temporal-epistemic formulae. A general\nclass of coordination tasks with timing constraints is defined, and timely\ncommon knowledge is used to characterise both solvability and optimal solutions\nof such tasks. Moreover, it is shown that under natural conditions, timely\ncommon knowledge is equivalent to an infinite conjunction of temporal-epistemic\nformulae, in analogy to the popular definition of common knowledge.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:19:46 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Gonczarowski", "Yannai A.", ""], ["Moses", "Yoram", ""]]}, {"id": "1310.6416", "submitter": "Burkhard C. Schipper", "authors": "Davide Grossi, Emiliano Lorini, Francois Schwarzentruber", "title": "Ceteris Paribus Structure in Logics of Game Forms", "comments": "11 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p94", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The article introduces a ceteris paribus modal logic interpreted on the\nequivalence classes induced by sets of propositional atoms. This logic is used\nto embed two logics of agency and games, namely atemporal STIT and the\ncoalition logic of propositional control (CL-PC). The embeddings highlight a\ncommon ceteris paribus structure underpinning the key modal operators of both\nlogics, they clarify the relationship between STIT and CL-PC, and enable the\ntransfer of complexity results to the ceteris paribus logic.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:24:12 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Grossi", "Davide", ""], ["Lorini", "Emiliano", ""], ["Schwarzentruber", "Francois", ""]]}, {"id": "1310.6418", "submitter": "Burkhard C. Schipper", "authors": "Ziv Hellman", "title": "Deludedly Agreeing to Agree", "comments": "6 pages, Contributed paper at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p105", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study conditions relating to the impossibility of agreeing to disagree in\nmodels of interactive KD45 belief (in contrast to models of S5 knowledge, which\nare used in nearly all the agreements literature). We show that even when the\ntruth axiom is not assumed it turns out that players will find it impossible to\nagree to disagree under fairly broad conditions.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:29:11 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Hellman", "Ziv", ""]]}, {"id": "1310.6423", "submitter": "Burkhard C. Schipper", "authors": "X. Huang and R. van der Meyden", "title": "Symbolic Synthesis of Knowledge-based Program Implementations with\n  Synchronous Semantics", "comments": "10 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p121", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the automated synthesis of implementations of\nknowledge-based programs with respect to two synchronous semantics (clock and\nsynchronous perfect recall). An approach to the synthesis problem based on the\nuse of symbolic representations is described. The method has been implemented\nas an extension to the model checker MCK. Two applications of the implemented\nsynthesis system are presented: the muddy children puzzle (where performance is\ncompared to an explicit state method for a related problem implemented in the\nmodel checker DEMO), and a knowledge-based program for a dynamic leader\nelection problem in a ring of processes.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:50:11 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Huang", "X.", ""], ["van der Meyden", "R.", ""]]}, {"id": "1310.6424", "submitter": "Burkhard C. Schipper", "authors": "Jeffrey Kane, Pavel Naumov", "title": "Epistemic Logic for Communication Chains", "comments": "7 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p131", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper considers epistemic properties of linear communication chains. It\ndescribes a sound and complete logical system that, in addition to the standard\naxioms of S5 in a multi-modal language, contains two non-trivial axioms that\ncapture the linear structure of communication chains.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 22:53:16 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Kane", "Jeffrey", ""], ["Naumov", "Pavel", ""]]}, {"id": "1310.6429", "submitter": "Burkhard C. Schipper", "authors": "Jerome Lang, Bruno Zanuttini", "title": "Knowledge-Based Programs as Plans: Succinctness and the Complexity of\n  Plan Existence", "comments": "10 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p138", "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Knowledge-based programs (KBPs) are high-level protocols describing the\ncourse of action an agent should perform as a function of its knowledge. The\nuse of KBPs for expressing action policies in AI planning has been surprisingly\noverlooked. Given that to each KBP corresponds an equivalent plan and vice\nversa, KBPs are typically more succinct than standard plans, but imply more\non-line computation time. Here we make this argument formal, and prove that\nthere exists an exponential succinctness gap between knowledge-based programs\nand standard plans. Then we address the complexity of plan existence. Some\nresults trivially follow from results already known from the literature on\nplanning under incomplete knowledge, but many were unknown so far.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:25:44 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Lang", "Jerome", ""], ["Zanuttini", "Bruno", ""]]}, {"id": "1310.6430", "submitter": "Burkhard C. Schipper", "authors": "Pavel Naumov, Brittany Nicholls", "title": "R.E. Axiomatization of Conditional Independence", "comments": "8 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p148", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper investigates properties of the conditional independence relation\nbetween pieces of information. This relation is also known in the database\ntheory as embedded multivalued dependency. In 1980, Parker and Parsaye-Ghomi\nestablished that the properties of this relation can not be described by a\nfinite system of inference rules. In 1995, Herrmann proved that the\npropositional theory of this relation is undecidable. The main result of this\npaper is a complete recursively enumerable axiomatization of this theory.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:28:48 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Naumov", "Pavel", ""], ["Nicholls", "Brittany", ""]]}, {"id": "1310.6433", "submitter": "Burkhard C. Schipper", "authors": "Bassel Tarbush", "title": "Agreeing on Decisions: An Analysis with Counterfactuals", "comments": "8 pages, Contributed talk at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p166", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Moses & Nachum ([7]) identify conceptual flaws in Bacharach's generalization\n([3]) of Aumann's seminal \"agreeing to disagree\" result ([1]). Essentially,\nBacharach's framework requires agents' decision functions to be defined over\nevents that are informationally meaningless for the agents. In this paper, we\nargue that the analysis of the agreement theorem should be carried out in\ninformation structures that can accommodate for counterfactual states. We\ntherefore develop a method for constructing such \"counterfactual structures\"\n(starting from partitional structures), and prove a new agreement theorem\nwithin such structures. Furthermore, we show that our approach also resolves\nthe conceptual flaws in the sense that, within our framework, decision\nfunctions are always only defined over events that are informationally\nmeaningful for the agents.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:35:59 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Tarbush", "Bassel", ""]]}, {"id": "1310.6434", "submitter": "Burkhard C. Schipper", "authors": "Rodica Bozianu, Catalin Dima, Constantin Enea", "title": "Model Checking an Epistemic mu-calculus with Synchronous and Perfect\n  Recall Semantics", "comments": "10 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p175", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We identify a subproblem of the model-checking problem for the epistemic\n\\mu-calculus which is decidable. Formulas in the instances of this subproblem\nallow free variables within the scope of epistemic modalities in a restricted\nform that avoids embodying any form of common knowledge. Our subproblem\nsubsumes known decidable fragments of epistemic CTL/LTL, may express winning\nstrategies in two-player games with one player having imperfect information and\nnon-observable objectives, and, with a suitable encoding, decidable instances\nof the model-checking problem for ATLiR.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:39:35 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Bozianu", "Rodica", ""], ["Dima", "Catalin", ""], ["Enea", "Constantin", ""]]}, {"id": "1310.6435", "submitter": "Burkhard C. Schipper", "authors": "Torben Brauner", "title": "Hybrid-Logical Reasoning in False-Belief Tasks", "comments": "10 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p186", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main aim of the present paper is to use a proof system for hybrid modal\nlogic to formalize what are called falsebelief tasks in cognitive psychology,\nthereby investigating the interplay between cognition and logical reasoning\nabout belief. We consider two different versions of the Smarties task,\ninvolving respectively a shift of perspective to another person and to another\ntime. Our formalizations disclose that despite this difference, the two\nversions of the Smarties task have exactly the same underlying logical\nstructure. We also consider the Sally-Anne task, having a somewhat more\ncomplicated logical structure, presupposing a \"principle of inertia\" saying\nthat a belief is preserved over time, unless there is belief to the contrary.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:42:41 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Brauner", "Torben", ""]]}, {"id": "1310.6436", "submitter": "Burkhard C. Schipper", "authors": "Hans van Ditmarsch, Jerome Lang, Abdallah Saffidine", "title": "Strategic Voting and the Logic of Knowledge", "comments": "10 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p196", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general framework for strategic voting when a voter may lack\nknowledge about other votes or about other voters' knowledge about her own\nvote. In this setting we define notions of manipulation and equilibrium. We\nalso model action changing knowledge about votes, such as a voter revealing its\npreference or as a central authority performing a voting poll. Some forms of\nmanipulation are preserved under such updates and others not. Another form of\nknowledge dynamics is the effect of a voter declaring its vote. We envisage\nStackelberg games for uncertain profiles. The purpose of this investigation is\nto provide the epistemic background for the analysis and design of voting rules\nthat incorporate uncertainty.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:45:28 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["van Ditmarsch", "Hans", ""], ["Lang", "Jerome", ""], ["Saffidine", "Abdallah", ""]]}, {"id": "1310.6437", "submitter": "Burkhard C. Schipper", "authors": "Jan van Eijck", "title": "PDL as a Multi-Agent Strategy Logic", "comments": "10 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p206", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Propositional Dynamic Logic or PDL was invented as a logic for reasoning\nabout regular programming constructs. We propose a new perspective on PDL as a\nmulti-agent strategic logic (MASL). This logic for strategic reasoning has\ngroup strategies as first class citizens, and brings game logic closer to\nstandard modal logic. We demonstrate that MASL can express key notions of game\ntheory, social choice theory and voting theory in a natural way, we give a\nsound and complete proof system for MASL, and we show that MASL encodes\ncoalition logic. Next, we extend the language to epistemic multi-agent\nstrategic logic (EMASL), we give examples of what it can express, we propose to\nuse it for posing new questions in epistemic social choice theory, and we give\na calculus for reasoning about a natural class of epistemic game models. We end\nby listing avenues for future research and by tracing connections to a number\nof other logics for reasoning about strategies.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:47:30 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["van Eijck", "Jan", ""]]}, {"id": "1310.6438", "submitter": "Burkhard C. Schipper", "authors": "Joseph Y. Halpern, Rafael Pass", "title": "Game Theory with Translucent Players", "comments": "6 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p216", "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A traditional assumption in game theory is that players are opaque to one\nanother -- if a player changes strategies, then this change in strategies does\nnot affect the choice of other players' strategies. In many situations this is\nan unrealistic assumption. We develop a framework for reasoning about games\nwhere the players may be translucent to one another; in particular, a player\nmay believe that if she were to change strategies, then the other player would\nalso change strategies. Translucent players may achieve significantly more\nefficient outcomes than opaque ones.\n  Our main result is a characterization of strategies consistent with\nappropriate analogues of common belief of rationality. Common Counterfactual\nBelief of Rationality (CCBR) holds if (1) everyone is rational, (2) everyone\ncounterfactually believes that everyone else is rational (i.e., all players i\nbelieve that everyone else would still be rational even if i were to switch\nstrategies), (3) everyone counterfactually believes that everyone else is\nrational, and counterfactually believes that everyone else is rational, and so\non. CCBR characterizes the set of strategies surviving iterated removal of\nminimax dominated strategies: a strategy $\\sigma_i$ is minimax dominated for i\nif there exists a strategy $\\sigma'_i$ for i such that $\\min_{\\mu'_{-i}}\nu_i(\\sigma_i, \\mu_{-i}') > \\max_{\\mu_{-i}} u_i(\\sigma_i, \\mu_{-i})$.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:54:32 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Halpern", "Joseph Y.", ""], ["Pass", "Rafael", ""]]}, {"id": "1310.6439", "submitter": "Burkhard C. Schipper", "authors": "Tivadar Papai, Henry Kautz, Daniel Stefankovic", "title": "Reasoning Under the Principle of Maximum Entropy for Modal Logics K45,\n  KD45, and S5", "comments": "7 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p222", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose modal Markov logic as an extension of propositional Markov logic\nto reason under the principle of maximum entropy for modal logics K45, KD45,\nand S5. Analogous to propositional Markov logic, the knowledge base consists of\nweighted formulas, whose weights are learned from data. However, in contrast to\nMarkov logic, in our framework we use the knowledge base to define a\nprobability distribution over non-equivalent epistemic situations (pointed\nKripke structures) rather than over atoms, and use this distribution to assign\nprobabilities to modal formulas. As in all probabilistic representations, the\ncentral task in our framework is inference. Although the size of the state\nspace grows doubly exponentially in the number of propositions in the domain,\nwe provide an algorithm that scales only exponentially in the size of the\nknowledge base. Finally, we briefly discuss the case of languages with an\ninfinite number of propositions.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 23:56:43 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Papai", "Tivadar", ""], ["Kautz", "Henry", ""], ["Stefankovic", "Daniel", ""]]}, {"id": "1310.6440", "submitter": "Burkhard C. Schipper", "authors": "Jeremy Seligman, Fenrong Liu, Patrick Girard", "title": "Facebook and the Epistemic Logic of Friendship", "comments": "10 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p229", "categories": "cs.LO cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a two-dimensional modal logic for reasoning about the\nchanging patterns of knowledge and social relationships in networks organised\non the basis of a symmetric 'friendship' relation, providing a precise language\nfor exploring 'logic in the community' [11]. Agents are placed in the model,\nallowing us to express such indexical facts as 'I am your friend' and 'You, my\nfriends, are in danger'.\n  The technical framework for this work is general dynamic dynamic logic (GDDL)\n[4], which provides a general method for extending modal logics with dynamic\noperators for reasoning about a wide range of model-transformations, starting\nwith those definable in propositional dynamic logic (PDL) and extended to allow\nfor the more subtle operators involved in, for example, private communication,\nas represented in dynamic epistemic logic (DEL) and related systems. We provide\na hands-on introduction to GDDL, introducing elements of the formalism as we\ngo, but leave the reader to consult [4] for technical details.\n  Instead, the purpose of this paper is to investigate a number of conceptual\nissues that arise when considering communication between agents in such\nnetworks, both from one agent to another, and broadcasts to socially-defined\ngroups of agents, such as the group of my friends.\n", "versions": [{"version": "v1", "created": "Thu, 24 Oct 2013 00:02:15 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Seligman", "Jeremy", ""], ["Liu", "Fenrong", ""], ["Girard", "Patrick", ""]]}, {"id": "1310.6441", "submitter": "Burkhard C. Schipper", "authors": "Yasuyuki Tsukada, Hideki Sakurada, Ken Mano, Yoshifumi Manabe", "title": "An Epistemic Approach to Compositional Reasoning about Anonymity and\n  Privacy", "comments": "10 pages, Poster presentation at TARK 2013 (arXiv:1310.6382)\n  http://www.tark.org", "journal-ref": null, "doi": null, "report-no": "TARK/2013/p239", "categories": "cs.CR cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present an epistemic logic approach to the compositionality\nof several privacy-related informationhiding/ disclosure properties. The\nproperties considered here are anonymity, privacy, onymity, and identity. Our\ninitial observation reveals that anonymity and privacy are not necessarily\nsequentially compositional; this means that even though a system comprising\nseveral sequential phases satisfies a certain unlinkability property in each\nphase, the entire system does not always enjoy a desired unlinkability\nproperty. We show that the compositionality can be guaranteed provided that the\nphases of the system satisfy what we call the independence assumptions. More\nspecifically, we develop a series of theoretical case studies of what\nassumptions are sufficient to guarantee the sequential compositionality of\nvarious degrees of anonymity, privacy, onymity, and/or identity properties.\nSimilar results for parallel composition are also discussed.\n", "versions": [{"version": "v1", "created": "Thu, 24 Oct 2013 00:04:27 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Tsukada", "Yasuyuki", ""], ["Sakurada", "Hideki", ""], ["Mano", "Ken", ""], ["Manabe", "Yoshifumi", ""]]}, {"id": "1310.6670", "submitter": "Matteo Camilli M.Sc.", "authors": "Carlo Bellettini, Matteo Camilli, Lorenzo Capra, Mattia Monga", "title": "Distributed CTL Model Checking in the Cloud", "comments": "8 pages", "journal-ref": null, "doi": "10.1109/SYNASC.2014.52", "report-no": null, "categories": "cs.SE cs.DC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent extensive availability of \"big data\" platforms calls for a more\nwidespread adoption by the formal verification community. In fact, formal\nverification requires high performance data processing software for extracting\nknowledge from the unprecedented amount of data which come from analyzed\nsystems. Since cloud based computing resources have became easily accessible,\nthere is an opportunity for verification techniques and tools to undergo a deep\ntechnological transition to exploit the new available architectures. This has\ncreated an increasing interest in parallelizing and distributing verification\ntechniques. In this paper we introduce a distributed approach which exploits\ntechniques typically used by the \"big data\" community to enable verification of\nComputation Tree Logic (CTL) formulas on very large state spaces using\ndistributed systems and cloud computing facilities. The outcome of several\ntests performed on benchmark specifications are presented, thus showing the\nconvenience of the proposed approach.\n", "versions": [{"version": "v1", "created": "Thu, 24 Oct 2013 16:54:37 GMT"}], "update_date": "2015-02-16", "authors_parsed": [["Bellettini", "Carlo", ""], ["Camilli", "Matteo", ""], ["Capra", "Lorenzo", ""], ["Monga", "Mattia", ""]]}, {"id": "1310.6813", "submitter": "J\\\"urgen Koslowski", "authors": "Peter Selinger (Dalhousie University, Canada)", "title": "Generators and relations for n-qubit Clifford operators", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 11, Issue 2 (June 19,\n  2015) lmcs:1570", "doi": "10.2168/LMCS-11(2:10)2015", "report-no": null, "categories": "quant-ph cs.ET cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a normal form for Clifford circuits, and we prove that every\nClifford operator has a unique normal form. Moreover, we present a rewrite\nsystem by which any Clifford circuit can be reduced to normal form. This yields\na presentation of Clifford operators in terms of generators and relations.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2013 03:52:05 GMT"}, {"version": "v2", "created": "Tue, 31 Mar 2015 00:08:17 GMT"}, {"version": "v3", "created": "Thu, 18 Jun 2015 12:12:05 GMT"}, {"version": "v4", "created": "Wed, 29 Mar 2017 19:31:22 GMT"}], "update_date": "2017-03-31", "authors_parsed": [["Selinger", "Peter", "", "Dalhousie University, Canada"]]}, {"id": "1310.6847", "submitter": "Sergio Mover", "authors": "Alessandro Cimatti, Alberto Griggio, Sergio Mover, Stefano Tonetta", "title": "IC3 Modulo Theories via Implicit Predicate Abstraction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel approach for generalizing the IC3 algorithm for invariant\nchecking from finite-state to infinite-state transition systems, expressed over\nsome background theories. The procedure is based on a tight integration of IC3\nwith Implicit (predicate) Abstraction, a technique that expresses abstract\ntran- sitions without computing explicitly the abstract system and is\nincremental with respect to the addition of predicates. In this scenario, IC3\noperates only at the Boolean level of the abstract state space, discovering\ninductive clauses over the abstraction predicates. Theory reasoning is confined\nwithin the underlying SMT solver, and applied transparently when performing\nsatisfiability checks. When the current abstraction allows for a spurious\ncounterexample, it is refined by discov- ering and adding a sufficient set of\nnew predicates. Importantly, this can be done in a completely incremental\nmanner, without discarding the clauses found in the previous search. The\nproposed approach has two key advantages. First, unlike current SMT gener-\nalizations of IC3, it allows to handle a wide range of background theories\nwithout relying on ad-hoc extensions, such as quantifier elimination or\ntheory-specific clause generalization procedures, which might not always be\navailable, and can moreover be inefficient. Second, compared to a direct\nexploration of the concrete transition system, the use of abstraction gives a\nsignificant performance improve- ment, as our experiments demonstrate.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2013 08:15:08 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Cimatti", "Alessandro", ""], ["Griggio", "Alberto", ""], ["Mover", "Sergio", ""], ["Tonetta", "Stefano", ""]]}, {"id": "1310.6978", "submitter": "Zarko Mijajlovic", "authors": "Zarko Mijajlovic, Aleksandar Pejovic", "title": "Computing finite models using free Boolean generators", "comments": "20 pages, 12 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A parallel method for computing Boolean expressions based on the properties\nof finite free Boolean algebras is presented. We also show how various finite\ncombinatorial objects can be codded in the formalism of Boolean algebras and\ncounted by this procedure. Particularly, using a translation of first order\npredicate formulas to propositional formulas, we give a method for constructing\nand counting finite models of the first order theories. An implementation of\nthe method that can be run on multi-core CPUs as well as on highly parallel\nGPUs is outlined.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 14:29:27 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Mijajlovic", "Zarko", ""], ["Pejovic", "Aleksandar", ""]]}, {"id": "1310.7417", "submitter": "Henning Kerstan", "authors": "Henning Kerstan (Universit\\\"at Duisburg-Essen), Barbara K\\\"onig\n  (Universit\\\"at Duisburg-Essen)", "title": "Coalgebraic Trace Semantics for Continuous Probabilistic Transition\n  Systems", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (December\n  4, 2013) lmcs:859", "doi": "10.2168/LMCS-9(4:16)2013", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coalgebras in a Kleisli category yield a generic definition of trace\nsemantics for various types of labelled transition systems. In this paper we\napply this generic theory to generative probabilistic transition systems, short\nPTS, with arbitrary (possibly uncountable) state spaces. We consider the\nsub-probability monad and the probability monad (Giry monad) on the category of\nmeasurable spaces and measurable functions. Our main contribution is that the\nexistence of a final coalgebra in the Kleisli category of these monads is\nclosely connected to the measure-theoretic extension theorem for sigma-finite\npre-measures. In fact, we obtain a practical definition of the trace measure\nfor both finite and infinite traces of PTS that subsumes a well-known result\nfor discrete probabilistic transition systems. Finally we consider two example\nsystems with uncountable state spaces and apply our theory to calculate their\ntrace measures.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2013 13:46:51 GMT"}, {"version": "v2", "created": "Mon, 2 Dec 2013 16:06:06 GMT"}, {"version": "v3", "created": "Tue, 3 Dec 2013 11:51:08 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Kerstan", "Henning", "", "Universität Duisburg-Essen"], ["König", "Barbara", "", "Universität Duisburg-Essen"]]}, {"id": "1310.7449", "submitter": "Elena Giachino", "authors": "Elena Giachino and Cosimo Laneve", "title": "Deadlock detection in linear recursive programs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deadlock detection in recursive programs that admit dynamic resource creation\nis extremely complex and solutions either give imprecise answers or do not\nscale.\n  We define an algorithm for detecting deadlocks of \"linear recursive programs\"\nof a basic model. The theory that underpins the algorithm is a generalization\nof the theory of permutations of names to so-called \"mutations\", which\ntransform tuples by introducing duplicates and fresh names.\n  Our algorithm realizes the back-end of deadlock analyzers for object-oriented\nprogramming languages, once the association programs/basic-model-programs has\nbeen defined as front-end.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2013 15:08:28 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Giachino", "Elena", ""], ["Laneve", "Cosimo", ""]]}, {"id": "1310.7627", "submitter": "Oliver Kullmann", "authors": "Olaf Beyersdorff and Oliver Kullmann", "title": "Hardness measures and resolution lower bounds", "comments": "43 pages, preliminary version (yet the application part is only\n  sketched, with proofs missing)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various \"hardness\" measures have been studied for resolution, providing\ntheoretical insight into the proof complexity of resolution and its fragments,\nas well as explanations for the hardness of instances in SAT solving. In this\nreport we aim at a unified view of a number of hardness measures, including\ndifferent measures of width, space and size of resolution proofs. We also\nextend these measures to all clause-sets (possibly satisfiable).\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2013 21:17:10 GMT"}, {"version": "v2", "created": "Mon, 17 Feb 2014 16:02:54 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Beyersdorff", "Olaf", ""], ["Kullmann", "Oliver", ""]]}, {"id": "1310.7911", "submitter": "Zvonko Iljazovic", "authors": "Zvonko Iljazovic (University of Zagreb)", "title": "Compact manifolds with computable boundaries", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (December\n  11, 2013) lmcs:891", "doi": "10.2168/LMCS-9(4:19)2013", "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate conditions under which a co-computably enumerable closed set\nin a computable metric space is computable and prove that in each locally\ncomputable computable metric space each co-computably enumerable compact\nmanifold with computable boundary is computable. In fact, we examine the notion\nof a semi-computable compact set and we prove a more general result: in any\ncomputable metric space each semi-computable compact manifold with computable\nboundary is computable. In particular, each semi-computable compact\n(boundaryless) manifold is computable.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2013 18:29:13 GMT"}, {"version": "v2", "created": "Mon, 9 Dec 2013 21:56:24 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Iljazovic", "Zvonko", "", "University of Zagreb"]]}, {"id": "1310.7950", "submitter": "Austin Jones M.S.", "authors": "Austin Jones, Mac Schwager, and Calin Belta", "title": "Technical Report: Distribution Temporal Logic: Combining Correctness\n  with Quality of Estimation", "comments": "More expanded version of \"Distribution Temporal Logic: Combining\n  Correctness with Quality of Estimation\" to appear in IEEE CDC 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new temporal logic called Distribution Temporal Logic (DTL)\ndefined over predicates of belief states and hidden states of partially\nobservable systems. DTL can express properties involving uncertainty and\nlikelihood that cannot be described by existing logics. A co-safe formulation\nof DTL is defined and algorithmic procedures are given for monitoring\nexecutions of a partially observable Markov decision process with respect to\nsuch formulae. A simulation case study of a rescue robotics application\noutlines our approach.\n", "versions": [{"version": "v1", "created": "Mon, 9 Sep 2013 18:06:50 GMT"}], "update_date": "2013-10-31", "authors_parsed": [["Jones", "Austin", ""], ["Schwager", "Mac", ""], ["Belta", "Calin", ""]]}, {"id": "1310.8120", "submitter": "Fabrizio Angiulli", "authors": "Fabrizio Angiulli and Rachel Ben-Eliyahu-Zohary and Fabio Fassetti and\n  Luigi Palopoli", "title": "On the Tractability of Minimal Model Computation for Some CNF Theories", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing algorithms capable of efficiently constructing minimal models of\nCNFs is an important task in AI. This paper provides new results along this\nresearch line and presents new algorithms for performing minimal model finding\nand checking over positive propositional CNFs and model minimization over\npropositional CNFs. An algorithmic schema, called the Generalized Elimination\nAlgorithm (GEA) is presented, that computes a minimal model of any positive\nCNF. The schema generalizes the Elimination Algorithm (EA) [BP97], which\ncomputes a minimal model of positive head-cycle-free (HCF) CNF theories. While\nthe EA always runs in polynomial time in the size of the input HCF CNF, the\ncomplexity of the GEA depends on the complexity of the specific eliminating\noperator invoked therein, which may in general turn out to be exponential.\nTherefore, a specific eliminating operator is defined by which the GEA\ncomputes, in polynomial time, a minimal model for a class of CNF that strictly\nincludes head-elementary-set-free (HEF) CNF theories [GLL06], which form, in\ntheir turn, a strict superset of HCF theories. Furthermore, in order to deal\nwith the high complexity associated with recognizing HEF theories, an\n\"incomplete\" variant of the GEA (called IGEA) is proposed: the resulting\nschema, once instantiated with an appropriate elimination operator, always\nconstructs a model of the input CNF, which is guaranteed to be minimal if the\ninput theory is HEF. In the light of the above results, the main contribution\nof this work is the enlargement of the tractability frontier for the minimal\nmodel finding and checking and the model minimization problems.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 12:37:06 GMT"}], "update_date": "2013-10-31", "authors_parsed": [["Angiulli", "Fabrizio", ""], ["Ben-Eliyahu-Zohary", "Rachel", ""], ["Fassetti", "Fabio", ""], ["Palopoli", "Luigi", ""]]}, {"id": "1310.8148", "submitter": "Achim Blumensath", "authors": "Achim Blumensath (Universit\\'e Paris Diderot), Bruno Courcelle\n  (Universit\\'e Bordeaux 1)", "title": "Monadic second-order definable graph orderings", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 10, Issue 1 (January\n  21, 2014) lmcs:793", "doi": "10.2168/LMCS-10(1:2)2014", "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the question of whether, for a given class of finite graphs, one can\ndefine, for each graph of the class, a linear ordering in monadic second-order\nlogic, possibly with the help of monadic parameters. We consider two variants\nof monadic second-order logic: one where we can only quantify over sets of\nvertices and one where we can also quantify over sets of edges. For several\nspecial cases, we present combinatorial characterisations of when such a linear\nordering is definable. In some cases, for instance for graph classes that omit\na fixed graph as a minor, the presented conditions are necessary and\nsufficient; in other cases, they are only necessary. Other graph classes we\nconsider include complete bipartite graphs, split graphs, chordal graphs, and\ncographs. We prove that orderability is decidable for the so called\nHR-equational classes of graphs, which are described by equation systems and\ngeneralize the context-free languages.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 13:29:37 GMT"}, {"version": "v2", "created": "Mon, 20 Jan 2014 17:37:34 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Blumensath", "Achim", "", "Université Paris Diderot"], ["Courcelle", "Bruno", "", "Université Bordeaux 1"]]}, {"id": "1310.8156", "submitter": "Lutz Stra", "authors": "Stefan Hetzl (INRIA Saclay -- Ile-de-France), Lutz Stra{\\ss}burger\n  (INRIA Saclay -- Ile-de-France)", "title": "Herbrand-Confluence", "comments": "25 pages, final version, accepted for publication at LMCS, special\n  issue for CSL 2012", "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (December\n  18, 2013) lmcs:727", "doi": "10.2168/LMCS-9(4:24)2013", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider cut-elimination in the sequent calculus for classical first-order\nlogic. It is well known that this system, in its most general form, is neither\nconfluent nor strongly normalizing. In this work we take a coarser (and\nmathematically more realistic) look at cut-free proofs. We analyze which\nwitnesses they choose for which quantifiers, or in other words: we only\nconsider the Herbrand-disjunction of a cut-free proof. Our main theorem is a\nconfluence result for a natural class of proofs: all (possibly infinitely many)\nnormal forms of the non-erasing reduction lead to the same\nHerbrand-disjunction.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 14:05:12 GMT"}, {"version": "v2", "created": "Tue, 17 Dec 2013 17:27:58 GMT"}], "update_date": "2016-03-27", "authors_parsed": [["Hetzl", "Stefan", "", "INRIA Saclay -- Ile-de-France"], ["Straßburger", "Lutz", "", "INRIA Saclay -- Ile-de-France"]]}, {"id": "1310.8182", "submitter": "Alexis B", "authors": "Alexis B\\`es (LACL, University of Paris-Est Cr\\'eteil)", "title": "Expansions of MSO by cardinality relations", "comments": "to appear in LMCS", "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (December\n  5, 2013) lmcs:747", "doi": "10.2168/LMCS-9(4:18)2013", "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study expansions of the Weak Monadic Second Order theory of (N,<) by\ncardinality relations, which are predicates R(X1,...,Xn) whose truth value\ndepends only on the cardinality of the sets X1, ...,Xn. We first provide a\n(definable) criterion for definability of a cardinality relation in (N,<), and\nuse it to prove that for every cardinality relation R which is not definable in\n(N,<), there exists a unary cardinality relation which is definable in (N,<,R)\nand not in (N,<). These results resemble Muchnik and Michaux-Villemaire\ntheorems for Presburger Arithmetic. We prove then that + and x are definable in\n(N,<,R) for every cardinality relation R which is not definable in (N,<). This\nimplies undecidability of the WMSO theory of (N,<,R). We also consider the\nrelated satisfiability problem for the class of finite orderings, namely the\nquestion whether an MSO sentence in the language {<,R} admits a finite model M\nwhere < is interpreted as a linear ordering, and R as the restriction of some\n(fixed) cardinality relation to the domain of M. We prove that this problem is\nundecidable for every cardinality relation R which is not definable in (N,<).\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 14:59:56 GMT"}, {"version": "v2", "created": "Wed, 4 Dec 2013 12:10:00 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Bès", "Alexis", "", "LACL, University of Paris-Est Créteil"]]}, {"id": "1310.8200", "submitter": "J\\\"urgen Koslowski", "authors": "Antti Kuusisto (University of Wroc{\\l}aw), Jeremy Meyers (Stanford\n  University), and Jonni Virtema (University of Tampere)", "title": "Undecidable First-Order Theories of Affine Geometries", "comments": "23 pages, 4 figures. arXiv admin note: substantial text overlap with\n  arXiv:1208.4930", "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (December\n  30, 2013) lmcs:728", "doi": "10.2168/LMCS-9(4:26)2013", "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tarski initiated a logic-based approach to formal geometry that studies\nfirst-order structures with a ternary betweenness relation \\beta, and a\nquaternary equidistance relation \\equiv. Tarski established, inter alia, that\nthe first-order (FO) theory of (R^2,\\beta,\\equiv) is decidable. Aiello and van\nBenthem (2002) conjectured that the FO-theory of expansions of (R^2,\\beta) with\nunary predicates is decidable. We refute this conjecture by showing that for\nall n>1, the FO-theory of the class of expansions of (R^2,\\beta) with just one\nunary predicate is not even arithmetical. We also define a natural and\ncomprehensive class C of geometric structures (T,\\beta), and show that for each\nstructure (T,\\beta) in C, the FO-theory of the class of expansions of (T,\\beta)\nwith a single unary predicate is undecidable. We then consider classes of\nexpansions of structures (T,\\beta) with a restricted unary predicate, for\nexample a finite predicate, and establish a variety of related undecidability\nresults. In addition to decidability questions, we briefly study the\nexpressivities of universal MSO and weak universal MSO over expansions of\n(R^n,\\beta). While the logics are incomparable in general, over expansions of\n(R^n,\\beta), formulae of weak universal MSO translate into equivalent formulae\nof universal MSO.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2013 02:17:03 GMT"}, {"version": "v2", "created": "Tue, 24 Dec 2013 13:44:31 GMT"}, {"version": "v3", "created": "Wed, 25 Dec 2013 11:47:48 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Kuusisto", "Antti", "", "University of Wrocław"], ["Meyers", "Jeremy", "", "Stanford\n  University"], ["Virtema", "Jonni", "", "University of Tampere"]]}, {"id": "1310.8278", "submitter": "Sicun Gao", "authors": "Sicun Gao, Soonho Kong, Edmund Clarke", "title": "Satisfiability Modulo ODEs", "comments": "Published in FMCAD 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study SMT problems over the reals containing ordinary differential\nequations. They are important for formal verification of realistic hybrid\nsystems and embedded software. We develop delta-complete algorithms for SMT\nformulas that are purely existentially quantified, as well as exists-forall\nformulas whose universal quantification is restricted to the time variables. We\ndemonstrate scalability of the algorithms, as implemented in our open-source\nsolver dReal, on SMT benchmarks with several hundred nonlinear ODEs and\nvariables.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 19:24:34 GMT"}], "update_date": "2013-10-31", "authors_parsed": [["Gao", "Sicun", ""], ["Kong", "Soonho", ""], ["Clarke", "Edmund", ""]]}, {"id": "1310.8408", "submitter": "Antti Valmari", "authors": "Antti Valmari (Tampere University of Technology)", "title": "All Linear-Time Congruences for Familiar Operators", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 9, Issue 4 (November\n  12, 2013) lmcs:858", "doi": "10.2168/LMCS-9(4:11)2013", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The detailed behaviour of a system is often represented as a labelled\ntransition system (LTS) and the abstract behaviour as a stuttering-insensitive\nsemantic congruence. Numerous congruences have been presented in the\nliterature. On the other hand, there have not been many results proving the\nabsence of more congruences. This publication fully analyses the linear-time\n(in a well-defined sense) region with respect to action prefix, hiding,\nrelational renaming, and parallel composition. It contains 40 congruences. They\nare built from the alphabet, two kinds of traces, two kinds of divergence\ntraces, five kinds of failures, and four kinds of infinite traces. In the case\nof finite LTSs, infinite traces lose their role and the number of congruences\ndrops to 20. The publication concentrates on the hardest and most novel part of\nthe result, that is, proving the absence of more congruences.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 07:09:32 GMT"}, {"version": "v2", "created": "Mon, 11 Nov 2013 00:33:18 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Valmari", "Antti", "", "Tampere University of Technology"]]}, {"id": "1310.8568", "submitter": "Mary Southern", "authors": "Mary Southern and Gopalan Nadathur", "title": "Translating Specifications in a Dependently Typed Lambda Calculus into a\n  Predicate Logic Form", "comments": "14 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dependently typed lambda calculi such as the Edinburgh Logical Framework (LF)\nare a popular means for encoding rule-based specifications concerning formal\nsyntactic objects. In these frameworks, relations over terms representing\nformal objects are naturally captured by making use of the dependent structure\nof types. We consider here the meaning-preserving translation of specifications\nwritten in this style into a predicate logic over simply typed {\\lambda}-terms.\nSuch a translation can provide the basis for efficient implementation and\nsophisticated capabilities for reasoning about specifications. We start with a\npreviously described translation of LF specifications to formulas in the logic\nof higher-order hereditary Harrop (hohh) formulas. We show how this translation\ncan be improved by recognizing and eliminating redundant type checking\ninformation contained in it. This benefits both the clarity of translated\nformulas, and reduces the effort which must be spent on type checking during\nexecution. To allow this translation to be used to execute LF specifications,\nwe describe an inverse transformation from hohh terms to LF expressions; thus\ncomputations can be carried out using the translated form and the results can\nthen be exported back into LF. Execution based on LF specifications may also\ninvolve some forms of type reconstruction. We discuss the possibility of\nsupporting such a capability using the translation under some reasonable\nrestrictions on the structure of specifications.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 16:10:52 GMT"}], "update_date": "2013-11-01", "authors_parsed": [["Southern", "Mary", ""], ["Nadathur", "Gopalan", ""]]}]