[{"id": "1005.0052", "submitter": "Byung-Hak Kim", "authors": "Byung-Hak Kim and Henry D. Pfister", "title": "On the Joint Decoding of LDPC Codes and Finite-State Channels via Linear\n  Programming", "comments": "To appear in Proc. 2010 IEEE Int. Symp. Information Theory, Ausin,\n  TX, June 12-18, 2010 (a small error in the reference corrected)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the linear programming (LP) decoder for binary linear codes,\nintroduced by Feldman, et al. is extended to joint-decoding of binary-input\nfinite-state channels. In particular, we provide a rigorous definition of LP\njoint-decoding pseudo-codewords (JD-PCWs) that enables evaluation of the\npairwise error probability between codewords and JD-PCWs. This leads naturally\nto a provable upper bound on decoder failure probability. If the channel is a\nfinite-state intersymbol interference channel, then the LP joint decoder also\nhas the maximum-likelihood (ML) certificate property and all integer valued\nsolutions are codewords. In this case, the performance loss relative to ML\ndecoding can be explained completely by fractional valued JD-PCWs.\n", "versions": [{"version": "v1", "created": "Sat, 1 May 2010 07:30:55 GMT"}, {"version": "v2", "created": "Fri, 7 May 2010 19:32:31 GMT"}, {"version": "v3", "created": "Mon, 7 Jun 2010 20:42:05 GMT"}], "update_date": "2010-06-09", "authors_parsed": [["Kim", "Byung-Hak", ""], ["Pfister", "Henry D.", ""]]}, {"id": "1005.0072", "submitter": "Rania El-Badry", "authors": "Rania El-Badry, Ahmed Sultan and Moustafa Youssef", "title": "HyberLoc: Providing Physical Layer Location Privacy in Hybrid Sensor\n  Networks", "comments": "7 pages, 4 figures, ICC'10", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many hybrid wireless sensor networks' applications, sensor nodes are\ndeployed in hostile environments where trusted and un-trusted nodes co-exist.\nIn anchor-based hybrid networks, it becomes important to allow trusted nodes to\ngain full access to the location information transmitted in beacon frames\nwhile, at the same time, prevent un-trusted nodes from using this information.\nThe main challenge is that un-trusted nodes can measure the physical signal\ntransmitted from anchor nodes, even if these nodes encrypt their transmission.\nUsing the measured signal strength, un-trusted nodes can still tri-laterate the\nlocation of anchor nodes. In this paper, we propose HyberLoc, an algorithm that\nprovides anchor physical layer location privacy in anchor-based hybrid sensor\nnetworks. The idea is for anchor nodes to dynamically change their transmission\npower following a certain probability distribution, degrading the localization\naccuracy at un-trusted nodes while maintaining high localization accuracy at\ntrusted nodes. Given an average power constraint, our analysis shows that the\ndiscretized exponential distribution is the distribution that maximizes\nlocation uncertainty at the untrusted nodes. Detailed evaluation through\nanalysis, simulation, and implementation shows that HyberLoc gives trusted\nnodes up to 3.5 times better localization accuracy as compared to untrusted\nnodes.\n", "versions": [{"version": "v1", "created": "Sat, 1 May 2010 13:43:03 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["El-Badry", "Rania", ""], ["Sultan", "Ahmed", ""], ["Youssef", "Moustafa", ""]]}, {"id": "1005.0117", "submitter": "Shirin Jalali", "authors": "Shirin Jalali, Michelle Effros", "title": "On the Separation of Lossy Source-Network Coding and Channel Coding in\n  Wireline Networks", "comments": "5 pages, to appear in the proceedings of 2010 IEEE International\n  Symposium on Information Theory (ISIT)", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513477", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proves the separation between source-network coding and channel\ncoding in networks of noisy, discrete, memoryless channels. We show that the\nset of achievable distortion matrices in delivering a family of dependent\nsources across such a network equals the set of achievable distortion matrices\nfor delivering the same sources across a distinct network which is built by\nreplacing each channel by a noiseless, point-to-point bit-pipe of the\ncorresponding capacity. Thus a code that applies source-network coding across\nlinks that are made almost lossless through the application of independent\nchannel coding across each link asymptotically achieves the optimal performance\nacross the network as a whole.\n", "versions": [{"version": "v1", "created": "Sun, 2 May 2010 01:35:08 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Jalali", "Shirin", ""], ["Effros", "Michelle", ""]]}, {"id": "1005.0167", "submitter": "M. Anand", "authors": "M. Anand and P. R. Kumar", "title": "A digital interface for Gaussian relay and interference networks:\n  Lifting codes from the discrete superposition model", "comments": "Final version", "journal-ref": "Special issue on interference Networks, IEEE Trans. Info. Theory,\n  vol. 57, no. 5, pp. 2548 - 2564, May 2011", "doi": "10.1109/TIT.2011.2120070", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For every Gaussian network, there exists a corresponding deterministic\nnetwork called the discrete superposition network. We show that this discrete\nsuperposition network provides a near-optimal digital interface for operating a\nclass consisting of many Gaussian networks in the sense that any code for the\ndiscrete superposition network can be naturally lifted to a corresponding code\nfor the Gaussian network, while achieving a rate that is no more than a\nconstant number of bits lesser than the rate it achieves for the discrete\nsuperposition network. This constant depends only on the number of nodes in the\nnetwork and not on the channel gains or SNR. Moreover the capacities of the two\nnetworks are within a constant of each other, again independent of channel\ngains and SNR. We show that the class of Gaussian networks for which this\ninterface property holds includes relay networks with a single\nsource-destination pair, interference networks, multicast networks, and the\ncounterparts of these networks with multiple transmit and receive antennas.\n  The code for the Gaussian relay network can be obtained from any code for the\ndiscrete superposition network simply by pruning it. This lifting scheme\nestablishes that the superposition model can indeed potentially serve as a\nstrong surrogate for designing codes for Gaussian relay networks.\n  We present similar results for the K x K Gaussian interference network, MIMO\nGaussian interference networks, MIMO Gaussian relay networks, and multicast\nnetworks, with the constant gap depending additionally on the number of\nantennas in case of MIMO networks.\n", "versions": [{"version": "v1", "created": "Sun, 2 May 2010 21:32:14 GMT"}, {"version": "v2", "created": "Fri, 20 May 2011 23:02:44 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Anand", "M.", ""], ["Kumar", "P. R.", ""]]}, {"id": "1005.0202", "submitter": "Kevin Rosenblum", "authors": "Kevin Rosenblum, Lihi Zelnik-Manor, Yonina C. Eldar", "title": "Dictionary Optimization for Block-Sparse Representations", "comments": "submitted to IEEE Transactions on Signal Processing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work has demonstrated that using a carefully designed dictionary\ninstead of a predefined one, can improve the sparsity in jointly representing a\nclass of signals. This has motivated the derivation of learning methods for\ndesigning a dictionary which leads to the sparsest representation for a given\nset of signals. In some applications, the signals of interest can have further\nstructure, so that they can be well approximated by a union of a small number\nof subspaces (e.g., face recognition and motion segmentation). This implies the\nexistence of a dictionary which enables block-sparse representations of the\ninput signals once its atoms are properly sorted into blocks. In this paper, we\npropose an algorithm for learning a block-sparsifying dictionary of a given set\nof signals. We do not require prior knowledge on the association of signals\ninto groups (subspaces). Instead, we develop a method that automatically\ndetects the underlying block structure. This is achieved by iteratively\nalternating between updating the block structure of the dictionary and updating\nthe dictionary atoms to better fit the data. Our experiments show that for\nblock-sparse data the proposed algorithm significantly improves the dictionary\nrecovery ability and lowers the representation error compared to dictionary\nlearning methods that do not employ block structure.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2010 06:46:56 GMT"}], "update_date": "2010-05-04", "authors_parsed": [["Rosenblum", "Kevin", ""], ["Zelnik-Manor", "Lihi", ""], ["Eldar", "Yonina C.", ""]]}, {"id": "1005.0267", "submitter": "Qiyu Sun", "authors": "Qiyu Sun", "title": "Recovery of sparsest signals via $\\ell^q$-minimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, it is proved that every $s$-sparse vector ${\\bf x}\\in {\\mathbb\nR}^n$ can be exactly recovered from the measurement vector ${\\bf z}={\\bf A}\n{\\bf x}\\in {\\mathbb R}^m$ via some $\\ell^q$-minimization with $0< q\\le 1$, as\nsoon as each $s$-sparse vector ${\\bf x}\\in {\\mathbb R}^n$ is uniquely\ndetermined by the measurement ${\\bf z}$.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2010 12:25:22 GMT"}], "update_date": "2010-05-04", "authors_parsed": [["Sun", "Qiyu", ""]]}, {"id": "1005.0291", "submitter": "Moritz Wiese", "authors": "Moritz Wiese and Holger Boche and Igor Bjelakovi\\'c and Volker\n  Jungnickel", "title": "The Compound Multiple Access Channel with Partially Cooperating Encoders", "comments": "accepted for publication in IEEE Transactions on Information Theory,\n  Special Issue on Interference Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is to provide a rigorous information-theoretic\nanalysis of subnetworks of interference networks. We prove two coding theorems\nfor the compound multiple-access channel with an arbitrary number of channel\nstates. The channel state information at the transmitters is such that each\ntransmitter has a finite partition of the set of states and knows which element\nof the partition the actual state belongs to. The receiver may have arbitrary\nchannel state information. The first coding theorem is for the case that both\ntransmitters have a common message and that each has an additional common\nmessage. The second coding theorem is for the case where rate-constrained, but\nnoiseless transmitter cooperation is possible. This cooperation may be used to\nexchange information about channel state information as well as the messages to\nbe transmitted. The cooperation protocol used here generalizes Willems'\nconferencing. We show how this models base station cooperation in modern\nwireless cellular networks used for interference coordination and capacity\nenhancement. In particular, the coding theorem for the cooperative case shows\nhow much cooperation is necessary in order to achieve maximal capacity in the\nnetwork considered.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2010 13:45:09 GMT"}, {"version": "v2", "created": "Wed, 10 Nov 2010 13:28:15 GMT"}, {"version": "v3", "created": "Tue, 1 Feb 2011 09:39:23 GMT"}], "update_date": "2011-02-02", "authors_parsed": [["Wiese", "Moritz", ""], ["Boche", "Holger", ""], ["Bjelaković", "Igor", ""], ["Jungnickel", "Volker", ""]]}, {"id": "1005.0375", "submitter": "Sami Akin", "authors": "Sami Akin and Mustafa Cenk Gursoy", "title": "Performance Analysis of Cognitive Radio Systems under QoS Constraints\n  and Channel Uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, performance of cognitive transmission over time-selective flat\nfading channels is studied under quality of service (QoS) constraints and\nchannel uncertainty. Cognitive secondary users (SUs) are assumed to initially\nperform channel sensing to detect the activities of the primary users, and then\nattempt to estimate the channel fading coefficients through training. Energy\ndetection is employed for channel sensing, and different minimum\nmean-square-error (MMSE) estimation methods are considered for channel\nestimation. In both channel sensing and estimation, erroneous decisions can be\nmade, and hence, channel uncertainty is not completely eliminated. In this\nsetting, performance is studied and interactions between channel sensing and\nestimation are investigated.\n  Following the channel sensing and estimation tasks, SUs engage in data\ntransmission. Transmitter, being unaware of the channel fading coefficients, is\nassumed to send the data at fixed power and rate levels that depend on the\nchannel sensing results. Under these assumptions, a state-transition model is\nconstructed by considering the reliability of the transmissions, channel\nsensing decisions and their correctness, and the evolution of primary user\nactivity which is modeled as a two-state Markov process. In the data\ntransmission phase, an average power constraint on the secondary users is\nconsidered to limit the interference to the primary users, and statistical\nlimitations on the buffer lengths are imposed to take into account the QoS\nconstraints of the secondary traffic. The maximum throughput under these\nstatistical QoS constraints is identified by finding the effective capacity of\nthe cognitive radio channel. Numerical results are provided for the power and\nrate policies.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2010 19:13:31 GMT"}, {"version": "v2", "created": "Tue, 2 Nov 2010 22:16:31 GMT"}], "update_date": "2010-11-04", "authors_parsed": [["Akin", "Sami", ""], ["Gursoy", "Mustafa Cenk", ""]]}, {"id": "1005.0404", "submitter": "Soheil Mohajer", "authors": "Soheil Mohajer, Suhas N. Diggavi, Christina Fragouli, and David N. C.\n  Tse", "title": "Approximate Capacity of Gaussian Interference-Relay Networks with Weak\n  Cross Links", "comments": "66 pages, 19 figures, submitted to IEEE Trans. on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a Gaussian relay-interference network, in which relay\n(helper) nodes are to facilitate competing information flows over a wireless\nnetwork. We focus on a two-stage relay-interference network where there are\nweak cross-links, causing the networks to behave like a chain of Z Gaussian\nchannels. For these Gaussian ZZ and ZS networks, we establish an approximate\ncharacterization of the rate region. The outer bounds to the capacity region\nare established using genie-aided techniques that yield bounds sharper than the\ntraditional cut-set outer bounds. For the inner bound of the ZZ network, we\npropose a new interference management scheme, termed interference\nneutralization, which is implemented using structured lattice codes. This\ntechnique allows for over-the-air interference removal, without the\ntransmitters having complete access the interfering signals. For both the ZZ\nand ZS networks, we establish a new network decomposition technique that\n(approximately) achieves the capacity region. We use insights gained from an\nexact characterization of the corresponding linear deterministic version of the\nproblems, in order to establish the approximate characterization for Gaussian\nnetworks.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2010 21:25:45 GMT"}], "update_date": "2010-05-05", "authors_parsed": [["Mohajer", "Soheil", ""], ["Diggavi", "Suhas N.", ""], ["Fragouli", "Christina", ""], ["Tse", "David N. C.", ""]]}, {"id": "1005.0419", "submitter": "Ersen Ekrem", "authors": "Ersen Ekrem and Sennur Ulukus", "title": "Capacity-Equivocation Region of the Gaussian MIMO Wiretap Channel", "comments": "Submitted to IEEE Transactions on Information Theory, April 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the Gaussian multiple-input multiple-output (MIMO) wiretap channel,\nwhich consists of a transmitter, a legitimate user, and an eavesdropper. In\nthis channel, the transmitter sends a common message to both the legitimate\nuser and the eavesdropper. In addition to this common message, the legitimate\nuser receives a private message, which is desired to be kept hidden as much as\npossible from the eavesdropper. We obtain the entire capacity-equivocation\nregion of the Gaussian MIMO wiretap channel. This region contains all\nachievable common message, private message, and private message's equivocation\n(secrecy) rates. In particular, we show the sufficiency of jointly Gaussian\nauxiliary random variables and channel input to evaluate the existing\nsingle-letter description of the capacity-equivocation region due to\nCsiszar-Korner.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2010 22:55:05 GMT"}], "update_date": "2010-05-05", "authors_parsed": [["Ekrem", "Ersen", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1005.0426", "submitter": "Theodoros Dikaliotis", "authors": "Theodoros K. Dikaliotis, Alexandros G. Dimakis, Tracey Ho", "title": "Security in Distributed Storage Systems by Communicating a Logarithmic\n  Number of Bits", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the problem of maintaining an encoded distributed storage\nsystem when some nodes contain adversarial errors. Using the error-correction\ncapabilities that are built into the existing redundancy of the system, we\npropose a simple linear hashing scheme to detect errors in the storage nodes.\nOur main result is that for storing a data object of total size $\\size$ using\nan $(n,k)$ MDS code over a finite field $\\F_q$, up to\n$t_1=\\lfloor(n-k)/2\\rfloor$ errors can be detected, with probability of failure\nsmaller than $1/ \\size$, by communicating only $O(n(n-k)\\log \\size)$ bits to a\ntrusted verifier. Our result constructs small projections of the data that\npreserve the errors with high probability and builds on a pseudorandom\ngenerator that fools linear functions. The transmission rate achieved by our\nscheme is asymptotically equal to the min-cut capacity between the source and\nany receiver.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2010 00:45:53 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Dikaliotis", "Theodoros K.", ""], ["Dimakis", "Alexandros G.", ""], ["Ho", "Tracey", ""]]}, {"id": "1005.0498", "submitter": "Tirza Routtenberg", "authors": "Routtenberg Tirza and Joseph Tabrikian", "title": "Classes of lower bounds on outage error probability and MSE in Bayesian\n  parameter estimation", "comments": "submitted to IEEE Trans. Inform. Theory (Journal paper)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, new classes of lower bounds on the outage error probability\nand on the mean-square-error (MSE) in Bayesian parameter estimation are\nproposed. The minima of the h-outage error probability and the MSE are obtained\nby the generalized maximum a-posteriori probability and the minimum MSE (MMSE)\nestimators, respectively. However, computation of these estimators and their\ncorresponding performance is usually not tractable and thus, lower bounds on\nthese terms can be very useful for performance analysis. The proposed class of\nlower bounds on the outage error probability is derived using Holder's\ninequality. This class is utilized to derive a new class of Bayesian MSE\nbounds. It is shown that for unimodal symmetric conditional probability density\nfunctions (pdf) the tightest probability of outage error lower bound in the\nproposed class attains the minimum probability of outage error and the tightest\nMSE bound coincides with the MMSE performance. In addition, it is shown that\nthe proposed MSE bounds are always tighter than the Ziv-Zakai lower bound\n(ZZLB). The proposed bounds are compared with other existing performance lower\nbounds via some examples.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2010 12:07:15 GMT"}], "update_date": "2010-05-05", "authors_parsed": [["Tirza", "Routtenberg", ""], ["Tabrikian", "Joseph", ""]]}, {"id": "1005.0545", "submitter": "Arash Behboodi", "authors": "Arash Behboodi and Pablo Piantanida", "title": "Capacity of a Class of Broadcast Relay Channels", "comments": "5 pages, to appear in proc. IEEE ISIT, June 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the broadcast relay channel (BRC) which consists of a source sending\ninformation over a two user broadcast\n  channel in presence of two relay nodes that help the transmission to the\ndestinations. Clearly, this network with\n  five nodes involves all the problems encountered in relay and broadcast\nchannels. New inner bounds on the capacity\n  region of this class of channels are derived. These results can be seen as a\ngeneralization and hence unification of\n  previous work in this topic. Our bounds are based on the idea of\nrecombination of message bits and various effective\n  coding strategies for relay and broadcast channels. Capacity result is\nobtained for the semi-degraded BRC-CR, where\n  one relay channel is degraded while the other one is reversely degraded. An\ninner and upper bound is also presented\n  for the degraded BRC with common relay (BRC-CR), where both the relay and\nbroadcast channel are degraded which is\n  the capacity for the Gaussian case. Application of these results arise in the\ncontext of opportunistic cooperation\n  of cellular networks.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2010 15:05:37 GMT"}], "update_date": "2010-05-05", "authors_parsed": [["Behboodi", "Arash", ""], ["Piantanida", "Pablo", ""]]}, {"id": "1005.0616", "submitter": "Aslan Tchamkerten", "authors": "Marat Burnashev and Aslan Tchamkerten", "title": "Tracking a Random Walk First-Passage Time Through Noisy Observations", "comments": "Reprint of the original article published in the Annals of Applied\n  Probability", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a Gaussian random walk (or a Wiener process), possibly with drift,\nobserved through noise, we consider the problem of estimating its first-passage\ntime $\\tau_\\ell$ of a given level $\\ell$ with a stopping time $\\eta$ defined\nover the noisy observation process.\n  Main results are upper and lower bounds on the minimum mean absolute\ndeviation $\\inf_\\eta \\ex|\\eta-\\tau_\\ell|$ which become tight as\n$\\ell\\to\\infty$. Interestingly, in this regime the estimation error does not\nget smaller if we allow $ \\eta$ to be an arbitrary function of the entire\nobservation process, not necessarily a stopping time.\n  In the particular case where there is no drift, we show that it is impossible\nto track $\\tau_\\ell$: $\\inf_\\eta \\ex|\\eta-\\tau_\\ell|^p=\\infty$ for any $\\ell>0$\nand $p\\geq1/2$.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2010 19:59:38 GMT"}, {"version": "v2", "created": "Sat, 8 May 2010 20:03:01 GMT"}, {"version": "v3", "created": "Thu, 18 Oct 2012 20:39:51 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Burnashev", "Marat", ""], ["Tchamkerten", "Aslan", ""]]}, {"id": "1005.0624", "submitter": "Aylin Yener", "authors": "Xiang He and Aylin Yener", "title": "The Gaussian Many-to-1 Interference Channel with Confidential Messages", "comments": "Submitted to IEEE Transactions on Information Theory, April 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The many-to-one interference channel has received interest by virtue of\nembodying the essence of an interference network while being more tractable\nthan the general K-user interference channel. In this paper, we introduce\ninformation theoretic secrecy to this model and consider the many-to-one\ninterference channel with confidential messages, in which each receiver, in\nparticular, the one subject to interference, is also one from which the\ninterfering users' messages need to be kept secret from. We derive the\nachievable secrecy sum rate for this channel using nested lattice codes, as\nwell as an upper bound on the secrecy sum rate for all possible channel gain\nconfigurations. We identify several nontrivial cases where the gap between the\nupper bound and the achieved secrecy sum rate is only a function of the number\nof the users K, and is uniform over all possible channel gain configurations in\neach case. In addition, we identify the secure degree of freedom for this\nchannel and show it to be equivalent to its degree of freedom, i.e., the\nsecrecy in high SNR comes for free.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2010 20:04:07 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["He", "Xiang", ""], ["Yener", "Aylin", ""]]}, {"id": "1005.0677", "submitter": "Farokh Marvasti", "authors": "K. Alishahi, S. Dashmiz, P. Pad, F. Marvasti, M. H. Shafinia, and M.\n  Mansouri", "title": "The Enigma of CDMA Revisited", "comments": "71 pages, submitted to IEEE Trans. on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we explore the mystery of synchronous CDMA as applied to\nwireless and optical communication systems under very general settings for the\nuser symbols and the signature matrix entries. The channel is modeled with\nreal/complex additive noise of arbitrary distribution. Two problems are\naddressed. The first problem concerns whether overloaded error free codes exist\nin the absence of additive noise under these general settings, and if so\nwhether there are any practical optimum decoding algorithms. The second one is\nabout the bounds for the sum channel capacity when user data and signature\ncodes employ any real or complex alphabets (finite or infinite). In response to\nthe first problem, we have developed practical Maximum Likelihood (ML) decoding\nalgorithms for overloaded CDMA systems for a large class of alphabets. In\nresponse to the second problem, a general theorem has been developed in which\nthe sum capacity lower bounds with respect to the number of users and spreading\ngain and Signal-to-Noise Ratio (SNR) can be derived as special cases for a\ngiven CDMA system. To show the power and utility of the main theorem, a number\nof sum capacity bounds for special cases are simulated. An important conclusion\nof this paper is that the lower and upper bounds of the sum capacity for\nsmall/medium size CDMA systems depend on both the input and the signature\nsymbols; this is contrary to the asymptotic results for large scale systems\nreported in the literature (also confirmed in this paper) where the signature\nsymbols and statistics disappear in the asymptotic sum capacity. Moreover,\nthese questions are investigated for the case when not all users are active.\nFurthermore, upper and asymptotic bounds are derived and numerically evaluated\nand compared to other derivations.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 06:52:49 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Alishahi", "K.", ""], ["Dashmiz", "S.", ""], ["Pad", "P.", ""], ["Marvasti", "F.", ""], ["Shafinia", "M. H.", ""], ["Mansouri", "M.", ""]]}, {"id": "1005.0732", "submitter": "Nikola Zlatanov", "authors": "Zoran Hadzi-Velkov and Nikola Zlatanov", "title": "Outage rates and outage durations of opportunistic relaying systems", "comments": null, "journal-ref": "IEEE Communications Letters, vol. 14, no. 2, pp 148-150, February\n  2010", "doi": "10.1109/LCOMM.2010.02.091683", "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Opportunistic relaying is a simple yet efficient cooperation scheme that\nachieves full diversity and preserves the spectral efficiency among the\nspatially distributed stations. However, the stations' mobility causes temporal\ncorrelation of the system's capacity outage events, which gives rise to its\nimportant second-order outage statistical parameters, such as the average\noutage rate (AOR) and the average outage duration (AOD). This letter presents\nexact analytical expressions for the AOR and the AOD of an opportunistic\nrelaying system, which employs a mobile source and a mobile destination\n(without a direct path), and an arbitrary number of (fixed-gain\namplify-and-forward or decode-and-forward) mobile relays in Rayleigh fading\nenvironment.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 12:29:03 GMT"}], "update_date": "2010-05-06", "authors_parsed": [["Hadzi-Velkov", "Zoran", ""], ["Zlatanov", "Nikola", ""]]}, {"id": "1005.0734", "submitter": "Nikola Zlatanov", "authors": "Nikola Zlatanov, Zoran Hadzi-Velkov and George Karagiannidis", "title": "An efficient approximation to the correlated Nakagami-m sums and its\n  application in equal gain diversity receivers", "comments": null, "journal-ref": "IEEE Transactions on Wireless Communications, vol. 9, no. 1, pp.\n  302-310, January 2010", "doi": "10.1109/TWC.2010.01.090457", "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  There are several cases in wireless communications theory where the\nstatistics of the sum of independent or correlated Nakagami-m random variables\n(RVs) is necessary to be known. However, a closed-form solution to the\ndistribution of this sum does not exist when the number of constituent RVs\nexceeds two, even for the special case of Rayleigh fading. In this paper, we\npresent an efficient closed-form approximation for the distribution of the sum\nof arbitrary correlated Nakagami-m envelopes with identical and integer fading\nparameters. The distribution becomes exact for maximal correlation, while the\ntightness of the proposed approximation is validated statistically by using the\nChi-square and the Kolmogorov-Smirnov goodness-of-fit tests. As an application,\nthe approximation is used to study the performance of equal-gain combining\n(EGC) systems operating over arbitrary correlated Nakagami-m fading channels,\nby utilizing the available analytical results for the error-rate performance of\nan equivalent maximal-ratio combining (MRC) system.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 12:34:41 GMT"}], "update_date": "2010-05-06", "authors_parsed": [["Zlatanov", "Nikola", ""], ["Hadzi-Velkov", "Zoran", ""], ["Karagiannidis", "George", ""]]}, {"id": "1005.0766", "submitter": "Vincent Tan", "authors": "Vincent Y. F. Tan, Animashree Anandkumar, Alan S. Willsky", "title": "Learning High-Dimensional Markov Forest Distributions: Analysis of Error\n  Rates", "comments": "Accepted to the Journal of Machine Learning Research (Feb 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of learning forest-structured discrete graphical models from\ni.i.d. samples is considered. An algorithm based on pruning of the Chow-Liu\ntree through adaptive thresholding is proposed. It is shown that this algorithm\nis both structurally consistent and risk consistent and the error probability\nof structure learning decays faster than any polynomial in the number of\nsamples under fixed model size. For the high-dimensional scenario where the\nsize of the model d and the number of edges k scale with the number of samples\nn, sufficient conditions on (n,d,k) are given for the algorithm to satisfy\nstructural and risk consistencies. In addition, the extremal structures for\nlearning are identified; we prove that the independent (resp. tree) model is\nthe hardest (resp. easiest) to learn using the proposed algorithm in terms of\nerror rates for structure learning.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 14:41:06 GMT"}, {"version": "v2", "created": "Sun, 13 Feb 2011 02:19:59 GMT"}], "update_date": "2011-02-15", "authors_parsed": [["Tan", "Vincent Y. F.", ""], ["Anandkumar", "Animashree", ""], ["Willsky", "Alan S.", ""]]}, {"id": "1005.0794", "submitter": "Xiaoran Yan", "authors": "Xiaoran Yan, Yaojia Zhu, Jean-Baptiste Rouquier, and Cristopher Moore", "title": "Active Learning for Hidden Attributes in Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cond-mat.stat-mech cs.IT cs.LG math.IT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many networks, vertices have hidden attributes, or types, that are\ncorrelated with the networks topology. If the topology is known but these\nattributes are not, and if learning the attributes is costly, we need a method\nfor choosing which vertex to query in order to learn as much as possible about\nthe attributes of the other vertices. We assume the network is generated by a\nstochastic block model, but we make no assumptions about its assortativity or\ndisassortativity. We choose which vertex to query using two methods: 1)\nmaximizing the mutual information between its attributes and those of the\nothers (a well-known approach in active learning) and 2) maximizing the average\nagreement between two independent samples of the conditional Gibbs\ndistribution. Experimental results show that both these methods do much better\nthan simple heuristics. They also consistently identify certain vertices as\nimportant by querying them early on.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 17:11:26 GMT"}], "update_date": "2010-05-25", "authors_parsed": [["Yan", "Xiaoran", ""], ["Zhu", "Yaojia", ""], ["Rouquier", "Jean-Baptiste", ""], ["Moore", "Cristopher", ""]]}, {"id": "1005.0826", "submitter": "Daniil Ryabko", "authors": "Daniil Ryabko (INRIA Lille - Nord Europe)", "title": "Clustering processes", "comments": "in proceedings of ICML 2010. arXiv-admin Note: This is a newer\n  version of the article arXiv:1004.5194v1, please see that article for any\n  previous version", "journal-ref": "27th International Conference on Machine Learning (2010) 919-926", "doi": null, "report-no": null, "categories": "cs.LG cs.IT math.IT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of clustering is considered, for the case when each data point is\na sample generated by a stationary ergodic process. We propose a very natural\nasymptotic notion of consistency, and show that simple consistent algorithms\nexist, under most general non-parametric assumptions. The notion of consistency\nis as follows: two samples should be put into the same cluster if and only if\nthey were generated by the same distribution. With this notion of consistency,\nclustering generalizes such classical statistical problems as homogeneity\ntesting and process classification. We show that, for the case of a known\nnumber of clusters, consistency can be achieved under the only assumption that\nthe joint distribution of the data is stationary ergodic (no parametric or\nMarkovian assumptions, no assumptions of independence, neither between nor\nwithin the samples). If the number of clusters is unknown, consistency can be\nachieved under appropriate assumptions on the mixing rates of the processes.\n(again, no parametric or independence assumptions). In both cases we give\nexamples of simple (at most quadratic in each argument) algorithms which are\nconsistent.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 19:41:55 GMT"}, {"version": "v2", "created": "Tue, 30 Apr 2013 09:32:30 GMT"}], "update_date": "2013-05-01", "authors_parsed": [["Ryabko", "Daniil", "", "INRIA Lille - Nord Europe"]]}, {"id": "1005.0855", "submitter": "Won-Yong Shin", "authors": "Won-Yong Shin, Daniel E. Lucani, Muriel Medard, Milica Stojanovic, and\n  Vahid Tarokh", "title": "On Capacity Scaling of Underwater Networks: An Information-Theoretic\n  Perspective", "comments": "16 pages, 4 figures, Submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Capacity scaling laws are analyzed in an underwater acoustic network with $n$\nregularly located nodes on a square. A narrow-band model is assumed where the\ncarrier frequency is allowed to scale as a function of $n$. In the network, we\ncharacterize an attenuation parameter that depends on the frequency scaling as\nwell as the transmission distance. A cut-set upper bound on the throughput\nscaling is then derived in extended networks. Our result indicates that the\nupper bound is inversely proportional to the attenuation parameter, thus\nresulting in a highly power-limited network. Interestingly, it is seen that\nunlike the case of wireless radio networks, our upper bound is intrinsically\nrelated to the attenuation parameter but not the spreading factor. Furthermore,\nwe describe an achievable scheme based on the simple nearest neighbor multi-hop\n(MH) transmission. It is shown under extended networks that the MH scheme is\norder-optimal as the attenuation parameter scales exponentially with $\\sqrt{n}$\n(or faster). Finally, these scaling results are extended to a random network\nrealization.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 21:13:10 GMT"}, {"version": "v2", "created": "Fri, 7 May 2010 14:18:17 GMT"}], "update_date": "2010-05-10", "authors_parsed": [["Shin", "Won-Yong", ""], ["Lucani", "Daniel E.", ""], ["Medard", "Muriel", ""], ["Stojanovic", "Milica", ""], ["Tarokh", "Vahid", ""]]}, {"id": "1005.0879", "submitter": "Martianus Frederic Ezerman", "authors": "Martianus Frederic Ezerman, San Ling, Patrick Sole and Olfa Yemen", "title": "From Skew-Cyclic Codes to Asymmetric Quantum Codes", "comments": "16 pages, 3 tables, submitted to Advances in Mathematics of\n  Communications", "journal-ref": null, "doi": "10.3934/amc.2011.5.41", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an additive but not $\\mathbb{F}_4$-linear map $S$ from\n$\\mathbb{F}_4^{n}$ to $\\mathbb{F}_4^{2n}$ and exhibit some of its interesting\nstructural properties. If $C$ is a linear $[n,k,d]_4$-code, then $S(C)$ is an\nadditive $(2n,2^{2k},2d)_4$-code. If $C$ is an additive cyclic code then $S(C)$\nis an additive quasi-cyclic code of index $2$. Moreover, if $C$ is a module\n$\\theta$-cyclic code, a recently introduced type of code which will be\nexplained below, then $S(C)$ is equivalent to an additive cyclic code if $n$ is\nodd and to an additive quasi-cyclic code of index $2$ if $n$ is even. Given any\n$(n,M,d)_4$-code $C$, the code $S(C)$ is self-orthogonal under the trace\nHermitian inner product. Since the mapping $S$ preserves nestedness, it can be\nused as a tool in constructing additive asymmetric quantum codes.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2010 02:49:08 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Ezerman", "Martianus Frederic", ""], ["Ling", "San", ""], ["Sole", "Patrick", ""], ["Yemen", "Olfa", ""]]}, {"id": "1005.1062", "submitter": "David G. M. Mitchell", "authors": "Michael Lentmaier, David G. M. Mitchell, Gerhard P. Fettweis, and\n  Daniel J. Costello, Jr.", "title": "Asymptotically Regular LDPC Codes with Linear Distance Growth and\n  Thresholds Close to Capacity", "comments": "Presented at the 2010 Information Theory and Applications Workshop,\n  San Diego, CA.", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Families of \"asymptotically regular\" LDPC block code ensembles can be formed\nby terminating (J,K)-regular protograph-based LDPC convolutional codes. By\nvarying the termination length, we obtain a large selection of LDPC block code\nensembles with varying code rates and substantially better iterative decoding\nthresholds than those of (J,K)-regular LDPC block code ensembles, despite the\nfact that the terminated ensembles are almost regular. Also, by means of an\nasymptotic weight enumerator analysis, we show that minimum distance grows\nlinearly with block length for all of the ensembles in these families, i.e.,\nthe ensembles are asymptotically good. We find that, as the termination length\nincreases, families of \"asymptotically regular\" codes with capacity approaching\niterative decoding thresholds and declining minimum distance growth rates are\nobtained, allowing a code designer to trade-off between distance growth rate\nand threshold. Further, we show that the thresholds and the distance growth\nrates can be improved by carefully choosing the component protographs used in\nthe code construction.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2010 19:44:26 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Lentmaier", "Michael", ""], ["Mitchell", "David G. M.", ""], ["Fettweis", "Gerhard P.", ""], ["Costello,", "Daniel J.", "Jr."]]}, {"id": "1005.1065", "submitter": "David G. M. Mitchell", "authors": "David G. M. Mitchell, Michael Lentmaier, and Daniel J. Costello Jr.", "title": "New Families of LDPC Block Codes Formed by Terminating Irregular\n  Protograph-Based LDPC Convolutional Codes", "comments": "To be presented at the 2010 IEEE International Symposium on\n  Information Theory", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513633", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a method of constructing new families of LDPC block\ncode ensembles formed by terminating irregular protograph-based LDPC\nconvolutional codes. Using the accumulate-repeat-by-4-jagged-accumulate (AR4JA)\nprotograph as an example, a density evolution analysis for the binary erasure\nchannel shows that this flexible design technique gives rise to a large\nselection of LDPC block code ensembles with varying code rates and thresholds\nclose to capacity. Further, by means of an asymptotic weight enumerator\nanalysis, we show that all the ensembles in this family also have minimum\ndistance that grows linearly with block length, i.e., they are asymptotically\ngood.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2010 19:56:11 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Mitchell", "David G. M.", ""], ["Lentmaier", "Michael", ""], ["Costello", "Daniel J.", "Jr."]]}, {"id": "1005.1155", "submitter": "Xin Wang", "authors": "Xin Wang and Chenyang Yang", "title": "Decentralized Estimation over Orthogonal Multiple-access Fading Channels\n  in Wireless Sensor Networks - Optimal and Suboptimal Estimators", "comments": null, "journal-ref": null, "doi": "10.1186/1687-6180-2011-132", "report-no": null, "categories": "cs.IT math.IT stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal and suboptimal decentralized estimators in wireless sensor networks\n(WSNs) over orthogonal multiple-access fading channels are studied in this\npaper. Considering multiple-bit quantization before digital transmission, we\ndevelop maximum likelihood estimators (MLEs) with both known and unknown\nchannel state information (CSI). When training symbols are available, we derive\na MLE that is a special case of the MLE with unknown CSI. It implicitly uses\nthe training symbols to estimate the channel coefficients and exploits the\nestimated CSI in an optimal way. To reduce the computational complexity, we\npropose suboptimal estimators. These estimators exploit both signal and data\nlevel redundant information to improve the estimation performance. The proposed\nMLEs reduce to traditional fusion based or diversity based estimators when\ncommunications or observations are perfect. By introducing a general message\nfunction, the proposed estimators can be applied when various analog or digital\ntransmission schemes are used. The simulations show that the estimators using\ndigital communications with multiple-bit quantization outperform the estimator\nusing analog-and-forwarding transmission in fading channels. When considering\nthe total bandwidth and energy constraints, the MLE using multiple-bit\nquantization is superior to that using binary quantization at medium and high\nobservation signal-to-noise ratio levels.\n", "versions": [{"version": "v1", "created": "Fri, 7 May 2010 08:30:39 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["Wang", "Xin", ""], ["Yang", "Chenyang", ""]]}, {"id": "1005.1284", "submitter": "Ayfer Ozgur", "authors": "Ayfer Ozgur and Suhas Diggavi", "title": "Approximately achieving Gaussian relay network capacity with lattice\n  codes", "comments": "ISIT 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, it has been shown that a quantize-map-and-forward scheme\napproximately achieves (within a constant number of bits) the Gaussian relay\nnetwork capacity for arbitrary topologies. This was established using Gaussian\ncodebooks for transmission and random mappings at the relays. In this paper, we\nshow that the same approximation result can be established by using lattices\nfor transmission and quantization along with structured mappings at the relays.\n", "versions": [{"version": "v1", "created": "Fri, 7 May 2010 19:54:59 GMT"}, {"version": "v2", "created": "Tue, 28 Feb 2012 10:58:25 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Ozgur", "Ayfer", ""], ["Diggavi", "Suhas", ""]]}, {"id": "1005.1339", "submitter": "Xi Liu", "authors": "Xi Liu, Elza Erkip", "title": "Coordination and Bargaining over the Gaussian Interference Channel", "comments": "5 pages, 4 figures, to appear in Proceedings of IEEE ISIT2010", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513349", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work considers coordination and bargaining between two selfish users\nover a Gaussian interference channel using game theory. The usual information\ntheoretic approach assumes full cooperation among users for codebook and rate\nselection. In the scenario investigated here, each selfish user is willing to\ncoordinate its actions only when an incentive exists and benefits of\ncooperation are fairly allocated. To improve communication rates, the two users\nare allowed to negotiate for the use of a simple Han-Kobayashi type scheme with\nfixed power split and conditions for which users have incentives to cooperate\nare identified. The Nash bargaining solution (NBS) is used as a tool to get\nfair information rates. The operating point is obtained as a result of an\noptimization problem and compared with a TDM-based one in the literature.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2010 15:28:21 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Liu", "Xi", ""], ["Erkip", "Elza", ""]]}, {"id": "1005.1349", "submitter": "Ali Al-Bashabsheh", "authors": "Ali Al-Bashabsheh, Yongyi Mao and Abbas Yongacoglu", "title": "On Holant Theorem and Its Proof", "comments": "25th Queen's Biennial Symposium on Communications.", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Holographic algorithms are a recent breakthrough in computer science and has\nfound applications in information theory. This paper provides a proof to the\ncentral component of holographic algorithms, namely, the Holant theorem.\nCompared with previous works, the proof appears simpler and more direct. Along\nthe proof, we also develop a mathematical tool, which we call c-tensor. We\nexpect the notion of c-tensor may be applicable over a wide range of analysis.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2010 19:28:55 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Al-Bashabsheh", "Ali", ""], ["Mao", "Yongyi", ""], ["Yongacoglu", "Abbas", ""]]}, {"id": "1005.1364", "submitter": "Sami Akin", "authors": "Sami Akin and Mustafa Cenk Gursoy", "title": "Cognitive Radio Transmission under QoS Constraints and Interference\n  Limitations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the performance of cognitive transmission under quality of\nservice (QoS)constraints and interference limitations is studied. Cognitive\nsecondary users are assumed to initially perform sensing over multiple\nfrequency bands (or equivalently channels) to detect the activities of primary\nusers. Subsequently, they perform transmission in a single channel at variable\npower and rates depending on the channel sensing decisions and the fading\nenvironment. A state transition model is constructed to model this cognitive\noperation. Statistical limitations on the buffer lengths are imposed to take\ninto account the QoS constraints of the cognitive secondary users. Under such\nQoS constraints and limitations on the interference caused to the primary\nusers, the maximum throughput is identified by finding the effective capacity\nof the cognitive radio channel. Optimal power allocation strategies are\nobtained and the optimal channel selection criterion is identified. The\nintricate interplay between effective capacity, interference and QoS\nconstraints, channel sensing parameters and reliability, fading, and the number\nof available frequency bands is investigated through numerical results.\n", "versions": [{"version": "v1", "created": "Sun, 9 May 2010 05:08:38 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Akin", "Sami", ""], ["Gursoy", "Mustafa Cenk", ""]]}, {"id": "1005.1365", "submitter": "ArunKumar Jayaprakasam", "authors": "ArunKumar Jayaprakasam, Vinod Sharma, Chandra R. Murthy and Prashant\n  Narayanan", "title": "Cooperative Sequential Spectrum Sensing Algorithms for OFDM", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the problem of spectrum sensing in cognitive radio\nnetworks when the primary user employs Orthogonal Frequency Division\nMultiplexing (OFDM). We develop cooperative sequential detection algorithms\nbased on energy detectors and the autocorrelation property of cyclic prefix\n(CP) used in OFDM systems and compare their performances. We show that\nsequential detection provides much better performance than the traditional\nfixed sample size (snapshot) based detectors. We also study the effect of model\nuncertainties such as timing and frequency offset, IQ-imbalance and uncertainty\nin noise and transmit power on the performance of the detectors. We modify the\ndetectors to mitigate the effects of these impairments. The performance of the\nproposed algorithms are studied via simulations. It is shown that energy\ndetector performs significantly better than the CP-based detector, except in\ncase of a snapshot detector with noise power uncertainty. Also, unlike for the\nCP-based detector, most of the above mentioned impairments have no effect on\nthe energy detector.\n", "versions": [{"version": "v1", "created": "Sun, 9 May 2010 05:25:09 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Jayaprakasam", "ArunKumar", ""], ["Sharma", "Vinod", ""], ["Murthy", "Chandra R.", ""], ["Narayanan", "Prashant", ""]]}, {"id": "1005.1369", "submitter": "Amit Weinstein", "authors": "Amit Weinstein", "title": "Simultaneous communication in noisy channels", "comments": null, "journal-ref": "Information Theory, IEEE Transactions on, Vol. 57, No. 10.\n  (October 2011), pp. 6455-6462", "doi": "10.1109/TIT.2011.2165798", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A sender wishes to broadcast a message of length $n$ over an alphabet to $r$\nusers, where each user $i$, $1 \\leq i \\leq r$ should be able to receive one of\n$m_i$ possible messages. The broadcast channel has noise for each of the users\n(possibly different noise for different users), who cannot distinguish between\nsome pairs of letters. The vector $(m_1, m_2,...s, m_r)_{(n)}$ is said to be\nfeasible if length $n$ encoding and decoding schemes exist enabling every user\nto decode his message. A rate vector $(R_1, R_2,..., R_r)$ is feasible if there\nexists a sequence of feasible vectors $(m_1, m_2,..., m_r)_{(n)}$ such that\n$R_i = \\lim_{n \\mapsto \\infty} \\frac {\\log_2 m_i} {n}, {for all} i$. We\ndetermine the feasible rate vectors for several different scenarios and\ninvestigate some of their properties. An interesting case discussed is when one\nuser can only distinguish between all the letters in a subset of the alphabet.\nTight restrictions on the feasible rate vectors for some specific noise types\nfor the other users are provided. The simplest non-trivial cases of two users\nand alphabet of size three are fully characterized. To this end a more general\npreviously known result, to which we sketch an alternative proof, is used. This\nproblem generalizes the study of the Shannon capacity of a graph, by\nconsidering more than a single user.\n", "versions": [{"version": "v1", "created": "Sun, 9 May 2010 06:53:19 GMT"}, {"version": "v2", "created": "Sat, 24 Dec 2011 10:08:17 GMT"}], "update_date": "2011-12-30", "authors_parsed": [["Weinstein", "Amit", ""]]}, {"id": "1005.1391", "submitter": "Dominguez-Montes Juan", "authors": "Juan Dominguez-Montes", "title": "Solution to the Counterfeit Coin Problem and its Generalization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work deals with a classic problem: \"Given a set of coins among which\nthere is a counterfeit coin of a different weight, find this counterfeit coin\nusing ordinary balance scales, with the minimum number of weighings possible,\nand indicate whether it weighs less or more than the rest\". The method proposed\nhere not only calculates the minimum number of weighings necessary, but also\nindicates how to perform these weighings, it is easily mechanizeable and valid\nfor any number of coins. Instructions are also given as to how to generalize\nthe procedure to include cases where there is more than one counterfeit coin.\n", "versions": [{"version": "v1", "created": "Sun, 9 May 2010 12:35:00 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Dominguez-Montes", "Juan", ""]]}, {"id": "1005.1524", "submitter": "Bezzateev Sergey Valentinovich", "authors": "Sergey Bezzateev and Natalia Shekhunova", "title": "Cumulative-Separable Codes", "comments": "14 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  q-ary cumulative-separable $\\Gamma(L,G^{(j)})$-codes $L=\\{ \\alpha \\in\nGF(q^{m}):G(\\alpha )\\neq 0 \\}$ and $G^{(j)}(x)=G(x)^{j}, 1 \\leq i\\leq q$ are\nconsidered. The relation between different codes from this class is\ndemonstrated. Improved boundaries of the minimum distance and dimension are\nobtained.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 12:52:57 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Bezzateev", "Sergey", ""], ["Shekhunova", "Natalia", ""]]}, {"id": "1005.1560", "submitter": "Laszlo Kish", "authors": "Laszlo B. Kish, Sunil Khatri and Tamas Horvath", "title": "Computation using Noise-based Logic: Efficient String Verification over\n  a Slow Communication Channel", "comments": "Accepted for publication in European Journal of Physics B (November\n  10, 2010)", "journal-ref": "Eur. Phys. J. B 79, 85-90 (2011)", "doi": "10.1140/epjb/e2010-10399-x", "report-no": null, "categories": "cs.IT math.IT physics.gen-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Utilizing the hyperspace of noise-based logic, we show two string\nverification methods with low communication complexity. One of them is based on\ncontinuum noise-based logic. The other one utilizes noise-based logic with\nrandom telegraph signals where a mathematical analysis of the error probability\nis also given. The last operation can also be interpreted as computing\nuniversal hash functions with noise-based logic and using them for string\ncomparison. To find out with 10^-25 error probability that two strings with\narbitrary length are different (this value is similar to the error probability\nof an idealistic gate in today's computer) Alice and Bob need to compare only\n83 bits of the noise-based hyperspace.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 14:24:33 GMT"}, {"version": "v2", "created": "Tue, 11 May 2010 16:34:33 GMT"}, {"version": "v3", "created": "Thu, 11 Nov 2010 23:22:02 GMT"}], "update_date": "2011-02-10", "authors_parsed": [["Kish", "Laszlo B.", ""], ["Khatri", "Sunil", ""], ["Horvath", "Tamas", ""]]}, {"id": "1005.1594", "submitter": "K. Raj Kumar", "authors": "K. Raj Kumar and Giuseppe Caire", "title": "Channel State Feedback over the MIMO-MAC", "comments": "Submitted to the IEEE Transactions on Information Theory, April 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of designing low latency and low complexity schemes\nfor channel state feedback over the MIMO-MAC (multiple-input multiple-output\nmultiple access channel). We develop a framework for analyzing this problem in\nterms of minimizing the MSE distortion, and come up with separated\nsource-channel schemes and joint source-channel schemes that perform better\nthan analog feedback. We also develop a strikingly simple code design based on\nscalar quantization and uncoded QAM modulation that achieves the theoretical\nasymptotic performance limit of the separated approach with very low complexity\nand latency, in the case of single-antenna users.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 15:40:05 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Kumar", "K. Raj", ""], ["Caire", "Giuseppe", ""]]}, {"id": "1005.1625", "submitter": "Nikolay Dimitrov", "authors": "Nikolay Dimitrov", "title": "On Some Results Related to Napoleon's Configurations", "comments": "10 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.MG cs.IT math.GM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is to give a purely geometric proof of a theorem by\nBranko Gr\\\"unbaum concerning configuration of triangles coming from the\nclassical Napoleon's theorem in planar Euclidean geometry.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 18:31:53 GMT"}], "update_date": "2010-05-12", "authors_parsed": [["Dimitrov", "Nikolay", ""]]}, {"id": "1005.1634", "submitter": "K. V. Rashmi", "authors": "Nihar B. Shah, K. V. Rashmi, P. Vijay Kumar, and Kannan Ramchandran", "title": "Interference Alignment in Regenerating Codes for Distributed Storage:\n  Necessity and Code Constructions", "comments": "38 pages, 12 figures, submitted to the IEEE Transactions on\n  Information Theory;v3 - The title has been modified to better reflect the\n  contributions of the submission. The paper is extensively revised with\n  several carefully constructed figures and examples", "journal-ref": null, "doi": "10.1109/TIT.2011.2178588", "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regenerating codes are a class of recently developed codes for distributed\nstorage that, like Reed-Solomon codes, permit data recovery from any arbitrary\nk of n nodes. However regenerating codes possess in addition, the ability to\nrepair a failed node by connecting to any arbitrary d nodes and downloading an\namount of data that is typically far less than the size of the data file. This\namount of download is termed the repair bandwidth. Minimum storage regenerating\n(MSR) codes are a subclass of regenerating codes that require the least amount\nof network storage; every such code is a maximum distance separable (MDS) code.\nFurther, when a replacement node stores data identical to that in the failed\nnode, the repair is termed as exact.\n  The four principal results of the paper are (a) the explicit construction of\na class of MDS codes for d = n-1 >= 2k-1 termed the MISER code, that achieves\nthe cut-set bound on the repair bandwidth for the exact-repair of systematic\nnodes, (b) proof of the necessity of interference alignment in exact-repair MSR\ncodes, (c) a proof showing the impossibility of constructing linear,\nexact-repair MSR codes for d < 2k-3 in the absence of symbol extension, and (d)\nthe construction, also explicit, of MSR codes for d = k+1. Interference\nalignment (IA) is a theme that runs throughout the paper: the MISER code is\nbuilt on the principles of IA and IA is also a crucial component to the\nnon-existence proof for d < 2k-3. To the best of our knowledge, the\nconstructions presented in this paper are the first, explicit constructions of\nregenerating codes that achieve the cut-set bound.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 19:50:04 GMT"}, {"version": "v2", "created": "Tue, 11 May 2010 16:49:40 GMT"}, {"version": "v3", "created": "Mon, 13 Sep 2010 10:52:45 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Shah", "Nihar B.", ""], ["Rashmi", "K. V.", ""], ["Kumar", "P. Vijay", ""], ["Ramchandran", "Kannan", ""]]}, {"id": "1005.1635", "submitter": "Hossein Bagheri", "authors": "Hossein Bagheri, Abolfazl S. Motahari, and Amir K. Khandani", "title": "The Approximate Capacity Region of the Gaussian Z-Interference Channel\n  with Conferencing Encoders", "comments": "25 pages, 6 figures, submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A two-user Gaussian Z-Interference Channel (GZIC) is considered, in which\nencoders are connected through noiseless links with finite capacities. In this\nsetting, prior to each transmission block the encoders communicate with each\nother over the cooperative links. The capacity region and the sum-capacity of\nthe channel are characterized within 1.71 bits per user and 2 bits in total,\nrespectively. It is also established that properly sharing the total limited\ncooperation capacity between the cooperative links may enhance the achievable\nregion, even when compared to the case of unidirectional transmitter\ncooperation with infinite cooperation capacity. To obtain the results,\ngenie-aided upper bounds on the sum-capacity and cut-set bounds on the\nindividual rates are compared with the achievable rate region. In the\ninterference-limited regime, the achievable scheme enjoys a simple type of\nHan-Kobayashi signaling, together with the zero-forcing, and basic relaying\ntechniques. In the noise-limited regime, it is shown that treating interference\nas noise achieves the capacity region up to a single bit per user.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 19:51:59 GMT"}, {"version": "v2", "created": "Thu, 27 May 2010 00:20:23 GMT"}], "update_date": "2010-05-28", "authors_parsed": [["Bagheri", "Hossein", ""], ["Motahari", "Abolfazl S.", ""], ["Khandani", "Amir K.", ""]]}, {"id": "1005.1684", "submitter": "John Scoville", "authors": "John Scoville", "title": "On Macroscopic Complexity and Perceptual Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.AI cs.MM cs.SD math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The theoretical limits of 'lossy' data compression algorithms are considered.\nThe complexity of an object as seen by a macroscopic observer is the size of\nthe perceptual code which discards all information that can be lost without\naltering the perception of the specified observer. The complexity of this\nmacroscopically observed state is the simplest description of any microstate\ncomprising that macrostate. Inference and pattern recognition based on\nmacrostate rather than microstate complexities will take advantage of the\ncomplexity of the macroscopic observer to ignore irrelevant noise.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 22:41:10 GMT"}, {"version": "v10", "created": "Tue, 14 Jun 2011 18:27:34 GMT"}, {"version": "v11", "created": "Mon, 4 Jul 2011 23:01:29 GMT"}, {"version": "v12", "created": "Thu, 7 Jul 2011 02:14:22 GMT"}, {"version": "v2", "created": "Mon, 24 May 2010 02:41:23 GMT"}, {"version": "v3", "created": "Wed, 9 Jun 2010 06:29:43 GMT"}, {"version": "v4", "created": "Wed, 22 Sep 2010 03:51:59 GMT"}, {"version": "v5", "created": "Thu, 23 Sep 2010 01:10:18 GMT"}, {"version": "v6", "created": "Thu, 7 Oct 2010 23:23:37 GMT"}, {"version": "v7", "created": "Wed, 20 Oct 2010 18:40:28 GMT"}, {"version": "v8", "created": "Tue, 26 Apr 2011 22:50:28 GMT"}, {"version": "v9", "created": "Tue, 10 May 2011 11:46:04 GMT"}], "update_date": "2011-07-08", "authors_parsed": [["Scoville", "John", ""]]}, {"id": "1005.1711", "submitter": "Meng Zeng", "authors": "Meng Zeng and Rui Zhang and Shuguang Cui", "title": "On Design of Distributed Beamforming for Two-Way Relay Networks", "comments": "12 pages, submitted to Trans. Signal Processing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a two-way relay network, where two source nodes, S1 and S2,\nexchange information through a cluster of relay nodes. The relay nodes receive\nthe sum signal from S1 and S2 in the first time slot. In the second time slot,\neach relay node multiplies its received signal by a complex coefficient and\nretransmits the signal to the two source nodes, which leads to a distributed\ntwo-way beamforming system. By applying the principle of analog network coding,\neach receiver at S1 and S2 cancels the ``self-interference'' in the received\nsignal from the relay cluster and decodes the message. This paper studies the\n2-dimensional achievable rate region for such a two-way relay network with\ndistributed beamforming. With different assumptions of channel reciprocity\nbetween the source-relay and relay-source channels, the achievable rate region\nis characterized under two setups. First, with reciprocal channels, we\ninvestigate the achievable rate regions when the relay cluster is subject to a\nsum-power constraint or individual-power constraints. We show that the optimal\nbeamforming vectors obtained from solving the weighted sum inverse-SNR\nminimization (WSISMin) problems are sufficient to characterize the\ncorresponding achievable rate region. Furthermore, we derive the closed form\nsolutions for those optimal beamforming vectors and consequently propose the\npartially distributed algorithms to implement the optimal beamforming, where\neach relay node only needs the local channel information and one global\nparameter. Second, with the non-reciprocal channels, the achievable rate\nregions are also characterized for both the sum-power constraint case and the\nindividual-power constraint case. Although no closed-form solutions are\navailable under this setup, we present efficient algorithms to compute the\noptimal beamforming vectors, which are attained by solving SDP problems after\nsemi-definite relaxation.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 04:34:39 GMT"}], "update_date": "2010-05-12", "authors_parsed": [["Zeng", "Meng", ""], ["Zhang", "Rui", ""], ["Cui", "Shuguang", ""]]}, {"id": "1005.1715", "submitter": "Sang-Woon Jeon", "authors": "Sang-Woon Jeon, Sae-Young Chung, and Syed A. Jafar", "title": "Degrees of Freedom Region of a Class of Multi-source Gaussian Relay\n  Networks", "comments": "19 pages, 5 figures, published in IEEE Transactions on Information\n  Theory", "journal-ref": "EEE Transactions on Information Theory, Special Issue on\n  Interference Networks, vol. 57, no. 5, pp. 3032-3044, May 2011", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a layered $K$-user $M$-hop Gaussian relay network consisting of\n$K_m$ nodes in the $m^{\\operatorname{th}}$ layer, where $M\\geq2$ and\n$K=K_1=K_{M+1}$. We observe that the time-varying nature of wireless channels\nor fading can be exploited to mitigate the inter-user interference. The\nproposed amplify-and-forward relaying scheme exploits such channel variations\nand works for a wide class of channel distributions including Rayleigh fading.\nWe show a general achievable degrees of freedom (DoF) region for this class of\nGaussian relay networks. Specifically, the set of all $(d_1,..., d_K)$ such\nthat $d_i\\leq 1$ for all $i$ and $\\sum_{i=1}^K d_i\\leq K_{\\Sigma}$ is\nachievable, where $d_i$ is the DoF of the $i^{\\operatorname{th}}$\nsource--destination pair and $K_{\\Sigma}$ is the maximum integer such that\n$K_{\\Sigma}\\leq \\min_m\\{K_m\\}$ and $M/K_{\\Sigma}$ is an integer. We show that\nsurprisingly the achievable DoF region coincides with the cut-set outer bound\nif $M/\\min_m\\{K_m\\}$ is an integer, thus interference-free communication is\npossible in terms of DoF. We further characterize an achievable DoF region\nassuming multi-antenna nodes and general message set, which again coincides\nwith the cut-set outer bound for a certain class of networks.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 05:12:44 GMT"}, {"version": "v2", "created": "Sun, 27 May 2012 19:16:44 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Jeon", "Sang-Woon", ""], ["Chung", "Sae-Young", ""], ["Jafar", "Syed A.", ""]]}, {"id": "1005.1785", "submitter": "Yipeng Liu Dr.", "authors": "Yipeng Liu and Qun Wan", "title": "Sidelobe Suppression for Robust Beamformer via The Mixed Norm Constraint", "comments": "10 pages, 3 figures; accepted by Wireless Personal Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Applying a sparse constraint on the beam pattern has been suggested to\nsuppress the sidelobe of the minimum variance distortionless response (MVDR)\nbeamformer recently. To further improve the performance, we add a mixed norm\nconstraint on the beam pattern. It matches the beam pattern better and\nencourages dense distribution in mainlobe and sparse distribution in sidelobe.\nThe obtained beamformer has a lower sidelobe level and deeper nulls for\ninterference avoidance than the standard sparse constraint based beamformer.\nSimulation demonstrates that the SINR gain is considerable for its lower\nsidelobe level and deeper nulling for interference, while the robustness\nagainst the mismatch between the steering angle and the direction of arrival\n(DOA) of the desired signal, caused by imperfect estimation of DOA, is\nmaintained too.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 10:09:51 GMT"}, {"version": "v2", "created": "Sun, 23 May 2010 14:23:40 GMT"}, {"version": "v3", "created": "Tue, 25 May 2010 08:23:11 GMT"}, {"version": "v4", "created": "Mon, 7 Jun 2010 10:04:34 GMT"}, {"version": "v5", "created": "Sat, 18 Jun 2011 09:02:04 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Liu", "Yipeng", ""], ["Wan", "Qun", ""]]}, {"id": "1005.1800", "submitter": "Yipeng Liu Dr.", "authors": "Yipeng Liu, Qun Wan, Xiaoli Chu", "title": "Power-Efficient Ultra-Wideband Waveform Design Considering Radio Channel\n  Effects", "comments": "14 pages, 2 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper presents a power-efficient mask-constrained ultra-wideband (UWB)\nwaveform design with radio channel effects taken into consideration. Based on a\nfinite impulse response (FIR) filter, we develop a convex optimization model\nwith respect to the autocorrelation of the filter coefficients to optimize the\ntransmitted signal power spectrum, subject to a regulatory emission mask. To\nimprove power efficiency, effects of transmitter radio frequency (RF)\ncomponents are included in the optimization of the transmitter-output waveform,\nand radio propagation effects are considered for optimizing at the receiver.\nOptimum coefficients of the FIR filter are obtained through spectral\nfactorization of their autocorrelations. Simulation results show that the\nproposed method is able to maximize the transmitted UWB signal power under mask\nconstraints set by regulatory authorities, while mitigating the power loss\ncaused by channel attenuations.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 11:24:40 GMT"}], "update_date": "2010-05-12", "authors_parsed": [["Liu", "Yipeng", ""], ["Wan", "Qun", ""], ["Chu", "Xiaoli", ""]]}, {"id": "1005.1801", "submitter": "Yipeng Liu Dr.", "authors": "Yipeng Liu, Qun Wan, Fei Wen, Jia Xu, Yingning Peng", "title": "Sparse Support Recovery with Phase-Only Measurements", "comments": "15 pages, 3 figures; accepted by International Journal of the\n  Physical Sciences", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sparse support recovery (SSR) is an important part of the compressive sensing\n(CS). Most of the current SSR methods are with the full information\nmeasurements. But in practice the amplitude part of the measurements may be\nseriously destroyed. The corrupted measurements mismatch the current SSR\nalgorithms, which leads to serious performance degeneration. This paper\nconsiders the problem of SSR with only phase information. In the proposed\nmethod, the minimization of the l1 norm of the estimated sparse signal enforces\nsparse distribution, while a nonzero constraint of the uncorrupted random\nmeasurements' amplitudes with respect to the reconstructed sparse signal is\nintroduced. Because it only requires the phase components of the measurements\nin the constraint, it can avoid the performance deterioration by corrupted\namplitude components. Simulations demonstrate that the proposed phase-only SSR\nis superior in the support reconstruction accuracy when the amplitude\ncomponents of the measurements are contaminated.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 11:35:02 GMT"}, {"version": "v2", "created": "Sat, 18 Jun 2011 09:02:21 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Liu", "Yipeng", ""], ["Wan", "Qun", ""], ["Wen", "Fei", ""], ["Xu", "Jia", ""], ["Peng", "Yingning", ""]]}, {"id": "1005.1803", "submitter": "Yipeng Liu Dr.", "authors": "Yipeng Liu, Qun Wan", "title": "Anti-Sampling-Distortion Compressive Wideband Spectrum Sensing for\n  Cognitive Radio", "comments": "24 pages, 4 figures, 1 table; accepted by International Journal of\n  Mobile Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Too high sampling rate is the bottleneck to wideband spectrum sensing for\ncognitive radio in mobile communication. Compressed sensing (CS) is introduced\nto transfer the sampling burden. The standard sparse signal recovery of CS does\nnot consider the distortion in the analogue-to-information converter (AIC). To\nmitigate performance degeneration casued by the mismatch in least square\ndistortionless constraint which doesn't consider the AIC distortion, we define\nthe sparse signal with the sampling distortion as a bounded additive noise, and\nAn anti-sampling-distortion constraint (ASDC) is deduced. Then we combine the\n\\ell1 norm based sparse constraint with the ASDC to get a novel robust sparse\nsignal recovery operator with sampling distortion. Numerical simulations\ndemonstrate that the proposed method outperforms standard sparse wideband\nspectrum sensing in accuracy, denoising ability, etc.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 11:45:51 GMT"}, {"version": "v2", "created": "Sat, 18 Jun 2011 09:01:43 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Liu", "Yipeng", ""], ["Wan", "Qun", ""]]}, {"id": "1005.1804", "submitter": "Yipeng Liu Dr.", "authors": "Yipeng Liu, Qun Wan", "title": "Compressive Wideband Spectrum Sensing for Fixed Frequency Spectrum\n  Allocation", "comments": "21 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Too high sampling rate is the bottleneck to wideband spectrum sensing for\ncognitive radio (CR). As the survey shows that the sensed signal has a sparse\nrepresentation in frequency domain in the mass, compressed sensing (CS) can be\nused to transfer the sampling burden to the digital signal processor. An analog\nto information converter (AIC) can randomly sample the received signal with\nsub-Nyquist rate to obtained the random measurements. Considering that the\nstatic frequency spectrum allocation of primary radios means the bounds between\ndifferent primary radios is known in advance, here we incorporate information\nof the spectrum boundaries between different primary user as a priori\ninformation to obtain a mixed l2/l1 norm denoising operator (MNDO). In the\nMNDO, the estimated power spectrum density (PSD) vector is divided into block\nsections with bounds corresponding different allocated primary radios.\nDifferent from previous standard l1-norm constraint on the whole PSD vector, a\nsum of the l2 norm of each section of the PSD vector is minimized to encourage\nthe local grouping distribution while the sparse distribution in mass, while a\nrelaxed constraint is used to improve the denoising performance. Simulation\ndemonstrates that the proposed method outperforms standard sparse spectrum\nestimation in accuracy, denoising ability, etc.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 11:51:34 GMT"}], "update_date": "2010-05-12", "authors_parsed": [["Liu", "Yipeng", ""], ["Wan", "Qun", ""]]}, {"id": "1005.1871", "submitter": "Fernando  Hernando", "authors": "Fernando Hernando, Michael E. O'Sullivan, Emanuel Popovici and\n  Shraddha Srivastava", "title": "Subfield-Subcodes of Generalized Toric codes", "comments": "Submitted to 2010 IEEE International Symposium on Information Theory\n  (ISIT 2010)", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513688", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study subfield-subcodes of Generalized Toric (GT) codes over\n$\\mathbb{F}_{p^s}$. These are the multidimensional analogues of BCH codes,\nwhich may be seen as subfield-subcodes of generalized Reed-Solomon codes. We\nidentify polynomial generators for subfield-subcodes of GT codes which allows\nus to determine the dimensions and obtain bounds for the minimum distance. We\ngive several examples of binary and ternary subfield-subcodes of GT codes that\nare the best known codes of a given dimension and length.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 15:56:31 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Hernando", "Fernando", ""], ["O'Sullivan", "Michael E.", ""], ["Popovici", "Emanuel", ""], ["Srivastava", "Shraddha", ""]]}, {"id": "1005.2061", "submitter": "Nikola Zlatanov", "authors": "Nikola Zlatanov, Zoran Hadzi-Velkov, George K. Karagiannidis and\n  Robert Schober", "title": "Cooperative Diversity with Mobile Nodes: Capacity Outage Rate and\n  Duration", "comments": "IEEE Transactions on Information Theory (2011)", "journal-ref": null, "doi": "10.1109/TIT.2011.2165794", "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The outage probability is an important performance measure for cooperative\ndiversity schemes. However, in mobile environments, the outage probability does\nnot completely describe the behavior of cooperative diversity schemes since the\nmobility of the involved nodes introduces variations in the channel gains. As a\nresult, the capacity outage events are correlated in time and second-order\nstatistical parameters of the achievable information-theoretic capacity such as\nthe average capacity outage rate (AOR) and the average capacity outage duration\n(AOD) are required to obtain a more complete description of the properties of\ncooperative diversity protocols. In this paper, assuming slow Rayleigh fading,\nwe derive exact expressions for the AOR and the AOD of three well-known\ncooperative diversity protocols: variable-gain amplify-and-forward,\ndecode-and-forward, and selection decode-and-forward relaying. Furthermore, we\ndevelop asymptotically tight high signal-to-noise ratio (SNR) approximations,\nwhich offer important insights into the influence of various system and channel\nparameters on the AOR and AOD. In particular, we show that on a\ndouble-logarithmic scale, similar to the outage probability, the AOR\nasymptotically decays with the SNR with a slope that depends on the diversity\ngain of the cooperative protocol, whereas the AOD asymptotically decays with a\nslope of -1/2 independent of the diversity gain.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2010 11:49:40 GMT"}, {"version": "v2", "created": "Tue, 9 Aug 2011 01:26:07 GMT"}, {"version": "v3", "created": "Mon, 31 Oct 2011 17:03:07 GMT"}], "update_date": "2011-11-01", "authors_parsed": [["Zlatanov", "Nikola", ""], ["Hadzi-Velkov", "Zoran", ""], ["Karagiannidis", "George K.", ""], ["Schober", "Robert", ""]]}, {"id": "1005.2249", "submitter": "Tong Zhang", "authors": "Tong Zhang", "title": "Sparse Recovery with Orthogonal Matching Pursuit under RIP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a new analysis for the orthogonal matching pursuit (OMP)\nalgorithm. It is shown that if the restricted isometry property (RIP) is\nsatisfied at sparsity level $O(\\bar{k})$, then OMP can recover a\n$\\bar{k}$-sparse signal in 2-norm. For compressed sensing applications, this\nresult implies that in order to uniformly recover a $\\bar{k}$-sparse signal in\n$\\Real^d$, only $O(\\bar{k} \\ln d)$ random projections are needed. This analysis\nimproves earlier results on OMP that depend on stronger conditions such as\nmutual incoherence that can only be satisfied with $\\Omega(\\bar{k}^2 \\ln d)$\nrandom projections.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2010 02:38:29 GMT"}, {"version": "v2", "created": "Fri, 3 Jun 2011 04:54:57 GMT"}], "update_date": "2011-06-06", "authors_parsed": [["Zhang", "Tong", ""]]}, {"id": "1005.2251", "submitter": "Onur Sahin", "authors": "Onur Sahin, Osvaldo Simeone, and Elza Erkip", "title": "Interference Channel with a Half-Duplex Out-of-Band Relay", "comments": "5 pages, 5 figures, to appear in Proceedings of IEEE ISIT 2010", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513378", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Gaussian interference channel (IC) aided by a half-duplex relay is\nconsidered, in which the relay receives and transmits in an orthogonal band\nwith respect to the IC. The system thus consists of two parallel channels, the\nIC and the channel over which the relay is active, which is referred to as\nOut-of-Band Relay Channel (OBRC). The OBRC is operated by separating a multiple\naccess phase from the sources to the relay and a broadcast phase from the relay\nto the destinations. Conditions under which the optimal operation, in terms of\nthe sum-capacity, entails either signal relaying and/or interference forwarding\nby the relay are identified. These conditions also assess the optimality of\neither separable or non-separable transmission over the IC and OBRC.\nSpecifically, the optimality of signal relaying and separable coding is\nestablished for scenarios where the relay-to-destination channels set the\nperformance bottleneck with respect to the source-to-relay channels on the\nOBRC. Optimality of interference forwarding and non-separable operation is also\nestablished in special cases.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2010 02:54:49 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Sahin", "Onur", ""], ["Simeone", "Osvaldo", ""], ["Erkip", "Elza", ""]]}, {"id": "1005.2254", "submitter": "John Scoville", "authors": "John Scoville", "title": "On Universal Complexity Measures", "comments": "The paper has been withdrawn due to the poor predictive performance\n  of circuit complexity vs. universal data compression. Given this fact, as\n  well as the high computational complexity, the method seems to have little\n  practical utility", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We relate the computational complexity of finite strings to universal\nrepresentations of their underlying symmetries. First, Boolean functions are\nclassified using the universal covering topologies of the circuits which\nenumerate them. A binary string is classified as a fixed point of its\nautomorphism group; the irreducible representation of this group is the\nstring's universal covering group. Such a measure may be used to test the\nquasi-randomness of binary sequences with regard to first-order set membership.\nNext, strings over general alphabets are considered. The complexity of a\ngeneral string is given by a universal representation which recursively factors\nthe codeword number associated with a string. This is the complexity of the\nrepresentation recursively decoding a Godel number having the value of the\nstring; the result is a tree of prime numbers which forms a universal\nrepresentation of the string's group symmetries.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2010 03:45:44 GMT"}, {"version": "v2", "created": "Mon, 17 May 2010 10:58:58 GMT"}, {"version": "v3", "created": "Tue, 18 May 2010 17:14:55 GMT"}, {"version": "v4", "created": "Mon, 24 May 2010 02:44:36 GMT"}, {"version": "v5", "created": "Mon, 27 Sep 2010 02:48:15 GMT"}, {"version": "v6", "created": "Fri, 1 Oct 2010 03:28:56 GMT"}, {"version": "v7", "created": "Thu, 7 Oct 2010 22:51:13 GMT"}, {"version": "v8", "created": "Wed, 20 Oct 2010 18:39:14 GMT"}, {"version": "v9", "created": "Fri, 16 Sep 2011 23:55:09 GMT"}], "update_date": "2011-09-20", "authors_parsed": [["Scoville", "John", ""]]}, {"id": "1005.2267", "submitter": "Guan Gui Mr", "authors": "Guan Gui, Wei Peng, Qun Wan, and Fumiyuki Adachi", "title": "A Fast Compressive Channel Estimation with Modified Smoothed L0\n  Algorithm", "comments": "4 pages, 4 figures, ICCACS2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Broadband wireless channel is a time dispersive and becomes strongly\nfrequency selective. In most cases, the channel is composed of a few dominant\ncoefficients and a large part of coefficients is approximately zero or zero. To\nexploit the sparsity of multi-path channel (MPC), there are various methods\nhave been proposed. They are, namely, greedy algorithms, iterative algorithms,\nand convex program. The former two algorithms are easy to be implemented but\nnot stable; on the other hand, the last method is stable but difficult to be\nimplemented as practical channel estimation problems because of computational\ncomplexity. In this paper, we proposed a novel channel estimation strategy by\nusing modified smoothed (MSL0) algorithm which combines stable and low\ncomplexity. Computer simulations confirm the effectiveness of the introduced\nalgorithm comparisons with the existing methods. We also give\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2010 08:18:26 GMT"}], "update_date": "2010-05-14", "authors_parsed": [["Gui", "Guan", ""], ["Peng", "Wei", ""], ["Wan", "Qun", ""], ["Adachi", "Fumiyuki", ""]]}, {"id": "1005.2269", "submitter": "Guan Gui Mr", "authors": "Guan Gui, An-min Huang, Qun Wan", "title": "Sparse Multipath Channel Estimation using DS Algorithm in Wideband\n  Communication Systems", "comments": "4 pages, 4 figures, Wicom2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wideband wireless channel is a time dispersive channel and becomes strongly\nfrequency-selective. However, in most cases, the channel is composed of a few\ndominant taps and a large part of taps is approximately zero or zero. They are\noften called sparse multi-path channels (MPC). Conventional linear MPC methods,\nsuch as the least squares (LS), do not exploit the sparsity of MPC. In general,\naccurate sparse MPC estimator can be obtained by solving a LASSO problem even\nin the presence of noise. In this paper, a novel CS-based sparse MPC method by\nusing Dantzig selector (DS) [1] is introduced. This method exploits a channel's\nsparsity to reduce the number of training sequence and, hence, increase\nspectral efficiency when compared to existed methods with computer simulations.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2010 08:28:59 GMT"}], "update_date": "2010-05-14", "authors_parsed": [["Gui", "Guan", ""], ["Huang", "An-min", ""], ["Wan", "Qun", ""]]}, {"id": "1005.2270", "submitter": "Guan Gui Mr", "authors": "Guan Gui, Qun Wan, Wei Peng and Fumiyuki Adachi", "title": "Sparse Multipath Channel Estimation Using Compressive Sampling Matching\n  Pursuit Algorithm", "comments": "5 pages, 7figures, IEEE APWCS 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wideband wireless channel is a time dispersive channel and becomes strongly\nfrequency-selective. However, in most cases, the channel is composed of a few\ndominant taps and a large part of taps is approximately zero or zero. To\nexploit the sparsity of multi-path channel (MPC), two methods have been\nproposed. They are, namely, greedy algorithm and convex program. Greedy\nalgorithm is easy to be implemented but not stable; on the other hand, the\nconvex program method is stable but difficult to be implemented as practical\nchannel estimation problems. In this paper, we introduce a novel channel\nestimation strategy using compressive sampling matching pursuit (CoSaMP)\nalgorithm which was proposed in [1]. This algorithm will combine the greedy\nalgorithm with the convex program method. The effectiveness of the proposed\nalgorithm will be confirmed through comparisons with the existing methods.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2010 08:31:44 GMT"}], "update_date": "2010-05-14", "authors_parsed": [["Gui", "Guan", ""], ["Wan", "Qun", ""], ["Peng", "Wei", ""], ["Adachi", "Fumiyuki", ""]]}, {"id": "1005.2321", "submitter": "Patrick Mitran", "authors": "Patrick Mitran", "title": "Typical Sequences for Polish Alphabets", "comments": "Submitted to IEEE Transactions on Information Theory. 29 pages.", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion of typical sequences plays a key role in the theory of\ninformation. Central to the idea of typicality is that a sequence $x_1, x_2,\n..., x_n$ that is $P_X$-typical should, loosely speaking, have an empirical\ndistribution that is in some sense close to the distribution $P_X$. The two\nmost common notions of typicality are that of strong (letter) typicality and\nweak (entropy) typicality. While weak typicality allows one to apply many\narguments that can be made with strongly typical arguments, some arguments for\nstrong typicality cannot be generalized to weak typicality. In this paper, we\nconsider an alternate definition of typicality, namely one based on the weak*\ntopology and that is applicable to Polish alphabets (which includes\n$\\reals^n$). This notion is a generalization of strong typicality in the sense\nthat it degenerates to strong typicality in the finite alphabet case, and can\nalso be applied to mixed and continuous distributions. Furthermore, it is\nstrong enough to prove a Markov lemma, and thus can be used to directly prove a\nmore general class of results than weak typicality. As an example of this\ntechnique, we directly prove achievability for Gel'fand-Pinsker channels with\ninput constraints for a large class of alphabets and channels without first\nproving a finite alphabet result and then resorting to delicate quantization\narguments. While this large class does not include Gaussian distributions with\npower constraints, it is shown to be straightforward to recover this case by\nconsidering a sequence of truncated Gaussian distributions.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2010 13:43:48 GMT"}], "update_date": "2010-05-14", "authors_parsed": [["Mitran", "Patrick", ""]]}, {"id": "1005.2443", "submitter": "Ernest Kurniawan", "authors": "E. Kurniawan, S. Sun, K. Yen, and K. F. E. Chong", "title": "Network Coded Transmission of Fountain Codes over Cooperative Relay\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a transmission strategy of fountain codes over cooperative\nrelay networks is proposed. When more than one relay nodes are available, we\napply network coding to fountain-coded packets. By doing this, partial\ninformation is made available to the destination node about the upcoming\nmessage block. It is therefore able to reduce the required number of\ntransmissions over erasure channels, hence increasing the effective throughput.\nIts application to wireless channels with Rayleigh fading and AWGN noise is\nalso analysed, whereby the role of analogue network coding and optimal weight\nselection is demonstrated.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2010 01:29:33 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Kurniawan", "E.", ""], ["Sun", "S.", ""], ["Yen", "K.", ""], ["Chong", "K. F. E.", ""]]}, {"id": "1005.2544", "submitter": "Quanquan Liang", "authors": "Quanquan Liang, Mingyan Liu", "title": "Channel Estimation for Opportunistic Spectrum Access: Uniform and Random\n  Sensing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The knowledge of channel statistics can be very helpful in making sound\nopportunistic spectrum access decisions. It is therefore desirable to be able\nto efficiently and accurately estimate channel statistics. In this paper we\nstudy the problem of optimally placing sensing times over a time window so as\nto get the best estimate on the parameters of an on-off renewal channel. We are\nparticularly interested in a sparse sensing regime with a small number of\nsamples relative to the time window size. Using Fisher information as a\nmeasure, we analytically derive the best and worst sensing sequences under a\nsparsity condition. We also present a way to derive the best/worst sequences\nwithout this condition using a dynamic programming approach. In both cases the\nworst turns out to be the uniform sensing sequence, where sensing times are\nevenly spaced within the window. With these results we argue that without a\npriori knowledge, a robust sensing strategy should be a randomized strategy. We\nthen compare different random schemes using a family of distributions generated\nby the circular $\\beta$ ensemble, and propose an adaptive sensing scheme to\neffectively track time-varying channel parameters. We further discuss the\napplicability of compressive sensing for this problem.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2010 14:44:09 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Liang", "Quanquan", ""], ["Liu", "Mingyan", ""]]}, {"id": "1005.2613", "submitter": "Deanna Needell", "authors": "Emmanuel J. Candes, Yonina C. Eldar, Deanna Needell, Paige Randall", "title": "Compressed Sensing with Coherent and Redundant Dictionaries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents novel results concerning the recovery of signals from\nundersampled data in the common situation where such signals are not sparse in\nan orthonormal basis or incoherent dictionary, but in a truly redundant\ndictionary. This work thus bridges a gap in the literature and shows not only\nthat compressed sensing is viable in this context, but also that accurate\nrecovery is possible via an L1-analysis optimization problem. We introduce a\ncondition on the measurement/sensing matrix, which is a natural generalization\nof the now well-known restricted isometry property, and which guarantees\naccurate recovery of signals that are nearly sparse in (possibly) highly\novercomplete and coherent dictionaries. This condition imposes no incoherence\nrestriction on the dictionary and our results may be the first of this kind. We\ndiscuss practical examples and the implications of our results on those\napplications, and complement our study by demonstrating the potential of\nL1-analysis for such problems.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2010 19:32:13 GMT"}, {"version": "v2", "created": "Sat, 23 Oct 2010 04:22:15 GMT"}, {"version": "v3", "created": "Sat, 4 Dec 2010 20:52:18 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Candes", "Emmanuel J.", ""], ["Eldar", "Yonina C.", ""], ["Needell", "Deanna", ""], ["Randall", "Paige", ""]]}, {"id": "1005.2646", "submitter": "Chen Feng", "authors": "Chen Feng, Danilo Silva and Frank R. Kschischang", "title": "An Algebraic Approach to Physical-Layer Network Coding", "comments": "5 pages, 3 figures, accepted to IEEE Int. Symp. Information Theory,\n  2010", "journal-ref": null, "doi": "10.1109/TIT.2013.2274264", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of designing new physical-layer network coding (PNC) schemes via\nlattice partitions is considered. Building on a recent work by Nazer and\nGastpar, who demonstrated its asymptotic gain using information-theoretic\ntools, we take an algebraic approach to show its potential in non-asymptotic\nsettings. We first relate Nazer-Gastpar's approach to the fundamental theorem\nof finitely generated modules over a principle ideal domain. Based on this\nconnection, we generalize their code construction and simplify their encoding\nand decoding methods. This not only provides a transparent understanding of\ntheir approach, but more importantly, it opens up the opportunity to design\nefficient and practical PNC schemes. Finally, we apply our framework for PNC to\na Gaussian relay network and demonstrate its advantage over conventional PNC\nschemes.\n", "versions": [{"version": "v1", "created": "Sat, 15 May 2010 02:10:54 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Feng", "Chen", ""], ["Silva", "Danilo", ""], ["Kschischang", "Frank R.", ""]]}, {"id": "1005.2662", "submitter": "Saber Jafarizadeh", "authors": "Saber Jafarizadeh", "title": "Fastest Distributed Consensus Averaging Problem on Perfect and Complete\n  n-ary Tree networks", "comments": "19 pages, 3 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Solving fastest distributed consensus averaging problem (i.e., finding\nweights on the edges to minimize the second-largest eigenvalue modulus of the\nweight matrix) over networks with different topologies is one of the primary\nareas of research in the field of sensor networks and one of the well known\nnetworks in this issue is tree network. Here in this work we present analytical\nsolution for the problem of fastest distributed consensus averaging algorithm\nby means of stratification and semidefinite programming, for two particular\ntypes of tree networks, namely perfect and complete n-ary tree networks. Our\nmethod in this paper is based on convexity of fastest distributed consensus\naveraging problem, and inductive comparing of the characteristic polynomials\ninitiated by slackness conditions in order to find the optimal weights. Also\nthe optimal weights for the edges of certain types of branches such as perfect\nand complete n-ary tree branches are determined independently of rest of the\nnetwork.\n", "versions": [{"version": "v1", "created": "Sat, 15 May 2010 10:00:09 GMT"}], "update_date": "2010-05-18", "authors_parsed": [["Jafarizadeh", "Saber", ""]]}, {"id": "1005.2710", "submitter": "Si-Hyeon Lee", "authors": "Si-Hyeon Lee and Sae-Young Chung", "title": "Capacity of a Class of Multicast Tree Networks", "comments": "27 pages, 2 figures, 1 table. Revised version in response to referee\n  comments (in revision for IEEE Transactions on Information Theory)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we characterize the capacity of a new class of single-source\nmulticast discrete memoryless relay networks having a tree topology in which\nthe root node is the source and each parent node in the graph has at most one\nnoisy child node and any number of noiseless child nodes. This class of\nmulticast tree networks includes the class of diamond networks studied by Kang\nand Ulukus as a special case, where they showed that the capacity can be\nstrictly lower than the cut-set bound. For achievablity, a novel coding scheme\nis constructed where each noisy relay employs a combination of\ndecode-and-forward (DF) and compress-and-forward (CF) and each noiseless relay\nperforms a random binning such that codebook constructions and relay operations\nare independent for each node and do not depend on the network topology. For\nconverse, a new technique of iteratively manipulating inequalities exploiting\nthe tree topology is used.\n", "versions": [{"version": "v1", "created": "Sat, 15 May 2010 22:35:43 GMT"}, {"version": "v2", "created": "Tue, 18 Oct 2011 07:11:31 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Lee", "Si-Hyeon", ""], ["Chung", "Sae-Young", ""]]}, {"id": "1005.2731", "submitter": "Wei Hou Mr.", "authors": "Wei Hou, Lin Zhang, Lei Yang, Heather Zheng, Xiuming Shan", "title": "Cross-Band Interference Considered Harmful in OFDM Based Distributed\n  Spectrum Sharing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past few years we have witnessed the paradigm shift from static\nspectrum allocation to dynamic spectrum access/sharing. Orthogonal\nFrequency-Division Multiple Access (OFDMA) is a promising mechanism to\nimplement the agile spectrum access. However, in wireless distributed networks\nwhere tight synchronization is infeasible, OFDMA faces the problem of\ncross-band interference. Subcarriers used by different users are no longer\northogonal, and transmissions operating on non-overlapping subcarriers can\ninterfere with each other. In this paper, we explore the cause of cross-band\ninterference and analytically quantify its strength and impact on packet\ntransmissions. Our analysis captures three key practical artifacts: inter-link\nfrequency offset, temporal sampling mismatch and power heterogeneity. To our\nbest knowledge, this work is the first to systematically analyze the cause and\nimpact of cross-band interference. Using insights from our analysis, we then\nbuild and compared three mitigating methods to combat cross-band interference.\nAnalytical and simulation results show that placing frequency guardband at link\nboundaries is the most effective solution in distributed spectrum sharing,\nwhile the other two frequency-domain methods are sensitive to either temporal\nsampling mismatch or inter-link frequency offset. We find that the proper\nguardband size depends heavily on power heterogeneity. Consequently, protocol\ndesigns for dynamic spectrum access should carefully take into account the\ncross-band interference when configuring spectrum usage.\n", "versions": [{"version": "v1", "created": "Sun, 16 May 2010 09:06:54 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Hou", "Wei", ""], ["Zhang", "Lin", ""], ["Yang", "Lei", ""], ["Zheng", "Heather", ""], ["Shan", "Xiuming", ""]]}, {"id": "1005.2759", "submitter": "Eran Hof", "authors": "Eran Hof and Shlomo Shamai", "title": "Secrecy-Achieving Polar-Coding for Binary-Input Memoryless Symmetric\n  Wire-Tap Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A polar coding scheme is introduced in this paper for the wire-tap channel.\nIt is shown that the provided scheme achieves the entire rate-equivocation\nregion for the case of symmetric and degraded wire-tap channel, where the weak\nnotion of secrecy is assumed. For the particular case of binary erasure\nwire-tap channel, an alternative proof is given. The case of general\nnon-degraded wire-tap channels is also considered.\n", "versions": [{"version": "v1", "created": "Sun, 16 May 2010 17:16:32 GMT"}, {"version": "v2", "created": "Sun, 15 Aug 2010 16:32:52 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Hof", "Eran", ""], ["Shamai", "Shlomo", ""]]}, {"id": "1005.2770", "submitter": "Eran Hof", "authors": "Eran Hof, Igal Sason, Shlomo Shamai, Chao Tian", "title": "Capacity-Achieving Polar Codes for Arbitrarily-Permuted Parallel\n  Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Channel coding over arbitrarily-permuted parallel channels was first studied\nby Willems et al. (2008). This paper introduces capacity-achieving polar coding\nschemes for arbitrarily-permuted parallel channels where the component channels\nare memoryless, binary-input and output-symmetric.\n", "versions": [{"version": "v1", "created": "Sun, 16 May 2010 18:53:47 GMT"}, {"version": "v2", "created": "Tue, 4 Oct 2011 07:41:52 GMT"}, {"version": "v3", "created": "Sun, 19 Aug 2012 19:26:14 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Hof", "Eran", ""], ["Sason", "Igal", ""], ["Shamai", "Shlomo", ""], ["Tian", "Chao", ""]]}, {"id": "1005.2839", "submitter": "Axel Kohnert", "authors": "Andreas-Stephan Elsenhans, Axel Kohnert, Alfred Wassermann", "title": "Construction of Codes for Network Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on ideas of K\\\"otter and Kschischang we use constant dimension\nsubspaces as codewords in a network. We show a connection to the theory of\nq-analogues of a combinatorial designs, which has been studied in Braun, Kerber\nand Laue as a purely combinatorial object. For the construction of network\ncodes we successfully modified methods (construction with prescribed\nautomorphisms) originally developed for the q-analogues of a combinatorial\ndesigns. We then give a special case of that method which allows the\nconstruction of network codes with a very large ambient space and we also show\nhow to decode such codes with a very small number of operations.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2010 08:40:09 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Elsenhans", "Andreas-Stephan", ""], ["Kohnert", "Axel", ""], ["Wassermann", "Alfred", ""]]}, {"id": "1005.2880", "submitter": "Tirza Routtenberg", "authors": "Tirza Routtenberg and Joseph Tabrikian", "title": "General Classes of Lower Bounds on the Probability of Error in Multiple\n  Hypothesis Testing", "comments": "submitted to IEEE Trans. on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, two new classes of lower bounds on the probability of error\nfor $m$-ary hypothesis testing are proposed. Computation of the minimum\nprobability of error which is attained by the maximum a-posteriori probability\n(MAP) criterion is usually not tractable. The new classes are derived using\nHolder's inequality and reverse Holder's inequality. The bounds in these\nclasses provide good prediction of the minimum probability of error in multiple\nhypothesis testing. The new classes generalize and extend existing bounds and\ntheir relation to some existing upper bounds is presented. It is shown that the\ntightest bounds in these classes asymptotically coincide with the optimum\nprobability of error provided by the MAP criterion for binary or multiple\nhypothesis testing problem. These bounds are compared with other existing lower\nbounds in several typical detection and classification problems in terms of\ntightness and computational complexity.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2010 11:08:50 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Routtenberg", "Tirza", ""], ["Tabrikian", "Joseph", ""]]}, {"id": "1005.2898", "submitter": "Zoran Hadzi-Velkov", "authors": "Zoran Hadzi-Velkov and Boris Spasenovski", "title": "Saturation Throughput - Delay Analysis of IEEE 802.11 DCF in Fading\n  Channel", "comments": "Proceedings of the IEEE International Conference on Communications\n  2003 (ICC 2003), 6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we analytically analyzed the impact of an error-prone channel\nover all performance measures in a trafficsaturated IEEE 802.11 WLAN. We\ncalculated station's transmission probability by using the modified Markov\nchain model of the backoff window size that considers the frame-error rates and\nmaximal allowable number of retransmission attempts. The frame error rate has a\nsignificant impact over theoretical throughput, mean frame delay, and discard\nprobability. The peak throughput of a WLAN is insensitive of the maximal number\nof retransmissions. Discard probabilities are insensitive to the station access\nmethod, Basic or RTS/CTS.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2010 12:08:14 GMT"}], "update_date": "2010-05-18", "authors_parsed": [["Hadzi-Velkov", "Zoran", ""], ["Spasenovski", "Boris", ""]]}, {"id": "1005.2949", "submitter": "Amina Chebira", "authors": "Amina Chebira, Matthew Fickus and Dustin G. Mixon", "title": "Filter Bank Fusion Frames", "comments": "keywords: filter banks, frames, tight, fusion, erasures, polyphase", "journal-ref": null, "doi": "10.1109/TSP.2010.2097255", "report-no": null, "categories": "cs.IT math.IT math.RT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we characterize and construct novel oversampled filter banks\nimplementing fusion frames. A fusion frame is a sequence of orthogonal\nprojection operators whose sum can be inverted in a numerically stable way.\nWhen properly designed, fusion frames can provide redundant encodings of\nsignals which are optimally robust against certain types of noise and erasures.\nHowever, up to this point, few implementable constructions of such frames were\nknown; we show how to construct them using oversampled filter banks. In this\nwork, we first provide polyphase domain characterizations of filter bank fusion\nframes. We then use these characterizations to construct filter bank fusion\nframe versions of discrete wavelet and Gabor transforms, emphasizing those\nspecific finite impulse response filters whose frequency responses are\nwell-behaved.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2010 15:17:59 GMT"}], "update_date": "2015-10-28", "authors_parsed": [["Chebira", "Amina", ""], ["Fickus", "Matthew", ""], ["Mixon", "Dustin G.", ""]]}, {"id": "1005.3093", "submitter": "Xu Zhiqiang", "authors": "Zhiqiang Xu", "title": "A remark about orthogonal matching pursuit algorithm", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note, we investigate the theoretical properties of Orthogonal\nMatching Pursuit (OMP), a class of decoder to recover sparse signal in\ncompressed sensing. In particular, we show that the OMP decoder can give\n$(p,q)$ instance optimality for a large class of encoders with $1\\leq p\\leq q\n\\leq 2$ and $(p,q)\\neq (2,2)$. We also show that, if the encoding matrix is\ndrawn from an appropriate distribution, then the OMP decoder is $(2,2)$\ninstance optimal in probability.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2010 02:58:31 GMT"}, {"version": "v2", "created": "Wed, 26 May 2010 02:11:10 GMT"}, {"version": "v3", "created": "Sun, 29 Aug 2010 07:57:19 GMT"}, {"version": "v4", "created": "Mon, 20 Sep 2010 03:12:56 GMT"}, {"version": "v5", "created": "Thu, 17 Feb 2011 14:24:37 GMT"}], "update_date": "2011-02-18", "authors_parsed": [["Xu", "Zhiqiang", ""]]}, {"id": "1005.3184", "submitter": "Guillermo Morales-Luna", "authors": "Viktor Yakovlev, Valery Korzhik, Guillermo Morales-Luna, Mihail Bakaev", "title": "Key Distribution Protocols Based on Extractors Under the Condition of\n  Noisy Channels in the Presence of an Active Adversary", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider in this paper the information-theoretic secure key distribution\nproblem over main and wire-tap noise channels with a public discussion in\npresence of an active adversary. In contrast to the solution proposed by\nourselves for a similar problem using hashing for privacy amplification, in the\ncurrent paper we use a technique of extractors.\n  We propose modified key distribution protocols for which we prove explicit\nestimates of key rates without the use of estimates with uncertain coefficients\nin notations $O,\\Omega,\\Theta$.\n  This leads in the new conclusion that the use of extractors is superior to\nthe use of hash functions only with the very large key lengths $\\ell$ (of order\n$\\ell>10^5$ bits).\n  We suggest hybrid key distribution protocols consisting from two\nconsecutively executed stages. At the fist stage it is generated a short\nauthentication key based on hash function, whereas at the second stage it is\ngenerated the final key with the use of extractors. We show that in fact the\nuse of extraction procedure is effective only at the second stage. We get also\nsome constructive estimates of the key rates for such protocols.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2010 13:04:28 GMT"}], "update_date": "2010-05-19", "authors_parsed": [["Yakovlev", "Viktor", ""], ["Korzhik", "Valery", ""], ["Morales-Luna", "Guillermo", ""], ["Bakaev", "Mihail", ""]]}, {"id": "1005.3238", "submitter": "Wing Kwan  Ng", "authors": "Derrick Wing Kwan Ng and Vincent Kin Nang Lau", "title": "Power Control and Performance Analysis of Outage-Limited Cellular\n  Network with MUD-SIC and Macro-Diversity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this paper, we analyze the uplink goodput (bits/sec/Hz successfully\ndecoded) and per-user packet outage in a cellular network using multi-user\ndetection with successive interference cancellation (MUD-SIC). We consider\nnon-ergodic fading channels where microscopic fading channel information is not\navailable at the transmitters. As a result, packet outage occurs whenever the\ndata rate of packet transmissions exceeds the instantaneous mutual information\neven if powerful channel coding is applied for protection. We are interested to\nstudy the role of macro-diversity (MDiv) between multiple base stations on the\nMUD-SIC performance where the effect of potential error-propagation during the\nSIC processing is taken into account. While the jointly optimal power and\ndecoding order in the MUD-SIC are NP hard problem, we derive a simple on/off\npower control and asymptotically optimal decoding order with respect to the\ntransmit power. Based on the information theoretical framework, we derive the\nclosed-form expressions on the total system goodput as well as the per-user\npacket outage probability. We show that the system goodput does not scale with\nSNR due to mutual interference in the SIC process and macro-diversity (MDiv)\ncould alleviate the problem and benefit to the system goodput.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2010 16:02:36 GMT"}, {"version": "v2", "created": "Wed, 19 May 2010 00:41:26 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Ng", "Derrick Wing Kwan", ""], ["Lau", "Vincent Kin Nang", ""]]}, {"id": "1005.3338", "submitter": "Changho Suh", "authors": "Changho Suh and David Tse", "title": "Feedback Capacity of the Gaussian Interference Channel to within 2 Bits", "comments": "Submitted to the IEEE Transactions on Information Theory (Special\n  Issue: Interference Networks)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We characterize the capacity region to within 2 bits/s/Hz and the symmetric\ncapacity to within 1 bit/s/Hz for the two-user Gaussian interference channel\n(IC) with feedback. We develop achievable schemes and derive a new outer bound\nto arrive at this conclusion. One consequence of the result is that feedback\nprovides multiplicative gain, i.e., the gain becomes arbitrarily large for\ncertain channel parameters. It is a surprising result because feedback has been\nso far known to provide no gain in memoryless point-to-point channels and only\nbounded additive gain in multiple access channels. The gain comes from using\nfeedback to maximize resource utilization, thereby enabling more efficient\nresource sharing between the interfering users. The result makes use of a\ndeterministic model to provide insights into the Gaussian channel. This\ndeterministic model is a special case of El Gamal-Costa deterministic model and\nas a side-generalization, we establish the exact feedback capacity region of\nthis general class of deterministic ICs.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2010 22:12:59 GMT"}], "update_date": "2010-05-20", "authors_parsed": [["Suh", "Changho", ""], ["Tse", "David", ""]]}, {"id": "1005.3350", "submitter": "Yipeng Liu Dr.", "authors": "Yipeng Liu, Jia Xu, Qun Wan, Yingning Peng", "title": "Minimum Variance Multi-Frequency Distortionless Restriction for Digital\n  Wideband Beamformer", "comments": "3 pages, 1 figures; accepted by RADAR2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a digital amplitude-phase weighting array based a minimum\nvariance multi-frequency distortionless restriction (MVMFDR) to aviod the\nfrequency band signal distortion in digital beamformer and too short time delay\nline (TDL) requirement in analoge wideband TDL array.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2010 02:07:50 GMT"}, {"version": "v2", "created": "Sat, 18 Jun 2011 09:01:23 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Liu", "Yipeng", ""], ["Xu", "Jia", ""], ["Wan", "Qun", ""], ["Peng", "Yingning", ""]]}, {"id": "1005.3486", "submitter": "Jens Zumbr\\\"agel", "authors": "Jens Zumbragel, Mark F. Flanagan, Vitaly Skachek", "title": "Exploration of AWGNC and BSC Pseudocodeword Redundancy", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The AWGNC, BSC, and max-fractional pseudocodeword redundancy of a code is\ndefined as the smallest number of rows in a parity-check matrix such that the\ncorresponding minimum pseudoweight is equal to the minimum Hamming distance of\nthe code. This paper provides new results on the AWGNC, BSC, and max-fractional\npseudocodeword redundancies of codes. The pseudocodeword redundancies for all\ncodes of small length (at most 9) are computed. Also, comprehensive results are\nprovided on the cases of cyclic codes of length at most 250 for which the\neigenvalue bound of Vontobel and Koetter is sharp.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2010 16:43:32 GMT"}], "update_date": "2010-05-20", "authors_parsed": [["Zumbragel", "Jens", ""], ["Flanagan", "Mark F.", ""], ["Skachek", "Vitaly", ""]]}, {"id": "1005.3561", "submitter": "Reza Khosravi-Farsani", "authors": "Reza K. Farsani", "title": "Two-Way Writing on Dirty Paper", "comments": "3 pages, 1 figure, submitted to IEEE Communications Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the Two-Way Channel (TWC) with Cannel State Information (CSI)\nis investigated. First, an achievable rate region is derived for the discrete\nmemoryless channel. Then by extending the result to the Gaussian TWC with\nadditive interference noise, it is shown that the capacity region of the later\nchannel is the same as the capacity when there is no interference, i.e. a\ntwo-way version of Costa's writing on dirty paper problem is established.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2010 21:13:35 GMT"}], "update_date": "2013-02-17", "authors_parsed": [["Farsani", "Reza K.", ""]]}, {"id": "1005.3620", "submitter": "Neri Merhav", "authors": "Neri Merhav", "title": "Threshold effects in parameter estimation as phase transitions in\n  statistical mechanics", "comments": "24 pages, 3 figures, submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cond-mat.dis-nn cond-mat.stat-mech math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Threshold effects in the estimation of parameters of non-linearly modulated,\ncontinuous-time, wide-band waveforms, are examined from a statistical physics\nperspective. These threshold effects are shown to be analogous to phase\ntransitions of certain disordered physical systems in thermal equilibrium. The\nmain message, in this work, is in demonstrating that this physical point of\nview may be insightful for understanding the interactions between two or more\nparameters to be estimated, from the aspects of the threshold effect.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2010 08:06:23 GMT"}], "update_date": "2010-05-21", "authors_parsed": [["Merhav", "Neri", ""]]}, {"id": "1005.3729", "submitter": "Weiyu Xu", "authors": "Weiyu Xu and Babak Hassibi", "title": "Compressive Sensing over the Grassmann Manifold: a Unified Geometric\n  Framework", "comments": "58 pages,7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  $\\ell_1$ minimization is often used for finding the sparse solutions of an\nunder-determined linear system. In this paper we focus on finding sharp\nperformance bounds on recovering approximately sparse signals using $\\ell_1$\nminimization, possibly under noisy measurements. While the restricted isometry\nproperty is powerful for the analysis of recovering approximately sparse\nsignals with noisy measurements, the known bounds on the achievable sparsity\n(The \"sparsity\" in this paper means the size of the set of nonzero or\nsignificant elements in a signal vector.) level can be quite loose. The\nneighborly polytope analysis which yields sharp bounds for ideally sparse\nsignals cannot be readily generalized to approximately sparse signals. Starting\nfrom a necessary and sufficient condition, the \"balancedness\" property of\nlinear subspaces, for achieving a certain signal recovery accuracy, we give a\nunified \\emph{null space Grassmann angle}-based geometric framework for\nanalyzing the performance of $\\ell_1$ minimization. By investigating the\n\"balancedness\" property, this unified framework characterizes sharp\nquantitative tradeoffs between the considered sparsity and the recovery\naccuracy of the $\\ell_{1}$ optimization. As a consequence, this generalizes the\nneighborly polytope result for ideally sparse signals. Besides the robustness\nin the \"strong\" sense for \\emph{all} sparse signals, we also discuss the\nnotions of \"weak\" and \"sectional\" robustness. Our results concern fundamental\nproperties of linear subspaces and so may be of independent mathematical\ninterest.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2010 15:07:40 GMT"}], "update_date": "2010-05-21", "authors_parsed": [["Xu", "Weiyu", ""], ["Hassibi", "Babak", ""]]}, {"id": "1005.3818", "submitter": "Mark Wilde", "authors": "Mark M. Wilde and Min-Hsiu Hsieh", "title": "Public and private resource trade-offs for a quantum channel", "comments": "26 pages, 5 figures; v2 has minor corrections; v3 has correction\n  regarding the optimization of the region. arXiv admin note: substantial text\n  overlap with arXiv:1004.0458", "journal-ref": "Quantum Information Processing, vol. 11, no. 6, pp. 1465-1501\n  (2012)", "doi": "10.1007/s11128-011-0317-z", "report-no": null, "categories": "quant-ph cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collins and Popescu realized a powerful analogy between several resources in\nclassical and quantum information theory. The Collins-Popescu analogy states\nthat public classical communication, private classical communication, and\nsecret key interact with one another somewhat similarly to the way that\nclassical communication, quantum communication, and entanglement interact. This\npaper discusses the information-theoretic treatment of this analogy for the\ncase of noisy quantum channels. We determine a capacity region for a quantum\nchannel interacting with the noiseless resources of public classical\ncommunication, private classical communication, and secret key. We then compare\nthis region with the classical-quantum-entanglement region from our prior\nefforts and explicitly observe the information-theoretic consequences of the\nstrong correlations in entanglement and the lack of a super-dense coding\nprotocol in the public-private-secret-key setting. The region simplifies for\nseveral realistic, physically-motivated channels such as entanglement-breaking\nchannels, Hadamard channels, and quantum erasure channels, and we are able to\ncompute and plot the region for several examples of these channels.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2010 20:05:22 GMT"}, {"version": "v2", "created": "Sat, 20 Aug 2011 15:22:14 GMT"}, {"version": "v3", "created": "Mon, 25 Jun 2012 13:59:16 GMT"}], "update_date": "2012-10-23", "authors_parsed": [["Wilde", "Mark M.", ""], ["Hsieh", "Min-Hsiu", ""]]}, {"id": "1005.3873", "submitter": "Yipeng Liu Dr.", "authors": "Ruiming Yang, Qun Wan, Yipeng Liu and Wanlin Yang", "title": "Improved OMP Approach to Sparse Multi-path Channel Estimation via\n  Adaptive Inter-atom Interference Mitigation", "comments": "5 pages, 4 figures, accepted by VTC2010-SPRING", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Since most components of sparse multi-path channel (SMPC) are zero, impulse\nresponse of SMPC can be recovered from a short training sequence. Though the\nordinary orthogonal matching pursuit (OMP) algorithm provides a very fast\nimplementation of SMPC estimation, it suffers from inter-atom interference\n(IAI), especially in the case of SMPC with a large delay spread and short\ntraining sequence. In this paper, an adaptive IAI mitigation method is proposed\nto improve the performance of SMPC estimation based on a general OMP algorithm.\nUnlike the ordinary OMP algorithm, a sensing dictionary is designed adaptively\nand posterior information is utilized efficiently to prevent false atoms from\nbeing selected due to serious IAI. Numeral experiments illustrate that the\nproposed general OMP algorithm based on adaptive IAI mitigation outperform both\nthe ordinary OMP algorithm and the general OMP algorithm based on non-adaptive\nIAI mitigation.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2010 01:59:46 GMT"}], "update_date": "2010-05-24", "authors_parsed": [["Yang", "Ruiming", ""], ["Wan", "Qun", ""], ["Liu", "Yipeng", ""], ["Yang", "Wanlin", ""]]}, {"id": "1005.3889", "submitter": "Shiro Ikeda Dr.", "authors": "Shiro Ikeda, Kazunori Hayashi, and Toshiyuki Tanaka", "title": "Capacity and Modulations with Peak Power Constraint", "comments": "9 pages with 12 figures. Preparing for submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A practical communication channel often suffers from constraints on input\nother than the average power, such as the peak power constraint. In order to\ncompare achievable rates with different constellations as well as the channel\ncapacity under such constraints, it is crucial to take these constraints into\nconsideration properly. In this paper, we propose a direct approach to compare\nthe achievable rates of practical input constellations and the capacity under\nsuch constraints. As an example, we study the discrete-time complex-valued\nadditive white Gaussian noise (AWGN) channel and compare the capacity under the\npeak power constraint with the achievable rates of phase shift keying (PSK) and\nquadrature amplitude modulation (QAM) input constellations.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2010 05:29:13 GMT"}, {"version": "v2", "created": "Mon, 16 May 2011 05:06:11 GMT"}], "update_date": "2011-05-17", "authors_parsed": [["Ikeda", "Shiro", ""], ["Hayashi", "Kazunori", ""], ["Tanaka", "Toshiyuki", ""]]}, {"id": "1005.3968", "submitter": "Gilson Oliveira Santos", "authors": "G. O. Santos, F. M. Assis and A. F. Lima", "title": "A Scheme of Concatenated Quantum Code to Protect against both\n  Computational Error and an Erasure", "comments": "21 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a description of encoding/decoding for a concatenated quantum code\nthat enables both protection against quantum computational errors and the\noccurrence of one quantum erasure. For this, it is presented how encoding and\ndecoding for quantum graph codes are done, which will provide the protection\nagainst the occurrence of computational errors (external code). As internal\ncode is used encoding and decoding via scheme of GHZ states for protection\nagainst the occurrence of one quantum erasure.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2010 14:07:08 GMT"}, {"version": "v2", "created": "Mon, 31 May 2010 20:37:11 GMT"}], "update_date": "2010-06-02", "authors_parsed": [["Santos", "G. O.", ""], ["Assis", "F. M.", ""], ["Lima", "A. F.", ""]]}, {"id": "1005.4178", "submitter": "Nihar Shah", "authors": "K. V. Rashmi, Nihar B. Shah and P. Vijay Kumar", "title": "Optimal Exact-Regenerating Codes for Distributed Storage at the MSR and\n  MBR Points via a Product-Matrix Construction", "comments": "Submitted to IEEE Transactions on Information Theory. Contains 20\n  pages, 2 figures", "journal-ref": "IEEE Transactions on Information Theory, vol. 57, no. 8, pp. 5227\n  - 5239, August 2011", "doi": "10.1109/TIT.2011.2159049", "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regenerating codes are a class of distributed storage codes that optimally\ntrade the bandwidth needed for repair of a failed node with the amount of data\nstored per node of the network. Minimum Storage Regenerating (MSR) codes\nminimize first, the amount of data stored per node, and then the repair\nbandwidth, while Minimum Bandwidth Regenerating (MBR) codes carry out the\nminimization in the reverse order. An [n, k, d] regenerating code permits the\ndata to be recovered by connecting to any k of the n nodes in the network,\nwhile requiring that repair of a failed node be made possible by connecting\n(using links of lesser capacity) to any d nodes. Previous, explicit and general\nconstructions of exact-regenerating codes have been confined to the case n=d+1.\nIn this paper, we present optimal, explicit constructions of MBR codes for all\nfeasible values of [n, k, d] and MSR codes for all [n, k, d >= 2k-2], using a\nproduct-matrix framework. The particular product-matrix nature of the\nconstructions is shown to significantly simplify system operation. To the best\nof our knowledge, these are the first constructions of exact-regenerating codes\nthat allow the number n of nodes in the distributed storage network, to be\nchosen independent of the other parameters. The paper also contains a simpler\ndescription, in the product-matrix framework, of a previously constructed MSR\ncode in which the parameter d satisfies [n=d+1, k, d >= 2k-1].\n", "versions": [{"version": "v1", "created": "Sun, 23 May 2010 08:16:03 GMT"}, {"version": "v2", "created": "Thu, 20 Jan 2011 06:06:28 GMT"}], "update_date": "2011-07-27", "authors_parsed": [["Rashmi", "K. V.", ""], ["Shah", "Nihar B.", ""], ["Kumar", "P. Vijay", ""]]}, {"id": "1005.4200", "submitter": "Yipeng Liu Dr.", "authors": "Yipeng Liu, Qun Wan, and Xiaoli Chu", "title": "A Robust Beamformer Based on Weighted Sparse Constraint", "comments": "4 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Applying a sparse constraint on the beam pattern has been suggested to\nsuppress the sidelobe level of a minimum variance distortionless response\n(MVDR) beamformer. In this letter, we introduce a weighted sparse constraint in\nthe beamformer design to provide a lower sidelobe level and deeper nulls for\ninterference avoidance, as compared with a conventional MVDR beamformer. The\nproposed beamformer also shows improved robustness against the mismatch between\nthe steering angle and the direction of arrival (DOA) of the desired signal,\ncaused by imperfect estimation of DOA.\n", "versions": [{"version": "v1", "created": "Sun, 23 May 2010 13:30:21 GMT"}], "update_date": "2010-05-25", "authors_parsed": [["Liu", "Yipeng", ""], ["Wan", "Qun", ""], ["Chu", "Xiaoli", ""]]}, {"id": "1005.4316", "submitter": "Hadi  Zayyani", "authors": "Hadi Zayyani, Massoud Babaie-Zadeh, Christian Jutten", "title": "Bayesian Cram\\'{e}r-Rao Bound for Noisy Non-Blind and Blind Compressed\n  Sensing", "comments": "This paper was submitted at 2 June 2009 to IEEE Signal Processing\n  Letters and was rejected at 21 August 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address the theoretical limitations in reconstructing\nsparse signals (in a known complete basis) using compressed sensing framework.\nWe also divide the CS to non-blind and blind cases. Then, we compute the\nBayesian Cramer-Rao bound for estimating the sparse coefficients while the\nmeasurement matrix elements are independent zero mean random variables.\nSimulation results show a large gap between the lower bound and the performance\nof the practical algorithms when the number of measurements are low.\n", "versions": [{"version": "v1", "created": "Mon, 24 May 2010 12:00:35 GMT"}], "update_date": "2010-05-25", "authors_parsed": [["Zayyani", "Hadi", ""], ["Babaie-Zadeh", "Massoud", ""], ["Jutten", "Christian", ""]]}, {"id": "1005.4461", "submitter": "Phong Nguyen", "authors": "Phong S. Nguyen, Henry D. Pfister, Krishna R. Narayanan", "title": "On Multiple Decoding Attempts for Reed-Solomon Codes: A Rate-Distortion\n  Approach", "comments": "to appear in the IEEE Transactions on Information Theory (Special\n  Issue on Facets of Coding Theory: from Algorithms to Networks)", "journal-ref": "IEEE Trans. on Information Theory, vol 57, issue 2 (2011), pages\n  668 - 691", "doi": "10.1109/TIT.2010.2095202", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One popular approach to soft-decision decoding of Reed-Solomon (RS) codes is\nbased on using multiple trials of a simple RS decoding algorithm in combination\nwith erasing or flipping a set of symbols or bits in each trial. This paper\npresents a framework based on rate-distortion (RD) theory to analyze these\nmultiple-decoding algorithms. By defining an appropriate distortion measure\nbetween an error pattern and an erasure pattern, the successful decoding\ncondition, for a single errors-and-erasures decoding trial, becomes equivalent\nto distortion being less than a fixed threshold. Finding the best set of\nerasure patterns also turns into a covering problem which can be solved\nasymptotically by rate-distortion theory. Thus, the proposed approach can be\nused to understand the asymptotic performance-versus-complexity trade-off of\nmultiple errors-and-erasures decoding of RS codes.\n  This initial result is also extended a few directions. The rate-distortion\nexponent (RDE) is computed to give more precise results for moderate\nblocklengths. Multiple trials of algebraic soft-decision (ASD) decoding are\nanalyzed using this framework. Analytical and numerical computations of the RD\nand RDE functions are also presented. Finally, simulation results show that\nsets of erasure patterns designed using the proposed methods outperform other\nalgorithms with the same number of decoding trials.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2010 00:17:36 GMT"}, {"version": "v2", "created": "Tue, 10 Aug 2010 18:35:09 GMT"}, {"version": "v3", "created": "Sat, 6 Nov 2010 15:46:55 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Nguyen", "Phong S.", ""], ["Pfister", "Henry D.", ""], ["Narayanan", "Krishna R.", ""]]}, {"id": "1005.4472", "submitter": "Yong Cheng", "authors": "Yong Cheng and Vincent K. N. Lau", "title": "Distributive Power Control Algorithm for Multicarrier Interference\n  Network over Time-Varying Fading Channels - Tracking Performance Analysis and\n  Optimization", "comments": "To Appear on the IEEE Transaction on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2010.2052044", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed power control over interference limited network has received an\nincreasing intensity of interest over the past few years. Distributed solutions\n(like the iterative water-filling, gradient projection, etc.) have been\nintensively investigated under \\emph{quasi-static} channels. However, as such\ndistributed solutions involve iterative updating and explicit message passing,\nit is unrealistic to assume that the wireless channel remains unchanged during\nthe iterations. Unfortunately, the behavior of those distributed solutions\nunder \\emph{time-varying} channels is in general unknown. In this paper, we\nshall investigate the distributed scaled gradient projection algorithm (DSGPA)\nin a $K$ pairs multicarrier interference network under a finite-state Markov\nchannel (FSMC) model. We shall analyze the \\emph{convergence property} as well\nas \\emph{tracking performance} of the proposed DSGPA. Our analysis shows that\nthe proposed DSGPA converges to a limit region rather than a single point under\nthe FSMC model. We also show that the order of growth of the tracking errors is\ngiven by $\\mathcal{O}\\(1 \\big/ \\bar{N}\\)$, where $\\bar{N}$ is the \\emph{average\nsojourn time} of the FSMC. Based on the analysis, we shall derive the\n\\emph{tracking error optimal scaling matrices} via Markov decision process\nmodeling. We shall show that the tracking error optimal scaling matrices can be\nimplemented distributively at each transmitter. The numerical results show the\nsuperior performance of the proposed DSGPA over three baseline schemes, such as\nthe gradient projection algorithm with a constant stepsize.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2010 02:59:58 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Cheng", "Yong", ""], ["Lau", "Vincent K. N.", ""]]}, {"id": "1005.4769", "submitter": "Pegah Sattari", "authors": "Pegah Sattari and Athina Markopoulou and Christina Fragouli and Minas\n  Gjoka", "title": "A Network Coding Approach to Loss Tomography", "comments": null, "journal-ref": null, "doi": "10.1109/TIT.2012.2236916", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network tomography aims at inferring internal network characteristics based\non measurements at the edge of the network. In loss tomography, in particular,\nthe characteristic of interest is the loss rate of individual links and\nmulticast and/or unicast end-to-end probes are typically used. Independently,\nrecent advances in network coding have shown that there are advantages from\nallowing intermediate nodes to process and combine, in addition to just\nforward, packets. In this paper, we study the problem of loss tomography in\nnetworks with network coding capabilities. We design a framework for estimating\nlink loss rates, which leverages network coding capabilities, and we show that\nit improves several aspects of tomography including the identifiability of\nlinks, the trade-off between estimation accuracy and bandwidth efficiency, and\nthe complexity of probe path selection. We discuss the cases of inferring link\nloss rates in a tree topology and in a general topology. In the latter case,\nthe benefits of our approach are even more pronounced compared to standard\ntechniques, but we also face novel challenges, such as dealing with cycles and\nmultiple paths between sources and receivers. Overall, this work makes the\nconnection between active network tomography and network coding.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2010 09:35:33 GMT"}, {"version": "v2", "created": "Mon, 24 Oct 2011 20:17:34 GMT"}, {"version": "v3", "created": "Mon, 20 Aug 2012 02:05:41 GMT"}, {"version": "v4", "created": "Thu, 15 Nov 2012 08:10:05 GMT"}, {"version": "v5", "created": "Sat, 9 Feb 2013 06:11:12 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Sattari", "Pegah", ""], ["Markopoulou", "Athina", ""], ["Fragouli", "Christina", ""], ["Gjoka", "Minas", ""]]}, {"id": "1005.4834", "submitter": "Enrico Paolini", "authors": "Enrico Paolini, Mark F. Flanagan, Marco Chiani, Marc P.C. Fossorier", "title": "Spectral Shape of Check-Hybrid GLDPC Codes", "comments": "6 pages, 3 figures. Presented at the IEEE ICC 2010, Cape Town, South\n  Africa. A minor typo in equation (9) has been corrected", "journal-ref": null, "doi": "10.1109/ICC.2010.5502377", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes the asymptotic exponent of both the weight spectrum and\nthe stopping set size spectrum for a class of generalized low-density\nparity-check (GLDPC) codes. Specifically, all variable nodes (VNs) are assumed\nto have the same degree (regular VN set), while the check node (CN) set is\nassumed to be composed of a mixture of different linear block codes (hybrid CN\nset). A simple expression for the exponent (which is also referred to as the\ngrowth rate or the spectral shape) is developed. This expression is consistent\nwith previous results, including the case where the normalized weight or\nstopping set size tends to zero. Furthermore, it is shown how certain symmetry\nproperties of the local weight distribution at the CNs induce a symmetry in the\noverall weight spectral shape function.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2010 14:53:59 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Paolini", "Enrico", ""], ["Flanagan", "Mark F.", ""], ["Chiani", "Marco", ""], ["Fossorier", "Marc P. C.", ""]]}, {"id": "1005.4853", "submitter": "Yuval Kochman", "authors": "Yuval Kochman and Ram Zamir", "title": "Analog Matching of Colored Sources to Colored Channels", "comments": "Submitted to IEEE Trans. Info. theory, July 2008. Revised May 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analog (uncoded) transmission provides a simple and robust scheme for\ncommunicating a Gaussian source over a Gaussian channel under the mean squared\nerror (MSE) distortion measure. Unfortunately, its performance is usually\ninferior to the all-digital, separation-based source-channel coding solution,\nwhich requires exact knowledge of the channel at the encoder. The loss comes\nfrom the fact that except for very special cases, e.g. white source and channel\nof matching bandwidth (BW), it is impossible to achieve perfect matching of\nsource to channel and channel to source by linear means. We show that by\ncombining prediction and modulo-lattice operations, it is possible to match any\ncolored Gaussian source to any colored Gaussian noise channel (of possibly\ndifferent BW), hence achieve Shannon's optimum attainable performance $R(D)=C$.\nFurthermore, when the source and channel BWs are equal (but otherwise their\nspectra are arbitrary), this scheme is asymptotically robust in the sense that\nfor high signal-to-noise ratio a single encoder (independent of the noise\nvariance) achieves the optimum performance. The derivation is based upon a\nrecent modulo-lattice modulation scheme for transmitting a Wyner-Ziv source\nover a dirty-paper channel.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2010 15:49:57 GMT"}, {"version": "v2", "created": "Wed, 2 Jun 2010 15:52:12 GMT"}], "update_date": "2010-06-03", "authors_parsed": [["Kochman", "Yuval", ""], ["Zamir", "Ram", ""]]}, {"id": "1005.4895", "submitter": "Manar Mohaisen", "authors": "Sebastien Aubert, Manar Mohaisen, Fabienne Nouvel, KyungHi Chang", "title": "Parallel QR decomposition in LTE-A systems", "comments": "The eleventh IEEE International Workshop on Signal Processing\n  Advances for Wireless Communications, 5 pages, 4 figures, 4 algorithms, 1\n  table", "journal-ref": null, "doi": "10.1109/SPAWC.2010.5671007", "report-no": null, "categories": "cs.OH cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The QR Decomposition (QRD) of communication channel matrices is a fundamental\nprerequisite to several detection schemes in Multiple-Input Multiple-Output\n(MIMO) communication systems. Herein, the main feature of the QRD is to\ntransform the non-causal system into a causal system, where consequently\nefficient detection algorithms based on the Successive Interference\nCancellation (SIC) or Sphere Decoder (SD) become possible. Also, QRD can be\nused as a light but efficient antenna selection scheme. In this paper, we\naddress the study of the QRD methods and compare their efficiency in terms of\ncomputational complexity and error rate performance. Moreover, a particular\nattention is paid to the parallelism of the QRD algorithms since it reduces the\nlatency of the matrix factorization.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2010 17:54:42 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Aubert", "Sebastien", ""], ["Mohaisen", "Manar", ""], ["Nouvel", "Fabienne", ""], ["Chang", "KyungHi", ""]]}, {"id": "1005.4951", "submitter": "Sanjay Karmakar", "authors": "Sanjay Karmakar and Mahesh K. Varanasi", "title": "The diversity-multiplexing tradeoff of the symmetric MIMO half-duplex\n  relay channel", "comments": "This paper has been withdrawn.", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn due to an error in one of the equations in the\nextended portion.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2010 21:18:13 GMT"}, {"version": "v2", "created": "Sun, 6 Jun 2010 23:23:13 GMT"}, {"version": "v3", "created": "Tue, 8 Jun 2010 19:09:44 GMT"}], "update_date": "2010-06-09", "authors_parsed": [["Karmakar", "Sanjay", ""], ["Varanasi", "Mahesh K.", ""]]}, {"id": "1005.4985", "submitter": "Shengqian Han", "authors": "Shengqian Han, Chenyang Yang, and Mats Bengtsson", "title": "User Scheduling for Cooperative Base Station Transmission Exploiting\n  Channel Asymmetry", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study low-signalling overhead scheduling for downlink coordinated\nmulti-point (CoMP) transmission with multi-antenna base stations (BSs) and\nsingle-antenna users. By exploiting the asymmetric channel feature, i.e., the\npathloss differences towards different BSs, we derive a metric to judge\northogonality among users only using their average channel gains, based on\nwhich we propose a semi-orthogonal scheduler that can be applied in a two-stage\ntransmission strategy. Simulation results demonstrate that the proposed\nscheduler performs close to the semi-orthogonal scheduler with full channel\ninformation, especially when each BS is with more antennas and the celledge\nregion is large. Compared with other overhead reduction strategies, the\nproposed scheduler requires much less training overhead to achieve the same\ncell-average data rate.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2010 05:20:12 GMT"}, {"version": "v2", "created": "Tue, 26 May 2015 16:50:55 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Han", "Shengqian", ""], ["Yang", "Chenyang", ""], ["Bengtsson", "Mats", ""]]}, {"id": "1005.5054", "submitter": "Manar Mohaisen", "authors": "HongSun An, Manar Mohaisen, DongKeol Han, KyungHi Chang", "title": "Coordinated transmit and receive processing with adaptive multi-stream\n  selection", "comments": "International Conference on Communications, Networking, and Mobile\n  Computing (WiCOM'10): 5 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an adaptive coordinated Tx-Rx beamforming scheme\nfor inter-user interference cancellation, when a base station (BS) communicates\nwith multiple users that each has multiple receive antennas. The conventional\ncoordinated Tx-Rx beamforming scheme transmits a fixed number of data streams\nfor each user regardless of the instantaneous channel states, that is, all the\nusers, no matter they are with ill-conditioned or well-conditioned channels,\nhave the same number of data streams. However, in the proposed adaptive\ncoordinated Tx-Rx beamforming scheme, we adaptively select the number of\nstreams per user to solve the inefficient problem of the conventional\ncoordinated Tx-Rx beamforming scheme. As a result, the BER performance is\nimproved. Simulation results show that the proposed algorithm outperforms the\nconventional co-ordinated Tx-Rx beamforming algorithm by 2.5dB at a target BER\nof 10^-2\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2010 12:58:36 GMT"}], "update_date": "2010-05-28", "authors_parsed": [["An", "HongSun", ""], ["Mohaisen", "Manar", ""], ["Han", "DongKeol", ""], ["Chang", "KyungHi", ""]]}, {"id": "1005.5063", "submitter": "Yara Abdallah", "authors": "Yara Abdallah, Mohamed Abdel Latif, Moustafa Youssef, Ahmed Sultan,\n  Hesham El Gamal", "title": "Keys through ARQ: Theory and Practice", "comments": "15 pages, submitted to IEEE Transactions on Information Forensics and\n  Security", "journal-ref": "IEEE Transactions on Information Forensics and Security, Sep. 2011", "doi": "10.1109/TIFS.2011.2123093", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a novel framework for sharing secret keys using the\nAutomatic Repeat reQuest (ARQ) protocol. We first characterize the underlying\ninformation theoretic limits, under different assumptions on the channel\nspatial and temporal correlation function. Our analysis reveals a novel role of\n\"dumb antennas\" in overcoming the negative impact of spatial correlation on the\nachievable secrecy rates. We further develop an adaptive rate allocation\npolicy, which achieves higher secrecy rates in temporally correlated channels,\nand explicit constructions for ARQ secrecy coding that enjoy low implementation\ncomplexity. Building on this theoretical foundation, we propose a unified\nframework for ARQ-based secrecy in Wi-Fi networks. By exploiting the existing\nARQ mechanism in the IEEE 802.11 standard, we develop security overlays that\noffer strong security guarantees at the expense of only minor modifications in\nthe medium access layer. Our numerical results establish the achievability of\nnon-zero secrecy rates even when the eavesdropper channel is less noisy, on the\naverage, than the legitimate channel, while our linux-based prototype\ndemonstrates the efficiency of our ARQ overlays in mitigating all known,\npassive and active, Wi-Fi attacks at the expense of a minimal increase in the\nlink setup time and a small loss in throughput.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2010 13:18:44 GMT"}, {"version": "v2", "created": "Fri, 28 May 2010 14:11:39 GMT"}], "update_date": "2013-04-09", "authors_parsed": [["Abdallah", "Yara", ""], ["Latif", "Mohamed Abdel", ""], ["Youssef", "Moustafa", ""], ["Sultan", "Ahmed", ""], ["Gamal", "Hesham El", ""]]}, {"id": "1005.5065", "submitter": "Manar Mohaisen", "authors": "Manar Mohaisen, KyungHi Chang", "title": "Upper-lower bounded-complexity QRD-M for spatial multiplexing MIMO-OFDM\n  systems", "comments": "Springer, Wireless Personal Communications Journal (WPC'2010), 13\n  pages, 6 figures, 2 tables, 1 algorithm", "journal-ref": null, "doi": "10.1007/s11277-010-0014-8", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple-input multiple-output (MIMO) technology applied with orthogonal\nfrequency division multiplexing (OFDM) is considered as the ultimate solution\nto increase channel capacity without any additional spectral resources. At the\nreceiver side, the challenge resides in designing low complexity detection\nalgorithms capable of separating independent streams sent simultaneously from\ndifferent antennas. In this paper, we introduce an upper-lower\nbounded-complexity QRD-M algorithm (ULBC QRD-M). In the proposed algorithm we\nsolve the problem of high extreme complexity of the conventional sphere\ndecoding by fixing the upper bound complexity to that of the conventional\nQRD-M. On the other hand, ULBC QRD-M intelligently cancels all unnecessary\nhypotheses to achieve very low computational requirements. Analyses and\nsimulation results show that the proposed algorithm achieves the performance of\nconventional QRD-M with only 26% of the required computations.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2010 13:26:03 GMT"}], "update_date": "2010-05-28", "authors_parsed": [["Mohaisen", "Manar", ""], ["Chang", "KyungHi", ""]]}, {"id": "1005.5348", "submitter": "Ming Lei Dr.", "authors": "Ming Lei, Pierre Del Moral, Christophe Baehr", "title": "Error Analysis of Approximated PCRLBs for Nonlinear Dynamics", "comments": "5 pages, 4 figures;", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.IT math.IT math.NA", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In practical nonlinear filtering, the assessment of achievable filtering\nperformance is important. In this paper, we focus on the problem of efficiently\napproximate the posterior Cramer-Rao lower bound (CRLB) in a recursive manner.\nBy using Gaussian assumptions, two types of approximations for calculating the\nCRLB are proposed: An exact model using the state estimate as well as a\nTaylor-series-expanded model using both of the state estimate and its error\ncovariance, are derived. Moreover, the difference between the two approximated\nCRLBs is also formulated analytically. By employing the particle filter (PF)\nand the unscented Kalman filter (UKF) to compute, simulation results reveal\nthat the approximated CRLB using mean-covariance-based model outperforms that\nusing the mean-based exact model. It is also shown that the theoretical\ndifference between the estimated CRLBs can be improved through an improved\nfiltering method.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2010 18:03:03 GMT"}], "update_date": "2010-05-31", "authors_parsed": [["Lei", "Ming", ""], ["Del Moral", "Pierre", ""], ["Baehr", "Christophe", ""]]}, {"id": "1005.5361", "submitter": "Ashley Smith", "authors": "Akash Kumar Gupta and Sanjeet Kumar", "title": "VHDL Implementation of different Turbo Encoder using Log-MAP Decoder", "comments": null, "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p49-53, April\n  2010", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Turbo code is a great achievement in the field of communication system. It\ncan be created by connecting a turbo encoder and a decoder serially. A Turbo\nencoder is build with parallel concatenation of two simple convolutional codes.\nBy varying the number of memory element (encoder configuration), code rate (1/2\nor 1/3), block size of data and iteration, we can achieve better BER\nperformance. Turbo code also consists of interleaver unit and its BER\nperformance also depends on interleaver size. Turbo Decoder can be implemented\nusing different algorithm, but Log -MAP decoding algorithm is less\ncomputationaly complex with respect to MAP (maximux a posteriori) algorithm,\nwithout compromising its BER performance, nearer to Shannon limit. A register\ntransfer level (RTL) turbo encoder is designed and simulated using VHDL (Very\nhigh speed integrated circuit Hardware Description Language). In this paper\nVHDL model of different turbo encoder are implemented using Log MAP decoder and\nits performance are compared and verified with corresponding MATLAB simulated\nresults.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 18:54:06 GMT"}], "update_date": "2010-05-31", "authors_parsed": [["Gupta", "Akash Kumar", ""], ["Kumar", "Sanjeet", ""]]}, {"id": "1005.5412", "submitter": "Jiangyuan Li", "authors": "Jiangyuan Li, Athina P. Petropulu, and H. Vincent Poor", "title": "On Cooperative Beamforming Based on Second-Order Statistics of Channel\n  State Information", "comments": "30 pages, 9 figures", "journal-ref": null, "doi": "10.1109/TSP.2010.2094614", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative beamforming in relay networks is considered, in which a source\ntransmits to its destination with the help of a set of cooperating nodes. The\nsource first transmits locally. The cooperating nodes that receive the source\nsignal retransmit a weighted version of it in an amplify-and-forward (AF)\nfashion. Assuming knowledge of the second-order statistics of the channel state\ninformation, beamforming weights are determined so that the signal-to-noise\nratio (SNR) at the destination is maximized subject to two different power\nconstraints, i.e., a total (source and relay) power constraint, and individual\nrelay power constraints. For the former constraint, the original problem is\ntransformed into a problem of one variable, which can be solved via Newton's\nmethod. For the latter constraint, the original problem is transformed into a\nhomogeneous quadratically constrained quadratic programming (QCQP) problem. In\nthis case, it is shown that when the number of relays does not exceed three the\nglobal solution can always be constructed via semidefinite programming (SDP)\nrelaxation and the matrix rank-one decomposition technique. For the cases in\nwhich the SDP relaxation does not generate a rank one solution, two methods are\nproposed to solve the problem: the first one is based on the coordinate descent\nmethod, and the second one transforms the QCQP problem into an infinity norm\nmaximization problem in which a smooth finite norm approximation can lead to\nthe solution using the augmented Lagrangian method.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2010 22:37:05 GMT"}], "update_date": "2015-10-28", "authors_parsed": [["Li", "Jiangyuan", ""], ["Petropulu", "Athina P.", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1005.5574", "submitter": "Chengwen  Xing", "authors": "Chengwen Xing, Shaodan Ma, Yik-Chung Wu and Tung-Sang Ng", "title": "Robust Beamforming for Amplify-and-Forward MIMO Relay Systems Based on\n  Quadratic Matrix Programming", "comments": "Proceedings of IEEE International Conference on Acoustics, Speech,\n  and Signal Processing (ICASSP'2010), U.S.A", "journal-ref": null, "doi": "10.1109/ICASSP.2010.5496038", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, robust transceiver design based on minimum-mean-square-error\n(MMSE) criterion for dual-hop amplify-and-forward MIMO relay systems is\ninvestigated. The channel estimation errors are modeled as Gaussian random\nvariables, and then the effect are incorporated into the robust transceiver\nbased on the Bayesian framework. An iterative algorithm is proposed to jointly\ndesign the precoder at the source, the forward matrix at the relay and the\nequalizer at the destination, and the joint design problem can be efficiently\nsolved by quadratic matrix programming (QMP).\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 03:17:01 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Xing", "Chengwen", ""], ["Ma", "Shaodan", ""], ["Wu", "Yik-Chung", ""], ["Ng", "Tung-Sang", ""]]}, {"id": "1005.5577", "submitter": "Chengwen  Xing", "authors": "Chengwen Xing, Shaodan Ma, Yik-Chung Wu and Tung-Sang Ng", "title": "Transceiver Design for Dual-Hop Non-regenerative MIMO-OFDM Relay Systems\n  Under Channel Uncertainties", "comments": "30 pages, 6 figures, IEEE Transactions on Signal Processing, The\n  Final Version", "journal-ref": null, "doi": "10.1109/TSP.2010.2070797", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, linear transceiver design for dual-hop non-regenerative\n(amplify-and-forward (AF)) MIMO-OFDM systems under channel estimation errors is\ninvestigated. Second order moments of channel estimation errors in the two hops\nare first deduced. Then based on the Bayesian framework, joint design of linear\nforwarding matrix at the relay and equalizer at the destination under channel\nestimation errors is proposed to minimize the total mean-square-error (MSE) of\nthe output signal at the destination. The optimal designs for both correlated\nand uncorrelated channel estimation errors are considered. The relationship\nwith existing algorithms is also disclosed. Moreover, this design is extended\nto the joint design involving source precoder design. Simulation results show\nthat the proposed design outperforms the design based on estimated channel\nstate information only.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 03:45:46 GMT"}, {"version": "v2", "created": "Tue, 18 Sep 2012 03:43:54 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Xing", "Chengwen", ""], ["Ma", "Shaodan", ""], ["Wu", "Yik-Chung", ""], ["Ng", "Tung-Sang", ""]]}, {"id": "1005.5591", "submitter": "Min-Zheng Shieh", "authors": "Min-Zheng Shieh and Shi-Chun Tsai", "title": "On the minimum weight problem of permutation codes under Chebyshev\n  distance", "comments": "5 pages. ISIT 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Permutation codes of length $n$ and distance $d$ is a set of permutations on\n$n$ symbols, where the distance between any two elements in the set is at least\n$d$. Subgroup permutation codes are permutation codes with the property that\nthe elements are closed under the operation of composition. In this paper,\nunder the distance metric $\\ell_{\\infty}$-norm, we prove that finding the\nminimum weight codeword for subgroup permutation code is NP-complete. Moreover,\nwe show that it is NP-hard to approximate the minimum weight within the factor\n$7/6-\\epsilon$ for any $\\epsilon>0$.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 06:09:49 GMT"}], "update_date": "2010-06-01", "authors_parsed": [["Shieh", "Min-Zheng", ""], ["Tsai", "Shi-Chun", ""]]}, {"id": "1005.5603", "submitter": "Daniil Ryabko", "authors": "Daniil Ryabko (INRIA Lille)", "title": "On the Relation between Realizable and Nonrealizable Cases of the\n  Sequence Prediction Problem", "comments": "Earlier conference version appeared as: \"Sequence prediction in\n  realizable and non-realizable cases,\" Conference on Learning Theory (2010)\n  119-131", "journal-ref": "Journal of Machine Learning Research, vol. 12: 2161-2180, 2011", "doi": null, "report-no": null, "categories": "cs.LG cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A sequence $x_1,\\dots,x_n,\\dots$ of discrete-valued observations is generated\naccording to some unknown probabilistic law (measure) $\\mu$. After observing\neach outcome, one is required to give conditional probabilities of the next\nobservation. The realizable case is when the measure $\\mu$ belongs to an\narbitrary but known class $\\mathcal C$ of process measures. The non-realizable\ncase is when $\\mu$ is completely arbitrary, but the prediction performance is\nmeasured with respect to a given set $\\mathcal C$ of process measures. We are\ninterested in the relations between these problems and between their solutions,\nas well as in characterizing the cases when a solution exists and finding these\nsolutions. We show that if the quality of prediction is measured using the\ntotal variation distance, then these problems coincide, while if it is measured\nusing the expected average KL divergence, then they are different. For some of\nthe formalizations we also show that when a solution exists, it can be obtained\nas a Bayes mixture over a countable subset of $\\mathcal C$. We also obtain\nseveral characterization of those sets $\\mathcal C$ for which solutions to the\nconsidered problems exist. As an illustration to the general results obtained,\nwe show that a solution to the non-realizable case of the sequence prediction\nproblem exists for the set of all finite-memory processes, but does not exist\nfor the set of all stationary processes.\n  It should be emphasized that the framework is completely general: the\nprocesses measures considered are not required to be i.i.d., mixing,\nstationary, or to belong to any parametric family.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 06:58:11 GMT"}, {"version": "v2", "created": "Mon, 20 Jun 2011 12:04:30 GMT"}, {"version": "v3", "created": "Sat, 27 Dec 2014 00:16:49 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Ryabko", "Daniil", "", "INRIA Lille"]]}, {"id": "1005.5697", "submitter": "Alexander Jung", "authors": "Alexander Jung, Zvika Ben-Haim, Franz Hlawatsch and Yonina C. Eldar", "title": "Unbiased Estimation of a Sparse Vector in White Gaussian Noise", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider unbiased estimation of a sparse nonrandom vector corrupted by\nadditive white Gaussian noise. We show that while there are infinitely many\nunbiased estimators for this problem, none of them has uniformly minimum\nvariance. Therefore, we focus on locally minimum variance unbiased (LMVU)\nestimators. We derive simple closed-form lower and upper bounds on the variance\nof LMVU estimators or, equivalently, on the Barankin bound (BB). Our bounds\nallow an estimation of the threshold region separating the low-SNR and high-SNR\nregimes, and they indicate the asymptotic behavior of the BB at high SNR. We\nalso develop numerical lower and upper bounds which are tighter than the\nclosed-form bounds and thus characterize the BB more accurately. Numerical\nstudies compare our characterization of the BB with established biased\nestimation schemes, and demonstrate that while unbiased estimators perform\npoorly at low SNR, they may perform better than biased estimators at high SNR.\nAn interesting conclusion of our analysis is that the high-SNR behavior of the\nBB depends solely on the value of the smallest nonzero component of the sparse\nvector, and that this type of dependence is also exhibited by the performance\nof certain practical estimators.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 15:32:40 GMT"}], "update_date": "2010-06-02", "authors_parsed": [["Jung", "Alexander", ""], ["Ben-Haim", "Zvika", ""], ["Hlawatsch", "Franz", ""], ["Eldar", "Yonina C.", ""]]}, {"id": "1005.5734", "submitter": "Alexander Vardy", "authors": "Ralf Koetter, Jun Ma, and Alexander Vardy", "title": "The Re-Encoding Transformation in Algebraic List-Decoding of\n  Reed-Solomon Codes", "comments": "15 pages, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main computational steps in algebraic soft-decoding, as well as\nSudan-type list-decoding, of Reed-Solomon codes are bivariate polynomial\ninterpolation and factorization. We introduce a computational technique, based\nupon re-encoding and coordinate transformation, that significantly reduces the\ncomplexity of the bivariate interpolation procedure. This re-encoding and\ncoordinate transformation converts the original interpolation problem into\nanother reduced interpolation problem, which is orders of magnitude smaller\nthan the original one. A rigorous proof is presented to show that the two\ninterpolation problems are indeed equivalent. An efficient factorization\nprocedure that applies directly to the reduced interpolation problem is also\ngiven.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 19:54:28 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Koetter", "Ralf", ""], ["Ma", "Jun", ""], ["Vardy", "Alexander", ""]]}]