[{"id": "1201.0119", "submitter": "Feng Xia", "authors": "Chi Lin, Guowei Wu, Feng Xia, Mingchu Li, Lin Yao, Zhongyi Pei", "title": "Energy Efficient Ant Colony Algorithms for Data Aggregation in Wireless\n  Sensor Networks", "comments": "To appear in Journal of Computer and System Sciences", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a family of ant colony algorithms called DAACA for data\naggregation has been presented which contains three phases: the initialization,\npacket transmission and operations on pheromones. After initialization, each\nnode estimates the remaining energy and the amount of pheromones to compute the\nprobabilities used for dynamically selecting the next hop. After certain rounds\nof transmissions, the pheromones adjustment is performed periodically, which\ncombines the advantages of both global and local pheromones adjustment for\nevaporating or depositing pheromones. Four different pheromones adjustment\nstrategies are designed to achieve the global optimal network lifetime, namely\nBasic-DAACA, ES-DAACA, MM-DAACA and ACS-DAACA. Compared with some other data\naggregation algorithms, DAACA shows higher superiority on average degree of\nnodes, energy efficiency, prolonging the network lifetime, computation\ncomplexity and success ratio of one hop transmission. At last we analyze the\ncharacteristic of DAACA in the aspects of robustness, fault tolerance and\nscalability.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 12:51:14 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Lin", "Chi", ""], ["Wu", "Guowei", ""], ["Xia", "Feng", ""], ["Li", "Mingchu", ""], ["Yao", "Lin", ""], ["Pei", "Zhongyi", ""]]}, {"id": "1201.0120", "submitter": "Feng Xia", "authors": "Zhikui Chen, Feng Xia, Tao Huang, Fanyu Bu, Haozhe Wang", "title": "A Localization Method for the Internet of Things", "comments": "To appear in Journal of Supercomputing. arXiv admin note: substantial\n  text overlap with arXiv:1011.3097", "journal-ref": null, "doi": "10.1007/s11227-011-0693-2", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many localization algorithms and systems have been developed by means of\nwireless sensor networks for both indoor and outdoor environments. To achieve\nhigher localization accuracy, extra hardware equipments are utilized by most of\nthe existing localization solutions, which increase the cost and considerably\nlimit the location-based applications. The Internet of Things (IOT) integrates\nmany technologies, such as Internet, Zigbee, Bluetooth, infrared, WiFi, GPRS,\n3G, etc, which can enable different ways to obtain the location information of\nvarious objects. Location-based service is a primary service of the IOT, while\nlocalization accuracy is a key issue. In this paper, a higher accuracy\nlocalization scheme is proposed which can effectively satisfy diverse\nrequirements for many indoor and outdoor location services. The proposed scheme\ncomposes of two phases: 1) partition phase, in which the target region is split\ninto small grids; 2) localization refinement phase, in which a higher accuracy\nof localization can be obtained by applying an algorithm designed in the paper.\nA trial system is set up to verify correctness of the proposed scheme and\nfurthermore to illustrate its feasibility and availability. The experimental\nresults show that the proposed scheme can improve the localization accuracy.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 12:57:43 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Chen", "Zhikui", ""], ["Xia", "Feng", ""], ["Huang", "Tao", ""], ["Bu", "Fanyu", ""], ["Wang", "Haozhe", ""]]}, {"id": "1201.0140", "submitter": "Vijendra Singh Bhadauria Mr.", "authors": "Vijendra Singh Bhadauria, Sanjeev Sharma and Ravindra Patel", "title": "A Comparative Study of Location Management Schemes: Challenges and\n  Guidelines", "comments": "7 pages, 3 figures", "journal-ref": "International Journal on Computer Science and Engineering (IJCSE),\n  ISSN : 0975-3397, Vol. 3 No. 7 July 2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the key issues in mobile communication is to find the current location\nof mobile terminal (MT) to deliver the services, which is called as location\nmanagement (LM). Increasing users and diverse services demand for a\nhigh-quality skeleton for LM. As an MT moves within a cellular network, it\nregisters its new location to the nearest base station (BS). When a call\narrives for an MT, the network searches the target MT in the area where it was\nlast registered. This paper presents comprehensive classification of existing\nmajor LM schemes, their comparative study and factors influencing their\nperformance. Finally, guidelines for developing and rating a LM scheme are\nsuggested with the help of LPCIC rule, which is the main contribution of this\npaper.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 15:40:39 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Bhadauria", "Vijendra Singh", ""], ["Sharma", "Sanjeev", ""], ["Patel", "Ravindra", ""]]}, {"id": "1201.0178", "submitter": "Salah A. Aly", "authors": "Salah A. Aly", "title": "Distributed Data Collection and Storage Algorithms for Collaborative\n  Learning Vision Sensor Devices with Applications to Pilgrimage", "comments": "arXiv admin note: substantial text overlap with arXiv:0908.4419", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents novel distributed data collection systems and storage\nalgorithms for collaborative learning wireless sensor networks (WSNs). In a\nlarge WSN, consider $n$ collaborative sensor devices distributed randomly to\nacquire information and learn about a certain field. Such sensors have less\npower, small bandwidth, and short memory, and they might disappear from the\nnetwork after certain time of operations. The goal of this work is to design\nefficient strategies to learn about the field by collecting sensed data from\nthese $n$ sensors with less computational overhead and efficient storage\nencoding operations.\n  In this data collection system, we propose two distributed data storage\nalgorithms (DSA's) to solve this problem with the means of network flooding and\nconnectivity among sensor devices. In the first algorithm denoted, DSA-I, it's\nassumed that the total number of nodes is known for each node in the network.\nWe show that this algorithm is efficient in terms of the encoding/decoding\noperations. Furthermore, every node uses network flooding to disseminate its\ndata throughout the network using mixing time approximately O(n). In the second\nalgorithm denoted, DSA-II, it's assumed that the total number of nodes is not\nknown for each learning sensor, hence dissemination of the data does not depend\non the value of $n$. In this case we show that the encoding operations take\n$O(C\\mu^2)$, where $\\mu$ is the mean degree of the network graph and $C$ is a\nsystem parameter. Performance of these two algorithms match the derived\ntheoretical results. Finally, we show how to deploy these algorithms for\nmonitoring and measuring certain phenomenons in American-made camp tents\nlocated in Minna field in south-east side of Makkah.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 20:14:48 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Aly", "Salah A.", ""]]}, {"id": "1201.0205", "submitter": "Feng Xia", "authors": "Guowei Wu, Dongze Lu, Feng Xia, Lin Yao", "title": "A Fault-Tolerant Emergency-Aware Access Control Scheme for\n  Cyber-Physical Systems", "comments": null, "journal-ref": "Information Technology and Control, 2011, Vol.40, No.1, pp. 29-40", "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Access control is an issue of paramount importance in cyber-physical systems\n(CPS). In this paper, an access control scheme, namely FEAC, is presented for\nCPS. FEAC can not only provide the ability to control access to data in normal\nsituations, but also adaptively assign emergency-role and permissions to\nspecific subjects and inform subjects without explicit access requests to\nhandle emergency situations in a proactive manner. In FEAC, emergency-group and\nemergency-dependency are introduced. Emergencies are processed in sequence\nwithin the group and in parallel among groups. A priority and dependency model\ncalled PD-AGM is used to select optimal response-action execution path aiming\nto eliminate all emergencies that occurred within the system. Fault-tolerant\naccess control polices are used to address failure in emergency management. A\ncase study of the hospital medical care application shows the effectiveness of\nFEAC.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 01:13:13 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Wu", "Guowei", ""], ["Lu", "Dongze", ""], ["Xia", "Feng", ""], ["Yao", "Lin", ""]]}, {"id": "1201.0206", "submitter": "Feng Xia", "authors": "Tie Qiu, Wei Wang, Feng Xia, Guowei Wu, Yu Zhou", "title": "A Failure Self-recovery Strategy with Balanced Energy Consumption for\n  Wireless Ad Hoc Networks", "comments": "To appear in Journal of Computers, Jan 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In energy constrained wireless sensor networks, it is significant to make\nfull use of the limited energy and maximize the network lifetime even when\nfacing some unexpected situation. In this paper, all sensor nodes are grouped\ninto clusters, and for each cluster, it has a mobile cluster head to manage the\nwhole cluster. We consider an emergent situation that one of the mobile cluster\nheads is broken down, and hence the whole cluster is consequently out of work.\nAn efficient approach is proposed for recovering the failure cluster by\nselecting multiple static sensor nodes as the cluster heads to collect packets\nand transmit them to the sink node. Improved simulated annealing algorithm is\nutilized to achieve the uniform deployment of the cluster heads. The new\ncluster heads are dynamically changed in order to keep balanced energy\nconsumption. Among the new cluster heads, packets are transmitted through\nmulti-hop forwarding path which is cost-lowest path found by Dijkstra's\nalgorithm. A balanced energy consumption model is provided to help find the\ncost-lowest path and prolong the lifetime of the network. The forwarding path\nis updated dynamically according to the cost of the path and residual energy of\nthe node in that path. The experimental results show that the failure cluster\nis recovered and the lifetime of the cluster is prolonged.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 01:35:09 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Qiu", "Tie", ""], ["Wang", "Wei", ""], ["Xia", "Feng", ""], ["Wu", "Guowei", ""], ["Zhou", "Yu", ""]]}, {"id": "1201.0207", "submitter": "Feng Xia", "authors": "Guowei Wu, Feng Xia, Lin Yao, Yan Zhang, Yanwei Zhu", "title": "A Hop-by-hop Cross-layer Congestion Control Scheme for Wireless Sensor\n  Networks", "comments": null, "journal-ref": "Journal of Software, Dec 2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Congestions in wireless sensor networks (WSNs) could potentially cause packet\nloss, throughput impairment and energy waste. To address this issue, a\nhop-by-hop cross-layer congestion control scheme (HCCC) built on\ncontention-based MAC protocol is proposed in this paper. According to MAC-layer\nchannel information including buffer occupancy ratio and congestion degree of\nlocal node, HCCC dynamically adjusts channel access priority in MAC layer and\ndata transmission rate of the node to tackle the problem of congestion.\nSimulations have been conducted to compare HCCC against closely-related\nexisting schemes. The results show that HCCC exhibits considerable superiority\nin terms of packets loss ratio, throughput and energy efficiency.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 01:42:19 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Wu", "Guowei", ""], ["Xia", "Feng", ""], ["Yao", "Lin", ""], ["Zhang", "Yan", ""], ["Zhu", "Yanwei", ""]]}, {"id": "1201.0210", "submitter": "Feng Xia", "authors": "Feng Xia, Ruixia Gao, Linqiang Wang and Ruonan Hao", "title": "Real-Time Performance Analysis of Infrastructure-based IEEE 802.11\n  Distributed Coordination Function", "comments": null, "journal-ref": "Control Engineering and Applied Informatics, Vol.13, No.3, pp.\n  74-81, 2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the increasing popularity of wireless networks, wireless local area\nnetworks (WLANs) have attracted significant research interest, which play a\ncritical role in providing anywhere and anytime connectivity. For WLANs the\nIEEE 802.11 standard is the most mature technology and has been widely adopted\nfor wireless networks. This paper analyzes real-time performance of the IEEE\n802.11 standard that adopts the MAC protocol of Distributed Coordination\nFunction (DCF) operating in infrastructure mode. Extensive simulations have\nbeen done to examine how the network performance in terms of realtime metrics\nincluding effective data rate, latency and packet loss rate will be impacted by\nsome critical parameters (e.g. CWmin and packet payload). The results are\npresented and analyzed. The analysis of simulation results can provide support\nfor parameter configuration and optimization of WLANs for realtime\napplications.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 02:03:48 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Xia", "Feng", ""], ["Gao", "Ruixia", ""], ["Wang", "Linqiang", ""], ["Hao", "Ruonan", ""]]}, {"id": "1201.0213", "submitter": "Feng Xia", "authors": "Jin Wang, Hassan Abid, Sungyoung Lee, Lei Shu and Feng Xia", "title": "A Secured Health Care Application Architecture for Cyber-Physical\n  Systems", "comments": null, "journal-ref": "Control Engineering and Applied Informatics, Vol.13, No.3, pp.\n  101-108, 2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyber-physical systems (CPS) can be viewed as a new generation of systems\nwith integrated control, communication and computational capabilities. Like the\ninternet transformed how humans interact with one another, cyber-physical\nsystems will transform how people interact with the physical world. Currently,\nthe study of CPS is still in its infancy and there exist many research issues\nand challenges ranging from electricity power, health care, transportation and\nsmart building etc. In this paper, an introduction of CPeSC3 (cyber physical\nenhanced secured wireless sensor networks (WSNs) integrated cloud computing for\nu-life care) architecture and its application to the health care monitoring and\ndecision support systems is given. The proposed CPeSC3 architecture is composed\nof three main components, namely 1) communication core, 2) computation core,\nand 3) resource scheduling and management core. Detailed analysis and\nexplanation are given for relevant models such as cloud computing, real time\nscheduling and security models. Finally, a medical health care application\nscenario is presented based on our practical test-bed which has been built for\n3 years.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 02:25:24 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Wang", "Jin", ""], ["Abid", "Hassan", ""], ["Lee", "Sungyoung", ""], ["Shu", "Lei", ""], ["Xia", "Feng", ""]]}, {"id": "1201.0215", "submitter": "Feng Xia", "authors": "Feng Xia, Ruonan Hao, Yang Cao, Lei Xue", "title": "ART-GAS: An Adaptive and Real-Time GTS Allocation Scheme for IEEE\n  802.15.4", "comments": "The Asian Internet Engineering Conference (AINTEC 2011), ACM,\n  November 2011, Bangkok, Thailand", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  IEEE 802.15.4 supports a Guaranteed Time Slot (GTS) allocation mechanism for\ntime-critical and delay-sensitive data transmissions in Wireless Personal Area\nNetworks (WPANs). However, the inflexible first-come-first-served GTS\nallocation policy and the passive deallocation mechanism significantly reduce\nnetwork efficiency. In this paper, we propose an Adaptive and Real-Time GTS\nAllocation Scheme (ART-GAS) to provide differentiated services for devices with\ndifferent priorities, which guarantees data transmissions for time-sensitive\nand high-traffic devices. The bandwidth utilization in IEEE 802.15.4-based PAN\nis improved. Simulation results show that our ART-GAS algorithm significantly\noutperforms the existing GTS mechanism specified in IEEE 802.15.4.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 03:05:06 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Xia", "Feng", ""], ["Hao", "Ruonan", ""], ["Cao", "Yang", ""], ["Xue", "Lei", ""]]}, {"id": "1201.0218", "submitter": "Feng Xia", "authors": "Fangwei Ding, Feng Xia, Wei Zhang, Xuhai Zhao, Chengchuan Ma", "title": "Monitoring Energy Consumption of Smartphones", "comments": "The 1st International Workshop on Sensing, Networking, and Computing\n  with Smartphones (PhoneCom), IEEE, Dalian, China, Oct 19-22, 2011", "journal-ref": null, "doi": "10.1109/iThings/CPSCom.2011.122", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the rapid development of new and innovative applications for mobile\ndevices like smartphones, advances in battery technology have not kept pace\nwith rapidly growing energy demands. Thus energy consumption has become a more\nand more important issue of mobile devices. To meet the requirements of saving\nenergy, it is critical to monitor and analyze the energy consumption of\napplications on smartphones. For this purpose, we develop a smart energy\nmonitoring system called SEMO for smartphones using Android operating system.\nIt can profile mobile applications with battery usage information, which is\nvital for both developers and users.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 03:44:21 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Ding", "Fangwei", ""], ["Xia", "Feng", ""], ["Zhang", "Wei", ""], ["Zhao", "Xuhai", ""], ["Ma", "Chengchuan", ""]]}, {"id": "1201.0219", "submitter": "Feng Xia", "authors": "Feng Xia, Wei Zhang, Fangwei Ding, Ruonan Hao", "title": "A-GPS Assisted Wi-Fi Access Point Discovery on Mobile Devices for Energy\n  Saving", "comments": "IEEE Global Information Infrastructure Symposium (GIIS 2011), August\n  2011, Da Nang, Vietnam", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile devices have been shipped with multiple wireless network interfaces in\norder to meet their diverse communication and networking demands. In this\npaper, we propose an A-GPS assisted scheme that discovers the nearest Wi-Fi\nnetwork access points (APs) by using user's location information. This allows\nthe user to switch to the Wi-Fi interface in an intelligent manner when she/he\narrives at the nearest Wi-Fi network AP. Therefore, it avoids the long periods\nin idle state and greatly reduces the number of unnecessary Wi-Fi scans on the\nmobile device. The experimental results demonstrate that our scheme effectively\nsaves energy for mobile devices integrated with Wi-Fi and cellular interfaces.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 03:53:04 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Xia", "Feng", ""], ["Zhang", "Wei", ""], ["Ding", "Fangwei", ""], ["Hao", "Ruonan", ""]]}, {"id": "1201.0301", "submitter": "Honggang Zhang", "authors": "Honggang Zhang, Sudarshan Vasudevan", "title": "Design and Analysis of Coalitions in Data Swarming Systems", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We design and analyze a mechanism for forming coalitions of peers in a data\nswarming system where peers have heterogeneous upload capacities. A coalition\nis a set of peers that explicitly cooperate with other peers inside the\ncoalition via choking, data replication, and capacity allocation strategies.\nFurther, each peer interacts with other peers outside its coalition via\npotentially distinct choking, data replication, and capacity allocation\nstrategies. Following on our preliminary work in IEEE ICNP 2011 that\ndemonstrated significant performance benefits of coalitions, we present here a\ncomprehensive analysis of the choking and data replication strategies for\ncoalitions.\n  We first develop an analytical model to understand a simple random choking\nstrategy as a within-coalition strategy and show that it accurately predicts a\ncoalition's performance. Our analysis formally shows that the random choking\nstrategy can help a coalition achieve near-optimal performance by optimally\nchoosing the re-choking interval lengths and the number unchoke slots. Further,\nour analytical model can be easily adapted to model a BitTorrent-like swarm. We\nalso introduce a simple data replication strategy which significantly improves\ndata availability within a coalition as compared to the rarest-first piece\nreplication strategy employed in BitTorrent systems. We further propose a\ncooperation-aware better response strategy that achieves convergence of the\ndynamic coalition formation process when peers freely join or leave any\ncoalition. Finally, using extensive simulations, we demonstrate improvements in\nthe performance of a swarming system due to coalition formation.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 18:55:42 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Zhang", "Honggang", ""], ["Vasudevan", "Sudarshan", ""]]}, {"id": "1201.0349", "submitter": "Matthias W\\\"ahlisch", "authors": "Thomas C. Schmidt and Matthias W\\\"ahlisch", "title": "Why We Shouldn't Forget Multicast in Name-oriented Publish/Subscribe", "comments": null, "journal-ref": "Thomas C. Schmidt, Matthias W\\\"ahlisch, Dominik Charousset,\n  Sebastian Meiling, On Name-based Group Communication: Challenges Concepts and\n  Transparent Deployment, Computer Communications, Vol. 36, No. 15--16, pp.\n  1657-1664, Sep-Oct 2013", "doi": "10.1016/j.comcom.2013.08.001", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Name-oriented networks introduce the vision of an information-centric,\nsecure, globally available publish-subscribe infrastructure. Current approaches\nconcentrate on unicast-based pull mechanisms and thereby fall short in\nautomatically updating content at receivers. In this paper, we argue that an\ninclusion of multicast will grant additional benefits to the network layer,\nnamely efficient distribution of real-time data, a many-to-many communication\nmodel, and simplified rendezvous processes. These aspects are comprehensively\nreflected by a group-oriented naming concept that integrates the various\navailable group schemes and introduces new use cases. A first draft of this\nname-oriented multicast access has been implemented in the HAMcast middleware.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jan 2012 12:58:24 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["Schmidt", "Thomas C.", ""], ["Wählisch", "Matthias", ""]]}, {"id": "1201.0424", "submitter": "Najmeh Kamyabpour", "authors": "Najmeh Kamyabpour, Doan B. Hoang", "title": "A Task Based Sensor-Centeric Model for overall Energy Consumption", "comments": "The paper has been published at PDCAT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sensors have limited resources so it is important to manage the resources\nefficiently to maximize their use. A sensor's battery is a crucial resource as\nit singly determines the lifetime of sensor network applications. Since these\ndevices are useful only when they are able to communicate with the world, radio\ntransceiver of a sensor as an I/O and a costly unit plays a key role in its\nlifetime. This resource often consumes a big portion of the sensor's energy as\nit must be active most of the time to announce the existence of the sensor in\nthe network. As such the radio component has to deal with its embedded sensor\nnetwork whose parameters and operations have significant effects on the\nsensor's lifetime. In existing energy models, hardware is considered, but the\nenvironment and the network's parameters did not receive adequate attention.\nEnergy consumption components of traditional network architecture are often\nconsidered individually and separately, and their influences on each other have\nnot been considered in these approaches. In this paper we consider all possible\ntasks of a sensor in its embedded network and propose an energy management\nmodel. We categorize these tasks in five energy consuming constituents. The\nsensor's Energy Consumption (EC) is modeled on its energy consuming\nconstituents and their input parameters and tasks. The sensor's EC can thus be\nreduced by managing and executing efficiently the tasks of its constituents.\nThe proposed approach can be effective for power management, and it also can be\nused to guide the design of energy efficient wireless sensor networks through\nnetwork parameterization and optimization.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 05:45:55 GMT"}, {"version": "v2", "created": "Thu, 5 Jan 2012 12:08:10 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Kamyabpour", "Najmeh", ""], ["Hoang", "Doan B.", ""]]}, {"id": "1201.0435", "submitter": "Yuan Li", "authors": "Yuan Li, Yue Zhao and Haibin Kan", "title": "Capacity Factors of a Point-to-point Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate some properties on capacity factors, which were\nproposed to investigate the link failure problem from network coding. A\ncapacity factor (CF) of a network is an edge set, deleting which will cause the\nmaximum flow to decrease while deleting any proper subset will not. Generally,\na $k$-CF is a minimal (not minimum) edge set which will cause the network\nmaximum flow decrease by $k$.\n  Under point to point acyclic scenario, we characterize all the edges which\nare contained in some CF, and propose an efficient algorithm to classify. And\nwe show that all edges on some $s$-$t$ path in an acyclic point-to-point\nacyclic network are contained in some 2-CF. We also study some other properties\nof CF of point to point network, and a simple relationship with CF in multicast\nnetwork.\n  On the other hand, some computational hardness results relating to capacity\nfactors are obtained. We prove that deciding whether there is a capacity factor\nof a cyclic network with size not less a given number is NP-complete, and the\ntime complexity of calculating the capacity rank is lowered bounded by solving\nthe maximal flow. Besides that, we propose the analogous definition of CF on\nvertices and show it captures edge capacity factors as a special case.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 07:56:41 GMT"}, {"version": "v2", "created": "Fri, 13 Jan 2012 07:00:14 GMT"}], "update_date": "2012-01-16", "authors_parsed": [["Li", "Yuan", ""], ["Zhao", "Yue", ""], ["Kan", "Haibin", ""]]}, {"id": "1201.0662", "submitter": "Steven Weber", "authors": "Steven Weber and Jeffrey G. Andrews", "title": "Transmission capacity of wireless networks", "comments": "173 pages; Foundations and Trends in Networking, vol. 5, no. 2-3,\n  2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transmission capacity (TC) is a performance metric for wireless networks that\nmeasures the spatial intensity of successful transmissions per unit area,\nsubject to a constraint on the permissible outage probability (where outage\noccurs when the SINR at a receiver is below a threshold). This volume gives a\nunified treatment of the TC framework that has been developed by the authors\nand their collaborators over the past decade. The mathematical framework\nunderlying the analysis (reviewed in Ch. 2) is stochastic geometry: Poisson\npoint processes model the locations of interferers, and (stable) shot noise\nprocesses represent the aggregate interference seen at a receiver. Ch. 3\npresents TC results (exact, asymptotic, and bounds) on a simple model in order\nto illustrate a key strength of the framework: analytical tractability yields\nexplicit performance dependence upon key model parameters. Ch. 4 presents\nenhancements to this basic model --- channel fading, variable link distances,\nand multi-hop. Ch. 5 presents four network design case studies well-suited to\nTC: i) spectrum management, ii) interference cancellation, iii) signal\nthreshold transmission scheduling, and iv) power control. Ch. 6 studies the TC\nwhen nodes have multiple antennas, which provides a contrast vs. classical\nresults that ignore interference.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 15:21:48 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Weber", "Steven", ""], ["Andrews", "Jeffrey G.", ""]]}, {"id": "1201.0686", "submitter": "Ming Liu", "authors": "Ming Liu (IETR), Matthieu Crussi\\`ere (IETR), Jean-Fran\\c{c}ois\n  H\\'elard (IETR)", "title": "A Novel Data-Aided Channel Estimation with Reduced Complexity for\n  TDS-OFDM Systems", "comments": null, "journal-ref": "IEEE Transactions on Broadcasting 58 (2012) 1-14", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In contrast to the classical cyclic prefix (CP)-OFDM, the time domain\nsynchronous (TDS)-OFDM employs a known pseudo noise (PN) sequence as guard\ninterval (GI). Conventional channel estimation methods for TDS-OFDM are based\non the exploitation of the PN sequence and consequently suffer from intersymbol\ninterference (ISI). This paper proposes a novel dataaided channel estimation\nmethod which combines the channel estimates obtained from the PN sequence and,\nmost importantly, additional channel estimates extracted from OFDM data\nsymbols. Data-aided channel estimation is carried out using the rebuilt OFDM\ndata symbols as virtual training sequences. In contrast to the classical turbo\nchannel estimation, interleaving and decoding functions are not included in the\nfeedback loop when rebuilding OFDM data symbols thereby reducing the\ncomplexity. Several improved techniques are proposed to refine the data-aided\nchannel estimates, namely one-dimensional (1-D)/two-dimensional (2-D) moving\naverage and Wiener filtering. Finally, the MMSE criteria is used to obtain the\nbest combination results and an iterative process is proposed to progressively\nrefine the estimation. Both MSE and BER simulations using specifications of the\nDTMB system are carried out to prove the effectiveness of the proposed\nalgorithm even in very harsh channel conditions such as in the single frequency\nnetwork (SFN) case.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 16:10:09 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Liu", "Ming", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"]]}, {"id": "1201.0725", "submitter": "Manel Khelifi", "authors": "Manel Khelifi, Assia Djabelkhir", "title": "LMEEC: Layered Multi-Hop Energy Efficient Cluster-based Routing Protocol\n  for Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, we propose LMEEC, a cluster-based routing protocol with low\nenergy consumption for wireless sensor networks. Our protocol is based on a\nstrategy which aims to provide a more reasonable exploitation of the selected\nnodes (cluster-heads) energy. Simulation results show the effectiveness of\nLMEEC in decreasing the energy consumption, and in prolonging the network\nlifetime, compared to LEACH.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 19:12:46 GMT"}, {"version": "v2", "created": "Tue, 17 Jan 2012 20:28:58 GMT"}], "update_date": "2012-01-18", "authors_parsed": [["Khelifi", "Manel", ""], ["Djabelkhir", "Assia", ""]]}, {"id": "1201.0834", "submitter": "Udi Weinsberg", "authors": "Yuval Shavitt and Udi Weinsberg", "title": "Topological Trends of Internet Content Providers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet is constantly changing, and its hierarchy was recently shown to\nbecome flatter. Recent studies of inter-domain traffic showed that large\ncontent providers drive this change by bypassing tier-1 networks and reaching\ncloser to their users, enabling them to save transit costs and reduce reliance\nof transit networks as new services are being deployed, and traffic shaping is\nbecoming increasingly popular.\n  In this paper we take a first look at the evolving connectivity of large\ncontent provider networks, from a topological point of view of the autonomous\nsystems (AS) graph. We perform a 5-year longitudinal study of the topological\ntrends of large content providers, by analyzing several large content providers\nand comparing these trends to those observed for large tier-1 networks. We\nstudy trends in the connectivity of the networks, neighbor diversity and\ngeographical spread, their hierarchy, the adoption of IXPs as a convenient\nmethod for peering, and their centrality. Our observations indicate that\ncontent providers gradually increase and diversify their connectivity, enabling\nthem to improve their centrality in the graph, and as a result, tier-1 networks\nlose dominance over time.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 06:37:51 GMT"}], "update_date": "2012-01-05", "authors_parsed": [["Shavitt", "Yuval", ""], ["Weinsberg", "Udi", ""]]}, {"id": "1201.0842", "submitter": "Soumen  Kanrar", "authors": "M. Siraj, Soumen Kanrar", "title": "Performance of Modeling wireless networks in realistic environment", "comments": "18 pages, 16 figures; ISSN:1985-4129", "journal-ref": "International Journal of Computer Networks Volume:2, Issue:1,\n  pages 62-79 (2010)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A wireless network is realized by mobile devices which communicate over radio\nchannels. Since, experiments of real life problem with real devices are very\ndifficult, simulation is used very often. Among many other important properties\nthat have to be defined for simulative experiments, the mobility model and the\nradio propagation model have to be selected carefully. Both have strong impact\non the performance of mobile wireless networks, e.g., the performance of\nrouting protocols varies with these models. There are many mobility and radio\npropagation models proposed in literature. Each of them was developed with\ndifferent objectives and is not suited for every physical scenario. The radio\npropagation models used in common wireless network simulators, in general\nresearcher consider simple radio propagation models and neglect obstacles in\nthe propagation environment. In this paper, we study the performance of\nwireless networks simulation by consider different Radio propagation models\nwith considering obstacles in the propagation environment. In this paper we\nanalyzed the performance of wireless networks by OPNET Modeler .In this paper\nwe quantify the parameters such as throughput, packet received attenuation.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 08:18:57 GMT"}], "update_date": "2012-01-05", "authors_parsed": [["Siraj", "M.", ""], ["Kanrar", "Soumen", ""]]}, {"id": "1201.1018", "submitter": "Manel Khelifi", "authors": "Manel Khelifi and Assia Djabelkhir", "title": "Un protocole de routage \\`a basse consommation d'\\'energie selon\n  l'approche de clustering pour les r\\'eseaux de capteurs sans fils", "comments": "in French. International Conference on Information Systems and\n  Technologies (ICIST 2011), Algeria. ICIST'2011 : 1201.1018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper we propose a new routing protocol with low energy consumption\nfor wireless sensor networks based on the clustering approach. Our protocol is\nbased on a strategy which aims at providing a more equitable exploitation of\nthe selected nodes (cluster-heads) energy by distributing their load of the\nmanaged sensors during the clustering process. In order to save the energy\ndissipated while transmitting sensed data to the base station, the multi-hops\nrouting strategy is used to arrange the communication of the data between\ncluster-heads nodes. Simulation results demonstrate that our proposed protocol\ndecreases the energy consumption and prolongs the network lifetime.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 21:51:08 GMT"}, {"version": "v2", "created": "Fri, 3 Feb 2012 23:30:13 GMT"}, {"version": "v3", "created": "Fri, 25 Sep 2015 18:06:30 GMT"}], "update_date": "2015-09-28", "authors_parsed": [["Khelifi", "Manel", ""], ["Djabelkhir", "Assia", ""]]}, {"id": "1201.1038", "submitter": "Nada Alamri Ms", "authors": "Nada Alamri, Nadine Akkari", "title": "UMTS-WiMAX Vertical Handover in Next Generation Wireless Networks", "comments": "20 pages, 20 figures, 4 tables, IJDPS; Nada Alamri and Nadine\n  Akkari,\"UMTS-WiMAX Vertical Handover in Next Generation Wireless Networks\",\n  International Journal for Distributed and Parallel Systems (IJDPS),2011,\n  vol.2, No,6", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The vision of next generation wireless network (NGWN) is to integrate\ndifferent wireless access technologies, each with its own characteristics, into\na common IP-based core network to provide mobile user with service continuity\nand seamless roaming. One of the major issues for the converged heterogeneous\nnetworks is providing a seamless vertical handover (VHO) with QoS support. In\nthis paper we have reviewed the various interworking architectures and handover\nscenarios between UMTS and WiMAX. Also, we have compared the proposed solutions\nbased on different criteria and revealed the pros and cons of each scheme. The\ncomparison aids to adopt a better interworking and handover mechanism in NGWN.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 23:43:32 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Alamri", "Nada", ""], ["Akkari", "Nadine", ""]]}, {"id": "1201.1090", "submitter": "Hossein Shokri Ghadikolaei", "authors": "Hossein Shokri-Ghadikolaei, Fatemeh Sheikholeslami, Masoumeh\n  Nasiri-Kenari", "title": "Distributed Multiuser Sequential Channel Sensing Schemes in Multichannel\n  Cognitive Radio Networks", "comments": "This paper has been withdrawn", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the author due to a crucial problem\nassociated with Figs. 2 and 3.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 09:26:40 GMT"}, {"version": "v2", "created": "Tue, 7 Feb 2012 06:29:58 GMT"}], "update_date": "2012-02-08", "authors_parsed": [["Shokri-Ghadikolaei", "Hossein", ""], ["Sheikholeslami", "Fatemeh", ""], ["Nasiri-Kenari", "Masoumeh", ""]]}, {"id": "1201.1174", "submitter": "Yongjun Liao", "authors": "Yongjun Liao, Wei Du, Pierre Geurts and Guy Leduc", "title": "DMFSGD: A Decentralized Matrix Factorization Algorithm for Network\n  Distance Prediction", "comments": "submitted to IEEE/ACM Transactions on Networking on Nov. 2011", "journal-ref": null, "doi": "10.1109/TNET.2012.2228881", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The knowledge of end-to-end network distances is essential to many Internet\napplications. As active probing of all pairwise distances is infeasible in\nlarge-scale networks, a natural idea is to measure a few pairs and to predict\nthe other ones without actually measuring them. This paper formulates the\ndistance prediction problem as matrix completion where unknown entries of an\nincomplete matrix of pairwise distances are to be predicted. The problem is\nsolvable because strong correlations among network distances exist and cause\nthe constructed distance matrix to be low rank. The new formulation circumvents\nthe well-known drawbacks of existing approaches based on Euclidean embedding.\n  A new algorithm, so-called Decentralized Matrix Factorization by Stochastic\nGradient Descent (DMFSGD), is proposed to solve the network distance prediction\nproblem. By letting network nodes exchange messages with each other, the\nalgorithm is fully decentralized and only requires each node to collect and to\nprocess local measurements, with neither explicit matrix constructions nor\nspecial nodes such as landmarks and central servers. In addition, we compared\ncomprehensively matrix factorization and Euclidean embedding to demonstrate the\nsuitability of the former on network distance prediction. We further studied\nthe incorporation of a robust loss function and of non-negativity constraints.\nExtensive experiments on various publicly-available datasets of network delays\nshow not only the scalability and the accuracy of our approach but also its\nusability in real Internet applications.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 14:02:16 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Liao", "Yongjun", ""], ["Du", "Wei", ""], ["Geurts", "Pierre", ""], ["Leduc", "Guy", ""]]}, {"id": "1201.1175", "submitter": "Mehmet Karaca", "authors": "Mehmet Karaca and Ozgur Ercetin", "title": "Throughput Optimal Multi-user Scheduling via Hierarchical Modulation", "comments": "4 pages, 2 figures, submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the network stability problem when two users are scheduled\nsimultaneously. The key idea is to simultaneously transmit to more than one\nusers experiencing different channel conditions by employing hierarchical\nmodulation. For two-user scheduling problem, we develop a throughput-optimal\nalgorithm which can stabilize the network whenever this is possible. In\naddition, we analytically prove that the proposed algorithm achieves larger\nachievable rate region compared to the conventional Max-Weight algorithm which\nemploys uniform modulation and transmits a single user. We demonstrate the\nefficacy of the algorithm on a realistic simulation environment using the\nparameters of High Data Rate protocol in a Code Division Multiple Access\nsystem. Simulation results show that with the proposed algorithm, the network\ncan carry higher user traffic with lower delays.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 14:02:48 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Karaca", "Mehmet", ""], ["Ercetin", "Ozgur", ""]]}, {"id": "1201.1353", "submitter": "Ved Prakash Bhardwaj", "authors": "Ved Prakash Bhardwaj, Nitin, Vipin Tyagi", "title": "Minimizing the Switch and Link Conflicts in an Optical Multi-stage\n  Interconnection Network", "comments": "9 pages, 6 figures", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 4, No 1, July 2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multistage Interconnection Networks (MINs) are very popular in switching and\ncommunication applications. A MIN connects N inputs to N outputs and is\nreferred as an N \\times N MIN; having size N. Optical Multistage\nInterconnection Network (OMIN) represents an important class of Interconnection\nnetworks. Crosstalk is the basic problem of OMIN. Switch Conflict and Link\nConflict are the two main reason of crosstalk. In this paper, we are\nconsidering both problems. A number of techniques like Optical window, Improved\nWindow, Heuristic, Genetic, and Zero have been proposed earlier in this\nresearch domain. In this paper, we have proposed two algorithms called Address\nSelection Algorithm and Route Selection Algorithm (RSA). RSA is based on\nImproved Window Method. We have applied the proposed algorithms on existing\nOmega network, having shuffle-exchange connection pattern. The main\nfunctionality of ASA and RSA is to minimize the number of switch and link\nconflicts in the network and to provide conflict free routes.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jan 2012 05:17:35 GMT"}], "update_date": "2012-01-09", "authors_parsed": [["Bhardwaj", "Ved Prakash", ""], ["Nitin", "", ""], ["Tyagi", "Vipin", ""]]}, {"id": "1201.1427", "submitter": "Antonios Argyriou", "authors": "Marc Aoun, Paul Beekhuizen, Antonios Argyriou, Dee Denteneer, Peter\n  van der Stok", "title": "Packet Skipping and Network Coding for Delay-Sensitive Network\n  Communication", "comments": null, "journal-ref": "Performance Evaluation 2012", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide an analytical study of the impact of packet skipping and\nopportunistic network coding on the timely communication of messages through a\nsingle network element. In a first step, we consider a single-server queueing\nsystem with Poisson arrivals, exponential service times, and a single buffer\nposition. Packets arriving at a network node have a fixed deadline before which\nthey should reach the destination. To preserve server capacity, we introduce a\nthresholding policy, based on remaining time until deadline expiration, to\ndecide whether to serve a packet or skip its service. The obtained goodput\nimprovement of the system is derived, as well as the operating conditions under\nwhich thresholding can enhance performance. Subsequently, we focus our analysis\non a system that supports network coding instead of thresholding. We\ncharacterize the impact of network coding at a router node on the delivery of\npackets associated with deadlines. We model the router node as a queueing\nsystem where packets arrive from two independent Poisson flows and undergo\nopportunistic coding operations. We obtain an exact expression for the goodput\nof the system and study the achievable gain. Finally, we provide an analytical\nmodel that considers both network coding and packet skipping, capturing their\njoint performance. A comparative analysis between the aforementioned approaches\nis provided.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jan 2012 14:29:01 GMT"}, {"version": "v2", "created": "Sun, 20 Jan 2013 11:17:31 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Aoun", "Marc", ""], ["Beekhuizen", "Paul", ""], ["Argyriou", "Antonios", ""], ["Denteneer", "Dee", ""], ["van der Stok", "Peter", ""]]}, {"id": "1201.1661", "submitter": "Giang Nguyen", "authors": "Giang T. K. Nguyen, Rachit Agarwal, Junda Liu, Matthew Caesar, P.\n  Brighten Godfrey, Scott Shenker", "title": "Slick Packets", "comments": "This is the full version of a paper with the same title that appeared\n  in ACM SIGMETRICS 2011, with the inclusion of the appendix. 16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Source-controlled routing has been proposed as a way to improve flexibility\nof future network architectures, as well as simplifying the data plane.\nHowever, if a packet specifies its path, this precludes fast local re-routing\nwithin the network. We propose SlickPackets, a novel solution that allows\npackets to slip around failures by specifying alternate paths in their headers,\nin the form of compactly-encoded directed acyclic graphs. We show that this can\nbe accomplished with reasonably small packet headers for real network\ntopologies, and results in responsiveness to failures that is competitive with\npast approaches that require much more state within the network. Our approach\nthus enables fast failure response while preserving the benefits of\nsource-controlled routing.\n", "versions": [{"version": "v1", "created": "Sun, 8 Jan 2012 22:21:15 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Nguyen", "Giang T. K.", ""], ["Agarwal", "Rachit", ""], ["Liu", "Junda", ""], ["Caesar", "Matthew", ""], ["Godfrey", "P. Brighten", ""], ["Shenker", "Scott", ""]]}, {"id": "1201.1964", "submitter": "Partha Bhattacharya DR", "authors": "Anita Garhwal, Partha Pratim Bhattacharya", "title": "A Survey on Dynamic Spectrum Access Techniques for Cognitive Radio", "comments": "arXiv admin note: text overlap with\n  http://www.ijetch.org/papers/206-Z058.pdf by other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Cognitive radio (CR) is a new paradigm that utilizes the available spectrum\nband. The key characteristic of CR system is to sense the electromagnetic\nenvironment to adapt their operation and dynamically vary its radio operating\nparameters. The technique of dynamically accessing the unused spectrum band is\nknown as Dynamic Spectrum Access (DSA). The dynamic spectrum access technology\nhelps to minimize unused spectrum bands. In this paper, main functions of\nCognitive Radio (CR) i.e. spectrum sensing, spectrum management, spectrum\nmobility and spectrum sharing are discussed. Then DSA models are discussed\nalong with different methods of DSA such as Command and Control, Exclusive-Use,\nShared Use of Primary Licensed User and Commons method. Game-theoretic approach\nusing Bertrand game model, Markovian Queuing Model for spectrum allocation in\ncentralized architecture and Fuzzy logic based method are also discussed and\nresult are shown.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2012 04:58:08 GMT"}], "update_date": "2013-09-27", "authors_parsed": [["Garhwal", "Anita", ""], ["Bhattacharya", "Partha Pratim", ""]]}, {"id": "1201.1972", "submitter": "Abdelhakim Khlifi", "authors": "Abdelhakim Khlifi and Ridha Bouallegue", "title": "Hybrid LS-LMMSE Channel Estimation Technique for LTE Downlink Systems", "comments": "13 pages, 11 figures", "journal-ref": "International Journal of Next Generation Networks (IJNGN) Vol.3,\n  No.4, December 2011, 1-13", "doi": "10.5121/ijngn.2011.3401", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose to improve the performance of the channel\nestimation for LTE Downlink systems under the effect of the channel length. As\nLTE Downlink system is a MIMO-OFDMA based system, a cyclic prefix (CP) is\ninserted at the beginning of each transmitted OFDM symbol in order to mitigate\nboth inter-carrier interference (ICI) and inter-symbol interference (ISI). The\ninserted CP is usually equal to or longer than the channel length. However, the\ncyclic prefix can be shorter because of some unforeseen channel behaviour.\nPrevious works have shown that in the case where the cyclic prefix is equal to\nor longer than the channel length, LMMSE performs better than LSE but at the\ncost of computational complexity .In the other case, LMMSE performs also better\nthan LS only for low SNR values. However, LS shows better performance for LTE\nDownlink systems for high SNR values. Therefore, we propose a hybrid LS-LMMSE\nchannel estimation technique robust to the channel length effect. MATLAB\nMonte-Carlo simulations are used to evaluate the performance of the proposed\nestimator in terms of Mean Square Error (MSE) and Bit Error Rate (BER) for 2x2\nLTE Downlink systems.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2012 06:14:26 GMT"}], "update_date": "2012-01-11", "authors_parsed": [["Khlifi", "Abdelhakim", ""], ["Bouallegue", "Ridha", ""]]}, {"id": "1201.2074", "submitter": "Jan Wr\\'obel", "authors": "Jan Wrobel", "title": "Reflection Scan: an Off-Path Attack on TCP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper demonstrates how traffic load of a shared packet queue can be\nexploited as a side channel through which protected information leaks to an\noff-path attacker. The attacker sends to a victim a sequence of identical\nspoofed segments. The victim responds to each segment in the sequence (the\nsequence is reflected by the victim) if the segments satisfy a certain\ncondition tested by the attacker. The responses do not reach the attacker\ndirectly, but induce extra load on a routing queue shared between the victim\nand the attacker. Increased processing time of packets traversing the queue\nreveal that the tested condition was true. The paper concentrates on the TCP,\nbut the approach is generic and can be effective against other protocols that\nallow to construct requests which are conditionally answered by the victim. A\nproof of concept was created to assess applicability of the method in real-life\nscenarios.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2012 15:19:38 GMT"}, {"version": "v2", "created": "Tue, 24 Jan 2012 11:16:26 GMT"}], "update_date": "2012-01-25", "authors_parsed": [["Wrobel", "Jan", ""]]}, {"id": "1201.2102", "submitter": "Yasir Malik", "authors": "Yasir Malik, Kishwer Abdul Khaliq, Bessam Abdulrazak, Usman Tariq", "title": "Mobile node localization in cellular networks", "comments": "10 Pages, 7 figures; ISSN:0975-3834 (Online); 0975-4679 (Print)", "journal-ref": "IJWMN Vol. 3, No. 6, December 2011 Pg-91-100", "doi": "10.5121/ijwmn.2011.3607", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Location information is the major component in location based applications.\nThis information is used in different safety and service oriented applications\nto provide users with services according to their Geolocation. There are many\napproaches to locate mobile nodes in indoor and outdoor environments. In this\npaper, we are interested in outdoor localization particularly in cellular\nnetworks of mobile nodes and presented a localization method based on cell and\nuser location information. Our localization method is based on hello message\ndelay (sending and receiving time) and coordinate information of Base\nTransceiver Station (BTSs). To validate our method across cellular network, we\nimplemented and simulated our method in two scenarios i.e. maintaining database\nof base stations in centralize and distributed system. Simulation results show\nthe effectiveness of our approach and its implementation applicability in\ntelecommunication systems.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2012 16:26:58 GMT"}], "update_date": "2012-01-11", "authors_parsed": [["Malik", "Yasir", ""], ["Khaliq", "Kishwer Abdul", ""], ["Abdulrazak", "Bessam", ""], ["Tariq", "Usman", ""]]}, {"id": "1201.2237", "submitter": "Abdelrahman Elleithy", "authors": "Abdelrahman Elleithy, Gonhsin Liu", "title": "A simulation model for the lifetime of wireless sensor networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a model for the lifetime of wireless sensor\nnetworks. The model takes into consideration several parameters such as the\ntotal number of sensors, network size, percentage of sink nodes, location of\nsensors, the mobility of sensors, and power consumption. A definition of the\nlife time of the network based on three different criteria is introduced;\npercentage of available power to total power, percentage of alive sensors to\ntotal sensors, and percentage of alive sink sensors to total sink sensors. A\nMatlab based simulator is developed for the introduced model. A number of\nwireless sensor networks scenarios are presented and discussed.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 04:53:31 GMT"}], "update_date": "2012-01-12", "authors_parsed": [["Elleithy", "Abdelrahman", ""], ["Liu", "Gonhsin", ""]]}, {"id": "1201.2288", "submitter": "Vijay Dhir", "authors": "Vijay Dhir, Rattan K. Datta and Maitreyee Dutta", "title": "Nimble@ITCEcnoGrid: A Grid in Research Domain for Weather Forecasting", "comments": "11 pages", "journal-ref": "International Journal of Grid Computing & Applications (IJGCA)\n  Vol.2, No.4, December 2011, 37-47", "doi": "10.5121/ijgca.2011.2404", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer Technology has Revolutionized Science. This has motivated scientists\nto develop mathematical model to simulate salient features of Physical\nuniverse. These models can approximate reality at many levels of scale such as\natomic nucleus, Earth's biosphere & weather/climate assessment. If the computer\npower is greater, the greater will be the accuracy in approximation i.e. close\nwill be the approximation to the reality. The speed of the computer required\nfor solution of such problems require computers with processing power of\nteraflops to Pets flops speed.. The way to speed up the computation is to\n\"parallelize\" it. One of the approach is to use multimillion dollar\nSupercomputer or use Computational Grid (which is also called poor man's\nsupercomputer) having geographically distributed resources e.g. SETI@home (Used\nto detect radio waves emitted by intelligent civilizations outside earth) has\n4.6 million participants computers. There are many alternatives tools available\nto achieve this goal like Globus Toolkit, Entropia, Legion, BOINC etc but they\nare mainly based on Linux platform. As majority of the computers available are\nwindows based, so it will be easy to develop a larger network of computers\nwhich will use the free cycles of the computer to solve the complex problem at\nwindow platform. Nimble@ITCEcnoGrid has been developed. It includes the feature\nof Inter Thread Communication which is missing in any of the toolkits\navailable. Nimble@ITCEcnoGrid Framework (A Fast Grid with Inter-thread\ncommunication with Economic Based Policy) was tested for computation of 'PI' up\nto 120 decimal points. Encouraged by the speed the same system has been\nutilized to computes the Momentum, Thermodynamics and Continuity equations for\nthe Weather Forecasting using the Windows based Desktop computers.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 12:02:39 GMT"}], "update_date": "2012-01-12", "authors_parsed": [["Dhir", "Vijay", ""], ["Datta", "Rattan K.", ""], ["Dutta", "Maitreyee", ""]]}, {"id": "1201.2292", "submitter": "Neil Walton", "authors": "S. C. Borst, N. S. Walton, A. P. Zwart", "title": "Network iso-elasticity and weighted $\\alpha$-fairness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When a communication network's capacity increases, it is natural to want the\nbandwidth allocated to increase to exploit this capacity. But, if the same\nrelative capacity increase occurs at each network resource, it is also natural\nto want each user to see the same relative benefit, so the bandwidth allocated\nto each route should remain proportional. We will be interested in bandwidth\nallocations which scale in this \\textit{iso-elastic} manner and, also, maximize\na utility function.\n  Utility optimizing bandwidth allocations have been frequently studied, and a\npopular choice of utility function are the weighted $\\alpha$-fair utility\nfunctions introduced by Mo and Walrand \\cite{MoWa00}. Because weighted\n$\\alpha$-fair utility functions possess this iso-elastic property, they are\nfrequently used to form fluid models of bandwidth sharing networks. In this\npaper, we present results that show, in many settings, the only utility\nfunctions which are iso-elastic are weighted $\\alpha$-fair utility functions.\n  Thus, if bandwidth is allocated according to a network utility function which\nscales with relative network changes then that utility function must be a\nweighted $\\alpha$-fair utility function, and hence, a control protocol that is\nrobust to the future relative changes in network capacity and usage ought to\nallocate bandwidth inorder to maximize a weighted $\\alpha$-fair utility\nfunction.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 12:28:30 GMT"}], "update_date": "2012-01-12", "authors_parsed": [["Borst", "S. C.", ""], ["Walton", "N. S.", ""], ["Zwart", "A. P.", ""]]}, {"id": "1201.2387", "submitter": "Cedric Westphal", "authors": "Marie-Jose Montpetit, Cedric Westphal, Dirk Trossen", "title": "Network Coding Meets Information-Centric Networking", "comments": "6 pages, position paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The focus of user behavior in the Internet has changed over the recent years\ntowards being driven by exchanging and accessing information. Many advances in\nnetworking technologies have utilized this change by focusing on the content of\nan exchange rather than the endpoints exchanging the content. Network coding\nand information centric networking are two examples of these technology trends,\neach being developed largely independent so far. This paper brings these areas\ntogether in an evolutionary as well as explorative setting for a new\ninternetworking architecture. We outline opportunities for applying network\ncoding in a novel and performance-enhancing way that could eventually push\nforward the case for information centric network itself.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 19:58:30 GMT"}], "update_date": "2012-01-12", "authors_parsed": [["Montpetit", "Marie-Jose", ""], ["Westphal", "Cedric", ""], ["Trossen", "Dirk", ""]]}, {"id": "1201.2399", "submitter": "Vinaye Armoogum VA", "authors": "Sheeba Armoogum, Vinaye Armoogum and Jayprakash Gopaul", "title": "The Development of a LAN for DVB-T Transmission and DVB-S Reception with\n  Designed QAM Modulators and COFDM in the Island Mauritius", "comments": "20 pages, IJWMN journal paper; ISSN:0975-3834 (Online); 0975-4679\n  (Print)", "journal-ref": "International Journal of Wireless & Mobile Networks (IJWMN) Vol.\n  3, No. 6, December 2011, 71-90", "doi": "10.5121/ijwmn.2011.3606", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is a thorough study of a digital broadcasting system adapted to\nthe small mountainous island of Mauritius. A digital LAN was designed with\nMPEG-2 signals. The compressed signals were transmitted using DVB-T and QAM\nmodulators. QAM-16 and QAM-64 modulators were designed and tested with a\nsimulator under critical conditions of AWGN and phase noises. Results obtained\nfrom simulation have shown that Digital video broadcast with a single frequency\nnetwork (SFN) is possible in Mauritius with QAM-64 and QAM-16 modulators\napplying COFDM mode of transmission. However, this study has also shown that\nQAM-16 modulator had a better performance at low AWGN values (less than 12 dB)\nand can be adopted for Mauritius Island, provided that the number of\ntransmitted channels is not high enough.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 20:38:47 GMT"}], "update_date": "2012-01-12", "authors_parsed": [["Armoogum", "Sheeba", ""], ["Armoogum", "Vinaye", ""], ["Gopaul", "Jayprakash", ""]]}, {"id": "1201.2474", "submitter": "Yibei Ling", "authors": "Yibei Ling, Scott Alexander, Richard Lau", "title": "On Quantification of Anchor Placement", "comments": "infocom 1012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper attempts to answer a question: for a given traversal area, how to\nquantify the geometric impact of anchor placement on localization performance.\nWe present a theoretical framework for quantifying the anchor placement impact.\nAn experimental study, as well as the field test using a UWB ranging\ntechnology, is presented. These experimental results validate the theoretical\nanalysis. As a byproduct, we propose a two-phase localization method (TPLM) and\nshow that TPLM outperforms the least-square method in localization accuracy by\na huge margin. TPLM performs much faster than the gradient descent method and\nslightly better than the gradient descent method in localization accuracy. Our\nfield test suggests that TPLM is more robust against noise than the\nleast-square and gradient descent methods.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 04:20:46 GMT"}], "update_date": "2012-01-13", "authors_parsed": [["Ling", "Yibei", ""], ["Alexander", "Scott", ""], ["Lau", "Richard", ""]]}, {"id": "1201.2481", "submitter": "K Munivara Prasad", "authors": "K. Munivara Prasad, A. Rama Mohan Reddy, M. Ganesh Karthik", "title": "Flooding attacks to internet threat monitors (ITM): Modeling and counter\n  measures using botnet and honeypots", "comments": null, "journal-ref": "International Journal of Computer Science & Information Technology\n  (IJCSIT) Vol 3, No 6, Dec 2011, 159-172", "doi": "10.5121/ijcsit.2011.3612", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The Internet Threat Monitoring (ITM),is a globally scoped Internet monitoring\nsystem whose goal is to measure, detect, characterize, and track threats such\nas distribute denial of service(DDoS) attacks and worms. To block the\nmonitoring system in the internet the attackers are targeted the ITM system. In\nthis paper we address flooding attack against ITM system in which the attacker\nattempt to exhaust the network and ITM's resources, such as network bandwidth,\ncomputing power, or operating system data structures by sending the malicious\ntraffic. We propose an information-theoretic frame work that models the\nflooding attacks using Botnet on ITM. Based on this model we generalize the\nflooding attacks and propose an effective attack detection using Honeypots.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 06:07:03 GMT"}], "update_date": "2012-01-13", "authors_parsed": [["Prasad", "K. Munivara", ""], ["Reddy", "A. Rama Mohan", ""], ["Karthik", "M. Ganesh", ""]]}, {"id": "1201.2575", "submitter": "Sung-eok Jeon", "authors": "Sung-eok Jeon, and Chuanyi Ji", "title": "Joint Approximation of Information and Distributed Link-Scheduling\n  Decisions in Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a large multi-hop wireless network, nodes are preferable to make\ndistributed and localized link-scheduling decisions with only interactions\namong a small number of neighbors. However, for a slowly decaying channel and\ndensely populated interferers, a small size neighborhood often results in\nnontrivial link outages and is thus insufficient for making optimal scheduling\ndecisions. A question arises how to deal with the information outside a\nneighborhood in distributed link-scheduling. In this work, we develop joint\napproximation of information and distributed link scheduling. We first apply\nmachine learning approaches to model distributed link-scheduling with complete\ninformation. We then characterize the information outside a neighborhood in\nform of residual interference as a random loss variable. The loss variable is\nfurther characterized by either a Mean Field approximation or a normal\ndistribution based on the Lyapunov central limit theorem. The approximated\ninformation outside a neighborhood is incorporated in a factor graph. This\nresults in joint approximation and distributed link-scheduling in an iterative\nfashion. Link-scheduling decisions are first made at each individual node based\non the approximated loss variables. Loss variables are then updated and used\nfor next link-scheduling decisions. The algorithm repeats between these two\nphases until convergence. Interactive iterations among these variables are\nimplemented with a message-passing algorithm over a factor graph. Simulation\nresults show that using learned information outside a neighborhood jointly with\ndistributed link-scheduling reduces the outage probability close to zero even\nfor a small neighborhood.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 14:28:23 GMT"}, {"version": "v2", "created": "Sun, 4 Mar 2012 23:06:41 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Jeon", "Sung-eok", ""], ["Ji", "Chuanyi", ""]]}, {"id": "1201.2657", "submitter": "Frank Li", "authors": "Frank Li, Prateek Mittal, Matthew Caesar and Nikita Borisov", "title": "SybilControl: Practical Sybil Defense with Computational Puzzles", "comments": "11 pages, submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many distributed systems are subject to the Sybil attack, where an adversary\nsubverts system operation by emulating behavior of multiple distinct nodes.\nMost recent work to address this problem leverages social networks to establish\ntrust relationships between users. However, the use of social networks is not\nappropriate in all systems, as they can be subverted by social engineering\ntechniques, require nodes in a P2P network to maintain and be aware of social\nnetwork information, and may require overly optimistic assumptions about the\nfast-mixing nature of social links.\n  This paper explores an alternate approach. We present SybilControl, a novel,\ndecentralized scheme for controlling the extent of Sybil attacks. SybilControl\nis an admission control mechanism for nodes in a distributed system that\nrequires them to periodically solve computational puzzles. SybilControl\nconsists of a distributed protocol to allow nodes to collectively verify the\ncomputational work of other nodes, and mechanisms to prevent the malicious\ninfluence of misbehaving nodes that do not perform the computational work. We\ninvestigate the practical issues involved with deploying SybilControl into\nexisting DHTs, particularly with resilient lookup protocols. We evaluate\nSybilControl through simulations and find that SybilControl retains low\noverhead and latency. Additionally, even when the adversary controls 20% of the\nsystem's computational resources, SybilControl-enabled DHTs can be configured\nto maintain lookup performance at over 99% success rate using low communication\noverhead.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 19:58:00 GMT"}, {"version": "v2", "created": "Fri, 13 Jan 2012 06:49:07 GMT"}], "update_date": "2012-01-16", "authors_parsed": [["Li", "Frank", ""], ["Mittal", "Prateek", ""], ["Caesar", "Matthew", ""], ["Borisov", "Nikita", ""]]}, {"id": "1201.2703", "submitter": "Rachit Agarwal", "authors": "Rachit Agarwal, P. Brighten Godfrey, Sariel Har-Peled", "title": "Faster Approximate Distance Queries and Compact Routing in Sparse Graphs", "comments": "20 pages, an earlier version appeared in INFOCOM 2011, this version\n  presents data structures with improved space/query-time trade-off", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A distance oracle is a compact representation of the shortest distance matrix\nof a graph. It can be queried to approximate shortest paths between any pair of\nvertices. Any distance oracle that returns paths of worst-case stretch (2k-1)\nmust require space $\\Omega(n^{1 + 1/k})$ for graphs of n nodes. The hard cases\nthat enforce this lower bound are, however, rather dense graphs with average\ndegree \\Omega(n^{1/k}).\n  We present distance oracles that, for sparse graphs, substantially break the\nlower bound barrier at the expense of higher query time. For any 1 \\leq \\alpha\n\\leq n, our distance oracles can return stretch 2 paths using O(m + n^2/\\alpha)\nspace and stretch 3 paths using O(m + n^2/\\alpha^2) space, at the expense of\nO(\\alpha m/n) query time. By setting appropriate values of \\alpha, we get the\nfirst distance oracles that have size linear in the size of the graph, and\nreturn constant stretch paths in non-trivial query time. The query time can be\nfurther reduced to O(\\alpha), by using an additional O(m \\alpha) space for all\nour distance oracles, or at the cost of a small constant additive stretch.\n  We use our stretch 2 distance oracle to present the first compact routing\nscheme with worst-case stretch 2. Any compact routing scheme with stretch less\nthan 2 must require linear memory at some nodes even for sparse graphs; our\nscheme, hence, achieves the optimal stretch with non-trivial memory\nrequirements. Moreover, supported by large-scale simulations on graphs\nincluding the AS-level Internet graph, we argue that our stretch-2 scheme would\nbe simple and efficient to implement as a distributed compact routing protocol.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 23:03:18 GMT"}], "update_date": "2012-01-16", "authors_parsed": [["Agarwal", "Rachit", ""], ["Godfrey", "P. Brighten", ""], ["Har-Peled", "Sariel", ""]]}, {"id": "1201.2760", "submitter": "Karim Habak", "authors": "Karim Habak, Moustafa Youssef and Khaled A. Harras", "title": "DBAS: A Deployable Bandwidth Aggregation System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The explosive increase in data demand coupled with the rapid deployment of\nvarious wireless access technologies have led to the increase of number of\nmulti-homed or multi-interface enabled devices. Fully exploiting these\ninterfaces has motivated researchers to propose numerous solutions that\naggregate their available bandwidths to increase overall throughput and satisfy\nthe end-user's growing data demand. These solutions, however, have faced a\nsteep deployment barrier that we attempt to overcome in this paper. We propose\na Deployable Bandwidth Aggregation System (DBAS) for multi-interface enabled\ndevices. Our system does not introduce any intermediate hardware, modify\ncurrent operating systems, modify socket implementations, nor require changes\nto current applications or legacy servers. The DBAS architecture is designed to\nautomatically estimate the characteristics of applications and dynamically\nschedule various connections or packets to different interfaces. Since our main\nfocus is deployability, we fully implement DBAS on the Windows operating system\nand evaluate various modes of operation. Our implementation and simulation\nresults show that DBAS achieves throughput gains up to 193% compared to current\noperating systems, while operating as an out-of-the-box standard Windows\nexecutable, highlighting its deployability and ease of use.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jan 2012 07:49:44 GMT"}], "update_date": "2012-01-16", "authors_parsed": [["Habak", "Karim", ""], ["Youssef", "Moustafa", ""], ["Harras", "Khaled A.", ""]]}, {"id": "1201.2937", "submitter": "Wael Jaafar", "authors": "Wael Jaafar, Wessam Ajib, David Haccoun", "title": "Opportunistic Adaptive Relaying in Cognitive Radio Networks", "comments": "5 pages, 4 figures. Accepted for publication in Proc. IEEE\n  International Communications Conference (ICC), Ottawa (ON), Canada, June 2012", "journal-ref": null, "doi": "10.1109/ICC.2012.6364211", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Combining cognitive radio technology with user cooperation could be\nadvantageous to both primary and secondary transmissions. In this paper, we\npropose a first relaying scheme for cognitive radio networks (called \"Adaptive\nrelaying scheme 1\"), where one relay node can assist the primary or the\nsecondary transmission with the objective of improving the outage probability\nof the secondary transmission with respect to a primary outage probability\nthreshold. Upper bound expressions of the secondary outage probability using\nthe proposed scheme are derived over Rayleigh fading channels. Numerical and\nsimulation results show that the secondary outage probability using the\nproposed scheme is lower than that of other relaying schemes. Then, we extend\nthe proposed scheme to the case where the relay node has the ability to decode\nboth the primary and secondary signals and also can assist simultaneously both\ntransmissions. Simulations show the performance improvement that can be\nobtained due to this extension in terms of secondary outage probability.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jan 2012 18:17:41 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Jaafar", "Wael", ""], ["Ajib", "Wessam", ""], ["Haccoun", "David", ""]]}, {"id": "1201.3001", "submitter": "Rachit Srivastava", "authors": "Rachit Srivastava and Anurag Kumar", "title": "Performance Analysis of Beacon-Less IEEE 802.15.4 Multi-Hop Networks", "comments": "Appeared in The Fourth International Conference on COMmunication\n  Systems and NETworkS (COMSNETS), Bangalore, India, 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an approximate analytical technique for evaluating the performance\nof multi-hop networks based on beacon-less CSMA/CA as standardised in IEEE\n802.15.4, a popular standard for wireless sensor networks. The network\ncomprises sensor nodes, which generate measurement packets, and relay nodes\nwhich only forward packets. We consider a detailed stochastic process at each\nnode, and analyse this process taking into account the interaction with\nneighbouring nodes via certain unknown variables (e.g., channel sensing rates,\ncollision probabilities, etc.). By coupling these analyses of the various\nnodes, we obtain fixed point equations that can be solved numerically to obtain\nthe unknown variables, thereby yielding approximations of time average\nperformance measures, such as packet discard probabilities and average queueing\ndelays. Different analyses arise for networks with no hidden nodes and networks\nwith hidden nodes. We apply this approach to the performance analysis of tree\nnetworks rooted at a data sink. Finally, we provide a validation of our\nanalysis technique against simulations.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jan 2012 09:04:22 GMT"}], "update_date": "2012-01-17", "authors_parsed": [["Srivastava", "Rachit", ""], ["Kumar", "Anurag", ""]]}, {"id": "1201.3059", "submitter": "Feng Wang", "authors": "Feng Wang, Jianwei Huang, and Yuping Zhao", "title": "Delay Sensitive Communications over Cognitive Radio Networks", "comments": "11 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Supporting the quality of service of unlicensed users in cognitive radio\nnetworks is very challenging, mainly due to dynamic resource availability\nbecause of the licensed users' activities. In this paper, we study the optimal\nadmission control and channel allocation decisions in cognitive overlay\nnetworks in order to support delay sensitive communications of unlicensed\nusers. We formulate it as a Markov decision process problem, and solve it by\ntransforming the original formulation into a stochastic shortest path problem.\nWe then propose a simple heuristic control policy, which includes a\nthreshold-based admission control scheme and and a largest-delay-first channel\nallocation scheme, and prove the optimality of the largest-delay-first channel\nallocation scheme. We further propose an improved policy using the rollout\nalgorithm. By comparing the performance of both proposed policies with the\nupper-bound of the maximum revenue, we show that our policies achieve\nclose-to-optimal performance with low complexities.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jan 2012 05:41:19 GMT"}], "update_date": "2012-01-17", "authors_parsed": [["Wang", "Feng", ""], ["Huang", "Jianwei", ""], ["Zhao", "Yuping", ""]]}, {"id": "1201.3066", "submitter": "Sungsu Lim", "authors": "Sungsu Lim, Kyomin Jung, Matthew Andrews", "title": "Stability of the Max-Weight Protocol in Adversarial Wireless Networks", "comments": "Accepted by IEEE INFOCOM 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider the Max-Weight protocol for routing and scheduling\nin wireless networks under an adversarial model. This protocol has received a\nsignificant amount of attention dating back to the papers of Tassiulas and\nEphremides. In particular, this protocol is known to be throughput-optimal\nwhenever the traffic patterns and propagation conditions are governed by a\nstationary stochastic process.\n  However, the standard proof of throughput optimality (which is based on the\nnegative drift of a quadratic potential function) does not hold when the\ntraffic patterns and the edge capacity changes over time are governed by an\narbitrary adversarial process. Such an environment appears frequently in many\npractical wireless scenarios when the assumption that channel conditions are\ngoverned by a stationary stochastic process does not readily apply.\n  In this paper we prove that even in the above adversarial setting, the\nMax-Weight protocol keeps the queues in the network stable (i.e. keeps the\nqueue sizes bounded) whenever this is feasible by some routing and scheduling\nalgorithm. However, the proof is somewhat more complex than the negative\npotential drift argument that applied in the stationary case. Our proof holds\nfor any arbitrary interference relationships among edges. We also prove the\nstability of $\\ep$-approximate Max-Weight under the adversarial model. We\nconclude the paper with a discussion of queue sizes in the adversarial model as\nwell as a set of simulation results.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jan 2012 07:58:34 GMT"}], "update_date": "2012-01-17", "authors_parsed": [["Lim", "Sungsu", ""], ["Jung", "Kyomin", ""], ["Andrews", "Matthew", ""]]}, {"id": "1201.3073", "submitter": "Sylvain Martin", "authors": "Sylvain Martin, Laurent Chiarello, Guy Leduc", "title": "DISco: a Distributed Information Store for network Challenges and their\n  Outcome", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present DISco, a storage and communication middleware designed to enable\ndistributed and task-centric autonomic control of networks.\n  DISco is designed to enable multi-agent identification of anomalous\nsituations -- so-called \"challenges\" -- and assist coordinated remediation that\nmaintains degraded -- but acceptable -- service level, while keeping a track of\nthe challenge evolution in order to enable human-assisted diagnosis of flaws in\nthe network. We propose to use state-of-art peer-to-peer publish/subscribe and\ndistributed storage as core building blocks for the DISco service.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jan 2012 09:37:08 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Martin", "Sylvain", ""], ["Chiarello", "Laurent", ""], ["Leduc", "Guy", ""]]}, {"id": "1201.3095", "submitter": "Savvas Gitzenis", "authors": "S. Gitzenis, G. S. Paschos, L. Tassiulas", "title": "Asymptotic Laws for Joint Content Replication and Delivery in Wireless\n  Networks", "comments": null, "journal-ref": null, "doi": "10.1109/TIT.2012.2235905", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate on the scalability of multihop wireless communications, a\nmajor concern in networking, for the case that users access content replicated\nacross the nodes. In contrast to the standard paradigm of randomly selected\ncommunicating pairs, content replication is efficient for certain regimes of\nfile popularity, cache and network size. Our study begins with the detailed\njoint content replication and delivery problem on a 2D square grid, a hard\ncombinatorial optimization. This is reduced to a simpler problem based on\nreplication density, whose performance is of the same order as the original.\nAssuming a Zipf popularity law, and letting the size of content and network\nboth go to infinity, we identify the scaling laws and regimes of the required\nlink capacity, ranging from O(\\sqrt{N}) down to O(1).\n", "versions": [{"version": "v1", "created": "Sun, 15 Jan 2012 15:17:20 GMT"}, {"version": "v2", "created": "Tue, 8 Jan 2013 17:24:56 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Gitzenis", "S.", ""], ["Paschos", "G. S.", ""], ["Tassiulas", "L.", ""]]}, {"id": "1201.3215", "submitter": "Akash Baid", "authors": "Akash Baid, Ritesh Madan, Ashwin Sampath", "title": "Delay Estimation and Fast Iterative Scheduling Policies for LTE Uplink", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the allocation of spectral and power resources to the mobiles\n(i.e., user equipment (UE)) in a cell every subframe (1 ms) for the Long Term\nEvolution (LTE) orthogonal frequency division multiple access (OFDMA) cellular\nnetwork. To enable scheduling based on packet delays, we design a novel\nmechanism for inferring the packet delays approximately from the buffer status\nreports (BSR) transmitted by the UEs; the BSR reports only contain queue length\ninformation. We then consider a constrained optimization problem with a concave\nobjective function - schedulers such as those based on utility maximization,\nmaximum weight scheduling, and recent results on iterative scheduling for small\nqueue/delay follow as special cases. In particular, the construction of the\nnon-differentiable objective function based on packet delays is novel. We model\nconstraints on bandwidth, peak transmit power at the UE, and the transmit power\nspectral density (PSD) at the UE due to fractional power control. When\nfrequency diversity doesn't exist or is not exploited at a fast time-scale, we\nuse subgradient analysis to construct an O(N log L) (per iteration with small\nnumber of iterations) algorithm to compute the optimal resource allocation for\nN users and L points of non-differentiability in the objective function. For a\nfrequency diversity scheduler with M sub-bands, the corre- sponding complexity\nper iteration is essentially O(N(M^2+L^2)). Unlike previous iterative policies\nbased on delay/queue, in our approach the complexity of scheduling can be\nreduced when the coherence bandwidth is larger. Through detailed system\nsimulations (based on NGMN and 3GPP evaluation methodology) which model H-ARQ,\nfinite resource grants per sub-frame, deployment, realistic traffic, power\nlimitations, interference, and channel fading, we demonstrate the effectiveness\nof our schemes for LTE.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2012 11:17:26 GMT"}], "update_date": "2012-01-17", "authors_parsed": [["Baid", "Akash", ""], ["Madan", "Ritesh", ""], ["Sampath", "Ashwin", ""]]}, {"id": "1201.3318", "submitter": "Marcin Kik", "authors": "Marcin Kik", "title": "Notes on Bit-reversal Broadcast Scheduling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This report contains revision and extension of some results about RBO\n[arXiv:1108.5095]. RBO is a simple and efficient broadcast scheduling of $n =\n2^k$ uniform frames for battery powered radio receivers. Each frame contains a\nkey from some arbitrary linearly ordered universe. The broadcast cycle -- a\nsequence of frames sorted by the keys and permuted by $k$-bit reversal -- is\ntransmitted in a round robin fashion by the broadcaster. At arbitrary time\nduring the transmission, the receiver may start a simple protocol that reports\nto him all the frames with the keys that are contained in a specified interval\nof the key values $[K', K\"]$. RBO receives at most $2 k + 1$ other frames' keys\nbefore receiving the first key from $[K', K\"]$ or noticing that there are no\nsuch keys in the broadcast cycle. As a simple corollary, $4 k + 2$ is upper\nbound the number of keys outside $[K', K\"]$ that will ever be received. In\nunreliable network the expected number of efforts to receive such frames is\nbounded by $(8 k + 4) / p + 2 (1 - p) / p^2$, where $p$ is probability of\nsuccessful reception, and the reception rate of the requested frames is $p$ --\nthe highest possible. The receiver's protocol state consists of the values $k$,\n$K'$ and $K\"$, one wake-up timer and two other $k$-bit variables. Its only\nnontrivial computation -- the computation of the next wake-up time slot -- can\nbe performed in $O (k)$ simple operations, such as arithmetic/bit-wise\noperations on $k$-bit numbers, using only constant number of $k$-bit variables.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2012 16:56:45 GMT"}], "update_date": "2012-01-17", "authors_parsed": [["Kik", "Marcin", ""]]}, {"id": "1201.3480", "submitter": "Ingo Scholtes", "authors": "Ingo Scholtes and Claudio Juan Tessone", "title": "Organic Design of Massively Distributed Systems: A Complex Networks\n  Perspective", "comments": "17 pages, 14 figures, preprint of submission to Informatik-Spektrum\n  published by Springer", "journal-ref": "Informatik-Spektrum, Volume 35, Number 2 (2012), 75-86", "doi": "10.1007/s00287-012-0597-4", "report-no": null, "categories": "cs.NI cond-mat.stat-mech physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The vision of Organic Computing addresses challenges that arise in the design\nof future information systems that are comprised of numerous, heterogeneous,\nresource-constrained and error-prone components or devices. Here, the notion\norganic particularly highlights the idea that, in order to be manageable, such\nsystems should exhibit self-organization, self-adaptation and self-healing\ncharacteristics similar to those of biological systems. In recent years, the\nprinciples underlying many of the interesting characteristics of natural\nsystems have been investigated from the perspective of complex systems science,\nparticularly using the conceptual framework of statistical physics and\nstatistical mechanics. In this article, we review some of the interesting\nrelations between statistical physics and networked systems and discuss\napplications in the engineering of organic networked computing systems with\npredictable, quantifiable and controllable self-* properties.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jan 2012 10:57:31 GMT"}], "update_date": "2012-04-26", "authors_parsed": [["Scholtes", "Ingo", ""], ["Tessone", "Claudio Juan", ""]]}, {"id": "1201.3723", "submitter": "Premkumar Karumbu", "authors": "Premkumar Karumbu, Xiaomin Chen, Douglas Leith", "title": "Proportional Fair Coding for Wireless Mesh Networks", "comments": "Submitted to IEEE/ACM Transactions on Networking (December 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider multi--hop wireless networks carrying unicast flows for multiple\nusers. Each flow has a specified delay deadline, and the lossy wireless links\nare modelled as binary symmetric channels (BSCs). Since transmission time, also\ncalled airtime, on the links is shared amongst flows, increasing the airtime\nfor one flow comes at the cost of reducing the airtime available to other flows\nsharing the same link. We derive the joint allocation of flow airtimes and\ncoding rates that achieves the proportionally fair throughput allocation. This\nutility optimisation problem is non--convex, and one of the technical\ncontributions of this paper is to show that the proportional fair utility\noptimisation can nevertheless be decomposed into a sequence of convex\noptimisation problems. The solution to this sequence of convex problems is the\nunique solution to the original non--convex optimisation. Surprisingly, this\nsolution can be written in an explicit form that yields considerable insight\ninto the nature of the proportional fair joint airtime/coding rate allocation.\nTo our knowledge, this is the first time that the utility fair joint allocation\nof airtime/coding rate has been analysed, and also, one of the first times that\nutility fairness with delay deadlines has been considered.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 08:48:48 GMT"}], "update_date": "2012-01-19", "authors_parsed": [["Karumbu", "Premkumar", ""], ["Chen", "Xiaomin", ""], ["Leith", "Douglas", ""]]}, {"id": "1201.3782", "submitter": "Abeer Ghandar", "authors": "Abeer Ghandar, Eman Shabaan and Zaky Taha Fayed", "title": "Performance Analysis of Observation Based Cooperation Enforcement in Ad\n  Hoc Networks", "comments": null, "journal-ref": "International Journal of Computer Science Issues (IJCSI), Vol. 8,\n  Issue 6, No 2, pp. 79-85, November 2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Node misbehavior due to selfish or malicious behavior could significantly\ndegrade the performance of MANET because most existing routing protocols in\nMANET aim to find the most efficient path. Overhearing and reputation based\ncooperation schemes have been used to detect and isolate the misbehaving nodes\nas well as to force them to cooperate. Performance analysis has been done for\nthe network traffic using OCEAN over DSR on ns2 while considering the low\nenergy levels for mobile nodes. Throughput, energy level, routing packets and\nnormalized routing overhead are analyzed for OCEAN and normal DSR to show the\nimpact of OCEAN on the overall network performance.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 13:31:45 GMT"}], "update_date": "2012-01-19", "authors_parsed": [["Ghandar", "Abeer", ""], ["Shabaan", "Eman", ""], ["Fayed", "Zaky Taha", ""]]}, {"id": "1201.3869", "submitter": "Narayan Prasad", "authors": "Narayan Prasad, Honghai Zhang, Hao Zhu and Sampath Rangarajan", "title": "Multi-User Scheduling in the 3GPP LTE Cellular Uplink", "comments": "To appear, IEEE Transactions on Mobile Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider resource allocation in the 3GPP Long Term\nEvolution (LTE) cellular uplink, which will be the most widely deployed next\ngeneration cellular uplink. The key features of the 3GPP LTE uplink (UL) are\nthat it is based on a modified form of the orthogonal frequency division\nmultiplexing based multiple access (OFDMA) which enables channel dependent\nfrequency selective scheduling, and that it allows for multi-user (MU)\nscheduling wherein multiple users can be assigned the same time-frequency\nresource. In addition to the considerable spectral efficiency improvements that\nare possible by exploiting these two features, the LTE UL allows for transmit\nantenna selection together with the possibility to employ advanced receivers at\nthe base-station, which promise further gains. However, several practical\nconstraints that seek to maintain a low signaling overhead, are also imposed.\nIn this paper, we show that the resulting resource allocation problem is\nAPX-hard and then propose a local ratio test (LRT) based constant-factor\npolynomial-time approximation algorithm. We then propose two enhancements to\nthis algorithm as well as a sequential LRT based MU scheduling algorithm that\noffers a constant-factor approximation and is another useful choice in the\ncomplexity versus performance tradeoff. Further, user pre-selection, wherein a\nsmaller pool of good users is pre-selected and a sophisticated scheduling\nalgorithm is then employed on the selected pool, is also examined. We suggest\nseveral such user pre-selection algorithms, some of which are shown to offer\nconstant-factor approximations to the pre-selection problem. Detailed\nevaluations reveal that the proposed algorithms and their enhancements offer\nsignificant gains.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 18:13:36 GMT"}, {"version": "v2", "created": "Thu, 12 Apr 2012 16:27:02 GMT"}, {"version": "v3", "created": "Fri, 29 Nov 2013 20:06:21 GMT"}], "update_date": "2013-12-02", "authors_parsed": [["Prasad", "Narayan", ""], ["Zhang", "Honghai", ""], ["Zhu", "Hao", ""], ["Rangarajan", "Sampath", ""]]}, {"id": "1201.3950", "submitter": "Koulali Mohammed-Amine", "authors": "Mohammed-Amine Koulali, Mohammed El Koutbi, Abdellatif Kobbane and\n  Mostafa Azizi", "title": "QGRP: A Novel QoS-Geographic Routing Protocol for Multimedia Wireless\n  Sensor Networks", "comments": "ISSN (Online): 1694-0814", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 6, No 2, pages 55-61, 2011", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Thanks to the potential they hold and the variety of their application\ndomains, Multimedia Wireless Sensor Networks (MWSN) are forecast to become\nhighly integrated into our daily activities. Due to the carried content nature,\nmainly composed of images and/or video streams with high throughput and delay\nconstraints, Quality of Service in the context of MWSN is a crucial issue. In\nthis paper, we propose a QoS and energy aware geographic routing protocol for\nMWSN: QGRP. The proposed protocol addresses bandwidth, delay and energy\nconstraints associated with MWSN. QGRP adopts an analytical model of IEEE\n802.11 Distributed Coordination Function (DCF) to estimate available bandwidth\nand generates loop-free routing paths.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 00:20:48 GMT"}], "update_date": "2012-01-20", "authors_parsed": [["Koulali", "Mohammed-Amine", ""], ["Koutbi", "Mohammed El", ""], ["Kobbane", "Abdellatif", ""], ["Azizi", "Mostafa", ""]]}, {"id": "1201.3960", "submitter": "Jung Ryu", "authors": "Jung Ryu", "title": "Congestion Control and Routing over Challenged Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This dissertation is a study on the design and analysis of novel, optimal\nrouting and rate control algorithms in wireless, mobile communication networks.\nCongestion control and routing algorithms upto now have been designed and\noptimized for wired or wireless mesh networks. In those networks, optimal\nalgorithms (optimal in the sense that either the throughput is maximized or\ndelay is minimized, or the network operation cost is minimized) can be\nengineered based on the classic time scale decomposition assumption that the\ndynamics of the network are either fast enough so that these algorithms\nessentially see the average or slow enough that any changes can be tracked to\nallow the algorithms to adapt over time. However, as technological advancements\nenable integration of ever more mobile nodes into communication networks, any\nrate control or routing algorithms based, for example, on averaging out the\ncapacity of the wireless mobile link or tracking the instantaneous capacity\nwill perform poorly. The common element in our solution to engineering\nefficient routing and rate control algorithms for mobile wireless networks is\nto make the wireless mobile links seem as if they are wired or wireless links\nto all but few nodes that directly see the mobile links (either the mobiles or\nnodes that can transmit to or receive from the mobiles) through an appropriate\nuse of queuing structures at these selected nodes. This approach allows us to\ndesign end-to-end rate control or routing algorithms for wireless mobile\nnetworks so that neither averaging nor instantaneous tracking is necessary.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 01:46:17 GMT"}], "update_date": "2012-01-20", "authors_parsed": [["Ryu", "Jung", ""]]}, {"id": "1201.4013", "submitter": "Justin Coon", "authors": "Justin P. Coon, Carl P. Dettmann, and Orestis Georgiou", "title": "Connectivity of Confined Dense Networks: Boundary Effects and Scaling\n  Laws", "comments": "21 pages, 6 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the probability that a dense network confined within\na given geometry is fully connected. We employ a cluster expansion approach\noften used in statistical physics to analyze the effects that the boundaries of\nthe geometry have on connectivity. To maximize practicality and applicability,\nwe adopt four important point-to-point link models based on outage probability\nin our analysis: single-input single-output (SISO), single-input\nmultiple-output (SIMO), multiple-input single-output (MISO), and multiple-input\nmultiple-output (MIMO). Furthermore, we derive diversity and power scaling laws\nthat dictate how boundary effects can be mitigated (to leading order) in\nconfined dense networks for each of these models. Finally, in order to\ndemonstrate the versatility of our theory, we analyze boundary effects for\ndense networks comprising MIMO point-to-point links confined within a right\nprism, a polyhedron that accurately models many geometries that can be found in\npractice. We provide numerical results for this example, which verify our\nanalytical results.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 10:38:58 GMT"}], "update_date": "2012-01-20", "authors_parsed": [["Coon", "Justin P.", ""], ["Dettmann", "Carl P.", ""], ["Georgiou", "Orestis", ""]]}, {"id": "1201.4116", "submitter": "Di Yuan Ph.D.", "authors": "Iana Siomina and Di Yuan", "title": "Analysis of Cell Load Coupling for LTE Network Planning and Optimization", "comments": "The paper contains 22 pages with 9 figures. The paper is submitted to\n  IEEE Transactions on Wireless Communications. This is the version in Jan 2012\n  after one revision", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  System-centric modeling and analysis are of key significance in planning and\noptimizing cellular networks. In this paper, we provide a mathematical analysis\nof performance modeling for LTE networks. The system model characterizes the\ncoupling relation between the cell load factors, taking into account\nnon-uniform traffic demand and interference between the cells with arbitrary\nnetwork topology. Solving the model enables a network-wide performance\nevaluation in resource consumption. We develop and prove both sufficient and\nnecessary conditions for the feasibility of the load-coupling system, and\nprovide results related to computational aspects for numerically approaching\nthe solution. The theoretical findings are accompanied with experimental\nresults to instructively illustrate the application in optimizing LTE network\nconfiguration.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 17:34:01 GMT"}], "update_date": "2012-01-20", "authors_parsed": [["Siomina", "Iana", ""], ["Yuan", "Di", ""]]}, {"id": "1201.4150", "submitter": "Philippe Nain", "authors": "Konstantin Avrachenkov (INRIA Sophia Antipolis), Alexander Dudin,\n  Valentina Klimenok, Philippe Nain (INRIA Sophia Antipolis), Olga Semenova", "title": "Optimal Threshold Control by the Robots of Web Search Engines with\n  Obsolescence of Documents", "comments": null, "journal-ref": "Computer Networks 55, 8 (2011) 1880-1893", "doi": "10.1016/j.comnet.2011.01.013", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A typical web search engine consists of three principal parts: crawling\nengine, indexing engine, and searching engine. The present work aims to\noptimize the performance of the crawling engine. The crawling engine finds new\nweb pages and updates web pages existing in the database of the web search\nengine. The crawling engine has several robots collecting information from the\nInternet. We first calculate various performance measures of the system (e.g.,\nprobability of arbitrary page loss due to the buffer overflow, probability of\nstarvation of the system, the average time waiting in the buffer). Intuitively,\nwe would like to avoid system starvation and at the same time to minimize the\ninformation loss. We formulate the problem as a multi-criteria optimization\nproblem and attributing a weight to each criterion. We solve it in the class of\nthreshold policies. We consider a very general web page arrival process modeled\nby Batch Marked Markov Arrival Process and a very general service time modeled\nby Phase-type distribution. The model has been applied to the performance\nevaluation and optimization of the crawler designed by INRIA Maestro team in\nthe framework of the RIAM INRIA-Canon research project.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 19:19:30 GMT"}], "update_date": "2012-01-20", "authors_parsed": [["Avrachenkov", "Konstantin", "", "INRIA Sophia Antipolis"], ["Dudin", "Alexander", "", "INRIA Sophia Antipolis"], ["Klimenok", "Valentina", "", "INRIA Sophia Antipolis"], ["Nain", "Philippe", "", "INRIA Sophia Antipolis"], ["Semenova", "Olga", ""]]}, {"id": "1201.4197", "submitter": "Carlee Joe-Wong", "authors": "Soumya Sen, Carlee Joe-Wong, Sangtae Ha, Mung Chiang", "title": "A Survey of Smart Data Pricing: Past Proposals, Current Plans, and\n  Future Trends", "comments": null, "journal-ref": "ACM Computing Surveys, Vol. 146, No. 2, June 2014", "doi": null, "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditionally, network operators have used simple flat-rate broadband data\nplans for both wired and wireless network access. But today, with the\npopularity of mobile devices and exponential growth of apps, videos, and\nclouds, service providers are gradually moving towards more sophisticated\npricing schemes. This decade will therefore likely witness a major change in\nthe ways in which network resources are managed, and the role of economics in\nallocating these resources. This survey reviews some of the well-known past\nbroadband pricing proposals (both static and dynamic), including their current\nrealizations in various consumer data plans around the world, and discusses\nseveral research problems and open questions. By exploring the benefits and\nchallenges of pricing data, this paper attempts to facilitate both the\nindustrial and the academic communities' efforts in understanding the existing\nliterature, recognizing new trends, and shaping an appropriate and timely\nresearch agenda.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jan 2012 01:24:09 GMT"}, {"version": "v2", "created": "Thu, 15 Mar 2012 22:07:35 GMT"}, {"version": "v3", "created": "Fri, 13 Jul 2012 04:58:11 GMT"}, {"version": "v4", "created": "Sat, 28 Sep 2013 21:20:06 GMT"}], "update_date": "2013-10-01", "authors_parsed": [["Sen", "Soumya", ""], ["Joe-Wong", "Carlee", ""], ["Ha", "Sangtae", ""], ["Chiang", "Mung", ""]]}, {"id": "1201.4292", "submitter": "John Whitbeck", "authors": "John Whitbeck, Yoann Lopez, Jeremie Leguay, Vania Conan, Marcelo Dias\n  de Amorim", "title": "Push-and-Track: Saving Infrastructure Bandwidth Through Opportunistic\n  Forwarding", "comments": "Accepted for publication in the Pervasive and Mobile Computing\n  journal", "journal-ref": null, "doi": "10.1016/j.pmcj.2012.02.001", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Major wireless operators are nowadays facing network capacity issues in\nstriving to meet the growing demands of mobile users. At the same time,\n3G-enabled devices increasingly benefit from ad hoc radio connectivity (e.g.,\nWi-Fi). In this context of hybrid connectivity, we propose Push-and-track, a\ncontent dissemina- tion framework that harnesses ad hoc communication\nopportunities to minimize the load on the wireless infrastructure while\nguaranteeing tight delivery delays. It achieves this through a control loop\nthat collects user-sent acknowledgements to determine if new copies need to be\nreinjected into the network through the 3G interface. Push-and-Track is\nflexible and can be applied to a variety of scenarios, including periodic\nmessage flooding and floating data. For the former, this paper examines\nmultiple strategies to determine how many copies of the content should be\ninjected, when, and to whom; for the latter, it examines the achievable offload\nratio depending on the freshness constraints. The short delay-tolerance of\ncommon content, such as news or road traffic updates, make them suitable for\nsuch a system. Use cases with a long delay-tolerance, such as software updates,\nare an even better fit. Based on a realistic large-scale vehicular dataset from\nthe city of Bologna composed of more than 10,000 vehicles, we demonstrate that\nPush-and-Track consistently meets its delivery objectives while reducing the\nuse of the 3G network by about 90%.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jan 2012 13:53:37 GMT"}, {"version": "v2", "created": "Tue, 7 Feb 2012 10:26:19 GMT"}, {"version": "v3", "created": "Sat, 18 Feb 2012 14:15:51 GMT"}], "update_date": "2012-02-21", "authors_parsed": [["Whitbeck", "John", ""], ["Lopez", "Yoann", ""], ["Leguay", "Jeremie", ""], ["Conan", "Vania", ""], ["de Amorim", "Marcelo Dias", ""]]}, {"id": "1201.4301", "submitter": "Chitra Kiran N", "authors": "Chitra Kiran N., G. Narendra Kumar", "title": "A Robust Client Verification in cloud enabled m-Commerce using Gaining\n  Protocol", "comments": null, "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 6, No 2, November 2011 ISSN (Online): 1694-0814", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The proposed system highlights a novel approach of exclusive verification\nprocess using gain protocol for ensuring security among both the parties\n(client-service provider) in m-commerce application with cloud enabled service.\nThe proposed system is based on the potential to verify the clients with\ntrusted hand held device depending on the set of frequent events and actions to\nbe carried out. The framework of the proposed work is design after collecting a\nreal time data sets from an android enabled hand set, which when subjected to\ngain protocol, will result in detection of malicious behavior of illegal\nclients in the network. The real time experiment is performed with applicable\ndatasets gather, which show the best result for identifying threats from last 2\nmonths data collected.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jan 2012 14:21:15 GMT"}], "update_date": "2012-01-23", "authors_parsed": [["N.", "Chitra Kiran", ""], ["Kumar", "G. Narendra", ""]]}, {"id": "1201.4376", "submitter": "Emiliano De Cristofaro", "authors": "Emiliano De Cristofaro and Claudio Soriente", "title": "Participatory Privacy: Enabling Privacy in Participatory Sensing", "comments": "To appear in IEEE Network. Vol. 27, No. 1. January 2013. Submitted\n  March 2011, Accepted January 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Participatory Sensing is an emerging computing paradigm that enables the\ndistributed collection of data by self-selected participants. It allows the\nincreasing number of mobile phone users to share local knowledge acquired by\ntheir sensor-equipped devices, e.g., to monitor temperature, pollution level or\nconsumer pricing information. While research initiatives and prototypes\nproliferate, their real-world impact is often bounded to comprehensive user\nparticipation. If users have no incentive, or feel that their privacy might be\nendangered, it is likely that they will not participate. In this article, we\nfocus on privacy protection in Participatory Sensing and introduce a suitable\nprivacy-enhanced infrastructure. First, we provide a set of definitions of\nprivacy requirements for both data producers (i.e., users providing sensed\ninformation) and consumers (i.e., applications accessing the data). Then, we\npropose an efficient solution designed for mobile phone users, which incurs\nvery low overhead. Finally, we discuss a number of open problems and possible\nresearch directions.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jan 2012 20:15:53 GMT"}, {"version": "v2", "created": "Fri, 8 Feb 2013 03:22:25 GMT"}], "update_date": "2013-02-11", "authors_parsed": [["De Cristofaro", "Emiliano", ""], ["Soriente", "Claudio", ""]]}, {"id": "1201.4522", "submitter": "Rajkumar Buyya", "authors": "Rajkumar Buyya, Saurabh Kumar Garg, and Rodrigo N. Calheiros", "title": "SLA-Oriented Resource Provisioning for Cloud Computing: Challenges,\n  Architecture, and Solutions", "comments": "10 pages, 7 figures, Conference Keynote Paper: 2011 IEEE\n  International Conference on Cloud and Service Computing (CSC 2011, IEEE\n  Press, USA), Hong Kong, China, December 12-14, 2011", "journal-ref": "Proceedings of the 2011 IEEE International Conference on Cloud and\n  Service Computing (CSC 2011, IEEE Press, USA), Hong Kong, China, December\n  12-14, 2011", "doi": "10.1109/CSC.2011.6138522", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing systems promise to offer subscription-oriented,\nenterprise-quality computing services to users worldwide. With the increased\ndemand for delivering services to a large number of users, they need to offer\ndifferentiated services to users and meet their quality expectations. Existing\nresource management systems in data centers are yet to support Service Level\nAgreement (SLA)-oriented resource allocation, and thus need to be enhanced to\nrealize cloud computing and utility computing. In addition, no work has been\ndone to collectively incorporate customer-driven service management,\ncomputational risk management, and autonomic resource management into a\nmarket-based resource management system to target the rapidly changing\nenterprise requirements of Cloud computing. This paper presents vision,\nchallenges, and architectural elements of SLA-oriented resource management. The\nproposed architecture supports integration of marketbased provisioning policies\nand virtualisation technologies for flexible allocation of resources to\napplications. The performance results obtained from our working prototype\nsystem shows the feasibility and effectiveness of SLA-based resource\nprovisioning in Clouds.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 01:41:04 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Buyya", "Rajkumar", ""], ["Garg", "Saurabh Kumar", ""], ["Calheiros", "Rodrigo N.", ""]]}, {"id": "1201.4524", "submitter": "Vance Faber", "authors": "Vance Faber", "title": "Livelock free routing schemes", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a livelock free routing algorithm for any allowed network. Unlike\nsome other solutions to this problem:\n  1) packets entering the network have an absolute upper bound on the time to\nreach their destination; 2) under light loads, packets are delivered to their\ndestinations in nearly optimal time; 3) packets with desired paths far away\nfrom congested areas will have routing times far shorter than packets wanting\nto access congested areas; 4) if the network becomes congested and later\nclears, the network operates just as it would have when it was initially under\na light load.\n  The main ideas of this note appear in a different form in my 1994 patent\n5,369,745. This note adds to those results and makes them more mathematical.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 01:58:21 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Faber", "Vance", ""]]}, {"id": "1201.4532", "submitter": "Jaydip Sen", "authors": "Jaydip Sen and Subhamoy Maitra", "title": "An Attack on Privacy Preserving Data Aggregation Protocol for Wireless\n  Sensor Networks", "comments": "The paper is withdrawn", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In-network data aggregation in Wireless Sensor Networks (WSNs) provides\nefficient bandwidth utilization and energy-efficient computing.Supporting\nefficient in-network data aggregation while preserving the privacy of the data\nof individual sensor nodes has emerged as an important requirement in numerous\nWSN applications. For privacy-preserving data aggregation in WSNs, He et al.\n(INFOCOM 2007) have proposed a Cluster-based Private Data Aggregation (CPDA)\nthat uses a clustering protocol and a well-known key distribution scheme for\ncomputing an additive aggregation function in a privacy-preserving manner. In\nspite of the wide popularity of CPDA, it has been observed that the protocol is\nnot secure and it is also possible to enhance its efficiency. In this paper, we\nfirst identify a security vulnerability in the existing CPDA scheme, wherein we\nshow how a malicious participant node can launch an attack on the privacy\nprotocol so as to get access to the private data of its neighboring sensor\nnodes. Next it is shown how the existing CPDA scheme can be made more efficient\nby suitable modification of the protocol. Further, suitable modifications in\nthe existing protocol have been proposed so as to plug the vulnerability of the\nprotocol.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 06:51:59 GMT"}, {"version": "v2", "created": "Mon, 30 Apr 2012 17:03:38 GMT"}], "update_date": "2012-05-01", "authors_parsed": [["Sen", "Jaydip", ""], ["Maitra", "Subhamoy", ""]]}, {"id": "1201.4536", "submitter": "Jaydip Sen", "authors": "Jaydip Sen", "title": "A Multi-Path Certification Protocol for Mobile Ad Hoc Networks", "comments": "4 pages, 6 figures, 4 pages. In Proceedings of the 4th International\n  Conference on Computers & Devices for Communications (CODEC), December 14 --\n  16, 2009, Kolkata, India", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A mobile ad hoc network (MANET) is a collection of autonomous nodes that\ncommunicate with each other by forming a multi-hop radio network and\nmaintaining connections in a decentralized manner. Security remains a major\nchallenge for these networks due to their features of open medium, dynamically\nchanging topologies, reliance on cooperative algorithms, absence of centralized\nmonitoring points, and lack of clear lines of defense. Most of the routing\nprotocols for MANETs are thus vulnerable to various types of attacks. For\nsecurity, these protocols are highly dependent on cryptographic key exchange\noperations. This paper presents a multi-path certification protocol for\nefficient and reliable key exchange among the nodes in a MANET. Simulation\nresults have shown the effectiveness and efficiency of the protocol.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 07:42:13 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Sen", "Jaydip", ""]]}, {"id": "1201.4555", "submitter": "Omid Mahdi Ebadati Esfahani", "authors": "Harleen Kaur, Omid MahdiEbadati E., M. Afshar Alm", "title": "Implementation of Portion Approach in Distributed Firewall Application\n  for Network Security Framework", "comments": "11 pages, 8 figurs, 4 tables, IJCSI; ISSN (Online): 1694-0814", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 6, No 2, November 2011 IJCSI, International Journal of Computer Science\n  Issues, Vol. 8, Issue 6, No 2, November 2011, 207-217", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stimulate of this research seeks collaboration of firewalls which, could\nreach to the capability of distributed points of security policy; the front-end\nentity may much interact by the invaders so the separation between this entity\nand back-end entity to make the secure domain protection is necessary;\ncollaborative security entity has the various task in the organization and\nthere is a certain security policy to apply in; the entities like DPFF have to\nbe protected from outsiders. Firewalls are utilized typically to be the main\nlayer of security in the network framework. The research is presented the\nparticular segment of the proposed framework that DPFF based on the developed\niptable firewall to be the layers of defense, which is protected front and\nbackend of the framework with a dynamic security and policy update to control\nthe framework's safeguard through proposed portion approach algorithm that\nutilize to reduce the traffic and efficiency in detection and policy update\nmechanism. The policy update mechanism for DPFF is given the way of its\nemployment. The complete framework signifies a distributed firewall, where the\nadministrator configures the policy rules set, which could be separately or\nelse from administration nodes' side.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 12:41:18 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Kaur", "Harleen", ""], ["E.", "Omid MahdiEbadati", ""], ["Alm", "M. Afshar", ""]]}, {"id": "1201.4650", "submitter": "Angelos Antonopoulos", "authors": "Angelos Antonopoulos and Christos Verikoukis", "title": "Network Coding-Based Cooperative ARQ Scheme", "comments": "5 pages, Conference", "journal-ref": "IEEE International Conference on Communications (ICC 2011),\n  pp.1-5, 5-9 June 2011, Kyoto, Japan", "doi": "10.1109/icc.2011.5963256", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a novel Automatic Repeat reQuest (ARQ) scheme for\ncooperative wireless networks. Our scheme adopts network coding techniques in\norder to enhance the total bandwidth of the network by minimizing the total\nnumber of transmissions. The performance of the proposed approach is evaluated\nby means of computer simulations and compared to other cooperative schemes,\nwhile an analytical solution is provided to validate the results.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2012 08:55:48 GMT"}], "update_date": "2014-08-26", "authors_parsed": [["Antonopoulos", "Angelos", ""], ["Verikoukis", "Christos", ""]]}, {"id": "1201.4768", "submitter": "Sameh Sorour Sameh Sorour", "authors": "Sameh Sorour and Shahrokh Valaee", "title": "Completion Delay Minimization for Instantly Decodable Network Codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the problem of minimizing the completion delay for\ninstantly decodable network coding (IDNC), in wireless multicast and broadcast\nscenarios. We are interested in this class of network coding due to its\nnumerous benefits, such as low decoding delay, low coding and decoding\ncomplexities and simple receiver requirements. We first extend the IDNC graph,\nwhich represents all feasible IDNC coding opportunities, to efficiently operate\nin both multicast and broadcast scenarios. We then formulate the minimum\ncompletion delay problem for IDNC as a stochastic shortest path (SSP) problem.\nAlthough finding the optimal policy using SSP is intractable, we use this\nformulation to draw the theoretical guidelines for the policies that can\nefficiently reduce the completion delay in IDNC. Based on these guidelines, we\ndesign a maximum weight clique selection algorithm, which can efficiently\nreduce the IDNC completion delay in polynomial time. We also design a quadratic\ntime heuristic clique selection algorithm, which can operate in real-time\napplications. Simulation results show that our proposed algorithms efficiently\nreduce the IDNC completion delay compared to the random and maximum-rate\nalgorithms, and almost achieve the global optimal completion delay performance\nover all network codes in broadcast scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2012 16:59:11 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Sorour", "Sameh", ""], ["Valaee", "Shahrokh", ""]]}, {"id": "1201.4906", "submitter": "Keqin Liu", "authors": "Keqin Liu, Qing Zhao", "title": "Adaptive Shortest-Path Routing under Unknown and Stochastically Varying\n  Link States", "comments": "10 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the adaptive shortest-path routing problem in wireless networks\nunder unknown and stochastically varying link states. In this problem, we aim\nto optimize the quality of communication between a source and a destination\nthrough adaptive path selection. Due to the randomness and uncertainties in the\nnetwork dynamics, the quality of each link varies over time according to a\nstochastic process with unknown distributions. After a path is selected for\ncommunication, the aggregated quality of all links on this path (e.g., total\npath delay) is observed. The quality of each individual link is not observable.\nWe formulate this problem as a multi-armed bandit with dependent arms. We show\nthat by exploiting arm dependencies, a regret polynomial with network size can\nbe achieved while maintaining the optimal logarithmic order with time. This is\nin sharp contrast with the exponential regret order with network size offered\nby a direct application of the classic MAB policies that ignore arm\ndependencies. Furthermore, our results are obtained under a general model of\nlink-quality distributions (including heavy-tailed distributions) and find\napplications in cognitive radio and ad hoc networks with unknown and dynamic\ncommunication environments.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 02:45:58 GMT"}], "update_date": "2012-01-25", "authors_parsed": [["Liu", "Keqin", ""], ["Zhao", "Qing", ""]]}, {"id": "1201.4943", "submitter": "Deepali Virmani", "authors": "Deepali Virmani and Satbir Jain", "title": "Decentralized Lifetime Maximizing Tree with Clustering for Data Delivery\n  in Wireless Sensor Networks", "comments": "9 pages, 8 figures", "journal-ref": "IJCSI volume 8, issue 5 ,september 2011,pp 310-318, ISSN (Online):\n  1694-0814", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A wireless sensor network has a wide application domain which is expanding\neveryday and they have been deployed pertaining to their application area. An\napplication independent approach is yet to come to terms with the ongoing\nexploitation of the WSNs. In this paper we propose a decentralized lifetime\nmaximizing tree for application independent data aggregation scheme using the\nclustering for data delivery in WSNs. The proposed tree will minimize the\nenergy consumption which has been a resisting factor in the smooth working of\nWSNs as well as minimize the distance between the communicating nodes under the\ncontrol of a sub-sink which further communicate and transfer data to the sink\nnode.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 10:32:05 GMT"}], "update_date": "2012-01-25", "authors_parsed": [["Virmani", "Deepali", ""], ["Jain", "Satbir", ""]]}, {"id": "1201.4946", "submitter": "Deepali Virmani", "authors": "Deepali Virmani and Satbir Jain", "title": "Real Time Communication Capacity for Data Delivery in Wireless Sensor\n  Networks", "comments": "10 pages, 7 figures", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 4, No 1, July 2011 ISSN (Online): 1694-0814", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real-time applications are performance critical applications that require\nbounded service latency. In multi-hop wireless ad-hoc and sensor networks,\ncommunication delays are dominant over processing delays. Therefore, to enable\nreal-time applications in such networks, the communication latency must be\nbounded. In this paper, we derive expressions of real-time capacity that\ncharacterize the ability of a network to deliver data on time as well as\ndevelop network protocols that achieve this capacity. Real-time capacity\nexpressions are obtained and analyzed for the earliest deadline first, deadline\nmonotonic. This paper presents a treatment of the real-time capacity limits.\nThe limits are derived for two extreme traffic topologies namely, the load\nbalanced topology and the convergecast (i.e., many-to-one) topology. It\nconsiders DM and EDF scheduling algorithms, and discusses the implications of\nthe capacity limit expressions.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 10:59:29 GMT"}], "update_date": "2012-01-25", "authors_parsed": [["Virmani", "Deepali", ""], ["Jain", "Satbir", ""]]}, {"id": "1201.4999", "submitter": "Xiaodong Hu", "authors": "Xiaodong Hu, Seyed Hossein Hosseini Nazhad, Mitra Ganguly", "title": "A study of distributed QoS adapter in large-scale wireless networks", "comments": "This paper has been withdrawn by the author due to a wrong authorship", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Considering the comfortably establishing ad hoc networks, the use of this\ntype of network is increasing day to day. On the other side, it is predicted\nthat using multimedia applications will be more public in these network. As it\nis known, in contrary to best-effort flows, the transmission of multimedia\nflows in any network need support from QoS. However, the wireless ad hoc\nnetworks are severely affected by bandwidth, and establishing a QoS in these\nnetworks face problems. In this paper, we have proposed a thoroughly\ndistributed algorithm to support the QoS in ad hoc networks. This algorithm\nguarantees the QoS of the real-time applications vis-a-vis each other and\nbest-effort flows as well. The algorithm suggested in this paper dynamically\nregulates the Contention Window of the flows and serves the flows in terms of\ntheir requests QoS choosing the smallest CW in every node. This algorithm also\nuses the fixed and/or less stationary nodes for the transmission of real-time\nflows by increasing the QoS of the multimedia flows. This algorithm is\npreferred because it prioritizes the flows that are of the same class but have\nnot obtained favorite QoS compared to other flows of the same class in addition\nto classifying the flows in the network and offering better services to the\nclasses of higher priority. All this occur without the controlled packets\nforwarding and resource reserving and freeing method. We have proved the\ncorrectness of this algorithm using Markov's mathematical model.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 15:02:00 GMT"}, {"version": "v2", "created": "Thu, 15 Mar 2012 12:59:12 GMT"}], "update_date": "2012-03-16", "authors_parsed": [["Hu", "Xiaodong", ""], ["Nazhad", "Seyed Hossein Hosseini", ""], ["Ganguly", "Mitra", ""]]}, {"id": "1201.5173", "submitter": "Sina Lashgari", "authors": "Sina Lashgari and A. Salman Avestimehr", "title": "Timely Throughput of Heterogeneous Wireless Networks: Fundamental Limits\n  and Algorithms", "comments": "46 pages, submitted to IEEE Trans. on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The proliferation of different wireless access technologies, together with\nthe growing number of multi-radio wireless devices suggest that the\nopportunistic utilization of multiple connections at the users can be an\neffective solution to the phenomenal growth of traffic demand in wireless\nnetworks. In this paper we consider the downlink of a wireless network with $N$\nAccess Points (AP's) and $M$ clients, where each client is connected to several\nout-of-band AP's, and requests delay-sensitive traffic (e.g., real-time video).\nWe adopt the framework of Hou, Borkar, and Kumar, and study the maximum total\ntimely throughput of the network, denoted by $C_{T^3}$, which is the maximum\naverage number of packets delivered successfully before their deadline. Solving\nthis problem is challenging since even the number of different ways of\nassigning packets to the AP's is $N^M$. We overcome the challenge by proposing\na deterministic relaxation of the problem, which converts the problem to a\nnetwork with deterministic delays in each link. We show that the additive gap\nbetween the capacity of the relaxed problem, denoted by $C_{det}$, and\n$C_{T^3}$ is bounded by $2\\sqrt{N(C_{det}+N/4)}$, which is asymptotically\nnegligible compared to $C_{det}$, when the network is operating at\nhigh-throughput regime.\n  In addition, our numerical results show that the actual gap between $C_{T^3}$\nand $C_{det}$ is in most cases much less than the worst-case gap proven\nanalytically. Moreover, using LP rounding methods we prove that the relaxed\nproblem can be approximated within additive gap of $N$. We extend the\nanalytical results to the case of time-varying channel states, real-time\ntraffic, prioritized traffic, and optimal online policies. Finally, we\ngeneralize the model for deterministic relaxation to consider fading, rate\nadaptation, and multiple simultaneous transmissions.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jan 2012 02:17:53 GMT"}, {"version": "v2", "created": "Sat, 20 Apr 2013 16:45:07 GMT"}], "update_date": "2013-04-23", "authors_parsed": [["Lashgari", "Sina", ""], ["Avestimehr", "A. Salman", ""]]}, {"id": "1201.5434", "submitter": "Sebastian Szyszkowicz", "authors": "Arshdeep S. Kahlon, Sebastian S. Szyszkowicz, Shalini Periyalwar,\n  Halim Yanikomeroglu", "title": "Separating the Effect of Independent Interference Sources with Rayleigh\n  Faded Signal Link: Outage Analysis and Applications", "comments": "Submitted to IEEE Wireless Communications Letters", "journal-ref": null, "doi": "10.1109/WCL.2012.071612.120392", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that, for independent interfering sources and a signal link with\nexponentially distributed received power, the total probability of outage can\nbe decomposed as a simple expression of the outages from the individual\ninterfering sources. We give a mathematical proof of this result, and discuss\nsome immediate implications, showing how it results in important\nsimplifications to statistical outage analysis. We also discuss its application\nto two active topics of study: spectrum sharing, and sum of interference powers\n(e.g., lognormal) analysis.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 03:26:31 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Kahlon", "Arshdeep S.", ""], ["Szyszkowicz", "Sebastian S.", ""], ["Periyalwar", "Shalini", ""], ["Yanikomeroglu", "Halim", ""]]}, {"id": "1201.5608", "submitter": "Dino Sejdinovic", "authors": "Robert Piechocki, Dino Sejdinovic", "title": "Combinatorial Channel Signature Modulation for Wireless ad-hoc Networks", "comments": "6 pages, 7 figures, to appear in IEEE International Conference on\n  Communications ICC 2012", "journal-ref": null, "doi": "10.1109/ICC.2012.6363956", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a novel modulation and multiplexing method which\nfacilitates highly efficient and simultaneous communication between multiple\nterminals in wireless ad-hoc networks. We term this method Combinatorial\nChannel Signature Modulation (CCSM). The CCSM method is particularly efficient\nin situations where communicating nodes operate in highly time dispersive\nenvironments. This is all achieved with a minimal MAC layer overhead, since all\nusers are allowed to transmit and receive at the same time/frequency (full\nsimultaneous duplex). The CCSM method has its roots in sparse modelling and the\nreceiver is based on compressive sampling techniques. Towards this end, we\ndevelop a new low complexity algorithm termed Group Subspace Pursuit. Our\nanalysis suggests that CCSM at least doubles the throughput when compared to\nthe state-of-the art.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 19:21:15 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Piechocki", "Robert", ""], ["Sejdinovic", "Dino", ""]]}, {"id": "1201.5688", "submitter": "Saurabh  Pal", "authors": "Sanjeev Gangwar, Saurabh Pal and Krishan Kumar", "title": "Mobile Ad Hoc Networks: A Comparative Study of QoS Routing Protocols", "comments": "5 pages", "journal-ref": "International Journal of Computer Science Engineering and\n  Technology (IJCSET), Vol.2, Issue 1, 2012, pp 771-775", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This Article presents a thorough overview of QoS routing metrics, resources\nand factors affecting performance of QoS routing protocols. The relative\nstrength, weakness, and applicability of existing QoS routing protocols are\nalso studied and compared. QoS routing protocols are classified according to\nthe QoS metrics used type of QoS guarantee assured.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2012 01:43:40 GMT"}], "update_date": "2012-01-30", "authors_parsed": [["Gangwar", "Sanjeev", ""], ["Pal", "Saurabh", ""], ["Kumar", "Krishan", ""]]}, {"id": "1201.5824", "submitter": "Sebastien Tixeuil", "authors": "Alexandre Maurer (LIP6, LINCS), S\\'ebastien Tixeuil (LIP6, LINCS, IUF)", "title": "Limiting Byzantien Influence in Multihop Asynchronous Networks", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of reliably broadcasting information in a multihop\nasyn- chronous network that is subject to Byzantine failures. That is, some\nnodes of the network can exhibit arbitrary (and potentially malicious)\nbehavior. Existing solutions provide de- terministic guarantees for\nbroadcasting between all correct nodes, but require that the communication\nnetwork is highly-connected (typically, 2k + 1 connectivity is required, where\nk is the total number of Byzantine nodes in the network). In this paper, we\ninvestigate the possibility of Byzantine tolerant reliable broadcast be- tween\nmost correct nodes in low-connectivity networks (typically, networks with\nconstant connectivity). In more details, we propose a new broadcast protocol\nthat is specifically designed for low-connectivity networks. We provide\nsufficient conditions for correct nodes using our protocol to reliably\ncommunicate despite Byzantine participants. We present experimental results\nthat show that our approach is especially effective in low-connectivity\nnetworks when Byzantine nodes are randomly distributed.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2012 16:36:50 GMT"}], "update_date": "2012-01-30", "authors_parsed": [["Maurer", "Alexandre", "", "LIP6, LINCS"], ["Tixeuil", "Sébastien", "", "LIP6, LINCS, IUF"]]}, {"id": "1201.6065", "submitter": "Qingsi Wang", "authors": "Qingsi Wang, Mingyan Liu", "title": "Throughput Optimal Switching in Multi-channel WLANs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We observe that in a multi-channel wireless system, an opportunistic\nchannel/spectrum access scheme that solely focuses on channel quality sensing\nmeasured by received SNR may induce users to use channels that, while providing\nbetter signals, are more congested. Ultimately the notion of channel quality\nshould include both the signal quality and the level of congestion, and a good\nmulti-channel access scheme should take both into account in deciding which\nchannel to use and when. Motivated by this, we focus on the congestion aspect\nand examine what type of dynamic channel switching schemes may result in the\nbest system throughput performance. Specifically we derive the stability region\nof a multi-user multi-channel WLAN system and determine the throughput optimal\nchannel switching scheme within a certain class of schemes.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jan 2012 18:22:31 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Wang", "Qingsi", ""], ["Liu", "Mingyan", ""]]}, {"id": "1201.6181", "submitter": "Tobias Jung", "authors": "Tobias Jung and Sylvain Martin and Damien Ernst and Guy Leduc", "title": "Contextual Multi-armed Bandits for the Prevention of Spam in VoIP\n  Networks", "comments": "Technical report, 19 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we argue that contextual multi-armed bandit algorithms could\nopen avenues for designing self-learning security modules for computer networks\nand related tasks. The paper has two contributions: a conceptual one and an\nalgorithmical one. The conceptual contribution is to formulate -- as an example\n-- the real-world problem of preventing SPIT (Spam in VoIP networks), which is\ncurrently not satisfyingly addressed by standard techniques, as a sequential\nlearning problem, namely as a contextual multi-armed bandit. Our second\ncontribution is to present CMABFAS, a new algorithm for general contextual\nmulti-armed bandit learning that specifically targets domains with finite\nactions. We illustrate how CMABFAS could be used to design a fully\nself-learning SPIT filter that does not rely on feedback from the end-user\n(i.e., does not require labeled data) and report first simulation results.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 11:40:06 GMT"}, {"version": "v2", "created": "Thu, 12 Jul 2012 11:55:33 GMT"}], "update_date": "2012-07-13", "authors_parsed": [["Jung", "Tobias", ""], ["Martin", "Sylvain", ""], ["Ernst", "Damien", ""], ["Leduc", "Guy", ""]]}, {"id": "1201.6190", "submitter": "Tobias Jung", "authors": "Tobias Jung and Sylvain Martin and Mohamed Nassar and Damien Ernst and\n  Guy Leduc", "title": "Outbound SPIT Filter with Optimal Performance Guarantees", "comments": "in submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a formal framework for identifying and filtering SPIT\ncalls (SPam in Internet Telephony) in an outbound scenario with provable\noptimal performance. In so doing, our work is largely different from related\nprevious work: our goal is to rigorously formalize the problem in terms of\nmathematical decision theory, find the optimal solution to the problem, and\nderive concrete bounds for its expected loss (number of mistakes the SPIT\nfilter will make in the worst case).\n  This goal is achieved by considering an abstracted scenario amenable to\ntheoretical analysis, namely SPIT detection in an outbound scenario with pure\nsources. Our methodology is to first define the cost of making an error (false\npositive and false negative), apply Wald's sequential probability ratio test to\nthe individual sources, and then determine analytically error probabilities\nsuch that the resulting expected loss is minimized.\n  The benefits of our approach are: (1) the method is optimal (in a sense\ndefined in the paper); (2) the method does not rely on manual tuning and\ntweaking of parameters but is completely self-contained and mathematically\njustified; (3) the method is computationally simple and scalable. These are\ndesirable features that would make our method a component of choice in larger,\nautonomic frameworks.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 12:14:18 GMT"}], "update_date": "2012-01-31", "authors_parsed": [["Jung", "Tobias", ""], ["Martin", "Sylvain", ""], ["Nassar", "Mohamed", ""], ["Ernst", "Damien", ""], ["Leduc", "Guy", ""]]}, {"id": "1201.6282", "submitter": "Anatolij Zubow Anatolij Zubow", "authors": "Anatolij Zubow, Johannes Marotzke", "title": "On the Frequency-Selective Scheduling Gain in SDMA-OFDMA Systems", "comments": "7 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Orthogonal Frequency Division Multiple Access (OFDMA) is a multi-user version\nof the Orthogonal Frequency Division Multiplexing (OFDM) transmission\ntechnique, which divides a wideband channel into a number of orthogonal\nnarrowband subchannels, called subcarriers. An OFDMA system takes advantage of\nboth frequency diversity (FD) gain and frequency-selective scheduling (FSS)\ngain. A FD gain is achieved by allocating a user the subcarriers distributed\nover the entire frequency band whereas a FSS gain is achieved by allocating a\nuser adjacent subcarriers located within a subband of a small bandwidth having\nthe most favorable channel conditions among other subbands in the entire\nfrequency band. Multi-User Multiple Input Multiple Output (MU-MIMO) is a\npromising technology to increase spectral efficiency. A well-known MU-MIMO mode\nis Space-Division Multiple Access (SDMA) which can be used in the downlink\ndirection to allow a group of spatially separable users to share the same\ntime/frequency resources. In this paper, we study the gain from FSS in\nSDMA-OFDMA systems using the example of WiMAX. Therefore, a complete SDMA-OFDMA\nMAC scheduling solution supporting both FD and FSS is proposed. The proposed\nsolution is analyzed in a typical urban macro-cell scenario by means of\nsystem-level packet-based simulations, with detailed MAC and physical layer\nabstractions. By explicitly simulating the MAC layer overhead (MAP) which is\nrequired to signal every packed data burst in the OFDMA frame we can present\nthe overall performance to be expected at the MAC layer. Our results show that\nin general the gain from FSS when applying SDMA is low. However, under specific\nconditions, small number of BS antennas or large channel bandwidth, a\nsignificant gain can be achieved from FSS.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 17:11:03 GMT"}, {"version": "v2", "created": "Wed, 29 Feb 2012 10:02:18 GMT"}], "update_date": "2012-03-01", "authors_parsed": [["Zubow", "Anatolij", ""], ["Marotzke", "Johannes", ""]]}]