[{"id": "0805.0360", "submitter": "Peter Harding Mr", "authors": "Peter J. Harding, Martyn Amos and Steve Gwynne", "title": "Prediction and Mitigation of Crush Conditions in Emergency Evacuations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several simulation environments exist for the simulation of large-scale\nevacuations of buildings, ships, or other enclosed spaces. These offer\nsophisticated tools for the study of human behaviour, the recreation of\nenvironmental factors such as fire or smoke, and the inclusion of architectural\nor structural features, such as elevators, pillars and exits. Although such\nsimulation environments can provide insights into crowd behaviour, they lack\nthe ability to examine potentially dangerous forces building up within a crowd.\nThese are commonly referred to as crush conditions, and are a common cause of\ndeath in emergency evacuations.\n  In this paper, we describe a methodology for the prediction and mitigation of\ncrush conditions. The paper is organised as follows. We first establish the\nneed for such a model, defining the main factors that lead to crush conditions,\nand describing several exemplar case studies. We then examine current methods\nfor studying crush, and describe their limitations. From this, we develop a\nthree-stage hybrid approach, using a combination of techniques. We conclude\nwith a brief discussion of the potential benefits of our approach.\n", "versions": [{"version": "v1", "created": "Sat, 3 May 2008 13:00:42 GMT"}], "update_date": "2008-05-06", "authors_parsed": [["Harding", "Peter J.", ""], ["Amos", "Martyn", ""], ["Gwynne", "Steve", ""]]}, {"id": "0805.0785", "submitter": "Michael Hilker", "authors": "Michael Hilker and Christoph Schommer", "title": "AGNOSCO - Identification of Infected Nodes with artificial Ant Colonies", "comments": "5 pages, 2 figures", "journal-ref": "Proceedings of the 6th International Conference on Recent Advances\n  in Soft Computing (RASC2006), July 2006, Canterbury, United Kingdom", "doi": null, "report-no": null, "categories": "cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  If a computer node is infected by a virus, worm or a backdoor, then this is a\nsecurity risk for the complete network structure where the node is associated.\nExisting Network Intrusion Detection Systems (NIDS) provide a certain amount of\nsupport for the identification of such infected nodes but suffer from the need\nof plenty of communication and computational power. In this article, we present\na novel approach called AGNOSCO to support the identification of infected nodes\nthrough the usage of artificial ant colonies. It is shown that AGNOSCO\novercomes the communication and computational power problem while identifying\ninfected nodes properly.\n", "versions": [{"version": "v1", "created": "Tue, 6 May 2008 19:47:11 GMT"}, {"version": "v2", "created": "Wed, 7 May 2008 15:33:35 GMT"}], "update_date": "2008-05-07", "authors_parsed": [["Hilker", "Michael", ""], ["Schommer", "Christoph", ""]]}, {"id": "0805.0849", "submitter": "Michael Hilker", "authors": "Michael Hilker and Christoph Schommer", "title": "SANA - Network Protection through artificial Immunity", "comments": "5 pages", "journal-ref": "Proceedings of the 2nd International Workshop on Theory of\n  Computer Viruses (TCV 2007), May 2007, Nancy, France", "doi": null, "report-no": null, "categories": "cs.CR cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current network protection systems use a collection of intelligent components\n- e.g. classifiers or rule-based firewall systems to detect intrusions and\nanomalies and to secure a network against viruses, worms, or trojans. However,\nthese network systems rely on individuality and support an architecture with\nless collaborative work of the protection components. They give less\nadministration support for maintenance, but offer a large number of individual\nsingle points of failures - an ideal situation for network attacks to succeed.\nIn this work, we discuss the required features, the performance, and the\nproblems of a distributed protection system called SANA. It consists of a\ncooperative architecture, it is motivated by the human immune system, where the\ncomponents correspond to artificial immune cells that are connected for their\ncollaborative work. SANA promises a better protection against intruders than\ncommon known protection systems through an adaptive self-management while\nkeeping the resources efficiently by an intelligent reduction of redundant\ntasks. We introduce a library of several novel and common used protection\ncomponents and evaluate the performance of SANA by a proof-of-concept\nimplementation.\n", "versions": [{"version": "v1", "created": "Wed, 7 May 2008 07:13:32 GMT"}], "update_date": "2008-05-08", "authors_parsed": [["Hilker", "Michael", ""], ["Schommer", "Christoph", ""]]}, {"id": "0805.0909", "submitter": "Michael Hilker", "authors": "Michael Hilker and Christoph Schommer", "title": "SANA - Security Analysis in Internet Traffic through Artificial Immune\n  Systems", "comments": "9 pages,", "journal-ref": "Proceedings of the Trustworthy Software Workshop 2006, IBFI,\n  Schloss Dagstuhl, May 2006, Saarbruecken, Germany", "doi": null, "report-no": null, "categories": "cs.CR cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Attacks done by Viruses, Worms, Hackers, etc. are a Network\nSecurity-Problem in many Organisations. Current Intrusion Detection Systems\nhave significant Disadvantages, e.g. the need of plenty of Computational Power\nor the Local Installation. Therefore, we introduce a novel Framework for\nNetwork Security which is called SANA. SANA contains an artificial Immune\nSystem with artificial Cells which perform certain Tasks in order to to support\nexisting systems to better secure the Network against Intrusions. The\nAdvantages of SANA are that it is efficient, adaptive, autonomous, and\nmassively-distributed. In this Article, we describe the Architecture of the\nartificial Immune System and the Functionality of the Components. We explain\nbriefly the Implementation and discuss Results.\n", "versions": [{"version": "v1", "created": "Wed, 7 May 2008 09:31:18 GMT"}], "update_date": "2008-05-08", "authors_parsed": [["Hilker", "Michael", ""], ["Schommer", "Christoph", ""]]}, {"id": "0805.1727", "submitter": "Martyn Amos", "authors": "Martyn Amos and Oliver Don", "title": "Swarm-Based Spatial Sorting", "comments": "Accepted by the Int. J. Intelligent Computing and Cybernetics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Purpose: To present an algorithm for spatially sorting objects into an\nannular structure. Design/Methodology/Approach: A swarm-based model that\nrequires only stochastic agent behaviour coupled with a pheromone-inspired\n\"attraction-repulsion\" mechanism. Findings: The algorithm consistently\ngenerates high-quality annular structures, and is particularly powerful in\nsituations where the initial configuration of objects is similar to those\nobserved in nature. Research limitations/implications: Experimental evidence\nsupports previous theoretical arguments about the nature and mechanism of\nspatial sorting by insects. Practical implications: The algorithm may find\napplications in distributed robotics. Originality/value: The model offers a\npowerful minimal algorithmic framework, and also sheds further light on the\nnature of attraction-repulsion algorithms and underlying natural processes.\n", "versions": [{"version": "v1", "created": "Mon, 12 May 2008 19:46:29 GMT"}], "update_date": "2008-05-13", "authors_parsed": [["Amos", "Martyn", ""], ["Don", "Oliver", ""]]}, {"id": "0805.1785", "submitter": "Michael Hilker", "authors": "Michael Hilker", "title": "Distributed Self Management for Distributed Security Systems", "comments": "12 pages, 3 figures", "journal-ref": "Proceedings of the 2nd International Conference on Bio-Inspired\n  Computing: Theories and Applications (BIC-TA 2007), September 2007,\n  Zhengzhou, China", "doi": null, "report-no": null, "categories": "cs.MA cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed system as e.g. artificial immune systems, complex adaptive\nsystems, or multi-agent systems are widely used in Computer Science, e.g. for\nnetwork security, optimisations, or simulations. In these systems, small\nentities move through the network and perform certain tasks. At some time, the\nentities move to another place and require therefore information where to move\nis most profitable. Common used systems do not provide any information or use a\ncentralised approach where a center delegates the entities. This article\ndiscusses whether small information about the neighbours enhances the\nperformance of the overall system or not. Therefore, two information-protocols\nare introduced and analysed. In addition, the protocols are implemented and\ntested using the artificial immune system SANA that protects a network against\nintrusions.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 06:32:12 GMT"}], "update_date": "2008-05-14", "authors_parsed": [["Hilker", "Michael", ""]]}, {"id": "0805.1786", "submitter": "Michael Hilker", "authors": "Michael Hilker", "title": "Next Challenges in Bringing Artificial Immune Systems to Production in\n  Network Security", "comments": "7 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The human immune system protects the human body against various pathogens\nlike e.g. biological viruses and bacteria. Artificial immune systems reuse the\narchitecture, organization, and workflows of the human immune system for\nvarious problems in computer science. In the network security, the artificial\nimmune system is used to secure a network and its nodes against intrusions like\nviruses, worms, and trojans. However, these approaches are far away from\nproduction where they are academic proof-of-concept implementations or use only\na small part to protect against a certain intrusion. This article discusses the\nrequired steps to bring artificial immune systems into production in the\nnetwork security domain. It furthermore figures out the challenges and provides\nthe description and results of the prototype of an artificial immune system,\nwhich is SANA called.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 06:40:39 GMT"}], "update_date": "2008-05-14", "authors_parsed": [["Hilker", "Michael", ""]]}, {"id": "0805.1787", "submitter": "Michael Hilker", "authors": "Michael Hilker and Christoph Schommer", "title": "A Network Protection Framework through Artificial Immunity", "comments": "24 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current network protection systems use a collection of intelligent components\n- e.g. classifiers or rule-based firewall systems to detect intrusions and\nanomalies and to secure a network against viruses, worms, or trojans. However,\nthese network systems rely on individuality and support an architecture with\nless collaborative work of the protection components. They give less\nadministration support for maintenance, but offer a large number of individual\nsingle points of failures - an ideal situation for network attacks to succeed.\nIn this work, we discuss the required features, the performance, and the\nproblems of a distributed protection system called {\\it SANA}. It consists of a\ncooperative architecture, it is motivated by the human immune system, where the\ncomponents correspond to artificial immune cells that are connected for their\ncollaborative work. SANA promises a better protection against intruders than\ncommon known protection systems through an adaptive self-management while\nkeeping the resources efficiently by an intelligent reduction of redundancies.\nWe introduce a library of several novel and common used protection components\nand evaluate the performance of SANA by a proof-of-concept implementation.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 06:51:35 GMT"}], "update_date": "2008-05-14", "authors_parsed": [["Hilker", "Michael", ""], ["Schommer", "Christoph", ""]]}, {"id": "0805.1788", "submitter": "Tobias Kretz", "authors": "Tobias Kretz, Stefan Hengst, Peter Vortisch", "title": "Pedestrian Flow at Bottlenecks - Validation and Calibration of Vissim's\n  Social Force Model of Pedestrian Traffic and its Empirical Foundations", "comments": "Accepted for presentation at International Symposium of Transport\n  Simulation 2008 (ISTS08) in Gold Coast, Australia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this contribution first results of experiments on pedestrian flow through\nbottlenecks are presented and then compared to simulation results obtained with\nthe Social Force Model in the Vissim simulation framework. Concerning the\nexperiments it is argued that the basic dependence between flow and bottleneck\nwidth is not a step function but that it is linear and modified by the effect\nof a psychological phenomenon. The simulation results as well show a linear\ndependence and the parameters can be calibrated such that the absolute values\nfor flow and time fit to range of experimental results.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 07:24:32 GMT"}], "update_date": "2008-09-10", "authors_parsed": [["Kretz", "Tobias", ""], ["Hengst", "Stefan", ""], ["Vortisch", "Peter", ""]]}]