[{"id": "1001.0440", "submitter": "Rajkumar Kannan", "authors": "Rajkumar Kannan, Frederic Andres, Balakrishnan Ramadoss", "title": "Tutoring System for Dance Learning", "comments": "IEEE International Advance Computing Conference 2009, Patiala, India", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances in hardware sophistication related to graphics display, audio\nand video devices made available a large number of multimedia and hypermedia\napplications. These multimedia applications need to store and retrieve the\ndifferent forms of media like text, hypertext, graphics, still images,\nanimations, audio and video. Dance is one of the important cultural forms of a\nnation and dance video is one such multimedia types. Archiving and retrieving\nthe required semantics from these dance media collections is a crucial and\ndemanding multimedia application. This paper summarizes the difference dance\nvideo archival techniques and systems. Keywords: Multimedia, Culture Media,\nMetadata archival and retrieval systems, MPEG-7, XML.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jan 2010 05:24:31 GMT"}], "update_date": "2010-01-05", "authors_parsed": [["Kannan", "Rajkumar", ""], ["Andres", "Frederic", ""], ["Ramadoss", "Balakrishnan", ""]]}, {"id": "1001.0441", "submitter": "Rajkumar Kannan", "authors": "Rajkumar Kannan, Balakrishnan Ramadoss", "title": "Semantic Modeling and Retrieval of Dance Video Annotations", "comments": "INFOCOMP Journal of Computer Science, Brazil", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dance video is one of the important types of narrative videos with semantic\nrich content. This paper proposes a new meta model, Dance Video Content Model\n(DVCM) to represent the expressive semantics of the dance videos at multiple\ngranularity levels. The DVCM is designed based on the concepts such as video,\nshot, segment, event and object, which are the components of MPEG-7 MDS. This\npaper introduces a new relationship type called Temporal Semantic Relationship\nto infer the semantic relationships between the dance video objects. Inverted\nfile based index is created to reduce the search time of the dance queries. The\neffectiveness of containment queries using precision and recall is depicted.\nKeywords: Dance Video Annotations, Effectiveness Metrics, Metamodeling,\nTemporal Semantic Relationships.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jan 2010 05:32:05 GMT"}], "update_date": "2010-01-05", "authors_parsed": [["Kannan", "Rajkumar", ""], ["Ramadoss", "Balakrishnan", ""]]}, {"id": "1001.0442", "submitter": "Rajkumar Kannan", "authors": "Rajkumar Kannan, Balakrishnan Ramadoss", "title": "Modeling and Annotating the Expressive Semantics of Dance Videos", "comments": "International Journal of Information Technologies and Knowledge", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dance videos are interesting and semantics-intensive. At the same time, they\nare the complex type of videos compared to all other types such as sports, news\nand movie videos. In fact, dance video is the one which is less explored by the\nresearchers across the globe. Dance videos exhibit rich semantics such as macro\nfeatures and micro features and can be classified into several types. Hence,\nthe conceptual modeling of the expressive semantics of the dance videos is very\ncrucial and complex. This paper presents a generic Dance Video Semantics Model\n(DVSM) in order to represent the semantics of the dance videos at different\ngranularity levels, identified by the components of the accompanying song. This\nmodel incorporates both syntactic and semantic features of the videos and\nintroduces a new entity type called, Agent, to specify the micro features of\nthe dance videos. The instantiations of the model are expressed as graphs. The\nmodel is implemented as a tool using J2SE and JMF to annotate the macro and\nmicro features of the dance videos. Finally examples and evaluation results are\nprovided to depict the effectiveness of the proposed dance video model.\nKeywords: Agents, Dance videos, Macro features, Micro features, Video\nannotation, Video semantics.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jan 2010 05:41:01 GMT"}], "update_date": "2010-01-05", "authors_parsed": [["Kannan", "Rajkumar", ""], ["Ramadoss", "Balakrishnan", ""]]}, {"id": "1001.0443", "submitter": "Rajkumar Kannan", "authors": "Rajkumar Kannan, Christian Guetl", "title": "Discovering Knowledge from Multi-modal Lecture Recordings", "comments": "First International Conference on Data Engineering and Management\n  2008, India", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Educational media mining is the process of converting raw media data from\neducational systems to useful information that can be used to design learning\nsystems, answer research questions and allow personalized learning experiences.\nKnowledge discovery encompasses a wide range of techniques ranging from\ndatabase queries to more recent developments in machine learning and language\ntechnology. Educational media mining techniques are now being used in IT\nServices research worldwide. Multi-modal Lecture Recordings is one of the\nimportant types of educational media and this paper explores the research\nchallenges for mining lecture recordings for the efficient personalized\nlearning experiences. Keywords: Educational Media Mining; Lecture Recordings,\nMultimodal Information System, Personalized Learning; Online Course Ware;\nSkills and Competences;\n", "versions": [{"version": "v1", "created": "Mon, 4 Jan 2010 05:44:57 GMT"}], "update_date": "2010-01-05", "authors_parsed": [["Kannan", "Rajkumar", ""], ["Guetl", "Christian", ""]]}, {"id": "1001.1013", "submitter": "Jatinder Singh", "authors": "Xiaoqing Zhu, Piyush Agrawal, Jatinder Pal Singh, Tansu Alpcan and\n  Bernd Girod", "title": "Distributed Rate Allocation Policies for Multi-Homed Video Streaming\n  over Heterogeneous Access Networks", "comments": "12 pages, 22 figures", "journal-ref": "IEEE Transactions on Multimedia, Pages: 752-764, Volume: 11 Issue:\n  4, Date: June 2009", "doi": null, "report-no": null, "categories": "cs.MM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of rate allocation among multiple simultaneous video\nstreams sharing multiple heterogeneous access networks. We develop and evaluate\nan analytical framework for optimal rate allocation based on observed available\nbit rate (ABR) and round-trip time (RTT) over each access network and video\ndistortion-rate (DR) characteristics. The rate allocation is formulated as a\nconvex optimization problem that minimizes the total expected distortion of all\nvideo streams. We present a distributed approximation of its solution and\ncompare its performance against H-infinity optimal control and two heuristic\nschemes based on TCP-style additive-increase-multiplicative decrease (AIMD)\nprinciples. The various rate allocation schemes are evaluated in simulations of\nmultiple high-definition (HD) video streams sharing multiple access networks.\nOur results demonstrate that, in comparison with heuristic AIMD-based schemes,\nboth media-aware allocation and H-infinity optimal control benefit from\nproactive congestion avoidance and reduce the average packet loss rate from 45%\nto below 2%. Improvement in average received video quality ranges between 1.5\nto 10.7 dB in PSNR for various background traffic loads and video playout\ndeadlines. Media-aware allocation further exploits its knowledge of the video\nDR characteristics to achieve a more balanced video quality among all streams.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jan 2010 01:11:44 GMT"}], "update_date": "2010-01-08", "authors_parsed": [["Zhu", "Xiaoqing", ""], ["Agrawal", "Piyush", ""], ["Singh", "Jatinder Pal", ""], ["Alpcan", "Tansu", ""], ["Girod", "Bernd", ""]]}, {"id": "1001.1794", "submitter": "Alexei Botchkarev", "authors": "Alexei Botchkarev, Lian Zhao, Hamed Rasouli", "title": "Designing a Truly Integrated (Onsite and Online) Conference: Concept,\n  Processes, Solutions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web conferencing tools have entered the mainstream of business applications.\nUsing web conferencing for IEEE conferences has a good potential of adding\nvalue to both organizers and participants. Authors propose a concept of Truly\nIntegrated Conference (TIC) according to which a multi-point\nworldwide-distributed network of conference online authors/participants will\nenhance the standard (centralized) IEEE conference model, which requires\nattendance of the participants in person at the main conference location. The\nconcept entails seamless integration of the onsite and online conference\nsystems, including data/presentation, video, audio channels. Benefits and\nchallenges of the TIC concept are analyzed. Requirements to the web\nconferencing system capable of supporting the TIC conference are presented and\nreviewed against commercial web conferencing tools. Case study of the IEEE\nToronto International Conference ? Science and Technology for Humanity, which\nwas the first realization of TIC, is presented which analyzes various aspects\n(organizational, technological, and financial) of the integrated conference.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jan 2010 05:06:16 GMT"}], "update_date": "2010-01-13", "authors_parsed": [["Botchkarev", "Alexei", ""], ["Zhao", "Lian", ""], ["Rasouli", "Hamed", ""]]}, {"id": "1001.1937", "submitter": "Ali Parandehgheibi", "authors": "Ali Parandehgheibi, Muriel Medard, Srinivas Shakkottai, Asu Ozdaglar", "title": "Avoiding Interruptions - QoE Trade-offs in Block-coded Streaming Media\n  Applications", "comments": "Submitted to ISIT 2010 - Full version", "journal-ref": null, "doi": null, "report-no": "MIT - RLE report #730", "categories": "cs.MM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We take an analytical approach to study Quality of user Experience (QoE) for\nvideo streaming applications. First, we show that random linear network coding\napplied to blocks of video frames can significantly simplify the packet\nrequests at the network layer and save resources by avoiding duplicate packet\nreception. Network coding allows us to model the receiver's buffer as a queue\nwith Poisson arrivals and deterministic departures. We consider the probability\nof interruption in video playback as well as the number of initially buffered\npackets (initial waiting time) as the QoE metrics. We characterize the optimal\ntrade-off between these metrics by providing upper and lower bounds on the\nminimum initial buffer size, required to achieve certain level of interruption\nprobability for different regimes of the system parameters. Our bounds are\nasymptotically tight as the file size goes to infinity.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jan 2010 16:13:50 GMT"}, {"version": "v2", "created": "Thu, 4 Feb 2010 16:26:43 GMT"}], "update_date": "2010-02-04", "authors_parsed": [["Parandehgheibi", "Ali", ""], ["Medard", "Muriel", ""], ["Shakkottai", "Srinivas", ""], ["Ozdaglar", "Asu", ""]]}, {"id": "1001.1972", "submitter": "Rdv Ijcsis", "authors": "Amanpreet Kaur, Renu Dhir, Geeta Sikka", "title": "A New Image Steganography Based On First Component Alteration Technique", "comments": "4 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS December 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 3, pp. 053-056, December 2009, USA", "doi": null, "report-no": "Volume 6, No. 3, ISSN 1947 5500", "categories": "cs.MM cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, A new image steganography scheme is proposed which is a kind\nof spatial domain technique. In order to hide secret data in cover-image, the\nfirst component alteration technique is used. Techniques used so far focuses\nonly on the two or four bits of a pixel in a image (at the most five bits at\nthe edge of an image) which results in less peak to signal noise ratio and high\nroot mean square error. In this technique, 8 bits of blue components of pixels\nare replaced with secret data bits. Proposed scheme can embed more data than\nprevious schemes and shows better image quality. To prove this scheme, several\nexperiments are performed, and are compared the experimental results with the\nrelated previous works.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jan 2010 18:30:20 GMT"}], "update_date": "2010-01-13", "authors_parsed": [["Kaur", "Amanpreet", ""], ["Dhir", "Renu", ""], ["Sikka", "Geeta", ""]]}, {"id": "1001.1974", "submitter": "Rdv Ijcsis", "authors": "Malik Sikandar Hayat Khiyal, Aihab Khan, Sehrish Amjad, M. Shahid\n  Khalil", "title": "Evaluating Effectiveness of Tamper Proofing on Dynamic Graph Software\n  Watermarks", "comments": "7 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS December 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 3, pp. 057-063, December 2009, USA", "doi": null, "report-no": "Volume 6, No. 3, ISSN 1947 5500", "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For enhancing the protection level of dynamic graph software watermarks and\nfor the purpose of conducting the analysis which evaluates the effect of\nintegrating two software protection techniques such as software watermarking\nand tamper proofing, constant encoding technique along with the enhancement\nthrough the idea of constant splitting is proposed. In this paper Thomborson\ntechnique has been implemented with the scheme of breaking constants which\nenables to encode all constants without having any consideration about their\nvalues with respect to the value of watermark tree. Experimental analysis which\nhave been conducted and provided in this paper concludes that the constant\nencoding process significantly increases the code size, heap space usage, and\nexecution time, while making the tamper proofed code resilient to variety of\nsemantic preserving program transformation attacks.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jan 2010 18:34:24 GMT"}], "update_date": "2010-01-13", "authors_parsed": [["Khiyal", "Malik Sikandar Hayat", ""], ["Khan", "Aihab", ""], ["Amjad", "Sehrish", ""], ["Khalil", "M. Shahid", ""]]}, {"id": "1001.2280", "submitter": "Rdv Ijcsis", "authors": "Manjur S Kolhar, Mosleh M. Abu-Alhaj, Omar Abouabdalla, Tat Chee Wan,\n  and Ahmad M. Manasrah", "title": "Comparative Evaluation and Analysis of IAX and RSW", "comments": "3 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS December 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 3, pp. 250-252, December 2009, USA", "doi": null, "report-no": "Volume 6, No. 3, ISSN 1947 5500", "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Voice over IP (VoIP) is a technology to transport media over IP networks such\nas the Internet. VoIP has the capability of connecting people over packet\nswitched networks instead of traditional circuit switched networks. Recently,\nthe InterAsterisk Exchange Protocol (IAX) has emerged as a new VoIP which is\ngaining popularity among VoIP products. IAX is known for its simplicity, NAT\nfriendliness, efficiency, and robustness. More recently, the Real time\nSwitching (RSW) control criterion has emerged as a multimedia conferencing\nprotocol. In this paper, we made a comparative evaluation and analysis of IAX\nand RSW using Mean Opinion Score rating (MOS) and found that they both perform\nwell under different network packet delays in ms.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jan 2010 19:29:02 GMT"}], "update_date": "2010-01-14", "authors_parsed": [["Kolhar", "Manjur S", ""], ["Abu-Alhaj", "Mosleh M.", ""], ["Abouabdalla", "Omar", ""], ["Wan", "Tat Chee", ""], ["Manasrah", "Ahmad M.", ""]]}, {"id": "1001.3744", "submitter": "T.R. Gopalakrishnan Nair", "authors": "P. Jayarekha, T.R. Gopalakrishnan Nair", "title": "Multicast Transmission Prefix and Popularity Aware Interval Caching\n  Based Admission Control Policy", "comments": "17 pages,", "journal-ref": "Innovations-2008, pp 15-31, 2008", "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Admission control is a key component in multimedia servers, which will allow\nthe resources to be used by the client only when they are available. A problem\nfaced by numerous content serving machines is overload, when there are too many\nclients who need to be served, the server tends to slow down. An admission\ncontrol algorithm for a multimedia server is responsible for determining if a\nnew request can be accepted without violating the QoS requirements of the\nexisting requests in the system. By caching and streaming only the data in the\ninterval between two successive requests on the same object, the following\nrequest can be serviced directly from the buffer cache without disk operations\nand within the deadline of the request. An admission control strategy based on\nPopularity-aware interval caching for Prefix [3] scheme extends the interval\ncaching by considering different popularity of multimedia objects. The method\nof Prefix caching with multicast transmission of popular objects utilizes the\nhard disk and network bandwidth efficiently and increases the number of\nrequests being served.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jan 2010 08:57:27 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Jayarekha", "P.", ""], ["Nair", "T. R. Gopalakrishnan", ""]]}, {"id": "1001.3774", "submitter": "T.R. Gopalakrishnan Nair", "authors": "M. Dakshayini, T.R. Gopalakrishan Nair", "title": "Cooperative Proxy Servers Architecture for VoD to Achieve High QoS with\n  Reduced Transmission Time and Cost", "comments": "12 pages, 6 figures", "journal-ref": "Innovations-2008, pp 103-114, 2008", "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  - The aim of this paper is to propose a novel Voice On Demand (VoD)\narchitecture and implementation of an efficient load sharing algorithm to\nachieve Quality of Service (QoS). This scheme reduces the transmission cost\nfrom the Centralized Multimedia Sever (CMS) to Proxy Servers (PS) by sharing\nthe videos among the proxy servers of the Local Proxy Servers Group [LPSG] and\namong the neighboring LPSGs, which are interconnected in a ring fashion. This\nresults in very low request rejection ratio, reduction in transmission time and\ncost, reduction of load on the CMS and high QoS for the users. Simulation\nresults indicate acceptable initial startup latency, reduced transmission cost\nand time, load sharing among the proxy servers, among the LPSGs and between the\nCMS and the PS.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jan 2010 11:08:42 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Dakshayini", "M.", ""], ["Nair", "T. R. Gopalakrishan", ""]]}, {"id": "1001.4135", "submitter": "T.R. Gopalakrishnan Nair", "authors": "P. Jayarekha, T.R. Gopalakrishnan Nair", "title": "An Adaptive Dynamic Replacement Approach for a Multicast based\n  Popularity Aware Prefix Cache Memory System", "comments": "7 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we have proposed an adaptive dynamic cache replacement\nalgorithm for a multimedia servers cache system. The goal is to achieve an\neffective utilization of the cache memory which stores the prefix of popular\nvideos. A replacement policy is usually evaluated using hit ratio, the\nfrequency with which any video is requested. Usually discarding the least\nrecently used page is the policy of choice in cache management. The adaptive\ndynamic replacement approach for prefix cache is a self tuning, low overhead\nalgorithm that responds online to changing access patterns. It constantly\nbalances between lru and lfu to improve combined result. It automatically\nadapts to evolving workloads. Since in our algorithm we have considered a\nprefix caching with multicast transmission of popular objects it utilizes the\nhard disk and network bandwidth efficiently and increases the number of\nrequests being served.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jan 2010 07:20:30 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Jayarekha", "P.", ""], ["Nair", "T. R. Gopalakrishnan", ""]]}]