[{"id": "0810.4000", "submitter": "Victor Lebreton", "authors": "Victor Lebreton (CES)", "title": "Le trading algorithmique", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The algorithmic trading comes from digitalisation of the processing of\ntrading assets on financial markets. Since 1980 the computerization of the\nstock market offers real time processing of financial information. This\ntechnological revolution has offered processes and mathematic methods to\nidentify best return on transactions. Current research relates to autonomous\ntransaction systems programmed in certain periods and some algorithms. This\noffers return opportunities where traders can not intervene. There are about\nthirty algorithms to assist the traders, the best known are the VWAP, the TWAP,\nTVOL. The algorithms offer the latest strategies and decision-making are the\nsubject of much research. These advances in modeling decision-making autonomous\nagent can envisage a rich future for these technologies, the players already in\nuse for more than 30% of their trading.\n", "versions": [{"version": "v1", "created": "Wed, 22 Oct 2008 08:23:10 GMT"}, {"version": "v2", "created": "Thu, 19 Mar 2009 10:38:33 GMT"}], "update_date": "2009-03-19", "authors_parsed": [["Lebreton", "Victor", "", "CES"]]}, {"id": "0810.4844", "submitter": "Miquel Montero", "authors": "Miquel Montero", "title": "Predator-Prey Model for Stock Market Fluctuations", "comments": "revtex, 31 pages in preprint style, 12 figures; new material added", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a dynamical model for the price evolution of financial assets. The\nmodel is based in a two level structure. In the first stage one finds an\nagent-based model that describes the present state of the investors' beliefs,\nperspectives or strategies. The dynamics is inspired by a model for describing\npredator-prey population evolution: agents change their mind through self- or\nmutual interaction, and the decision is adopted on a random basis, with no\ndirect influence of the price itself. One of the most appealing properties of\nsuch a system is the presence of large oscillations in the number of agents\nsharing the same perspective, what may be linked with the existence of bullish\nand bearish periods in financial markets. In the second stage one has the\npricing mechanism, which will be driven by the relative population in the\ndifferent investors' groups. The price equation will depend on the specific\nnature of the species, and thus it may change from one market to the other: we\nwill firstly present a simple model of excess demand, and subsequently consider\na more elaborate liquidity model. The outcomes of both models are analysed and\ncompared.\n", "versions": [{"version": "v1", "created": "Mon, 27 Oct 2008 15:36:24 GMT"}, {"version": "v2", "created": "Fri, 16 Jan 2009 18:16:42 GMT"}, {"version": "v3", "created": "Tue, 3 Mar 2009 18:02:11 GMT"}, {"version": "v4", "created": "Thu, 30 Jul 2009 14:22:09 GMT"}], "update_date": "2009-07-30", "authors_parsed": [["Montero", "Miquel", ""]]}]