[{"id": "0811.1561", "submitter": "Michel Fliess", "authors": "Michel Fliess (LIX, INRIA Saclay - Ile de France), C\\'edric Join\n  (INRIA Saclay - Ile de France, CRAN)", "title": "Time Series Technical Analysis via New Fast Estimation Methods: A\n  Preliminary Study in Mathematical Finance", "comments": null, "journal-ref": "IAR-ACD08 (23rd IAR Workshop on Advanced Control and Diagnosis)\n  (2008)", "doi": null, "report-no": null, "categories": "stat.AP math.AC math.OC math.ST q-fin.CP q-fin.TR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  New fast estimation methods stemming from control theory lead to a fresh look\nat time series, which bears some resemblance to \"technical analysis\". The\nresults are applied to a typical object of financial engineering, namely the\nforecast of foreign exchange rates, via a \"model-free\" setting, i.e., via\nrepeated identifications of low order linear difference equations on sliding\nshort time windows. Several convincing computer simulations, including the\nprediction of the position and of the volatility with respect to the forecasted\ntrendline, are provided. $\\mathcal{Z}$-transform and differential algebra are\nthe main mathematical tools.\n", "versions": [{"version": "v1", "created": "Mon, 10 Nov 2008 19:58:38 GMT"}, {"version": "v2", "created": "Sun, 16 Nov 2008 10:38:59 GMT"}], "update_date": "2009-03-23", "authors_parsed": [["Fliess", "Michel", "", "LIX, INRIA Saclay - Ile de France"], ["Join", "Cédric", "", "INRIA Saclay - Ile de France, CRAN"]]}, {"id": "0811.2084", "submitter": "Jan Sladkowski", "authors": "Edward W. Piotrowski and Jan Sladkowski", "title": "A model of subjective supply-demand: the maximum Boltzmann/Shannon\n  entropy solution", "comments": "Presented at the SIGMAPHI 08 Conference", "journal-ref": null, "doi": "10.1088/1742-5468/2009/03/P03035", "report-no": null, "categories": "q-fin.TR physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate activities that have different periods of duration. We define\nthe profit intensity as a measure of this economic category. The profit\nintensity in a repeated trading has a unique property of attaining its maximum\nat a fixed point regardless of the shape of demand curves for a wide class of\nprobability distributions of random reverse transaction (ie closing of the\nposition). This type of market games is often considered in the research aiming\nat finding an algorithm that maximizes profit of a trader who negotiates prices\nwith the Rest of the World (a collective opponent) that posses a definite and\nobjective supply profile. Such idealization neglects the sometimes important\ninfluence of an individual trader on the demand/supply profile of the Rest of\nthe World and in extreme cases questions the very idea of demand/supply\nprofile. Therefore we put forward a trading model in which the demand/supply\nprofile of the Rest of the World induces the (rational) trader to\n(subjectively) presume that he/she lacks (almost) all knowledge concerning the\nmarket but his/hers average frequency of trade. This point of view introduces\nmaximum entropy principles into the model and broadens the range of economics\nphenomena that can be perceived as a sort of thermodynamical system. As a\nconsequence, the profit intensity has a fixed point:the profit in tensity\nreaches its maximum when the probability of transaction is given by the Golden\nRatio rule $\\frac{\\sqrt{5}-1}{2}$.\n", "versions": [{"version": "v1", "created": "Thu, 13 Nov 2008 16:44:31 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Piotrowski", "Edward W.", ""], ["Sladkowski", "Jan", ""]]}, {"id": "0811.3988", "submitter": "Daniel Fenn", "authors": "Daniel J. Fenn, Mason A. Porter, Mark McDonald, Stacy Williams, Neil\n  F. Johnson and Nick S. Jones", "title": "Dynamic communities in multichannel data: An application to the foreign\n  exchange market during the 2007--2008 credit crisis", "comments": "8 pages, 6 figures, accepted for publication in Chaos", "journal-ref": "Chaos, Vol. 19, No. 3: 033119 (2009)", "doi": "10.1063/1.3184538", "report-no": null, "categories": "physics.soc-ph nlin.AO physics.data-an q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the cluster dynamics of multichannel (multivariate) time series by\nrepresenting their correlations as time-dependent networks and investigating\nthe evolution of network communities. We employ a node-centric approach that\nallows us to track the effects of the community evolution on the functional\nroles of individual nodes without having to track entire communities. As an\nexample, we consider a foreign exchange market network in which each node\nrepresents an exchange rate and each edge represents a time-dependent\ncorrelation between the rates. We study the period 2005-2008, which includes\nthe recent credit and liquidity crisis. Using dynamical community detection, we\nfind that exchange rates that are strongly attached to their community are\npersistently grouped with the same set of rates, whereas exchange rates that\nare important for the transfer of information tend to be positioned on the\nedges of communities. Our analysis successfully uncovers major trading changes\nthat occurred in the market during the credit crisis.\n", "versions": [{"version": "v1", "created": "Mon, 24 Nov 2008 22:32:01 GMT"}, {"version": "v2", "created": "Fri, 27 Mar 2009 14:03:34 GMT"}, {"version": "v3", "created": "Wed, 1 Jul 2009 09:06:11 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Fenn", "Daniel J.", ""], ["Porter", "Mason A.", ""], ["McDonald", "Mark", ""], ["Williams", "Stacy", ""], ["Johnson", "Neil F.", ""], ["Jones", "Nick S.", ""]]}, {"id": "0811.4256", "submitter": "Valentina Alfi", "authors": "V. Alfi, M. Cristelli, L. Pietronero, A. Zaccaria", "title": "Mechanisms of Self-Organization and Finite Size Effects in a Minimal\n  Agent Based Model", "comments": "14 pages, 7 figures", "journal-ref": null, "doi": "10.1088/1742-5468/2009/03/P03016", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a detailed analysis of the self-organization phenomenon in which\nthe stylized facts originate from finite size effects with respect to the\nnumber of agents considered and disappear in the limit of an infinite\npopulation. By introducing the possibility that agents can enter or leave the\nmarket depending on the behavior of the price, it is possible to show that the\nsystem self-organizes in a regime with a finite number of agents which\ncorresponds to the stylized facts. The mechanism to enter or leave the market\nis based on the idea that a too stable market is unappealing for traders while\nthe presence of price movements attracts agents to enter and speculate on the\nmarket. We show that this mechanism is also compatible with the idea that\nagents are scared by a noisy and risky market at shorter time scales. We also\nshow that the mechanism for self-organization is robust with respect to\nvariations of the exit/entry rules and that the attempt to trigger the system\nto self-organize in a region without stylized facts leads to an unrealistic\ndynamics. We study the self-organization in a specific agent based model but we\nbelieve that the basic ideas should be of general validity.\n", "versions": [{"version": "v1", "created": "Wed, 26 Nov 2008 09:35:02 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Alfi", "V.", ""], ["Cristelli", "M.", ""], ["Pietronero", "L.", ""], ["Zaccaria", "A.", ""]]}]