[{"id": "0902.2065", "submitter": "Mohammed Saif", "authors": "M. Ali Saif and Prashant M. Gade", "title": "Emergence of Power Law in a Market with Mixed Models", "comments": "18 pages and 9 figures", "journal-ref": "Physica A 384 (2007) 448", "doi": "10.1016/j.physa.2007.03.058", "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the problem of wealth distribution from the viewpoint of asset\nexchange. Robust nature of Pareto's law across economies, ideologies and\nnations suggests that this could be an outcome of trading strategies. However,\nthe simple asset exchange models fail to reproduce this feature. A yardsale(YS)\nmodel in which amount put on the bet is a fraction of minimum of the two\nplayers leads to condensation of wealth in hands of some agent while theft and\nfraud(TF) model in which the amount to be exchanged is a fraction of loser's\nwealth leads to an exponential distribution of wealth. We show that if we allow\nfew agents to follow a different model than others, {\\it i.e.} there are some\nagents following TF model while rest follow YS model, it leads to distribution\nwith power law tails. Similar effect is observed when one carries out\ntransactions for a fraction of one's wealth using TF model and for the rest YS\nmodel is used. We also observe a power law tail in wealth distribution if we\nallow the agents to follow either of the models with some probability.\n", "versions": [{"version": "v1", "created": "Thu, 12 Feb 2009 09:46:06 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Saif", "M. Ali", ""], ["Gade", "Prashant M.", ""]]}, {"id": "0902.2070", "submitter": "Mohammed Saif", "authors": "M. Ali Saif and Prashant M. Gade", "title": "Effects of introduction of new resources and fragmentation of existing\n  resources on limiting wealth distribution in asset exchange models", "comments": "15 pages and 6 figures", "journal-ref": "Physica A 388 (2009) 697", "doi": "10.1016/j.physa.2008.11.004", "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pareto law, which states that wealth distribution in societies have a\npower-law tail, has been a subject of intensive investigations in statistical\nphysics community. Several models have been employed to explain this behavior.\nHowever, most of the agent based models assume the conservation of number of\nagents and wealth. Both these assumptions are unrealistic. In this paper, we\nstudy the limiting wealth distribution when one or both of these assumptions\nare not valid. Given the universality of the law, we have tried to study the\nwealth distribution from the asset exchange models point of view. We consider\nmodels in which a) new agents enter the market at constant rate b) richer\nagents fragment with higher probability introducing newer agents in the system\nc) both fragmentation and entry of new agents is taking place. While models a)\nand c) do not conserve total wealth or number of agents, model b) conserves\ntotal wealth. All these models lead to a power-law tail in the wealth\ndistribution pointing to the possibility that more generalized asset exchange\nmodels could help us to explain emergence of power-law tail in wealth\ndistribution.\n", "versions": [{"version": "v1", "created": "Thu, 12 Feb 2009 10:09:32 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Saif", "M. Ali", ""], ["Gade", "Prashant M.", ""]]}, {"id": "0902.2429", "submitter": "Shipra Agrawal", "authors": "Shipra Agrawal, Erick Delage, Mark Peters, Zizhuo Wang, Yinyu Ye", "title": "A Unified Framework for Dynamic Pari-Mutuel Information Market Design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, several new pari-mutuel mechanisms have been introduced to organize\nmarkets for contingent claims. Hanson introduced a market maker derived from\nthe logarithmic scoring rule, and later Chen and Pennock developed a cost\nfunction formulation for the market maker. On the other hand, the SCPM model of\nPeters et al. is based on ideas from a call auction setting using a convex\noptimization model. In this work, we develop a unified framework that bridges\nthese seemingly unrelated models for centrally organizing contingent claim\nmarkets. The framework, developed as a generalization of the SCPM, will support\nmany desirable properties such as proper scoring, truthful bidding (in a myopic\nsense), efficient computation, and guarantees on worst case loss. In fact, our\nunified framework will allow us to express various proper scoring rules,\nexisting or new, from classical utility functions in a convex optimization\nproblem representing the market organizer. Additionally, we utilize concepts\nfrom duality to show that the market model is equivalent to a risk minimization\nproblem where a convex risk measure is employed. This will allow us to more\nclearly understand the differences in the risk attitudes adopted by various\nmechanisms, and particularly deepen our intuition about popular mechanisms like\nHanson's market-maker. In aggregate, we believe this work advances our\nunderstanding of the objectives that the market organizer is optimizing in\npopular pari-mutuel mechanisms by recasting them into one unified framework.\n", "versions": [{"version": "v1", "created": "Sat, 14 Feb 2009 03:11:00 GMT"}], "update_date": "2009-02-17", "authors_parsed": [["Agrawal", "Shipra", ""], ["Delage", "Erick", ""], ["Peters", "Mark", ""], ["Wang", "Zizhuo", ""], ["Ye", "Yinyu", ""]]}, {"id": "0902.2516", "submitter": "Mike Ludkovski", "authors": "Erhan Bayraktar and Mike Ludkovski", "title": "Optimal Trade Execution in Illiquid Markets", "comments": null, "journal-ref": "Mathematical Finance 21(4), pp. 681-701, 2011", "doi": "10.1111/j.1467-9965.2010.00446", "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study optimal trade execution strategies in financial markets with\ndiscrete order flow. The agent has a finite liquidation horizon and must\nminimize price impact given a random number of incoming trade counterparties.\nAssuming that the order flow $N$ is given by a Poisson process, we give a full\nanalysis of the properties and computation of the optimal dynamic execution\nstrategy. Extensions, whereby (a) $N$ is a fully-observed regime-switching\nPoisson process; and (b) $N$ is a Markov-modulated compound Poisson process\ndriven by a hidden Markov chain, are also considered.\n  We derive and compare the properties of the three cases and illustrate our\nresults with computational examples.\n", "versions": [{"version": "v1", "created": "Sun, 15 Feb 2009 02:23:03 GMT"}], "update_date": "2012-05-07", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Ludkovski", "Mike", ""]]}, {"id": "0902.3840", "submitter": "Samuel V\\'azquez", "authors": "Samuel E. Vazquez", "title": "Scale Invariance, Bounded Rationality and Non-Equilibrium Economics", "comments": "40 pages, 17 figs", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a class of heterogeneous agent-based models which are based on a\nbasic set of principles, and the most fundamental operations of an economic\nsystem: trade and product transformations.\n  A basic guiding principle is scale invariance, which means that the dynamics\nof the economy should not depend on the units used to measure the different\nproducts. We develop the idea of a \"near-equilibrium\" expansion which allow us\nto study the dynamics of fluctuations around economic equilibrium. This is\nsimilar to the familiar \"perturbation theory\" studied in many areas of physics.\nWe study some simple models of both centralized and decentralized markets. We\nshow the relaxation to equilibrium when appropriate. More interestingly, we\nstudy a simple model of a decentralized market that shows a spontaneous\ntransition into a monetary phase. We use mean field theory analysis to provide\na statistical interpretation of the monetary phase. Furthermore, we show that\nsuch phase can be dynamically unstable. Finally, we study some simple\ncentralized financial markets, one of which shows a speculative bubble and a\ncrash.\n", "versions": [{"version": "v1", "created": "Mon, 23 Feb 2009 19:18:37 GMT"}], "update_date": "2009-02-24", "authors_parsed": [["Vazquez", "Samuel E.", ""]]}, {"id": "0902.4159", "submitter": "Matthieu Cristelli", "authors": "M. Cristelli, V. Alfi, L. Pietronero, A. Zaccaria", "title": "Liquidity Crisis, Granularity of the Order Book and Price Fluctuations", "comments": "18 pages, 7 figures", "journal-ref": null, "doi": "10.1140/epjb/e2009-00353-6", "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a microscopic model for the dynamics of the order book to study\nhow the lack of liquidity influences price fluctuations. We use the average\ndensity of the stored orders (granularity $g$) as a proxy for liquidity. This\nleads to a Price Impact Surface which depends on both volume $\\omega$ and $g$.\nThe dependence on the volume (averaged over the granularity) of the Price\nImpact Surface is found to be a concave power law function\n$<\\phi(\\omega,g)>_g\\sim\\omega^\\delta$ with $\\delta\\approx 0.59$. Instead the\ndependence on the granularity is $\\phi(\\omega,g|\\omega)\\sim g^\\alpha$ with\n$\\alpha\\approx-1$, showing a divergence of price fluctuations in the limit\n$g\\to 0$. Moreover, even in intermediate situations of finite liquidity, this\neffect can be very large and it is a natural candidate for understanding the\norigin of large price fluctuations.\n", "versions": [{"version": "v1", "created": "Tue, 24 Feb 2009 14:40:03 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2009 14:32:56 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Cristelli", "M.", ""], ["Alfi", "V.", ""], ["Pietronero", "L.", ""], ["Zaccaria", "A.", ""]]}]