[{"id": "1001.0656", "submitter": "Leilei Shi", "authors": "Leilei Shi (1), Yiwen Wang (2), Ding Chen (3), Liyan Han (2), Yan Piao\n  and Chengling Gou (4) ((1) Complex System Research Group, Department of\n  Modern Physics University of Science and Technology of China (2) Department\n  of Finance, Beijing University of Aeronautics and Astronautics (3) Harvest\n  Fund Management Co. Ltd. (4) Department of Physics, Beijing University of\n  Aeronautics and Astronautics)", "title": "A Security Price Volatile Trading Conditioning Model", "comments": "23x2 pages, 7x2 figures, 1x2 tables and in both English and Chinese\n  versions", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a theoretical trading conditioning model subject to price\nvolatility and return information in terms of market psychological behavior,\nbased on analytical transaction volume-price probability wave distributions in\nwhich we use transaction volume probability to describe price volatility\nuncertainty and intensity. Applying the model to high frequent data test in\nChina stock market, we have main findings as follows: 1) there is, in general,\nsignificant positive correlation between the rate of mean return and that of\nchange in trading conditioning intensity; 2) it lacks significance in spite of\npositive correlation in two time intervals right before and just after bubble\ncrashes; and 3) it shows, particularly, significant negative correlation in a\ntime interval when SSE Composite Index is rising during bull market. Our model\nand findings can test both disposition effect and herd behavior simultaneously,\nand explain excessive trading (volume) and other anomalies in stock market.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jan 2010 09:31:27 GMT"}, {"version": "v2", "created": "Tue, 9 Feb 2010 14:32:43 GMT"}], "update_date": "2010-02-09", "authors_parsed": [["Shi", "Leilei", ""], ["Wang", "Yiwen", ""], ["Chen", "Ding", ""], ["Han", "Liyan", ""], ["Piao", "Yan", ""], ["Gou", "Chengling", ""]]}, {"id": "1001.0880", "submitter": "Leilei Shi", "authors": "Leilei Shi (1)(2)(3) ((1)Department of Systems Science, School of\n  Management, Beijing Normal University (2) Complex System Research Group,\n  Department of Modern Physics, University of Science and Technology of China\n  (3) Generali-China Life Insurance Co., Ltd.)", "title": "Does Security Transaction Volume-Price Behavior Resemble a Probability\n  Wave?", "comments": "20 pages, 6 figures, and 2 Appendixes", "journal-ref": "Physica A 366 (2006), 419-436", "doi": "10.1016/j.physa.2005.10.016", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by how transaction amount constrain trading volume and price\nvolatility in stock market, we, in this paper, study the relation between\nvolume and price if amount of transaction is given. We find that accumulative\ntrading volume gradually emerges a kurtosis near the price mean value over a\ntrading price range when it takes a longer trading time, regardless of actual\nprice fluctuation path, time series, or total transaction volume in the time\ninterval. To explain the volume-price behavior, we, in terms of physics,\npropose a transaction energy hypothesis, derive a time-independent transaction\nvolume-price probability wave equation, and get two sets of analytical volume\ndistribution eigenfunctions over a trading price range. By empiric test, we\nshow the existence of coherence in stock market and demonstrate the model\nvalidation at this early stage. The volume-price behaves like a probability\nwave.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jan 2010 12:33:20 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Shi", "Leilei", ""]]}, {"id": "1001.2549", "submitter": "Bence T\\'oth", "authors": "Bence Toth, Fabrizio Lillo, J. Doyne Farmer", "title": "Segmentation algorithm for non-stationary compound Poisson processes", "comments": "11 pages, 11 figures", "journal-ref": "Eur. Phys. J. B 78, 235-243 (2010)", "doi": "10.1140/epjb/e2010-10046-8", "report-no": null, "categories": "physics.data-an physics.soc-ph q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an algorithm for the segmentation of a class of regime switching\nprocesses. The segmentation algorithm is a non parametric statistical method\nable to identify the regimes (patches) of the time series. The process is\ncomposed of consecutive patches of variable length, each patch being described\nby a stationary compound Poisson process, i.e. a Poisson process where each\ncount is associated to a fluctuating signal. The parameters of the process are\ndifferent in each patch and therefore the time series is non stationary. Our\nmethod is a generalization of the algorithm introduced by Bernaola-Galvan, et\nal., Phys. Rev. Lett., 87, 168105 (2001). We show that the new algorithm\noutperforms the original one for regime switching compound Poisson processes.\nAs an application we use the algorithm to segment the time series of the\ninventory of market members of the London Stock Exchange and we observe that\nour method finds almost three times more patches than the original one.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jan 2010 20:25:55 GMT"}, {"version": "v2", "created": "Wed, 9 Feb 2011 21:22:26 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["Toth", "Bence", ""], ["Lillo", "Fabrizio", ""], ["Farmer", "J. Doyne", ""]]}, {"id": "1001.3455", "submitter": "Mike Ludkovski", "authors": "Michael Ludkovski", "title": "Stochastic Switching Games and Duopolistic Competition in Emissions\n  Markets", "comments": "Revised version, 24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study optimal behavior of energy producers under a CO_2 emission abatement\nprogram. We focus on a two-player discrete-time model where each producer is\nsequentially optimizing her emission and production schedules. The\ngame-theoretic aspect is captured through a reduced-form price-impact model for\nthe CO_2 allowance price. Such duopolistic competition results in a new type of\na non-zero-sum stochastic switching game on finite horizon. Existence of game\nNash equilibria is established through generalization to randomized switching\nstrategies. No uniqueness is possible and we therefore consider a variety of\ncorrelated equilibrium mechanisms. We prove existence of correlated equilibrium\npoints in switching games and give a recursive description of equilibrium game\nvalues. A simulation-based algorithm to solve for the game values is\nconstructed and a numerical example is presented.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jan 2010 04:16:05 GMT"}, {"version": "v2", "created": "Mon, 8 Feb 2010 23:52:34 GMT"}, {"version": "v3", "created": "Sat, 21 Aug 2010 18:15:44 GMT"}], "update_date": "2010-08-24", "authors_parsed": [["Ludkovski", "Michael", ""]]}, {"id": "1001.3731", "submitter": "Jie-Jun Tseng", "authors": "Jie-Jun Tseng, Sai-Ping Li, Sun-Chong Wang", "title": "Experimental evidence for the interplay between individual wealth and\n  transaction network", "comments": "6 pages, 7 figures", "journal-ref": "Eur. Phys. J. B 73, 69 - 74 (2010)", "doi": "10.1140/epjb/e2009-00424-8", "report-no": null, "categories": "physics.soc-ph q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We conduct a market experiment with human agents in order to explore the\nstructure of transaction networks and to study the dynamics of wealth\naccumulation. The experiment is carried out on our platform for 97 days with\n2,095 effective participants and 16,936 times of transactions. From these data,\nthe hybrid distribution (log-normal bulk and power-law tail) in the wealth is\nobserved and we demonstrate that the transaction networks in our market are\nalways scale-free and disassortative even for those with the size of the order\nof few hundred. We further discover that the individual wealth is correlated\nwith its degree by a power-law function which allows us to relate the exponent\nof the transaction network degree distribution to the Pareto index in wealth\ndistribution.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jan 2010 06:40:18 GMT"}], "update_date": "2010-01-22", "authors_parsed": [["Tseng", "Jie-Jun", ""], ["Li", "Sai-Ping", ""], ["Wang", "Sun-Chong", ""]]}, {"id": "1001.5124", "submitter": "Michael Christopher M\\\"unnix", "authors": "Michael C. M\\\"unnix, Rudi Sch\\\"afer, Thomas Guhr", "title": "Impact of the tick-size on financial returns and correlations", "comments": "18 pages, 10 figures", "journal-ref": "Physica A Vol. 389, No. 21 (2010)", "doi": "10.1016/j.physa.2010.06.037", "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate that the lowest possible price change (tick-size) has a large\nimpact on the structure of financial return distributions. It induces a\nmicrostructure as well as it can alter the tail behavior. On small return\nintervals, the tick-size can distort the calculation of correlations. This\nespecially occurs on small return intervals and thus contributes to the decay\nof the correlation coefficient towards smaller return intervals (Epps effect).\nWe study this behavior within a model and identify the effect in market data.\nFurthermore, we present a method to compensate this purely statistical error.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jan 2010 18:08:28 GMT"}, {"version": "v2", "created": "Fri, 19 Mar 2010 15:37:26 GMT"}, {"version": "v3", "created": "Sun, 25 Apr 2010 13:18:47 GMT"}, {"version": "v4", "created": "Mon, 12 Jul 2010 15:17:54 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Münnix", "Michael C.", ""], ["Schäfer", "Rudi", ""], ["Guhr", "Thomas", ""]]}]