[{"id": "1002.0609", "submitter": "Eric J\\\"arpe", "authors": "Maria Boguta and Eric J\\\"arpe", "title": "A new space-time model for volatility clustering in the financial market", "comments": "11 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new space-time model for interacting agents on the financial market is\npresented. It is a combination of the Curie-Weiss model and a space-time model\nintroduced by J\\\"arpe 2005. Properties of the model are derived with focus on\nthe critical temperature and magnetization. It turns out that the Hamiltonian\nis a sufficient statistic for the temperature parameter and thus statistical\ninference about this parameter can be performed. Thus e.g. statements about how\nfar the current financial situation is from a financial crisis can be made, and\nfinancial trading stability be monitored for detection of malicious risk\nindicating signals.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2010 15:32:21 GMT"}], "update_date": "2010-02-04", "authors_parsed": [["Boguta", "Maria", ""], ["Järpe", "Eric", ""]]}, {"id": "1002.0917", "submitter": "Jie-Jun Tseng", "authors": "Jie-Jun Tseng, Chih-Hao Lin, Chih-Ting Lin, Sun-Chong Wang, Sai-Ping\n  Li", "title": "Statistical properties of agent-based models in markets with continuous\n  double auction mechanism", "comments": "16 pages, 7 figures", "journal-ref": "Physica A 389, 1699 - 1707 (2010)", "doi": "10.1016/j.physa.2009.12.034", "report-no": null, "categories": "q-fin.TR physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real world markets display power-law features in variables such as price\nfluctuations in stocks. To further understand market behavior, we have\nconducted a series of market experiments on our web-based prediction market\nplatform which allows us to reconstruct transaction networks among traders.\n  From these networks, we are able to record the degree of a trader, the size\nof a community of traders, the transaction time interval among traders and\nother variables that are of interest. The distributions of all these variables\nshow power-law behavior. On the other hand, agent-based models have been\nproposed to study the properties of real financial markets. We here study the\nstatistical properties of these agent-based models and compare them with the\nresults from our web-based market experiments. In this work, three agent-based\nmodels are studied, namely, zero-intelligence (ZI), zero-intelligence-plus\n(ZIP) and Gjerstad-Dickhaut (GD). Computer simulations of variables based on\nthese three agent-based models were carried out. We found that although being\nthe most naive agent-based model, ZI indeed best describes the properties\nobserved in real markets. Our study suggests that the basic ingredient to\nproduce the observed properties from real world markets could in fact be the\nresult of a continuously evolving dynamical system with basic features similar\nto the ZI model.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2010 08:07:07 GMT"}], "update_date": "2010-02-05", "authors_parsed": [["Tseng", "Jie-Jun", ""], ["Lin", "Chih-Hao", ""], ["Lin", "Chih-Ting", ""], ["Wang", "Sun-Chong", ""], ["Li", "Sai-Ping", ""]]}, {"id": "1002.1653", "submitter": "Fei Ren", "authors": "Fei Ren and Wei-Xing Zhou", "title": "Recurrence interval analysis of trading volumes", "comments": "9 pages, 9 figures and 1 table", "journal-ref": "Physical Review E 81 (6), 066107 (2010)", "doi": "10.1103/PhysRevE.81.066107", "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the statistical properties of the recurrence intervals $\\tau$\nbetween successive trading volumes exceeding a certain threshold $q$. The\nrecurrence interval analysis is carried out for the 20 liquid Chinese stocks\ncovering a period from January 2000 to May 2009, and two Chinese indices from\nJanuary 2003 to April 2009. Similar to the recurrence interval distribution of\nthe price returns, the tail of the recurrence interval distribution of the\ntrading volumes follows a power-law scaling, and the results are verified by\nthe goodness-of-fit tests using the Kolmogorov-Smirnov (KS) statistic, the\nweighted KS statistic and the Cram{\\'{e}}r-von Mises criterion. The\nmeasurements of the conditional probability distribution and the detrended\nfluctuation function show that both short-term and long-term memory effects\nexist in the recurrence intervals between trading volumes. We further study the\nrelationship between trading volumes and price returns based on the recurrence\ninterval analysis method. It is found that large trading volumes are more\nlikely to occur following large price returns, and the comovement between\ntrading volumes and price returns is more pronounced for large trading volumes.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2010 07:06:06 GMT"}], "update_date": "2010-07-08", "authors_parsed": [["Ren", "Fei", ""], ["Zhou", "Wei-Xing", ""]]}, {"id": "1002.2171", "submitter": "Judith Wiesinger", "authors": "J. Wiesinger, D. Sornette, J. Satinover", "title": "Reverse Engineering Financial Markets with Majority and Minority Games\n  using Genetic Algorithms", "comments": "14 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.LG cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using virtual stock markets with artificial interacting software investors,\naka agent-based models (ABMs), we present a method to reverse engineer\nreal-world financial time series. We model financial markets as made of a large\nnumber of interacting boundedly rational agents. By optimizing the similarity\nbetween the actual data and that generated by the reconstructed virtual stock\nmarket, we obtain parameters and strategies, which reveal some of the inner\nworkings of the target stock market. We validate our approach by out-of-sample\npredictions of directional moves of the Nasdaq Composite Index.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2010 18:48:43 GMT"}], "update_date": "2010-02-11", "authors_parsed": [["Wiesinger", "J.", ""], ["Sornette", "D.", ""], ["Satinover", "J.", ""]]}, {"id": "1002.4641", "submitter": "Randall LaViolette", "authors": "Vitus J. Leung, Randall A. LaViolette", "title": "Sensitivity of the Performance of a Simple Exchange Model to its\n  Topology", "comments": "20 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a simple exchange model in which price is fixed and the amount of a\ngood transferred between actors depends only on the actors' respective budgets\nand the existence of a link between transacting actors. The model induces a\nsimply-connected but possibly multi-component bipartite graph. A trading\nsession on a fixed graph consists of a sequence of exchanges between connected\nbuyers and sellers until no more exchanges are possible. We deem a trading\nsession \"feasible\" if all of the buyers satisfy their respective demands. If\nall trading sessions are feasible the graph is deemed \"successful\", otherwise\nthe feasibility of a trading session depends on the order of the sequence of\nexchanges. We demonstrate that topology is important for the success of trading\nsessions on graphs. In particular, for the case that supply equals demand for\neach component of the graph, we prove that the graph is successful if and only\nif the graph consists of components each of which are complete bipartite. For\nthe case that supply exceeds demand, we prove that the other topologies also\ncan be made successful but with finite reserve (i.e., excess supply)\nrequirements that may grow proportional to the number of buyers. Finally, with\ncomputations for a small instance of the model, we provide an example of the\nwide range of performance in which only the connectivity varies. These results\ntaken together place limits on the improvements in performance that can be\nexpected from proposals to increase the connectivity of sparse exchange\nnetworks.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2010 21:29:23 GMT"}], "update_date": "2010-02-26", "authors_parsed": [["Leung", "Vitus J.", ""], ["LaViolette", "Randall A.", ""]]}, {"id": "1002.4744", "submitter": "Yongjoo Baek", "authors": "Yongjoo Baek, Sang Hoon Lee, Hawoong Jeong", "title": "Market behavior and performance of different strategy evaluation schemes", "comments": "10 pages, 6 figures", "journal-ref": "Phys. Rev. E 82, 026109 (2010)", "doi": "10.1103/PhysRevE.82.026109", "report-no": null, "categories": "q-fin.PM physics.soc-ph q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strategy evaluation schemes are a crucial factor in any agent-based market\nmodel, as they determine the agents' strategy preferences and consequently\ntheir behavioral pattern. This study investigates how the strategy evaluation\nschemes adopted by agents affect their performance in conjunction with the\nmarket circumstances. We observe the performance of three strategy evaluation\nschemes, the history-dependent wealth game, the trend-opposing minority game,\nand the trend-following majority game, in a stock market where the price is\nexogenously determined. The price is either directly adopted from the real\nstock market indices or generated with a Markov chain of order $\\le 2$. Each\nscheme's success is quantified by average wealth accumulated by the traders\nequipped with the scheme. The wealth game, as it learns from the history, shows\nrelatively good performance unless the market is highly unpredictable. The\nmajority game is successful in a trendy market dominated by long periods of\nsustained price increase or decrease. On the other hand, the minority game is\nsuitable for a market with persistent zig-zag price patterns. We also discuss\nthe consequence of implementing finite memory in the scoring processes of\nstrategies. Our findings suggest under which market circumstances each\nevaluation scheme is appropriate for modeling the behavior of real market\ntraders.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2010 10:49:37 GMT"}, {"version": "v2", "created": "Mon, 23 Aug 2010 04:58:27 GMT"}], "update_date": "2010-08-24", "authors_parsed": [["Baek", "Yongjoo", ""], ["Lee", "Sang Hoon", ""], ["Jeong", "Hawoong", ""]]}]