[{"id": "1101.1847", "submitter": "Matthieu Cristelli", "authors": "M. Cristelli, L. Pietronero, A. Zaccaria", "title": "Critical Overview of Agent-Based Models for Economics", "comments": "51 pages, 9 figures, Proceedings of the School of Physics \"E. Fermi\",\n  course CLXXVI, 2010, Varenna", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an overview of some representative Agent-Based Models in\nEconomics. We discuss why and how agent-based models represent an important\nstep in order to explain the dynamics and the statistical properties of\nfinancial markets beyond the Classical Theory of Economics. We perform a\nschematic analysis of several models with respect to some specific key\ncategories such as agents' strategies, price evolution, number of agents, etc.\nIn the conclusive part of this review we address some open questions and future\nperspectives and highlight the conceptual importance of some usually neglected\ntopics, such as non-stationarity and the self-organization of financial\nmarkets.\n", "versions": [{"version": "v1", "created": "Mon, 10 Jan 2011 15:28:26 GMT"}], "update_date": "2011-01-11", "authors_parsed": [["Cristelli", "M.", ""], ["Pietronero", "L.", ""], ["Zaccaria", "A.", ""]]}, {"id": "1101.3422", "submitter": "Muzy", "authors": "E. Bacry, S. Delattre, M. Hoffmann and J.F. Muzy", "title": "Modeling microstructure noise with mutually exciting point processes", "comments": "31 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new stochastic model for the variations of asset prices at the\ntick-by-tick level in dimension 1 (for a single asset) and 2 (for a pair of\nassets). The construction is based on marked point processes and relies on\nlinear self and mutually exciting stochastic intensities as introduced by\nHawkes. We associate a counting process with the positive and negative jumps of\nan asset price. By coupling suitably the stochastic intensities of upward and\ndownward changes of prices for several assets simultaneously, we can reproduce\nmicrostructure noise (i.e. strong microscopic mean reversion at the level of\nseconds to a few minutes) and the Epps effect (i.e. the decorrelation of the\nincrements in microscopic scales) while preserving a standard Brownian\ndiffusion behaviour on large scales. More effectively, we obtain analytical\nclosed-form formulae for the mean signature plot and the correlation of two\nprice increments that enable to track across scales the effect of the\nmean-reversion up to the diffusive limit of the model. We show that the\ntheoretical results are consistent with empirical fits on futures Euro-Bund and\nEuro-Bobl in several situations.\n", "versions": [{"version": "v1", "created": "Tue, 18 Jan 2011 10:46:01 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Bacry", "E.", ""], ["Delattre", "S.", ""], ["Hoffmann", "M.", ""], ["Muzy", "J. F.", ""]]}]