[{"id": "1505.00328", "submitter": "Wei-Xing Zhou", "authors": "Huai-Long Shi, Zhi-Qiang Jiang, Wei-Xing Zhou (ECUST)", "title": "Profitability of contrarian strategies in the Chinese stock market", "comments": "24 pages (including 4 figures and 9 tables) + 5 supplementary figures\n  + 10 supplementary tables", "journal-ref": "PLoS ONE 10(9), e0137892 (2015)", "doi": "10.1371/journal.pone.0137892", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper reexamines the profitability of loser, winner and contrarian\nportfolios in the Chinese stock market using monthly data of all stocks traded\non the Shanghai Stock Exchange and Shenzhen Stock Exchange covering the period\nfrom January 1997 to December 2012. We find evidence of short-term and\nlong-term contrarian profitability in the whole sample period when the\nestimation and holding horizons are 1 month or longer than 12 months and the\nannualized returns of contrarian portfolios increases with the estimation and\nholding horizons. We perform subperiod analysis and find that the long-term\ncontrarian effect is significant in both bullish and bearish states while the\nshort-term contrarian effect disappears in bullish states. We compare the\nperformance of contrarian portfolios based on different grouping manners in the\nestimation period and unveil that decile grouping outperforms quintile grouping\nand tertile grouping, which is more evident and robust in the long run.\nGenerally, loser portfolios and winner portfolios have positive returns and\nloser portfolios perform much better than winner portfolios. Both loser and\nwinner portfolios in bullish states perform better than those in the whole\nsample period. In contrast, loser and winner portfolios have smaller returns in\nbearish states in which loser portfolio returns are significant only in the\nlong term and winner portfolio returns become insignificant. These results are\nrobust to the one-month skipping between the estimation and holding periods and\nfor the two stock exchanges. Our findings show that the Chinese stock market is\nnot efficient in the weak form. These findings also have obvious practical\nimplications for financial practitioners.\n", "versions": [{"version": "v1", "created": "Sat, 2 May 2015 09:19:31 GMT"}], "update_date": "2015-09-17", "authors_parsed": [["Shi", "Huai-Long", "", "ECUST"], ["Jiang", "Zhi-Qiang", "", "ECUST"], ["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "1505.04810", "submitter": "Lingjiong Zhu", "authors": "Xin Guo, Zhao Ruan, Lingjiong Zhu", "title": "Dynamics of Order Positions and Related Queues in a Limit Order Book", "comments": "42 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Order positions are key variables in algorithmic trading. This paper studies\nthe limiting behavior of order positions and related queues in a limit order\nbook. In addition to the fluid and diffusion limits for the processes,\nfluctuations of order positions and related queues around their fluid limits\nare analyzed. As a corollary, explicit analytical expressions for various\nquantities of interests in a limit order book are derived.\n", "versions": [{"version": "v1", "created": "Mon, 18 May 2015 20:22:42 GMT"}, {"version": "v2", "created": "Tue, 13 Oct 2015 19:36:42 GMT"}], "update_date": "2015-10-14", "authors_parsed": [["Guo", "Xin", ""], ["Ruan", "Zhao", ""], ["Zhu", "Lingjiong", ""]]}, {"id": "1505.04936", "submitter": "Mathieu Rosenbaum", "authors": "Weibing Huang and Mathieu Rosenbaum", "title": "Ergodicity and diffusivity of Markovian order book models: a general\n  framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general Markovian framework for order book modeling. Through our\napproach, we aim at providing a tool enabling to get a better understanding of\nthe price formation process and of the link between microscopic and macroscopic\nfeatures of financial assets. To do so, we propose a new method of order book\nrepresentation, and decompose the problem of order book modeling into two\nsub-problems: dynamics of a continuous-time double auction system with a fixed\nreference price; interactions between the double auction system and the\nreference price movements. State dependency is included in our framework by\nallowing the order flow intensities to depend on the order book state.\nFurthermore, contrary to most existing models, the impact of the order book\nupdates on the reference price dynamics is not assumed to be instantaneous. We\nfirst prove that under general assumptions, our system is ergodic. Then we\ndeduce the convergence towards a Brownian motion of the rescaled price process.\n", "versions": [{"version": "v1", "created": "Tue, 19 May 2015 09:58:41 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Huang", "Weibing", ""], ["Rosenbaum", "Mathieu", ""]]}]