[{"id": "1507.01610", "submitter": "Grigory Temnov Dr", "authors": "Grigory Temnov", "title": "Analysis of Ornstein-Uhlenbeck process stopped at maximum drawdown and\n  application to trading strategies with trailing stops", "comments": "19 pages, 10 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a strategy for automated trading, outline theoretical\njustification of the profitability of this strategy and overview the\nhypothetical results in application to currency pairs trading. The proposed\nmethodology relies on the assumption that processes reflecting the dynamics of\ncurrency exchange rates are in a certain sense similar to the class of\nOrnstein-Uhlenbeck processes and exhibits the mean reverting property. In order\nto describe the quantitative characteristics of the projected return of the\nstrategy, we derive the explicit expression for the running maximum of the\nOrnstein-Uhlenbeck process stopped at maximum drawdown and look at the\ncorrespondence between derived characteristics and the observed ones.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jul 2015 20:07:44 GMT"}], "update_date": "2015-07-09", "authors_parsed": [["Temnov", "Grigory", ""]]}, {"id": "1507.05376", "submitter": "Misha Perepelitsa", "authors": "Misha Perepelitsa", "title": "The time scales of the aggregate learning and sorting in market entry\n  games with large number of players", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the dynamics of player's strategies in repeated market games,\nwhere the selection of strategies is determined by a learning model. Prior\ntheoretical analysis and experimental data show that after large number of\nplays the average number of agents who decide to enter, per round of the game,\napproaches the market capacity and, after a longer wait, agents are being\nsorted into two groups: the agents in one group rarely enter the market, and in\nthe other, the agents enter almost all the time. In this paper we obtain\nestimates of the characteristic times it takes for both patterns to emerge in\nthe repeated plays of the game. The estimates are given in terms of the\nparameters of the game, assuming that the number of agents is large, the number\nof rounds of the game per unit of time is large, and the characteristic change\nof the propensity per game is small. Our approach is based on the analysis of\nthe partial differential equation for the function $f(t,q)$ that describes the\ndistribution of agents according to their level of propensity to enter the\nmarket, $q,$ at time $t.$\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2015 03:28:07 GMT"}, {"version": "v2", "created": "Fri, 18 Sep 2015 16:25:32 GMT"}], "update_date": "2015-09-21", "authors_parsed": [["Perepelitsa", "Misha", ""]]}, {"id": "1507.06514", "submitter": "Amirhossein Sadoghi", "authors": "A. Sadoghi, J. Vecer", "title": "Optimum Liquidation Problem Associated with the Poisson Cluster Process", "comments": "46 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this research, we develop a trading strategy for the discrete-time optimal\nliquidation problem of large order trading with different market\nmicrostructures in an illiquid market. In this framework, the flow of orders\ncan be viewed as a point process with stochastic intensity. We model the price\nimpact as a linear function of a self-exciting dynamic process. We formulate\nthe liquidation problem as a discrete-time Markov Decision Processes, where the\nstate process is a Piecewise Deterministic Markov Process (PDMP). The numerical\nresults indicate that an optimal trading strategy is dependent on\ncharacteristics of the market microstructure. When no orders above certain\nvalue come the optimal solution takes offers in the lower levels of the limit\norder book in order to prevent not filling of orders and facing final inventory\ncosts.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2015 14:33:55 GMT"}, {"version": "v2", "created": "Fri, 25 Dec 2015 10:43:02 GMT"}], "update_date": "2015-12-29", "authors_parsed": [["Sadoghi", "A.", ""], ["Vecer", "J.", ""]]}, {"id": "1507.07052", "submitter": "Mathieu Rosenbaum", "authors": "Weibing Huang, Charles-Albert Lehalle, Mathieu Rosenbaum", "title": "How to predict the consequences of a tick value change? Evidence from\n  the Tokyo Stock Exchange pilot program", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tick value is a crucial component of market design and is often\nconsidered the most suitable tool to mitigate the effects of high frequency\ntrading. The goal of this paper is to demonstrate that the approach introduced\nin Dayri and Rosenbaum (2015) allows for an ex ante assessment of the\nconsequences of a tick value change on the microstructure of an asset. To that\npurpose, we analyze the pilot program on tick value modifications started in\n2014 by the Tokyo Stock Exchange in light of this methodology. We focus on\nforecasting the future cost of market and limit orders after a tick value\nchange and show that our predictions are very accurate. Furthermore, for each\nasset involved in the pilot program, we are able to define (ex ante) an optimal\ntick value. This enables us to classify the stocks according to the relevance\nof their tick value, before and after its modification.\n", "versions": [{"version": "v1", "created": "Sat, 25 Jul 2015 01:54:15 GMT"}], "update_date": "2015-07-28", "authors_parsed": [["Huang", "Weibing", ""], ["Lehalle", "Charles-Albert", ""], ["Rosenbaum", "Mathieu", ""]]}]