[{"id": "1606.01495", "submitter": "Donovan Platt", "authors": "Donovan Platt, Tim Gebbie", "title": "The Problem of Calibrating an Agent-Based Model of High-Frequency\n  Trading", "comments": "28 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agent-based models, particularly those applied to financial markets,\ndemonstrate the ability to produce realistic, simulated system dynamics,\ncomparable to those observed in empirical investigations. Despite this, they\nremain fairly difficult to calibrate due to their tendency to be\ncomputationally expensive, even with recent advances in technology. For this\nreason, financial agent-based models are frequently validated by demonstrating\nan ability to reproduce well-known log return time series and central limit\norder book stylized facts, as opposed to being rigorously calibrated to\ntransaction data. We thus apply an established financial agent-based model\ncalibration framework to a simple model of high- and low-frequency trader\ninteraction and demonstrate possible inadequacies of a stylized fact-centric\napproach to model validation. We further argue for the centrality of\ncalibration to the validation of financial agent-based models and possible\npitfalls of current approaches to financial agent-based modeling.\n", "versions": [{"version": "v1", "created": "Sun, 5 Jun 2016 11:29:56 GMT"}, {"version": "v2", "created": "Mon, 26 Sep 2016 10:13:48 GMT"}, {"version": "v3", "created": "Fri, 23 Dec 2016 06:45:43 GMT"}, {"version": "v4", "created": "Thu, 23 Mar 2017 09:48:13 GMT"}], "update_date": "2017-03-24", "authors_parsed": [["Platt", "Donovan", ""], ["Gebbie", "Tim", ""]]}, {"id": "1606.03590", "submitter": "Mihaly Ormos", "authors": "Mihaly Ormos and Dusan Timotity", "title": "Market Microstructure During Financial Crisis: Dynamics of Informed and\n  Heuristic-Driven Trading", "comments": "15 pages, 1 figure, 7 tables and 1 appendix, Finance Research\n  Letters, (2016)", "journal-ref": null, "doi": "10.1016/j.frl.2016.06.003", "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We implement a market microstructure model including informed, uninformed and\nheuristic-driven investors, which latter behave in line with loss-aversion and\nmental accounting. We show that the probability of informed trading (PIN)\nvaries significantly during 2008. In contrast, the probability of\nheuristic-driven trading (PH) remains constant both before and after the\ncollapse of Lehman Brothers. Cross-sectional analysis yields that, unlike PIN,\nPH is not sensitive to size and volume effects. We show that heuristic-driven\ntraders are universally present in all market segments and their presence is\nconstant over time. Furthermore, we find that heuristic-driven investors and\ninformed traders are disjoint sets.\n", "versions": [{"version": "v1", "created": "Sat, 11 Jun 2016 13:31:53 GMT"}], "update_date": "2016-06-14", "authors_parsed": [["Ormos", "Mihaly", ""], ["Timotity", "Dusan", ""]]}, {"id": "1606.07381", "submitter": "Jack Sarkissian", "authors": "Jack Sarkissian", "title": "Spread, volatility, and volume relationship in financial markets and\n  market making profit optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the relationship between price spread, volatility and trading\nvolume. We find that spread forms as a result of interplay between order\nliquidity and order impact. When trading volume is small adding more liquidity\nhelps improve price accuracy and reduce spread, but after some point additional\nliquidity begins to deteriorate price. The model allows to connect the bid-ask\nspread and high-low bars to measurable microstructural parameters and express\ntheir dependence on trading volume, volatility and time horizon. Using the\nestablished relations, we address the operating spread optimization problem to\nmaximize market-making profit.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jun 2016 17:40:15 GMT"}], "update_date": "2016-06-24", "authors_parsed": [["Sarkissian", "Jack", ""]]}, {"id": "1606.09194", "submitter": "Andrea Rapisarda", "authors": "Alessio Emanuele Biondo, Alessandro Pluchino, Andrea Rapisarda", "title": "A multilayer approach for price dynamics in financial markets", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new Self-Organized Criticality (SOC) model for simulating\nprice evolution in an artificial financial market, based on a multilayer\nnetwork of traders. The model also implements, in a quite realistic way with\nrespect to previous studies, the order book dy- namics, by considering two\nassets with variable fundamental prices. Fat tails in the probability\ndistributions of normalized returns are observed, together with other features\nof real financial markets.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jun 2016 17:32:24 GMT"}], "update_date": "2016-06-30", "authors_parsed": [["Biondo", "Alessio Emanuele", ""], ["Pluchino", "Alessandro", ""], ["Rapisarda", "Andrea", ""]]}]