[{"id": "1711.02573", "submitter": "Torsten Trimborn", "authors": "Torsten Trimborn, Martin Frank, Stephan Martin", "title": "Mean Field Limit of a Behavioral Financial Market Model", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2018.03.079", "report-no": null, "categories": "q-fin.TR math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past decade there has been a growing interest in agent-based\neconophysical financial market models. The goal of these models is to gain\nfurther insights into stylized facts of financial data. We derive the mean\nfield limit of the econophysical model by Cross, Grinfeld, Lamba and Seaman\n(Physica A, 354) and show that the kinetic limit is a good approximation of the\noriginal model. Our kinetic model is able to replicate some of the most\nprominent stylized facts, namely fat-tails of asset returns, uncorrelated stock\nprice returns and volatility clustering. Interestingly, psychological\nmisperceptions of investors can be accounted to be the origin of the appearance\nof stylized facts. The mesoscopic model allows us to study the model\nanalytically. We derive steady state solutions and entropy bounds of the\ndeterministic skeleton. These first analytical results already guide us to\nexplanations for the complex dynamics of the model.\n", "versions": [{"version": "v1", "created": "Tue, 7 Nov 2017 15:53:10 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Trimborn", "Torsten", ""], ["Frank", "Martin", ""], ["Martin", "Stephan", ""]]}, {"id": "1711.03291", "submitter": "Torsten Trimborn", "authors": "Torsten Trimborn, Lorenzo Pareschi, Martin Frank", "title": "Portfolio Optimization and Model Predictive Control: A Kinetic Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.AP math.OC q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a large system of interacting financial agents in\nwhich each agent is faced with the decision of how to allocate his capital\nbetween a risky stock or a risk-less bond. The investment decision of\ninvestors, derived through an optimization, drives the stock price. The model\nhas been inspired by the econophysical Levy-Levy-Solomon model (Economics\nLetters, 45). The goal of this work is to gain insights into the stock price\nand wealth distribution. We especially want to discover the causes for the\nappearance of power-laws in financial data. We follow a kinetic approach\nsimilar to (D. Maldarella, L. Pareschi, Physica A, 391) and derive the mean\nfield limit of our microscopic agent dynamics. The novelty in our approach is\nthat the financial agents apply model predictive control (MPC) to approximate\nand solve the optimization of their utility function. Interestingly, the MPC\napproach gives a mathematical connection between the two opponent economic\nconcepts of modeling financial agents to be rational or boundedly rational.\nFurthermore, this is to our knowledge the first kinetic portfolio model which\nconsiders a wealth and stock price distribution simultaneously. Due to our\nkinetic approach, we can study the wealth and price distribution on a\nmesoscopic level. The wealth distribution is characterized by a lognormal law.\nFor the stock price distribution, we can either observe a lognormal behavior in\nthe case of long-term investors or a power-law in the case of high-frequency\ntrader. Furthermore, the stock return data exhibits a fat-tail, which is a well\nknown characteristic of real financial data.\n", "versions": [{"version": "v1", "created": "Thu, 9 Nov 2017 08:23:46 GMT"}, {"version": "v2", "created": "Wed, 21 Feb 2018 22:32:35 GMT"}, {"version": "v3", "created": "Sat, 26 May 2018 23:00:31 GMT"}, {"version": "v4", "created": "Tue, 19 Feb 2019 22:08:58 GMT"}], "update_date": "2019-02-21", "authors_parsed": [["Trimborn", "Torsten", ""], ["Pareschi", "Lorenzo", ""], ["Frank", "Martin", ""]]}, {"id": "1711.03534", "submitter": "Martin Magris", "authors": "Martin Magris, Jiyeong Kim, Esa Rasanen, Juho Kanniainen", "title": "Long-range Auto-correlations in Limit Order Book Markets: Inter- and\n  Cross-event Analysis", "comments": "Paper submitted for the IEEE SSCI 2017 conference. November 27 -\n  December 1 2017, Honolulu, USA. This paper is protected by copyright\n  agreement, however its pubblication on ArXiv is permitted based on IEEE\n  policy", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Long-range correlation in financial time series reflects the complex dynamics\nof the stock markets driven by algorithms and human decisions. Our analysis\nexploits ultra-high frequency order book data from NASDAQ Nordic over a period\nof three years to numerically estimate the power-law scaling exponents using\ndetrended fluctuation analysis (DFA). We address inter-event durations (order\nto order, trade to trade, cancel to cancel) as well as cross-event durations\n(time from order submission to its trade or cancel). We find strong evidence of\nlong-range correlation, which is consistent across different stocks and\nvariables. However, given the crossovers in the DFA fluctuation functions, our\nresults indicate that the long-range correlation in inter-event durations\nbecomes stronger over a longer time scale, i.e., when moving from a range of\nhours to days and further to months. We also observe interesting associations\nbetween the scaling exponent and a number of economic variables, in particular,\nin the inter-trade time series.\n", "versions": [{"version": "v1", "created": "Thu, 9 Nov 2017 18:59:40 GMT"}], "update_date": "2017-11-10", "authors_parsed": [["Magris", "Martin", ""], ["Kim", "Jiyeong", ""], ["Rasanen", "Esa", ""], ["Kanniainen", "Juho", ""]]}, {"id": "1711.05681", "submitter": "Jozef Barunik", "authors": "Stanislav Anatolyev and Jozef Barunik", "title": "Forecasting dynamic return distributions based on ordered binary choice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a simple approach to forecasting conditional probability\ndistributions of asset returns. We work with a parsimonious specification of\nordered binary choice regression that imposes a connection on sign\npredictability across different quantiles. The model forecasts the future\nconditional probability distributions of returns quite precisely when using a\npast indicator and past volatility proxy as predictors. Direct benefits of the\nmodel are revealed in an empirical application to the 29 most liquid U.S.\nstocks. The forecast probability distribution is translated to significant\neconomic gains in a simple trading strategy. Our approach can also be useful in\nmany other applications where conditional distribution forecasts are desired.\n", "versions": [{"version": "v1", "created": "Wed, 15 Nov 2017 17:16:21 GMT"}, {"version": "v2", "created": "Mon, 29 Oct 2018 08:04:29 GMT"}, {"version": "v3", "created": "Sat, 5 Jan 2019 10:11:25 GMT"}], "update_date": "2019-01-08", "authors_parsed": [["Anatolyev", "Stanislav", ""], ["Barunik", "Jozef", ""]]}, {"id": "1711.07630", "submitter": "Shanshan Wang", "authors": "Shanshan Wang, Sebastian Neus\\\"u{\\ss} and Thomas Guhr", "title": "Statistical properties of market collective responses", "comments": null, "journal-ref": "Eur. Phys. J. B (2018) 91: 191", "doi": "10.1140/epjb/e2018-80665-0", "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We empirically analyze the price and liquidity responses to trade signs,\ntraded volumes and signed traded volumes. Utilizing the singular value\ndecomposition, we explore the interconnections of price responses and of\nliquidity responses across the whole market. The statistical characteristics of\ntheir singular vectors are well described by the $t$ location-scale\ndistribution. Furthermore, we discuss the relation between prices and liquidity\nwith respect to their overlapping factors. The factors of price and liquidity\nchanges are non-random when these factors are related to the traded volumes.\nThis means that the traded volumes play a critical role in the price change\ninduced by the liquidity change. In contrast, the two kinds of factors are\nweakly overlapping when they are related to the trade signs and signed traded\nvolumes. Hence, an imbalance of liquidity is related to the price change.\n", "versions": [{"version": "v1", "created": "Tue, 21 Nov 2017 04:28:31 GMT"}], "update_date": "2018-09-11", "authors_parsed": [["Wang", "Shanshan", ""], ["Neusüß", "Sebastian", ""], ["Guhr", "Thomas", ""]]}, {"id": "1711.08799", "submitter": "Kamilla Sabitova", "authors": "Kamilla Sabitova", "title": "Impact of Cross-Listing Chinese Stock Returns. A and N Shares Rate of\n  Return Comparison", "comments": null, "journal-ref": null, "doi": "10.13140/RG.2.2.12115.68642", "report-no": null, "categories": "q-fin.PR q-fin.RM q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper examines the Chinese market reaction to the ADR issue by comparing\nreturns and their stochastic variances of the Chinese firms cross-listed in the\nU.S. stock market. First, It was implemented capital asset pricing model (CAPM)\nto determine expected returns A and N shares. The CAPM provided with a\nmethodology to quantify risk and translate that risk into estimates of expected\nreturn on equity. Overall findings document that N shares of Chinese entities\nlisted on U.S. market were greatly affected by economic turmoil during the\nperiod of World Financial Crises 2007-2008 than the A shares listed on the\nlocal market. After in order to test the hypothesis of beneficial\ncross-listing, it was implemented an event study method and the returns was\nmodeled following GARCH process, which assumes homoscedasticity in residual\nreturns. The results indicate a significant negative abnormal market return on\nan ADR listing date. The return volatilities after the listing date are\ncompared to those before the listing. Four out of ten companies experienced\nincreased volatility of local return after the cross-listing. Keywords:\ncross-listing, ADR, rate of return, volatility, CAPM, GARCH model, N shares, A\nshares\n", "versions": [{"version": "v1", "created": "Thu, 23 Nov 2017 18:30:08 GMT"}], "update_date": "2017-11-27", "authors_parsed": [["Sabitova", "Kamilla", ""]]}]