[{"id": "1712.00235", "submitter": "Bahadir Sahin", "authors": "G\\\"okhan Ceyhan, Nermin Elif Kurt, H. Bahadir Sahin, K\\\"ur\\c{s}ad\n  Derinkuyu", "title": "Empirical comparison of three models for determining market clearing\n  prices in Turkish day-ahead electricity market", "comments": "7 pages, 3 figures, 14th International Conference on the European\n  Energy Market (EEM), 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bidders in day-ahead electricity markets want to sell/buy electricity when\ntheir bids generate positive surplus and not to take an action when the reverse\nholds. However, non-convexities in these markets cause conflicts between the\nactions that the bidders want to take and the actual market results. In this\nwork, we investigate the non-convex market clearing problem of Turkish market\noperator and propose three different rule sets. The first rule set allows both\nrejection of bids with positive surplus and acceptance of bids with negative\nsurplus. The second and the third sets only allow one of these conflicted\ncases. By using total surplus maximization as the objective, we formulate three\nmodels and statistically explore their performance with the real data taken\nfrom Turkish market operator.\n", "versions": [{"version": "v1", "created": "Fri, 1 Dec 2017 09:01:16 GMT"}], "update_date": "2017-12-04", "authors_parsed": [["Ceyhan", "Gökhan", ""], ["Kurt", "Nermin Elif", ""], ["Sahin", "H. Bahadir", ""], ["Derinkuyu", "Kürşad", ""]]}, {"id": "1712.01137", "submitter": "Dieter Hendricks", "authors": "Dieter Hendricks, Adam Cobb, Richard Everett, Jonathan Downing and\n  Stephen J. Roberts", "title": "Inferring agent objectives at different scales of a complex adaptive\n  system", "comments": "6 pages, 3 figures, NIPS 2017 Workshop on Learning in the Presence of\n  Strategic Behaviour (MLStrat)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a framework to study the effective objectives at different time\nscales of financial market microstructure. The financial market can be regarded\nas a complex adaptive system, where purposeful agents collectively and\nsimultaneously create and perceive their environment as they interact with it.\nIt has been suggested that multiple agent classes operate in this system, with\na non-trivial hierarchy of top-down and bottom-up causation classes with\ndifferent effective models governing each level. We conjecture that agent\nclasses may in fact operate at different time scales and thus act differently\nin response to the same perceived market state. Given scale-specific temporal\nstate trajectories and action sequences estimated from aggregate market\nbehaviour, we use Inverse Reinforcement Learning to compute the effective\nreward function for the aggregate agent class at each scale, allowing us to\nassess the relative attractiveness of feature vectors across different scales.\nDifferences in reward functions for feature vectors may indicate different\nobjectives of market participants, which could assist in finding the scale\nboundary for agent classes. This has implications for learning algorithms\noperating in this domain.\n", "versions": [{"version": "v1", "created": "Mon, 4 Dec 2017 15:06:15 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Hendricks", "Dieter", ""], ["Cobb", "Adam", ""], ["Everett", "Richard", ""], ["Downing", "Jonathan", ""], ["Roberts", "Stephen J.", ""]]}, {"id": "1712.03106", "submitter": "Anatoliy Swishchuk Dr.", "authors": "Anatoliy Swishchuk, Bruno Remillard, Robert Elliott, Jonathan\n  Chavez-Casillas", "title": "Compound Hawkes Processes in Limit Order Books", "comments": "24 pages, 16 figures. arXiv admin note: substantial text overlap with\n  arXiv:1706.07459", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce two new Hawkes processes, namely, compound and\nregime-switching compound Hawkes processes, to model the price processes in\nlimit order books. We prove Law of Large Numbers and Functional Central Limit\nTheorems (FCLT) for both processes. The two FCLTs are applied to limit order\nbooks where we use these asymptotic methods to study the link between price\nvolatility and order flow in our two models by using the diffusion limits of\nthese price processes. The volatilities of price changes are expressed in terms\nof parameters describing the arrival rates and price changes. We also present\nsome numerical examples.\n", "versions": [{"version": "v1", "created": "Thu, 7 Dec 2017 18:07:06 GMT"}], "update_date": "2017-12-11", "authors_parsed": [["Swishchuk", "Anatoliy", ""], ["Remillard", "Bruno", ""], ["Elliott", "Robert", ""], ["Chavez-Casillas", "Jonathan", ""]]}, {"id": "1712.09592", "submitter": "Murat Ozbayoglu", "authors": "O.B. Sezer, M. Ozbayoglu, E. Dogdu", "title": "An Artificial Neural Network-based Stock Trading System Using Technical\n  Analysis and Big Data Framework", "comments": "ACM Southeast Conference, ACMSE 2017, Kennesaw State University, GA,\n  U.S.A., 13-15 April, 2017", "journal-ref": "ACM Southeast Conference, ACMSE 2017, Kennesaw State University,\n  GA, U.S.A., 13-15 April, 2017", "doi": "10.1145/3077286.3077294", "report-no": null, "categories": "cs.CE q-fin.TR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a neural network-based stock price prediction and trading\nsystem using technical analysis indicators is presented. The model developed\nfirst converts the financial time series data into a series of buy-sell-hold\ntrigger signals using the most commonly preferred technical analysis\nindicators. Then, a Multilayer Perceptron (MLP) artificial neural network (ANN)\nmodel is trained in the learning stage on the daily stock prices between 1997\nand 2007 for all of the Dow30 stocks. Apache Spark big data framework is used\nin the training stage. The trained model is then tested with data from 2007 to\n2017. The results indicate that by choosing the most appropriate technical\nindicators, the neural network model can achieve comparable results against the\nBuy and Hold strategy in most of the cases. Furthermore, fine tuning the\ntechnical indicators and/or optimization strategy can enhance the overall\ntrading performance.\n", "versions": [{"version": "v1", "created": "Wed, 27 Dec 2017 14:45:40 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Sezer", "O. B.", ""], ["Ozbayoglu", "M.", ""], ["Dogdu", "E.", ""]]}, {"id": "1712.09987", "submitter": "Russell Stanley Geronimo", "authors": "Russell Stanley Q. Geronimo", "title": "How Short Sales Circumvent the Capital Gains Tax System", "comments": null, "journal-ref": "Philippine Law Journal Vol. 90 Issue No. 01 (2016)", "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Through a short sale, a person borrows a share of stock from a lender, sells\nthe borrowed share to a third person at the current price, and purchases an\nidentical share in the market at a future date and at a future price to replace\nthe borrowed share of stock. This only makes sense if the short seller\nanticipates a downward trend in share price. The short seller incurs a gain if\nshare price decreases because the cost of replacing the borrowed share falls\nbelow the selling price. The reverse is true in an ordinary sale, where a\nperson owning a share of stock incurs a loss if price decreases because the\nselling price falls below the basis or acquisition cost. Therefore, when a\ntaxpayer simultaneously owns a share of stock and short sells an identical\nstock, any gain in an ordinary sale of the owned stock is offset by a\ncorresponding loss in the short sale of the borrowed identical stock, vice\nversa. This offsetting effect, in turn, creates an unexpected tax deferral\nopportunity abused in other jurisdictions and which remains unregulated in the\nPhilippine tax system.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 18:49:35 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Geronimo", "Russell Stanley Q.", ""]]}, {"id": "1712.10287", "submitter": "Reginald Smith", "authors": "Reginald D. Smith", "title": "Bitcoin Average Dormancy: A Measure of Turnover and Trading Activity", "comments": "12 pages, 5 figures; accepted and to appear in Ledger", "journal-ref": "Ledger, 3, 91-99 (2018)", "doi": "10.5195/ledger.2018.99", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Attempts to accurately measure the monetary velocity or related properties of\nbitcoin used in transactions have often attempted to either directly apply\ndefinitions from traditional macroeconomic theory or to use specialized metrics\nrelative to the properties of the Blockchain like bitcoin days destroyed. In\nthis paper, it is demonstrated that beyond being a useful metric, bitcoin days\ndestroyed has mathematical properties that allow you to calculate the average\ndormancy (time since last use in a transaction) of the bitcoins used in\ntransactions over a given time period. In addition, bitcoin days destroyed is\nshown to have another unexpected significance as the average size of the pool\nof traded bitcoins by virtue of the expression Little's Law, though only under\nlimited conditions.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 15:16:59 GMT"}, {"version": "v2", "created": "Thu, 8 Feb 2018 01:40:47 GMT"}], "update_date": "2018-11-22", "authors_parsed": [["Smith", "Reginald D.", ""]]}]