[{"id": "1812.00595", "submitter": "Stefan Voigt", "authors": "Nikolaus Hautsch, Christoph Scheuch, Stefan Voigt", "title": "Building Trust Takes Time: Limits to Arbitrage in Blockchain-Based\n  Markets", "comments": "This paper replaces an earlier draft titled \"Limits to Arbitrage in\n  Markets with Stochastic Settlement Latency\". 55 pages, 8 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed ledger technologies replace central counterparties with\ntime-consuming consensus protocols to record the transfer of ownership. This\nsettlement latency slows down cross-market trading and exposes arbitrageurs to\nprice risk. We theoretically derive arbitrage bounds induced by settlement\nlatency. Using Bitcoin orderbook and network data, we estimate average\narbitrage bounds of 121 basis points, explaining 91% of the cross-market price\ndifferences, and demonstrate that asset flows chase arbitrage opportunities.\nControlling for inventory holdings as a measure of trust in exchanges does not\naffect our main results. Blockchain-based settlement without trusted\nintermediation thus introduces a non-trivial friction that impedes arbitrage\nactivity.\n", "versions": [{"version": "v1", "created": "Mon, 3 Dec 2018 08:14:01 GMT"}, {"version": "v2", "created": "Wed, 25 Mar 2020 08:01:43 GMT"}, {"version": "v3", "created": "Fri, 5 Feb 2021 08:46:39 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Hautsch", "Nikolaus", ""], ["Scheuch", "Christoph", ""], ["Voigt", "Stefan", ""]]}, {"id": "1812.02298", "submitter": "Anatoliy Swishchuk Dr.", "authors": "Anatoliy Swishchuk and Aiden Huffman", "title": "General Compound Hawkes Processes in Limit Order Books", "comments": "27 pages, 31 figues, 9 tables. arXiv admin note: substantial text\n  overlap with arXiv:1706.07459", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study various new Hawkes processes. Specifically, we\nconstruct general compound Hawkes processes and investigate their properties in\nlimit order books. With regards to these general compound Hawkes processes, we\nprove a Law of Large Numbers (LLN) and a Functional Central Limit Theorems\n(FCLT) for several specific variations. We apply several of these FCLTs to\nlimit order books to study the link between price volatility and order flow,\nwhere the volatility in mid-price changes is expressed in terms of parameters\ndescribing the arrival rates and mid-price process.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2018 20:36:46 GMT"}], "update_date": "2018-12-07", "authors_parsed": [["Swishchuk", "Anatoliy", ""], ["Huffman", "Aiden", ""]]}, {"id": "1812.02340", "submitter": "Daniel Philps", "authors": "Daniel Philps, Tillman Weyde, Artur d'Avila Garcez, Roy Batchelor", "title": "Continual Learning Augmented Investment Decisions", "comments": "NeurIPS 2018 Workshop on Challenges and Opportunities for AI in\n  Financial Services: the Impact of Fairness, Explainability, Accuracy, and\n  Privacy, Montreal, Canada. This is a non-archival publication - the authors\n  may submit revisions and extensions of this paper to other publication venues", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI q-fin.CP q-fin.PM q-fin.TR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Investment decisions can benefit from incorporating an accumulated knowledge\nof the past to drive future decision making. We introduce Continual Learning\nAugmentation (CLA) which is based on an explicit memory structure and a feed\nforward neural network (FFNN) base model and used to drive long term financial\ninvestment decisions. We demonstrate that our approach improves accuracy in\ninvestment decision making while memory is addressed in an explainable way. Our\napproach introduces novel remember cues, consisting of empirically learned\nchange points in the absolute error series of the FFNN. Memory recall is also\nnovel, with contextual similarity assessed over time by sampling distances\nusing dynamic time warping (DTW). We demonstrate the benefits of our approach\nby using it in an expected return forecasting task to drive investment\ndecisions. In an investment simulation in a broad international equity universe\nbetween 2003-2017, our approach significantly outperforms FFNN base models. We\nalso illustrate how CLA's memory addressing works in practice, using a worked\nexample to demonstrate the explainability of our approach.\n", "versions": [{"version": "v1", "created": "Thu, 6 Dec 2018 04:26:25 GMT"}, {"version": "v2", "created": "Sat, 8 Dec 2018 17:26:47 GMT"}, {"version": "v3", "created": "Fri, 14 Dec 2018 10:19:57 GMT"}, {"version": "v4", "created": "Fri, 25 Jan 2019 09:51:52 GMT"}], "update_date": "2019-01-28", "authors_parsed": [["Philps", "Daniel", ""], ["Weyde", "Tillman", ""], ["Garcez", "Artur d'Avila", ""], ["Batchelor", "Roy", ""]]}, {"id": "1812.02726", "submitter": "Torsten Trimborn", "authors": "Maximilian Beikirch, Simon Cramer, Martin Frank, Philipp Otte, Emma\n  Pabich, Torsten Trimborn", "title": "Simulation of Stylized Facts in Agent-Based Computational Economic\n  Market Models", "comments": "arXiv admin note: substantial text overlap with arXiv:1801.01811", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.EM q-fin.EC q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the qualitative and quantitative appearance of stylized facts in\nseveral agent-based computational economic market (ABCEM) models. We perform\nour simulations with the SABCEMM (Simulator for Agent-Based Computational\nEconomic Market Models) tool recently introduced by the authors (Trimborn et\nal. 2019). Furthermore, we present novel ABCEM models created by recombining\nexisting models and study them with respect to stylized facts as well. This can\nbe efficiently performed by the SABCEMM tool thanks to its object-oriented\nsoftware design. The code is available on GitHub (Trimborn et al. 2018), such\nthat all results can be reproduced by the reader.\n", "versions": [{"version": "v1", "created": "Tue, 27 Nov 2018 22:07:46 GMT"}, {"version": "v2", "created": "Fri, 15 Nov 2019 14:37:06 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Beikirch", "Maximilian", ""], ["Cramer", "Simon", ""], ["Frank", "Martin", ""], ["Otte", "Philipp", ""], ["Pabich", "Emma", ""], ["Trimborn", "Torsten", ""]]}, {"id": "1812.05657", "submitter": "David Dewhurst", "authors": "David Rushing Dewhurst, Michael Vincent Arnold, Colin Michael Van Oort", "title": "Selection mechanisms affect volatility in evolving markets", "comments": "9 pages, 7 figures, to appear in proceedings of GECCO 2019 as a full\n  paper", "journal-ref": "In Proceedings of the Genetic and Evolutionary Computation\n  Conference (2019) 90-98", "doi": "10.1145/3321707.3321734", "report-no": null, "categories": "q-fin.TR cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial asset markets are sociotechnical systems whose constituent agents\nare subject to evolutionary pressure as unprofitable agents exit the\nmarketplace and more profitable agents continue to trade assets. Using a\npopulation of evolving zero-intelligence agents and a frequent batch auction\nprice-discovery mechanism as substrate, we analyze the role played by\nevolutionary selection mechanisms in determining macro-observable market\nstatistics. In particular, we show that selection mechanisms incorporating a\nlocal fitness-proportionate component are associated with high correlation\nbetween a micro, risk-aversion parameter and a commonly-used macro-volatility\nstatistic, while a purely quantile-based selection mechanism shows\nsignificantly less correlation.\n", "versions": [{"version": "v1", "created": "Thu, 13 Dec 2018 19:55:22 GMT"}, {"version": "v2", "created": "Sat, 27 Apr 2019 18:46:28 GMT"}], "update_date": "2020-08-05", "authors_parsed": [["Dewhurst", "David Rushing", ""], ["Arnold", "Michael Vincent", ""], ["Van Oort", "Colin Michael", ""]]}, {"id": "1812.06600", "submitter": "Sebastian Jaimungal", "authors": "Brian Ning, Franco Ho Ting Lin, Sebastian Jaimungal", "title": "Double Deep Q-Learning for Optimal Execution", "comments": "20 pages, 7 figures, 1 table. Updated minor typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.LG q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal trade execution is an important problem faced by essentially all\ntraders. Much research into optimal execution uses stringent model assumptions\nand applies continuous time stochastic control to solve them. Here, we instead\ntake a model free approach and develop a variation of Deep Q-Learning to\nestimate the optimal actions of a trader. The model is a fully connected Neural\nNetwork trained using Experience Replay and Double DQN with input features\ngiven by the current state of the limit order book, other trading signals, and\navailable execution actions, while the output is the Q-value function\nestimating the future rewards under an arbitrary action. We apply our model to\nnine different stocks and find that it outperforms the standard benchmark\napproach on most stocks using the measures of (i) mean and median\nout-performance, (ii) probability of out-performance, and (iii) gain-loss\nratios.\n", "versions": [{"version": "v1", "created": "Mon, 17 Dec 2018 03:33:55 GMT"}, {"version": "v2", "created": "Mon, 8 Jun 2020 15:21:40 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Ning", "Brian", ""], ["Lin", "Franco Ho Ting", ""], ["Jaimungal", "Sebastian", ""]]}, {"id": "1812.07369", "submitter": "Sebastian Krause", "authors": "Sebastian M. Krause, Jonas A. Fiegen, Thomas Guhr", "title": "Emergence of stylized facts during the opening of stock markets", "comments": "7 pages, 7 figures, 1 supplemental table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial markets show a number of non-stationarities, ranging from\nvolatility fluctuations over ever changing technical and regulatory market\nconditions to seasonalities. On the other hand, financial markets show various\nstylized facts which are remarkably stable. It is thus an intriguing question\nto find out how these stylized facts emerge. As a first example, we here\ninvestigate how the bid-ask-spread between best sell and best buy offer for\nstocks develops during the trading day. For rescaled and properly smoothed data\nwe observe collapsing curves for many different NASDAQ stocks, with a slow\npower law decline of the spread during the whole trading day. This effect\nemerges robustly after a highly fluctuating opening period. Some so called\nlarge-tick stocks behave differently because of technical boundaries. Their\nspread closes to one tick shortly after the market opening. We use our findings\nfor identifying the duration of the market opening which we find to vary\nlargely from stock to stock.\n", "versions": [{"version": "v1", "created": "Tue, 18 Dec 2018 14:04:40 GMT"}], "update_date": "2018-12-19", "authors_parsed": [["Krause", "Sebastian M.", ""], ["Fiegen", "Jonas A.", ""], ["Guhr", "Thomas", ""]]}, {"id": "1812.07529", "submitter": "Umut \\c{C}etin", "authors": "Umut \\c{C}etin and Albina Danilova", "title": "On pricing rules and optimal strategies in general Kyle-Back models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The folk result in Kyle-Back models states that the value function of the\ninsider remains unchanged when her admissible strategies are restricted to\nabsolutely continuous ones. In this paper we show that, for a large class of\npricing rules used in current literature, the value function of the insider can\nbe finite when her strategies are restricted to be absolutely continuous and\ninfinite when this restriction is not imposed. This implies that the folk\nresult doesn't hold for those pricing rules and that they are not consistent\nwith equilibrium. We derive the necessary conditions for a pricing rule to be\nconsistent with equilibrium and prove that, when a pricing rule satisfies these\nnecessary conditions, the insider's optimal strategy is absolutely continuous,\nthus obtaining the classical result in a more general setting.\n  This, furthermore, allows us to justify the standard assumption of absolute\ncontinuity of insider's strategies since one can construct a pricing rule\nsatisfying the necessary conditions derived in the paper that yield the same\nprice process as the pricing rules employed in the modern literature when\ninsider's strategies are absolutely continuous.\n", "versions": [{"version": "v1", "created": "Tue, 18 Dec 2018 17:52:38 GMT"}], "update_date": "2018-12-19", "authors_parsed": [["Çetin", "Umut", ""], ["Danilova", "Albina", ""]]}, {"id": "1812.09067", "submitter": "Stephan Grimm", "authors": "Stephan Grimm, Thomas Guhr", "title": "How spread changes affect the order book: Comparing the price responses\n  of order deletions and placements to trades", "comments": "11 pages, 12 figures", "journal-ref": null, "doi": "10.1140/epjb/e2019-90744-3", "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We observe the effects of the three different events that cause spread\nchanges in the order book, namely trades, deletions and placement of limit\norders. By looking at the frequencies of the relative amounts of price changing\nevents, we discover that deletions of orders open the bid-ask spread of a stock\nmore often than trades do. We see that once the amount of spread changes due to\ndeletions exceeds the amount of the ones due to trades, other observables in\nthe order book change as well. We then look at how these spread changing events\naffect the prices of stocks, by means of the price response. We not only see\nthat the self-response of stocks is positive for both spread changing trades\nand deletions and negative for order placements, but also cross-response to\nother stocks and therefore the market as a whole. In addition, the\nself-response function of spread-changing trades is similar to that of all\ntrades. This leads to the conclusion that spread changing deletions and order\nplacements have a similar effect on the order book and stock prices over time\nas trades.\n", "versions": [{"version": "v1", "created": "Fri, 21 Dec 2018 11:59:16 GMT"}], "update_date": "2019-07-24", "authors_parsed": [["Grimm", "Stephan", ""], ["Guhr", "Thomas", ""]]}, {"id": "1812.10252", "submitter": "Yagna Patel", "authors": "Yagna Patel", "title": "Optimizing Market Making using Multi-Agent Reinforcement Learning", "comments": "10 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.LG stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, reinforcement learning is applied to the problem of optimizing\nmarket making. A multi-agent reinforcement learning framework is used to\noptimally place limit orders that lead to successful trades. The framework\nconsists of two agents. The macro-agent optimizes on making the decision to\nbuy, sell, or hold an asset. The micro-agent optimizes on placing limit orders\nwithin the limit order book. For the context of this paper, the proposed\nframework is applied and studied on the Bitcoin cryptocurrency market. The goal\nof this paper is to show that reinforcement learning is a viable strategy that\ncan be applied to complex problems (with complex environments) such as market\nmaking.\n", "versions": [{"version": "v1", "created": "Wed, 26 Dec 2018 07:29:10 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Patel", "Yagna", ""]]}]