[{"id": "1906.01293", "submitter": "Jos\\'e Lages", "authors": "C\\'elestin Coquid\\'e, Jos\\'e Lages, and Dima L. Shepelyansky", "title": "Contagion in Bitcoin networks", "comments": "12 pages, 6 figures. Paper accepted in 2nd Workshop on Blockchain and\n  Smart Contract Technologies (BSCT 2019), workshop satellite of 22nd\n  International Conference on Business Information Systems (BIS 2019)", "journal-ref": "Business Information Systems Workshops. BIS 2019. Lecture Notes in\n  Business Information Processing, vol 373. Springer, Cham", "doi": "10.1007/978-3-030-36691-9_18", "report-no": null, "categories": "q-fin.TR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct the Google matrices of bitcoin transactions for all year\nquarters during the period of January 11, 2009 till April 10, 2013. During the\nlast quarters the network size contains about 6 million users (nodes) with\nabout 150 million transactions. From PageRank and CheiRank probabilities,\nanalogous to trade import and export, we determine the dimensionless trade\nbalance of each user and model the contagion propagation on the network\nassuming that a user goes bankrupt if its balance exceeds a certain\ndimensionless threshold $\\kappa$. We find that the phase transition takes place\nfor $\\kappa<\\kappa_c\\approx0.1$ with almost all users going bankrupt. For\n$\\kappa>0.55$ almost all users remain safe. We find that even on a distance\nfrom the critical threshold $\\kappa_c$ the top PageRank and CheiRank users, as\na house of cards, rapidly drop to the bankruptcy. We attribute this effect to\nstrong interconnections between these top users which we determine with the\nreduced Google matrix algorithm. This algorithm allows to establish efficiently\nthe direct and indirect interactions between top PageRank users. We argue that\nthis study models the contagion on real financial networks.\n", "versions": [{"version": "v1", "created": "Tue, 4 Jun 2019 09:22:34 GMT"}], "update_date": "2020-04-01", "authors_parsed": [["Coquidé", "Célestin", ""], ["Lages", "José", ""], ["Shepelyansky", "Dima L.", ""]]}, {"id": "1906.01427", "submitter": "Adriano Koshiyama", "authors": "Nick Firoozye and Adriano Koshiyama", "title": "Optimal Dynamic Strategies on Gaussian Returns", "comments": "Accepted by Journal of Investment Strategies. arXiv admin note: text\n  overlap with arXiv:1905.05023", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamic trading strategies, in the spirit of trend-following or\nmean-reversion, represent an only partly understood but lucrative and pervasive\narea of modern finance. Assuming Gaussian returns and Gaussian dynamic weights\nor signals, (e.g., linear filters of past returns, such as simple moving\naverages, exponential weighted moving averages, forecasts from ARIMA models),\nwe are able to derive closed-form expressions for the first four moments of the\nstrategy's returns, in terms of correlations between the random signals and\nunknown future returns. By allowing for randomness in the asset-allocation and\nmodelling the interaction of strategy weights with returns, we demonstrate that\npositive skewness and excess kurtosis are essential components of all positive\nSharpe dynamic strategies, which is generally observed empirically; demonstrate\nthat total least squares (TLS) or orthogonal least squares is more appropriate\nthan OLS for maximizing the Sharpe ratio, while canonical correlation analysis\n(CCA) is similarly appropriate for the multi-asset case; derive standard errors\non Sharpe ratios which are tighter than the commonly used standard errors from\nLo; and derive standard errors on the skewness and kurtosis of strategies,\napparently new results. We demonstrate these results are applicable\nasymptotically for a wide range of stationary time-series.\n", "versions": [{"version": "v1", "created": "Fri, 31 May 2019 20:25:08 GMT"}], "update_date": "2019-06-05", "authors_parsed": [["Firoozye", "Nick", ""], ["Koshiyama", "Adriano", ""]]}, {"id": "1906.01713", "submitter": "Thibaut Mastrolia", "authors": "Paul Jusselin, Thibaut Mastrolia, Mathieu Rosenbaum", "title": "Optimal auction duration: A price formation viewpoint", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an auction market in which market makers fill the order book\nduring a given time period while some other investors send market orders. We\ndefine the clearing price of the auction as the price maximizing the exchanged\nvolume at the clearing time according to the supply and demand of each market\nparticipants. Then we derive in a semi-explicit form the error made between\nthis clearing price and the efficient price as a function of the auction\nduration. We study the impact of the behavior of market takers on this error.\nTo do so we consider the case of naive market takers and that of rational\nmarket takers playing a Nash equilibrium to minimize their transaction costs.\nWe compute the optimal duration of the auctions for 77 stocks traded on\nEuronext and compare the quality of price formation process under this optimal\nvalue to the case of a continuous limit order book. Continuous limit order\nbooks are found to be usually sub-optimal. However, in term of our metric, they\nonly moderately impair the quality of price formation process. Order of\nmagnitude of optimal auction durations is from 2 to 10 minutes.\n", "versions": [{"version": "v1", "created": "Tue, 4 Jun 2019 20:16:00 GMT"}, {"version": "v2", "created": "Fri, 2 Aug 2019 10:10:32 GMT"}, {"version": "v3", "created": "Mon, 29 Jun 2020 08:41:49 GMT"}], "update_date": "2020-06-30", "authors_parsed": [["Jusselin", "Paul", ""], ["Mastrolia", "Thibaut", ""], ["Rosenbaum", "Mathieu", ""]]}, {"id": "1906.02152", "submitter": "Ariah Klages-Mundt", "authors": "Ariah Klages-Mundt, Andreea Minca", "title": "(In)Stability for the Blockchain: Deleveraging Spirals and Stablecoin\n  Attacks", "comments": "To be published in Cryptoeconomic Systems 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a model of stable assets, including non-custodial stablecoins\nbacked by cryptocurrencies. Such stablecoins are popular methods for\nbootstrapping price stability within public blockchain settings. We derive\nfundamental results about dynamics and liquidity in stablecoin markets,\ndemonstrate that these markets face deleveraging feedback effects that cause\nilliquidity during crises and exacerbate collateral drawdown, and characterize\nstable dynamics of the system under particular conditions. The possibility of\nsuch `deleveraging spirals' was first predicted in the initial release of our\npaper in 2019 and later directly observed during the `Black Thursday' crisis in\nDai in 2020. From these insights, we suggest design improvements that aim to\nimprove long-term stability. We also introduce new attacks that exploit\narbitrage-like opportunities around stablecoin liquidations. Using our model,\nwe demonstrate that these can be profitable. These attacks may induce\nvolatility in the `stable' asset and cause perverse incentives for miners,\nposing risks to blockchain consensus. A variant of such attacks also later\noccurred during Black Thursday, taking the form of mempool manipulation to\nclear Dai liquidation auctions at near zero prices, costing $8m.\n", "versions": [{"version": "v1", "created": "Wed, 5 Jun 2019 17:24:41 GMT"}, {"version": "v2", "created": "Thu, 4 Jun 2020 16:54:42 GMT"}, {"version": "v3", "created": "Tue, 2 Mar 2021 00:33:47 GMT"}], "update_date": "2021-03-04", "authors_parsed": [["Klages-Mundt", "Ariah", ""], ["Minca", "Andreea", ""]]}, {"id": "1906.02312", "submitter": "Shaojie Xu", "authors": "Svitlana Vyetrenko, Shaojie Xu", "title": "Risk-Sensitive Compact Decision Trees for Autonomous Execution in\n  Presence of Simulated Market Response", "comments": "Proceedings of the 36th International Conference on Machine\n  Learning,Long Beach, California, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate an application of risk-sensitive reinforcement learning to\noptimizing execution in limit order book markets. We represent taking order\nexecution decisions based on limit order book knowledge by a Markov Decision\nProcess; and train a trading agent in a market simulator, which emulates\nmulti-agent interaction by synthesizing market response to our agent's\nexecution decisions from historical data. Due to market impact, executing high\nvolume orders can incur significant cost. We learn trading signals from market\nmicrostructure in presence of simulated market response and derive explainable\ndecision-tree-based execution policies using risk-sensitive Q-learning to\nminimize execution cost subject to constraints on cost variance.\n", "versions": [{"version": "v1", "created": "Wed, 5 Jun 2019 21:13:11 GMT"}, {"version": "v2", "created": "Wed, 6 Jan 2021 06:52:45 GMT"}], "update_date": "2021-01-07", "authors_parsed": [["Vyetrenko", "Svitlana", ""], ["Xu", "Shaojie", ""]]}, {"id": "1906.03309", "submitter": "Dmitry Kramkov", "authors": "Dmitry Kramkov and Yan Xu", "title": "An optimal transport problem with backward martingale constraints\n  motivated by insider trading", "comments": "46 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.TR", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We study a single-period optimal transport problem on $\\mathbb{R}^2$ with a\ncovariance-type cost function $c(x,y) = (x_1-y_1)(x_2-y_2)$ and a backward\nmartingale constraint. We show that a transport plan $\\gamma$ is optimal if and\nonly if there is a maximal monotone set $G$ that supports the $x$-marginal of\n$\\gamma$ and such that $c(x,y) = \\min_{z\\in G}c(z,y)$ for every $(x,y)$ in the\nsupport of $\\gamma$. We obtain sharp regularity conditions for the uniqueness\nof an optimal plan and for its representation in terms of a map. Our study is\nmotivated by a variant of the classical Kyle model of insider trading from\nRochet and Vila (1994).\n", "versions": [{"version": "v1", "created": "Fri, 7 Jun 2019 19:45:20 GMT"}], "update_date": "2019-06-11", "authors_parsed": [["Kramkov", "Dmitry", ""], ["Xu", "Yan", ""]]}, {"id": "1906.03430", "submitter": "Wonse Kim", "authors": "Wonse Kim, Junseok Lee, Kyungwon Kang", "title": "The Effects of the Introduction of Bitcoin Futures on the Volatility of\n  Bitcoin Returns", "comments": "Accepted in Finance Research Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the effects of the launch of Bitcoin futures on the\nintraday volatility of Bitcoin. Based on one-minute price data collected from\nfour cryptocurrency exchanges, we first examine the change in realized\nvolatility after the introduction of Bitcoin futures to investigate their\naggregate effects on the intraday volatility of Bitcoin. We then analyze the\neffects in more detail utilizing the discrete Fourier transform. We show that\nalthough the Bitcoin market became more volatile immediately after the\nintroduction of Bitcoin futures, over time it has become more stable than it\nwas before the introduction.\n", "versions": [{"version": "v1", "created": "Sat, 8 Jun 2019 09:38:28 GMT"}], "update_date": "2019-06-11", "authors_parsed": [["Kim", "Wonse", ""], ["Lee", "Junseok", ""], ["Kang", "Kyungwon", ""]]}, {"id": "1906.04404", "submitter": "Zihao Zhang", "authors": "Zihao Zhang, Stefan Zohren, Stephen Roberts", "title": "Extending Deep Learning Models for Limit Order Books to Quantile\n  Regression", "comments": "5 pages, 4 figures, Time Series Workshop of the ICML (2019)", "journal-ref": "Proceedings of Time Series Workshop of the 36 th International\n  Conference on Machine Learning, Long Beach, California, PMLR 97, 2019", "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We showcase how Quantile Regression (QR) can be applied to forecast financial\nreturns using Limit Order Books (LOBs), the canonical data source of\nhigh-frequency financial time-series. We develop a deep learning architecture\nthat simultaneously models the return quantiles for both buy and sell\npositions. We test our model over millions of LOB updates across multiple\ndifferent instruments on the London Stock Exchange. Our results suggest that\nthe proposed network not only delivers excellent performance but also provides\nimproved prediction robustness by combining quantile estimates.\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2019 06:05:35 GMT"}], "update_date": "2019-06-13", "authors_parsed": [["Zhang", "Zihao", ""], ["Zohren", "Stefan", ""], ["Roberts", "Stephen", ""]]}, {"id": "1906.04813", "submitter": "Jacobo Roa-Vicens", "authors": "Jacobo Roa-Vicens, Cyrine Chtourou, Angelos Filos, Francisco Rullan,\n  Yarin Gal, Ricardo Silva", "title": "Towards Inverse Reinforcement Learning for Limit Order Book Dynamics", "comments": "Published as a workshop paper on AI in Finance: Applications and\n  Infrastructure for Multi-Agent Learning at the 36th International Conference\n  on Machine Learning (ICML), Long Beach, California, PMLR97, 2019. Copyright\n  2019 by the author(s)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-fin.TR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-agent learning is a promising method to simulate aggregate competitive\nbehaviour in finance. Learning expert agents' reward functions through their\nexternal demonstrations is hence particularly relevant for subsequent design of\nrealistic agent-based simulations. Inverse Reinforcement Learning (IRL) aims at\nacquiring such reward functions through inference, allowing to generalize the\nresulting policy to states not observed in the past. This paper investigates\nwhether IRL can infer such rewards from agents within real financial stochastic\nenvironments: limit order books (LOB). We introduce a simple one-level LOB,\nwhere the interactions of a number of stochastic agents and an expert trading\nagent are modelled as a Markov decision process. We consider two cases for the\nexpert's reward: either a simple linear function of state features; or a\ncomplex, more realistic non-linear function. Given the expert agent's\ndemonstrations, we attempt to discover their strategy by modelling their latent\nreward function using linear and Gaussian process (GP) regressors from previous\nliterature, and our own approach through Bayesian neural networks (BNN). While\nthe three methods can learn the linear case, only the GP-based and our proposed\nBNN methods are able to discover the non-linear reward case. Our BNN IRL\nalgorithm outperforms the other two approaches as the number of samples\nincreases. These results illustrate that complex behaviours, induced by\nnon-linear reward functions amid agent-based stochastic scenarios, can be\ndeduced through inference, encouraging the use of inverse reinforcement\nlearning for opponent-modelling in multi-agent systems.\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2019 20:47:24 GMT"}], "update_date": "2019-06-13", "authors_parsed": [["Roa-Vicens", "Jacobo", ""], ["Chtourou", "Cyrine", ""], ["Filos", "Angelos", ""], ["Rullan", "Francisco", ""], ["Gal", "Yarin", ""], ["Silva", "Ricardo", ""]]}, {"id": "1906.05420", "submitter": "Othmane Mounjid", "authors": "Othmane Mounjid, Mathieu Rosenbaum, Pamela Saliba", "title": "From asymptotic properties of general point processes to the ranking of\n  financial agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general non-linear order book model that is built from the\nindividual behaviours of the agents. Our framework encompasses Markovian and\nHawkes based models. Under mild assumptions, we prove original results on the\nergodicity and diffusivity of such system. Then we provide closed form formulas\nfor various quantities of interest: stationary distribution of the best bid and\nask quantities, spread, liquidity fluctuations and price volatility. These\nformulas are expressed in terms of individual order flows of market\nparticipants. Our approach enables us to establish a ranking methodology for\nthe market makers with respect to the quality of their trading.\n", "versions": [{"version": "v1", "created": "Wed, 12 Jun 2019 23:10:03 GMT"}], "update_date": "2019-06-14", "authors_parsed": [["Mounjid", "Othmane", ""], ["Rosenbaum", "Mathieu", ""], ["Saliba", "Pamela", ""]]}, {"id": "1906.06000", "submitter": "Takanobu Mizuta", "authors": "Takanobu Mizuta", "title": "An agent-based model for designing a financial market that works well", "comments": null, "journal-ref": "2020 IEEE Symposium Series on Computational Intelligence (SSCI)", "doi": "10.1109/SSCI47803.2020.9308376", "report-no": null, "categories": "q-fin.TR q-fin.CP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing a financial market that works well is very important for developing\nand maintaining an advanced economy, but is not easy because changing detailed\nrules, even ones that seem trivial, sometimes causes unexpected large impacts\nand side effects. A computer simulation using an agent-based model can directly\ntreat and clearly explain such complex systems where micro processes and macro\nphenomena interact. Many effective agent-based models investigating human\nbehavior have already been developed. Recently, an artificial market model,\nwhich is an agent-based model for a financial market, has started to contribute\nto discussions on rules and regulations of actual financial markets. I\nintroduce an artificial market model to design financial markets that work well\nand describe a previous study investigating tick size reduction. I hope that\nmore artificial market models will contribute to designing financial markets\nthat work well to further develop and maintain advanced economies.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2019 03:17:07 GMT"}], "update_date": "2021-01-08", "authors_parsed": [["Mizuta", "Takanobu", ""]]}, {"id": "1906.11023", "submitter": "Stefano Ugolini", "authors": "Stefano Ugolini (LEREPS)", "title": "The Coevolution of Banks and Corporate Securities Markets: The Financing\n  of Belgium's Industrial Take-Off in the 1830s", "comments": null, "journal-ref": "Business History, Taylor & Francis (Routledge), 2019, pp.1-22", "doi": "10.1080/00076791.2019.1621293", "report-no": null, "categories": "q-fin.GN q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent developments in the literature on financial architecture suggest that\nbanks and markets not only coexist, but also coevolve in ways that are\nnon-neutral from the viewpoint of optimality. This article aims to analyse the\nconcrete mechanisms of this coevolution by focusing on a very relevant case\nstudy: Belgium (the first Continental country to industrialize) at the time of\nthe very first emergence of a modern financial system (the 1830s). The article\nshows that intermediaries played a crucial role in developing secondary\nsecurities markets (as banks acted as securitizers), but market conditions also\nhad a strong feedback on banks' balance sheets and activities (as banks also\nacted as market-makers for the securities they had issued). The findings\nsuggest that not only structural, but also cyclical factors can be important\ndeterminants of changes in financial architecture.\n", "versions": [{"version": "v1", "created": "Wed, 26 Jun 2019 12:26:43 GMT"}], "update_date": "2019-06-27", "authors_parsed": [["Ugolini", "Stefano", "", "LEREPS"]]}, {"id": "1906.11046", "submitter": "Wenhang Bao", "authors": "Wenhang Bao, Xiao-yang Liu", "title": "Multi-Agent Deep Reinforcement Learning for Liquidation Strategy\n  Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Liquidation is the process of selling a large number of shares of one stock\nsequentially within a given time frame, taking into consideration the costs\narising from market impact and a trader's risk aversion. The main challenge in\noptimizing liquidation is to find an appropriate modeling system that can\nincorporate the complexities of the stock market and generate practical trading\nstrategies. In this paper, we propose to use multi-agent deep reinforcement\nlearning model, which better captures high-level complexities comparing to\nvarious machine learning methods, such that agents can learn how to make the\nbest selling decisions. First, we theoretically analyze the Almgren and Chriss\nmodel and extend its fundamental mechanism so it can be used as the multi-agent\ntrading environment. Our work builds the foundation for future multi-agent\nenvironment trading analysis. Secondly, we analyze the cooperative and\ncompetitive behaviours between agents by adjusting the reward functions for\neach agent, which overcomes the limitation of single-agent reinforcement\nlearning algorithms. Finally, we simulate trading and develop an optimal\ntrading strategy with practical constraints by using a reinforcement learning\nmethod, which shows the capabilities of reinforcement learning methods in\nsolving realistic liquidation problems.\n", "versions": [{"version": "v1", "created": "Mon, 24 Jun 2019 20:22:46 GMT"}], "update_date": "2019-06-27", "authors_parsed": [["Bao", "Wenhang", ""], ["Liu", "Xiao-yang", ""]]}, {"id": "1906.12010", "submitter": "Tucker Hybinette Balch", "authors": "Tucker Hybinette Balch, Mahmoud Mahfouz, Joshua Lockhart, Maria\n  Hybinette, David Byrd", "title": "How to Evaluate Trading Strategies: Single Agent Market Replay or\n  Multiple Agent Interactive Simulation?", "comments": null, "journal-ref": "Presented at the 2019 ICML Workshop on AI in Finance: Applications\n  and Infrastructure for Multi-Agent Learning. Long Beach, CA", "doi": null, "report-no": null, "categories": "q-fin.TR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how a multi-agent simulator can support two important but distinct\nmethods for assessing a trading strategy: Market Replay and Interactive\nAgent-Based Simulation (IABS). Our solution is important because each method\noffers strengths and weaknesses that expose or conceal flaws in the subject\nstrategy. A key weakness of Market Replay is that the simulated market does not\nsubstantially adapt to or respond to the presence of the experimental strategy.\nIABS methods provide an artificial market for the experimental strategy using a\npopulation of background trading agents. Because the background agents attend\nto market conditions and current price as part of their strategy, the overall\nmarket is responsive to the presence of the experimental strategy. Even so,\nIABS methods have their own weaknesses, primarily that it is unclear if the\nmarket environment they provide is realistic. We describe our approach in\ndetail, and illustrate its use in an example application: The evaluation of\nmarket impact for various size orders.\n", "versions": [{"version": "v1", "created": "Fri, 28 Jun 2019 01:31:51 GMT"}], "update_date": "2019-07-01", "authors_parsed": [["Balch", "Tucker Hybinette", ""], ["Mahfouz", "Mahmoud", ""], ["Lockhart", "Joshua", ""], ["Hybinette", "Maria", ""], ["Byrd", "David", ""]]}]