[{"id": "2102.00626", "submitter": "Yixin Cao", "authors": "Yixin Cao and Chuanwei Zou and Xianfeng Cheng", "title": "Flashot: A Snapshot of Flash Loan Attack on DeFi Ecosystem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Flash Loan attack can grab millions of dollars from decentralized vaults in\none single transaction, drawing increasing attention from the Decentralized\nFinance (DeFi) players. It has also demonstrated an exciting opportunity that a\nhuge wealth could be created by composing DeFi's building blocks and exploring\nthe arbitrage change. However, a fundamental framework to study the field of\nDeFi has not yet reached a consensus and there's a lack of standard tools or\nlanguages to help better describe, design and improve the running processes of\nthe infant DeFi systems, which naturally makes it harder to understand the\nbasic principles behind the complexity of Flash Loan attacks.\n  In this paper, we are the first to propose Flashot, a prototype that is able\nto transparently illustrate the precise asset flows intertwined with smart\ncontracts in a standardized diagram for each Flash Loan event. Some use cases\nare shown and specifically, based on Flashot, we study a typical Pump and\nArbitrage case and present in-depth economic explanations to the attacker's\nbehaviors. Finally, we conclude the development trends of Flash Loan attacks\nand discuss the great impact on DeFi ecosystem brought by Flash Loan. We\nenvision a brand new quantitative financial industry powered by highly\nefficient automatic risk and profit detection systems based on the blockchain.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2021 04:20:56 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Cao", "Yixin", ""], ["Zou", "Chuanwei", ""], ["Cheng", "Xianfeng", ""]]}, {"id": "2102.02119", "submitter": "Joerg Osterrieder", "authors": "Ali Hirsa, Joerg Osterrieder, Branka Hadji Misheva, Wenxin Cao, Yiwen\n  Fu, Hanze Sun, Kin Wai Wong", "title": "The VIX index under scrutiny of machine learning techniques and neural\n  networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The CBOE Volatility Index, known by its ticker symbol VIX, is a popular\nmeasure of the market's expected volatility on the SP 500 Index, calculated and\npublished by the Chicago Board Options Exchange (CBOE). It is also often\nreferred to as the fear index or the fear gauge. The current VIX index value\nquotes the expected annualized change in the SP 500 index over the following 30\ndays, based on options-based theory and current options-market data. Despite\nits theoretical foundation in option price theory, CBOE's Volatility Index is\nprone to inadvertent and deliberate errors because it is weighted average of\nout-of-the-money calls and puts which could be illiquid. Many claims of market\nmanipulation have been brought up against VIX in recent years.\n  This paper discusses several approaches to replicate the VIX index as well as\nVIX futures by using a subset of relevant options as well as neural networks\nthat are trained to automatically learn the underlying formula. Using subset\nselection approaches on top of the original CBOE methodology, as well as\nbuilding machine learning and neural network models including Random Forests,\nSupport Vector Machines, feed-forward neural networks, and long short-term\nmemory (LSTM) models, we will show that a small number of options is sufficient\nto replicate the VIX index. Once we are able to actually replicate the VIX\nusing a small number of SP options we will be able to exploit potential\narbitrage opportunities between the VIX index and its underlying derivatives.\nThe results are supposed to help investors to better understand the options\nmarket, and more importantly, to give guidance to the US regulators and CBOE\nthat have been investigating those manipulation claims for several years.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2021 15:49:56 GMT"}], "update_date": "2021-06-17", "authors_parsed": [["Hirsa", "Ali", ""], ["Osterrieder", "Joerg", ""], ["Misheva", "Branka Hadji", ""], ["Cao", "Wenxin", ""], ["Fu", "Yiwen", ""], ["Sun", "Hanze", ""], ["Wong", "Kin Wai", ""]]}, {"id": "2102.02179", "submitter": "Bo Li", "authors": "Yong Shi, Bo Li and Guangle Du", "title": "Pyramid scheme in stock market: a kind of financial market simulation", "comments": "23 pages, 11 figures, in this version we have corrected some\n  expression errors in the previous version", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR physics.soc-ph", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Artificial stock market simulation based on agent is an important means to\nstudy financial market. Based on the assumption that the investors are composed\nof a main fund, small trend and contrarian investors characterized by four\nparameters, we simulate and research a kind of financial phenomenon with the\ncharacteristics of pyramid schemes. Our simulation results and theoretical\nanalysis reveal the relationships between the rate of return of the main fund\nand the proportion of the trend investors in all small investors, the small\ninvestors' parameters of taking profit and stopping loss, the order size of the\nmain fund and the strategies adopted by the main fund. Our work are helpful to\nexplain the financial phenomenon with the characteristics of pyramid schemes in\nfinancial markets, design trading rules for regulators and develop trading\nstrategies for investors.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2021 18:16:21 GMT"}, {"version": "v2", "created": "Tue, 16 Feb 2021 04:44:47 GMT"}], "update_date": "2021-02-17", "authors_parsed": [["Shi", "Yong", ""], ["Li", "Bo", ""], ["Du", "Guangle", ""]]}, {"id": "2102.02834", "submitter": "Mehdi Tomas", "authors": "Mehdi Tomas, Iacopo Mastromatteo, Michael Benzaquen", "title": "Cross impact in derivative markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.PR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We introduce a linear cross-impact framework in a setting in which the price\nof some given financial instruments (derivatives) is a deterministic function\nof one or more, possibly tradeable, stochastic factors (underlying). We show\nthat a particular cross-impact model, the multivariate Kyle model, prevents\narbitrage and aggregates (potentially non-stationary) traded order flows on\nderivatives into (roughly stationary) liquidity pools aggregating order flows\ntraded on both derivatives and underlying. Using E-Mini futures and options\nalong with VIX futures, we provide empirical evidence that the price formation\nprocess from order flows on derivatives is driven by cross-impact and confirm\nthat the simple Kyle cross-impact model is successful at capturing\nparsimoniously such empirical phenomenology. Our framework may be used in\npractice for estimating execution costs, in particular hedging costs.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2021 19:02:47 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Tomas", "Mehdi", ""], ["Mastromatteo", "Iacopo", ""], ["Benzaquen", "Michael", ""]]}, {"id": "2102.02877", "submitter": "Bastien Baldacci", "authors": "Mike Weber, Iuliia Manziuk, Bastien Baldacci", "title": "Liquidity Stress Testing using Optimal Portfolio Liquidation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We build an optimal portfolio liquidation model for OTC markets, aiming at\nminimizing the trading costs via the choice of the liquidation time. We work in\nthe Locally Linear Order Book framework of \\cite{toth2011anomalous} to obtain\nthe market impact as a function of the traded volume. We find that the optimal\nterminal time for a linear execution of a small order is proportional to the\nsquare root of the ratio between the amount being bought or sold and the\naverage daily volume. Numerical experiments on real market data illustrate the\nmethod on a portfolio of corporate bonds.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2021 20:37:40 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Weber", "Mike", ""], ["Manziuk", "Iuliia", ""], ["Baldacci", "Bastien", ""]]}, {"id": "2102.04591", "submitter": "Zhiyong Cheng", "authors": "Zhiyong Cheng, Jun Deng, Tianyi Wang, Mei Yu", "title": "Liquidation, Leverage and Optimal Margin in Bitcoin Futures Markets", "comments": "21 pages, 5 fugures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Using the generalized extreme value theory to characterize tail\ndistributions, we address liquidation, leverage, and optimal margins for\nbitcoin long and short futures positions. The empirical analysis of perpetual\nbitcoin futures on BitMEX shows that (1) daily forced liquidations to out-\nstanding futures are substantial at 3.51%, and 1.89% for long and short; (2)\ninvestors got forced liquidation do trade aggressively with average leverage of\n60X; and (3) exchanges should elevate current 1% margin requirement to 33% (3X\nleverage) for long and 20% (5X leverage) for short to reduce the daily margin\ncall probability to 1%. Our results further suggest normality assumption on\nreturn significantly underestimates optimal margins. Policy implications are\nalso discussed.\n", "versions": [{"version": "v1", "created": "Tue, 9 Feb 2021 00:54:07 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Cheng", "Zhiyong", ""], ["Deng", "Jun", ""], ["Wang", "Tianyi", ""], ["Yu", "Mei", ""]]}, {"id": "2102.08107", "submitter": "d'Artis Kancs", "authors": "Pavel Ciaian, d'Artis Kancs, Miroslava Rajcaniova", "title": "Interdependencies between Mining Costs, Mining Rewards and Blockchain\n  Security", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.IT math.IT q-fin.EC q-fin.TR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper studies to what extent the cost of operating a proof-of-work\nblockchain is intrinsically linked to the cost of preventing attacks, and to\nwhat extent the underlying digital ledger security budgets are correlated with\nthe cryptocurrency market outcomes. We theoretically derive an equilibrium\nrelationship between the cryptocurrency price, mining rewards and mining costs,\nand blockchain security outcomes. Using daily crypto market data for 2014-2021\nand employing the autoregressive distributed lag approach - that allows\ntreating all the relevant moments of the blockchain series as potentially\nendogenous - we provide empirical evidence of cryptocurrency price and mining\nrewards indeed being intrinsically linked to blockchain security outcomes.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 12:14:11 GMT"}], "update_date": "2021-02-17", "authors_parsed": [["Ciaian", "Pavel", ""], ["Kancs", "d'Artis", ""], ["Rajcaniova", "Miroslava", ""]]}, {"id": "2102.08811", "submitter": "Zihao Zhang", "authors": "Zihao Zhang, Bryan Lim and Stefan Zohren", "title": "Deep Learning for Market by Order Data", "comments": "17 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Market by order (MBO) data - a detailed feed of individual trade instructions\nfor a given stock on an exchange - is arguably one of the most granular sources\nof microstructure information. While limit order books (LOBs) are implicitly\nderived from it, MBO data is largely neglected by current academic literature\nwhich focuses primarily on LOB modelling. In this paper, we demonstrate the\nutility of MBO data for forecasting high-frequency price movements, providing\nan orthogonal source of information to LOB snapshots and expanding the universe\nof alpha discovery. We provide the first predictive analysis on MBO data by\ncarefully introducing the data structure and presenting a specific\nnormalisation scheme to consider level information in order books and to allow\nmodel training with multiple instruments. Through forecasting experiments using\ndeep neural networks, we show that while MBO-driven and LOB-driven models\nindividually provide similar performance, ensembles of the two can lead to\nimprovements in forecasting accuracy - indicating that MBO data is additive to\nLOB-based features.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2021 15:16:26 GMT"}, {"version": "v2", "created": "Tue, 27 Jul 2021 09:20:19 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Zhang", "Zihao", ""], ["Lim", "Bryan", ""], ["Zohren", "Stefan", ""]]}, {"id": "2102.10099", "submitter": "Yusuke Ikeno", "authors": "Yusuke Ikeno, James Angel, Shin'ichiro Matsuo and Ryosuke Ushida", "title": "Auction Type Resolution on Smart Derivatives", "comments": "13 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper proposes an auction type resolution for smart derivatives. It has\nbeen discussed to migrate derivatives contracts to smart contracts (smart\nderivatives). Automation is often discussed in this context. It is also\nimportant to prepare to avoid disputes from practical perspectives. There are\ncontroversial issues to terminate the relationship at defaults. In OTC\nderivative markets, master agreements define a basic policy for the liquidation\nprocess but there happened some disputes over these processes. We propose to\ndefine an auction type resolution in smart derivatives, which each participant\nwould find beneficial.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2021 05:56:16 GMT"}], "update_date": "2021-02-22", "authors_parsed": [["Ikeno", "Yusuke", ""], ["Angel", "James", ""], ["Matsuo", "Shin'ichiro", ""], ["Ushida", "Ryosuke", ""]]}, {"id": "2102.10756", "submitter": "Masaaki Fujii", "authors": "Masaaki Fujii, Akihiko Takahashi", "title": "Equilibrium Price Formation with a Major Player and its Mean Field Limit", "comments": "typos corrected, comments added", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF econ.GN q-fin.EC q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this article, we consider the problem of equilibrium price formation in an\nincomplete securities market consisting of one major financial firm and a large\nnumber of minor firms. They carry out continuous trading via the securities\nexchange to minimize their cost while facing idiosyncratic and common noises as\nwell as stochastic order flows from their individual clients. The equilibrium\nprice process that balances demand and supply of the securities, including the\nfunctional form of the price impact for the major firm, is derived endogenously\nboth in the market of finite population size and in the corresponding mean\nfield limit.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2021 03:43:34 GMT"}, {"version": "v2", "created": "Fri, 12 Mar 2021 10:06:16 GMT"}], "update_date": "2021-03-15", "authors_parsed": [["Fujii", "Masaaki", ""], ["Takahashi", "Akihiko", ""]]}, {"id": "2102.10925", "submitter": "Ivan Jericevich", "authors": "Ivan Jericevich and Dharmesh Sing and Tim Gebbie", "title": "CoinTossX: An open-source low-latency high-throughput matching engine", "comments": "21 pages, 10 figures, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.MA q-fin.CP q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We deploy and demonstrate the CoinTossX low-latency, high-throughput,\nopen-source matching engine with orders sent using the Julia and Python\nlanguages. We show how this can be deployed for small-scale local desk-top\ntesting and discuss a larger scale, but local hosting, with multiple traded\ninstruments managed concurrently and managed by multiple clients. We then\ndemonstrate a cloud based deployment using Microsoft Azure, with large-scale\nindustrial and simulation research use cases in mind. The system is exposed and\ninteracted with via sockets using UDP SBE message protocols and can be\nmonitored using a simple web browser interface using HTTP. We give examples\nshowing how orders can be be sent to the system and market data feeds monitored\nusing the Julia and Python languages. The system is developed in Java with\norders submitted as binary encodings (SBE) via UDP protocols using the Aeron\nMedia Driver as the low-latency, high throughput message transport. The system\nseparates the order-generation and simulation environments e.g. agent-based\nmodel simulation, from the matching of orders, data-feeds and various\nmodularised components of the order-book system. This ensures a more natural\nand realistic asynchronicity between events generating orders, and the events\nassociated with order-book dynamics and market data-feeds. We promote the use\nof Julia as the preferred order submission and simulation environment.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2021 11:50:34 GMT"}], "update_date": "2021-02-23", "authors_parsed": [["Jericevich", "Ivan", ""], ["Sing", "Dharmesh", ""], ["Gebbie", "Tim", ""]]}]