[{"id": "2106.00123", "submitter": "Tidor-Vlad Pricope", "authors": "Tidor-Vlad Pricope", "title": "Deep Reinforcement Learning in Quantitative Algorithmic Trading: A\n  Review", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Algorithmic stock trading has become a staple in today's financial market,\nthe majority of trades being now fully automated. Deep Reinforcement Learning\n(DRL) agents proved to be to a force to be reckon with in many complex games\nlike Chess and Go. We can look at the stock market historical price series and\nmovements as a complex imperfect information environment in which we try to\nmaximize return - profit and minimize risk. This paper reviews the progress\nmade so far with deep reinforcement learning in the subdomain of AI in finance,\nmore precisely, automated low-frequency quantitative stock trading. Many of the\nreviewed studies had only proof-of-concept ideals with experiments conducted in\nunrealistic settings and no real-time trading applications. For the majority of\nthe works, despite all showing statistically significant improvements in\nperformance compared to established baseline strategies, no decent\nprofitability level was obtained. Furthermore, there is a lack of experimental\ntesting in real-time, online trading platforms and a lack of meaningful\ncomparisons between agents built on different types of DRL or human traders. We\nconclude that DRL in stock trading has showed huge applicability potential\nrivalling professional traders under strong assumptions, but the research is\nstill in the very early stages of development.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 22:26:43 GMT"}], "update_date": "2021-06-02", "authors_parsed": [["Pricope", "Tidor-Vlad", ""]]}, {"id": "2106.03035", "submitter": "Koya Ishikawa", "authors": "Koya Ishikawa and Kazuhide Nakata", "title": "Online Trading Models in the Forex Market Considering Transaction Costs", "comments": "7 pages, 2 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, a wide range of investment models have been created using\nartificial intelligence. Automatic trading by artificial intelligence can\nexpand the range of trading methods, such as by conferring the ability to\noperate 24 hours a day and the ability to trade with high frequency. Automatic\ntrading can also be expected to trade with more information than is available\nto humans if it can sufficiently consider past data. In this paper, we propose\nan investment agent based on a deep reinforcement learning model, which is an\nartificial intelligence model. The model considers the transaction costs\ninvolved in actual trading and creates a framework for trading over a long\nperiod of time so that it can make a large profit on a single trade. In doing\nso, it can maximize the profit while keeping transaction costs low. In\naddition, in consideration of actual operations, we use online learning so that\nthe system can continue to learn by constantly updating the latest online data\ninstead of learning with static data. This makes it possible to trade in\nnon-stationary financial markets by always incorporating current market trend\ninformation.\n", "versions": [{"version": "v1", "created": "Sun, 6 Jun 2021 05:36:12 GMT"}], "update_date": "2021-06-08", "authors_parsed": [["Ishikawa", "Koya", ""], ["Nakata", "Kazuhide", ""]]}, {"id": "2106.03716", "submitter": "Kevin Kamm", "authors": "Marco Di Francesco and Kevin Kamm", "title": "How to handle negative interest rates in a CIR framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we propose a new model to address the problem of negative\ninterest rates that preserves the analytical tractability of the original\nCox-Ingersoll-Ross (CIR) model without introducing a shift to the market\ninterest rates, because it is defined as the difference of two independent CIR\nprocesses. The strength of our model lies within the fact that it is very\nsimple and can be calibrated to the market zero yield curve using an analytical\nformula. We run several numerical experiments at two different dates, once with\na partially sub-zero interest rate and once with a fully negative interest\nrate. In both cases, we obtain good results in the sense that the model\nreproduces the market term structures very well. We then simulate the model\nusing the Euler-Maruyama scheme and examine the mean, variance and distribution\nof the model. The latter agrees with the skewness and fat tail seen in the\noriginal CIR model. In addition, we compare the model's zero coupon prices with\nmarket prices at different future points in time. Finally, we test the market\nconsistency of the model by evaluating swaptions with different tenors and\nmaturities.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2021 15:27:12 GMT"}], "update_date": "2021-06-08", "authors_parsed": [["Di Francesco", "Marco", ""], ["Kamm", "Kevin", ""]]}, {"id": "2106.06974", "submitter": "Olivier Gu\\'eant", "authors": "Alexander Barzykin, Philippe Bergault, Olivier Gu\\'eant", "title": "Algorithmic market making in foreign exchange cash markets: a new model\n  for active market makers", "comments": "arXiv admin note: text overlap with arXiv:1907.01225", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In OTC markets, one of the main tasks of dealers / market makers consists in\nproviding prices at which they agree to buy and sell the assets and securities\nthey have in their scope. With ever increasing trading volume, this quoting\ntask has to be done algorithmically. Over the last ten years, many market\nmaking models have been designed that can be the basis of quoting algorithms in\nOTC markets. However, in the academic literature, most market making models\nadapted to OTC markets are general and only a few focus on specific market\ncharacteristics. In particular, to the best of our knowledge, in all OTC market\nmaking models, the market maker only sets quotes and/or waits for clients.\nHowever, on many markets such as foreign exchange cash markets, market makers\nhave access to liquidity pools where they can unwind part of their inventory.\nIn this paper, we propose a model taking this possibility into account,\ntherefore allowing market makers to trade ``actively'' in the market. The model\ndisplays an important feature well known to practitioners that in a certain\ninventory range the market maker does not actually want to capitalize on this\nactive trading opportunity but should rather ``internalize'' the flow by\nappropriately adjusting the quotes. The larger the market making franchise, the\nwider is the inventory range suitable for internalization. The model is\nillustrated numerically with realistic parameters for USDCNH spot market.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jun 2021 12:27:43 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Barzykin", "Alexander", ""], ["Bergault", "Philippe", ""], ["Guéant", "Olivier", ""]]}, {"id": "2106.07040", "submitter": "Riccardo Marcaccioli", "authors": "Riccardo Marcaccioli, Jean-Philippe Bouchaud and Michael Benzaquen", "title": "Exogenous and Endogenous Price Jumps Belong to Different Dynamical\n  Classes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR physics.soc-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Synchronising a database of stock specific news with 5 years worth of order\nbook data on 300 stocks, we show that abnormal price movements following news\nreleases (exogenous) exhibit markedly different dynamical features from those\narising spontaneously (endogenous). On average, large volatility fluctuations\ninduced by exogenous events occur abruptly and are followed by a decaying\npower-law relaxation, while endogenous price jumps are characterized by\nprogressively accelerating growth of volatility, also followed by a power-law\nrelaxation, but slower than for exogenous jumps. Remarkably, our results are\nreminiscent of what is observed in different contexts, namely Amazon book sales\nand YouTube views. Finally, we show that fitting power-laws to {\\it individual}\nvolatility profiles allows one to classify large events into endogenous and\nexogenous dynamical classes, without relying on the news feed.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jun 2021 16:51:09 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Marcaccioli", "Riccardo", ""], ["Bouchaud", "Jean-Philippe", ""], ["Benzaquen", "Michael", ""]]}, {"id": "2106.08437", "submitter": "Joerg Osterrieder", "authors": "Ali Hirsa, Joerg Osterrieder, Branka Hadji-Misheva, Jan-Alexander\n  Posth", "title": "Deep reinforcement learning on a multi-asset environment for trading", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Financial trading has been widely analyzed for decades with market\nparticipants and academics always looking for advanced methods to improve\ntrading performance. Deep reinforcement learning (DRL), a recently\nreinvigorated method with significant success in multiple domains, still has to\nshow its benefit in the financial markets. We use a deep Q-network (DQN) to\ndesign long-short trading strategies for futures contracts. The state space\nconsists of volatility-normalized daily returns, with buying or selling being\nthe reinforcement learning action and the total reward defined as the\ncumulative profits from our actions. Our trading strategy is trained and tested\nboth on real and simulated price series and we compare the results with an\nindex benchmark. We analyze how training based on a combination of artificial\ndata and actual price series can be successfully deployed in real markets. The\ntrained reinforcement learning agent is applied to trading the E-mini S&P 500\ncontinuous futures contract. Our results in this study are preliminary and need\nfurther improvement.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jun 2021 21:09:19 GMT"}], "update_date": "2021-06-17", "authors_parsed": [["Hirsa", "Ali", ""], ["Osterrieder", "Joerg", ""], ["Hadji-Misheva", "Branka", ""], ["Posth", "Jan-Alexander", ""]]}, {"id": "2106.09267", "submitter": "Eyal Neuman", "authors": "Eyal Neuman and Moritz Vo{\\ss}", "title": "Trading with the Crowd", "comments": "52 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR math.PR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We formulate and solve a multi-player stochastic differential game between\nfinancial agents who seek to cost-efficiently liquidate their position in a\nrisky asset in the presence of jointly aggregated transient price impact, along\nwith taking into account a common general price predicting signal. The unique\nNash-equilibrium strategies reveal how each agent's liquidation policy adjusts\nthe predictive trading signal to the aggregated transient price impact induced\nby all other agents. This unfolds a quantitative relation between trading\nsignals and the order flow in crowded markets. We also formulate and solve the\ncorresponding mean field game in the limit of infinitely many agents. We prove\nthat the equilibrium trading speed and the value function of an agent in the\nfinite $N$-player game converges to the corresponding trading speed and value\nfunction in the mean field game at rate $O(N^{-2})$. In addition, we prove that\nthe mean field optimal strategy provides an approximate Nash-equilibrium for\nthe finite-player game.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2021 06:29:48 GMT"}], "update_date": "2021-06-18", "authors_parsed": [["Neuman", "Eyal", ""], ["Voß", "Moritz", ""]]}, {"id": "2106.09783", "submitter": "Agostino Capponi", "authors": "Agostino Capponi, Sveinn Olafsson, and Humoud Alsabah", "title": "Proof-of-Work Cryptocurrencies: Does Mining Technology Undermine\n  Decentralization?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Does the proof-of-work protocol serve its intended purpose of supporting\ndecentralized cryptocurrency mining? To address this question, we develop a\ngame-theoretical model where miners first invest in hardware to improve the\nefficiency of their operations, and then compete for mining rewards in a\nrent-seeking game. We argue that because of capacity constraints faced by\nminers, centralization in mining is lower than indicated by both public\ndiscourse and recent academic work. We show that advancements in hardware\nefficiency do not necessarily lead to larger miners increasing their advantage,\nbut rather allow smaller miners to expand and new miners to enter the\ncompetition. Our calibrated model illustrates that hardware efficiency has a\nsmall impact on the cost of attacking a network, while the mining reward has a\nsignificant impact. This highlights the vulnerability of smaller and emerging\ncryptocurrencies, as well as of established cryptocurrencies transitioning to a\nfee-based mining reward scheme.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2021 19:53:44 GMT"}], "update_date": "2021-06-21", "authors_parsed": [["Capponi", "Agostino", ""], ["Olafsson", "Sveinn", ""], ["Alsabah", "Humoud", ""]]}, {"id": "2106.11691", "submitter": "Edgar Jungblut", "authors": "Sebastian M. Krause, Edgar Jungblut, Thomas Guhr", "title": "Two Price Regimes in Limit Order Books: Liquidity Cushion and Fragmented\n  Distant Field", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The distribution of liquidity within the limit order book is essential for\nthe impact of market orders on the stock price and the emergence of price\nshocks. Hence it is of great interest to improve the understanding of the\ntime-dependent dynamics of the limit order book. In our analysis we find a\nbroad distribution of limit order lifetimes. Around the quotes we find a\ndensely filled regime with mostly short living limit orders, far away from the\nquotes we find a sparse filling with mostly long living limit orders. We\ndetermine the characteristics of those two regimes and point out the main\ndifferences. Based on our research we propose a model for simulating the regime\naround the quotes.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2021 11:51:28 GMT"}], "update_date": "2021-06-23", "authors_parsed": [["Krause", "Sebastian M.", ""], ["Jungblut", "Edgar", ""], ["Guhr", "Thomas", ""]]}, {"id": "2106.14404", "submitter": "Andreas Aigner", "authors": "Andreas A. Aigner and Gurvinder Dhaliwal", "title": "UNISWAP: Impermanent Loss and Risk Profile of a Liquidity Provider", "comments": "16 pages, 8 Figures, 1 Table", "journal-ref": null, "doi": "10.13140/RG.2.2.32419.58400/6", "report-no": null, "categories": "q-fin.TR q-fin.CP q-fin.GN q-fin.PM q-fin.RM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Uniswap is a decentralized exchange (DEX) and was first launched on November\n2, 2018 on the Ethereum mainnet [1] and is part of an Ecosystem of products in\nDecentralized Finance (DeFi). It replaces a traditional order book type of\ntrading common on centralized exchanges (CEX) with a deterministic model that\nswaps currencies (or tokens/assets) along a fixed price function determined by\nthe amount of currencies supplied by the liquidity providers. Liquidity\nproviders can be regarded as investors in the decentralized exchange and earn\nfixed commissions per trade. They lock up funds in liquidity pools for distinct\npairs of currencies allowing market participants to swap them using the fixed\nprice function. Liquidity providers take on market risk as a liquidity provider\nin exchange for earning commissions on each trade. Here we analyze the risk\nprofile of a liquidity provider and the so called impermanent (unrealized) loss\nin particular. We provide an improved version of the commonly denoted\nimpermanent loss function for Uniswap v2 on the semi-infinite domain. The\ndifferences between Uniswap v2 and v3 are also discussed.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2021 05:38:51 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Aigner", "Andreas A.", ""], ["Dhaliwal", "Gurvinder", ""]]}, {"id": "2106.16047", "submitter": "Peter Tankov", "authors": "Peter Tankov and Laura Tinsi", "title": "Decision making with dynamic probabilistic forecasts", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a sequential decision making process, such as renewable energy\ntrading or electrical production scheduling, whose outcome depends on the\nfuture realization of a random factor, such as a meteorological variable. We\nassume that the decision maker disposes of a dynamically updated probabilistic\nforecast (predictive distribution) of the random factor. We propose several\nstochastic models for the evolution of the probabilistic forecast, and show how\nthese models may be calibrated from ensemble forecasts, commonly provided by\nweather centers. We then show how these stochastic models can be used to\ndetermine optimal decision making strategies depending on the forecast updates.\nApplications to wind energy trading are given.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2021 13:20:50 GMT"}], "update_date": "2021-07-01", "authors_parsed": [["Tankov", "Peter", ""], ["Tinsi", "Laura", ""]]}, {"id": "2106.16088", "submitter": "Supriya Bajpai", "authors": "Supriya Bajpai", "title": "Application of deep reinforcement learning for Indian stock trading\n  automation", "comments": "9 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.LG", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In stock trading, feature extraction and trading strategy design are the two\nimportant tasks to achieve long-term benefits using machine learning\ntechniques. Several methods have been proposed to design trading strategy by\nacquiring trading signals to maximize the rewards. In the present paper the\ntheory of deep reinforcement learning is applied for stock trading strategy and\ninvestment decisions to Indian markets. The experiments are performed\nsystematically with three classical Deep Reinforcement Learning models Deep\nQ-Network, Double Deep Q-Network and Dueling Double Deep Q-Network on ten\nIndian stock datasets. The performance of the models are evaluated and\ncomparison is made.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 15:49:00 GMT"}], "update_date": "2021-07-01", "authors_parsed": [["Bajpai", "Supriya", ""]]}]