[{"id": "1509.00099", "submitter": "T\\'omas Magn\\'usson", "authors": "Bjarki \\'Ag\\'ust Gu{\\dh}mundsson, T\\'omas Ken Magn\\'usson, Bj\\\"orn\n  Orri S{\\ae}mundsson", "title": "Bounds and Fixed-Parameter Algorithms for Weighted Improper Coloring\n  (Extended Version)", "comments": "18 pages, 5 figures, extended version for additional proofs in\n  appendix for 16th Italian Conference on Theoretical Computer Science 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the weighted improper coloring problem, a generalization of\ndefective coloring. We present some hardness results and in particular we show\nthat weighted improper coloring is not fixed-parameter tractable when\nparameterized by pathwidth. We generalize bounds for defective coloring to\nweighted improper coloring and give a bound for weighted improper coloring in\nterms of the sum of edge weights. Finally we give fixed-parameter algorithms\nfor weighted improper coloring both when parameterized by treewidth and maximum\ndegree and when parameterized by treewidth and precision of edge weights. In\nparticular, we obtain a linear-time algorithm for weighted improper coloring of\ninterval graphs of bounded degree.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2015 00:15:32 GMT"}], "update_date": "2015-09-02", "authors_parsed": [["Guðmundsson", "Bjarki Ágúst", ""], ["Magnússon", "Tómas Ken", ""], ["Sæmundsson", "Björn Orri", ""]]}, {"id": "1509.00118", "submitter": "Ali Vakilian", "authors": "Sariel Har-Peled and Piotr Indyk and Sepideh Mahabadi and Ali Vakilian", "title": "Towards Tight Bounds for the Streaming Set Cover Problem", "comments": "A preliminary version of this paper is to appear in PODS 2016", "journal-ref": null, "doi": "10.1145/2902251.2902287", "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the classic Set Cover problem in the data stream model. For $n$\nelements and $m$ sets ($m\\geq n$) we give a $O(1/\\delta)$-pass algorithm with a\nstrongly sub-linear $\\tilde{O}(mn^{\\delta})$ space and logarithmic\napproximation factor. This yields a significant improvement over the earlier\nalgorithm of Demaine et al. [DIMV14] that uses exponentially larger number of\npasses. We complement this result by showing that the tradeoff between the\nnumber of passes and space exhibited by our algorithm is tight, at least when\nthe approximation factor is equal to $1$. Specifically, we show that any\nalgorithm that computes set cover exactly using $({1 \\over 2\\delta}-1)$ passes\nmust use $\\tilde{\\Omega}(mn^{\\delta})$ space in the regime of $m=O(n)$.\nFurthermore, we consider the problem in the geometric setting where the\nelements are points in $\\mathbb{R}^2$ and sets are either discs, axis-parallel\nrectangles, or fat triangles in the plane, and show that our algorithm (with a\nslight modification) uses the optimal $\\tilde{O}(n)$ space to find a\nlogarithmic approximation in $O(1/\\delta)$ passes.\n  Finally, we show that any randomized one-pass algorithm that distinguishes\nbetween covers of size 2 and 3 must use a linear (i.e., $\\Omega(mn)$) amount of\nspace. This is the first result showing that a randomized, approximate\nalgorithm cannot achieve a space bound that is sublinear in the input size.\n  This indicates that using multiple passes might be necessary in order to\nachieve sub-linear space bounds for this problem while guaranteeing small\napproximation factors.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2015 02:16:50 GMT"}, {"version": "v2", "created": "Mon, 2 May 2016 16:58:19 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Har-Peled", "Sariel", ""], ["Indyk", "Piotr", ""], ["Mahabadi", "Sepideh", ""], ["Vakilian", "Ali", ""]]}, {"id": "1509.00269", "submitter": "Francis Lazarus", "authors": "Vincent Despr\\'e and Francis Lazarus", "title": "Some Triangulated Surfaces without Balanced Splitting", "comments": "15 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let G be the graph of a triangulated surface $\\Sigma$ of genus $g\\geq 2$. A\ncycle of G is splitting if it cuts $\\Sigma$ into two components, neither of\nwhich is homeomorphic to a disk. A splitting cycle has type k if the\ncorresponding components have genera k and g-k. It was conjectured that G\ncontains a splitting cycle (Barnette '1982). We confirm this conjecture for an\ninfinite family of triangulations by complete graphs but give counter-examples\nto a stronger conjecture (Mohar and Thomassen '2001) claiming that G should\ncontain splitting cycles of every possible type.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2015 13:01:32 GMT"}], "update_date": "2015-09-02", "authors_parsed": [["Despré", "Vincent", ""], ["Lazarus", "Francis", ""]]}, {"id": "1509.00321", "submitter": "Joseph O'Rourke", "authors": "Joseph O'Rourke", "title": "Spiral Unfoldings of Convex Polyhedra", "comments": "22 pages, 36 figures, 4 references. Version 2 added a conjecture in a\n  final section", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion of a spiral unfolding of a convex polyhedron, resulting by\nflattening a special type of Hamiltonian cut-path, is explored. The Platonic\nand Archimedian solids all have nonoverlapping spiral unfoldings, although\namong generic polyhedra, overlap is more the rule than the exception. The\nstructure of spiral unfoldings is investigated, primarily by analyzing one\nparticular class, the polyhedra of revolution.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2015 14:40:51 GMT"}, {"version": "v2", "created": "Mon, 19 Oct 2015 19:57:26 GMT"}], "update_date": "2015-10-20", "authors_parsed": [["O'Rourke", "Joseph", ""]]}, {"id": "1509.01013", "submitter": "Zdenek Dvorak", "authors": "Zdenek Dvorak and Daniel Kral and Robin Thomas", "title": "Three-coloring triangle-free graphs on surfaces VI. 3-colorability of\n  quadrangulations", "comments": "32 pages, no figures; updated for reviewer comments", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a linear-time algorithm to decide 3-colorability (and find a\n3-coloring, if it exists) of quadrangulations of a fixed surface. The algorithm\nalso allows to prescribe the coloring for a bounded number of vertices.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2015 09:57:18 GMT"}, {"version": "v2", "created": "Wed, 19 Aug 2020 09:20:57 GMT"}], "update_date": "2020-08-20", "authors_parsed": [["Dvorak", "Zdenek", ""], ["Kral", "Daniel", ""], ["Thomas", "Robin", ""]]}, {"id": "1509.01301", "submitter": "Jing Huang", "authors": "Joergen Bang-Jensen, J. Huang and Xuding Zhu", "title": "Completing orientations of partially oriented graphs", "comments": "17 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We initiate a general study of what we call orientation completion problems.\nFor a fixed class C of oriented graphs, the orientation completion problem asks\nwhether a given partially oriented graph P can be completed to an oriented\ngraph in C by orienting the (non-oriented) edges in P. Orien- tation completion\nproblems commonly generalize several existing problems including recognition of\ncertain classes of graphs and digraphs as well as extending representations of\ncertain geometrically representable graphs. We study orientation completion\nproblems for various classes of oriented graphs, including k-arc- strong\noriented graphs, k-strong oriented graphs, quasi-transitive oriented graphs,\nlocal tournament, acyclic local tournaments, locally transitive tournaments,\nlocally transitive local tournaments, in- tournaments, and oriented graphs\nwhich have directed cycle factors. We show that the orientation completion\nproblem for each of these classes is either polynomial time solvable or\nNP-complete. We also show that some of the NP-complete problems become\npolynomial time solvable when the input oriented graphs satisfy certain extra\nconditions. Our results imply that the representation extension problems for\nproper interval graphs and for proper circular arc graphs are polynomial time\nsolvable, which generalize a previous result.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2015 22:58:14 GMT"}], "update_date": "2015-09-07", "authors_parsed": [["Bang-Jensen", "Joergen", ""], ["Huang", "J.", ""], ["Zhu", "Xuding", ""]]}, {"id": "1509.01307", "submitter": "Jing Huang", "authors": "Jan Gorzny and Jing Huang", "title": "End-vertices of LBFS of (AT-free) bigraphs", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lexicographic Breadth First Search (LBFS) is one of fundamental graph search\nalgorithms that has numerous applications, including recognition of graph\nclasses, computation of graph parameters, and detection of certain graph\nstructures. The well-known result of Rose, Tarjan and Lueker on the\nend-vertices of LBFS of chordal graphs has tempted researchers to study the\nend-vertices of LBFS of various classes of graphs, including chordal graphs,\nsplit graphs, interval graphs, and asteroidal triple-free (AT-free) graphs. In\nthis paper we study the end-vertices of LBFS of bipartite graphs. We show that\ndeciding whether a vertex of a bipartite graph is the end-vertex of an LBFS is\nan NP-complete problem. In contrast we characterize the end-vertices of LBFS of\nAT-free bipartite graphs. Our characterization implies that the problem of\ndeciding whether a vertex of an AT-free bipartite graph is the end-vertex of an\nLBFS is solvable in polynomial time. Key words: Lexicographic breadth first\nsearch, end-vertex, bipartite graphs, AT-free, proper interval bigraph,\ncharacterization, algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2015 23:16:17 GMT"}], "update_date": "2015-09-07", "authors_parsed": [["Gorzny", "Jan", ""], ["Huang", "Jing", ""]]}, {"id": "1509.01576", "submitter": "Gabriel Renault", "authors": "Gabriel Renault", "title": "Invertibility modulo dead-ending no-P-universes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In normal version of combinatorial game theory, all games are invertible,\nwhereas only the empty game is invertible in mis\\`ere version. For this reason,\nseveral restricted universes were earlier considered for their study, in which\nmore games are invertible. We here study combinatorial games in mis\\`ere\nversion, in particular universes where no player would like to pass their turn\nIn these universes, we prove that having one extra condition makes all games\nbecome invertible. We then focus our attention on a specific quotient, called\nQ_Z, and show that all sums of universes whose quotient is Q_Z also have Q_Z as\ntheir quotient.\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2015 19:54:42 GMT"}], "update_date": "2015-09-07", "authors_parsed": [["Renault", "Gabriel", ""]]}, {"id": "1509.01787", "submitter": "Petr Hlin\\v{e}n\\'y", "authors": "Petr Hlin\\v{e}n\\'y and Gelasio Salazar", "title": "On Hardness of the Joint Crossing Number", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Joint Crossing Number problem asks for a simultaneous embedding of two\ndisjoint graphs into one surface such that the number of edge crossings\n(between the two graphs) is minimized. It was introduced by Negami in 2001 in\nconnection with diagonal flips in triangulations of surfaces, and subsequently\ninvestigated in a general form for small-genus surfaces. We prove that all of\nthe commonly considered variants of this problem are NP-hard already in the\norientable surface of genus 6, by a reduction from a special variant of the\nanchored crossing number problem of Cabello and Mohar.\n", "versions": [{"version": "v1", "created": "Sun, 6 Sep 2015 08:51:02 GMT"}], "update_date": "2015-09-08", "authors_parsed": [["Hliněný", "Petr", ""], ["Salazar", "Gelasio", ""]]}, {"id": "1509.01852", "submitter": "Giovanni Rossi Mr", "authors": "Giovanni Rossi", "title": "Weighted paths between partitions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How to quantify the distance between any two partitions of a finite set is an\nimportant issue in statistical classification, whenever different clustering\nresults need to be compared. Developing from the traditional Hamming distance\nbetween subsets or cardinality of their symmetric difference, this work\nconsiders alternative metric distances between partitions. With one exception,\nall of them obtain as minimum-weight paths in the undirected graph\ncorresponding to the Hasse diagram of the partition lattice. Firstly, by\nfocusing on the atoms of the lattice, one well-known partition distance is\nrecognized to be in fact the analog of the Hamming distance between subsets,\nwith weights on edges of the Hasse diagram determined through the number of\natoms in the unique maximal join-decomposition of partitions. Secondly, another\npartition distance known as \"variation of information\" is seen to correspond to\na minimum-weight path with edge weights determined by the entropy of\npartitions. These two distances are next compared in terms of their upper and\nlower bounds over all pairs of partitions that are complements of one another.\nWhat emerges is that the two distances share the same minimizers and\nmaximizers, while a much rawer behavior is observed for the partition distance\nwhich does not correspond to a minimum-weight path. The idea of measuring the\ndistance between partitions by means of minimum-weight paths in the Hasse\ndiagram is further explored by considering alternative symmetric and\norder-preserving/inverting partition functions (such as the the rank, in the\nsimplest case) for assigning weights to edges. What matters most, in such a\ngeneral setting, turns out to be whether the weighting function is supermodular\nor else submodular, as this makes any minimum-weight path visit the meet or\nelse the join of the two partitions, depending on order preserving/inverting.\n", "versions": [{"version": "v1", "created": "Sun, 6 Sep 2015 20:34:53 GMT"}, {"version": "v2", "created": "Sat, 10 Dec 2016 16:01:30 GMT"}], "update_date": "2016-12-13", "authors_parsed": [["Rossi", "Giovanni", ""]]}, {"id": "1509.01866", "submitter": "Richard Taylor Dr", "authors": "Richard Taylor", "title": "Approximation of the Quadratic Knapsack Problem", "comments": "8 pages one figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For any given $\\epsilon>0$ we provide an algorithm for the Quadratic Knapsack\nProblem that has an approximation ratio within $O(n^{2/5+\\epsilon})$ and a run\ntime within $O(n^{9/\\epsilon})$.\n", "versions": [{"version": "v1", "created": "Sun, 6 Sep 2015 23:21:39 GMT"}, {"version": "v2", "created": "Mon, 23 May 2016 01:12:25 GMT"}], "update_date": "2016-05-24", "authors_parsed": [["Taylor", "Richard", ""]]}, {"id": "1509.01981", "submitter": "Kolja Knauer", "authors": "Ignacio Garc\\'ia-Marco, Kolja Knauer", "title": "Drawing graphs with vertices and edges in convex position", "comments": "15 pages, 12 figures, improved exposition", "journal-ref": "Computational Geometry 58 (2016) 25-33", "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A graph has strong convex dimension $2$, if it admits a straight-line drawing\nin the plane such that its vertices are in convex position and the midpoints of\nits edges are also in convex position. Halman, Onn, and Rothblum conjectured\nthat graphs of strong convex dimension $2$ are planar and therefore have at\nmost $3n-6$ edges. We prove that all such graphs have at most $2n-3$ edges\nwhile on the other hand we present a class of non-planar graphs of strong\nconvex dimension $2$. We also give lower bounds on the maximum number of edges\na graph of strong convex dimension $2$ can have and discuss variants of this\ngraph class. We apply our results to questions about large convexly independent\nsets in Minkowski sums of planar point sets, that have been of interest in\nrecent years.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2015 11:01:24 GMT"}, {"version": "v2", "created": "Wed, 15 Jun 2016 09:30:41 GMT"}], "update_date": "2017-01-17", "authors_parsed": [["García-Marco", "Ignacio", ""], ["Knauer", "Kolja", ""]]}, {"id": "1509.02485", "submitter": "Diego Delle Donne", "authors": "Victor Campos, Ricardo C. Corr\\^ea, Diego Delle Donne, Javier Marenco,\n  Annegret Wagler", "title": "Polyhedral studies of vertex coloring problems: The asymmetric\n  representatives formulation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the fact that some vertex coloring problems are polynomially solvable\non certain graph classes, most of these problems are not \"under control\" from a\npolyhedral point of view. The equivalence between \\emph{optimization} and\n\\emph{polyhedral separation} suggests that, for these problems, there must\nexist formulations admitting some elegant characterization for the polytopes\nassociated to them. Therefore, it is interesting to study known formulations\nfor vertex coloring with the goal of finding such characterizations. In this\nwork we study the asymmetric representatives formulation and we show that the\ncorresponding coloring polytope, for a given graph $G$, can be interpreted as\nthe stable set polytope of another graph obtained from $G$. This result allows\nus to derive complete characterizations for the corresponding coloring polytope\nfor some families of graphs, based on known complete characterizations for the\nstable set polytope.\n", "versions": [{"version": "v1", "created": "Fri, 28 Aug 2015 14:38:55 GMT"}], "update_date": "2015-09-09", "authors_parsed": [["Campos", "Victor", ""], ["Corrêa", "Ricardo C.", ""], ["Donne", "Diego Delle", ""], ["Marenco", "Javier", ""], ["Wagler", "Annegret", ""]]}, {"id": "1509.02843", "submitter": "Jordan Greenblatt", "authors": "Jordan Greenblatt", "title": "Dimensionally Exponential Lower Bounds on the $L^p$ Norms of the\n  Spherical Maximal Operator for Cartesian Powers of Finite Trees and Related\n  Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM math.CA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $T$ be a finite tree graph, $T^N$ be the Cartesian power graph of $T$,\nand $d^N$ be the graph distance metric on $T^N$. Also let \\[ \\mathbb S_r^N(x)\n:= \\{v \\in T^N: d^N(x,v) = r\\} \\] be the sphere of radius $r$ centered at $x$\nand $M$ be the spherical maximal averaging operator on $T^N$ given by \\[ Mf(x)\n:= \\sup_{\\substack{r \\geq 0 \\\\ \\mathbb S_r^N(x) \\neq \\emptyset}}\n\\frac{1}{|\\mathbb S_r^N(x)|} |\\sum_{\\mathbb S_r^N(x)} f(y)|. \\] We will show\nthat for any fixed $1 \\leq p \\leq \\infty$, the $L^p$ operator norm of $M$, i.e.\n\\[ \\|M\\|_p := \\sup_{\\|f\\|_p = 1} \\|Mf\\|_p, \\] grows exponentially in the\ndimension $N$. In particular, if $r$ is the probability that a random vertex of\n$T$ is a leaf, then $\\|M\\|_p \\geq r^{-N/p}$, although this is not a sharp\nbound.\n  This exponential growth phenomenon extends to a class of graphs strictly\nlarger than trees, which we will call \\emph{global antipode graphs}. This\ngrowth result stands in contrast to the work of Greenblatt, Harrow, Kolla,\nKrause, and Schulman that proved that the spherical maximal $L^p$ bounds (for\n$p > 1$) are dimension-independent for finite cliques.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 16:37:13 GMT"}], "update_date": "2015-09-10", "authors_parsed": [["Greenblatt", "Jordan", ""]]}, {"id": "1509.02972", "submitter": "Jared Lichtman", "authors": "Jared D. Lichtman", "title": "On the Multidimensional Stable Marriage Problem", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a problem definition of the stable marriage problem for a general\nnumber of parties $p$ under a natural preference scheme in which each person\nhas simple lists for the other parties. We extend the notion of stability in a\nnatural way and present so called elemental and compound algorithms to generate\nmatchings for a problem instance. We demonstrate the stability of matchings\ngenerated by both algorithms, as well as show that the former runs in $O(pn^2)$\ntime.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 23:03:38 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Lichtman", "Jared D.", ""]]}, {"id": "1509.02975", "submitter": "Steve Huntsman", "authors": "Steve Huntsman and Arman Rezaee", "title": "De Bruijn entropy and string similarity", "comments": "Extended version of a paper presented at WORDS 2015; MATLAB source\n  code and scripts for reproducing results are included", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.IT math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the notion of de Bruijn entropy of an Eulerian quiver and show\nhow the corresponding relative entropy can be applied to practical string\nsimilarity problems. This approach explicitly links the combinatorial and\ninformation-theoretical properties of words and its performance is superior to\nedit distances in many respects and competitive in most others. The\ncomputational complexity of our current implementation is parametrically\ntunable between linear and cubic, and we outline how an optimized linear\nalgebra subroutine can reduce the cubic complexity to approximately linear.\nNumerous examples are provided, including a realistic application to molecular\nphylogenetics.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 23:27:04 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Huntsman", "Steve", ""], ["Rezaee", "Arman", ""]]}, {"id": "1509.03016", "submitter": "EPTCS", "authors": "Dilian Gurov (KTH Royal Institute of Technology, Stockholm, Sweden),\n  Minko Markov (St. Kliment Ohridski University of Sofia, Sofia, Bulgaria)", "title": "Self-Correlation and Maximum Independence in Finite Relations", "comments": "In Proceedings FICS 2015, arXiv:1509.02826", "journal-ref": "EPTCS 191, 2015, pp. 60-74", "doi": "10.4204/EPTCS.191.7", "report-no": null, "categories": "cs.DM cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider relations with no order on their attributes as in Database\nTheory. An independent partition of the set of attributes S of a finite\nrelation R is any partition X of S such that the join of the projections of R\nover the elements of X yields R. Identifying independent partitions has many\napplications and corresponds conceptually to revealing orthogonality between\nsets of dimensions in multidimensional point spaces. A subset of S is termed\nself-correlated if there is a value of each of its attributes such that no\ntuple of R contains all those values. This paper uncovers a connection between\nindependence and self-correlation, showing that the maximum independent\npartition is the least fixed point of a certain inflationary transformer alpha\nthat operates on the finite lattice of partitions of S. alpha is defined via\nthe minimal self-correlated subsets of S. We use some additional properties of\nalpha to show the said fixed point is still the limit of the standard\napproximation sequence, just as in Kleene's well-known fixed point theorem for\ncontinuous functions.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2015 05:31:46 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Gurov", "Dilian", "", "KTH Royal Institute of Technology, Stockholm, Sweden"], ["Markov", "Minko", "", "St. Kliment Ohridski University of Sofia, Sofia, Bulgaria"]]}, {"id": "1509.03547", "submitter": "Yasmeen Shameem Akhtar", "authors": "Soumen Maity, Yasmeen Akhtar, Reshma C Chandrasekharan, Charles J\n  Colbourn", "title": "Improved Strength Four Covering Arrays with Three Symbols", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A covering array $t$-$CA(n,k,g)$, of size $n$, strength $t$, degree $k$, and\norder $g$, is a $k\\times n$ array on $g$ symbols such that every $t\\times n$\nsub-array contains every $t\\times 1$ column on $g$ symbols at least once.\nCovering arrays have been studied for their applications to software testing,\nhardware testing, drug screening, and in areas where interactions of multiple\nparameters are to be tested. In this paper, we present an algebraic\nconstruction that improves many of the best known upper bounds on $n$ for\ncovering arrays 4-$CA(n,k,g)$ with $g=3$. The $coverage$ $measure$ $\\mu_t(A)$\nof a testing array $A$ is defined by the ratio between the number of distinct\n$t$-tuples contained in the column vectors of $A$ and the total number of\n$t$-tuples. A covering array is a testing array with full coverage. The\n$covering$ $arrays$ $with$ $budget$ $constraints$ $problem$ is the problem of\nconstructing a testing array of size at most $n$ having largest possible\ncoverage measure, given values of $k,g$ and $n$. This paper presents several\nstrength four testing arrays with high coverage. The construction here is a\ngeneralisation of the construction methods used by Chateauneuf, Colbourn and\nKreher, and Meagher and Stevens.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2015 15:13:33 GMT"}, {"version": "v2", "created": "Wed, 30 Dec 2015 05:59:07 GMT"}], "update_date": "2015-12-31", "authors_parsed": [["Maity", "Soumen", ""], ["Akhtar", "Yasmeen", ""], ["Chandrasekharan", "Reshma C", ""], ["Colbourn", "Charles J", ""]]}, {"id": "1509.03574", "submitter": "Hosam Abdo", "authors": "Hosam Abdo, Darko Dimitrov, Ivan Gutman", "title": "On extremal trees with respect to the $F$-index", "comments": "13 pages, 2 Figures, 2 Tabels", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a study on the structure--dependency of the total $\\pi$-electron energy\nfrom 1972, Trinajsti\\'c and one of the present authors have shown that it\ndepends on the sums $\\sum_{v\\in V}d(v)^2$ and $\\sum_{v\\in V}d(v)^3$, where\n$d(v)$ is the degree of a vertex $v$ of the underling molecular graph $G$. The\nfirst sum was later named {\\it first Zagreb index} and over the years became\none of the most investigated graph--based molecular structure descriptors. On\nthe other hand, the second sum, except in very few works on the general first\nZagreb index and the zeroth--order general Randi\\'c index, has been almost\ncompletely neglected. Recently, this second sum was named {\\em forgotten\nindex}, or shortly the $F$-{\\em index}, and shown to have an exceptional\napplicative potential. In this paper we examine the trees extremal with respect\nto the $F$-index.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2015 16:14:36 GMT"}, {"version": "v2", "created": "Fri, 18 Sep 2015 09:48:18 GMT"}], "update_date": "2015-09-21", "authors_parsed": [["Abdo", "Hosam", ""], ["Dimitrov", "Darko", ""], ["Gutman", "Ivan", ""]]}, {"id": "1509.03817", "submitter": "Mircea Parpalea", "authors": "Mircea Parpalea, Nicoleta Avesalon, Eleonor Ciurea", "title": "Minimum parametric flow over time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents a dynamic solution method for dynamic minimum parametric\nnetworks flow. The solution method solves the problem for a special parametric\ndynamic network with linear lower bound functions of a single parameter.\nInstead directly work on the original network, the method implements a\nlabelling algorithm in the parametric dynamic residual network and uses\nquickest paths from the source node to the sink node in the time-space network\nalong which repeatedly decreases the dynamic flow for a sequence of parameter\nvalues, in their increasing order. In each iteration, the algorithm computes\nboth the minimum flow for a certain subinterval of the parameter values, and\nthe new breakpoint for the maximum parametric dynamic flow value function.\n", "versions": [{"version": "v1", "created": "Sun, 13 Sep 2015 06:30:00 GMT"}], "update_date": "2015-09-15", "authors_parsed": [["Parpalea", "Mircea", ""], ["Avesalon", "Nicoleta", ""], ["Ciurea", "Eleonor", ""]]}, {"id": "1509.03976", "submitter": "Mikael Gast", "authors": "Mikael Gast, Mathias Hauptmann and Marek Karpinski", "title": "Approximability of TSP on Power Law Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM math.CO math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the special case of Graphic TSP where the underlying\ngraph is a power law graph (PLG). We give a refined analysis of some of the\ncurrent best approximation algorithms and show that an improved approximation\nratio can be achieved for certain ranges of the power law exponent $\\beta$. For\nthe value of power law exponent $\\beta=1.5$ we obtain an approximation ratio of\n$1.34$ for Graphic TSP. Moreover we study the $(1,2)$-TSP with the underlying\ngraph of $1$-edges being a PLG. We show improved approximation ratios in the\ncase of underlying deterministic PLGs for $\\beta$ greater than $1.666$. For\nunderlying random PLGs we further improve the analysis and show even better\nexpected approximation ratio for the range of $\\beta$ between $1$ and $3.5$. On\nthe other hand we prove the first explicit inapproximability bounds for\n$(1,2)$-TSP for an underlying power law graph.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2015 07:50:27 GMT"}], "update_date": "2015-09-15", "authors_parsed": [["Gast", "Mikael", ""], ["Hauptmann", "Mathias", ""], ["Karpinski", "Marek", ""]]}, {"id": "1509.04199", "submitter": "Eric Sopena", "authors": "Eric Sopena (LaBRI)", "title": "i-MARK: A New Subtraction Division Game", "comments": "A few typos have been corrected, including the statement of Theorem 8", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given two finite sets of integers $S\\subseteq\\NNN\\setminus\\{0\\}$ and\n$D\\subseteq\\NNN\\setminus\\{0,1\\}$,the impartial combinatorial game $\\IMARK(S,D)$\nis played on a heap of tokens. From a heap of $n$ tokens, each player can\nmoveeither to a heap of $n-s$ tokens for some $s\\in S$, or to a heap of $n/d$\ntokensfor some $d\\in D$ if $d$ divides $n$.Such games can be considered as an\nintegral variant of \\MARK-type games, introduced by Elwyn Berlekamp and Joe\nBuhlerand studied by Aviezri Fraenkel and Alan Guo, for which it is allowed to\nmove from a heap of $n$ tokensto a heap of $\\lfloor n/d\\rfloor$ tokens for any\n$d\\in D$.Under normal convention, it is observed that the Sprague-Grundy\nsequence of the game $\\IMARK(S,D)$ is aperiodic for any sets $S$ and\n$D$.However, we prove that, in many cases, this sequence is almost periodic and\nthat the set of winning positions is periodic.Moreover, in all these cases, the\nSprague-Grundy value of a heap of $n$ tokens can be computed in time $O(\\log\nn)$.We also prove that, under mis\\`ere convention, the outcome sequence of\nthese games is purely periodic.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2015 16:57:57 GMT"}, {"version": "v2", "created": "Mon, 9 Nov 2015 15:11:52 GMT"}], "update_date": "2015-11-10", "authors_parsed": [["Sopena", "Eric", "", "LaBRI"]]}, {"id": "1509.04273", "submitter": "Konrad Dabrowski", "authors": "Andreas Brandst\\\"adt, Konrad K. Dabrowski, Shenwei Huang, Dani\\\"el\n  Paulusma", "title": "Bounding the Clique-Width of $H$-free Split Graphs", "comments": "17 pages, 5 figures. An extended abstract of this paper appeared in\n  the proceedings of EuroComb 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A graph is $H$-free if it has no induced subgraph isomorphic to $H$. We\ncontinue a study into the boundedness of clique-width of subclasses of perfect\ngraphs. We identify five new classes of $H$-free split graphs whose\nclique-width is bounded. Our main result, obtained by combining new and known\nresults, provides a classification of all but two stubborn cases, that is, with\ntwo potential exceptions we determine all graphs $H$ for which the class of\n$H$-free split graphs has bounded clique-width.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2015 20:07:31 GMT"}], "update_date": "2015-09-16", "authors_parsed": [["Brandstädt", "Andreas", ""], ["Dabrowski", "Konrad K.", ""], ["Huang", "Shenwei", ""], ["Paulusma", "Daniël", ""]]}, {"id": "1509.04565", "submitter": "Tilen Marc", "authors": "Tilen Marc", "title": "Classification of vertex-transitive cubic partial cubes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Partial cubes are graphs isometrically embeddable into hypercubes. In this\npaper it is proved that every cubic, vertex-transitive partial cube is\nisomorphic to one of the following graphs: $K_2 \\, \\square \\, C_{2n}$, for some\n$n\\geq 2$, the generalized Petersen graph $G(10,3)$, the cubic permutahedron,\nthe truncated cuboctahedron, or the truncated icosidodecahedron. This\nclassification is a generalization of results of Bre\\v{s}ar et al.~from 2004 on\ncubic mirror graphs, it includes all cubic, distance-regular partial cubes\n(Weichsel, 1992), and presents a contribution to the classification of all\ncubic partial cubes.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2015 14:03:22 GMT"}, {"version": "v2", "created": "Thu, 21 Jul 2016 13:37:02 GMT"}], "update_date": "2016-07-22", "authors_parsed": [["Marc", "Tilen", ""]]}, {"id": "1509.04696", "submitter": "Robert W Bell", "authors": "Taylor Ball, Robert W. Bell, Jonathan Guzman, Madeleine Hanson-Colvin,\n  and Nikolas Schonscheck", "title": "On the cop number of generalized Petersen graphs", "comments": "12 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the cop number of every generalized Petersen graph is at most 4.\nThe strategy is to play a modified game of cops and robbers on an infinite\ncyclic covering space where the objective is to capture the robber or force the\nrobber towards an end of the infinite graph. We prove that finite isometric\nsubtrees are 1-guardable and apply this to determine the exact cop number of\nsome families of generalized Petersen graphs. We also extend these ideas to\nprove that the cop number of any connected I-graph is at most 5.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2015 19:42:49 GMT"}], "update_date": "2015-09-16", "authors_parsed": [["Ball", "Taylor", ""], ["Bell", "Robert W.", ""], ["Guzman", "Jonathan", ""], ["Hanson-Colvin", "Madeleine", ""], ["Schonscheck", "Nikolas", ""]]}, {"id": "1509.04880", "submitter": "Ignasi Sau", "authors": "Eunjung Kim, Sang-il Oum, Christophe Paul, Ignasi Sau, Dimitrios M.\n  Thilikos", "title": "An FPT 2-Approximation for Tree-Cut Decomposition", "comments": "17 pages, 3 figures", "journal-ref": "Algorithmica, 80(1)(January 2018), pp. 116-135", "doi": "10.1007/s00453-016-0245-5", "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tree-cut width of a graph is a graph parameter defined by Wollan [J.\nComb. Theory, Ser. B, 110:47-66, 2015] with the help of tree-cut\ndecompositions. In certain cases, tree-cut width appears to be more adequate\nthan treewidth as an invariant that, when bounded, can accelerate the\nresolution of intractable problems. While designing algorithms for problems\nwith bounded tree-cut width, it is important to have a parametrically tractable\nway to compute the exact value of this parameter or, at least, some constant\napproximation of it. In this paper we give a parameterized 2-approximation\nalgorithm for the computation of tree-cut width; for an input $n$-vertex graph\n$G$ and an integer $w$, our algorithm either confirms that the tree-cut width\nof $G$ is more than $w$ or returns a tree-cut decomposition of $G$ certifying\nthat its tree-cut width is at most $2w$, in time $2^{O(w^2\\log w)} \\cdot n^2$.\nPrior to this work, no constructive parameterized algorithms, even approximated\nones, existed for computing the tree-cut width of a graph. As a consequence of\nthe Graph Minors series by Robertson and Seymour, only the existence of a\ndecision algorithm was known.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 10:50:00 GMT"}], "update_date": "2018-05-16", "authors_parsed": [["Kim", "Eunjung", ""], ["Oum", "Sang-il", ""], ["Paul", "Christophe", ""], ["Sau", "Ignasi", ""], ["Thilikos", "Dimitrios M.", ""]]}, {"id": "1509.04927", "submitter": "Norbert Blum", "authors": "Norbert Blum", "title": "Maximum Matching in General Graphs Without Explicit Consideration of\n  Blossoms Revisited", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We reduce the problem of finding an augmenting path in a general graph to a\nreachability problem in a directed bipartite graph. A slight modification of\ndepth-first search leads to an algorithm for finding such paths. Although this\nsetting is equivalent to the traditional terminology of blossoms due to\nEdmonds, there are some advantages. Mainly, this point of view enables the\ndescription of algorithms for the solution of matching problems without\nexplicit analysis of blossoms, nested blossoms, and so on. Exemplary, we\ndescribe an efficient realization of the Hopcroft-Karp approach for the\ncomputation of a maximum cardinality matching in general graphs and a variant\nof Edmonds' primal-dual algorithm for the maximum weighted matching problem.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 14:11:38 GMT"}], "update_date": "2015-09-17", "authors_parsed": [["Blum", "Norbert", ""]]}, {"id": "1509.04932", "submitter": "Meijie Ma", "authors": "Meijie Ma", "title": "Cycles in enhanced hypercubes", "comments": "9 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The enhanced hypercube $Q_{n,k}$ is a variant of the hypercube $Q_n$. We\ninvestigate all the lengths of cycles that an edge of the enhanced hypercube\nlies on. It is proved that every edge of $Q_{n,k}$ lies on a cycle of every\neven length from $4$ to $2^n$; if $k$ is even, every edge of $Q_{n,k}$ also\nlies on a cycle of every odd length from $k+3$ to $2^n-1$, and some special\nedges lie on a shortest odd cycle of length $k+1$.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 14:23:58 GMT"}], "update_date": "2015-09-17", "authors_parsed": [["Ma", "Meijie", ""]]}, {"id": "1509.04944", "submitter": "Hung-Lung Wang", "authors": "Wing-Kai Hon, Ton Kloks, Hsiang-Hsuan Liu, Hung-Lung Wang, Yue-Li Wang", "title": "Convexities in Some Special Graph Classes ---New Results in AT-free\n  Graphs and Beyond", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study convexity properties of graphs. In this paper we present a\nlinear-time algorithm for the geodetic number in tree-cographs. Settling a\n10-year-old conjecture, we prove that the Steiner number is at least the\ngeodetic number in AT-free graphs. Computing a maximal and proper monophonic\nset in $\\AT$-free graphs is NP-complete. We present polynomial algorithms for\nthe monophonic number in permutation graphs and the geodetic number in $P_4$-\nsparse graphs.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 15:13:08 GMT"}], "update_date": "2015-09-17", "authors_parsed": [["Hon", "Wing-Kai", ""], ["Kloks", "Ton", ""], ["Liu", "Hsiang-Hsuan", ""], ["Wang", "Hung-Lung", ""], ["Wang", "Yue-Li", ""]]}, {"id": "1509.05057", "submitter": "Taylor Short", "authors": "Taylor Short", "title": "On some conjectures concerning critical independent sets of a graph", "comments": "10 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $G$ be a simple graph with vertex set $V(G)$. A set $S\\subseteq V(G)$ is\nindependent if no two vertices from $S$ are adjacent. For $X\\subseteq V(G)$,\nthe difference of $X$ is $d(X) = |X|-|N(X)|$ and an independent set $A$ is\ncritical if $d(A) = \\max \\{d(X): X\\subseteq V(G) \\text{ is an independent\nset}\\}$ (possibly $A=\\emptyset$). Let $\\text{nucleus}(G)$ and\n$\\text{diadem}(G)$ be the intersection and union, respectively, of all maximum\nsize critical independent sets in $G$. In this paper, we will give two new\ncharacterizations of K\\\"{o}nig-Egerv\\'{a}ry graphs involving\n$\\text{nucleus}(G)$ and $\\text{diadem}(G)$. We also prove a related lower bound\nfor the independence number of a graph. This work answers several conjectures\nposed by Jarden, Levit, and Mandrescu.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 20:33:40 GMT"}], "update_date": "2015-09-18", "authors_parsed": [["Short", "Taylor", ""]]}, {"id": "1509.05069", "submitter": "Marc Hellmuth", "authors": "Marc Hellmuth and Nicolas Wieseke", "title": "On Tree Representations of Relations and Graphs: Symbolic Ultrametrics\n  and Cograph Edge Decompositions", "comments": "arXiv admin note: substantial text overlap with arXiv:1501.03931", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tree representations of (sets of) symmetric binary relations, or equivalently\nedge-colored undirected graphs, are of central interest, e.g.\\ in\nphylogenomics. In this context symbolic ultrametrics play a crucial role.\nSymbolic ultrametrics define an edge-colored complete graph that allows to\nrepresent the topology of this graph as a vertex-colored tree. Here, we are\ninterested in the structure and the complexity of certain combinatorial\nproblems resulting from considerations based on symbolic ultrametrics, and on\nalgorithms to solve them.\n  This includes, the characterization of symbolic ultrametrics that\nadditionally distinguishes between edges and non-edges of \\emph{arbitrary}\nedge-colored graphs $G$ and thus, yielding a tree representation of $G$, by\nmeans of so-called cographs. Moreover, we address the problem of finding\n\"closest\" symbolic ultrametrics and show the NP-completeness of the three\nproblems: symbolic ultrametric editing, completion and deletion. Finally, as\nnot all graphs are cographs, and hence, don't have a tree representation, we\nask, furthermore, what is the minimum number of cotrees needed to represent the\ntopology of an arbitrary non-cograph $G$. This is equivalent to find an optimal\ncograph edge $k$-decomposition $\\{E_1,\\dots,E_k\\}$ of $E$ so that each subgraph\n$(V,E_i)$ of $G$ is a cograph. We investigate this problem in full detail,\nresulting in several new open problems, and NP-hardness results.\n  For all optimization problems proven to be NP-hard we will provide integer\nlinear program (ILP) formulations to efficiently solve them.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 21:38:32 GMT"}], "update_date": "2015-09-18", "authors_parsed": [["Hellmuth", "Marc", ""], ["Wieseke", "Nicolas", ""]]}, {"id": "1509.05255", "submitter": "Siaw-Lynn Ng Dr", "authors": "S.-L. Ng and M.B. Paterson", "title": "Disjoint difference families and their applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Difference sets and their generalisations to difference families arise from\nthe study of designs and many other applications. Here we give a brief survey\nof some of these applications, noting in particular the diverse definitions of\ndifference families and the variations in priorities in constructions. We\npropose a definition of disjoint difference families that encompasses these\nvariations and allows a comparison of the similarities and disparities. We then\nfocus on two constructions of disjoint difference families arising from\nfrequency hopping sequences and showed that they are in fact the same. We\nconclude with a discussion of the notion of equivalence for frequency hopping\nsequences and for disjoint difference families.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2015 13:46:06 GMT"}, {"version": "v2", "created": "Thu, 22 Oct 2015 11:09:03 GMT"}], "update_date": "2015-10-23", "authors_parsed": [["Ng", "S. -L.", ""], ["Paterson", "M. B.", ""]]}, {"id": "1509.05559", "submitter": "Junjie Ye", "authors": "Leizhen Cai, Junjie Ye", "title": "Finding Two Edge-Disjoint Paths with Length Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of finding, for two pairs $(s_1,t_1)$ and $(s_2,t_2)$\nof vertices in an undirected graphs, an $(s_1,t_1)$-path $P_1$ and an\n$(s_2,t_2)$-path $P_2$ such that $P_1$ and $P_2$ share no edges and the length\nof each $P_i$ satisfies $L_i$, where $L_i \\in \\{ \\le k_i, \\; = k_i, \\; \\ge k_i,\n\\; \\le \\infty\\}$.\n  We regard $k_1$ and $k_2$ as parameters and investigate the parameterized\ncomplexity of the above problem when at least one of $P_1$ and $P_2$ has a\nlength constraint (note that $L_i = \"\\le \\infty\"$ indicates that $P_i$ has no\nlength constraint). For the nine different cases of $(L_1, L_2)$, we obtain FPT\nalgorithms for seven of them. Our algorithms uses random partition backed by\nsome structural results. On the other hand, we prove that the problem admits no\npolynomial kernel for all nine cases unless $NP \\subseteq coNP/poly$.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 09:28:23 GMT"}], "update_date": "2015-09-21", "authors_parsed": [["Cai", "Leizhen", ""], ["Ye", "Junjie", ""]]}, {"id": "1509.05586", "submitter": "Yohann Benchetrit", "authors": "Yohann Benchetrit and Andr\\'as Seb\\H{o}", "title": "Ear-decompositions and the complexity of the matching polytope", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The complexity of the matching polytope of graphs may be measured with the\nmaximum length $\\beta$ of a starting sequence of odd ears in an\near-decomposition. Indeed, a theorem of Edmonds and Pulleyblank shows that its\nfacets are defined by 2-connected factor-critical graphs, which have an odd\near-decomposition (according to a theorem of Lov\\'asz). In particular,\n$\\beta(G) \\leq 1$ if and only if the matching polytope of the graph $G$ is\ncompletely described by non-negativity, star and odd-circuit inequalities. This\nis essentially equivalent to the h-perfection of the line-graph of $G$, as\nobserved by Cao and Nemhauser.\n  The complexity of computing $\\beta$ is apparently not known. We show that\ndeciding whether $\\beta(G)\\leq 1$ can be executed efficiently by looking at any\near-decomposition starting with an odd circuit and performing basic modulo-2\ncomputations. Such a greedy-approach is surprising in view of the complexity of\nthe problem in more special cases by Bruhn and Schaudt, and it is simpler than\nusing the Parity Minor Algorithm.\n  Our results imply a simple polynomial-time algorithm testing h-perfection in\nline-graphs (deciding h-perfection is open in general). We also generalize our\napproach to binary matroids and show that computing $\\beta$ is a\nFixed-Parameter-Tractable problem (FPT).\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 10:55:58 GMT"}], "update_date": "2015-09-21", "authors_parsed": [["Benchetrit", "Yohann", ""], ["Sebő", "András", ""]]}, {"id": "1509.05807", "submitter": "Vincent Vajnovszki", "authors": "Sergey Avgustinovich, Sergey Kitaev, Vladimir N. Potapov, Vincent\n  Vajnovszki", "title": "Gray coding planar maps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The idea of (combinatorial) Gray codes is to list objects in question in such\na way that two successive objects differ in some pre-specified small way. In\nthis paper, we utilize beta-description trees to cyclicly Gray code three\nclasses of cubic planar maps, namely, bicubic planar maps, 3-connected cubic\nplanar maps, and cubic non-separable planar maps.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 21:50:18 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Avgustinovich", "Sergey", ""], ["Kitaev", "Sergey", ""], ["Potapov", "Vladimir N.", ""], ["Vajnovszki", "Vincent", ""]]}, {"id": "1509.05828", "submitter": "Francisco Soulignac", "authors": "Francisco J. Soulignac", "title": "A certifying and dynamic algorithm for the recognition of proper\n  circular-arc graphs", "comments": "44 pages, 8 figures, appendix with 11 pages and many figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a dynamic algorithm for the recognition of proper circular-arc\n(PCA) graphs, that supports the insertion and removal of vertices (together\nwith its incident edges). The main feature of the algorithm is that it outputs\na minimally non-PCA induced subgraph when the insertion of a vertex fails. Each\noperation cost $O(\\log n + d)$ time, where $n$ is the number vertices and $d$\nis the degree of the modified vertex. When removals are disallowed, each\ninsertion is processed in $O(d)$ time. The algorithm also provides two\nconstant-time operations to query if the dynamic graph is proper Helly (PHCA)\nor proper interval (PIG). When the dynamic graph is not PHCA (resp. PIG), a\nminimally non-PHCA (resp. non-PIG) induced subgraph is obtained.\n", "versions": [{"version": "v1", "created": "Sat, 19 Sep 2015 00:06:19 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Soulignac", "Francisco J.", ""]]}, {"id": "1509.05977", "submitter": "Dohan Kim", "authors": "Dohan Kim", "title": "Group-theoretical vector space model", "comments": "This is an Accepted Manuscript of an article published by Taylor &\n  Francis Group in International Journal of Computer Mathematics on 16/09/2014,\n  available online: http://dx.doi.org/10.1080/00207160.2014.958079", "journal-ref": "Int. J. Comput. Math. 92(8): 1536-1550 (2015)", "doi": "10.1080/00207160.2014.958079", "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a group-theoretical vector space model (VSM) that extends\nthe VSM with a group action on a vector space of the VSM. We use group and its\nrepresentation theory to represent a dynamic transformation of information\nobjects, in which each information object is represented by a vector in a\nvector space of the VSM. Several groups and their matrix representations are\nemployed for representing different kinds of dynamic transformations of\ninformation objects used in the VSM. We provide concrete examples of how a\ndynamic transformation of information objects is performed and discuss\nalgebraic properties involving certain dynamic transformations of information\nobjects used in the VSM.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2015 08:11:51 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Kim", "Dohan", ""]]}, {"id": "1509.06029", "submitter": "Siddharth Jain", "authors": "Siddharth Jain, Farzad Farnoud, Jehoshua Bruck", "title": "Capacity and Expressiveness of Genomic Tandem Duplication", "comments": "19 pages, 3 figures, submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/ISIT.2015.7282795", "report-no": null, "categories": "cs.IT cs.DM cs.FL math.IT q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The majority of the human genome consists of repeated sequences. An important\ntype of repeated sequences common in the human genome are tandem repeats, where\nidentical copies appear next to each other. For example, in the sequence\n$AGTC\\underline{TGTG}C$, $TGTG$ is a tandem repeat, that may be generated from\n$AGTCTGC$ by a tandem duplication of length $2$. In this work, we investigate\nthe possibility of generating a large number of sequences from a \\textit{seed},\ni.e.\\ a small initial string, by tandem duplications of bounded length. We\nstudy the capacity of such a system, a notion that quantifies the system's\ngenerating power. Our results include \\textit{exact capacity} values for\ncertain tandem duplication string systems. In addition, motivated by the role\nof DNA sequences in expressing proteins via RNA and the genetic code, we define\nthe notion of the \\textit{expressiveness} of a tandem duplication system as the\ncapability of expressing arbitrary substrings. We then \\textit{completely}\ncharacterize the expressiveness of tandem duplication systems for general\nalphabet sizes and duplication lengths. In particular, based on a celebrated\nresult by Axel Thue from 1906, presenting a construction for ternary\nsquare-free sequences, we show that for alphabets of size 4 or larger, bounded\ntandem duplication systems, regardless of the seed and the bound on duplication\nlength, are not fully expressive, i.e. they cannot generate all strings even as\nsubstrings of other strings. Note that the alphabet of size 4 is of particular\ninterest as it pertains to the genomic alphabet. Building on this result, we\nalso show that these systems do not have full capacity. In general, our results\nillustrate that duplication lengths play a more significant role than the seed\nin generating a large number of sequences for these systems.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2015 17:33:13 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Jain", "Siddharth", ""], ["Farnoud", "Farzad", ""], ["Bruck", "Jehoshua", ""]]}, {"id": "1509.06048", "submitter": "Abdolahad Noori Zehmakan", "authors": "Abdolahad Noori Zehmakan and Mojtaba Eslahi", "title": "A linear approximation algorithm for the BPP with the best possible\n  absolute approximation ratio", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Bin Packing Problem is one of the most important Combinatorial\nOptimization problems in optimization and has a lot of real-world applications.\nMany approximation algorithms have been presented for this problem because of\nits NP-hard nature. In this article also a new creative approximation algorithm\nis presented for this important problem. It has been proven that the best\napproximation ratio and the best time order for the Bin Packing Problem are 3/2\nand O(n), respectively unless P=NP. The presented algorithm in this article has\nthe best possible factors, O(n) and 3/2.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2015 20:18:46 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Zehmakan", "Abdolahad Noori", ""], ["Eslahi", "Mojtaba", ""]]}, {"id": "1509.06092", "submitter": "Oliver Knill", "authors": "Oliver Knill", "title": "Universality for Barycentric subdivision", "comments": "17 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.SP cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The spectrum of the Laplacian of successive Barycentric subdivisions of a\ngraph converges exponentially fast to a limit which only depends on the clique\nnumber of the initial graph and not on the graph itself. The proof uses an\nexplicit linear operator mapping the clique vector of a graph to the clique\nvector of the Barycentric refinement. The eigenvectors of its transpose produce\nintegral geometric invariants for which Euler characteristic is one example.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 01:48:58 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Knill", "Oliver", ""]]}, {"id": "1509.06139", "submitter": "Zbigniew Golebiewski", "authors": "Bernhard Gittenberger and Zbigniew Go{\\l}\\k{e}biewski", "title": "On the number of lambda terms with prescribed size of their De Bruijn\n  representation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.LO math.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  John Tromp introduced the so-called 'binary lambda calculus' as a way to\nencode lambda terms in terms of binary words. Later, Grygiel and Lescanne\nconjectured that the number of binary lambda terms with $m$ free indices and of\nsize $n$ (encoded as binary words of length $n$) is $o(n^{-3/2} \\tau^{-n})$ for\n$\\tau \\approx 1.963448\\ldots$. We generalize the proposed notion of size and\nshow that for several classes of lambda terms, including binary lambda terms\nwith $m$ free indices, the number of terms of size $n$ is $\\Theta(n^{-3/2}\n\\rho^{-n})$ with some class dependent constant $\\rho$, which in particular\ndisproves the above mentioned conjecture. A way to obtain lower and upper\nbounds for the constant near the leading term is presented and numerical\nresults for a few previously introduced classes of lambda terms are given.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 08:23:01 GMT"}], "update_date": "2015-09-23", "authors_parsed": [["Gittenberger", "Bernhard", ""], ["Gołębiewski", "Zbigniew", ""]]}, {"id": "1509.06191", "submitter": "Jan H\\k{a}z{\\l}a", "authors": "Jan H\\k{a}z{\\l}a, Thomas Holenstein, Elchanan Mossel", "title": "Product Space Models of Correlation: Between Noise Stability and\n  Additive Combinatorics", "comments": null, "journal-ref": "Discrete Analysis, 2018:20, 63 pp", "doi": "10.19086/da.6513", "report-no": null, "categories": "cs.DM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  There is a common theme to some research questions in additive combinatorics\nand noise stability. Both study the following basic question: Let $\\mathcal{P}$\nbe a probability distribution over a space $\\Omega^\\ell$ with all $\\ell$\nmarginals equal. Let $\\underline{X}^{(1)}, \\ldots, \\underline{X}^{(\\ell)}$\nwhere $\\underline{X}^{(j)} = (X_1^{(j)}, \\ldots, X_n^{(j)})$ be random vectors\nsuch that for every coordinate $i \\in [n]$ the tuples $(X_i^{(1)}, \\ldots,\nX_i^{(\\ell)})$ are i.i.d. according to $\\mathcal{P}$.\n  A central question that is addressed in both areas is:\n  - Does there exist a function $c_{\\mathcal{P}}()$ independent of $n$ such\nthat for every $f: \\Omega^n \\to [0, 1]$ with $\\mathrm{E}[f(X^{(1)})] = \\mu >\n0$: \\begin{align*} \\mathrm{E} \\left[ \\prod_{j=1}^\\ell f(X^{(j)}) \\right]\n  \\ge c(\\mu) > 0 \\, ? \\end{align*}\n  Instances of this question include the finite field model version of Roth's\nand Szemer\\'edi's theorems as well as Borell's result about the optimality of\nnoise stability of half-spaces.\n  Our goal in this paper is to interpolate between the noise stability theory\nand the finite field additive combinatorics theory and address the question\nabove in further generality than considered before. In particular, we settle\nthe question for $\\ell = 2$ and when $\\ell > 2$ and $\\mathcal{P}$ has bounded\ncorrelation $\\rho(\\mathcal{P}) < 1$. Under the same conditions we also\ncharacterize the _obstructions_ for similar lower bounds in the case of $\\ell$\ndifferent functions. Part of the novelty in our proof is the combination of\nanalytic arguments from the theories of influences and hyper-contraction with\narguments from additive combinatorics.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 11:31:01 GMT"}, {"version": "v2", "created": "Fri, 2 Jun 2017 19:34:01 GMT"}, {"version": "v3", "created": "Sun, 23 Dec 2018 21:56:49 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Hązła", "Jan", ""], ["Holenstein", "Thomas", ""], ["Mossel", "Elchanan", ""]]}, {"id": "1509.06305", "submitter": "Pooja Pandey", "authors": "Pooja Pandey and Abraham P. Punnen", "title": "On a linearization technique for solving quadratic set covering problem\n  and variations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we identify some inaccuracies in the paper by R.R. Saxena and\nS.R. Arora, A Linearization technique for solving the Quadratic Set Covering\nProblem, Optimization, 39 (1997) 33-42. In particular, we observe that their\nalgorithm need not guarantee optimality, contrary to what is claimed.\nExperimental analysis with the algorithm has been carried out to evaluate its\nmerit as a heuristic and compared with CPLEX. The results disclose that for\nsome class of problems the algorithm is reasonably effective while for some\nother class, it's performance is very poor. we also discussion similar\ninaccuracies in another related paper.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 17:13:09 GMT"}, {"version": "v2", "created": "Fri, 26 Aug 2016 20:44:57 GMT"}], "update_date": "2016-08-30", "authors_parsed": [["Pandey", "Pooja", ""], ["Punnen", "Abraham P.", ""]]}, {"id": "1509.06332", "submitter": "Pooja Pandey", "authors": "Pooja Pandey", "title": "A note on linear fractional set packing problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note we point out various errors in the paper by Rashmi Gupta and R.\nR. Saxena, Set packing problem with linear fractional objective function,\nInternational Journal of Mathematics and Computer Applications Research\n(IJMCAR), 4 (2014) 9 - 18. We also provide some additional results.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 18:29:57 GMT"}, {"version": "v2", "created": "Wed, 23 Sep 2015 21:41:03 GMT"}], "update_date": "2015-09-25", "authors_parsed": [["Pandey", "Pooja", ""]]}, {"id": "1509.06349", "submitter": "Jarkko Peltom\\\"aki", "authors": "Jarkko Peltom\\\"aki, Markus Whiteland", "title": "A square root map on Sturmian words", "comments": "Extended version. 40 pages, 5 figures, 2 tables", "journal-ref": "The Electronic Journal of Combinatorics Vol. 24, Issue 1, #P1.54\n  (2017)", "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a square root map on Sturmian words and study its properties.\nGiven a Sturmian word of slope $\\alpha$, there exists exactly six minimal\nsquares in its language (a minimal square does not have a square as a proper\nprefix). A Sturmian word $s$ of slope $\\alpha$ can be written as a product of\nthese six minimal squares: $s = X_1^2 X_2^2 X_3^2 \\cdots$. The square root of\n$s$ is defined to be the word $\\sqrt{s} = X_1 X_2 X_3 \\cdots$. The main result\nof this paper is that that $\\sqrt{s}$ is also a Sturmian word of slope\n$\\alpha$. Further, we characterize the Sturmian fixed points of the square root\nmap, and we describe how to find the intercept of $\\sqrt{s}$ and an occurrence\nof any prefix of $\\sqrt{s}$ in $s$. Related to the square root map, we\ncharacterize the solutions of the word equation $X_1^2 X_2^2 \\cdots X_n^2 =\n(X_1 X_2 \\cdots X_n)^2$ in the language of Sturmian words of slope $\\alpha$\nwhere the words $X_i^2$ are minimal squares of slope $\\alpha$.\n  We also study the square root map in a more general setting. We explicitly\nconstruct an infinite set of non-Sturmian fixed points of the square root map.\nWe show that the subshifts $\\Omega$ generated by these words have a curious\nproperty: for all $w \\in \\Omega$ either $\\sqrt{w} \\in \\Omega$ or $\\sqrt{w}$ is\nperiodic. In particular, the square root map can map an aperiodic word to a\nperiodic word.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 19:16:45 GMT"}], "update_date": "2017-04-05", "authors_parsed": [["Peltomäki", "Jarkko", ""], ["Whiteland", "Markus", ""]]}, {"id": "1509.06430", "submitter": "David Harris", "authors": "Bernhard Haeupler, David G. Harris", "title": "Parallel algorithms and concentration bounds for the Lovasz Local Lemma\n  via witness DAGs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Lov\\'{a}sz Local Lemma (LLL) is a cornerstone principle in the\nprobabilistic method of combinatorics, and a seminal algorithm of Moser &\nTardos (2010) provides an efficient randomized algorithm to implement it. This\ncan be parallelized to give an algorithm that uses polynomially many processors\nand runs in $O(\\log^3 n)$ time on an EREW PRAM, stemming from $O(\\log n)$\nadaptive computations of a maximal independent set (MIS). Chung et al. (2014)\ndeveloped faster local and parallel algorithms, potentially running in time\n$O(\\log^2 n)$, but these algorithms require more stringent conditions than the\nLLL.\n  We give a new parallel algorithm that works under essentially the same\nconditions as the original algorithm of Moser & Tardos but uses only a single\nMIS computation, thus running in $O(\\log^2 n)$ time on an EREW PRAM. This can\nbe derandomized to give an NC algorithm running in time $O(\\log^2 n)$ as well,\nspeeding up a previous NC LLL algorithm of Chandrasekaran et al. (2013).\n  We also provide improved and tighter bounds on the run-times of the\nsequential and parallel resampling-based algorithms originally developed by\nMoser & Tardos. These apply to any problem instance in which the tighter\nShearer LLL criterion is satisfied.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2015 23:49:56 GMT"}, {"version": "v2", "created": "Wed, 23 Sep 2015 02:56:28 GMT"}, {"version": "v3", "created": "Thu, 24 Sep 2015 13:14:55 GMT"}, {"version": "v4", "created": "Thu, 20 Oct 2016 15:53:58 GMT"}, {"version": "v5", "created": "Wed, 5 Jul 2017 13:19:14 GMT"}, {"version": "v6", "created": "Fri, 8 Sep 2017 23:16:50 GMT"}, {"version": "v7", "created": "Thu, 28 Sep 2017 18:13:50 GMT"}], "update_date": "2017-10-02", "authors_parsed": [["Haeupler", "Bernhard", ""], ["Harris", "David G.", ""]]}, {"id": "1509.06434", "submitter": "Saber Mirzaei", "authors": "Assaf Kfoury, Saber Mirzaei", "title": "Efficient Reassembling of Graphs, Part 1: The Linear Case", "comments": null, "journal-ref": null, "doi": "10.1007/s10878-016-0024-x", "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The reassembling of a simple connected graph G = (V,E) is an abstraction of a\nproblem arising in earlier studies of network analysis. Its simplest\nformulation is in two steps: (1) We cut every edge of G into two halves, thus\nobtaining a collection of n=|V| one-vertex components. (2) We splice the two\nhalves of every edge together, not of all the edges at once, but in some\nordering \\Theta of the edges that minimizes two measures that depend on the\nedge-boundary degrees of assembled components.\n  The edge-boundary degree of a component A (subset of V) is the number of\nedges in G with one endpoint in A and one endpoint in V-A. We call the maximum\nedge-boundary degree encountered during the reassembling process the\nalpha-measure of the reassembling, and the sum of all edge-boundary degrees is\nits beta-measure. The alpha-optimization (resp. beta-optimization) of the\nreassembling of G is to determine an order \\Theta for splicing the edges that\nminimizes its alpha-measure (resp. beta-measure).\n  There are different forms of reassembling. We consider only cases satisfying\nthe condition that if the an edge between disjoint components A and B is\nspliced, then all the edges between A and B are spliced at the same time. In\nthis report, we examine the particular case of linear reassembling, which\nrequires that the next edge to be spliced must be adjacent to an already\nspliced edge. We delay other forms of reassembling to follow-up reports.\n  We prove that alpha-optimization of linear reassembling and minimum-cutwidth\nlinear arrangment (CutWidth) are polynomially reducible to each other, and that\nbeta-optimization of linear reassembling and minimum-cost linear arrangement\n(MinArr) are polynomially reducible to each other.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2015 00:30:01 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Kfoury", "Assaf", ""], ["Mirzaei", "Saber", ""]]}, {"id": "1509.06562", "submitter": "Phillippe Samer", "authors": "Rafael A. Melo, Phillippe Samer, Sebasti\\'an Urrutia", "title": "An effective decomposition approach and heuristics to generate spanning\n  trees with a small number of branch vertices", "comments": "18 pages; 5 figures; accepted for publication in Computational\n  Optimization and Applications", "journal-ref": null, "doi": "10.1007/s10589-016-9850-0", "report-no": null, "categories": "cs.DM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a graph $G=(V,E)$, the minimum branch vertices problem consists in\nfinding a spanning tree $T=(V,E')$ of $G$ minimizing the number of vertices\nwith degree greater than two. We consider a simple combinatorial lower bound\nfor the problem, from which we propose a decomposition approach. The motivation\nis to break down the problem into several smaller subproblems which are more\ntractable computationally, and then recombine the obtained solutions to\ngenerate a solution to the original problem. We also propose effective\nconstructive heuristics to the problem which take into consideration the\nproblem's structure in order to obtain good feasible solutions. Computational\nresults show that our decomposition approach is very fast and can drastically\nreduce the size of the subproblems to be solved. This allows a branch and cut\nalgorithm to perform much better than when used over the full original problem.\nThe results also show that the proposed constructive heuristics are highly\nefficient and generate very good quality solutions, outperforming other\nheuristics available in the literature in several situations.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2015 12:09:59 GMT"}, {"version": "v2", "created": "Thu, 30 Jun 2016 22:46:15 GMT"}], "update_date": "2016-07-04", "authors_parsed": [["Melo", "Rafael A.", ""], ["Samer", "Phillippe", ""], ["Urrutia", "Sebastián", ""]]}, {"id": "1509.06983", "submitter": "Marc Hellmuth", "authors": "Marc Hellmuth, Adrian Fritz, Nicolas Wieseke and Peter F. Stadler", "title": "Techniques for the Cograph Editing Problem: Module Merge is equivalent\n  to Editing P4s", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cographs are graphs in which no four vertices induce a simple connected path\n$P_4$. Cograph editing is to find for a given graph $G = (V,E)$ a set of at\nmost $k$ edge additions and deletions that transform $G$ into a cograph. This\ncombinatorial optimization problem is NP-hard. It has, recently found\napplications in the context of phylogenetics, hence good heuristics are of\npractical importance.\n  It is well-known that the cograph editing problem can be solved independently\non the so-called strong prime modules of the modular decomposition of $G$. We\nshow here that editing the induced $P_4$'s of a given graph is equivalent to\nresolving strong prime modules by means of a newly defined merge operation on\nthe submodules. This observation leads to a new exact algorithm for the cograph\nediting problem that can be used as a starting point for the construction of\nnovel heuristics.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2015 13:54:15 GMT"}, {"version": "v2", "created": "Thu, 24 Sep 2015 09:34:29 GMT"}], "update_date": "2015-09-25", "authors_parsed": [["Hellmuth", "Marc", ""], ["Fritz", "Adrian", ""], ["Wieseke", "Nicolas", ""], ["Stadler", "Peter F.", ""]]}, {"id": "1509.07007", "submitter": "Chidambaram Annamalai", "authors": "Chidambaram Annamalai", "title": "Finding Perfect Matchings in Bipartite Hypergraphs", "comments": "added a figure; some clarifications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Haxell's condition is a natural hypergraph analog of Hall's condition, which\nis a well-known necessary and sufficient condition for a bipartite graph to\nadmit a perfect matching. That is, when Haxell's condition holds it forces the\nexistence of a perfect matching in the bipartite hypergraph. Unlike in graphs,\nhowever, there is no known polynomial time algorithm to find the hypergraph\nperfect matching that is guaranteed to exist when Haxell's condition is\nsatisfied.\n  We prove the existence of an efficient algorithm to find perfect matchings in\nbipartite hypergraphs whenever a stronger version of Haxell's condition holds.\nOur algorithm can be seen as a generalization of the classical Hungarian\nalgorithm for finding perfect matchings in bipartite graphs. The techniques we\nuse to achieve this result could be of use more generally in other\ncombinatorial problems on hypergraphs where disjointness structure is crucial,\ne.g. Set Packing.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2015 14:30:18 GMT"}, {"version": "v2", "created": "Mon, 5 Dec 2016 19:22:34 GMT"}], "update_date": "2016-12-06", "authors_parsed": [["Annamalai", "Chidambaram", ""]]}, {"id": "1509.07029", "submitter": "Yuan-Hsun Lo", "authors": "Yuan-Hsun Lo, Yijin Zhang, Wing Shing Wong and Hung-Lin Fu", "title": "The Global Packing Number for an Optical Network", "comments": "23 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The global packing number problem arises from the investigation of optimal\nwavelength allocation in an optical network that employs Wavelength Division\nMultiplexing (WDM). Consider an optical network that is represented by a\nconnected, simple graph $G$. We assume all communication channels are\nbidirectional, so that all links and paths are undirected. It follows that\nthere are ${|G|\\choose 2}$ distinct node pairs associated with $G$, where $|G|$\nis the number of nodes in $G$. A path system $\\mathcal{P}$ of $G$ consists of\n${|G|\\choose 2}$ paths, one path to connect each of the node pairs. The global\npacking number of a path system $\\mathcal{P}$, denoted by\n$\\Phi(G,\\mathcal{P})$, is the minimum integer $k$ to guarantee the existence of\na mapping $\\omega:\\mathcal{P}\\to\\{1,2,\\ldots,k\\}$, such that\n$\\omega(P)\\neq\\omega(P')$ if $P$ and $P'$ have common edge(s). The global\npacking number of $G$, denoted by $\\Phi(G)$, is defined to be the minimum\n$\\Phi(G,\\mathcal{P})$ among all possible path systems $\\mathcal{P}$. If there\nis no wavelength conversion along any optical transmission path for any node\npair in the network, the global packing number signifies the minimum number of\nwavelengths required to support simultaneous communication for all pairs in the\nnetwork.\n  In this paper, the focus is on ring networks, so that $G$ is a cycle.\nExplicit formulas for the global packing number of a cycle is derived. The\ninvestigation is further extended to chain networks. A path system,\n$\\mathcal{P}$, that enjoys $\\Phi(G,\\mathcal{P})=\\Phi(G)$ is called ideal. A\ncharacterization of ideal path systems is also presented. We also describe an\nefficient heuristic algorithm to assign wavelengths that can be applied to a\ngeneral network with more complicated traffic load.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2015 15:24:57 GMT"}], "update_date": "2015-09-24", "authors_parsed": [["Lo", "Yuan-Hsun", ""], ["Zhang", "Yijin", ""], ["Wong", "Wing Shing", ""], ["Fu", "Hung-Lin", ""]]}, {"id": "1509.07076", "submitter": "Georgios Amanatidis", "authors": "Georgios Amanatidis, Bradley Green and Milena Mihail", "title": "Graphic Realizations of Joint-Degree Matrices", "comments": "Unpublished manuscript of 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce extensions and modifications of the classical\ndegree sequence graphic realization problem studied by Erd\\H{o}s-Gallai and\nHavel-Hakimi, as well as of the corresponding connected graphic realization\nversion. We define the joint-degree matrix graphic (resp. connected graphic)\nrealization problem, where in addition to the degree sequence, the exact number\nof desired edges between vertices of different degree classes is also\nspecified. We give necessary and sufficient conditions, and polynomial time\ndecision and construction algorithms for the graphic and connected graphic\nrealization problems. These problems arise naturally in the current topic of\ngraph modeling for complex networks. From the technical point of view, the\njoint-degree matrix realization algorithm is straightforward. However, the\nconnected joint-degree matrix realization algorithm involves a novel recursive\nsearch of suitable local graph modifications. Also, we outline directions for\nfurther work of both theoretical and practical interest. In particular, we give\na Markov chain which converges to the uniform distribution over all\nrealizations. We show that the underline state space is connected, and we leave\nthe question of the mixing rate open.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2015 17:55:28 GMT"}], "update_date": "2015-09-24", "authors_parsed": [["Amanatidis", "Georgios", ""], ["Green", "Bradley", ""], ["Mihail", "Milena", ""]]}, {"id": "1509.07680", "submitter": "Zhentao Li", "authors": "Ken-ichi Kawarabayashi, Zhentao Li, Bruce Reed", "title": "Connectivity Preserving Iterative Compaction and Finding 2 Disjoint\n  Rooted Paths in Linear Time", "comments": "83 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show how to combine two algorithmic techniques to obtain\nlinear time algorithms for various optimization problems on graphs, and present\na subroutine which will be useful in doing so.\n  The first technique is iterative shrinking. In the first phase of an\niterative shrinking algorithm, we construct a sequence of graphs of decreasing\nsize $G_1,\\ldots,G_\\ell$ where $G_1$ is the initial input, $G_\\ell$ is a graph\non which the problem is easy, and $G_i$ is obtained from $G_{i+1}$ via some\nshrinking algorithm. In the second phase we work through the sequence in\nreverse, repeatedly constructing a solution for a graph from the solution for\nits successor. In an iterative compaction algorithm, we insist that the graphs\ndecrease by a constant fraction of the entire graph.\n  Another approach to solving optimization problems is to exploit the\nstructural properties implied by the connectivity of the input graph. This\napproach can be used on graphs which are not highly connected by decomposing an\ninput graph into its highly connected pieces, solving subproblems on these\nspecially structured pieces and then combining their solutions.\n  We combine these two techniques by developing compaction algorithms which\nwhen applied to the highly connected pieces preserve their connectivity\nproperties. The structural properties this connectivity implies can be helpful\nboth in finding further compactions in later iterations and when we are\nmanipulating solutions in the second phase of an iterative compaction\nalgorithm.\n  To illustrate how this compaction algorithm can be used as a subroutine, we\npresent a linear time algorithm that given four vertices $\\{s_1,s_2,t_1,t_2\\}$\nof a graph $G$, either finds a pair of disjoint paths $P_1$ and $P_2$ of $G$\nsuch that $P_i$ has endpoints $s_i$ and $t_i$, or returns a planar embedding of\nan auxiliary graph which shows that no such pair exists.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2015 11:13:38 GMT"}], "update_date": "2015-09-28", "authors_parsed": [["Kawarabayashi", "Ken-ichi", ""], ["Li", "Zhentao", ""], ["Reed", "Bruce", ""]]}, {"id": "1509.07687", "submitter": "Chiel Ten Brinke", "authors": "Chiel B. Ten Brinke, Frank J. P. van Houten, and Hans L. Bodlaender", "title": "Practical Algorithms for Linear Boolean-width", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we give a number of new exact algorithms and heuristics to\ncompute linear boolean decompositions, and experimentally evaluate these\nalgorithms. The experimental evaluation shows that significant improvements can\nbe made with respect to running time without increasing the width of the\ngenerated decompositions. We also evaluated dynamic programming algorithms on\nlinear boolean decompositions for several vertex subset problems. This\nevaluation shows that such algorithms are often much faster (up to several\norders of magnitude) compared to theoretical worst case bounds.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2015 11:42:03 GMT"}], "update_date": "2015-09-28", "authors_parsed": [["Brinke", "Chiel B. Ten", ""], ["van Houten", "Frank J. P.", ""], ["Bodlaender", "Hans L.", ""]]}, {"id": "1509.07702", "submitter": "Adrien Richard", "authors": "Adrien Richard", "title": "Fixed points and connections between positive and negative cycles in\n  Boolean networks", "comments": "15 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are interested in the relationships between the number fixed points in a\nBoolean network $f:\\{0,1\\}^n\\to\\{0,1\\}^n$ and its interaction graph, which is\nthe arc-signed digraph $G$ on $\\{1,\\dots,n\\}$ that describes the positive and\nnegative influences between the components of the network. A fundamental\ntheorem of Aracena says that if $G$ has no positive (resp. negative) cycle,\nthen $f$ has at most (resp. at least) one fixed point; the sign of a cycle\nbeing the product of the signs of its arcs. In this note, we generalize this\nresult by taking into account the influence of connections between positive and\nnegative cycles. In particular, we prove that if every positive (resp.\nnegative) cycle of $G$ has an arc $a$ such that $G\\setminus a$ has a\nnon-trivial initial strongly connected component containing the terminal vertex\nof $a$ and only negative (resp. positive) cycles, then $f$ has at most (resp.\nat least) one fixed point. This is, up to our knowledge, the first\ngeneralization of Aracena's theorem where the conditions are expressed with $G$\nonly.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2015 13:00:57 GMT"}, {"version": "v2", "created": "Mon, 5 Oct 2015 14:04:38 GMT"}, {"version": "v3", "created": "Mon, 28 Nov 2016 15:25:06 GMT"}, {"version": "v4", "created": "Thu, 16 Nov 2017 09:52:29 GMT"}], "update_date": "2017-11-17", "authors_parsed": [["Richard", "Adrien", ""]]}, {"id": "1509.07808", "submitter": "Thomas Rothvoss", "authors": "Elaine Levey and Thomas Rothvoss", "title": "A (1+epsilon)-Approximation for Makespan Scheduling with Precedence\n  Constraints using LP Hierarchies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a classical problem in scheduling, one has $n$ unit size jobs with a\nprecedence order and the goal is to find a schedule of those jobs on $m$\nidentical machines as to minimize the makespan. It is one of the remaining four\nopen problems from the book of Garey & Johnson whether or not this problem is\n$\\mathbf{NP}$-hard for $m=3$.\n  We prove that for any fixed $\\varepsilon$ and $m$, an LP-hierarchy lift of\nthe time-indexed LP with a slightly super poly-logarithmic number of $r =\n(\\log(n))^{\\Theta(\\log \\log n)}$ rounds provides a $(1 +\n\\varepsilon)$-approximation. For example Sherali-Adams suffices as hierarchy.\nThis implies an algorithm that yields a $(1+\\varepsilon)$-approximation in time\n$n^{O(r)}$. The previously best approximation algorithms guarantee a $2 -\n\\frac{7}{3m+1}$-approximation in polynomial time for $m \\geq 4$ and\n$\\frac{4}{3}$ for $m=3$. Our algorithm is based on a recursive scheduling\napproach where in each step we reduce the correlation in form of long chains.\nOur method adds to the rather short list of examples where hierarchies are\nactually useful to obtain better approximation algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2015 17:43:05 GMT"}, {"version": "v2", "created": "Fri, 16 Feb 2018 01:15:58 GMT"}], "update_date": "2018-02-19", "authors_parsed": [["Levey", "Elaine", ""], ["Rothvoss", "Thomas", ""]]}, {"id": "1509.07986", "submitter": "Giovanni Rossi Mr", "authors": "Giovanni Rossi", "title": "Continuous set packing and near-Boolean functions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a family of feasible subsets of a ground set, the packing problem is to\nfind a largest subfamily of pairwise disjoint family members.\nNon-approximability renders heuristics attractive viable options, while\nefficient methods with worst-case guarantee are a key concern in computational\ncomplexity. This work proposes a novel near-Boolean optimization method relying\non a polynomial multilinear form with variables ranging each in a\nhigh-dimensional unit simplex, rather than in the unit interval as usual. The\nvariables are the elements of the ground set, and distribute each a unit\nmembership over those feasible subsets where they are included. The given\nproblem is thus translated into a continuous version where the objective is to\nmaximize a function taking values on collections of points in a unit hypercube.\nMaximizers are shown to always include collections of hypercube disjoint\nvertices, i.e. partitions of the ground set, which constitute feasible\nsolutions for the original discrete version of the problem. A gradient-based\nlocal search in the expanded continuous domain is designed. Approximations with\npolynomial multilinear form of bounded degree and near-Boolean games are also\nfinally discussed.\n", "versions": [{"version": "v1", "created": "Sat, 26 Sep 2015 14:23:41 GMT"}], "update_date": "2015-09-29", "authors_parsed": [["Rossi", "Giovanni", ""]]}, {"id": "1509.08145", "submitter": "Saber Mirzaei", "authors": "Saber Mirzaei, Assaf Kfoury", "title": "Linear Arrangement of Halin Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the Optimal Linear Arrangement (OLA) problem of Halin graphs, one of\nthe simplest classes of non-outerplanar graphs. We present several properties\nof OLA of general Halin graphs. We prove a lower bound on the cost of OLA of\nany Halin graph, and define classes of Halin graphs for which the cost of OLA\nmatches this lower bound. We show for these classes of Halin graphs, OLA can be\ncomputed in O(n log n), where n is the number of vertices.\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2015 21:20:27 GMT"}], "update_date": "2015-09-29", "authors_parsed": [["Mirzaei", "Saber", ""], ["Kfoury", "Assaf", ""]]}, {"id": "1509.08216", "submitter": "William Kuszmaul", "authors": "William Kuszmaul", "title": "Fast Algorithms for Finding Pattern Avoiders and Counting Pattern\n  Occurrences in Permutations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set $\\Pi$ of permutation patterns of length at most $k$, we present\nan algorithm for building $S_{\\le n}(\\Pi)$, the set of permutations of length\nat most $n$ avoiding the patterns in $\\Pi$, in time $O(|S_{\\le n - 1}(\\Pi)|\n\\cdot k + |S_{n}(\\Pi)|)$. Additionally, we present an $O(n!k)$-time algorithm\nfor counting the number of copies of patterns from $\\Pi$ in each permutation in\n$S_n$. Surprisingly, when $|\\Pi| = 1$, this runtime can be improved to $O(n!)$,\nspending only constant time per permutation. Whereas the previous best\nalgorithms, based on generate-and-check, take exponential time per permutation\nanalyzed, all of our algorithms take time at most polynomial per outputted\npermutation.\n  If we want to solve only the enumerative variant of each problem, computing\n$|S_{\\le n}(\\Pi)|$ or tallying permutations according to $\\Pi$-patterns, rather\nthan to store information about every permutation, then all of our algorithms\ncan be implemented in $O(n^{k+1}k)$ space.\n  Using our algorithms, we generated $|S_5(\\Pi)|, \\ldots, |S_{16}(\\Pi)|$ for\neach $\\Pi \\subseteq S_4$ with $|\\Pi| > 4$, and analyzed OEIS matches. We\nobtained a number of potentially novel pattern-avoidance conjectures.\n  Our algorithms extend to considering permutations in any set closed under\nstandardization of subsequences. Our algorithms also partially adapt to\nconsidering vincular patterns.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2015 07:08:27 GMT"}, {"version": "v2", "created": "Thu, 31 Dec 2015 17:18:05 GMT"}, {"version": "v3", "created": "Sun, 30 Oct 2016 04:11:26 GMT"}, {"version": "v4", "created": "Fri, 17 Mar 2017 02:21:24 GMT"}], "update_date": "2017-03-20", "authors_parsed": [["Kuszmaul", "William", ""]]}, {"id": "1509.08456", "submitter": "Giovanni Rossi Mr", "authors": "Giovanni Rossi", "title": "Multilinear objective function-based clustering", "comments": "arXiv admin note: text overlap with arXiv:1509.07986", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The input of most clustering algorithms is a symmetric matrix quantifying\nsimilarity within data pairs. Such a matrix is here turned into a quadratic set\nfunction measuring cluster score or similarity within data subsets larger than\npairs. In general, any set function reasonably assigning a cluster score to\ndata subsets gives rise to an objective function-based clustering problem. When\nconsidered in pseudo-Boolean form, cluster score enables to evaluate fuzzy\nclusters through multilinear extension MLE, while the global score of fuzzy\nclusterings simply is the sum over constituents fuzzy clusters of their MLE\nscore. This is shown to be no greater than the global score of hard clusterings\nor partitions of the data set, thereby expanding a known result on extremizers\nof pseudo-Boolean functions. Yet, a multilinear objective function allows to\nsearch for optimality in the interior of the hypercube. The proposed method\nonly requires a fuzzy clustering as initial candidate solution, for the\nappropriate number of clusters is implicitly extracted from the given data set.\n", "versions": [{"version": "v1", "created": "Sat, 26 Sep 2015 13:45:08 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Rossi", "Giovanni", ""]]}, {"id": "1509.08535", "submitter": "Siamak Ravanbakhsh", "authors": "Siamak Ravanbakhsh, Barnabas Poczos, Russell Greiner", "title": "Boolean Matrix Factorization and Noisy Completion via Message Passing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.AI cs.DM stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Boolean matrix factorization and Boolean matrix completion from noisy\nobservations are desirable unsupervised data-analysis methods due to their\ninterpretability, but hard to perform due to their NP-hardness. We treat these\nproblems as maximum a posteriori inference problems in a graphical model and\npresent a message passing approach that scales linearly with the number of\nobservations and factors. Our empirical study demonstrates that message passing\nis able to recover low-rank Boolean matrices, in the boundaries of\ntheoretically possible recovery and compares favorably with state-of-the-art in\nreal-world applications, such collaborative filtering with large-scale Boolean\ndata.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2015 23:11:16 GMT"}, {"version": "v2", "created": "Fri, 9 Oct 2015 19:27:13 GMT"}, {"version": "v3", "created": "Thu, 4 Feb 2016 21:05:32 GMT"}], "update_date": "2016-02-08", "authors_parsed": [["Ravanbakhsh", "Siamak", ""], ["Poczos", "Barnabas", ""], ["Greiner", "Russell", ""]]}, {"id": "1509.08709", "submitter": "Ekkehard K\\\"ohler", "authors": "Ekkehard K\\\"ohler and Martin Strehler", "title": "Traffic signal optimization: combining static and dynamic models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In this paper, we present a cyclically time-expanded network model for\nsimultaneous optimization of traffic assignment and traffic signal parameters,\nin particular offsets, split times, and phase orders. Since travel times are of\ngreat importance for developing realistic solutions for traffic assignment and\ntraffic signal coordination in urban road networks, we perform an extensive\nanalysis of the model. We show that a linear time-expanded model can reproduce\nrealistic travel times especially for use with traffic signals and we verify\nthis by simulation. Furthermore, we show how exact mathematical programming\ntechniques can be used for optimizing the control of traffic signals. We\nprovide computational results for real world instances and demonstrate the\ncapabilities of the cyclically time-expanded by simulation results obtained\nwith state-of-the-art traffic simulation tools.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2015 12:12:24 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Köhler", "Ekkehard", ""], ["Strehler", "Martin", ""]]}, {"id": "1509.08773", "submitter": "Rohan Sharma", "authors": "Rohan Sharma and Bibhas Adhikari", "title": "Self-Coordinated Corona Graphs: a model for complex networks", "comments": "21 pages, 31 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.SI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, real world networks having constant/shrinking diameter along with\npower-law degree distribution are observed and investigated in literature.\nTaking an inspiration from these findings, we propose a deterministic complex\nnetwork model, which we call Self-Coordinated Corona Graphs (SCCG), based on\nthe corona product of graphs. As it has also been established that self\ncoordination/organization of nodes gives rise to emergence of power law in\ndegree distributions of several real networks, the networks in the proposed\nmodel are generated by the virtue of self coordination of nodes in corona\ngraphs. Alike real networks, the SCCG inherit motifs which act as the seed\ngraphs for the generation of SCCG. We also analytically prove that the power\nlaw exponent of SCCG is approximately $2$ and the diameter of SCCG produced by\na class of motifs is constant. Finally, we compare different properties of the\nproposed model with that of the BA and Pseudofractal scale-free models for\ncomplex networks.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2015 10:02:00 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Sharma", "Rohan", ""], ["Adhikari", "Bibhas", ""]]}, {"id": "1509.09188", "submitter": "Pavel Kolev", "authors": "Pavel Kolev and Kurt Mehlhorn", "title": "Approximate Spectral Clustering: Efficiency and Guarantees", "comments": "A preliminary version of this paper was presented at the 24th Annual\n  European Symposium on Algorithms (ESA 2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Approximate Spectral Clustering (ASC) is a popular and successful heuristic\nfor partitioning the nodes of a graph $G$ into clusters for which the ratio of\noutside connections compared to the volume (sum of degrees) is small. ASC\nconsists of the following two subroutines: i) compute an approximate Spectral\nEmbedding via the Power method; and ii) partition the resulting vector set with\nan approximate $k$-means clustering algorithm. The resulting $k$-means\npartition naturally induces a $k$-way node partition of $G$.\n  We give a comprehensive analysis of ASC building on the work of Peng et\nal.~(SICOMP'17), Boutsidis et al.~(ICML'15) and Ostrovsky et al.~(JACM'13). We\nshow that ASC i) runs efficiently, and ii) yields a good approximation of an\noptimal $k$-way node partition of $G$. Moreover, we strengthen the quality\nguarantees of a structural result of Peng et al. by a factor of $k$, and\nsimultaneously weaken the eigenvalue gap assumption. Further, we show that ASC\nfinds a $k$-way node partition of $G$ with the strengthened quality guarantees.\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2015 14:20:44 GMT"}, {"version": "v2", "created": "Fri, 8 Jan 2016 00:09:11 GMT"}, {"version": "v3", "created": "Wed, 17 Feb 2016 14:12:31 GMT"}, {"version": "v4", "created": "Thu, 21 Apr 2016 10:17:59 GMT"}, {"version": "v5", "created": "Sun, 29 Jul 2018 16:58:47 GMT"}], "update_date": "2018-07-31", "authors_parsed": [["Kolev", "Pavel", ""], ["Mehlhorn", "Kurt", ""]]}]