[{"id": "2001.00635", "submitter": "Yoshiro Suzuki", "authors": "Yusuke Takahashi, Yoshiro Suzuki, Akira Todoroki", "title": "Convolutional Neural Network-based Topology Optimization (CNN-TO) By\n  Estimating Sensitivity of Compliance from Material Distribution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new topology optimization method that applies a\nconvolutional neural network (CNN), which is one deep learning technique for\ntopology optimization problems. Using this method, we acquire a structure with\na little higher performance that could not be obtained by the previous topology\noptimization method. In particular, in this paper, we solve a topology\noptimization problem aimed at maximizing stiffness with a mass constraint,\nwhich is a common type of topology optimization. In this paper, we first\nformulate the conventional topology optimization by the solid isotropic\nmaterial with penalization method. Next, we formulate the topology optimization\nusing CNN. Finally, we show the effectiveness of the proposed topology\noptimization method by solving a verification example, namely a topology\noptimization problem aimed at maximizing stiffness. In this research, as a\nresult of solving the verification example for a small design area of 16x32\nelement, we obtain the solution different from the previous topology\noptimization method. This result suggests that stiffness information of\nstructure can be extracted and analyzed for structural design by analyzing the\ndensity distribution using CNN like an image. This suggests that CNN technology\ncan be utilized in the structural design and topology optimization.\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2019 07:17:23 GMT"}], "update_date": "2020-01-06", "authors_parsed": [["Takahashi", "Yusuke", ""], ["Suzuki", "Yoshiro", ""], ["Todoroki", "Akira", ""]]}, {"id": "2001.00647", "submitter": "Karol Lewandowski", "authors": "Karol Lewandowski, {\\L}ukasz Kaczmarczyk, Ignatios Athanasiadis, John\n  F. Marshall, Chris J. Pearce", "title": "Numerical investigation into fracture resistance of bone following\n  adaptation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bone adapts in response to its mechanical environment. This evolution of bone\ndensity is one of the most important mechanisms for developing fracture\nresistance. A finite element framework for simulating bone adaptation, commonly\ncalled bone remodelling, is presented. This is followed by a novel method to\nboth quantify fracture resistance and to simulate fracture propagation. The\nauthors' previous work on the application of configurational mechanics for\nmodelling fracture is extended to include the influence of heterogeneous bone\ndensity distribution. The main advantage of this approach is that\nconfigurational forces, and fracture energy release rate, are expressed\nexclusively in terms of nodal quantities. This approach avoids the need for\npost-processing and enables a fully implicit formulation for modelling the\nevolving crack front. In this paper density fields are generated from both (a)\nbone adaptation analysis and (b) subject-specific geometry and material\nproperties obtained from CT scans. It is shown that, in order to correctly\nevaluate the configurational forces at the crack front, it is necessary to have\na spatially smooth density field with higher regularity than if the field is\ndirectly approximated on the finite element mesh. Therefore, discrete density\ndata is approximated as a smooth density field using a Moving Weighted Least\nSquares method. Performance of the framework is demonstrated using numerical\nsimulations for bone adaptation and subsequent crack propagation, including\nconsideration of an equine 3rd metacarpal bone. The degree of bone adaption is\nshown to influence both fracture resistance and the resulting crack path.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2020 22:09:35 GMT"}], "update_date": "2020-01-06", "authors_parsed": [["Lewandowski", "Karol", ""], ["Kaczmarczyk", "Łukasz", ""], ["Athanasiadis", "Ignatios", ""], ["Marshall", "John F.", ""], ["Pearce", "Chris J.", ""]]}, {"id": "2001.01022", "submitter": "Hyoung Suk Suh", "authors": "Hyoung Suk Suh, WaiChing Sun, Devin O'Connor", "title": "A phase field model for cohesive fracture in micropolar continua", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2020.113181", "report-no": null, "categories": "cs.CE", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  While crack nucleation and propagation in the brittle or quasi-brittle regime\ncan be predicted via variational or material-force-based phase field fracture\nmodels, these models often assume that the underlying elastic response of the\nmaterial is non-polar and yet a length scale parameter must be introduced to\nenable the sharp cracks represented by a regularized implicit function.\nHowever, many materials with internal microstructures that contain surface\ntension, micro-cracks, micro-fracture, inclusion, cavity or those of\nparticulate nature often exhibit size-dependent behaviors in both the\npath-independent and path-dependent regimes. This paper is intended to\nintroduce a unified treatment that captures the size effect of the materials in\nboth elastic and damaged states. By introducing a cohesive micropolar phase\nfield fracture theory, along with the computational model and validation\nexercises, we explore the interacting size-dependent elastic deformation and\nfracture mechanisms exhibits in materials of complex microstructures. To\nachieve this goal, we introduce the distinctive degradation functions of the\nforce-stress-strain and couple-stress-micro-rotation energy-conjugated pairs\nfor a given regularization profile such that the macroscopic size-dependent\nresponses of the micropolar continua is insensitive to the length scale\nparameter of the regularized interface. Then, we apply the variational\nprinciple to derive governing equations from the micropolar stored energy and\ndissipative functionals. Numerical examples are introduced to demonstrate the\nproper way to identify material parameters and the capacity of the new\nformulation to simulate complex crack patterns in the quasi-static regime.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jan 2020 02:17:44 GMT"}, {"version": "v2", "created": "Tue, 11 Aug 2020 22:06:29 GMT"}], "update_date": "2020-08-13", "authors_parsed": [["Suh", "Hyoung Suk", ""], ["Sun", "WaiChing", ""], ["O'Connor", "Devin", ""]]}, {"id": "2001.01027", "submitter": "Konstantinos A. Mountris", "authors": "Konstantinos A. Mountris and Esther Pueyo", "title": "The Radial Point Interpolation Mixed Collocation (RPIMC) Method for the\n  Solution of Transient Diffusion Problems", "comments": "Accepted version for publication in Engineering Analysis with\n  Boundary Elements", "journal-ref": null, "doi": "10.1016/j.enganabound.2020.10.005", "report-no": null, "categories": "cs.CE cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Radial Point Interpolation Mixed Collocation (RPIMC) method is proposed\nin this paper for transient analysis of diffusion problems. RPIMC is an\nefficient purely meshless method where the solution of the field variable is\nobtained through collocation. The field function and its gradient are both\ninterpolated (mixed collocation approach) leading to reduced $C$-continuity\nrequirement compared to strong-form collocation schemes. The method's accuracy\nis evaluated in heat conduction benchmark problems. The RPIMC convergence is\ncompared against the Meshless Local Petrov-Galerkin Mixed Collocation (MLPG-MC)\nmethod and the Finite Element Method (FEM). Due to the delta Kronecker property\nof RPIMC, improved accuracy can be achieved as compared to MLPG-MC. RPIMC is\nproven to be a promising meshless alternative to FEM for transient diffusion\nproblems.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jan 2020 03:30:37 GMT"}, {"version": "v2", "created": "Wed, 7 Oct 2020 13:23:27 GMT"}], "update_date": "2020-10-13", "authors_parsed": [["Mountris", "Konstantinos A.", ""], ["Pueyo", "Esther", ""]]}, {"id": "2001.01575", "submitter": "Xiaoxuan Zhang", "authors": "Xiaoxuan Zhang, Krishna Garikipati", "title": "Machine learning materials physics: Multi-resolution neural networks\n  learn the free energy and nonlinear elastic response of evolving\n  microstructures", "comments": "24 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many important multi-component crystalline solids undergo mechanochemical\nspinodal decomposition: a phase transformation in which the compositional\nredistribution is coupled with structural changes of the crystal, resulting in\ndynamically evolving microstructures. The ability to rapidly compute the\nmacroscopic behavior based on these detailed microstructures is of paramount\nimportance for accelerating material discovery and design. Here, our focus is\non the macroscopic, nonlinear elastic response of materials harboring\nmicrostructure. Because of the diversity of microstructural patterns that can\nform, there is interest in taking a purely computational approach to predicting\ntheir macroscopic response. However, the evaluation of macroscopic, nonlinear\nelastic properties purely based on direct numerical simulations (DNS) is\ncomputationally very expensive, and hence impractical for material design when\na large number of microstructures need to be tested. A further complexity of a\nhierarchical nature arises if the elastic free energy and its variation with\nstrain is a small-scale fluctuation on the dominant trajectory of the total\nfree energy driven by microstructural dynamics. To address these challenges, we\npresent a data-driven approach, which combines advanced neural network (NN)\nmodels with DNS to predict the homogenized, macroscopic, mechanical free energy\nand stress fields arising in a family of multi-component crystalline solids\nthat develop microstructure. The hierarchical structure of the free energy's\nevolution induces a multi-resolution character to the machine learning\nparadigm: We construct knowledge-based neural networks (KBNNs) with either\npre-trained fully connected deep neural networks (DNNs), or pre-trained\nconvolutional neural networks (CNNs) that describe the dominant characteristic\nof the data to fully represent the hierarchically evolving free energy.\n", "versions": [{"version": "v1", "created": "Tue, 31 Dec 2019 19:40:57 GMT"}, {"version": "v2", "created": "Tue, 16 Jun 2020 15:10:15 GMT"}], "update_date": "2020-06-17", "authors_parsed": [["Zhang", "Xiaoxuan", ""], ["Garikipati", "Krishna", ""]]}, {"id": "2001.01597", "submitter": "Pankaj Mishra", "authors": "Jure Mo\\v{c}nik - Berljavac, Pankaj K Mishra, Jure Slak, and Gregor\n  Kosec", "title": "RBF-FD analysis of 2D time-domain acoustic wave propagation in\n  heterogeneous media", "comments": "To reproduce the numerical tests in this paper, please see the\n  project repository\n  \\url{https://gitlab.com/e62Lab/2019_p_wavepropagation_code}", "journal-ref": "Computers & Geosciences 153 (2021)", "doi": "10.1016/j.cageo.2021.104796", "report-no": null, "categories": "cs.CE cs.NA math.NA physics.geo-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Radial Basis Function-generated Finite Differences (RBF-FD) is a popular\nvariant of local strong-form meshless methods that do not require a predefined\nconnection between the nodes, making it easier to adapt node-distribution to\nthe problem under consideration. This paper investigates an RBF-FD solution of\ntime-domain acoustic wave propagation in the context of seismic modeling in the\nEarth's subsurface. Through a number of numerical tests, ranging from\nhomogeneous to highly-heterogeneous velocity models including non-smooth\nirregular topography, we demonstrate that the present approach can be further\ngeneralized to solve large-scale seismic modeling and full waveform inversion\nproblems in arbitrarily complex models enabling more robust interpretations of\ngeophysical observations\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2020 18:11:38 GMT"}, {"version": "v2", "created": "Mon, 10 May 2021 16:05:52 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Berljavac", "Jure Močnik -", ""], ["Mishra", "Pankaj K", ""], ["Slak", "Jure", ""], ["Kosec", "Gregor", ""]]}, {"id": "2001.01699", "submitter": "Pavel Bochev B", "authors": "K. Aadithya, P. Kuberry, B. Paskaleva, P. Bochev, K. Leeson, A. Mar,\n  T. Mei, E. Keiter", "title": "Development, Demonstration, and Validation of Data-driven Compact Diode\n  Models for Circuit Simulation and Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": "SAND2019-15303 R", "categories": "cs.LG cs.CE stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compact semiconductor device models are essential for efficiently designing\nand analyzing large circuits. However, traditional compact model development\nrequires a large amount of manual effort and can span many years. Moreover,\ninclusion of new physics (eg, radiation effects) into an existing compact model\nis not trivial and may require redevelopment from scratch. Machine Learning\n(ML) techniques have the potential to automate and significantly speed up the\ndevelopment of compact models. In addition, ML provides a range of modeling\noptions that can be used to develop hierarchies of compact models tailored to\nspecific circuit design stages. In this paper, we explore three such options:\n(1) table-based interpolation, (2)Generalized Moving Least-Squares, and (3)\nfeed-forward Deep Neural Networks, to develop compact models for a p-n junction\ndiode. We evaluate the performance of these \"data-driven\" compact models by (1)\ncomparing their voltage-current characteristics against laboratory data, and\n(2) building a bridge rectifier circuit using these devices, predicting the\ncircuit's behavior using SPICE-like circuit simulations, and then comparing\nthese predictions against laboratory measurements of the same circuit.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2020 18:25:32 GMT"}], "update_date": "2020-01-07", "authors_parsed": [["Aadithya", "K.", ""], ["Kuberry", "P.", ""], ["Paskaleva", "B.", ""], ["Bochev", "P.", ""], ["Leeson", "K.", ""], ["Mar", "A.", ""], ["Mei", "T.", ""], ["Keiter", "E.", ""]]}, {"id": "2001.01756", "submitter": "Kirana Kumara P", "authors": "Kirana Kumara P", "title": "Preliminary Studies on the Usefulness of Nonlinear Boundary Element\n  Method for Real-Time Simulation of Biological Organs", "comments": "20 pages, 8 figures, 6 tables, submitted to a journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is some literature on the application of linear boundary element method\n(BEM) for real-time simulation of biological organs. However, literature is\nscant when it comes to the application of nonlinear BEM, although there is a\npossibility that the use of nonlinear BEM would result in better simulations.\nHence the present paper explores the possibility of using nonlinear BEM for\nreal-time simulation of biological organs. This paper begins with a general\ndiscussion about using the nonlinear BEM for real-time simulation of biological\norgans. Literature on nonlinear BEM is reviewed and the literature that deal\nwith nonlinear formulations and coding are noted down next. In the later\nsections, some results obtained from nonlinear analyses are compared with the\ncorresponding results from linear analyses. The last section concludes with\nremarks that indicate that it might be possible to obtain better simulations in\nthe future by using nonlinear BEM.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2020 19:48:07 GMT"}], "update_date": "2020-01-08", "authors_parsed": [["P", "Kirana Kumara", ""]]}, {"id": "2001.01896", "submitter": "Zhi Zeng", "authors": "Zhi Zeng and Fulei Ma", "title": "An Efficient Gradient Projection Method for Structural Topology\n  Optimization", "comments": "The two authors contributed equally to this work. This paper has been\n  accepted by Advances in Engineering Software", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents an efficient gradient projection-based method for\nstructural topological optimization problems characterized by a nonlinear\nobjective function which is minimized over a feasible region defined by\nbilateral bounds and a single linear equality constraint. The specialty of the\nconstraints type, as well as heuristic engineering experiences are exploited to\nimprove the scaling scheme, projection, and searching step. In detail, gradient\nclipping and a modified projection of searching direction under certain\ncondition are utilized to facilitate the efficiency of the proposed method.\nBesides, an analytical solution is proposed to approximate this projection with\nnegligible computation and memory costs. Furthermore, the calculation of\nsearching steps is largely simplified. Benchmark problems, including the MBB,\nthe force inverter mechanism, and the 3D cantilever beam are used to validate\nthe effectiveness of the method. The proposed method is implemented in MATLAB\nwhich is open-sourced for educational usage.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2020 05:22:21 GMT"}, {"version": "v2", "created": "Mon, 15 Jun 2020 03:12:29 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Zeng", "Zhi", ""], ["Ma", "Fulei", ""]]}, {"id": "2001.02412", "submitter": "Chuanqi Liu", "authors": "Chuanqi Liu and Waiching Sun", "title": "ILS-MPM: an implicit level-set-based material point method for\n  frictional particulate contact mechanics of deformable particles", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2020.113168", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Finite element simulations of frictional multi-body contact problems via\nconformal meshes can be challenging and computationally demanding. To render\ngeometrical features, unstructured meshes must be used and this unavoidably\nincreases the degrees of freedom and therefore makes the construction of\nslave/master pairs more demanding. In this work, we introduce an implicit\nmaterial point method designed to bypass the meshing of bodies by employing\nlevel set functions to represent boundaries at structured grids. This implicit\nfunction representation provides an elegant mean to link an unbiased\nintermediate reference surface with the true boundaries by closest point\nprojection as shown in leichner et al. (2019). We then enforce the contact\nconstraints by a penalty method where the Coulomb friction law is implemented\nas an elastoplastic constitutive model such that a return mapping algorithm can\nbe used to provide constitutive updates for both the stick and slip states. To\nevolve the geometry of the contacts properly, the Hamilton-Jacobi equation is\nsolved incrementally such that the level set and material points are both\nupdated accord to the deformation field. To improve the accuracy and regularity\nof the numerical integration of the material point method, a moving least\nsquare method is used to project numerical values of the material points back\nto the standard locations for Gaussian-Legendre quadrature. Several benchmarks\nare used to verify the proposed model. Comparisons with discrete element\nsimulations are made to analyze the importance of stress fields on predicting\nthe macroscopic responses of granular assemblies.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2020 08:29:26 GMT"}, {"version": "v2", "created": "Thu, 16 Jan 2020 01:40:03 GMT"}, {"version": "v3", "created": "Mon, 2 Nov 2020 12:45:54 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Liu", "Chuanqi", ""], ["Sun", "Waiching", ""]]}, {"id": "2001.02892", "submitter": "Jonas Nitzler", "authors": "Jonas Nitzler, Jonas Biehler, Niklas Fehn, Phaedon-Stelios\n  Koutsourelakis, Wolfgang A. Wall", "title": "A Generalized Probabilistic Learning Approach for Multi-Fidelity\n  Uncertainty Propagation in Complex Physical Simulations", "comments": "31 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two of the most significant challenges in uncertainty propagation pertain to\nthe high computational cost for the simulation of complex physical models and\nthe high dimension of the random inputs. In applications of practical interest\nboth of these problems are encountered and standard methods for uncertainty\nquantification either fail or are not feasible. To overcome the current\nlimitations, we propose a probabilistic multi-fidelity framework that can\nexploit lower-fidelity model versions of the original problem in a small data\nregime. The approach circumvents the curse of dimensionality by learning\ndependencies between the outputs of high-fidelity models and lower-fidelity\nmodels instead of explicitly accounting for the high-dimensional inputs. We\ncomplement the information provided by a low-fidelity model with a\nlow-dimensional set of informative features of the stochastic input, which are\ndiscovered by employing a combination of supervised and unsupervised\ndimensionality reduction techniques. The goal of our analysis is an efficient\nand accurate estimation of the full probabilistic response for a high-fidelity\nmodel. Despite the incomplete and noisy information that low-fidelity\npredictors provide, we demonstrate that accurate and certifiable estimates for\nthe quantities of interest can be obtained in the small data regime, i.e., with\nsignificantly fewer high-fidelity model runs than state-of-the-art methods for\nuncertainty propagation. We illustrate our approach by applying it to\nchallenging numerical examples such as Navier-Stokes flow simulations and\nmonolithic fluid-structure interaction problems.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jan 2020 09:09:04 GMT"}], "update_date": "2020-01-10", "authors_parsed": [["Nitzler", "Jonas", ""], ["Biehler", "Jonas", ""], ["Fehn", "Niklas", ""], ["Koutsourelakis", "Phaedon-Stelios", ""], ["Wall", "Wolfgang A.", ""]]}, {"id": "2001.03237", "submitter": "Mahesh Patil", "authors": "Mahesh B. Patil, Ramakrishna U., Mohan S. C", "title": "Multi-Objective Optimisation of Damper Placement for Improved Seismic\n  Response in Dynamically Similar Adjacent Buildings", "comments": "11 pages, 8 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-objective optimisation of damper placement in dynamically symmetric\nadjacent buildings is considered with identical viscoelastic dampers used for\nvibration control. First, exhaustive search is used to describe the solution\nspace in terms of various quantities of interest such as maximum top floor\ndisplacement, maximum floor acceleration, base shear, and interstorey drift.\nWith the help of examples, it is pointed out that the Pareto fronts in these\nproblems contain a very small number of solutions. The effectiveness of two\ncommonly used multi-objective evolutionary algorithms, viz., NSGA-II and MOPSO,\nis evaluated for a specific example.\n", "versions": [{"version": "v1", "created": "Sun, 29 Dec 2019 19:19:57 GMT"}], "update_date": "2020-01-13", "authors_parsed": [["Patil", "Mahesh B.", ""], ["U.", "Ramakrishna", ""], ["C", "Mohan S.", ""]]}, {"id": "2001.03416", "submitter": "Saptarshi Kumar Lahiri Mr.", "authors": "Saptarshi Kumar Lahiri, Kanishka Bhattacharya, Amit Shaw, L S\n  Ramachandra", "title": "A stable SPH with adaptive B-spline kernel", "comments": "34 Pages, 22 Figures", "journal-ref": "Journal of Computational Physics 422(2020) 109761", "doi": "10.1016/j.jcp.2020.109761", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tensile instability, often observed in smoothed particle hydrodynamics (SPH),\nis a numerical artifact that manifests itself by unphysical clustering or\nseparation of particles. The instability originates in estimating the\nderivatives of the smoothing functions which, when interact with material\nconstitution may result in negative stiffness in the discretized system. In the\npresent study, a stable formulation of SPH is developed where the kernel\nfunction is continuously adapted at every material point depending on its state\nof stress. Bspline basis function with a variable intermediate knot is used as\nthe kernel function. The shape of the kernel function is then modified by\nchanging the intermediate knot position such that the condition associated with\ninstability does not arise. While implementing the algorithm the simplicity and\ncomputational efficiency of SPH are not compromised. One-dimensional dispersion\nanalysis is performed to understand the effect adaptive kernel on the\nstability. Finally, the efficacy of the algorithm is demonstrated through some\nbenchmark elastic dynamics problems.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jan 2020 09:27:32 GMT"}], "update_date": "2020-08-26", "authors_parsed": [["Lahiri", "Saptarshi Kumar", ""], ["Bhattacharya", "Kanishka", ""], ["Shaw", "Amit", ""], ["Ramachandra", "L S", ""]]}, {"id": "2001.03438", "submitter": "Dengpeng Huang", "authors": "Dengpeng Huang, Jan Niklas Fuhg, Christian Wei{\\ss}enfels, Peter\n  Wriggers", "title": "A machine learning based plasticity model using proper orthogonal\n  decomposition", "comments": null, "journal-ref": "Computer Methods in Applied Mechanics and Engineering, Volume 365,\n  2020, 113008, ISSN 0045-7825,", "doi": "10.1016/j.cma.2020.113008", "report-no": null, "categories": "cs.CE cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data-driven material models have many advantages over classical numerical\napproaches, such as the direct utilization of experimental data and the\npossibility to improve performance of predictions when additional data is\navailable. One approach to develop a data-driven material model is to use\nmachine learning tools. These can be trained offline to fit an observed\nmaterial behaviour and then be applied in online applications. However,\nlearning and predicting history dependent material models, such as plasticity,\nis still challenging. In this work, a machine learning based material modelling\nframework is proposed for both elasticity and plasticity. The machine learning\nbased hyperelasticity model is developed with the Feed forward Neural Network\n(FNN) directly whereas the machine learning based plasticity model is developed\nby using of a novel method called Proper Orthogonal Decomposition Feed forward\nNeural Network (PODFNN). In order to account for the loading history, the\naccumulated absolute strain is proposed to be the history variable of the\nplasticity model. Additionally, the strain-stress sequence data for plasticity\nis collected from different loading-unloading paths based on the concept of\nsequence for plasticity. By means of the POD, the multi-dimensional stress\nsequence is decoupled leading to independent one dimensional coefficient\nsequences. In this case, the neural network with multiple output is replaced by\nmultiple independent neural networks each possessing a one-dimensional output,\nwhich leads to less training time and better training performance. To apply the\nmachine learning based material model in finite element analysis, the tangent\nmatrix is derived by the automatic symbolic differentiation tool AceGen. The\neffectiveness and generalization of the presented models are investigated by a\nseries of numerical examples using both 2D and 3D finite element analysis.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2020 15:46:16 GMT"}], "update_date": "2020-06-11", "authors_parsed": [["Huang", "Dengpeng", ""], ["Fuhg", "Jan Niklas", ""], ["Weißenfels", "Christian", ""], ["Wriggers", "Peter", ""]]}, {"id": "2001.04023", "submitter": "Raymond Leung", "authors": "Raymond Leung", "title": "Modelling Orebody Structures: Block Merging Algorithms and Block Model\n  Spatial Restructuring Strategies Given Mesh Surfaces of Geological Boundaries", "comments": "Keywords: Block merging algorithms, block model structure, spatial\n  restructuring, mesh surfaces, subsurface modelling, geological structures,\n  sub-blocking, boundary correction, domain identification, iterative\n  refinement, geospatial information system. 27 page article, 26 figures, 6\n  tables, plus supplementary material (17 pages)", "journal-ref": "Journal of Spatial Information Science 21 (2020) 137-174", "doi": "10.5311/JOSIS.2020.21.582", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a framework for capturing geological structures in a 3D\nblock model and improving its spatial fidelity given new mesh surfaces. Using\nsurfaces that represent geological boundaries, the objectives are to identify\nareas where refinement is needed, increase spatial resolution to minimize\nsurface approximation error, reduce redundancy to increase the compactness of\nthe model and identify the geological domain on a block-by-block basis. These\nobjectives are fulfilled by four system components which perform block-surface\noverlap detection, spatial structure decomposition, sub-blocks consolidation\nand block tagging, respectively. The main contributions are a coordinate-ascent\nmerging algorithm and a flexible architecture for updating the spatial\nstructure of a block model when given multiple surfaces, which emphasizes the\nability to selectively retain or modify previously assigned block labels. The\ntechniques employed include block-surface intersection analysis based on the\nseparable axis theorem and ray-tracing for establishing the location of blocks\nrelative to surfaces. To demonstrate the robustness and applicability of the\nproposed block merging strategy in a more narrow setting, it is used to reduce\nblock fragmentation in an existing model where surfaces are not given and the\nminimum block size is fixed. To obtain further insight, a systematic comparison\nwith octree subblocking subsequently illustrates the inherent constraints of\ndyadic hierarchical decomposition and the importance of inter-scale merging.\nThe results show the proposed method produces merged blocks with less extreme\naspect ratios and is highly amenable to parallel processing. The overall\nframework is applicable to orebody modelling given geological boundaries, and\n3D segmentation more generally, where there is a need to delineate spatial\nregions using mesh surfaces within a block model.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 01:10:03 GMT"}, {"version": "v2", "created": "Tue, 18 Aug 2020 10:05:44 GMT"}, {"version": "v3", "created": "Wed, 2 Sep 2020 06:36:29 GMT"}], "update_date": "2020-12-24", "authors_parsed": [["Leung", "Raymond", ""]]}, {"id": "2001.04175", "submitter": "Martin Thomas Horsch", "authors": "Martin Thomas Horsch, Silvia Chiacchiera, Youness Bami, Georg J.\n  Schmitz, Gabriele Mogni, Gerhard Goldbeck, and Emanuele Ghedini", "title": "Reliable and interoperable computational molecular engineering: 2.\n  Semantic interoperability based on the European Materials and Modelling\n  Ontology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cond-mat.mtrl-sci cs.DB cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The European Materials and Modelling Ontology (EMMO) is a top-level ontology\ndesigned by the European Materials Modelling Council to facilitate semantic\ninteroperability between platforms, models, and tools in computational\nmolecular engineering, integrated computational materials engineering, and\nrelated applications of materials modelling and characterization. Additionally,\ndomain ontologies exist based on data technology developments from specific\nplatforms. The present work discusses the ongoing work on establishing a\nEuropean Virtual Marketplace Framework, into which diverse platforms can be\nintegrated. It addresses common challenges that arise when marketplace-level\ndomain ontologies are combined with a top-level ontology like the EMMO by\nontology alignment.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 12:02:37 GMT"}], "update_date": "2020-01-14", "authors_parsed": [["Horsch", "Martin Thomas", ""], ["Chiacchiera", "Silvia", ""], ["Bami", "Youness", ""], ["Schmitz", "Georg J.", ""], ["Mogni", "Gabriele", ""], ["Goldbeck", "Gerhard", ""], ["Ghedini", "Emanuele", ""]]}, {"id": "2001.04789", "submitter": "Brandon Runnels", "authors": "Brandon Runnels, Vinamra Agrawal, Weiqun Zhang, and Ann Almgren", "title": "Massively parallel finite difference elasticity using block-structured\n  adaptive mesh refinement with a geometric multigrid solver", "comments": null, "journal-ref": null, "doi": "10.1016/j.jcp.2020.110065", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computationally solving the equations of elasticity is a key component in\nmany materials science and mechanics simulations. Phenomena such as\ndeformation-induced microstructure evolution, microfracture, and microvoid\nnucleation are examples of applications for which accurate stress and strain\nfields are required. A characteristic feature of these simulations is that the\nproblem domain is simple (typically a rectilinear representative volume element\n(RVE)), but the evolution of internal topological features is extremely\ncomplex. Traditionally, the finite element method (FEM) is used for elasticity\ncalculations; FEM is nearly ubiquituous due to (1) its ability to handle meshes\nof complex geometry using isoparametric elements, and (2) the weak formulation\nwhich eschews the need for computation of second derivatives. However, variable\ntopology problems (e.g. microstructure evolution) require either remeshing, or\nadaptive mesh refinement (AMR) - both of which can cause extensive overhead and\nlimited scaling. Block-structured AMR (BSAMR) is a method for adaptive mesh\nrefinement that exhibits good scaling and is well-suited for many problems in\nmaterials science. Here, it is shown that the equations of elasticity can be\nefficiently solved using BSAMR using the finite difference method. The boundary\noperator method is used to treat different types of boundary conditions, and\nthe \"reflux-free\" method is introduced to efficiently and easily treat the\ncoarse-fine boundaries that arise in BSAMR. Examples are presented that\ndemonstrate the use of this method in a variety of cases relevant to materials\nscience: Eshelby inclusions, fracture, and microstructure evolution. Reasonable\nscaling is demonstrated up to $\\sim$4000 processors with tens of millions of\ngrid points, and good AMR efficiency is observed.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2020 22:01:36 GMT"}, {"version": "v2", "created": "Mon, 7 Dec 2020 16:22:12 GMT"}], "update_date": "2021-01-29", "authors_parsed": [["Runnels", "Brandon", ""], ["Agrawal", "Vinamra", ""], ["Zhang", "Weiqun", ""], ["Almgren", "Ann", ""]]}, {"id": "2001.04816", "submitter": "Zhenlin Wang", "authors": "Z. Wang, X. Huan, K. Garikipati", "title": "Variational system identification of the partial differential equations\n  governing microstructure evolution in materials: Inference over sparse and\n  spatially unrelated data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NA math.NA physics.data-an", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Pattern formation is a widely observed phenomenon in diverse fields including\nmaterials physics, developmental biology and ecology, among many others. The\nphysics underlying the patterns is specific to the mechanisms, and is encoded\nby partial differential equations (PDEs). With the aim of discovering hidden\nphysics, we have previously presented a variational approach to identifying\nsuch systems of PDEs in the face of noisy data at varying fidelities (Computer\nMethods in Applied Mechanics and Engineering, 353:201-216, 2019). Here, we\nextend our variational system identification methods to address the challenges\npresented by image data on microstructures in materials physics. PDEs are\nformally posed as initial and boundary value problems over combinations of time\nintervals and spatial domains whose evolution is either fixed or can be\ntracked. However, the vast majority of microscopy techniques for evolving\nmicrostructure in a given material system deliver micrographs of pattern\nevolution over domains that bear no relation with each other at different time\ninstants. The temporal resolution can rarely capture the fastest time scales\nthat dominate the early dynamics, and noise abounds. Furthermore, data for\nevolution of the same phenomenon in a material system may well be obtained from\ndifferent physical specimens. Against this backdrop of spatially unrelated,\nsparse and multi-source data, we exploit the variational framework to make\njudicious choices of weighting functions and identify PDE operators from the\ndynamics. A consistency condition arises for parsimonious inference of a\nminimal set of the spatial operators at steady state. It is complemented by a\nconfirmation test that provides a sharp condition for acceptance of the\ninferred operators. The entire framework is demonstrated on synthetic data that\nreflect the characteristics of the experimental material microscopy images.\n", "versions": [{"version": "v1", "created": "Sat, 11 Jan 2020 18:19:50 GMT"}, {"version": "v2", "created": "Thu, 9 Apr 2020 16:22:19 GMT"}, {"version": "v3", "created": "Fri, 10 Apr 2020 01:36:57 GMT"}, {"version": "v4", "created": "Fri, 29 Jan 2021 20:21:50 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Wang", "Z.", ""], ["Huan", "X.", ""], ["Garikipati", "K.", ""]]}, {"id": "2001.04818", "submitter": "Sundararajan Natarajan", "authors": "Rupesh Kumar Mahendran, Hirshikesh, Ratna Kumar Annabattula,\n  Sundararajan Natarajan", "title": "Continuum modelling of stress diffusion interactions in an elastoplastic\n  medium in the presence of geometric discontinuity", "comments": null, "journal-ref": null, "doi": null, "report-no": "IITM-2020-01", "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chemo-mechanical coupled systems have been a subject of interest for many\ndecades now. Previous attempts to solve such models have mainly focused on\nelastic materials without taking into account the plastic deformation beyond\nyield, thus causing inaccuracies in failure calculations. This paper aims to\nstudy the effect of stress-diffusion interactions in an elastoplastic material\nusing a coupled chemo-mechanical system. The induced stress is dependent on the\nlocal concentration in a one way coupled system, and vice versa in a two way\ncoupled system. The time-dependent transient coupled system is solved using a\nfinite element formulation in an open-source finite element solver FEniCS. This\npaper attempts to computationally study the interaction of deformation and\ndiffusion and its effect on the localization of plastic strain. We investigate\nthe role of geometric discontinuities in scenarios involving diffusing species,\nnamely, a plate with a notch/hole/void and particle with a void/hole/core. We\nalso study the effect of stress concentrations and plastic yielding on the\ndiffusion-deformation. The developed code can be from\nhttps://github.com/mrupeshkumar/Elastoplastic-stress-diffusion-coupling\n", "versions": [{"version": "v1", "created": "Sat, 11 Jan 2020 16:01:33 GMT"}], "update_date": "2020-01-15", "authors_parsed": [["Mahendran", "Rupesh Kumar", ""], ["Hirshikesh", "", ""], ["Annabattula", "Ratna Kumar", ""], ["Natarajan", "Sundararajan", ""]]}, {"id": "2001.04925", "submitter": "Chennakesava Kadapa", "authors": "Chennakesava Kadapa and Wulf G Dettmer and Djordje Peric", "title": "Accurate iteration-free mixed-stabilised formulation for laminar\n  incompressible Navier-Stokes: Applications to fluid-structure interaction", "comments": "26 pages", "journal-ref": null, "doi": "10.1016/j.jfluidstructs.2020.103077", "report-no": null, "categories": "cs.CE physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stabilised mixed velocity-pressure formulations are one of the widely-used\nfinite element schemes for computing the numerical solutions of laminar\nincompressible Navier-Stokes. In these formulations, the Newton-Raphson scheme\nis employed to solve the nonlinearity in the convection term. One fundamental\nissue with this approach is the computational cost incurred in the\nNewton-Raphson iterations at every load/time step. In this paper, we present an\niteration-free mixed finite element formulation for incompressible\nNavier-Stokes that preserves second-order temporal accuracy of the\ngeneralised-alpha and related schemes for both velocity and pressure fields.\nFirst, we demonstrate the second-order temporal accuracy using numerical\nconvergence studies for an example with a manufactured solution. Later, we\nassess the accuracy and the computational benefits of the proposed scheme by\nstudying the benchmark example of flow past a fixed circular cylinder. Towards\nshowcasing the applicability of the proposed technique in a wider context, the\ninf-sup stable P2-P1 pair for the formulation without stabilisation is also\nconsidered. Finally, the resulting benefits of using the proposed scheme for\nfluid-structure interaction problems is illustrated using two benchmark\nexamples in fluid-flexible structure interaction.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2020 17:36:01 GMT"}, {"version": "v2", "created": "Wed, 17 Jun 2020 08:48:38 GMT"}], "update_date": "2020-07-15", "authors_parsed": [["Kadapa", "Chennakesava", ""], ["Dettmer", "Wulf G", ""], ["Peric", "Djordje", ""]]}, {"id": "2001.05061", "submitter": "Hardikkumar Zalavadia", "authors": "Hardikkumar Zalavadia and Eduardo Gildin", "title": "Non-Intrusive Parametric Model Order Reduction With Error Correction\n  Modeling for Changing Well Locations Using a Machine Learning Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of this paper is to develop a global non-intrusive Parametric\nModel Order Reduction (PMOR) methodology for the problem of changing well\nlocations in an oil field, that can eventually be used for well placement\noptimization to gain significant computational savings. In this work, we\npropose a proper orthogonal decomposition (POD) based PMOR strategy that is\nnon-intrusive to the simulator source code and hence extends its applicability\nto any commercial simulator. The non-intrusiveness of the proposed technique\nstems from formulating a novel Machine Learning (ML) based framework used with\nPOD. The features of ML model are designed such that they take into\nconsideration the temporal evolution of the state solutions and thereby\navoiding simulator access for time dependency of the solutions. We represent\nwell location changes as a parameter by introducing geometry-based features and\nflow diagnostics inspired physics-based features. An error correction model\nbased on reduced model solutions is formulated later to correct for\ndiscrepancies in the state solutions at well gridblocks. It was observed that\nthe global PMOR could predict the overall trend in pressure and saturation\nsolutions at the well blocks but some bias was observed that resulted in\ndiscrepancies in prediction of quantities of interest (QoI). Thus, the error\ncorrection model that considers the physics based reduced model solutions as\nfeatures, proved to reduce the error in QoI significantly. This workflow is\napplied to a heterogeneous channelized reservoir that showed good solution\naccuracies and speed-ups of 50x-100x were observed for different cases\nconsidered. The method is formulated such that all the simulation time steps\nare independent and hence can make use of parallel resources very efficiently\nand also avoid stability issues that can result from error accumulation over\ntimesteps.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2020 02:10:27 GMT"}], "update_date": "2020-01-16", "authors_parsed": [["Zalavadia", "Hardikkumar", ""], ["Gildin", "Eduardo", ""]]}, {"id": "2001.05234", "submitter": "Pedro Costa", "authors": "Pedro Costa, Everett Phillips, Luca Brandt and Massimiliano Fatica", "title": "GPU acceleration of CaNS for massively-parallel direct numerical\n  simulations of canonical fluid flows", "comments": null, "journal-ref": "Computers & Mathematics with Applications 81 (2021) 502-511", "doi": "10.1016/j.camwa.2020.01.002", "report-no": null, "categories": "physics.flu-dyn cs.CE physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents the GPU acceleration of the open-source code CaNS for very\nfast massively-parallel simulations of canonical fluid flows. The distinct\nfeature of the many-CPU Navier-Stokes solver in CaNS is its fast direct solver\nfor the second-order finite-difference Poisson equation, based on the method of\neigenfunction expansions. The solver implements all the boundary conditions\nvalid for this type of problems in a unified framework. Here, we extend the\nsolver for GPU-accelerated clusters using CUDA Fortran. The porting makes\nextensive use of CUF kernels and has been greatly simplified by the unified\nmemory feature of CUDA Fortran, which handles the data migration between host\n(CPU) and device (GPU) without defining new arrays in the source code. The\noverall implementation has been validated against benchmark data for turbulent\nchannel flow and its performance assessed on a NVIDIA DGX-2 system (16 Tesla\nV100 32Gb, connected with NVLink via NVSwitch). The wall-clock time per time\nstep of the GPU-accelerated implementation is impressively small when compared\nto its CPU implementation on state-of-the-art many-CPU clusters, as long as the\ndomain partitioning is sufficiently small that the data resides mostly on the\nGPUs. The implementation has been made freely available and open-source under\nthe terms of an MIT license.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2020 11:06:25 GMT"}, {"version": "v2", "created": "Thu, 16 Jan 2020 11:53:37 GMT"}, {"version": "v3", "created": "Fri, 2 Oct 2020 11:18:57 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Costa", "Pedro", ""], ["Phillips", "Everett", ""], ["Brandt", "Luca", ""], ["Fatica", "Massimiliano", ""]]}, {"id": "2001.05964", "submitter": "Karsten Paul", "authors": "Karsten Paul, Christopher Zimmermann, Thang X. Duong, Roger A. Sauer", "title": "Isogeometric continuity constraints for multi-patch shells governed by\n  fourth-order deformation and phase field models", "comments": "In this version, typos were fixed, Chapter 6.4 is added, Table 1 is\n  updated, and clarifying explanations and remarks are added at several places", "journal-ref": "Comput. Methods Appl. Mech. Eng. 370 (2020)", "doi": "10.1016/j.cma.2020.113219", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents numerical techniques to enforce continuity constraints on\nmulti-patch surfaces for three distinct problem classes. The first involves\nstructural analysis of thin shells that are described by general Kirchhoff-Love\nkinematics. Their governing equation is a vector-valued, fourth-order,\nnonlinear, partial differential equation (PDE) that requires at least\n$C^1$-continuity within a displacement-based finite element formulation. The\nsecond class are surface phase separations modeled by a phase field. Their\ngoverning equation is the Cahn-Hilliard equation - a scalar, fourth-order,\nnonlinear PDE - that can be coupled to the thin shell PDE. The third class are\nbrittle fracture processes modeled by a phase field approach. In this work,\nthese are described by a scalar, fourth-order, nonlinear PDE that is similar to\nthe Cahn-Hilliard equation and is also coupled to the thin shell PDE. Using a\ndirect finite element discretization, the two phase field equations also\nrequire at least a $C^1$-continuous formulation. Isogeometric surface\ndiscretizations - often composed of multiple patches - thus require constraints\nthat enforce the $C^1$-continuity of displacement and phase field. For this,\ntwo numerical strategies are presented: For this, two numerical strategies are\npresented: A Lagrange multiplier formulation and a penalty method. The\ncurvilinear shell model including the geometrical constraints is taken from\nDuong et al. (2017) and it is extended to model the coupled phase field\nproblems on thin shells of Zimmermann et al. (2019) and Paul et al. (2020) on\nmulti-patches. Their accuracy and convergence are illustrated by several\nnumerical examples considering deforming shells, phase separations on evolving\nsurfaces, and dynamic brittle fracture of thin shells.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2020 17:52:18 GMT"}, {"version": "v2", "created": "Mon, 27 Jul 2020 16:37:33 GMT"}], "update_date": "2020-07-28", "authors_parsed": [["Paul", "Karsten", ""], ["Zimmermann", "Christopher", ""], ["Duong", "Thang X.", ""], ["Sauer", "Roger A.", ""]]}, {"id": "2001.06285", "submitter": "Stefan Hickel PhD", "authors": "Mohamad Fathi and Stefan Hickel", "title": "Rapid multi-component phase-split calculations using volume functions\n  and reduction methods", "comments": null, "journal-ref": "AIChE Journal 2021; e17174", "doi": "10.1002/aic.17174", "report-no": null, "categories": "cs.CE physics.comp-ph physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new family of fast and robust methods for the calculation of the\nvapor-liquid equilibrium at isobaric-isothermal (PT-flash),\nisochoric-isothermal (VT-flash), isenthalpic-isobaric (HP-flash), and\nisoenergetic-isochoric (UV-flash) conditions. The framework is provided by\nformulating phase-equilibrium conditions for multi-component mixtures in an\neffectively reduced space based on the molar specific value of the recently\nintroduced volume function derived from the Helmholtz free energy. The proposed\nalgorithmic implementation can fully exploit the optimum quadratic convergence\nof a Newton method with the analytical Jacobian matrix. This paper provides all\nrequired exact analytic expressions for the general cubic equation of state.\nComputational results demonstrate the effectivity and efficiency of the new\nmethods. Compared to conventional methods, the proposed reduced-space iteration\nleads to a considerable speed-up as well as to improved robustness and better\nconvergence behavior near the spinodal and coexistence curves of\nmulti-component mixtures, where the preconditioning by the reduction method is\nmost effective.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 21:17:57 GMT"}], "update_date": "2021-01-29", "authors_parsed": [["Fathi", "Mohamad", ""], ["Hickel", "Stefan", ""]]}, {"id": "2001.06833", "submitter": "Janine Mergel", "authors": "Janine C. Mergel, Julien Scheibert, Roger A. Sauer", "title": "Contact with coupled adhesion and friction: Computational framework,\n  applications, and new insights", "comments": null, "journal-ref": "Journal of the Mechanics and Physics of Solids 146:104194, 2021", "doi": "10.1016/j.jmps.2020.104194", "report-no": null, "categories": "cs.CE", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Contact involving soft materials often combines dry adhesion, sliding\nfriction, and large deformations. At the local level, these three aspects are\nrarely captured simultaneously, but included in the theoretical models by\nMergel et al. (2019). We here develop a corresponding finite element framework\nthat captures 3D finite-strain contact of two deformable bodies. This framework\nis suitable to investigate sliding friction even under tensile normal loads.\nFirst, we demonstrate the capabilities of our finite element model using both\n2D and 3D test cases, which range from compliant tapes to structures with high\nstiffness, and include deformable-rigid and deformable-deformable contact. We\nthen provide new results on the onset of sliding of smooth elastomer-glass\ninterfaces, a setup that couples nonlinear material behavior, adhesion, and\nlarge frictional stresses. Our simulations not only agree well with both\nexperimental and theoretical findings, they also provide new insights into the\ncurrent debate on the shear-induced reduction of the contact area in\nelastomeric contact.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2020 14:15:35 GMT"}, {"version": "v2", "created": "Sun, 5 Jul 2020 14:28:17 GMT"}, {"version": "v3", "created": "Tue, 1 Dec 2020 19:27:02 GMT"}], "update_date": "2020-12-03", "authors_parsed": [["Mergel", "Janine C.", ""], ["Scheibert", "Julien", ""], ["Sauer", "Roger A.", ""]]}, {"id": "2001.06884", "submitter": "Michele Piana", "authors": "Michele Piana, Giacomo Caviglia, Sara Sommariva", "title": "Mathematical modelling of nuclear medicine data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Positron Emission Tomography using 2-[18F]-2deoxy-D-glucose as radiotracer\n(FDG-PET) is currently one of the most frequently applied functional imaging\nmethods in clinical applications. The interpretation of FDG-PET data requires\nsophisticated mathematical approaches able to exploit the dynamical information\ncontained in this kind of data. Most of these approaches are formulated within\nthe framework of compartmental analysis, which connects the experimental\nnuclear data with unknown tracer coefficients measuring the effectiveness of\nthe tracer metabolism by means of Cauchy systems of ordinary differential\nequations. This paper provides a coincise overview of linear compartmental\nmethods, focusing on the analytical solution of the forward compartmental\nproblem and on the specific issues concerning the corresponding compartmental\ninverse problem.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2020 19:12:24 GMT"}], "update_date": "2020-01-22", "authors_parsed": [["Piana", "Michele", ""], ["Caviglia", "Giacomo", ""], ["Sommariva", "Sara", ""]]}, {"id": "2001.07105", "submitter": "Astrid Pechstein", "authors": "Astrid S. Pechstein, Martin Meindlhumer and Alexander Humer", "title": "High-order mixed finite elements for an energy-based model of the\n  polarization process in ferroelectric materials", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An energy-based model of the ferroelectric polarization process is presented\nin the current contribution. In an energy-based setting, dielectric\ndisplacement and strain (or displacement) are the primary independent unknowns.\nAs an internal variable, the remanent polarization vector is chosen. The model\nis then governed by two constitutive functions: the free energy function and\nthe dissipation function. Choices for both functions are given. As the\ndissipation function for rate-independent response is non-differentiable, it is\nproposed to regularize the problem. Then, a variational equation can be posed,\nwhich is subsequently discretized using conforming finite elements for each\nquantity. We point out which kind of continuity is needed for each field\n(displacement, dielectric displacement and remanent polarization) is necessary\nto obtain a conforming method, and provide corresponding finite elements. The\nelements are chosen such that Gauss' law of zero charges is satisfied exactly.\nThe discretized variational equations are solved for all unknowns at once in a\nsingle Newton iteration. We present numerical examples gained in the open\nsource software package Netgen/NGSolve.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2020 13:41:16 GMT"}], "update_date": "2020-01-22", "authors_parsed": [["Pechstein", "Astrid S.", ""], ["Meindlhumer", "Martin", ""], ["Humer", "Alexander", ""]]}, {"id": "2001.07186", "submitter": "Tobias K\\\"oppl", "authors": "Tobias K\\\"oppl, Ettore Vidotto, Barbara Wohlmuth", "title": "A 3D-1D coupled blood flow and oxygen transport model to generate\n  microvascular networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we introduce an algorithmic approach to generate microvascular\nnetworks starting from larger vessels that can be reconstructed without\nnoticeable segmentation errors. Contrary to larger vessels, the reconstruction\nof fine-scale components of microvascular networks shows significant\nsegmentation errors, and an accurate mapping is time and cost intense. Thus\nthere is a need for fast and reliable reconstruction algorithms yielding\nsurrogate networks having similar stochastic properties as the original ones.\nThe microvascular networks are constructed in a marching way by adding vessels\nto the outlets of the vascular tree from the previous step. To optimise the\nstructure of the vascular trees, we use Murray's law to determine the radii of\nthe vessels and bifurcation angles. In each step, we compute the local gradient\nof the partial pressure of oxygen and adapt the orientation of the new vessels\nto this gradient. At the same time, we use the partial pressure of oxygen to\ncheck whether the considered tissue block is supplied sufficiently with oxygen.\nComputing the partial pressure of oxygen, we use a 3D-1D coupled model for\nblood flow and oxygen transport. To decrease the complexity of a fully coupled\n3D model, we reduce the blood vessel network to a 1D graph structure and use a\nbi-directional coupling with the tissue which is described by a 3D homogeneous\nporous medium. The resulting surrogate networks are analysed with respect to\nmorphological and physiological aspects.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2020 17:53:59 GMT"}, {"version": "v2", "created": "Tue, 31 Mar 2020 20:04:35 GMT"}, {"version": "v3", "created": "Fri, 22 May 2020 15:34:09 GMT"}, {"version": "v4", "created": "Wed, 8 Jul 2020 18:46:45 GMT"}], "update_date": "2020-07-10", "authors_parsed": [["Köppl", "Tobias", ""], ["Vidotto", "Ettore", ""], ["Wohlmuth", "Barbara", ""]]}, {"id": "2001.07408", "submitter": "Shunchuan Yang", "authors": "Zekun Zhu, Xiaochao Zhou, Shunchuan Yang", "title": "Vector Single-Source SIE for TE Scattering From Objects Embedded in\n  Multilayers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A single-source (SS) surface integral equation (SIE) for transverse electric\n(TE) scattering from objects embedded in multilayers is proposed in this paper.\nThrough recursively applying the surface equivalence theorem from innermost to\noutermost boundaries, an equivalent model with surface current sources enforced\non the outermost boundary of the original object can be obtained. By further\nincorporated with the differential surface admittance operator (DSAO), only the\nelectric current density is required. In addition, an efficient singularity\ncancellation approach is proposed to accurately evaluate singular and nearly\nsingular integrals in the new formulation. Compared with other SIEs, like the\nPoggio-Miller-Chan-Harrington-Wu-Tsai (PMCHWT) formulation and other dual\nsources (DSs) formulations with both electric and magnetic current densities\nrequired, only single surface equivalent electric current density is required\nto be enforced on the outermost boundary in the proposed formulation. It is\nfound that the overall count of unknowns and memory consumption can be\nsignificantly reduced and the conditioning of the final system is much better\ncompared with the PMCHWT formulation. As numerical results shown, only a very\nsmall fraction amount of unknowns, memory and CPU time, 18%~30% of unknowns,\n5%~9% of memory and 55%~70% of CPU time of the PMCHWT formulation in our\nsimulations, is possibly needed in the proposed formulation.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2020 09:38:20 GMT"}, {"version": "v2", "created": "Sun, 14 Jun 2020 04:44:52 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Zhu", "Zekun", ""], ["Zhou", "Xiaochao", ""], ["Yang", "Shunchuan", ""]]}, {"id": "2001.07947", "submitter": "Thomas Spenke", "authors": "Thomas Spenke, Norbert Hosters, Marek Behr", "title": "A Multi-Vector Interface Quasi-Newton Method with Linear Complexity for\n  Partitioned Fluid-Structure Interaction", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2019.112810", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, interface quasi-Newton methods have gained growing attention\nin the fluid-structure interaction community by significantly improving\npartitioned solution schemes: They not only help to control the inherent\nadded-mass instability, but also prove to substantially speed up the coupling's\nconvergence. In this work, we present a novel variant: The key idea is to build\non the multi-vector Jacobian update scheme first presented by Bogaers et al.\n(2014) and avoid any explicit representation of the (inverse) Jacobian\napproximation, since it slows down the solution for large systems. Instead, all\nterms involving a quadratic complexity have been systematically eliminated. The\nresult is a new multi-vector interface quasi-Newton variant whose computational\ncost scales linearly with the problem size.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2020 10:31:27 GMT"}], "update_date": "2020-01-23", "authors_parsed": [["Spenke", "Thomas", ""], ["Hosters", "Norbert", ""], ["Behr", "Marek", ""]]}, {"id": "2001.08075", "submitter": "Yang Chen", "authors": "Yang Chen", "title": "Active Learning over DNN: Automated Engineering Design Optimization for\n  Fluid Dynamics Based on Self-Simulated Dataset", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimizing fluid-dynamic performance is an important engineering task.\nTraditionally, experts design shapes based on empirical estimations and verify\nthem through expensive experiments. This costly process, both in terms of time\nand space, may only explore a limited number of shapes and lead to sub-optimal\ndesigns. In this research, a test-proven deep learning architecture is applied\nto predict the performance under various restrictions and search for better\nshapes by optimizing the learned prediction function. The major challenge is\nthe vast amount of data points Deep Neural Network (DNN) demands, which is\nimprovident to simulate. To remedy this drawback, a Frequentist active learning\nis used to explore regions of the output space that DNN predicts promising.\nThis operation reduces the number of data samples demanded from ~8000 to 625.\nThe final stage, a user interface, made the model capable of optimizing with\ngiven user input of minimum area and viscosity. Flood fill is used to define a\nboundary area function so that the optimal shape does not bypass the minimum\narea. Stochastic Gradient Langevin Dynamics (SGLD) is employed to make sure the\nultimate shape is optimized while circumventing the required area. Jointly,\nshapes with extremely low drags are found explored by a practical user\ninterface with no human domain knowledge and modest computation overhead.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jan 2020 07:35:00 GMT"}, {"version": "v2", "created": "Thu, 23 Jan 2020 03:16:45 GMT"}], "update_date": "2020-01-24", "authors_parsed": [["Chen", "Yang", ""]]}, {"id": "2001.08201", "submitter": "Andrea Beck", "authors": "Andrea D. Beck, Jonas Zeifang, Anna Schwarz, David G. Flad", "title": "A Neural Network based Shock Detection and Localization Approach for\n  Discontinuous Galerkin Methods", "comments": null, "journal-ref": null, "doi": "10.1016/j.jcp.2020.109824", "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stable and accurate approximation of discontinuities such as shocks on a\nfinite computational mesh is a challenging task. Detection of shocks or strong\ndiscontinuities in the flow solution is typically achieved through a priori\ntroubled cell indicators, which guide the subsequent action of an appropriate\nshock capturing mechanism. Arriving at a stable and accurate solution often\nrequires empirically based parameter tuning and adjustments of the indicator\nsettings to the discretization and solution at hand. In this work, we propose\nto separate the task of shock detection and shock capturing more strongly and\naim to develop a shock indicator that is robust, accurate, requires minimal\nuser input and is suitable for high order element-based methods like\ndiscontinuous Galerkin and flux reconstruction methods. The novel indicator is\nlearned from analytical data through a supervised learning strategy; its input\nis given by the high order solution field, its output is an element-local map\nof the shock position. We use state of the art methods from edge detection in\nimage analysis based on deep convolutional multiscale networks and deep\nsupervision to train the indicators. The resulting networks are then used as\nblack box indicators, showing their robustness and accuracy on well established\ncanonical testcases. All simulations are run ab initio using the developed\nindicators, showing that they provide also stability during the strongly\ntransient phases. In particular for high order schemes with large cells and\nconsiderable inner-cell resolution capabilities, we demonstrate how the\nadditional accurate prediction of the position of the shock front can be\nexploited to guide inner-element shock capturing strategies.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2020 10:37:34 GMT"}], "update_date": "2020-10-28", "authors_parsed": [["Beck", "Andrea D.", ""], ["Zeifang", "Jonas", ""], ["Schwarz", "Anna", ""], ["Flad", "David G.", ""]]}, {"id": "2001.08244", "submitter": "Hugo Casquero", "authors": "Hugo Casquero, Carles Bona-Casas, Deepesh Toshniwal, Thomas J.R.\n  Hughes, Hector Gomez, Yongjie Jessica Zhang", "title": "The divergence-conforming immersed boundary method: Application to\n  vesicle and capsule dynamics", "comments": "For supplementary movies go to\n  https://www.andrew.cmu.edu/user/hugocp/research.html", "journal-ref": null, "doi": "10.1016/j.jcp.2020.109872", "report-no": null, "categories": "physics.flu-dyn cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend the recently introduced divergence-conforming immersed boundary\n(DCIB) method [1] to fluid-structure interaction (FSI) problems involving\nclosed co-dimension one solids. We focus on capsules and vesicles, whose\ndiscretization is particularly challenging due to the higher-order derivatives\nthat appear in their formulations. In two-dimensional settings, we employ cubic\nB-splines with periodic knot vectors to obtain discretizations of closed curves\nwith C^2 inter-element continuity. In three-dimensional settings, we use\nanalysis-suitable bi-cubic T-splines to obtain discretizations of closed\nsurfaces with at least C^1 inter-element continuity. Large spurious changes of\nthe fluid volume inside closed co-dimension one solids is a well-known issue\nfor IB methods. The DCIB method results in volume changes orders of magnitude\nlower than conventional IB methods. This is a byproduct of discretizing the\nvelocity-pressure pair with divergence-conforming B-splines, which lead to\nnegligible incompressibility errors at the Eulerian level. The higher\ninter-element continuity of divergence-conforming B-splines is also crucial to\navoid the quadrature/interpolation errors of IB methods becoming the dominant\ndiscretization error. Benchmark and application problems of vesicle and capsule\ndynamics are solved, including mesh-independence studies and comparisons with\nother numerical methods.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2020 19:38:22 GMT"}], "update_date": "2020-12-02", "authors_parsed": [["Casquero", "Hugo", ""], ["Bona-Casas", "Carles", ""], ["Toshniwal", "Deepesh", ""], ["Hughes", "Thomas J. R.", ""], ["Gomez", "Hector", ""], ["Zhang", "Yongjie Jessica", ""]]}, {"id": "2001.08849", "submitter": "Gang Mei", "authors": "Zenan Huo, Gang Mei, Nengxiong Xu", "title": "juSFEM: A Julia-based Open-source Package of Parallel Smoothed Finite\n  Element Method (S-FEM) for Elastic Problems", "comments": "Revised version submitted to Computers & Mathematics with\n  Applications on Dec. 4, 2019", "journal-ref": "Computers & Mathematics with Applications, 2020", "doi": "10.1016/j.camwa.2020.01.027", "report-no": null, "categories": "cs.MS cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Smoothed Finite Element Method (S-FEM) proposed by Liu G.R. can achieve\nmore accurate results than the conventional FEM. Currently, much commercial\nsoftware and many open-source packages have been developed to analyze various\nscience and engineering problems using the FEM. However, there is little work\nfocusing on designing and developing software or packages for the S-FEM. In\nthis paper, we design and implement an open-source package of the parallel\nS-FEM for elastic problems by utilizing the Julia language on multi-core CPU.\nThe Julia language is a fast, easy-to-use, and open-source programming language\nthat was originally designed for high-performance computing. We term our\npackage as juSFEM. To the best of the authors knowledge, juSFEM is the first\npackage of parallel S-FEM developed with the Julia language. To verify the\ncorrectness and evaluate the efficiency of juSFEM, two groups of benchmark\ntests are conducted. The benchmark results show that (1) juSFEM can achieve\naccurate results when compared to commercial FEM software ABAQUS, and (2)\njuSFEM only requires 543 seconds to calculate the displacements of a 3D elastic\ncantilever beam model which is composed of approximately 2 million tetrahedral\nelements, while in contrast the commercial FEM software needs 930 seconds for\nthe same calculation model; (3) the parallel juSFEM executed on the 24-core CPU\nis approximately 20x faster than the corresponding serial version. Moreover,\nthe structure and function of juSFEM are easily modularized, and the code in\njuSFEM is clear and readable, which is convenient for further development.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2020 23:37:15 GMT"}], "update_date": "2020-02-21", "authors_parsed": [["Huo", "Zenan", ""], ["Mei", "Gang", ""], ["Xu", "Nengxiong", ""]]}, {"id": "2001.08936", "submitter": "Dimitri Pinel", "authors": "Dimitri Pinel", "title": "Clustering Methods Assessment for Investment in Zero Emission\n  Neighborhoods Energy System", "comments": "12 pages, 19 figures, 7 tables, 1 Appendix,", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the use of clustering in the context of designing the\nenergy system of Zero Emission Neighborhoods (ZEN). ZENs are neighborhoods who\naim to have net zero emissions during their lifetime. While previous work has\nused and studied clustering for designing the energy system of neighborhoods,\nno article dealt with neighborhoods such as ZEN, which have high requirements\nfor the solar irradiance time series, include a CO2 factor time series and have\na zero emission balance limiting the possibilities. To this end several methods\nare used and their results compared. The results are on the one hand the\nperformances of the clustering itself and on the other hand, the performances\nof each method in the optimization model where the data is used. Various\naspects related to the clustering methods are tested. The different aspects\nstudied are: the goal (clustering to obtain days or hours), the algorithm\n(k-means or k-medoids), the normalization method (based on the standard\ndeviation or range of values) and the use of heuristic. The results highlight\nthat k-means offers better results than k-medoids and that k-means was\nsystematically underestimating the objective value while k-medoids was\nconstantly overestimating it. When the choice between clustering days and hours\nis possible, it appears that clustering days offers the best precision and\nsolving time. The choice depends on the formulation used for the optimization\nmodel and the need to model seasonal storage. The choice of the normalization\nmethod has the least impact, but the range of values method show some\nadvantages in terms of solving time. When a good representation of the solar\nirradiance time series is needed, a higher number of days or using hours is\nnecessary. The choice depends on what solving time is acceptable.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2020 10:22:53 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Pinel", "Dimitri", ""]]}, {"id": "2001.09034", "submitter": "Yue Guan", "authors": "Yue Guan, Rade Grujicic, Xuechuan Wang, Leiting Dong and Satya N.\n  Atluri", "title": "A New Meshless \"Fragile Points Method\" and A Local Variational Iteration\n  Method for General Transient Heat Conduction in Anisotropic Nonhomogeneous\n  Media", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new and effective computational approach is presented for analyzing\ntransient heat conduction problems. The approach consists of a meshless Fragile\nPoints Method (FPM) being utilized for spatial discretization, and a Local\nVariational Iteration (LVI) scheme for time discretization. Anisotropy and\nnonhomogeneity do not give rise to any difficulties in the present\nimplementation. The meshless FPM is based on a Galerkin weak-form formulation\nand thus leads to symmetric matrices. Local, very simple, polynomial and\ndiscontinuous trial and test functions are employed. In the meshless FPM,\nInterior Penalty Numerical Fluxes are introduced to ensure the consistency of\nthe method. The LVIM in the time domain is generated as a combination of the\nVariational Iteration Method (VIM) applied over a large time interval and\nnumerical algorithms. A set of collocation nodes are employed in each finitely\nlarge time interval. The FPM + LVIM approach is capable of solving transient\nheat transfer problems in complex geometries with mixed boundary conditions,\nincluding pre-existing cracks. Numerical examples are presented in 2D and 3D\ndomains. Both functionally graded materials and composite materials are\nconsidered. It is shown that, with suitable computational parameters, the FPM +\nLVIM approach is not only accurate, but also efficient, and has reliable\nstability under relatively large time intervals. The present methodology\nrepresents a considerable improvement to the current state of science in\ncomputational transient heat conduction in anisotropic nonhomogeneous media.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2020 18:17:52 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Guan", "Yue", ""], ["Grujicic", "Rade", ""], ["Wang", "Xuechuan", ""], ["Dong", "Leiting", ""], ["Atluri", "Satya N.", ""]]}, {"id": "2001.09038", "submitter": "Seiji Takeda Dr", "authors": "Seiji Takeda, Toshiyuki Hama, Hsiang-Han Hsu, Toshiyuki Yamane, Koji\n  Masuda, Victoria A. Piunova, Dmitry Zubarev, Jed Pitera, Daniel P. Sanders,\n  and Daiju Nakano", "title": "AI-driven Inverse Design System for Organic Molecules", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing novel materials that possess desired properties is a central need\nacross many manufacturing industries. Driven by that industrial need, a variety\nof algorithms and tools have been developed that combine AI (machine learning\nand analytics) with domain knowledge in physics, chemistry, and materials\nscience. AI-driven materials design can be divided to mainly two stages; the\nfirst one is the modeling stage, where the goal is to build an accurate\nregression or classification model to predict material properties (e.g. glass\ntransition temperature) or attributes (e.g. toxic/non-toxic). The next stage is\ndesign, where the goal is to assemble or tune material structures so that they\ncan achieve user-demanded target property values based on a prediction model\nthat is trained in the modeling stage. For maximum benefit, these two stages\nshould be architected to form a coherent workflow. Today there are several\nemerging services and tools for AI-driven material design, however, most of\nthem provide only partial technical components (e.g. data analyzer, regression\nmodel, structure generator, etc.), that are useful for specific purposes, but\nfor comprehensive material design, those components need to be orchestrated\nappropriately. Our material design system provides an end-to-end solution to\nthis problem, with a workflow that consists of data input, feature encoding,\nprediction modeling, solution search, and structure generation. The system\nbuilds a regression model to predict properties, solves an inverse problem on\nthe trained model, and generates novel chemical structure candidates that\nsatisfy the target properties. In this paper we will introduce the methodology\nof our system, and demonstrate a simple example of inverse design generating\nnew chemical structures that satisfy targeted physical property values.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2020 09:15:51 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Takeda", "Seiji", ""], ["Hama", "Toshiyuki", ""], ["Hsu", "Hsiang-Han", ""], ["Yamane", "Toshiyuki", ""], ["Masuda", "Koji", ""], ["Piunova", "Victoria A.", ""], ["Zubarev", "Dmitry", ""], ["Pitera", "Jed", ""], ["Sanders", "Daniel P.", ""], ["Nakano", "Daiju", ""]]}, {"id": "2001.09686", "submitter": "Felix Wolf", "authors": "Stefan Kurz, Sebastian Sch\\\"ops, Gerhard Unger, Felix Wolf", "title": "Solving Maxwell's Eigenvalue Problem via Isogeometric Boundary Elements\n  and a Contour Integral Method", "comments": null, "journal-ref": "Mathematical Methods in the Applied Sciences, May 2021", "doi": "10.1002/mma.7447", "report-no": null, "categories": "cs.CE cs.NA math.NA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We solve Maxwell's eigenvalue problem via isogeometric boundary elements and\na contour integral method. We discuss the analytic properties of the\ndiscretisation, outline the implementation, and showcase numerical examples.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2020 10:54:08 GMT"}, {"version": "v2", "created": "Mon, 8 Jun 2020 10:24:27 GMT"}], "update_date": "2021-06-03", "authors_parsed": [["Kurz", "Stefan", ""], ["Schöps", "Sebastian", ""], ["Unger", "Gerhard", ""], ["Wolf", "Felix", ""]]}, {"id": "2001.09842", "submitter": "David Yevick", "authors": "David Yevick", "title": "Electric Field Propagation Through Singular Value Decomposition", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE eess.IV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate that the singular value decomposition algorithm in conjunction\nwith the fast Fourier transform or finite difference procedures provides a\nstraightforward and accurate method for rapidly propagating electric fields in\nthe one-way Helmholtz formalism.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2020 09:29:12 GMT"}], "update_date": "2020-01-28", "authors_parsed": [["Yevick", "David", ""]]}, {"id": "2001.10280", "submitter": "Sandeep Pandey", "authors": "Sandeep Pandey, J\\\"org Schumacher", "title": "Reservoir computing model of two-dimensional turbulent convection", "comments": "16 pages, 12 figures", "journal-ref": "Phys. Rev. Fluids 5, 113506 (2020)", "doi": "10.1103/PhysRevFluids.5.113506", "report-no": null, "categories": "physics.flu-dyn cs.CE cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reservoir computing is applied to model the large-scale evolution and the\nresulting low-order turbulence statistics of a two-dimensional turbulent\nRayleigh-B\\'{e}nard convection flow at a Rayleigh number ${\\rm Ra}=10^7$ and a\nPrandtl number ${\\rm Pr}=7$ in an extended domain with an aspect ratio of 6.\nOur data-driven approach which is based on a long-term direct numerical\nsimulation of the convection flow comprises a two-step procedure. (1) Reduction\nof the original simulation data by a Proper Orthogonal Decomposition (POD)\nsnapshot analysis and subsequent truncation to the first 150 POD modes which\nare associated with the largest total energy amplitudes. (2) Setup and\noptimization of a reservoir computing model to describe the dynamical evolution\nof these 150 degrees of freedom and thus the large-scale evolution of the\nconvection flow. The quality of the prediction of the reservoir computing model\nis comprehensively tested. At the core of the model is the reservoir, a very\nlarge sparse random network charcterized by the spectral radius of the\ncorresponding adjacency matrix and a few further hyperparameters which are\nvaried to investigate the quality of the prediction. Our work demonstrates that\nthe reservoir computing model is capable to model the large-scale structure and\nlow-order statistics of turbulent convection which can open new avenues for\nmodeling mesoscale convection processes in larger circulation models.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jan 2020 11:49:25 GMT"}, {"version": "v2", "created": "Tue, 27 Oct 2020 20:34:18 GMT"}], "update_date": "2020-11-25", "authors_parsed": [["Pandey", "Sandeep", ""], ["Schumacher", "Jörg", ""]]}, {"id": "2001.10639", "submitter": "Nathan Sime", "authors": "Nathan Sime, Cian R. Wilson", "title": "Automatic weak imposition of free slip boundary conditions via Nitsche's\n  method: application to nonlinear problems in geodynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Imposition of free slip boundary conditions in science and engineering\nsimulations presents a challenge when the simulation domain is non-trivial.\nInspired by recent progress in symbolic computation of discontinuous Galerkin\nfinite element methods, we present a symmetric interior penalty form of\nNitsche's method to weakly impose these slip boundary conditions and present\nexamples of its use in the Stokes subsystem motivated by problems in\ngeodynamics. We compare numerical results with well established benchmark\nproblems. We also examine performance of the method with iterative solvers.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jan 2020 23:38:22 GMT"}], "update_date": "2020-01-30", "authors_parsed": [["Sime", "Nathan", ""], ["Wilson", "Cian R.", ""]]}, {"id": "2001.10721", "submitter": "Shunchuan Yang", "authors": "Yu Cheng, Guangzhi Chen, Xiang-Hua Wang, and Shunchuan Yang", "title": "Investigation of Numerical Dispersion with Time Step of The FDTD\n  Methods: Avoiding Erroneous Conclusions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is widely thought that small time steps lead to small numerical errors in\nthe finite-difference time-domain (FDTD) simulations. In this paper, we\ninvestigated how time steps impact on numerical dispersion of two FDTD methods\nincluding the FDTD(2,2) method and the FDTD(2,4) method. Through rigorously\nanalytical and numerical analysis, it is found that small time steps of the\nFDTD methods do not always have small numerical errors. Our findings reveal\nthat these two FDTD methods present different behaviors with respect to time\nsteps: (1) for the FDTD(2,2) method, smaller time steps limited by the\nCourant-Friedrichs-Lewy (CFL) condition increase numerical dispersion and lead\nto larger simulation errors; (2) for the FDTD(2,4) method, as time step\nincreases, numerical dispersion errors first decrease and then increase. Our\nfindings are also comprehensively validated from one- to three-dimensional\ncases through several numerical examples including wave propagation, resonant\nfrequencies of cavities and a practical electromagnetic compatibility (EMC)\nproblem.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2020 08:28:46 GMT"}, {"version": "v2", "created": "Thu, 20 Feb 2020 16:46:30 GMT"}], "update_date": "2020-02-21", "authors_parsed": [["Cheng", "Yu", ""], ["Chen", "Guangzhi", ""], ["Wang", "Xiang-Hua", ""], ["Yang", "Shunchuan", ""]]}, {"id": "2001.10815", "submitter": "Juraj Kardos", "authors": "Juraj Kardos and Drosos Kourounis and Olaf Schenk", "title": "Reduced-Space Interior Point Methods in Power Grid Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CE cs.DC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Due to critical environmental issues, the power systems have to accommodate a\nsignificant level of penetration of renewable generation which requires smart\napproaches to the power grid control. Associated optimal control problems are\nlarge-scale nonlinear optimization problems with up to hundreds of millions of\nvariables and constraints. The interior point methods become computationally\nintractable, mainly due to the solution of large linear systems.\n  This document addresses the computational bottlenecks of the interior point\nmethod during the solution of the security constrained optimal power flow\nproblems by applying reduced space quasi-Newton IPM, which could utilize\nhigh-performance computers due to the inherent parallelism in the adjoint\nmethod. Reduced space IPM approach and the adjoint method is a novel approach\nwhen it comes to solving the (security constrained) optimal power flow\nproblems. These were previously used in the PDE-constrained optimization. The\npresented methodology is suitable for high-performance architectures due to\ninherent parallelism in the adjoint method during the gradient evaluation,\nsince the individual contingency scenarios are modeled by independent set of\nthe constraints. Preliminary evaluation of the performance and convergence is\nperformed to study the reduced space approach.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2020 13:26:32 GMT"}], "update_date": "2020-01-30", "authors_parsed": [["Kardos", "Juraj", ""], ["Kourounis", "Drosos", ""], ["Schenk", "Olaf", ""]]}, {"id": "2001.11806", "submitter": "Martin Bauer", "authors": "Martin Bauer, Harald K\\\"ostler, Ulrich R\\\"ude", "title": "lbmpy: Automatic code generation for efficient parallel lattice\n  Boltzmann methods", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.CE cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lattice Boltzmann methods are a popular mesoscopic alternative to macroscopic\ncomputational fluid dynamics solvers. Many variants have been developed that\nvary in complexity, accuracy, and computational cost. Extensions are available\nto simulate multi-phase, multi-component, turbulent, or non-Newtonian flows. In\nthis work we present lbmpy, a code generation package that supports a wide\nvariety of different methods and provides a generic development environment for\nnew schemes as well. A high-level domain-specific language allows the user to\nformulate, extend and test various lattice Boltzmann schemes. The method\nspecification is represented in a symbolic intermediate representation.\nTransformations that operate on this intermediate representation optimize and\nparallelize the method, yielding highly efficient lattice Boltzmann compute\nkernels not only for single- and two-relaxation-time schemes but also for\nmulti-relaxation-time, cumulant, and entropically stabilized methods. An\nintegration into the HPC framework waLBerla makes massively parallel,\ndistributed simulations possible, which is demonstrated through scaling\nexperiments on the SuperMUC-NG supercomputing system\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 13:00:26 GMT"}, {"version": "v2", "created": "Sat, 11 Apr 2020 09:09:36 GMT"}], "update_date": "2020-04-14", "authors_parsed": [["Bauer", "Martin", ""], ["Köstler", "Harald", ""], ["Rüde", "Ulrich", ""]]}]