[{"id": "0911.0142", "submitter": "Sava Ecaterina", "authors": "Wilfried Huss, Ecaterina Sava, Wolfgang Woess", "title": "Entropy sensitivity of languages defined by infinite automata, via\n  Markov chains with forbidden transitions", "comments": "to appear in Theoretical Computer Science, 2010", "journal-ref": "Theoretical Computer Science 411 (2010), 3917-3922", "doi": "10.1016/j.tcs.2010.07.020", "report-no": null, "categories": "cs.FL math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A language L over a finite alphabet is growth-sensitive (or entropy\nsensitive) if forbidding any set of subwords F yields a sub-language L^F whose\nexponential growth rate (entropy) is smaller than that of L. Let (X, E, l) be\nan infinite, oriented, labelled graph. Considering the graph as an (infinite)\nautomaton, we associate with any pair of vertices x,y in X the language\nconsisting of all words that can be read as the labels along some path from x\nto y. Under suitable, general assumptions we prove that these languages are\ngrowth-sensitive. This is based on using Markov chains with forbidden\ntransitions.\n", "versions": [{"version": "v1", "created": "Sun, 1 Nov 2009 07:58:52 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2010 09:38:18 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Huss", "Wilfried", ""], ["Sava", "Ecaterina", ""], ["Woess", "Wolfgang", ""]]}, {"id": "0911.1370", "submitter": "Jakub Radoszewski", "authors": "Marcin Kubica, Jakub Radoszewski, Wojciech Rytter, Tomasz Walen", "title": "On the maximal number of cubic subwords in a string", "comments": "14 pages", "journal-ref": null, "doi": "10.1007/978-3-642-10217-2_34", "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the problem of the maximum number of cubic subwords (of the\nform $www$) in a given word. We also consider square subwords (of the form\n$ww$). The problem of the maximum number of squares in a word is not well\nunderstood. Several new results related to this problem are produced in the\npaper. We consider two simple problems related to the maximum number of\nsubwords which are squares or which are highly repetitive; then we provide a\nnontrivial estimation for the number of cubes. We show that the maximum number\nof squares $xx$ such that $x$ is not a primitive word (nonprimitive squares) in\na word of length $n$ is exactly $\\lfloor \\frac{n}{2}\\rfloor - 1$, and the\nmaximum number of subwords of the form $x^k$, for $k\\ge 3$, is exactly $n-2$.\nIn particular, the maximum number of cubes in a word is not greater than $n-2$\neither. Using very technical properties of occurrences of cubes, we improve\nthis bound significantly. We show that the maximum number of cubes in a word of\nlength $n$ is between $(1/2)n$ and $(4/5)n$. (In particular, we improve the\nlower bound from the conference version of the paper.)\n", "versions": [{"version": "v1", "created": "Fri, 6 Nov 2009 23:05:30 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Kubica", "Marcin", ""], ["Radoszewski", "Jakub", ""], ["Rytter", "Wojciech", ""], ["Walen", "Tomasz", ""]]}, {"id": "0911.2033", "submitter": "EPTCS", "authors": "Tom\\'a\\v{s} Babiak, Vojt\\v{e}ch \\v{R}eh\\'ak, Jan Strej\\v{c}ek", "title": "Almost Linear B\\\"uchi Automata", "comments": null, "journal-ref": "EPTCS 8, 2009, pp. 16-25", "doi": "10.4204/EPTCS.8.2", "report-no": null, "categories": "cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new fragment of Linear temporal logic (LTL) called LIO and a\nnew class of Buechi automata (BA) called Almost linear Buechi automata (ALBA).\nWe provide effective translations between LIO and ALBA showing that the two\nformalisms are expressively equivalent. While standard translations of LTL into\nBA use some intermediate formalisms, the presented translation of LIO into ALBA\nis direct. As we expect applications of ALBA in model checking, we compare the\nexpressiveness of ALBA with other classes of Buechi automata studied in this\ncontext and we indicate possible applications.\n", "versions": [{"version": "v1", "created": "Wed, 11 Nov 2009 00:48:28 GMT"}], "update_date": "2009-11-12", "authors_parsed": [["Babiak", "Tomáš", ""], ["Řehák", "Vojtěch", ""], ["Strejček", "Jan", ""]]}, {"id": "0911.2233", "submitter": "Zhi Xu", "authors": "Ehsan Chiniforooshan, Lila Kari and Zhi Xu", "title": "Pseudo-Power Avoidance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Repetition avoidance has been studied since Thue's work. In this paper, we\nconsidered another type of repetition, which is called pseudo-power. This\nconcept is inspired by Watson-Crick complementarity in DNA sequence and is\ndefined over an antimorphic involution $\\phi$. We first classify the alphabet\n$\\Sigma$ and the antimorphic involution $\\phi$, under which there exists\nsufficiently long pseudo-$k$th-power-free words. Then we present algorithms to\ntest whether a finite word $w$ is pseudo-$k$th-power-free.\n", "versions": [{"version": "v1", "created": "Wed, 11 Nov 2009 21:07:36 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Chiniforooshan", "Ehsan", ""], ["Kari", "Lila", ""], ["Xu", "Zhi", ""]]}, {"id": "0911.2320", "submitter": "EPTCS", "authors": "Paola Bonizzoni, Clelia De Felice, Rosalba Zizza", "title": "Circular Languages Generated by Complete Splicing Systems and Pure\n  Unitary Languages", "comments": null, "journal-ref": "EPTCS 9, 2009, pp. 22-31", "doi": "10.4204/EPTCS.9.3", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Circular splicing systems are a formal model of a generative mechanism of\ncircular words, inspired by a recombinant behaviour of circular DNA. Some\nunanswered questions are related to the computational power of such systems,\nand finding a characterization of the class of circular languages generated by\ncircular splicing systems is still an open problem. In this paper we solve this\nproblem for complete systems, which are special finite circular splicing\nsystems. We show that a circular language L is generated by a complete system\nif and only if the set Lin(L) of all words corresponding to L is a pure unitary\nlanguage generated by a set closed under the conjugacy relation. The class of\npure unitary languages was introduced by A. Ehrenfeucht, D. Haussler, G.\nRozenberg in 1983, as a subclass of the class of context-free languages,\ntogether with a characterization of regular pure unitary languages by means of\na decidable property. As a direct consequence, we characterize (regular)\ncircular languages generated by complete systems. We can also decide whether\nthe language generated by a complete system is regular. Finally, we point out\nthat complete systems have the same computational power as finite simple\nsystems, an easy type of circular splicing system defined in the literature\nfrom the very beginning, when only one rule is allowed. From our results on\ncomplete systems, it follows that finite simple systems generate a class of\ncontext-free languages containing non-regular languages, showing the\nincorrectness of a longstanding result on simple systems.\n", "versions": [{"version": "v1", "created": "Thu, 12 Nov 2009 08:40:12 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Bonizzoni", "Paola", ""], ["De Felice", "Clelia", ""], ["Zizza", "Rosalba", ""]]}, {"id": "0911.2324", "submitter": "EPTCS", "authors": "Martin F\\\"urer", "title": "Deterministic Autopoietic Automata", "comments": null, "journal-ref": "EPTCS 9, 2009, pp. 49-53", "doi": "10.4204/EPTCS.9.6", "report-no": null, "categories": "cs.NE cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies two issues related to the paper on Computing by\nSelf-reproduction: Autopoietic Automata by Jiri Wiedermann. It is shown that\nall results presented there extend to deterministic computations. In\nparticular, nondeterminism is not needed for a lineage to generate all\nautopoietic automata.\n", "versions": [{"version": "v1", "created": "Thu, 12 Nov 2009 08:48:38 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Fürer", "Martin", ""]]}, {"id": "0911.2829", "submitter": "EPTCS", "authors": "S. Barry Cooper, Vincent Danos", "title": "Proceedings Fifth Workshop on Developments in Computational\n  Models--Computational Models From Nature", "comments": null, "journal-ref": "EPTCS 9, 2009", "doi": "10.4204/EPTCS.9", "report-no": null, "categories": "cs.CE cs.AI cs.CC cs.FL cs.LO cs.NE cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The special theme of DCM 2009, co-located with ICALP 2009, concerned\nComputational Models From Nature, with a particular emphasis on computational\nmodels derived from physics and biology. The intention was to bring together\ndifferent approaches - in a community with a strong foundational background as\nproffered by the ICALP attendees - to create inspirational cross-boundary\nexchanges, and to lead to innovative further research. Specifically DCM 2009\nsought contributions in quantum computation and information, probabilistic\nmodels, chemical, biological and bio-inspired ones, including spatial models,\ngrowth models and models of self-assembly. Contributions putting to the test\nlogical or algorithmic aspects of computing (e.g., continuous computing with\ndynamical systems, or solid state computing models) were also very much\nwelcomed.\n", "versions": [{"version": "v1", "created": "Sun, 15 Nov 2009 03:35:32 GMT"}], "update_date": "2009-11-17", "authors_parsed": [["Cooper", "S. Barry", ""], ["Danos", "Vincent", ""]]}, {"id": "0911.3275", "submitter": "EPTCS", "authors": "Nguyen Van Tang (AIST)", "title": "A Tighter Bound for the Determinization of Visibly Pushdown Automata", "comments": null, "journal-ref": "EPTCS 10, 2009, pp. 62-76", "doi": "10.4204/EPTCS.10.5", "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Visibly pushdown automata (VPA), introduced by Alur and Madhusuan in 2004, is\na subclass of pushdown automata whose stack behavior is completely determined\nby the input symbol according to a fixed partition of the input alphabet. Since\nits introduce, VPAs have been shown to be useful in various context, e.g., as\nspecification formalism for verification and as automaton model for processing\nXML streams. Due to high complexity, however, implementation of formal\nverification based on VPA framework is a challenge. In this paper we consider\nthe problem of implementing VPA-based model checking algorithms. For doing so,\nwe first present an improvement on upper bound for determinization of VPA.\nNext, we propose simple on-the-fly algorithms to check universality and\ninclusion problems of this automata class. Then, we implement the proposed\nalgorithms in a prototype tool. Finally, we conduct experiments on randomly\ngenerated VPAs. The experimental results show that the proposed algorithms are\nconsiderably faster than the standard ones.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 12:48:55 GMT"}], "update_date": "2009-11-18", "authors_parsed": [["Van Tang", "Nguyen", "", "AIST"]]}, {"id": "0911.3277", "submitter": "EPTCS", "authors": "Bahareh Badban (Konstanz university), Stefan Leue (Konstanz\n  university), Jan-Georg Smaus (Freiburg University)", "title": "Automated Predicate Abstraction for Real-Time Models", "comments": null, "journal-ref": "EPTCS 10, 2009, pp. 36-43", "doi": "10.4204/EPTCS.10.3", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a technique designed to automatically compute predicate\nabstractions for dense real-timed models represented as networks of timed\nautomata.\n  We use the CIPM algorithm in our previous work which computes new invariants\nfor timed automata control locations and prunes the model, to compute a\npredicate abstraction of the model. We do so by taking information regarding\ncontrol locations and their newly computed invariants into account.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 13:12:54 GMT"}], "update_date": "2009-11-18", "authors_parsed": [["Badban", "Bahareh", "", "Konstanz university"], ["Leue", "Stefan", "", "Konstanz\n  university"], ["Smaus", "Jan-Georg", "", "Freiburg University"]]}, {"id": "0911.3283", "submitter": "EPTCS", "authors": "Christophe Morvan (Universit\\'e Paris-Est)", "title": "On external presentations of infinite graphs", "comments": null, "journal-ref": "EPTCS 10, 2009, pp. 23-35", "doi": "10.4204/EPTCS.10.2", "report-no": null, "categories": "cs.FL cs.DM cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The vertices of a finite state system are usually a subset of the natural\nnumbers. Most algorithms relative to these systems only use this fact to select\nvertices.\n  For infinite state systems, however, the situation is different: in\nparticular, for such systems having a finite description, each state of the\nsystem is a configuration of some machine. Then most algorithmic approaches\nrely on the structure of these configurations. Such characterisations are said\ninternal. In order to apply algorithms detecting a structural property (like\nidentifying connected components) one may have first to transform the system in\norder to fit the description needed for the algorithm. The problem of internal\ncharacterisation is that it hides structural properties, and each solution\nbecomes ad hoc relatively to the form of the configurations.\n  On the contrary, external characterisations avoid explicit naming of the\nvertices. Such characterisation are mostly defined via graph transformations.\n  In this paper we present two kind of external characterisations:\ndeterministic graph rewriting, which in turn characterise regular graphs,\ndeterministic context-free languages, and rational graphs. Inverse substitution\nfrom a generator (like the complete binary tree) provides characterisation for\nprefix-recognizable graphs, the Caucal Hierarchy and rational graphs. We\nillustrate how these characterisation provide an efficient tool for the\nrepresentation of infinite state systems.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 12:07:16 GMT"}], "update_date": "2009-11-18", "authors_parsed": [["Morvan", "Christophe", "", "Université Paris-Est"]]}, {"id": "0911.3307", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "On Some Sets of Dictionaries Whose omega-Powers Have a Given Complexity", "comments": "To appear in Mathematical Logic Quarterly", "journal-ref": "Mathematical Logic Quarterly 56, 5 (2010) 452?460", "doi": "10.1002/malq.200810154", "report-no": null, "categories": "math.LO cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A dictionary is a set of finite words over some finite alphabet X. The\nomega-power of a dictionary V is the set of infinite words obtained by infinite\nconcatenation of words in V. Lecomte studied in [Omega-powers and descriptive\nset theory, JSL 2005] the complexity of the set of dictionaries whose\nassociated omega-powers have a given complexity. In particular, he considered\nthe sets $W({\\bf\\Si}^0_{k})$ (respectively, $W({\\bf\\Pi}^0_{k})$,\n$W({\\bf\\Delta}_1^1)$) of dictionaries $V \\subseteq 2^\\star$ whose omega-powers\nare ${\\bf\\Si}^0_{k}$-sets (respectively, ${\\bf\\Pi}^0_{k}$-sets, Borel sets). In\nthis paper we first establish a new relation between the sets\n$W({\\bf\\Sigma}^0_{2})$ and $W({\\bf\\Delta}_1^1)$, showing that the set\n$W({\\bf\\Delta}_1^1)$ is \"more complex\" than the set $W({\\bf\\Sigma}^0_{2})$. As\nan application we improve the lower bound on the complexity of\n$W({\\bf\\Delta}_1^1)$ given by Lecomte. Then we prove that, for every integer\n$k\\geq 2$, (respectively, $k\\geq 3$) the set of dictionaries\n$W({\\bf\\Pi}^0_{k+1})$ (respectively, $W({\\bf\\Si}^0_{k+1})$) is \"more complex\"\nthan the set of dictionaries $W({\\bf\\Pi}^0_{k})$ (respectively,\n$W({\\bf\\Si}^0_{k})$) .\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 13:40:29 GMT"}], "update_date": "2010-09-28", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "0911.3440", "submitter": "EPTCS", "authors": "Axel Legay (INRIA/Irisa Rennes)", "title": "Proceedings International Workshop on Verification of Infinite-State\n  Systems", "comments": null, "journal-ref": "EPTCS 10, 2009", "doi": "10.4204/EPTCS.10", "report-no": null, "categories": "cs.LO cs.DM cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 11th International Workshop on\nVerification of Infinite-State Systems (INFINITY 2009). The workshop was held\nin Bologna, Italy on August 31, 2009, as a satellite event to the 20th\nInternational Conference on Concurrency Theory (CONCUR 2009). The aim of the\nINFINITY workshop is to provide a forum for researchers interested in the\ndevelopment of formal methods and algorithmic techniques for the analysis of\nsystems with infinitely many states, and their application in automated\nverification of complex software and hardware systems.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 23:46:08 GMT"}], "update_date": "2009-11-19", "authors_parsed": [["Legay", "Axel", "", "INRIA/Irisa Rennes"]]}, {"id": "0911.4985", "submitter": "EPTCS", "authors": "Mariangiola Dezani-Ciancaglini (Dipartimento di Informatica,\n  Universit\\`a di Torino), Paola Giannini (Dipartimento di Informatica,\n  Universit\\`a del Piemonte Orientale), Angelo Troina (Dipartimento di\n  Informatica, Universit\\`a di Torino)", "title": "A Type System for a Stochastic CLS", "comments": null, "journal-ref": "EPTCS 11, 2009, pp. 91-105", "doi": "10.4204/EPTCS.11.6", "report-no": null, "categories": "cs.FL cs.PL q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Stochastic Calculus of Looping Sequences is suitable to describe the\nevolution of microbiological systems, taking into account the speed of the\ndescribed activities. We propose a type system for this calculus that models\nhow the presence of positive and negative catalysers can modify these speeds.\nWe claim that types are the right abstraction in order to represent the\ninteraction between elements without specifying exactly the element positions.\nOur claim is supported through an example modelling the lactose operon.\n", "versions": [{"version": "v1", "created": "Thu, 26 Nov 2009 00:24:08 GMT"}], "update_date": "2009-11-30", "authors_parsed": [["Dezani-Ciancaglini", "Mariangiola", "", "Dipartimento di Informatica,\n  Università di Torino"], ["Giannini", "Paola", "", "Dipartimento di Informatica,\n  Università del Piemonte Orientale"], ["Troina", "Angelo", "", "Dipartimento di\n  Informatica, Università di Torino"]]}, {"id": "0911.4988", "submitter": "EPTCS", "authors": "Roberta Gori (Dipartimento di informatica, Pisa.), Francesca Levi\n  (Dipartimento di informatica, Pisa)", "title": "Abstract Interpretation for Probabilistic Termination of Biological\n  Systems", "comments": null, "journal-ref": "EPTCS 11, 2009, pp. 137-153", "doi": "10.4204/EPTCS.11.9", "report-no": null, "categories": "cs.LO cs.CE cs.FL q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a previous paper the authors applied the Abstract Interpretation approach\nfor approximating the probabilistic semantics of biological systems, modeled\nspecifically using the Chemical Ground Form calculus. The methodology is based\non the idea of representing a set of experiments, which differ only for the\ninitial concentrations, by abstracting the multiplicity of reagents present in\na solution, using intervals. In this paper, we refine the approach in order to\naddress probabilistic termination properties. More in details, we introduce a\nrefinement of the abstract LTS semantics and we abstract the probabilistic\nsemantics using a variant of Interval Markov Chains. The abstract probabilistic\nmodel safely approximates a set of concrete experiments and reports\nconservative lower and upper bounds for probabilistic termination.\n", "versions": [{"version": "v1", "created": "Thu, 26 Nov 2009 00:36:03 GMT"}], "update_date": "2009-12-01", "authors_parsed": [["Gori", "Roberta", "", "Dipartimento di informatica, Pisa."], ["Levi", "Francesca", "", "Dipartimento di informatica, Pisa"]]}]