[{"id": "1512.00174", "submitter": "Steven Chaplick", "authors": "Steven Chaplick, Grzegorz Gu\\'spiel, Grzegorz Gutowski, Tomasz\n  Krawczyk, Giuseppe Liotta", "title": "The Partial Visibility Representation Extension Problem", "comments": "Appears in the Proceedings of the 24th International Symposium on\n  Graph Drawing and Network Visualization (GD 2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a graph $G$, a function $\\psi$ is called a \\emph{bar visibility\nrepresentation} of $G$ when for each vertex $v \\in V(G)$, $\\psi(v)$ is a\nhorizontal line segment (\\emph{bar}) and $uv \\in E(G)$ iff there is an\nunobstructed, vertical, $\\varepsilon$-wide line of sight between $\\psi(u)$ and\n$\\psi(v)$. Graphs admitting such representations are well understood (via\nsimple characterizations) and recognizable in linear time. For a directed graph\n$G$, a bar visibility representation $\\psi$ of $G$, additionally, puts the bar\n$\\psi(u)$ strictly below the bar $\\psi(v)$ for each directed edge $(u,v)$ of\n$G$. We study a generalization of the recognition problem where a function\n$\\psi'$ defined on a subset $V'$ of $V(G)$ is given and the question is whether\nthere is a bar visibility representation $\\psi$ of $G$ with $\\psi(v) =\n\\psi'(v)$ for every $v \\in V'$. We show that for undirected graphs this problem\ntogether with closely related problems are \\NP-complete, but for certain cases\ninvolving directed graphs it is solvable in polynomial time.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2015 08:22:50 GMT"}, {"version": "v2", "created": "Tue, 30 Aug 2016 16:16:52 GMT"}], "update_date": "2016-08-31", "authors_parsed": [["Chaplick", "Steven", ""], ["Guśpiel", "Grzegorz", ""], ["Gutowski", "Grzegorz", ""], ["Krawczyk", "Tomasz", ""], ["Liotta", "Giuseppe", ""]]}, {"id": "1512.00180", "submitter": "Michael Lesnick", "authors": "Michael Lesnick, Matthew Wright", "title": "Interactive Visualization of 2-D Persistence Modules", "comments": "75 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AT cs.CG math.AC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this work is to extend the standard persistent homology pipeline\nfor exploratory data analysis to the 2-D persistence setting, in a practical,\ncomputationally efficient way. To this end, we introduce RIVET, a software tool\nfor the visualization of 2-D persistence modules, and present mathematical\nfoundations for this tool. RIVET provides an interactive visualization of the\nbarcodes of 1-D affine slices of a 2-D persistence module $M$. It also computes\nand visualizes the dimension of each vector space in $M$ and the bigraded Betti\nnumbers of $M$. At the heart of our computational approach is a novel data\nstructure based on planar line arrangements, on which we can perform fast\nqueries to find the barcode of any slice of $M$. We present an efficient\nalgorithm for constructing this data structure and establish bounds on its\ncomplexity.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2015 09:12:26 GMT"}], "update_date": "2015-12-02", "authors_parsed": [["Lesnick", "Michael", ""], ["Wright", "Matthew", ""]]}, {"id": "1512.00307", "submitter": "Darren Engwirda", "authors": "Darren Engwirda", "title": "Multi-resolution unstructured grid-generation for geophysical\n  applications on the sphere", "comments": "This paper was presented as a research note at the 24th International\n  Meshing Roundtable, University of Texas at Austin, October, 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.ao-ph cs.CG math.NA physics.comp-ph physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An algorithm for the generation of non-uniform unstructured grids on\nellipsoidal geometries is described. This technique is designed to generate\nhigh quality triangular and polygonal meshes appropriate for general\ncirculation modelling on the sphere, including applications to atmospheric and\nocean simulation, and numerical weather predication. Using a recently developed\nFrontal-Delaunay-refinement technique, a method for the construction of\nhigh-quality unstructured ellipsoidal Delaunay triangulations is introduced. A\ndual polygonal grid, derived from the associated Voronoi diagram, is also\noptionally generated as a by-product. Compared to existing techniques, it is\nshown that the Frontal-Delaunay approach typically produces grids with\nnear-optimal element quality and smooth grading characteristics, while imposing\nrelatively low computational expense. Initial results are presented for a\nselection of uniform and non-uniform ellipsoidal grids appropriate for\nlarge-scale geophysical applications. The use of user-defined mesh-sizing\nfunctions to generate smoothly graded, non-uniform grids is discussed.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2015 15:50:48 GMT"}], "update_date": "2015-12-02", "authors_parsed": [["Engwirda", "Darren", ""]]}, {"id": "1512.00358", "submitter": "Boris Aronov", "authors": "Boris Aronov and Micha Sharir", "title": "Almost Tight Bounds for Eliminating Depth Cycles in Three Dimensions", "comments": "15 pages including appendix, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given $n$ non-vertical lines in 3-space, their vertical depth (above/below)\nrelation can contain cycles. We show that the lines can be cut into\n$O(n^{3/2}\\mathop{\\mathrm{polylog}} n)$ pieces, such that the depth relation\namong these pieces is now a proper partial order. This bound is nearly tight in\nthe worst case.\n  Previous results on this topic could only handle restricted cases of the\nproblem (such as handling only triangular cycles, by Aronov, Koltun, and Sharir\n(2005), or only cycles in grid-like patterns, by Chazelle et al. (1992)), and\nthe bounds were considerably weaker---much closer to the trivial quadratic\nbound.\n  Our proof uses a recent variant of the polynomial partitioning technique, due\nto Guth, and some simple tools from algebraic geometry. It is much more\nstraightforward than the previous \"purely combinatorial\" methods.\n  Our technique can be extended to eliminating all cycles in the depth relation\namong segments, and among constant-degree algebraic arcs. We hope that a\nsuitable extension of this technique could be used to handle the much more\ndifficult case of pairwise-disjoint triangles.\n  We also discuss several algorithms for constructing a small set of cuts so as\nto eliminate all depth-relation cycles among the lines (minimizing such a set,\nfor the case of line segments, is known to be NP-complete). The performance of\nthese algorithms improves due to our new bound, but, so far, none of them both\n(a) produce close to $n^{3/2}$ cuts, and (b) run in time close to $n^{3/2}$, in\nthe worst case.\n  Our results almost completely settle a 35-year-old open problem in\ncomputational geometry, motivated by hidden-surface removal in computer\ngraphics.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2015 17:43:00 GMT"}, {"version": "v2", "created": "Wed, 8 Jun 2016 13:24:29 GMT"}], "update_date": "2016-06-09", "authors_parsed": [["Aronov", "Boris", ""], ["Sharir", "Micha", ""]]}, {"id": "1512.00720", "submitter": "Kathl\\'en Kohn", "authors": "Johannes Bl\\\"omer, Kathl\\'en Kohn", "title": "Voronoi Cells of Lattices with Respect to Arbitrary Norms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.MG cs.CG math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the geometry and complexity of Voronoi cells of lattices with\nrespect to arbitrary norms. On the positive side, we show for strictly convex\nand smooth norms that the geometry of Voronoi cells of lattices in any\ndimension is similar to the Euclidean case, i.e., the Voronoi cells are defined\nby the so-called Voronoi-relevant vectors and the facets of a Voronoi cell are\nin one-to-one correspondence with these vectors. On the negative side, we show\nthat Voronoi cells are combinatorially much more complicated for arbitrary\nstrictly convex and smooth norms than in the Euclidean case. In particular, we\nconstruct a family of three-dimensional lattices whose number of\nVoronoi-relevant vectors with respect to the $\\ell_3$-norm is unbounded. Our\nresult indicates, that the break through single exponential time algorithm of\nMicciancio and Voulgaris for solving the shortest and closest vector problem in\nthe Euclidean norm cannot be extended to achieve deterministic single\nexponential time algorithms for lattice problems with respect to arbitrary\n$\\ell_p$-norms. In fact, the algorithm of Micciancio and Voulgaris and its run\ntime analysis crucially depend on the fact that for the Euclidean norm the\nnumber of Voronoi-relevant vectors is single exponential in the lattice\ndimension.\n", "versions": [{"version": "v1", "created": "Fri, 27 Nov 2015 16:25:29 GMT"}, {"version": "v2", "created": "Mon, 14 Dec 2015 12:13:12 GMT"}, {"version": "v3", "created": "Fri, 26 May 2017 06:38:17 GMT"}, {"version": "v4", "created": "Tue, 7 Nov 2017 17:49:04 GMT"}, {"version": "v5", "created": "Sat, 11 Nov 2017 11:02:06 GMT"}], "update_date": "2017-11-15", "authors_parsed": [["Blömer", "Johannes", ""], ["Kohn", "Kathlén", ""]]}, {"id": "1512.01485", "submitter": "Sander Verdonschot", "authors": "Prosenjit Bose and Sander Verdonschot", "title": "Flips in Edge-Labelled Pseudo-Triangulations", "comments": "15 pages, 10 figures, invited to a CGTA special issue for CCCG 2015.\n  The paper is a stand-alone version of results that appeared in the second\n  author's PhD thesis (arXiv:1509.02563 [cs.CG])", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that $O(n^2)$ exchanging flips suffice to transform any edge-labelled\npointed pseudo-triangulation into any other with the same set of labels. By\nusing insertion, deletion and exchanging flips, we can transform any\nedge-labelled pseudo-triangulation into any other with $O(n \\log c + h \\log h)$\nflips, where $c$ is the number of convex layers and $h$ is the number of points\non the convex hull.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2015 17:23:37 GMT"}], "update_date": "2015-12-07", "authors_parsed": [["Bose", "Prosenjit", ""], ["Verdonschot", "Sander", ""]]}, {"id": "1512.01594", "submitter": "Jan Verschelde", "authors": "Jeff Sommars and Jan Verschelde", "title": "Pruning Algorithms for Pretropisms of Newton Polytopes", "comments": "exact, gift wrapping, Newton polytope, pretropism, tree pruning,\n  accepted for presentation at Computer Algebra in Scientific Computing, CASC\n  2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pretropisms are candidates for the leading exponents of Puiseux series that\nrepresent solutions of polynomial systems. To find pretropisms, we propose an\nexact gift wrapping algorithm to prune the tree of edges of a tuple of Newton\npolytopes. We prefer exact arithmetic not only because of the exact input and\nthe degrees of the output, but because of the often unpredictable growth of the\ncoordinates in the face normals, even for polytopes in generic position. We\nprovide experimental results with our preliminary implementation in Sage that\ncompare favorably with the pruning method that relies only on cone\nintersections.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2015 23:44:24 GMT"}, {"version": "v2", "created": "Fri, 17 Jun 2016 19:34:33 GMT"}], "update_date": "2016-06-20", "authors_parsed": [["Sommars", "Jeff", ""], ["Verschelde", "Jan", ""]]}, {"id": "1512.01699", "submitter": "Saeed Mehrabi", "authors": "Saeed Mehrabi, Abbas Mehrabi", "title": "A Note on Approximating 2-Transmitters", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A k-transmitter in a simple orthogonal polygon P is a mobile guard that\ntravels back and forth along an orthogonal line segment s inside P. The\nk-transmitter can see a point p in P if there exists a point q on s such that\nthe line segment pq is normal to s and pq intersects the boundary of P in at\nmost k points. In this paper, we give a 2-approximation algorithm for the\nproblem of guarding a monotone orthogonal polygon with the minimum number of\n2-transmitters.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2015 20:36:01 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Mehrabi", "Saeed", ""], ["Mehrabi", "Abbas", ""]]}, {"id": "1512.01700", "submitter": "Peter Bubenik", "authors": "Paul Bendich and Peter Bubenik and Alexander Wagner", "title": "Stabilizing the unstable output of persistent homology computations", "comments": "30 pages, 15 figures, added example producing a stable heat map\n  visualizing representative cycles for persistent homology classes (see Figure\n  1), accepted, to appear in Journal of Applied and Computational Topology", "journal-ref": "Journal of Applied and Computational Topology volume 4, pages\n  309-338 (2020)", "doi": "10.1007/s41468-019-00044-9", "report-no": null, "categories": "cs.CG math.AT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general technique for extracting a larger set of stable\ninformation from persistent homology computations than is currently done. The\npersistent homology algorithm is usually viewed as a procedure which starts\nwith a filtered complex and ends with a persistence diagram. This procedure is\nstable (at least to certain types of perturbations of the input). This\njustifies the use of the diagram as a signature of the input, and the use of\nfeatures derived from it in statistics and machine learning. However, these\ncomputations also produce other information of great interest to practitioners\nthat is unfortunately unstable. For example, each point in the diagram\ncorresponds to a simplex whose addition in the filtration results in the birth\nof the corresponding persistent homology class, but this correspondence is\nunstable. In addition, the persistence diagram is not stable with respect to\nother procedures that are employed in practice, such as thresholding a point\ncloud by density. We recast these problems as real-valued functions which are\ndiscontinuous but measurable, and then observe that convolving such a function\nwith a suitable function produces a Lipschitz function. The resulting stable\nfunction can be estimated by perturbing the input and averaging the output. We\nillustrate this approach with a number of examples, including a stable\nlocalization of a persistent homology generator from brain imaging data.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2015 20:42:33 GMT"}, {"version": "v2", "created": "Thu, 27 Apr 2017 23:56:18 GMT"}, {"version": "v3", "created": "Fri, 22 Dec 2017 02:55:38 GMT"}, {"version": "v4", "created": "Thu, 25 Oct 2018 15:02:40 GMT"}, {"version": "v5", "created": "Wed, 16 Oct 2019 19:39:53 GMT"}], "update_date": "2021-01-29", "authors_parsed": [["Bendich", "Paul", ""], ["Bubenik", "Peter", ""], ["Wagner", "Alexander", ""]]}, {"id": "1512.01713", "submitter": "Rahul Saladi", "authors": "Saladi Rahul", "title": "Approximate Range Counting Revisited", "comments": "A preliminary version of this paper has been accepted at SoCG 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study range-searching for colored objects, where one has to count\n(approximately) the number of colors present in a query range. The problems\nstudied mostly involve orthogonal range-searching in two and three dimensions,\nand the dual setting of rectangle stabbing by points. We present optimal and\nnear-optimal solutions for these problems. Most of the results are obtained via\nreductions to the approximate uncolored version, and improved data-structures\nfor them. An additional contribution of this work is the introduction of nested\nshallow cuttings.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2015 23:43:40 GMT"}, {"version": "v2", "created": "Fri, 23 Dec 2016 22:22:18 GMT"}, {"version": "v3", "created": "Mon, 20 Mar 2017 19:54:01 GMT"}], "update_date": "2017-03-22", "authors_parsed": [["Rahul", "Saladi", ""]]}, {"id": "1512.01775", "submitter": "Lee-Ad Gottlieb", "authors": "Yair Bartal, Lee-Ad Gottlieb", "title": "Approximate nearest neighbor search for $\\ell_p$-spaces ($2 < p <\n  \\infty$) via embeddings", "comments": "arXiv admin note: substantial text overlap with arXiv:1408.1789", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While the problem of approximate nearest neighbor search has been\nwell-studied for Euclidean space and $\\ell_1$, few non-trivial algorithms are\nknown for $\\ell_p$ when ($2 < p < \\infty$). In this paper, we revisit this\nfundamental problem and present approximate nearest-neighbor search algorithms\nwhich give the first non-trivial approximation factor guarantees in this\nsetting.\n", "versions": [{"version": "v1", "created": "Sun, 6 Dec 2015 11:02:39 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Bartal", "Yair", ""], ["Gottlieb", "Lee-Ad", ""]]}, {"id": "1512.01784", "submitter": "Azadeh Tabatabaei", "authors": "Azadeh Tabatabaei, Mohammad Ghodsi", "title": "Randomized Strategy for Walking in Streets for a Simple Robot", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of walking in an unknown street, for a robot that has\na minimal sensing capability. The robot is equipped with a sensor that only\ndetects the discontinuities in depth information (gaps) and can locate the\ntarget point as enters in its visibility region. First, we propose an online\ndeterministic search strategy that generates an optimal search path for the\nsimple robot to reach the target t, starting from s. In contrast with\npreviously known research, the path is designed without memorizing any portion\nof the scene has seen so far. Then, we present a randomized search strategy,\nbased on the deterministic strategy. We prove that the expected distance\ntraveled by the robot is at most a 5.33 times longer than the shortest path to\nreach the target.\n", "versions": [{"version": "v1", "created": "Sun, 6 Dec 2015 12:39:27 GMT"}, {"version": "v2", "created": "Tue, 8 Dec 2015 06:57:56 GMT"}], "update_date": "2015-12-09", "authors_parsed": [["Tabatabaei", "Azadeh", ""], ["Ghodsi", "Mohammad", ""]]}, {"id": "1512.01876", "submitter": "Kyle Fox", "authors": "Pankaj K. Agarwal, Kyle Fox, Jiangwei Pan and Rex Ying", "title": "Approximating Dynamic Time Warping and Edit Distance for a Pair of Point\n  Sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give the first subquadratic-time approximation schemes for dynamic time\nwarping (DTW) and edit distance (ED) of several natural families of point\nsequences in $\\mathbb{R}^d$, for any fixed $d \\ge 1$. In particular, our\nalgorithms compute $(1+\\varepsilon)$-approximations of DTW and ED in time\nnear-linear for point sequences drawn from k-packed or k-bounded curves, and\nsubquadratic for backbone sequences. Roughly speaking, a curve is\n$\\kappa$-packed if the length of its intersection with any ball of radius $r$\nis at most $\\kappa \\cdot r$, and a curve is $\\kappa$-bounded if the sub-curve\nbetween two curve points does not go too far from the two points compared to\nthe distance between the two points. In backbone sequences, consecutive points\nare spaced at approximately equal distances apart, and no two points lie very\nclose together. Recent results suggest that a subquadratic algorithm for DTW or\nED is unlikely for an arbitrary pair of point sequences even for $d=1$. Our\nalgorithms work by constructing a small set of rectangular regions that cover\nthe entries of the dynamic programming table commonly used for these distance\nmeasures. The weights of entries inside each rectangle are roughly the same, so\nwe are able to use efficient procedures to approximately compute the cheapest\npaths through these rectangles.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2015 01:54:19 GMT"}, {"version": "v2", "created": "Thu, 7 Jan 2016 21:40:51 GMT"}], "update_date": "2016-01-11", "authors_parsed": [["Agarwal", "Pankaj K.", ""], ["Fox", "Kyle", ""], ["Pan", "Jiangwei", ""], ["Ying", "Rex", ""]]}, {"id": "1512.02086", "submitter": "Joseph O'Rourke", "authors": "Giovanna Diaz, Joseph O'Rourke", "title": "Hypercube Unfoldings that Tile R^3 and R^2", "comments": "20 pages, 18 figures, 10 refs. Version 2: Corrected a typo, added a\n  reference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the hypercube has a face-unfolding that tiles space, and that\nunfolding has an edge-unfolding that tiles the plane. So the hypercube is a\n\"dimension-descending tiler.\" We also show that the hypercube cross unfolding\nmade famous by Dali tiles space, but we leave open the question of whether or\nnot it has an edge-unfolding that tiles the plane.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2015 15:20:45 GMT"}, {"version": "v2", "created": "Tue, 8 Dec 2015 13:22:25 GMT"}], "update_date": "2015-12-09", "authors_parsed": [["Diaz", "Giovanna", ""], ["O'Rourke", "Joseph", ""]]}, {"id": "1512.02257", "submitter": "Carsten Grimm", "authors": "Jean-Lou De Carufel and Carsten Grimm and Anil Maheshwari and Michiel\n  Smid", "title": "Minimizing the Continuous Diameter when Augmenting Paths and Cycles with\n  Shortcuts", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We seek to augment a geometric network in the Euclidean plane with shortcuts\nto minimize its continuous diameter, i.e., the largest network distance between\nany two points on the augmented network. Unlike in the discrete setting where a\nshortcut connects two vertices and the diameter is measured between vertices,\nwe take all points along the edges of the network into account when placing a\nshortcut and when measuring distances in the augmented network.\n  We study this network augmentation problem for paths and cycles. For paths,\nwe determine an optimal shortcut in linear time. For cycles, we show that a\nsingle shortcut never decreases the continuous diameter and that two shortcuts\nalways suffice to reduce the continuous diameter. Furthermore, we characterize\noptimal pairs of shortcuts for convex and non-convex cycles. Finally, we\ndevelop a linear time algorithm that produces an optimal pair of shortcuts for\nconvex cycles. Apart from the algorithms, our results extend to rectifiable\ncurves.\n  Our work reveals some of the underlying challenges that must be overcome when\naddressing the discrete version of this network augmentation problem, where we\nminimize the discrete diameter of a network with shortcuts that connect only\nvertices.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2015 21:44:54 GMT"}], "update_date": "2015-12-09", "authors_parsed": [["De Carufel", "Jean-Lou", ""], ["Grimm", "Carsten", ""], ["Maheshwari", "Anil", ""], ["Smid", "Michiel", ""]]}, {"id": "1512.02356", "submitter": "Sanjib Sadhu Mr", "authors": "Sanjib Sadhu, Sasanka Roy, Soumen Nandi, Anil Maheswari, and Subhas C.\n  Nandy", "title": "Approximation algorithms for the two-center problem of convex polygon", "comments": "27 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a convex polygon $P$ with $n$ vertices, the two-center problem is to\nfind two congruent closed disks of minimum radius such that they completely\ncover $P$. We propose an algorithm for this problem in the streaming setup,\nwhere the input stream is the vertices of the polygon in clockwise order. It\nproduces a radius $r$ satisfying $r\\leq2r_{opt}$ using $O(1)$ space, where\n$r_{opt}$ is the optimum solution. Next, we show that in non-streaming setup,\nwe can improve the approximation factor by $r\\leq 1.84 r_{opt}$, maintaining\nthe time complexity of the algorithm to $O(n)$, and using $O(1)$ extra space in\naddition to the space required for storing the input.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2015 07:15:56 GMT"}], "update_date": "2015-12-09", "authors_parsed": [["Sadhu", "Sanjib", ""], ["Roy", "Sasanka", ""], ["Nandi", "Soumen", ""], ["Maheswari", "Anil", ""], ["Nandy", "Subhas C.", ""]]}, {"id": "1512.02381", "submitter": "Louis Esperet", "authors": "Louis Esperet", "title": "Box representations of embedded graphs", "comments": "16 pages, 6 figures - revised version", "journal-ref": "Discrete and Computational Geometry 57(3) (2017), 590-606", "doi": "10.1007/s00454-016-9837-8", "report-no": null, "categories": "math.CO cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A $d$-box is the cartesian product of $d$ intervals of $\\mathbb{R}$ and a\n$d$-box representation of a graph $G$ is a representation of $G$ as the\nintersection graph of a set of $d$-boxes in $\\mathbb{R}^d$. It was proved by\nThomassen in 1986 that every planar graph has a 3-box representation. In this\npaper we prove that every graph embedded in a fixed orientable surface, without\nshort non-contractible cycles, has a 5-box representation. This directly\nimplies that there is a function $f$, such that in every graph of genus $g$, a\nset of at most $f(g)$ vertices can be removed so that the resulting graph has a\n5-box representation. We show that such a function $f$ can be made linear in\n$g$. Finally, we prove that for any proper minor-closed class $\\mathcal{F}$,\nthere is a constant $c(\\mathcal{F})$ such that every graph of $\\mathcal{F}$\nwithout cycles of length less than $c(\\mathcal{F})$ has a 3-box representation,\nwhich is best possible.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2015 09:37:18 GMT"}, {"version": "v2", "created": "Fri, 18 Nov 2016 10:32:59 GMT"}], "update_date": "2017-03-13", "authors_parsed": [["Esperet", "Louis", ""]]}, {"id": "1512.02620", "submitter": "Georg Muntingh PhD", "authors": "Juan Gerardo Alc\\'azar, Carlos Hermoso, Georg Muntingh", "title": "Similarity detection of rational space curves", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AG cs.CG cs.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide an algorithm to check whether two rational space curves are\nrelated by a similarity. The algorithm exploits the relationship between the\ncurvatures and torsions of two similar curves, which is formulated in a\ncomputer algebra setting. Helical curves, where curvature and torsion are\nproportional, need to be distinguished as a special case. The algorithm is easy\nto implement, as it involves only standard computer algebra techniques, such as\ngreatest common divisors and resultants, and Gr\\\"obner basis for the special\ncase of helical curves. Details on the implementation and experimentation\ncarried out using the computer algebra system Maple 18 are provided.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2015 20:38:42 GMT"}, {"version": "v2", "created": "Thu, 10 Mar 2016 18:38:31 GMT"}, {"version": "v3", "created": "Tue, 26 Apr 2016 05:58:47 GMT"}, {"version": "v4", "created": "Mon, 17 Oct 2016 11:37:43 GMT"}, {"version": "v5", "created": "Sat, 10 Jun 2017 20:14:08 GMT"}], "update_date": "2017-06-13", "authors_parsed": [["Alcázar", "Juan Gerardo", ""], ["Hermoso", "Carlos", ""], ["Muntingh", "Georg", ""]]}, {"id": "1512.02730", "submitter": "Ahmad Biniaz", "authors": "Ahmad Biniaz, Prosenjit Bose, Anil Maheshwari, and Michiel Smid", "title": "Plane Bichromatic Trees of Low Degree", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $R$ and $B$ be two disjoint sets of points in the plane such that\n$|B|\\leqslant |R|$, and no three points of $R\\cup B$ are collinear. We show\nthat the geometric complete bipartite graph $K(R,B)$ contains a non-crossing\nspanning tree whose maximum degree is at most $\\max\\left\\{3, \\left\\lceil\n\\frac{|R|-1}{|B|}\\right\\rceil + 1\\right\\}$; this is the best possible upper\nbound on the maximum degree. This solves an open problem posed by Abellanas et\nal. at the Graph Drawing Symposium, 1996.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2015 02:51:42 GMT"}], "update_date": "2015-12-10", "authors_parsed": [["Biniaz", "Ahmad", ""], ["Bose", "Prosenjit", ""], ["Maheshwari", "Anil", ""], ["Smid", "Michiel", ""]]}, {"id": "1512.02794", "submitter": "Matthias Althoff", "authors": "Matthias Althoff", "title": "On Computing the Minkowski Difference of Zonotopes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Zonotopes are becoming an increasingly popular set representation for formal\nverification techniques. This is mainly due to their efficient representation\nand their favorable computational complexity of important operations in\nhigh-dimensional spaces. In particular, zonotopes are closed under Minkowski\naddition and linear maps, which can be very efficiently implemented.\nUnfortunately, zonotopes are not closed under Minkowski difference for\ndimensions greater than two. However, we present an algorithm that efficiently\ncomputes a halfspace representation of the Minkowski difference of two\nzonotopes. In addition, we present an efficient algorithm that computes an\napproximation of the Minkowski difference in generator representation. The\nefficiency of the proposed solution is demonstrated by numerical experiments.\nThese experiments show a reduced computation time in comparison to that when\nfirst the halfspace representation of zonotopes is obtained and the Minkowski\ndifference is performed subsequently.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2015 09:18:19 GMT"}, {"version": "v2", "created": "Tue, 29 Nov 2016 16:29:15 GMT"}], "update_date": "2016-11-30", "authors_parsed": [["Althoff", "Matthias", ""]]}, {"id": "1512.02960", "submitter": "Vladimir V Kisil", "authors": "Vladimir V. Kisil", "title": "An Extension of Moebius--Lie Geometry with Conformal Ensembles of Cycles\n  and Its Implementation in a GiNaC Library", "comments": "LaTeX 16pp+111pp of appendices, including 10 PDF graphic files and\n  program code; v2: major revision of the paper, code in v3.1; v3: formal\n  definition of the extended geometry, connection with integrable systems, code\n  in v3.2rc1", "journal-ref": "Proc. Int. Geom. Cent. v.11 (2018), n.3, pp.45-67", "doi": "10.15673/tmgc.v11i3.1203", "report-no": null, "categories": "cs.CG cs.MS cs.SC math.DG", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We propose to consider ensembles of cycles (quadrics), which are\ninterconnected through conformal-invariant geometric relations (e.g. \"to be\northogonal\", \"to be tangent\", etc.), as new objects in an extended Moebius--Lie\ngeometry. It was recently demonstrated in several related papers, that such\nensembles of cycles naturally parameterise many other conformally-invariant\nobjects, e.g. loxodromes or continued fractions. The paper describes a method,\nwhich reduces a collection of conformally invariant geometric relations to a\nsystem of linear equations, which may be accompanied by one fixed quadratic\nrelation.\n  To show its usefulness, the method is implemented as a C++ library. It\noperates with numeric and symbolic data of cycles in spaces of arbitrary\ndimensionality and metrics with any signatures. Numeric calculations can be\ndone in exact or approximate arithmetic. In the two- and three-dimensional\ncases illustrations and animations can be produced. An interactive Python\nwrapper of the library is provided as well.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2015 17:32:30 GMT"}, {"version": "v2", "created": "Mon, 19 Feb 2018 09:09:18 GMT"}, {"version": "v3", "created": "Sun, 19 Aug 2018 20:16:48 GMT"}], "update_date": "2019-02-05", "authors_parsed": [["Kisil", "Vladimir V.", ""]]}, {"id": "1512.02963", "submitter": "L\\'aszl\\'o Kozma", "authors": "L\\'aszl\\'o Kozma, Tobias M\\\"omke", "title": "Maximum Scatter TSP in Doubling Metrics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of finding a tour of $n$ points in which every edge is\nlong. More precisely, we wish to find a tour that visits every point exactly\nonce, maximizing the length of the shortest edge in the tour. The problem is\nknown as Maximum Scatter TSP, and was introduced by Arkin et al. (SODA 1997),\nmotivated by applications in manufacturing and medical imaging. Arkin et al.\ngave a $0.5$-approximation for the metric version of the problem and showed\nthat this is the best possible ratio achievable in polynomial time (assuming $P\n\\neq NP$). Arkin et al. raised the question of whether a better approximation\nratio can be obtained in the Euclidean plane.\n  We answer this question in the affirmative in a more general setting, by\ngiving a $(1-\\epsilon)$-approximation algorithm for $d$-dimensional doubling\nmetrics, with running time $\\tilde{O}\\big(n^3 + 2^{O(K \\log K)}\\big)$, where $K\n\\leq \\left( \\frac{13}{\\epsilon} \\right)^d$. As a corollary we obtain (i) an\nefficient polynomial-time approximation scheme (EPTAS) for all constant\ndimensions $d$, (ii) a polynomial-time approximation scheme (PTAS) for\ndimension $d = \\log\\log{n}/c$, for a sufficiently large constant $c$, and (iii)\na PTAS for constant $d$ and $\\epsilon = \\Omega(1/\\log\\log{n})$. Furthermore, we\nshow the dependence on $d$ in our approximation scheme to be essentially\noptimal, unless Satisfiability can be solved in subexponential time.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2015 17:38:07 GMT"}, {"version": "v2", "created": "Tue, 28 Jun 2016 15:51:38 GMT"}], "update_date": "2016-06-29", "authors_parsed": [["Kozma", "László", ""], ["Mömke", "Tobias", ""]]}, {"id": "1512.02985", "submitter": "Sayan Bandyapadhyay", "authors": "Sayan Bandyapadhyay, Kasturi Varadarajan", "title": "On Variants of k-means Clustering", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \\textit{Clustering problems} often arise in the fields like data mining,\nmachine learning etc. to group a collection of objects into similar groups with\nrespect to a similarity (or dissimilarity) measure. Among the clustering\nproblems, specifically \\textit{$k$-means} clustering has got much attention\nfrom the researchers. Despite the fact that $k$-means is a very well studied\nproblem its status in the plane is still an open problem. In particular, it is\nunknown whether it admits a PTAS in the plane. The best known approximation\nbound in polynomial time is $9+\\eps$.\n  In this paper, we consider the following variant of $k$-means. Given a set\n$C$ of points in $\\mathcal{R}^d$ and a real $f > 0$, find a finite set $F$ of\npoints in $\\mathcal{R}^d$ that minimizes the quantity $f*|F|+\\sum_{p\\in C}\n\\min_{q \\in F} {||p-q||}^2$. For any fixed dimension $d$, we design a local\nsearch PTAS for this problem. We also give a \"bi-criterion\" local search\nalgorithm for $k$-means which uses $(1+\\eps)k$ centers and yields a solution\nwhose cost is at most $(1+\\eps)$ times the cost of an optimal $k$-means\nsolution. The algorithm runs in polynomial time for any fixed dimension.\n  The contribution of this paper is two fold. On the one hand, we are being\nable to handle the square of distances in an elegant manner, which yields near\noptimal approximation bound. This leads us towards a better understanding of\nthe $k$-means problem. On the other hand, our analysis of local search might\nalso be useful for other geometric problems. This is important considering that\nvery little is known about the local search method for geometric approximation.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2015 18:37:49 GMT"}], "update_date": "2015-12-10", "authors_parsed": [["Bandyapadhyay", "Sayan", ""], ["Varadarajan", "Kasturi", ""]]}, {"id": "1512.03012", "submitter": "Manolis Savva", "authors": "Angel X. Chang, Thomas Funkhouser, Leonidas Guibas, Pat Hanrahan,\n  Qixing Huang, Zimo Li, Silvio Savarese, Manolis Savva, Shuran Song, Hao Su,\n  Jianxiong Xiao, Li Yi, and Fisher Yu", "title": "ShapeNet: An Information-Rich 3D Model Repository", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR cs.AI cs.CG cs.CV cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present ShapeNet: a richly-annotated, large-scale repository of shapes\nrepresented by 3D CAD models of objects. ShapeNet contains 3D models from a\nmultitude of semantic categories and organizes them under the WordNet taxonomy.\nIt is a collection of datasets providing many semantic annotations for each 3D\nmodel such as consistent rigid alignments, parts and bilateral symmetry planes,\nphysical sizes, keywords, as well as other planned annotations. Annotations are\nmade available through a public web-based interface to enable data\nvisualization of object attributes, promote data-driven geometric analysis, and\nprovide a large-scale quantitative benchmark for research in computer graphics\nand vision. At the time of this technical report, ShapeNet has indexed more\nthan 3,000,000 models, 220,000 models out of which are classified into 3,135\ncategories (WordNet synsets). In this report we describe the ShapeNet effort as\na whole, provide details for all currently available datasets, and summarize\nfuture plans.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2015 19:42:48 GMT"}], "update_date": "2015-12-10", "authors_parsed": [["Chang", "Angel X.", ""], ["Funkhouser", "Thomas", ""], ["Guibas", "Leonidas", ""], ["Hanrahan", "Pat", ""], ["Huang", "Qixing", ""], ["Li", "Zimo", ""], ["Savarese", "Silvio", ""], ["Savva", "Manolis", ""], ["Song", "Shuran", ""], ["Su", "Hao", ""], ["Xiao", "Jianxiong", ""], ["Yi", "Li", ""], ["Yu", "Fisher", ""]]}, {"id": "1512.03236", "submitter": "Jean Cardinal", "authors": "Jean Cardinal, Michael S. Payne and Noam Solomon", "title": "Ramsey-type theorems for lines in 3-space", "comments": "18 pages including appendix", "journal-ref": "Discrete Mathematics & Theoretical Computer Science, Vol. 18 no.\n  3, Combinatorics (September 19, 2016) dmtcs:2036", "doi": null, "report-no": null, "categories": "math.CO cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove geometric Ramsey-type statements on collections of lines in 3-space.\nThese statements give guarantees on the size of a clique or an independent set\nin (hyper)graphs induced by incidence relations between lines, points, and\nreguli in 3-space. Among other things, we prove that: (1) The intersection\ngraph of n lines in R^3 has a clique or independent set of size Omega(n^{1/3}).\n(2) Every set of n lines in R^3 has a subset of n^{1/2} lines that are all\nstabbed by one line, or a subset of Omega((n/log n)^{1/5}) such that no\n6-subset is stabbed by one line. (3) Every set of n lines in general position\nin R^3 has a subset of Omega(n^{2/3}) lines that all lie on a regulus, or a\nsubset of Omega(n^{1/3}) lines such that no 4-subset is contained in a regulus.\nThe proofs of these statements all follow from geometric incidence bounds --\nsuch as the Guth-Katz bound on point-line incidences in R^3 -- combined with\nTur\\'an-type results on independent sets in sparse graphs and hypergraphs.\nAlthough similar Ramsey-type statements can be proved using existing generic\nalgebraic frameworks, the lower bounds we get are much larger than what can be\nobtained with these methods. The proofs directly yield polynomial-time\nalgorithms for finding subsets of the claimed size.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 12:55:00 GMT"}, {"version": "v2", "created": "Thu, 15 Sep 2016 06:18:32 GMT"}], "update_date": "2017-02-08", "authors_parsed": [["Cardinal", "Jean", ""], ["Payne", "Michael S.", ""], ["Solomon", "Noam", ""]]}, {"id": "1512.03359", "submitter": "Christian Scheffer", "authors": "Anil Maheshwari and J\\\"org-R\\\"udiger Sack and Christian Scheffer", "title": "Approximating the Integral Fr\\'echet Distance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A pseudo-polynomial time $(1 + \\varepsilon)$-approximation algorithm is\npresented for computing the integral and average Fr\\'{e}chet distance between\ntwo given polygonal curves $T_1$ and $T_2$. In particular, the running time is\nupper-bounded by $\\mathcal{O}( \\zeta^{4}n^4/\\varepsilon^{2})$ where $n$ is the\ncomplexity of $T_1$ and $T_2$ and $\\zeta$ is the maximal ratio of the lengths\nof any pair of segments from $T_1$ and $T_2$. The Fr\\'{e}chet distance captures\nthe minimal cost of a continuous deformation of $T_1$ into $T_2$ and vice versa\nand defines the cost of a deformation as the maximal distance between two\npoints that are related. The integral Fr\\'{e}chet distance defines the cost of\na deformation as the integral of the distances between points that are related.\nThe average Fr\\'{e}chet distance is defined as the integral Fr\\'{e}chet\ndistance divided by the lengths of $T_1$ and $T_2$.\n  Furthermore, we give relations between weighted shortest paths inside a\nsingle parameter cell $C$ and the monotone free space axis of $C$. As a result\nwe present a simple construction of weighted shortest paths inside a parameter\ncell. Additionally, such a shortest path provides an optimal solution for the\npartial Fr\\'{e}chet similarity of segments for all leash lengths. These two\naspects are related to each other and are of independent interest.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 18:31:14 GMT"}], "update_date": "2015-12-11", "authors_parsed": [["Maheshwari", "Anil", ""], ["Sack", "Jörg-Rüdiger", ""], ["Scheffer", "Christian", ""]]}, {"id": "1512.03589", "submitter": "Guillermo Diez-Canas", "authors": "Guillermo D. Canas, Steven J. Gortler", "title": "On the Embeddability of Delaunay Triangulations in Anisotropic, Normed,\n  and Bregman Spaces", "comments": "40 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a two-dimensional space endowed with a divergence function that is\nconvex in the first argument, continuously differentiable in the second, and\nsatisfies suitable regularity conditions at Voronoi vertices, we show that\norphan-freedom (the absence of disconnected Voronoi regions) is sufficient to\nensure that Voronoi edges and vertices are also connected, and that the dual is\na simple planar graph. We then prove that the straight-edge dual of an\norphan-free Voronoi diagram (with sites as the first argument of the\ndivergence) is always an embedded triangulation.\n  Among the divergences covered by our proofs are Bregman divergences,\nanisotropic divergences, as well as all distances derived from strictly convex\n$\\mathcal{C}^1$ norms (including the $L_p$ norms with $1< p < \\infty$). While\nBregman diagrams of the {first kind} are simply affine diagrams, and their\nduals ({weighted} Delaunay triangulations) are always embedded, we show that\nduals of orphan-free Bregman diagrams of the \\emph{second kind} are always\nembedded.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2015 10:46:23 GMT"}, {"version": "v2", "created": "Sat, 9 Jan 2016 19:00:08 GMT"}], "update_date": "2016-01-12", "authors_parsed": [["Canas", "Guillermo D.", ""], ["Gortler", "Steven J.", ""]]}, {"id": "1512.03794", "submitter": "Joel Haddley PhD", "authors": "Joel Haddley, Stephen Worsley", "title": "Infinite families of monohedral disk tilings", "comments": "This is a new version which defines the notation of a radially\n  generated tiling and classifies such tilings", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.MG cs.CG math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper gives new solutions to the problem: 'Can we construct monohedral\ntilings of the disk such that a neighbourhood of the origin has trivial\nintersection with at least one tile?'\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2015 15:35:43 GMT"}, {"version": "v2", "created": "Thu, 28 Apr 2016 12:28:15 GMT"}], "update_date": "2016-04-29", "authors_parsed": [["Haddley", "Joel", ""], ["Worsley", "Stephen", ""]]}, {"id": "1512.03897", "submitter": "Kai Jin", "authors": "Kai Jin", "title": "A Geometric Structure Associated with the Convex Polygon", "comments": "50 pages, 39 figures, 1 beautiful structure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a geometric structure induced by any given convex polygon $P$,\ncalled $Nest(P)$, which is an arrangement of $\\Theta(n^2)$ line segments, each\nof which is parallel to an edge of $P$, where $n$ denotes the number of edges\nof $P$. We then deduce six nontrivial properties of $Nest(P)$ from the\nconvexity of $P$ and the parallelism of the line segments in $Nest(P)$. Among\nothers, we show that $Nest(P)$ is a subdivision of the exterior of $P$, and its\ninner boundary interleaves the boundary of $P$. They manifest that $Nest(P)$\nhas a surprisingly good interaction with the boundary of $P$. Furthermore, we\nstudy some computational problems on $Nest(P)$. In particular, we consider\nthree kinds of location queries on $Nest(P)$ and answer each of them in\n(amortized) $O(\\log^2n)$ time. Our algorithm for answering these queries avoids\nan explicit construction of $Nest(P)$, which would take $\\Omega(n^2)$ time.\n  By applying the aforementioned six properties altogether, we find that the\ngeometric optimization problem of finding the maximum area parallelogram(s) in\n$P$ can be reduced to answering $O(n)$ aforementioned location queries, and\nthus be solved in $O(n\\log^2n)$ time. This application will be reported in a\nsubsequent paper.\n", "versions": [{"version": "v1", "created": "Sat, 12 Dec 2015 09:31:22 GMT"}, {"version": "v10", "created": "Fri, 30 Nov 2018 09:19:21 GMT"}, {"version": "v11", "created": "Thu, 11 Jul 2019 04:46:42 GMT"}, {"version": "v2", "created": "Fri, 8 Apr 2016 02:36:35 GMT"}, {"version": "v3", "created": "Thu, 8 Dec 2016 08:15:34 GMT"}, {"version": "v4", "created": "Mon, 3 Apr 2017 12:19:31 GMT"}, {"version": "v5", "created": "Tue, 4 Apr 2017 07:02:06 GMT"}, {"version": "v6", "created": "Wed, 5 Apr 2017 11:52:59 GMT"}, {"version": "v7", "created": "Fri, 3 Nov 2017 09:28:51 GMT"}, {"version": "v8", "created": "Mon, 9 Apr 2018 10:46:32 GMT"}, {"version": "v9", "created": "Thu, 26 Jul 2018 11:42:39 GMT"}], "update_date": "2019-07-12", "authors_parsed": [["Jin", "Kai", ""]]}, {"id": "1512.04108", "submitter": "Elizabeth Munch", "authors": "Elizabeth Munch and Bei Wang", "title": "Convergence between Categorical Representations of Reeb Space and Mapper", "comments": null, "journal-ref": null, "doi": "10.4230/LIPIcs.SoCG.2016.53", "report-no": null, "categories": "cs.CG math.AT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Reeb space, which generalizes the notion of a Reeb graph, is one of the\nfew tools in topological data analysis and visualization suitable for the study\nof multivariate scientific datasets. First introduced by Edelsbrunner et al.,\nit compresses the components of the level sets of a multivariate mapping and\nobtains a summary representation of their relationships. A related construction\ncalled mapper, and a special case of the mapper construction called the Joint\nContour Net have been shown to be effective in visual analytics. Mapper and JCN\nare intuitively regarded as discrete approximations of the Reeb space, however\nwithout formal proofs or approximation guarantees. An open question has been\nproposed by Dey et al. as to whether the mapper construction converges to the\nReeb space in the limit.\n  In this paper, we are interested in developing the theoretical understanding\nof the relationship between the Reeb space and its discrete approximations to\nsupport its use in practical data analysis. Using tools from category theory,\nwe formally prove the convergence between the Reeb space and mapper in terms of\nan interleaving distance between their categorical representations. Given a\nsequence of refined discretizations, we prove that these approximations\nconverge to the Reeb space in the interleaving distance; this also helps to\nquantify the approximation quality of the discretization at a fixed resolution.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2015 19:25:37 GMT"}, {"version": "v2", "created": "Tue, 12 Apr 2016 17:51:01 GMT"}], "update_date": "2018-11-30", "authors_parsed": [["Munch", "Elizabeth", ""], ["Wang", "Bei", ""]]}, {"id": "1512.04226", "submitter": "Kenneth Clarkson", "authors": "Kenneth L. Clarkson and Bernd G\\\"artner and Johannes Lengler and May\n  Szedlak", "title": "Random Sampling with Removal", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study randomized algorithms for constrained optimization, in abstract\nframeworks that include, in strictly increasing generality: convex programming;\nLP-type problems; violator spaces; and a setting we introduce, consistent\nspaces. Such algorithms typically involve a step of finding the optimal\nsolution for a random sample of the constraints. They exploit the condition\nthat, in finite dimension $\\delta$, this sample optimum violates a provably\nsmall expected fraction of the non-sampled constraints, with the fraction\ndecreasing in the sample size~$r$. We extend such algorithms by considering the\ntechnique of removal, where a fixed number $k$ of constraints are removed from\nthe sample according to a fixed rule, with the goal of improving the solution\nquality. This may have the effect of increasing the number of violated\nnon-sampled constraints. We study this increase, and bound it in a variety of\ngeneral settings. This work is motivated by, and extends, results on removal as\nproposed for chance-constrained optimization.\n  For many relevant values of $r$, $\\delta$, and $k$, we prove matching upper\nand lower bounds for the expected number of constraints violated by a random\nsample, after the removal of $k$ constraints. For a large range of values of\n$k$, the new upper bounds improve the previously best bounds for LP-type\nproblems, which moreover had only been known in special cases, and not in the\ngenerality we consider. Moreover, we show that our results extend from finite\nto infinite spaces, for chance-constrained optimization.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2015 09:28:45 GMT"}, {"version": "v2", "created": "Thu, 11 Feb 2016 14:17:35 GMT"}, {"version": "v3", "created": "Fri, 31 May 2019 22:38:46 GMT"}], "update_date": "2019-06-04", "authors_parsed": [["Clarkson", "Kenneth L.", ""], ["Gärtner", "Bernd", ""], ["Lengler", "Johannes", ""], ["Szedlak", "May", ""]]}, {"id": "1512.04303", "submitter": "Marcio Oshiro", "authors": "Cristina G. Fernandes and Marcio T. I. Oshiro", "title": "Kinetic Clustering of Points on the Line", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of clustering a set of points moving on the line consists of the\nfollowing: given positive integers n and k, the initial position and the\nvelocity of n points, find an optimal k-clustering of the points. We consider\ntwo classical quality measures for the clustering: minimizing the sum of the\nclusters diameters and minimizing the maximum diameter of a cluster. For the\nformer, we present polynomial-time algorithms under some assumptions and, for\nthe latter, a (2.71 + epsilon)-approximation.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2015 13:28:47 GMT"}], "update_date": "2015-12-23", "authors_parsed": [["Fernandes", "Cristina G.", ""], ["Oshiro", "Marcio T. I.", ""]]}, {"id": "1512.04349", "submitter": "Amer Krivo\\v{s}ija", "authors": "Anne Driemel and Amer Krivo\\v{s}ija and Christian Sohler", "title": "Clustering time series under the Fr\\'echet distance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Fr\\'echet distance is a popular distance measure for curves. We study the\nproblem of clustering time series under the Fr\\'echet distance. In particular,\nwe give $(1+\\varepsilon)$-approximation algorithms for variations of the\nfollowing problem with parameters $k$ and $\\ell$. Given $n$ univariate time\nseries $P$, each of complexity at most $m$, we find $k$ time series, not\nnecessarily from $P$, which we call \\emph{cluster centers} and which each have\ncomplexity at most $\\ell$, such that (a) the maximum distance of an element of\n$P$ to its nearest cluster center or (b) the sum of these distances is\nminimized. Our algorithms have running time near-linear in the input size for\nconstant $\\varepsilon$, $k$ and $\\ell$. To the best of our knowledge, our\nalgorithms are the first clustering algorithms for the Fr\\'echet distance which\nachieve an approximation factor of $(1+\\varepsilon)$ or better.\n  Keywords: time series, longitudinal data, functional data, clustering,\nFr\\'echet distance, dynamic time warping, approximation algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2015 14:56:37 GMT"}], "update_date": "2015-12-15", "authors_parsed": [["Driemel", "Anne", ""], ["Krivošija", "Amer", ""], ["Sohler", "Christian", ""]]}, {"id": "1512.04388", "submitter": "Mitra Fatemi", "authors": "Mitra Fatemi, Arash Amini, and Martin Vetterli", "title": "Sampling and Reconstruction of Shapes with Algebraic Boundaries", "comments": "12 pages, 14 figures", "journal-ref": null, "doi": "10.1109/TSP.2016.2591505", "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a sampling theory for a class of binary images with finite rate of\ninnovation (FRI). Every image in our model is the restriction of\n$\\mathds{1}_{\\{p\\leq0\\}}$ to the image plane, where $\\mathds{1}$ denotes the\nindicator function and $p$ is some real bivariate polynomial. This particularly\nmeans that the boundaries in the image form a subset of an algebraic curve with\nthe implicit polynomial $p$. We show that the image parameters --i.e., the\npolynomial coefficients-- satisfy a set of linear annihilation equations with\nthe coefficients being the image moments. The inherent sensitivity of the\nmoments to noise makes the reconstruction process numerically unstable and\nnarrows the choice of the sampling kernels to polynomial reproducing kernels.\nAs a remedy to these problems, we replace conventional moments with more stable\n\\emph{generalized moments} that are adjusted to the given sampling kernel. The\nbenefits are threefold: (1) it relaxes the requirements on the sampling\nkernels, (2) produces annihilation equations that are robust at numerical\nprecision, and (3) extends the results to images with unbounded boundaries. We\nfurther reduce the sensitivity of the reconstruction process to noise by taking\ninto account the sign of the polynomial at certain points, and sequentially\nenforcing measurement consistency. We consider various numerical experiments to\ndemonstrate the performance of our algorithm in reconstructing binary images,\nincluding low to moderate noise levels and a range of realistic sampling\nkernels.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2015 16:20:56 GMT"}], "update_date": "2016-11-03", "authors_parsed": [["Fatemi", "Mitra", ""], ["Amini", "Arash", ""], ["Vetterli", "Martin", ""]]}, {"id": "1512.04648", "submitter": "Cl\\'ement Maria", "authors": "Cl\\'ement Maria, Jonathan Spreer", "title": "Admissible colourings of 3-manifold triangulations for Turaev-Viro type\n  invariants", "comments": "26 pages, 10 figures, 5 tables", "journal-ref": "24th Annual European Symposium on Algorithms (ESA 2016), Leibniz\n  International Proceedings in Informatics (LIPIcs), vol. 57, 64:1-64:16, 2016", "doi": "10.4230/LIPIcs.ESA.2016.64", "report-no": null, "categories": "cs.CG math.CO math.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Turaev Viro invariants are amongst the most powerful tools to distinguish\n3-manifolds: They are implemented in mathematical software, and allow practical\ncomputations. The invariants can be computed purely combinatorially by\nenumerating colourings on the edges of a triangulation T.\n  These edge colourings can be interpreted as embeddings of surfaces in T. We\ngive a characterisation of how these embedded surfaces intersect with the\ntetrahedra of T. This is done by characterising isotopy classes of simple\nclosed loops in the 3-punctured disk. As a direct result we obtain a new system\nof coordinates for edge colourings which allows for simpler definitions of the\ntetrahedron weights incorporated in the Turaev-Viro invariants.\n  Moreover, building on a detailed analysis of the colourings, as well as\nclassical work due to Kirby and Melvin, Matveev, and others, we show that\nconsidering a much smaller set of colourings suffices to compute Turaev-Viro\ninvariants in certain significant cases. This results in a substantial\nimprovement of running times to compute the invariants, reducing the number of\ncolourings to consider by a factor of $2^n$. In addition, we present an\nalgorithm to compute Turaev-Viro invariants of degree four -- a problem known\nto be #P-hard -- which capitalises on the combinatorial structure of the input.\n  The improved algorithms are shown to be optimal in the following sense: There\nexist triangulations admitting all colourings the algorithms consider.\nFurthermore, we demonstrate that our new algorithms to compute Turaev-Viro\ninvariants are able to distinguish the majority of $\\mathbb{Z}$-homology\nspheres with complexity up to $11$ in $O(2^n)$ operations in $\\mathbb{Q}$.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2015 04:44:44 GMT"}], "update_date": "2018-10-24", "authors_parsed": [["Maria", "Clément", ""], ["Spreer", "Jonathan", ""]]}, {"id": "1512.04856", "submitter": "Yannik Stein", "authors": "Peyman Afshani, Donald R. Sheehy, Yannik Stein", "title": "Approximating the Simplicial Depth", "comments": "25 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $P$ be a set of $n$ points in $d$-dimensions. The simplicial depth,\n$\\sigma_P(q)$ of a point $q$ is the number of $d$-simplices with vertices in\n$P$ that contain $q$ in their convex hulls. The simplicial depth is a notion of\ndata depth with many applications in robust statistics and computational\ngeometry. Computing the simplicial depth of a point is known to be a\nchallenging problem. The trivial solution requires $O(n^{d+1})$ time whereas it\nis generally believed that one cannot do better than $O(n^{d-1})$. In this\npaper, we consider approximation algorithms for computing the simplicial depth\nof a point. For $d=2$, we present a new data structure that can approximate the\nsimplicial depth in polylogarithmic time, using polylogarithmic query time. In\n3D, we can approximate the simplicial depth of a given point in near-linear\ntime, which is clearly optimal up to polylogarithmic factors. For higher\ndimensions, we consider two approximation algorithms with different worst-case\nscenarios. By combining these approaches, we compute a\n$(1+\\varepsilon)$-approximation of the simplicial depth in time\n$\\tilde{O}(n^{d/2 + 1})$ ignoring polylogarithmic factor. All of these\nalgorithms are Monte Carlo algorithms. Furthermore, we present a simple\nstrategy to compute the simplicial depth exactly in $O(n^d \\log n)$ time, which\nprovides the first improvement over the trivial $O(n^{d+1})$ time algorithm for\n$d>4$. Finally, we show that computing the simplicial depth exactly is\n#P-complete and W[1]-hard if the dimension is part of the input.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2015 17:00:49 GMT"}, {"version": "v2", "created": "Sun, 27 Dec 2015 10:40:20 GMT"}], "update_date": "2015-12-29", "authors_parsed": [["Afshani", "Peyman", ""], ["Sheehy", "Donald R.", ""], ["Stein", "Yannik", ""]]}, {"id": "1512.04866", "submitter": "Michael Bekos", "authors": "Michael A. Bekos, Michael Kaufmann and Robert Krug", "title": "On the Total Number of Bends for Planar Octilinear Drawings", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An octilinear drawing of a planar graph is one in which each edge is drawn as\na sequence of horizontal, vertical and diagonal at 45 degrees line-segments.\nFor such drawings to be readable, special care is needed in order to keep the\nnumber of bends small. As the problem of finding planar octilinear drawings of\nminimum number of bends is NP-hard, in this paper we focus on upper and lower\nbounds. From a recent result of Keszegh et al. on the slope number of planar\ngraphs, we can derive an upper bound of 4n-10 bends for 8-planar graphs with n\nvertices. We considerably improve this general bound and corresponding previous\nones for triconnected 4-, 5- and 6-planar graphs. We also derive non-trivial\nlower bounds for these three classes of graphs by a technique inspired by the\nnetwork flow formulation of Tamassia.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2015 17:23:50 GMT"}], "update_date": "2015-12-16", "authors_parsed": [["Bekos", "Michael A.", ""], ["Kaufmann", "Michael", ""], ["Krug", "Robert", ""]]}, {"id": "1512.05152", "submitter": "Salman Parsa", "authors": "Salman Parsa", "title": "Small Model $2$-Complexes in $4$-space and Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS math.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider computational complexity of problems related to the fundamental\ngroup and the first homology group of (embeddable) $2$-complexes. We show, as\nan extension of an earlier work, that computing first homology of $2$-complexes\nis equivalent in computational complexity to matrix diagonalization. That is,\nthe usual procedures for computing homology cannot be improved other than by\nmatrix methods. This is true even if the complex is in the euclidean $4$-space.\nFor this purpose, we use $2$-complexes built in a standard way from group\npresentations, called model $2$-complexes. Model complexes have fundamental\ngroup isomorphic with the group defined by the presentation. We show that there\nare model complexes of size in the order of the bit-complexity of the\npresentation that can be realized linearly in $4$-space. We further derive some\napplications of this result regarding embeddability problems in the euclidean\n$4$-space.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2015 12:48:59 GMT"}, {"version": "v2", "created": "Fri, 8 Apr 2016 11:37:16 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Parsa", "Salman", ""]]}, {"id": "1512.05164", "submitter": "Salman Parsa", "authors": "Salman Parsa", "title": "On links of vertices in simplicial $d$-complexes embeddable in the\n  euclidean $2d$-space", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider $d$-dimensional simplicial complexes which can be PL embedded in\nthe $2d$-dimensional euclidean space. In short, we show that in any such\ncomplex, for any three vertices, the intersection of the link-complexes of the\nvertices is linklessly embeddable in the $(2d-1)$-dimensional euclidean space.\nThese considerations lead us to a new upper bound on the total number of\n$d$-simplices in an embeddable complex in $2d$-space with $n$ vertices,\nimproving known upper bounds, for all $d \\geq 2$. Moreover, the bound is also\ntrue for the size of $d$-complexes linklessly embeddable in the\n$(2d+1)$-dimensional space.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2015 13:08:21 GMT"}, {"version": "v2", "created": "Sun, 14 Feb 2016 12:41:01 GMT"}, {"version": "v3", "created": "Thu, 3 Mar 2016 13:03:40 GMT"}, {"version": "v4", "created": "Thu, 23 Jun 2016 12:27:52 GMT"}, {"version": "v5", "created": "Tue, 11 Sep 2018 05:34:42 GMT"}, {"version": "v6", "created": "Sun, 16 Dec 2018 08:53:01 GMT"}, {"version": "v7", "created": "Tue, 21 Jan 2020 20:44:53 GMT"}, {"version": "v8", "created": "Fri, 24 Jan 2020 21:03:05 GMT"}], "update_date": "2020-01-28", "authors_parsed": [["Parsa", "Salman", ""]]}, {"id": "1512.05279", "submitter": "Omer Gold", "authors": "Omer Gold and Micha Sharir", "title": "Improved Bounds for 3SUM, $k$-SUM, and Linear Degeneracy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set of $n$ real numbers, the 3SUM problem is to decide whether there\nare three of them that sum to zero. Until a recent breakthrough by Gr{\\o}nlund\nand Pettie [FOCS'14], a simple $\\Theta(n^2)$-time deterministic algorithm for\nthis problem was conjectured to be optimal. Over the years many algorithmic\nproblems have been shown to be reducible from the 3SUM problem or its variants,\nincluding the more generalized forms of the problem, such as $k$-SUM and\n$k$-variate linear degeneracy testing ($k$-LDT). The conjectured hardness of\nthese problems have become extremely popular for basing conditional lower\nbounds for numerous algorithmic problems in P.\n  In this paper, we show that the randomized $4$-linear decision tree\ncomplexity of 3SUM is $O(n^{3/2})$, and that the randomized $(2k-2)$-linear\ndecision tree complexity of $k$-SUM and $k$-LDT is $O(n^{k/2})$, for any odd\n$k\\ge 3$. These bounds improve (albeit randomized) the corresponding\n$O(n^{3/2}\\sqrt{\\log n})$ and $O(n^{k/2}\\sqrt{\\log n})$ decision tree bounds\nobtained by Gr{\\o}nlund and Pettie. Our technique includes a specialized\nrandomized variant of fractional cascading data structure. Additionally, we\ngive another deterministic algorithm for 3SUM that runs in $O(n^2 \\log\\log n /\n\\log n )$ time. The latter bound matches a recent independent bound by Freund\n[Algorithmica 2017], but our algorithm is somewhat simpler, due to a better use\nof word-RAM model.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2015 18:55:23 GMT"}, {"version": "v2", "created": "Sun, 5 Mar 2017 00:12:44 GMT"}], "update_date": "2017-03-07", "authors_parsed": [["Gold", "Omer", ""], ["Sharir", "Micha", ""]]}, {"id": "1512.05648", "submitter": "Joshua Zahl", "authors": "Larry Guth and Joshua Zahl", "title": "Curves in $\\mathbb{R}^4$ and two-rich points", "comments": "20 pages, 0 figures. v2: fixed an error in Section 5.2", "journal-ref": "Discrete. Comput. Geom. 58: 232--253, 2017", "doi": "10.1007/s00454-016-9833-z", "report-no": null, "categories": "math.CO cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We obtain a new bound on the number of two-rich points spanned by an\narrangement of low degree algebraic curves in $\\mathbb{R}^4$. Specifically, we\nshow that an arrangement of $n$ algebraic curves determines at most $C_\\epsilon\nn^{4/3+3\\epsilon}$ two-rich points, provided at most $n^{2/3+2\\epsilon}$ curves\nlie in any low degree hypersurface and at most $n^{1/3+\\epsilon}$ curves lie in\nany low degree surface. This result follows from a structure theorem about\narrangements of curves that determine many two-rich points.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2015 16:01:19 GMT"}, {"version": "v2", "created": "Wed, 17 Jan 2018 19:58:43 GMT"}], "update_date": "2018-01-19", "authors_parsed": [["Guth", "Larry", ""], ["Zahl", "Joshua", ""]]}, {"id": "1512.06112", "submitter": "Bartosz Walczak", "authors": "Alexandre Rok, Bartosz Walczak", "title": "Coloring curves that cross a fixed curve", "comments": "Small corrections, improved presentation", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that for every integer $t\\geq 1$, the class of intersection graphs\nof curves in the plane each of which crosses a fixed curve in at least one and\nat most $t$ points is $\\chi$-bounded. This is essentially the strongest\n$\\chi$-boundedness result one can get for this kind of graph classes. As a\ncorollary, we prove that for any fixed integers $k\\geq 2$ and $t\\geq 1$, every\n$k$-quasi-planar topological graph on $n$ vertices with any two edges crossing\nat most $t$ times has $O(n\\log n)$ edges.\n", "versions": [{"version": "v1", "created": "Fri, 18 Dec 2015 20:53:12 GMT"}, {"version": "v2", "created": "Wed, 9 Mar 2016 20:56:39 GMT"}, {"version": "v3", "created": "Thu, 4 Aug 2016 22:26:54 GMT"}, {"version": "v4", "created": "Mon, 12 Dec 2016 17:57:44 GMT"}, {"version": "v5", "created": "Wed, 4 Oct 2017 15:48:11 GMT"}], "update_date": "2017-10-05", "authors_parsed": [["Rok", "Alexandre", ""], ["Walczak", "Bartosz", ""]]}, {"id": "1512.06649", "submitter": "Nicolas Catusse", "authors": "Hadrien Cambazard, Nicolas Catusse", "title": "Fixed-Parameter Algorithms for Rectilinear Steiner tree and Rectilinear\n  Traveling Salesman Problem in the plane", "comments": "24 pages, 13 figures, 6 tables", "journal-ref": "European Journal of Operational Research, Volume 270, Issue 2,\n  2018, Pages 419-429, ISSN 0377-2217", "doi": "10.1016/j.ejor.2018.03.042", "report-no": null, "categories": "cs.DS cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set $P$ of $n$ points with their pairwise distances, the traveling\nsalesman problem (TSP) asks for a shortest tour that visits each point exactly\nonce. A TSP instance is rectilinear when the points lie in the plane and the\ndistance considered between two points is the $l_1$ distance. In this paper, a\nfixed-parameter algorithm for the Rectilinear TSP is presented and relies on\ntechniques for solving TSP on bounded-treewidth graphs. It proves that the\nproblem can be solved in $O\\left(nh7^h\\right)$ where $h \\leq n$ denotes the\nnumber of horizontal lines containing the points of $P$. The same technique can\nbe directly applied to the problem of finding a shortest rectilinear Steiner\ntree that interconnects the points of $P$ providing a $O\\left(nh5^h\\right)$\ntime complexity. Both bounds improve over the best time bounds known for these\nproblems.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2015 14:38:29 GMT"}, {"version": "v2", "created": "Tue, 15 Nov 2016 20:21:28 GMT"}, {"version": "v3", "created": "Thu, 23 Feb 2017 21:54:39 GMT"}, {"version": "v4", "created": "Tue, 23 Jul 2019 07:14:46 GMT"}], "update_date": "2019-07-24", "authors_parsed": [["Cambazard", "Hadrien", ""], ["Catusse", "Nicolas", ""]]}, {"id": "1512.06678", "submitter": "Aur\\'elien Ooms", "authors": "Jean Cardinal and John Iacono and Aur\\'elien Ooms", "title": "Solving $k$-SUM using few linear queries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The $k$-SUM problem is given $n$ input real numbers to determine whether any\n$k$ of them sum to zero. The problem is of tremendous importance in the\nemerging field of complexity theory within $P$, and it is in particular open\nwhether it admits an algorithm of complexity $O(n^c)$ with $c<\\lceil\n\\frac{k}{2} \\rceil$. Inspired by an algorithm due to Meiser (1993), we show\nthat there exist linear decision trees and algebraic computation trees of depth\n$O(n^3\\log^3 n)$ solving $k$-SUM. Furthermore, we show that there exists a\nrandomized algorithm that runs in $\\tilde{O}(n^{\\lceil \\frac{k}{2} \\rceil+8})$\ntime, and performs $O(n^3\\log^3 n)$ linear queries on the input. Thus, we show\nthat it is possible to have an algorithm with a runtime almost identical (up to\nthe $+8$) to the best known algorithm but for the first time also with the\nnumber of queries on the input a polynomial that is independent of $k$. The\n$O(n^3\\log^3 n)$ bound on the number of linear queries is also a tighter bound\nthan any known algorithm solving $k$-SUM, even allowing unlimited total time\noutside of the queries. By simultaneously achieving few queries to the input\nwithout significantly sacrificing runtime vis-\\`{a}-vis known algorithms, we\ndeepen the understanding of this canonical problem which is a cornerstone of\ncomplexity-within-$P$.\n  We also consider a range of tradeoffs between the number of terms involved in\nthe queries and the depth of the decision tree. In particular, we prove that\nthere exist $o(n)$-linear decision trees of depth $o(n^4)$.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2015 16:07:35 GMT"}, {"version": "v2", "created": "Thu, 18 Feb 2016 10:57:33 GMT"}], "update_date": "2016-02-19", "authors_parsed": [["Cardinal", "Jean", ""], ["Iacono", "John", ""], ["Ooms", "Aurélien", ""]]}, {"id": "1512.06706", "submitter": "Pasin Manurangsi", "authors": "Jeffrey Bosboom, Erik D. Demaine, Martin L. Demaine, Jayson Lynch,\n  Pasin Manurangsi, Mikhail Rudoy, Anak Yodpinyanee", "title": "Dissection with the Fewest Pieces is Hard, Even to Approximate", "comments": "18 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that it is NP-hard to dissect one simple orthogonal polygon into\nanother using a given number of pieces, as is approximating the fewest pieces\nto within a factor of $1+1/1080-\\varepsilon$.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2015 17:06:29 GMT"}], "update_date": "2015-12-22", "authors_parsed": [["Bosboom", "Jeffrey", ""], ["Demaine", "Erik D.", ""], ["Demaine", "Martin L.", ""], ["Lynch", "Jayson", ""], ["Manurangsi", "Pasin", ""], ["Rudoy", "Mikhail", ""], ["Yodpinyanee", "Anak", ""]]}, {"id": "1512.07160", "submitter": "Haitao Wang", "authors": "Sang Won Bae, Matias Korman, Joseph S.B. Mitchell, Yoshio Okamoto,\n  Valentin Polishchuk, and Haitao Wang", "title": "Computing the $L_1$ Geodesic Diameter and Center of a Polygonal Domain", "comments": "Made a few cosmetic changes over the previous version; this version\n  to appear in Discrete & Computational Geometry", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a polygonal domain with $h$ holes and a total of $n$ vertices, we present\nalgorithms that compute the $L_1$ geodesic diameter in $O(n^2+h^4)$ time and\nthe $L_1$ geodesic center in $O((n^4+n^2 h^4)\\alpha(n))$ time, respectively,\nwhere $\\alpha(\\cdot)$ denotes the inverse Ackermann function. No algorithms\nwere known for these problems before. For the Euclidean counterpart, the best\nalgorithms compute the geodesic diameter in $O(n^{7.73})$ or $O(n^7(h+\\log n))$\ntime, and compute the geodesic center in $O(n^{11}\\log n)$ time. Therefore, our\nalgorithms are significantly faster than the algorithms for the Euclidean\nproblems. Our algorithms are based on several interesting observations on $L_1$\nshortest paths in polygonal domains.\n", "versions": [{"version": "v1", "created": "Tue, 22 Dec 2015 17:09:20 GMT"}, {"version": "v2", "created": "Wed, 9 Nov 2016 22:29:48 GMT"}], "update_date": "2016-11-11", "authors_parsed": [["Bae", "Sang Won", ""], ["Korman", "Matias", ""], ["Mitchell", "Joseph S. B.", ""], ["Okamoto", "Yoshio", ""], ["Polishchuk", "Valentin", ""], ["Wang", "Haitao", ""]]}, {"id": "1512.07533", "submitter": "Tsunehiko Kameda", "authors": "Binay Bhattacharya, Sandip Das, Yuya Higashikawa, Tsunehiko Kameda,\n  Naoki Katoh", "title": "Geometric k-Center Problems with Centers Constrained to Two Lines", "comments": "12 pages, 5 figures, JCDCGG2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the $k$-center problem in which the centers are constrained to\nlie on two lines. Given a set of $n$ weighted points in the plane, we want to\nlocate up to $k$ centers on two parallel lines. We present an $O(n\\log^2 n)$\ntime algorithm, which minimizes the weighted distance from any point to a\ncenter. We then consider the unweighted case, where the centers are constrained\nto be on two perpendicular lines. Our algorithms run in $O(n\\log^2 n)$ time\nalso in this case.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2015 16:33:11 GMT"}, {"version": "v2", "created": "Tue, 26 Apr 2016 13:57:09 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Bhattacharya", "Binay", ""], ["Das", "Sandip", ""], ["Higashikawa", "Yuya", ""], ["Kameda", "Tsunehiko", ""], ["Katoh", "Naoki", ""]]}, {"id": "1512.07537", "submitter": "Tsunehiko Kameda", "authors": "Binay Bhattacharya, Sandip Das, Tsunehiko Kameda", "title": "Linear-Time Fitting of a $k$-Step Function", "comments": "12 pages, 4 figures, Caldam 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set of $n$ weighted points on the $x$-$y$ plane, we want to find a\nstep function consisting of $k$ horizontal steps such that the maximum vertical\nweighted distance from any point to a step is minimized. We solve this problem\nin $O(n)$ time when $k$ is a constant. Our approach relies on the\nprune-and-search technique, and can be adapted to design similar linear time\nalgorithms to solve the line-constrained k-center problem and the size-$k$\nhistogram construction problem as well.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2015 16:42:28 GMT"}, {"version": "v2", "created": "Tue, 7 Jun 2016 05:57:51 GMT"}], "update_date": "2016-06-08", "authors_parsed": [["Bhattacharya", "Binay", ""], ["Das", "Sandip", ""], ["Kameda", "Tsunehiko", ""]]}, {"id": "1512.07872", "submitter": "Carla Michini", "authors": "Alberto Del Pia and Carla Michini", "title": "On the diameter of lattice polytopes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show that the diameter of a d-dimensional lattice polytope\nin [0,k]^n is at most (k - 1/2) d. This result implies that the diameter of a\nd-dimensional half-integral polytope is at most 3/2 d. We also show that for\nhalf-integral polytopes the latter bound is tight for any d.\n", "versions": [{"version": "v1", "created": "Thu, 24 Dec 2015 17:54:21 GMT"}], "update_date": "2015-12-25", "authors_parsed": [["Del Pia", "Alberto", ""], ["Michini", "Carla", ""]]}, {"id": "1512.08292", "submitter": "Saeed Mehrabi", "authors": "Saeed Mehrabi", "title": "Guarding the Vertices of an Orthogonal Terrain using Vertex Guards", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A terrain T is an x-monotone polygonal chain in the plane; T is orthogonal if\neach edge of T is either horizontal or vertical. In this paper, we give an\nexact algorithm for the problem of guarding the convex vertices of an\northogonal terrain with the minimum number of reflex vertices.\n", "versions": [{"version": "v1", "created": "Mon, 28 Dec 2015 00:01:52 GMT"}], "update_date": "2015-12-29", "authors_parsed": [["Mehrabi", "Saeed", ""]]}, {"id": "1512.08846", "submitter": "Raymond Scaringe", "authors": "Raymond P. Scaringe", "title": "Apollonius Solutions in Rd", "comments": "30 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Voronoi and related diagrams have technological applications, for example, in\nmotion planning and surface reconstruction, and also find significant use in\nmaterials science, molecular biology, and crystallography. Apollonius diagrams\narguably provide the most natural division of space for many materials and\ntechnology problems, but compared to Voronoi and power diagrams, their use has\nbeen limited, presumably by the complexity of their calculation. In this work,\nwe report explicit equations for the vertices of the Apollonius diagram in a\nd-dimensional Euclidean space. We show that there are special lines that\ncontain vertices of more than one type of diagram and this property can be\nexploited to develop simple vertex expressions for the Apollonius diagram.\nFinding the Apollonius vertices is not significantly more difficult or\nexpensive than computing those of the power diagram and have application beyond\ntheir use in calculating the diagram. The expressions reported here lend\nthemselves to the use of standard vector and matrix libraries and the stability\nand precision their use implies. They can also be used in algorithms with\nmulti-precision numeric types and those adhering to the exact algorithms\nparadigm. The results have been coded in C++ for the 2-d and 3-d cases and an\nexample of their use in characterizing the shape of a void in a molecular\ncrystal is given.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2015 04:24:58 GMT"}], "update_date": "2015-12-31", "authors_parsed": [["Scaringe", "Raymond P.", ""]]}]