[{"id": "1505.00422", "submitter": "Rushan Ziatdinov", "authors": "Irina Erjomina, Aleksandr Rozentsvaig, Rushan Ziatdinov", "title": "Server component installation and testing of the university information\n  and educational environment on the Moodle LMS platform", "comments": "in Russian", "journal-ref": "Izvestiya Sochi State University, Vol. 34, No. 1, Apr. 2015, pp.\n  24-32", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The informational educational environment (IEE) of an institution is a\ncomplex multilevel system which, along with methodical, organizational and\ncultural resources, accumulates the intellectual and technical potential of a\nuniversity, as well as the informative and activity components of the learners\nand teachers. In practice, the formation of IEE is actually based on the\ncreation of information technologies and their integration into the existing\neducational environment of the institution. The management of this system is\ncarried out using specialized equipment and software. For the successful\nformation and operation of IEE, in the present work we review software products\nthat form the basis of the organization of interactive and web interactions\nbetween students, teachers and all participants of the educational process. We\nanalyse the technical capabilities that have provided users with IEE services\nsuch as the Apache web server with connected modules PHP, MySQL, the Java\nvirtual machine and the Red5 server. We demonstrate the possibility of\nobtaining results from the interaction of these products, and reports on users'\nwork in webinars, video conferences and web conferences.\n", "versions": [{"version": "v1", "created": "Sun, 3 May 2015 12:04:00 GMT"}], "update_date": "2015-05-05", "authors_parsed": [["Erjomina", "Irina", ""], ["Rozentsvaig", "Aleksandr", ""], ["Ziatdinov", "Rushan", ""]]}, {"id": "1505.01056", "submitter": "Zhihan Lv", "authors": "Xiaoming Li, Zhihan Lv, Weixi Wang, Chen Wu, Jinxing Hu", "title": "Preprint Virtual Reality GIS and Cloud Service Based Traffic Analysis\n  Platform", "comments": "This is the preprint version of our paper on The 23rd International\n  Conference on Geoinformatics (Geoinformatics2015)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is the preprint version of our paper on The 23rd International\nConference on Geoinformatics (Geoinformatics2015). City traffic data has\nseveral characteristics, such as large scale, diverse predictable and\nreal-time, which falls in the range of definition of Big Data. This paper\nproposed a cloud service platform which targets for wise transportation is to\ncarry out unified management and mining analysis of the huge number of the\nmultivariate and heterogeneous dynamic transportation information, provides\nreal-time transportation information, increase the utilization efficiency of\ntransportation, promote transportation management and service level of travel\ninformation and provide decision support of transportation management by\nvirtual reality as visual.\n", "versions": [{"version": "v1", "created": "Tue, 5 May 2015 15:57:36 GMT"}, {"version": "v2", "created": "Wed, 29 Jul 2015 08:32:30 GMT"}], "update_date": "2015-07-30", "authors_parsed": [["Li", "Xiaoming", ""], ["Lv", "Zhihan", ""], ["Wang", "Weixi", ""], ["Wu", "Chen", ""], ["Hu", "Jinxing", ""]]}, {"id": "1505.01888", "submitter": "Waldemar Koczkodaj Prof.", "authors": "M.W. Herman, W.W. Koczkodaj", "title": "A Monte Carlo Study of Pairwise Comparisons", "comments": null, "journal-ref": "Information Processing Letters 57 (1996) 25-29", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consistent approximations obtained by geometric means ($GM$) and the\nprincipal eigenvector ($EV$), turned out to be close enough for 1,000,000\nnot-so-inconsistent pairwise comparisons matrices. In this respect both methods\nare accurate enough for most practical applications. As the enclosed Table 1\ndemonstrates, the biggest difference between average deviations of $GM$ and\n$EV$ solutions is 0.00019 for the Euclidean metric and 0.00355 for the\nTchebychev metric.\n  For practical applications, this precision is far better than expected. After\nall we are talking, in most cases, about relative subjective comparisons and\none tenth of a percent is usually below our threshold of perception.\n", "versions": [{"version": "v1", "created": "Thu, 7 May 2015 23:12:02 GMT"}], "update_date": "2015-05-11", "authors_parsed": [["Herman", "M. W.", ""], ["Koczkodaj", "W. W.", ""]]}, {"id": "1505.01902", "submitter": "Waldemar Koczkodaj Prof.", "authors": "S. Bozoki, J. Fulop, W.W. Koczkodaj", "title": "An LP-based inconsistency monitoring of pairwise comparison matrices", "comments": null, "journal-ref": "Mathematical and Computer Modelling, v.54(1-2),789-793, 2011", "doi": "10.1016/j.mcm.2011.03.026", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A distance-based inconsistency indicator, defined by the third author for the\nconsistency-driven pairwise comparisons method, is extended to the incomplete\ncase. The corresponding optimization problem is transformed into an equivalent\nlinear programming problem. The results can be applied in the process of\nfilling in the matrix as the decision maker gets automatic feedback. As soon as\na serious error occurs among the matrix elements, even due to a misprint, a\nsignificant increase in the inconsistency index is reported. The high\ninconsistency may be alarmed not only at the end of the process of filling in\nthe matrix but also during the completion process. Numerical examples are also\nprovided.\n", "versions": [{"version": "v1", "created": "Fri, 8 May 2015 01:25:57 GMT"}], "update_date": "2015-05-11", "authors_parsed": [["Bozoki", "S.", ""], ["Fulop", "J.", ""], ["Koczkodaj", "W. W.", ""]]}, {"id": "1505.01903", "submitter": "Waldemar Koczkodaj Prof.", "authors": "W.W. Koczkodaj, M. Orlowski", "title": "An Algorithm for the Optimal Consistent Approximation to a Pairwise\n  Comparisons Matrix by Orthogonal Projections", "comments": null, "journal-ref": "Computers & Mathematics with Applications,34(10): 41-47, 1997", "doi": "10.1016/S0898-1221(97)00205-8", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The algorithm for finding the optimal consistent approximation of an\ninconsistent pairwise comparisons matrix is based on a logarithmic\ntransformation of a pairwise comparisons matrix into a vector space with the\nEuclidean metric. Orthogonal basis is introduced in the vector space. The\northogonal projection of the transformed matrix onto the space formed by the\nimages of consistent matrices is the required consistent approximation.\n", "versions": [{"version": "v1", "created": "Fri, 8 May 2015 01:40:03 GMT"}], "update_date": "2015-05-11", "authors_parsed": [["Koczkodaj", "W. W.", ""], ["Orlowski", "M.", ""]]}, {"id": "1505.02100", "submitter": "Marek Sawerwain", "authors": "Artur Gramacki and Marek Sawerwain and Jaros{\\l}aw Gramacki", "title": "FPGA-Based Bandwidth Selection for Kernel Density Estimation Using High\n  Level Synthesis Approach", "comments": "23 pages, 6 figures, extended version of initial paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  FPGA technology can offer significantly hi\\-gher performance at much lower\npower consumption than is available from CPUs and GPUs in many computational\nproblems. Unfortunately, programming for FPGA (using ha\\-rdware description\nlanguages, HDL) is a difficult and not-trivial task and is not intuitive for\nC/C++/Java programmers. To bring the gap between programming effectiveness and\ndifficulty the High Level Synthesis (HLS) approach is promoting by main FPGA\nvendors. Nowadays, time-intensive calculations are mainly performed on GPU/CPU\narchitectures, but can also be successfully performed using HLS approach. In\nthe paper we implement a bandwidth selection algorithm for kernel density\nestimation (KDE) using HLS and show techniques which were used to optimize the\nfinal FPGA implementation. We are also going to show that FPGA speedups,\ncomparing to highly optimized CPU and GPU implementations, are quite\nsubstantial. Moreover, power consumption for FPGA devices is usually much less\nthan typical power consumption of the present CPUs and GPUs.\n", "versions": [{"version": "v1", "created": "Fri, 8 May 2015 16:54:00 GMT"}, {"version": "v2", "created": "Tue, 29 Sep 2015 20:00:15 GMT"}], "update_date": "2015-10-01", "authors_parsed": [["Gramacki", "Artur", ""], ["Sawerwain", "Marek", ""], ["Gramacki", "Jarosław", ""]]}, {"id": "1505.02388", "submitter": "Heba Abdelnasser", "authors": "Heba Abdelnasser, Khaled A. Harras, Moustafa Youssef", "title": "UbiBreathe: A Ubiquitous non-Invasive WiFi-based Breathing Estimator", "comments": "Accepted for publication in MobiHoc 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Monitoring breathing rates and patterns helps in the diagnosis and potential\navoidance of various health problems. Current solutions for respiratory\nmonitoring, however, are usually invasive and/or limited to medical facilities.\nIn this paper, we propose a novel respiratory monitoring system, UbiBreathe,\nbased on ubiquitous off-the-shelf WiFi-enabled devices. Our experiments show\nthat the received signal strength (RSS) at a WiFi-enabled device held on a\nperson's chest is affected by the breathing process. This effect extends to\nscenarios when the person is situated on the line-of-sight (LOS) between the\naccess point and the device, even without holding it. UbiBreathe leverages\nthese changes in the WiFi RSS patterns to enable ubiquitous non-invasive\nrespiratory rate estimation, as well as apnea detection.\n  We propose the full architecture and design for UbiBreathe, incorporating\nvarious modules that help reliably extract the hidden breathing signal from a\nnoisy WiFi RSS. The system handles various challenges such as noise\nelimination, interfering humans, sudden user movements, as well as detecting\nabnormal breathing situations. Our implementation of UbiBreathe using\noff-the-shelf devices in a wide range of environmental conditions shows that it\ncan estimate different breathing rates with less than 1 breaths per minute\n(bpm) error. In addition, UbiBreathe can detect apnea with more than 96%\naccuracy in both the device-on-chest and hands-free scenarios. This highlights\nits suitability for a new class of anywhere respiratory monitoring.\n", "versions": [{"version": "v1", "created": "Sun, 10 May 2015 14:43:17 GMT"}], "update_date": "2015-05-12", "authors_parsed": [["Abdelnasser", "Heba", ""], ["Harras", "Khaled A.", ""], ["Youssef", "Moustafa", ""]]}, {"id": "1505.02759", "submitter": "Vincenzo De Florio", "authors": "Vincenzo De Florio and Arianit Pajaziti", "title": "How Resilient Are Our Societies? Analyses, Models, and Preliminary\n  Results", "comments": "Paper submitted for publication in the Proc. of SERENE 2015\n  (http://serene.disim.univaq.it/2015/)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional social organizations such as those for the management of\nhealthcare and civil defence are the result of designs and realizations that\nmatched well with an operational context considerably different from the one we\nare experiencing today: A simpler world, characterized by a greater amount of\nresources to match less users producing lower peaks of requests. The new\ncontext reveals all the fragility of our societies: unmanageability is just\naround the corner unless we do not complement the \"old recipes\" with smarter\nforms of social organization. Here we analyze this problem and propose a\nrefinement to our fractal social organizations as a model for resilient\ncyber-physical societies. Evidence to our claims is provided by simulating our\nmodel in terms of multi-agent systems.\n", "versions": [{"version": "v1", "created": "Fri, 8 May 2015 09:59:55 GMT"}], "update_date": "2015-05-12", "authors_parsed": [["De Florio", "Vincenzo", ""], ["Pajaziti", "Arianit", ""]]}, {"id": "1505.04157", "submitter": "Vijaykumar S", "authors": "Vijaykumar S., Saravanakumar S.G., M. Balamurugan", "title": "Unique Sense: Smart Computing Prototype", "comments": "6 Pages", "journal-ref": "Elsevier Procedia Computer Science 50, 2015 Pages 223-228", "doi": "10.1016/j.procs.2015.04.056", "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Unique sense: Smart computing prototype is a part of unique sense computing\narchitecture, which delivers alternate solution for todays computing\narchitecture. This computing is one step towards future generation needs, which\nbrings extended support to the ubiquitous environment. This smart computing\nprototype is the light weight compact architecture which is designed to satisfy\nall the needs of this society. The proposed solution is based on the hybrid\ncombination of cutting edge technologies and techniques from the various\nlayers. In addition it achieves low cost architecture and eco-friendly to meet\nall the levels of peoples needs.\n", "versions": [{"version": "v1", "created": "Sat, 9 May 2015 02:38:57 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["S.", "Vijaykumar", ""], ["G.", "Saravanakumar S.", ""], ["Balamurugan", "M.", ""]]}, {"id": "1505.05186", "submitter": "Emanuel Diamant", "authors": "Emanuel Diamant", "title": "Advances in Computational Biology: A Real Boost or a Wishful Thinking", "comments": "The paper was submitted to the ICCS-2015 conference (Reykjavik,\n  Iceland, June 1-3, 2015) and was rejected as irrelevant to the conference\n  topic. arXiv admin note: text overlap with arXiv:1411.0054, arXiv:1502.04791,\n  arXiv:1505.04785", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computational biology is on the verge of a paradigm shift in its research\npractice - from a data-based (computational) paradigm to an information-based\n(cognitive) paradigm. As in the other research fields, this transition is\nimpeded by lack of a right understanding about what is actually hidden behind\nthe term \"information\". The paper is intended to clarify this issue and\nintroduces two new notions of \"physical information\" and \"semantic\ninformation\", which together constitute the term \"information\". Some\nimplications of this introduction are considered.\n", "versions": [{"version": "v1", "created": "Mon, 18 May 2015 10:51:50 GMT"}], "update_date": "2015-05-21", "authors_parsed": [["Diamant", "Emanuel", ""]]}, {"id": "1505.05334", "submitter": "Waldemar Koczkodaj Prof.", "authors": "W.W. Koczkodaj, M.W. Herman, M. Orlowski", "title": "Managing Null Entries in Pairwise Comparisons", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper shows how to manage null entries in pairwise comparisons matrices.\nAlthough assessments can be imprecise, since subjective criteria are involved,\nthe classical pairwise comparisons theory expects all of them to be available.\nIn practice, some experts may not be able (or available) to provide all\nassessments. Therefore managing null entries is a necessary extension of the\npairwise comparisons method. It is shown that certain null entries can be\nrecovered on the basis of the transitivity property which each pairwise\ncomparisons matrix is expected to satisfy.\n", "versions": [{"version": "v1", "created": "Wed, 20 May 2015 11:58:22 GMT"}], "update_date": "2015-05-21", "authors_parsed": [["Koczkodaj", "W. W.", ""], ["Herman", "M. W.", ""], ["Orlowski", "M.", ""]]}, {"id": "1505.06494", "submitter": "Serap Savari", "authors": "Narendra Chaudhary, Yao Luo, Serap A. Savari, and Roger McCay", "title": "Lossless Layout Image Compression Algorithms for Electron-Beam\n  Direct-Write Lithography", "comments": "This is the source file for the paper which was published in the\n  Journal of Vacuum Science & Technology B (volume 33, 06FD01) on 5 August 2015", "journal-ref": "Journal of Vacuum Science & Technology B (Vol.33, Issue 6), 06FD01\n  (2015)", "doi": "10.1116/1.4927639", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electron-beam direct-write (EBDW) lithography systems must in the future\ntransmit terabits of information per second to be viable for commercial\nsemiconductor manufacturing. Lossless layout image compression algorithms with\nhigh decoding throughputs and modest decoding resources are tools to address\nthe data transfer portion of the throughput problem. The earlier lossless\nlayout image compression algorithm Corner2 is designed for binary layout images\non raster-scanning systems. We propose variations of Corner2 collectively\ncalled Corner2-EPC and Paeth-EPC which apply to electron-beam proximity\ncorrected layout images and offer interesting trade-offs between compression\nratios and decoding speeds. Most of our algorithms achieve better overall\ncompression performance than PNG, Block C4 and LineDiffEntropy while having low\ndecoding times and resources.\n", "versions": [{"version": "v1", "created": "Sun, 24 May 2015 22:48:00 GMT"}, {"version": "v2", "created": "Tue, 18 Aug 2015 15:40:19 GMT"}], "update_date": "2015-08-19", "authors_parsed": [["Chaudhary", "Narendra", ""], ["Luo", "Yao", ""], ["Savari", "Serap A.", ""], ["McCay", "Roger", ""]]}, {"id": "1505.06939", "submitter": "Wei Shi", "authors": "William Lee Croft, Wei Shi, Jorg-Rudiger Sack, Jean-Pierre Corriveau", "title": "A Novel Geographic Partitioning System for Anonymizing Health Care Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With large volumes of detailed health care data being collected, there is a\nhigh demand for the release of this data for research purposes. Hospitals and\norganizations are faced with conflicting interests of releasing this data and\nprotecting the confidentiality of the individuals to whom the data pertains.\nSimilarly, there is a conflict in the need to release precise geographic\ninformation for certain research applications and the requirement to censor or\ngeneralize the same information for the sake of confidentiality. Ultimately the\nchallenge is to anonymize data in order to comply with government privacy\npolicies while reducing the loss in geographic information as much as possible.\nIn this paper, we present a novel geographic-based system for the anonymization\nof health care data. This system is broken up into major components for which\ndifferent approaches may be supplied. We compare such approaches in order to\nmake recommendations on which of them to select to best match user\nrequirements.\n", "versions": [{"version": "v1", "created": "Tue, 26 May 2015 13:30:19 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Croft", "William Lee", ""], ["Shi", "Wei", ""], ["Sack", "Jorg-Rudiger", ""], ["Corriveau", "Jean-Pierre", ""]]}, {"id": "1505.07062", "submitter": "Hajer Braham", "authors": "Hajer Braham, Sana Ben Jemaa, Gersende Fort, Eric Moulines and Berna\n  Sayrac", "title": "Fixed Rank Kriging for Cellular Coverage Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coverage planning and optimization is one of the most crucial tasks for a\nradio network operator. Efficient coverage optimization requires accurate\ncoverage estimation. This estimation relies on geo-located field measurements\nwhich are gathered today during highly expensive drive tests (DT); and will be\nreported in the near future by users' mobile devices thanks to the 3GPP\nMinimizing Drive Tests (MDT) feature~\\cite{3GPPproposal}. This feature consists\nin an automatic reporting of the radio measurements associated with the\ngeographic location of the user's mobile device. Such a solution is still\ncostly in terms of battery consumption and signaling overhead. Therefore,\npredicting the coverage on a location where no measurements are available\nremains a key and challenging task. This paper describes a powerful tool that\ngives an accurate coverage prediction on the whole area of interest: it builds\na coverage map by spatially interpolating geo-located measurements using the\nKriging technique. The paper focuses on the reduction of the computational\ncomplexity of the Kriging algorithm by applying Fixed Rank Kriging (FRK). The\nperformance evaluation of the FRK algorithm both on simulated measurements and\nreal field measurements shows a good trade-off between prediction efficiency\nand computational complexity. In order to go a step further towards the\noperational application of the proposed algorithm, a multicellular use-case is\nstudied. Simulation results show a good performance in terms of coverage\nprediction and detection of the best serving cell.\n", "versions": [{"version": "v1", "created": "Tue, 26 May 2015 17:42:16 GMT"}, {"version": "v2", "created": "Mon, 14 Mar 2016 21:50:11 GMT"}], "update_date": "2016-03-16", "authors_parsed": [["Braham", "Hajer", ""], ["Jemaa", "Sana Ben", ""], ["Fort", "Gersende", ""], ["Moulines", "Eric", ""], ["Sayrac", "Berna", ""]]}, {"id": "1505.08088", "submitter": "Kevin Straight", "authors": "Kevin A. Straight", "title": "An Analogy Based Method for Freight Forwarding Cost Estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The author explored estimation by analogy (EBA) as a means of estimating the\ncost of international freight consignment. A version of the k-Nearest Neighbors\nalgorithm (k-NN) was tested by predicting job costs from a database of over\n5000 actual jobs booked by an Irish freight forwarding firm over a seven year\nperiod. The effect of a computer intensive training process on overall accuracy\nof the method was found to be insignificant when the method was implemented\nwith four or fewer neighbors. Overall, the accuracy of the analogy based\nmethod, while still significantly less accurate than manually working up\nestimates, might be worthwhile to implement in practice, depending labor costs\nin an adopting firm. A simulation model was used to compare manual versus\nanalytical estimation methods. The point of indifference occurs when it takes a\nfirm more than 1.5 worker hours to prepare a manual estimate (at current Irish\nlabor costs). Suggestions are given for future experiments to improve the\nsampling policy of the method to improve accuracy and to improve overall\nscalability.\n", "versions": [{"version": "v1", "created": "Thu, 28 May 2015 01:24:24 GMT"}], "update_date": "2015-06-01", "authors_parsed": [["Straight", "Kevin A.", ""]]}, {"id": "1505.08107", "submitter": "Roberto Herrera", "authors": "Roberto H. Herrera, Zhaorui Liu, Natasha Raffa, Paul Christensen,\n  Adrianus Elvers", "title": "Improving Time Estimation by Blind Deconvolution: with Applications to\n  TOFD and Backscatter Sizing", "comments": "10 pages, 10 figures, Conference Paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a blind deconvolution scheme based on statistical\nwavelet estimation. We assume no prior knowledge of the wavelet, and do not\nselect a reflector from the signal. Instead, the wavelet (ultrasound pulse) is\nstatistically estimated from the signal itself by a kurtosis-based metric. This\nwavelet is then used to deconvolve the RF (radiofrequency) signal through\nWiener filtering, and the resultant zero phase trace is subjected to spectral\nbroadening by Autoregressive Spectral Extrapolation (ASE). These steps increase\nthe time resolution of diffraction techniques. Results on synthetic and real\ncases show the robustness of the proposed method.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2015 16:45:16 GMT"}], "update_date": "2015-06-01", "authors_parsed": [["Herrera", "Roberto H.", ""], ["Liu", "Zhaorui", ""], ["Raffa", "Natasha", ""], ["Christensen", "Paul", ""], ["Elvers", "Adrianus", ""]]}]