[{"id": "1103.0038", "submitter": "Yue Zhao", "authors": "Yue Zhao, Chee Wei Tan, A. Salman Avestimehr, Suhas N. Diggavi,\n  Gregory J. Pottie", "title": "On the Sum-Capacity with Successive Decoding in Interference Channels", "comments": "32 pages, 21 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate the sum-capacity of the two-user Gaussian\ninterference channel with Gaussian superposition coding and successive\ndecoding. We first examine an approximate deterministic formulation of the\nproblem, and introduce the complementarity conditions that capture the use of\nGaussian coding and successive decoding. In the deterministic channel problem,\nwe find the constrained sum-capacity and its achievable schemes with the\nminimum number of messages, first in symmetric channels, and then in general\nasymmetric channels. We show that the constrained sum-capacity oscillates as a\nfunction of the cross link gain parameters between the information theoretic\nsum-capacity and the sum-capacity with interference treated as noise.\nFurthermore, we show that if the number of messages of either of the two users\nis fewer than the minimum number required to achieve the constrained\nsum-capacity, the maximum achievable sum-rate drops to that with interference\ntreated as noise. We provide two algorithms (a simple one and a finer one) to\ntranslate the optimal schemes in the deterministic channel model to the\nGaussian channel model. We also derive two upper bounds on the sum-capacity of\nthe Gaussian Han-Kobayashi schemes, which automatically upper bound the\nsum-capacity using successive decoding of Gaussian codewords. Numerical\nevaluations show that, similar to the deterministic channel results, the\nconstrained sum-capacity in the Gaussian channels oscillates between the\nsum-capacity with Han-Kobayashi schemes and that with single message schemes.\n", "versions": [{"version": "v1", "created": "Mon, 28 Feb 2011 22:04:06 GMT"}, {"version": "v2", "created": "Tue, 29 Mar 2011 01:22:20 GMT"}], "update_date": "2011-03-30", "authors_parsed": [["Zhao", "Yue", ""], ["Tan", "Chee Wei", ""], ["Avestimehr", "A. Salman", ""], ["Diggavi", "Suhas N.", ""], ["Pottie", "Gregory J.", ""]]}, {"id": "1103.0089", "submitter": "Chiranjib Choudhuri", "authors": "Chiranjib Choudhuri and Urbashi Mitra", "title": "Capacity Bounds for Relay Channels with Inter-symbol Interference and\n  Colored Gaussian Noise", "comments": "42 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity of a relay channel with inter-symbol interference (ISI) and\nadditive colored Gaussian noise is examined under an input power constraint.\nPrior results are used to show that the capacity of this channel can be\ncomputed by examining the circular degraded relay channel in the limit of\ninfinite block length. The current work provides single letter expressions for\nthe achievable rates with decodeand- forward (DF) and compress-and-forward (CF)\nprocessing employed at the relay. Additionally, the cut-set bound for the relay\nchannel is generalized for the ISI/colored Gaussian noise scenario. All results\nhinge on showing the optimality of the decomposition of the relay channel with\nISI/colored Gaussian noise into an equivalent collection of coupled parallel,\nscalar, memoryless relay channels. The region of optimality of the DF and CF\nachievable rates are also discussed. Optimal power allocation strategies are\nalso discussed for the two lower bounds and the cut-set upper bound. As the\nmaximizing power allocations for DF and CF appear to be intractable, the\ndesired cost functions are modified and then optimized. The resulting rates are\nillustrated through the computation of numerical examples.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 06:52:07 GMT"}], "update_date": "2011-03-02", "authors_parsed": [["Choudhuri", "Chiranjib", ""], ["Mitra", "Urbashi", ""]]}, {"id": "1103.0135", "submitter": "Jochen Sommerfeld", "authors": "Igor Bjelakovi\\'c, Holger Boche, and Jochen Sommerfeld", "title": "Capacity results for compound wiretap channels", "comments": "5 pages, no figures. Accepted for presentation at the IEEE ITW 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive a lower bound on the secrecy capacity of the compound wiretap\nchannel with channel state information at the transmitter which matches the\ngeneral upper bound on the secrecy capacity of general compound wiretap\nchannels given by Liang et al. and thus establishing a full coding theorem in\nthis case. We achieve this with a quite strong secrecy criterion and with a\ndecoder that is robust against the effect of randomisation in the encoding.\nThis relieves us from the need of decoding the randomisation parameter which is\nin general not possible within this model. Moreover we prove a lower bound on\nthe secrecy capacity of the compound wiretap channel without channel state\ninformation.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 11:06:12 GMT"}, {"version": "v2", "created": "Tue, 9 Aug 2011 13:36:01 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Bjelaković", "Igor", ""], ["Boche", "Holger", ""], ["Sommerfeld", "Jochen", ""]]}, {"id": "1103.0171", "submitter": "Amir Ingber", "authors": "Amir Ingber, Ram Zamir, Meir Feder", "title": "Finite Dimensional Infinite Constellations", "comments": "54 pages, 13 figures. Submitted to IEEE Transactions on Information\n  Theory", "journal-ref": "IEEE Trans. on Information Theory, Vol. 59 ,Issue 3, pp.\n  1630-1656, 2013", "doi": "10.1109/TIT.2012.2224145", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the setting of a Gaussian channel without power constraints, proposed by\nPoltyrev, the codewords are points in an n-dimensional Euclidean space (an\ninfinite constellation) and the tradeoff between their density and the error\nprobability is considered. The capacity in this setting is the highest\nachievable normalized log density (NLD) with vanishing error probability. This\ncapacity as well as error exponent bounds for this setting are known. In this\nwork we consider the optimal performance achievable in the fixed blocklength\n(dimension) regime. We provide two new achievability bounds, and extend the\nvalidity of the sphere bound to finite dimensional infinite constellations. We\nalso provide asymptotic analysis of the bounds: When the NLD is fixed, we\nprovide asymptotic expansions for the bounds that are significantly tighter\nthan the previously known error exponent results. When the error probability is\nfixed, we show that as n grows, the gap to capacity is inversely proportional\n(up to the first order) to the square-root of n where the proportion constant\nis given by the inverse Q-function of the allowed error probability, times the\nsquare root of 1/2. In an analogy to similar result in channel coding, the\ndispersion of infinite constellations is 1/2nat^2 per channel use. All our\nachievability results use lattices and therefore hold for the maximal error\nprobability as well. Connections to the error exponent of the power constrained\nGaussian channel and to the volume-to-noise ratio as a figure of merit are\ndiscussed. In addition, we demonstrate the tightness of the results numerically\nand compare to state-of-the-art coding schemes.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 14:05:30 GMT"}, {"version": "v2", "created": "Wed, 27 Jul 2011 19:38:35 GMT"}, {"version": "v3", "created": "Mon, 5 Sep 2011 12:18:33 GMT"}], "update_date": "2013-02-28", "authors_parsed": [["Ingber", "Amir", ""], ["Zamir", "Ram", ""], ["Feder", "Meir", ""]]}, {"id": "1103.0205", "submitter": "Tobias Koch", "authors": "A. Taufiq Asyhari, Tobias Koch, Albert Guill\\'en i F\\`abregas", "title": "Nearest Neighbour Decoding and Pilot-Aided Channel Estimation in\n  Stationary Gaussian Flat-Fading Channels", "comments": "5 pages, 1 figure. To be presented at the IEEE International\n  Symposium on Information Theory (ISIT), St. Petersburg, Russia, 2011.\n  Replaced with version that will appear in the proceedings", "journal-ref": null, "doi": "10.1109/ISIT.2011.6034081", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the information rates of non-coherent, stationary, Gaussian,\nmultiple-input multiple-output (MIMO) flat-fading channels that are achievable\nwith nearest neighbour decoding and pilot-aided channel estimation. In\nparticular, we analyse the behaviour of these achievable rates in the limit as\nthe signal-to-noise ratio (SNR) tends to infinity. We demonstrate that nearest\nneighbour decoding and pilot-aided channel estimation achieves the capacity\npre-log - which is defined as the limiting ratio of the capacity to the\nlogarithm of SNR as the SNR tends to infinity - of non-coherent multiple-input\nsingle-output (MISO) flat-fading channels, and it achieves the best so far\nknown lower bound on the capacity pre-log of non-coherent MIMO flat-fading\nchannels.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 16:13:15 GMT"}, {"version": "v2", "created": "Mon, 30 May 2011 21:53:26 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Asyhari", "A. Taufiq", ""], ["Koch", "Tobias", ""], ["Fàbregas", "Albert Guillén i", ""]]}, {"id": "1103.0266", "submitter": "Won-Yong Shin", "authors": "Won-Yong Shin, Daniel E. Lucani, Muriel Medard, Milica Stojanovic, and\n  Vahid Tarokh", "title": "On the Order Optimality of Large-scale Underwater Networks", "comments": "25 pages, 6 figures, Submitted to IEEE Transactions on Information\n  Theory (part of this work was submitted to the 2011 IEEE International\n  Symposium on Information Theory 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Capacity scaling laws are analyzed in an underwater acoustic network with $n$\nregularly located nodes on a square, in which both bandwidth and received\nsignal power can be limited significantly. A narrow-band model is assumed where\nthe carrier frequency is allowed to scale as a function of $n$. In the network,\nwe characterize an attenuation parameter that depends on the frequency scaling\nas well as the transmission distance. Cut-set upper bounds on the throughput\nscaling are then derived in both extended and dense networks having unit node\ndensity and unit area, respectively. It is first analyzed that under extended\nnetworks, the upper bound is inversely proportional to the attenuation\nparameter, thus resulting in a highly power-limited network. Interestingly, it\nis seen that the upper bound for extended networks is intrinsically related to\nthe attenuation parameter but not the spreading factor. On the other hand, in\ndense networks, we show that there exists either a bandwidth or power\nlimitation, or both, according to the path-loss attenuation regimes, thus\nyielding the upper bound that has three fundamentally different operating\nregimes. Furthermore, we describe an achievable scheme based on the simple\nnearest-neighbor multi-hop (MH) transmission. We show that under extended\nnetworks, the MH scheme is order-optimal for all the operating regimes. An\nachievability result is also presented in dense networks, where the operating\nregimes that guarantee the order optimality are identified. It thus turns out\nthat frequency scaling is instrumental towards achieving the order optimality\nin the regimes. Finally, these scaling results are extended to a random network\nrealization. As a result, vital information for fundamental limits of a variety\nof underwater network scenarios is provided by showing capacity scaling laws.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 20:38:05 GMT"}, {"version": "v2", "created": "Mon, 7 Mar 2011 14:47:13 GMT"}, {"version": "v3", "created": "Mon, 28 Mar 2011 14:56:33 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Shin", "Won-Yong", ""], ["Lucani", "Daniel E.", ""], ["Medard", "Muriel", ""], ["Stojanovic", "Milica", ""], ["Tarokh", "Vahid", ""]]}, {"id": "1103.0270", "submitter": "Huarui Yin", "authors": "Huarui Yin, Lei, Ke, Zhengdao Wang", "title": "Interference Alignment and Degrees of Freedom Region of Cellular Sigma\n  Channel", "comments": "5 page2 2figures submitted to isit 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the Degrees of Freedom (DoF) Region of a cellular network,\nwhere the cells can have overlapping areas. Within an overlapping area, the\nmobile users can access multiple base stations. We consider a case where there\nare two base stations both equipped with multiple antennas. The mobile stations\nare all equipped with single antenna and each mobile station can belong to\neither a single cell or both cells. We completely characterize the DoF region\nfor the uplink channel assuming that global channel state information is\navailable at the transmitters. The achievability scheme is based on\ninterference alignment at the base stations.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 20:55:00 GMT"}], "update_date": "2011-03-02", "authors_parsed": [["Yin", "Huarui", ""], ["Lei", "", ""], ["Ke", "", ""], ["Wang", "Zhengdao", ""]]}, {"id": "1103.0305", "submitter": "Peng Zhang", "authors": "Peng Zhang, Robert Qiu", "title": "GLRT-Based Spectrum Sensing with Blindly Learned Feature under Rank-1\n  Assumption", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prior knowledge can improve the performance of spectrum sensing. Instead of\nusing universal features as prior knowledge, we propose to blindly learn the\nlocalized feature at the secondary user. Motivated by pattern recognition in\nmachine learning, we define signal feature as the leading eigenvector of the\nsignal's sample covariance matrix. Feature learning algorithm (FLA) for blind\nfeature learning and feature template matching algorithm (FTM) for spectrum\nsensing are proposed. Furthermore, we implement the FLA and FTM in hardware.\nSimulations and hardware experiments show that signal feature can be learned\nblindly. In addition, by using signal feature as prior knowledge, the detection\nperformance can be improved by about 2 dB. Motivated by experimental results,\nwe derive several GLRT based spectrum sensing algorithms under rank-1\nassumption, considering signal feature, signal power and noise power as the\navailable parameters. The performance of our proposed algorithms is tested on\nboth synthesized rank-1 signal and captured DTV data, and compared to other\nstate-of-the-art covariance matrix based spectrum sensing algorithms. In\ngeneral, our GLRT based algorithms have better detection performance. In\naddition, algorithms with signal feature as prior knowledge are about 2 dB\nbetter than algorithms without prior knowledge.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 22:20:30 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Zhang", "Peng", ""], ["Qiu", "Robert", ""]]}, {"id": "1103.0311", "submitter": "Arash Einolghozati", "authors": "Arash Einolghozati, Mohsen Sardari, Ahmad Beirami, Faramarz Fekri", "title": "Consensus Problem under Diffusion-based Molecular Communication", "comments": "6 pages. To appear in CISS 2011 proceeding", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the consensus problem in a network where nodes communicate via\ndiffusion-based molecular communication (DbMC). In DbMC, messages are conveyed\nvia the variation in the concentration of molecules in the medium. Every node\nacquires sensory information about the environment. Communication enables the\nnodes to reach the best estimate for that measurement, e.g., the average of the\ninitial estimates by all nodes. We consider an iterative method for\ncommunication among nodes that enables information spreading and averaging in\nthe network. We show that the consensus can be attained after a finite number\nof iterations and variance of estimates of nodes can be made arbitrarily small\nvia communication.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 23:24:40 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Einolghozati", "Arash", ""], ["Sardari", "Mohsen", ""], ["Beirami", "Ahmad", ""], ["Fekri", "Faramarz", ""]]}, {"id": "1103.0317", "submitter": "Eyal En Gad", "authors": "Eyal En Gad, Michael Langberg, Moshe Schwartz, Jehoshua Bruck", "title": "Generalized Gray Codes for Local Rank Modulation", "comments": "7 pages, 1 figure, shorter version was submitted to ISIT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the local rank-modulation scheme in which a sliding window going\nover a sequence of real-valued variables induces a sequence of permutations.\nLocal rank-modulation is a generalization of the rank-modulation scheme, which\nhas been recently suggested as a way of storing information in flash memory. We\nstudy Gray codes for the local rank-modulation scheme in order to simulate\nconventional multi-level flash cells while retaining the benefits of rank\nmodulation. Unlike the limited scope of previous works, we consider code\nconstructions for the entire range of parameters including the code length,\nsliding window size, and overlap between adjacent windows. We show our\nconstructed codes have asymptotically-optimal rate. We also provide efficient\nencoding, decoding, and next-state algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 23:53:45 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Gad", "Eyal En", ""], ["Langberg", "Michael", ""], ["Schwartz", "Moshe", ""], ["Bruck", "Jehoshua", ""]]}, {"id": "1103.0326", "submitter": "Meik D\\\"orpinghaus", "authors": "Meik D\\\"orpinghaus, Heinrich Meyr", "title": "On the Achievable Rate of Stationary Rayleigh Flat-Fading Channels with\n  Gaussian Inputs", "comments": "submitted to the Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we consider a discrete-time stationary Rayleigh flat-fading\nchannel with unknown channel state information at transmitter and receiver. The\nlaw of the channel is presumed to be known to the receiver. In addition, we\nassume the power spectral density (PSD) of the fading process to be compactly\nsupported. For i.i.d. zero-mean proper Gaussian input distributions, we\ninvestigate the achievable rate. One of the main contributions is the\nderivation of two new upper bounds on the achievable rate with zero-mean proper\nGaussian input symbols. The first one holds only for the special case of a\nrectangular PSD and depends on the SNR and the spread of the PSD. Together with\na lower bound on the achievable rate, which is achievable with i.i.d. zero-mean\nproper Gaussian input symbols, we have found a set of bounds which is tight in\nthe sense that their difference is bounded. Furthermore, we show that the high\nSNR slope is characterized by a pre-log of 1-2f_d, where f_d is the normalized\nmaximum Doppler frequency. This pre-log is equal to the high SNR pre-log of the\npeak power constrained capacity. Furthermore, we derive an alternative upper\nbound on the achievable rate with i.i.d. input symbols which is based on the\none-step channel prediction error variance. The novelty lies in the fact that\nthis bound is not restricted to peak power constrained input symbols like known\nbounds, e.g. in [1]. Therefore, the derived upper bound can also be used to\nevaluate the achievable rate with i.i.d. proper Gaussian input symbols. We\ncompare the derived bounds on the achievable rate with i.i.d. zero-mean proper\nGaussian input symbols with bounds on the peak power constrained capacity given\nin [1-3]. Finally, we compare the achievable rate with i.i.d. zero-mean proper\nGaussian input symbols with the achievable rate using synchronized detection in\ncombination with a solely pilot based channel estimation.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 00:59:06 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Dörpinghaus", "Meik", ""], ["Meyr", "Heinrich", ""]]}, {"id": "1103.0358", "submitter": "Anthony Kim", "authors": "Anthony Kim", "title": "On Network Coding Capacity - Matroidal Networks and Network Capacity\n  Regions", "comments": "Master of Engineering Thesis, MIT, September 2010, 70 pages, 10\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One fundamental problem in the field of network coding is to determine the\nnetwork coding capacity of networks under various network coding schemes. In\nthis thesis, we address the problem with two approaches: matroidal networks and\ncapacity regions.\n  In our matroidal approach, we prove the converse of the theorem which states\nthat, if a network is scalar-linearly solvable then it is a matroidal network\nassociated with a representable matroid over a finite field. As a consequence,\nwe obtain a correspondence between scalar-linearly solvable networks and\nrepresentable matroids over finite fields in the framework of matroidal\nnetworks. We prove a theorem about the scalar-linear solvability of networks\nand field characteristics. We provide a method for generating scalar-linearly\nsolvable networks that are potentially different from the networks that we\nalready know are scalar-linearly solvable.\n  In our capacity region approach, we define a multi-dimensional object, called\nthe network capacity region, associated with networks that is analogous to the\nrate regions in information theory. For the network routing capacity region, we\nshow that the region is a computable rational polytope and provide exact\nalgorithms and approximation heuristics for computing the region. For the\nnetwork linear coding capacity region, we construct a computable rational\npolytope, with respect to a given finite field, that inner bounds the linear\ncoding capacity region and provide exact algorithms and approximation\nheuristics for computing the polytope. The exact algorithms and approximation\nheuristics we present are not polynomial time schemes and may depend on the\noutput size.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 07:33:17 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Kim", "Anthony", ""]]}, {"id": "1103.0361", "submitter": "Anthony Kim", "authors": "Anthony Kim, Muriel Medard", "title": "Computing Bounds on Network Capacity Regions as a Polytope\n  Reconstruction Problem", "comments": "Appeared in the 2011 IEEE International Symposium on Information\n  Theory, 5 pages, 1 figure", "journal-ref": null, "doi": "10.1109/ISIT.2011.6034197", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a notion of network capacity region of networks that generalizes\nthe notion of network capacity defined by Cannons et al. and prove its notable\nproperties such as closedness, boundedness and convexity when the finite field\nis fixed. We show that the network routing capacity region is a computable\nrational polytope and provide exact algorithms and approximation heuristics for\ncomputing the region. We define the semi-network linear coding capacity region,\nwith respect to a fixed finite field, that inner bounds the corresponding\nnetwork linear coding capacity region, show that it is a computable rational\npolytope, and provide exact algorithms and approximation heuristics. We show\nconnections between computing these regions and a polytope reconstruction\nproblem and some combinatorial optimization problems, such as the minimum cost\ndirected Steiner tree problem. We provide an example to illustrate our results.\nThe algorithms are not necessarily polynomial-time.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 07:43:56 GMT"}, {"version": "v2", "created": "Mon, 6 Feb 2012 03:28:17 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Kim", "Anthony", ""], ["Medard", "Muriel", ""]]}, {"id": "1103.0377", "submitter": "Mehdi Molkaraie", "authors": "Mehdi Molkaraie and Payam Pakzad", "title": "On Properties of the Minimum Entropy Sub-tree to Compute Lower Bounds on\n  the Partition Function", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.IT math.IT physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computing the partition function and the marginals of a global probability\ndistribution are two important issues in any probabilistic inference problem.\nIn a previous work, we presented sub-tree based upper and lower bounds on the\npartition function of a given probabilistic inference problem. Using the\nentropies of the sub-trees we proved an inequality that compares the lower\nbounds obtained from different sub-trees. In this paper we investigate the\nproperties of one specific lower bound, namely the lower bound computed by the\nminimum entropy sub-tree. We also investigate the relationship between the\nminimum entropy sub-tree and the sub-tree that gives the best lower bound.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 09:46:44 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Molkaraie", "Mehdi", ""], ["Pakzad", "Payam", ""]]}, {"id": "1103.0461", "submitter": "Debashis Dash", "authors": "Debashis Dash and Ashutosh Sabharwal", "title": "Paranoid Secondary: Waterfilling in a Cognitive Interference Channel\n  with Partial Information", "comments": "26 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a two-user cognitive channel, where the primary flow is sporadic,\ncannot be re-designed and operating below its link capacity. To study the\nimpact of primary traffic uncertainty, we propose a block activity model that\ncaptures the random on-off periods of primary's transmissions. Each block in\nthe model can be split into parallel Gaussian-mixture channels, such that each\nchannel resembles a multiple user channel (MAC) from the point of view of the\nsecondary user. The secondary senses the current state of the primary at the\nstart of each block. We show that the optimal power transmitted depends on the\nsensed state and the optimal power profile is paranoid, i.e. either growing or\ndecaying in power as a function of time. We show that such a scheme achieves\ncapacity when there is no noise in the sensing. The optimal transmission for\nthe secondary performs rate splitting and follows a layered water-filling power\nallocation for each parallel channel to achieve capacity. The secondary rate\napproaches a genie-aided scheme for large block-lengths. Additionally, if the\nfraction of time primary uses the channel tends to one, the paranoid scheme and\nthe genie-aided upper bound get arbitrarily close to a no-sensing scheme.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 15:48:57 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Dash", "Debashis", ""], ["Sabharwal", "Ashutosh", ""]]}, {"id": "1103.0484", "submitter": "Camilla Hollanti", "authors": "Camilla Hollanti, Roope Vehkalahti, and Youssef Nasser", "title": "Algebraic Hybrid Satellite-Terrestrial Space-Time Codes for Digital\n  Broadcasting in SFN", "comments": "14 pages, 2 figures, submitted to ISIT 2011", "journal-ref": "Proceedings of the IEEE Workshop on Signal Processing Systems,\n  SiPS 2011, October 4-7, 2011, Beirut, Lebanon", "doi": "10.1109/SiPS.2011.6088980", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lately, different methods for broadcasting future digital TV in a single\nfrequency network (SFN) have been under an intensive study. To improve the\ntransmission to also cover suburban and rural areas, a hybrid scheme may be\nused. In hybrid transmission, the signal is transmitted both from a satellite\nand from a terrestrial site. In 2008, Y. Nasser et al. proposed to use a double\nlayer 3D space-time (ST) code in the hybrid 4 x 2 MIMO transmission of digital\nTV. In this paper, alternative codes with simpler structure are proposed for\nthe 4 x 2 hybrid system, and new codes are constructed for the 3 x 2 system.\nThe performance of the proposed codes is analyzed through computer simulations,\nshowing a significant improvement over simple repetition schemes. The proposed\ncodes prove in addition to be very robust in the presence of power imbalance\nbetween the two sites.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 16:48:39 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Hollanti", "Camilla", ""], ["Vehkalahti", "Roope", ""], ["Nasser", "Youssef", ""]]}, {"id": "1103.0494", "submitter": "Jose Paris", "authors": "Jose F. Paris", "title": "Outage Probability in {\\eta}-{\\mu}/{\\eta}-{\\mu} Interference-limited\n  Scenarios", "comments": "This work has been submitted to the IEEE for possible publication.\n  Copyright may be transferred without notice, after which this version may no\n  longer be accessible", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper exact closed-form expressions are derived for the outage\nprobability (OP) in scenarios where both the signal of interest (SOI) and the\ninterfering signals experience {\\eta}-{\\mu} fading and the background noise can\nbe neglected. With the only assumption that the {\\mu} parameter is a positive\ninteger number for the interfering signals, the derived expressions are given\nin elementary terms for maximal ratio combining (MRC) with independent\nbranches. The analysis is also valid when the {\\mu} parameters of the\npre-combining SOI power envelopes are positive integer or half-integer numbers\nand the SOI is formed at the receiver from spatially correlated MRC.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 17:27:20 GMT"}, {"version": "v2", "created": "Wed, 2 Nov 2011 13:53:52 GMT"}, {"version": "v3", "created": "Thu, 3 Nov 2011 08:58:07 GMT"}], "update_date": "2011-11-04", "authors_parsed": [["Paris", "Jose F.", ""]]}, {"id": "1103.0502", "submitter": "Jose Paris", "authors": "Jose F. Paris", "title": "Unified Analysis of the Average Gaussian Error Probability for a Class\n  of Fading Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on the analysis of average Gaussian error probabilities in\ncertain fading channels, i.e. we are interested in E[Q((p {\\gamma})^(1/2))]\nwhere Q(.) is the Gaussian Q-function, p is a positive real number and {\\gamma}\nis a nonnegative random variable. We present a unified analysis of the average\nGaussian error probability, derive a compact expression in terms of the\nLauricella FD^(n) function that is applicable to a broad class of fading\nchannels, and discuss the relation of this expression and expressions of this\ntype recently appeared in literature. As an intermediate step in our\nderivations, we also obtain a compact expression for the outage probability of\nthe same class of fading channels. Finally, we show how this unified analysis\nallows us to obtain novel performance analytical results.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 17:54:16 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Paris", "Jose F.", ""]]}, {"id": "1103.0505", "submitter": "Jose Paris", "authors": "Jose F. Paris", "title": "A Note on the Sum of Correlated Gamma Random Variables", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The sum of correlated gamma random variables appears in the analysis of many\nwireless communications systems, e.g. in systems under Nakagami-m fading. In\nthis Letter we obtain exact expressions for the probability density function\n(PDF) and the cumulative distribution function (CDF) of the sum of arbitrarily\ncorrelated gamma variables in terms of certain Lauricella functions.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 18:04:36 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Paris", "Jose F.", ""]]}, {"id": "1103.0561", "submitter": "Marios Kountouris", "authors": "Marios Kountouris, Jeffrey G. Andrews", "title": "Downlink SDMA with Limited Feedback in Interference-Limited Wireless\n  Networks", "comments": "Submitted to IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": "10.1109/TWC.2012.051712.110357", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tremendous capacity gains promised by space division multiple access\n(SDMA) depend critically on the accuracy of the transmit channel state\ninformation. In the broadcast channel, even without any network interference,\nit is known that such gains collapse due to interstream interference if the\nfeedback is delayed or low rate. In this paper, we investigate SDMA in the\npresence of interference from many other simultaneously active transmitters\ndistributed randomly over the network. In particular we consider zero-forcing\nbeamforming in a decentralized (ad hoc) network where each receiver provides\nfeedback to its respective transmitter. We derive closed-form expressions for\nthe outage probability, network throughput, transmission capacity, and average\nachievable rate and go on to quantify the degradation in network performance\ndue to residual self-interference as a function of key system parameters. One\nparticular finding is that as in the classical broadcast channel, the per-user\nfeedback rate must increase linearly with the number of transmit antennas and\nSINR (in dB) for the full multiplexing gains to be preserved with limited\nfeedback. We derive the throughput-maximizing number of streams, establishing\nthat single-stream transmission is optimal in most practically relevant\nsettings. In short, SDMA does not appear to be a prudent design choice for\ninterference-limited wireless networks.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 21:33:08 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Kountouris", "Marios", ""], ["Andrews", "Jeffrey G.", ""]]}, {"id": "1103.0680", "submitter": "Zoran Majkic", "authors": "Zoran Majkic", "title": "First-order Logic: Modality and Intensionality", "comments": "33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GL cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Contemporary use of the term 'intension' derives from the traditional logical\nFrege-Russell's doctrine that an idea (logic formula) has both an extension and\nan intension. From the Montague's point of view, the meaning of an idea can be\nconsidered as particular extensions in different possible worlds. In this paper\nwe analyze the minimal intensional semantic enrichment of the syntax of the FOL\nlanguage, by unification of different views: Tarskian extensional semantics of\nthe FOL, modal interpretation of quantifiers, and a derivation of the Tarskian\ntheory of truth from unified semantic theory based on a single meaning\nrelation. We show that not all modal predicate logics are intensional, and that\nan equivalent modal Kripke's interpretation of logic quantifiers in FOL results\nin a particular pure extensional modal predicate logic (as is the standard\nTarskian semantics of the FOL). This minimal intensional enrichment is obtained\nby adopting the theory of properties, relations and propositions (PRP) as the\nuniverse or domain of the FOL, composed by particulars and universals (or\nconcepts), with the two-step interpretation of the FOL that eliminates the weak\npoints of the Montague's intensional semantics. Differently from the Bealer's\nintensional FOL, we show that it is not necessary the introduction of the\nintensional abstraction in order to obtain the full intensional properties of\nthe FOL. Final result of this paper is represented by the commutative\nhomomorphic diagram that holds in each given possible world of this new\nintensional FOL, from the free algebra of the FOL syntax, toward its\nintensional algebra of concepts, and, successively, to the new extensional\nrelational algebra (different from Cylindric algebras), and we show that it\ncorresponds to the Tarski's interpretation of the standard extensional FOL in\nthis possible world.\n", "versions": [{"version": "v1", "created": "Thu, 3 Mar 2011 13:32:59 GMT"}], "update_date": "2011-03-04", "authors_parsed": [["Majkic", "Zoran", ""]]}, {"id": "1103.0769", "submitter": "Vassilis Kekatos", "authors": "Vassilis Kekatos and Georgios B. Giannakis", "title": "Sparse Volterra and Polynomial Regression Models: Recoverability and\n  Estimation", "comments": "20 pages, to appear in IEEE Trans. on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2011.2165952", "report-no": null, "categories": "cs.LG cs.IT math.IT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Volterra and polynomial regression models play a major role in nonlinear\nsystem identification and inference tasks. Exciting applications ranging from\nneuroscience to genome-wide association analysis build on these models with the\nadditional requirement of parsimony. This requirement has high interpretative\nvalue, but unfortunately cannot be met by least-squares based or kernel\nregression methods. To this end, compressed sampling (CS) approaches, already\nsuccessful in linear regression settings, can offer a viable alternative. The\nviability of CS for sparse Volterra and polynomial models is the core theme of\nthis work. A common sparse regression task is initially posed for the two\nmodels. Building on (weighted) Lasso-based schemes, an adaptive RLS-type\nalgorithm is developed for sparse polynomial regressions. The identifiability\nof polynomial models is critically challenged by dimensionality. However,\nfollowing the CS principle, when these models are sparse, they could be\nrecovered by far fewer measurements. To quantify the sufficient number of\nmeasurements for a given level of sparsity, restricted isometry properties\n(RIP) are investigated in commonly met polynomial regression settings,\ngeneralizing known results for their linear counterparts. The merits of the\nnovel (weighted) adaptive CS algorithms to sparse polynomial modeling are\nverified through synthetic as well as real data tests for genotype-phenotype\nanalysis.\n", "versions": [{"version": "v1", "created": "Thu, 3 Mar 2011 20:21:28 GMT"}, {"version": "v2", "created": "Wed, 7 Sep 2011 00:03:45 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Kekatos", "Vassilis", ""], ["Giannakis", "Georgios B.", ""]]}, {"id": "1103.0795", "submitter": "Shiva Kumar Planjery", "authors": "Shiva Kumar Planjery, Bane Vasic, and David Declercq", "title": "Decimation-Enhanced Finite Alphabet Iterative Decoders for LDPC codes on\n  the BSC", "comments": "5 pages, 2 figures, submitted to ISIT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Finite alphabet iterative decoders (FAID) with multilevel messages that can\nsurpass BP in the error floor region for LDPC codes on the BSC were previously\nproposed. In this paper, we propose decimation-enhanced decoders. The technique\nof decimation which is incorporated into the message update rule, involves\nfixing certain bits of the code to a particular value. Under appropriately\nchosen rules, decimation can significantly reduce the number of iterations\nrequired to correct a fixed number of errors, while maintaining the good\nperformance of the original decoder in the error floor region. At the same\ntime, the algorithm is much more amenable to analysis. We shall provide a\nsimple decimation scheme for a particularly good 7-level FAID for column-weight\nthree codes on the BSC, that helps to correct a fixed number of errors in fewer\niterations, and provide insights into the analysis of the decoder. We shall\nalso examine the conditions under which the decimation-enhanced 7-level FAID\nperforms at least as good as the 7-level FAID.\n", "versions": [{"version": "v1", "created": "Thu, 3 Mar 2011 22:33:45 GMT"}], "update_date": "2011-03-07", "authors_parsed": [["Planjery", "Shiva Kumar", ""], ["Vasic", "Bane", ""], ["Declercq", "David", ""]]}, {"id": "1103.0801", "submitter": "Dung Nguyen", "authors": "Dung Viet Nguyen, Bane Vasic and Michael W. Marcellin", "title": "Two-Bit Bit Flipping Decoding of LDPC Codes", "comments": "6 pages. Submitted to IEEE International Symposium on Information\n  Theory 2011", "journal-ref": null, "doi": "10.1109/ISIT.2011.6033902", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a new class of bit flipping algorithms for\nlow-density parity-check (LDPC) codes over the binary symmetric channel (BSC).\nCompared to the regular (parallel or serial) bit flipping algorithms, the\nproposed algorithms employ one additional bit at a variable node to represent\nits \"strength.\" The introduction of this additional bit increases the\nguaranteed error correction capability by a factor of at least 2. An additional\nbit can also be employed at a check node to capture information which is\nbeneficial to decoding. A framework for failure analysis of the proposed\nalgorithms is described. These algorithms outperform the Gallager A/B algorithm\nand the min-sum algorithm at much lower complexity. Concatenation of two-bit\nbit flipping algorithms show a potential to approach the performance of belief\npropagation (BP) decoding in the error floor region, also at lower complexity.\n", "versions": [{"version": "v1", "created": "Thu, 3 Mar 2011 23:08:04 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Nguyen", "Dung Viet", ""], ["Vasic", "Bane", ""], ["Marcellin", "Michael W.", ""]]}, {"id": "1103.0875", "submitter": "Behzad Sharif", "authors": "Behzad Sharif and Yoram Bresler", "title": "Generic Feasibility of Perfect Reconstruction with Short FIR Filters in\n  Multi-channel Systems", "comments": "Manuscript submitted to IEEE Transactions on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2011.2166550", "report-no": null, "categories": "cs.IT math.IT math.NA math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the feasibility of short finite impulse response (FIR) synthesis for\nperfect reconstruction (PR) in generic FIR filter banks. Among all PR synthesis\nbanks, we focus on the one with the minimum filter length. For filter banks\nwith oversampling factors of at least two, we provide prescriptions for the\nshortest filter length of the synthesis bank that would guarantee PR almost\nsurely. The prescribed length is as short or shorter than the analysis filters\nand has an approximate inverse relationship with the oversampling factor. Our\nresults are in form of necessary and sufficient statements that hold\ngenerically, hence only fail for elaborately-designed nongeneric examples. We\nprovide extensive numerical verification of the theoretical results and\ndemonstrate that the gap between the derived filter length prescriptions and\nthe true minimum is small. The results have potential applications in synthesis\nFB design problems, where the analysis bank is given, and for analysis of\nfundamental limitations in blind signals reconstruction from data collected by\nunknown subsampled multi-channel systems.\n", "versions": [{"version": "v1", "created": "Fri, 4 Mar 2011 11:37:08 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Sharif", "Behzad", ""], ["Bresler", "Yoram", ""]]}, {"id": "1103.0920", "submitter": "Zoran Majkic", "authors": "Zoran Majkic", "title": "Reduction of Many-valued into Two-valued Modal Logics", "comments": "27 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we develop a 2-valued reduction of many-valued logics, into\n2-valued multi-modal logics. Such an approach is based on the contextualization\nof many-valued logics with the introduction of higher-order Herbrand\ninterpretation types, where we explicitly introduce the coexistence of a set of\nalgebraic truth values of original many-valued logic, transformed as parameters\n(or possible worlds), and the set of classic two logic values. This approach is\nclose to the approach used in annotated logics, but offers the possibility of\nusing the standard semantics based on Herbrand interpretations. Moreover, it\nuses the properties of the higher-order Herbrand types, as their fundamental\nnature is based on autoreferential Kripke semantics where the possible worlds\nare algebraic truth-values of original many-valued logic. This autoreferential\nKripke semantics, which has the possibility of flattening higher-order Herbrand\ninterpretations into ordinary 2-valued Herbrand interpretations, gives us a\nclearer insight into the relationship between many-valued and 2-valued\nmulti-modal logics. This methodology is applied to the class of many-valued\nLogic Programs, where reduction is done in a structural way, based on the logic\nstructure (logic connectives) of original many-valued logics. Following this,\nwe generalize the reduction to general structural many-valued logics, in an\nabstract way, based on Suszko's informal non-constructive idea. In all cases,\nby using developed 2-valued reductions we obtain a kind of non truth-valued\nmodal meta-logics, where two-valued formulae are modal sentences obtained by\napplication of particular modal operators to original many-valued formulae.\n", "versions": [{"version": "v1", "created": "Fri, 4 Mar 2011 15:21:37 GMT"}], "update_date": "2011-03-07", "authors_parsed": [["Majkic", "Zoran", ""]]}, {"id": "1103.0967", "submitter": "Zoran Majkic", "authors": "Zoran Majkic", "title": "Intensionality and Two-steps Interpretations", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we considered the extension of the First-order Logic (FOL) by\nBealer's intensional abstraction operator. Contemporary use of the term\n'intension' derives from the traditional logical Frege-Russell's doctrine that\nan idea (logic formula) has both an extension and an intension. Although there\nis divergence in formulation, it is accepted that the extension of an idea\nconsists of the subjects to which the idea applies, and the intension consists\nof the attributes implied by the idea. From the Montague's point of view, the\nmeaning of an idea can be considered as particular extensions in different\npossible worlds. In the case of the pure FOL we obtain commutative homomorphic\ndiagram that holds in each given possible world of the intensional FOL, from\nthe free algebra of the FOL syntax, toward its intensional algebra of concepts,\nand, successively, to the new extensional relational algebra (different from\nCylindric algebras). Then we show that it corresponds to the Tarski's\ninterpretation of the standard extensional FOL in this possible world.\n", "versions": [{"version": "v1", "created": "Fri, 4 Mar 2011 19:54:23 GMT"}], "update_date": "2011-03-07", "authors_parsed": [["Majkic", "Zoran", ""]]}, {"id": "1103.0996", "submitter": "Bernd Bandemer", "authors": "Bernd Bandemer and Abbas El Gamal", "title": "Communication with Disturbance Constraints", "comments": "25 pages, 10 figures; added vector Gaussian case, outer bound for the\n  deterministic channel with two disturbance constraints, and a new example;\n  submitted for publication to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the broadcast view of the interference channel, the new problem\nof communication with disturbance constraints is formulated. The\nrate-disturbance region is established for the single constraint case and the\noptimal encoding scheme turns out to be the same as the Han-Kobayashi scheme\nfor the two user-pair interference channel. This result is extended to the\nGaussian vector (MIMO) case. For the case of communication with two disturbance\nconstraints, inner and outer bounds on the rate-disturbance region for a\ndeterministic model are established. The inner bound is achieved by an encoding\nscheme that involves rate splitting, Marton coding, and superposition coding,\nand is shown to be optimal in several nontrivial cases. This encoding scheme\ncan be readily applied to discrete memoryless interference channels and\nmotivates a natural extension of the Han-Kobayashi scheme to more than two user\npairs.\n", "versions": [{"version": "v1", "created": "Fri, 4 Mar 2011 23:51:47 GMT"}, {"version": "v2", "created": "Tue, 8 Nov 2011 06:15:51 GMT"}], "update_date": "2011-11-09", "authors_parsed": [["Bandemer", "Bernd", ""], ["Gamal", "Abbas El", ""]]}, {"id": "1103.0999", "submitter": "MinJi Kim", "authors": "MinJi Kim, Elona Erez, Edmund M. Yeh, Muriel Medard", "title": "Deterministic Network Model Revisited: An Algebraic Network Coding\n  Approach", "comments": "19 pages, 19 figures, submitted to Transactions on Information Theory\n  (removed figures that were mistakenly included at the end of the document)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity of multiuser networks has been a long-standing problem in\ninformation theory. Recently, Avestimehr et al. have proposed a deterministic\nnetwork model to approximate multiuser wireless networks. This model, known as\nthe ADT network model, takes into account the broadcast nature of wireless\nmedium and interference.\n  We show that the ADT network model can be described within the algebraic\nnetwork coding framework introduced by Koetter and Medard. We prove that the\nADT network problem can be captured by a single matrix, and show that the\nmin-cut of an ADT network is the rank of this matrix; thus, eliminating the\nneed to optimize over exponential number of cuts between two nodes to compute\nthe min-cut of an ADT network. We extend the capacity characterization for ADT\nnetworks to a more general set of connections, including single\nunicast/multicast connection and non-multicast connections such as multiple\nmulticast, disjoint multicast, and two-level multicast. We also provide\nsufficiency conditions for achievability in ADT networks for any general\nconnection set. In addition, we show that random linear network coding, a\nrandomized distributed algorithm for network code construction, achieves the\ncapacity for the connections listed above. Furthermore, we extend the ADT\nnetworks to those with random erasures and cycles (thus, allowing\nbi-directional links).\n  In addition, we propose an efficient linear code construction for the\ndeterministic wireless multicast relay network model. Avestimehr et al.'s\nproposed code construction is not guaranteed to be efficient and may\npotentially involve an infinite block length. Unlike several previous coding\nschemes, we do not attempt to find flows in the network. Instead, for a layered\nnetwork, we maintain an invariant where it is required that at each stage of\nthe code construction, certain sets of codewords are linearly independent.\n", "versions": [{"version": "v1", "created": "Sat, 5 Mar 2011 02:27:19 GMT"}, {"version": "v2", "created": "Fri, 6 May 2011 16:10:27 GMT"}], "update_date": "2011-05-09", "authors_parsed": [["Kim", "MinJi", ""], ["Erez", "Elona", ""], ["Yeh", "Edmund M.", ""], ["Medard", "Muriel", ""]]}, {"id": "1103.1168", "submitter": "Yangyang Xu", "authors": "Yangyang Xu, Wotao Yin, Zaiwen Wen, Yin Zhang", "title": "An Alternating Direction Algorithm for Matrix Completion with\n  Nonnegative Factors", "comments": null, "journal-ref": "Frontiers of Mathematics in China 7(2), 365-384, 2012", "doi": "10.1007/s11464-012-0194-5", "report-no": null, "categories": "cs.IT cs.NA math.IT math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces an algorithm for the nonnegative matrix\nfactorization-and-completion problem, which aims to find nonnegative low-rank\nmatrices X and Y so that the product XY approximates a nonnegative data matrix\nM whose elements are partially known (to a certain accuracy). This problem\naggregates two existing problems: (i) nonnegative matrix factorization where\nall entries of M are given, and (ii) low-rank matrix completion where\nnonnegativity is not required. By taking the advantages of both nonnegativity\nand low-rankness, one can generally obtain superior results than those of just\nusing one of the two properties. We propose to solve the non-convex constrained\nleast-squares problem using an algorithm based on the classic alternating\ndirection augmented Lagrangian method. Preliminary convergence properties of\nthe algorithm and numerical simulation results are presented. Compared to a\nrecent algorithm for nonnegative matrix factorization, the proposed algorithm\nproduces factorizations of similar quality using only about half of the matrix\nentries. On tasks of recovering incomplete grayscale and hyperspectral images,\nthe proposed algorithm yields overall better qualities than those produced by\ntwo recent matrix-completion algorithms that do not exploit nonnegativity.\n", "versions": [{"version": "v1", "created": "Sun, 6 Mar 2011 22:27:52 GMT"}, {"version": "v2", "created": "Mon, 12 Dec 2011 22:43:08 GMT"}], "update_date": "2015-11-23", "authors_parsed": [["Xu", "Yangyang", ""], ["Yin", "Wotao", ""], ["Wen", "Zaiwen", ""], ["Zhang", "Yin", ""]]}, {"id": "1103.1178", "submitter": "Karthik Mohan", "authors": "Samet Oymak, Karthik Mohan, Maryam Fazel, Babak Hassibi", "title": "A Simplified Approach to Recovery Conditions for Low Rank Matrices", "comments": "6 pages, This is a modified version of a paper submitted to ISIT\n  2011; Proc. Intl. Symp. Info. Theory (ISIT), Aug 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.IT cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recovering sparse vectors and low-rank matrices from noisy linear\nmeasurements has been the focus of much recent research. Various reconstruction\nalgorithms have been studied, including $\\ell_1$ and nuclear norm minimization\nas well as $\\ell_p$ minimization with $p<1$. These algorithms are known to\nsucceed if certain conditions on the measurement map are satisfied. Proofs of\nrobust recovery for matrices have so far been much more involved than in the\nvector case.\n  In this paper, we show how several robust classes of recovery conditions can\nbe extended from vectors to matrices in a simple and transparent way, leading\nto the best known restricted isometry and nullspace conditions for matrix\nrecovery. Our results rely on the ability to \"vectorize\" matrices through the\nuse of a key singular value inequality.\n", "versions": [{"version": "v1", "created": "Mon, 7 Mar 2011 00:34:25 GMT"}, {"version": "v2", "created": "Sun, 27 Mar 2011 22:19:11 GMT"}, {"version": "v3", "created": "Wed, 9 Nov 2011 02:28:40 GMT"}], "update_date": "2011-11-10", "authors_parsed": [["Oymak", "Samet", ""], ["Mohan", "Karthik", ""], ["Fazel", "Maryam", ""], ["Hassibi", "Babak", ""]]}, {"id": "1103.1305", "submitter": "Hugo M\\'eric M", "authors": "Hugo M\\'eric, J\\'er\\^ome Lacan, Caroline Amiot-Bazile, Fabrice Arnal\n  and Marie-Laure Boucheret", "title": "Generic Approach for Hierarchical Modulation Performance Analysis:\n  Application to DVB-SH", "comments": "To appear in WTS 2011 proceedings", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Broadcasting systems have to deal with channel diversity in order to offer\nthe best rate to the users. Hierarchical modulation is a practical solution to\nprovide several rates in function of the channel quality. Unfortunately the\nperformance evaluation of such modulations requires time consuming simulations.\nWe propose in this paper a novel approach based on the channel capacity to\navoid these simulations. The method allows to study the performance in terms of\nspectrum efficiency of hierarchical and also classical modulations combined\nwith error correcting codes. Our method will be applied to the DVB-SH standard\nwhich considers hierarchical modulation as an optional feature.\n", "versions": [{"version": "v1", "created": "Mon, 7 Mar 2011 15:46:05 GMT"}], "update_date": "2011-03-08", "authors_parsed": [["Méric", "Hugo", ""], ["Lacan", "Jérôme", ""], ["Amiot-Bazile", "Caroline", ""], ["Arnal", "Fabrice", ""], ["Boucheret", "Marie-Laure", ""]]}, {"id": "1103.1306", "submitter": "Melda Yuksel", "authors": "Melda Yuksel, Xi Liu, Elza Erkip", "title": "A Secure Communication Game with a Relay Helping the Eavesdropper", "comments": "13 pages, 11 figures, to appear in IEEE Transactions on Information\n  Forensics and Security, Special Issue on Using the Physical Layer for\n  Securing the Next Generation of Communication Systems. This is the journal\n  version of cs.IT:0911.0089", "journal-ref": null, "doi": "10.1109/TIFS.2011.2125956", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work a four terminal complex Gaussian network composed of a source, a\ndestination, an eavesdropper and a jammer relay is studied under two different\nset of assumptions: (i) The jammer relay does not hear the source transmission,\nand (ii) The jammer relay is causally given the source message. In both cases\nthe jammer relay assists the eavesdropper and aims to decrease the achievable\nsecrecy rates. The source, on the other hand, aims to increase it. To help the\neavesdropper, the jammer relay can use pure relaying and/or send interference.\nEach of the problems is formulated as a two-player, non-cooperative, zero-sum\ncontinuous game. Assuming Gaussian strategies at the source and the jammer\nrelay in the first problem, the Nash equilibrium is found and shown to be\nachieved with mixed strategies in general. The optimal cumulative distribution\nfunctions (cdf) for the source and the jammer relay that achieve the value of\nthe game, which is the Nash equilibrium secrecy rate, are found. For the second\nproblem, the Nash equilibrium solution is found and the results are compared to\nthe case when the jammer relay is not informed about the source message.\n", "versions": [{"version": "v1", "created": "Mon, 7 Mar 2011 15:46:21 GMT"}], "update_date": "2011-03-08", "authors_parsed": [["Yuksel", "Melda", ""], ["Liu", "Xi", ""], ["Erkip", "Elza", ""]]}, {"id": "1103.1403", "submitter": "Nima Torabkhani", "authors": "Badri N. Vellambi, Nima Torabkhani, Faramarz Fekri", "title": "Study of Throughput and Delay in Finite-Buffer Line Networks", "comments": "5 pages, 8 figures, ITA 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we study the effects of finite buffers on the throughput and\ndelay of line networks with erasure links. We identify the calculation of\nperformance parameters such as throughput and delay to be equivalent to\ndetermining the stationary distribution of an irreducible Markov chain. We note\nthat the number of states in the Markov chain grows exponentially in the size\nof the buffers with the exponent scaling linearly with the number of hops in a\nline network. We then propose a simplified iterative scheme to approximately\nidentify the steady-state distribution of the chain by decoupling the chain to\nsmaller chains. The approximate solution is then used to understand the effect\nof buffer sizes on throughput and distribution of packet delay. Further, we\nclassify nodes based on congestion that yields an intelligent scheme for memory\nallocation using the proposed framework. Finally, by simulations we confirm\nthat our framework yields an accurate prediction of the variation of the\nthroughput and delay distribution.\n", "versions": [{"version": "v1", "created": "Mon, 7 Mar 2011 22:51:43 GMT"}], "update_date": "2011-03-09", "authors_parsed": [["Vellambi", "Badri N.", ""], ["Torabkhani", "Nima", ""], ["Fekri", "Faramarz", ""]]}, {"id": "1103.1424", "submitter": "Walid  Abediseid", "authors": "Walid Abediseid", "title": "On the Average Complexity of Sphere Decoding in Lattice Space-Time Coded\n  MIMO Channel", "comments": "16 Pages, 4 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The exact average complexity analysis of the basic sphere decoder for general\nspace-time codes applied to multiple-input multiple-output (MIMO) wireless\nchannel is known to be difficult. In this work, we shed the light on the\ncomputational complexity of sphere decoding for the quasi-static, LAttice\nSpace-Time (LAST) coded MIMO channel. Specifically, we drive an upper bound of\nthe tail distribution of the decoder's computational complexity. We show that,\nwhen the computational complexity exceeds a certain limit, this upper bound\nbecomes dominated by the outage probability achieved by LAST coding and sphere\ndecoding schemes. We then calculate the minimum average computational\ncomplexity that is required by the decoder to achieve near optimal performance\nin terms of the system parameters. Our results indicate that there exists a\ncut-off rate (multiplexing gain) for which the average complexity remains\nbounded.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 03:05:42 GMT"}, {"version": "v2", "created": "Tue, 20 Sep 2011 23:57:27 GMT"}, {"version": "v3", "created": "Tue, 5 Jun 2012 21:39:51 GMT"}], "update_date": "2012-06-07", "authors_parsed": [["Abediseid", "Walid", ""]]}, {"id": "1103.1432", "submitter": "Abdelaziz Marjane", "authors": "Abdelaziz Marjane, Abdellah Mokrane, Boufeldja Allailou", "title": "Vectorial Feedback with Carry Registers and Memory requirements", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In \\cite{marjane2010}, we have introduced vectorial conception of FCSR's in\nFibonacci mode. This conception allows us to easily analyze FCSR's over binary\nfinite fields $\\mathbb{F}_{2^{n}}$ for $n\\geq 2$. In \\cite{allailou2010}, we\ndescribe and study the corresponding Galois mode and use it to design a new\nstream cipher. In this paper, we introduce the Ring mode for vectorial FCSR,\nexplain the analysis of such Feedback registers and illustrate with a simple\nexample.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 04:24:31 GMT"}, {"version": "v2", "created": "Tue, 13 Sep 2011 19:52:40 GMT"}], "update_date": "2011-09-14", "authors_parsed": [["Marjane", "Abdelaziz", ""], ["Mokrane", "Abdellah", ""], ["Allailou", "Boufeldja", ""]]}, {"id": "1103.1439", "submitter": "Kazushi Mimura", "authors": "Kazushi Mimura, Masato Okada", "title": "Generating Functional Analysis for Iterative CDMA Multiuser Detectors", "comments": "28 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cond-mat.dis-nn math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the detection dynamics of a soft parallel interference\ncanceller (soft-PIC), which includes a hard-PIC as a special case, for\ncode-division multiple-access (CDMA) multiuser detection, applied to a randomly\nspread, fully synchronous base-band uncoded CDMA channel model with additive\nwhite Gaussian noise under perfect power control in the large-system limit. We\nanalyze the detection dynamics of some iterative detectors, namely soft-PIC,\nthe Onsager-reaction-cancelling parallel interference canceller (ORC-PIC) and\nthe belief-propagation-based detector (BP-based detector), by the generating\nfunctional analysis (GFA). The GFA allows us to study the asymptotic behavior\nof the dynamics in the infinitely large system without assuming the\nindependence of messages. We study the detection dynamics and the stationary\nestimates of an iterative algorithm.\n  We also show the decoupling principle in iterative multiuser detection\nalgorithms in the large-system limit. For a generic iterative multiuser\ndetection algorithm with binary input, it is shown that the multiuser channel\nis equivalent to a bank of independent single-user additive non-Gaussian\nchannels, whose signal-to-noise ratio degrades due to both the multiple-access\ninterference and the Onsager reaction, at each stage of the algorithm. If an\nalgorithm cancels the Onsager reaction, the equivalent single-user channels\ncoincide with an additive white Gaussian noise channel. We also discuss ORC-PIC\nand the BP-based detector.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 05:15:24 GMT"}, {"version": "v2", "created": "Fri, 10 Aug 2012 03:41:07 GMT"}, {"version": "v3", "created": "Tue, 10 Sep 2013 12:32:32 GMT"}], "update_date": "2013-09-11", "authors_parsed": [["Mimura", "Kazushi", ""], ["Okada", "Masato", ""]]}, {"id": "1103.1448", "submitter": "Hussein Al-Zubaidy", "authors": "Hussein Al-Zubaidy, Ioannis Lambadaris, Yannis Viniotis", "title": "Optimal Multi-Server Allocation to Parallel Queues With Independent\n  Random Queue-Server Connectivity", "comments": "53 single-column pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI cs.SY math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate an optimal scheduling problem in a discrete-time system of L\nparallel queues that are served by K identical, randomly connected servers.\nEach queue may be connected to a subset of the K servers during any given time\nslot. This model has been widely used in studies of emerging 3G/4G wireless\nsystems. We introduce the class of Most Balancing (MB) policies and provide\ntheir mathematical characterization. We prove that MB policies are optimal; we\ndefine optimality as minimization, in stochastic ordering sense, of a range of\ncost functions of the queue lengths, including the process of total number of\npackets in the system. We use stochastic coupling arguments for our proof. We\nintroduce the Least Connected Server First/Longest Connected Queue (LCSF/LCQ)\npolicy as an easy-to-implement approximation of MB policies. We conduct a\nsimulation study to compare the performance of several policies. The simulation\nresults show that: (a) in all cases, LCSF/LCQ approximations to the MB policies\noutperform the other policies, (b) randomized policies perform fairly close to\nthe optimal one, and, (c) the performance advantage of the optimal policy over\nthe other simulated policies increases as the channel connectivity probability\ndecreases and as the number of servers in the system increases.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 06:59:50 GMT"}, {"version": "v2", "created": "Thu, 17 Mar 2011 19:17:04 GMT"}, {"version": "v3", "created": "Fri, 8 Apr 2011 01:43:03 GMT"}], "update_date": "2016-10-05", "authors_parsed": [["Al-Zubaidy", "Hussein", ""], ["Lambadaris", "Ioannis", ""], ["Viniotis", "Yannis", ""]]}, {"id": "1103.1453", "submitter": "Jalaluddin Qureshi", "authors": "Jalaluddin Qureshi, Jianfei Cai and Chuan Heng Foh", "title": "Cooperative Retransmissions Through Collisions", "comments": "IEEE ICC 2011, Kyoto, Japan. 5 pages, 5 figures, 2 tables. Analog\n  Network Coding, Retransmission, Access Point, WLAN, interference, collision,\n  capacity, packet loss", "journal-ref": null, "doi": "10.1109/icc.2011.5962704", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Interference in wireless networks is one of the key capacity-limiting\nfactors. Recently developed interference-embracing techniques show promising\nperformance on turning collisions into useful transmissions. However, the\ninterference-embracing techniques are hard to apply in practical applications\ndue to their strict requirements. In this paper, we consider utilising the\ninterference-embracing techniques in a common scenario of two interfering\nsender-receiver pairs. By employing opportunistic listening and analog network\ncoding (ANC), we show that compared to traditional ARQ retransmission, a higher\nretransmission throughput can be achieved by allowing two interfering senders\nto cooperatively retransmit selected lost packets at the same time. This\nsimultaneous retransmission is facilitated by a simple handshaking procedure\nwithout introducing additional overhead. Simulation results demonstrate the\nsuperior performance of the proposed cooperative retransmission.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 07:41:02 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Qureshi", "Jalaluddin", ""], ["Cai", "Jianfei", ""], ["Foh", "Chuan Heng", ""]]}, {"id": "1103.1529", "submitter": "Alexander Shen", "authors": "Laurent Bienvenu, Peter Gacs, Mathieu Hoyrup, Cristobal Rojas,\n  Alexander Shen", "title": "Algorithmic tests and randomness with respect to a class of measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper considers quantitative versions of different randomness notions:\nalgorithmic test measures the amount of non-randomness (and is infinite for\nnon-random sequences). We start with computable measures on Cantor space (and\nMartin-Lof randomness), then consider uniform randomness (test is a function of\na sequence and a measure, not necessarily computable) and arbitrary\nconstructive metric spaces. We also consider tests for classes of measures, in\nparticular Bernoulli measures on Cantor space, and show how they are related to\nuniform tests and original Martin-Lof definition. We show that Hyppocratic\n(blind, oracle-free) randomness is equivalent to uniform randomness for\nmeasures in an effectively orthogonal effectively compact class. We also\nconsider the notions of sparse set and on-line randomness and show how they can\nbe expressed in our framework.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 13:43:06 GMT"}, {"version": "v2", "created": "Thu, 26 May 2011 14:20:22 GMT"}], "update_date": "2011-05-27", "authors_parsed": [["Bienvenu", "Laurent", ""], ["Gacs", "Peter", ""], ["Hoyrup", "Mathieu", ""], ["Rojas", "Cristobal", ""], ["Shen", "Alexander", ""]]}, {"id": "1103.1559", "submitter": "Eirik Rosnes", "authors": "Eirik Rosnes, Michael Helmling, and Alexandre Graell i Amat", "title": "Minimum Pseudoweight Analysis of 3-Dimensional Turbo Codes", "comments": "To appear in IEEE Transactions on Communications", "journal-ref": null, "doi": "10.1109/TCOMM.2014.2329690", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we consider pseudocodewords of (relaxed) linear programming\n(LP) decoding of 3-dimensional turbo codes (3D-TCs). We present a relaxed LP\ndecoder for 3D-TCs, adapting the relaxed LP decoder for conventional turbo\ncodes proposed by Feldman in his thesis. We show that the 3D-TC polytope is\nproper and $C$-symmetric, and make a connection to finite graph covers of the\n3D-TC factor graph. This connection is used to show that the support set of any\npseudocodeword is a stopping set of iterative decoding of 3D-TCs using maximum\na posteriori constituent decoders on the binary erasure channel. Furthermore,\nwe compute ensemble-average pseudoweight enumerators of 3D-TCs and perform a\nfinite-length minimum pseudoweight analysis for small cover degrees. Also, an\nexplicit description of the fundamental cone of the 3D-TC polytope is given.\nFinally, we present an extensive numerical study of small-to-medium block\nlength 3D-TCs, which shows that 1) typically (i.e., in most cases) when the\nminimum distance $d_{\\rm min}$ and/or the stopping distance $h_{\\rm min}$ is\nhigh, the minimum pseudoweight (on the additive white Gaussian noise channel)\nis strictly smaller than both the $d_{\\rm min}$ and the $h_{\\rm min}$, and 2)\nthe minimum pseudoweight grows with the block length, at least for\nsmall-to-medium block lengths.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 15:26:21 GMT"}, {"version": "v2", "created": "Thu, 19 Sep 2013 21:22:00 GMT"}, {"version": "v3", "created": "Thu, 13 Mar 2014 12:46:06 GMT"}, {"version": "v4", "created": "Fri, 6 Jun 2014 13:30:58 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Rosnes", "Eirik", ""], ["Helmling", "Michael", ""], ["Amat", "Alexandre Graell i", ""]]}, {"id": "1103.1598", "submitter": "Martin Haenggi", "authors": "Martin Haenggi", "title": "Mean Interference in Hard-Core Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mat\\'ern hard core processes of types I and II are the point processes of\nchoice to model concurrent transmitters in CSMA networks. We determine the mean\ninterference observed at a node of the process and compare it with the mean\ninterference in a Poisson point process of the same density. It turns out that\ndespite the similarity of the two models, they behave rather differently. For\ntype I, the excess interference (relative to the Poisson case) increases\nexponentially in the hard-core distance, while for type II, the gap never\nexceeds 1 dB.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 18:43:31 GMT"}], "update_date": "2011-03-09", "authors_parsed": [["Haenggi", "Martin", ""]]}, {"id": "1103.1672", "submitter": "Sanjay Karmakar", "authors": "Sanjay Karmakar and Mahesh K. Varanasi", "title": "The Generalized Degrees of Freedom of the MIMO Interference Channel", "comments": "5 pages, 8 figures; submitted to ISIT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The generalized degrees of freedom (GDoF) region of the MIMO Gaussian\ninterference channel is obtained for the general case with an arbitrary number\nof antennas at each node and where the SNR and interference-to-noise ratios\n(INRs) vary with arbitrary exponents to a nominal SNR. The GDoF region reveals\nvarious insights through the joint dependence of optimal interference\nmanagement techniques at high SNR on the SNR exponents that determine the\nrelative strengths of direct-link SNRs and cross-link INRs and the numbers of\nantennas at the four terminals. For instance, it permits an in-depth look at\nthe issue of rate-splitting and partial decoding at high SNR and it reveals\nthat, unlike in the SISO case, treating interference as noise is not GDoF\noptimal always even in the very weak interference regime. Moreover, while the\nDoF-optimal strategy that relies just on transmit/receive zero-forcing\nbeamforming and time-sharing is not GDoF optimal (and thus has an unbounded gap\nto capacity) the precise characterization of the very strong interference\nregime, where single-user DoF performance can be achieved simultaneously for\nboth users, depends on the relative numbers of antennas at the four terminals\nand thus deviates from what it is in the SISO case. For asymmetric numbers of\nantennas at the four nodes the shape of the symmetric GDoF curve can be a\n\"distorted W\" curve to the extent that for certain MIMO ICs it is a \"V\" curve.\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2011 00:23:31 GMT"}], "update_date": "2011-03-10", "authors_parsed": [["Karmakar", "Sanjay", ""], ["Varanasi", "Mahesh K.", ""]]}, {"id": "1103.1689", "submitter": "Morteza Ibrahimi", "authors": "Jos\\'e Bento and Morteza Ibrahimi and Andrea Montanari", "title": "Information Theoretic Limits on Learning Stochastic Differential\n  Equations", "comments": "6 pages, 2 figures, conference version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.LG math.IT math.ST q-fin.ST stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the problem of learning the drift coefficient of a stochastic\ndifferential equation from a sample path. In this paper, we assume that the\ndrift is parametrized by a high dimensional vector. We address the question of\nhow long the system needs to be observed in order to learn this vector of\nparameters. We prove a general lower bound on this time complexity by using a\ncharacterization of mutual information as time integral of conditional\nvariance, due to Kadota, Zakai, and Ziv. This general lower bound is applied to\nspecific classes of linear and non-linear stochastic differential equations. In\nthe linear case, the problem under consideration is the one of learning a\nmatrix of interaction coefficients. We evaluate our lower bound for ensembles\nof sparse and dense random matrices. The resulting estimates match the\nqualitative behavior of upper bounds achieved by computationally efficient\nprocedures.\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2011 02:03:17 GMT"}], "update_date": "2011-03-10", "authors_parsed": [["Bento", "José", ""], ["Ibrahimi", "Morteza", ""], ["Montanari", "Andrea", ""]]}, {"id": "1103.1742", "submitter": "Hugo M\\'eric", "authors": "Hugo M\\'eric, J\\'er\\^ome Lacan, Caroline Amiot-Bazile, Fabrice Arnal,\n  Marie-Laure Boucheret", "title": "Generic Approach for Hierarchical Modulation Performance Analysis:\n  Application to DVB-SH and DVB-S2", "comments": "Submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Broadcasting systems have to deal with channel variability in order to offer\nthe best rate to the users. Hierarchical modulation is a practical solution to\nprovide different rates to the receivers in function of the channel quality.\nUnfortunately, the performance evaluation of such modulations requires time\nconsuming simulations. We propose in this paper a novel approach based on the\nchannel capacity to avoid these simulations. The method allows to study the\nperformance of hierarchical and also classical modulations combined with error\ncorrecting codes. We will also compare hierarchical modulation with time\nsharing strategy in terms of achievable rates and indisponibility. Our work\nwill be applied to the DVB-SH and DVB-S2 standards, which both consider\nhierarchical modulation as an optional feature.\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2011 09:31:58 GMT"}], "update_date": "2011-03-10", "authors_parsed": [["Méric", "Hugo", ""], ["Lacan", "Jérôme", ""], ["Amiot-Bazile", "Caroline", ""], ["Arnal", "Fabrice", ""], ["Boucheret", "Marie-Laure", ""]]}, {"id": "1103.1784", "submitter": "Lin Chen", "authors": "Kehao Wang, Lin Chen", "title": "On the Optimality of Myopic Sensing in Multi-channel Opportunistic\n  Access: the Case of Sensing Multiple Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent works have developed a simple and robust myopic sensing policy for\nmulti-channel opportunistic communication systems where a secondary user (SU)\ncan access one of N i.i.d. Markovian channels. The optimality of the myopic\nsensing policy in maximizing the SU's cumulated reward is established under\ncertain conditions on channel parameters. This paper studies the generic case\nwhere the SU can sense more than one channel each time. By characterizing the\nmyopic sensing policy in this context, we establish analytically its optimality\nfor certain system setting when the SU is allowed to sense two channels. In the\nmore generic case, we construct counterexamples to show that the myopic sensing\npolicy, despite its simple structure, is non-optimal.\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2011 13:56:58 GMT"}], "update_date": "2011-03-10", "authors_parsed": [["Wang", "Kehao", ""], ["Chen", "Lin", ""]]}, {"id": "1103.1943", "submitter": "Andrea Montanari", "authors": "David Donoho, Iain Johnstone, Arian Maleki and Andrea Montanari", "title": "Compressed Sensing over $\\ell_p$-balls: Minimax Mean Square Error", "comments": "41 pages, 11 pdf figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the compressed sensing problem, where the object $x_0 \\in \\bR^N$\nis to be recovered from incomplete measurements $y = Ax_0 + z$; here the\nsensing matrix $A$ is an $n \\times N$ random matrix with iid Gaussian entries\nand $n < N$. A popular method of sparsity-promoting reconstruction is\n$\\ell^1$-penalized least-squares reconstruction (aka LASSO, Basis Pursuit).\n  It is currently popular to consider the strict sparsity model, where the\nobject $x_0$ is nonzero in only a small fraction of entries. In this paper, we\ninstead consider the much more broadly applicable $\\ell_p$-sparsity model,\nwhere $x_0$ is sparse in the sense of having $\\ell_p$ norm bounded by $\\xi\n\\cdot N^{1/p}$ for some fixed $0 < p \\leq 1$ and $\\xi > 0$.\n  We study an asymptotic regime in which $n$ and $N$ both tend to infinity with\nlimiting ratio $n/N = \\delta \\in (0,1)$, both in the noisy ($z \\neq 0$) and\nnoiseless ($z=0$) cases. Under weak assumptions on $x_0$, we are able to\nprecisely evaluate the worst-case asymptotic minimax mean-squared\nreconstruction error (AMSE) for $\\ell^1$ penalized least-squares: min over\npenalization parameters, max over $\\ell_p$-sparse objects $x_0$. We exhibit the\nasymptotically least-favorable object (hardest sparse signal to recover) and\nthe maximin penalization.\n  Our explicit formulas unexpectedly involve quantities appearing classically\nin statistical decision theory. Occurring in the present setting, they reflect\na deeper connection between penalized $\\ell^1$ minimization and scalar soft\nthresholding. This connection, which follows from earlier work of the authors\nand collaborators on the AMP iterative thresholding algorithm, is carefully\nexplained.\n  Our approach also gives precise results under weak-$\\ell_p$ ball coefficient\nconstraints, as we show here.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 06:04:40 GMT"}, {"version": "v2", "created": "Thu, 24 Mar 2011 02:01:08 GMT"}], "update_date": "2011-03-25", "authors_parsed": [["Donoho", "David", ""], ["Johnstone", "Iain", ""], ["Maleki", "Arian", ""], ["Montanari", "Andrea", ""]]}, {"id": "1103.1958", "submitter": "Peter Trifonov", "authors": "Peter Trifonov", "title": "On the Root Finding Step in List Decoding of Folded Reed-Solomon Codes", "comments": "Not accepted to IEEE Int. Symposium on Information Theory, 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The root finding step of the Guruswami-Rudra list decoding algorithm for\nfolded Reed-Solomon codes is considered. It is shown that a multivariate\ngeneralization of the Roth-Ruckenstein algorithm can be used to implement it.\nThis leads to an improved bound on the size of the list produced by the\ndecoder, as well as enables one to relax the constraints on the parameters of\nfolded codes. Furthermore, the class of time-domain folded Reed-Solomon codes\nis introduced, which can be efficiently list decoded with the Guruswami-Rudra\nalgorithm, and provides greater flexibility in parameter selection than the\nclassical (frequency-domain) folded codes.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 08:16:21 GMT"}, {"version": "v2", "created": "Mon, 26 Sep 2011 08:25:44 GMT"}, {"version": "v3", "created": "Tue, 9 Jul 2013 07:10:43 GMT"}], "update_date": "2013-07-10", "authors_parsed": [["Trifonov", "Peter", ""]]}, {"id": "1103.1991", "submitter": "Guoqiang Mao Dr", "authors": "Guoqiang Mao and Brian DO Anderson", "title": "Connectivity of Large Scale Networks: Emergence of Unique Unbounded\n  Component", "comments": "This paper has been withdrawn because of a latter version was\n  accepted into IEEE Transaction on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies networks where all nodes are distributed on a unit square\n$A\\triangleq[(-1/2,1/2)^{2}$ following a Poisson distribution with known\ndensity $\\rho$ and a pair of nodes separated by an Euclidean distance $x$ are\ndirectly connected with probability $g(\\frac{x}{r_{\\rho}})$, independent of the\nevent that any other pair of nodes are directly connected. Here\n$g:[0,\\infty)\\rightarrow[0,1]$ satisfies the conditions of rotational\ninvariance, non-increasing monotonicity, integral boundedness and\n$g(x)=o(\\frac{1}{x^{2}\\log^{2}x})$; further,\n$r_{\\rho}=\\sqrt{\\frac{\\log\\rho+b}{C\\rho}}$ where $C=\\int_{\\Re^{2}}g(\\Vert\n\\boldsymbol{x}\\Vert)d\\boldsymbol{x}$ and $b$ is a constant. Denote the above\nnetwork by\\textmd{}$\\mathcal{G}(\\mathcal{X}_{\\rho},g_{r_{\\rho}},A)$. We show\nthat as $\\rho\\rightarrow\\infty$, asymptotically almost surely a) there is no\ncomponent in $\\mathcal{G}(\\mathcal{X}_{\\rho},g_{r_{\\rho}},A)$ of fixed and\nfinite order $k>1$; b) the number of components with an unbounded order is one.\nTherefore as $\\rho\\rightarrow\\infty$, the network asymptotically almost surely\ncontains a unique unbounded component and isolated nodes only; a sufficient\ncondition for $\\mathcal{G}(\\mathcal{X}_{\\rho},g_{r_{\\rho}},A)$ to be\nasymptotically almost surely connected is that there is no isolated node in the\nnetwork.{\\normalsize{}}The contribution of these results, together with results\nin a companion paper on the asymptotic distribution of isolated nodes in\n\\textmd{\\normalsize $\\mathcal{G}(\\mathcal{X}_{\\rho},g_{r_{\\rho}},A)$}, is to\nexpand recent results obtained for connectivity of random geometric graphs from\nthe unit disk model to the more generic and more practical random connection\nmodel.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 11:01:40 GMT"}, {"version": "v2", "created": "Fri, 5 Oct 2012 00:17:45 GMT"}], "update_date": "2012-10-08", "authors_parsed": [["Mao", "Guoqiang", ""], ["Anderson", "Brian DO", ""]]}, {"id": "1103.1994", "submitter": "Guoqiang Mao Dr", "authors": "Guoqiang Mao and Brian DO Anderson", "title": "Connectivity of Large Scale Networks: Distribution of Isolated Nodes", "comments": "This paper has been withdrawn because of a latter version was\n  accepted into IEEE Transaction on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Connectivity is one of the most fundamental properties of wireless multi-hop\nnetworks. A network is said to be connected if there is a path between any pair\nof nodes. A convenient way to study the connectivity of a random network is by\ninvestigating the condition under which the network has no isolated node. The\ncondition under which the network has no isolated node provides a necessary\ncondition for a connected network. Further the condition for a network to have\nno isolated node and the condition for the network to be connected can often be\nshown to asymptotically converge to be the same as the number of nodes\napproaches infinity, given a suitably defined random network and connection\nmodel. Currently analytical results on the distribution of the number of\nisolated nodes only exist for the unit disk model. This study advances research\nin the area by providing the asymptotic distribution of the number of isolated\nnodes in random networks with nodes Poissonly distributed on a unit square\nunder a generic random connection model. On that basis we derive a necessary\ncondition for the above network to be asymptotically almost surely connected.\nThese results, together with results in a companion paper on the sufficient\ncondition for a network to be connected, expand recent results obtained for\nconnectivity of random geometric graphs assuming a unit disk model to results\nassuming a more generic and more practical random connection model.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 11:16:50 GMT"}, {"version": "v2", "created": "Fri, 5 Oct 2012 00:15:05 GMT"}], "update_date": "2012-10-08", "authors_parsed": [["Mao", "Guoqiang", ""], ["Anderson", "Brian DO", ""]]}, {"id": "1103.2046", "submitter": "Caner Nazaroglu", "authors": "Caner Nazaroglu, Ayfer Ozgur, Christina Fragouli", "title": "Wireless Network Simplification: the Gaussian N-Relay Diamond Network", "comments": "Submitted to Transactions on Information Theory in October 2012. The\n  new version includes discussions on the algorithmic complexity of discovering\n  a high-capacity subnetwork and on the performance of amplify-and-forward", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the Gaussian N-relay diamond network, where a source wants to\ncommunicate to a destination node through a layer of N-relay nodes. We\ninvestigate the following question: what fraction of the capacity can we\nmaintain by using only k out of the N available relays? We show that\nindependent of the channel configurations and the operating SNR, we can always\nfind a subset of k relays which alone provide a rate (kC/(k+1))-G, where C is\nthe information theoretic cutset upper bound on the capacity of the whole\nnetwork and G is a constant that depends only on N and k (logarithmic in N and\nlinear in k). In particular, for k = 1, this means that half of the capacity of\nany N-relay diamond network can be approximately achieved by routing\ninformation over a single relay. We also show that this fraction is tight:\nthere are configurations of the N-relay diamond network where every subset of k\nrelays alone can at most provide approximately a fraction k/(k+1) of the total\ncapacity. These high-capacity k-relay subnetworks can be also discovered\nefficiently. We propose an algorithm that computes a constant gap approximation\nto the capacity of the Gaussian N-relay diamond network in O(N log N) running\ntime and discovers a high-capacity k-relay subnetwork in O(kN) running time.\n  This result also provides a new approximation to the capacity of the Gaussian\nN-relay diamond network which is hybrid in nature: it has both multiplicative\nand additive gaps. In the intermediate SNR regime, this hybrid approximation is\ntighter than existing purely additive or purely multiplicative approximations\nto the capacity of this network.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 14:25:20 GMT"}, {"version": "v2", "created": "Wed, 14 Nov 2012 21:38:56 GMT"}], "update_date": "2012-11-16", "authors_parsed": [["Nazaroglu", "Caner", ""], ["Ozgur", "Ayfer", ""], ["Fragouli", "Christina", ""]]}, {"id": "1103.2071", "submitter": "Lei Jiang", "authors": "Jiang Lei, Zhu Han, M. A. V\\'azquez-Castro and Are Hj{\\o}rungnes", "title": "Secure Satellite Communication Systems Design with Individual Secrecy\n  Rate Constraints", "comments": "34 pages, 10 figures, 1 table, submitted to \"Transactions on\n  Information Forensics and Security\"", "journal-ref": null, "doi": "10.1109/TIFS.2011.2148716", "report-no": null, "categories": "cs.IT cs.CR cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study multibeam satellite secure communication through\nphysical (PHY) layer security techniques, i.e., joint power control and\nbeamforming. By first assuming that the Channel State Information (CSI) is\navailable and the beamforming weights are fixed, a novel secure satellite\nsystem design is investigated to minimize the transmit power with individual\nsecrecy rate constraints. An iterative algorithm is proposed to obtain an\noptimized power allocation strategy. Moreover, sub-optimal beamforming weights\nare obtained by completely eliminating the co-channel interference and nulling\nthe eavesdroppers' signal simultaneously. In order to obtain jointly optimized\npower allocation and beamforming strategy in some practical cases, e.g., with\ncertain estimation errors of the CSI, we further evaluate the impact of the\neavesdropper's CSI on the secure multibeam satellite system design. The\nconvergence of the iterative algorithm is proven under justifiable assumptions.\nThe performance is evaluated by taking into account the impact of the number of\nantenna elements, number of beams, individual secrecy rate requirement, and\nCSI. The proposed novel secure multibeam satellite system design can achieve\noptimized power allocation to ensure the minimum individual secrecy rate\nrequirement. The results show that the joint beamforming scheme is more\nfavorable than fixed beamforming scheme, especially in the cases of a larger\nnumber of satellite antenna elements and higher secrecy rate requirement.\nFinally, we compare the results under the current satellite air-interface in\nDVB-S2 and the results under Gaussian inputs.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 16:25:07 GMT"}, {"version": "v2", "created": "Fri, 11 Mar 2011 08:46:12 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Lei", "Jiang", ""], ["Han", "Zhu", ""], ["Vázquez-Castro", "M. A.", ""], ["Hjørungnes", "Are", ""]]}, {"id": "1103.2172", "submitter": "Leonardo Rey Vega", "authors": "Andres Altieri, Leonardo Rey Vega, Cecilia G. Galarza and Pablo\n  Piantanida", "title": "Cooperative Strategies for Interference-Limited Wireless Networks", "comments": "5 pages and 4 figures. Submitted to ISIT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the communication of a single-user aided by a nearby relay involved\nin a large wireless network where the nodes form an homogeneous Poisson point\nprocess. Since this network is interference-limited the asymptotic error\nprobability is bounded from above by the outage probability experienced by the\nuser. We investigate the outage behavior for the well-known cooperative\nschemes, namely, decode-and-forward (DF) and compress-and-forward (CF). In this\nsetting, the outage events are induced by both fading and the spatial proximity\nof neighbor nodes who generate the strongest interference and hence the worst\ncommunication case. Upper and lower bounds on the asymptotic error probability\nwhich are tight in some cases are derived. It is shown that there exists a\nclear trade off between the network density and the benefits of user\ncooperation. These results are useful to evaluate performances and to optimize\nrelaying schemes in the context of large wireless networks.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2011 00:07:05 GMT"}], "update_date": "2011-03-14", "authors_parsed": [["Altieri", "Andres", ""], ["Vega", "Leonardo Rey", ""], ["Galarza", "Cecilia G.", ""], ["Piantanida", "Pablo", ""]]}, {"id": "1103.2177", "submitter": "Harpreet S. Dhillon", "authors": "Harpreet S. Dhillon, Radha Krishna Ganti, Francois Baccelli and\n  Jeffrey G. Andrews", "title": "Modeling and Analysis of K-Tier Downlink Heterogeneous Cellular Networks", "comments": "IEEE Journal on Selected Areas in Communications, vol. 30, no. 3, pp.\n  550 - 560, Apr. 2012", "journal-ref": null, "doi": "10.1109/JSAC.2012.120405", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cellular networks are in a major transition from a carefully planned set of\nlarge tower-mounted base-stations (BSs) to an irregular deployment of\nheterogeneous infrastructure elements that often additionally includes micro,\npico, and femtocells, as well as distributed antennas. In this paper, we\ndevelop a tractable, flexible, and accurate model for a downlink heterogeneous\ncellular network (HCN) consisting of K tiers of randomly located BSs, where\neach tier may differ in terms of average transmit power, supported data rate\nand BS density. Assuming a mobile user connects to the strongest candidate BS,\nthe resulting Signal-to-Interference-plus-Noise-Ratio (SINR) is greater than 1\nwhen in coverage, Rayleigh fading, we derive an expression for the probability\nof coverage (equivalently outage) over the entire network under both open and\nclosed access, which assumes a strikingly simple closed-form in the high SINR\nregime and is accurate down to -4 dB even under weaker assumptions. For\nexternal validation, we compare against an actual LTE network (for tier 1) with\nthe other K-1 tiers being modeled as independent Poisson Point Processes. In\nthis case as well, our model is accurate to within 1-2 dB. We also derive the\naverage rate achieved by a randomly located mobile and the average load on each\ntier of BSs. One interesting observation for interference-limited open access\nnetworks is that at a given SINR, adding more tiers and/or BSs neither\nincreases nor decreases the probability of coverage or outage when all the\ntiers have the same target-SINR.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2011 00:51:27 GMT"}, {"version": "v2", "created": "Mon, 14 Mar 2011 21:48:55 GMT"}, {"version": "v3", "created": "Thu, 29 Mar 2012 04:09:57 GMT"}, {"version": "v4", "created": "Sun, 23 Dec 2012 23:09:23 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Dhillon", "Harpreet S.", ""], ["Ganti", "Radha Krishna", ""], ["Baccelli", "Francois", ""], ["Andrews", "Jeffrey G.", ""]]}, {"id": "1103.2240", "submitter": "Xin Kang", "authors": "Xin Kang, Rui Zhang, and Mehul Motani", "title": "Price-Based Resource Allocation for Spectrum-Sharing Femtocell Networks:\n  A Stackelberg Game Approach", "comments": "27 pages, 7 figures, Submitted to JSAC", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the price-based resource allocation strategies for\nthe uplink transmission of a spectrum-sharing femtocell network, in which a\ncentral macrocell is underlaid with distributed femtocells, all operating over\nthe same frequency band as the macrocell. Assuming that the macrocell base\nstation (MBS) protects itself by pricing the interference from the femtocell\nusers, a Stackelberg game is formulated to study the joint utility maximization\nof the macrocell and the femtocells subject to a maximum tolerable interference\npower constraint at the MBS. Especially, two practical femtocell channel\nmodels: sparsely deployed scenario for rural areas and densely deployed\nscenario for urban areas, are investigated. For each scenario, two pricing\nschemes: uniform pricing and non-uniform pricing, are proposed. Then, the\nStackelberg equilibriums for these proposed games are studied, and an effective\ndistributed interference price bargaining algorithm with guaranteed convergence\nis proposed for the uniform-pricing case. Finally, numerical examples are\npresented to verify the proposed studies. It is shown that the proposed\nalgorithms are effective in resource allocation and macrocell protection\nrequiring minimal network overhead for spectrum-sharing-based two-tier\nfemtocell networks.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2011 10:44:51 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Kang", "Xin", ""], ["Zhang", "Rui", ""], ["Motani", "Mehul", ""]]}, {"id": "1103.2289", "submitter": "Venkatesh Saligrama", "authors": "Venkatesh Saligrama and Murat Alanyali", "title": "A Token Based Algorithm to Distributed Computation in Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.IT cs.SY math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider distributed algorithms for data aggregation and function\ncomputation in sensor networks. The algorithms perform pairwise computations\nalong edges of an underlying communication graph. A token is associated with\neach sensor node, which acts as a transmission permit. Nodes with active tokens\nhave transmission permits; they generate messages at a constant rate and send\neach message to a randomly selected neighbor. By using different strategies to\ncontrol the transmission permits we can obtain tradeoffs between message and\ntime complexity. Gossip corresponds to the case when all nodes have permits all\nthe time. We study algorithms where permits are revoked after transmission and\nrestored upon reception. Examples of such algorithms include Simple-Random\nWalk(SRW), Coalescent-Random-Walk(CRW) and Controlled Flooding(CFLD) and their\nhybrid variants. SRW has a single node permit, which is passed on in the\nnetwork. CRW, initially initially has a permit for each node but these permits\nare revoked gradually. The final result for SRW and CRW resides at a single(or\nfew) random node(s) making a direct comparison with GOSSIP difficult. A hybrid\ntwo-phase algorithm switching from CRW to CFLD at a suitable pre-determined\ntime can be employed to achieve consensus. We show that such hybrid variants\nachieve significant gains in both message and time complexity. The per-node\nmessage complexity for n-node graphs, such as 2D mesh, torii, and Random\ngeometric graphs, scales as $O(polylog(n))$ and the corresponding time\ncomplexity scales as O(n). The reduced per-node message complexity leads to\nreduced energy utilization in sensor networks.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2011 15:08:12 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Saligrama", "Venkatesh", ""], ["Alanyali", "Murat", ""]]}, {"id": "1103.2351", "submitter": "Szymon Grabowski", "authors": "Szymon Grabowski, Sebastian Deorowicz", "title": "Engineering Relative Compression of Genomes", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.IT math.IT q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Technology progress in DNA sequencing boosts the genomic database growth at\nfaster and faster rate. Compression, accompanied with random access\ncapabilities, is the key to maintain those huge amounts of data. In this paper\nwe present an LZ77-style compression scheme for relative compression of\nmultiple genomes of the same species. While the solution bears similarity to\nknown algorithms, it offers significantly higher compression ratios at\ncompression speed over a order of magnitude greater. One of the new successful\nideas is augmenting the reference sequence with phrases from the other\nsequences, making more LZ-matches available.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2011 19:27:20 GMT"}], "update_date": "2011-03-14", "authors_parsed": [["Grabowski", "Szymon", ""], ["Deorowicz", "Sebastian", ""]]}, {"id": "1103.2411", "submitter": "Alexis Akira Toda", "authors": "Alexis Akira Toda", "title": "Unification of Maximum Entropy and Bayesian Inference via Plausible\n  Reasoning", "comments": "Submitted to IEEE Transactions on Information Theory on March 8, 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.ST physics.data-an stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper modifies Jaynes's axioms of plausible reasoning and derives the\nminimum relative entropy principle, Bayes's rule, as well as maximum likelihood\nfrom first principles. The new axioms, which I call the Optimum Information\nPrinciple, is applicable whenever the decision maker is given the data and the\nrelevant background information. These axioms provide an answer to the question\n\"why maximize entropy when faced with incomplete information?\"\n", "versions": [{"version": "v1", "created": "Sat, 12 Mar 2011 01:32:24 GMT"}, {"version": "v2", "created": "Mon, 21 Mar 2011 20:54:37 GMT"}, {"version": "v3", "created": "Sat, 26 Mar 2011 20:21:06 GMT"}, {"version": "v4", "created": "Tue, 29 Mar 2011 00:17:16 GMT"}], "update_date": "2011-03-30", "authors_parsed": [["Toda", "Alexis Akira", ""]]}, {"id": "1103.2431", "submitter": "Stefano Marano", "authors": "Stefano Marano, Vincenzo Matta, Ting He, Lang Tong", "title": "The Embedding Capacity of Information Flows Under Renewal Traffic", "comments": "Sumbitted to IEEE Trans. on Information Theory on March 10, 2011", "journal-ref": null, "doi": "10.1109/TIT.2012.2227672", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given two independent point processes and a certain rule for matching points\nbetween them, what is the fraction of matched points over infinitely long\nstreams? In many application contexts, e.g., secure networking, a meaningful\nmatching rule is that of a maximum causal delay, and the problem is related to\nembedding a flow of packets in cover traffic such that no traffic analysis can\ndetect it. We study the best undetectable embedding policy and the\ncorresponding maximum flow rate ---that we call the embedding capacity--- under\nthe assumption that the cover traffic can be modeled as arbitrary renewal\nprocesses. We find that computing the embedding capacity requires the inversion\nof very structured linear systems that, for a broad range of renewal models\nencountered in practice, admits a fully analytical expression in terms of the\nrenewal function of the processes. Our main theoretical contribution is a\nsimple closed form of such relationship. This result enables us to explore\nproperties of the embedding capacity, obtaining closed-form solutions for\nselected distribution families and a suite of sufficient conditions on the\ncapacity ordering. We evaluate our solution on real network traces, which shows\na noticeable match for tight delay constraints. A gap between the predicted and\nthe actual embedding capacities appears for looser constraints, and further\ninvestigation reveals that it is caused by inaccuracy of the renewal traffic\nmodel rather than of the solution itself.\n", "versions": [{"version": "v1", "created": "Sat, 12 Mar 2011 09:38:30 GMT"}, {"version": "v2", "created": "Tue, 15 Mar 2011 17:18:16 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Marano", "Stefano", ""], ["Matta", "Vincenzo", ""], ["He", "Ting", ""], ["Tong", "Lang", ""]]}, {"id": "1103.2469", "submitter": "Jorge Silva PhD", "authors": "Jorge Silva, Minhua Chen, Yonina C. Eldar, Guillermo Sapiro, Lawrence\n  Carin", "title": "Blind Compressed Sensing Over a Structured Union of Subspaces", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the problem of simultaneous signal recovery and\ndictionary learning based on compressive measurements. Multiple signals are\nanalyzed jointly, with multiple sensing matrices, under the assumption that the\nunknown signals come from a union of a small number of disjoint subspaces. This\nproblem is important, for instance, in image inpainting applications, in which\nthe multiple signals are constituted by (incomplete) image patches taken from\nthe overall image. This work extends standard dictionary learning and\nblock-sparse dictionary optimization, by considering compressive measurements,\ne.g., incomplete data). Previous work on blind compressed sensing is also\ngeneralized by using multiple sensing matrices and relaxing some of the\nrestrictions on the learned dictionary. Drawing on results developed in the\ncontext of matrix completion, it is proven that both the dictionary and signals\ncan be recovered with high probability from compressed measurements. The\nsolution is unique up to block permutations and invertible linear\ntransformations of the dictionary atoms. The recovery is contingent on the\nnumber of measurements per signal and the number of signals being sufficiently\nlarge; bounds are derived for these quantities. In addition, this paper\npresents a computationally practical algorithm that performs dictionary\nlearning and signal recovery, and establishes conditions for its convergence to\na local optimum. Experimental results for image inpainting demonstrate the\ncapabilities of the method.\n", "versions": [{"version": "v1", "created": "Sat, 12 Mar 2011 18:15:58 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Silva", "Jorge", ""], ["Chen", "Minhua", ""], ["Eldar", "Yonina C.", ""], ["Sapiro", "Guillermo", ""], ["Carin", "Lawrence", ""]]}, {"id": "1103.2501", "submitter": "Anas Chaaban", "authors": "Anas Chaaban, Aydin Sezgin, Bernd Bandemer, Arogyaswami Paulraj", "title": "On Gaussian Multiple Access Channels with Interference: Achievable Rates\n  and Upper Bounds", "comments": "submitted to MACOM 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the interaction between two interfering Gaussian 2-user multiple\naccess channels. The capacity region is characterized under mixed\nstrong--extremely strong interference and individually very strong\ninterference. Furthermore, the sum capacity is derived under a less restricting\ndefinition of very strong interference. Finally, a general upper bound on the\nsum capacity is provided, which is nearly tight for weak cross links.\n", "versions": [{"version": "v1", "created": "Sun, 13 Mar 2011 06:57:41 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Chaaban", "Anas", ""], ["Sezgin", "Aydin", ""], ["Bandemer", "Bernd", ""], ["Paulraj", "Arogyaswami", ""]]}, {"id": "1103.2503", "submitter": "Chengling Jiang", "authors": "Chunliang Yang, Chengling Jiang", "title": "Coded Single-Tone Signaling for Resource Coordination and Interference\n  Management in Femtocell Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Resource coordination and interference management is the key to achieving the\nbenefits of femtocell networks. Over-the-air signaling is one of the most\neffective means for distributed dynamic resource coordination and interference\nmanagement. However, the design of this type of signal is challenging. In this\nletter, we address the challenges and propose an effective solution, referred\nto as coded single-tone signaling (STS). The proposed coded STS scheme\npossesses certain highly desirable properties, such as no dedicated resource\nrequirement (no overhead), no near-and-far effect, no inter-signal interference\n(no multi-user interference), low peak-to-average power ratio (deep coverage).\nIn addition, the proposed coded STS can fully exploit frequency diversity and\nprovides a means for high quality wideband channel estimation. The coded STS\ndesign is demonstrated through a concrete numerical example. Performance of the\nproposed coded STS is evaluated through simulations.\n", "versions": [{"version": "v1", "created": "Sun, 13 Mar 2011 07:26:30 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Yang", "Chunliang", ""], ["Jiang", "Chengling", ""]]}, {"id": "1103.2544", "submitter": "Tarik Kaced", "authors": "Tarik Kaced", "title": "Almost-perfect secret sharing", "comments": "Acknowledgments added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Splitting a secret s between several participants, we generate (for each\nvalue of s) shares for all participants. The goal: authorized groups of\nparticipants should be able to reconstruct the secret but forbidden ones get no\ninformation about it. In this paper we introduce several notions of non-\nperfect secret sharing, where some small information leak is permitted. We\nstudy its relation to the Kolmogorov complexity version of secret sharing\n(establishing some connection in both directions) and the effects of changing\nthe secret size (showing that we can decrease the size of the secret and the\ninformation leak at the same time).\n", "versions": [{"version": "v1", "created": "Sun, 13 Mar 2011 19:07:37 GMT"}, {"version": "v2", "created": "Sat, 2 Jul 2011 17:13:49 GMT"}, {"version": "v3", "created": "Thu, 17 Nov 2011 13:00:33 GMT"}], "update_date": "2011-11-18", "authors_parsed": [["Kaced", "Tarik", ""]]}, {"id": "1103.2545", "submitter": "Andrei Romashchenko", "authors": "Tarik Kaced and Andrei Romashchenko", "title": "On essentially conditional information inequalities", "comments": "v4: substantial corrections; 13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 1997, Z.Zhang and R.W.Yeung found the first example of a conditional\ninformation inequality in four variables that is not \"Shannon-type\". This\nlinear inequality for entropies is called conditional (or constraint) since it\nholds only under condition that some linear equations are satisfied for the\ninvolved entropies. Later, the same authors and other researchers discovered\nseveral unconditional information inequalities that do not follow from\nShannon's inequalities for entropy.\n  In this paper we show that some non Shannon-type conditional inequalities are\n\"essentially\" conditional, i.e., they cannot be extended to any unconditional\ninequality. We prove one new essentially conditional information inequality for\nShannon's entropy and discuss conditional information inequalities for\nKolmogorov complexity.\n", "versions": [{"version": "v1", "created": "Sun, 13 Mar 2011 19:35:18 GMT"}, {"version": "v2", "created": "Fri, 20 May 2011 16:55:29 GMT"}, {"version": "v3", "created": "Tue, 31 May 2011 19:50:07 GMT"}, {"version": "v4", "created": "Mon, 26 Sep 2011 17:18:05 GMT"}], "update_date": "2011-09-27", "authors_parsed": [["Kaced", "Tarik", ""], ["Romashchenko", "Andrei", ""]]}, {"id": "1103.2560", "submitter": "Sanjay Karmakar", "authors": "Sanjay Karmakar and Mahesh K. Varanasi", "title": "The Generalized Degrees of Freedom Region of the MIMO Interference\n  Channel", "comments": "38 pages, 14 figures. Submitted to Trans. of IT", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The generalized degrees of freedom (GDoF) region of the MIMO Gaussian\ninterference channel (IC) is obtained for the general case of an arbitrary\nnumber of antennas at each node and where the signal-to-noise ratios (SNR) and\ninterference-to-noise ratios (INR) vary with arbitrary exponents to a nominal\nSNR. The GDoF region reveals various insights through the joint dependence of\noptimal interference management techniques (at high SNR) on the SNR exponents\nthat determine the relative strengths of direct-link SNRs and cross-link INRs\nand the numbers of antennas at the four terminals. For instance, it permits an\nin-depth look at the issue of rate-splitting and partial decoding and it\nreveals that, unlike in the scalar IC, treating interference as noise is not\nalways GDoF-optimal even in the very weak interference regime. Moreover, while\nthe DoF-optimal strategy that relies just on transmit/receive zero-forcing\nbeamforming and time-sharing is not GDoF optimal (and thus has an unbounded gap\nto capacity), the precise characterization of the very strong interference\nregime -- where single-user DoF performance can be achieved simultaneously for\nboth users-- depends on the relative numbers of antennas at the four terminals\nand thus deviates from what it is in the SISO case. For asymmetric numbers of\nantennas at the four nodes the shape of the symmetric GDoF curve can be a\n\"distorted W\" curve to the extent that for certain MIMO ICs it is a \"V\" curve.\n", "versions": [{"version": "v1", "created": "Sun, 13 Mar 2011 23:11:36 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Karmakar", "Sanjay", ""], ["Varanasi", "Mahesh K.", ""]]}, {"id": "1103.2573", "submitter": "Tian Peng Ren", "authors": "Tian Peng Ren, Yong Liang Guan, Chau Yuen, Yue Zhou and Er Yang Zhang", "title": "Optimization of Fast-Decodable Full-Rate STBC with Non-Vanishing\n  Determinants", "comments": "Accepted by IEEE Transactions on Communications", "journal-ref": null, "doi": "10.1109/TCOMM.2011.050911.090148", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Full-rate STBC (space-time block codes) with non-vanishing determinants\nachieve the optimal diversity-multiplexing tradeoff but incur high decoding\ncomplexity. To permit fast decoding, Sezginer, Sari and Biglieri proposed an\nSTBC structure with special QR decomposition characteristics. In this paper, we\nadopt a simplified form of this fast-decodable code structure and present a new\nway to optimize the code analytically. We show that the signal constellation\ntopology (such as QAM, APSK, or PSK) has a critical impact on the existence of\nnon-vanishing determinants of the full-rate STBC. In particular, we show for\nthe first time that, in order for APSK-STBC to achieve non-vanishing\ndeterminant, an APSK constellation topology with constellation points lying on\nsquare grid and ring radius $\\sqrt{m^2+n^2} (m,n\\emph{\\emph{integers}})$ needs\nto be used. For signal constellations with vanishing determinants, we present a\nmethodology to analytically optimize the full-rate STBC at specific\nconstellation dimension.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 02:34:24 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Ren", "Tian Peng", ""], ["Guan", "Yong Liang", ""], ["Yuen", "Chau", ""], ["Zhou", "Yue", ""], ["Zhang", "Er Yang", ""]]}, {"id": "1103.2574", "submitter": "Tom Leinster", "authors": "Tom Leinster", "title": "A multiplicative characterization of the power means", "comments": "7 pages. Version 3: references added; minor edits", "journal-ref": "Bulletin of the London Mathematical Society 44 (2012), 106-112", "doi": "10.1112/blms/bdr073", "report-no": null, "categories": "math.FA cs.IT math.CA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A startlingly simple characterization of the p-norms has recently been found\nby Aubrun and Nechita (arXiv:1102.2618) and by Fernandez-Gonzalez, Palazuelos\nand Perez-Garcia. We deduce a simple characterization of the power means of\norder greater than or equal to 1.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 02:46:37 GMT"}, {"version": "v2", "created": "Sun, 20 Mar 2011 03:01:20 GMT"}, {"version": "v3", "created": "Wed, 8 Jun 2011 21:31:05 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Leinster", "Tom", ""]]}, {"id": "1103.2580", "submitter": "Inder Jeet Taneja", "authors": "Inder Jeet Taneja", "title": "Inequalities Among Logarithmic-Mean Measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we shall consider some famous means such as arithmetic,\nharmonic, geometric, logarithmic means, etc. Inequalities involving logarithmic\nmean with differences among other means are presented\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 03:33:45 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Taneja", "Inder Jeet", ""]]}, {"id": "1103.2607", "submitter": "Reza Asvadi", "authors": "Reza Asvadi, Amir H. Banihashemi, Mahmoud Ahmadian-Attari, and Hamid\n  Saeedi", "title": "LLR Approximation for Wireless Channels Based on Taylor Series and Its\n  Application to BICM with LDPC Codes", "comments": "submitted to IEEE Trans. Commun", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new approach for the approximation of the channel log-likelihood ratio\n(LLR) for wireless channels based on Taylor series is proposed. The\napproximation is applied to the uncorrelated flat Rayleigh fading channel with\nunknown channel state information at the receiver. It is shown that the\nproposed approximation greatly simplifies the calculation of channel LLRs, and\nyet provides results almost identical to those based on the exact calculation\nof channel LLRs. The results are obtained in the context of bit-interleaved\ncoded modulation (BICM) schemes with low-density parity-check (LDPC) codes, and\ninclude threshold calculations and error rate performance of finite-length\ncodes. Compared to the existing approximations, the proposed method is either\nsignificantly less complex, or considerably more accurate.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 09:24:21 GMT"}, {"version": "v2", "created": "Tue, 15 Mar 2011 09:44:26 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Asvadi", "Reza", ""], ["Banihashemi", "Amir H.", ""], ["Ahmadian-Attari", "Mahmoud", ""], ["Saeedi", "Hamid", ""]]}, {"id": "1103.2690", "submitter": "Valentin Savin", "authors": "Lam Pham Sy, Valentin Savin, David Declercq, Nghia Pham", "title": "Scheduled-PEG construction of LDPC codes for Upper-Layer FEC", "comments": "WCC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Progressive Edge Growth (PEG) algorithm is one of the most widely-used\nmethod for constructing finite length LDPC codes. In this paper we consider the\nPEG algorithm together with a scheduling distribution, which specifies the\norder in which edges are established in the graph. The goal is to find a\nscheduling distribution that yields \"the best\" performance in terms of decoding\noverhead, performance metric specific to erasure codes and widely used for\nupper-layer forward error correction (UL-FEC). We rigorously formulate this\noptimization problem, and we show that it can be addressed by using genetic\noptimization algorithms. We also exhibit PEG codes with optimized scheduling\ndistribution, whose decoding overhead is less than half of the decoding\noverhead of their classical-PEG counterparts.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 15:29:02 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Sy", "Lam Pham", ""], ["Savin", "Valentin", ""], ["Declercq", "David", ""], ["Pham", "Nghia", ""]]}, {"id": "1103.2691", "submitter": "Valentin Savin", "authors": "Lam Pham Sy, Valentin Savin, David Declercq", "title": "Extended Non-Binary Low-Density Parity-Check Codes over Erasure Channels", "comments": "ISIT 2011, submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on the extended binary image of non-binary LDPC codes, we propose a\nmethod for generating extra redundant bits, such as to decreases the coding\nrate of a mother code. The proposed method allows for using the same decoder,\nregardless of how many extra redundant bits have been produced, which\nconsiderably increases the flexibility of the system without significantly\nincreasing its complexity. Extended codes are also optimized for the binary\nerasure channel, by using density evolution methods. Nevertheless, the results\npresented in this paper can easily be extrapolated to more general channel\nmodels.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 15:32:25 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Sy", "Lam Pham", ""], ["Savin", "Valentin", ""], ["Declercq", "David", ""]]}, {"id": "1103.2816", "submitter": "Yi-Kai Liu", "authors": "Yi-Kai Liu", "title": "Universal low-rank matrix recovery from Pauli measurements", "comments": "v2: corrected typos, added proof details, 9+8 pages, to appear in\n  NIPS 2011", "journal-ref": "Advances in Neural Information Processing Systems (NIPS) 24,\n  pp.1638-1646 (2011)", "doi": null, "report-no": null, "categories": "quant-ph cs.IT math.IT math.ST stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of reconstructing an unknown matrix M of rank r and\ndimension d using O(rd poly log d) Pauli measurements. This has applications in\nquantum state tomography, and is a non-commutative analogue of a well-known\nproblem in compressed sensing: recovering a sparse vector from a few of its\nFourier coefficients.\n  We show that almost all sets of O(rd log^6 d) Pauli measurements satisfy the\nrank-r restricted isometry property (RIP). This implies that M can be recovered\nfrom a fixed (\"universal\") set of Pauli measurements, using nuclear-norm\nminimization (e.g., the matrix Lasso), with nearly-optimal bounds on the error.\nA similar result holds for any class of measurements that use an orthonormal\noperator basis whose elements have small operator norm. Our proof uses Dudley's\ninequality for Gaussian processes, together with bounds on covering numbers\nobtained via entropy duality.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 23:51:32 GMT"}, {"version": "v2", "created": "Thu, 3 Nov 2011 02:08:52 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Liu", "Yi-Kai", ""]]}, {"id": "1103.2837", "submitter": "M. Amin  Khajehnejad", "authors": "Amin Khajehnejad, Alexandros G. Dimakis, Babak Hassibi, Benjamin\n  Vigoda and William Bradley", "title": "Reweighted LP Decoding for LDPC Codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a novel algorithm for decoding binary linear codes by linear\nprogramming. We build on the LP decoding algorithm of Feldman et al. and\nintroduce a post-processing step that solves a second linear program that\nreweights the objective function based on the outcome of the original LP\ndecoder output. Our analysis shows that for some LDPC ensembles we can improve\nthe provable threshold guarantees compared to standard LP decoding. We also\nshow significant empirical performance gains for the reweighted LP decoding\nalgorithm with very small additional computational complexity.\n", "versions": [{"version": "v1", "created": "Tue, 15 Mar 2011 03:42:11 GMT"}], "update_date": "2011-03-16", "authors_parsed": [["Khajehnejad", "Amin", ""], ["Dimakis", "Alexandros G.", ""], ["Hassibi", "Babak", ""], ["Vigoda", "Benjamin", ""], ["Bradley", "William", ""]]}, {"id": "1103.2882", "submitter": "Neri Merhav", "authors": "Neri Merhav", "title": "On optimum strategies for minimizing the exponential moments of a given\n  cost function", "comments": "26 pages, 1 figure; submitted to the IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cond-mat.stat-mech math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a general problem of finding a strategy that minimizes the\nexponential moment of a given cost function, with an emphasis on its relation\nto the more common criterion of minimization the expectation of the first\nmoment of the same cost function. In particular, our main result is a theorem\nthat gives simple sufficient conditions for a strategy to be optimum in the\nexponential moment sense. This theorem may be useful in various situations, and\napplication examples are given. We also examine the asymptotic regime and\ninvestigate universal asymptotically optimum strategies in light of the\naforementioned sufficient conditions, as well as phenomena of irregularities,\nor phase transitions, in the behavior of the asymptotic performance, which can\nbe viewed and understood from a statistical-mechanical perspective. Finally, we\npropose a new route for deriving lower bounds on exponential moments of certain\ncost functions (like the square error in estimation problems) on the basis of\nwell known lower bounds on their expectations.\n", "versions": [{"version": "v1", "created": "Tue, 15 Mar 2011 11:35:29 GMT"}], "update_date": "2011-03-16", "authors_parsed": [["Merhav", "Neri", ""]]}, {"id": "1103.2897", "submitter": "Dirk Lorenz", "authors": "Dirk A. Lorenz", "title": "Constructing test instances for Basis Pursuit Denoising", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The number of available algorithms for the so-called Basis Pursuit Denoising\nproblem (or the related LASSO-problem) is large and keeps growing. Similarly,\nthe number of experiments to evaluate and compare these algorithms on different\ninstances is growing.\n  In this note, we present a method to produce instances with exact solutions\nwhich is based on a simple observation which is related to the so called source\ncondition from sparse regularization.\n", "versions": [{"version": "v1", "created": "Tue, 15 Mar 2011 13:04:10 GMT"}], "update_date": "2011-03-16", "authors_parsed": [["Lorenz", "Dirk A.", ""]]}, {"id": "1103.2960", "submitter": "Moshe Mishali", "authors": "Moshe Mishali and Yonina C. Eldar", "title": "Xampling: Compressed Sensing of Analog Signals", "comments": "58 pages, 26 figures", "journal-ref": "in: \"Compressed Sensing: Theory and Applications\", Cambridge\n  University Press, 2011", "doi": null, "report-no": null, "categories": "cs.IT cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Xampling generalizes compressed sensing (CS) to reduced-rate sampling of\nanalog signals. A unified framework is introduced for low rate sampling and\nprocessing of signals lying in a union of subspaces. Xampling consists of two\nmain blocks: Analog compression that narrows down the input bandwidth prior to\nsampling with commercial devices followed by a nonlinear algorithm that detects\nthe input subspace prior to conventional signal processing. A variety of analog\nCS applications are reviewed within the unified Xampling framework including a\ngeneral filter-bank scheme for sparse shift-invariant spaces, periodic\nnonuniform sampling and modulated wideband conversion for multiband\ncommunications with unknown carrier frequencies, acquisition techniques for\nfinite rate of innovation signals with applications to medical and radar\nimaging, and random demodulation of sparse harmonic tones. A hardware-oriented\nviewpoint is advocated throughout, addressing practical constraints and\nexemplifying hardware realizations where relevant. It will appear as a chapter\nin a book on \"Compressed Sensing: Theory and Applications\" edited by Yonina\nEldar and Gitta Kutyniok.\n", "versions": [{"version": "v1", "created": "Tue, 15 Mar 2011 17:06:14 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Mishali", "Moshe", ""], ["Eldar", "Yonina C.", ""]]}, {"id": "1103.3054", "submitter": "Nevroz Sen Mr.", "authors": "Nevroz \\c{S}en, Giacomo Como, Serdar Y\\\"uksel and Fady Alajaji", "title": "On the Capacity of Memoryless Finite-State Multiple Access Channels with\n  Asymmetric Noisy State Information at the Encoders", "comments": "To be submitted Allerton Conference 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the capacity of memoryless finite-state multiple access channel\n(FS-MAC) with causal asymmetric noisy state information available at both\ntransmitters and complete state information available at the receiver. Single\nletter inner and outer bounds are provided for the capacity of such channels\nwhen the state process is independent and identically distributed. The outer\nbound is attained by observing that the proposed inner bound is tight for the\nsum-rate capacity.\n", "versions": [{"version": "v1", "created": "Tue, 15 Mar 2011 22:13:54 GMT"}, {"version": "v2", "created": "Wed, 1 Jun 2011 23:21:20 GMT"}], "update_date": "2011-06-03", "authors_parsed": [["Şen", "Nevroz", ""], ["Como", "Giacomo", ""], ["Yüksel", "Serdar", ""], ["Alajaji", "Fady", ""]]}, {"id": "1103.3093", "submitter": "Bin Da", "authors": "Bin Da and Rui Zhang", "title": "Exploiting Interference Alignment in Multi-Cell Cooperative OFDMA\n  Resource Allocation", "comments": "5 pages, 5 figures, GC2011 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies interference alignment (IA) based multi-cell cooperative\nresource allocation for the downlink OFDMA with universal frequency reuse.\nUnlike the traditional scheme that treats subcarriers as separate dimensions\nfor resource allocation, the IA technique is utilized to enable\nfrequency-domain precoding over parallel subcarriers. In this paper, the joint\noptimization of frequency-domain precoding via IA, subcarrier user selection\nand power allocation is investigated for a cooperative three-cell OFDMA system\nto maximize the downlink throughput. Numerical results for a simplified\nsymmetric channel setup reveal that the IA-based scheme achieves notable\nthroughput gains over the traditional scheme only when the inter-cell\ninterference link has a comparable strength as the direct link, and the\nreceiver SNR is sufficiently large. Motivated by this observation, a practical\nhybrid scheme is proposed for cellular systems with heterogenous channel\nconditions, where the total spectrum is divided into two subbands, over which\nthe IAbased scheme and the traditional scheme are applied for resource\nallocation to users located in the cell-intersection region and cellnon-\nintersection region, respectively. It is shown that this hybrid resource\nallocation scheme flexibly exploits the downlink IA gains for OFDMA-based\ncellular systems.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 04:52:01 GMT"}], "update_date": "2011-03-17", "authors_parsed": [["Da", "Bin", ""], ["Zhang", "Rui", ""]]}, {"id": "1103.3113", "submitter": "Xiaojun Tang", "authors": "Xiaojun Tang, Ruoheng Liu, Predrag Spasojevic, H. Vincent Poor", "title": "A Broadcast Approach To Secret Key Generation Over Slow Fading Channels", "comments": "submitted to IEEE Trans. Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A secret-key generation scheme based on a layered broadcasting strategy is\nintroduced for slow-fading channels. In the model considered, Alice wants to\nshare a key with Bob while keeping the key secret from Eve, who is a passive\neavesdropper. Both Alice-Bob and Alice-Eve channels are assumed to undergo slow\nfading, and perfect channel state information (CSI) is assumed to be known only\nat the receivers during the transmission. In each fading slot, Alice broadcasts\na continuum of coded layers and, hence, allows Bob to decode at the rate\ncorresponding to the fading state (unknown to Alice). The index of a reliably\ndecoded layer is sent back from Bob to Alice via a public and error-free\nchannel and used to generate a common secret key. In this paper, the achievable\nsecrecy key rate is first derived for a given power distribution over coded\nlayers. The optimal power distribution is then characterized. It is shown that\nlayered broadcast coding can increase the secrecy key rate significantly\ncompared to single-level coding.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 07:03:51 GMT"}], "update_date": "2011-03-17", "authors_parsed": [["Tang", "Xiaojun", ""], ["Liu", "Ruoheng", ""], ["Spasojevic", "Predrag", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1103.3117", "submitter": "Tuvi Etzion", "authors": "Michael Braun, Tuvi Etzion, Alexander Vardy", "title": "Linearity and Complements in Projective Space", "comments": "submitted to Linear Algebra and Its Applications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The projective space of order $n$ over the finite field $\\Fq$, denoted here\nas $\\Ps$, is the set of all subspaces of the vector space $\\Fqn$. The\nprojective space can be endowed with distance function $d_S(X,Y) = \\dim(X) +\n\\dim(Y) - 2\\dim(X\\cap Y)$ which turns $\\Ps$ into a metric space. With this,\n\\emph{an $(n,M,d)$ code $\\C$ in projective space} is a subset of $\\Ps$ of size\n$M$ such that the distance between any two codewords (subspaces) is at least\n$d$. Koetter and Kschischang recently showed that codes in projective space are\nprecisely what is needed for error-correction in networks: an $(n,M,d)$ code\ncan correct $t$ packet errors and $\\rho$ packet erasures introduced\n(adversarially) anywhere in the network as long as $2t + 2\\rho < d$. This\nmotivates new interest in such codes.\n  In this paper, we examine the two fundamental concepts of\n\\myemph{complements} and \\myemph{linear codes} in the context of $\\Ps$. These\nturn out to be considerably more involved than their classical counterparts.\nThese concepts are examined from two different points of view, coding theory\nand lattice theory. Our discussion reveals some surprised phenomena of these\nconcepts in $\\Ps$ and leaves some interesting problems for further research.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 07:48:11 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Braun", "Michael", ""], ["Etzion", "Tuvi", ""], ["Vardy", "Alexander", ""]]}, {"id": "1103.3190", "submitter": "Johnny Karout", "authors": "Johnny Karout, Erik Agrell, Krzysztof Szczerba and Magnus Karlsson", "title": "Designing Power-Efficient Modulation Formats for Noncoherent Optical\n  Systems", "comments": "Submitted to Globecom 2011", "journal-ref": "Proc. Global Communications Conference (GlobeCom), Houston, TX,\n  Dec. 2011 (best paper award)", "doi": "10.1109/GLOCOM.2011.6133546", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We optimize modulation formats for the additive white Gaussian noise channel\nwith a nonnegative input constraint, also known as the intensity-modulated\ndirect detection channel, with and without confining them to a lattice\nstructure. Our optimization criteria are the average electrical and optical\npower. The nonnegativity input signal constraint is translated into a conical\nconstraint in signal space, and modulation formats are designed by sphere\npacking inside this cone. Some remarkably dense packings are found, which yield\nmore power-efficient modulation formats than previously known. For example, at\na spectral efficiency of 1 bit/s/Hz, the obtained modulation format offers a\n0.86 dB average electrical power gain and 0.43 dB average optical power gain\nover the previously best known modulation formats to achieve a symbol error\nrate of 10^-6. This modulation turns out to have a lattice-based structure. At\na spectral efficiency of 3/2 bits/s/Hz and to achieve a symbol error rate of\n10^-6, the modulation format obtained for optimizing the average electrical\npower offers a 0.58 dB average electrical power gain over the best\nlattice-based modulation and 2.55 dB gain over the best previously known\nformat. However, the modulation format optimized for average optical power\noffers a 0.46 dB average optical power gain over the best lattice-based\nmodulation and 1.35 dB gain over the best previously known format.\n", "versions": [{"version": "v1", "created": "Sat, 12 Mar 2011 00:17:35 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Karout", "Johnny", ""], ["Agrell", "Erik", ""], ["Szczerba", "Krzysztof", ""], ["Karlsson", "Magnus", ""]]}, {"id": "1103.3292", "submitter": "Hsuan-Jung Su", "authors": "Jin-Hao Li and Hsuan-Jung Su", "title": "Feedback Reduction for MIMO Broadcast Channel with Heterogeneous Fading", "comments": "6 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers feedback load reduction for multiuser multiple input\nmultiple output (MIMO) broadcast channel where the users' channel distributions\nare not homogeneous. A cluster-based feedback scheme is proposed such that the\nrange of possible signal-to-noise ratio (SNR) of the users are divided into\nseveral clusters according to the order statistics of the users' SNRs. Each\ncluster has a corresponding threshold, and the users compare their measured\ninstantaneous SNRs with the thresholds to determine whether and how many bits\nthey should use to feed back their instantaneous SNRs. If a user's\ninstantaneous SNR is lower than a certain threshold, the user does not feed\nback. Feedback load reduction is thus achieved. For a given number of clusters,\nthe sum rate loss using the cluster-based feedback scheme is investigated. Then\nthe minimum number of clusters given a maximum tolerable sum rate loss is\nderived. Through simulations, it is shown that, when the number of users is\nlarge, full multiuser diversity can be achieved by the proposed feedback\nscheme, which is more efficient than the conventional schemes.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 20:37:53 GMT"}], "update_date": "2011-03-18", "authors_parsed": [["Li", "Jin-Hao", ""], ["Su", "Hsuan-Jung", ""]]}, {"id": "1103.3316", "submitter": "Shriram Sarvotham", "authors": "Shriram Sarvotham, Richard G. Baraniuk", "title": "Deterministic Bounds for Restricted Isometry of Compressed Sensing\n  Matrices", "comments": "41 Pages, 3 Figures. Submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compressed Sensing (CS) is an emerging field that enables reconstruction of a\nsparse signal $x \\in {\\mathbb R} ^n$ that has only $k \\ll n$ non-zero\ncoefficients from a small number $m \\ll n$ of linear projections. The\nprojections are obtained by multiplying $x$ by a matrix $\\Phi \\in {\\mathbb\nR}^{m \\times n}$ --- called a CS matrix --- where $k < m \\ll n$. In this work,\nwe ask the following question: given the triplet $\\{k, m, n \\}$ that defines\nthe CS problem size, what are the deterministic limits on the performance of\nthe best CS matrix in ${\\mathbb R}^{m \\times n}$? We select Restricted Isometry\nas the performance metric. We derive two deterministic converse bounds and one\ndeterministic achievable bound on the Restricted Isometry for matrices in\n${\\mathbb R}^{m \\times n}$ in terms of $n$, $m$ and $k$. The first converse\nbound (structural bound) is derived by exploiting the intricate relationships\nbetween the singular values of sub-matrices and the complete matrix. The second\nconverse bound (packing bound) and the achievable bound (covering bound) are\nderived by recognizing the equivalence of CS matrices to codes on Grassmannian\nspaces. Simulations reveal that random Gaussian $\\Phi$ provide far from optimal\nperformance. The derivation of the three bounds offers several new geometric\ninsights that relate optimal CS matrices to equi-angular tight frames, the\nWelch bound, codes on Grassmannian spaces, and the Generalized Pythagorean\nTheorem (GPT).\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 23:28:48 GMT"}, {"version": "v2", "created": "Sun, 27 Mar 2011 21:10:20 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Sarvotham", "Shriram", ""], ["Baraniuk", "Richard G.", ""]]}, {"id": "1103.3510", "submitter": "Ram Somaraju Dr.", "authors": "Ram Somaraju and Jochen Trumpf", "title": "Degrees of Freedom of a Communication Channel and Kolmogorov numbers", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.FA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note, we show that the operator theoretic concept of Kolmogorov\nnumbers and the number of degrees of freedom at level $\\epsilon$ of a\ncommunication channel are closely related. Linear communication channels may be\nmodeled using linear compact operators on Banach or Hilbert spaces and the\nnumber of degrees of freedom of such channels is defined to be the number of\nlinearly independent signals that may be communicated over this channel, where\nthe channel is restricted by a threshold noise level. Kolmogorov numbers are a\nparticular example of $s$-numbers, which are defined over the class of bounded\noperators between Banach spaces. We demonstrate that these two concepts are\nclosely related, namely that the Kolmogorov numbers correspond to the \"jump\npoints\" in the function relating numbers of degrees of freedom with the noise\nlevel $\\epsilon$. We also establish a useful numerical computation result for\nevaluating Kolmogorov numbers of compact operators.\n", "versions": [{"version": "v1", "created": "Thu, 17 Mar 2011 20:14:55 GMT"}], "update_date": "2011-03-21", "authors_parsed": [["Somaraju", "Ram", ""], ["Trumpf", "Jochen", ""]]}, {"id": "1103.3580", "submitter": "Yuri Borissov Ph.D.", "authors": "Yuri L. Borissov", "title": "On a Connection between Ideal Two-level Autocorrelation and Almost\n  Balancedness of $p$-ary Sequences", "comments": "6 pages, submitted to Comptes rendus de l'Academie Bulgare des\n  Sciences", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this correspondence, for every periodic $p-$ary sequence satisfying ideal\ntwo-level autocorrelation property the existence of an element of the field\n${\\bf GF}(p)$ which appears one time less than all the rest that are equally\ndistributed in a period of that sequence, is proved by algebraic method. In\naddition, it is shown that such a special element might not be only the zero\nelement but as well arbitrary element of that field.\n", "versions": [{"version": "v1", "created": "Fri, 18 Mar 2011 09:30:07 GMT"}], "update_date": "2011-03-21", "authors_parsed": [["Borissov", "Yuri L.", ""]]}, {"id": "1103.3596", "submitter": "Amin Gohari", "authors": "Amin Aminzadeh Gohari, Shenghao Yang and Sidharth Jaggi", "title": "Beyond the Cut-Set Bound: Uncertainty Computations in Network Coding\n  with Correlated Sources", "comments": "12 pages, A short version appears in ISIT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cut-set bounds on achievable rates for network communication protocols are\nnot in general tight. In this paper we introduce a new technique for proving\nconverses for the problem of transmission of correlated sources in networks,\nthat results in bounds that are tighter than the corresponding cut-set bounds.\nWe also define the concept of \"uncertainty region\" which might be of\nindependent interest. We provide a full characterization of this region for the\ncase of two correlated random variables. The bounding technique works as\nfollows: on one hand we show that if the communication problem is solvable, the\nuncertainty of certain random variables in the network with respect to\nimaginary parties that have partial knowledge of the sources must satisfy some\nconstraints that depend on the network architecture. On the other hand, the\nsame uncertainties have to satisfy constraints that only depend on the joint\ndistribution of the sources. Matching these two leads to restrictions on the\nstatistical joint distribution of the sources in communication problems that\nare solvable over a given network architecture.\n", "versions": [{"version": "v1", "created": "Fri, 18 Mar 2011 10:45:52 GMT"}, {"version": "v2", "created": "Mon, 9 May 2011 12:32:24 GMT"}, {"version": "v3", "created": "Sat, 28 May 2011 11:45:53 GMT"}], "update_date": "2011-05-31", "authors_parsed": [["Gohari", "Amin Aminzadeh", ""], ["Yang", "Shenghao", ""], ["Jaggi", "Sidharth", ""]]}, {"id": "1103.3641", "submitter": "Jens Zumbr\\\"agel", "authors": "Jens Zumbr\\\"agel, Vitaly Skachek, and Mark F. Flanagan", "title": "On the Pseudocodeword Redundancy of Binary Linear Codes", "comments": "14 pages. arXiv admin note: substantial text overlap with\n  arXiv:1005.3486", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The AWGNC, BSC, and max-fractional pseudocodeword redundancies of a binary\nlinear code are defined to be the smallest number of rows in a parity-check\nmatrix such that the corresponding minimum pseudoweight is equal to the minimum\nHamming distance of the code. It is shown that most codes do not have a finite\npseudocodeword redundancy. Also, upper bounds on the pseudocodeword redundancy\nfor some families of codes, including codes based on designs, are provided. The\npseudocodeword redundancies for all codes of small length (at most 9) are\ncomputed. Furthermore, comprehensive results are provided on the cases of\ncyclic codes of length at most 250 for which the eigenvalue bound of Vontobel\nand Koetter is sharp.\n", "versions": [{"version": "v1", "created": "Fri, 18 Mar 2011 14:57:28 GMT"}, {"version": "v2", "created": "Tue, 6 Mar 2012 13:33:00 GMT"}], "update_date": "2012-03-07", "authors_parsed": [["Zumbrägel", "Jens", ""], ["Skachek", "Vitaly", ""], ["Flanagan", "Mark F.", ""]]}, {"id": "1103.3673", "submitter": "Aissa Ikhlef", "authors": "Aissa Ikhlef, Diomidis S. Michalopoulos, Robert Schober", "title": "Buffers Improve the Performance of Relay Selection", "comments": "6 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the performance of relay selection can be improved by employing\nrelays with buffers. Under the idealized assumption that no buffer is full or\nempty, the best source-relay and the best relay-destination channels can be\nsimultaneously exploited by selecting the corresponding relays for reception\nand transmission, respectively. The resulting relay selection scheme is\nreferred to as max-max relay selection (MMRS). Since for finite buffer sizes,\nempty and full buffers are practically unavoidable if MMRS is employed, we\npropose a hybrid relay selection (HRS) scheme, which is a combination of\nconventional best relay selection (BRS) and MMRS. We analyze the outage\nprobabilities of MMRS and HRS and show that both schemes achieve the same\ndiversity gain as conventional BRS and a superior coding gain. Furthermore, our\nresults show that for moderate buffer sizes (e.g. 30 packets) HRS closely\napproaches the performance of idealized MMRS and the performance gain compared\nto BRS approaches 3 dB as the number of relays increases.\n", "versions": [{"version": "v1", "created": "Fri, 18 Mar 2011 17:37:15 GMT"}], "update_date": "2011-03-21", "authors_parsed": [["Ikhlef", "Aissa", ""], ["Michalopoulos", "Diomidis S.", ""], ["Schober", "Robert", ""]]}, {"id": "1103.3719", "submitter": "Hsuan-Jung Su", "authors": "Chung-Pi Lee and Hsuan-Jung Su", "title": "Diversity-Multiplexing Tradeoff in the Multiaccess Relay Channel with\n  Finite Block Length", "comments": "28 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Dynamic Decode-and-Forward (DDF) protocol and the Hybrid DDF and\nAmplified-and-Forward (HDAF) protocol for the multiple-access relay channel\n(MARC) with quasi static fading are evaluated using the Zheng-Tse\ndiversity-multiplexing tradeoff (DMT). We assume that there are two users, one\nhalf-duplex relay, and a common destination, each equipped with single antenna.\nFor the Rayleigh fading, the DDF protocol is well known and has been analyzed\nin terms of the DMT with infinite block length. By carefully dealing with\nproperties specific to finite block length, we characterize the finite block\nlength DMT which takes into account the fact that the event of decoding error\nat the relay causes the degradation in error performance when the block length\nis finite. Furthermore, we consider the situation where the destination does\nnot have a priori knowledge of the relay decision time at which the relay\nswitches from listening to transmitting. By introducing a decision rejection\ncriterion such that the relay forwards message only when its decision is\nreliable, and the generalized likelihood ratio test (GLRT) at the destination\nthat jointly decodes the relay decision time and the information message, our\nanalysis show that the optimal DMT is achievable as if there is no decoding\nerror at the relay and the relay decision time is known at the destination.\nTherefore, infinite block length and additional overhead for communicating the\ndecision time are not needed for the DDF to achieve the optimal DMT. To further\nimprove the DMT, we propose the HDAF protocol which take advantages of both the\nDDF and the Amplified-and-Forward protocols by judiciously choosing which\nprotocol to use. Our result shows that the HDAF protocol outperforms the\noriginal DDF in the DMT perspective. Finally, a variant of the HDAF protocol\nwith lower implementation complexity without sacrificing the DMT performance is\ndevised.\n", "versions": [{"version": "v1", "created": "Fri, 18 Mar 2011 21:40:21 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Lee", "Chung-Pi", ""], ["Su", "Hsuan-Jung", ""]]}, {"id": "1103.3737", "submitter": "Zhiying Wang", "authors": "Itzhak Tamo and Zhiying Wang and Jehoshua Bruck", "title": "MDS Array Codes with Optimal Rebuilding", "comments": "14 pages, 4 figures, a short version submitted to ISIT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MDS array codes are widely used in storage systems to protect data against\nerasures. We address the \\emph{rebuilding ratio} problem, namely, in the case\nof erasures, what is the the fraction of the remaining information that needs\nto be accessed in order to rebuild \\emph{exactly} the lost information? It is\nclear that when the number of erasures equals the maximum number of erasures\nthat an MDS code can correct then the rebuilding ratio is 1 (access all the\nremaining information). However, the interesting (and more practical) case is\nwhen the number of erasures is smaller than the erasure correcting capability\nof the code. For example, consider an MDS code that can correct two erasures:\nWhat is the smallest amount of information that one needs to access in order to\ncorrect a single erasure? Previous work showed that the rebuilding ratio is\nbounded between 1/2 and 3/4, however, the exact value was left as an open\nproblem. In this paper, we solve this open problem and prove that for the case\nof a single erasure with a 2-erasure correcting code, the rebuilding ratio is\n1/2. In general, we construct a new family of $r$-erasure correcting MDS array\ncodes that has optimal rebuilding ratio of $\\frac{1}{r}$ in the case of a\nsingle erasure. Our array codes have efficient encoding and decoding algorithms\n(for the case $r=2$ they use a finite field of size 3) and an optimal update\nproperty.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2011 00:41:12 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Tamo", "Itzhak", ""], ["Wang", "Zhiying", ""], ["Bruck", "Jehoshua", ""]]}, {"id": "1103.3742", "submitter": "Harry Yosh", "authors": "Harry Yosh", "title": "The key exchange cryptosystem used with higher order Diophantine\n  equations", "comments": "8 pages, 0 figure", "journal-ref": "International Journal of Network Security & Its Applications\n  (IJNSA), Vol.3, No.2, March 2011", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One-way functions are widely used for encrypting the secret in public key\ncryptography, although they are regarded as plausibly one-way but have not been\nproven so. Here we discuss the public key cryptosystem based on the system of\nhigher order Diophantine equations. In this system those Diophantine equations\nare used as public keys for sender and recipient, and sender can recover the\nsecret from the Diophantine equation returned from recipient with a trapdoor.\nIn general the system of Diophantine equations is hard to solve when it is\npositive-dimensional and it implies the Diophantine equations in this\ncryptosystem works as a possible one-way function. We also discuss some\nproblems on implementation, which are caused from additional complexity\nnecessary for constructing Diophantine equations in order to prevent from\nattacking by tamperers.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2011 02:52:19 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Yosh", "Harry", ""]]}, {"id": "1103.3746", "submitter": "Paul Cuff", "authors": "Paul Cuff", "title": "Using a Secret Key to Foil an Eavesdropper", "comments": "Allerton 2010, 6 pages, 1 figure, uses IEEEtran.cls", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work addresses private communication with distributed systems in mind.\nWe consider how to best use secret key resources and communication to transmit\nsignals across a system so that an eavesdropper is least capable to act on the\nsignals. One of the key assumptions is that the private signals are publicly\navailable with a delay---in this case a delay of one. We find that even if the\nsource signal (information source) is memoryless, the design and performance of\nthe optimal system has a strong dependence on which signals are assumed to be\navailable to the eavesdropper with delay.\n  Specifically, we consider a distributed system with two components where\ninformation is known to only one component and communication resources are\nlimited. Instead of measuring secrecy by \"equivocation,\" we define a value\nfunction for the system, based on the actions of the system and the adversary,\nand characterize the optimal performance of the system, as measured by the\naverage value obtained against the worst adversary. The resulting optimal\nrate-payoff region is expressed with information theoretic inequalities, and\nthe optimal communication methods are not standard source coding techniques but\ninstead are methods that stem from synthesizing a memoryless channel.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2011 03:52:13 GMT"}, {"version": "v2", "created": "Fri, 1 Apr 2011 03:56:20 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Cuff", "Paul", ""]]}, {"id": "1103.3794", "submitter": "Lucian Trifina", "authors": "Lucian Trifina, Daniela T\\u{a}rniceriu and Valeriu Munteanu", "title": "Improved QPP Interleavers for LTE Standard", "comments": "IEEE International Symposium on Signals, Circuits and Systems - ISSCS\n  2011, pp. 403-406, June 30-July 1, 2011, Iasi, Romania", "journal-ref": "IEEE International Symposium on Signals, Circuits and Systems -\n  ISSCS 2011, pp. 403-406, June 30-July 1, 2011, Iasi, Romania", "doi": "10.1109/ISSCS.2011.5978745", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes and proves a theorem which stipulates sufficient\nconditions the coefficients of two quadratic permutation polynomials (QPP) must\nsatisfy, so that the permutations generated by them are identical. The result\nis used to reduce the search time of QPP interleavers with lengths given by\nLong Term Evolution (LTE) standard up to 512, by improving the distance\nspectrum over the set of polynomials with the largest spreading factor.\nPolynomials that lead to better performance compared to LTE standard are found\nfor several lengths. Simulations show that 0.5 dB coding gains can be obtained\ncompared to LTE standard.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2011 16:39:13 GMT"}, {"version": "v2", "created": "Tue, 5 Jul 2011 10:28:00 GMT"}, {"version": "v3", "created": "Wed, 6 Jul 2011 06:40:49 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["Trifina", "Lucian", ""], ["Tărniceriu", "Daniela", ""], ["Munteanu", "Valeriu", ""]]}, {"id": "1103.3799", "submitter": "Feichi Long", "authors": "Feichi Long, Tiejun Lv", "title": "Relaxed Belief Propagation for MIMO Detection", "comments": "5 Pages, 8 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, relaxed belief propagation (RBP) based detectors are proposed\nfor multiple-input multiple-out (MIMO) system. The factor graph is leveraged to\nrepresent the MIMO channels, and based on which our algorithms are developed.\nUnlike the existing complicated standard belief propagation (SBP) detector that\nconsiders all the edges of the factor graph when updating messages, the\nproposed RBP focuses on partial edges, which largely reduces computational\ncomplexity. In particular, relax degree is introduced in to determine how many\nedges to be selected, whereby RBP is a generalized edge selection based BP\nmethod and SBP is a special case of RBP having the smallest relax degree.\nMoreover, we propose a novel Gaussian approximation with feedback information\nmechanism to enable the proposed RBP detector. In order to further improve the\ndetection performance, we also propose to cascade a minimum mean square error\n(MMSE) detector before the RBP detector, from which pseudo priori information\nis judiciously exploited. Convergence and complexity analyses, along with the\nnumerical simulation results, verify that the proposed RBP outperform other BP\nmethods having the similar complexity, and the MMSE cascaded RBP even\noutperform SBP at the largest relax degree in large MIMO systems.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2011 17:47:43 GMT"}, {"version": "v2", "created": "Wed, 4 May 2011 09:33:22 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Long", "Feichi", ""], ["Lv", "Tiejun", ""]]}, {"id": "1103.3837", "submitter": "Heejin Kim", "authors": "Heejin Kim, Sang-Rim Lee, Kyoung-Jae Lee, Inkyu Lee", "title": "Transmission Selection Schemes using Sum Rate Analysis in Distributed\n  Antenna Systems", "comments": "6 pages, 5 figures, Submitted to Globecom 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study single cell multi-user downlink distributed antenna\nsystems (DAS) where the antenna ports are geographically separated in a cell.\nFirst, we derive an expression of the ergodic sum rate for DAS in the presence\nof pathloss. Then, we propose a transmission selection scheme based on the\nderived expressions to maximize the overall ergodic sum rate. Utilizing the\nknowledge of distance information from a user to each distributed antenna (DA)\nport, we consider the pairings of each DA port and its supporting user to\noptimize the system performance. Then, we compute the ergodic sum rate for\nvarious transmission mode candidates and adopt a transmission selection scheme\nwhich chooses the best mode maximizing the ergodic sum rate among the mode\ncandidates. In our proposed scheme, the number of mode candidates are greatly\nreduced compared to that of the ideal mode selection. Through Monte Carlo\nsimulations, we will show the accuracy of our derivation for the ergodic sum\nrate expression. Moreover, simulation results with the pathloss modeling\nconfirm that the proposed transmission selection scheme produces the average\nsum rate identical to the ideal mode selection with significantly reduced\nselection candidates.\n", "versions": [{"version": "v1", "created": "Sun, 20 Mar 2011 07:46:48 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Kim", "Heejin", ""], ["Lee", "Sang-Rim", ""], ["Lee", "Kyoung-Jae", ""], ["Lee", "Inkyu", ""]]}, {"id": "1103.3843", "submitter": "Emil Saucan", "authors": "Emil Saucan", "title": "A Simple Sampling Method for Metric Measure Spaces", "comments": "34 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new, simple metric method of sampling metric measure spaces,\nbased on a well-known \"snowflakeing operator\" and we show that, as a\nconsequence of a classical result of Assouad, the sampling of doubling metric\nspaces is bilipschitz equivalent to that of subsets of some $\\mathbb{R}^N$.\nMoreover, we compare this new method with two other approaches, in particular\nto one that represents a direct application of our triangulation method of\nmetric measure spaces satisfying a generalized Ricci curvature condition.\n", "versions": [{"version": "v1", "created": "Sun, 20 Mar 2011 11:36:32 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Saucan", "Emil", ""]]}, {"id": "1103.3846", "submitter": "Xu Zhiqiang", "authors": "Yang Wang, Zhiqiang Xu", "title": "The Performance of PCM Quantization Under Tight Frame Representations", "comments": "23 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.IT math.FA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the performance of the PCM scheme with linear\nquantization rule for quantizing finite unit-norm tight frame expansions for\n$\\R^d$ and derive the PCM quantization error without the White Noise\nHypothesis. We prove that for the class of unit norm tight frames derived from\nuniform frame paths the quantization error has an upper bound of\n$O(\\delta^{3/2})$ regardless of the frame redundancy. This is achieved using\nsome of the techniques developed by G\\\"{u}nt\\\"{u}rk in his study of Sigma-Delta\nquantization. Using tools of harmonic analysis we show that this upper bound is\nsharp for $d=2$. A consequence of this result is that, unlike with Sigma-Delta\nquantization, the error for PCM quantization in general does not diminish to\nzero as one increases the frame redundancy. We extend the result to high\ndimension and show that the PCM quantization error has an upper bound\n$O(\\delta^{(d+1)/2})$ for asymptopitcally equidistributed unit-norm tight frame\nof $\\R^{d}$.\n", "versions": [{"version": "v1", "created": "Sun, 20 Mar 2011 11:49:46 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Wang", "Yang", ""], ["Xu", "Zhiqiang", ""]]}, {"id": "1103.3866", "submitter": "Lei Jiang", "authors": "Jiang Lei and M. A. V\\'azquez-Castro", "title": "Multibeam Satellite Frequency/Time Duality Study and Capacity\n  Optimization", "comments": "9 pages, 9 figures, Submitted to Journal of Communications and\n  Networks", "journal-ref": "Journal of Communications and Networks, vol. 13, no. 5, pp.\n  472-480, Oct. 2011", "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate two new candidate transmission schemes,\nNon-Orthogonal Frequency Reuse (NOFR) and Beam-Hoping (BH). They operate in\ndifferent domains (frequency and time/space, respectively), and we want to know\nwhich domain shows overall best performance. We propose a novel formulation of\nthe Signal-to-Interference plus Noise Ratio (SINR) which allows us to prove the\nfrequency/time duality of these schemes. Further, we propose two novel capacity\noptimization approaches assuming per-beam SINR constraints in order to use the\nsatellite resources (e.g. power and bandwidth) more efficiently. Moreover, we\ndevelop a general methodology to include technological constraints due to\nrealistic implementations, and obtain the main factors that prevent the two\ntechnologies dual of each other in practice, and formulate the technological\ngap between them. The Shannon capacity (upper bound) and current\nstate-of-the-art coding and modulations are analyzed in order to quantify the\ngap and to evaluate the performance of the two candidate schemes. Simulation\nresults show significant improvements in terms of power gain, spectral\nefficiency and traffic matching ratio when comparing with conventional systems,\nwhich are designed based on uniform bandwidth and power allocation. The results\nalso show that BH system turns out to show a less complex design and performs\nbetter than NOFR system specially for non-real time services.\n", "versions": [{"version": "v1", "created": "Sun, 20 Mar 2011 17:34:40 GMT"}], "update_date": "2011-11-01", "authors_parsed": [["Lei", "Jiang", ""], ["Vázquez-Castro", "M. A.", ""]]}, {"id": "1103.3882", "submitter": "Abhinav G", "authors": "Teja Damodaram Bavirisetti, G. Abhinav, K. Prasad and B. Sundar Rajan", "title": "A Transform Approach to Linear Network Coding for Acyclic Networks with\n  Delay", "comments": "Edits to Section II A, Theorem 4, Theorem 5. Lemma 4 newly added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The algebraic formulation for linear network coding in acyclic networks with\nthe links having integer delay is well known. Based on this formulation, for a\ngiven set of connections over an arbitrary acyclic network with integer delay\nassumed for the links, the output symbols at the sink nodes, at any given time\ninstant, is a \\mathbb{F}_{q}$-linear combination of the input symbols across\ndifferent generations, where $\\mathbb{F}_{q}$ denotes the field over which the\nnetwork operates. We use finite-field discrete fourier transform (DFT) to\nconvert the output symbols at the sink nodes, at any given time instant, into a\n$\\mathbb{F}_{q}$-linear combination of the input symbols generated during the\nsame generation. We call this as transforming the acyclic network with delay\ninto {\\em $n$-instantaneous networks} ($n$ is sufficiently large). We show that\nunder certain conditions, there exists a network code satisfying sink demands\nin the usual (non-transform) approach if and only if there exists a network\ncode satisfying sink demands in the transform approach. Furthermore, we show\nthat the transform method (along with the use of alignment strategies) can be\nemployed to achieve half the rate corresponding to the individual\nsource-destination min-cut (which are assumed to be equal to 1) for some\nclasses of three-source three-destination unicast network with delays, when the\nzero-interference conditions are not satisfied.\n", "versions": [{"version": "v1", "created": "Sun, 20 Mar 2011 19:54:55 GMT"}, {"version": "v2", "created": "Fri, 15 Apr 2011 16:45:32 GMT"}, {"version": "v3", "created": "Tue, 6 Sep 2011 17:35:56 GMT"}, {"version": "v4", "created": "Thu, 10 May 2012 15:53:31 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Bavirisetti", "Teja Damodaram", ""], ["Abhinav", "G.", ""], ["Prasad", "K.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "1103.3885", "submitter": "Hsuan-Jung Su", "authors": "Jin-Hao Li, Hsuan-Jung Su and Yu-Lun Tsai", "title": "Feedback Reduction for Random Beamforming in Multiuser MIMO Broadcast\n  Channel", "comments": "25 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the multiuser multiple-input multiple-output (MIMO) downlink channel, the\nusers feedback their channel state information (CSI) to help the base station\n(BS) schedule users and improve the system sum rate. However, this incurs a\nlarge aggregate feedback bandwidth which grows linearly with the number of\nusers. In this paper, we propose a novel scheme to reduce the feedback load in\na downlink orthogonal space division multiple access (SDMA) system with\nzero-forcing receivers by allowing the users to dynamically determine the\nnumber of feedback bits to use according to multiple decision thresholds.\nThrough theoretical analysis, we show that, while keeping the aggregate\nfeedback load of the entire system constant regardless of the number of users,\nthe proposed scheme almost achieves the optimal asymptotic sum rate scaling\nwith respect to the number of users (also known as the multiuser diversity).\nSpecifically, given the number of thresholds, the proposed scheme can achieve a\nconstant portion of the optimal sum rate achievable only by the system where\nall the users always feedback, and the remaining portion (referred to as the\nsum rate loss) decreases exponentially to zero as the number of thresholds\nincreases. By deriving a tight upper bound for the sum rate loss, the minimum\nnumber of thresholds for a given tolerable sum rate loss is determined. In\naddition, a fast bit allocation method is discussed for the proposed scheme,\nand the simulation results show that the sum rate performances with the complex\noptimal bit allocation method and with the fast algorithm are almost the same.\nWe compare our multi-threshold scheme to some previously proposed feedback\nschemes. Through simulation, we demonstrate that the proposed scheme can reduce\nthe feedback load and utilize the limited feedback bandwidth more effectively\nthan the existing feedback methods.\n", "versions": [{"version": "v1", "created": "Sun, 20 Mar 2011 20:45:28 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Li", "Jin-Hao", ""], ["Su", "Hsuan-Jung", ""], ["Tsai", "Yu-Lun", ""]]}, {"id": "1103.3915", "submitter": "Chan Wong  Wong", "authors": "Chan Wong Wong, Tan F. Wong, and John M. Shea", "title": "LDPC Code Design for the BPSK-constrained Gaussian Wiretap Channel", "comments": "submitted to IEEE GLOBECOM 2011 - Communication Theory Symposium", "journal-ref": null, "doi": "10.1109/GLOCOMW.2011.6162586", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A coding scheme based on irregular low-density parity-check (LDPC) codes is\nproposed to send secret messages from a source over the Gaussian wiretap\nchannel to a destination in the presence of a wiretapper, with the restriction\nthat the source can send only binary phase-shift keyed (BPSK) symbols. The\nsecrecy performance of the proposed coding scheme is measured by the secret\nmessage rate through the wiretap channel as well as the equivocation rate about\nthe message at the wiretapper. A code search procedure is suggested to obtain\nirregular LDPC codes that achieve good secrecy performance in such context.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2011 03:58:34 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Wong", "Chan Wong", ""], ["Wong", "Tan F.", ""], ["Shea", "John M.", ""]]}, {"id": "1103.3933", "submitter": "Tuvi Etzion", "authors": "Tuvi Etzion", "title": "Product Constructions for Perfect Lee Codes", "comments": "submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2161133", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A well known conjecture of Golomb and Welch is that the only nontrivial\nperfect codes in the Lee and Manhattan metrics have length two or minimum\ndistance three. This problem and related topics were subject for extensive\nresearch in the last forty years. In this paper two product constructions for\nperfect Lee codes and diameter perfect Lee codes are presented. These\nconstructions yield a large number of nonlinear perfect codes and nonlinear\ndiameter perfect codes in the Lee and Manhattan metrics. A short survey and\nother related problems on perfect codes in the Lee and the Manhattan metrics\nare also discussed.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2011 07:53:53 GMT"}, {"version": "v2", "created": "Wed, 22 Jun 2011 09:47:33 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Etzion", "Tuvi", ""]]}, {"id": "1103.3952", "submitter": "{\\L}ukasz D{\\ke}bowski", "authors": "{\\L}ukasz D\\k{e}bowski", "title": "Mixing, Ergodic, and Nonergodic Processes with Rapidly Growing\n  Information between Blocks", "comments": "21 pages", "journal-ref": "IEEE Transactions on Information Theory 58:3392-3401, 2012", "doi": "10.1109/TIT.2012.2190708", "report-no": null, "categories": "cs.IT cs.CL math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct mixing processes over an infinite alphabet and ergodic processes\nover a finite alphabet for which Shannon mutual information between adjacent\nblocks of length $n$ grows as $n^\\beta$, where $\\beta\\in(0,1)$. The processes\nare a modification of nonergodic Santa Fe processes, which were introduced in\nthe context of natural language modeling. The rates of mutual information for\nthe latter processes are alike and also established in this paper. As an\nauxiliary result, it is shown that infinite direct products of mixing processes\nare also mixing.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2011 10:04:20 GMT"}, {"version": "v2", "created": "Tue, 22 Nov 2011 15:52:30 GMT"}], "update_date": "2020-03-11", "authors_parsed": [["Dębowski", "Łukasz", ""]]}, {"id": "1103.4007", "submitter": "Haim Permuter Henry", "authors": "Haim Permuter and Himanshu Asnani", "title": "Multiple Access Channel with Partial and Controlled Cribbing Encoders", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider a multiple access channel (MAC) with partial\ncribbing encoders. This means that each of two encoders obtains a deterministic\nfunction of the other encoder output with or without delay. The partial\ncribbing scheme is especially motivated by the additive noise Gaussian MAC\nsince perfect cribbing results in the degenerated case of full cooperation\nbetween the encoders and requires an infinite entropy link. We derive a single\nletter characterization of the capacity of the MAC with partial cribbing for\nthe cases of causal and strictly causal partial cribbing. Several numerical\nexamples, such as quantized cribbing, are presented. We further consider and\nderive the capacity region where the cribbing depends on actions that are\nfunctions of the previous cribbed observations. In particular, we consider a\nscenario where the action is \"to crib or not to crib\" and show that a naive\ntime-sharing strategy is not optimal.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2011 13:38:12 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Permuter", "Haim", ""], ["Asnani", "Himanshu", ""]]}, {"id": "1103.4086", "submitter": "Jean-Claude Belfiore", "authors": "Fr\\'ed\\'erique Oggier and Patrick Sol\\'e and Jean-Claude Belfiore", "title": "Lattice Codes for the Wiretap Gaussian Channel: Construction and\n  Analysis", "comments": "43 pages, 16 figures, submitted to IEEE Trans. on Inform. Theory", "journal-ref": null, "doi": "10.1007/978-3-642-20901-7_3", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the Gaussian wiretap channel, where two legitimate players Alice\nand Bob communicate over an additive white Gaussian noise (AWGN) channel, while\nEve is eavesdropping, also through an AWGN channel. We propose a coding\nstrategy based on lattice coset encoding. We analyze Eve's probability of\ndecoding, from which we define the secrecy gain as a design criterion for\nwiretap lattice codes, expressed in terms of the lattice theta series, which\ncharacterizes Eve's confusion as a function of the channel parameters. The\nsecrecy gain is studied for even unimodular lattices, and an asymptotic\nanalysis shows that it grows exponentially in the dimension of the lattice.\nExamples of wiretap lattice codes are given. Interestingly, minimizing Eve's\nprobability of error involves the same optimization of the theta series as does\nthe flatness factor, another newly defined code design that characterizes\nlattice codes that achieve strong secrecy.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2011 17:17:41 GMT"}, {"version": "v2", "created": "Tue, 8 Jan 2013 09:27:59 GMT"}, {"version": "v3", "created": "Wed, 9 Jan 2013 17:34:54 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Oggier", "Frédérique", ""], ["Solé", "Patrick", ""], ["Belfiore", "Jean-Claude", ""]]}, {"id": "1103.4177", "submitter": "Lele Wang", "authors": "Lele Wang and Mohammad Naghshvar", "title": "On the Capacity of the Noncausal Relay Channel", "comments": "To appear in the IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the noncausal relay channel, also known as the relay\nchannel with unlimited lookahead, introduced by El Gamal, Hassanpour, and\nMammen. Unlike the standard relay channel model, where the relay encodes its\nsignal based on the previous received output symbols, the relay in the\nnoncausal relay channel encodes its signal as a function of the entire received\nsequence. In the existing coding schemes, the relay uses this noncausal\ninformation solely to recover the transmitted message and then cooperates with\nthe sender to communicate this message to the receiver. However, it is shown in\nthis paper that by applying the Gelfand--Pinsker coding scheme, the relay can\ntake further advantage of the noncausally available information, which can\nachieve strictly higher rates than existing coding schemes. This paper also\nprovides a new upper bound on the capacity of the noncausal relay that strictly\nimproves upon the cutset bound. These new lower and upper bounds on the\ncapacity coincide for the class of degraded noncausal relay channels and\nestablish the capacity for this class.\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2011 00:10:07 GMT"}, {"version": "v2", "created": "Tue, 9 Dec 2014 22:52:16 GMT"}, {"version": "v3", "created": "Wed, 19 Apr 2017 17:55:44 GMT"}], "update_date": "2017-04-20", "authors_parsed": [["Wang", "Lele", ""], ["Naghshvar", "Mohammad", ""]]}, {"id": "1103.4223", "submitter": "Kaibin Huang", "authors": "Kaibin Huang and Jeffrey G. Andrews", "title": "A Stochastic-Geometry Approach to Coverage in Cellular Networks with\n  Multi-Cell Cooperation", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-cell cooperation is a promising approach for mitigating inter-cell\ninterference in dense cellular networks. Quantifying the performance of\nmulti-cell cooperation is challenging as it integrates physical-layer\ntechniques and network topologies. For tractability, existing work typically\nrelies on the over-simplified Wyner-type models. In this paper, we propose a\nnew stochastic-geometry model for a cellular network with multi-cell\ncooperation, which accounts for practical factors including the irregular\nlocations of base stations (BSs) and the resultant path-losses. In particular,\nthe proposed network-topology model has three key features: i) the cells are\nmodeled using a Poisson random tessellation generated by Poisson distributed\nBSs, ii) multi-antenna BSs are clustered using a hexagonal lattice and BSs in\nthe same cluster mitigate mutual interference by spatial interference\navoidance, iii) BSs near cluster edges access a different sub-channel from that\nby other BSs, shielding cluster-edge mobiles from strong interference. Using\nthis model and assuming sparse scattering, we analyze the shapes of the outage\nprobabilities of mobiles served by cluster-interior BSs as the average number\n$K$ of BSs per cluster increases. The outage probability of a mobile near a\ncluster center is shown to be proportional to $e^{-c(2-\\sqrt{\\nu})^2K}$ where\n$\\nu$ is the fraction of BSs lying in the interior of clusters and $c$ is a\nconstant. Moreover, the outage probability of a typical mobile is proved to\nscale proportionally with $e^{-c' (1-\\sqrt{\\nu})^2K}$ where $c'$ is a constant.\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2011 07:42:13 GMT"}], "update_date": "2011-03-23", "authors_parsed": [["Huang", "Kaibin", ""], ["Andrews", "Jeffrey G.", ""]]}, {"id": "1103.4335", "submitter": "Hugues Randriam", "authors": "Hugues Randriam", "title": "Diviseurs de la forme 2D-G sans sections et rang de la multiplication\n  dans les corps finis (Divisors of the form 2D-G without sections and bilinear\n  complexity of multiplication in finite fields)", "comments": "35 pages, in French; French and English abstract", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AG cs.CC cs.IT math.IT math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let X be an algebraic curve, defined over a perfect field, and G a divisor on\nX. If X has sufficiently many points, we show how to construct a divisor D on X\nsuch that l(2D-G)=0, of essentially any degree such that this is compatible the\nRiemann-Roch theorem. We also generalize this construction to the case of a\nfinite number of constraints, l(k_i.D-G_i)=0, where |k_i|\\leq 2.\n  Such a result was previously claimed by Shparlinski-Tsfasman-Vladut, in\nrelation with the Chudnovsky-Chudnovsky method for estimating the bilinear\ncomplexity of the multiplication in finite fields based on interpolation on\ncurves; unfortunately, as noted by Cascudo et al., their proof was flawed. So\nour work fixes the proof of Shparlinski-Tsfasman-Vladut and shows that their\nestimate m_q\\leq 2(1+1/(A(q)-1)) holds, at least when A(q)\\geq 5. We also fix a\nstatement of Ballet that suffers from the same problem, and then we point out a\nfew other possible applications.\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2011 18:14:24 GMT"}, {"version": "v2", "created": "Thu, 24 Mar 2011 18:39:07 GMT"}], "update_date": "2011-03-25", "authors_parsed": [["Randriam", "Hugues", ""]]}, {"id": "1103.4401", "submitter": "Osman Yagan", "authors": "Osman Yagan and Armand M. Makowski", "title": "On the gradual deployment of random pairwise key distribution schemes\n  (Extended Version)", "comments": "The extended version of a paper that will appear at WiOpt 2011.\n  Additional parts may later be reported elsewhere", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of wireless sensor networks, the pairwise key distribution\nscheme of Chan et al. has several advantages over other key distribution\nschemes including the original scheme of Eschenauer and Gligor. However, this\noffline pairwise key distribution mechanism requires that the network size be\nset in advance, and involves all sensor nodes simultaneously. Here, we address\nthis issue by describing an implementation of the pairwise scheme that supports\nthe gradual deployment of sensor nodes in several consecutive phases. We\ndiscuss the key ring size needed to maintain the secure connectivity throughout\nall the deployment phases. In particular we show that the number of keys at\neach sensor node can be taken to be $O(\\log n)$ in order to achieve secure\nconnectivity (with high probability).\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2011 22:13:17 GMT"}], "update_date": "2011-03-24", "authors_parsed": [["Yagan", "Osman", ""], ["Makowski", "Armand M.", ""]]}, {"id": "1103.4406", "submitter": "Aimal Khan Yousafzai", "authors": "Aimal Khan Yousafzai and Mohammad Reza Nakhai", "title": "Interference Alignment with Partially Coordinated Transmit Precoding", "comments": "19 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce an efficient interference alignment (IA)\nalgorithm exploiting partially coordinated transmit precoding to improve the\nnumber of concurrent interference-free transmissions, i.e., the multiplexing\ngain, in multicell downlink. The proposed coordination model is such that each\nbase-station simultaneously transmits to two users and each user is served by\ntwo base-stations. First, we show in a K-user system operating at the\ninformation theoretic upper bound of degrees of freedom (DOF), the generic IA\nis proper when $K \\leq 3$, whereas the proposed partially coordinated IA is\nproper when $K \\leq 5$. Then, we derive a non-iterative, i.e., one shot, IA\nalgorithm for the proposed scheme when $K \\leq 5$. We show that for a given\nlatency, the backhaul data rate requirement of the proposed method grows\nlinearly with K. Monte-Carlo simulation results show that the proposed one-shot\nalgorithm offers higher system throughput than the iterative IA at practical\nSNR levels.\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2011 22:52:46 GMT"}], "update_date": "2011-03-24", "authors_parsed": [["Yousafzai", "Aimal Khan", ""], ["Nakhai", "Mohammad Reza", ""]]}, {"id": "1103.4435", "submitter": "Amin Emad", "authors": "Amin Emad and Olgica Milenkovic", "title": "Information Theoretic Bounds for Tensor Rank Minimization over Finite\n  Fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of noiseless and noisy low-rank tensor completion\nfrom a set of random linear measurements. In our derivations, we assume that\nthe entries of the tensor belong to a finite field of arbitrary size and that\nreconstruction is based on a rank minimization framework. The derived results\nshow that the smallest number of measurements needed for exact reconstruction\nis upper bounded by the product of the rank, the order and the dimension of a\ncubic tensor. Furthermore, this condition is also sufficient for unique\nminimization. Similar bounds hold for the noisy rank minimization scenario,\nexcept for a scaling function that depends on the channel error probability.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2011 04:12:51 GMT"}, {"version": "v2", "created": "Sun, 3 Apr 2011 20:16:19 GMT"}], "update_date": "2011-04-05", "authors_parsed": [["Emad", "Amin", ""], ["Milenkovic", "Olgica", ""]]}, {"id": "1103.4438", "submitter": "Ravi Teja Sukhavasi", "authors": "Ravi Teja Sukhavasi, Babak Hassibi", "title": "Anytime Reliable Codes for Stabilizing Plants over Erasure Channels", "comments": "Submitted to CDC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.IT math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of stabilizing an unstable plant over a noisy communication link\nis an increasingly important one that arises in problems of distributed control\nand networked control systems. Although the work of Schulman and Sahai over the\npast two decades, and their development of the notions of \"tree codes\" and\n\"anytime capacity\", provides the theoretical framework for studying such\nproblems, there has been scant practical progress in this area because explicit\nconstructions of tree codes with efficient encoding and decoding did not exist.\nTo stabilize an unstable plant driven by bounded noise over a noisy channel one\nneeds real-time encoding and real-time decoding and a reliability which\nincreases exponentially with delay, which is what tree codes guarantee. We\nprove the existence of linear tree codes with high probability and, for erasure\nchannels, give an explicit construction with an expected encoding and decoding\ncomplexity that is constant per time instant. We give sufficient conditions on\nthe rate and reliability required of the tree codes to stabilize vector plants\nand argue that they are asymptotically tight. This work takes a major step\ntowards controlling plants over noisy channels, and we demonstrate the efficacy\nof the method through several examples.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2011 05:27:42 GMT"}], "update_date": "2011-03-24", "authors_parsed": [["Sukhavasi", "Ravi Teja", ""], ["Hassibi", "Babak", ""]]}, {"id": "1103.4525", "submitter": "Huang  Huang", "authors": "Huang Huang and Vincent K. N. Lau and Yinggang Du and Sheng Liu", "title": "Robust Lattice Alignment for K-user MIMO Interference Channels with\n  Imperfect Channel Knowledge", "comments": null, "journal-ref": null, "doi": "10.1109/TSP.2011.2135855", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a robust lattice alignment design for K-user\nquasi-static MIMO interference channels with imperfect channel knowledge. With\nrandom Gaussian inputs, the conventional interference alignment (IA) method has\nthe feasibility problem when the channel is quasi-static. On the other hand,\nstructured lattices can create structured interference as opposed to the random\ninterference caused by random Gaussian symbols. The structured interference\nspace can be exploited to transmit the desired signals over the gaps. However,\nthe existing alignment methods on the lattice codes for quasi-static channels\neither require infinite SNR or symmetric interference channel coefficients.\nFurthermore, perfect channel state information (CSI) is required for these\nalignment methods, which is difficult to achieve in practice. In this paper, we\npropose a robust lattice alignment method for quasi-static MIMO interference\nchannels with imperfect CSI at all SNR regimes, and a two-stage decoding\nalgorithm to decode the desired signal from the structured interference space.\nWe derive the achievable data rate based on the proposed robust lattice\nalignment method, where the design of the precoders, decorrelators, scaling\ncoefficients and interference quantization coefficients is jointly formulated\nas a mixed integer and continuous optimization problem. The effect of imperfect\nCSI is also accommodated in the optimization formulation, and hence the derived\nsolution is robust to imperfect CSI. We also design a low complex iterative\noptimization algorithm for our robust lattice alignment method by using the\nexisting iterative IA algorithm that was designed for the conventional IA\nmethod. Numerical results verify the advantages of the proposed robust lattice\nalignment method.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2011 14:18:37 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Huang", "Huang", ""], ["Lau", "Vincent K. N.", ""], ["Du", "Yinggang", ""], ["Liu", "Sheng", ""]]}, {"id": "1103.4547", "submitter": "Ayaz Ahmad", "authors": "Ayaz Ahmad and Mohamad Assaad", "title": "Canonical Dual Method for Resource Allocation and Adaptive Modulation in\n  Uplink SC-FDMA Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study resource allocation and adaptive modulation in\nSC-FDMA which is adopted as the multiple access scheme for the uplink in the\n3GPP-LTE standard. A sum-utility maximization (SUmax), and a joint adaptive\nmodulation and sum-cost minimization (JAMSCmin) problems are considered. Unlike\nOFDMA, in addition to the restriction of allocating a sub-channel to one user\nat most, the multiple sub-channels allocated to a user in SC-FDMA should be\nconsecutive as well. This renders the resource allocation problem prohibitively\ndifficult and the standard optimization tools (e.g., Lagrange dual approach\nwidely used for OFDMA, etc.) can not help towards its optimal solution. We\npropose a novel optimization framework for the solution of these problems that\nis inspired from the recently developed canonical duality theory. We first\nformulate the optimization problems as binary-integer programming problems and\nthen transform these binary-integer programming problems into continuous space\ncanonical dual problems that are concave maximization problems. Based on the\nsolution of the continuous space dual problems, we derive resource allocation\n(joint with adaptive modulation for JAMSCmin) algorithms for both the problems\nwhich have polynomial complexities. We provide conditions under which the\nproposed algorithms are optimal. We also propose an adaptive modulation scheme\nfor SUmax problem. We compare the proposed algorithms with the existing\nalgorithms in the literature to assess their performance.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2011 15:15:22 GMT"}, {"version": "v2", "created": "Wed, 28 Dec 2011 16:36:40 GMT"}, {"version": "v3", "created": "Mon, 14 May 2012 17:41:09 GMT"}, {"version": "v4", "created": "Fri, 18 May 2012 05:20:58 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Ahmad", "Ayaz", ""], ["Assaad", "Mohamad", ""]]}, {"id": "1103.4578", "submitter": "Chengpu Wang", "authors": "Chengpu Wang", "title": "Common Signal Analysis", "comments": "8 Pages, 1 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A common signal is defined for any two signals which have non-zero\ncorrelation. A mathematical method is provided to extract the best obtainable\ncommon signal between the two signals. This analysis is extended to extracting\ncommon signal among three signals.\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2011 13:35:34 GMT"}, {"version": "v2", "created": "Thu, 24 Mar 2011 12:56:53 GMT"}], "update_date": "2011-03-25", "authors_parsed": [["Wang", "Chengpu", ""]]}, {"id": "1103.4684", "submitter": "Tharaka Samarasinghe", "authors": "Tharaka Samarasinghe, Hazer Inaltekin, Jamie Evans", "title": "Vector Broadcast Channels: Optimality of Threshold Feedback Policies", "comments": "Submitted to IEEE International Symposium on Information Theory, St.\n  Petersburg, Russia, Aug 2011", "journal-ref": null, "doi": "10.1109/ISIT.2011.6033745", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Beamforming techniques utilizing only partial channel state information (CSI)\nhas gained popularity over other communication strategies requiring perfect CSI\nthanks to their lower feedback requirements. The amount of feedback in\nbeamforming based communication systems can be further reduced through\nselective feedback techniques in which only the users with channels good enough\nare allowed to feed back by means of a decentralized feedback policy. In this\npaper, we prove that thresholding at the receiver is the rate-wise optimal\ndecentralized feedback policy for feedback limited systems with prescribed\nfeedback constraints. This result is highly adaptable due to its distribution\nindependent nature, provides an analytical justification for the use of\nthreshold feedback policies in practical systems, and reinforces previous work\nanalyzing threshold feedback policies as a selective feedback technique without\nproving its optimality. It is robust to selfish unilateral deviations. Finally,\nit reduces the search for rate-wise optimal feedback policies subject to\nfeedback constraints from function spaces to a finite dimensional Euclidean\nspace.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 06:25:54 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Samarasinghe", "Tharaka", ""], ["Inaltekin", "Hazer", ""], ["Evans", "Jamie", ""]]}, {"id": "1103.4687", "submitter": "Tharaka Samarasinghe", "authors": "Tharaka Samarasinghe, Hazer Inaltekin, Jamie Evans", "title": "Vector Broadcast Channels: Optimal Threshold Selection Problem", "comments": "Submitted to IEEE International Symposium on Information Theory, St.\n  Petersburg, Russia, Aug 2011", "journal-ref": null, "doi": "10.1109/ISIT.2011.6033883", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Threshold feedback policies are well known and provably rate-wise optimal\nselective feedback techniques for communication systems requiring partial\nchannel state information (CSI). However, optimal selection of thresholds at\nmobile users to maximize information theoretic data rates subject to feedback\nconstraints is an open problem. In this paper, we focus on the optimal\nthreshold selection problem, and provide a solution for this problem for finite\nfeedback systems. Rather surprisingly, we show that using the same threshold\nvalues at all mobile users is not always a rate-wise optimal feedback strategy,\neven for a system with identical users experiencing statistically the same\nchannel conditions. By utilizing the theory of majorization, we identify an\nunderlying Schur-concave structure in the rate function and obtain sufficient\nconditions for a homogenous threshold feedback policy to be optimal. Our\nresults hold for most fading channel models, and we illustrate an application\nof our results to familiar Rayleigh fading channels.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 06:37:12 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Samarasinghe", "Tharaka", ""], ["Inaltekin", "Hazer", ""], ["Evans", "Jamie", ""]]}, {"id": "1103.4774", "submitter": "Ananthanarayanan Chockalingam", "authors": "Biswajit Dutta, Somsubhra Barik and A. Chockalingam", "title": "Full-Rate Full-Diversity Achieving MIMO Precoding with Partial CSIT", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a $n_t\\times n_r$ multiple-input multiple-output\n(MIMO) channel subjected to block fading. Reliability (in terms of achieved\ndiversity order) and rate (in number of symbols transmitted per channel use)\nare of interest in such channels. We propose a new precoding scheme which\nachieves both full diversity ($n_tn_r$th order diversity) as well as full rate\n($n_t$ symbols per channel use) using partial channel state information at the\ntransmitter (CSIT), applicable in MIMO systems including $n_r<n_t$ asymmetric\nMIMO. The proposed scheme achieves full diversity and improved coding gain\nthrough an optimization over the choice of constellation sets. The optimization\nmaximizes $d_{min}^2$ for our precoding scheme subject to an energy constraint.\nThe scheme requires feedback of $n_t-1$ angle parameter values, compared to\n$2n_tn_r$ real coefficients in case of full CSIT. Error rate performance\nresults for $3\\times 1$, $3\\times 2$, $4\\times 1$, $8\\times 1$ precoded MIMO\nsystems (with $n_t=3,3,4,8$ symbols per channel use, respectively) show that\nthe proposed precoding achieves 3rd, 6th, 4th and 8th order diversities,\nrespectively. These performances are shown to be better than other precoding\nschemes in the literature; the better performance is due to the choice of the\nsignal sets and the feedback angles in the proposed scheme.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 14:23:54 GMT"}], "update_date": "2011-03-25", "authors_parsed": [["Dutta", "Biswajit", ""], ["Barik", "Somsubhra", ""], ["Chockalingam", "A.", ""]]}, {"id": "1103.4784", "submitter": "Chao Tian", "authors": "Chao Tian", "title": "Latent Capacity Region: A Case Study on Symmetric Broadcast With Common\n  Messages", "comments": "13 pages, 4 figures, double column format. to appear in IEEE Trans.\n  Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2133070", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of broadcast with common messages, and focus on the\ncase that the common message rate $R_{\\mathcal{A}}$, i.e., the rate of the\nmessage intended for all the receivers in the set $\\mathcal{A}$, is the same\nfor all the set $\\mathcal{A}$ of the same cardinality. Instead of attempting to\ncharacterize the capacity region of general broadcast channels, we only\nconsider the structure of the capacity region that any broadcast channel should\nbear. The concept of latent capacity region is useful in capturing these\nunderlying constraints, and we provide a complete characterization of the\nlatent capacity region for the symmetric broadcast problem. The converse proof\nof this tight characterization relies on a deterministic broadcast channel\nmodel. The achievability proof generalizes the familiar rate transfer argument\nto include more involved erasure correction coding among messages, thus\nrevealing an inherent connection between broadcast with common message and\nerasure correction codes.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 15:25:25 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Tian", "Chao", ""]]}, {"id": "1103.4787", "submitter": "Paolo Castiglione", "authors": "Paolo Castiglione, Osvaldo Simeone, Elza Erkip, Thomas Zemen", "title": "Energy Management Policies for Energy-Neutral Source-Channel Coding", "comments": "Submitted to IEEE Transactions on Communications in March 2011; last\n  update in July 2011", "journal-ref": null, "doi": "10.1109/TCOMM.2012.071212.110167", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In cyber-physical systems where sensors measure the temporal evolution of a\ngiven phenomenon of interest and radio communication takes place over short\ndistances, the energy spent for source acquisition and compression may be\ncomparable with that used for transmission. Additionally, in order to avoid\nlimited lifetime issues, sensors may be powered via energy harvesting and thus\ncollect all the energy they need from the environment. This work addresses the\nproblem of energy allocation over source acquisition/compression and\ntransmission for energy-harvesting sensors. At first, focusing on a\nsingle-sensor, energy management policies are identified that guarantee a\nmaximal average distortion while at the same time ensuring the stability of the\nqueue connecting source and channel encoders. It is shown that the identified\nclass of policies is optimal in the sense that it stabilizes the queue whenever\nthis is feasible by any other technique that satisfies the same average\ndistortion constraint. Moreover, this class of policies performs an independent\nresource optimization for the source and channel encoders. Analog transmission\ntechniques as well as suboptimal strategies that do not use the energy buffer\n(battery) or use it only for adapting either source or channel encoder energy\nallocation are also studied for performance comparison. The problem of\noptimizing the desired trade-off between average distortion and delay is then\nformulated and solved via dynamic programming tools. Finally, a system with\nmultiple sensors is considered and time-division scheduling strategies are\nderived that are able to maintain the stability of all data queues and to meet\nthe average distortion constraints at all sensors whenever it is feasible.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 15:29:39 GMT"}, {"version": "v2", "created": "Wed, 6 Jul 2011 09:17:47 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Castiglione", "Paolo", ""], ["Simeone", "Osvaldo", ""], ["Erkip", "Elza", ""], ["Zemen", "Thomas", ""]]}, {"id": "1103.4854", "submitter": "Vadas Gintautas", "authors": "Vadas Gintautas, Aric Hagberg, Luis M. A. Bettencourt", "title": "When is social computation better than the sum of its parts?", "comments": "5 pages, 1 figure; In H. Liu, J. J. Salerno, and M. J. Young,\n  editors, Social Computing, Behavior Modeling, and Prediction, 2009", "journal-ref": null, "doi": null, "report-no": "LA-UR 09-00432", "categories": "cs.IT cs.AI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social computation, whether in the form of searches performed by swarms of\nagents or collective predictions of markets, often supplies remarkably good\nsolutions to complex problems. In many examples, individuals trying to solve a\nproblem locally can aggregate their information and work together to arrive at\na superior global solution. This suggests that there may be general principles\nof information aggregation and coordination that can transcend particular\napplications. Here we show that the general structure of this problem can be\ncast in terms of information theory and derive mathematical conditions that\nlead to optimal multi-agent searches. Specifically, we illustrate the problem\nin terms of local search algorithms for autonomous agents looking for the\nspatial location of a stochastic source. We explore the types of search\nproblems, defined in terms of the statistical properties of the source and the\nnature of measurements at each agent, for which coordination among multiple\nsearchers yields an advantage beyond that gained by having the same number of\nindependent searchers. We show that effective coordination corresponds to\nsynergy and that ineffective coordination corresponds to independence as\ndefined using information theory. We classify explicit types of sources in\nterms of their potential for synergy. We show that sources that emit\nuncorrelated signals provide no opportunity for synergetic coordination while\nsources that emit signals that are correlated in some way, do allow for strong\nsynergy between searchers. These general considerations are crucial for\ndesigning optimal algorithms for particular search problems in real world\nsettings.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 19:47:51 GMT"}], "update_date": "2011-03-25", "authors_parsed": [["Gintautas", "Vadas", ""], ["Hagberg", "Aric", ""], ["Bettencourt", "Luis M. A.", ""]]}, {"id": "1103.4888", "submitter": "Vadas Gintautas", "authors": "Vadas Gintautas, Aric Hagberg, Luis M. A. Bettencourt", "title": "Cooperative searching for stochastic targets", "comments": "Journal of Intelligence Community Research and Development,\n  permanently available on Intelink, October 2010", "journal-ref": null, "doi": null, "report-no": "LA-UR 09-07676", "categories": "cs.IT cs.AI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatial search problems abound in the real world, from locating hidden\nnuclear or chemical sources to finding skiers after an avalanche. We exemplify\nthe formalism and solution for spatial searches involving two agents that may\nor may not choose to share information during a search. For certain classes of\ntasks, sharing information between multiple searchers makes cooperative\nsearching advantageous. In some examples, agents are able to realize synergy by\naggregating information and moving based on local judgments about maximal\ninformation gathering expectations. We also explore one- and two-dimensional\nsimplified situations analytically and numerically to provide a framework for\nanalyzing more complex problems. These general considerations provide a guide\nfor designing optimal algorithms for real-world search problems.\n", "versions": [{"version": "v1", "created": "Fri, 25 Mar 2011 00:54:19 GMT"}], "update_date": "2011-03-28", "authors_parsed": [["Gintautas", "Vadas", ""], ["Hagberg", "Aric", ""], ["Bettencourt", "Luis M. A.", ""]]}, {"id": "1103.4951", "submitter": "Yohann de Castro", "authors": "Yohann de Castro (IMT), Fabrice Gamboa (IMT)", "title": "Exact Reconstruction using Beurling Minimal Extrapolation", "comments": "27 pages, 3 figures version 2 : minor changes and new title", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT math.OC math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that measures with finite support on the real line are the unique\nsolution to an algorithm, named generalized minimal extrapolation, involving\nonly a finite number of generalized moments (which encompass the standard\nmoments, the Laplace transform, the Stieltjes transformation, etc). Generalized\nminimal extrapolation shares related geometric properties with basis pursuit of\nChen, Donoho and Saunders [CDS98]. Indeed we also extend some standard results\nof compressed sensing (the dual polynomial, the nullspace property) to the\nsigned measure framework. We express exact reconstruction in terms of a simple\ninterpolation problem. We prove that every nonnegative measure, supported by a\nset containing s points,can be exactly recovered from only 2s + 1 generalized\nmoments. This result leads to a new construction of deterministic sensing\nmatrices for compressed sensing.\n", "versions": [{"version": "v1", "created": "Fri, 25 Mar 2011 11:31:47 GMT"}, {"version": "v2", "created": "Thu, 5 Apr 2012 06:55:24 GMT"}], "update_date": "2012-04-06", "authors_parsed": [["de Castro", "Yohann", "", "IMT"], ["Gamboa", "Fabrice", "", "IMT"]]}, {"id": "1103.4977", "submitter": "David K\\\"allberg Mr", "authors": "David K\\\"allberg, Nikolaj Leonenko, Oleg Seleznjev", "title": "Statistical Inference for R\\'enyi Entropy Functionals", "comments": "15 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Numerous entropy-type characteristics (functionals) generalizing R\\'enyi\nentropy are widely used in mathematical statistics, physics, information\ntheory, and signal processing for characterizing uncertainty in probability\ndistributions and distribution identification problems. We consider estimators\nof some entropy (integral) functionals for discrete and continuous\ndistributions based on the number of epsilon-close vector records in the\ncorresponding independent and identically distributed samples from two\ndistributions. The estimators form a triangular scheme of generalized\nU-statistics. We show the asymptotic properties of these estimators (e.g.,\nconsistency and asymptotic normality). The results can be applied in various\nproblems in computer science and mathematical statistics (e.g., approximate\nmatching for random databases, record linkage, image matching).\n", "versions": [{"version": "v1", "created": "Fri, 25 Mar 2011 14:20:38 GMT"}], "update_date": "2011-03-28", "authors_parsed": [["Källberg", "David", ""], ["Leonenko", "Nikolaj", ""], ["Seleznjev", "Oleg", ""]]}, {"id": "1103.5128", "submitter": "Chia-han Lee", "authors": "Chia-han Lee and Wayne Wolf", "title": "Power Consumption of LDPC Decoders in Software Radio", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  LDPC code is a powerful error correcting code and has been applied to many\nadvanced communication systems. The prosperity of software radio has motivated\nus to investigate the implementation of LDPC decoders on processors. In this\npaper, we estimate and compare complexity and power consumption of LDPC\ndecoding algorithms running on general purpose processors. Using the estimation\nresults, we show two power control schemes for software radio: SNR-based\nalgorithm diversity and joint transmit power and receiver energy management.\nOverall, this paper discusses general concerns about using processors as the\nsoftware radio platform for the implementation of LDPC decoders.\n", "versions": [{"version": "v1", "created": "Sat, 26 Mar 2011 13:10:35 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Lee", "Chia-han", ""], ["Wolf", "Wayne", ""]]}, {"id": "1103.5133", "submitter": "Arash Behboodi", "authors": "Arash Behboodi and Pablo Piantanida", "title": "Cooperative Strategies for Simultaneous and Broadcast Relay Channels", "comments": "32 pages, 7 figures, To appear in IEEE Trans. on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the \\emph{simultaneous relay channel} (SRC) which consists of a set\nof relay channels where the source wishes to transmit common and private\ninformation to each of the destinations. This problem is recognized as being\nequivalent to that of sending common and private information to several\ndestinations in presence of helper relays where each channel outcome becomes a\nbranch of the \\emph{broadcast relay channel} (BRC). Cooperative schemes and\ncapacity region for a set with two memoryless relay channels are investigated.\nThe proposed coding schemes, based on \\emph{Decode-and-Forward} (DF) and\n\\emph{Compress-and-Forward} (CF) must be capable of transmitting information\nsimultaneously to all destinations in such set.\n  Depending on the quality of source-to-relay and relay-to-destination\nchannels, inner bounds on the capacity of the general BRC are derived. Three\ncases of particular interest are considered: cooperation is based on DF\nstrategy for both users --referred to as DF-DF region--, cooperation is based\non CF strategy for both users --referred to as CF-CF region--, and cooperation\nis based on DF strategy for one destination and CF for the other --referred to\nas DF-CF region--. These results can be seen as a generalization and hence\nunification of previous works. An outer-bound on the capacity of the general\nBRC is also derived. Capacity results are obtained for the specific cases of\nsemi-degraded and degraded Gaussian simultaneous relay channels. Rates are\nevaluated for Gaussian models where the source must guarantee a minimum amount\nof information to both users while additional information is sent to each of\nthem.\n", "versions": [{"version": "v1", "created": "Sat, 26 Mar 2011 13:42:53 GMT"}, {"version": "v2", "created": "Wed, 16 May 2012 15:04:21 GMT"}, {"version": "v3", "created": "Sun, 14 Oct 2012 14:25:58 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Behboodi", "Arash", ""], ["Piantanida", "Pablo", ""]]}, {"id": "1103.5142", "submitter": "Paolo Braca Paolo Braca", "authors": "Paolo Braca, Stefano Marano, and Vincenzo Matta", "title": "Asymptotic Properties of One-Bit Distributed Detection with Ordered\n  Transmissions", "comments": "Submitted to IEEE Signal Processing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.MA math.IT stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a sensor network made of remote nodes connected to a common fusion\ncenter. In a recent work Blum and Sadler [1] propose the idea of ordered\ntransmissions -sensors with more informative samples deliver their messages\nfirst- and prove that optimal detection performance can be achieved using only\na subset of the total messages. Taking to one extreme this approach, we show\nthat just a single delivering allows making the detection errors as small as\ndesired, for a sufficiently large network size: a one-bit detection scheme can\nbe asymptotically consistent. The transmission ordering is based on the modulus\nof some local statistic (MO system). We derive analytical results proving the\nasymptotic consistency and, for the particular case that the local statistic is\nthe log-likelihood (\\ell-MO system), we also obtain a bound on the error\nconvergence rate. All the theorems are proved under the general setup of random\nnumber of sensors. Computer experiments corroborate the analysis and address\ntypical examples of applications including: non-homogeneous Poisson-deployed\nnetworks, detection by per-sensor censoring, monitoring of energy-constrained\nphenomenon.\n", "versions": [{"version": "v1", "created": "Sat, 26 Mar 2011 16:48:29 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Braca", "Paolo", ""], ["Marano", "Stefano", ""], ["Matta", "Vincenzo", ""]]}, {"id": "1103.5188", "submitter": "Catuscia Palamidessi", "authors": "M\\'ario S. Alvim, Miguel E. Andr\\'es, Konstantinos Chatzikokolakis,\n  Pierpaolo Degano, Catuscia Palamidessi", "title": "Differential Privacy: on the trade-off between Utility and Information\n  Leakage", "comments": "30 pages; HAL repository", "journal-ref": "Proceedings of the 8th International Workshop on Formal Aspects of\n  Security & Trust (FAST'11), Springer, LNCS 7140, pp. 39-54, 2011", "doi": "10.1007/978-3-642-29420-4_3", "report-no": "inria-00580122", "categories": "cs.CR cs.DB cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Differential privacy is a notion of privacy that has become very popular in\nthe database community. Roughly, the idea is that a randomized query mechanism\nprovides sufficient privacy protection if the ratio between the probabilities\nthat two adjacent datasets give the same answer is bound by e^epsilon. In the\nfield of information flow there is a similar concern for controlling\ninformation leakage, i.e. limiting the possibility of inferring the secret\ninformation from the observables. In recent years, researchers have proposed to\nquantify the leakage in terms of R\\'enyi min mutual information, a notion\nstrictly related to the Bayes risk. In this paper, we show how to model the\nquery system in terms of an information-theoretic channel, and we compare the\nnotion of differential privacy with that of mutual information. We show that\ndifferential privacy implies a bound on the mutual information (but not\nvice-versa). Furthermore, we show that our bound is tight. Then, we consider\nthe utility of the randomization mechanism, which represents how close the\nrandomized answers are, in average, to the real ones. We show that the notion\nof differential privacy implies a bound on utility, also tight, and we propose\na method that under certain conditions builds an optimal randomization\nmechanism, i.e. a mechanism which provides the best utility while guaranteeing\ndifferential privacy.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2011 06:41:12 GMT"}, {"version": "v2", "created": "Mon, 9 May 2011 00:04:26 GMT"}, {"version": "v3", "created": "Thu, 25 Aug 2011 04:12:17 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Alvim", "Mário S.", ""], ["Andrés", "Miguel E.", ""], ["Chatzikokolakis", "Konstantinos", ""], ["Degano", "Pierpaolo", ""], ["Palamidessi", "Catuscia", ""]]}, {"id": "1103.5197", "submitter": "Parisa Babaheidarian", "authors": "Parisa Babaheidarian and Somayeh Salimi and Mohammad Reza Aref", "title": "A New Secret key Agreement Scheme in a Four-Terminal Network", "comments": "6 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new scenario for generating a secret key and two private keys among three\nTerminals in the presence of an external eavesdropper is considered. Terminals\n1, 2 and 3 intend to share a common secret key concealed from the external\neavesdropper (Terminal 4) and simultaneously, each of Terminals 1 and 2 intends\nto share a private key with Terminal 3 while keeping it concealed from each\nother and from Terminal 4. All four Terminals observe i.i.d. outputs of\ncorrelated sources and there is a public channel from Terminal 3 to Terminals 1\nand 2. An inner bound of the \"secret key-private keys capacity region\" is\nderived and the single letter capacity regions are obtained for some special\ncases.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2011 11:08:07 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Babaheidarian", "Parisa", ""], ["Salimi", "Somayeh", ""], ["Aref", "Mohammad Reza", ""]]}, {"id": "1103.5218", "submitter": "Inder Jeet Taneja", "authors": "Inder Jeet Taneja", "title": "Generalized Symmetric Divergence Measures and the Probability of Error", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are three classical divergence measures exist in the literature on\ninformation theory and statistics. These are namely, Jeffryes-Kullback-Leiber\nJ-divergence. Sibson-Burbea-Rao Jensen-Shannon divegernce and Taneja\nArithmetic-Geometric divergence. These three measures bear an interesting\nrelationship among each other. The divergence measures like Hellinger\ndiscrimination, symmetric chi-square divergence, and triangular discrimination\nare also known in the literature. In this paper, we have considered generalized\nsymmetric divergence measures having the measures given above as particular\ncases. Bounds on the probability of error are obtained in terms of generalized\nsymmetric divergence measures. Study of bounds on probability of error is\nextended for the difference of divergence measures.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2011 14:46:35 GMT"}, {"version": "v2", "created": "Wed, 30 Mar 2011 22:20:52 GMT"}], "update_date": "2011-04-01", "authors_parsed": [["Taneja", "Inder Jeet", ""]]}, {"id": "1103.5219", "submitter": "Inder Jeet Taneja", "authors": "Inder Jeet Taneja", "title": "Upper Bounds on the Probability of Error in terms of Mean Divergence\n  Measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we shall consider some famous means such as arithmetic,\nharmonic, geometric, root square mean, etc. Considering the difference of these\nmeans, we can establish. some inequalities among them. Interestingly, the\ndifference of mean considered is convex functions. Applying some properties,\nupper bounds on the probability of error are established in this paper. It is\nalso shown that the results obtained are sharper than obtained directly\napplying known inequalities.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2011 14:52:12 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Taneja", "Inder Jeet", ""]]}, {"id": "1103.5290", "submitter": "Chin Keong Ho", "authors": "Chin Keong Ho and Rui Zhang", "title": "Optimal Energy Allocation for Wireless Communications with Energy\n  Harvesting Constraints", "comments": "27 pages, 6 figures, accepted for publications at IEEE Transactions\n  on Signal Processing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the use of energy harvesters, in place of conventional batteries\nwith fixed energy storage, for point-to-point wireless communications. In\naddition to the challenge of transmitting in a channel with time selective\nfading, energy harvesters provide a perpetual but unreliable energy source. In\nthis paper, we consider the problem of energy allocation over a finite horizon,\ntaking into account channel conditions and energy sources that are time\nvarying, so as to maximize the throughput. Two types of side information (SI)\non the channel conditions and harvested energy are assumed to be available:\ncausal SI (of the past and present slots) or full SI (of the past, present and\nfuture slots). We obtain structural results for the optimal energy allocation,\nvia the use of dynamic programming and convex optimization techniques. In\nparticular, if unlimited energy can be stored in the battery with harvested\nenergy and the full SI is available, we prove the optimality of a water-filling\nenergy allocation solution where the so-called water levels follow a staircase\nfunction.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 06:59:42 GMT"}, {"version": "v2", "created": "Wed, 9 May 2012 06:01:25 GMT"}], "update_date": "2012-05-10", "authors_parsed": [["Ho", "Chin Keong", ""], ["Zhang", "Rui", ""]]}, {"id": "1103.5348", "submitter": "Dieter Duyck", "authors": "Dieter Duyck, Joseph Jean Boutros, Marc Moeneclaey", "title": "Precoding for Outage Probability Minimization on Block Fading Channels", "comments": "Submitted to Transactions on Information Theory on March 23, 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The outage probability limit is a fundamental and achievable lower bound on\nthe word error rate of coded communication systems affected by fading. This\nlimit is mainly determined by two parameters: the diversity order and the\ncoding gain. With linear precoding, full diversity on a block fading channel\ncan be achieved without error-correcting code. However, the effect of precoding\non the coding gain is not well known, mainly due to the complicated expression\nof the outage probability. Using a geometric approach, this paper establishes\nsimple upper bounds on the outage probability, the minimization of which yields\nto precoding matrices that achieve very good performance. For discrete\nalphabets, it is shown that the combination of constellation expansion and\nprecoding is sufficient to closely approach the minimum possible outage\nachieved by an i.i.d. Gaussian input distribution, thus essentially maximizing\nthe coding gain.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 13:37:30 GMT"}, {"version": "v2", "created": "Thu, 12 May 2011 14:03:42 GMT"}, {"version": "v3", "created": "Thu, 4 Oct 2012 13:55:33 GMT"}], "update_date": "2012-10-05", "authors_parsed": [["Duyck", "Dieter", ""], ["Boutros", "Joseph Jean", ""], ["Moeneclaey", "Marc", ""]]}, {"id": "1103.5426", "submitter": "Alireza Vahid", "authors": "Alireza Vahid, Changho Suh, and Amir Salman Avestimehr", "title": "Interference Channels with Rate-Limited Feedback", "comments": "A mistake in the derivation of inequalities (27) and (75) is\n  corrected. Inequalities (26g), (26l), (26m), (33c) and (63c) are updated\n  accordingly", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the two-user interference channel with rate-limited feedback.\nRelated prior works focus on the case where feedback links have infinite\ncapacity, while no research has been done for the rate-limited feedback\nproblem. Several new challenges arise due to the capacity limitations of the\nfeedback links, both in deriving inner-bounds and outer-bounds. We study this\nproblem under three different interference models: the El Gamal-Costa\ndeterministic model, the linear deterministic model, and the Gaussian model.\nFor the first two models, we develop an achievable scheme that employs three\ntechniques: Han-Kobayashi message splitting, quantize-and-binning, and\ndecode-and-forward. We also derive new outer-bounds for all three models and we\nshow the optimality of our scheme under the linear deterministic model. In the\nGaussian case, we propose a transmission strategy that incorporates lattice\ncodes, inspired by the ideas developed in the first two models. For symmetric\nchannel gains, we prove that the gap between the achievable sum-rate of the\nproposed scheme and our new outer-bounds is bounded by a constant number of\nbits, independent of the channel gains.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 17:37:37 GMT"}, {"version": "v2", "created": "Fri, 23 Dec 2011 17:11:16 GMT"}, {"version": "v3", "created": "Sun, 6 May 2012 18:45:21 GMT"}], "update_date": "2012-05-08", "authors_parsed": [["Vahid", "Alireza", ""], ["Suh", "Changho", ""], ["Avestimehr", "Amir Salman", ""]]}, {"id": "1103.5478", "submitter": "Emmanuel Abbe A", "authors": "Emmanuel Abbe, Shao-Lun Huang, Emre Telatar", "title": "Proof of the outage probability conjecture for MISO channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Telatar 1999, it is conjectured that the covariance matrices minimizing\nthe outage probability for MIMO channels with Gaussian fading are diagonal with\neither zeros or constant values on the diagonal. In the MISO setting, this is\nequivalent to conjecture that the Gaussian quadratic forms having largest tale\nprobability correspond to such diagonal matrices. We prove here the conjecture\nin the MISO setting.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 20:33:46 GMT"}], "update_date": "2011-03-30", "authors_parsed": [["Abbe", "Emmanuel", ""], ["Huang", "Shao-Lun", ""], ["Telatar", "Emre", ""]]}, {"id": "1103.5479", "submitter": "Deanna Needell", "authors": "Yonina C. Eldar, Deanna Needell, Yaniv Plan", "title": "Unicity conditions for low-rank matrix recovery", "comments": null, "journal-ref": null, "doi": "10.1117/12.891933", "report-no": null, "categories": "math.NA cs.IT cs.SY math.IT math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Low-rank matrix recovery addresses the problem of recovering an unknown\nlow-rank matrix from few linear measurements. Nuclear-norm minimization is a\ntractible approach with a recent surge of strong theoretical backing. Analagous\nto the theory of compressed sensing, these results have required random\nmeasurements. For example, m >= Cnr Gaussian measurements are sufficient to\nrecover any rank-r n x n matrix with high probability. In this paper we address\nthe theoretical question of how many measurements are needed via any method\nwhatsoever --- tractible or not. We show that for a family of random\nmeasurement ensembles, m >= 4nr - 4r^2 measurements are sufficient to guarantee\nthat no rank-2r matrix lies in the null space of the measurement operator with\nprobability one. This is a necessary and sufficient condition to ensure uniform\nrecovery of all rank-r matrices by rank minimization. Furthermore, this value\nof $m$ precisely matches the dimension of the manifold of all rank-2r matrices.\nWe also prove that for a fixed rank-r matrix, m >= 2nr - r^2 + 1 random\nmeasurements are enough to guarantee recovery using rank minimization. These\nresults give a benchmark to which we may compare the efficacy of nuclear-norm\nminimization.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 20:36:03 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Eldar", "Yonina C.", ""], ["Needell", "Deanna", ""], ["Plan", "Yaniv", ""]]}, {"id": "1103.5520", "submitter": "Yue Wu", "authors": "Yue Wu, Joseph P. Noonan, and Sos Agaian", "title": "Shannon Entropy based Randomness Measurement and Test for Image\n  Encryption", "comments": "23 Pages, 7 figures and 5 tables. Submitted to the Journal of\n  Information Sciences", "journal-ref": null, "doi": "10.1016/j.ins.2012.07.049", "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The quality of image encryption is commonly measured by the Shannon entropy\nover the ciphertext image. However, this measurement does not consider to the\nrandomness of local image blocks and is inappropriate for scrambling based\nimage encryption methods. In this paper, a new information entropy-based\nrandomness measurement for image encryption is introduced which, for the first\ntime, answers the question of whether a given ciphertext image is sufficiently\nrandom-like. It measures the randomness over the ciphertext in a fairer way by\ncalculating the averaged entropy of a series of small image blocks within the\nentire test image. In order to fulfill both quantitative and qualitative\nmeasurement, the expectation and the variance of this averaged block entropy\nfor a true-random image are strictly derived and corresponding numerical\nreference tables are also provided. Moreover, a hypothesis test at\nsignificance-level is given to help accept or reject the hypothesis that the\ntest image is ideally encrypted/random-like. Simulation results show that the\nproposed test is able to give both effectively quantitative and qualitative\nresults for image encryption. The same idea can also be applied to measure\nother digital data, like audio and video.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 00:55:53 GMT"}], "update_date": "2016-11-27", "authors_parsed": [["Wu", "Yue", ""], ["Noonan", "Joseph P.", ""], ["Agaian", "Sos", ""]]}, {"id": "1103.5535", "submitter": "Natasha Devroye", "authors": "Yiwei Song and Natasha Devroye", "title": "A Lattice Compress-and-Forward Scheme", "comments": "7 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a nested lattice-code-based strategy that achieves the\nrandom-coding based Compress-and-Forward (CF) rate for the three node Gaussian\nrelay channel. To do so, we first outline a lattice-based strategy for the\n$(X+Z_1,X+Z_2)$ Wyner-Ziv lossy source-coding with side-information problem in\nGaussian noise, a re-interpretation of the nested lattice-code-based Gaussian\nWyner-Ziv scheme presented by Zamir, Shamai, and Erez. We use the notation\n$(X+Z_1,X+Z_2)$ Wyner-Ziv to mean that the source is of the form $X+ Z_1$ and\nthe side-information at the receiver is of the form $X+ Z_2$, for independent\nGaussian $X, Z_1$ and $Z_2$. We next use this $(X+Z_1,X+Z_2)$ Wyner-Ziv scheme\nto implement a \"structured\" or lattice-code-based CF scheme which achieves the\nclassic CF rate for Gaussian relay channels. This suggests that lattice codes\nmay not only be useful in point-to-point single-hop source and channel coding,\nin multiple access and broadcast channels, but that they may also be useful in\nlarger relay networks. The usage of lattice codes in larger networks is\nmotivated by their structured nature (possibly leading to rate gains) and\ndecoding (relatively simple) being more practically realizable than their\nrandom coding based counterparts. We furthermore expect the proposed\nlattice-based CF scheme to constitute a first step towards a generic structured\nachievability scheme for networks such as a structured version of the recently\nintroduced \"noisy network coding\".\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 02:57:39 GMT"}], "update_date": "2011-03-30", "authors_parsed": [["Song", "Yiwei", ""], ["Devroye", "Natasha", ""]]}, {"id": "1103.5542", "submitter": "Jovana Ilic", "authors": "Jovana Ilic and Thomas Strohmer", "title": "Sparsity Enhanced Decision Feedback Equalization", "comments": null, "journal-ref": null, "doi": "10.1109/TSP.2012.2189387", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For single-carrier systems with frequency domain equalization, decision\nfeedback equalization (DFE) performs better than linear equalization and has\nmuch lower computational complexity than sequence maximum likelihood detection.\nThe main challenge in DFE is the feedback symbol selection rule. In this paper,\nwe give a theoretical framework for a simple, sparsity based thresholding\nalgorithm. We feed back multiple symbols in each iteration, so the algorithm\nconverges fast and has a low computational cost. We show how the initial\nsolution can be obtained via convex relaxation instead of linear equalization,\nand illustrate the impact that the choice of the initial solution has on the\nbit error rate performance of our algorithm. The algorithm is applicable in\nseveral existing wireless communication systems (SC-FDMA, MC-CDMA, MIMO-OFDM).\nNumerical results illustrate significant performance improvement in terms of\nbit error rate compared to the MMSE solution.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 04:33:44 GMT"}, {"version": "v2", "created": "Thu, 31 Mar 2011 03:00:49 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Ilic", "Jovana", ""], ["Strohmer", "Thomas", ""]]}, {"id": "1103.5625", "submitter": "Reginald Smith", "authors": "Reginald D. Smith", "title": "Information Theory and Population Genetics", "comments": "29 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The key findings of classical population genetics are derived using a\nframework based on information theory using the entropies of the allele\nfrequency distribution as a basis. The common results for drift, mutation,\nselection, and gene flow will be rewritten both in terms of information\ntheoretic measurements and used to draw the classic conclusions for balance\nconditions and common features of one locus dynamics. Linkage disequilibrium\nwill also be discussed including the relationship between mutual information\nand r^2 and a simple model of hitchhiking.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2011 15:45:40 GMT"}, {"version": "v2", "created": "Fri, 8 Jun 2012 16:32:33 GMT"}], "update_date": "2012-06-11", "authors_parsed": [["Smith", "Reginald D.", ""]]}, {"id": "1103.5639", "submitter": "Tomer Michaeli", "authors": "Tomer Michaeli, Daniel Sigalov and Yonina C. Eldar", "title": "Partially Linear Estimation with Application to Sparse Signal Recovery\n  From Measurement Pairs", "comments": "13 pages, 5 figures", "journal-ref": null, "doi": "10.1109/TSP.2012.2185232", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of estimating a random vector X from two sets of\nmeasurements Y and Z, such that the estimator is linear in Y. We show that the\npartially linear minimum mean squared error (PLMMSE) estimator does not require\nknowing the joint distribution of X and Y in full, but rather only its\nsecond-order moments. This renders it of potential interest in various\napplications. We further show that the PLMMSE method is minimax-optimal among\nall estimators that solely depend on the second-order statistics of X and Y. We\ndemonstrate our approach in the context of recovering a signal, which is sparse\nin a unitary dictionary, from noisy observations of it and of a filtered\nversion of it. We show that in this setting PLMMSE estimation has a clear\ncomputational advantage, while its performance is comparable to\nstate-of-the-art algorithms. We apply our approach both in static and dynamic\nestimation applications. In the former category, we treat the problem of image\nenhancement from blurred/noisy image pairs, where we show that PLMMSE\nestimation performs only slightly worse than state-of-the art algorithms, while\nrunning an order of magnitude faster. In the dynamic setting, we provide a\nrecursive implementation of the estimator and demonstrate its utility in the\ncontext of tracking maneuvering targets from position and acceleration\nmeasurements.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 13:42:04 GMT"}, {"version": "v2", "created": "Thu, 24 Nov 2011 08:18:35 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Michaeli", "Tomer", ""], ["Sigalov", "Daniel", ""], ["Eldar", "Yonina C.", ""]]}, {"id": "1103.5738", "submitter": "Hadi Ghauch", "authors": "Hadi G. Ghauch, Constantinos B. Papadias", "title": "Interference Alignment: A one-sided approach", "comments": "Submitted to the IEEE GLOBECOM 2011 conference, under the Signal\n  Processing for Communications Track: 5 pages, double columns, 5 figures", "journal-ref": null, "doi": "10.1109/GLOCOM.2011.6134100", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interference Alignment (IA) is the process of designing signals in such a way\nthat they cast overlapping shadows at their unintended receivers, while\nremaining distinguishable at the intended ones. Our goal in this paper is to\ncome up with an algorithm for IA that runs at the transmitters only (and is\ntransparent to the receivers), that doesn't require channel reciprocity, and\nthat alleviates the need to alternate between the forward and reverse network\nas is the case in Distributed IA (Gomadam, Cadambe, Jafar 08'), thereby\ninducing significant overhead in certain environments where the channel changes\nfrequently. Most importantly, our effort is focused on ensuring that this\none-sided approach does not degrade the performance of the system w.r.t.\nDistributed IA (since it cannot improve it). As a first step, we model the\ninterference in each receiver's desired signal as a function of the\ntransmitters' beamforming vectors. We then propose a simple steepest descent\n(SD) algorithm and use it to minimize the interference in each receiver's\ndesired signal space. We mathematically establish equivalences between our\napproach and the Distributed IA algorithm (Gomadam, Cadambe, Jafar 08') and\nshow that our algorithm also converges to an alignment solution (when the\nsolution is feasible).\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 19:46:07 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Ghauch", "Hadi G.", ""], ["Papadias", "Constantinos B.", ""]]}, {"id": "1103.5740", "submitter": "Steve Haynal", "authors": "Steve Haynal and Heidi Haynal", "title": "Generating and Searching Families of FFT Algorithms", "comments": "Preprint submitted on March 28, 2011, to the Journal on\n  Satisfiability, Boolean Modeling and Computation", "journal-ref": "Journal on Satisfiability, Boolean Modeling and Computation,\n  7:145-187, 2011", "doi": null, "report-no": null, "categories": "cs.IT cs.LO cs.SC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fundamental question of longstanding theoretical interest is to prove the\nlowest exact count of real additions and multiplications required to compute a\npower-of-two discrete Fourier transform (DFT). For 35 years the split-radix\nalgorithm held the record by requiring just 4n log n - 6n + 8 arithmetic\noperations on real numbers for a size-n DFT, and was widely believed to be the\nbest possible. Recent work by Van Buskirk et al. demonstrated improvements to\nthe split-radix operation count by using multiplier coefficients or \"twiddle\nfactors\" that are not n-th roots of unity for a size-n DFT. This paper presents\na Boolean Satisfiability-based proof of the lowest operation count for certain\nclasses of DFT algorithms. First, we present a novel way to choose new yet\nvalid twiddle factors for the nodes in flowgraphs generated by common\npower-of-two fast Fourier transform algorithms, FFTs. With this new technique,\nwe can generate a large family of FFTs realizable by a fixed flowgraph. This\nsolution space of FFTs is cast as a Boolean Satisfiability problem, and a\nmodern Satisfiability Modulo Theory solver is applied to search for FFTs\nrequiring the fewest arithmetic operations. Surprisingly, we find that there\nare FFTs requiring fewer operations than the split-radix even when all twiddle\nfactors are n-th roots of unity.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 19:46:24 GMT"}, {"version": "v2", "created": "Tue, 30 Aug 2011 20:04:54 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Haynal", "Steve", ""], ["Haynal", "Heidi", ""]]}, {"id": "1103.5789", "submitter": "Lei Zhou", "authors": "Lei Zhou and Wei Yu", "title": "On the Capacity of the K-User Cyclic Gaussian Interference Channel", "comments": "ISIT, Saint Petersburg, Russia, Aug 2011, pp. 1171-1175", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This paper studies the capacity region of a $K$-user cyclic Gaussian\ninterference channel, where the $k$th user interferes with only the $(k-1)$th\nuser (mod $K$) in the network. Inspired by the work of Etkin, Tse and Wang,\nwhich derived a capacity region outer bound for the two-user Gaussian\ninterference channel and proved that a simple Han-Kobayashi power splitting\nscheme can achieve to within one bit of the capacity region for all values of\nchannel parameters, this paper shows that a similar strategy also achieves the\ncapacity region for the $K$-user cyclic interference channel to within a\nconstant gap in the weak interference regime. Specifically, a compact\nrepresentation of the Han-Kobayashi achievable rate region using\nFourier-Motzkin elimination is first derived, a capacity region outer bound is\nthen established. It is shown that the Etkin-Tse-Wang power splitting strategy\ngives a constant gap of at most two bits (or one bit per dimension) in the weak\ninterference regime. Finally, the capacity result of the $K$-user cyclic\nGaussian interference channel in the strong interference regime is also given.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 23:00:04 GMT"}, {"version": "v2", "created": "Sat, 10 Dec 2011 04:00:32 GMT"}, {"version": "v3", "created": "Sat, 19 May 2012 17:16:46 GMT"}], "update_date": "2012-05-22", "authors_parsed": [["Zhou", "Lei", ""], ["Yu", "Wei", ""]]}, {"id": "1103.5985", "submitter": "Paul Vitanyi", "authors": "Paul M.B. Vit\\'anyi (CWI and University of Amsterdam)", "title": "On Empirical Entropy", "comments": "14 pages, LaTeX", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a compression-based version of the empirical entropy of a finite\nstring over a finite alphabet. Whereas previously one considers the naked\nentropy of (possibly higher order) Markov processes, we consider the sum of the\ndescription of the random variable involved plus the entropy it induces. We\nassume only that the distribution involved is computable. To test the new\nnotion we compare the Normalized Information Distance (the similarity metric)\nwith a related measure based on Mutual Information in Shannon's framework. This\nway the similarities and differences of the last two concepts are exposed.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2011 16:30:27 GMT"}], "update_date": "2011-04-05", "authors_parsed": [["Vitányi", "Paul M. B.", "", "CWI and University of Amsterdam"]]}, {"id": "1103.5991", "submitter": "Matt Malloy", "authors": "Matthew Malloy, Robert Nowak", "title": "Sequential Analysis in High Dimensional Multiple Testing and Sparse\n  Recovery", "comments": "Submitted to ISIT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the problem of high-dimensional multiple testing and\nsparse recovery from the perspective of sequential analysis. In this setting,\nthe probability of error is a function of the dimension of the problem. A\nsimple sequential testing procedure is proposed. We derive necessary conditions\nfor reliable recovery in the non-sequential setting and contrast them with\nsufficient conditions for reliable recovery using the proposed sequential\ntesting procedure. Applications of the main results to several commonly\nencountered models show that sequential testing can be exponentially more\nsensitive to the difference between the null and alternative distributions (in\nterms of the dependence on dimension), implying that subtle cases can be much\nmore reliably determined using sequential methods.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2011 16:56:29 GMT"}, {"version": "v2", "created": "Fri, 3 Jun 2011 18:52:24 GMT"}], "update_date": "2011-06-06", "authors_parsed": [["Malloy", "Matthew", ""], ["Nowak", "Robert", ""]]}, {"id": "1103.6060", "submitter": "Chenwei Wang", "authors": "Chenwei Wang, Syed A. Jafar, Shlomo Shamai (Shitz), Michele Wigger", "title": "Interference, Cooperation and Connectivity - A Degrees of Freedom\n  Perspective", "comments": "Submitted to 2011 IEEE International Symposium on Information Theory\n  (ISIT)", "journal-ref": null, "doi": "10.1109/ISIT.2011.6034162", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the interplay between interference, cooperation and connectivity\nin heterogeneous wireless interference networks. Specifically, we consider a\n4-user locally-connected interference network with pairwise clustered decoding\nand show that its degrees of freedom (DoF) are bounded above by 12/5.\nInterestingly, when compared to the corresponding fully connected setting which\nis known to have 8/3 DoF, the locally connected network is only missing\ninterference-carrying links, but still has lower DoF, i.e., eliminating these\ninterference-carrying links reduces the DoF. The 12/5 DoF outer bound is\nobtained through a novel approach that translates insights from interference\nalignment over linear vector spaces into corresponding sub-modularity\nrelationships between entropy functions.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2011 22:47:12 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Wang", "Chenwei", "", "Shitz"], ["Jafar", "Syed A.", "", "Shitz"], ["Shamai", "Shlomo", "", "Shitz"], ["Wigger", "Michele", ""]]}, {"id": "1103.6067", "submitter": "Ashwin Nayak", "authors": "Rahul Jain and Ashwin Nayak", "title": "Short proofs of the Quantum Substate Theorem", "comments": "11 pages. Rewritten; included new references; presented the results\n  in terms of smooth relative min-entropy; stronger results; included converse\n  and proof using SDP duality", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Quantum Substate Theorem due to Jain, Radhakrishnan, and Sen (2002) gives\nus a powerful operational interpretation of relative entropy, in fact, of the\nobservational divergence of two quantum states, a quantity that is related to\ntheir relative entropy. Informally, the theorem states that if the\nobservational divergence between two quantum states rho, sigma is small, then\nthere is a quantum state rho' close to rho in trace distance, such that rho'\nwhen scaled down by a small factor becomes a substate of sigma. We present new\nproofs of this theorem. The resulting statement is optimal up to a constant\nfactor in its dependence on observational divergence. In addition, the proofs\nare both conceptually simpler and significantly shorter than the earlier proof.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 00:22:40 GMT"}, {"version": "v2", "created": "Thu, 12 Jan 2012 05:12:45 GMT"}], "update_date": "2012-01-13", "authors_parsed": [["Jain", "Rahul", ""], ["Nayak", "Ashwin", ""]]}, {"id": "1103.6149", "submitter": "David Elkouss Coronas", "authors": "David Elkouss, Jesus Martinez-Mateo, Vicente Martin", "title": "Untainted Puncturing for Irregular Low-Density Parity-Check Codes", "comments": "4 pages, 3 figures", "journal-ref": "Wireless Communications Letters, IEEE Volume: 1 , Issue: 6,\n  Publication Year: 2012 , Page(s): 585 - 588", "doi": "10.1109/WCL.2012.082712.120531", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Puncturing is a well-known coding technique widely used for constructing\nrate-compatible codes. In this paper, we consider the problem of puncturing\nlow-density parity-check codes and propose a new algorithm for intentional\npuncturing. The algorithm is based on the puncturing of untainted symbols, i.e.\nnodes with no punctured symbols within their neighboring set. It is shown that\nthe algorithm proposed here performs better than previous proposals for a range\nof coding rates and short proportions of punctured symbols.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 11:58:00 GMT"}, {"version": "v2", "created": "Fri, 23 Mar 2012 11:03:26 GMT"}, {"version": "v3", "created": "Tue, 29 Jan 2013 07:18:35 GMT"}], "update_date": "2013-01-30", "authors_parsed": [["Elkouss", "David", ""], ["Martinez-Mateo", "Jesus", ""], ["Martin", "Vicente", ""]]}, {"id": "1103.6241", "submitter": "Chun-Hung Liu", "authors": "Chun-Hung Liu and Jeffrey G. Andrews", "title": "Ergodic Transmission Capacity of Wireless Ad Hoc Networks with\n  Interference Management", "comments": "25 pages, 5 figures and 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most work on wireless network throughput ignores the temporal correlation\ninherent to wireless channels because it degrades tractability. To better model\nand quantify the temporal variations of wireless network throughput, this paper\nintroduces a metric termed ergodic transmission capacity (ETC), which includes\nspatial and temporal ergodicity. All transmitters in the network form a\nhomogeneous Poisson point process and all channels are modeled by a finite\nstate Markov chain. The bounds on outage probability and ETC are characterized,\nand their scaling behaviors for a sparse and dense network are discussed. From\nthese results, we show that the ETC can be characterized by the inner product\nof the channel-state related vector and the invariant probability vector of the\nMarkov chain. This indicates that channel-aware opportunistic transmission does\nnot always increase ETC. Finally, we look at outage probability with\ninterference management from a stochastic geometry point of view. The improved\nbounds on outage probability and ETC due to interference management are\ncharacterized and they provide some useful insights on how to effectively\nmanage interference in sparse and dense networks.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 17:12:54 GMT"}], "update_date": "2011-04-01", "authors_parsed": [["Liu", "Chun-Hung", ""], ["Andrews", "Jeffrey G.", ""]]}, {"id": "1103.6258", "submitter": "Xiaomeng Shi", "authors": "Wangmei Guo, Ning Cai, Xiaomeng Shi, Muriel Medard", "title": "Localized Dimension Growth in Random Network Coding: A Convolutional\n  Approach", "comments": "7 pages, 1 figure, submitted to IEEE ISIT 2011", "journal-ref": null, "doi": "10.1109/ISIT.2011.6033714", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an efficient Adaptive Random Convolutional Network Coding (ARCNC)\nalgorithm to address the issue of field size in random network coding. ARCNC\noperates as a convolutional code, with the coefficients of local encoding\nkernels chosen randomly over a small finite field. The lengths of local\nencoding kernels increase with time until the global encoding kernel matrices\nat related sink nodes all have full rank. Instead of estimating the necessary\nfield size a priori, ARCNC operates in a small finite field. It adapts to\nunknown network topologies without prior knowledge, by locally incrementing the\ndimensionality of the convolutional code. Because convolutional codes of\ndifferent constraint lengths can coexist in different portions of the network,\nreductions in decoding delay and memory overheads can be achieved with ARCNC.\nWe show through analysis that this method performs no worse than random linear\nnetwork codes in general networks, and can provide significant gains in terms\nof average decoding delay in combination networks.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 18:08:53 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Guo", "Wangmei", ""], ["Cai", "Ning", ""], ["Shi", "Xiaomeng", ""], ["Medard", "Muriel", ""]]}]