[{"id": "1011.0810", "submitter": "Nell Sedransk", "authors": "Nell Sedransk, Lawrence H. Cox, Deborah Nolan, Keith Soper, Cliff\n  Spiegelman, Linda J. Young, Katrina L. Kelner, Robert A. Moffitt, Ani Thakar,\n  Jordan Raddick, Edward J. Ungvarsky, Richard W. Carlson, Rolf Apweiler", "title": "Make Research Data Public? -- Not Always so Simple: A Dialogue for\n  Statisticians and Science Editors", "comments": "Published in at http://dx.doi.org/10.1214/10-STS320 the Statistical\n  Science (http://www.imstat.org/sts/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Statistical Science 2010, Vol. 25, No. 1, 41-50", "doi": "10.1214/10-STS320", "report-no": "IMS-STS-STS320", "categories": "stat.ME cs.DL physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Putting data into the public domain is not the same thing as making those\ndata accessible for intelligent analysis. A distinguished group of editors and\nexperts who were already engaged in one way or another with the issues inherent\nin making research data public came together with statisticians to initiate a\ndialogue about policies and practicalities of requiring published research to\nbe accompanied by publication of the research data. This dialogue carried\nbeyond the broad issues of the advisability, the intellectual integrity, the\nscientific exigencies to the relevance of these issues to statistics as a\ndiscipline and the relevance of statistics, from inference to modeling to data\nexploration, to science and social science policies on these issues.\n", "versions": [{"version": "v1", "created": "Wed, 3 Nov 2010 07:28:00 GMT"}], "update_date": "2016-11-27", "authors_parsed": [["Sedransk", "Nell", ""], ["Cox", "Lawrence H.", ""], ["Nolan", "Deborah", ""], ["Soper", "Keith", ""], ["Spiegelman", "Cliff", ""], ["Young", "Linda J.", ""], ["Kelner", "Katrina L.", ""], ["Moffitt", "Robert A.", ""], ["Thakar", "Ani", ""], ["Raddick", "Jordan", ""], ["Ungvarsky", "Edward J.", ""], ["Carlson", "Richard W.", ""], ["Apweiler", "Rolf", ""]]}, {"id": "1011.1533", "submitter": "Sta\\v{s}a Milojevi\\'c", "authors": "Sta\\v{s}a Milojevi\\'c", "title": "Power-law Distributions in Information Science - Making the Case for\n  Logarithmic Binning", "comments": "Accepted for publication in JASIST", "journal-ref": null, "doi": "10.1002/asi.21426", "report-no": null, "categories": "physics.soc-ph cs.DL stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We suggest partial logarithmic binning as the method of choice for uncovering\nthe nature of many distributions encountered in information science (IS).\nLogarithmic binning retrieves information and trends \"not visible\" in noisy\npower-law tails. We also argue that obtaining the exponent from logarithmically\nbinned data using a simple least square method is in some cases warranted in\naddition to methods such as the maximum likelihood. We also show why often used\ncumulative distributions can make it difficult to distinguish noise from\ngenuine features, and make it difficult to obtain an accurate power-law\nexponent of the underlying distribution. The treatment is non-technical, aimed\nat IS researchers with little or no background in mathematics.\n", "versions": [{"version": "v1", "created": "Sat, 6 Nov 2010 01:47:41 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Milojević", "Staša", ""]]}, {"id": "1011.1979", "submitter": "Panigrahy Rina", "authors": "Rina Panigrahy", "title": "Can Knowledge be preserved in the long run?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Can (scientific) knowledge be reliably preserved over the long term? We have\ntoday very efficient and reliable methods to encode, store and retrieve data in\na storage medium that is fault tolerant against many types of failures. But\ndoes this guarantee -- or does it even seem likely -- that all knowledge can be\npreserved over thousands of years and beyond? History shows that many types of\nknowledge that were known before have been lost. We observe that the nature of\nstored and communicated information and the way it is interpreted is such that\nit always tends to decay and therefore must lost eventually in the long term.\nThe likely fundamental conclusion is that knowledge cannot be reliably\npreserved indefinitely.\n", "versions": [{"version": "v1", "created": "Tue, 9 Nov 2010 06:00:08 GMT"}, {"version": "v2", "created": "Sun, 6 Feb 2011 01:18:21 GMT"}], "update_date": "2011-02-08", "authors_parsed": [["Panigrahy", "Rina", ""]]}, {"id": "1011.3120", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff and Ismael Rafols", "title": "The Local Emergence and Global Diffusion of Research Technologies: An\n  Exploration of Patterns of Network Formation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Grasping the fruits of \"emerging technologies\" is an objective of many\ngovernment priority programs in a knowledge-based and globalizing economy. We\nuse the publication records (in the Science Citation Index) of two emerging\ntechnologies to study the mechanisms of diffusion in the case of two innovation\ntrajectories: small interference RNA (siRNA) and nano-crystalline solar cells\n(NCSC). Methods for analyzing and visualizing geographical and cognitive\ndiffusion are specified as indicators of different dynamics. Geographical\ndiffusion is illustrated with overlays to Google Maps; cognitive diffusion is\nmapped using an overlay to a map based on the ISI Subject Categories. The\nevolving geographical networks show both preferential attachment and\nsmall-world characteristics. The strength of preferential attachment decreases\nover time, while the network evolves into an oligopolistic control structure\nwith small-world characteristics. The transition from disciplinary-oriented\n(\"mode-1\") to transfer-oriented (\"mode-2\") research is suggested as the crucial\ndifference in explaining the different rates of diffusion between siRNA and\nNCSC.\n", "versions": [{"version": "v1", "created": "Sat, 13 Nov 2010 09:29:04 GMT"}, {"version": "v2", "created": "Mon, 31 Jan 2011 18:22:30 GMT"}], "update_date": "2011-02-01", "authors_parsed": [["Leydesdorff", "Loet", ""], ["Rafols", "Ismael", ""]]}, {"id": "1011.3794", "submitter": "Stefano Balietti", "authors": "Dirk Helbing and Stefano Balietti", "title": "How to Create an Innovation Accelerator", "comments": "32 pages, Visioneer White Paper, see http://www.visioneer.ethz.ch", "journal-ref": null, "doi": "10.1140/epjst/e2011-01403-6", "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Too many policy failures are fundamentally failures of knowledge. This has\nbecome particularly apparent during the recent financial and economic crisis,\nwhich is questioning the validity of mainstream scholarly paradigms. We propose\nto pursue a multi-disciplinary approach and to establish new institutional\nsettings which remove or reduce obstacles impeding efficient knowledge\ncreation. We provided suggestions on (i) how to modernize and improve the\nacademic publication system, and (ii) how to support scientific coordination,\ncommunication, and co-creation in large-scale multi-disciplinary projects. Both\nconstitute important elements of what we envision to be a novel ICT\ninfrastructure called \"Innovation Accelerator\" or \"Knowledge Accelerator\".\n", "versions": [{"version": "v1", "created": "Tue, 16 Nov 2010 19:38:05 GMT"}, {"version": "v2", "created": "Mon, 24 Jan 2011 17:27:24 GMT"}, {"version": "v3", "created": "Thu, 24 Feb 2011 16:30:52 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Helbing", "Dirk", ""], ["Balietti", "Stefano", ""]]}, {"id": "1011.4879", "submitter": "Ash Mohammad Abbas", "authors": "Ash Mohammad Abbas", "title": "Analysis of Generalized Impact Factor and Indices of Journals", "comments": "7 pages, 5 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analyzing the relationships among the parameters for quantifying the quality\nof research published in journals is a challenging task. In this paper, we\nanalyze the relationships between impact factor, h-index, and g-index of a\njournal. To keep our analysis simple and easy to understand, we consider a\ngeneralized version of the impact factor where there is no time window. In the\nabsence of the time window, the impact factor converges to the number of\ncitations received per paper. This is not only justified for the impact factor,\nit simplifies the analysis of h-index and g-index as well because addition of a\ntime window in the form of years complicates the computation of indices too. We\nderive the expressions for the relationships among impact factor, h-index, and\ng-index and validate them using a given set of publication-citation data.\n", "versions": [{"version": "v1", "created": "Mon, 22 Nov 2010 17:25:45 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Abbas", "Ash Mohammad", ""]]}, {"id": "1011.5311", "submitter": "Peter Kamphuis", "authors": "P. Kamphuis and P.C. van der Kruit", "title": "Citations and impact of Dutch astronomy", "comments": "37 pages, 21 figures, 9 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this study is to make a bibliometric comparison of the performance\nof research astronomers in the Netherlands Research School for Astronomy (NOVA)\nwith astronomers elsewhere by using the NASA Astrophysics Data System (ADS). We\nuse various indices for bibliometric performance for a sample of NOVA\nastronomers to compare to samples of astronomers worldwide, and from the United\nStates. We give much weight to normalising bibliometric measures by number of\nauthors, and number of years since first publication. In particular we\ncalculate the `Hirsh-index' normalized to number of authors and for\nfirst-author papers. Secondly, we consider the results of the 'Nederlands\nObservatorium van Wetenschap en Technologie' (NOWT; Netherlands Observatory of\nScience and Technology), which regularly publishes a report 'Science and\nTechnology Indicators'. We reproduce those results using publication lists from\ninstitutions in the Netherlands, again using ADS, and examine and discuss the\nconclusions and indications in these reports. We find that the NOVA researchers\nperform much better in bibliometric measures than samples drawn from IAU or AAS\nmembership lists. A more suitable comparison is one with the (tenured) staff of\nthe top-15 US institutions and there the NOVA staff performs in these respects\nas good or almost as good as that of American top institutes. From a citation\nanalysis through the use of ADS we conclude that the impact ratio of Dutch\nastronomical publications is rising which is opposite to what is reported by\nNOWT. This difference is most likely caused by a better separation of astronomy\nand physics in ADS than in World of Knowledge. ADS probably finds more\ncitations in conference proceedings, while the inclusion of citations to\narticles with their pre-print identifier could also help explain the difference\n(especially since the citation windows in the reports are short).\n", "versions": [{"version": "v1", "created": "Wed, 24 Nov 2010 07:52:47 GMT"}], "update_date": "2010-11-25", "authors_parsed": [["Kamphuis", "P.", ""], ["van der Kruit", "P. C.", ""]]}]