[{"id": "1105.1693", "submitter": "Jaydip Sen", "authors": "Debasis Bandyopadhyay and Jaydip Sen", "title": "Internet of Things: Applications and Challenges in Technology and\n  Standardization", "comments": "24 pages, 3 figures; Special Issue: Distributed and Secure Cloud\n  Clustering (DISC)", "journal-ref": "Springer International Journal of Wireless Personal\n  Communications, Vol. 58, No. 1, pp. 49 -- 69, May 2011", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The phrase Internet of Things (IoT) heralds a vision of the future Internet\nwhere connecting physical things, from banknotes to bicycles, through a network\nwill let them take an active part in the Internet, exchanging information about\nthemselves and their surroundings. This will give immediate access to\ninformation about the physical world and the objects in it leading to\ninnovative services and increase in efficiency and productivity. This paper\nstudies the state-of-the-art of IoT and presents the key technological\ndrivers,potential applications, challenges and future research areas in the\ndomain of IoT. IoT definitions from different perspective in academic and\nindustry communities are also discussed and compared. Finally some major issues\nof future research in IoT are identified and discussed briefly.\n", "versions": [{"version": "v1", "created": "Mon, 9 May 2011 15:05:15 GMT"}], "update_date": "2011-05-10", "authors_parsed": [["Bandyopadhyay", "Debasis", ""], ["Sen", "Jaydip", ""]]}, {"id": "1105.1885", "submitter": "Alessandro Frigeri", "authors": "Alessandro Frigeri, Gisella Speranza", "title": "\"Eppur si muove\", Software Libero e Ricerca Riproducibile", "comments": "The article is in Italian. ISSN:2037-1217", "journal-ref": "Studi Umbri (2) 2010", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article describes similarities of the scientific method and the free\nopen source software development, and how reproducibility is the key of an\nhealthy scientific production.\n", "versions": [{"version": "v1", "created": "Tue, 10 May 2011 09:01:55 GMT"}], "update_date": "2011-05-11", "authors_parsed": [["Frigeri", "Alessandro", ""], ["Speranza", "Gisella", ""]]}, {"id": "1105.3715", "submitter": "Anderson Vieira", "authors": "Carlos Augusto Almeida Alcantara, Anderson Luiz Nogueira Vieira", "title": "Tecnologia M\\'ovel: Uma Tend\\^encia, Uma Realidade", "comments": "Artigo defendido no II Workshop de Redes na Universidade Est\\'acio de\n  S\\'a, Juiz de Fora, MG, Brasil", "journal-ref": "PEREZ, Marin, Grande Crescimento para o Com\\'ercio M\\'ovel,\n  InformationWeek EUA -- 2009. Praestro Convergence - ebook Mobile Marketing:\n  Mobile Marketing: Conceitos, Tecnologias e Cases, 2009", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Currently, mobility presents itself as a major innovation in historic\ntechnological revolution. From the first decade of this century, nothing\ncompares to what happened in the field of Information Technology (IT), which is\nadding to market a range of news relating to infrastructure such as mobile\ncomputing hardware, software, computer networks, etc.. From a handheld as a\nwireless device, iPad, Smartphone, you can connect to the digital world,\npeople, customers, business partners, etc.. Given the infinite range of\ninformation, services and resources available in the electronic world, it is\nconsidered that few are those, markets and people who want to be left behind.\nThe interest in this channel of communication becomes not only a new strategy\nof marketing and communications. Mobile devices are becoming more sophisticated\nand allows access to the web. Thinking in this context is that manufacturers of\nelectronic components face each other in a war over the disputed technology to\na competitive environment that is open to those who put on the market the\nproduct more attractive, interactive and versatile.\n", "versions": [{"version": "v1", "created": "Wed, 18 May 2011 18:49:17 GMT"}], "update_date": "2011-05-20", "authors_parsed": [["Alcantara", "Carlos Augusto Almeida", ""], ["Vieira", "Anderson Luiz Nogueira", ""]]}, {"id": "1105.4517", "submitter": "Maurizio Conti", "authors": "O. Awodele, S.O. Kuyoro, A.K. Adejumobi, O. Awe, O. Makanju", "title": "Citadel E-Learning: A New Dimension to Learning System", "comments": "8 Pages", "journal-ref": "World of Computer Science and Information Technology Journal\n  (WCSIT), Vol. 1, No. 3, 71- 78, 2011", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  E-learning has been an important policy for education planners for many years\nin developed countries. This policy has been adopted by education in some\ndeveloping countries; it is therefore expedient to study its emergence in the\nNigerian education system. The birth of contemporary technology shows that\nthere is higher requirement for education even in the work force. This has been\nan eye opener to importance of Education which conveniently can be achieved\nthrough E-learning. This work presents CITADEL E-learning approach to Nigeria\ninstitutions; its ubiquity, its implementations, its flexibility, portability,\nease of use and feature that are synonymous to the standard of education in\nNigeria and how it can be enhanced to improve learning for both educators and\nlearners to help them in their learning endeavour.\n", "versions": [{"version": "v1", "created": "Mon, 23 May 2011 14:45:14 GMT"}], "update_date": "2011-05-24", "authors_parsed": [["Awodele", "O.", ""], ["Kuyoro", "S. O.", ""], ["Adejumobi", "A. K.", ""], ["Awe", "O.", ""], ["Makanju", "O.", ""]]}, {"id": "1105.5255", "submitter": "Amitabh Trehan", "authors": "Shay Kutten, Ron Lavi, Amitabh Trehan", "title": "Composition Games for Distributed Systems: the EU Grant games", "comments": "Accepted at AAAI 2013: Twenty-Seventh Conference on Artificial\n  Intelligence, Bellevue, Washington, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CY cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze ways by which people decompose into groups in distributed systems.\nWe are interested in systems in which an agent can increase its utility by\nconnecting to other agents, but must also pay a cost that increases with the\nsize of the sys- tem. The right balance is achieved by the right size group of\nagents. We formulate and analyze three intuitive and realistic games and show\nhow simple changes in the protocol can dras- tically improve the price of\nanarchy of these games. In partic- ular, we identify two important properties\nfor a low price of anarchy: agreement in joining the system, and the possibil-\nity of appealing a rejection from a system. We show that the latter property is\nespecially important if there are some pre- existing constraints regarding who\nmay collaborate (or com- municate) with whom.\n", "versions": [{"version": "v1", "created": "Thu, 26 May 2011 10:49:50 GMT"}, {"version": "v2", "created": "Mon, 4 Jun 2012 12:19:47 GMT"}, {"version": "v3", "created": "Mon, 20 May 2013 13:55:18 GMT"}], "update_date": "2013-05-21", "authors_parsed": [["Kutten", "Shay", ""], ["Lavi", "Ron", ""], ["Trehan", "Amitabh", ""]]}, {"id": "1105.5803", "submitter": "Philip Stark", "authors": "Josh Benaloh, Douglas Jones, Eric Lazarus, Mark Lindeman, and Philip\n  B. Stark", "title": "SOBA: Secrecy-preserving Observable Ballot-level Audit", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  SOBA is an approach to election verification that provides observers with\njustifiably high confidence that the reported results of an election are\nconsistent with an audit trail (\"ballots\"), which can be paper or electronic.\nSOBA combines three ideas: (1) publishing cast vote records (CVRs) separately\nfor each contest, so that anyone can verify that each reported contest outcome\nis correct, if the CVRs reflect voters' intentions with sufficient accuracy;\n(2) shrouding a mapping between ballots and the CVRs for those ballots to\nprevent the loss of privacy that could occur otherwise; (3) assessing the\naccuracy with which the CVRs reflect voters' intentions for a collection of\ncontests while simultaneously assessing the integrity of the shrouded mapping\nbetween ballots and CVRs by comparing randomly selected ballots to the CVRs\nthat purport to represent them. Step (1) is related to work by the Humboldt\nCounty Election Transparency Project, but publishing CVRs separately for\nindividual contests rather than images of entire ballots preserves privacy.\nStep (2) requires a cryptographic commitment from elections officials.\nObservers participate in step (3), which relies on the \"super-simple\nsimultaneous single-ballot risk-limiting audit.\" Step (3) is designed to reveal\nrelatively few ballots if the shrouded mapping is proper and the CVRs\naccurately reflect voter intent. But if the reported outcomes of the contests\ndiffer from the outcomes that a full hand count would show, step (3) is\nguaranteed to have a large chance of requiring all the ballots to be counted by\nhand, thereby limiting the risk that an incorrect outcome will become official\nand final.\n", "versions": [{"version": "v1", "created": "Sun, 29 May 2011 17:00:20 GMT"}, {"version": "v2", "created": "Sat, 2 Jul 2011 21:46:34 GMT"}], "update_date": "2011-07-05", "authors_parsed": [["Benaloh", "Josh", ""], ["Jones", "Douglas", ""], ["Lazarus", "Eric", ""], ["Lindeman", "Mark", ""], ["Stark", "Philip B.", ""]]}, {"id": "1105.6307", "submitter": "Emilio Ferrara", "authors": "Salvatore A. Catanese, Pasquale De Meo, Emilio Ferrara, Giacomo\n  Fiumara, Alessandro Provetti", "title": "Crawling Facebook for Social Network Analysis Purposes", "comments": "WIMS '11: International Conference on Web Intelligence, Mining and\n  Semantics ACM New York, NY, USA \\c{opyright}2011 ISBN: 978-1-4503-0148-0", "journal-ref": "Proceedings of the International Conference on Web Intelligence,\n  Mining and Semantics, 2011", "doi": "10.1145/1988688.1988749", "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe our work in the collection and analysis of massive data\ndescribing the connections between participants to online social networks.\nAlternative approaches to social network data collection are defined and\nevaluated in practice, against the popular Facebook Web site. Thanks to our\nad-hoc, privacy-compliant crawlers, two large samples, comprising millions of\nconnections, have been collected; the data is anonymous and organized as an\nundirected graph. We describe a set of tools that we developed to analyze\nspecific properties of such social-network graphs, i.e., among others, degree\ndistribution, centrality measures, scaling laws and distribution of friendship.\n", "versions": [{"version": "v1", "created": "Tue, 31 May 2011 14:53:40 GMT"}], "update_date": "2011-06-01", "authors_parsed": [["Catanese", "Salvatore A.", ""], ["De Meo", "Pasquale", ""], ["Ferrara", "Emilio", ""], ["Fiumara", "Giacomo", ""], ["Provetti", "Alessandro", ""]]}, {"id": "1105.6357", "submitter": "Ali Al Khouri Dr.", "authors": "Ali M. Al-Khouri", "title": "PKI in Government Identity Management Systems", "comments": "28 pages, 9 figures, 3 tables", "journal-ref": "International Journal of Network Security & Its Applications\n  (IJNSA), Vol.3, No.3, May 2011", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this article is to provide an overview of the PKI project\ninitiated part of the UAE national ID card program. It primarily shows the\noperational model of the PKI implementation that is indented to integrate the\nfederal government identity management infrastructure with e-government\ninitiatives owners in the country. It also explicates the agreed structure of\nthe major components in relation to key stakeholders; represented by federal\nand local e-government authorities, financial institutions, and other\norganizations in both public and private sectors. The content of this article\nis believed to clarify some of the misconceptions about PKI implementation in\nnational ID schemes, and explain how the project is envisaged to encourage the\ndiffusion of e-government services in the United Arab Emirates. The study\nconcludes that governments in the Middle East region have the trust in PKI\ntechnology to support their e-government services and expanding outreach and\npopulation trust, if of course accompanied by comprehensive digital laws and\npolicies.\n", "versions": [{"version": "v1", "created": "Tue, 31 May 2011 18:27:06 GMT"}], "update_date": "2011-06-01", "authors_parsed": [["Al-Khouri", "Ali M.", ""]]}, {"id": "1105.6358", "submitter": "Ali Al Khouri Dr.", "authors": "Ali M. Al-Khouri", "title": "An Innovative Approach for E-Government Transformation", "comments": "22 Pages, 15 figures, 5 tables", "journal-ref": "International Journal of Managing Value and Supply Chains (IJMVSC)\n  Vol. 2, No. 1, March 2011", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the immeasurable investment in e-government initiatives throughout\nthe world, such initiatives have yet to succeed in fully meeting expectations\nand desired outcomes. A key objective of this research article is to support\nthe government of the UAE in realizing its vision of e-government\ntransformation. It presents an innovative framework to support e-government\nimplementation, which was developed from a practitioner's perspective and based\non learnings from numerous e-government practices around the globe. The\nframework presents an approach to guide governments worldwide, and UAE in\nparticular, to develop a top down strategy and leverage technology in order\nrealize its long term goal of e-government transformation. The study also\noutlines the potential role of modern national identity schemes in enabling the\ntransformation of traditional identities into digital identities. The work\npresented in this study is envisaged to help bridge the gap between policy\nmakers and implementers, by providing greater clarity and reducing misalignment\non key elements of e-government transformation. In the hands of leaders that\nhave a strong will to invest in e-government transformation, the work presented\nin this study is envisaged to become a powerful tool to communicate and\ncoordinate initiatives, and provide a clear visualization of an integrated\napproach to e-government transformation.\n", "versions": [{"version": "v1", "created": "Tue, 31 May 2011 18:41:10 GMT"}], "update_date": "2011-06-01", "authors_parsed": [["Al-Khouri", "Ali M.", ""]]}]