[{"id": "1009.0797", "submitter": "Gerard Briscoe Dr", "authors": "Gerard Briscoe and Paolo Dini", "title": "Towards Autopoietic Computing", "comments": "10 Pages, 3 figures", "journal-ref": null, "doi": "10.1007/978-3-642-14859-0_16", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A key challenge in modern computing is to develop systems that address\ncomplex, dynamic problems in a scalable and efficient way, because the\nincreasing complexity of software makes designing and maintaining efficient and\nflexible systems increasingly difficult. Biological systems are thought to\npossess robust, scalable processing paradigms that can automatically manage\ncomplex, dynamic problem spaces, possessing several properties that may be\nuseful in computer systems. The biological properties of self-organisation,\nself-replication, self-management, and scalability are addressed in an\ninteresting way by autopoiesis, a descriptive theory of the cell founded on the\nconcept of a system's circular organisation to define its boundary with its\nenvironment. In this paper, therefore, we review the main concepts of\nautopoiesis and then discuss how they could be related to fundamental concepts\nand theories of computation. The paper is conceptual in nature and the emphasis\nis on the review of other people's work in this area as part of a longer-term\nstrategy to develop a formal theory of autopoietic computing.\n", "versions": [{"version": "v1", "created": "Sat, 4 Sep 2010 01:33:47 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Briscoe", "Gerard", ""], ["Dini", "Paolo", ""]]}, {"id": "1009.0923", "submitter": "Ammar Adl", "authors": "Ammar Adl, Amr Badr, Ibrahim Farag", "title": "A Note on the Membrane Computer", "comments": null, "journal-ref": "COMPUTING AND INFORMATION SYSTEMS JOURNAL, Issue2, May 2010, P 1-7", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by the emergent membrane computing (P Systems) concepts, some\nefforts are carried out introducing simulation models, some are software\noriented, and others are hardware, yet all are applied with the current vision\nof the conventional computers, based on \"Von Neumann architecture\", which is a\nsequential design in its essence. We think that these models will need \"as a\nconsequent result\" to a new architecture exposing a true parallel design, in\nthis paper; we try to investigate and introduce a global view for how it would\nbe like to have such architecture. The main goal is to point out to this\ndirection broadly, suggesting that it might be useful considering some aspects,\nlike the need for a new definition of an operating system and its programs,\nwhich will eventually lead to a higher scope: the membrane computer.\n", "versions": [{"version": "v1", "created": "Sun, 5 Sep 2010 14:34:13 GMT"}], "update_date": "2010-12-03", "authors_parsed": [["Adl", "Ammar", ""], ["Badr", "Amr", ""], ["Farag", "Ibrahim", ""]]}, {"id": "1009.2000", "submitter": "Zeeshan Ahmed Mr.", "authors": "Zeeshan Ahmed", "title": "Home Automation", "comments": "In the proceedings of 9th National Research Conference on Management\n  and Computer Sciences, SZABIST Institute of Science and Technology, Pakistan", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper I briefly discuss the importance of home automation system.\nGoing in to the details I briefly present a real time designed and implemented\nsoftware and hardware oriented house automation research project, capable of\nautomating house's electricity and providing a security system to detect the\npresence of unexpected behavior.\n", "versions": [{"version": "v1", "created": "Fri, 10 Sep 2010 12:54:24 GMT"}], "update_date": "2010-09-13", "authors_parsed": [["Ahmed", "Zeeshan", ""]]}, {"id": "1009.2002", "submitter": "Zeeshan Ahmed Mr.", "authors": "Zeeshan Ahmed", "title": "Aero Fighter - 2D Gaming", "comments": "In the proceedings of 9th National Research Conference on Management\n  and Computer Sciences, SZABIST Institute of Science and Technology, Pakistan", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing and developing quality based computer game is always a challenging\ntask for developers. In this paper I briefly discuss aero fighting war game\nbased on simple 2D gaming concepts and developed in C & C++ programming\nlanguages, using old bitmapping concepts. Going into the details of the game\ndevelopment, I discuss the designed strategies, flow of game and implemented\nprototype version of game, especially for beginners of game programming.\n", "versions": [{"version": "v1", "created": "Fri, 10 Sep 2010 12:56:30 GMT"}], "update_date": "2010-09-13", "authors_parsed": [["Ahmed", "Zeeshan", ""]]}, {"id": "1009.2287", "submitter": "Vladimir Privman", "authors": "Vladimir Privman, Jan Halamek, Mary A. Arugula, Dmitriy Melnikov, Vera\n  Bocharova, Evgeny Katz", "title": "Biochemical Filter with Sigmoidal Response: Increasing the Complexity of\n  Biomolecular Logic", "comments": "24 pages, PDF", "journal-ref": "J. Phys. Chem. B 114, 14103-14109 (2010)", "doi": "10.1021/jp108693m", "report-no": null, "categories": "physics.bio-ph cond-mat.soft cs.OH physics.chem-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The first realization of a designed, rather than natural, biochemical filter\nprocess is reported and analyzed as a promising network component for\nincreasing the complexity of biomolecular logic systems. Key challenge in\nbiochemical logic research has been achieving scalability for complex network\ndesigns. Various logic gates have been realized, but a \"toolbox\" of analog\nelements for interconnectivity and signal processing has remained elusive.\nFilters are important as network elements that allow control of noise in signal\ntransmission and conversion. We report a versatile biochemical filtering\nmechanism designed to have sigmoidal response in combination with\nsignal-conversion process. Horseradish peroxidase-catalyzed oxidation of\nchromogenic electron donor by hydrogen peroxide, was altered by adding\nascorbate, allowing to selectively suppress the output signal, modifying the\nresponse from convex to sigmoidal. A kinetic model was developed for evaluation\nof the quality of filtering. The results offer improved capabilities for design\nof scalable biomolecular information processing systems.\n", "versions": [{"version": "v1", "created": "Mon, 13 Sep 2010 02:46:25 GMT"}], "update_date": "2010-11-09", "authors_parsed": [["Privman", "Vladimir", ""], ["Halamek", "Jan", ""], ["Arugula", "Mary A.", ""], ["Melnikov", "Dmitriy", ""], ["Bocharova", "Vera", ""], ["Katz", "Evgeny", ""]]}, {"id": "1009.5098", "submitter": "Avik Chakraborty", "authors": "Avik Chakraborty", "title": "Testing of Bridging Faults in AND-EXOR based Reversible Logic Circuits", "comments": "6 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reversible circuits find applications in many areas of Computer Science\nincluding Quantum Computation. This paper examines the testability of an\nimportant subclass of reversible logic circuits that are composed of k-wire\ncontrolled NOT (k-CNOT with k >/- 1) gates. A reversible k-CNOT gate can be\nimplemented using an irreversible k-input AND gate and an EXOR gate. A\nreversible k-CNOT circuit where each k-CNOT gate is realized using irreversible\nk-input AND and EXOR gate, has been considered. One of the most commonly used\nSingle Bridging Fault model (both wired-AND and wired-OR) has been assumed to\nbe type of fault for such circuits. It has been shown that an (n+p)-input\nAND-EXOR based reversible logic circuit with p observable outputs, can be\ntested for single bridging faults (SBF) using (3n + \\lefthalfcap log2p\n\\righthalfcap + 2) tests.\n", "versions": [{"version": "v1", "created": "Sun, 26 Sep 2010 14:31:24 GMT"}], "update_date": "2010-09-28", "authors_parsed": [["Chakraborty", "Avik", ""]]}, {"id": "1009.5347", "submitter": "Ali Reza Manashty", "authors": "Ali Reza Manashty, Mohammad Reza Ahmadzadeh Raji, Zahra Forootan\n  Jahromi and Amir Rajabzadeh", "title": "ARMrayan Multimedia Mobile CMS: a Simplified Approach towards\n  Content-Oriented Mobile Application Designing", "comments": "6 Pages, 4 figures, Keywords- Mobile CMS, MCMS, Mobile Content\n  Builder, J2ME Application, Multimedia Mobile Application, Multimedia CMS,\n  Multimedia Mobile CMS, Content Management System; ISSN. 2070-3724", "journal-ref": "International Conference on Wireless Communication and Mobile\n  Computing (ICWCMC 2010), Proceedings of WASET, vol. 62, pp. 62-67, February\n  2010", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ARMrayan Multimedia Mobile CMS (Content Management System) is the first\nmobile CMS that gives the opportunity to users for creating multimedia J2ME\nmobile applications with their desired content, design and logo; simply,\nwithout any need for writing even a line of code. The low-level programming and\ncompatibility problems of the J2ME, along with UI designing difficulties, makes\nit hard for most people -even programmers- to broadcast their content to the\nwidespread mobile phones used by nearly all people. This system provides\nuser-friendly, PC-based tools for creating a tree index of pages and inserting\nmultiple multimedia contents (e.g. sound, video and picture) in each page for\ncreating a J2ME mobile application. The output is a stand-alone Java mobile\napplication that has a user interface, shows texts and pictures and plays music\nand videos regardless of the type of devices used as long as the devices\nsupport the J2ME platform. Bitmap fonts have also been used thus Middle Eastern\nlanguages can be easily supported on all mobile phone devices. We omitted\nprogramming concepts for users in order to simplify multimedia content-oriented\nmobile application designing for use in educational, cultural or marketing\ncenters. Ordinary operators can now create a variety of multimedia mobile\napplications such as tutorials, catalogues, books, and guides in minutes rather\nthan months. Simplicity and power has been the goal of this CMS. In this paper,\nwe present the software engineered-designed concepts of the ARMrayan MCMS along\nwith the implementation challenges faces and solutions adapted.\n", "versions": [{"version": "v1", "created": "Mon, 27 Sep 2010 18:22:50 GMT"}], "update_date": "2010-09-28", "authors_parsed": [["Manashty", "Ali Reza", ""], ["Raji", "Mohammad Reza Ahmadzadeh", ""], ["Jahromi", "Zahra Forootan", ""], ["Rajabzadeh", "Amir", ""]]}, {"id": "1009.5557", "submitter": "Ali Reza Manashty", "authors": "Amir Rajabzadeh, Ali Reza Manashty and Zahra Forootan Jahromi", "title": "A Mobile Application for Smart House Remote Control System", "comments": "7 pages, 8 figures, Keywords-Smart House, Mobile Application, Remote\n  Control, Automated Home, Windows Mobile", "journal-ref": "International Conference on Wireless Communication and Mobile\n  Computing (ICWCMC 2010), Proceedings of WASET, vol. 62, ISSN. 2070-3724, pp.\n  80-86, February 2010", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  At the start of the second decade of 21th century, the time has come to make\nthe Smart Houses a reality for regular use. The different parts of a Smart\nHouse are researched but there are still distances from an applicable system,\nusing the modern technology. In this paper we present an overview of the Smart\nHouse subsystems necessary for controlling the house using a mobile application\nefficiently and securely. The sequence diagram of the mobile application\nconnecting to the server application and also the use-cases possible are\npresented. The challenges faced in designing the mobile application and\nillustrating the updated house top plane view in that application, are\ndiscussed and solutions are adapted for it. Finally the designed mobile\napplication was implemented and the important sections of it were described,\nsuch as the interactive house top view map which indicates the status of the\ndevices using predefined icons. The facilities to manage the scheduled tasks\nand defined rules are also implemented in this mobile application that was\ndeveloped for use in Windows Mobile platform. This application has the\ncapability of connecting to the main server using GPRS mobile internet and SMS.\nThis system is expected to be an important step towards a unified system\nstructure that can be used efficiently in near future regular houses.\n", "versions": [{"version": "v1", "created": "Mon, 27 Sep 2010 18:13:37 GMT"}], "update_date": "2010-09-29", "authors_parsed": [["Rajabzadeh", "Amir", ""], ["Manashty", "Ali Reza", ""], ["Jahromi", "Zahra Forootan", ""]]}, {"id": "1009.6186", "submitter": "Sm Thamarai", "authors": "SM. Thamarai, K.Kuppusamy and T.Meyyappan", "title": "Heuristic approach to optimize the number of test cases for simple\n  circuits", "comments": "PDF 9 pages, 2 figures, 2 tables", "journal-ref": "International journal of VLSI design & Communication Systems\n  (VLSICS) Vol.1, No.3, September 2010", "doi": "10.5121/vlsic.2010.1302", "report-no": "0910vlsics02", "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper a new solution is proposed for testing simple stwo stage\nelectronic circuits. It minimizes the number of tests to be performed to\ndetermine the genuinity of the circuit. The main idea behind the present\nresearch work is to identify the maximum number of indistinguishable faults\npresent in the given circuit and minimize the number of test cases based on the\nnumber of faults that has been detected. Heuristic approach is used for test\nminimization part, which identifies the essential tests from overall test\ncases. From the results it is observed that, test minimization varies from 50%\nto 99% with the lowest one corresponding to a circuit with four gates .Test\nminimization is low in case of circuits with lesser input leads in gates\ncompared to greater input leads in gates for the boolean expression with same\nnumber of symbols. Achievement of 99% reduction is due to the fact that the\nlarge number of tests find the same faults. The new approach is implemented for\nsimple circuits. The results show potential for both smaller test sets and\nlower cpu times.\n", "versions": [{"version": "v1", "created": "Thu, 30 Sep 2010 16:30:45 GMT"}], "update_date": "2010-10-05", "authors_parsed": [["Thamarai", "SM.", ""], ["Kuppusamy", "K.", ""], ["Meyyappan", "T.", ""]]}]