[{"id": "1202.0031", "submitter": "Tad Hogg", "authors": "Tad Hogg and Kristina Lerman", "title": "Social Dynamics of Digg", "comments": "arXiv admin note: text overlap with arXiv:1010.0237", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online social media provide multiple ways to find interesting content. One\nimportant method is highlighting content recommended by user's friends. We\nexamine this process on one such site, the news aggregator Digg. With a\nstochastic model of user behavior, we distinguish the effects of the content\nvisibility and interestingness to users. We find a wide range of interest and\ndistinguish stories primarily of interest to a users' friends from those of\ninterest to the entire user community. We show how this model predicts a\nstory's eventual popularity from users' early reactions to it, and estimate the\nprediction reliability. This modeling framework can help evaluate alternative\ndesign choices for displaying content on the site.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jan 2012 21:24:33 GMT"}], "update_date": "2012-02-02", "authors_parsed": [["Hogg", "Tad", ""], ["Lerman", "Kristina", ""]]}, {"id": "1202.0327", "submitter": "Bernardo Huberman", "authors": "Louis Yu, Sitaram Asur and Bernardo A. Huberman", "title": "Artificial Inflation: The True Story of Trends in Sina Weibo", "comments": "arXiv admin note: text overlap with arXiv:1107.3522", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There has been a tremendous rise in the growth of online social networks all\nover the world in recent years. This has facilitated users to generate a large\namount of real-time content at an incessant rate, all competing with each other\nto attract enough attention and become trends. While Western online social\nnetworks such as Twitter have been well studied, characteristics of the popular\nChinese microblogging network Sina Weibo have not been. In this paper, we\nanalyze in detail the temporal aspect of trends and trend-setters in Sina\nWeibo, constrasting it with earlier observations on Twitter. First, we look at\nthe formation, persistence and decay of trends and examine the key topics that\ntrend in Sina Weibo. One of our key findings is that retweets are much more\ncommon in Sina Weibo and contribute a lot to creating trends. When we look\ncloser, we observe that a large percentage of trends in Sina Weibo are due to\nthe continuous retweets of a small amount of fraudulent accounts. These fake\naccounts are set up to artificially inflate certain posts causing them to shoot\nup into Sina Weibo's trending list, which are in turn displayed as the most\npopular topics to users.\n", "versions": [{"version": "v1", "created": "Wed, 1 Feb 2012 23:54:22 GMT"}], "update_date": "2012-02-03", "authors_parsed": [["Yu", "Louis", ""], ["Asur", "Sitaram", ""], ["Huberman", "Bernardo A.", ""]]}, {"id": "1202.0331", "submitter": "Emilio Ferrara", "authors": "Emilio Ferrara, Giacomo Fiumara", "title": "Topological Features of Online Social Networks", "comments": null, "journal-ref": "Communications on Applied and Industrial Mathematics, 2(2):1-20,\n  2011", "doi": "10.1685/journal.caim.381", "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of modeling and analyzing Social Networks is a consequence of\nthe success of Online Social Networks during last years. Several models of\nnetworks have been proposed, reflecting the different characteristics of Social\nNetworks. Some of them fit better to model specific phenomena, such as the\ngrowth and the evolution of the Social Networks; others are more appropriate to\ncapture the topological characteristics of the networks. Because these networks\nshow unique and different properties and features, in this work we describe and\nexploit several models in order to capture the structure of popular Online\nSocial Networks, such as Arxiv, Facebook, Wikipedia and YouTube. Our\nexperimentation aims at verifying the structural characteristics of these\nnetworks, in order to understand what model better depicts their structure, and\nto analyze the inner community structure, to illustrate how members of these\nOnline Social Networks interact and group together into smaller communities.\n", "versions": [{"version": "v1", "created": "Thu, 2 Feb 2012 00:21:57 GMT"}], "update_date": "2012-02-03", "authors_parsed": [["Ferrara", "Emilio", ""], ["Fiumara", "Giacomo", ""]]}, {"id": "1202.0332", "submitter": "Bernardo Huberman", "authors": "Roja Bandari, Sitaram Asur and Bernardo A. Huberman", "title": "The Pulse of News in Social Media: Forecasting Popularity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  News articles are extremely time sensitive by nature. There is also intense\ncompetition among news items to propagate as widely as possible. Hence, the\ntask of predicting the popularity of news items on the social web is both\ninteresting and challenging. Prior research has dealt with predicting eventual\nonline popularity based on early popularity. It is most desirable, however, to\npredict the popularity of items prior to their release, fostering the\npossibility of appropriate decision making to modify an article and the manner\nof its publication. In this paper, we construct a multi-dimensional feature\nspace derived from properties of an article and evaluate the efficacy of these\nfeatures to serve as predictors of online popularity. We examine both\nregression and classification algorithms and demonstrate that despite\nrandomness in human behavior, it is possible to predict ranges of popularity on\ntwitter with an overall 84% accuracy. Our study also serves to illustrate the\ndifferences between traditionally prominent sources and those immensely popular\non the social web.\n", "versions": [{"version": "v1", "created": "Thu, 2 Feb 2012 00:31:19 GMT"}], "update_date": "2012-02-07", "authors_parsed": [["Bandari", "Roja", ""], ["Asur", "Sitaram", ""], ["Huberman", "Bernardo A.", ""]]}, {"id": "1202.0500", "submitter": "Matthew Salganik", "authors": "Matthew J. Salganik and Karen E. C. Levy", "title": "Wiki surveys: Open and quantifiable social data collection", "comments": "24 pages, 8 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the social sciences, there is a longstanding tension between data\ncollection methods that facilitate quantification and those that are open to\nunanticipated information. Advances in technology now enable new, hybrid\nmethods that combine some of the benefits of both approaches. Drawing\ninspiration from online information aggregation systems like Wikipedia and from\ntraditional survey research, we propose a new class of research instruments\ncalled wiki surveys. Just as Wikipedia evolves over time based on contributions\nfrom participants, we envision an evolving survey driven by contributions from\nrespondents. We develop three general principles that underlie wiki surveys:\nthey should be greedy, collaborative, and adaptive. Building on these\nprinciples, we develop methods for data collection and data analysis for one\ntype of wiki survey, a pairwise wiki survey. Using two proof-of-concept case\nstudies involving our free and open-source website www.allourideas.org, we show\nthat pairwise wiki surveys can yield insights that would be difficult to obtain\nwith other methods.\n", "versions": [{"version": "v1", "created": "Thu, 2 Feb 2012 17:36:49 GMT"}, {"version": "v2", "created": "Thu, 2 Oct 2014 02:54:11 GMT"}], "update_date": "2014-10-03", "authors_parsed": [["Salganik", "Matthew J.", ""], ["Levy", "Karen E. C.", ""]]}, {"id": "1202.1715", "submitter": "Ravi Iyer S.", "authors": "Ravi S. Iyer", "title": "Improve the Practice of Software Development in India by Having a\n  Software Development Career Track in Indian CS & IT Academia", "comments": "21 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many, but not all, Indian CS & IT academics tend to have a focus on theory\nand research. They do not give much importance to the practice of software\ndevelopment. This paper proposes an additional software development career\ntrack for Indian CS & IT academics different from the existing research\noriented career track. A measure of software contribution record is suggested.\nIt opines that adoption of such changes to academic regulations will result in\nsignificant improvement of software development skill set in Indian CS & IT\nacademia which, in turn, will result in better software development skill set\nin Indian CS & IT graduates.\n", "versions": [{"version": "v1", "created": "Wed, 8 Feb 2012 14:43:54 GMT"}, {"version": "v2", "created": "Thu, 16 Feb 2012 15:13:32 GMT"}, {"version": "v3", "created": "Wed, 27 Jun 2012 09:03:29 GMT"}, {"version": "v4", "created": "Fri, 21 Dec 2012 11:23:41 GMT"}], "update_date": "2012-12-24", "authors_parsed": [["Iyer", "Ravi S.", ""]]}, {"id": "1202.2420", "submitter": "Wajeb Gharibi", "authors": "Wajeb Gharibi and Maha Shaabi", "title": "Cyber threats in social networking websites", "comments": "8 pages; International Journal of Distributed and Parallel Systems\n  (IJDPS) Vol.3, No.1, January 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A social network is a social structure made up of individuals or\norganizations called nodes, which are connected by one or more specific types\nof interdependency, such as friendship, common interest, and exchange of\nfinance, relationships of beliefs, knowledge or prestige. A cyber threat can be\nboth unintentional and intentional, targeted or non targeted, and it can come\nfrom a variety of sources, including foreign nations engaged in espionage and\ninformation warfare, criminals, hackers, virus writers, disgruntled employees\nand contractors working within an organization. Social networking sites are not\nonly to communicate or interact with other people globally, but also one\neffective way for business promotion. In this paper, we investigate and study\nthe cyber threats in social networking websites. We go through the amassing\nhistory of online social websites, classify their types and also discuss the\ncyber threats, suggest the anti-threats strategies and visualize the future\ntrends of such hoppy popular websites.\n", "versions": [{"version": "v1", "created": "Sat, 11 Feb 2012 06:42:03 GMT"}], "update_date": "2012-02-14", "authors_parsed": [["Gharibi", "Wajeb", ""], ["Shaabi", "Maha", ""]]}, {"id": "1202.2465", "submitter": "Jierui Xie", "authors": "Jierui Xie and Boleslaw K. Szymanski", "title": "Towards Linear Time Overlapping Community Detection in Social Networks", "comments": "PAKDD 2012", "journal-ref": "Proc. 16th PAKDD Pacific-Asia Conference on Knowledge Discovery\n  and Data Mining, Kuala Lumpur, Malaysia, 2012, Lecture Notes AI vol. 7302,\n  Part II, Springer, Berlin, Germany, 2012, pp. 25-36", "doi": null, "report-no": null, "categories": "cs.SI cs.CY cs.DS physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Membership diversity is a characteristic aspect of social networks in which a\nperson may belong to more than one social group. For this reason, discovering\noverlapping structures is necessary for realistic social analysis. In this\npaper, we present a fast algorithm1, called SLPA, for overlapping community\ndetection in large-scale networks. SLPA spreads labels according to dynamic\ninteraction rules. It can be applied to both unipartite and bipartite networks.\nIt is also able to uncover overlapping nested hierarchy. The time complexity of\nSLPA scales linearly with the number of edges in the network. Experiments in\nboth synthetic and real- world networks show that SLPA has an excellent\nperformance in identifying both node and community level overlapping\nstructures.\n", "versions": [{"version": "v1", "created": "Sat, 11 Feb 2012 20:07:45 GMT"}], "update_date": "2013-05-15", "authors_parsed": [["Xie", "Jierui", ""], ["Szymanski", "Boleslaw K.", ""]]}, {"id": "1202.3162", "submitter": "Kristina Lerman", "authors": "Kristina Lerman, Rumi Ghosh, Tawan Surachawala", "title": "Social Contagion: An Empirical Study of Information Spread on Digg and\n  Twitter Follower Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social networks have emerged as a critical factor in information\ndissemination, search, marketing, expertise and influence discovery, and\npotentially an important tool for mobilizing people. Social media has made\nsocial networks ubiquitous, and also given researchers access to massive\nquantities of data for empirical analysis. These data sets offer a rich source\nof evidence for studying dynamics of individual and group behavior, the\nstructure of networks and global patterns of the flow of information on them.\nHowever, in most previous studies, the structure of the underlying networks was\nnot directly visible but had to be inferred from the flow of information from\none individual to another. As a result, we do not yet understand dynamics of\ninformation spread on networks or how the structure of the network affects it.\nWe address this gap by analyzing data from two popular social news sites.\nSpecifically, we extract follower graphs of active Digg and Twitter users and\ntrack how interest in news stories cascades through the graph. We compare and\ncontrast properties of information cascades on both sites and elucidate what\nthey tell us about dynamics of information flow on networks.\n", "versions": [{"version": "v1", "created": "Tue, 14 Feb 2012 21:56:54 GMT"}, {"version": "v2", "created": "Mon, 12 Aug 2013 21:35:28 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Lerman", "Kristina", ""], ["Ghosh", "Rumi", ""], ["Surachawala", "Tawan", ""]]}, {"id": "1202.4238", "submitter": "Michalis Vafopoulos n", "authors": "Michalis Vafopoulos, Petros Stefaneas, Ioannis Anagnostopoulos, Kieron\n  O'Hara", "title": "A methodology for internal Web ethics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The vigorous impact of the Web in time and space arises from the fact that it\nmotivates massive creation, editing and distribution of information by Users\nwith little knowledge. This unprecedented continuum provides novel\nopportunities for innovation but also puts under jeopardy its survival as a\nstable construct that nurtures a complex system of connections. We examine the\nWeb as an ethics determined space by demonstrating Hayek's theory of freedom in\na three-leveled Web: technological, contextualized and economic. Our approach\naccounts for the co-dependence of code and values, and assumes that the Web is\na self-contained system that exists in and by itself. This view of internal Web\nethics directly connects the concept of freedom with issues like centralization\nof traffic and data control, rights on visiting log file, custom User profiles\nand the interplay among function, structure and morality of the Web. It is also\ndemonstrated, in the case of Net Neutrality, that generic freedom-coercion\ntrade-offs are incomplete in treating specific cases at work.\n", "versions": [{"version": "v1", "created": "Mon, 20 Feb 2012 07:01:47 GMT"}], "update_date": "2012-02-21", "authors_parsed": [["Vafopoulos", "Michalis", ""], ["Stefaneas", "Petros", ""], ["Anagnostopoulos", "Ioannis", ""], ["O'Hara", "Kieron", ""]]}, {"id": "1202.4393", "submitter": "Yaneer Bar-Yam", "authors": "Ama\\c{c} Herda\\u{g}delen, Wenyun Zuo, Alexander Gard-Murray and Yaneer\n  Bar-Yam", "title": "An Exploration of Social Identity: The Geography and Politics of\n  News-Sharing Communities in Twitter", "comments": "19 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": "New England Complex Systems Institute (NECSI) Report 2012-02-01", "categories": "physics.soc-ph cs.CY cs.SI nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of collective social action in current events is manifest in\nthe Arab Spring and Occupy movements. Electronic social media have become a\npervasive channel for social interactions, and a basis of collective social\nresponse to information. The study of social media can reveal how individual\nactions combine to become the collective dynamics of society. Characterizing\nthe groups that form spontaneously may reveal both how individuals\nself-identify and how they will act together. Here we map the social,\npolitical, and geographical properties of news-sharing communities on Twitter,\na popular micro-blogging platform. We track user-generated messages that\ncontain links to New York Times online articles and we label users according to\nthe topic of the links they share, their geographic location, and their\nself-descriptive keywords. When users are clustered based on who follows whom\nin Twitter, we find social groups separate by whether they are interested in\nlocal (NY), national (US) or global (cosmopolitan) issues. The national group\nsubdivides into liberal, conservative and other, the latter being a diverse but\nmostly business oriented group with sports, arts and other splinters. The\nnational political groups are based across the US but are distinct from the\nnational group that is broadly interested in a variety of topics. A person who\nis cosmopolitan associates with others who are cosmopolitan, and a US liberal /\nconservative associates with others who are US liberal / conservative, creating\nseparated social groups with those identities. The existence of \"citizens\" of\nlocal, national and cosmopolitan communities is a basis for dialog and action\nat each of these levels of societal organization.\n", "versions": [{"version": "v1", "created": "Mon, 20 Feb 2012 17:27:00 GMT"}], "update_date": "2012-02-21", "authors_parsed": [["Herdağdelen", "Amaç", ""], ["Zuo", "Wenyun", ""], ["Gard-Murray", "Alexander", ""], ["Bar-Yam", "Yaneer", ""]]}, {"id": "1202.4503", "submitter": "Arvind Narayanan", "authors": "Arvind Narayanan and Vincent Toubiana and Solon Barocas and Helen\n  Nissenbaum and Dan Boneh", "title": "A Critical Look at Decentralized Personal Data Architectures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While the Internet was conceived as a decentralized network, the most widely\nused web applications today tend toward centralization. Control increasingly\nrests with centralized service providers who, as a consequence, have also\namassed unprecedented amounts of data about the behaviors and personalities of\nindividuals.\n  Developers, regulators, and consumer advocates have looked to alternative\ndecentralized architectures as the natural response to threats posed by these\ncentralized services. The result has been a great variety of solutions that\ninclude personal data stores (PDS), infomediaries, Vendor Relationship\nManagement (VRM) systems, and federated and distributed social networks. And\nyet, for all these efforts, decentralized personal data architectures have seen\nlittle adoption.\n  This position paper attempts to account for these failures, challenging the\naccepted wisdom in the web community on the feasibility and desirability of\nthese approaches. We start with a historical discussion of the development of\nvarious categories of decentralized personal data architectures. Then we survey\nthe main ideas to illustrate the common themes among these efforts. We tease\napart the design characteristics of these systems from the social values that\nthey (are intended to) promote. We use this understanding to point out numerous\ndrawbacks of the decentralization paradigm, some inherent and others\nincidental. We end with recommendations for designers of these systems for\nworking towards goals that are achievable, but perhaps more limited in scope\nand ambition.\n", "versions": [{"version": "v1", "created": "Tue, 21 Feb 2012 01:15:51 GMT"}], "update_date": "2012-02-22", "authors_parsed": [["Narayanan", "Arvind", ""], ["Toubiana", "Vincent", ""], ["Barocas", "Solon", ""], ["Nissenbaum", "Helen", ""], ["Boneh", "Dan", ""]]}, {"id": "1202.6164", "submitter": "Florentina Pintea", "authors": "Alina Oana Zamosteanu", "title": "E-learning and use of computer in forensic field", "comments": "8 pages", "journal-ref": "Ann. Univ. Tibiscus Comp. Sci. Series VIII / 1 (2010), 9-16", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Romanian penitentiary establishments and those of other European\ncountries one talks about the formal and informal education. Since the\ncorrespondence education system, important steps have been made towards the\ne-learning didactics which are reflected by the modern teaching methods\n(through ICT) used even by the penitentiary system. The Moodle platform, the\nweb site with certain specific, and the forum represent the means used as an\ninterface between the educator and the student, their benefits being clearly\ndemonstrated.\n", "versions": [{"version": "v1", "created": "Tue, 28 Feb 2012 10:13:54 GMT"}], "update_date": "2012-02-29", "authors_parsed": [["Zamosteanu", "Alina Oana", ""]]}]