[{"id": "2104.00406", "submitter": "Dmitriy Zhuk", "authors": "Dmitriy Zhuk and Barnaby Martin", "title": "The complete classification for quantified equality constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO math.LO", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We prove that QCSP$(\\mathbb{N};x=y\\rightarrow y=z)$ is PSpace-complete,\nsettling a question open for more than ten years. This completes the complexity\nclassification for quantified equality languages as a trichotomy between\nLogspace, NP-complete and PSpace-complete.\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2021 11:32:24 GMT"}], "update_date": "2021-04-02", "authors_parsed": [["Zhuk", "Dmitriy", ""], ["Martin", "Barnaby", ""]]}, {"id": "2104.00785", "submitter": "Joshua Cook", "authors": "Joshua Cook", "title": "Unitarization Through Approximate Basis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we introduce the problem of unitarization. Unitarization is\nthe problem of taking several input quantum circuits that produce orthogonal\nstates from the all 0 state, and create an output circuit implementing a\nunitary with its first columns as those states. We allow the resulting\ncircuits, and even the input circuits, to use ancilla qubits initialized to 0.\nBut ancilla qubits must always be returned to 0 for ANY input, and we are only\nguaranteed the input circuits returns ancilla qubits to 0 on the all 0 input.\n  The unitarization problem seems hard if the output states are neither\northogonal to or in the span of the computational basis vectors that need to\nmap to them. In this work, we approximately solve this problem in the case\nwhere input circuits are given as black box oracles by probably finding an\napproximate basis for our states. This method may be more interesting than the\napplication.\n  Specifically, we find an approximate basis in polynomial time for the\nfollowing parameters. Take any natural $n$, $k =\nO\\left(\\frac{\\ln(n)}{\\ln(\\ln(n))}\\right)$, and $\\epsilon =\n2^{-O(\\sqrt{\\ln(n)})}$. Take any $k$ input unit vectors, $(\\lvert \\psi_i\n\\rangle)_{i\\in [k]}$ on polynomial in $n$ qubits prepared by quantum oracles,\n$(V_i)_{i \\in [k]}$, (that we can control call and control invert). Then there\nis a quantum circuit with polynomial size in $n$ and access to the oracles\n$(V_i)_{i \\in [k]}$ that with at least $1 - \\epsilon$ probability, computes at\nmost $k$ circuits with size polynomial in $n$ and oracle access to $(V_i)_{i\n\\in [k]}$ that $\\epsilon$ approximately computes an $\\epsilon$ approximate\northonormal basis for $(\\lvert \\psi_i \\rangle)_{i\\in [k]}$.\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2021 22:11:05 GMT"}], "update_date": "2021-04-05", "authors_parsed": [["Cook", "Joshua", ""]]}, {"id": "2104.01130", "submitter": "Jeroen Zuiddam", "authors": "Matthias Christandl, Omar Fawzi, Hoang Ta, Jeroen Zuiddam", "title": "Communication Complexity, Corner-Free Sets and the Symmetric Subrank of\n  Tensors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.AC math.CO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We develop and apply new combinatorial and algebraic tools to understand\nmultiparty communication complexity in the Number On the Forehead (NOF) model,\nand related Ramsey type problems in combinatorics. We identify barriers for\nprogress and propose new techniques to circumvent these.\n  (1) We introduce a technique for constructing independent sets in hypergraphs\nvia combinatorial degeneration. In particular, we make progress on the corner\nproblem by proving the existence of a corner-free subset of $\\mathbb{F}_2^n\n\\times \\mathbb{F}_2^n$ of size $3.16^{n-o(n)}$, which improves the previous\nlower bound $2.82^n$ of Linial, Pitassi and Shraibman (ITCS 2018).\n  In the Eval problem over a group $G$, three players need to determine whether\ntheir inputs $x_1, x_2, x_3 \\in G$ sum to zero. As a consequence of our\nconstruction of corner-free sets, the communication complexity of the Eval\nproblem over $\\mathbb{F}_2^n$ is at most $0.34n + O(\\log n)$, which improves\nthe previous upper bound $0.5n + O(\\log n)$.\n  (2) We point out how induced matchings in hypergraphs pose a barrier for\nexisting tensor tools (like slice rank, subrank, analytic rank, geometric rank\nand G-stable rank) to effectively upper bound the size of independent sets in\nhypergraphs. This implies a barrier for these tools to effectively lower bound\nthe communication complexity of the Eval problem over any group $G$.\n  (3) We introduce the symmetric subrank of tensors as a proposal to circumvent\nthe induced matching barrier and we introduce the symmetric quantum functional\nas a symmetric variation on the quantum functionals (STOC 2018). We prove that\nComon's conjecture holds asymptotically for the tensor rank, the subrank and\nthe restriction preorder, which implies a strong connection between Strassen's\nasymptotic spectrum of tensors and the asymptotic spectrum of symmetric\ntensors.\n", "versions": [{"version": "v1", "created": "Fri, 2 Apr 2021 16:10:35 GMT"}], "update_date": "2021-04-05", "authors_parsed": [["Christandl", "Matthias", ""], ["Fawzi", "Omar", ""], ["Ta", "Hoang", ""], ["Zuiddam", "Jeroen", ""]]}, {"id": "2104.01173", "submitter": "Lucas Maziero", "authors": "Lucas Porto Maziero, F\\'abio Luiz Usberti and Celso Cavellucci", "title": "Branch-and-cut algorithms for the covering salesman problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Covering Salesman Problem (CSP) is a generalization of the Traveling\nSalesman Problem in which the tour is not required to visit all vertices, as\nlong as all vertices are covered by the tour. The objective of CSP is to find a\nminimum length Hamiltonian cycle over a subset of vertices that covers an\nundirected graph. In this paper, valid inequalities from the generalized\ntraveling salesman problem are applied to the CSP in addition to new valid\ninequalities that explore distinct aspects of the problem. A branch-and-cut\nframework assembles exact and heuristic separation routines for integer and\nfractional CSP solutions. Computational experiments show that the proposed\nframework outperformed methodologies from literature with respect to optimality\ngaps. Moreover, optimal solutions were proven for several previously unsolved\ninstances.\n", "versions": [{"version": "v1", "created": "Fri, 2 Apr 2021 17:47:07 GMT"}], "update_date": "2021-04-05", "authors_parsed": [["Maziero", "Lucas Porto", ""], ["Usberti", "Fábio Luiz", ""], ["Cavellucci", "Celso", ""]]}, {"id": "2104.01736", "submitter": "Michael Chavrimootoo", "authors": "Benjamin Carleton, Michael Chavrimootoo, Conor Taliancich", "title": "A Critique of Keum-Bae Cho's Proof that $\\mathrm{P} \\subsetneq\n  \\mathrm{NP}$", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we critique Keum-Bae Cho's proof that $\\mathrm{P} \\subsetneq\n\\mathrm{NP}$. This proof relates instances of 3-SAT to indistinguishable\nbinomial decision trees and claims that no polynomial-time algorithm can solve\n3-SAT instances represented by these trees. We argue that their proof fails to\njustify a crucial step, and so the proof does not establish that $\\mathrm{P}\n\\subsetneq \\mathrm{NP}$.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2021 01:31:08 GMT"}], "update_date": "2021-04-06", "authors_parsed": [["Carleton", "Benjamin", ""], ["Chavrimootoo", "Michael", ""], ["Taliancich", "Conor", ""]]}, {"id": "2104.01841", "submitter": "Benjamin Merlin Bumpus", "authors": "Benjamin Merlin Bumpus and Zoltan A. Kocsis", "title": "Spined categories: generalizing tree-width beyond graphs", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC math.CT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We develop a general theory of categories that admit a functorial invariant\n(the triangulation functor) which generalizes the tree-width of graphs. Our\ntriangulation functor provides a uniform construction for various\ntree-width-like invariants including hypergraph tree-width, and the tree-width\nof the modular quotient in the category of modular partition functions.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2021 10:36:26 GMT"}], "update_date": "2021-04-06", "authors_parsed": [["Bumpus", "Benjamin Merlin", ""], ["Kocsis", "Zoltan A.", ""]]}, {"id": "2104.01993", "submitter": "Julius Aguma", "authors": "J Ceasar Aguma", "title": "An upper bound on the Universality of the Quantum Approximate\n  Optimization Algorithm", "comments": "preprint", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using lie algebra, this brief text provides an upper bound on the\nuniversality of QAOA. That is, we prove that the upper bound for the number of\nalterations of QAOA required to approximate a universal gate set is within O(n)\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2021 17:49:02 GMT"}], "update_date": "2021-04-06", "authors_parsed": [["Aguma", "J Ceasar", ""]]}, {"id": "2104.02363", "submitter": "Christian Ikenmeyer", "authors": "Lennart J. Haas and Christian Ikenmeyer", "title": "Young Flattenings in the Schur module basis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AG cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are several isomorphic constructions for the irreducible polynomial\nrepresentations of the general linear group in characteristic zero. The two\nmost well-known versions are called Schur modules and Weyl modules. Steven Sam\nused a Weyl module implementation in 2009 for his Macaulay2 package PieriMaps.\nThis implementation can be used to compute so-called Young flattenings of\npolynomials. Over the Schur module basis Oeding and Farnsworth describe a\nsimple combinatorial procedure that is supposed to give the Young flattening,\nbut their construction is not equivariant. In this paper we clarify this issue,\npresent the full details of the theory of Young flattenings in the Schur module\nbasis, and give a software implementation in this basis. Using Reuven Hodges'\nrecently discovered Young tableau straightening algorithm in the Schur module\nbasis as a subroutine, our implementation outperforms Sam's PieriMaps\nimplementation by several orders of magnitude on many examples, in particular\nfor powers of linear forms, which is the case of highest interest for proving\nborder Waring rank lower bounds.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2021 08:40:00 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Haas", "Lennart J.", ""], ["Ikenmeyer", "Christian", ""]]}, {"id": "2104.02519", "submitter": "Philippe Toint", "authors": "Stefania Bellavia, Gianmarco Gurioli, Benedetta Morini, Philippe L.\n  Toint", "title": "The Impact of Noise on Evaluation Complexity: The Deterministic\n  Trust-Region Case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CC cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intrinsic noise in objective function and derivatives evaluations may cause\npremature termination of optimization algorithms. Evaluation complexity bounds\ntaking this situation into account are presented in the framework of a\ndeterministic trust-region method. The results show that the presence of\nintrinsic noise may dominate these bounds, in contrast with what is known for\nmethods in which the inexactness in function and derivatives' evaluations is\nfully controllable. Moreover, the new analysis provides estimates of the\noptimality level achievable, should noise cause early termination. It finally\nsheds some light on the impact of inexact computer arithmetic on evaluation\ncomplexity.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2021 13:52:50 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Bellavia", "Stefania", ""], ["Gurioli", "Gianmarco", ""], ["Morini", "Benedetta", ""], ["Toint", "Philippe L.", ""]]}, {"id": "2104.02563", "submitter": "Stefan Mengel", "authors": "Stefan Mengel, Friedrich Slivovsky", "title": "Proof Complexity of Symbolic QBF Reasoning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce and investigate symbolic proof systems for Quantified Boolean\nFormulas (QBF) operating on Ordered Binary Decision Diagrams (OBDDs). These\nsystems capture QBF solvers that perform symbolic quantifier elimination, and\nas such admit short proofs of formulas of bounded path-width and quantifier\ncomplexity. As a consequence, we obtain exponential separations from standard\nclausal proof systems, specifically (long-distance) QU-Resolution and IR-Calc.\n  We further develop a lower bound technique for symbolic QBF proof systems\nbased on strategy extraction that lifts known lower bounds from communication\ncomplexity. This allows us to derive strong lower bounds against symbolic QBF\nproof systems that are independent of the variable ordering of the underlying\nOBDDs, and that hold even if the proof system is allowed access to an\nNP-oracle.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2021 15:01:56 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Mengel", "Stefan", ""], ["Slivovsky", "Friedrich", ""]]}, {"id": "2104.02564", "submitter": "Philippe Toint", "authors": "Serge Gratton, Sadok Jerad, Philippe L. Toint", "title": "H\\\"older Gradient Descent and Adaptive Regularization Methods in Banach\n  Spaces for First-Order Points", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CC cs.NA math.FA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers optimization of smooth nonconvex functionals in smooth\ninfinite dimensional spaces. A H\\\"older gradient descent algorithm is first\nproposed for finding approximate first-order points of regularized polynomial\nfunctionals. This method is then applied to analyze the evaluation complexity\nof an adaptive regularization method which searches for approximate first-order\npoints of functionals with $\\beta$-H\\\"older continuous derivatives. It is shown\nthat finding an $\\epsilon$-approximate first-order point requires at most\n$O(\\epsilon^{-\\frac{p+\\beta}{p+\\beta-1}})$ evaluations of the functional and\nits first $p$ derivatives.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2021 15:03:23 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Gratton", "Serge", ""], ["Jerad", "Sadok", ""], ["Toint", "Philippe L.", ""]]}, {"id": "2104.02752", "submitter": "David Pastor-Escuredo", "authors": "David Pastor-Escuredo and Philip Treleaven", "title": "Multiscale Governance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CC econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Future societal systems will be characterized by heterogeneous human\nbehaviors and also collective action. The interaction between local systems and\nglobal systems will be complex. Humandemics will propagate because of the\npathways that connect the different systems and several invariant behaviors and\npatterns that have emerged globally. On the contrary, infodemics of\nmisinformation can be a risk as it has occurred in the COVID-19 pandemic. The\nemerging fragility or robustness of the system will depend on how this complex\nnetwork of systems is governed. Future societal systems will not be only\nmultiscale in terms of the social dimension, but also in the temporality.\nNecessary and proper prevention and response systems based on complexity, ethic\nand multi-scale governance will be required. Real-time response systems are the\nbasis for resilience to be the foundation of robust societies. A top-down\napproach led by Governmental organs for managing humandemics is not sufficient\nand may be only effective if policies are very restrictive and their efficacy\ndepends not only in the measures implemented but also on the dynamics of the\npolicies and the population perception and compliance. This top-down approach\nis even weaker if there is not national and international coordination.\nCoordinating top-down agencies with bottom-up constructs will be the design\nprinciple. Multi-scale governance integrates decision-making processes with\nsignaling, sensing and leadership mechanisms to drive thriving societal systems\nwith real-time sensitivity.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2021 19:23:44 GMT"}], "update_date": "2021-04-08", "authors_parsed": [["Pastor-Escuredo", "David", ""], ["Treleaven", "Philip", ""]]}, {"id": "2104.02886", "submitter": "Arian Nadjimzadah", "authors": "Arian Nadjimzadah, David E. Narv\\'aez", "title": "On Salum's Algorithm for $\\mathrm{X3SAT}$", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This is a commentary on, and critique of, Latif Salum's paper titled\n\"Tractability of One-in-three $\\mathrm{3SAT}$: $\\mathrm{P} = \\mathrm{NP}$.\"\nSalum purports to give a polynomial-time algorithm that solves the\n$\\mathrm{NP}$-complete problem $\\mathrm{X3SAT}$, thereby claiming $\\mathrm{P} =\n\\mathrm{NP}$. The algorithm, in short, fixes the polarity of a variable,\ncarries out simplifications over the resulting formula to decide whether to\nkeep the value assigned or flip the polarity, and repeats with the remaining\nvariables. One thing this algorithm does not do is backtrack. We give an\nillustrative counterexample showing why the lack of backtracking makes this\nalgorithm flawed.\n", "versions": [{"version": "v1", "created": "Wed, 7 Apr 2021 03:23:38 GMT"}], "update_date": "2021-04-08", "authors_parsed": [["Nadjimzadah", "Arian", ""], ["Narváez", "David E.", ""]]}, {"id": "2104.02998", "submitter": "Petr Golovach", "authors": "Fedor V. Fomin, Petr A. Golovach, Dimitrios M. Thilikos", "title": "Parameterized Complexity of Elimination Distance to First-Order Logic\n  Properties", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.DM cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The elimination distance to some target graph property P is a general graph\nmodification parameter introduced by Bulian and Dawar. We initiate the study of\nelimination distances to graph properties expressible in first-order logic. We\ndelimit the problem's fixed-parameter tractability by identifying sufficient\nand necessary conditions on the structure of prefixes of first-order logic\nformulas. Our main result is the following meta-theorem: for every graph\nproperty P expressible by a first order-logic formula \\phi\\in \\Sigma_3, that\nis, of the form \\phi=\\exists x_1\\exists x_2\\cdots \\exists x_r \\forall\ny_1\\forall y_2\\cdots \\forall y_s \\exists z_1\\exists z_2\\cdots \\exists z_t \\psi,\nwhere \\psi is a quantifier-free first-order formula, checking whether the\nelimination distance of a graph to P does not exceed k, is fixed-parameter\ntractable parameterized by k. Properties of graphs expressible by formulas from\n\\Sigma_3 include being of bounded degree, excluding a forbidden subgraph, or\ncontaining a bounded dominating set. We complement this theorem by showing that\nsuch a general statement does not hold for formulas with even slightly more\nexpressive prefix structure: there are formulas \\phi\\in \\Pi_3, for which\ncomputing elimination distance is W[2]-hard.\n", "versions": [{"version": "v1", "created": "Wed, 7 Apr 2021 08:55:36 GMT"}], "update_date": "2021-04-08", "authors_parsed": [["Fomin", "Fedor V.", ""], ["Golovach", "Petr A.", ""], ["Thilikos", "Dimitrios M.", ""]]}, {"id": "2104.03591", "submitter": "Guy Weissenberg", "authors": "Zvika Brakerski, Devika Sharma, Guy Weissenberg", "title": "Unitary Subgroup Testing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of $\\textit{subgroup testing}$ for a quantum circuit\n$C$: given access to $C$, determine whether it implements a unitary from a\nsubgroup $\\mathcal{G}$ of the unitary group. In particular, the group\n$\\mathcal{G}$ can be the trivial subgroup (i.e., identity testing) or groups\nsuch as the Pauli or Clifford groups, or even their $q$-ary extensions. We also\nconsider a $\\textit{promise}$ version of the problem where $C$ is promised to\nbe in some subgroup of the unitaries that contains $\\mathcal{G}$ (e.g.,\nidentity testing for Clifford circuits).\n  We present a novel structural property of Clifford unitaries. Namely, that\ntheir (normalized) trace is bounded by $1/\\sqrt{2}$ in absolute value,\nregardless of the dimension. We show a similar property for the $q$-ary\nCliffords. This allows us to analyze a very simple single-query identity test\nunder the Clifford promise and show that it has (at least) constant soundness.\nThe same test has perfect soundness under the Pauli promise.\n  We use the test to show that identity/Pauli/Clifford testing (without\npromise) are all computationally equivalent, thus establishing computational\nhardness for Pauli and Clifford testing.\n", "versions": [{"version": "v1", "created": "Thu, 8 Apr 2021 08:12:25 GMT"}], "update_date": "2021-04-09", "authors_parsed": [["Brakerski", "Zvika", ""], ["Sharma", "Devika", ""], ["Weissenberg", "Guy", ""]]}, {"id": "2104.04356", "submitter": "Eva Miranda", "authors": "Robert Cardona, Eva Miranda and Daniel Peralta-Salas", "title": "Turing universality of the incompressible Euler equations and a\n  conjecture of Moore", "comments": "13 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP cs.CC math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we construct a compact Riemannian manifold of high dimension\non which the time dependent Euler equations are Turing complete. More\nprecisely, the halting of any Turing machine with a given input is equivalent\nto a certain global solution of the Euler equations entering a certain open set\nin the space of divergence-free vector fields. In particular, this implies the\nundecidability of whether a solution to the Euler equations with an initial\ndatum will reach a certain open set or not in the space of divergence-free\nfields. This result goes one step further in Tao's programme to study the\nblow-up problem for the Euler and Navier-Stokes equations using fluid\ncomputers. As a remarkable spin-off, our method of proof allows us to give a\ncounterexample to a conjecture of Moore dating back to 1998 on the\nnon-existence of analytic maps on compact manifolds that are Turing complete.\n", "versions": [{"version": "v1", "created": "Fri, 9 Apr 2021 13:36:17 GMT"}], "update_date": "2021-04-12", "authors_parsed": [["Cardona", "Robert", ""], ["Miranda", "Eva", ""], ["Peralta-Salas", "Daniel", ""]]}, {"id": "2104.04711", "submitter": "Jan Krajicek", "authors": "Jan Krajicek", "title": "Information in propositional proofs and algorithmic proof search", "comments": "Preliminary version February 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study from the proof complexity perspective the (informal) proof search\nproblem:\n  Is there an optimal way to search for propositional proofs?\n  We note that for any fixed proof system there exists a time-optimal proof\nsearch algorithm. Using classical proof complexity results about reflection\nprinciples we prove that a time-optimal proof search algorithm exists without\nrestricting proof systems iff a p-optimal proof system exists.\n  To characterize precisely the time proof search algorithms need for\nindividual formulas we introduce a new proof complexity measure based on\nalgorithmic information concepts. In particular, to a proof system $P$ we\nattach {\\bf information-efficiency function} $i_P(\\tau)$ assigning to a\ntautology a natural number, and we show that:\n  - $i_P(\\tau)$ characterizes time any $P$-proof search algorithm has to use on\n$\\tau$ and that for a fixed $P$ there is such an information-optimal algorithm,\n  - a proof system is information-efficiency optimal iff it is p-optimal,\n  - for non-automatizable systems $P$ there are formulas $\\tau$ with short\nproofs but having large information measure $i_P(\\tau)$.\n  We isolate and motivate the problem to establish unconditional\nsuper-logarithmic lower bounds for $i_P(\\tau)$ where no super-polynomial size\nlower bounds are known. We also point out connections of the new measure with\nsome topics in proof complexity other than proof search.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2021 08:37:08 GMT"}, {"version": "v2", "created": "Fri, 30 Apr 2021 14:53:45 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Krajicek", "Jan", ""]]}, {"id": "2104.04908", "submitter": "Sepehr Assadi", "authors": "Sepehr Assadi and Vishvajeet N", "title": "Graph Streaming Lower Bounds for Parameter Estimation and Property\n  Testing via a Streaming XOR Lemma", "comments": "Full version of the paper accepted to STOC 2021. 50 pages, 7 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study space-pass tradeoffs in graph streaming algorithms for parameter\nestimation and property testing problems such as estimating the size of maximum\nmatchings and maximum cuts, weight of minimum spanning trees, or testing if a\ngraph is connected or cycle-free versus being far from these properties. We\ndevelop a new lower bound technique that proves that for many problems of\ninterest, including all the above, obtaining a $(1+\\epsilon)$-approximation\nrequires either $n^{\\Omega(1)}$ space or $\\Omega(1/\\epsilon)$ passes, even on\nhighly restricted families of graphs such as bounded-degree planar graphs. For\nmultiple of these problems, this bound matches those of existing algorithms and\nis thus (asymptotically) optimal.\n  Our results considerably strengthen prior lower bounds even for arbitrary\ngraphs: starting from the influential work of [Verbin, Yu; SODA 2011], there\nhas been a plethora of lower bounds for single-pass algorithms for these\nproblems; however, the only multi-pass lower bounds proven very recently in\n[Assadi, Kol, Saxena, Yu; FOCS 2020] rules out sublinear-space algorithms with\nexponentially smaller $o(\\log{(1/\\epsilon)})$ passes for these problems.\n  One key ingredient of our proofs is a simple streaming XOR Lemma, a generic\nhardness amplification result, that we prove: informally speaking, if a\n$p$-pass $s$-space streaming algorithm can only solve a decision problem with\nadvantage $\\delta > 0$ over random guessing, then it cannot solve XOR of $\\ell$\nindependent copies of the problem with advantage much better than\n$\\delta^{\\ell}$. This result can be of independent interest and useful for\nother streaming lower bounds as well.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2021 03:36:02 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Assadi", "Sepehr", ""], ["N", "Vishvajeet", ""]]}, {"id": "2104.05065", "submitter": "Rustem Takhanov", "authors": "Rustem Takhanov", "title": "The algebraic structure of the densification and the sparsification\n  tasks for CSPs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tractability of certain CSPs for dense or sparse instances is known from\nthe 90s. Recently, the densification and the sparsification of CSPs were\nformulated as computational tasks and the systematical study of their\ncomputational complexity was initiated.\n  We approach this problem by introducing the densification operator, i.e. the\nclosure operator that, given an instance of a CSP, outputs all constraints that\nare satisfied by all of its solutions. According to the Galois theory of\nclosure operators, any such operator is related to a certain implicational\nsystem (or, a functional dependency) $\\Sigma$. We are specifically interested\nin those classes of fixed-template CSPs, parameterized by constraint languages\n$\\Gamma$, for which the size of an implicational system $\\Sigma$ is a\npolynomial in the number of variables $n$. We show that in the Boolean case,\n$\\Sigma$ is of polynomial size if and only if $\\Gamma$ is of bounded width. For\nsuch languages, $\\Sigma$ can be computed in log-space or in a logarithmic time\nwith a polynomial number of processors. Given an implicational system $\\Sigma$,\nthe densification task is equivalent to the computation of the closure of input\nconstraints. The sparsification task is equivalent to the computation of the\nminimal key. This leads to ${\\mathcal O}({\\rm poly}(n)\\cdot N^2)$-algorithm for\nthe sparsification task where $N$ is the number of non-redundant\nsparsifications of an original CSP.\n  Finally, we give a complete classification of constraint languages over the\nBoolean domain for which the densification problem is tractable.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2021 18:10:16 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Takhanov", "Rustem", ""]]}, {"id": "2104.05288", "submitter": "Till Heller", "authors": "Rebekka Haese and Till Heller and Sven O. Krumke", "title": "Algorithms and Complexity for the Almost Equal Maximum Flow Problem", "comments": null, "journal-ref": "Operations Research Proceedings 2019. Springer, Cham, 2020.\n  323-329", "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Equal Maximum Flow Problem (EMFP), we aim for a maximum flow where we\nrequire the same flow value on all edges in some given subsets of the edge set.\nIn this paper, we study the closely related Almost Equal Maximum Flow Problems\n(AEMFP) where the flow values on edges of one homologous edge set differ at\nmost by the valuation of a so called deviation function~$\\Delta$. We prove that\nthe integer almost equal maximum flow problem (integer AEMFP) is in general\n$\\mathcal{NP}$-complete, and show that even the problem of finding a fractional\nmaximum flow in the case of convex deviation functions is also\n$\\mathcal{NP}$-complete. This is in contrast to the EMFP, which is polynomial\ntime solvable in the fractional case. We provide inapproximability results for\nthe integral AEMFP. For the integer AEMFP we state a polynomial algorithm for\nthe constant deviation and concave case for a fixed number of homologous sets.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 08:38:38 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Haese", "Rebekka", ""], ["Heller", "Till", ""], ["Krumke", "Sven O.", ""]]}, {"id": "2104.05322", "submitter": "Till Fluschnik", "authors": "Dario Cavallaro and Till Fluschnik", "title": "Feedback Vertex Set on Hamiltonian Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the computational complexity of Feedback Vertex Set on subclasses of\nHamiltonian graphs. In particular, we consider Hamiltonian graphs that are\nregular or are planar and regular. Moreover, we study the less known class of\n$p$-Hamiltonian-ordered graphs, which are graphs that admit for any $p$-tuple\nof vertices a Hamiltonian cycle visiting them in the order given by the tuple.\nWe prove that Feedback Vertex Set remains NP-hard in these restricted cases,\neven if a Hamiltonian cycle is additionally given as part of the input.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 10:03:51 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Cavallaro", "Dario", ""], ["Fluschnik", "Till", ""]]}, {"id": "2104.05323", "submitter": "Petr Tichavsky", "authors": "Petr Tichavsky", "title": "Characterization of Decomposition of Matrix Multiplication Tensors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, the canonical polyadic (CP) decomposition of tensors that\ncorresponds to matrix multiplications is studied. Finding the rank of these\ntensors and computing the decompositions is a fundamental problem of algebraic\ncomplexity theory. In this paper, we characterize existing decompositions\n(found by any algorithm) by certain vectors called signature, and transform\nthem in another decomposition which can be more suitable in practical\nalgorithms. In particular, we present a novel decomposition of the tensor\nmultiplication of matrices of the size 3x3 with 3x6 with rank 40.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 10:06:17 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Tichavsky", "Petr", ""]]}, {"id": "2104.05425", "submitter": "Jan Maly", "authors": "Jan Maly", "title": "Ranking Sets of Objects: The Complexity of Avoiding Impossibility\n  Results", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of lifting a preference order on a set of objects to a preference\norder on a family of subsets of this set is a fundamental problem with a wide\nvariety of applications in AI. The process is often guided by axioms\npostulating properties the lifted order should have. Well-known impossibility\nresults by Kannai and Peleg and by Barber\\`a and Pattanaik tell us that some\ndesirable axioms - namely dominance and (strict) independence - are not jointly\nsatisfiable for any linear order on the objects if all non-empty sets of\nobjects are to be ordered. On the other hand, if not all non-empty sets of\nobjects are to be ordered, the axioms are jointly satisfiable for all linear\norders on the objects for some families of sets. Such families are very\nimportant for applications as they allow for the use of lifted orders, for\nexample, in combinatorial voting. In this paper, we determine the computational\ncomplexity of recognizing such families. We show that it is $\\Pi_2^p$-complete\nto decide for a given family of subsets whether dominance and independence or\ndominance and strict independence are jointly satisfiable for all linear orders\non the objects if the lifted order needs to be total. Furthermore, we show that\nthe problem remains coNP-complete if the lifted order can be incomplete.\nAdditionally, we show that the complexity of these problem can increase\nexponentially if the family of sets is not given explicitly but via a succinct\ndomain restriction. Finally, we show that it is NP-complete to decide for\nfamily of subsets whether dominance and independence or dominance and strict\nindependence are jointly satisfiable for at least one linear orders on the\nobjects.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 12:54:28 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Maly", "Jan", ""]]}, {"id": "2104.06085", "submitter": "Dylan Bellier", "authors": "Dylan Bellier (1), Massimo Benerecetti (2), Dario Della Monica (3),\n  Fabio Mogavero (2) ((1) UnivRennes (2) Universit\\`a di Napoli Federico II (3)\n  Universit\\`a di Udine)", "title": "Good-for-Game QPTL: An Alternating Hodges Semantics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  An extension of QPTL is considered where functional dependencies among the\nquantified variables can be restricted in such a way that their current values\nare independent of the future values of the other variables. This restriction\nis tightly connected to the notion of behavioral strategies in game-theory and\nallows the resulting logic to naturally express game-theoretic concepts. The\nfragment where only restricted quantifications are considered, called\nbehavioral quantifications, can be decided, for both model checking and\nsatisfiability, in 2ExpTime and is expressively equivalent to QPTL, though\nsignificantly less succinct.\n", "versions": [{"version": "v1", "created": "Tue, 13 Apr 2021 10:42:45 GMT"}, {"version": "v2", "created": "Thu, 24 Jun 2021 14:36:01 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Bellier", "Dylan", ""], ["Benerecetti", "Massimo", ""], ["Della Monica", "Dario", ""], ["Mogavero", "Fabio", ""]]}, {"id": "2104.07166", "submitter": "Patrick Phillips", "authors": "David Narv\\'aez and Patrick Phillips", "title": "On Lev Gordeev's \"On P Versus NP\"", "comments": "This article has 6 pages and 1 figure. This work as supported in part\n  by NSF grant CCF-2030859 to the Computing Research Association for the\n  CIFellows Project and by NSF grant CCF-2006496", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In the paper \"On P versus NP,\" Lev Gordeev attempts to extend the method of\napproximation, which successfully proved exponential lower bounds for monotone\ncircuits, to the case of De Morgan Normal (DMN) circuits. As in Razborov's\nproof of exponential lower bounds for monotone circuits, Gordeev's work is\nfocused on the NP-complete problem CLIQUE. If successful in proving exponential\nDMN circuit lower bounds for CLIQUE, Gordeev would prove that P $\\neq$ NP.\nHowever, we show that Gordeev makes a crucial mistake in Lemma 12. This mistake\ncomes from only approximating operations over positive circuit inputs.\nFurthermore, we argue that efforts to extend the method of approximation to DMN\ncircuits will need to approximate negated inputs as well.\n", "versions": [{"version": "v1", "created": "Wed, 14 Apr 2021 23:54:19 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["Narváez", "David", ""], ["Phillips", "Patrick", ""]]}, {"id": "2104.07247", "submitter": "Nicholas LaRacuente", "authors": "Nicholas LaRacuente", "title": "Quantum Oracle Separations from Complex but Easily Specified States", "comments": "29 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A foundational question in quantum computational complexity asks how much\nmore useful a quantum state can be in a given task than a comparable, classical\nstring. Aaronson and Kuperberg showed such a separation in the presence of a\nquantum oracle, a black box unitary callable during quantum computation. Their\nquantum oracle responds to a random, marked, quantum state, which is\nintractable to specify classically. We constrain the marked state in ways that\nmake it easy to specify classically while retaining separations in task\ncomplexity. Our method replaces query by state complexity. Furthermore,\nassuming a widely believed separation between the difficulty of creating a\nrandom, complex state and creating a specified state, we propose an\nexperimental demonstration of quantum witness advantage on near-term,\ndistributed quantum computers. Finally, using the fact that a standard,\nclassically defined oracle may enable a quantum algorithm to prepare an\notherwise hard state in polynomial steps, we observe quantum-classical oracle\nseparation in heavy output sampling.\n", "versions": [{"version": "v1", "created": "Thu, 15 Apr 2021 05:40:38 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["LaRacuente", "Nicholas", ""]]}, {"id": "2104.07293", "submitter": "Alexis Ghyselen", "authors": "Patrick Baillot (LIP), Alexis Ghyselen (LIP), Naoki Kobayashi", "title": "Sized Types with Usages for Parallel Complexity of Pi-Calculus Processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of analysing the complexity of concurrent programs\nwritten in Pi-calculus. We are interested in parallel complexity, or span,\nunderstood as the execution time in a model with maximal parallelism. A type\nsystem for parallel complexity has been recently proposed by Baillot and\nGhyselen but it is too imprecise for non-linear channels and cannot analyse\nsome concurrent processes. Aiming for a more precise analysis, we design a type\nsystem which builds on the concepts of sized types and usages. The new variant\nof usages we define accounts for the various ways a channel is employed and\nrelies on time annotations to track under which conditions processes can\nsynchronize. We prove that a type derivation for a process provides an upper\nbound on its parallel complexity.\n", "versions": [{"version": "v1", "created": "Thu, 15 Apr 2021 08:07:55 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["Baillot", "Patrick", "", "LIP"], ["Ghyselen", "Alexis", "", "LIP"], ["Kobayashi", "Naoki", ""]]}, {"id": "2104.07454", "submitter": "Rohitash Chandra", "authors": "Animesh Renanse, Rohitash Chandra, Alok Sharma", "title": "Memory Capacity of Neural Turing Machines with Matrix Representation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  It is well known that recurrent neural networks (RNNs) faced limitations in\nlearning long-term dependencies that have been addressed by memory structures\nin long short-term memory (LSTM) networks. Matrix neural networks feature\nmatrix representation which inherently preserves the spatial structure of data\nand has the potential to provide better memory structures when compared to\ncanonical neural networks that use vector representation. Neural Turing\nmachines (NTMs) are novel RNNs that implement notion of programmable computers\nwith neural network controllers to feature algorithms that have copying,\nsorting, and associative recall tasks. In this paper, we study the augmentation\nof memory capacity with a matrix representation of RNNs and NTMs (MatNTMs). We\ninvestigate if matrix representation has a better memory capacity than the\nvector representations in conventional neural networks. We use a probabilistic\nmodel of the memory capacity using Fisher information and investigate how the\nmemory capacity for matrix representation networks are limited under various\nconstraints, and in general, without any constraints. In the case of memory\ncapacity without any constraints, we found that the upper bound on memory\ncapacity to be $N^2$ for an $N\\times N$ state matrix. The results from our\nexperiments using synthetic algorithmic tasks show that MatNTMs have a better\nlearning capacity when compared to its counterparts.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2021 23:43:28 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["Renanse", "Animesh", ""], ["Chandra", "Rohitash", ""], ["Sharma", "Alok", ""]]}, {"id": "2104.08015", "submitter": "Mika\\\"el Monet", "authors": "Marcelo Arenas, Pablo Barcel\\'o, Leopoldo Bertossi, Mika\\\"el Monet", "title": "On the Complexity of SHAP-Score-Based Explanations: Tractability via\n  Knowledge Compilation and Non-Approximability Results", "comments": "52 pages, including 48 pages of main text. This is an extended\n  version of the AAAI conference paper \"The Tractability of SHAP-Score-Based\n  Explanations over Deterministic and Decomposable Boolean Circuits\"\n  (arXiv:2007.14045), with additional results", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In Machine Learning, the $\\mathsf{SHAP}$-score is a version of the Shapley\nvalue that is used to explain the result of a learned model on a specific\nentity by assigning a score to every feature. While in general computing\nShapley values is an intractable problem, we prove a strong positive result\nstating that the $\\mathsf{SHAP}$-score can be computed in polynomial time over\ndeterministic and decomposable Boolean circuits. Such circuits are studied in\nthe field of Knowledge Compilation and generalize a wide range of Boolean\ncircuits and binary decision diagrams classes, including binary decision trees\nand Ordered Binary Decision Diagrams (OBDDs).\n  We also establish the computational limits of the SHAP-score by observing\nthat computing it over a class of Boolean models is always polynomially as hard\nas the model counting problem for that class. This implies that both\ndeterminism and decomposability are essential properties for the circuits that\nwe consider. It also implies that computing $\\mathsf{SHAP}$-scores is\nintractable as well over the class of propositional formulas in DNF. Based on\nthis negative result, we look for the existence of fully-polynomial randomized\napproximation schemes (FPRAS) for computing $\\mathsf{SHAP}$-scores over such\nclass. In contrast to the model counting problem for DNF formulas, which admits\nan FPRAS, we prove that no such FPRAS exists for the computation of\n$\\mathsf{SHAP}$-scores. Surprisingly, this negative result holds even for the\nclass of monotone formulas in DNF. These techniques can be further extended to\nprove another strong negative result: Under widely believed complexity\nassumptions, there is no polynomial-time algorithm that checks, given a\nmonotone DNF formula $\\varphi$ and features $x,y$, whether the\n$\\mathsf{SHAP}$-score of $x$ in $\\varphi$ is smaller than the\n$\\mathsf{SHAP}$-score of $y$ in $\\varphi$.\n", "versions": [{"version": "v1", "created": "Fri, 16 Apr 2021 10:22:32 GMT"}], "update_date": "2021-04-19", "authors_parsed": [["Arenas", "Marcelo", ""], ["Barceló", "Pablo", ""], ["Bertossi", "Leopoldo", ""], ["Monet", "Mikaël", ""]]}, {"id": "2104.08470", "submitter": "Till Fluschnik", "authors": "Dario Cavallaro and Till Fluschnik", "title": "3-Coloring on Regular, Planar, and Ordered Hamiltonian Graphs", "comments": "arXiv admin note: text overlap with arXiv:2104.05322", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that 3-Coloring remains NP-hard on 4- and 5-regular planar\nHamiltonian graphs, strengthening the results of Dailey [Disc. Math.'80] and\nFleischner and Sabidussi [J. Graph. Theor.'02]. Moreover, we prove that\n3-Coloring remains NP-hard on $p$-regular Hamiltonian graphs for every $p\\geq\n6$ and $p$-ordered regular Hamiltonian graphs for every $p\\geq 3$.\n", "versions": [{"version": "v1", "created": "Sat, 17 Apr 2021 07:18:05 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Cavallaro", "Dario", ""], ["Fluschnik", "Till", ""]]}, {"id": "2104.08616", "submitter": "Nils Morawietz", "authors": "Nils Morawietz and Petra Wolf", "title": "A Timecop's Chase Around the Table", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the cops and robber game variant consisting of one cop and one\nrobber on time-varying graphs (TVG). The considered TVGs are edge periodic\ngraphs, i.e., for each edge, a binary string $s_e$ determines in which time\nstep the edge is present, namely the edge $e$ is present in time step $t$ if\nand only if the string $s_e$ contains a $1$ at position $t \\mod |s_e|$. This\nperiodicity allows for a compact representation of the infinite TVG. We proof\nthat even for very simple underlying graphs, i.e., directed and undirected\ncycles the problem whether a cop-winning strategy exists is NP-hard and\nW[1]-hard parameterized by the number of vertices. Our second main result are\nmatching lower bounds for the ratio between the length of the underlying cycle\nand the least common multiple (LCM) of the lengths of binary strings describing\nedge-periodicies over which the graph is robber-winning. Our third main result\nimproves the previously known EXPTIME upper bound for Periodic Cop and Robber\non general edge periodic graphs to PSPACE-membership.\n", "versions": [{"version": "v1", "created": "Sat, 17 Apr 2021 18:42:55 GMT"}, {"version": "v2", "created": "Sun, 11 Jul 2021 22:09:42 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Morawietz", "Nils", ""], ["Wolf", "Petra", ""]]}, {"id": "2104.08759", "submitter": "Ofir Gordon", "authors": "Ofir Gordon, Yuval Filmus, Oren Salzman", "title": "Revisiting the Complexity Analysis of Conflict-Based Search: New\n  Computational Techniques and Improved Bounds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.CC cs.RO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The problem of Multi-Agent Path Finding (MAPF) calls for finding a set of\nconflict-free paths for a fleet of agents operating in a given environment.\nArguably, the state-of-the-art approach to computing optimal solutions is\nConflict-Based Search (CBS). In this work we revisit the complexity analysis of\nCBS to provide tighter bounds on the algorithm's run-time in the worst-case.\nOur analysis paves the way to better pinpoint the parameters that govern (in\nthe worst case) the algorithm's computational complexity.\n  Our analysis is based on two complementary approaches: In the first approach\nwe bound the run-time using the size of a Multi-valued Decision Diagram (MDD)\n-- a layered graph which compactly contains all possible single-agent paths\nbetween two given vertices for a specific path length.\n  In the second approach we express the running time by a novel recurrence\nrelation which bounds the algorithm's complexity. We use generating\nfunctions-based analysis in order to tightly bound the recurrence.\n  Using these technique we provide several new upper-bounds on CBS's\ncomplexity. The results allow us to improve the existing bound on the running\ntime of CBS for many cases. For example, on a set of common benchmarks we\nimprove the upper-bound by a factor of at least $2^{10^{7}}$.\n", "versions": [{"version": "v1", "created": "Sun, 18 Apr 2021 07:46:28 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Gordon", "Ofir", ""], ["Filmus", "Yuval", ""], ["Salzman", "Oren", ""]]}, {"id": "2104.09002", "submitter": "Ted Ralphs", "authors": "Aykut Bulut and Ted K. Ralphs", "title": "On the Complexity of Inverse Mixed Integer Linear Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": "Laboratory for Computation Optimization Research @ Lehigh (COR@L)\n  Technical Report 15T-001-R5", "categories": "cs.CC math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inverse optimization is the problem of determining the values of missing\ninput parameters for an associated forward problem that are closest to given\nestimates and that will make a given target vector optimal. This study is\nconcerned with the relationship of a particular inverse mixed integer linear\noptimization problem (MILP) to both the forward problem and the separation\nproblem associated with its feasible region. We show that a decision version of\nthe inverse MILP in which a primal bound is verified is coNP-complete, whereas\nprimal bound verification for the associated forward problem is NP-complete,\nand that the optimal value verification problems for both the inverse problem\nand the associated forward problem are complete for the complexity class D^P.\nWe also describe a cutting-plane algorithm for solving inverse MILPs that\nillustrates the close relationship between the separation problem for the\nconvex hull of solutions to a given MILP and the associated inverse problem.\nThe inverse problem is shown to be equivalent to the separation problem for the\nradial cone defined by all inequalities that are both valid for the convex hull\nof solutions to the forward problem and binding at the target vector. Thus, the\ninverse, forward, and separation problems can be said to be equivalent.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2021 01:36:13 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Bulut", "Aykut", ""], ["Ralphs", "Ted K.", ""]]}, {"id": "2104.09884", "submitter": "Chao Qian", "authors": "Chao Qian, Dan-Xuan Liu, Chao Feng, Ke Tang", "title": "Multi-objective Evolutionary Algorithms are Generally Good: Maximizing\n  Monotone Submodular Functions over Sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.AI cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary algorithms (EAs) are general-purpose optimization algorithms,\ninspired by natural evolution. Recent theoretical studies have shown that EAs\ncan achieve good approximation guarantees for solving the problem classes of\nsubmodular optimization, which have a wide range of applications, such as\nmaximum coverage, sparse regression, influence maximization, document\nsummarization and sensor placement, just to name a few. Though they have\nprovided some theoretical explanation for the general-purpose nature of EAs,\nthe considered submodular objective functions are defined only over sets or\nmultisets. To complement this line of research, this paper studies the problem\nclass of maximizing monotone submodular functions over sequences, where the\nobjective function depends on the order of items. We prove that for each kind\nof previously studied monotone submodular objective functions over sequences,\ni.e., prefix monotone submodular functions, weakly monotone and strongly\nsubmodular functions, and DAG monotone submodular functions, a simple\nmulti-objective EA, i.e., GSEMO, can always reach or improve the best known\napproximation guarantee after running polynomial time in expectation. Note that\nthese best-known approximation guarantees can be obtained only by different\ngreedy-style algorithms before. Empirical studies on various applications,\ne.g., accomplishing tasks, maximizing information gain, search-and-tracking and\nrecommender systems, show the excellent performance of the GSEMO.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2021 10:36:10 GMT"}], "update_date": "2021-04-21", "authors_parsed": [["Qian", "Chao", ""], ["Liu", "Dan-Xuan", ""], ["Feng", "Chao", ""], ["Tang", "Ke", ""]]}, {"id": "2104.10124", "submitter": "Robert Bredereck", "authors": "Niclas Boehmer, Robert Bredereck, Du\\v{s}an Knop, Junjie Luo", "title": "Finding Small Multi-Demand Set Covers with Ubiquitous Elements and Large\n  Sets is Fixed-Parameter Tractable", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a variant of Set Cover where each element of the universe has some\ndemand that determines how many times the element needs to be covered.\nMoreover, we examine two generalizations of this problem when a set can be\nincluded multiple times and when sets have different prices. We prove that all\nthree problems are fixed-parameter tractable with respect to the combined\nparameter budget, the maximum number of elements missing in one of the sets,\nand the maximum number of sets in which one of the elements does not occur.\nLastly, we point out how our fixed-parameter tractability algorithm can be\napplied in the context of bribery for the (collective-decision) group\nidentification problem.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2021 17:12:15 GMT"}], "update_date": "2021-04-21", "authors_parsed": [["Boehmer", "Niclas", ""], ["Bredereck", "Robert", ""], ["Knop", "Dušan", ""], ["Luo", "Junjie", ""]]}, {"id": "2104.10343", "submitter": "Michael Hahn", "authors": "Michael Hahn, Dan Jurafsky, Richard Futrell", "title": "Sensitivity as a Complexity Measure for Sequence Classification Tasks", "comments": "Accepted by TACL. This is a pre-MIT Press publication version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a theoretical framework for understanding and predicting the\ncomplexity of sequence classification tasks, using a novel extension of the\ntheory of Boolean function sensitivity. The sensitivity of a function, given a\ndistribution over input sequences, quantifies the number of disjoint subsets of\nthe input sequence that can each be individually changed to change the output.\nWe argue that standard sequence classification methods are biased towards\nlearning low-sensitivity functions, so that tasks requiring high sensitivity\nare more difficult. To that end, we show analytically that simple lexical\nclassifiers can only express functions of bounded sensitivity, and we show\nempirically that low-sensitivity functions are easier to learn for LSTMs. We\nthen estimate sensitivity on 15 NLP tasks, finding that sensitivity is higher\non challenging tasks collected in GLUE than on simple text classification\ntasks, and that sensitivity predicts the performance both of simple lexical\nclassifiers and of vanilla BiLSTMs without pretrained contextualized\nembeddings. Within a task, sensitivity predicts which inputs are hard for such\nsimple models. Our results suggest that the success of massively pretrained\ncontextual representations stems in part because they provide representations\nfrom which information can be extracted by low-sensitivity decoders.\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2021 03:56:59 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Hahn", "Michael", ""], ["Jurafsky", "Dan", ""], ["Futrell", "Richard", ""]]}, {"id": "2104.10570", "submitter": "Barnaby Martin", "authors": "Benoit Larose and Petar Markovic and Barnaby Martin and Daniel\n  Paulusma and Siani Smith and Stanislav Zivny", "title": "QCSP on Reflexive Tournaments", "comments": "arXiv admin note: text overlap with arXiv:1709.09486", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We give a complexity dichotomy for the Quantified Constraint Satisfaction\nProblem QCSP(H) when H is a reflexive tournament. It is well-known that\nreflexive tournaments can be split into a sequence of strongly connected\ncomponents H_1,...,H_n so that there exists an edge from every vertex of H_i to\nevery vertex of H_j if and only if i<j. We prove that if H has both its initial\nand final strongly connected component (possibly equal) of size 1, then QCSP(H)\nis in NL and otherwise QCSP(H) is NP-hard.\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2021 14:53:48 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Larose", "Benoit", ""], ["Markovic", "Petar", ""], ["Martin", "Barnaby", ""], ["Paulusma", "Daniel", ""], ["Smith", "Siani", ""], ["Zivny", "Stanislav", ""]]}, {"id": "2104.10593", "submitter": "Daniel Paulusma", "authors": "Christoph Brause and Petr Golovach and Barnaby Martin and Pascal Ochem\n  and Dani\\\"el Paulusma and Siani Smith", "title": "Acyclic, Star, and Injective Colouring: Bounding the Diameter", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the effect of bounding the diameter for well-studied variants of\nthe Colouring problem. A colouring is acyclic, star, or injective if any two\ncolour classes induce a forest, star forest or disjoint union of vertices and\nedges, respectively. The corresponding decision problems are Acyclic Colouring,\nStar Colouring and Injective Colouring. The last problem is also known as\n$L(1,1)$-Labelling and we also consider the framework of $L(a,b)$-Labelling. We\nprove a number of (almost-)complete complexity classifications. In particular,\nwe show that for graphs of diameter at most $d$, Acyclic $3$-Colouring is\npolynomial-time solvable if $d\\leq 2$ but NP-complete if $d\\geq 4$, and Star\n$3$-Colouring is polynomial-time solvable if $d\\leq 3$ but NP-complete for\n$d\\geq 8$. As far as we are aware, Star $3$-Colouring is the first problem that\nexhibits a complexity jump for some $d\\geq 3$. Our third main result is that\n$L(1,2)$-Labelling is NP-complete for graphs of diameter $2$; we relate the\nlatter problem to a special case of Hamiltonian Path.\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2021 15:45:07 GMT"}, {"version": "v2", "created": "Mon, 10 May 2021 20:16:03 GMT"}, {"version": "v3", "created": "Tue, 1 Jun 2021 13:43:03 GMT"}], "update_date": "2021-06-02", "authors_parsed": [["Brause", "Christoph", ""], ["Golovach", "Petr", ""], ["Martin", "Barnaby", ""], ["Ochem", "Pascal", ""], ["Paulusma", "Daniël", ""], ["Smith", "Siani", ""]]}, {"id": "2104.10621", "submitter": "Tony Tan", "authors": "Ting-Wei Lin, Chia-Hsuan Lu, Tony Tan", "title": "Towards a more efficient approach for the satisfiability of two-variable\n  logic", "comments": "To appear in the proceedings of LICS 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the satisfiability problem for two-variable logic, denoted by\nSAT(FO2), which is known to be NEXP-complete. The upper bound is usually\nderived from its well known \"exponential size model\" property. Whether it can\nbe determinized/randomized efficiently is still an open question.\n  In this paper we present a different approach by reducing it to a novel\ngraph-theoretic problem that we call \"Conditional Independent Set\" (CIS). We\nshow that CIS is NP-complete and present three simple algorithms for it:\nDeterministic, randomized with zero error and randomized with small one-sided\nerror, with run time O(1.4423^n), O(1.6181^n) and O(1.3661^n), respectively.\n  We then show that without the equality predicate SAT(FO2) is in fact\nequivalent to CIS in succinct representation. This yields the same three simple\nalgorithms as above for SAT(FO2) without the the equality predicate with run\ntime O(1.4423^(2^n)), O(1.6181^(2^n)) and O(1.3661^(2^n)), respectively, where\nn is the number of predicates in the input formula. To the best of our\nknowledge, these are the first deterministic/randomized algorithms for an\nNEXP-complete decidable logic with time complexity significantly lower than\nO(2^(2^n)). We also identify a few lower complexity fragments of SAT(FO2) which\ncorrespond to the tractable fragments of CIS.\n  For the fragment with the equality predicate, we present a linear time\nmany-one reduction to the fragment without the equality predicate. The\nreduction yields equi-satisfiable formulas and incurs a small constant blow-up\nin the number of predicates.\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2021 16:29:09 GMT"}, {"version": "v2", "created": "Thu, 29 Apr 2021 01:59:24 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Lin", "Ting-Wei", ""], ["Lu", "Chia-Hsuan", ""], ["Tan", "Tony", ""]]}, {"id": "2104.11192", "submitter": "Abuzer Yakaryilmaz", "authors": "Aliya Khadieva and Abuzer Yakary{\\i}lmaz", "title": "Affine automata verifiers", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We initiate the study of the verification power of AfAs as part of\nArthur-Merlin (AM) proof systems. We show that every unary language is verified\nby a real-valued AfA verifier. Then, we focus on the verifiers restricted to\nhave only integer-valued or rational-valued transitions. We observe that\nrational-valued verifiers can be simulated by integer-valued verifiers, and,\ntheir protocols can be simulated in nondeterministic polynomial time. We show\nthat this bound tight by presenting an AfA verifier for NP-complete problem\nSUBSETSUM. We also show that AfAs can verify certain non-affine and\nnon-stochastic unary languages.\n", "versions": [{"version": "v1", "created": "Thu, 22 Apr 2021 17:24:28 GMT"}], "update_date": "2021-04-23", "authors_parsed": [["Khadieva", "Aliya", ""], ["Yakaryılmaz", "Abuzer", ""]]}, {"id": "2104.11808", "submitter": "Libor Barto", "authors": "Libor Barto, Zarathustra Brady, Andrei Bulatov, Marcin Kozik, Dmitriy\n  Zhuk", "title": "Minimal Taylor Algebras as a Common Framework for the Three Algebraic\n  Approaches to the CSP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper focuses on the algebraic theory underlying the study of the\ncomplexity and the algorithms for the Constraint Satisfaction Problem (CSP). We\nunify, simplify, and extend parts of the three approaches that have been\ndeveloped to study the CSP over finite templates - absorption theory that was\nused to characterize CSPs solvable by local consistency methods (JACM'14), and\nBulatov's and Zhuk's theories that were used for two independent proofs of the\nCSP Dichotomy Theorem (FOCS'17, JACM'20).\n  As the first contribution we present an elementary theorem about primitive\npositive definability and use it to obtain the starting points of Bulatov's and\nZhuk's proofs as corollaries. As the second contribution we propose and\ninitiate a systematic study of minimal Taylor algebras. This class of algebras\nis broad enough so that it suffices to verify the CSP Dichotomy Theorem on this\nclass only, but still is unusually well behaved. In particular, many concepts\nfrom the three approaches coincide in the class, which is in striking contrast\nwith the general setting.\n  We believe that the theory initiated in this paper will eventually result in\na simple and more natural proof of the Dichotomy Theorem that employs a simpler\nand more efficient algorithm, and will help in attacking complexity questions\nin other CSP-related problems.\n", "versions": [{"version": "v1", "created": "Fri, 23 Apr 2021 20:12:46 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Barto", "Libor", ""], ["Brady", "Zarathustra", ""], ["Bulatov", "Andrei", ""], ["Kozik", "Marcin", ""], ["Zhuk", "Dmitriy", ""]]}, {"id": "2104.11955", "submitter": "Sebastian Rudolph", "authors": "Manuel Bodirsky, Thomas Feller, Simon Kn\\\"auer, Sebastian Rudolph", "title": "On Logics and Homomorphism Closure", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Predicate logic is the premier choice for specifying classes of relational\nstructures. Homomorphisms are key to describing correspondences between\nrelational structures. Questions concerning the interdependencies between these\ntwo means of characterizing (classes of) structures are of fundamental interest\nand can be highly non-trivial to answer. We investigate several problems\nregarding the homomorphism closure (homclosure) of the class of all (finite or\narbitrary) models of logical sentences: membership of structures in a\nsentence's homclosure; sentence homclosedness; homclosure characterizability in\na logic; normal forms for homclosed sentences in certain logics. For a wide\nvariety of fragments of first- and second-order predicate logic, we clarify\nthese problems' computational properties.\n", "versions": [{"version": "v1", "created": "Sat, 24 Apr 2021 13:55:07 GMT"}, {"version": "v2", "created": "Thu, 29 Apr 2021 12:07:37 GMT"}, {"version": "v3", "created": "Tue, 29 Jun 2021 20:46:24 GMT"}], "update_date": "2021-07-01", "authors_parsed": [["Bodirsky", "Manuel", ""], ["Feller", "Thomas", ""], ["Knäuer", "Simon", ""], ["Rudolph", "Sebastian", ""]]}, {"id": "2104.12212", "submitter": "Subhamoy Maitra", "authors": "Suman Dutta, Subhamoy Maitra and Chandra Sekhar Mukherjee", "title": "Following Forrelation -- Quantum Algorithms in Exploring Boolean\n  Functions' Spectra", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Here we revisit the quantum algorithms for obtaining Forrelation [Aaronson et\nal, 2015] values to evaluate some of the well-known cryptographically\nsignificant spectra of Boolean functions, namely the Walsh spectrum, the\ncross-correlation spectrum and the autocorrelation spectrum. We first study the\n2-fold Forrelation formulation with bent duality based promise problems as\ndesirable instantiations. Next we concentrate on the $3$-fold version through\ntwo approaches. First, we judiciously set-up some of the functions in $3$-fold\nForrelation, so that given an oracle access, one can sample from the Walsh\nSpectrum of $f$. Using this, we obtain improved results in resiliency checking.\nFurthermore, we use similar idea to obtain a technique in estimating the\ncross-correlation (and thus autocorrelation) value at any point, improving upon\nthe existing algorithms. Finally, we tweak the quantum algorithm with\nsuperposition of linear functions to obtain a cross-correlation sampling\ntechnique. To the best of our knowledge, this is the first cross-correlation\nsampling algorithm with constant query complexity. This also provides a\nstrategy to check if two functions are uncorrelated of degree $m$. We further\nmodify this using Dicke states so that the time complexity reduces,\nparticularly for constant values of $m$.\n", "versions": [{"version": "v1", "created": "Sun, 25 Apr 2021 17:13:18 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Dutta", "Suman", ""], ["Maitra", "Subhamoy", ""], ["Mukherjee", "Chandra Sekhar", ""]]}, {"id": "2104.12800", "submitter": "Stanislav Zivny", "authors": "Alex Brandts and Stanislav \\v{Z}ivn\\'y", "title": "Beyond PCSP(1-in-3,NAE)", "comments": "Full version of an ICALP 2021 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The promise constraint satisfaction problem (PCSP) is a recently introduced\nvast generalisation of the constraint satisfaction problem (CSP) that captures\napproximability of satisfiable instances. A PCSP instance comes with two forms\nof each constraint: a strict one and a weak one. Given the promise that a\nsolution exists using the strict constraints, the task is to find a solution\nusing the weak constraints. While there are by now several dichotomy results\nfor fragments of PCSPs, they all consider (in some way) symmetric PCSPs.\n  1-in-3-SAT and Not-All-Equal-3-SAT are classic examples of Boolean symmetric\n(non-promise) CSPs. While both problems are NP-hard, Brakensiek and Guruswami\nshowed [SODA'18] that given a satisfiable instance of 1-in-3-SAT one can find a\nsolution to the corresponding instance of (weaker) Not-All-Equal-3-SAT. In\nother words, the PCSP template (1-in-3,NAE) is tractable.\n  We focus on non-symmetric PCSPs. In particular, we study PCSP templates\nobtained from the Boolean template (t-in-k,NAE) by either adding tuples to\nt-in-k or removing tuples from NAE. For the former, we classify all templates\nas either tractable or not solvable by the currently strongest known algorithm\nfor PCSPs, the combined basic LP and affine IP relaxation of Brakensiek and\nGuruswami [SODA'20]. For the latter, we classify all templates as either\ntractable or NP-hard.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2021 18:00:41 GMT"}], "update_date": "2021-04-28", "authors_parsed": [["Brandts", "Alex", ""], ["Živný", "Stanislav", ""]]}, {"id": "2104.13097", "submitter": "Michael Lampis", "authors": "Michael Lampis", "title": "Minimum Stable Cut and Treewidth", "comments": "Full version of ICALP 2021 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A stable cut of a graph is a cut whose weight cannot be increased by changing\nthe side of a single vertex. Equivalently, a cut is stable if all vertices have\nthe (weighted) majority of their neighbors on the other side. In this paper we\nstudy Min Stable Cut, the problem of finding a stable cut of minimum weight,\nwhich is closely related to the Price of Anarchy of the Max Cut game. Since\nthis problem is NP-hard, we study its complexity on graphs of low treewidth,\nlow degree, or both. We show that the problem is weakly NP-hard on severely\nrestricted trees, so bounding treewidth alone cannot make it tractable. We\nmatch this with a pseudo-polynomial DP algorithm running in time $(\\Delta\\cdot\nW)^{O(tw)}n^{O(1)}$, where $tw$ is the treewidth, $\\Delta$ the maximum degree,\nand $W$ the maximum weight. On the other hand, bounding $\\Delta$ is also not\nenough, as the problem is NP-hard for unweighted graphs of bounded degree. We\ntherefore parameterize Min Stable Cut by both $tw+\\Delta$ and obtain an FPT\nalgorithm running in time $2^{O(\\Delta tw)}(n+\\log W)^{O(1)}$. Our main result\nis to provide a reduction showing that both aforementioned algorithms are\nessentially optimal, even if we replace treewidth by pathwidth: if there exists\nan algorithm running in $(nW)^{o(pw)}$ or $2^{o(\\Delta pw)}(n+\\log W)^{O(1)}$,\nthen the ETH is false. Complementing this, we show that we can obtain an FPT\napproximation scheme parameterized by treewidth, if we consider almost-stable\nsolutions.\n  Motivated by these mostly negative results, we consider Unweighted Min Stable\nCut. Here our results already imply a much faster exact algorithm running in\ntime $\\Delta^{O(tw)}n^{O(1)}$. We show that this is also probably essentially\noptimal: an algorithm running in $n^{o(pw)}$ would contradict the ETH.\n", "versions": [{"version": "v1", "created": "Tue, 27 Apr 2021 10:42:04 GMT"}], "update_date": "2021-04-28", "authors_parsed": [["Lampis", "Michael", ""]]}, {"id": "2104.13362", "submitter": "Arka Ray", "authors": "Arka Ray", "title": "There is no APTAS for 2-dimensional vector bin packing: Revisited", "comments": "11 pages, LIPIcs format, changes: fixed typos, added vector bin\n  covering result", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study vector bin packing and vector bin covering problems,\nmultidimensional generalizations of the classical bin packing and bin covering\nproblems, respectively. In Vector Bin Packing we are given a set of\n$d$-dimensional vectors from $(0,1]^d$, and the aim is to partition the set\ninto the minimum number of bins such that for each bin $B$, we have\n$\\left\\|\\sum_{v\\in B}v\\right\\|_\\infty\\leq 1$. Woeginger [Woe97] claimed that\nthe problem has no APTAS for dimensions greater than or equal to 2. We note\nthat there was a slight oversight in the original proof. Hence, we give a\nrevised proof using some additional ideas from [BCKS06, CC09]. In fact, we show\nthat it is NP-hard to get an asymptotic approximation ratio better than\n$\\frac{600}{599}$, for $d=2$.\n  In the vector bin covering problem given a set of $d$-dimensional vectors\nfrom $(0,1]^d$, the aim is to obtain a family of disjoint subsets (called bins)\nwith the maximum cardinality such that for each bin $B$, we have $\\sum_{v\\in\nB}v\\geq \\mathbf 1$. Using ideas similar to our vector bin packing result, we\nshow that for vector bin covering there is no APTAS for dimensions greater than\nor equal to 2. In fact, we show that it is NP-hard to get an asymptotic\napproximation ratio better than $\\frac{998}{997}$.\n", "versions": [{"version": "v1", "created": "Tue, 27 Apr 2021 17:43:33 GMT"}, {"version": "v2", "created": "Sat, 8 May 2021 18:35:21 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Ray", "Arka", ""]]}, {"id": "2104.13681", "submitter": "Gabriel Istrate", "authors": "Gabriel Istrate, Cosmin Bonchis and Adrian Craciun", "title": "Kernelization, Proof Complexity and Social Choice", "comments": "Revised version will appear in the Proceedings of ICALP 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.GT cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We display an application of the notions of kernelization and data reduction\nfrom parameterized complexity to proof complexity: Specifically, we show that\nthe existence of data reduction rules for a parameterized problem having (a). a\nsmall-length reduction chain, and (b). small-size (extended) Frege proofs\ncertifying the soundness of reduction steps implies the existence of\nsubexponential size (extended) Frege proofs for propositional formalizations of\nthe given problem.\n  We apply our result to infer the existence of subexponential Frege and\nextended Frege proofs for a variety of problems. Improving earlier results of\nAisenberg et al. (ICALP 2015), we show that propositional formulas expressing\n(a stronger form of) the Kneser-Lov\\'asz Theorem have polynomial size Frege\nproofs for each constant value of the parameter k. Previously only\nquasipolynomial bounds were known (and only for the ordinary Kneser-Lov\\'asz\nTheorem).\n  Another notable application of our framework is to impossibility results in\ncomputational social choice: we show that, for any fixed number of agents,\npropositional translations of the Arrow and Gibbard-Satterthwaite impossibility\ntheorems have subexponential size Frege proofs.\n", "versions": [{"version": "v1", "created": "Wed, 28 Apr 2021 10:09:14 GMT"}], "update_date": "2021-04-29", "authors_parsed": [["Istrate", "Gabriel", ""], ["Bonchis", "Cosmin", ""], ["Craciun", "Adrian", ""]]}, {"id": "2104.13983", "submitter": "Prasanna Date", "authors": "Prasanna Date, Catherine Schuman, Bill Kay, Thomas Potok", "title": "Neuromorphic Computing is Turing-Complete", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CC cs.CL cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neuromorphic computing is a non-von Neumann computing paradigm that performs\ncomputation by emulating the human brain. Neuromorphic systems are extremely\nenergy-efficient and known to consume thousands of times less power than CPUs\nand GPUs. They have the potential to drive critical use cases such as\nautonomous vehicles, edge computing and internet of things in the future. For\nthis reason, they are sought to be an indispensable part of the future\ncomputing landscape. Neuromorphic systems are mainly used for spike-based\nmachine learning applications, although there are some non-machine learning\napplications in graph theory, differential equations, and spike-based\nsimulations. These applications suggest that neuromorphic computing might be\ncapable of general-purpose computing. However, general-purpose computability of\nneuromorphic computing has not been established yet. In this work, we prove\nthat neuromorphic computing is Turing-complete and therefore capable of\ngeneral-purpose computing. Specifically, we present a model of neuromorphic\ncomputing, with just two neuron parameters (threshold and leak), and two\nsynaptic parameters (weight and delay). We devise neuromorphic circuits for\ncomputing all the {\\mu}-recursive functions (i.e., constant, successor and\nprojection functions) and all the {\\mu}-recursive operators (i.e., composition,\nprimitive recursion and minimization operators). Given that the {\\mu}-recursive\nfunctions and operators are precisely the ones that can be computed using a\nTuring machine, this work establishes the Turing-completeness of neuromorphic\ncomputing.\n", "versions": [{"version": "v1", "created": "Wed, 28 Apr 2021 19:25:01 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Date", "Prasanna", ""], ["Schuman", "Catherine", ""], ["Kay", "Bill", ""], ["Potok", "Thomas", ""]]}, {"id": "2104.14171", "submitter": "Laurent Bulteau", "authors": "Laurent Bulteau, Michael R. Fellows, Christian Komusiewicz, Frances\n  Rosamond", "title": "Parameterized String Equations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study systems of String Equations where block variables need to be\nassigned strings so that their concatenation gives a specified target string.\nWe investigate this problem under a multivariate complexity framework,\nsearching for tractable special cases such as systems of equations with few\nblock variables or few equations. Our main results include a polynomial-time\nalgorithm for size-2 equations, and hardness for size-3 equations, as well as\nhardness for systems of two equations, even with tight constraints on the block\nvariables. We also study a variant where few deletions are allowed in the\ntarget string, and give XP algorithms in this setting when the number of block\nvariables is constant.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 07:56:41 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Bulteau", "Laurent", ""], ["Fellows", "Michael R.", ""], ["Komusiewicz", "Christian", ""], ["Rosamond", "Frances", ""]]}, {"id": "2104.14316", "submitter": "Reiner Czerwinski", "authors": "Reiner Czerwinski", "title": "Separation of PSPACE and EXP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This article shows that PSPACE not equal EXP. A simple but novel proof\ntechnique has been used to separate these two classes. Whether an arbitrary\nTuring machine accepts an input when the running time is limited has been\ncomputed in this paper. Then, the limit goes to infinity. Thus, methods of the\nrecursion theory can be applied to problems of computational complexity theory\nwithout violating the relativization barrier.\n", "versions": [{"version": "v1", "created": "Wed, 28 Apr 2021 07:49:53 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Czerwinski", "Reiner", ""]]}, {"id": "2104.14384", "submitter": "JevgÄ\u0093nijs Vihrovs", "authors": "Adam Glos, Martins Kokainis, Ryuhei Mori, Jevg\\=enijs Vihrovs", "title": "Quantum speedups for dynamic programming on $n$-dimensional lattice\n  graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the quantum speedup for dynamic programming on the Boolean\nhypercube by Ambainis et al. (2019), we investigate which graphs admit a\nsimilar quantum advantage. In this paper, we examine a generalization of the\nBoolean hypercube graph, the $n$-dimensional lattice graph $Q(D,n)$ with\nvertices in $\\{0,1,\\ldots,D\\}^n$. We study the complexity of the following\nproblem: given a subgraph $G$ of $Q(D,n)$ via query access to the edges,\ndetermine whether there is a path from $0^n$ to $D^n$. While the classical\nquery complexity is $\\widetilde{\\Theta}((D+1)^n)$, we show a quantum algorithm\nwith complexity $\\widetilde O(T_D^n)$, where $T_D < D+1$. The first few values\nof $T_D$ are $T_1 \\approx 1.817$, $T_2 \\approx 2.660$, $T_3 \\approx 3.529$,\n$T_4 \\approx 4.421$, $T_5 \\approx 5.332$. We also prove that $T_D \\geq\n\\frac{D+1}{\\mathrm e}$, thus for general $D$, this algorithm does not provide,\nfor example, a speedup, polynomial in the size of the lattice.\n  While the presented quantum algorithm is a natural generalization of the\nknown quantum algorithm for $D=1$ by Ambainis et al., the analysis of\ncomplexity is rather complicated. For the precise analysis, we use the\nsaddle-point method, which is a common tool in analytic combinatorics, but has\nnot been widely used in this field.\n  We then show an implementation of this algorithm with time complexity\n$\\text{poly}(n)^{\\log n} T_D^n$, and apply it to the Set Multicover problem. In\nthis problem, $m$ subsets of $[n]$ are given, and the task is to find the\nsmallest number of these subsets that cover each element of $[n]$ at least $D$\ntimes. While the time complexity of the best known classical algorithm is\n$O(m(D+1)^n)$, the time complexity of our quantum algorithm is\n$\\text{poly}(m,n)^{\\log n} T_D^n$.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 14:50:03 GMT"}, {"version": "v2", "created": "Fri, 7 May 2021 16:13:43 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Glos", "Adam", ""], ["Kokainis", "Martins", ""], ["Mori", "Ryuhei", ""], ["Vihrovs", "Jevgēnijs", ""]]}, {"id": "2104.14395", "submitter": "Ana Silva", "authors": "Celina M. H. de Figueiredo and Alexsander A. de Melo and Diana Sasaki\n  and Ana Silva", "title": "Revising Johnson's table for the 21st century", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.CO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  What does it mean today to study a problem from a computational point of\nview? We focus on parameterized complexity and on Column 16 \"Graph Restrictions\nand Their Effect\" of D. S. Johnson's Ongoing guide, where several puzzles were\nproposed in a summary table with 30 graph classes as rows and 11 problems as\ncolumns. Several of the 330 entries remain unclassified into Polynomial or\nNP-complete after 35 years. We provide a full dichotomy for the Steiner Tree\ncolumn by proving that the problem is NP-complete when restricted to Undirected\nPath graphs. We revise Johnson's summary table according to the granularity\nprovided by the parameterized complexity for NP-complete problems.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 15:10:48 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["de Figueiredo", "Celina M. H.", ""], ["de Melo", "Alexsander A.", ""], ["Sasaki", "Diana", ""], ["Silva", "Ana", ""]]}, {"id": "2104.14415", "submitter": "Daniele Mundici", "authors": "Daniele Mundici", "title": "Polytime reductions of AF-algebraic problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.FA math.OA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We assess the computational complexity of several decision problems\nconcerning (Murray-von Neumann) equivalence classes of projections of\nAF-algebras whose Elliott classifier is lattice-ordered. We construct polytime\nreductions among many of these problems.\n", "versions": [{"version": "v1", "created": "Wed, 28 Apr 2021 07:23:13 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Mundici", "Daniele", ""]]}, {"id": "2104.14436", "submitter": "Ashwin Nayak", "authors": "Ashwin Nayak", "title": "Deterministic Algorithms for the Hidden Subgroup Problem", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC quant-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this note, we present deterministic algorithms for the Hidden Subgroup\nProblem. The algorithm for abelian groups achieves the same asymptotic query\ncomplexity as the optimal randomized algorithm. The algorithm for non-abelian\ngroups comes within a polylogarithmic factor of the optimal randomized query\ncomplexity.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 15:55:15 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Nayak", "Ashwin", ""]]}, {"id": "2104.14596", "submitter": "Marc Roth", "authors": "Norbert Peyerimhoff and Marc Roth and Johannes Schmitt and Jakob Stix\n  and Alina Vdovina", "title": "Parameterized (Modular) Counting and Cayley Graph Expanders", "comments": "49 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": "MPIM-Bonn-2021", "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem $\\#\\mathrm{EdgeSub}(\\Phi)$ of counting $k$-edge\nsubgraphs satisfying a given graph property $\\Phi$ in a large host graph $G$.\nBuilding upon the breakthrough result of Curticapean, Dell and Marx (STOC 17),\nwe express the number of such subgraphs as a finite linear combination of graph\nhomomorphism counts and derive the complexity of computing this number by\nstudying its coefficients.\n  Our approach relies on novel constructions of low-degree Cayley graph\nexpanders of $p$-groups, which might be of independent interest. The properties\nof those expanders allow us to analyse the coefficients in the aforementioned\nlinear combinations over the field $\\mathbb{F}_p$ which gives us significantly\nmore control over the cancellation behaviour of the coefficients. Our main\nresult is an exhaustive and fine-grained complexity classification of\n$\\#\\mathrm{EdgeSub}(\\Phi)$ for minor-closed properties $\\Phi$, closing the\nmissing gap in previous work by Roth, Schmitt and Wellnitz (ICALP 21).\n  Additionally, we observe that our methods also apply to modular counting.\nAmong others, we investigate the problems of modular counting of paths, cycles,\nforests and matroid bases. In the course of our investigations we also provide\nan exhaustive parameterized complexity classification for the problem of\ncounting graph homomorphisms modulo a prime $p$.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 18:31:37 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Peyerimhoff", "Norbert", ""], ["Roth", "Marc", ""], ["Schmitt", "Johannes", ""], ["Stix", "Jakob", ""], ["Vdovina", "Alina", ""]]}, {"id": "2104.14647", "submitter": "Adrian de Wynter", "authors": "Adrian de Wynter", "title": "Turing Completeness and Sid Meier's Civilization", "comments": "Preprint", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.AI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We prove that three strategy video games from the Sid Meier's Civilization\nseries: Sid Meier's Civilization: Beyond Earth, Sid Meier's Civilization V, and\nSid Meier's Civilization VI, are Turing complete. We achieve this by building\nthree universal Turing machines-one for each game-using only the elements\npresent in the games, and using their internal rules and mechanics as the\ntransition function. The existence of such machines imply that under the\nassumptions made, the games are undecidable. We show constructions of these\nmachines within a running game session, and we provide a sample execution of an\nalgorithm-the three-state Busy Beaver-with one of our machines.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 20:48:58 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["de Wynter", "Adrian", ""]]}, {"id": "2104.14818", "submitter": "Philippe Blaettchen", "authors": "Philippe Blaettchen, Andre P. Calmon, Georgina Hall", "title": "Traceability Technology Adoption in Supply Chain Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CC cs.DS", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Modern traceability technologies promise to improve supply chain management\nby simplifying recalls, increasing demand visibility, or ascertaining\nsustainable supplier practices. Managers in the traceability initiatives\ndeveloping such technologies face a difficult question: which companies should\nthey target as early adopters to ensure that their technology is broadly\nemployed? To answer this question, managers must consider that supply chains\nare interlinked in complex networks and that a supply chain effect is inherent\nto traceability technologies. More specifically, the benefits obtained from\ntraceability are conditional on technology adoption throughout a product's\nsupply chain.\n  We introduce a model of the dynamics of traceability technology adoption in\nsupply chain networks to tackle the problem of selecting the smallest set of\nearly adopters guaranteeing broad dissemination. Our model builds on extant\ndiffusion models while incorporating that a firm's adoption decision depends on\nprevious adoption decisions throughout its supply chains. We show that the\nproblem is NP-hard and that no approximation within a polylogarithmic factor\ncan be guaranteed for any polynomial-time algorithm. Nevertheless, we introduce\nan algorithm that identifies an exact solution in polynomial time under certain\nassumptions on the network structure and provide evidence that it is tractable\nfor real-world supply chain networks. We further propose a random generative\nmodel that outputs networks consistent with real-world supply chain networks.\nThe networks obtained display, whp, structures that allow us to find the\noptimal seed set in subexponential time using our algorithm. Our generative\nmodel also provides approximate seed sets when information on the network is\nlimited.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2021 08:05:21 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Blaettchen", "Philippe", ""], ["Calmon", "Andre P.", ""], ["Hall", "Georgina", ""]]}, {"id": "2104.15075", "submitter": "Jiehua Chen", "authors": "Jiehua Chen, Martin Lackner, Jan Maly", "title": "Participatory Budgeting with Donations and Diversity Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.CC cs.DS cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Participatory budgeting (PB) is a democratic process where citizens jointly\ndecide on how to allocate public funds to indivisible projects. This paper\nfocuses on PB processes where citizens may give additional money to projects\nthey want to see funded. We introduce a formal framework for this kind of PB\nwith donations. Our framework also allows for diversity constraints, meaning\nthat each project belongs to one or more types, and there are lower and upper\nbounds on the number of projects of the same type that can be funded. We\npropose three general classes of methods for aggregating the citizens'\npreferences in the presence of donations and analyze their axiomatic\nproperties. Furthermore, we investigate the computational complexity of\ndetermining the outcome of a PB process with donations and of finding a\ncitizen's optimal donation strategy.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2021 15:48:25 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Chen", "Jiehua", ""], ["Lackner", "Martin", ""], ["Maly", "Jan", ""]]}]