[{"id": "0801.0195", "submitter": "Masahiko Egami", "authors": "Masahiko Egami, Hideki Iwaki", "title": "An optimal life insurance policy in the investment-consumption problem\n  in an incomplete market", "comments": "This paper has been withdrawn by the authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC", "license": null, "abstract": "  This paper considers an optimal life insurance for a householder subject to\nmortality risk. The household receives a wage income continuously, which is\nterminated by unexpected (premature) loss of earning power or (planned and\nintended) retirement, whichever happens first. In order to hedge the risk of\nlosing income stream by householder's unpredictable event, the household enters\na life insurance contract by paying a premium to an insurance company. The\nhousehold may also invest their wealth into a financial market. The problem is\nto determine an optimal insurance/investment/consumption strategy in order to\nmaximize the expected total, discounted utility from consumption and terminal\nwealth. To reflect a real-life situation better, we consider an incomplete\nmarket where the householder cannot trade insurance contracts continuously. To\nour best knowledge, such a model is new in the insurance and finance\nliterature. The case of exponential utilities is considered in detail to derive\nan explicit solution. We also provide numerical experiments for that particular\ncase to illustrate our results.\n", "versions": [{"version": "v1", "created": "Mon, 31 Dec 2007 09:32:32 GMT"}, {"version": "v2", "created": "Mon, 2 May 2011 08:42:36 GMT"}], "update_date": "2011-05-03", "authors_parsed": [["Egami", "Masahiko", ""], ["Iwaki", "Hideki", ""]]}, {"id": "0801.3560", "submitter": "Fei Ren", "authors": "F. Ren and Y.-C. Zhang", "title": "Trading Model with Pair Pattern Strategies", "comments": "22 pages, 16 figures", "journal-ref": "Physica A 387 (2008), 5523-5534", "doi": "10.1016/j.physa.2008.06.027", "report-no": null, "categories": "q-fin.PM physics.soc-ph", "license": null, "abstract": "  A simple trading model based on pair pattern strategy space with holding\nperiods is proposed. Power-law behaviors are observed for the return variance\n$\\sigma^2$, the price impact $H$ and the predictability $K$ for both models\nwith linear and square root impact functions. The sum of the traders' wealth\ndisplays a positive value for the model with square root price impact function,\nand a qualitative explanation is given based on the observation of the\nconditional excess demand $<A|u>$. An evolutionary trading model is further\nproposed, and the elimination mechanism effectively changes the behavior of the\ntraders highly performed in the model without evolution. The trading model with\nother types of traders, e.g., traders with the MG's strategies and producers,\nare also carefully studied.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2008 12:16:52 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Ren", "F.", ""], ["Zhang", "Y. -C.", ""]]}, {"id": "0801.4305", "submitter": "Frank Schweitzer", "authors": "J. Emeterio Navarro Barrientos, Frank E. Walter, Frank Schweitzer", "title": "Risk-Seeking versus Risk-Avoiding Investments in Noisy Periodic\n  Environments", "comments": "27 pp. v2 with minor corrections. See http://www.sg.ethz.ch for more\n  info", "journal-ref": "International Journal of Modern Physics C vol. 19, no. 6 (2008)\n  971-994", "doi": "10.1142/S0129183108012662", "report-no": null, "categories": "q-fin.PM cs.CE physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the performance of various agent strategies in an artificial\ninvestment scenario. Agents are equipped with a budget, $x(t)$, and at each\ntime step invest a particular fraction, $q(t)$, of their budget. The return on\ninvestment (RoI), $r(t)$, is characterized by a periodic function with\ndifferent types and levels of noise. Risk-avoiding agents choose their fraction\n$q(t)$ proportional to the expected positive RoI, while risk-seeking agents\nalways choose a maximum value $q_{max}$ if they predict the RoI to be positive\n(\"everything on red\"). In addition to these different strategies, agents have\ndifferent capabilities to predict the future $r(t)$, dependent on their\ninternal complexity. Here, we compare 'zero-intelligent' agents using technical\nanalysis (such as moving least squares) with agents using reinforcement\nlearning or genetic algorithms to predict $r(t)$. The performance of agents is\nmeasured by their average budget growth after a certain number of time steps.\nWe present results of extensive computer simulations, which show that, for our\ngiven artificial environment, (i) the risk-seeking strategy outperforms the\nrisk-avoiding one, and (ii) the genetic algorithm was able to find this optimal\nstrategy itself, and thus outperforms other prediction approaches considered.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2008 15:09:58 GMT"}, {"version": "v2", "created": "Sun, 7 Sep 2008 13:48:45 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Barrientos", "J. Emeterio Navarro", ""], ["Walter", "Frank E.", ""], ["Schweitzer", "Frank", ""]]}, {"id": "0801.4941", "submitter": "Wing Yan Yip", "authors": "Wing Yan Yip, Sofia Olhede, David Stephens", "title": "Hedging strategies and minimal variance portfolios for European and\n  exotic options in a Levy market", "comments": "32 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents hedging strategies for European and exotic options in a\nLevy market. By applying Taylor's Theorem, dynamic hedging portfolios are con-\nstructed under different market assumptions, such as the existence of power\njump assets or moment swaps. In the case of European options or baskets of\nEuropean options, static hedging is implemented. It is shown that perfect\nhedging can be achieved. Delta and gamma hedging strategies are extended to\nhigher moment hedging by investing in other traded derivatives depending on the\nsame underlying asset. This development is of practical importance as such\nother derivatives might be readily available. Moment swaps or power jump assets\nare not typically liquidly traded. It is shown how minimal variance portfolios\ncan be used to hedge the higher order terms in a Taylor expansion of the\npricing function, investing only in a risk-free bank account, the underlying\nasset and potentially variance swaps. The numerical algorithms and performance\nof the hedging strategies are presented, showing the practical utility of the\nderived results.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2008 20:24:42 GMT"}, {"version": "v2", "created": "Mon, 5 May 2008 16:06:53 GMT"}, {"version": "v3", "created": "Mon, 5 May 2008 23:32:37 GMT"}, {"version": "v4", "created": "Sat, 18 Oct 2008 10:51:41 GMT"}], "update_date": "2008-12-10", "authors_parsed": [["Yip", "Wing Yan", ""], ["Olhede", "Sofia", ""], ["Stephens", "David", ""]]}]