[{"id": "0904.0870", "submitter": "Sovan Mitra", "authors": "Sovan Mitra", "title": "Risk Measures in Quantitative Finance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper was presented and written for two seminars: a national UK\nUniversity Risk Conference and a Risk Management industry workshop. The target\naudience is therefore a cross section of Academics and industry professionals.\n  The current ongoing global credit crunch has highlighted the importance of\nrisk measurement in Finance to companies and regulators alike. Despite risk\nmeasurement's central importance to risk management, few papers exist reviewing\nthem or following their evolution from its foremost beginnings up to the\npresent day risk measures.\n  This paper reviews the most important portfolio risk measures in Financial\nMathematics, from Bernoulli (1738) to Markowitz's Portfolio Theory, to the\npresently preferred risk measures such as CVaR (conditional Value at Risk). We\nprovide a chronological review of the risk measures and survey less commonly\nknown risk measures e.g. Treynor ratio.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2009 09:20:23 GMT"}], "update_date": "2009-04-07", "authors_parsed": [["Mitra", "Sovan", ""]]}, {"id": "0904.1131", "submitter": "Sovan Mitra", "authors": "Sovan Mitra", "title": "Optimisation of Stochastic Programming by Hidden Markov Modelling based\n  Scenario Generation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper formed part of a preliminary research report for a risk\nconsultancy and academic research. Stochastic Programming models provide a\npowerful paradigm for decision making under uncertainty. In these models the\nuncertainties are represented by a discrete scenario tree and the quality of\nthe solutions obtained is governed by the quality of the scenarios generated.\nWe propose a new technique to generate scenarios based on Gaussian Mixture\nHidden Markov Modelling. We show that our approach explicitly captures\nimportant time varying dynamics of stochastic processes (such as autoregression\nand jumps) as well as non-Gaussian distribution characteristics (such as\nskewness and kurtosis). Our scenario generation method enables richer\nrobustness and scenario analysis through exploiting the tractable properties of\nMarkov models and Gaussian mixture distributions. We demonstrate the benefits\nof our scenario generation method by conducting numerical experiments on\nFTSE-100 data.\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2009 13:36:30 GMT"}], "update_date": "2009-04-08", "authors_parsed": [["Mitra", "Sovan", ""]]}, {"id": "0904.1903", "submitter": "Constantinos Kardaras", "authors": "Constantinos Kardaras, Eckhard Platen", "title": "Minimizing the expected market time to reach a certain wealth level", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a financial market model, we consider variations of the problem of\nminimizing the expected time to upcross a certain wealth level. For exponential\nLevy markets, we show the asymptotic optimality of the growth-optimal portfolio\nfor the above problem and obtain tight bounds for the value function for any\nwealth level. In an Ito market, we employ the concept of market time, which is\na clock that runs according to the underlying market growth. We show the\noptimality of the growth-optimal portfolio for minimizing the expected market\ntime to reach any wealth level. This reveals a general definition of market\ntime which can be useful from an investor's point of view. We utilize this last\ndefinition to extend the previous results in a general semimartingale setting.\n", "versions": [{"version": "v1", "created": "Mon, 13 Apr 2009 04:09:18 GMT"}], "update_date": "2009-04-14", "authors_parsed": [["Kardaras", "Constantinos", ""], ["Platen", "Eckhard", ""]]}, {"id": "0904.4620", "submitter": "Josep J. Masdemont", "authors": "Josep J. Masdemont, Luis Ortiz-Gracia", "title": "Haar Wavelets-Based Approach for Quantifying Credit Portfolio Losses", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new methodology to compute Value at Risk (VaR) for\nquantifying losses in credit portfolios. We approximate the cumulative\ndistribution of the loss function by a finite combination of Haar wavelets\nbasis functions and calculate the coefficients of the approximation by\ninverting its Laplace transform. In fact, we demonstrate that only a few\ncoefficients of the approximation are needed, so VaR can be reached quickly. To\ntest the methodology we consider the Vasicek one-factor portfolio credit loss\nmodel as our model framework. The Haar wavelets method is fast, accurate and\nrobust to deal with small or concentrated portfolios, when the hypothesis of\nthe Basel II formulas are violated.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2009 14:22:30 GMT"}], "update_date": "2009-04-30", "authors_parsed": [["Masdemont", "Josep J.", ""], ["Ortiz-Gracia", "Luis", ""]]}]