[{"id": "1003.2521", "submitter": "Sebastien Lleo", "authors": "Mark Davis and Sebastien Lleo", "title": "Risk Sensitive Investment Management with Affine Processes: a Viscosity\n  Approach", "comments": "32 pages", "journal-ref": "in \"Recent Advances in Financial Engineering 2009 - Proceedings of\n  the KIER-TMU International Workshop on Financial Engineering 2009.\" M.\n  Kijima, C. Hara and K. Tanaka editors. World Scientific Publishing Co. 2010.", "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we extend the jump-diffusion model proposed by Davis and Lleo\nto include jumps in asset prices as well as valuation factors. The criterion,\nfollowing earlier work by Bielecki, Pliska, Nagai and others, is risk-sensitive\noptimization (equivalent to maximizing the expected growth rate subject to a\nconstraint on variance.) In this setting, the Hamilton- Jacobi-Bellman equation\nis a partial integro-differential PDE. The main result of the paper is to show\nthat the value function of the control problem is the unique viscosity solution\nof the Hamilton-Jacobi-Bellman equation.\n", "versions": [{"version": "v1", "created": "Fri, 12 Mar 2010 11:31:46 GMT"}], "update_date": "2010-03-15", "authors_parsed": [["Davis", "Mark", ""], ["Lleo", "Sebastien", ""]]}, {"id": "1003.2930", "submitter": "Qingshuo Song", "authors": "Qingshuo Song, G. Yin, Chao Zhu", "title": "Utility Maximization of an Indivisible Market with Transaction Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work takes up the challenges of utility maximization problem when the\nmarket is indivisible and the transaction costs are included. First there is a\nso-called solvency region given by the minimum margin requirement in the\nproblem formulation. Then the associated utility maximization is formulated as\nan optimal switching problem. The diffusion turns out to be degenerate and the\nboundary of domain is an unbounded set. One no longer has the continuity of the\nvalue function without posing further conditions due to the degeneracy and the\ndependence of the random terminal time on the initial data. This paper provides\nsufficient conditions under which the continuity of the value function is\nobtained. The essence of our approach is to find a sequence of continuous\nfunctions locally uniformly converging to the desired value function. Thanks to\ncontinuity, the value function can be characterized by using the notion of\nviscosity solution of certain quasi-variational inequality.\n", "versions": [{"version": "v1", "created": "Mon, 15 Mar 2010 14:43:11 GMT"}], "update_date": "2010-03-16", "authors_parsed": [["Song", "Qingshuo", ""], ["Yin", "G.", ""], ["Zhu", "Chao", ""]]}, {"id": "1003.3582", "submitter": "Marcel Nutz", "authors": "Marcel Nutz", "title": "Risk Aversion Asymptotics for Power Utility Maximization", "comments": "45 pages", "journal-ref": "Probability Theory and Related Fields, Vol. 152, No. 3-4, pp.\n  703-749, 2012", "doi": "10.1007/s00440-010-0334-3", "report-no": null, "categories": "q-fin.PM math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the economic problem of optimal consumption and investment with\npower utility. We study the optimal strategy as the relative risk aversion\ntends to infinity or to one. The convergence of the optimal consumption is\nobtained for general semimartingale models while the convergence of the optimal\ntrading strategy is obtained for continuous models. The limits are related to\nexponential and logarithmic utility. To derive these results, we combine\napproaches from optimal control, convex analysis and backward stochastic\ndifferential equations (BSDEs).\n", "versions": [{"version": "v1", "created": "Thu, 18 Mar 2010 14:07:47 GMT"}], "update_date": "2012-08-13", "authors_parsed": [["Nutz", "Marcel", ""]]}, {"id": "1003.4216", "submitter": "Xueying Hu", "authors": "Erhan Bayraktar, Xueying Hu, Virginia R. Young", "title": "Minimizing the Probability of Lifetime Ruin under Stochastic Volatility", "comments": "Keywords: Optimal investment, minimizing the probability of lifetime\n  ruin, stochastic volatility", "journal-ref": null, "doi": "10.1016/j.insmatheco.2011.04.001", "report-no": null, "categories": "q-fin.PM cs.SY math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We assume that an individual invests in a financial market with one riskless\nand one risky asset, with the latter's price following a diffusion with\nstochastic volatility. In the current financial market especially, it is\nimportant to include stochastic volatility in the risky asset's price process.\nGiven the rate of consumption, we find the optimal investment strategy for the\nindividual who wishes to minimize the probability of going bankrupt. To solve\nthis minimization problem, we use techniques from stochastic optimal control.\n", "versions": [{"version": "v1", "created": "Fri, 19 Mar 2010 01:45:32 GMT"}, {"version": "v2", "created": "Thu, 5 May 2011 14:34:45 GMT"}], "update_date": "2011-05-06", "authors_parsed": [["Bayraktar", "Erhan", ""], ["Hu", "Xueying", ""], ["Young", "Virginia R.", ""]]}, {"id": "1003.6002", "submitter": "Thomas Lim", "authors": "Thomas Lim (ENSIIE, D\\'epartement de math\\'ematiques), Marie-Claire\n  Quenez (LPMA)", "title": "Portfolio optimization in a default model under full/partial information", "comments": null, "journal-ref": "Prob. Eng. Inf. Sci. 29 (2015) 565-587", "doi": "10.1017/S0269964815000194", "report-no": null, "categories": "q-fin.PM math.OC q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a financial market with assets exposed to some\nrisks inducing jumps in the asset prices, and which can still be traded after\ndefault times. We use a default-intensity modeling approach, and address in\nthis incomplete market context the problem of maximization of expected utility\nfrom terminal wealth for logarithmic, power and exponential utility functions.\nWe study this problem as a stochastic control problem both under full and\npartial information. Our contribution consists in showing that the optimal\nstrategy can be obtained by a direct approach for the logarithmic utility\nfunction, and the value function for the power utility function can be\ndetermined as the minimal solution of a backward stochastic differential\nequation. For the partial information case, we show how the problem can be\ndivided into two problems: a filtering problem and an optimization problem. We\nalso study the indifference pricing approach to evaluate the price of a\ncontingent claim in an incomplete market and the information price for an agent\nwith insider information.\n", "versions": [{"version": "v1", "created": "Wed, 31 Mar 2010 09:43:51 GMT"}, {"version": "v2", "created": "Thu, 21 Nov 2013 19:13:27 GMT"}], "update_date": "2015-10-21", "authors_parsed": [["Lim", "Thomas", "", "ENSIIE, Département de mathématiques"], ["Quenez", "Marie-Claire", "", "LPMA"]]}]