[{"id": "1011.3246", "submitter": "Teemu Pennanen", "authors": "Matti Koivu and Teemu Pennanen", "title": "Reduced form models of bond portfolios", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive simple return models for several classes of bond portfolios. With\nonly one or two risk factors our models are able to explain most of the return\nvariations in portfolios of fixed rate government bonds, inflation linked\ngovernment bonds and investment grade corporate bonds. The underlying risk\nfactors have natural interpretations which make the models well suited for risk\nmanagement and portfolio design.\n", "versions": [{"version": "v1", "created": "Sun, 14 Nov 2010 18:43:59 GMT"}], "update_date": "2010-11-16", "authors_parsed": [["Koivu", "Matti", ""], ["Pennanen", "Teemu", ""]]}, {"id": "1011.4499", "submitter": "Gechun  Liang", "authors": "G. Liang, T. Lyons, Z. Qian", "title": "A Functional Approach to FBSDEs and Its Application in Optimal\n  Portfolios", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Liang et al (2009), the current authors demonstrated that BSDEs can be\nreformulated as functional differential equations, and as an application, they\nsolved BSDEs on general filtered probability spaces. In this paper the authors\ncontinue the study of functional differential equations and demonstrate how\nsuch approach can be used to solve FBSDEs. By this approach the equations can\nbe solved in one direction altogether rather than in a forward and backward\nway. The solutions of FBSDEs are then employed to construct the weak solutions\nto a class of BSDE systems (not necessarily scalar) with quadratic growth, by a\nnonlinear version of Girsanov's transformation. As the solving procedure is\nconstructive, the authors not only obtain the existence and uniqueness theorem,\nbut also really work out the solutions to such class of BSDE systems with\nquadratic growth. Finally an optimal portfolio problem in incomplete markets is\nsolved based on the functional differential equation approach and the nonlinear\nGirsanov's transformation.\n", "versions": [{"version": "v1", "created": "Fri, 19 Nov 2010 19:05:50 GMT"}], "update_date": "2010-11-22", "authors_parsed": [["Liang", "G.", ""], ["Lyons", "T.", ""], ["Qian", "Z.", ""]]}, {"id": "1011.4991", "submitter": "Tiantian Li", "authors": "Jun Ye, Tiantian Li", "title": "Optimal mean-variance investment strategy under value-at-risk\n  constraints", "comments": "20 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is devoted to study the effects arising from imposing a\nvalue-at-risk (VaR) constraint in mean-variance portfolio selection problem for\nan investor who receives a stochastic cash flow which he/she must then invest\nin a continuous-time financial market. For simplicity, we assume that there is\nonly one investment opportunity available for the investor, a risky stock.\nUsing techniques of stochastic linear-quadratic (LQ) control, the optimal\nmean-variance investment strategy with and without VaR constraint are derived\nexplicitly in closed forms, based on solution of corresponding\nHamilton-Jacobi-Bellman (HJB) equation. Furthermore, some numerical examples\nare proposed to show how the addition of the VaR constraint affects the optimal\nstrategy.\n", "versions": [{"version": "v1", "created": "Tue, 23 Nov 2010 02:44:17 GMT"}], "update_date": "2010-11-24", "authors_parsed": [["Ye", "Jun", ""], ["Li", "Tiantian", ""]]}, {"id": "1011.6097", "submitter": "Tristan Fletcher", "authors": "Tristan Fletcher, Zakria Hussain and John Shawe-Taylor", "title": "Currency Forecasting using Multiple Kernel Learning with Financially\n  Motivated Features", "comments": "To be presented at NIPS 2010 workshop: New Directions in Multiple\n  Kernel Learning", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple Kernel Learning (MKL) is used to replicate the signal combination\nprocess that trading rules embody when they aggregate multiple sources of\nfinancial information when predicting an asset's price movements. A set of\nfinancially motivated kernels is constructed for the EURUSD currency pair and\nis used to predict the direction of price movement for the currency over\nmultiple time horizons. MKL is shown to outperform each of the kernels\nindividually in terms of predictive accuracy. Furthermore, the kernel\nweightings selected by MKL highlights which of the financial features\nrepresented by the kernels are the most informative for predictive tasks.\n", "versions": [{"version": "v1", "created": "Sun, 28 Nov 2010 22:23:18 GMT"}], "update_date": "2010-11-30", "authors_parsed": [["Fletcher", "Tristan", ""], ["Hussain", "Zakria", ""], ["Shawe-Taylor", "John", ""]]}]