[{"id": "1102.0346", "submitter": "Kasper Larsen", "authors": "Kasper Larsen, Gordan \\v{Z}itkovi\\'c", "title": "On utility maximization under convex portfolio constraints", "comments": "Published in at http://dx.doi.org/10.1214/12-AAP850 the Annals of\n  Applied Probability (http://www.imstat.org/aap/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Probability 2013, Vol. 23, No. 2, 665-692", "doi": "10.1214/12-AAP850", "report-no": "IMS-AAP-AAP850", "categories": "q-fin.PM math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a utility-maximization problem in a general semimartingale\nfinancial model, subject to constraints on the number of shares held in each\nrisky asset. These constraints are modeled by predictable convex-set-valued\nprocesses whose values do not necessarily contain the origin; that is, it may\nbe inadmissible for an investor to hold no risky investment at all. Such a\nsetup subsumes the classical constrained utility-maximization problem, as well\nas the problem where illiquid assets or a random endowment are present. Our\nmain result establishes the existence of optimal trading strategies in such\nmodels under no smoothness requirements on the utility function. The result\nalso shows that, up to attainment, the dual optimization problem can be posed\nover a set of countably-additive probability measures, thus eschewing the need\nfor the usual finitely-additive enlargement.\n", "versions": [{"version": "v1", "created": "Wed, 2 Feb 2011 02:22:26 GMT"}, {"version": "v2", "created": "Wed, 21 Mar 2012 02:31:58 GMT"}, {"version": "v3", "created": "Fri, 22 Feb 2013 11:27:14 GMT"}], "update_date": "2013-02-25", "authors_parsed": [["Larsen", "Kasper", ""], ["Žitković", "Gordan", ""]]}, {"id": "1102.0938", "submitter": "Ola Mahmoud", "authors": "Lisa R. Goldberg, Michael Y. Hayes, Ola Mahmoud", "title": "Minimizing Shortfall", "comments": null, "journal-ref": "Quantitative Finance, iFirst, 1-13, 2012", "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes an empirical study of shortfall optimization with Barra\nExtreme Risk. We compare minimum shortfall to minimum variance portfolios in\nthe US, UK, and Japanese equity markets using Barra Style Factors (Value,\nGrowth, Momentum, etc.). We show that minimizing shortfall generally improves\nperformance over minimizing variance, especially during down-markets, over the\nperiod 1985-2010. The outperformance of shortfall is due to intuitive tilts\ntowards protective factors like Value, and away from aggressive factors like\nGrowth and Momentum. The outperformance is largest for the shortfall that\nmeasures overall asymmetry rather than the extreme losses.\n", "versions": [{"version": "v1", "created": "Fri, 4 Feb 2011 15:24:01 GMT"}, {"version": "v2", "created": "Mon, 1 Jul 2013 18:41:56 GMT"}], "update_date": "2013-07-02", "authors_parsed": [["Goldberg", "Lisa R.", ""], ["Hayes", "Michael Y.", ""], ["Mahmoud", "Ola", ""]]}, {"id": "1102.1186", "submitter": "Serguei Pergamenchtchikov", "authors": "Berdjane Belkacem, Serguei Pergamenchtchikov (LMRS)", "title": "Optimal consumption and investment for markets with random coefficients", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an optimal investment and consumption problem for a Black-Scholes\nfinancial market with stochastic coefficients driven by a diffusion process. We\nassume that an agent makes consumption and investment decisions based on CRRA\nutility functions. The dynamical programming approach leads to an investigation\nof the Hamilton Jacobi Bellman (HJB) equation which is a highly non linear\npartial differential equation (PDE) of the second oder. By using the Feynman -\nKac representation we prove uniqueness and smoothness of the solution.\nMoreover, we study the optimal convergence rate of the iterative numerical\nschemes for both the value function and the optimal portfolio. We show, that in\nthis case, the optimal convergence rate is super geometrical, i.e. is more\nrapid than any geometrical one. We apply our results to a stochastic volatility\nfinancial market.\n", "versions": [{"version": "v1", "created": "Sun, 6 Feb 2011 19:21:15 GMT"}, {"version": "v2", "created": "Fri, 9 Dec 2011 13:16:51 GMT"}], "update_date": "2011-12-12", "authors_parsed": [["Belkacem", "Berdjane", "", "LMRS"], ["Pergamenchtchikov", "Serguei", "", "LMRS"]]}, {"id": "1102.2263", "submitter": "Diogo Pinheiro", "authors": "I. Duarte, D. Pinheiro, A.A. Pinto, S.R. Pliska", "title": "Optimal Life Insurance Purchase, Consumption and Investment on a\n  financial market with multi-dimensional diffusive terms", "comments": "10 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an extension to Merton's famous continuous time model of optimal\nconsumption and investment, in the spirit of previous works by Pliska and Ye,\nto allow for a wage earner to have a random lifetime and to use a portion of\nthe income to purchase life insurance in order to provide for his estate, while\ninvesting his savings in a financial market comprised of one risk-free security\nand an arbitrary number of risky securities driven by multi-dimensional\nBrownian motion. We then provide a detailed analysis of the optimal\nconsumption, investment, and insurance purchase strategies for the wage earner\nwhose goal is to maximize the expected utility obtained from his family\nconsumption, from the size of the estate in the event of premature death, and\nfrom the size of the estate at the time of retirement. We use dynamic\nprogramming methods to obtain explicit solutions for the case of discounted\nconstant relative risk aversion utility functions and describe new analytical\nresults which are presented together with the corresponding economic\ninterpretations.\n", "versions": [{"version": "v1", "created": "Fri, 11 Feb 2011 00:17:19 GMT"}], "update_date": "2011-02-14", "authors_parsed": [["Duarte", "I.", ""], ["Pinheiro", "D.", ""], ["Pinto", "A. A.", ""], ["Pliska", "S. R.", ""]]}, {"id": "1102.4722", "submitter": "Ulrich Kirchner", "authors": "Ulrich Kirchner, Caroline Zunckel", "title": "Measuring Portfolio Diversification", "comments": "9 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the market place, diversification reduces risk and provides protection\nagainst extreme events by ensuring that one is not overly exposed to individual\noccurrences. We argue that diversification is best measured by characteristics\nof the combined portfolio of assets and introduce a measure based on the\ninformation entropy of the probability distribution for the final portfolio\nasset value. For Gaussian assets the measure is a logarithmic function of the\nvariance and combining independent Gaussian assets of equal variance adds an\namount to the diversification. The advantages of this measure include that it\nnaturally extends to any type of distribution and that it takes all moments\ninto account. Furthermore, it can be used in cases of undefined weights\n(zero-cost assets) or moments. We present examples which apply this measure to\nderivative overlays.\n", "versions": [{"version": "v1", "created": "Wed, 23 Feb 2011 12:36:55 GMT"}], "update_date": "2011-02-24", "authors_parsed": [["Kirchner", "Ulrich", ""], ["Zunckel", "Caroline", ""]]}, {"id": "1102.5078", "submitter": "Traian Pirvu A", "authors": "Yang Li and Traian A Pirvu", "title": "On Mean-Variance Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the mean variance portfolio management problem. We\nexamine portfolios which contain both primary and derivative securities. The\nchallenge in this context is due to portfolio's nonlinearities. The delta-gamma\napproximation is employed to overcome it. Thus, the optimization problem is\nreduced to a well posed quadratic program. The methodology developed in this\npaper can be also applied to pricing and hedging in incomplete markets.\n", "versions": [{"version": "v1", "created": "Thu, 24 Feb 2011 20:27:00 GMT"}, {"version": "v2", "created": "Fri, 30 Sep 2011 18:17:09 GMT"}, {"version": "v3", "created": "Fri, 4 Nov 2011 20:00:23 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Li", "Yang", ""], ["Pirvu", "Traian A", ""]]}, {"id": "1102.5126", "submitter": "Sebastien Lleo", "authors": "Mark Davis and Sebastien Lleo", "title": "Jump-Diffusion Risk-Sensitive Asset Management II: Jump-Diffusion Factor\n  Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.SY math.OC q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we extend earlier work on the jump-diffusion risk-sensitive\nasset management problem [SIAM J. Fin. Math. (2011) 22-54] by allowing jumps in\nboth the factor process and the asset prices, as well as stochastic volatility\nand investment constraints. In this case, the HJB equation is a partial\nintegro-differential equation (PIDE). By combining viscosity solutions with a\nchange of notation, a policy improvement argument and classical results on\nparabolic PDEs we prove that the HJB PIDE admits a unique smooth solution. A\nverification theorem concludes the resolution of this problem.\n", "versions": [{"version": "v1", "created": "Thu, 24 Feb 2011 23:19:14 GMT"}, {"version": "v2", "created": "Tue, 11 Sep 2012 19:26:17 GMT"}], "update_date": "2012-09-12", "authors_parsed": [["Davis", "Mark", ""], ["Lleo", "Sebastien", ""]]}, {"id": "1102.5665", "submitter": "William Shaw", "authors": "William T. Shaw", "title": "Risk, VaR, CVaR and their associated Portfolio Optimizations when Asset\n  Returns have a Multivariate Student T Distribution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC q-fin.RM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how to reduce the problem of computing VaR and CVaR with Student T\nreturn distributions to evaluation of analytical functions of the moments. This\nallows an analysis of the risk properties of systems to be carefully attributed\nbetween choices of risk function (e.g. VaR vs CVaR); choice of return\ndistribution (power law tail vs Gaussian) and choice of event frequency, for\nrisk assessment. We exploit this to provide a simple method for portfolio\noptimization when the asset returns follow a standard multivariate T\ndistribution. This may be used as a semi-analytical verification tool for more\ngeneral optimizers, and for practical assessment of the impact of fat tails on\nasset allocation for shorter time horizons.\n", "versions": [{"version": "v1", "created": "Mon, 28 Feb 2011 14:10:35 GMT"}], "update_date": "2011-03-01", "authors_parsed": [["Shaw", "William T.", ""]]}]