[{"id": "1310.1444", "submitter": "Ladislav Kristoufek", "authors": "Ladislav Kristoufek", "title": "Can Google Trends search queries contribute to risk diversification?", "comments": "11 pages, 3 figures", "journal-ref": "Scientific Reports 3:2713, 2013", "doi": "10.1038/srep02713", "report-no": null, "categories": "q-fin.PM q-fin.ST", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Portfolio diversification and active risk management are essential parts of\nfinancial analysis which became even more crucial (and questioned) during and\nafter the years of the Global Financial Crisis. We propose a novel approach to\nportfolio diversification using the information of searched items on Google\nTrends. The diversification is based on an idea that popularity of a stock\nmeasured by search queries is correlated with the stock riskiness. We penalize\nthe popular stocks by assigning them lower portfolio weights and we bring\nforward the less popular, or peripheral, stocks to decrease the total riskiness\nof the portfolio. Our results indicate that such strategy dominates both the\nbenchmark index and the uniformly weighted portfolio both in-sample and\nout-of-sample.\n", "versions": [{"version": "v1", "created": "Sat, 5 Oct 2013 05:29:24 GMT"}], "update_date": "2013-10-08", "authors_parsed": [["Kristoufek", "Ladislav", ""]]}, {"id": "1310.2964", "submitter": "Si Chen", "authors": "Si Chen", "title": "Optimistic versus Pessimistic--Optimal Judgemental Bias with Reference\n  Point", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a model of reference-dependent assessment of subjective\nbeliefs in which loss-averse people optimally choose the expectation as the\nreference point to balance the current felicity from the optimistic\nanticipation and the future disappointment from the realisation. The choice of\nover-optimism or over-pessimism depends on the real chance of success and\noptimistic decision makers prefer receiving early information. In the portfolio\nchoice problem, pessimistic investors tend to trade conservatively, however,\nthey might trade aggressively if they are sophisticated enough to recognise the\nbiases since low expectation can reduce their fear of loss.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 21:04:59 GMT"}], "update_date": "2013-10-14", "authors_parsed": [["Chen", "Si", ""]]}, {"id": "1310.2973", "submitter": "Kasper Larsen", "authors": "Jin Hyuk Choi and Kasper Larsen", "title": "Taylor approximation of incomplete Radner equilibrium models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the setting of exponential investors and uncertainty governed by Brownian\nmotions we first prove the existence of an incomplete equilibrium for a general\nclass of models. We then introduce a tractable class of exponential-quadratic\nmodels and prove that the corresponding incomplete equilibrium is characterized\nby a coupled set of Riccati equations. Finally, we prove that these\nexponential-quadratic models can be used to approximate the incomplete models\nwe studied in the first part.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 22:19:49 GMT"}, {"version": "v2", "created": "Mon, 29 Sep 2014 15:08:28 GMT"}], "update_date": "2014-09-30", "authors_parsed": [["Choi", "Jin Hyuk", ""], ["Larsen", "Kasper", ""]]}, {"id": "1310.3396", "submitter": "Raphael Hauser A", "authors": "Thomas Schmelzer and Raphael Hauser", "title": "Seven Sins in Portfolio Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although modern portfolio theory has been in existence for over 60 years,\nfund managers often struggle to get its models to produce reliable portfolio\nallocations without strongly constraining the decision vector by tight bands of\nstrategic allocation targets. The two main root causes to this problem are\ninadequate parameter estimation and numerical artifacts. When both obstacles\nare overcome, portfolio models yield excellent allocations. In this paper,\nwhich is primarily aimed at practitioners, we discuss the most common mistakes\nin setting up portfolio models and in solving them algorithmically.\n", "versions": [{"version": "v1", "created": "Sat, 12 Oct 2013 15:39:45 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Schmelzer", "Thomas", ""], ["Hauser", "Raphael", ""]]}, {"id": "1310.3397", "submitter": "Raphael Hauser A", "authors": "Thomas Schmelzer, Raphael Hauser, Erling Andersen and Joachim Dahl", "title": "Regression techniques for Portfolio Optimisation using MOSEK", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regression is widely used by practioners across many disciplines. We\nreformulate the underlying optimisation problem as a second-order conic program\nproviding the flexibility often needed in applications. Using examples from\nportfolio management and quantitative trading we solve regression problems with\nand without constraints. Several Python code fragments are given. The code and\ndata are available online at http://www.github.com/tschm/MosekRegression.\n", "versions": [{"version": "v1", "created": "Sat, 12 Oct 2013 15:51:48 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Schmelzer", "Thomas", ""], ["Hauser", "Raphael", ""], ["Andersen", "Erling", ""], ["Dahl", "Joachim", ""]]}, {"id": "1310.6822", "submitter": "Yiran Sheng", "authors": "Yiran Sheng, Ruokun Huang", "title": "Optimal Choice under Short Sell Limit with Sharpe Ratio as Criterion\n  among Multiple Assets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is the term paper of the course Investments. We mainly focus on\nmodeling long-term investment decisions of a typical utility-maximizing\nindividual, with features of Chinese stock market in perspective. We adopt an\nOR based methodology with market information as input parameters to carry out\nthe solution. Two main features of this article are: first, we take the no\nshort-sell constraint in Chinese stock market into consideration and use an\napproach otherwise identical to Markowitz to work out the optimal portfolio\nchoice; this method has critical and practical implication to Chinese\ninvestors. Second, we incorporate the benefits of multiple assets into one\nsingle well-defined utility function and use a MIQP procedure to derive the\noptimal allocation of funds upon each of them along the time-line.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2013 05:03:33 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Sheng", "Yiran", ""], ["Huang", "Ruokun", ""]]}]