[{"id": "1311.0498", "submitter": "Konstantinos Spiliopoulos", "authors": "Konstantinos Spiliopoulos, Richard B. Sowers", "title": "Default Clustering in Large Pools: Large Deviations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study large deviations and rare default clustering events in a dynamic\nlarge heterogeneous portfolio of interconnected components. Defaults come as\nPoisson events and the default intensities of the different components in the\nsystem interact through the empirical default rate and via systematic effects\nthat are common to all components. We establish the large deviations principle\nfor the empirical default rate for such an interacting particle system. The\nrate function is derived in an explicit form that is amenable to numerical\ncomputations and derivation of the most likely path to failure for the system\nitself. Numerical studies illustrate the theoretical findings. An understanding\nof the role of the preferred paths to large default rates and the most likely\nways in which contagion and systematic risk combine to lead to large default\nrates would give useful insights into how to optimally safeguard against such\nevents.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2013 17:56:43 GMT"}, {"version": "v2", "created": "Wed, 18 Feb 2015 21:23:51 GMT"}], "update_date": "2015-02-20", "authors_parsed": [["Spiliopoulos", "Konstantinos", ""], ["Sowers", "Richard B.", ""]]}, {"id": "1311.1715", "submitter": "Johannes Muhle-Karbe", "authors": "Ren Liu, Johannes Muhle-Karbe", "title": "Portfolio Choice with Stochastic Investment Opportunities: a User's\n  Guide", "comments": "31 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This survey reviews portfolio choice in settings where investment\nopportunities are stochastic due to, e.g., stochastic volatility or return\npredictability. It is explained how to heuristically compute candidate optimal\nportfolios using tools from stochastic control, and how to rigorously verify\ntheir optimality by means of convex duality. Special emphasis is placed on\nlong-horizon asymptotics, that lead to particularly tractable results.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2013 15:38:49 GMT"}], "update_date": "2013-11-08", "authors_parsed": [["Liu", "Ren", ""], ["Muhle-Karbe", "Johannes", ""]]}, {"id": "1311.1924", "submitter": "Diego Garlaschelli", "authors": "Mel MacMahon, Diego Garlaschelli", "title": "Community detection for correlation matrices", "comments": "Final version, accepted for publication on PRX", "journal-ref": "Physical Review X 5, 021006 (2015)", "doi": "10.1103/PhysRevX.5.021006", "report-no": null, "categories": "physics.data-an physics.soc-ph q-fin.PM q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A challenging problem in the study of complex systems is that of resolving,\nwithout prior information, the emergent, mesoscopic organization determined by\ngroups of units whose dynamical activity is more strongly correlated internally\nthan with the rest of the system. The existing techniques to filter\ncorrelations are not explicitly oriented towards identifying such modules and\ncan suffer from an unavoidable information loss. A promising alternative is\nthat of employing community detection techniques developed in network theory.\nUnfortunately, this approach has focused predominantly on replacing network\ndata with correlation matrices, a procedure that tends to be intrinsically\nbiased due to its inconsistency with the null hypotheses underlying the\nexisting algorithms. Here we introduce, via a consistent redefinition of null\nmodels based on random matrix theory, the appropriate correlation-based\ncounterparts of the most popular community detection techniques. Our methods\ncan filter out both unit-specific noise and system-wide dependencies, and the\nresulting communities are internally correlated and mutually anti-correlated.\nWe also implement multiresolution and multifrequency approaches revealing\nhierarchically nested sub-communities with `hard' cores and `soft' peripheries.\nWe apply our techniques to several financial time series and identify\nmesoscopic groups of stocks which are irreducible to a standard, sectorial\ntaxonomy, detect `soft stocks' that alternate between communities, and discuss\nimplications for portfolio optimization and risk management.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2013 10:29:22 GMT"}, {"version": "v2", "created": "Tue, 15 Apr 2014 12:27:37 GMT"}, {"version": "v3", "created": "Fri, 24 Oct 2014 22:47:02 GMT"}], "update_date": "2015-04-21", "authors_parsed": [["MacMahon", "Mel", ""], ["Garlaschelli", "Diego", ""]]}, {"id": "1311.2511", "submitter": "Mircea Andrecut Dr", "authors": "M. Andrecut", "title": "Spin Glasses and Nonlinear Constraints in Portfolio Optimization", "comments": "10 pages, 4 figures", "journal-ref": null, "doi": "10.1016/j.physleta.2013.12.013", "report-no": null, "categories": "q-fin.PM physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss the portfolio optimization problem with the obligatory deposits\nconstraint. Recently it has been shown that as a consequence of this nonlinear\nconstraint, the solution consists of an exponentially large number of optimal\nportfolios, completely different from each other, and extremely sensitive to\nany changes in the input parameters of the problem, making the concept of\nrational decision making questionable. Here we reformulate the problem using a\nquadratic obligatory deposits constraint, and we show that from the physics\npoint of view, finding an optimal portfolio amounts to calculating the\nmean-field magnetizations of a random Ising model with the constraint of a\nconstant magnetization norm. We show that the model reduces to an eigenproblem,\nwith 2N solutions, where N is the number of assets defining the portfolio.\nAlso, in order to illustrate our results, we present a detailed numerical\nexample of a portfolio of several risky common stocks traded on the Nasdaq\nMarket.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2013 17:45:58 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Andrecut", "M.", ""]]}, {"id": "1311.2550", "submitter": "Mads Nielsen", "authors": "Mads Nielsen", "title": "The Kelly growth optimal strategy with a stop-loss rule", "comments": "13 pages, 4 figures. Submitted to Quantitative Finance 29 May 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  From the Hamilton-Jacobi-Bellman equation for the value function we derive a\nnon-linear partial differential equation for the optimal portfolio strategy\n(the dynamic control). The equation is general in the sense that it does not\ndepend on the terminal utility and provides additional analytical insight for\nsome optimal investment problems with known solutions. Furthermore, when\nboundary conditions for the optimal strategy can be established independently,\nit is considerably simpler than the HJB to solve numerically. Using this method\nwe calculate the Kelly growth optimal strategy subject to a periodically reset\nstop-loss rule.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2013 19:55:39 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2013 16:14:45 GMT"}], "update_date": "2013-11-20", "authors_parsed": [["Nielsen", "Mads", ""]]}, {"id": "1311.3529", "submitter": "Sigrid K\\\"allblad", "authors": "Sigrid Kallblad, Jan Obloj and Thaleia Zariphopoulou", "title": "Time--consistent investment under model uncertainty: the robust forward\n  criteria", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We combine forward investment performance processes and ambiguity averse\nportfolio selection. We introduce the notion of robust forward criteria which\naddresses the issues of ambiguity in model specification and in preferences and\ninvestment horizon specification. It describes the evolution of time-consistent\nambiguity averse preferences.\n  We first focus on establishing dual characterizations of the robust forward\ncriteria. This offers various advantages as the dual problem amounts to a\nsearch for an infimum whereas the primal problem features a saddle-point. Our\napproach is based on ideas developed in Schied (2007) and Zitkovic (2009). We\nthen study in detail non-volatile criteria. In particular, we solve explicitly\nthe example of an investor who starts with a logarithmic utility and applies a\nquadratic penalty function. The investor builds a dynamical estimate of the\nmarket price of risk $\\hat \\lambda$ and updates her stochastic utility in\naccordance with the so-perceived elapsed market opportunities. We show that\nthis leads to a time-consistent optimal investment policy given by a fractional\nKelly strategy associated with $\\hat \\lambda$. The leverage is proportional to\nthe investor's confidence in her estimate $\\hat \\lambda$.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2013 15:10:39 GMT"}, {"version": "v2", "created": "Fri, 14 Nov 2014 04:24:12 GMT"}], "update_date": "2014-11-17", "authors_parsed": [["Kallblad", "Sigrid", ""], ["Obloj", "Jan", ""], ["Zariphopoulou", "Thaleia", ""]]}, {"id": "1311.4057", "submitter": "Thierry Roncalli", "authors": "Th\\'eophile Griveau-Billion, Jean-Charles Richard and Thierry Roncalli", "title": "A Fast Algorithm for Computing High-dimensional Risk Parity Portfolios", "comments": "9 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a cyclical coordinate descent (CCD) algorithm for\nsolving high dimensional risk parity problems. We show that this algorithm\nconverges and is very fast even with large covariance matrices (n > 500).\nComparison with existing algorithms also shows that it is one of the most\nefficient algorithms.\n", "versions": [{"version": "v1", "created": "Sat, 16 Nov 2013 13:11:39 GMT"}], "update_date": "2013-11-19", "authors_parsed": [["Griveau-Billion", "Théophile", ""], ["Richard", "Jean-Charles", ""], ["Roncalli", "Thierry", ""]]}, {"id": "1311.5120", "submitter": "Catherine Donnelly", "authors": "Catherine Donnelly", "title": "Actuarial fairness and solidarity in pooled annuity funds", "comments": "25 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various types of structures that enable a group of individuals to pool their\nmortality risk have been proposed in the literature. Collectively, the\nstructures are called pooled annuity funds. Since the pooled annuity funds\npropose different methods of pooling mortality risk, we investigate the\nconnections between them and find that they are genuinely different for a\nfinite heterogeneous membership profile.\n  We discuss the importance of actuarial fairness, defined as the expected\nbenefits equalling the contributions for each member, in the context of pooling\nmortality risk and comment on whether actuarial unfairness can be seen as\nsolidarity between members. We show that, with a finite number of members in\nthe fund, the group self-annuitization scheme is not actuarially fair: some\nmembers subsidize the other members. The implication is that the members who\nare subsidizing the others may obtain a higher expected benefit by joining a\nfund with a more favourable membership profile. However, we find that the\nsubsidies are financially significant only for very small or highly\nheterogeneous membership profiles.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2013 16:23:03 GMT"}, {"version": "v2", "created": "Thu, 24 Apr 2014 15:29:02 GMT"}, {"version": "v3", "created": "Tue, 17 Jun 2014 09:44:59 GMT"}, {"version": "v4", "created": "Tue, 22 Jul 2014 08:58:17 GMT"}], "update_date": "2014-07-23", "authors_parsed": [["Donnelly", "Catherine", ""]]}, {"id": "1311.6080", "submitter": "Zuo Quan Xu Dr.", "authors": "Zuo Quan Xu", "title": "A New Characterization of Comonotonicity and its Application in\n  Behavioral Finance", "comments": "This paper has been withdrawn by the author. The main results are\n  existing in the literature, so we withdraw it", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well-known that an $\\mathbb{R}$-valued random vector $(X_1, X_2,\n\\cdots, X_n)$ is comonotonic if and only if $(X_1, X_2, \\cdots, X_n)$ and\n$(Q_1(U), Q_2(U),\\cdots, Q_n(U))$ coincide \\emph{in distribution}, for\n\\emph{any} random variable $U$ uniformly distributed on the unit interval\n$(0,1)$, where $Q_k(\\cdot)$ are the quantile functions of $X_k$, $k=1,2,\\cdots,\nn$. It is natural to ask whether $(X_1, X_2, \\cdots, X_n)$ and $(Q_1(U),\nQ_2(U),\\cdots, Q_n(U))$ can coincide \\emph{almost surely} for \\emph{some}\nspecial $U$. In this paper, we give a positive answer to this question by\nconstruction. We then apply this result to a general behavioral investment\nmodel with a law-invariant preference measure and develop a universal framework\nto link the problem to its quantile formulation. We show that any optimal\ninvestment output should be anti-comonotonic with the market pricing kernel.\nUnlike previous studies, our approach avoids making the assumption that the\npricing kernel is atomless, and consequently, we overcome one of the major\ndifficulties encountered when one considers behavioral economic equilibrium\nmodels in which the pricing kernel is a yet-to-be-determined unknown random\nvariable. The method is applicable to many other models such as risk sharing\nmodel.\n", "versions": [{"version": "v1", "created": "Sun, 24 Nov 2013 05:04:10 GMT"}, {"version": "v2", "created": "Thu, 20 Mar 2014 02:57:07 GMT"}, {"version": "v3", "created": "Thu, 27 Mar 2014 13:46:15 GMT"}, {"version": "v4", "created": "Fri, 11 Apr 2014 05:59:47 GMT"}, {"version": "v5", "created": "Mon, 14 Apr 2014 02:31:30 GMT"}, {"version": "v6", "created": "Mon, 16 Jun 2014 02:50:26 GMT"}, {"version": "v7", "created": "Tue, 17 Jun 2014 02:39:34 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Xu", "Zuo Quan", ""]]}, {"id": "1311.6179", "submitter": "Lingjiong Zhu", "authors": "Lingjiong Zhu", "title": "Optimal Strategies for a Long-Term Static Investor", "comments": "14 pages", "journal-ref": "Stochastic Models 2014, Volume 30, Issue 3, 300-318", "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The optimal strategies for a long-term static investor are studied. Given a\nportfolio of a stock and a bond, we derive the optimal allocation of the\ncapitols to maximize the expected long-term growth rate of a utility function\nof the wealth. When the bond has constant interest rate, three models for the\nunderlying stock price processes are studied: Heston model, 3/2 model and jump\ndiffusion model. We also study the optimal strategies for a portfolio in which\nthe stock price process follows a Black-Scholes model and the bond process has\na Vasicek interest rate that is correlated to the stock price.\n", "versions": [{"version": "v1", "created": "Sun, 24 Nov 2013 22:27:44 GMT"}, {"version": "v2", "created": "Sat, 24 May 2014 23:21:00 GMT"}, {"version": "v3", "created": "Tue, 14 Oct 2014 22:38:29 GMT"}], "update_date": "2014-10-16", "authors_parsed": [["Zhu", "Lingjiong", ""]]}, {"id": "1311.7419", "submitter": "Sigrid K\\\"allblad", "authors": "Sigrid K\\\"allblad", "title": "Risk- and ambiguity-averse portfolio optimization with quasiconcave\n  utility functionals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by recent axiomatic developments, we study the risk- and\nambiguity-averse investment problem where trading takes place over a fixed\nfinite horizon and terminal payoffs are evaluated according to a criterion\ndefined in terms of a quasiconcave utility functional. We extend to the present\nsetting certain existence and duality results established for the so-called\nvariational preferences by Schied (2007). The results are proven by building on\nexisting results for the classical utility maximization problem.\n", "versions": [{"version": "v1", "created": "Thu, 28 Nov 2013 20:49:17 GMT"}], "update_date": "2013-12-02", "authors_parsed": [["Källblad", "Sigrid", ""]]}]