[{"id": "1407.1595", "submitter": "Dalia Ibrahim", "authors": "Dalia Ibrahim, Fr\\'ed\\'eric Abergel (MAS, FiQuant)", "title": "Non-linear filtering and optimal investment under partial information\n  for stochastic volatility models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the question of filtering and maximizing terminal wealth\nfrom expected utility in a partially information stochastic volatility models.\nThe special features is that the only information available to the investor is\nthe one generated by the asset prices, and the unobservable processes will be\nmodeled by a stochastic differential equations. Using the change of measure\ntechniques, the partial observation context can be transformed into a full\ninformation context such that coefficients depend only on past history of\nobserved prices (filters processes). Adapting the stochastic non-linear\nfiltering, we show that under some assumptions on the model coefficients, the\nestimation of the filters depend on a priorimodels for the trend and the\nstochastic volatility. Moreover, these filters satisfy a stochastic partial\ndifferential equations named \"Kushner-Stratonovich equations\". Using the\nmartingale duality approach in this partially observed incomplete model, we can\ncharacterize the value function and the optimal portfolio. The main result here\nis that the dual value function associated to the martingale approach can be\nexpressed, via the dynamic programmingapproach, in terms of the solution to a\nsemilinear partial differential equation. We illustrate our results with some\nexamples of stochastic volatility models popular in the financial literature.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jul 2014 06:50:19 GMT"}, {"version": "v2", "created": "Sat, 25 Jul 2015 07:52:15 GMT"}], "update_date": "2015-07-28", "authors_parsed": [["Ibrahim", "Dalia", "", "MAS, FiQuant"], ["Abergel", "Frédéric", "", "MAS, FiQuant"]]}, {"id": "1407.3154", "submitter": "Ljudmila  Bordag A.", "authors": "Ljudmila A. Bordag, Ivan P. Yamshchikov and Dmitry Zhelezov", "title": "Portfolio optimization in the case of an asset with a given liquidation\n  time distribution", "comments": "30 pages, 1 figure", "journal-ref": "Int. J. Eng. Math. Model, vol. 2, no. 2, pp.31-50, 2015", "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Management of the portfolios containing low liquidity assets is a tedious\nproblem. The buyer proposes the price that can differ greatly from the paper\nvalue estimated by the seller, the seller, on the other hand, can not liquidate\nhis portfolio instantly and waits for a more favorable offer. To minimize\nlosses in this case we need to develop new methods. One of the steps moving the\ntheory towards practical needs is to take into account the time lag of the\nliquidation of an illiquid asset. This task became especially significant for\nthe practitioners in the time of the global financial crises. Working in the\nMerton's optimal consumption framework with continuous time we consider an\noptimization problem for a portfolio with an illiquid, a risky and a risk-free\nasset. While a standard Black-Scholes market describes the liquid part of the\ninvestment the illiquid asset is sold at a random moment with prescribed\nliquidation time distribution. In the moment of liquidation it generates\nadditional liquid wealth dependent on illiquid assets paper value. The investor\nhas the logarithmic utility function as a limit case of a HARA-type utility.\nDifferent distributions of the liquidation time of the illiquid asset are under\nconsideration - a classical exponential distribution and Weibull distribution\nthat is more practically relevant. Under certain conditions we show the\nexistence of the viscosity solution in both cases. Applying numerical methods\nwe compare classical Merton's strategies and the optimal consumption-allocation\nstrategies for portfolios with different liquidation-time distributions of an\nilliquid asset.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jul 2014 13:37:31 GMT"}], "update_date": "2020-09-28", "authors_parsed": [["Bordag", "Ljudmila A.", ""], ["Yamshchikov", "Ivan P.", ""], ["Zhelezov", "Dmitry", ""]]}, {"id": "1407.3372", "submitter": "Przemys{\\l}aw Rola", "authors": "Przemys{\\l}aw Rola", "title": "Arbitrage in markets with bid-ask spreads", "comments": "18 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper a finite discrete time market with an arbitrary state space and\nbid-ask spreads is considered. The notion of an equivalent bid-ask martingale\nmeasure (EBAMM) is introduced and the fundamental theorem of asset pricing is\nproved using (EBAMM) as an equivalent condition for no-arbitrage. The\nCox-Ross-Rubinstein model with bid-ask spreads is presented as an application\nof our results.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jul 2014 11:07:13 GMT"}], "update_date": "2014-07-15", "authors_parsed": [["Rola", "Przemysław", ""]]}, {"id": "1407.5278", "submitter": "Mark Davis", "authors": "Grzegorz Andruszkiewicz and Mark H.A. Davis and S\\'ebastien Lleo", "title": "Risk-sensitive investment in a finite-factor model", "comments": "23 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new jump diffusion regime-switching model is introduced, which allows for\nlinking jumps in asset prices with regime changes. We prove the existence and\nuniqueness of the solution to the risk-sensitive asset management criterion\nmaximisation problem in this setting. We provide an ODE for the optimal value\nfunction, which may be efficiently solved numerically. Relevant probability\nmeasure changes are discussed in the appendix. The approach of Klebaner and\nLipster (2014) is used to prove the martingale property of the relevant density\nprocesses.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jul 2014 11:55:52 GMT"}, {"version": "v2", "created": "Wed, 20 Jan 2016 16:24:14 GMT"}], "update_date": "2016-01-21", "authors_parsed": [["Andruszkiewicz", "Grzegorz", ""], ["Davis", "Mark H. A.", ""], ["Lleo", "Sébastien", ""]]}, {"id": "1407.6649", "submitter": "Amogh Deshpande Dr.", "authors": "Amogh Deshpande", "title": "On the role of F\\\"ollmer-Schweizer minimal martingale measure in Risk\n  Sensitive control Asset Management", "comments": "A.Deshpande (2015), On the role of F\\\"ollmer-Schweizer minimal\n  martingale measure in Risk Sensitive control Asset Management,Vol. 52, No. 3,\n  Journal of Applied Probability", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Kuroda and Nagai \\cite{KN} state that the factor process in the Risk\nSensitive control Asset Management (RSCAM) is stable under the\nF\\\"ollmer-Schweizer minimal martingale measure . Fleming and Sheu \\cite{FS} and\nmore recently F\\\"ollmer and Schweizer \\cite{FoS} have observed that the role of\nthe minimal martingale measure in this portfolio optimization is yet to be\nestablished. In this article we aim to address this question by explicitly\nconnecting the optimal wealth allocation to the minimal martingale measure. We\nachieve this by using a \"trick\" of observing this problem in the context of\nmodel uncertainty via a two person zero sum stochastic differential game\nbetween the investor and an antagonistic market that provides a probability\nmeasure. We obtain some startling insights. Firstly, if short-selling is not\npermitted and if the factor process evolves under the minimal martingale\nmeasure then the investor's optimal strategy can only be to invest in the\nriskless asset (i.e. the no-regret strategy). Secondly, if the factor process\nand the stock price process have independent noise, then even if the market\nallows short selling, the optimal strategy for the investor must be the\nno-regret strategy while the factor process will evolve under the minimal\nmartingale measure .\n", "versions": [{"version": "v1", "created": "Thu, 24 Jul 2014 16:58:20 GMT"}, {"version": "v2", "created": "Thu, 5 Mar 2015 21:48:06 GMT"}], "update_date": "2015-03-09", "authors_parsed": [["Deshpande", "Amogh", ""]]}, {"id": "1407.7717", "submitter": "Peter Bank", "authors": "Peter Bank and Helena Kauppila", "title": "Convex duality for stochastic singular control problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a general theory of convex duality for certain singular control\nproblems, taking the abstract results by Kramkov and Schachermayer (1999) for\noptimal expected utility from nonnegative random variables to the level of\noptimal expected utility from increasing, adapted controls. The main\ncontributions are the formulation of a suitable duality framework, the\nidentification of the problem's dual functional as well as the full duality for\nthe primal and dual value functions and their optimizers. The scope of our\nresults is illustrated by an irreversible investment problem and the\nHindy-Huang-Kreps utility maximization problem for incomplete financial\nmarkets.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jul 2014 13:15:18 GMT"}], "update_date": "2014-07-30", "authors_parsed": [["Bank", "Peter", ""], ["Kauppila", "Helena", ""]]}, {"id": "1407.8300", "submitter": "Ting Kam Leonard Wong", "authors": "Ting-Kam Leonard Wong", "title": "Optimization of relative arbitrage", "comments": "33 pages, 5 figures, 2 tables; revised version", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In stochastic portfolio theory, a relative arbitrage is an equity portfolio\nwhich is guaranteed to outperform a benchmark portfolio over a finite horizon.\nWhen the market is diverse and sufficiently volatile, and the benchmark is the\nmarket or a buy-and-hold portfolio, functionally generated portfolios\nintroduced by Fernholz provide a systematic way of constructing relative\narbitrages. In this paper we show that if the market portfolio is replaced by\nthe equal or entropy weighted portfolio among many others, no relative\narbitrages can be constructed under the same conditions using functionally\ngenerated portfolios. We also introduce and study a shaped-constrained\noptimization problem for functionally generated portfolios in the spirit of\nmaximum likelihood estimation of a log-concave density.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jul 2014 07:25:13 GMT"}, {"version": "v2", "created": "Tue, 5 Aug 2014 01:37:17 GMT"}, {"version": "v3", "created": "Mon, 24 Nov 2014 22:08:58 GMT"}], "update_date": "2014-11-26", "authors_parsed": [["Wong", "Ting-Kam Leonard", ""]]}]