[{"id": "1408.0916", "submitter": "Dmitry Kramkov", "authors": "Dmitry Kramkov, Sergio Pulido", "title": "A system of quadratic BSDEs arising in a price impact model", "comments": "Published at http://dx.doi.org/10.1214/15-AAP1103 in the Annals of\n  Applied Probability (http://www.imstat.org/aap/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Probability 2016, Vol. 26, No. 2, 794-817", "doi": "10.1214/15-AAP1103", "report-no": "IMS-AAP-AAP1103", "categories": "q-fin.MF math.PR q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a financial model where the prices of risky assets are quoted by\na representative market maker who takes into account an exogenous demand. We\ncharacterize these prices in terms of a system of BSDEs with quadratic growth.\nWe show that this system admits a unique solution for every bounded demand if\nand only if the market maker's risk-aversion is sufficiently small. The\nuniqueness is established in the natural class of solutions, without any\nadditional norm restrictions. To the best of our knowledge, this is the first\nstudy that proves such (global) uniqueness result for a system of fully coupled\nquadratic BSDEs.\n", "versions": [{"version": "v1", "created": "Tue, 5 Aug 2014 10:41:04 GMT"}, {"version": "v2", "created": "Mon, 20 Oct 2014 00:31:25 GMT"}, {"version": "v3", "created": "Wed, 4 May 2016 12:11:00 GMT"}], "update_date": "2016-05-05", "authors_parsed": [["Kramkov", "Dmitry", ""], ["Pulido", "Sergio", ""]]}, {"id": "1408.1159", "submitter": "Marcos Lopez de Prado", "authors": "Peter P. Carr, Marcos Lopez de Prado", "title": "Determining Optimal Trading Rules without Backtesting", "comments": "Working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Calibrating a trading rule using a historical simulation (also called\nbacktest) contributes to backtest overfitting, which in turn leads to\nunderperformance. In this paper we propose a procedure for determining the\noptimal trading rule (OTR) without running alternative model configurations\nthrough a backtest engine. We present empirical evidence of the existence of\nsuch optimal solutions for the case of prices following a discrete\nOrnstein-Uhlenbeck process, and show how they can be computed numerically.\nAlthough we do not derive a closed-form solution for the calculation of OTRs,\nwe conjecture its existence on the basis of the empirical evidence presented.\n", "versions": [{"version": "v1", "created": "Wed, 6 Aug 2014 01:37:28 GMT"}, {"version": "v2", "created": "Sun, 28 Sep 2014 22:57:23 GMT"}], "update_date": "2014-09-30", "authors_parsed": [["Carr", "Peter P.", ""], ["de Prado", "Marcos Lopez", ""]]}, {"id": "1408.1382", "submitter": "Xiang Yu", "authors": "Xiang Yu", "title": "Optimal Consumption under Habit Formation In Markets with Transaction\n  Costs and Random Endowments", "comments": "Final version. To appear in The Annals of Applied Probability.\n  Keywords: Proportional Transaction Costs, Unbounded Random Endowments,\n  Acceptable Portfolios, Consumption Budget Constraint, Consumption Habit\n  Formation, Convex Duality, Market Isomorphism", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the optimal consumption under the addictive habit\nformation preference in markets with transaction costs and unbounded random\nendowments. To model the proportional transaction costs, we adopt the Kabanov's\nmulti-asset framework with a cash account. At the terminal time T, the investor\ncan receive unbounded random endowments for which we propose a new definition\nof acceptable portfolios based on the strictly consistent price system (SCPS).\nWe prove a type of super-hedging theorem using the acceptable portfolios which\nenables us to obtain the consumption budget constraint condition under market\nfrictions. Applying the path dependence reduction and the embedding approach,\nwe obtain the existence and uniqueness of the optimal consumption using some\nauxiliary processes and the duality analysis. As an application of the duality\ntheory, the market isomorphism with special discounting factors is also\ndiscussed in the sense that the original optimal consumption with habit\nformation is equivalent to the standard optimal consumption problem without the\nhabits impact, however, in a modified isomorphic market model.\n", "versions": [{"version": "v1", "created": "Wed, 6 Aug 2014 19:26:00 GMT"}, {"version": "v2", "created": "Mon, 11 Aug 2014 18:46:54 GMT"}, {"version": "v3", "created": "Wed, 25 Nov 2015 09:11:14 GMT"}, {"version": "v4", "created": "Thu, 26 Nov 2015 04:09:42 GMT"}, {"version": "v5", "created": "Mon, 30 Nov 2015 18:26:16 GMT"}, {"version": "v6", "created": "Mon, 25 Jul 2016 06:35:16 GMT"}], "update_date": "2016-07-26", "authors_parsed": [["Yu", "Xiang", ""]]}, {"id": "1408.2217", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze", "title": "Mean-Reversion and Optimization", "comments": "41 pages; a trivial typo corrected", "journal-ref": "Journal of Asset Management 16(1) (2015) 14-40", "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of these notes is to provide a systematic quantitative framework\n- in what is intended to be a \"pedagogical\" fashion - for discussing\nmean-reversion and optimization. We start with pair trading and add complexity\nby following the sequence \"mean-reversion via demeaning -> regression ->\nweighted regression -> (constrained) optimization -> factor models\". We discuss\nin detail how to do mean-reversion based on this approach, including common\npitfalls encountered in practical applications, such as the difference between\nmaximizing the Sharpe ratio and minimizing an objective function when trading\ncosts are included. We also discuss explicit algorithms for optimization with\nlinear costs, constraints and bounds.\n", "versions": [{"version": "v1", "created": "Sun, 10 Aug 2014 12:11:38 GMT"}, {"version": "v2", "created": "Tue, 7 Oct 2014 13:48:07 GMT"}, {"version": "v3", "created": "Fri, 12 Feb 2016 19:39:55 GMT"}], "update_date": "2016-02-15", "authors_parsed": [["Kakushadze", "Zura", ""]]}, {"id": "1408.2805", "submitter": "Georg Hofmann", "authors": "Georg Hofmann", "title": "Accelerated Portfolio Optimization with Conditional Value-at-Risk\n  Constraints using a Cutting-Plane Method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.PM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial portfolios are often optimized for maximum profit while subject to\na constraint formulated in terms of the Conditional Value-at-Risk (CVaR). This\namounts to solving a linear problem. However, in its original formulation this\nlinear problem has a very large number of linear constraints, too many to be\nenforced in practice. In the literature this is addressed by a reformulation of\nthe problem using so-called dummy variables. This reduces the large number of\nconstraints in the original linear problem at the cost of increasing the number\nof variables. In the context of reinsurance portfolio optimization we observe\nthat the increase in variable count can lead to situations where solving the\nreformulated problem takes a long time. Therefore we suggest a different\napproach. We solve the original linear problem with cutting-plane method: The\nproposed algorithm starts with the solution of a relaxed problem and then\niteratively adds cuts until the solution is approximated within a preset\nthreshold. This is a new approach. For a reinsurance case study we show that a\nsignificant reduction of necessary computer resources can be achieved.\n", "versions": [{"version": "v1", "created": "Tue, 12 Aug 2014 19:01:24 GMT"}], "update_date": "2014-08-13", "authors_parsed": [["Hofmann", "Georg", ""]]}, {"id": "1408.3774", "submitter": "Yan Dolinsky", "authors": "Yan Dolinsky and Yuri Kifer", "title": "Risk Minimization for Game Options in Markets Imposing Minimal\n  Transaction Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study partial hedging for game options in markets with transaction costs\nbounded from below. More precisely, we assume that the investor's transaction\ncosts for each trade are the maximum between proportional transaction costs and\na fixed transaction costs. We prove that in the continuous time Black--Scholes\n(BS) model, there exists a trading strategy which minimizes the shortfall risk.\nFurthermore, we use binomial models in order to provide numerical schemes for\nthe calculation of the shortfall risk and the corresponding optimal portfolio\nin the BS model.\n", "versions": [{"version": "v1", "created": "Sat, 16 Aug 2014 21:47:35 GMT"}, {"version": "v2", "created": "Thu, 4 Jun 2015 22:02:06 GMT"}], "update_date": "2015-06-08", "authors_parsed": [["Dolinsky", "Yan", ""], ["Kifer", "Yuri", ""]]}, {"id": "1408.5989", "submitter": "Christoph Czichowsky", "authors": "Christoph Czichowsky and Walter Schachermayer", "title": "Duality Theory for Portfolio Optimisation under Transaction Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For portfolio optimisation under proportional transaction costs, we provide a\nduality theory for general cadlag price processes. In this setting, we prove\nthe existence of a dual optimiser as well as a shadow price process in a\ngeneralised sense. This shadow price is defined via a \"sandwiched\" process\nconsisting of a predictable and an optional strong supermartingale and pertains\nto all strategies which remain solvent under transaction costs. We provide\nexamples showing that in the present general setting the shadow price process\nhas to be of this generalised form.\n", "versions": [{"version": "v1", "created": "Tue, 26 Aug 2014 02:57:42 GMT"}], "update_date": "2014-08-27", "authors_parsed": [["Czichowsky", "Christoph", ""], ["Schachermayer", "Walter", ""]]}, {"id": "1408.6065", "submitter": "Walter Schachermayer", "authors": "Christoph Czichowsky, Walter Schachermayer, Junjian Yang", "title": "Shadow prices for continuous processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a financial market with a continuous price process and proportional\ntransaction costs we investigate the problem of utility maximization of\nterminal wealth. We give sufficient conditions for the existence of a shadow\nprice process, i.e.~a least favorable frictionless market leading to the same\noptimal strategy and utility as in the original market under transaction costs.\nThe crucial ingredients are the continuity of the price process and the\nhypothesis of \"no unbounded profit with bounded risk\". A counter-example\nreveals that these hypotheses cannot be relaxed.\n", "versions": [{"version": "v1", "created": "Tue, 26 Aug 2014 10:26:31 GMT"}, {"version": "v2", "created": "Tue, 5 May 2015 09:24:58 GMT"}], "update_date": "2015-05-06", "authors_parsed": [["Czichowsky", "Christoph", ""], ["Schachermayer", "Walter", ""], ["Yang", "Junjian", ""]]}, {"id": "1408.6070", "submitter": "Xun Li", "authors": "Xiangyu Cui, Xun Li, Duan Li, Yun Shi", "title": "Time Consistent Behavior Portfolio Policy for Dynamic Mean-Variance\n  Formulation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When we implement a portfolio selection methodology under a mean-risk\nformulation, it is essential to correctly model investors' risk aversion which\nmay be time-dependent, or even state-dependent during the investment procedure.\nIn this paper, we propose a behavior risk aversion model, which is a piecewise\nlinear function of the current wealth level with a reference point at a preset\ninvestment target. Due to the time inconsistency of the resulting multi-period\nmean-variance model with an adaptive risk aversion, we investigate in this\npaper the time consistent behavior portfolio policy by solving a nested\nmean-variance game formulation. We derive semi-analytical time consistent\nbehavior portfolio policy which takes a piecewise linear feedback form of the\ncurrent wealth level with respect to the discounted investment target.\n", "versions": [{"version": "v1", "created": "Tue, 26 Aug 2014 11:05:48 GMT"}, {"version": "v2", "created": "Sun, 2 Aug 2015 15:38:52 GMT"}], "update_date": "2015-08-04", "authors_parsed": [["Cui", "Xiangyu", ""], ["Li", "Xun", ""], ["Li", "Duan", ""], ["Shi", "Yun", ""]]}, {"id": "1408.6455", "submitter": "Huyen Pham", "authors": "Huyen Pham (LPMA, CREST)", "title": "Long time asymptotics for optimal investment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This survey reviews portfolio selection problem for long-term horizon. We\nconsider two objectives: (i) maximize the probability for outperforming a\ntarget growth rate of wealth process (ii) minimize the probability of falling\nbelow a target growth rate. We study the asymptotic behavior of these criteria\nformulated as large deviations control pro\\-blems, that we solve by duality\nmethod leading to ergodic risk-sensitive portfolio optimization problems.\nSpecial emphasis is placed on linear factor models where explicit solutions are\nobtained.\n", "versions": [{"version": "v1", "created": "Wed, 27 Aug 2014 16:30:22 GMT"}], "update_date": "2014-08-28", "authors_parsed": [["Pham", "Huyen", "", "LPMA, CREST"]]}]