[{"id": "1506.00535", "submitter": "Moawia Alghalith", "authors": "Moawia Alghalith", "title": "New exact Taylor's expansions and simple solutions to PDEs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide new exact Taylor's series with fixed coefficients and without the\nremainder. We demonstrate the usefulness of this contribution by using it to\nobtain very simple solutions to (non-linear) PDEs. We also apply the method to\nthe portfolio model.\n", "versions": [{"version": "v1", "created": "Fri, 27 Mar 2015 14:29:53 GMT"}, {"version": "v2", "created": "Sun, 13 Sep 2015 15:53:59 GMT"}, {"version": "v3", "created": "Mon, 16 Nov 2015 23:19:47 GMT"}], "update_date": "2015-11-18", "authors_parsed": [["Alghalith", "Moawia", ""]]}, {"id": "1506.02020", "submitter": "Eric Bax", "authors": "Ragavendran Gopalakrishnan, Eric Bax, Krishna Prasad Chitrapura,\n  Sachin Garg", "title": "Portfolio Allocation for Sellers in Online Advertising", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In markets for online advertising, some advertisers pay only when users\nrespond to ads. So publishers estimate ad response rates and multiply by\nadvertiser bids to estimate expected revenue for showing ads. Since these\nestimates may be inaccurate, the publisher risks not selecting the ad for each\nad call that would maximize revenue. The variance of revenue can be decomposed\ninto two components -- variance due to `uncertainty' because the true response\nrate is unknown, and variance due to `randomness' because realized response\nstatistics fluctuate around the true response rate. Over a sequence of many ad\ncalls, the variance due to randomness nearly vanishes due to the law of large\nnumbers. However, the variance due to uncertainty doesn't diminish.\n  We introduce a technique for ad selection that augments existing estimation\nand explore-exploit methods. The technique uses methods from portfolio\noptimization to produce a distribution over ads rather than selecting the\nsingle ad that maximizes estimated expected revenue. Over a sequence of similar\nad calls, ads are selected according to the distribution. This approach\ndecreases the effects of uncertainty and increases revenue.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2015 19:26:53 GMT"}], "update_date": "2015-06-08", "authors_parsed": [["Gopalakrishnan", "Ragavendran", ""], ["Bax", "Eric", ""], ["Chitrapura", "Krishna Prasad", ""], ["Garg", "Sachin", ""]]}, {"id": "1506.02802", "submitter": "Eberhard Mayerhofer", "authors": "Paolo Guasoni, Eberhard Mayerhofer", "title": "The Limits of Leverage", "comments": "4 figures", "journal-ref": "Mathematical Finance, Vol 29, 249-284, 2019", "doi": "10.1111/mafi.12172", "report-no": null, "categories": "q-fin.PM math.OC math.PR q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When trading incurs proportional costs, leverage can scale an asset's return\nonly up to a maximum multiple, which is sensitive to its volatility and\nliquidity. In a model with one safe and one risky asset, with constant\ninvestment opportunities and proportional costs, we find strategies that\nmaximize long term returns given average volatility. As leverage increases,\nrising rebalancing costs imply declining Sharpe ratios. Beyond a critical\nlevel, even returns decline. Holding the Sharpe ratio constant, higher asset\nvolatility leads to superior returns through lower costs.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2015 07:21:33 GMT"}, {"version": "v2", "created": "Thu, 18 Feb 2016 14:33:46 GMT"}, {"version": "v3", "created": "Tue, 17 Oct 2017 15:15:10 GMT"}], "update_date": "2019-01-29", "authors_parsed": [["Guasoni", "Paolo", ""], ["Mayerhofer", "Eberhard", ""]]}, {"id": "1506.05990", "submitter": "Virginia Young", "authors": "Moshe A. Milevsky, Virginia R. Young", "title": "Annuitization and asset allocation", "comments": null, "journal-ref": "J of Economic Dynamics and Control 31(9) (2007), 3138-3177", "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines the optimal annuitization, investment and consumption\nstrategies of a utility-maximizing retiree facing a stochastic time of death\nunder a variety of institutional restrictions. We focus on the impact of aging\non the optimal purchase of life annuities which form the basis of most Defined\nBenefit pension plans. Due to adverse selection, acquiring a lifetime payout\nannuity is an irreversible transaction that creates an incentive to delay.\nUnder the institutional all-or-nothing arrangement where annuitization must\ntake place at one distinct point in time (i.e. retirement), we derive the\noptimal age at which to annuitize and develop a metric to capture the loss from\nannuitizing prematurely. In contrast, under an open-market structure where\nindividuals can annuitize any fraction of their wealth at anytime, we locate a\ngeneral optimal annuity purchasing policy. In this case, we find that an\nindividual will initially annuitize a lump sum and then buy annuities to keep\nwealth to one side of a separating ray in wealth-annuity space. We believe our\npaper is the first to integrate life annuity products into the portfolio choice\nliterature while taking into account realistic institutional restrictions which\nare unique to the market for mortality-contingent claims.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 13:13:44 GMT"}], "update_date": "2015-06-22", "authors_parsed": [["Milevsky", "Moshe A.", ""], ["Young", "Virginia R.", ""]]}, {"id": "1506.08360", "submitter": "Jinxia  Zhu", "authors": "Jinxia Zhu and Hailiang Yang", "title": "Optimal financing and dividend distribution in a general diffusion model\n  with regime switching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimal financing and dividend distribution problem with\nrestricted dividend rates in a diffusion type surplus model where the drift and\nvolatility coefficients are general functions of the level of surplus and the\nexternal environment regime. The environment regime is modeled by a Markov\nprocess. Both capital injections and dividend payments incur expenses. The\nobjective is to maximize the expectation of the total discounted dividends\nminus the total cost of capital injections. We prove that it is optimal to\ninject capitals only when the surplus tends to fall below zero and to pay out\ndividends at the maximal rate when the surplus is at or above the threshold\ndependent on the environment regime.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jun 2015 05:45:17 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Zhu", "Jinxia", ""], ["Yang", "Hailiang", ""]]}, {"id": "1506.08690", "submitter": "Gergo Barta", "authors": "Gabor Nagy and Gergo Barta and Tamas Henk", "title": "Portfolio optimization using local linear regression ensembles in\n  RapidMiner", "comments": "RCOMM 2012: Rapidminer Community Meeting and Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we implement a Local Linear Regression Ensemble Committee\n(LOLREC) to predict 1-day-ahead returns of 453 assets form the S&P500. The\nestimates and the historical returns of the committees are used to compute the\nweights of the portfolio from the 453 stock. The proposed method outperforms\nbenchmark portfolio selection strategies that optimize the growth rate of the\ncapital. We investigate the effect of algorithm parameter m: the number of\nselected stocks on achieved average annual yields. Results suggest the\nalgorithm's practical usefulness in everyday trading.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 15:42:39 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Nagy", "Gabor", ""], ["Barta", "Gergo", ""], ["Henk", "Tamas", ""]]}]