[{"id": "1701.02958", "submitter": "Gon\\c{c}alo Sim\\~oes", "authors": "Gon\\c{c}alo Sim\\~oes, Mark McDonald, Stacy Williams, Daniel Fenn,\n  Raphael Hauser", "title": "Robust Portfolio Optimisation with Specified Competitors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend Relative Robust Portfolio Optimisation models to allow portfolios\nto optimise their distance to a set of benchmarks. Portfolio managers are also\ngiven the option of computing regret in a way which is more in line with market\npractices than other approaches suggested in the literature. In addition, they\nare given the choice of simply adding an extra constraint to their optimisation\nproblem instead of outright changing the objective function, as is commonly\nsuggested in the literature. We illustrate the benefits of this approach by\napplying it to equity portfolios in a variety of regions.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2017 13:00:19 GMT"}], "update_date": "2017-01-12", "authors_parsed": [["Simões", "Gonçalo", ""], ["McDonald", "Mark", ""], ["Williams", "Stacy", ""], ["Fenn", "Daniel", ""], ["Hauser", "Raphael", ""]]}, {"id": "1701.05016", "submitter": "Ziping Zhao", "authors": "Ziping Zhao and Daniel P. Palomar", "title": "Mean-Reverting Portfolio Design with Budget Constraint", "comments": "Paper submitted to IEEE Transactions on Signal Processing. Part of\n  this work will appear in the Proceedings of the 50th annual Asilomar\n  conference on signals, systems, and computers, Nov. 6-9, 2016, CA, USA", "journal-ref": null, "doi": "10.1109/TSP.2018.2799193", "report-no": null, "categories": "q-fin.PM q-fin.CP q-fin.MF q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the mean-reverting portfolio design problem arising from\nstatistical arbitrage in the financial markets. We first propose a general\nproblem formulation aimed at finding a portfolio of underlying component assets\nby optimizing a mean-reversion criterion characterizing the mean-reversion\nstrength, taking into consideration the variance of the portfolio and an\ninvestment budget constraint. Then several specific problems are considered\nbased on the general formulation, and efficient algorithms are proposed.\nNumerical results on both synthetic and market data show that our proposed\nmean-reverting portfolio design methods can generate consistent profits and\noutperform the traditional design methods and the benchmark methods in the\nliterature.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 11:33:51 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Zhao", "Ziping", ""], ["Palomar", "Daniel P.", ""]]}]