[{"id": "1708.00644", "submitter": "Jean-Philippe Bouchaud", "authors": "Stefano Ciliberti, Emmanuel S\\'eri\\'e, Guillaume Simon, Yves\n  Lemp\\'eri\\`ere, Jean-Philippe Bouchaud", "title": "The \"Size Premium\" in Equity Markets: Where is the Risk?", "comments": "Working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We find that when measured in terms of dollar-turnover, and once\n$\\beta$-neutralised and Low-Vol neutralised, the Size Effect is alive and well.\nWith a long term t-stat of $5.1$, the \"Cold-Minus-Hot\" (CMH) anomaly is\ncertainly not less significant than other well-known factors such as Value or\nQuality. As compared to market-cap based SMB, CMH portfolios are much less\nanti-correlated to the Low-Vol anomaly. In contrast with standard risk premia,\nsize-based portfolios are found to be virtually unskewed. In fact, the extreme\nrisk of these portfolios is dominated by the large cap leg; small caps actually\nhave a positive (rather than negative) skewness. The only argument that favours\na risk premium interpretation at the individual stock level is that the extreme\ndrawdowns are more frequent for small cap/turnover stocks, even after\naccounting for volatility. This idiosyncratic risk is however clearly\ndiversifiable.\n", "versions": [{"version": "v1", "created": "Wed, 2 Aug 2017 08:31:17 GMT"}, {"version": "v2", "created": "Wed, 23 Aug 2017 10:16:40 GMT"}], "update_date": "2017-08-24", "authors_parsed": [["Ciliberti", "Stefano", ""], ["Sérié", "Emmanuel", ""], ["Simon", "Guillaume", ""], ["Lempérière", "Yves", ""], ["Bouchaud", "Jean-Philippe", ""]]}, {"id": "1708.02424", "submitter": "Juan  Monge", "authors": "Juan Francisco Monge", "title": "Cardinality constrained portfolio selection via factor models", "comments": null, "journal-ref": "Optimization Letters, 2020", "doi": "10.1007/s11590-020-01571-6", "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose and discuss different 0-1 linear models in order to\nsolve the cardinality constrained portfolio problem by using factor models.\nFactor models are used to build portfolios to track indexes, together with\nother objectives, also need a smaller number of parameters to estimate than the\nclassical Markowitz model. The addition of the cardinality constraints limits\nthe number of securities in the portfolio. Restricting the number of securities\nin the portfolio allows us to obtain a concentrated portfolio, reduce the risk\nand limit transaction costs. To solve this problem, a pure 0-1 model is\npresented in this work, the 0-1 model is constructed by means of a piecewise\nlinear approximation. We also present a new quadratic combinatorial problem,\ncalled a minimum edge-weighted clique problem, to obtain an equality weighted\ncardinality constrained portfolio. A piecewise linear approximation for this\nproblem is presented in the context of a multi factor model. For a single\nfactor model, we present a fast heuristic, based on some theoretical results to\nobtain an equality weighted cardinality constraint portfolio. The consideration\nof a piecewise linear approximation allow us to reduce significantly the\ncomputation time required for the equivalent quadratic problem. Computational\nresults from the 0-1 models are compared to those using a state-of-the-art\nQuadratic MIP solver.\n", "versions": [{"version": "v1", "created": "Tue, 8 Aug 2017 09:35:52 GMT"}], "update_date": "2020-03-19", "authors_parsed": [["Monge", "Juan Francisco", ""]]}, {"id": "1708.02984", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "Decoding Stock Market with Quant Alphas", "comments": "20 pages; to appear in Journal of Asset Management", "journal-ref": "Journal of Asset Management 19(1) (2018) 38-48", "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give an explicit algorithm and source code for extracting expected returns\nfor stocks from expected returns for alphas. Our algorithm altogether bypasses\ncombining alphas with weights into \"alpha combos\". Simply put, we have\ndeveloped a new method for trading alphas which does not involve combining\nthem. This yields substantial cost savings as alpha combos cost hedge funds\naround 3% of the P&L, while alphas themselves cost around 10%. Also, the extra\nlayer of alpha combos, which our new method avoids, adds noise and\nsuboptimality. We also arrive at our algorithm independently by explicitly\nconstructing alpha risk models based on position data.\n", "versions": [{"version": "v1", "created": "Wed, 9 Aug 2017 19:53:47 GMT"}], "update_date": "2018-02-12", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}, {"id": "1708.05713", "submitter": "Amir Ahmadi Javid", "authors": "Amir Ahmadi-Javid and Malihe Fallah-Tafti", "title": "Portfolio Optimization with Entropic Value-at-Risk", "comments": null, "journal-ref": "European Journal of Operational Research, 279(1), 225-241", "doi": "10.1016/j.ejor.2019.02.007", "report-no": null, "categories": "q-fin.PM math.OC q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The entropic value-at-risk (EVaR) is a new coherent risk measure, which is an\nupper bound for both the value-at-risk (VaR) and conditional value-at-risk\n(CVaR). As important properties, the EVaR is strongly monotone over its domain\nand strictly monotone over a broad sub-domain including all continuous\ndistributions, while well-known monotone risk measures, such as VaR and CVaR\nlack these properties. A key feature for a risk measure, besides its financial\nproperties, is its applicability in large-scale sample-based portfolio\noptimization. If the negative return of an investment portfolio is a\ndifferentiable convex function, the portfolio optimization with the EVaR\nresults in a differentiable convex program whose number of variables and\nconstraints is independent of the sample size, which is not the case for the\nVaR and CVaR. This enables us to design an efficient algorithm using\ndifferentiable convex optimization. Our extensive numerical study shows the\nhigh efficiency of the algorithm in large scales, compared to the existing\nconvex optimization software packages. The computational efficiency of the EVaR\nportfolio optimization approach is also compared with that of CVaR-based\nportfolio optimization. This comparison shows that the EVaR approach generally\nperforms similarly, and it outperforms as the sample size increases. Moreover,\nthe comparison of the portfolios obtained for a real case by the EVaR and CVaR\napproaches shows that the EVaR approach can find portfolios with better\nexpectations and VaR values at high confidence levels.\n", "versions": [{"version": "v1", "created": "Fri, 18 Aug 2017 15:38:56 GMT"}], "update_date": "2020-04-17", "authors_parsed": [["Ahmadi-Javid", "Amir", ""], ["Fallah-Tafti", "Malihe", ""]]}, {"id": "1708.07567", "submitter": "Michael McCourt", "authors": "Kevin Tee, Michael McCourt, Ruben Martinez-Cantin, Ian Dewancker,\n  Frank Liu", "title": "Active Preference Learning for Personalized Portfolio Construction", "comments": "4 pages, 2 figures, 1 algorithm, ICML Human in the Loop workshop", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In financial asset management, choosing a portfolio requires balancing\nreturns, risk, exposure, liquidity, volatility and other factors. These\nconcerns are difficult to compare explicitly, with many asset managers using an\nintuitive or implicit sense of their interaction. We propose a mechanism for\nlearning someone's sense of distinctness between portfolios with the goal of\nbeing able to identify portfolios which are predicted to perform well but are\ndistinct from the perspective of the user. This identification occurs, e.g., in\nthe context of Bayesian optimization of a backtested performance metric.\nNumerical experiments are presented which show the impact of personal beliefs\nin informing the development of a diverse and high-performing portfolio.\n", "versions": [{"version": "v1", "created": "Thu, 24 Aug 2017 22:21:29 GMT"}], "update_date": "2017-08-28", "authors_parsed": [["Tee", "Kevin", ""], ["McCourt", "Michael", ""], ["Martinez-Cantin", "Ruben", ""], ["Dewancker", "Ian", ""], ["Liu", "Frank", ""]]}, {"id": "1708.07637", "submitter": "Jean-Philippe Bouchaud", "authors": "Tung-Lam Dao, Daniel Hoehener, Yves Lemp\\'eri\\`ere, Trung-Tu Nguyen,\n  Philip Seager, Jean-Philippe Bouchaud", "title": "Trends and Risk Premia: Update and Additional Plots", "comments": "Short note, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, our group has published two papers that have received some\nattention in the finance community. One is about the profitability of trend\nfollowing strategies over 200 years, the second is about the correlation\nbetween the profitability of \"Risk Premia\" and their skewness. In this short\nnote, we present two additional plots that fully corroborate our findings on\nnew data.\n", "versions": [{"version": "v1", "created": "Fri, 25 Aug 2017 07:53:27 GMT"}], "update_date": "2017-08-28", "authors_parsed": [["Dao", "Tung-Lam", ""], ["Hoehener", "Daniel", ""], ["Lempérière", "Yves", ""], ["Nguyen", "Trung-Tu", ""], ["Seager", "Philip", ""], ["Bouchaud", "Jean-Philippe", ""]]}]