[{"id": "1810.02125", "submitter": "Adriano Koshiyama", "authors": "Adriano Soares Koshiyama, Nick Firoozye and Philip Treleaven", "title": "A Machine Learning-based Recommendation System for Swaptions Strategies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.LG q-fin.GN stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Derivative traders are usually required to scan through hundreds, even\nthousands of possible trades on a daily basis. Up to now, not a single solution\nis available to aid in their job. Hence, this work aims to develop a trading\nrecommendation system, and apply this system to the so-called Mid-Curve\nCalendar Spread (MCCS), an exotic swaption-based derivatives package. In\nsummary, our trading recommendation system follows this pipeline: (i) on a\ncertain trade date, we compute metrics and sensitivities related to an MCCS;\n(ii) these metrics are feed in a model that can predict its expected return for\na given holding period; and after repeating (i) and (ii) for all trades we\n(iii) rank the trades using some dominance criteria. To suggest that such\napproach is feasible, we used a list of 35 different types of MCCS; a total of\n11 predictive models; and 4 benchmark models. Our results suggest that in\ngeneral linear regression with lasso regularisation compared favourably to\nother approaches from a predictive and interpretability perspective.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2018 09:55:40 GMT"}], "update_date": "2018-10-05", "authors_parsed": [["Koshiyama", "Adriano Soares", ""], ["Firoozye", "Nick", ""], ["Treleaven", "Philip", ""]]}, {"id": "1810.02444", "submitter": "Alex Garivaltis", "authors": "Alex Garivaltis", "title": "Super-Replication of the Best Pairs Trade in Hindsight", "comments": "22 pages, 1 figure", "journal-ref": "Cogent Economics & Finance (2019), 7: 1568657", "doi": null, "report-no": null, "categories": "q-fin.PM econ.GN econ.TH q-fin.EC q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper derives a robust on-line equity trading algorithm that achieves\nthe greatest possible percentage of the final wealth of the best pairs\nrebalancing rule in hindsight. A pairs rebalancing rule chooses some pair of\nstocks in the market and then perpetually executes rebalancing trades so as to\nmaintain a target fraction of wealth in each of the two. After each discrete\nmarket fluctuation, a pairs rebalancing rule will sell a precise amount of the\noutperforming stock and put the proceeds into the underperforming stock. Under\ntypical conditions, in hindsight one can find pairs rebalancing rules that\nwould have spectacularly beaten the market. Our trading strategy, which extends\nOrdentlich and Cover's (1998) \"max-min universal portfolio,\" guarantees to\nachieve an acceptable percentage of the hindsight-optimized wealth, a\npercentage which tends to zero at a slow (polynomial) rate. This means that on\na long enough investment horizon, the trader can enforce a compound-annual\ngrowth rate that is arbitrarily close to that of the best pairs rebalancing\nrule in hindsight. The strategy will \"beat the market asymptotically\" if there\nturns out to exist a pairs rebalancing rule that grows capital at a higher\nasymptotic rate than the market index. The advantages of our algorithm over the\nOrdentlich and Cover (1998) strategy are twofold. First, their strategy is\nimpossible to compute in practice. Second, in considering the more modest\nbenchmark (instead of the best all-stock rebalancing rule in hindsight), we\nreduce the \"cost of universality\" and achieve a higher learning rate.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2018 22:30:01 GMT"}, {"version": "v2", "created": "Wed, 17 Oct 2018 21:44:08 GMT"}, {"version": "v3", "created": "Thu, 14 Mar 2019 21:18:41 GMT"}], "update_date": "2019-06-06", "authors_parsed": [["Garivaltis", "Alex", ""]]}, {"id": "1810.02447", "submitter": "Alex Garivaltis", "authors": "Alex Garivaltis", "title": "Multilinear Superhedging of Lookback Options", "comments": "41 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR econ.TH q-fin.CP q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a pathbreaking paper, Cover and Ordentlich (1998) solved a max-min\nportfolio game between a trader (who picks an entire trading algorithm,\n$\\theta(\\cdot)$) and \"nature,\" who picks the matrix $X$ of gross-returns of all\nstocks in all periods. Their (zero-sum) game has the payoff kernel\n$W_\\theta(X)/D(X)$, where $W_\\theta(X)$ is the trader's final wealth and $D(X)$\nis the final wealth that would have accrued to a $\\$1$ deposit into the best\nconstant-rebalanced portfolio (or fixed-fraction betting scheme) determined in\nhindsight. The resulting \"universal portfolio\" compounds its money at the same\nasymptotic rate as the best rebalancing rule in hindsight, thereby beating the\nmarket asymptotically under extremely general conditions. Smitten with this\n(1998) result, the present paper solves the most general tractable version of\nCover and Ordentlich's (1998) max-min game. This obtains for performance\nbenchmarks (read: derivatives) that are separately convex and homogeneous in\neach period's gross-return vector. For completely arbitrary (even\nnon-measurable) performance benchmarks, we show how the axiom of choice can be\nused to \"find\" an exact maximin strategy for the trader.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2018 22:50:42 GMT"}], "update_date": "2019-06-06", "authors_parsed": [["Garivaltis", "Alex", ""]]}, {"id": "1810.02485", "submitter": "Alex Garivaltis", "authors": "Alex Garivaltis", "title": "Exact Replication of the Best Rebalancing Rule in Hindsight", "comments": "37 pages, 10 figures", "journal-ref": "The Journal of Derivatives 26(4), pp.35-53 (2019)", "doi": null, "report-no": null, "categories": "q-fin.PR econ.GN econ.TH q-fin.EC q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper prices and replicates the financial derivative whose payoff at $T$\nis the wealth that would have accrued to a $\\$1$ deposit into the best\ncontinuously-rebalanced portfolio (or fixed-fraction betting scheme) determined\nin hindsight. For the single-stock Black-Scholes market, Ordentlich and Cover\n(1998) only priced this derivative at time-0, giving\n$C_0=1+\\sigma\\sqrt{T/(2\\pi)}$. Of course, the general time-$t$ price is not\nequal to $1+\\sigma\\sqrt{(T-t)/(2\\pi)}$. I complete the Ordentlich-Cover (1998)\nanalysis by deriving the price at any time $t$. By contrast, I also study the\nmore natural case of the best levered rebalancing rule in hindsight. This\nyields $C(S,t)=\\sqrt{T/t}\\cdot\\,\\exp\\{rt+\\sigma^2b(S,t)^2\\cdot t/2\\}$, where\n$b(S,t)$ is the best rebalancing rule in hindsight over the observed history\n$[0,t]$. I show that the replicating strategy amounts to betting the fraction\n$b(S,t)$ of wealth on the stock over the interval $[t,t+dt].$ This fact holds\nfor the general market with $n$ correlated stocks in geometric Brownian motion:\nwe get $C(S,t)=(T/t)^{n/2}\\exp(rt+b'\\Sigma b\\cdot t/2)$, where $\\Sigma$ is the\ncovariance of instantaneous returns per unit time. This result matches the\n$\\mathcal{O}(T^{n/2})$ \"cost of universality\" derived by Cover in his\n\"universal portfolio theory\" (1986, 1991, 1996, 1998), which super-replicates\nthe same derivative in discrete-time. The replicating strategy compounds its\nmoney at the same asymptotic rate as the best levered rebalancing rule in\nhindsight, thereby beating the market asymptotically. Naturally enough, we find\nthat the American-style version of Cover's Derivative is never exercised early\nin equilibrium.\n", "versions": [{"version": "v1", "created": "Fri, 5 Oct 2018 01:36:19 GMT"}, {"version": "v2", "created": "Thu, 14 Mar 2019 21:04:03 GMT"}], "update_date": "2019-06-06", "authors_parsed": [["Garivaltis", "Alex", ""]]}, {"id": "1810.04370", "submitter": "Yusuke Uchiyama", "authors": "Yusuke Uchiyama, Takanori Kadoya, Kei Nakagawa", "title": "Complex Valued Risk Diversification", "comments": null, "journal-ref": null, "doi": "10.3390/e21020119", "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risk diversification is one of the dominant concerns for portfolio managers.\nVarious portfolio constructions have been proposed to minimize the risk of the\nportfolio under some constrains including expected returns. We propose a\nportfolio construction method that incorporates the complex valued principal\ncomponent analysis into the risk diversification portfolio construction. The\nproposed method is verified to outperform the conventional risk parity and risk\ndiversification portfolio constructions.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2018 04:39:49 GMT"}], "update_date": "2019-02-20", "authors_parsed": [["Uchiyama", "Yusuke", ""], ["Kadoya", "Takanori", ""], ["Nakagawa", "Kei", ""]]}, {"id": "1810.06366", "submitter": "Takashi Shinzato", "authors": "Takashi Shinzato", "title": "Replica Analysis for Maximization of Net Present Value", "comments": "1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cond-mat.dis-nn cond-mat.stat-mech math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we use replica analysis to determine the investment strategy\nthat can maximize the net present value for portfolios containing multiple\ndevelopment projects. Replica analysis was developed in statistical mechanical\ninformatics and econophysics to evaluate disordered systems, and here we use it\nto formulate the maximization of the net present value as an optimization\nproblem under budget and investment concentration constraints. Furthermore, we\nconfirm that a common approach from operations research underestimates the true\nmaximal net present value as the maximal expected net present value by\ncomparing our results with the maximal expected net present value as derived in\noperations research. Moreover, it is shown that the conventional method for\nestimating the net present value does not consider variance in the cash flow.\n", "versions": [{"version": "v1", "created": "Mon, 15 Oct 2018 14:19:16 GMT"}], "update_date": "2018-10-16", "authors_parsed": [["Shinzato", "Takashi", ""]]}, {"id": "1810.08384", "submitter": "Stanislao Gualdi", "authors": "Stefano Ciliberti and Stanislao Gualdi", "title": "Portfolio Construction Matters", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The role of portfolio construction in the implementation of equity market\nneutral factors is often underestimated. Taking the classical momentum strategy\nas an example, we show that one can significantly improve the main strategy's\nfeatures by properly taking care of this key step. More precisely, an optimized\nportfolio construction algorithm allows one to significantly improve the Sharpe\nRatio, reduce sector exposures and volatility fluctuations, and mitigate the\nstrategy's skewness and tail correlation with the market. These results are\nsupported by long-term, world-wide simulations and will be shown to be\nuniversal. Our findings are quite general and hold true for a number of other\n\"equity factors\". Finally, we discuss the details of a more realistic set-up\nwhere we also deal with transaction costs.\n", "versions": [{"version": "v1", "created": "Fri, 19 Oct 2018 07:59:10 GMT"}], "update_date": "2018-10-22", "authors_parsed": [["Ciliberti", "Stefano", ""], ["Gualdi", "Stanislao", ""]]}, {"id": "1810.08466", "submitter": "Rafael Serrano", "authors": "Rafael Serrano and Camilo Castillo", "title": "Optimal continuous-time ALM for insurers: a martingale approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a continuous-time asset-allocation problem for a firm in the\ninsurance industry that backs up the liabilities raised by the insurance\ncontracts with the underwriting profits and the income resulting from investing\nin the financial market. Using the martingale approach and convex duality\ntechniques we characterize strategies that maximize expected utility from\nconsumption and final wealth under CRRA preferences. We present numerical\nresults for some distributions of claims/liabilities with policy limits.\n", "versions": [{"version": "v1", "created": "Fri, 19 Oct 2018 12:35:36 GMT"}], "update_date": "2018-10-22", "authors_parsed": [["Serrano", "Rafael", ""], ["Castillo", "Camilo", ""]]}, {"id": "1810.08584", "submitter": "Davide Venturelli", "authors": "Davide Venturelli and Alexei Kondratyev", "title": "Reverse Quantum Annealing Approach to Portfolio Optimization Problems", "comments": "19 pages, 6 figures (incl. appendix)", "journal-ref": "Quantum Mach. Intell. (2019)", "doi": "10.1007/s42484-019-00001-w", "report-no": null, "categories": "quant-ph q-fin.CP q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a hybrid quantum-classical solution method to the\nmean-variance portfolio optimization problems. Starting from real financial\ndata statistics and following the principles of the Modern Portfolio Theory, we\ngenerate parametrized samples of portfolio optimization problems that can be\nrelated to quadratic binary optimization forms programmable in the analog\nD-Wave Quantum Annealer 2000Q. The instances are also solvable by an\nindustry-established Genetic Algorithm approach, which we use as a classical\nbenchmark. We investigate several options to run the quantum computation\noptimally, ultimately discovering that the best results in terms of expected\ntime-to-solution as a function of number of variables for the hardest instances\nset are obtained by seeding the quantum annealer with a solution candidate\nfound by a greedy local search and then performing a reverse annealing\nprotocol. The optimized reverse annealing protocol is found to be more than 100\ntimes faster than the corresponding forward quantum annealing on average.\n", "versions": [{"version": "v1", "created": "Fri, 19 Oct 2018 16:58:33 GMT"}, {"version": "v2", "created": "Thu, 25 Oct 2018 20:41:41 GMT"}], "update_date": "2019-07-01", "authors_parsed": [["Venturelli", "Davide", ""], ["Kondratyev", "Alexei", ""]]}, {"id": "1810.09825", "submitter": "Gian Paolo Clemente", "authors": "Gian Paolo Clemente, Rosanna Grassi, Asmerilda Hitaj", "title": "Asset allocation: new evidence through network approaches", "comments": "Submitted", "journal-ref": "Annals of Operations Research, 2019", "doi": "10.1007/s10479-019-03136-y", "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main contribution of the paper is to employ the financial market network\nas a useful tool to improve the portfolio selection process, where nodes\nindicate securities and edges capture the dependence structure of the system.\nThree different methods are proposed in order to extract the dependence\nstructure between assets in a network context. Starting from this modified\nstructure, we formulate and then we solve the asset allocation problem. We find\nthat the portfolios obtained through a network-based approach are composed\nmainly of peripheral assets, which are poorly connected with the others. These\nportfolios, in the majority of cases, are characterized by an higher trade-off\nbetween performance and risk with respect to the traditional Global Minimum\nVariance (GMV) portfolio. Additionally, this methodology benefits of a\ngraphical visualization of the selected portfolio directly over the graphic\nlayout of the network, which helps in improving our understanding of the\noptimal strategy.\n", "versions": [{"version": "v1", "created": "Sat, 20 Oct 2018 20:53:34 GMT"}], "update_date": "2019-01-15", "authors_parsed": [["Clemente", "Gian Paolo", ""], ["Grassi", "Rosanna", ""], ["Hitaj", "Asmerilda", ""]]}, {"id": "1810.10726", "submitter": "Vic Norton", "authors": "Vic Norton", "title": "How Not To Do Mean-Variance Analysis", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use the 2014 market history of two high-returning biotechnology\nexchange-traded funds to illustrate how ex post mean-variance analysis should\nnot be done. Unfortunately, the way it should not be done is the way it\ngenerally is done -- to our knowledge.\n", "versions": [{"version": "v1", "created": "Thu, 25 Oct 2018 05:35:45 GMT"}], "update_date": "2018-10-26", "authors_parsed": [["Norton", "Vic", ""]]}, {"id": "1810.10800", "submitter": "Olivier Scaillet", "authors": "Stelios Arvanitis, Olivier Scaillet, Nikolas Topaloglou", "title": "Spanning Tests for Markowitz Stochastic Dominance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST econ.EM q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive properties of the cdf of random variables defined as saddle-type\npoints of real valued continuous stochastic processes. This facilitates the\nderivation of the first-order asymptotic properties of tests for stochastic\nspanning given some stochastic dominance relation. We define the concept of\nMarkowitz stochastic dominance spanning, and develop an analytical\nrepresentation of the spanning property. We construct a non-parametric test for\nspanning based on subsampling, and derive its asymptotic exactness and\nconsistency. The spanning methodology determines whether introducing new\nsecurities or relaxing investment constraints improves the investment\nopportunity set of investors driven by Markowitz stochastic dominance. In an\napplication to standard data sets of historical stock market returns, we reject\nmarket portfolio Markowitz efficiency as well as two-fund separation. Hence, we\nfind evidence that equity management through base assets can outperform the\nmarket, for investors with Markowitz type preferences.\n", "versions": [{"version": "v1", "created": "Thu, 25 Oct 2018 09:21:59 GMT"}], "update_date": "2018-10-26", "authors_parsed": [["Arvanitis", "Stelios", ""], ["Scaillet", "Olivier", ""], ["Topaloglou", "Nikolas", ""]]}, {"id": "1810.10970", "submitter": "Roland Ramsahai", "authors": "Roland R. Ramsahai", "title": "Defining and estimating stochastic rate change in a dynamic general\n  insurance portfolio", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rate change calculations in the literature involve deterministic methods that\nmeasure the change in premium for a given policy. The definition of rate change\nas a statistical parameter is proposed to address the stochastic nature of the\npremium charged for a policy. It promotes the idea that rate change is a\nproperty of an asymptotic population to be estimated, not just a property to\nmeasure or monitor in the sample of observed policies that are written. Various\nmodels and techniques are given for estimating this stochastic rate change and\nquantifying the uncertainty in the estimates. The use of matched sampling is\nemphasized for rate change estimation, as it adjusts for changes in policy\ncharacteristics by directly searching for similar policies across policy years.\nThis avoids any of the assumptions and recipes that are required to re-rate\npolicies in years where they were not written, as is common with deterministic\nmethods. Such procedures can be subjective or implausible if the structure of\nrating algorithms change or there are complex and heterogeneous exposure bases\nand coverages. The methods discussed are applied to a motor premium database.\nThe application includes the use of a genetic algorithm with parallel\ncomputations to automatically optimize the matched sampling.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2018 19:20:08 GMT"}], "update_date": "2018-10-26", "authors_parsed": [["Ramsahai", "Roland R.", ""]]}, {"id": "1810.11299", "submitter": "Jan Palczewski", "authors": "Bogdan Grechuk and Andrzej Palczewski and Jan Palczewski", "title": "On the solution uniqueness in portfolio optimization and risk analysis", "comments": "39 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the issue of solution uniqueness for portfolio optimization\nproblem and its inverse for asset returns with a finite number of possible\nscenarios. The risk is assessed by deviation measures introduced by\n[Rockafellar et al., Mathematical Programming, Ser. B, 108 (2006), pp. 515-540]\ninstead of variance as in the Markowitz optimization problem. We prove that in\ngeneral one can expect uniqueness neither in forward nor in inverse problems.\nWe discuss consequences of that non-uniqueness for several problems in risk\nanalysis and portfolio optimization, including capital allocation, risk\nsharing, cooperative investment, and the Black-Litterman methodology. In all\ncases, the issue with non-uniqueness is closely related to the fact that\nsubgradient of a convex function is non-unique at the points of\nnon-differentiability. We suggest methodology to resolve this issue by\nidentifying a unique \"special\" subgradient satisfying some natural axioms. This\n\"special\" subgradient happens to be the Stainer point of the subdifferential\nset.\n", "versions": [{"version": "v1", "created": "Fri, 26 Oct 2018 12:56:28 GMT"}, {"version": "v2", "created": "Thu, 1 Nov 2018 11:18:05 GMT"}, {"version": "v3", "created": "Thu, 8 Oct 2020 13:38:28 GMT"}], "update_date": "2020-10-09", "authors_parsed": [["Grechuk", "Bogdan", ""], ["Palczewski", "Andrzej", ""], ["Palczewski", "Jan", ""]]}, {"id": "1810.11619", "submitter": "Daniel Sevcovic", "authors": "Sona Kilianova, Daniel Sevcovic", "title": "Expected Utility Maximization and Conditional Value-at-Risk\n  Deviation-based Sharpe Ratio in Dynamic Stochastic Portfolio Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we investigate the expected terminal utility maximization\napproach for a dynamic stochastic portfolio optimization problem. We solve it\nnumerically by solving an evolutionary Hamilton-Jacobi-Bellman equation which\nis transformed by means of the Riccati transformation. We examine the\ndependence of the results on the shape of a chosen utility function in regard\nto the associated risk aversion level. We define the\n  Conditional value-at-risk deviation ($CVaRD$) based Sharpe ratio for\nmeasuring risk-adjusted performance of a dynamic portfolio. We compute optimal\nstrategies for a portfolio investment problem motivated by the German DAX 30\nIndex and we evaluate and analyze the dependence of the $CVaRD$-based Sharpe\nratio on the utility function and the associated risk aversion level.\n", "versions": [{"version": "v1", "created": "Sat, 27 Oct 2018 08:47:36 GMT"}], "update_date": "2018-10-30", "authors_parsed": [["Kilianova", "Sona", ""], ["Sevcovic", "Daniel", ""]]}, {"id": "1810.12840", "submitter": "Ricardo Fernholz", "authors": "Ricardo T. Fernholz and Caleb Stroup", "title": "Asset Price Distributions and Efficient Markets", "comments": "45 pages, 6 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore a decomposition in which returns on a large class of portfolios\nrelative to the market depend on a smooth non-negative drift and changes in the\nasset price distribution. This decomposition is obtained using general\ncontinuous semimartingale price representations, and is thus consistent with\nvirtually any asset pricing model. Fluctuations in portfolio relative returns\ndepend on stochastic time-varying dispersion in asset prices. Thus, our\nframework uncovers an asset pricing factor whose existence emerges from an\naccounting identity universal across different economic and financial\nenvironments, a fact that has deep implications for market efficiency. In\nparticular, in a closed, dividend-free market in which asset price dispersion\nis relatively constant, a large class of portfolios must necessarily outperform\nthe market portfolio over time. We show that price dispersion in commodity\nfutures markets has increased only slightly, and confirm the existence of\nsubstantial excess returns that co-vary with changes in price dispersion as\npredicted by our theory.\n", "versions": [{"version": "v1", "created": "Tue, 30 Oct 2018 16:27:49 GMT"}], "update_date": "2018-10-31", "authors_parsed": [["Fernholz", "Ricardo T.", ""], ["Stroup", "Caleb", ""]]}]