[{"id": "1903.00590", "submitter": "Yu Feng Dr", "authors": "Yu Feng", "title": "Non-Parametric Robust Model Risk Measurement with Path-Dependent Loss\n  Functions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding and measuring model risk is important to financial\npractitioners. However, there lacks a non-parametric approach to model risk\nquantification in a dynamic setting and with path-dependent losses. We propose\na complete theory generalizing the relative-entropic approach by Glasserman and\nXu to the dynamic case under any $f$-divergence. It provides an unified\ntreatment for measuring both the worst-case risk and the $f$-divergence budget\nthat originate from the model uncertainty of an underlying state process.\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2019 00:52:43 GMT"}], "update_date": "2019-03-06", "authors_parsed": [["Feng", "Yu", ""]]}, {"id": "1903.00829", "submitter": "Alex Garivaltis", "authors": "Alex Garivaltis", "title": "Cover's Rebalancing Option With Discrete Hindsight Optimization", "comments": "33 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM econ.GN econ.TH q-fin.EC q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study T. Cover's rebalancing option (Ordentlich and Cover 1998) under\ndiscrete hindsight optimization in continuous time. The payoff in question is\nequal to the final wealth that would have accrued to a $\\$1$ deposit into the\nbest of some finite set of (perhaps levered) rebalancing rules determined in\nhindsight. A rebalancing rule (or fixed-fraction betting scheme) amounts to\nfixing an asset allocation (i.e. $200\\%$ stocks and $-100\\%$ bonds) and then\ncontinuously executing rebalancing trades to counteract allocation drift.\nRestricting the hindsight optimization to a small number of rebalancing rules\n(i.e. 2) has some advantages over the pioneering approach taken by Cover $\\&$\nCompany in their brilliant theory of universal portfolios (1986, 1991, 1996,\n1998), where one's on-line trading performance is benchmarked relative to the\nfinal wealth of the best unlevered rebalancing rule of any kind in hindsight.\nOur approach lets practitioners express an a priori view that one of the\nfavored asset allocations (\"bets\") $b\\in\\{b_1,...,b_n\\}$ will turn out to have\nperformed spectacularly well in hindsight. In limiting our robustness to some\ndiscrete set of asset allocations (rather than all possible asset allocations)\nwe reduce the price of the rebalancing option and guarantee to achieve a\ncorrespondingly higher percentage of the hindsight-optimized wealth at the end\nof the planning period. A practitioner who lives to delta-hedge this variant of\nCover's rebalancing option through several decades is guaranteed to see the day\nthat his realized compound-annual capital growth rate is very close to that of\nthe best $b_i$ in hindsight. Hence the point of the rock-bottom option price.\n", "versions": [{"version": "v1", "created": "Sun, 3 Mar 2019 04:36:48 GMT"}], "update_date": "2019-06-06", "authors_parsed": [["Garivaltis", "Alex", ""]]}, {"id": "1903.04257", "submitter": "Xiang Yu", "authors": "Yue Yang and Xiang Yu", "title": "Optimal Entry and Consumption under Habit Formation", "comments": "Final version, forthcoming in Advances in Applied Probability", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a composite problem involving the decision making of the\noptimal entry time and dynamic consumption afterwards. In stage-1, the investor\nhas access to full market information subjecting to some information costs and\nneeds to choose an optimal stopping time to initiate stage-2; in stage-2, the\ninvestor terminates the costly full information acquisition and starts dynamic\ninvestment and consumption under partial observations of free public stock\nprices. The habit formation preference is employed, in which the past\nconsumption affects the investor's current decisions. By using the stochastic\nPerron's method, the value function of the composite problem is proved to be\nthe unique viscosity solution of some variational inequalities.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2019 12:48:43 GMT"}, {"version": "v2", "created": "Fri, 31 May 2019 02:54:38 GMT"}, {"version": "v3", "created": "Tue, 3 Sep 2019 12:45:26 GMT"}, {"version": "v4", "created": "Tue, 18 Feb 2020 09:12:40 GMT"}, {"version": "v5", "created": "Fri, 2 Apr 2021 06:46:44 GMT"}, {"version": "v6", "created": "Fri, 2 Jul 2021 03:05:52 GMT"}], "update_date": "2021-07-05", "authors_parsed": [["Yang", "Yue", ""], ["Yu", "Xiang", ""]]}, {"id": "1903.04841", "submitter": "Thierry Roncalli", "authors": "Joan Gonzalvez, Edmond Lezmi, Thierry Roncalli, Jiali Xu", "title": "Financial Applications of Gaussian Processes and Bayesian Optimization", "comments": "42 pages, 20 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last five years, the financial industry has been impacted by the\nemergence of digitalization and machine learning. In this article, we explore\ntwo methods that have undergone rapid development in recent years: Gaussian\nprocesses and Bayesian optimization. Gaussian processes can be seen as a\ngeneralization of Gaussian random vectors and are associated with the\ndevelopment of kernel methods. Bayesian optimization is an approach for\nperforming derivative-free global optimization in a small dimension, and uses\nGaussian processes to locate the global maximum of a black-box function. The\nfirst part of the article reviews these two tools and shows how they are\nconnected. In particular, we focus on the Gaussian process regression, which is\nthe core of Bayesian machine learning, and the issue of hyperparameter\nselection. The second part is dedicated to two financial applications. We first\nconsider the modeling of the term structure of interest rates. More precisely,\nwe test the fitting method and compare the GP prediction and the random walk\nmodel. The second application is the construction of trend-following\nstrategies, in particular the online estimation of trend and covariance\nwindows.\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2019 11:12:58 GMT"}], "update_date": "2019-03-13", "authors_parsed": [["Gonzalvez", "Joan", ""], ["Lezmi", "Edmond", ""], ["Roncalli", "Thierry", ""], ["Xu", "Jiali", ""]]}, {"id": "1903.05990", "submitter": "Thomas Bernhardt", "authors": "Thomas Bernhardt and Catherine Donnelly", "title": "Modern tontine with bequest: innovation in pooled annuity products", "comments": "40 pages, 23 pictures. Insurance: Mathematics and Economics(2019)", "journal-ref": "Insurance: Mathematics and Economics 86 (2019) 168-188", "doi": "10.1016/j.insmatheco.2019.03.002", "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new pension product that offers retirees the opportunity for a\nlifelong income and a bequest for their estate. Based on a tontine mechanism,\nthe product divides pension savings between a tontine account and a bequest\naccount. The tontine account is given up to a tontine pool upon death while the\nbequest account value is paid to the retiree's estate. The values of these two\naccounts are continuously re-balanced to the same proportion, which is the key\nfeature of our new product. Our main research question about the new product is\nwhat proportion of pension savings should a retiree allocate to the tontine\naccount. Under a power utility function, we show that more risk averse retirees\nallocate a fairly stable proportion of their pension savings to the tontine\naccount, regardless of the strength of their bequest motive. The proportion\ndeclines as the retiree becomes less risk averse for a while. However, for the\nleast risk averse retirees, a high proportion of their pension savings is\noptimally allocated to the tontine account. This surprising result is explained\nby the least risk averse retirees seeking the potentially high value of the\nbequest account at very old ages.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2019 13:37:23 GMT"}], "update_date": "2019-11-25", "authors_parsed": [["Bernhardt", "Thomas", ""], ["Donnelly", "Catherine", ""]]}, {"id": "1903.06033", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "Altcoin-Bitcoin Arbitrage", "comments": "26 pages; a few trivial typos corrected. arXiv admin note:\n  substantial text overlap with arXiv:1811.07860", "journal-ref": "Bulletin of Applied Economics 6(1) (2019) 87-110", "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give an algorithm and source code for a cryptoasset statistical arbitrage\nalpha based on a mean-reversion effect driven by the leading momentum factor in\ncryptoasset returns discussed in https://ssrn.com/abstract=3245641. Using\nempirical data, we identify the cross-section of cryptoassets for which this\naltcoin-Bitcoin arbitrage alpha is significant and discuss it in the context of\nliquidity considerations as well as its implications for cryptoasset trading.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2019 16:33:53 GMT"}, {"version": "v2", "created": "Tue, 2 Apr 2019 04:08:36 GMT"}], "update_date": "2019-04-04", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}, {"id": "1903.06230", "submitter": "Enzo Busseti", "authors": "Nicholas Moehle and Enzo Busseti and Stephen Boyd and Matt Wytock", "title": "Dynamic Energy Management", "comments": "63 pages, 15 figures, accompanying open source library", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a unified method, based on convex optimization, for managing the\npower produced and consumed by a network of devices over time. We start with\nthe simple setting of optimizing power flows in a static network, and then\nproceed to the case of optimizing dynamic power flows, i.e., power flows that\nchange with time over a horizon. We leverage this to develop a real-time\ncontrol strategy, model predictive control, which at each time step solves a\ndynamic power flow optimization problem, using forecasts of future quantities\nsuch as demands, capacities, or prices, to choose the current power flow\nvalues. Finally, we consider a useful extension of model predictive control\nthat explicitly accounts for uncertainty in the forecasts. We mirror our\nframework with an object-oriented software implementation, an open-source\nPython library for planning and controlling power flows at any scale. We\ndemonstrate our method with various examples. Appendices give more detail about\nthe package, and describe some basic but very effective methods for\nconstructing forecasts from historical data.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2019 19:53:54 GMT"}], "update_date": "2019-03-18", "authors_parsed": [["Moehle", "Nicholas", ""], ["Busseti", "Enzo", ""], ["Boyd", "Stephen", ""], ["Wytock", "Matt", ""]]}, {"id": "1903.06334", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "Machine Learning Risk Models", "comments": "26 pages; a few trivial typos corrected", "journal-ref": "Journal of Risk & Control 6(1) (2019) 37-64", "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give an explicit algorithm and source code for constructing risk models\nbased on machine learning techniques. The resultant covariance matrices are not\nfactor models. Based on empirical backtests, we compare the performance of\nthese machine learning risk models to other constructions, including\nstatistical risk models, risk models based on fundamental industry\nclassifications, and also those utilizing multilevel clustering based industry\nclassifications.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2019 02:47:21 GMT"}, {"version": "v2", "created": "Tue, 9 Apr 2019 02:15:01 GMT"}], "update_date": "2019-04-10", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}, {"id": "1903.06632", "submitter": "Masoud Fekri", "authors": "Masoud Fekri, Babak Barazandeh", "title": "Designing an Optimal Portfolio for Iran's Stock Market with Genetic\n  Algorithm using Neural Network Prediction of Risk and Return Stocks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal capital allocation between different assets is an important financial\nproblem, which is generally framed as the portfolio optimization problem.\nGeneral models include the single-period and multi-period cases. The\ntraditional Mean-Variance model introduced by Harry Markowitz has been the\nbasis of many models used to solve the portfolio optimization problem. The\noverall goal is to achieve the highest return and lowest risk in portfolio\noptimization problems. In this paper, we will present an optimal portfolio\nbased the Markowitz Mean-Variance-Skewness with weight constraints model for\nshort-term investment opportunities in Iran's stock market. We will use a\nneural network based predictor to predict the stock returns and measure the\nrisk of stocks based on the prediction errors in the neural network. We will\nperform a series of experiments on our portfolio optimization model with the\nreal data from Iran's stock market indices including Bank, Insurance,\nInvestment, Petroleum Products and Chemicals indices. Finally, 8 different\nportfolios with low, medium and high risks for different type of investors\n(risk-averse or risk taker) using genetic algorithm will be designed and\nanalyzed.\n", "versions": [{"version": "v1", "created": "Sun, 17 Feb 2019 10:47:27 GMT"}], "update_date": "2019-03-18", "authors_parsed": [["Fekri", "Masoud", ""], ["Barazandeh", "Babak", ""]]}, {"id": "1903.06912", "submitter": "Ale\\v{s} \\v{C}ern\\'y", "authors": "Ale\\v{s} \\v{C}ern\\'y", "title": "Semimartingale theory of monotone mean--variance portfolio allocation", "comments": "(v4) updated bibliography", "journal-ref": "Mathematical Finance 30(3), 1168-1178, 2020", "doi": "10.1111/mafi.12241", "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study dynamic optimal portfolio allocation for monotone mean--variance\npreferences in a general semimartingale model. Armed with new results in this\narea we revisit the work of Cui, Li, Wang and Zhu (2012, MAFI) and fully\ncharacterize the circumstances under which one can set aside a non-negative\ncash flow while simultaneously improving the mean--variance efficiency of the\nleft-over wealth. The paper analyzes, for the first time, the monotone hull of\nthe Sharpe ratio and highlights its relevance to the problem at hand.\n", "versions": [{"version": "v1", "created": "Sat, 16 Mar 2019 12:08:57 GMT"}, {"version": "v2", "created": "Mon, 10 Jun 2019 10:56:43 GMT"}, {"version": "v3", "created": "Tue, 10 Sep 2019 12:11:31 GMT"}, {"version": "v4", "created": "Fri, 24 Jan 2020 11:24:07 GMT"}], "update_date": "2020-06-23", "authors_parsed": [["Černý", "Aleš", ""]]}, {"id": "1903.06928", "submitter": "Ali Al-Aradi", "authors": "Ali Al-Aradi and Sebastian Jaimungal", "title": "Active and Passive Portfolio Management with Latent Factors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address a portfolio selection problem that combines active\n(outperformance) and passive (tracking) objectives using techniques from convex\nanalysis. We assume a general semimartingale market model where the assets'\ngrowth rate processes are driven by a latent factor. Using techniques from\nconvex analysis we obtain a closed-form solution for the optimal portfolio and\nprovide a theorem establishing its uniqueness. The motivation for incorporating\nlatent factors is to achieve improved growth rate estimation, an otherwise\nnotoriously difficult task. To this end, we focus on a model where growth rates\nare driven by an unobservable Markov chain. The solution in this case requires\na filtering step to obtain posterior probabilities for the state of the Markov\nchain from asset price information, which are subsequently used to find the\noptimal allocation. We show the optimal strategy is the posterior average of\nthe optimal strategies the investor would have held in each state assuming the\nMarkov chain remains in that state. Finally, we implement a number of\nhistorical backtests to demonstrate the performance of the optimal portfolio.\n", "versions": [{"version": "v1", "created": "Sat, 16 Mar 2019 14:10:44 GMT"}], "update_date": "2019-03-19", "authors_parsed": [["Al-Aradi", "Ali", ""], ["Jaimungal", "Sebastian", ""]]}, {"id": "1903.08156", "submitter": "Huy N. Chau", "authors": "Huy N. Chau, Miklos Rasonyi", "title": "Behavioural investors in conic market models", "comments": "arXiv admin note: text overlap with arXiv:1606.07311", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We treat a fairly broad class of financial models which includes markets with\nproportional transaction costs. We consider an investor with cumulative\nprospect theory preferences and a non-negativity constraint on portfolio\nwealth. The existence of an optimal strategy is shown in this context in a\nclass of generalized strategies.\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2019 09:36:55 GMT"}], "update_date": "2019-03-21", "authors_parsed": [["Chau", "Huy N.", ""], ["Rasonyi", "Miklos", ""]]}, {"id": "1903.08957", "submitter": "Li-Hsien  Sun", "authors": "Hiroaki Hata, Shuenn-Jyi Sheu, Li-Hsien Sun", "title": "Expected exponential utility maximization of insurers with a general\n  diffusion factor model : The complete market case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the problem of optimal investment by an insurer.\nThe insurer invests in a market consisting of a bank account and $m$ risky\nassets. The mean returns and volatilities of the risky assets depend\nnonlinearly on economic factors that are formulated as the solutions of general\nstochastic differential equations. The wealth of the insurer is described by a\nCram\\'er--Lundberg process, and the insurer preferences are exponential.\nAdapting a dynamic programming approach, we derive Hamilton--Jacobi--Bellman\n(HJB) equation. And, we prove the unique solvability of HJB equation. In\naddition, the optimal strategy is also obtained using the coupled forward and\nbackward stochastic differential equations (FBSDEs). Finally, proving the\nverification theorem, we construct the optimal strategy.\n", "versions": [{"version": "v1", "created": "Thu, 21 Mar 2019 12:44:13 GMT"}], "update_date": "2019-03-22", "authors_parsed": [["Hata", "Hiroaki", ""], ["Sheu", "Shuenn-Jyi", ""], ["Sun", "Li-Hsien", ""]]}, {"id": "1903.10065", "submitter": "Daniel Sevcovic", "authors": "Sona Kilianova, Daniel Sevcovic", "title": "Dynamic intertemporal utility optimization by means of Riccati\n  transformation of Hamilton-Jacobi Bellman equation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we investigate a dynamic stochastic portfolio optimization\nproblem involving both the expected terminal utility and intertemporal utility\nmaximization. We solve the problem by means of a solution to a fully nonlinear\nevolutionary Hamilton-Jacobi-Bellman (HJB) equation. We propose the so-called\nRiccati method for transformation of the fully nonlinear HJB equation into a\nquasi-linear parabolic equation with non-local terms involving the\nintertemporal utility function. As a numerical method we propose a\nsemi-implicit scheme in time based on a finite volume approximation in the\nspatial variable. By analyzing an explicit traveling wave solution we show that\nthe numerical method is of the second experimental order of convergence. As a\npractical application we compute optimal strategies for a portfolio investment\nproblem motivated by market financial data of German DAX 30 Index and show the\neffect of considering intertemporal utility on optimal portfolio selection.\n", "versions": [{"version": "v1", "created": "Sun, 24 Mar 2019 21:55:29 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Kilianova", "Sona", ""], ["Sevcovic", "Daniel", ""]]}, {"id": "1903.10454", "submitter": "\\c{C}a\\u{g}{\\i}n Ararat", "authors": "Tahsin Deniz Akt\\\"urk, \\c{C}a\\u{g}{\\i}n Ararat", "title": "Portfolio optimization with two coherent risk measures", "comments": "29 pages", "journal-ref": "Journal of Global Optimization 78 (3), 597-626, (2020)", "doi": "10.1007/s10898-020-00922-y", "report-no": null, "categories": "q-fin.PM math.OC q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide analytical results for a static portfolio optimization problem\nwith two coherent risk measures. The use of two risk measures is motivated by\njoint decision-making for portfolio selection where the risk perception of the\nportfolio manager is of primary concern, hence, it appears in the objective\nfunction, and the risk perception of an external authority needs to be taken\ninto account as well, which appears in the form of a risk constraint. The\nproblem covers the risk minimization problem with an expected return constraint\nand the expected return maximization problem with a risk constraint, as special\ncases. For the general case of an arbitrary joint distribution for the asset\nreturns, under certain conditions, we characterize the optimal portfolio as the\noptimal Lagrange multiplier associated to an equality-constrained dual problem.\nThen, we consider the special case of Gaussian returns for which it is possible\nto identify all cases where an optimal solution exists and to give an explicit\nformula for the optimal portfolio whenever it exists.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 16:42:19 GMT"}, {"version": "v2", "created": "Mon, 12 Aug 2019 11:04:45 GMT"}, {"version": "v3", "created": "Sat, 11 Jul 2020 12:41:39 GMT"}], "update_date": "2021-01-19", "authors_parsed": [["Aktürk", "Tahsin Deniz", ""], ["Ararat", "Çağın", ""]]}]