[{"id": "2003.00656", "submitter": "Michael Pinelis", "authors": "Michael Pinelis, David Ruppert", "title": "Machine Learning Portfolio Allocation", "comments": "40 pgs", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.GN q-fin.PR q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We find economically and statistically significant gains when using machine\nlearning for portfolio allocation between the market index and risk-free asset.\nOptimal portfolio rules for time-varying expected returns and volatility are\nimplemented with two Random Forest models. One model is employed in forecasting\nthe sign probabilities of the excess return with payout yields. The second is\nused to construct an optimized volatility estimate. Reward-risk timing with\nmachine learning provides substantial improvements over the buy-and-hold in\nutility, risk-adjusted returns, and maximum drawdowns. This paper presents a\nnew theoretical basis and unifying framework for machine learning applied to\nboth return- and volatility-timing.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2020 04:45:16 GMT"}, {"version": "v2", "created": "Tue, 3 Mar 2020 04:44:47 GMT"}, {"version": "v3", "created": "Fri, 13 Mar 2020 15:05:42 GMT"}, {"version": "v4", "created": "Wed, 8 Jul 2020 23:46:43 GMT"}], "update_date": "2020-07-10", "authors_parsed": [["Pinelis", "Michael", ""], ["Ruppert", "David", ""]]}, {"id": "2003.00884", "submitter": "Amit Chattopadhyay", "authors": "Amit K Chattopadhyay, Biswajit Debnath, Rihab El-Hassani, Sadhan Kumar\n  Ghosh, Rahul Baidya", "title": "Cleaner Production in Optimized Multivariate Networks: Operations\n  Management through a Roll of Dice", "comments": "18 pages, 9 figures; 3 additional appendices (14 pages)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.CP q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of supply chain management in analyzing and later catalyzing\neconomic expectations while simultaneously prioritizing cleaner production\naspects is a vital component of modern finance. Such predictions, though, are\noften known to be less than accurate due to the ubiquitous uncertainty plaguing\nmost business decisions. Starting from a multi-dimensional cost function\ndefining the sustainability of the supply chain (SC) kernel, this article\noutlines a 4-component SC module - environmental, demand, economic, and social\nuncertainties - each ranked according to its individual weight. Our\nmathematical model then assesses the viability of a sustainable business by\nfirst ranking the potentially stochastic variables in order of their subjective\nimportance, and then optimizing the cost kernel, defined from a utility\nfunction. The model will then identify conditions (as equations) validating the\nsustainability of a business venture. The ranking is initially obtained from an\nAnalytical Hierarchical Process; the resultant weighted cost function is then\noptimized to analyze the impact of market uncertainty based on our supply chain\nmodel. Model predictions are then ratified against SME data to emphasize the\nimportance of cleaner production in business strategies.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 19:18:11 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Chattopadhyay", "Amit K", ""], ["Debnath", "Biswajit", ""], ["El-Hassani", "Rihab", ""], ["Ghosh", "Sadhan Kumar", ""], ["Baidya", "Rahul", ""]]}, {"id": "2003.01809", "submitter": "Yongyang Cai", "authors": "Yongyang Cai, Kenneth Judd, Rong Xu", "title": "Numerical Solution of Dynamic Portfolio Optimization with Transaction\n  Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM econ.GN q-fin.CP q-fin.EC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply numerical dynamic programming techniques to solve discrete-time\nmulti-asset dynamic portfolio optimization problems with proportional\ntransaction costs and shorting/borrowing constraints. Examples include problems\nwith multiple assets, and many trading periods in a finite horizon problem. We\nalso solve dynamic stochastic problems, with a portfolio including one\nrisk-free asset, an option, and its underlying risky asset, under the existence\nof transaction costs and constraints. These examples show that it is now\ntractable to solve such problems.\n", "versions": [{"version": "v1", "created": "Tue, 3 Mar 2020 21:50:16 GMT"}], "update_date": "2020-03-05", "authors_parsed": [["Cai", "Yongyang", ""], ["Judd", "Kenneth", ""], ["Xu", "Rong", ""]]}, {"id": "2003.02515", "submitter": "Yuk Kwan Wong", "authors": "Steven Y. K. Wong (1), Jennifer Chan (2), Lamiae Azizi (2), and\n  Richard Y. D. Xu (1) ((1) University of Technology Sydney, (2) University of\n  Sydney)", "title": "Time-varying neural network for stock return prediction", "comments": "35 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.LG q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of neural network training in a time-varying context.\nMachine learning algorithms have excelled in problems that do not change over\ntime. However, problems encountered in financial markets are often\ntime-varying. We propose the online early stopping algorithm and show that a\nneural network trained using this algorithm can track a function changing with\nunknown dynamics. We compare the proposed algorithm to current approaches on\npredicting monthly U.S. stock returns and show its superiority. We also show\nthat prominent factors (such as the size and momentum effects) and industry\nindicators, exhibit time varying stock return predictiveness. We find that\nduring market distress, industry indicators experience an increase in\nimportance at the expense of firm level features. This indicates that\nindustries play a role in explaining stock returns during periods of heightened\nrisk.\n", "versions": [{"version": "v1", "created": "Thu, 5 Mar 2020 10:16:13 GMT"}, {"version": "v2", "created": "Wed, 8 Apr 2020 11:28:00 GMT"}, {"version": "v3", "created": "Mon, 29 Jun 2020 12:08:29 GMT"}, {"version": "v4", "created": "Fri, 22 Jan 2021 11:39:29 GMT"}], "update_date": "2021-01-25", "authors_parsed": [["Wong", "Steven Y. K.", ""], ["Chan", "Jennifer", ""], ["Azizi", "Lamiae", ""], ["Xu", "Richard Y. D.", ""]]}, {"id": "2003.06365", "submitter": "Yuan Gao", "authors": "Ziming Gao, Yuan Gao, Yi Hu, Zhengyong Jiang, Jionglong Su", "title": "Application of Deep Q-Network in Portfolio Management", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine Learning algorithms and Neural Networks are widely applied to many\ndifferent areas such as stock market prediction, face recognition and\npopulation analysis. This paper will introduce a strategy based on the classic\nDeep Reinforcement Learning algorithm, Deep Q-Network, for portfolio management\nin stock market. It is a type of deep neural network which is optimized by Q\nLearning. To make the DQN adapt to financial market, we first discretize the\naction space which is defined as the weight of portfolio in different assets so\nthat portfolio management becomes a problem that Deep Q-Network can solve.\nNext, we combine the Convolutional Neural Network and dueling Q-net to enhance\nthe recognition ability of the algorithm. Experimentally, we chose five\nlowrelevant American stocks to test the model. The result demonstrates that the\nDQN based strategy outperforms the ten other traditional strategies. The profit\nof DQN algorithm is 30% more than the profit of other strategies. Moreover, the\nSharpe ratio associated with Max Drawdown demonstrates that the risk of policy\nmade with DQN is the lowest.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2020 16:20:51 GMT"}], "update_date": "2020-03-16", "authors_parsed": [["Gao", "Ziming", ""], ["Gao", "Yuan", ""], ["Hu", "Yi", ""], ["Jiang", "Zhengyong", ""], ["Su", "Jionglong", ""]]}, {"id": "2003.08450", "submitter": "Ali Al-Aradi", "authors": "Ali Al-Aradi, Sebastian Jaimungal", "title": "A Variational Analysis Approach to Solving the Merton Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the Merton problem of maximizing the expected utility of terminal\nwealth using techniques from variational analysis. Under a general continuous\nsemimartingale market model with stochastic parameters, we obtain a\ncharacterization of the optimal portfolio for general utility functions in\nterms of a forward-backward stochastic differential equation (FBSDE) and derive\nsolutions for a number of well-known utility functions. Our results complement\na previous studies conducted on optimal strategies in markets driven by\nBrownian noise with random drift and volatility parameters.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2020 19:34:22 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Al-Aradi", "Ali", ""], ["Jaimungal", "Sebastian", ""]]}, {"id": "2003.10419", "submitter": "Florent Benaych-Georges", "authors": "Florent Benaych-Georges, Jean-Philippe Bouchaud, Stefano Ciliberti", "title": "Equity Factors: To Short Or Not To Short, That Is The Question", "comments": "11 pages, 11 figures. To appear in Journal of Investing", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What is the best market-neutral implementation of classical Equity Factors?\nShould one use the specific predictability of the short-leg to build a zero\nbeta Long-Short portfolio, in spite of the specific costs associated to\nshorting, or is it preferable to ban the shorts and hedge the long-leg with --\nsay -- an index future? We revisit this question by focusing on the relative\npredictability of the two legs, the issue of diversification, and various\nsources of costs. Our conclusion is that, using the same Factors, a Long-Short\nimplementation leads to superior risk-adjusted returns than its Hedged\nLong-Only counterpart, at least when Assets Under Management are not too large.\n", "versions": [{"version": "v1", "created": "Mon, 23 Mar 2020 17:47:27 GMT"}, {"version": "v2", "created": "Tue, 22 Dec 2020 17:54:02 GMT"}, {"version": "v3", "created": "Tue, 6 Apr 2021 13:12:55 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Benaych-Georges", "Florent", ""], ["Bouchaud", "Jean-Philippe", ""], ["Ciliberti", "Stefano", ""]]}, {"id": "2003.13360", "submitter": "Andrew Paskaramoorthy", "authors": "Andrew Paskaramoorthy (1), Terence van Zyl (1), Tim Gebbie (2)", "title": "A Framework for Online Investment Algorithms", "comments": "for associated code patterns, see\n  https://github.com/apaskara/Online_Invest_Algo", "journal-ref": "Investment Analysts Journal, 2020, 49:3", "doi": "10.1080/10293523.2020.1806460", "report-no": null, "categories": "q-fin.PM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The artificial segmentation of an investment management process into a\nworkflow with silos of offline human operators can restrict silos from\ncollectively and adaptively pursuing a unified optimal investment goal. To meet\nthe investor's objectives, an online algorithm can provide an explicit\nincremental approach that makes sequential updates as data arrives at the\nprocess level. This is in stark contrast to offline (or batch) processes that\nare focused on making component level decisions prior to process level\nintegration. Here we present and report results for an integrated, and online\nframework for algorithmic portfolio management. This article provides a\nworkflow that can in-turn be embedded into a process level learning framework.\nThe workflow can be enhanced to refine signal generation and asset-class\nevolution and definitions. Our results confirm that we can use our framework in\nconjunction with resampling methods to outperform naive market capitalisation\nbenchmarks while making clear the extent of back-test over-fitting. We consider\nsuch an online update framework to be a crucial step towards developing\nintelligent portfolio selection algorithms that integrate financial theory,\ninvestor views, and data analysis with process-level learning.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 11:41:53 GMT"}], "update_date": "2020-09-08", "authors_parsed": [["Paskaramoorthy", "Andrew", ""], ["van Zyl", "Terence", ""], ["Gebbie", "Tim", ""]]}, {"id": "2003.14359", "submitter": "Giorgio Ferrari", "authors": "Giorgio Ferrari, Hanwu Li, Frank Riedel", "title": "A Knightian Irreversible Investment Problem", "comments": "32 pages. Relaxed one assumption", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study an irreversible investment problem under Knightian\nuncertainty. In a general framework, in which Knightian uncertainty is modeled\nthrough a set of multiple priors, we prove existence and uniqueness of the\noptimal investment plan, and derive necessary and sufficient conditions for\noptimality. This allows us to construct the optimal policy in terms of the\nsolution to a stochastic backward equation under the worst-case scenario. In a\ntime-homogeneous setting - where risk is driven by a geometric Brownian motion\nand Knightian uncertainty is realized through a so-called \"k-ignorance\" - we\nare able to provide the explicit form of the optimal irreversible investment\nplan.\n", "versions": [{"version": "v1", "created": "Tue, 31 Mar 2020 16:41:04 GMT"}, {"version": "v2", "created": "Mon, 6 Apr 2020 15:37:57 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Ferrari", "Giorgio", ""], ["Li", "Hanwu", ""], ["Riedel", "Frank", ""]]}]