[{"id": "2012.01121", "submitter": "Frank Phillipson", "authors": "Frank Phillipson and Harshil Singh Bhatia", "title": "Portfolio Optimisation Using the D-Wave Quantum Annealer", "comments": "14 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The first quantum computers are expected to perform well at quadratic\noptimisation problems. In this paper a quadratic problem in finance is taken,\nthe Portfolio Optimisation problem. Here, a set of assets is chosen for\ninvestment, such that the total risk is minimised, a minimum return is realised\nand a budget constraint is met. This problem is solved for several instances in\ntwo main indices, the Nikkei225 and the S\\&P500 index, using the\nstate-of-the-art implementation of D-Wave's quantum annealer and its hybrid\nsolvers. The results are benchmarked against conventional, state-of-the-art,\ncommercially available tooling. Results show that for problems of the size of\nthe used instances, the D-Wave solution, in its current, still limited size,\ncomes already close to the performance of commercial solvers.\n", "versions": [{"version": "v1", "created": "Fri, 13 Nov 2020 16:15:20 GMT"}], "update_date": "2020-12-03", "authors_parsed": [["Phillipson", "Frank", ""], ["Bhatia", "Harshil Singh", ""]]}, {"id": "2012.01235", "submitter": "Gon\\c{c}alo dos Reis Dr.", "authors": "Goncalo dos Reis and Vadim Platonov", "title": "Forward utility and market adjustments in relative\n  investment-consumption games of many players", "comments": "35 pages, 1 Figure, 1 Table; With full length calculations for arXiv", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN math.PR q-fin.EC q-fin.MF q-fin.PM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study a portfolio management problem featuring many-player and mean-field\ncompetition, investment and consumption, and relative performance concerns\nunder the forward performance processes (FPP) framework. We focus on agents\nusing power (CRRA) type FPPs for their investment-consumption optimization\nproblem an under common noise Merton market model and we solve both the\nmany-player and mean-field game providing closed-form expressions for the\nsolutions where the limit of the former yields the latter.\n  In our case, the FPP framework yields a continuum of solutions for the\nconsumption component as indexed to a market parameter we coin \"market\nconsumption intensity\". The parameter permits the agent to set a preference for\ntheir consumption going forward in time that, in the competition case, reflects\na common market behaviour. We show the FPP framework, under both competition\nand no-competition, allows the agent to disentangle his risk-tolerance and\nelasticity of intertemporal substitution (EIS) just like Epstein-Zin\npreferences under recursive utility framework and unlike the classical utility\ntheory one. This, in turn, allows a finer analysis on the agent's consumption\n\"income\" and \"substitution\" regimes, and, of independent interest, motivates a\nnew strand of economics research on EIS under the FPP framework.\n  We find that competition rescales the agent's perception of consumption in a\nnon-trivial manner in addition to a time-dependent \"elasticity of conformity\"\nof the agent to the market's consumption intensity.\n", "versions": [{"version": "v1", "created": "Wed, 2 Dec 2020 14:23:51 GMT"}], "update_date": "2020-12-03", "authors_parsed": [["Reis", "Goncalo dos", ""], ["Platonov", "Vadim", ""]]}, {"id": "2012.01819", "submitter": "Vilhelm Niklasson", "authors": "Taras Bodnar, Mathias Lindholm, Vilhelm Niklasson and Erik Thors\\'en", "title": "Bayesian Quantile-Based Portfolio Selection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimal portfolio allocation problem from a Bayesian perspective\nusing value at risk (VaR) and conditional value at risk (CVaR) as risk\nmeasures. By applying the posterior predictive distribution for the future\nportfolio return, we derive relevant quantiles needed in the computations of\nVaR and CVaR, and express the optimal portfolio weights in terms of observed\ndata only. This is in contrast to the conventional method where the optimal\nsolution is based on unobserved quantities which are estimated, leading to\nsuboptimality. We also obtain the expressions for the weights of the global\nminimum VaR and CVaR portfolios, and specify conditions for their existence. It\nis shown that these portfolios may not exist if the confidence level used for\nthe VaR or CVaR computation are too low. Moreover, analytical expressions for\nthe mean-VaR and mean-CVaR efficient frontiers are presented and the extension\nof theoretical results to general coherent risk measures is provided. One of\nthe main advantages of the suggested Bayesian approach is that the theoretical\nresults are derived in the finite-sample case and thus they are exact and can\nbe applied to large-dimensional portfolios.\n  By using simulation and real market data, we compare the new Bayesian\napproach to the conventional method by studying the performance and existence\nof the global minimum VaR portfolio and by analysing the estimated efficient\nfrontiers. It is concluded that the Bayesian approach outperforms the\nconventional one, in particular at predicting the out-of-sample VaR.\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2020 10:52:33 GMT"}], "update_date": "2020-12-04", "authors_parsed": [["Bodnar", "Taras", ""], ["Lindholm", "Mathias", ""], ["Niklasson", "Vilhelm", ""], ["Thorsén", "Erik", ""]]}, {"id": "2012.02277", "submitter": "Bahman Angoshtari", "authors": "Bahman Angoshtari, Erhan Bayraktar, Virginia R. Young", "title": "Optimal Consumption under a Habit-Formation Constraint", "comments": "35 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new optimal consumption model in which the degree of\naddictiveness of habit formation is directly controlled through a consumption\nconstraint. In particular, we assume that the individual is unwilling to\nconsume at a rate below a certain proportion $0<\\alpha\\le1$ of her consumption\nhabit, which is the exponentially-weighted average of past consumption rates.\n$\\alpha=1$ prohibits the habit process to decrease and corresponds to the\ncompletely addictive model. $\\alpha=0$ makes the habit-formation constraint\nmoot and corresponds to the non-addictive model. $0<\\alpha<1$ leads to\npartially addictive models, with the level of addictiveness increasing with\n$\\alpha$. In contrast to the existing habit-formation literature, our\nconstraint cannot be incorporated in the objective function through infinite\nmarginal utility. Assuming that the individual invests in a risk-free market,\nwe formulate and solve an infinite-horizon, deterministic control problem to\nmaximize the discounted CRRA utility of the consumption-to-habit process\nsubject to the habit-formation constraint. Optimal consumption policies are\nderived explicitly in terms of the solution of a nonlinear free-boundary\nproblem, which we analyze in detail. Impatient always consume above the minimum\nrate; thus, they eventually attain the minimum wealth-to-habit ratio. Patient\nindividuals consume at the minimum rate if their wealth-to-habit ratio is below\na threshold, and above it otherwise. By consuming patiently, these individuals\nmaintain a wealth-to-habit ratio that is greater than the minimum acceptable\nlevel. Additionally, we prove that the optimal consumption path is hump-shaped\nif the initial wealth-to-habit ratio is either: (1) larger than a high\nthreshold; or (2) below a low threshold and the agent is less risk averse.\nThus, we provide a simple explanation for the consumption hump observed by\nvarious empirical studies.\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2020 21:29:27 GMT"}, {"version": "v2", "created": "Tue, 11 May 2021 18:20:42 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Angoshtari", "Bahman", ""], ["Bayraktar", "Erhan", ""], ["Young", "Virginia R.", ""]]}, {"id": "2012.04500", "submitter": "Sebastian Jaimungal", "authors": "Silvana Pesenti and Sebastian Jaimungal", "title": "Portfolio Optimisation within a Wasserstein Ball", "comments": "37 pages, 2 tables, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM q-fin.RM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the problem of active portfolio management where an investor aims to\noutperform a benchmark strategy's risk profile while not deviating too far from\nit. Specifically, an investor considers alternative strategies whose terminal\nwealth lie within a Wasserstein ball surrounding a benchmark's -- being\ndistributionally close -- and that have a specified dependence/copula -- tying\nstate-by-state outcomes -- to it. The investor then chooses the alternative\nstrategy that minimises a distortion risk measure of terminal wealth. In a\ngeneral (complete) market model, we prove that an optimal dynamic strategy\nexists and provide its characterisation through the notion of isotonic\nprojections.\n  We further propose a simulation approach to calculate the optimal strategy's\nterminal wealth, making our approach applicable to a wide range of market\nmodels. Finally, we illustrate how investors with different copula and risk\npreferences invest and improve upon the benchmark using the Tail Value-at-Risk,\ninverse S-shaped, and lower- and upper-tail distortion risk measures as\nexamples. We find that investors' optimal terminal wealth distribution has\nlarger probability masses in regions that reduce their risk measure relative to\nthe benchmark while preserving the benchmark's structure.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2020 15:38:05 GMT"}, {"version": "v2", "created": "Mon, 31 May 2021 17:28:33 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Pesenti", "Silvana", ""], ["Jaimungal", "Sebastian", ""]]}, {"id": "2012.05088", "submitter": "Apostolos Chalkis", "authors": "Apostolos Chalkis and Ioannis Z. Emiris", "title": "Modeling asset allocation strategies and a new portfolio performance\n  score", "comments": "16 pages, 4 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.CG stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss a powerful, geometric representation of financial portfolios and\nstock markets, which identifies the space of portfolios with the points lying\nin a simplex convex polytope. The ambient space has dimension equal to the\nnumber of stocks, or assets. Although our statistical tools are quite general,\nin this paper we focus on the problem of portfolio scoring. Our contribution is\nto introduce an original computational framework to model portfolio allocation\nstrategies, which is of independent interest for computational finance. To\nmodel asset allocation strategies, we employ log-concave distributions centered\non portfolio benchmarks. Our approach addresses the crucial question of\nevaluating portfolio management, and is relevant to the individual private\ninvestors as well as financial organizations. We evaluate the performance of an\nallocation, in a certain time period, by providing a new portfolio score, based\non the aforementioned framework and concepts. In particular, it relies on the\nexpected proportion of actually invested portfolios that it outperforms when a\ncertain set of strategies take place in that time period. We also discuss how\nthis set of strategies -- and the knowledge one may have about them -- could\nvary in our framework, and we provide additional versions of our score in order\nto obtain a more complete picture of its performance. In all cases, we show\nthat the score computations can be performed efficiently. Last but not least,\nwe expect this framework to be useful in portfolio optimization and in\nautomatically identifying extreme phenomena in a stock market.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2020 14:44:02 GMT"}, {"version": "v2", "created": "Thu, 10 Dec 2020 11:02:45 GMT"}], "update_date": "2020-12-11", "authors_parsed": [["Chalkis", "Apostolos", ""], ["Emiris", "Ioannis Z.", ""]]}, {"id": "2012.06173", "submitter": "\\c{C}a\\u{g}{\\i}n Ararat", "authors": "\\c{C}a\\u{g}{\\i}n Ararat", "title": "Portfolio optimization with two quasiconvex risk measures", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a static portfolio optimization problem with two risk measures: a\nprinciple risk measure in the objective function and a secondary risk measure\nwhose value is controlled in the constraints. This problem is of interest when\nit is necessary to consider the risk preferences of two parties, such as a\nportfolio manager and a regulator, at the same time. A special case of this\nproblem where the risk measures are assumed to be coherent (positively\nhomogeneous) is studied recently in a joint work of the author. The present\npaper extends the analysis to a more general setting by assuming that the two\nrisk measures are only quasiconvex. First, we study the case where the\nprincipal risk measure is convex. We introduce a dual problem, show that there\nis zero duality gap between the portfolio optimization problem and the dual\nproblem, and finally identify a condition under which the Lagrange multiplier\nassociated to the dual problem at optimality gives an optimal portfolio. Next,\nwe study the general case without the convexity assumption and show that an\napproximately optimal solution with prescribed optimality gap can be achieved\nby using the well-known bisection algorithm combined with a duality result that\nwe prove.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2020 07:40:36 GMT"}], "update_date": "2020-12-14", "authors_parsed": [["Ararat", "Çağın", ""]]}, {"id": "2012.06703", "submitter": "Bin Zou", "authors": "Zhuo Jin, Zuo Quan Xu, and Bin Zou", "title": "A Perturbation Approach to Optimal Investment, Liability Ratio, and\n  Dividend Strategies", "comments": "29 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an optimal dividend problem for an insurer who simultaneously\ncontrols investment weights in a financial market, liability ratio in the\ninsurance business, and dividend payout rate. The insurer seeks an optimal\nstrategy to maximize her expected utility of dividend payments over an infinite\nhorizon. By applying a perturbation approach, we obtain the optimal strategy\nand the value function in closed form for log and power utility. We conduct an\neconomic analysis to investigate the impact of various model parameters and\nrisk aversion on the insurer's optimal strategy.\n", "versions": [{"version": "v1", "created": "Sat, 12 Dec 2020 02:23:22 GMT"}, {"version": "v2", "created": "Wed, 26 May 2021 15:32:23 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Jin", "Zhuo", ""], ["Xu", "Zuo Quan", ""], ["Zou", "Bin", ""]]}, {"id": "2012.07149", "submitter": "Daniel Poh", "authors": "Daniel Poh, Bryan Lim, Stefan Zohren and Stephen Roberts", "title": "Building Cross-Sectional Systematic Strategies By Learning to Rank", "comments": "12 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.IR cs.LG q-fin.PM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The success of a cross-sectional systematic strategy depends critically on\naccurately ranking assets prior to portfolio construction. Contemporary\ntechniques perform this ranking step either with simple heuristics or by\nsorting outputs from standard regression or classification models, which have\nbeen demonstrated to be sub-optimal for ranking in other domains (e.g.\ninformation retrieval). To address this deficiency, we propose a framework to\nenhance cross-sectional portfolios by incorporating learning-to-rank\nalgorithms, which lead to improvements of ranking accuracy by learning pairwise\nand listwise structures across instruments. Using cross-sectional momentum as a\ndemonstrative case study, we show that the use of modern machine learning\nranking algorithms can substantially improve the trading performance of\ncross-sectional strategies -- providing approximately threefold boosting of\nSharpe Ratios compared to traditional approaches.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2020 20:52:35 GMT"}], "update_date": "2020-12-15", "authors_parsed": [["Poh", "Daniel", ""], ["Lim", "Bryan", ""], ["Zohren", "Stefan", ""], ["Roberts", "Stephen", ""]]}, {"id": "2012.07245", "submitter": "Kentaro Minami", "authors": "Kentaro Imajo and Kentaro Minami and Katsuya Ito and Kei Nakagawa", "title": "Deep Portfolio Optimization via Distributional Prediction of Residual\n  Factors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent developments in deep learning techniques have motivated intensive\nresearch in machine learning-aided stock trading strategies. However, since the\nfinancial market has a highly non-stationary nature hindering the application\nof typical data-hungry machine learning methods, leveraging financial inductive\nbiases is important to ensure better sample efficiency and robustness. In this\nstudy, we propose a novel method of constructing a portfolio based on\npredicting the distribution of a financial quantity called residual factors,\nwhich is known to be generally useful for hedging the risk exposure to common\nmarket factors. The key technical ingredients are twofold. First, we introduce\na computationally efficient extraction method for the residual information,\nwhich can be easily combined with various prediction algorithms. Second, we\npropose a novel neural network architecture that allows us to incorporate\nwidely acknowledged financial inductive biases such as amplitude invariance and\ntime-scale invariance. We demonstrate the efficacy of our method on U.S. and\nJapanese stock market data. Through ablation experiments, we also verify that\neach individual technique contributes to improving the performance of trading\nstrategies. We anticipate our techniques may have wide applications in various\nfinancial problems.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2020 04:09:52 GMT"}], "update_date": "2020-12-15", "authors_parsed": [["Imajo", "Kentaro", ""], ["Minami", "Kentaro", ""], ["Ito", "Katsuya", ""], ["Nakagawa", "Kei", ""]]}, {"id": "2012.07368", "submitter": "Yuanyuan Chen", "authors": "Hezhi Luo, Yuanyuan Chen, Xianye Zhang, Duan Li (deceased), Huixian Wu", "title": "Effective Algorithms for Optimal Portfolio Deleveraging Problem with\n  Cross Impact", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the optimal portfolio deleveraging (OPD) problem with\npermanent and temporary price impacts, where the objective is to maximize\nequity while meeting a prescribed debt/equity requirement. We take the real\nsituation with cross impact among different assets into consideration. The\nresulting problem is, however, a non-convex quadratic program with a quadratic\nconstraint and a box constraint, which is known to be NP-hard. In this paper,\nwe first develop a successive convex optimization (SCO) approach for solving\nthe OPD problem and show that the SCO algorithm converges to a KKT point of its\ntransformed problem. Second, we propose an effective global algorithm for the\nOPD problem, which integrates the SCO method, simple convex relaxation and a\nbranch-and-bound framework, to identify a global optimal solution to the OPD\nproblem within a pre-specified $\\epsilon$-tolerance. We establish the global\nconvergence of our algorithm and estimate its complexity. We also conduct\nnumerical experiments to demonstrate the effectiveness of our proposed\nalgorithms with both the real data and the randomly generated medium- and\nlarge-scale OPD problem instances.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2020 09:40:32 GMT"}, {"version": "v2", "created": "Fri, 15 Jan 2021 10:35:47 GMT"}], "update_date": "2021-01-18", "authors_parsed": [["Luo", "Hezhi", "", "deceased"], ["Chen", "Yuanyuan", "", "deceased"], ["Zhang", "Xianye", "", "deceased"], ["Li", "Duan", "", "deceased"], ["Wu", "Huixian", ""]]}, {"id": "2012.10632", "submitter": "Hansjoerg Albrecher", "authors": "Hansjoerg Albrecher and Pablo Azcue and Nora Muler", "title": "Optimal ratcheting of dividends in a Brownian risk model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of optimal dividend payout from a surplus process\ngoverned by Brownian motion with drift under the additional constraint of\nratcheting, i.e. the dividend rate can never decrease. We solve the resulting\ntwo-dimensional optimal control problem, identifying the value function to be\nthe unique viscosity solution of the corresponding Hamilton-Jacobi-Bellman\nequation. For finitely many admissible dividend rates we prove that threshold\nstrategies are optimal, and for any finite continuum of admissible dividend\nrates we establish the $\\varepsilon$-optimality of curve strategies. This work\nis a counterpart of Albrecher et al. (2020), where the ratcheting problem was\nstudied for a compound Poisson surplus process with drift. In the present\nBrownian setup, calculus of variation techniques allow to obtain a much more\nexplicit analysis and description of the optimal dividend strategies. We also\ngive some numerical illustrations of the optimality results.\n", "versions": [{"version": "v1", "created": "Sat, 19 Dec 2020 08:53:47 GMT"}], "update_date": "2020-12-22", "authors_parsed": [["Albrecher", "Hansjoerg", ""], ["Azcue", "Pablo", ""], ["Muler", "Nora", ""]]}, {"id": "2012.11715", "submitter": "Nymisha Bandi", "authors": "Nymisha Bandi and Theja Tulabandhula", "title": "Off-Policy Optimization of Portfolio Allocation Policies under\n  Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI q-fin.PM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The dynamic portfolio optimization problem in finance frequently requires\nlearning policies that adhere to various constraints, driven by investor\npreferences and risk. We motivate this problem of finding an allocation policy\nwithin a sequential decision making framework and study the effects of: (a)\nusing data collected under previously employed policies, which may be\nsub-optimal and constraint-violating, and (b) imposing desired constraints\nwhile computing near-optimal policies with this data. Our framework relies on\nsolving a minimax objective, where one player evaluates policies via off-policy\nestimators, and the opponent uses an online learning strategy to control\nconstraint violations. We extensively investigate various choices for\noff-policy estimation and their corresponding optimization sub-routines, and\nquantify their impact on computing constraint-aware allocation policies. Our\nstudy shows promising results for constructing such policies when back-tested\non historical equities data, under various regimes of operation, dimensionality\nand constraints.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2020 22:22:04 GMT"}], "update_date": "2020-12-23", "authors_parsed": [["Bandi", "Nymisha", ""], ["Tulabandhula", "Theja", ""]]}, {"id": "2012.11972", "submitter": "Gabriela Kov\\'a\\v{c}ov\\'a", "authors": "Gabriela Kov\\'a\\v{c}ov\\'a, Birgit Rudloff, Igor Cialenco", "title": "Acceptability maximization", "comments": "31 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this paper is to study the optimal investment problem by using\ncoherent acceptability indices (CAIs) as a tool to measure the portfolio\nperformance. We call this problem the acceptability maximization. First, we\nstudy the one-period (static) case, and propose a numerical algorithm that\napproximates the original problem by a sequence of risk minimization problems.\nThe results are applied to several important CAIs, such as the gain-to-loss\nratio, the risk-adjusted return on capital and the tail-value-at-risk based\nCAI. In the second part of the paper we investigate the acceptability\nmaximization in a discrete time dynamic setup. Using robust representations of\nCAIs in terms of a family of dynamic coherent risk measures (DCRMs), we\nestablish an intriguing dichotomy: if the corresponding family of DCRMs is\nrecursive (i.e. strongly time consistent) and assuming some recursive structure\nof the market model, then the acceptability maximization problem reduces to\njust a one period problem and the maximal acceptability is constant across all\nstates and times. On the other hand, if the family of DCRMs is not recursive,\nwhich is often the case, then the acceptability maximization problem ordinarily\nis a time-inconsistent stochastic control problem, similar to the classical\nmean-variance criteria. To overcome this form of time-inconsistency, we adapt\nto our setup the set-valued Bellman's principle recently proposed in\n\\cite{KovacovaRudloff2019} applied to two particular dynamic CAIs - the dynamic\nrisk-adjusted return on capital and the dynamic gain-to-loss ratio. The\nobtained theoretical results are illustrated via numerical examples that\ninclude, in particular, the computation of the intermediate mean-risk efficient\nfrontiers.\n", "versions": [{"version": "v1", "created": "Tue, 22 Dec 2020 12:51:42 GMT"}], "update_date": "2020-12-23", "authors_parsed": [["Kováčová", "Gabriela", ""], ["Rudloff", "Birgit", ""], ["Cialenco", "Igor", ""]]}, {"id": "2012.13773", "submitter": "Gang Huang", "authors": "Gang Huang, Xiaohua Zhou, Qingyang Song", "title": "Deep reinforcement learning for portfolio management based on the\n  empirical study of chinese stock market", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.LG q-fin.PM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  According to documents, there has not been a completely artificial\nintelligence framework with shorting mechanism in continuous action space for\nportfolio optimization. The objective of this paper is to verify that current\ncutting-edge technology, deep reinforcement learning, can be applied in\nportfolio management and help us get artificial intelligence. We improve on the\nexisting Deep Reinforcement Learning Portfolio model and make many innovations,\nsuch as adding short mechanism, designing an arbitrage mechanism. In\nexperiments, we use our model in several randomly selected portfolios, the\nresults show we can get artificial intelligence and defeat market through deep\nreinforcement learning.\n", "versions": [{"version": "v1", "created": "Sat, 26 Dec 2020 16:25:20 GMT"}, {"version": "v2", "created": "Sun, 3 Jan 2021 16:42:57 GMT"}, {"version": "v3", "created": "Sun, 10 Jan 2021 12:50:09 GMT"}, {"version": "v4", "created": "Mon, 19 Apr 2021 16:25:09 GMT"}, {"version": "v5", "created": "Wed, 28 Apr 2021 14:55:36 GMT"}], "update_date": "2021-04-29", "authors_parsed": [["Huang", "Gang", ""], ["Zhou", "Xiaohua", ""], ["Song", "Qingyang", ""]]}, {"id": "2012.13830", "submitter": "Alexei Kitaev", "authors": "Stanislav Shalunov, Alexei Kitaev, Yakov Shalunov, Arseniy Akopyan", "title": "Calculated Boldness: Optimizing Financial Decisions with Illiquid Assets", "comments": "16 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM econ.TH physics.bio-ph q-fin.RM", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We consider games of chance played by someone with external capital that\ncannot be applied to the game and determine how this affects risk-adjusted\noptimal betting. Specifically, we focus on Kelly optimization as a metric,\noptimizing the expected logarithm of total capital including both capital in\nplay and the external capital. For games with multiple rounds, we determine the\noptimal strategy through dynamic programming and construct a close\napproximation through the WKB method. The strategy can be described in terms of\nshort-term utility functions, with risk aversion depending on the ratio of the\namount in the game to the external money. Thus, a rational player's behavior\nvaries between conservative play that approaches Kelly strategy as they are\nable to invest a larger fraction of total wealth and extremely aggressive play\nthat maximizes linear expectation when a larger portion of their capital is\nlocked away. Because you always have expected future productivity to account\nfor as external resources, this goes counter to the conventional wisdom that\nsuper-Kelly betting is a ruinous proposition.\n", "versions": [{"version": "v1", "created": "Sat, 26 Dec 2020 23:33:33 GMT"}], "update_date": "2020-12-29", "authors_parsed": [["Shalunov", "Stanislav", ""], ["Kitaev", "Alexei", ""], ["Shalunov", "Yakov", ""], ["Akopyan", "Arseniy", ""]]}]