[{"id": "2107.00427", "submitter": "Wolfgang Schadner", "authors": "Wolfgang Schadner", "title": "Feasible Implied Correlation Matrices from Factor Structures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF econ.EM q-fin.CP q-fin.PM q-fin.ST", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Forward-looking correlations are of interest in different financial\napplications, including factor-based asset pricing, forecasting stock-price\nmovements or pricing index options. With a focus on non-FX markets, this paper\ndefines necessary conditions for option implied correlation matrices to be\nmathematically and economically feasible and argues, that existing models are\ntypically not capable of guaranteeing so. To overcome this difficulty, the\nproblem is addressed from the underlying factor structure and introduces two\napproaches to solve it. Under the quantitative approach, the puzzle is\nreformulated into a nearest correlation matrix problem which can be used either\nas a stand-alone estimate or to re-establish positive-semi-definiteness of any\nother model's estimate. From an economic approach, it is discussed how expected\ncorrelations between stocks and risk factors (like CAPM, Fama-French) can be\ntranslated into a feasible implied correlation matrix. Empirical experiments\nare carried out on monthly option data of the S\\&P 100 and S\\&P 500 index\n(1996-2020).\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2021 13:18:01 GMT"}], "update_date": "2021-07-02", "authors_parsed": [["Schadner", "Wolfgang", ""]]}, {"id": "2107.01352", "submitter": "Andrzej Jarosz", "authors": "Zdzislaw Burda and Andrzej Jarosz", "title": "Cleaning large-dimensional covariance matrices for correlated samples", "comments": "5 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math-ph math.MP math.ST q-fin.PM stat.TH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A non-linear shrinkage estimator of large-dimensional covariance matrices is\nderived in a setting of auto-correlated samples, thus generalizing the recent\nformula by Ledoit-P\\'{e}ch\\'{e}. The calculation is facilitated by random\nmatrix theory. The result is turned into an efficient algorithm, and an\nassociated Python library, shrinkage, with help of Ledoit-Wolf kernel\nestimation technique. An example of exponentially-decaying auto-correlations is\npresented.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jul 2021 06:19:46 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Burda", "Zdzislaw", ""], ["Jarosz", "Andrzej", ""]]}, {"id": "2107.03340", "submitter": "Wing Fung Chong", "authors": "Wing Fung Chong and Haoen Cui and Yuxuan Li", "title": "Pseudo-Model-Free Hedging for Variable Annuities via Deep Reinforcement\n  Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.PM", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper applies a deep reinforcement learning approach to revisit the\nhedging problem of variable annuities. Instead of assuming actuarial and\nfinancial dual-market model a priori, the reinforcement learning agent learns\nhow to hedge by collecting anchor-hedging reward signals through interactions\nwith the market. By the recently advanced proximal policy optimization, the\npseudo-model-free reinforcement learning agent performs equally well as the\ncorrect Delta, while outperforms the misspecified Deltas. The reinforcement\nlearning agent is also integrated with online learning to demonstrate its full\nadaptive capability to the market.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 16:31:06 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Chong", "Wing Fung", ""], ["Cui", "Haoen", ""], ["Li", "Yuxuan", ""]]}, {"id": "2107.04636", "submitter": "Ayse Sinem Uysal", "authors": "Ayse Sinem Uysal, Xiaoyue Li, and John M. Mulvey", "title": "End-to-End Risk Budgeting Portfolio Optimization with Neural Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.CP", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Portfolio optimization has been a central problem in finance, often\napproached with two steps: calibrating the parameters and then solving an\noptimization problem. Yet, the two-step procedure sometimes encounter the\n\"error maximization\" problem where inaccuracy in parameter estimation\ntranslates to unwise allocation decisions. In this paper, we combine the\nprediction and optimization tasks in a single feed-forward neural network and\nimplement an end-to-end approach, where we learn the portfolio allocation\ndirectly from the input features. Two end-to-end portfolio constructions are\nincluded: a model-free network and a model-based network. The model-free\napproach is seen as a black-box, whereas in the model-based approach, we learn\nthe optimal risk contribution on the assets and solve the allocation with an\nimplicit optimization layer embedded in the neural network. The model-based\nend-to-end framework provides robust performance in the out-of-sample\n(2017-2021) tests when maximizing Sharpe ratio is used as the training\nobjective function, achieving a Sharpe ratio of 1.16 when nominal risk parity\nyields 0.79 and equal-weight fix-mix yields 0.83. Noticing that risk-based\nportfolios can be sensitive to the underlying asset universe, we develop an\nasset selection mechanism embedded in the neural network with stochastic gates,\nin order to prevent the portfolio being hurt by the low-volatility assets with\nlow returns. The gated end-to-end with filter outperforms the nominal\nrisk-parity benchmarks with naive filtering mechanism, boosting the Sharpe\nratio of the out-of-sample period (2017-2021) to 1.24 in the market data.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 19:13:07 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Uysal", "Ayse Sinem", ""], ["Li", "Xiaoyue", ""], ["Mulvey", "John M.", ""]]}, {"id": "2107.05359", "submitter": "P\\'al Andr\\'as Papp", "authors": "P\\'al Andr\\'as Papp, Roger Wattenhofer", "title": "Debt Swapping for Risk Mitigation in Financial Networks", "comments": null, "journal-ref": null, "doi": "10.1145/3465456.3467638", "report-no": null, "categories": "q-fin.RM cs.CE q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study financial networks where banks are connected by debt contracts. We\nconsider the operation of debt swapping when two creditor banks decide to\nexchange an incoming payment obligation, thus leading to a locally different\nnetwork structure. We say that a swap is positive if it is beneficial for both\nof the banks involved; we can interpret this notion either with respect to the\namount of assets received by the banks, or their exposure to different shocks\nthat might hit the system.\n  We analyze various properties of these swapping operations in financial\nnetworks. We first show that there can be no positive swap for any pair of\nbanks in a static financial system, or when a shock hits each bank in the\nnetwork proportionally. We then study worst-case shock models, when a shock of\ngiven size is distributed in the worst possible way for a specific bank. If the\ngoal of banks is to minimize their losses in such a worst-case setting, then a\npositive swap can indeed exist. We analyze the effects of such a positive swap\non other banks of the system, the computational complexity of finding a swap,\nand special cases where a swap can be found efficiently. Finally, we also\npresent some results for more complex swapping operations when the banks swap\nmultiple contracts, or when more than two banks participate in the swap.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jun 2021 12:42:34 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Papp", "Pál András", ""], ["Wattenhofer", "Roger", ""]]}, {"id": "2107.05535", "submitter": "Nicklas Werge", "authors": "Nicklas Werge", "title": "Predicting Risk-adjusted Returns using an Asset Independent\n  Regime-switching Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.CE cs.LG q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial markets tend to switch between various market regimes over time,\nmaking stationarity-based models unsustainable. We construct a regime-switching\nmodel independent of asset classes for risk-adjusted return predictions based\non hidden Markov models. This framework can distinguish between market regimes\nin a wide range of financial markets such as the commodity, currency, stock,\nand fixed income market. The proposed method employs sticky features that\ndirectly affect the regime stickiness and thereby changing turnover levels. An\ninvestigation of our metric for risk-adjusted return predictions is conducted\nby analyzing daily financial market changes for almost twenty years. Empirical\ndemonstrations of out-of-sample observations obtain an accurate detection of\nbull, bear, and high volatility periods, improving risk-adjusted returns while\nkeeping a preferable turnover level.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 10:23:59 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Werge", "Nicklas", ""]]}, {"id": "2107.06194", "submitter": "Lara Dalmeyer", "authors": "Lara Dalmeyer and Tim Gebbie", "title": "Geometric insights into robust portfolio construction with gearing", "comments": "18 pages, 5 Figures, 3 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We investigate and extend the results of Golts and Jones (2009) that an\n$\\alpha$-weight angle resulting from unconstrained quadratic portfolio\noptimisations has an upper bound dependent on the condition number of the\ncovariance matrix. This implies that better conditioned covariance matrices\nproduce weights from unconstrained mean-variance optimisations that are better\naligned with each assets expected return. We provide further clarity on the\nmathematical insights that relate the inequality between the $\\alpha$-weight\nangle and the condition number and extend the result to include portfolio\noptimisations with gearing constraints. We provide an extended family of robust\noptimisations that include the gearing constraints, and discuss their\ninterpretation.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 15:49:56 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2021 14:09:34 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Dalmeyer", "Lara", ""], ["Gebbie", "Tim", ""]]}, {"id": "2107.06460", "submitter": "Yang Liu", "authors": "Zongxia Liang, Yang Liu, Ming Ma", "title": "A Unified Formula of the Optimal Portfolio for Piecewise HARA Utilities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.OC q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general family of piecewise hyperbolic absolute risk aversion\n(PHARA) utility, including many non-standard utilities as examples. A typical\napplication is the composition of an HARA preference and a piecewise linear\npayoff in hedge fund management. We derive a unified closed-form formula of the\noptimal portfolio, which is a four-term division. The formula has clear\neconomic meanings, reflecting the behavior of risk aversion, risk seeking, loss\naversion and first-order risk aversion. One main finding is that risk-taking\nbehaviors are greatly increased by non-concavity and reduced by\nnon-differentiability.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2021 02:51:12 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Liang", "Zongxia", ""], ["Liu", "Yang", ""], ["Ma", "Ming", ""]]}, {"id": "2107.06593", "submitter": "Joseph Jerome", "authors": "David Hobson, Martin Herdegen, Joseph Jerome", "title": "The Infinite Horizon Investment-Consumption Problem for Epstein-Zin\n  Stochastic Differential Utility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In this article we consider the optimal investment-consumption problem for an\nagent with preferences governed by Epstein-Zin stochastic differential utility\nwho invests in a constant-parameter Black-Scholes-Merton market.\n  The paper has three main goals: first, to provide a detailed introduction to\ninfinite-horizon Epstein-Zin stochastic differential utility, including a\ndiscussion of which parameter combinations lead to a well-formulated problem;\nsecond, to prove existence and uniqueness of infinite horizon Epstein-Zin\nstochastic differential utility under a restriction on the parameters governing\nthe agent's risk aversion and temporal variance aversion; and third, to provide\na verification argument for the candidate optimal solution to the\ninvestment-consumption problem among all admissible consumption streams.\n  To achieve these goals, we introduce a slightly different formulation of\nEpstein-Zin stochastic differential utility to that which is traditionally used\nin the literature. This formulation highlights the necessity and\nappropriateness of certain restrictions on the parameters governing the\nstochastic differential utility function.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2021 10:34:28 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Hobson", "David", ""], ["Herdegen", "Martin", ""], ["Jerome", "Joseph", ""]]}, {"id": "2107.07339", "submitter": "Luis Zuluaga", "authors": "Onur Babat and Juan C. Vera and Luis F. Zuluaga", "title": "Computing near-optimal Value-at-Risk portfolios using Integer\n  Programming techniques", "comments": "21 pages, 7 figures", "journal-ref": "BEuropean Journal of Operational Research, 266(1), 304-315 (2018)", "doi": "10.1016/j.ejor.2017.09.009", "report-no": null, "categories": "q-fin.PM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Value-at-Risk (VaR) is one of the main regulatory tools used for risk\nmanagement purposes. However, it is difficult to compute optimal VaR\nportfolios; that is, an optimal risk-reward portfolio allocation using VaR as\nthe risk measure. This is due to VaR being non-convex and of combinatorial\nnature. In particular, it is well known that the VaR portfolio problem can be\nformulated as a mixed integer linear program (MILP) that is difficult to solve\nwith current MILP solvers for medium to large-scale instances of the problem.\nHere, we present an algorithm to compute near-optimal VaR portfolios that takes\nadvantage of this MILP formulation and provides a guarantee of the solution's\nnear-optimality. As a byproduct, we obtain an algorithm to compute tight lower\nbounds on the VaR portfolio problem that outperform related algorithms proposed\nin the literature for this purpose. The near-optimality guarantee provided by\nthe proposed algorithm is obtained thanks to the relation between minimum risk\nportfolios satisfying a reward benchmark and the corresponding maximum reward\nportfolios satisfying a risk benchmark. These alternate formulations of the\nportfolio allocation problem have been frequently studied in the case of convex\nrisk measures and concave reward functions. Here, this relationship is\nconsidered for general risk measures and reward functions. To illustrate the\nefficiency of the presented algorithm, numerical results are presented using\nhistorical asset returns from the US financial market.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2021 22:20:46 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Babat", "Onur", ""], ["Vera", "Juan C.", ""], ["Zuluaga", "Luis F.", ""]]}, {"id": "2107.08721", "submitter": "Qinkai Chen", "authors": "Qinkai Chen", "title": "Stock Movement Prediction with Financial News using Contextualized\n  Embedding from BERT", "comments": "22 pages, 6 figures, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.CL cs.LG q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  News events can greatly influence equity markets. In this paper, we are\ninterested in predicting the short-term movement of stock prices after\nfinancial news events using only the headlines of the news. To achieve this\ngoal, we introduce a new text mining method called Fine-Tuned\nContextualized-Embedding Recurrent Neural Network (FT-CE-RNN). Compared with\nprevious approaches which use static vector representations of the news (static\nembedding), our model uses contextualized vector representations of the\nheadlines (contextualized embeddings) generated from Bidirectional Encoder\nRepresentations from Transformers (BERT). Our model obtains the\nstate-of-the-art result on this stock movement prediction task. It shows\nsignificant improvement compared with other baseline models, in both accuracy\nand trading simulations. Through various trading simulations based on millions\nof headlines from Bloomberg News, we demonstrate the ability of this model in\nreal scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 09:47:28 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Chen", "Qinkai", ""]]}, {"id": "2107.08827", "submitter": "Gustav Sourek", "authors": "Matej Uhr\\'in, Gustav \\v{S}ourek, Ond\\v{r}ej Hub\\'a\\v{c}ek, Filip\n  \\v{Z}elezn\\'y", "title": "Optimal sports betting strategies in practice: an experimental review", "comments": "Accepted to IMA Journal of Management Mathematics where it, however,\n  appeared with swapped names and surnames - putting the correct version here\n  for reference", "journal-ref": "IMA Journal of Management Mathematics (2021) 00", "doi": "10.1093/imaman/dpaa029", "report-no": null, "categories": "q-fin.PM cs.CE q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the most popular approaches to the problem of sports betting\ninvestment based on modern portfolio theory and the Kelly criterion. We define\nthe problem setting, the formal investment strategies, and review their common\nmodifications used in practice. The underlying purpose of the reviewed\nmodifications is to mitigate the additional risk stemming from the unrealistic\nmathematical assumptions of the formal strategies. We test the resulting\nmethods using a unified evaluation protocol for three sports: horse racing,\nbasketball and soccer. The results show the practical necessity of the\nadditional risk-control methods and demonstrate their individual benefits.\nParticularly, we show that an adaptive variant of the popular ``fractional\nKelly'' method is a very suitable choice across a wide range of settings.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jul 2021 15:09:47 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Uhrín", "Matej", ""], ["Šourek", "Gustav", ""], ["Hubáček", "Ondřej", ""], ["Železný", "Filip", ""]]}, {"id": "2107.11371", "submitter": "Jaydip Sen", "authors": "Jaydip Sen and Sidra Mehtab", "title": "Optimum Risk Portfolio and Eigen Portfolio: A Comparative Analysis Using\n  Selected Stocks from the Indian Stock Market", "comments": "The is the preprint of our accepted paper in the journal\n  International Journal of Business Forecasting and Marketing Intelligence\n  published by Inderscience Publishers, Switzerland. It consists of 35 pages,\n  and includes 29 figures and 36 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.LG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing an optimum portfolio that allocates weights to its constituent\nstocks in a way that achieves the best trade-off between the return and the\nrisk is a challenging research problem. The classical mean-variance theory of\nportfolio proposed by Markowitz is found to perform sub-optimally on the\nreal-world stock market data since the error in estimation for the expected\nreturns adversely affects the performance of the portfolio. This paper presents\nthree approaches to portfolio design, viz, the minimum risk portfolio, the\noptimum risk portfolio, and the Eigen portfolio, for seven important sectors of\nthe Indian stock market. The daily historical prices of the stocks are scraped\nfrom Yahoo Finance website from January 1, 2016, to December 31, 2020. Three\nportfolios are built for each of the seven sectors chosen for this study, and\nthe portfolios are analyzed on the training data based on several metrics such\nas annualized return and risk, weights assigned to the constituent stocks, the\ncorrelation heatmaps, and the principal components of the Eigen portfolios.\nFinally, the optimum risk portfolios and the Eigen portfolios for all sectors\nare tested on their return over a period of a six-month period. The\nperformances of the portfolios are compared and the portfolio yielding the\nhigher return for each sector is identified.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2021 17:50:45 GMT"}], "update_date": "2021-07-26", "authors_parsed": [["Sen", "Jaydip", ""], ["Mehtab", "Sidra", ""]]}, {"id": "2107.12041", "submitter": "Carol Alexander Prof.", "authors": "Carol Alexander and Arben Imeraj", "title": "Inverse Options in a Black-Scholes World", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF q-fin.PM q-fin.TR", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Most trading in cryptocurrency options is on inverse products, so called\nbecause the contract size is denominated in US dollars and they are margined\nand settled in crypto, typically bitcoin or ether. Their popularity stems from\nallowing professional traders in bitcoin or ether options to avoid transferring\nfiat currency to and from the exchanges. We derive new analytic pricing and\nhedging formulae for inverse options under the assumption that the underlying\nfollows a geometric Brownian motion. The boundary conditions and hedge ratios\nexhibit relatively complex but very important new features which warrant\nfurther analysis and explanation. We also illustrate some inconsistencies,\nexhibited in time series of Deribit bitcoin option implied volatilities, which\nindicate that traders may be applying direct option hedging and valuation\nmethods erroneously. This could be because they are unaware of the correct,\ninverse option characteristics which are derived in this paper.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2021 08:57:56 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Alexander", "Carol", ""], ["Imeraj", "Arben", ""]]}, {"id": "2107.13866", "submitter": "Iason Kynigakis", "authors": "Thomas Conlon, John Cotter, Iason Kynigakis", "title": "Machine Learning and Factor-Based Portfolio Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM econ.EM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We examine machine learning and factor-based portfolio optimization. We find\nthat factors based on autoencoder neural networks exhibit a weaker relationship\nwith commonly used characteristic-sorted portfolios than popular dimensionality\nreduction techniques. Machine learning methods also lead to covariance and\nportfolio weight structures that diverge from simpler estimators.\nMinimum-variance portfolios using latent factors derived from autoencoders and\nsparse methods outperform simpler benchmarks in terms of risk minimization.\nThese effects are amplified for investors with an increased sensitivity to\nrisk-adjusted returns, during high volatility periods or when accounting for\ntail risk.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2021 09:58:37 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Conlon", "Thomas", ""], ["Cotter", "John", ""], ["Kynigakis", "Iason", ""]]}]