[{"id": "1209.0053", "submitter": "Nilanjan  Dey", "authors": "Nilanjan Dey, Moumita Pal, Achintya Das", "title": "A Session Based Blind Watermarking Technique within the NROI of Retinal\n  Fundus Images for Authentication Using DWT, Spread Spectrum and Harris Corner\n  Detection", "comments": "9 pages, 10 figures", "journal-ref": "International Journal of Modern Engineering Research\n  (IJMER),Vol.2, Issue.3,May-June 2012 pp-749-757,ISSN: 2249-6645", "doi": null, "report-no": null, "categories": "cs.CV cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Digital Retinal Fundus Images helps to detect various ophthalmic diseases by\ndetecting morphological changes in optical cup, optical disc and macula.\nPresent work proposes a method for the authentication of medical images based\non Discrete Wavelet Transformation (DWT) and Spread Spectrum. Proper selection\nof the Non Region of Interest (NROI) for watermarking is crucial, as the area\nunder concern has to be the least required portion conveying any medical\ninformation. Proposed method discusses both the selection of least impact area\nand the blind watermarking technique. Watermark is embedded within the\nHigh-High (HH) sub band. During embedding, watermarked image is dispersed\nwithin the band using a pseudo random sequence and a Session key. Watermarked\nimage is extracted using the session key and the size of the image. In this\napproach the generated watermarked image having an acceptable level of\nimperceptibility and distortion is compared to the Original retinal image based\non Peak Signal to Noise Ratio (PSNR) and correlation value.\n", "versions": [{"version": "v1", "created": "Sat, 1 Sep 2012 04:17:39 GMT"}], "update_date": "2012-09-04", "authors_parsed": [["Dey", "Nilanjan", ""], ["Pal", "Moumita", ""], ["Das", "Achintya", ""]]}, {"id": "1209.0835", "submitter": "Neil Zhenqiang Gong", "authors": "Neil Zhenqiang Gong, Wenchang Xu, Ling Huang, Prateek Mittal, Emil\n  Stefanov, Vyas Sekar, Dawn Song", "title": "Evolution of Social-Attribute Networks: Measurements, Modeling, and\n  Implications using Google+", "comments": "14 pages, 19 figures. will appear in IMC'12", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding social network structure and evolution has important\nimplications for many aspects of network and system design including\nprovisioning, bootstrapping trust and reputation systems via social networks,\nand defenses against Sybil attacks. Several recent results suggest that\naugmenting the social network structure with user attributes (e.g., location,\nemployer, communities of interest) can provide a more fine-grained\nunderstanding of social networks. However, there have been few studies to\nprovide a systematic understanding of these effects at scale. We bridge this\ngap using a unique dataset collected as the Google+ social network grew over\ntime since its release in late June 2011. We observe novel phenomena with\nrespect to both standard social network metrics and new attribute-related\nmetrics (that we define). We also observe interesting evolutionary patterns as\nGoogle+ went from a bootstrap phase to a steady invitation-only stage before a\npublic release. Based on our empirical observations, we develop a new\ngenerative model to jointly reproduce the social structure and the node\nattributes. Using theoretical analysis and empirical evaluations, we show that\nour model can accurately reproduce the social and attribute structure of real\nsocial networks. We also demonstrate that our model provides more accurate\npredictions for practical application contexts.\n", "versions": [{"version": "v1", "created": "Wed, 5 Sep 2012 01:01:47 GMT"}, {"version": "v2", "created": "Sat, 8 Sep 2012 04:12:28 GMT"}, {"version": "v3", "created": "Tue, 11 Sep 2012 17:17:36 GMT"}, {"version": "v4", "created": "Wed, 19 Sep 2012 02:24:50 GMT"}], "update_date": "2012-09-20", "authors_parsed": [["Gong", "Neil Zhenqiang", ""], ["Xu", "Wenchang", ""], ["Huang", "Ling", ""], ["Mittal", "Prateek", ""], ["Stefanov", "Emil", ""], ["Sekar", "Vyas", ""], ["Song", "Dawn", ""]]}, {"id": "1209.1260", "submitter": "Loet Leydesdorff", "authors": "Fred Y. Ye, Susan S. Yu, Loet Leydesdorff", "title": "The Triple Helix of University-Industry-Government Relations at the\n  Country Level, and Its Dynamic Evolution under the Pressures of Globalization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using data from the Web of Science (WoS), we analyze the mutual information\namong university, industrial, and governmental addresses (U-I-G) at the country\nlevel for a number of countries. The dynamic evolution of the Triple Helix can\nthus be compared among developed and developing nations in terms of\ncross-sectorial co-authorship relations. The results show that the Triple-Helix\ninteractions among the three subsystems U-I-G become less intensive over time,\nbut unequally for different countries. We suggest that globalization erodes\nlocal Triple-Helix relations and thus can be expected to increase\ndifferentiation in national systems since the mid-1990s. This effect of\nglobalization is more pronounced in developed countries than in developing\nones. In the dynamic analysis, we focus on a more detailed comparison between\nChina and the USA. The Chinese Academy of the (Social) Sciences changes\nincreasingly from a public research institute to an academic one, and this has\na measurable effect on China's position in the globalization.\n", "versions": [{"version": "v1", "created": "Thu, 6 Sep 2012 11:47:50 GMT"}, {"version": "v2", "created": "Thu, 15 Nov 2012 07:00:06 GMT"}, {"version": "v3", "created": "Thu, 3 Jan 2013 07:35:26 GMT"}], "update_date": "2013-01-04", "authors_parsed": [["Ye", "Fred Y.", ""], ["Yu", "Susan S.", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "1209.2166", "submitter": "David Pritchard", "authors": "David Pritchard and Troy Vasiga", "title": "CS Circles: An In-Browser Python Course for Beginners", "comments": "To appear in SIGCSE 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Computer Science Circles is a free programming website for beginners that is\ndesigned to be fun, easy to use, and accessible to the broadest possible\naudience. We teach Python since it is simple yet powerful, and the course\ncontent is well-structured but written in plain language. The website has over\none hundred exercises in thirty lesson pages, plus special features to help\nteachers support their students. It is available in both English and French. We\ndiscuss the philosophy behind the course and its design, we describe how it was\nimplemented, and we give statistics on its use.\n", "versions": [{"version": "v1", "created": "Mon, 10 Sep 2012 22:12:53 GMT"}, {"version": "v2", "created": "Tue, 11 Dec 2012 04:36:15 GMT"}], "update_date": "2012-12-12", "authors_parsed": [["Pritchard", "David", ""], ["Vasiga", "Troy", ""]]}, {"id": "1209.2368", "submitter": "Shilpan Vyas D", "authors": "Shilpan Dineshkumar Vyas", "title": "Impact of E-Banking on Traditional Banking Services", "comments": null, "journal-ref": "International Journal of Computer Science & Communication\n  Networks, Vol 2(3), 310-313, June-July 2012, ISSN: 2249-5789", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet banking is changing the banking industry, having the major effects\non banking relationships. Banking is now no longer confined to the branches\nwere one has to approach the branch in person, to withdraw cash or deposit a\ncheque or request a statement of accounts. In true Internet banking, any\ninquiry or transaction is processed online without any reference to the branch\n(anywhere banking) at any time. Providing Internet banking is increasingly\nbecoming a \"need to have\" than a \"nice to have\" service. The net banking, thus,\nnow is more of a norm rather than an exception in many developed countries due\nto the fact that it is the cheapest way of providing banking services. This\nresearch paper will introduce you to e-banking, giving the meaning, functions,\ntypes, advantages and limitations of e-banking. It will also show the impact of\ne-banking on traditional services and finally the result documentation.\n", "versions": [{"version": "v1", "created": "Fri, 31 Aug 2012 04:47:59 GMT"}], "update_date": "2012-09-12", "authors_parsed": [["Vyas", "Shilpan Dineshkumar", ""]]}, {"id": "1209.2531", "submitter": "Steven Murdoch", "authors": "Mike Bond, Omar Choudary, Steven J. Murdoch, Sergei Skorobogatov, Ross\n  Anderson", "title": "Chip and Skim: cloning EMV cards with the pre-play attack", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  EMV, also known as \"Chip and PIN\", is the leading system for card payments\nworldwide. It is used throughout Europe and much of Asia, and is starting to be\nintroduced in North America too. Payment cards contain a chip so they can\nexecute an authentication protocol. This protocol requires point-of-sale (POS)\nterminals or ATMs to generate a nonce, called the unpredictable number, for\neach transaction to ensure it is fresh. We have discovered that some EMV\nimplementers have merely used counters, timestamps or home-grown algorithms to\nsupply this number. This exposes them to a \"pre-play\" attack which is\nindistinguishable from card cloning from the standpoint of the logs available\nto the card-issuing bank, and can be carried out even if it is impossible to\nclone a card physically (in the sense of extracting the key material and\nloading it into another card). Card cloning is the very type of fraud that EMV\nwas supposed to prevent. We describe how we detected the vulnerability, a\nsurvey methodology we developed to chart the scope of the weakness, evidence\nfrom ATM and terminal experiments in the field, and our implementation of\nproof-of-concept attacks. We found flaws in widely-used ATMs from the largest\nmanufacturers. We can now explain at least some of the increasing number of\nfrauds in which victims are refused refunds by banks which claim that EMV cards\ncannot be cloned and that a customer involved in a dispute must therefore be\nmistaken or complicit. Pre-play attacks may also be carried out by malware in\nan ATM or POS terminal, or by a man-in-the-middle between the terminal and the\nacquirer. We explore the design and implementation mistakes that enabled the\nflaw to evade detection until now: shortcomings of the EMV specification, of\nthe EMV kernel certification process, of implementation testing, formal\nanalysis, or monitoring customer complaints. Finally we discuss\ncountermeasures.\n", "versions": [{"version": "v1", "created": "Wed, 12 Sep 2012 09:16:13 GMT"}], "update_date": "2012-09-14", "authors_parsed": [["Bond", "Mike", ""], ["Choudary", "Omar", ""], ["Murdoch", "Steven J.", ""], ["Skorobogatov", "Sergei", ""], ["Anderson", "Ross", ""]]}, {"id": "1209.3117", "submitter": "Khurram Naim Shamsi", "authors": "Khurram Naim Shamsi, Zafar Iqbal Khan", "title": "Development of an e-learning system incorporating semantic web", "comments": "4 pages, 2 figures, published at International Journal of Research in\n  Computer Science", "journal-ref": "International Journal of Research in Computer Science, 2 (5): pp.\n  11-14, 2012", "doi": "10.7815/ijorcs.25.2012.042", "report-no": null, "categories": "cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  E-Learning is efficient, task relevant and just-in-time learning grown from\nthe learning requirements of the new and dynamically changing world. The term\nSemantic Web covers the steps to create a new WWW architecture that augments\nthe content with formal semantics enabling better possibilities of navigation\nthrough the cyberspace and its contents. In this paper, we present the Semantic\nWeb-Based model for our e-learning system taking into account the learning\nenvironment at Saudi Arabian universities. The proposed system is mainly based\non ontology-based descriptions of content, context and structure of the\nlearning materials. It further provides flexible and personalized access to\nthese learning materials. The framework has been validated by an interview\nbased qualitative method.\n", "versions": [{"version": "v1", "created": "Fri, 14 Sep 2012 08:01:50 GMT"}], "update_date": "2012-09-17", "authors_parsed": [["Shamsi", "Khurram Naim", ""], ["Khan", "Zafar Iqbal", ""]]}, {"id": "1209.3433", "submitter": "Salah A. Aly", "authors": "Hossam M. Zawbaa, Salah A. Aly, Adnan A. Gutub", "title": "A Hajj And Umrah Location Classification System For Video Crowded Scenes", "comments": "9 pages, 10 figures, 2 tables, 3 algirthms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CY cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a new automatic system for classifying ritual locations in\ndiverse Hajj and Umrah video scenes is investigated. This challenging subject\nhas mostly been ignored in the past due to several problems one of which is the\nlack of realistic annotated video datasets. HUER Dataset is defined to model\nsix different Hajj and Umrah ritual locations[26].\n  The proposed Hajj and Umrah ritual location classifying system consists of\nfour main phases: Preprocessing, segmentation, feature extraction, and location\nclassification phases. The shot boundary detection and background/foregroud\nsegmentation algorithms are applied to prepare the input video scenes into the\nKNN, ANN, and SVM classifiers. The system improves the state of art results on\nHajj and Umrah location classifications, and successfully recognizes the six\nHajj rituals with more than 90% accuracy. The various demonstrated experiments\nshow the promising results.\n", "versions": [{"version": "v1", "created": "Sat, 15 Sep 2012 20:57:51 GMT"}], "update_date": "2012-09-18", "authors_parsed": [["Zawbaa", "Hossam M.", ""], ["Aly", "Salah A.", ""], ["Gutub", "Adnan A.", ""]]}, {"id": "1209.4277", "submitter": "Elisa Omodei", "authors": "Elisa Omodei, Thierry Poibeau, Jean-Philippe Cointet", "title": "Multi-Level Modeling of Quotation Families Morphogenesis", "comments": "Published in the Proceedings of the ASE/IEEE 4th Intl. Conf. on\n  Social Computing \"SocialCom 2012\", Sep. 3-5, 2012, Amsterdam, NL", "journal-ref": null, "doi": "10.1109/SocialCom-PASSAT.2012.114", "report-no": null, "categories": "cs.CY cs.CL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates cultural dynamics in social media by examining the\nproliferation and diversification of clearly-cut pieces of content: quoted\ntexts. In line with the pioneering work of Leskovec et al. and Simmons et al.\non memes dynamics we investigate in deep the transformations that quotations\npublished online undergo during their diffusion. We deliberately put aside the\nstructure of the social network as well as the dynamical patterns pertaining to\nthe diffusion process to focus on the way quotations are changed, how often\nthey are modified and how these changes shape more or less diverse families and\nsub-families of quotations. Following a biological metaphor, we try to\nunderstand in which way mutations can transform quotations at different scales\nand how mutation rates depend on various properties of the quotations.\n", "versions": [{"version": "v1", "created": "Wed, 19 Sep 2012 15:16:20 GMT"}, {"version": "v2", "created": "Fri, 4 Jan 2013 13:27:21 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Omodei", "Elisa", ""], ["Poibeau", "Thierry", ""], ["Cointet", "Jean-Philippe", ""]]}, {"id": "1209.4896", "submitter": "Harsh Alkutkar Mr.", "authors": "Harsh Alkutkar, Ajinkya Abhyankar, Rushikesh Gawali, Saurabh Gandhele", "title": "Using Microsoft PowerPoint Presentations To Create HTML5 Based\n  E-learning Courses", "comments": "Paper has been withdrawn due to inconsistencies in images", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper introduces how to use Microsoft PowerPoint presentation files to\ngenerate HTML5 based interactive e-learning courses packaged in SCORM format.\n", "versions": [{"version": "v1", "created": "Wed, 19 Sep 2012 05:26:57 GMT"}, {"version": "v2", "created": "Tue, 25 Sep 2012 06:01:45 GMT"}], "update_date": "2012-09-26", "authors_parsed": [["Alkutkar", "Harsh", ""], ["Abhyankar", "Ajinkya", ""], ["Gawali", "Rushikesh", ""], ["Gandhele", "Saurabh", ""]]}, {"id": "1209.5004", "submitter": "Carlee Joe-Wong", "authors": "Carlee Joe-Wong, Soumya Sen, Sangtae Ha", "title": "Offering Supplementary Network Technologies: Adoption Behavior and\n  Offloading Benefits", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To alleviate the congestion caused by rapid growth in demand for mobile data,\nwireless service providers (WSPs) have begun encouraging users to offload some\nof their traffic onto supplementary network technologies, e.g., offloading from\n3G or 4G to WiFi or femtocells. With the growing popularity of such offerings,\na deeper understanding of the underlying economic principles and their impact\non technology adoption is necessary. To this end, we develop a model for user\nadoption of a base technology (e.g., 3G) and a bundle of the base plus a\nsupplementary technology (e.g., 3G + WiFi). Users individually make their\nadoption decisions based on several factors, including the technologies'\nintrinsic qualities, negative congestion externalities from other subscribers,\nand the flat access rates that a WSP charges. We then show how these user-level\ndecisions translate into aggregate adoption dynamics and prove that these\nconverge to a unique equilibrium for a given set of exogenously determined\nsystem parameters. We fully characterize these equilibria and study adoption\nbehaviors of interest to a WSP. We then derive analytical expressions for the\nrevenue-maximizing prices and optimal coverage factor for the supplementary\ntechnology and examine some resulting non-intuitive user adoption behaviors.\nFinally, we develop a mobile app to collect empirical 3G/WiFi usage data and\nnumerically investigate the profit-maximizing adoption levels when a WSP\naccounts for its cost of deploying the supplemental technology and savings from\noffloading traffic onto this technology.\n", "versions": [{"version": "v1", "created": "Sat, 22 Sep 2012 17:23:52 GMT"}, {"version": "v2", "created": "Tue, 15 Jan 2013 19:30:24 GMT"}, {"version": "v3", "created": "Sat, 1 Feb 2014 20:04:24 GMT"}], "update_date": "2014-02-04", "authors_parsed": [["Joe-Wong", "Carlee", ""], ["Sen", "Soumya", ""], ["Ha", "Sangtae", ""]]}, {"id": "1209.5401", "submitter": "Adis Medic Adis Medic", "authors": "Adis Medic and Adis Golubovic", "title": "P2P Appliance Calculation Method For Trust between Nodes", "comments": null, "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 9,\n  Issue 4, No 2, July 2012, ISSN (Online): 1694-0814", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern ways of communications, such as in a web services environment, also\ninfluences trust relationships between organisations. This concept of web-based\n(way towards semantic web services) trust is new and has as yet not been\nresolved. We hope that some of the trust properties mentioned above can be\nsuccessfully employed to improve the understanding of trust between machines.\nSo, trust is a vital ingredient of any successful interaction between\nindividuals, among organizations and/or in society at large. In this paper, we\nsuggested a trust model using fuzzy logic in semantic network of nodes. Trust\nis an aggregation of consensus given a set of past interaction among nodes\n(semantic network based on machines, agents etc.). We applied our suggested\nmodel to semantic networks in order to show how trust mechanisms are involved\nin communicating algorithm to choose the proper path from source to\ndestination. Authors use the terms untrust and distrust as synonyms for the\ncondition opposite to the trust.\n", "versions": [{"version": "v1", "created": "Mon, 24 Sep 2012 20:01:29 GMT"}], "update_date": "2012-09-26", "authors_parsed": [["Medic", "Adis", ""], ["Golubovic", "Adis", ""]]}, {"id": "1209.5901", "submitter": "Koen Holtman", "authors": "Koen Holtman", "title": "Appcessory Economics: Enabling loosely coupled hardware / software\n  innovation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An appcessory (app + accessory) is a smart phone accessory that is combined\nwith a specially written app to perform a useful function. An example is a toy\nhelicopter controlled by a smart phone app: the full value proposition involves\nboth new hardware outside the phone and new software running inside the phone.\nLike the smart phone itself and like a PC, the appcessory hardware is a\nplatform: it has the property that it becomes even more valuable if innovative\nnew software is written for it. It is technically possible that innovation in\nthe appcessory space becomes loosely coupled, with different parties\nspecializing to innovate on either the hardware (accessory) side or the\nsoftware (app) side. However, we are not seeing this loose coupling yet in the\ncurrent market. We argue that the reason for this is economical: a market\nframework in which loosely coupled software parties are adequately rewarded is\nnot yet in place. We describe a technical solution for creating the needed\nmarket framework, consisting of an automated micropayment system by which money\ncan flow from appcessory hardware makers to app software innovators. This\nsolution also has a broader applicability to the problem of innovation in the\nInternet of Things.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2012 11:14:56 GMT"}], "update_date": "2012-09-27", "authors_parsed": [["Holtman", "Koen", ""]]}, {"id": "1209.6125", "submitter": "Heru Susanto", "authors": "Heru Susanto, Mohammad Nabil Almunawar, Chen Chin Kang", "title": "Toward Cloud Computing Evolution", "comments": null, "journal-ref": "Computer Science Journal, 2012", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  -Information Technology (IT) shaped the success of organizations, giving them\na solid foundation that increases both their level of efficiency as well as\nproductivity. The computing industry is witnessing a paradigm shift in the way\ncomputing is performed worldwide. There is a growing awareness among consumers\nand enterprises to access their IT resources extensively through a \"utility\"\nmodel known as \"cloud computing.\" Cloud computing was initially rooted in\ndistributed grid-based computing. It has become a significant technology trend\nand expect that cloud computing will reshape IT processes and the IT\nmarketplace. With the cloud computing technology, clients use a variety of\nsmart mobile devices to access programs, storage, and application-development\nplatforms over the network and internet, through services offered by cloud\ncomputing providers.An innovative new way to boost capacity and add\ncapabilities in computing without spending money on a new infrastructure,\ntraining new personnel or licensing software is one of the characteristics of a\ncloud computing. Demands for fastest access to information is changing and\nincreasing, therefore, the availability of cloud computing has made it easier\nfor organizations to share and store related data and information with their\nstakeholders.Moreover, cloud computing is the use of internet-based services to\nsupport business processes.Our research is to find out what the demand and main\nemphasized of cloud computing compared with efficiency, trendy and security\nthat leads to improved business processes within corporate as cloud user.\n", "versions": [{"version": "v1", "created": "Thu, 27 Sep 2012 05:13:45 GMT"}], "update_date": "2012-09-28", "authors_parsed": [["Susanto", "Heru", ""], ["Almunawar", "Mohammad Nabil", ""], ["Kang", "Chen Chin", ""]]}, {"id": "1209.6398", "submitter": "Collin David Anderson", "authors": "Collin Anderson", "title": "The Hidden Internet of Iran: Private Address Allocations on a National\n  Network", "comments": "Working Draft", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  While funding agencies have provided substantial support for the developers\nand vendors of services that facilitate the unfettered flow of information\nthrough the Internet, little consolidated knowledge exists on the basic\ncommunications network infrastructure of the Islamic Republic of Iran. In the\nabsence open access and public data, rumors and fear have reigned supreme.\nDuring provisional research on the country's censorship regime, we found\ninitial indicators that telecommunications entities in Iran allowed private\naddresses to route domestically, whether intentionally or unintentionally,\ncreating a hidden network only reachable within the country. Moreover, records\nsuch as DNS entries lend evidence of a 'dual stack' approach, wherein servers\nare assigned a domestic IP addresses, in addition to a global one. Despite the\nclear political implications of the claim we put forward, particularly in light\nof rampant speculation regarding the mandate of Article 46 of the 'Fifth Five\nYear Development Plan' to establish a \"national information network,\" we\nrefrain from hypothesizing the purpose of this structure. In order to solicit\ncritical feedback for future research, we outline our initial findings and\nattempt to demonstrate that the matter under contention is a nation-wide\nphenomenom that warrants broader attention.\n", "versions": [{"version": "v1", "created": "Fri, 28 Sep 2012 00:09:11 GMT"}], "update_date": "2012-10-01", "authors_parsed": [["Anderson", "Collin", ""]]}]