[{"id": "1309.2458", "submitter": "Karthik Reddy g", "authors": "Karthik Reddy. G (Department of Electronics and Communication\n  Engineering, G. Pulla Reddy Engineering college, Kurnool, A.P, India)", "title": "Low power-area designs of 1bit full adder in cadence virtuoso platform", "comments": "10 pages", "journal-ref": "International Journal of VLSI design & Communication Systems\n  (VLSICS) Vol.4, No.4,page no. 55-64, August 2013", "doi": "10.5121/vlsic.2013.4406", "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Power consumption has emerged as a primary design constraint for integrated\ncircuits (ICs). In the Nano meter technology regime, leakage power has become a\nmajor component of total power. Full adder is the basic functional unit of an\nALU. The power consumption of a processor is lowered by lowering the power\nconsumption of an ALU, and the power consumption of an ALU can be lowered by\nlowering the power consumption of Full adder. So the full adder designs with\nlow power characteristics are becoming more popular these days. This proposed\nwork illustrates the design of the low-power less transistor full adder designs\nusing cadence tool and virtuoso platform, the entire simulations have been done\non 180nm single n-well CMOS bulk technology, in virtuoso platform of cadence\ntool with the supply voltage 1.8V and frequency of 100MHz. These circuits\nconsume less power with maximum (6T design)of 93.1% power saving compare to\nconventional 28T design and 80.2% power saving compare to SERF design without\nmuch delay degradation. The proposed circuit exploits the advantage of GDI\ntechnique and pass transistor logic\n", "versions": [{"version": "v1", "created": "Tue, 10 Sep 2013 11:19:15 GMT"}], "update_date": "2013-09-11", "authors_parsed": [["G", "Karthik Reddy.", "", "Department of Electronics and Communication\n  Engineering, G. Pulla Reddy Engineering college, Kurnool, A.P, India"]]}, {"id": "1309.2533", "submitter": "Jalil Boukhobza", "authors": "Yahia Benmoussa (Lab-STICC), Jalil Boukhobza (Lab-STICC), Eric Senn\n  (Lab-STICC), Djamel Benazzouz (MSS)", "title": "Evaluation of the Performance/Energy Overhead in DSP Video Decoding and\n  its Implications", "comments": null, "journal-ref": "Annual Metting of the GDR SoC SiP, Lyon : France (2013)", "doi": null, "report-no": null, "categories": "cs.AR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Video decoding is considered as one of the most compute and energy intensive\napplication in energy constrained mobile devices. Some specific processing\nunits, such as DSPs, are added to those devices in order to optimize the\nperformance and the energy consumption. However, in DSP video decoding, the\ninter-processor communication overhead may have a considerable impact on the\nperformance and the energy consumption. In this paper, we propose to evaluate\nthis overhead and analyse its impact on the performance and the energy\nconsumption as compared to the GPP decoding. Our work revealed that the GPP can\nbe the best choice in many cases due to the a significant overhead in DSP\ndecoding which may represents 30% of the total decoding energy.\n", "versions": [{"version": "v1", "created": "Tue, 10 Sep 2013 14:50:29 GMT"}], "update_date": "2013-09-11", "authors_parsed": [["Benmoussa", "Yahia", "", "Lab-STICC"], ["Boukhobza", "Jalil", "", "Lab-STICC"], ["Senn", "Eric", "", "Lab-STICC"], ["Benazzouz", "Djamel", "", "MSS"]]}, {"id": "1309.3685", "submitter": "Pece Mitrevski", "authors": "Pece Mitrevski and Marjan Gusev", "title": "On the Performance Potential of Speculative Execution based on Branch\n  and Value Prediction", "comments": null, "journal-ref": "International Scientific Journal Facta Universitatis, Series:\n  Electronics and Energetics, Vol. 16, No. 1, ISSN: 0353-3670, pp. 83-91, 2003", "doi": "10.2298/FUEE0301083M", "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fluid Stochastic Petri Nets are used to capture the dynamic behavior of an\nILP processor, and discrete-event simulation is applied to assess the\nperformance potential of predictions and speculative execution in boosting the\nperformance of ILP processors that fetch, issue, execute and commit a large\nnumber of instructions per cycle.\n", "versions": [{"version": "v1", "created": "Sat, 14 Sep 2013 16:43:05 GMT"}], "update_date": "2013-09-17", "authors_parsed": [["Mitrevski", "Pece", ""], ["Gusev", "Marjan", ""]]}, {"id": "1309.3785", "submitter": "Sparsh Mittal", "authors": "Sparsh Mittal", "title": "Energy Saving Techniques for Phase Change Memory (PCM)", "comments": "Survey, phase change RAM (PCRAM)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, the energy consumption of computing systems has increased\nand a large fraction of this energy is consumed in main memory. Towards this,\nresearchers have proposed use of non-volatile memory, such as phase change\nmemory (PCM), which has low read latency and power; and nearly zero leakage\npower. However, the write latency and power of PCM are very high and this,\nalong with limited write endurance of PCM present significant challenges in\nenabling wide-spread adoption of PCM. To address this, several\narchitecture-level techniques have been proposed. In this report, we review\nseveral techniques to manage power consumption of PCM. We also classify these\ntechniques based on their characteristics to provide insights into them. The\naim of this work is encourage researchers to propose even better techniques for\nimproving energy efficiency of PCM based main memory.\n", "versions": [{"version": "v1", "created": "Sun, 15 Sep 2013 18:32:21 GMT"}], "update_date": "2013-09-17", "authors_parsed": [["Mittal", "Sparsh", ""]]}, {"id": "1309.5459", "submitter": "Irfan Uddin", "authors": "Irfan Uddin", "title": "Advances in computer architecture", "comments": "12 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In the past, efforts were taken to improve the performance of a processor via\nfrequency scaling. However, industry has reached the limits of increasing the\nfrequency and therefore concurrent execution of instructions on multiple cores\nseems the only possible option. It is not enough to provide concurrent\nexecution by the hardware, software also have to introduce concurrency in order\nto exploit the parallelism.\n", "versions": [{"version": "v1", "created": "Sat, 21 Sep 2013 10:33:36 GMT"}], "update_date": "2013-09-24", "authors_parsed": [["Uddin", "Irfan", ""]]}, {"id": "1309.5507", "submitter": "Irfan Uddin", "authors": "Irfan Uddin", "title": "Microgrid - The microthreaded many-core architecture", "comments": "30 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Traditional processors use the von Neumann execution model, some other\nprocessors in the past have used the dataflow execution model. A combination of\nvon Neuman model and dataflow model is also tried in the past and the resultant\nmodel is referred as hybrid dataflow execution model. We describe a hybrid\ndataflow model known as the microthreading. It provides constructs for\ncreation, synchronization and communication between threads in an intermediate\nlanguage. The microthreading model is an abstract programming and machine model\nfor many-core architecture. A particular instance of this model is named as the\nmicrothreaded architecture or the Microgrid. This architecture implements all\nthe concurrency constructs of the microthreading model in the hardware with the\nmanagement of these constructs in the hardware.\n", "versions": [{"version": "v1", "created": "Sat, 21 Sep 2013 17:50:09 GMT"}], "update_date": "2013-09-24", "authors_parsed": [["Uddin", "Irfan", ""]]}, {"id": "1309.5551", "submitter": "Irfan Uddin", "authors": "Irfan Uddin", "title": "Design space exploration in the microthreaded many-core architecture", "comments": "12 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Design space exploration is commonly performed in embedded system, where the\narchitecture is a complicated piece of engineering. With the current trend of\nmany-core systems, design space exploration in general-purpose computers can no\nlonger be avoided. Microgrid is a complicated architecture, and therefor we\nneed to perform design space exploration. Generally, simulators are used for\nthe design space exploration of an architecture. Different simulators with\ndifferent levels of complexity, simulation time and accuracy are used.\nSimulators with little complexity, low simulation time and reasonable accuracy\nare desirable for the design space exploration of an architecture. These\nsimulators are referred as high-level simulators and are commonly used in the\ndesign of embedded systems. However, the use of high-level simulation for\ndesign space exploration in general-purpose computers is a relatively new area\nof research.\n", "versions": [{"version": "v1", "created": "Sun, 22 Sep 2013 02:01:28 GMT"}], "update_date": "2013-09-24", "authors_parsed": [["Uddin", "Irfan", ""]]}, {"id": "1309.5647", "submitter": "Sparsh Mittal", "authors": "Sparsh Mittal", "title": "A Cache-Coloring Based Technique for Saving Leakage Energy In\n  Multitasking Systems", "comments": "Cache leakage energy saving technique", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There has been a significant increase in leakage energy dissipation of CMOS\ncircuits with each technology generation. Further, due to their large size,\nlast level caches (LLCs) spend a large fraction of their energy in the form of\nleakage energy and hence, addressing this has become extremely important to\nmeet the challenges of chip power budget. For addressing this, several\ntechniques have been proposed. However, most of these techniques require\noffline profiling and hence cannot be used for real-life systems which usually\nrun multitasking programs, with possible pre-emptions. In this paper, we\npropose a dynamic profiling based technique for saving cache leakage energy in\nmultitasking systems. Our technique uses a small coloring-based profiling\ncache, to estimate performance and energy consumption of multiple cache\nconfigurations and then selects the best (least-energy) configuration among\nthem. Our technique uses non-intrusive profiling and saves energy despite\nintra-task and inter-task variations; thus, it is suitable for multitasking\nsystems. Simulations performed using workloads from SPEC2006 suite show the\nsuperiority of our technique over an existing cache energy saving technique.\nWith a 2MB baseline cache, the average saving in memory sub-system energy is\n22.8%.\n", "versions": [{"version": "v1", "created": "Sun, 22 Sep 2013 20:44:49 GMT"}], "update_date": "2013-09-24", "authors_parsed": [["Mittal", "Sparsh", ""]]}, {"id": "1309.7082", "submitter": "Sparsh Mittal", "authors": "Sparsh Mittal", "title": "A Cache Reconfiguration Approach for Saving Leakage and Refresh Energy\n  in Embedded DRAM Caches", "comments": "Embedded DRAM (eDRAM) caches", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, the size and leakage energy consumption of large last level\ncaches (LLCs) has increased. To address this, embedded DRAM (eDRAM) caches have\nbeen considered which have lower leakage energy consumption; however eDRAM\ncaches consume a significant amount of energy in the form of refresh energy. In\nthis paper, we present a technique for saving both leakage and refresh energy\nin eDRAM caches. We use dynamic cache reconfiguration approach to intelligently\nturn-off part of the cache to save leakage energy and refresh only valid data\nof the active (i.e. not turned-off) cache to save refresh energy. We evaluate\nour technique using an x86-64 simulator and SPEC2006 benchmarks and compare it\nwith a recently proposed technique for saving refresh energy, named Refrint.\nThe experiments have shown that our technique provides better performance and\nenergy efficiency than Refrint. Using our technique, for a 2MB LLC and 40\nmicro-seconds eDRAM refresh period, the average saving in energy over eDRAM\nbaseline (which periodically refreshes all cache lines) is 22.8%.\n", "versions": [{"version": "v1", "created": "Thu, 26 Sep 2013 22:18:43 GMT"}], "update_date": "2013-09-30", "authors_parsed": [["Mittal", "Sparsh", ""]]}, {"id": "1309.7163", "submitter": "Dipankar Saha", "authors": "Dipankar Saha, Subhramita Basak, Sagar Mukherjee, C. K. Sarkar", "title": "A Low-Voltage, Low-Power 4-bit BCD Adder, designed using the Clock Gated\n  Power Gating, and the DVT Scheme", "comments": "To appear in the proceedings of 2013 IEEE International Conference on\n  Signal Processing, Computing and Control (ISPCC,13)", "journal-ref": null, "doi": "10.1109/ISPCC.2013.6663444", "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a Low-Power, Energy Efficient 4-bit Binary Coded Decimal\n(BCD) adder design where the conventional 4-bit BCD adder has been modified\nwith the Clock Gated Power Gating Technique. Moreover, the concept of DVT\n(Dual-vth) scheme has been introduced while designing the full adder blocks to\nreduce the Leakage Power, as well as, to maintain the overall performance of\nthe entire circuit. The reported architecture of 4-bit BCD adder is designed\nusing 45 nm technology and it consumes 1.384 {\\mu}Watt of Average Power while\noperating with a frequency of 200 MHz, and a Supply Voltage (Vdd) of 1 Volt.\nThe results obtained from different simulation runs on SPICE, indicate the\nsuperiority of the proposed design compared to the conventional 4-bit BCD\nadder. Considering the product of Average Power and Delay, for the operating\nfrequency of 200 MHz, a fair 47.41 % reduction compared to the conventional\ndesign has been achieved with this proposed scheme.\n", "versions": [{"version": "v1", "created": "Fri, 27 Sep 2013 09:09:37 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Saha", "Dipankar", ""], ["Basak", "Subhramita", ""], ["Mukherjee", "Sagar", ""], ["Sarkar", "C. K.", ""]]}, {"id": "1309.7321", "submitter": "Daniel Sorin", "authors": "Ralph Nathan, Bryan Anthonio, Shih-Lien Lu, Helia Naeimi, Daniel J.\n  Sorin, Xiaobai Sun", "title": "Recycled Error Bits: Energy-Efficient Architectural Support for Higher\n  Precision Floating Point", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we provide energy-efficient architectural support for floating\npoint accuracy. Our goal is to provide accuracy that is far greater than that\nprovided by the processor's hardware floating point unit (FPU). Specifically,\nfor each floating point addition performed, we \"recycle\" that operation's\nerror: the difference between the finite-precision result produced by the\nhardware and the result that would have been produced by an infinite-precision\nFPU. We make this error architecturally visible such that it can be used, if\ndesired, by software. Experimental results on physical hardware show that\nsoftware that exploits architecturally recycled error bits can achieve accuracy\ncomparable to a 2B-bit FPU with performance and energy that are comparable to a\nB-bit FPU.\n", "versions": [{"version": "v1", "created": "Fri, 27 Sep 2013 18:24:32 GMT"}], "update_date": "2013-09-30", "authors_parsed": [["Nathan", "Ralph", ""], ["Anthonio", "Bryan", ""], ["Lu", "Shih-Lien", ""], ["Naeimi", "Helia", ""], ["Sorin", "Daniel J.", ""], ["Sun", "Xiaobai", ""]]}, {"id": "1309.7818", "submitter": "Guillaume Berhault", "authors": "Guillaume Berhault, Camille Leroux, Christophe Jego, Dominique Dallet", "title": "Partial Sums Generation Architecture for Successive Cancellation\n  Decoding of Polar Codes", "comments": "Submitted to IEEE Workshop on Signal Processing Systems (SiPS)(26\n  April 2012). Accepted (28 June 2013)", "journal-ref": null, "doi": "10.1109/SiPS.2013.6674541", "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Polar codes are a new family of error correction codes for which efficient\nhardware architectures have to be defined for the encoder and the decoder.\nPolar codes are decoded using the successive cancellation decoding algorithm\nthat includes partial sums computations. We take advantage of the recursive\nstructure of polar codes to introduce an efficient partial sums computation\nunit that can also implements the encoder. The proposed architecture is\nsynthesized for several codelengths in 65nm ASIC technology. The area of the\nresulting design is reduced up to 26% and the maximum working frequency is\nimproved by ~25%.\n", "versions": [{"version": "v1", "created": "Mon, 30 Sep 2013 12:20:47 GMT"}], "update_date": "2015-01-12", "authors_parsed": [["Berhault", "Guillaume", ""], ["Leroux", "Camille", ""], ["Jego", "Christophe", ""], ["Dallet", "Dominique", ""]]}]