[{"id": "1604.00118", "submitter": "Anibal Sanjab", "authors": "Anibal Sanjab and Walid Saad", "title": "Data Injection Attacks on Smart Grids with Multiple Adversaries: A\n  Game-Theoretic Perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT cs.IT cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data injection attacks have recently emerged as a significant threat on the\nsmart power grid. By launching data injection attacks, an adversary can\nmanipulate the real-time locational marginal prices to obtain economic\nbenefits. Despite the surge of existing literature on data injection, most such\nworks assume the presence of a single attacker and assume no cost for attack or\ndefense. In contrast, in this paper, a model for data injection attacks with\nmultiple adversaries and a single smart grid defender is introduced. To study\nthe defender-attackers interaction, two game models are considered. In the\nfirst, a Stackelberg game model is used in which the defender acts as a leader\nthat can anticipate the actions of the adversaries, that act as followers,\nbefore deciding on which measurements to protect. The existence and properties\nof the Stackelberg equilibrium of this game are studied. To find the\nequilibrium, a distributed learning algorithm that operates under limited\nsystem information is proposed and shown to converge to the game solution. In\nthe second proposed game model, it is considered that the defender cannot\nanticipate the actions of the adversaries. To this end, we proposed a hybrid\nsatisfaction equilibrium - Nash equilibrium game and defined its equilibrium\nconcept. A search algorithm is also provided to find the equilibrium of the\nhybrid game. Numerical results using the IEEE 30-bus system are used to\nillustrate and analyze the strategic interactions between the attackers and\ndefender. Our results show that by defending a very small set of measurements,\nthe grid operator can achieve an equilibrium through which the optimal attacks\nhave no effect on the system. Moreover, our results show how, at equilibrium,\nmultiple attackers can play a destructive role towards each other, by choosing\nto carry out attacks that cancel each other out, leaving the system unaffected.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 03:32:02 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Sanjab", "Anibal", ""], ["Saad", "Walid", ""]]}, {"id": "1604.00299", "submitter": "Serdar Y\\\"uksel", "authors": "Nuh Ayg\\\"un Dalk{\\i}ran and Serdar Y\\\"uksel", "title": "Stochastic Control Approach to Reputation Games", "comments": "To appear in IEEE Transactions on Automatic Control", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Through a stochastic control theoretic approach, we analyze reputation games\nwhere a strategic long-lived player acts in a sequential repeated game against\na collection of short-lived players. The key assumption in our model is that\nthe information of the short-lived players is nested in that of the long-lived\nplayer. This nested information structure is obtained through an appropriate\nmonitoring structure. Under this monitoring structure, we show that, given mild\nassumptions, the set of Perfect Bayesian Equilibrium payoffs coincide with\nMarkov Perfect Equilibrium payoffs, and hence a dynamic programming formulation\ncan be obtained for the computation of equilibrium strategies of the strategic\nlong-lived player in the discounted setup. We also consider the undiscounted\naverage-payoff setup where we obtain an optimal equilibrium strategy of the\nstrategic long-lived player under further technical conditions. We then use\nthis optimal strategy in the undiscounted setup as a tool to obtain a tight\nupper payoff bound for the arbitrarily patient long-lived player in the\ndiscounted setup. Finally, by using measure concentration techniques, we obtain\na refined lower payoff bound on the value of reputation in the discounted\nsetup. We also study the continuity of equilibrium payoffs in the prior\nbeliefs.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 15:48:17 GMT"}, {"version": "v2", "created": "Fri, 2 Dec 2016 04:47:40 GMT"}, {"version": "v3", "created": "Sun, 12 Nov 2017 07:29:52 GMT"}, {"version": "v4", "created": "Tue, 18 Jun 2019 06:01:31 GMT"}, {"version": "v5", "created": "Mon, 20 Jan 2020 15:52:40 GMT"}], "update_date": "2020-01-22", "authors_parsed": [["Dalkıran", "Nuh Aygün", ""], ["Yüksel", "Serdar", ""]]}, {"id": "1604.00357", "submitter": "Aviad Rubinstein", "authors": "Aviad Rubinstein", "title": "Beyond matroids: Secretary Problem and Prophet Inequality with general\n  constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study generalizations of the \"Prophet Inequality\" and \"Secretary Problem\",\nwhere the algorithm is restricted to an arbitrary downward-closed set system.\nFor {0,1}-values, we give O(log n)-competitive algorithms for both problems.\nThis is close to the \\Omega(log n / loglog n) lower bound due to Babaioff,\nImmorlica, and Kleinberg. For general values, our results translate to O(log n\nlog r)-competitive algorithms, where r is the cardinality of the largest\nfeasible set. This resolves (up to the O(log r loglog n) factors) an open\nquestion posed to us by Bobby Kleinberg.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 18:53:08 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Rubinstein", "Aviad", ""]]}, {"id": "1604.00706", "submitter": "Tatsuya Iwase Ph.D.", "authors": "Tatsuya Iwase, Takahiro Shiga", "title": "Coordination of Players in Ride-Sharing Games by Signaling", "comments": "The 30th Annual Conference of Japanese Society of Artificial\n  Intelligence(2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sharing unused vehicles is one practical solution for traffic congestion. We\npropose an advanced vehicle-sharing service that maximizes the sharing of\nvehicles and improves traffic efficiency by coordinating user trips via an\ninformation system. We formulate ride-sharing games that model externalities in\nvehicle sharing caused by insufficient vehicle supply. We show how Bayes\ncorrelated equilibrium can coordinate players in ride-sharing games and verify\nthe resultant improvement in the price of anarchy.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 00:30:42 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Iwase", "Tatsuya", ""], ["Shiga", "Takahiro", ""]]}, {"id": "1604.00710", "submitter": "Tatsuya Iwase Ph.D.", "authors": "Tatsuya Iwase, Takahiro Shiga", "title": "Pure Nash Equilibrium and Coordination of Players in Ride Sharing Games", "comments": "GAMES 2016, the 5th World Congress of the Game Theory Society", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, we formulate positive and negative externalities caused by\nchanges in the supply of shared vehicles as ride sharing games. The study aims\nto understand the price of anarchy (PoA) and its improvement via a coordination\ntechnique in ride sharing games. A critical question is whether ride sharing\ngames exhibit a pure Nash equilibrium (pNE) since the PoA bound assumes it. Our\nresult shows a sufficient condition for a ride sharing game to have a finite\nimprovement property and a pNE similar to potential games. This is the first\nstep to analyze PoA bound and its improvement by coordination in ride sharing\ngames. We also show an example of coordinating players in ride sharing games\nusing signaling and evaluate the improvement in the PoA.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 00:56:38 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Iwase", "Tatsuya", ""], ["Shiga", "Takahiro", ""]]}, {"id": "1604.00896", "submitter": "Vincent Knight Dr", "authors": "Vincent Knight, Owen Campbell, Marc Harper, Karol Langner, James\n  Campbell, Thomas Campbell, Alex Carney, Martin Chorley, Cameron\n  Davidson-Pilon, Kristian Glass, Nikoleta Glynatsi, Tom\\'a\\v{s} Ehrlich,\n  Martin Jones, Georgios Koutsovoulos, Holly Tibble, M\\\"uller Jochen, Geraint\n  Palmer, Piotr Petunov, Paul Slavin, Timothy Standen, Luis Visintini, Karl\n  Molden", "title": "An open reproducible framework for the study of the iterated prisoner's\n  dilemma", "comments": "11 pages, Journal of Open Research Software 4.1 (2016)", "journal-ref": null, "doi": "10.5334/jors.125", "report-no": null, "categories": "cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Axelrod library is an open source Python package that allows for\nreproducible game theoretic research into the Iterated Prisoner's Dilemma. This\narea of research began in the 1980s but suffers from a lack of documentation\nand test code. The goal of the library is to provide such a resource, with\nfacilities for the design of new strategies and interactions between them, as\nwell as conducting tournaments and ecological simulations for populations of\nstrategies.\n  With a growing collection of 139 strategies, the library is a also a platform\nfor an original tournament that, in itself, is of interest to the game\ntheoretic community. This paper describes the Iterated Prisoner's Dilemma, the\nAxelrod library and its development, and insights gained from some novel\nresearch.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 15:05:42 GMT"}, {"version": "v2", "created": "Tue, 5 Apr 2016 15:51:14 GMT"}, {"version": "v3", "created": "Wed, 6 Apr 2016 21:10:14 GMT"}, {"version": "v4", "created": "Tue, 20 Dec 2016 18:48:00 GMT"}], "update_date": "2016-12-21", "authors_parsed": [["Knight", "Vincent", ""], ["Campbell", "Owen", ""], ["Harper", "Marc", ""], ["Langner", "Karol", ""], ["Campbell", "James", ""], ["Campbell", "Thomas", ""], ["Carney", "Alex", ""], ["Chorley", "Martin", ""], ["Davidson-Pilon", "Cameron", ""], ["Glass", "Kristian", ""], ["Glynatsi", "Nikoleta", ""], ["Ehrlich", "Tomáš", ""], ["Jones", "Martin", ""], ["Koutsovoulos", "Georgios", ""], ["Tibble", "Holly", ""], ["Jochen", "Müller", ""], ["Palmer", "Geraint", ""], ["Petunov", "Piotr", ""], ["Slavin", "Paul", ""], ["Standen", "Timothy", ""], ["Visintini", "Luis", ""], ["Molden", "Karl", ""]]}, {"id": "1604.01091", "submitter": "Haris Aziz", "authors": "Haris Aziz and Peter Biro and Jerome Lang and Julien Lesca and Jerome\n  Monnot", "title": "Efficient Reallocation under Additive and Responsive Preferences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reallocating resources to get mutually beneficial outcomes is a fundamental\nproblem in various multi-agent settings. While finding an arbitrary Pareto\noptimal allocation is generally easy, checking whether a particular allocation\nis Pareto optimal can be much more difficult. This problem is equivalent to\nchecking that the allocated objects cannot be reallocated in such a way that at\nleast one agent prefers her new share to his old one, and no agent prefers her\nold share to her new one. We consider the problem for two related types of\npreference relations over sets of objects. In the first part of the paper we\nfocus on the setting in which agents express additive cardinal utilities over\nobjects. We present computational hardness results as well as polynomial-time\nalgorithms for testing Pareto optimality under different restrictions such as\ntwo utility values or lexicographic utilities. In the second part of the paper\nwe assume that agents express only their (ordinal) preferences over single\nobjects, and that their preferences are additively separable. In this setting,\nwe present characterizations and polynomial-time algorithms for possible and\nnecessary Pareto optimality.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 23:58:33 GMT"}, {"version": "v2", "created": "Thu, 17 May 2018 11:42:29 GMT"}], "update_date": "2018-05-18", "authors_parsed": [["Aziz", "Haris", ""], ["Biro", "Peter", ""], ["Lang", "Jerome", ""], ["Lesca", "Julien", ""], ["Monnot", "Jerome", ""]]}, {"id": "1604.01435", "submitter": "Haris Aziz", "authors": "Haris Aziz and Gerhard Rauchecker and Guido Schryen and Toby Walsh", "title": "Approximation Algorithms for Max-Min Share Allocations of Indivisible\n  Chores and Goods", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider Max-min Share (MmS) allocations of items both in the case where\nitems are goods (positive utility) and when they are chores (negative utility).\nWe show that fair allocations of goods and chores have some fundamental\nconnections but differences as well. We prove that like in the case for goods,\nan MmS allocation does not need to exist for chores and computing an MmS\nallocation - if it exists - is strongly NP-hard. In view of these non-existence\nand complexity results, we present a polynomial-time 2-approximation algorithm\nfor MmS fairness for chores. We then introduce a new fairness concept called\noptimal MmS that represents the best possible allocation in terms of MmS that\nis guaranteed to exist. For both goods and chores, we use connections to\nparallel machine scheduling to give (1) an exponential-time exact algorithm and\n(2) a polynomial-time approximation scheme for computing an optimal MmS\nallocation when the number of agents is fixed.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 21:43:26 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Aziz", "Haris", ""], ["Rauchecker", "Gerhard", ""], ["Schryen", "Guido", ""], ["Walsh", "Toby", ""]]}, {"id": "1604.01529", "submitter": "Piotr Skowron", "authors": "Piotr Skowron and Piotr Faliszewski and Arkadii Slinko", "title": "Axiomatic Characterization of Committee Scoring Rules", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Committee scoring rules form a rich class of aggregators of voters'\npreferences for the purpose of selecting subsets of objects with desired\nproperties, e.g., a shortlist of candidates for an interview, a representative\ncollective body such as a parliament, or a set of locations for a set of public\nfacilities. In the spirit of celebrated Young's characterization result that\naxiomatizes single-winner scoring rules, we provide an axiomatic\ncharacterization of multiwinner committee scoring rules. We show that committee\nscoring rules---despite forming a remarkably general class of rules---are\ncharacterized by the set of four standard axioms, anonymity, neutrality,\nconsistency and continuity, and by one axiom specific to multiwinner rules\nwhich we call committee dominance. In the course of our proof, we develop\nseveral new notions and techniques. In particular, we introduce and\naxiomatically characterize multiwinner decision scoring rules, a class of rules\nthat broadly generalizes the well-known majority relation.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 08:09:43 GMT"}, {"version": "v2", "created": "Wed, 2 Nov 2016 06:28:27 GMT"}], "update_date": "2016-11-03", "authors_parsed": [["Skowron", "Piotr", ""], ["Faliszewski", "Piotr", ""], ["Slinko", "Arkadii", ""]]}, {"id": "1604.01627", "submitter": "Zhixuan Fang", "authors": "Zhixuan Fang, Longbo Huang and Adam Wierman", "title": "Prices and Subsidies in the Sharing Economy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growth of the sharing economy is driven by the emergence of sharing\nplatforms, e.g., Uber and Lyft, that match owners looking to share their\nresources with customers looking to rent them. The design of such platforms is\na complex mixture of economics and engineering, and how to \"optimally\" design\nsuch platforms is still an open problem. In this paper, we focus on the design\nof prices and subsidies in sharing platforms. Our results provide insights into\nthe tradeoff between revenue maximizing prices and social welfare maximizing\nprices. Specifically, we introduce a novel model of sharing platforms and\ncharacterize the profit and social welfare maximizing prices in this model.\nFurther, we bound the efficiency loss under profit maximizing prices, showing\nthat there is a strong alignment between profit and efficiency in practical\nsettings. Our results highlight that the revenue of platforms may be limited in\npractice due to supply shortages; thus platforms have a strong incentive to\nencourage sharing via subsidies. We provide an analytic characterization of\nwhen such subsidies are valuable and show how to optimize the size of the\nsubsidy provided. Finally, we validate the insights from our analysis using\ndata from Didi Chuxing, the largest ridesharing platform in China.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 13:50:04 GMT"}, {"version": "v2", "created": "Wed, 6 Jul 2016 06:53:44 GMT"}, {"version": "v3", "created": "Mon, 24 Oct 2016 07:59:10 GMT"}, {"version": "v4", "created": "Tue, 25 Oct 2016 04:27:23 GMT"}, {"version": "v5", "created": "Mon, 31 Oct 2016 19:40:11 GMT"}], "update_date": "2016-11-01", "authors_parsed": [["Fang", "Zhixuan", ""], ["Huang", "Longbo", ""], ["Wierman", "Adam", ""]]}, {"id": "1604.01672", "submitter": "Zhixuan Fang", "authors": "Zhixuan Fang and Longbo Huang", "title": "Market Share Analysis with Brand Effect", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate the effect of brand in market competition.\nSpecifically, we propose a variant Hotelling model where companies and\ncustomers are represented by points in an Euclidean space, with axes being\nproduct features. $N$ companies compete to maximize their own profits by\noptimally choosing their prices, while each customer in the market, when\nchoosing sellers, considers the sum of product price, discrepancy between\nproduct feature and his preference, and a company's brand name, which is\nmodeled by a function of its market area of the form $-\\beta\\cdot\\text{(Market\nArea)}^q$, where $\\beta$ captures the brand influence and $q$ captures how\nmarket share affects the brand. By varying the parameters $\\beta$ and $q$, we\nderive existence results of Nash equilibrium and equilibrium market prices and\nshares. In particular, we prove that pure Nash equilibrium always exists when\n$q=0$ for markets with either one and two dominating features, and it always\nexists in a single dominating feature market when market affects brand name\nlinearly, i.e., $q=1$. Moreover, we show that at equilibrium, a company's price\nis proportional to its market area over the competition intensity with its\nneighbors, a result that quantitatively reconciles the common belief of a\ncompany's pricing power. We also study an interesting \"wipe out\" phenomenon\nthat only appears when $q>0$, which is similar to the \"undercut\" phenomenon in\nthe Hotelling model, where companies may suddenly lose the entire market area\nwith a small price increment. Our results offer novel insight into market\npricing and positioning under competition with brand effect.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 16:01:45 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Fang", "Zhixuan", ""], ["Huang", "Longbo", ""]]}, {"id": "1604.01734", "submitter": "Michel Lemaitre", "authors": "Sylvain Bouveret, Michel Lema\\^itre (Toulouse)", "title": "Efficiency and Sequenceability in Fair Division of Indivisible Goods\n  with Additive Preferences", "comments": "COMSOC-2016, Jun 2016, Toulouse, France", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In fair division of indivisible goods, using sequences of sincere choices (or\npicking sequences) is a natural way to allocate the objects. The idea is the\nfollowing: at each stage, a designated agent picks one object among those that\nremain. This paper, restricted to the case where the agents have numerical\nadditive preferences over objects, revisits to some extent the seminal paper by\nBrams and King [9] which was specific to ordinal and linear order preferences\nover items. We point out similarities and differences with this latter context.\nIn particular, we show that any Pareto-optimal allocation (under additive\npreferences) is sequenceable, but that the converse is not true anymore. This\nasymmetry leads naturally to the definition of a \"scale of efficiency\" having\nthree steps: Pareto-optimality, sequenceability without Pareto-optimality, and\nnon-sequenceability. Finally, we investigate the links between these efficiency\nproperties and the \"scale of fairness\" we have described in an earlier work\n[7]: we first show that an allocation can be envy-free and non-sequenceable,\nbut that every competitive equilibrium with equal incomes is sequenceable. Then\nwe experimentally explore the links between the scales of efficiency and\nfairness.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 19:08:34 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Bouveret", "Sylvain", "", "Toulouse"], ["Lemaître", "Michel", "", "Toulouse"]]}, {"id": "1604.01741", "submitter": "Jean-Sebastien Gomez", "authors": "J S Gomez (Infres, LTCI), A Vergne (Infres), P Martins (Infres),\n  Laurent Decreusefond (LTCI), Wei Chen", "title": "Cournot-Nash Equilibria for Bandwidth Allocation under Base-Station\n  Cooperation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  -In this paper, a novel resource allocation scheme based on discrete\nCournot-Nash equilibria and optimal transport theory is proposed. The\noriginality of this framework lies in the joint optimization of downlink\nbandwidth allocation and cooperation between base stations. A tractable\nformalization is given in the form of a quadratic optimization problem. A low\ncomplexity approximate solution is derived and theoretically characterized.\nSimulations highlight the existence of an optimal working point, that maximizes\nuser satisfaction ratio and network load. The impact of the network deployment\non the optimum is numerically investigated, thanks to the $\\beta$-Ginibre\nmodel. Indeed, base stations are assumed to be drawn according to\n$\\beta$-Ginibre point processes. Numerical analysis shows that the network\nperformance increases with $\\beta$ going to one.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 19:29:17 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Gomez", "J S", "", "Infres, LTCI"], ["Vergne", "A", "", "Infres"], ["Martins", "P", "", "Infres"], ["Decreusefond", "Laurent", "", "LTCI"], ["Chen", "Wei", ""]]}, {"id": "1604.01952", "submitter": "David Balduzzi", "authors": "David Balduzzi", "title": "Deep Online Convex Optimization with Gated Games", "comments": "13 pages. This paper renders arXiv:1509.01851 obsolete. It contains\n  the same basic results, with major changes to exposition and minor changes to\n  terminology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT cs.NE stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Methods from convex optimization are widely used as building blocks for deep\nlearning algorithms. However, the reasons for their empirical success are\nunclear, since modern convolutional networks (convnets), incorporating\nrectifier units and max-pooling, are neither smooth nor convex. Standard\nguarantees therefore do not apply. This paper provides the first convergence\nrates for gradient descent on rectifier convnets. The proof utilizes the\nparticular structure of rectifier networks which consists in binary\nactive/inactive gates applied on top of an underlying linear network. The\napproach generalizes to max-pooling, dropout and maxout. In other words, to\nprecisely the neural networks that perform best empirically. The key step is to\nintroduce gated games, an extension of convex games with similar convergence\nproperties that capture the gating function of rectifiers. The main result is\nthat rectifier convnets converge to a critical point at a rate controlled by\nthe gated-regret of the units in the network. Corollaries of the main result\ninclude: (i) a game-theoretic description of the representations learned by a\nneural network; (ii) a logarithmic-regret algorithm for training neural nets;\nand (iii) a formal setting for analyzing conditional computation in neural nets\nthat can be applied to recently developed models of attention.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 10:46:54 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Balduzzi", "David", ""]]}, {"id": "1604.01971", "submitter": "Shahar Dobzinski", "authors": "Shahar Dobzinski", "title": "Computational Efficiency Requires Simple Taxation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We characterize the communication complexity of truthful mechanisms. Our\ndeparture point is the well known taxation principle. The taxation principle\nasserts that every truthful mechanism can be interpreted as follows: every\nplayer is presented with a menu that consists of a price for each bundle (the\nprices depend only on the valuations of the other players). Each player is\nallocated a bundle that maximizes his profit according to this menu. We define\nthe taxation complexity of a truthful mechanism to be the logarithm of the\nmaximum number of menus that may be presented to a player.\n  Our main finding is that in general the taxation complexity essentially\nequals the communication complexity. The proof consists of two main steps.\nFirst, we prove that for rich enough domains the taxation complexity is at most\nthe communication complexity. We then show that the taxation complexity is much\nsmaller than the communication complexity only in \"pathological\" cases and\nprovide a formal description of these extreme cases.\n  Next, we study mechanisms that access the valuations via value queries only.\nIn this setting we establish that the menu complexity -- a notion that was\nalready studied in several different contexts -- characterizes the number of\nvalue queries that the mechanism makes in exactly the same way that the\ntaxation complexity characterizes the communication complexity.\n  Our approach yields several applications, including strengthening the\nsolution concept with low communication overhead, fast computation of prices,\nand hardness of approximation by computationally efficient truthful mechanisms.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 12:13:12 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Dobzinski", "Shahar", ""]]}, {"id": "1604.02103", "submitter": "Hao Wang", "authors": "Hao Wang and Jianwei Huang", "title": "Cooperative Planning of Renewable Generations for Interconnected\n  Microgrids", "comments": "To appear in IEEE Transactions on Smart Grid", "journal-ref": "IEEE Transactions on Smart Grid, 7(5), Pages: 2486-2496, 2016", "doi": "10.1109/TSG.2016.2552642", "report-no": null, "categories": "cs.GT cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the renewable energy generations in Hong Kong based on realistic\nmeteorological data, and find that different renewable sources exhibit diverse\ntime-varying and location-dependent profiles. To efficiently explore and\nutilize the diverse renewable energy generations, we propose a theoretical\nframework for the cooperative planning of renewable generations in a system of\ninterconnected microgrids. The cooperative framework considers the\nself-interested behaviors of microgrids, and incorporates both their long-term\ninvestment costs and short-term operational costs over the planning horizon.\nSpecifically, interconnected microgrids jointly decide where and how much to\ndeploy renewable energy generations, and how to split the associated investment\ncost. We show that the cooperative framework minimizes the overall system cost.\nWe also design a fair cost sharing method based on Nash bargaining to\nincentivize cooperative planning, such that all microgrids will benefit from\ncooperative planning. Using realistic data obtained from the Hong Kong\nobservatory, we validate the cooperative planning framework, and demonstrate\nthat all microgrids benefit through the cooperation, and the overall system\ncost is reduced by 35.9% compared to the noncooperative planning benchmark.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 18:34:46 GMT"}], "update_date": "2016-08-23", "authors_parsed": [["Wang", "Hao", ""], ["Huang", "Jianwei", ""]]}, {"id": "1604.02364", "submitter": "Piotr Faliszewski", "authors": "Piotr Faliszewski and Jean-Francois Laslier and Robert Schaefer and\n  Piotr Skowron and Arkadii Slinko and Nimrod Talmon", "title": "Modeling Representation of Minorities Under Multiwinner Voting Rules", "comments": "14 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is twofold. First and foremost, we aim to\nexperimentally and quantitatively show that the choice of a multiwinner voting\nrule can play a crucial role on the way minorities are represented. We also\ntest the possibility for some of these rules to achieve proportional\nrepresentation.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 14:51:12 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Faliszewski", "Piotr", ""], ["Laslier", "Jean-Francois", ""], ["Schaefer", "Robert", ""], ["Skowron", "Piotr", ""], ["Slinko", "Arkadii", ""], ["Talmon", "Nimrod", ""]]}, {"id": "1604.02435", "submitter": "Jian Li", "authors": "Jian Li, Rajarshi Bhattacharyya, Suman Paul, Srinivas Shakkottai, and\n  Vijay Subramanian", "title": "Incentivizing Sharing in Realtime D2D Streaming Networks: A Mean Field\n  Game Perspective", "comments": "To appear in IEEE/ACM Transactions on Networking. A preliminary\n  version appeared in the proceedings of IEEE Infocom 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.PF cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of streaming live content to a cluster of co-located\nwireless devices that have both an expensive unicast base-station-to-device\n(B2D) interface, as well as an inexpensive broadcast device-to-device (D2D)\ninterface, which can be used simultaneously. Our setting is a streaming system\nthat uses a block-by-block random linear coding approach to achieve a target\npercentage of on-time deliveries with minimal B2D usage. Our goal is to design\nan incentive framework that would promote such cooperation across devices,\nwhile ensuring good quality of service. Based on ideas drawn from truth-telling\nauctions, we design a mechanism that achieves this goal via appropriate\ntransfers (monetary payments or rebates) in a setting with a large number of\ndevices, and with peer arrivals and departures. Here, we show that a Mean Field\nGame can be used to accurately approximate our system. Furthermore, the\ncomplexity of calculating the best responses under this regime is low. We\nimplement the proposed system on an Android testbed, and illustrate its\nefficient performance using real world experiments.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 19:32:43 GMT"}, {"version": "v2", "created": "Sun, 1 May 2016 14:38:05 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Li", "Jian", ""], ["Bhattacharyya", "Rajarshi", ""], ["Paul", "Suman", ""], ["Shakkottai", "Srinivas", ""], ["Subramanian", "Vijay", ""]]}, {"id": "1604.02606", "submitter": "Bo Li", "authors": "Bo Li, Yevgeniy Vorobeychik, Xinyun Chen", "title": "A General Retraining Framework for Scalable Adversarial Classification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional classification algorithms assume that training and test data come\nfrom similar distributions. This assumption is violated in adversarial\nsettings, where malicious actors modify instances to evade detection. A number\nof custom methods have been developed for both adversarial evasion attacks and\nrobust learning. We propose the first systematic and general-purpose retraining\nframework which can: a) boost robustness of an \\emph{arbitrary} learning\nalgorithm, in the face of b) a broader class of adversarial models than any\nprior methods. We show that, under natural conditions, the retraining framework\nminimizes an upper bound on optimal adversarial risk, and show how to extend\nthis result to account for approximations of evasion attacks. Extensive\nexperimental evaluation demonstrates that our retraining methods are nearly\nindistinguishable from state-of-the-art algorithms for optimizing adversarial\nrisk, but are more general and far more scalable. The experiments also confirm\nthat without retraining, our adversarial framework dramatically reduces the\neffectiveness of learning. In contrast, retraining significantly boosts\nrobustness to evasion attacks without significantly compromising overall\naccuracy.\n", "versions": [{"version": "v1", "created": "Sat, 9 Apr 2016 20:14:36 GMT"}, {"version": "v2", "created": "Sat, 26 Nov 2016 09:31:57 GMT"}], "update_date": "2016-11-29", "authors_parsed": [["Li", "Bo", ""], ["Vorobeychik", "Yevgeniy", ""], ["Chen", "Xinyun", ""]]}, {"id": "1604.02676", "submitter": "Siddharth Barman", "authors": "Siddharth Barman, Katrina Ligett, and Georgios Piliouras", "title": "Approximating Nash Equilibria in Tree Polymatrix Games", "comments": "Appeared in the proceedings of the 8th International Symposium on\n  Algorithmic Game Theory (SAGT), 2015. 11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a quasi-polynomial time Las Vegas algorithm for approximating Nash\nequilibria in polymatrix games over trees, under a mild renormalizing\nassumption. Our result, in particular, leads to an expected polynomial-time\nalgorithm for computing approximate Nash equilibria of tree polymatrix games in\nwhich the number of actions per player is a fixed constant. Further, for trees\nwith constant degree, the running time of the algorithm matches the best known\nupper bound for approximating Nash equilibria in bimatrix games (Lipton,\nMarkakis, and Mehta 2003).\n  Notably, this work closely complements the hardness result of Rubinstein\n(2015), which establishes the inapproximability of Nash equilibria in\npolymatrix games over constant-degree bipartite graphs with two actions per\nplayer.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 11:34:26 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Barman", "Siddharth", ""], ["Ligett", "Katrina", ""], ["Piliouras", "Georgios", ""]]}, {"id": "1604.02737", "submitter": "Luis Ortiz", "authors": "Luis E. Ortiz and Boshen Wang and Ze Gong", "title": "Correlated Equilibria for Approximate Variational Inference in MRFs", "comments": "54 pages, 8 figures, 20 plots, Extension of Section 4 of a manuscript\n  by the first author first drafted on August 25, 2009 (see\n  http://www-personal.umd.umich.edu/~leortiz/papers/infeq.pdf). Changes:\n  experiments with multiplicative-weight learning algorithms on larger (12x12)\n  synthetic Ising models and 28x28 Ising models learned from MNIST dataset; and\n  misc. edits to improve presentation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Almost all of the work in graphical models for game theory has mirrored\nprevious work in probabilistic graphical models. Our work considers the\nopposite direction: Taking advantage of recent advances in equilibrium\ncomputation for probabilistic inference. We present formulations of inference\nproblems in Markov random fields (MRFs) as computation of equilibria in a\ncertain class of game-theoretic graphical models. We concretely establishes the\nprecise connection between variational probabilistic inference in MRFs and\ncorrelated equilibria. No previous work exploits recent theoretical and\nempirical results from the literature on algorithmic and computational game\ntheory on the tractable, polynomial-time computation of exact or approximate\ncorrelated equilibria in graphical games with arbitrary, loopy graph structure.\nWe discuss how to design new algorithms with equally tractable guarantees for\nthe computation of approximate variational inference in MRFs. Also, inspired by\na previously stated game-theoretic view of state-of-the-art tree-reweighed\n(TRW) message-passing techniques for belief inference as zero-sum game, we\npropose a different, general-sum potential game to design approximate\nfictitious-play techniques. We perform synthetic experiments evaluating our\nproposed approximation algorithms with standard methods and TRW on several\nclasses of classical Ising models (i.e., with binary random variables). We also\nevaluate the algorithms using Ising models learned from the MNIST dataset. Our\nexperiments show that our global approach is competitive, particularly shinning\nin a class of Ising models with constant, \"highly attractive\" edge-weights, in\nwhich it is often better than all other alternatives we evaluated. With a\nnotable exception, our more local approach was not as effective. Yet, in\nfairness, almost all of the alternatives are often no better than a simple\nbaseline: estimate 0.5.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 21:21:00 GMT"}, {"version": "v2", "created": "Sat, 7 Oct 2017 13:18:40 GMT"}], "update_date": "2017-10-10", "authors_parsed": [["Ortiz", "Luis E.", ""], ["Wang", "Boshen", ""], ["Gong", "Ze", ""]]}, {"id": "1604.02929", "submitter": "Marco Alberto Javarone", "authors": "Marco Alberto Javarone", "title": "Solving Optimization Problems by the Public Goods Game", "comments": "17 pages, 5 figure. accepted for publication in Eur. Phys. J. B", "journal-ref": null, "doi": "10.1140/epjb/e2017-80346-6", "report-no": null, "categories": "physics.soc-ph cs.GT cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a method based on the Public Goods Game for solving optimization\ntasks. In particular, we focus on the Traveling Salesman Problem, i.e. a\nNP-hard problem whose search space exponentially grows increasing the number of\ncities. The proposed method considers a population whose agents are provided\nwith a random solution to the given problem. In doing so, agents interact by\nplaying the Public Goods Game using the fitness of their solution as currency\nof the game. Notably, agents with better solutions provide higher\ncontributions, while those with lower ones tend to imitate the solution of\nricher agents for increasing their fitness. Numerical simulations show that the\nproposed method allows to compute exact solutions, and suboptimal ones, in the\nconsidered search spaces. As result, beyond to propose a new heuristic for\ncombinatorial optimization problems, our work aims to highlight the\npotentiality of evolutionary game theory beyond its current horizons.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 17:45:10 GMT"}, {"version": "v2", "created": "Tue, 29 Aug 2017 12:10:39 GMT"}], "update_date": "2017-08-30", "authors_parsed": [["Javarone", "Marco Alberto", ""]]}, {"id": "1604.03171", "submitter": "Jamie Morgenstern", "authors": "Jamie Morgenstern, Tim Roughgarden", "title": "Learning Simple Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general framework for proving polynomial sample complexity\nbounds for the problem of learning from samples the best auction in a class of\n\"simple\" auctions. Our framework captures all of the most prominent examples of\n\"simple\" auctions, including anonymous and non-anonymous item and bundle\npricings, with either a single or multiple buyers. The technique we propose is\nto break the analysis of auctions into two natural pieces. First, one shows\nthat the set of allocation rules have large amounts of structure; second,\nfixing an allocation on a sample, one shows that the set of auctions agreeing\nwith this allocation on that sample have revenue functions with low\ndimensionality. Our results effectively imply that whenever it's possible to\ncompute a near-optimal simple auction with a known prior, it is also possible\nto compute such an auction with an unknown prior (given a polynomial number of\nsamples).\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 22:51:04 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Morgenstern", "Jamie", ""], ["Roughgarden", "Tim", ""]]}, {"id": "1604.03178", "submitter": "Luca de Alfaro", "authors": "Luca de Alfaro, Michael Shavlovsky, Vassilis Polychronopoulos", "title": "Incentives for Truthful Peer Grading", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": "UCSC-SOE-15-19", "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer grading systems work well only if users have incentives to grade\ntruthfully. An example of non-truthful grading, that we observed in classrooms,\nconsists in students assigning the maximum grade to all submissions. With a\nnaive grading scheme, such as averaging the assigned grades, all students would\nreceive the maximum grade. In this paper, we develop three grading schemes that\nprovide incentives for truthful peer grading. In the first scheme, the\ninstructor grades a fraction p of the submissions, and penalizes students whose\ngrade deviates from the instructor grade. We provide lower bounds on p to\nensure truthfulness, and conclude that these schemes work only for moderate\nclass sizes, up to a few hundred students. To overcome this limitation, we\npropose a hierarchical extension of this supervised scheme, and we show that it\ncan handle classes of any size with bounded (and little) instructor work, and\nis therefore applicable to Massive Open Online Courses (MOOCs). Finally, we\npropose unsupervised incentive schemes, in which the student incentive is based\non statistical properties of the grade distribution, without any grading\nrequired by the instructor. We show that the proposed unsupervised schemes\nprovide incentives to truthful grading, at the price of being possibly unfair\nto individual students.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 23:56:21 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["de Alfaro", "Luca", ""], ["Shavlovsky", "Michael", ""], ["Polychronopoulos", "Vassilis", ""]]}, {"id": "1604.03324", "submitter": "Duc-Tuyen Ta", "authors": "Duc-Tuyen Ta and Nhan Nguyen-Thanh and Patrick Maille and Phillippe\n  Ciblat and Van-Tam Nguyen", "title": "Mitigating selfish primary user emulation attacks in multi-channel\n  cognitive radio networks: A surveillance game", "comments": "6 pages; Globecom'16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Primary User Emulation Attack (PUEA), in which attackers emulate primary user\nsignals causing restriction of secondary access on the attacked channels, is a\nserious security problem in Cognitive Radio Networks (CRNs). An user performing\na PUEA for selfishly occupying more channels is called a selfish PUEA attacker.\nNetwork managers could adopt a surveillance process on disallowed channels for\nidentifying illegal channel occupation of selfish PUEA attackers and hence\nmitigating selfish PUEA. Determining surveillance strategies, particularly in\nmulti-channel context, is necessary for ensuring network operation fairness. In\nthis paper, we formulate a game, called multi-channel surveillance game,\nbetween the selfish attack and the surveillance process in multi-channel CRNs.\nThe sequence-form representation method is adopted to determine the Nash\nEquilibrium (NE) of the game. We show that performing the obtained NE\nsurveillance strategy significantly mitigates selfish PUEA.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 09:47:12 GMT"}, {"version": "v2", "created": "Tue, 19 Apr 2016 13:33:38 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Ta", "Duc-Tuyen", ""], ["Nguyen-Thanh", "Nhan", ""], ["Maille", "Patrick", ""], ["Ciblat", "Phillippe", ""], ["Nguyen", "Van-Tam", ""]]}, {"id": "1604.03609", "submitter": "Dinesh Govindaraj", "authors": "Dinesh Govindaraj", "title": "Network Formation Game with Different Cost Value for Players", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Social Networks, it is often interesting to study type of networks formed,\nits efficiency with respect to social objective and which networks are stable.\nMany work have already been there in this area. Players in network formation\ngame will incur some cost to form a link. In previous work, all player will\nhave same cost for forming a link int he network. Here we will the study the\noptimal network and Nash equilibrium network when each player have different\ncost value for forming the link in the social network.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 22:31:18 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Govindaraj", "Dinesh", ""]]}, {"id": "1604.03632", "submitter": "Nicholas Mattei", "authors": "Haris Aziz, Omer Lev, Nicholas Mattei, Jeffrey S. Rosenschein, and\n  Toby Walsh", "title": "Strategyproof Peer Selection using Randomization, Partitioning, and\n  Apportionment", "comments": "1 Figure, Source Code available at\n  https://github.com/nmattei/peerselection", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer reviews, evaluations, and selections are a fundamental aspect of modern\nscience. Funding bodies the world over employ experts to review and select the\nbest proposals from those submitted for funding. The problem of peer selection,\nhowever, is much more general: a professional society may want to give a subset\nof its members awards based on the opinions of all members; an instructor for a\nMassive Open Online Course (MOOC) or an online course may want to crowdsource\ngrading; or a marketing company may select ideas from group brainstorming\nsessions based on peer evaluation.\n  We make three fundamental contributions to the study of peer selection, a\nspecific type of group decision-making problem, studied in computer science,\neconomics, and political science. First, we propose a novel mechanism that is\nstrategyproof, i.e., agents cannot benefit by reporting insincere valuations.\nSecond, we demonstrate the effectiveness of our mechanism by a comprehensive\nsimulation-based comparison with a suite of mechanisms found in the literature.\nFinally, our mechanism employs a randomized rounding technique that is of\nindependent interest, as it solves the apportionment problem that arises in\nvarious settings where discrete resources such as parliamentary representation\nslots need to be divided proportionally.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 02:28:15 GMT"}, {"version": "v2", "created": "Fri, 29 Sep 2017 13:44:12 GMT"}, {"version": "v3", "created": "Thu, 25 Apr 2019 20:14:19 GMT"}, {"version": "v4", "created": "Tue, 30 Apr 2019 17:53:38 GMT"}], "update_date": "2019-05-01", "authors_parsed": [["Aziz", "Haris", ""], ["Lev", "Omer", ""], ["Mattei", "Nicholas", ""], ["Rosenschein", "Jeffrey S.", ""], ["Walsh", "Toby", ""]]}, {"id": "1604.03655", "submitter": "Haris Aziz", "authors": "Haris Aziz and Simon Mackenzie", "title": "A Discrete and Bounded Envy-Free Cake Cutting Protocol for Any Number of\n  Agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the well-studied cake cutting problem in which the goal is to\nfind an envy-free allocation based on queries from $n$ agents. The problem has\nreceived attention in computer science, mathematics, and economics. It has been\na major open problem whether there exists a discrete and bounded envy-free\nprotocol. We resolve the problem by proposing a discrete and bounded envy-free\nprotocol for any number of agents. The maximum number of queries required by\nthe protocol is $n^{n^{n^{n^{n^n}}}}$. We additionally show that even if we do\nnot run our protocol to completion, it can find in at most $n^3{(n^2)}^n$\nqueries a partial allocation of the cake that achieves proportionality (each\nagent gets at least $1/n$ of the value of the whole cake) and envy-freeness.\nFinally we show that an envy-free partial allocation can be computed in at most\n$n^3{(n^2)}^n$ queries such that each agent gets a connected piece that gives\nthe agent at least $1/(3n)$ of the value of the whole cake.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 05:06:29 GMT"}, {"version": "v10", "created": "Wed, 5 Oct 2016 22:30:52 GMT"}, {"version": "v11", "created": "Tue, 27 Dec 2016 23:00:21 GMT"}, {"version": "v12", "created": "Sun, 27 Aug 2017 08:35:26 GMT"}, {"version": "v2", "created": "Thu, 14 Apr 2016 02:50:59 GMT"}, {"version": "v3", "created": "Wed, 27 Apr 2016 21:45:28 GMT"}, {"version": "v4", "created": "Sat, 7 May 2016 13:57:27 GMT"}, {"version": "v5", "created": "Tue, 7 Jun 2016 11:44:24 GMT"}, {"version": "v6", "created": "Mon, 25 Jul 2016 12:36:58 GMT"}, {"version": "v7", "created": "Fri, 29 Jul 2016 22:15:32 GMT"}, {"version": "v8", "created": "Sun, 28 Aug 2016 23:25:26 GMT"}, {"version": "v9", "created": "Thu, 15 Sep 2016 11:07:30 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Aziz", "Haris", ""], ["Mackenzie", "Simon", ""]]}, {"id": "1604.03747", "submitter": "Sundong Kim", "authors": "Sundong Kim, Jin-Jae Lee", "title": "Behavior of Self-Motivated Agents in Complex Networks", "comments": "14 pages, Format: Winter Simulation Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional evolutionary game theory describes how certain strategy spreads\nthroughout the system where individual player imitates the most successful\nstrategy among its neighborhood. Accordingly, player doesn't have own authority\nto change their state. However in the human society, peoples do not just follow\nstrategies of other people, they choose their own strategy. In order to see the\ndecision of each agent in timely basis and differentiate between network\nstructures, we conducted multi-agent based modeling and simulation. In this\npaper, agent can decide its own strategy by payoff comparison and we name this\nagent as \"Self-motivated agent\". To explain the behavior of self-motivated\nagent, prisoner's dilemma game with cooperator, defector, loner and punisher\nare considered as an illustrative example. We performed simulation by\ndifferentiating participation rate, mutation rate and the degree of network,\nand found the special coexisting conditions.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 12:56:27 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Kim", "Sundong", ""], ["Lee", "Jin-Jae", ""]]}, {"id": "1604.03764", "submitter": "Lin Gao", "authors": "Lin Gao, Lingjie Duan, and Jianwei Huang", "title": "Two-sided Matching Based Cooperative Spectrum Sharing", "comments": "This manuscript serves as the online technical report for the paper\n  with the same title published in IEEE Transactions on Mobile Computing, 2016", "journal-ref": null, "doi": "10.1109/TMC.2016.2557794", "report-no": null, "categories": "cs.GT cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamic spectrum access (DSA) can effectively improve the spectrum efficiency\nand alleviate the spectrum scarcity, by allowing unlicensed secondary users\n(SUs) to access the licensed spectrum of primary users (PUs) opportunistically.\nCooperative spectrum sharing is a new promising paradigm to provide necessary\nincentives for both PUs and SUs in dynamic spectrum access. The key idea is\nthat SUs relay the traffic of PUs in exchange for the access time on the PUs'\nlicensed spectrum. In this paper, we formulate the cooperative spectrum sharing\nbetween multiple PUs and multiple SUs as a two-sided market, and study the\nmarket equilibrium under both complete and incomplete information. First, we\ncharacterize the sufficient and necessary conditions for the market\nequilibrium. We analytically show that there may exist multiple market\nequilibria, among which there is always a unique Pareto-optimal equilibrium for\nPUs (called PU-Optimal-EQ), in which every PU achieves a utility no worse than\nin any other equilibrium. Then, we show that under complete information, the\nunique Pareto-optimal equilibrium PU-Optimal-EQ can always be achieved despite\nthe competition among PUs; whereas, under incomplete information, the\nPU-Optimal-EQ may not be achieved due to the mis-representations of SUs (in\nreporting their private information). Regarding this, we further study the\nworse-case equilibrium for PUs, and characterize a Robust equilibrium for PUs\n(called PU-Robust-EQ), which provides every PU a guaranteed utility under all\npossible mis-representation behaviors of SUs. Numerical results show that in a\ntypical network where the number of PUs and SUs are different, the performance\ngap between PU-Optimal-EQ and PU-Robust-EQ is quite small (e.g., less than 10%\nin the simulations).\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 13:36:04 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Gao", "Lin", ""], ["Duan", "Lingjie", ""], ["Huang", "Jianwei", ""]]}, {"id": "1604.03773", "submitter": "EPTCS", "authors": "Youssouf Oualhadj (LACL, U-PEC, Paris, France), Nicolas Troquard\n  (LACL, U-PEC, Paris, France)", "title": "Rational Verification in Iterated Electric Boolean Games", "comments": "In Proceedings SR 2016, arXiv:1607.02694", "journal-ref": "EPTCS 218, 2016, pp. 41-51", "doi": "10.4204/EPTCS.218.4", "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electric boolean games are compact representations of games where the players\nhave qualitative objectives described by LTL formulae and have limited\nresources. We study the complexity of several decision problems related to the\nanalysis of rationality in electric boolean games with LTL objectives. In\nparticular, we report that the problem of deciding whether a profile is a Nash\nequilibrium in an iterated electric boolean game is no harder than in iterated\nboolean games without resource bounds. We show that it is a PSPACE-complete\nproblem. As a corollary, we obtain that both rational elimination and rational\nconstruction of Nash equilibria by a supervising authority are PSPACE-complete\nproblems.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 13:51:59 GMT"}, {"version": "v2", "created": "Tue, 12 Jul 2016 13:47:18 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Oualhadj", "Youssouf", "", "LACL, U-PEC, Paris, France"], ["Troquard", "Nicolas", "", "LACL, U-PEC, Paris, France"]]}, {"id": "1604.04095", "submitter": "Paolo Serafino", "authors": "Nicola Gatti, Marco Rocco, Paolo Serafino, Carmine Ventre", "title": "Towards Better Models of Externalities in Sponsored Search Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sponsored Search Auctions (SSAs) arguably represent the problem at the\nintersection of computer science and economics with the deepest applications in\nreal life. Within the realm of SSAs, the study of the effects that showing one\nad has on the other ads, a.k.a. externalities in economics, is of utmost\nimportance and has so far attracted the attention of much research. However,\neven the basic question of modeling the problem has so far escaped a definitive\nanswer. The popular cascade model is arguably too idealized to really describe\nthe phenomenon yet it allows a good comprehension of the problem. Other models,\ninstead, describe the setting more adequately but are too complex to permit a\nsatisfactory theoretical analysis. In this work, we attempt to get the best of\nboth approaches: firstly, we define a number of general mathematical\nformulations for the problem in the attempt to have a rich description of\nexternalities in SSAs and, secondly, prove a host of results drawing a nearly\ncomplete picture about the computational complexity of the problem. We\ncomplement these approximability results with some considerations about\nmechanism design in our context.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 10:13:37 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Gatti", "Nicola", ""], ["Rocco", "Marco", ""], ["Serafino", "Paolo", ""], ["Ventre", "Carmine", ""]]}, {"id": "1604.04157", "submitter": "Walter Kern", "authors": "Walter Kern, Bodo Manthey, Marc Uetz", "title": "Note on VCG vs. Price Raising for Matching Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In \\cite{EK10} the use of VCG in matching markets is motivated by saying that\nin order to compute market clearing prices in a matching market, the auctioneer\nneeds to know the true valuations of the bidders. Hence VCG and corresponding\npersonalized prices are proposed as an incentive compatible mechanism. The same\nline of argument pops up in several lecture sheets and other documents related\nto courses based on Easley and Kleinberg's book, seeming to suggest that\ncomputing market clearing prices and corresponding assignments were \\emph{not}\nincentive compatible. Main purpose of our note is to observe that, in contrast,\nassignments based on buyer optimal market clearing prices are indeed incentive\ncompatible.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 13:54:10 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Kern", "Walter", ""], ["Manthey", "Bodo", ""], ["Uetz", "Marc", ""]]}, {"id": "1604.04270", "submitter": "Attila Szolnoki", "authors": "Attila Szolnoki, Matjaz Perc", "title": "Collective influence in evolutionary social dilemmas", "comments": "6 pages, 5 figures; accepted for publication in Europhysics Letters", "journal-ref": "EPL 113 (2016) 58004", "doi": "10.1209/0295-5075/113/58004", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When evolutionary games are contested in structured populations, the degree\nof each player in the network plays an important role. If they exist, hubs\noften determine the fate of the population in remarkable ways. Recent research\nbased on optimal percolation in random networks has shown, however, that the\ndegree is neither the sole nor the best predictor of influence in complex\nnetworks. Low-degree nodes may also be optimal influencers if they are\nhierarchically linked to hubs. Taking this into account leads to the formalism\nof collective influence in complex networks, which as we show here, has\nfar-reaching implications for the favorable resolution of social dilemmas. In\nparticular, there exists an optimal hierarchical depth for the determination of\ncollective influence that we use to describe the potency of players for passing\ntheir strategies, which depends on the strength of the social dilemma.\nInterestingly, the degree, which corresponds to the baseline depth zero, is\noptimal only when the temptation to defect is small. Our research reveals that\nevolutionary success stories are related to spreading processes which are\nrooted in favorable hierarchical structures that extend beyond local\nneighborhoods.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 19:36:14 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1604.04403", "submitter": "Palash Dey", "authors": "Palash Dey and Neeldhara Misra", "title": "Elicitation for Preferences Single Peaked on Trees", "comments": "To appear in IJCAI 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.CC cs.DS cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In multiagent systems, we often have a set of agents each of which have a\npreference ordering over a set of items and one would like to know these\npreference orderings for various tasks, for example, data analysis, preference\naggregation, voting etc. However, we often have a large number of items which\nmakes it impractical to ask the agents for their complete preference ordering.\nIn such scenarios, we usually elicit these agents' preferences by asking (a\nhopefully small number of) comparison queries --- asking an agent to compare\ntwo items. Prior works on preference elicitation focus on unrestricted domain\nand the domain of single peaked preferences and show that the preferences in\nsingle peaked domain can be elicited by much less number of queries compared to\nunrestricted domain. We extend this line of research and study preference\nelicitation for single peaked preferences on trees which is a strict superset\nof the domain of single peaked preferences. We show that the query complexity\ncrucially depends on the number of leaves, the path cover number, and the\ndistance from path of the underlying single peaked tree, whereas the other\nnatural parameters like maximum degree, diameter, pathwidth do not play any\ndirect role in determining query complexity. We then investigate the query\ncomplexity for finding a weak Condorcet winner for preferences single peaked on\na tree and show that this task has much less query complexity than preference\nelicitation. Here again we observe that the number of leaves in the underlying\nsingle peaked tree and the path cover number of the tree influence the query\ncomplexity of the problem.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 08:40:39 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""]]}, {"id": "1604.04579", "submitter": "Wenjing Shuai", "authors": "Wenjing Shuai and Patrick Maill\\'e and Alexander Pelov", "title": "Competition Between Regulation-Providing and Fixed-Power Charging\n  Stations for Electric Vehicles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper models a non-cooperative game between two EV charging stations.\nOne is a fixed-power charging station purchasing electricity from the grid at\nwholesale price and reselling the energy to EV owners at a higher retail price;\nthe other is regulation-providing and varies the recharging power level of its\nclients to provide regulation services to the grid, so its profit comes from\nboth EV owners (who buy energy) and the grid (which pays for regulation\nservices). Users are reluctant to charging power variations and prefer shorter\noverall charging times, hence regulation-providing charging has to be cheaper\nthan fixed-power charging.\n  We analyze the competition among those charging providers, and examine the\nperformance at the equilibrium in terms of user welfare, station revenue and\nelectricity prices. As expected, competing stations provide users with lower\ncharging prices than when both charging solutions are offered by a monopolistic\nprovider. Moreover, while competition benefits users, it also benefits the grid\nin that the amount of regulation services increases significantly with respect\nto the monopolistic case.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 17:34:04 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Shuai", "Wenjing", ""], ["Maillé", "Patrick", ""], ["Pelov", "Alexander", ""]]}, {"id": "1604.04725", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Reyhan Aydogan, Vicente Julian and Catholijn\n  Jonker", "title": "Unanimously acceptable agreements for negotiation teams in unpredictable\n  domains", "comments": "Electronic Commerce Research and Applications, 2014", "journal-ref": null, "doi": "10.1016/j.elerap.2014.05.002", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A negotiation team is a set of agents with common and possibly also\nconflicting preferences that forms one of the parties of a negotiation. A\nnegotiation team is involved in two decision making processes simultaneously, a\nnegotiation with the opponents, and an intra-team process to decide on the\nmoves to make in the negotiation. This article focuses on negotiation team\ndecision making for circumstances that require unanimity of team decisions.\nExisting agent-based approaches only guarantee unanimity in teams negotiating\nin domains exclusively composed of predictable and compatible issues. This\narticle presents a model for negotiation teams that guarantees unanimous team\ndecisions in domains consisting of predictable and compatible, and also\nunpredictable issues. Moreover, the article explores the influence of using\nopponent, and team member models in the proposing strategies that team members\nuse. Experimental results show that the team benefits if team members employ\nBayesian learning to model their teammates' preferences.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 11:01:44 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Aydogan", "Reyhan", ""], ["Julian", "Vicente", ""], ["Jonker", "Catholijn", ""]]}, {"id": "1604.04728", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Vicente Julian, Vicente Botti and Ana\n  Garcia-Fornes", "title": "Reaching Unanimous Agreements Within Agent-Based Negotiation Teams With\n  Linear and Monotonic Utility Functions", "comments": "IEEE Transactions on Systems, Man, and Cybernetics, Part B\n  (Cybernetics), 2012", "journal-ref": null, "doi": "10.1109/TSMCB.2011.2177658", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, an agent-based negotiation model for negotiation teams that\nnegotiate a deal with an opponent is presented. Agent-based negotiation teams\nare groups of agents that join together as a single negotiation party because\nthey share an interest that is related to the negotiation process. The model\nrelies on a trusted mediator that coordinates and helps team members in the\ndecisions that they have to take during the negotiation process: which offer is\nsent to the opponent, and whether the offers received from the opponent are\naccepted. The main strength of the proposed negotiation model is the fact that\nit guarantees unanimity within team decisions since decisions report a utility\nto team members that is greater than or equal to their aspiration levels at\neach negotiation round. This work analyzes how unanimous decisions are taken\nwithin the team and the robustness of the model against different types of\nmanipulations. An empirical evaluation is also performed to study the impact of\nthe different parameters of the model.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 11:42:38 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Julian", "Vicente", ""], ["Botti", "Vicente", ""], ["Garcia-Fornes", "Ana", ""]]}, {"id": "1604.04730", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Soledad Valero, Vicente Julian, Vicente Botti\n  and Ana Garcia-Fornes", "title": "Evolutionary-aided negotiation model for bilateral bargaining in Ambient\n  Intelligence domains with complex utility functions", "comments": "Information Sciences, 2013", "journal-ref": null, "doi": "10.1016/j.ins.2010.11.018", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ambient Intelligence aims to offer personalized services and easier ways of\ninteraction between people and systems. Since several users and systems may\ncoexist in these environments, it is quite possible that entities with opposing\npreferences need to cooperate to reach their respective goals. Automated\nnegotiation is pointed as one of the mechanisms that may provide a solution to\nthis kind of problems. In this article, a multi-issue bilateral bargaining\nmodel for Ambient Intelligence domains is presented where it is assumed that\nagents have computational bounded resources and do not know their opponents'\npreferences. The main goal of this work is to provide negotiation models that\nobtain efficient agreements while maintaining the computational cost low. A\nniching genetic algorithm is used before the negotiation process to sample\none's own utility function (self-sampling). During the negotiation process,\ngenetic operators are applied over the opponent's and one's own offers in order\nto sample new offers that are interesting for both parties. Results show that\nthe proposed model is capable of outperforming similarity heuristics which only\nsample before the negotiation process and of obtaining similar results to\nsimilarity heuristics which have access to all of the possible offers.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 11:53:46 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Valero", "Soledad", ""], ["Julian", "Vicente", ""], ["Botti", "Vicente", ""], ["Garcia-Fornes", "Ana", ""]]}, {"id": "1604.04736", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Reyhan Aydogan, Vicente Julian and Catholijn\n  Jonker", "title": "Intra-Team Strategies for Teams Negotiating Against Competitor,\n  Matchers, and Conceders", "comments": "Novel Insights in Agent-based Complex Automated Negotiation, 2014", "journal-ref": null, "doi": "10.1007/978-4-431-54758-7_1", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under some circumstances, a group of individuals may need to negotiate\ntogether as a negotiation team against another party. Unlike bilateral\nnegotiation between two individuals, this type of negotiations entails to adopt\nan intra-team strategy for negotiation teams in order to make team decisions\nand accordingly negotiate with the opponent. It is crucial to be able to\nnegotiate successfully with heterogeneous opponents since opponents'\nnegotiation strategy and behavior may vary in an open environment. While one\nopponent might collaborate and concede over time, another may not be inclined\nto concede. This paper analyzes the performance of recently proposed intra-team\nstrategies for negotiation teams against different categories of opponents:\ncompetitors, matchers, and conceders. Furthermore, it provides an extension of\nthe negotiation tool Genius for negotiation teams in bilateral settings.\nConsequently, this work facilitates research in negotiation teams.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 12:11:02 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Aydogan", "Reyhan", ""], ["Julian", "Vicente", ""], ["Jonker", "Catholijn", ""]]}, {"id": "1604.04809", "submitter": "Dominik Wojtczak", "authors": "Sunil Simon and Dominik Wojtczak", "title": "Efficient Local Search in Coordination Games on Graphs", "comments": "Extended version of a paper accepted to IJCAI16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study strategic games on weighted directed graphs, where the payoff of a\nplayer is defined as the sum of the weights on the edges from players who chose\nthe same strategy augmented by a fixed non-negative bonus for picking a given\nstrategy. These games capture the idea of coordination in the absence of\nglobally common strategies. Prior work shows that the problem of determining\nthe existence of a pure Nash equilibrium for these games is NP-complete already\nfor graphs with all weights equal to one and no bonuses. However, for several\nclasses of graphs (e.g. DAGs and cliques) pure Nash equilibria or even strong\nequilibria always exist and can be found by simply following a particular\nimprovement or coalition-improvement path, respectively. In this paper we\nidentify several natural classes of graphs for which a finite improvement or\ncoalition-improvement path of polynomial length always exists, and, as a\nconsequence, a Nash equilibrium or strong equilibrium in them can be found in\npolynomial time. We also argue that these results are optimal in the sense that\nin natural generalisations of these classes of graphs, a pure Nash equilibrium\nmay not even exist.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 23:07:59 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Simon", "Sunil", ""], ["Wojtczak", "Dominik", ""]]}, {"id": "1604.04859", "submitter": "Moran Feldman", "authors": "Moran Feldman and Rica Gonen", "title": "Online Truthful Mechanisms for Multi-sided Markets", "comments": "21 pages. This paper studies an online extension of a model suggested\n  by arXiv:1603.08717. For completeness, we repeat some of the proofs of\n  arXiv:1603.08717", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The study of mechanisms for multi-sided markets has received an increasingly\ngrowing attention from the research community, and is motivated by the numerous\nexamples of such markets on the web and in electronic commerce. Many of these\nexamples represent dynamic and uncertain environments, and thus, require, in\nfact, online mechanisms. Unfortunately, as far as we know, no previously\npublished online mechanism for a multi-sided market (or even for a double-sided\nmarket) has managed to (approximately) maximize the gain from trade, while\nguaranteeing desirable economic properties such as incentivizing truthfulness,\nvoluntary participation and avoiding budget deficit. In this work we present\nthe first online mechanism for a multi-sided market which has the above\nproperties. Our mechanism is designed for a market setting suggested by\n[Feldman and Gonen (2016)]; which is motivated by the foreseeable future form\nof online advertising.\n  The online nature of our setting motivated us to define a stronger notion of\nindividual rationality, called \"continuous individual rationality\", capturing\nthe natural requirement that a player should never lose either by participating\nin the mechanism or by not leaving prematurely. Satisfying the requirements of\ncontinuous individual rationality, together with the other economic properties\nour mechanism guarantees, requires the mechanism to use a novel pricing scheme\nwhere users may be paid ongoing increments during the mechanism's execution up\nto a pre-known maximum value. As users rarely ever get paid in reality, this\npricing scheme is new to mechanism design. Nevertheless, the principle it is\nbased on can be observed in many common real life scenarios such as executive\ncompensation payments and company acquisition deals. We believe both our new\ndynamic pricing scheme concept and our strengthened notion of individual\nrationality are of independent interest.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 10:45:07 GMT"}, {"version": "v2", "created": "Tue, 6 Sep 2016 09:51:18 GMT"}], "update_date": "2016-09-07", "authors_parsed": [["Feldman", "Moran", ""], ["Gonen", "Rica", ""]]}, {"id": "1604.04871", "submitter": "Parinaz Naghizadeh", "authors": "Parinaz Naghizadeh and Mingyan Liu", "title": "Using Private and Public Assessments in Security Information Sharing\n  Agreements", "comments": "To appear in the IEEE Transactions on Information Forensics and\n  Security (IEEE TIFS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information sharing among organizations has been gaining attention as a\nmethod for improving cybersecurity. However, the associated disclosure costs\nact as deterrents for firms' voluntary cooperation. In this work, we take a\ngame-theoretic approach to understanding firms' incentives in these agreements.\nWe propose the design of inter-temporal incentives (i.e. conditioning future\ncooperation on past interactions). Specifically, we show that incentives for\nfull cooperation can be designed if firms share their private assessments of\nother firms' disclosure decisions through a common communication platform. We\nfurther show that similar incentives can be designed based on outcomes of a\npublic rating/assessment system.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 14:06:15 GMT"}, {"version": "v2", "created": "Thu, 16 Jan 2020 21:45:28 GMT"}], "update_date": "2020-01-20", "authors_parsed": [["Naghizadeh", "Parinaz", ""], ["Liu", "Mingyan", ""]]}, {"id": "1604.04876", "submitter": "Shahar Dobzinski", "authors": "Liad Blumrosen and Shahar Dobzinski", "title": "(Almost) Efficient Mechanisms for Bilateral Trading", "comments": "Some minimal overlap with arXiv:1404.6786 [cs.GT], but the two papers\n  are mostly disjoint", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the bilateral trade problem: one seller, one buyer and a single,\nindivisible item for sale. It is well known that there is no fully-efficient\nand incentive compatible mechanism for this problem that maintains a balanced\nbudget. We design simple and robust mechanisms that obtain approximate\nefficiency with these properties. We show that even minimal use of statistical\ndata can yield good approximation results. Finally, we demonstrate how a\nmechanism for this simple bilateral-trade problem can be used as a \"black-box\"\nfor constructing mechanisms in more general environments.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 14:34:02 GMT"}, {"version": "v2", "created": "Thu, 28 Jul 2016 18:48:55 GMT"}, {"version": "v3", "created": "Sun, 18 Nov 2018 19:41:51 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Blumrosen", "Liad", ""], ["Dobzinski", "Shahar", ""]]}, {"id": "1604.04928", "submitter": "Yang Liu", "authors": "Yang Liu and Yiling Chen", "title": "Learning to Incentivize: Eliciting Effort via Output Agreement", "comments": "23 pages; short version is accepted to IJCAI 16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In crowdsourcing when there is a lack of verification for contributed\nanswers, output agreement mechanisms are often used to incentivize participants\nto provide truthful answers when the correct answer is hold by the majority. In\nthis paper, we focus on using output agreement mechanisms to elicit effort, in\naddition to eliciting truthful answers, from a population of workers. We\nconsider a setting where workers have heterogeneous cost of effort exertion and\nexamine the data requester's problem of deciding the reward level in output\nagreement for optimal elicitation. In particular, when the requester knows the\ncost distribution, we derive the optimal reward level for output agreement\nmechanisms. This is achieved by first characterizing Bayesian Nash equilibria\nof output agreement mechanisms for a given reward level. When the requester\ndoes not know the cost distribution, we develop sequential mechanisms that\ncombine learning the cost distribution with incentivizing effort exertion to\napproximately determine the optimal reward level.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 21:07:02 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Liu", "Yang", ""], ["Chen", "Yiling", ""]]}, {"id": "1604.05090", "submitter": "Josef Tkadlec", "authors": "Krishnendu Chatterjee, Rasmus Ibsen-Jensen, Josef Tkadlec", "title": "Robust Draws in Balanced Knockout Tournaments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Balanced knockout tournaments are ubiquitous in sports competitions and are\nalso used in decision-making and elections. The traditional computational\nquestion, that asks to compute a draw (optimal draw) that maximizes the winning\nprobability for a distinguished player, has received a lot of attention.\nPrevious works consider the problem where the pairwise winning probabilities\nare known precisely, while we study how robust is the winning probability with\nrespect to small errors in the pairwise winning probabilities. First, we\npresent several illuminating examples to establish: (a)~there exist\ndeterministic tournaments (where the pairwise winning probabilities are~0 or~1)\nwhere one optimal draw is much more robust than the other; and (b)~in general,\nthere exist tournaments with slightly suboptimal draws that are more robust\nthan all the optimal draws. The above examples motivate the study of the\ncomputational problem of robust draws that guarantee a specified winning\nprobability. Second, we present a polynomial-time algorithm for approximating\nthe robustness of a draw for sufficiently small errors in pairwise winning\nprobabilities, and obtain that the stated computational problem is NP-complete.\nWe also show that two natural cases of deterministic tournaments where the\noptimal draw could be computed in polynomial time also admit polynomial-time\nalgorithms to compute robust optimal draws.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 11:13:59 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Ibsen-Jensen", "Rasmus", ""], ["Tkadlec", "Josef", ""]]}, {"id": "1604.05194", "submitter": "Palash Dey", "authors": "Palash Dey and Neeldhara Misra", "title": "Preference Elicitation For Single Crossing Domain", "comments": "To appear in IJCAI 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.DS cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eliciting the preferences of a set of agents over a set of alternatives is a\nproblem of fundamental importance in social choice theory. Prior work on this\nproblem has studied the query complexity of preference elicitation for the\nunrestricted domain and for the domain of single peaked preferences. In this\npaper, we consider the domain of single crossing preference profiles and study\nthe query complexity of preference elicitation under various settings. We\nconsider two distinct situations: when an ordering of the voters with respect\nto which the profile is single crossing is known versus when it is unknown. We\nalso consider different access models: when the votes can be accessed at\nrandom, as opposed to when they are coming in a pre-defined sequence. In the\nsequential access model, we distinguish two cases when the ordering is known:\nthe first is that sequence in which the votes appear is also a single-crossing\norder, versus when it is not.\n  The main contribution of our work is to provide polynomial time algorithms\nwith low query complexity for preference elicitation in all the above six\ncases. Further, we show that the query complexities of our algorithms are\noptimal up to constant factors for all but one of the above six cases. We then\npresent preference elicitation algorithms for profiles which are close to being\nsingle crossing under various notions of closeness, for example, single\ncrossing width, minimum number of candidates | voters whose deletion makes a\nprofile single crossing.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 08:47:18 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""]]}, {"id": "1604.05243", "submitter": "Yun Kuen Cheung", "authors": "Yun Kuen Cheung", "title": "Better Strategyproof Mechanisms without Payments or Prior --- An\n  Analytic Approach", "comments": "14 pages. This is the full version of and IJCAI 2016 conference paper\n  of the same title", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the problem of designing strategyproof mechanisms for allocating\ndivisible items among two agents who have linear utilities, where payments are\ndisallowed and there is no prior information on the agents' preferences. The\nobjective is to design strategyproof mechanisms which are competitive against\nthe most efficient (but not strategyproof) mechanism.\n  For the case with two items:\n  (1) We provide a set of sufficient conditions for strategyproofness.\n  (2) We use an analytic approach to derive strategyproof mechanisms which are\nmore competitive than all prior strategyproof mechanisms.\n  (3) We improve the linear-program-based proof of Guo and Conitzer to show new\nupper bounds on competitive ratios.\n  (4) We provide the first \"mathematical\" upper bound proof.\n  For the cases with any number of items:\n  (1) We build on the Partial Allocation mechanisms introduced by Cole et al.\nto design a strategyproof mechanism which is 0.67776-competitive, breaking the\n2/3 barrier.\n  (2) We propose a new subclass of strategyproof mechanisms called\nDynamical-Increasing-Price mechanisms, where each agent purchases the items\nusing virtual money, and the prices of the items depend on other agents'\npreferences.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 17:09:19 GMT"}, {"version": "v2", "created": "Wed, 12 Apr 2017 07:44:03 GMT"}], "update_date": "2017-04-13", "authors_parsed": [["Cheung", "Yun Kuen", ""]]}, {"id": "1604.05471", "submitter": "Ragavendran Gopalakrishnan", "authors": "Arpita Biswas, Ragavendran Gopalakrishnan, Partha Dutta", "title": "Managing Overstaying Electric Vehicles in Park-and-Charge Facilities", "comments": "Published in Proceedings of the 25th International Joint Conference\n  on Artificial Intelligence IJCAI 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the increase in adoption of Electric Vehicles (EVs), proper utilization\nof the charging infrastructure is an emerging challenge for service providers.\nOverstaying of an EV after a charging event is a key contributor to low\nutilization. Since overstaying is easily detectable by monitoring the power\ndrawn from the charger, managing this problem primarily involves designing an\nappropriate \"penalty\" during the overstaying period. Higher penalties do\ndiscourage overstaying; however, due to uncertainty in parking duration, less\npeople would find such penalties acceptable, leading to decreased utilization\n(and revenue). To analyze this central trade-off, we develop a novel framework\nthat integrates models for realistic user behavior into queueing dynamics to\nlocate the optimal penalty from the points of view of utilization and revenue,\nfor different values of the external charging demand. Next, when the model\nparameters are unknown, we show how an online learning algorithm, such as UCB,\ncan be adapted to learn the optimal penalty. Our experimental validation, based\non charging data from London, shows that an appropriate penalty can increase\nboth utilization and revenue while significantly reducing overstaying.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 08:42:14 GMT"}, {"version": "v2", "created": "Thu, 14 Jul 2016 15:20:26 GMT"}], "update_date": "2016-07-15", "authors_parsed": [["Biswas", "Arpita", ""], ["Gopalakrishnan", "Ragavendran", ""], ["Dutta", "Partha", ""]]}, {"id": "1604.05543", "submitter": "Thorsten Wissmann", "authors": "Alexander Weinert and Martin Zimmermann", "title": "Easy to Win, Hard to Master: Optimal Strategies in Parity Games with\n  Costs", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 13, Issue 3 (September\n  19, 2017) lmcs:3938", "doi": "10.23638/LMCS-13(3:29)2017", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The winning condition of a parity game with costs requires an arbitrary, but\nfixed bound on the cost incurred between occurrences of odd colors and the next\noccurrence of a larger even one. Such games quantitatively extend parity games\nwhile retaining most of their attractive properties, i.e, determining the\nwinner is in NP and co-NP and one player has positional winning strategies.\n  We show that the characteristics of parity games with costs are vastly\ndifferent when asking for strategies realizing the minimal such bound: The\nsolution problem becomes PSPACE-complete and exponential memory is both\nnecessary in general and always sufficient. Thus, solving and playing parity\ngames with costs optimally is harder than just winning them. Moreover, we show\nthat the tradeoff between the memory size and the realized bound is gradual in\ngeneral. All these results hold true for both a unary and binary encoding of\ncosts.\n  Moreover, we investigate Streett games with costs. Here, playing optimally is\nas hard as winning, both in terms of complexity and memory.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 12:46:14 GMT"}, {"version": "v2", "created": "Thu, 9 Feb 2017 13:20:37 GMT"}, {"version": "v3", "created": "Thu, 10 Aug 2017 11:12:01 GMT"}, {"version": "v4", "created": "Mon, 18 Sep 2017 13:16:40 GMT"}], "update_date": "2017-10-11", "authors_parsed": [["Weinert", "Alexander", ""], ["Zimmermann", "Martin", ""]]}, {"id": "1604.05562", "submitter": "Veronika Loitzenbauer", "authors": "Oren Ben-Zwi and Monika Henzinger and Veronika Loitzenbauer", "title": "Ad Exchange: Envy-Free Auctions with Mediators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ad exchanges are an emerging platform for trading advertisement slots on the\nweb with billions of dollars revenue per year. Every time a user visits a web\npage, the publisher of that web page can ask an ad exchange to auction off the\nad slots on this page to determine which advertisements are shown at which\nprice. Due to the high volume of traffic, ad networks typically act as\nmediators for individual advertisers at ad exchanges. If multiple advertisers\nin an ad network are interested in the ad slots of the same auction, the ad\nnetwork might use a \"local\" auction to resell the obtained ad slots among its\nadvertisers.\n  In this work we want to deepen the theoretical understanding of these new\nmarkets by analyzing them from the viewpoint of combinatorial auctions. Prior\nwork studied mostly single-item auctions, while we allow the advertisers to\nexpress richer preferences over multiple items. We develop a game-theoretic\nmodel for the entanglement of the central auction at the ad exchange with the\nlocal auctions at the ad networks. We consider the incentives of all three\ninvolved parties and suggest a three-party competitive equilibrium, an\nextension of the Walrasian equilibrium that ensures envy-freeness for all\nparticipants. We show the existence of a three-party competitive equilibrium\nand a polynomial-time algorithm to find one for gross-substitute bidder\nvaluations.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 13:34:08 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Ben-Zwi", "Oren", ""], ["Henzinger", "Monika", ""], ["Loitzenbauer", "Veronika", ""]]}, {"id": "1604.05692", "submitter": "Florian Brandl", "authors": "Florian Brandl, Felix Brandt, Manuel Eberl and Christian Geist", "title": "Proving the Incompatibility of Efficiency and Strategyproofness via SMT\n  Solving", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two important requirements when aggregating the preferences of multiple\nagents are that the outcome should be economically efficient and the\naggregation mechanism should not be manipulable. In this paper, we provide a\ncomputer-aided proof of a sweeping impossibility using these two conditions for\nrandomized aggregation mechanisms. More precisely, we show that every efficient\naggregation mechanism can be manipulated for all expected utility\nrepresentations of the agents' preferences. This settles an open problem and\nstrengthens a number of existing theorems, including statements that were shown\nwithin the special domain of assignment. Our proof is obtained by formulating\nthe claim as a satisfiability problem over predicates from real-valued\narithmetic, which is then checked using an SMT (satisfiability modulo theories)\nsolver. In order to verify the correctness of the result, a minimal\nunsatisfiable set of constraints returned by the SMT solver was translated back\ninto a proof in higher-order logic, which was automatically verified by an\ninteractive theorem prover. To the best of our knowledge, this is the first\napplication of SMT solvers in computational social choice.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 19:01:55 GMT"}, {"version": "v2", "created": "Sat, 23 Apr 2016 10:21:50 GMT"}, {"version": "v3", "created": "Thu, 16 Jun 2016 12:19:30 GMT"}, {"version": "v4", "created": "Wed, 6 Sep 2017 16:03:25 GMT"}], "update_date": "2017-09-07", "authors_parsed": [["Brandl", "Florian", ""], ["Brandt", "Felix", ""], ["Eberl", "Manuel", ""], ["Geist", "Christian", ""]]}, {"id": "1604.05972", "submitter": "David K\\\"ubel", "authors": "Elmar Langetepe and David K\\\"ubel", "title": "Optimal online escape path against a certificate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  More than fifty years ago, Bellman asked for the best escape path within a\nknown forest but for an unknown starting position. This deterministic finite\npath is the shortest path that leads out of a given environment from any\nstarting point. There are some worst case positions where the full path length\nis required. Up to now such a fixed ultimate optimal escape path for a known\nshape for any starting position is only known for some special convex shapes\n(i.e., circles, strips of a given width, fat convex bodies, some isosceles\ntriangles). Therefore, we introduce a different, simple and intuitive escape\npath, the so-called certificate path. This escape path depends on the starting\nposition s and takes the distances from s to the outer boundary of the\nenvironment into account. Due to the additional information, the certificate\npath always (for any position s) leaves the environment earlier than the\nultimate escape path, in the above convex examples. Next we assume that fewer\ninformation is available. Neither the precise shape of the envir- onment, nor\nthe location of the starting point is known. For a class of environments\n(convex shapes and shapes with kernel positions), we design an online strategy\nthat always leaves the environment. We show that the path length for leaving\nthe environment is always shorter than 3.318764 the length of the corresponding\ncertificate path. We also give a lower bound of 3.313126, which shows that for\nthe above class of environments the factor 3.318764 is (almost) tight.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 14:21:16 GMT"}], "update_date": "2016-04-21", "authors_parsed": [["Langetepe", "Elmar", ""], ["Kübel", "David", ""]]}, {"id": "1604.06061", "submitter": "Viktor Winschel", "authors": "Jules Hedges, Evguenia Shprits, Viktor Winschel, Philipp Zahn", "title": "Compositionality and String Diagrams for Game Theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce string diagrams as a formal mathematical, graphical language to\nrepresent, compose, program and reason about games. The language is well\nestablished in quantum physics, quantum computing and quantum linguistic with\nthe semantics given by category theory. We apply this language to the game\ntheoretical setting and show examples how to use it for some economic games\nwhere we highlight the compositional nature of our higher-order game theory.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 19:03:10 GMT"}], "update_date": "2016-04-21", "authors_parsed": [["Hedges", "Jules", ""], ["Shprits", "Evguenia", ""], ["Winschel", "Viktor", ""], ["Zahn", "Philipp", ""]]}, {"id": "1604.06167", "submitter": "Matthew Shum", "authors": "Kirill Pogorelskiy, Emerson Melo, Matthew Shum", "title": "Testing the Quantal Response Hypothesis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a non-parametric test for consistency of players'\nbehavior in a series of games with the Quantal Response Equilibrium (QRE). The\ntest exploits a characterization of the equilibrium choice probabilities in any\nstructural QRE as the gradient of a convex function, which thus satisfies the\ncyclic monotonicity inequalities. Our testing procedure utilizes recent\neconometric results for moment inequality models. We assess our test using lab\nexperimental data from a series of generalized matching pennies games. We\nreject the QRE hypothesis in the pooled data, but it cannot be rejected in the\nindividual data for over half of the subjects.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 02:55:36 GMT"}], "update_date": "2016-04-22", "authors_parsed": [["Pogorelskiy", "Kirill", ""], ["Melo", "Emerson", ""], ["Shum", "Matthew", ""]]}, {"id": "1604.06210", "submitter": "Erel Segal-Halevi", "authors": "Erel Segal-Halevi and Avinatan Hassidim and Yonatan Aumann", "title": "Double Auctions in Markets for Multiple Kinds of Goods", "comments": "Full version of IJCAI-18 paper, with 2 figures. Previous names:\n  \"MIDA: A Multi Item-type Double-Auction Mechanism\", \"A Random-Sampling\n  Double-Auction Mechanism\". 10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by applications such as stock exchanges and spectrum auctions,\nthere is a growing interest in mechanisms for arranging trade in two-sided\nmarkets. Existing mechanisms are either not truthful, or do not guarantee an\nasymptotically-optimal gain-from-trade, or rely on a prior on the traders'\nvaluations, or operate in limited settings such as a single kind of good. We\nextend the random market-halving technique used in earlier works to markets\nwith multiple kinds of goods, where traders have gross-substitute valuations.\nWe present MIDA: a Multi Item-kind Double-Auction mechanism. It is prior-free,\ntruthful, strongly-budget-balanced, and guarantees near-optimal gain from trade\nwhen market sizes of all goods grow to $\\infty$ at a similar rate.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 08:11:43 GMT"}, {"version": "v2", "created": "Sat, 23 Jul 2016 20:43:40 GMT"}, {"version": "v3", "created": "Thu, 4 Aug 2016 18:41:32 GMT"}, {"version": "v4", "created": "Sun, 15 Jan 2017 10:11:44 GMT"}, {"version": "v5", "created": "Tue, 1 May 2018 04:42:31 GMT"}], "update_date": "2018-05-02", "authors_parsed": [["Segal-Halevi", "Erel", ""], ["Hassidim", "Avinatan", ""], ["Aumann", "Yonatan", ""]]}, {"id": "1604.06580", "submitter": "Yannai A. Gonczarowski", "authors": "Moshe Babaioff, Yannai A. Gonczarowski, Noam Nisan", "title": "The Menu-Size Complexity of Revenue Approximation", "comments": null, "journal-ref": null, "doi": "10.1016/j.geb.2021.03.001", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a monopolist selling $n$ items to an additive buyer whose item\nvalues are drawn from independent distributions $F_1,F_2,\\ldots,F_n$ possibly\nhaving unbounded support. Unlike in the single-item case, it is well known that\nthe revenue-optimal selling mechanism (a pricing scheme) may be complex,\nsometimes requiring a continuum of menu entries. Also known is that simple\nmechanisms with a bounded number of menu entries can extract a constant\nfraction of the optimal revenue. Nonetheless, whether an arbitrarily high\nfraction of the optimal revenue can be extracted via a bounded menu size\nremained open.\n  We give an affirmative answer: for every $n$ and $\\varepsilon>0$, there\nexists $C=C(n,\\varepsilon)$ s.t. mechanisms of menu size at most $C$ suffice\nfor obtaining $(1-\\varepsilon)$ of the optimal revenue from any\n$F_1,\\ldots,F_n$. We prove upper and lower bounds on the revenue-approximation\ncomplexity $C(n,\\varepsilon)$ and on the deterministic communication complexity\nrequired to run a mechanism achieving such an approximation.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2016 09:14:02 GMT"}, {"version": "v2", "created": "Tue, 1 Nov 2016 17:15:42 GMT"}, {"version": "v3", "created": "Sun, 9 Apr 2017 23:04:19 GMT"}, {"version": "v4", "created": "Fri, 9 Apr 2021 19:46:01 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Babaioff", "Moshe", ""], ["Gonczarowski", "Yannai A.", ""], ["Nisan", "Noam", ""]]}, {"id": "1604.06710", "submitter": "Mason Wright", "authors": "Mason Wright", "title": "Using Reinforcement Learning to Validate Empirical Game-Theoretic\n  Analysis: A Continuous Double Auction Study", "comments": "technical report, 37 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Empirical game-theoretic analysis (EGTA) has recently been applied\nsuccessfully to analyze the behavior of large numbers of competing traders in a\ncontinuous double auction market. Multiagent simulation methods like EGTA are\nuseful for studying complex strategic environments like a stock market, where\nit is not feasible to solve analytically for the rational behavior of each\nagent. A weakness of simulation-based methods in strategic settings, however,\nis that it is typically impossible to prove that the strategy profile assigned\nto the simulated agents is stable, as in a Nash equilibrium. I propose using\nreinforcement learning to analyze the regret of supposed Nash-equilibrium\nstrategy profiles found by EGTA. I have developed a new library of\nreinforcement learning tools, which I have integrated into an extended version\nof the market simulator from our prior work. I provide evidence for the\neffectiveness of our library methods, both on a suite of benchmark problems\nfrom the literature, and on non-equilibrium strategy profiles in our market\nenvironment. Finally, I use our new reinforcement learning tools to provide\nevidence that the equilibria found by EGTA in our recent continuous double\nauction study are likely to have only negligible regret, even with respect to\nan extended strategy space.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2016 15:23:27 GMT"}], "update_date": "2016-04-25", "authors_parsed": [["Wright", "Mason", ""]]}, {"id": "1604.07084", "submitter": "Tom Morgan", "authors": "Meena Boppana, Rani Hod, Michael Mitzenmacher and Tom Morgan", "title": "Voronoi Choice Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study novel variations of Voronoi games and associated random processes\nthat we call Voronoi choice games. These games provide a rich framework for\nstudying questions regarding the power of small numbers of choices in\nmulti-player, competitive scenarios, and they further lead to many interesting,\nnon-trivial random processes that appear worthy of study.\n  As an example of the type of problem we study, suppose a group of $n$ miners\nare staking land claims through the following process: each miner has $m$\nassociated points independently and uniformly distributed on an underlying\nspace, so the $k$th miner will have associated points\n$p_{k1},p_{k2},\\ldots,p_{km}$. Each miner chooses one of these points as the\nbase point for their claim. Each miner obtains mining rights for the area of\nthe square that is closest to their chosen base, that is, they obtain the\nVoronoi cell corresponding to their chosen point in the Voronoi diagram of the\n$n$ chosen points. Each player's goal is simply to maximize the amount of land\nunder their control. What can we say about the players' strategy and the\nequilibria of such games?\n  In our main result, we derive bounds on the expected number of pure Nash\nequilibria for a variation of the 1-dimensional game on the circle where a\nplayer owns the arc starting from their point and moving clockwise to the next\npoint. This result uses interesting properties of random arc lengths on\ncircles, and demonstrates the challenges in analyzing these kinds of problems.\nWe also provide several other related results. In particular, for the\n1-dimensional game on the circle, we show that a pure Nash equilibrium always\nexists when each player owns the part of the circle nearest to their point, but\nit is NP-hard to determine whether a pure Nash equilibrium exists in the\nvariant when each player owns the arc starting from their point clockwise to\nthe next point.\n", "versions": [{"version": "v1", "created": "Sun, 24 Apr 2016 21:18:40 GMT"}], "update_date": "2016-04-26", "authors_parsed": [["Boppana", "Meena", ""], ["Hod", "Rani", ""], ["Mitzenmacher", "Michael", ""], ["Morgan", "Tom", ""]]}, {"id": "1604.07139", "submitter": "Hao Fu", "authors": "Hao Fu, Hongxing Li, Zizhan Zheng, Pengfei Hu, Prasant Mohapatra", "title": "Trust Exploitation and Attention Competition: A Game Theoretical Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The proliferation of Social Network Sites (SNSs) has greatly reformed the way\nof information dissemination, but also provided a new venue for hosts with\nimpure motivations to disseminate malicious information. Social trust is the\nbasis for information dissemination in SNSs. Malicious hosts judiciously and\ndynamically make the balance between maintaining its social trust and selfishly\nmaximizing its malicious gain over a long time-span. Studying the optimal\nresponse strategies for each malicious host could assist to design the best\nsystem maneuver so as to achieve the targeted level of overall malicious\nactivities. In this paper, we propose an interaction-based social trust model,\nand formulate the maximization of long-term malicious gains of multiple\ncompeting hosts as a non-cooperative differential game. Through rigorous\nanalysis, optimal response strategies are identified and the best system\nmaneuver mechanism is presented. Extensive numerical studies further verify the\nanalytical results.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 06:26:30 GMT"}, {"version": "v2", "created": "Wed, 20 Jul 2016 01:24:48 GMT"}, {"version": "v3", "created": "Sun, 2 Oct 2016 00:36:40 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Fu", "Hao", ""], ["Li", "Hongxing", ""], ["Zheng", "Zizhan", ""], ["Hu", "Pengfei", ""], ["Mohapatra", "Prasant", ""]]}, {"id": "1604.07259", "submitter": "Xavier Vila\\c{c}a", "authors": "Amin M. Khan and Xavier Vila\\c{c}a and Lu\\'is Rodrigues and Felix\n  Freitag", "title": "A Distributed Auctioneer for Resource Allocation in Decentralized\n  Systems", "comments": "17 pages, 5 figures, 1 algorithm, published in ICDCS'16", "journal-ref": "36th IEEE International Conference on Distributed Computing\n  Systems (ICDCS 2016). Nara, Japan. 27-30 June 2016", "doi": "10.1109/ICDCS.2016.38", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In decentralized systems, nodes often need to coordinate to access shared\nresources in a fair manner. One approach to perform such arbitration is to rely\non auction mechanisms. Although there is an extensive literature that studies\nauctions, most of these works assume the existence of a central, trusted\nauctioneer. Unfortunately, in fully decentralized systems, where the nodes that\nneed to cooperate operate under separate spheres of control, such central\ntrusted entity may not exist. Notable examples of such decentralized systems\ninclude community networks, clouds of clouds, cooperative nano data centres,\namong others. In this paper, we make theoretical and practical contributions to\ndistribute the role of the auctioneer. From the theoretical perspective, we\npropose a framework of distributed simulations of the auctioneer that are Nash\nequilibria resilient to coalitions and asynchrony. From the practical\nperspective, our protocols leverage the distributed nature of the simulations\nto parallelise the execution. We have implemented a prototype that instantiates\nthe framework for bandwidth allocation in community networks, and evaluated it\nin a real distributed setting.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 13:50:48 GMT"}], "update_date": "2020-01-20", "authors_parsed": [["Khan", "Amin M.", ""], ["Vilaça", "Xavier", ""], ["Rodrigues", "Luís", ""], ["Freitag", "Felix", ""]]}, {"id": "1604.07540", "submitter": "Haris Aziz", "authors": "Haris Aziz and Pang Luo and Christine Rizkallah", "title": "Incompatibility of Efficiency and Strategyproofness in the Random\n  Assignment Setting with Indifferences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fundamental resource allocation setting is the random assignment problem in\nwhich agents express preferences over objects that are then randomly allocated\nto the agents. In 2001, Bogomolnaia and Moulin presented the probabilistic\nserial (PS) mechanism that is an anonymous, neutral, Pareto optimal, and weak\nstrategyproof mechanism when the preferences are considered with respect to\nstochastic dominance. The result holds when agents have strict preferences over\nindividual objects. It has been an open problem whether there exists a\nmechanism that satisfies the same properties when agents may have indifference\namong the objects. We show that for this more general domain, there exists no\nextension of PS that is ex post efficient and weak strategyproof. The result is\nsurprising because it does not even require additional symmetry or fairness\nconditions such as anonymity, neutrality, or equal treatment of equals. Our\nresult further demonstrates that the lack of weak SD-strategyproofness of the\nextended PS mechanism of Katta and Sethuraman (2006) is not a design flaw of\nextended PS but is due to an inherent incompatibility of efficiency and\nstrategyproofness of PS in the full preference domain.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 06:34:45 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Aziz", "Haris", ""], ["Luo", "Pang", ""], ["Rizkallah", "Christine", ""]]}, {"id": "1604.07564", "submitter": "Dietmar Berwanger", "authors": "Dietmar Berwanger, Anup Basil Mathew, R. Ramanujam", "title": "A Retraction Theorem for Distributed Synthesis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.FL cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general theorem for distributed synthesis problems in\ncoordination games with $\\omega$-regular objectives of the form: If there\nexists a winning strategy for the coalition, then there exists an \"essential\"\nwinning strategy, that is obtained by a retraction of the given one. In\ngeneral, this does not lead to finite-state winning strategies, but when the\nknowledge of agents remains bounded, we can solve the synthesis problem. Our\nstudy is carried out in a setting where objectives are expressed in terms of\nevents that may \\emph{not} be observable. This is natural in games of imperfect\ninformation, rather than the common assumption that objectives are expressed in\nterms of events that are observable to all agents. We characterise decidable\ndistributed synthesis problems in terms of finiteness of knowledge states and\nfinite congruence classes induced by them.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 08:32:29 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Berwanger", "Dietmar", ""], ["Mathew", "Anup Basil", ""], ["Ramanujam", "R.", ""]]}, {"id": "1604.07634", "submitter": "Rasmus Ibsen-Jensen", "authors": "Kristoffer Arnsfelt Hansen, Rasmus Ibsen-Jensen, and Michal Kouck\\'y", "title": "The Big Match in Small Space", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study how to play (stochastic) games optimally using little\nspace. We focus on repeated games with absorbing states, a type of two-player,\nzero-sum concurrent mean-payoff games. The prototypical example of these games\nis the well known Big Match of Gillete (1957). These games may not allow\noptimal strategies but they always have {\\epsilon}-optimal strategies. In this\npaper we design {\\epsilon}-optimal strategies for Player 1 in these games that\nuse only O(log log T ) space. Furthermore, we construct strategies for Player 1\nthat use space s(T), for an arbitrary small unbounded non-decreasing function\ns, and which guarantee an {\\epsilon}-optimal value for Player 1 in the limit\nsuperior sense. The previously known strategies use space {\\Omega}(logT) and it\nwas known that no strategy can use constant space if it is {\\epsilon}-optimal\neven in the limit superior sense. We also give a complementary lower bound.\nFurthermore, we also show that no Markov strategy, even extended with finite\nmemory, can ensure value greater than 0 in the Big Match, answering a question\nposed by Abraham Neyman.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 11:56:08 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Hansen", "Kristoffer Arnsfelt", ""], ["Ibsen-Jensen", "Rasmus", ""], ["Koucký", "Michal", ""]]}, {"id": "1604.08179", "submitter": "Eli A. Meirom", "authors": "Eli A. Meirom, Shie Mannor, Ariel Orda", "title": "Strategic Formation of Heterogeneous Networks", "comments": "arXiv admin note: text overlap with arXiv:1307.4102, arXiv:1412.8501", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish a network formation game for the Internet's Autonomous System\n(AS) interconnection topology. The game includes different types of players,\naccounting for the heterogeneity of ASs in the Internet. In this network\nformation game, the utility of a player depends on the network structure, e.g.,\nthe distances between nodes and the cost of links. We also consider the case\nwhere utility (or monetary) transfers are allowed between the players. We\nincorporate reliability considerations in the player's utility function, and\nanalyze static properties of the game as well as its dynamic evolution. We\nprovide dynamic analysis of topological quantities, and explain the prevalence\nof some \"network motifs\" in the Internet graph. We assess our predictions with\nreal-world data.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 19:02:49 GMT"}, {"version": "v2", "created": "Sat, 30 Apr 2016 20:36:43 GMT"}, {"version": "v3", "created": "Mon, 23 May 2016 17:59:33 GMT"}], "update_date": "2016-05-24", "authors_parsed": [["Meirom", "Eli A.", ""], ["Mannor", "Shie", ""], ["Orda", "Ariel", ""]]}, {"id": "1604.08191", "submitter": "Zack Fitzsimmons", "authors": "Zack Fitzsimmons and Edith Hemaspaandra", "title": "Modeling Single-Peakedness for Votes with Ties", "comments": "A shorter version of this paper will appear in STAIRS 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Single-peakedness is one of the most important and well-known domain\nrestrictions on preferences. The computational study of single-peaked\nelectorates has largely been restricted to elections with tie-free votes, and\nrecent work that studies the computational complexity of manipulative attacks\nfor single-peaked elections for votes with ties has been restricted to\nnonstandard models of single-peaked preferences for top orders. We study the\ncomputational complexity of manipulation for votes with ties for the standard\nmodel of single-peaked preferences and for single-plateaued preferences. We\nshow that these models avoid the anomalous complexity behavior exhibited by the\nother models. We also state a surprising result on the relation between the\nsocietal axis and the complexity of manipulation for single-peaked preferences.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 19:28:00 GMT"}, {"version": "v2", "created": "Sat, 18 Jun 2016 17:21:39 GMT"}], "update_date": "2016-06-21", "authors_parsed": [["Fitzsimmons", "Zack", ""], ["Hemaspaandra", "Edith", ""]]}, {"id": "1604.08379", "submitter": "Debasis Mishra", "authors": "Debasis Mishra and Tridib Sharma", "title": "Balanced Ranking Mechanisms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the private values single object auction model, we construct a\nsatisfactory mechanism - a symmetric, dominant strategy incentive compatible,\nand budget-balanced mechanism. Our mechanism allocates the object to the\nhighest valued agent with more than 99% probability provided there are at least\n14 agents. It is also ex-post individually rational. We show that our mechanism\nis optimal in a restricted class of satisfactory ranking mechanisms. Since\nachieving efficiency through a dominant strategy incentive compatible and\nbudget-balanced mechanism is impossible in this model, our results illustrate\nthe limits of this impossibility.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 11:41:02 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Mishra", "Debasis", ""], ["Sharma", "Tridib", ""]]}, {"id": "1604.08779", "submitter": "Reino Niskanen", "authors": "Reino Niskanen, Igor Potapov, Julien Reichert", "title": "Undecidability of Two-dimensional Robot Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Robot game is a two-player vector addition game played on the integer lattice\n$\\mathbb{Z}^n$. Both players have sets of vectors and in each turn the vector\nchosen by a player is added to the current configuration vector of the game.\nOne of the players, called Eve, tries to play the game from the initial\nconfiguration to the origin while the other player, Adam, tries to avoid the\norigin. The problem is to decide whether or not Eve has a winning strategy. In\nthis paper we prove undecidability of the robot game in dimension two answering\nthe question formulated by Doyen and Rabinovich in 2011 and closing the gap\nbetween undecidable and decidable cases.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 11:34:38 GMT"}], "update_date": "2016-05-02", "authors_parsed": [["Niskanen", "Reino", ""], ["Potapov", "Igor", ""], ["Reichert", "Julien", ""]]}, {"id": "1604.08910", "submitter": "Parinaz Naghizadeh Ardabili", "authors": "Parinaz Naghizadeh and Mingyan Liu", "title": "Provision of Public Goods on Networks: On Existence, Uniqueness, and\n  Centralities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the provision of public goods on networks of strategic agents. We\nstudy different effort outcomes of these network games, namely, the Nash\nequilibria, Pareto efficient effort profiles, and semi-cooperative equilibria\n(effort profiles resulting from interactions among coalitions of agents). We\nidentify necessary and sufficient conditions on the structure of the network\nfor the uniqueness of the Nash equilibrium. We show that our finding unifies\n(and strengthens) existing results in the literature. We also identify\nconditions for the existence of Nash equilibria for the subclasses of games at\nthe two extremes of our model, namely games of strategic complements and games\nof strategic substitutes. We provide a graph-theoretical interpretation of\nagents' efforts at the Nash equilibrium, as well as the Pareto efficient\noutcomes and semi-cooperative equilibria, by linking an agent's decision to her\ncentrality in the interaction network. Using this connection, we separate the\neffects of incoming and outgoing edges on agents' efforts and uncover an\nalternating effect over walks of different length in the network.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 16:57:32 GMT"}, {"version": "v2", "created": "Wed, 18 May 2016 21:06:52 GMT"}], "update_date": "2016-05-20", "authors_parsed": [["Naghizadeh", "Parinaz", ""], ["Liu", "Mingyan", ""]]}]