[{"id": "1708.00043", "submitter": "J. Benjamin Miller", "authors": "Shuchi Chawla, J. Benjamin Miller, Yifeng Teng", "title": "Pricing for Online Resource Allocation: Intervals and Paths", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present pricing mechanisms for several online resource allocation problems\nwhich obtain tight or nearly tight approximations to social welfare. In our\nsettings, buyers arrive online and purchase bundles of items; buyers' values\nfor the bundles are drawn from known distributions. This problem is closely\nrelated to the so-called prophet-inequality of Krengel and Sucheston and its\nextensions in recent literature. Motivated by applications to cloud economics,\nwe consider two kinds of buyer preferences. In the first, items correspond to\ndifferent units of time at which a resource is available; the items are\narranged in a total order and buyers desire intervals of items. The second\ncorresponds to bandwidth allocation over a tree network; the items are edges in\nthe network and buyers desire paths.\n  Because buyers' preferences have complementarities in the settings we\nconsider, recent constant-factor approximations via item prices do not apply,\nand indeed strong negative results are known. We develop static, anonymous\nbundle pricing mechanisms.\n  For the interval preferences setting, we show that static, anonymous bundle\npricings achieve a sublogarithmic competitive ratio, which is optimal (within\nconstant factors) over the class of all online allocation algorithms, truthful\nor not. For the path preferences setting, we obtain a nearly-tight logarithmic\ncompetitive ratio. Both of these results exhibit an exponential improvement\nover item pricings for these settings. Our results extend to settings where the\nseller has multiple copies of each item, with the competitive ratio decreasing\nlinearly with supply. Such a gradual tradeoff between supply and the\ncompetitive ratio for welfare was previously known only for the single item\nprophet inequality.\n", "versions": [{"version": "v1", "created": "Mon, 31 Jul 2017 19:12:36 GMT"}, {"version": "v2", "created": "Tue, 24 Apr 2018 17:55:19 GMT"}, {"version": "v3", "created": "Fri, 13 Jul 2018 02:46:30 GMT"}], "update_date": "2018-07-16", "authors_parsed": [["Chawla", "Shuchi", ""], ["Miller", "J. Benjamin", ""], ["Teng", "Yifeng", ""]]}, {"id": "1708.00075", "submitter": "Cyril Zhang", "authors": "Elad Hazan, Karan Singh, Cyril Zhang", "title": "Efficient Regret Minimization in Non-Convex Games", "comments": "Published as a conference paper at ICML 2017", "journal-ref": null, "doi": null, "report-no": "PMLR 70:1433-1441", "categories": "cs.LG cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider regret minimization in repeated games with non-convex loss\nfunctions. Minimizing the standard notion of regret is computationally\nintractable. Thus, we define a natural notion of regret which permits efficient\noptimization and generalizes offline guarantees for convergence to an\napproximate local optimum. We give gradient-based methods that achieve optimal\nregret, which in turn guarantee convergence to equilibrium in this framework.\n", "versions": [{"version": "v1", "created": "Mon, 31 Jul 2017 21:23:29 GMT"}], "update_date": "2017-11-06", "authors_parsed": [["Hazan", "Elad", ""], ["Singh", "Karan", ""], ["Zhang", "Cyril", ""]]}, {"id": "1708.00239", "submitter": "Oleksii Ignatenko", "authors": "Oleksii Ignatenko, Oleksandr Synetskyi", "title": "Evolutionary game of N competing AIMD connections", "comments": "International Conference on Information and Communication\n  Technologies in Education, Research, and Industrial Applications. Springer,\n  Cham, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with modeling of network's dynamic using evolutionary games\napproach. Today there are many different protocols for data transmission\nthrough the Internet, providing users with better or worse service. The process\nof choosing better protocol could be considered as a dynamic game with players\n(users), trying to maximize their payoffs (eg throughput). In this work we\npresented the model of network's dynamic using differential equations with\ndiscontinuous right side and proved existence and uniqueness of the solution,\nformulated payoff matrix for a network game and found conditions of equilibrium\nexistence depending on loss sensitivity parameter. The results are illustrated\nby simulations\n", "versions": [{"version": "v1", "created": "Tue, 1 Aug 2017 10:48:39 GMT"}], "update_date": "2017-08-02", "authors_parsed": [["Ignatenko", "Oleksii", ""], ["Synetskyi", "Oleksandr", ""]]}, {"id": "1708.00521", "submitter": "Shikha Singh", "authors": "Jing Chen, Samuel McCauley, and Shikha Singh", "title": "Non-Cooperative Rational Interactive Proofs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interactive-proof games model the scenario where an honest party interacts\nwith powerful but strategic provers, to elicit from them the correct answer to\na computational question. Interactive proofs are increasingly used as a\nframework to design protocols for computation outsourcing.\n  Existing interactive-proof games largely fall into two categories: either as\ngames of cooperation such as multi-prover interactive proofs and cooperative\nrational proofs, where the provers work together as a team; or as games of\nconflict such as refereed games, where the provers directly compete with each\nother in a zero-sum game. Neither of these extremes truly capture the strategic\nnature of service providers in outsourcing applications. How to design and\nanalyze non-cooperative interactive proofs is an important open problem.\n  In this paper, we introduce a mechanism-design approach to define a\nmulti-prover interactive-proof model in which the provers are rational and\nnon-cooperative---they act to maximize their expected utility given others'\nstrategies. We define a strong notion of backwards induction as our solution\nconcept to analyze the resulting extensive-form game with imperfect\ninformation.\n  Our protocols provide utility gap guarantees, which are analogous to\nsoundness gap in classic interactive proofs. At a high level, a utility gap of\nu means that the protocol is robust against provers that may not care about a\nutility loss of 1/u.\n  We fully characterize the complexity of our proof system under different\nutility gap guarantees. For example, we show that with a polynomial utility\ngap, the power of non-cooperative rational interactive proofs is exactly\nP^NEXP.\n", "versions": [{"version": "v1", "created": "Tue, 1 Aug 2017 21:19:13 GMT"}, {"version": "v2", "created": "Mon, 9 Apr 2018 13:55:51 GMT"}, {"version": "v3", "created": "Sun, 9 Sep 2018 21:37:37 GMT"}, {"version": "v4", "created": "Thu, 7 Mar 2019 20:40:26 GMT"}, {"version": "v5", "created": "Thu, 15 Aug 2019 15:15:58 GMT"}], "update_date": "2019-08-16", "authors_parsed": [["Chen", "Jing", ""], ["McCauley", "Samuel", ""], ["Singh", "Shikha", ""]]}, {"id": "1708.00611", "submitter": "Haifeng Xu", "authors": "Ashwinkumar Badanidiyuru, Kshipra Bhawalkar, Haifeng Xu", "title": "Targeting and Signaling in Ad Auctions", "comments": "Appears at SODA 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern ad auctions allow advertisers to target more specific segments of the\nuser population. Unfortunately, this is not always in the best interest of the\nad platform. In this paper, we examine the following basic question in the\ncontext of second-price ad auctions: how should an ad platform optimally reveal\ninformation about the ad opportunity to the advertisers in order to maximize\nrevenue? We consider a model in which bidders' valuations depend on a random\nstate of the ad opportunity. Different from previous work, we focus on a more\npractical, and challenging, situation where the space of possible realizations\nof ad opportunities is extremely large. We thus focus on developing algorithms\nwhose running time is independent of the number of ad opportunity realizations.\n  We examine the auctioneer's algorithmic question of designing the optimal\nsignaling scheme. When the auctioneer is restricted to send a public signal to\nall bidders, we focus on a well-motivated Bayesian valuation setting in which\nthe auctioneer and bidders both have private information, and present two main\nresults: 1. we exhibit a characterization result regarding approximately\noptimal schemes and prove that any constant-approximate public signaling scheme\nmust use exponentially many signals; 2. we present a \"simple\" public signaling\nscheme that serves as a constant approximation under mild assumptions. We then\ninitiate an exploration on the power of being able to send different signals\nprivately to different bidders. Here we examine a basic setting where the\nauctioneer knows bidders' valuations, and exhibit a polynomial-time private\nscheme that extracts almost full surplus even in the worst Bayes Nash\nequilibrium. This illustrates the surprising power of private signaling schemes\nin extracting revenue.\n", "versions": [{"version": "v1", "created": "Wed, 2 Aug 2017 06:15:29 GMT"}, {"version": "v2", "created": "Wed, 1 Nov 2017 05:26:44 GMT"}, {"version": "v3", "created": "Mon, 15 Jul 2019 00:33:53 GMT"}], "update_date": "2019-07-16", "authors_parsed": [["Badanidiyuru", "Ashwinkumar", ""], ["Bhawalkar", "Kshipra", ""], ["Xu", "Haifeng", ""]]}, {"id": "1708.00730", "submitter": "Tomasz Tajmajer", "authors": "Andrzej Janusz, Maciej \\'Swiechowski, Tomasz Tajmajer", "title": "Helping AI to Play Hearthstone: AAIA'17 Data Mining Challenge", "comments": "Federated Conference on Computer Science and Information Systems,\n  Prague (FedCSIS-2017) (Prague, Czech Republic)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper summarizes the AAIA'17 Data Mining Challenge: Helping AI to Play\nHearthstone which was held between March 23, and May 15, 2017 at the Knowledge\nPit platform. We briefly describe the scope and background of this competition\nin the context of a more general project related to the development of an AI\nengine for video games, called Grail. We also discuss the outcomes of this\nchallenge and demonstrate how predictive models for the assessment of player's\nwinning chances can be utilized in a construction of an intelligent agent for\nplaying Hearthstone. Finally, we show a few selected machine learning\napproaches for modeling state and action values in Hearthstone. We provide\nevaluation for a few promising solutions that may be used to create more\nadvanced types of agents, especially in conjunction with Monte Carlo Tree\nSearch algorithms.\n", "versions": [{"version": "v1", "created": "Wed, 2 Aug 2017 12:58:04 GMT"}], "update_date": "2017-08-03", "authors_parsed": [["Janusz", "Andrzej", ""], ["Świechowski", "Maciej", ""], ["Tajmajer", "Tomasz", ""]]}, {"id": "1708.01208", "submitter": "Long Chen", "authors": "Long Chen, Karl Francis, Wen Tang", "title": "Semantic Augmented Reality Environment with Material-Aware Physical\n  Interactions", "comments": "ISMAR 2017 Poster", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Augmented Reality (AR) environment, realistic interactions between the\nvirtual and real objects play a crucial role in user experience. Much of recent\nadvances in AR has been largely focused on developing geometry-aware\nenvironment, but little has been done in dealing with interactions at the\nsemantic level. High-level scene understanding and semantic descriptions in AR\nwould allow effective design of complex applications and enhanced user\nexperience. In this paper, we present a novel approach and a prototype system\nthat enables the deeper understanding of semantic properties of the real world\nenvironment, so that realistic physical interactions between the real and the\nvirtual objects can be generated. A material-aware AR environment has been\ncreated based on the deep material learning using a fully convolutional network\n(FCN). The state-of-the-art dense Simultaneous Localisation and Mapping (SLAM)\nhas been used for the semantic mapping. Together with efficient accelerated 3D\nray casting, natural and realistic physical interactions are generated for\ninteractive AR games. Our approach has significant impact on the future\ndevelopment of advanced AR systems and applications.\n", "versions": [{"version": "v1", "created": "Thu, 3 Aug 2017 16:52:14 GMT"}, {"version": "v2", "created": "Thu, 17 Aug 2017 15:31:08 GMT"}, {"version": "v3", "created": "Fri, 16 Mar 2018 14:29:07 GMT"}], "update_date": "2018-03-19", "authors_parsed": [["Chen", "Long", ""], ["Francis", "Karl", ""], ["Tang", "Wen", ""]]}, {"id": "1708.01348", "submitter": "Bowei Chen", "authors": "Bowei Chen, Jingmin Huang, Yufei Huang, Stefanos Kollias and Shigang\n  Yue", "title": "Combining guaranteed and spot markets in display advertising: Selling\n  guaranteed page views with stochastic demand", "comments": null, "journal-ref": "European Journal of Operational Research, 280(3):1144-1159, 2020", "doi": "10.1016/j.ejor.2019.07.067", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While page views are often sold instantly through real-time auctions when\nusers visit websites, they can also be sold in advance via guaranteed\ncontracts. In this paper, we present a dynamic programming model to study how\nan online publisher should optimally allocate and price page views between\nguaranteed and spot markets. The problem is challenging because the allocation\nand pricing of guaranteed contracts affect how advertisers split their\npurchases between the two markets, and the terminal value of the model is\nendogenously determined by the updated dual force of supply and demand in\nauctions. We take the advertisers' purchasing behaviour into consideration,\ni.e., risk aversion and stochastic demand arrivals, and present a scalable and\nefficient algorithm for the optimal solution. The model is also empirically\nvalidated with a commercial dataset. The experimental results show that selling\npage views via both channels can increase the publisher's expected total\nrevenue, and the optimal pricing and allocation strategies are robust to\ndifferent market and advertiser types.\n", "versions": [{"version": "v1", "created": "Fri, 4 Aug 2017 01:32:42 GMT"}, {"version": "v2", "created": "Fri, 3 Nov 2017 00:01:46 GMT"}, {"version": "v3", "created": "Mon, 31 Dec 2018 16:20:41 GMT"}, {"version": "v4", "created": "Mon, 29 Apr 2019 20:20:54 GMT"}, {"version": "v5", "created": "Wed, 11 Dec 2019 14:53:29 GMT"}], "update_date": "2019-12-12", "authors_parsed": [["Chen", "Bowei", ""], ["Huang", "Jingmin", ""], ["Huang", "Yufei", ""], ["Kollias", "Stefanos", ""], ["Yue", "Shigang", ""]]}, {"id": "1708.01477", "submitter": "Rasmus Kr{\\ae}mmer Rendsvig", "authors": "Rasmus K. Rendsvig", "title": "Diffusion, Influence and Best-Response Dynamics in Networks: An Action\n  Model Approach", "comments": "As appeared in R. de Haan (ed.), Proceedings of the ESSLLI 2014\n  Student Session, p. 63-75, T\\\"ubingen, Germany, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Threshold models and their dynamics may be used to model the spread of\n`behaviors' in social networks. Regarding such from a modal logical\nperspective, it is shown how standard update mechanisms may be emulated using\naction models -- graphs encoding agents' decision rules. A small class of\naction models capturing the possible sets of decision rules suitable for\nthreshold models is identified, and shown to include models characterizing\nbest-response dynamics of both coordination and anti-coordination games played\non graphs.\n", "versions": [{"version": "v1", "created": "Fri, 4 Aug 2017 12:51:51 GMT"}], "update_date": "2017-08-07", "authors_parsed": [["Rendsvig", "Rasmus K.", ""]]}, {"id": "1708.01628", "submitter": "Muaz Niazi", "authors": "Faisal Riaz, Muaz A. Niazi", "title": "Validation of Enhanced Emotion Enabled Cognitive Agent Using Virtual\n  Overlay Multi-Agent System Approach", "comments": "35 pages, 21 figures, 19 tables", "journal-ref": "Broad Research in Artificial Intelligence and Neuroscience 8.3\n  (2017): 13-37", "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.GT cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Making roads safer by avoiding road collisions is one of the main reasons for\ninventing Autonomous vehicles (AVs). In this context, designing agent-based\ncollision avoidance components of AVs which truly represent human cognition and\nemotions look is a more feasible approach as agents can replace human drivers.\nHowever, to the best of our knowledge, very few human emotion and\ncognition-inspired agent-based studies have previously been conducted in this\ndomain. Furthermore, these agent-based solutions have not been validated using\nany key validation technique. Keeping in view this lack of validation\npractices, we have selected state-of-the-art Emotion Enabled Cognitive Agent\n(EEC_Agent), which was proposed to avoid lateral collisions between semi-AVs.\nThe architecture of EEC_Agent has been revised using Exploratory Agent Based\nModeling (EABM) level of the Cognitive Agent Based Computing (CABC) framework\nand real-time fear emotion generation mechanism using the Ortony, Clore &\nCollins (OCC) model has also been introduced. Then the proposed fear generation\nmechanism has been validated using the Validated Agent Based Modeling level of\nCABC framework using a Virtual Overlay MultiAgent System (VOMAS). Extensive\nsimulation and practical experiments demonstrate that the Enhanced EEC_Agent\nexhibits the capability to feel different levels of fear, according to\ndifferent traffic situations and also needs a smaller Stopping Sight Distance\n(SSD) and Overtaking Sight Distance (OSD) as compared to human drivers.\n", "versions": [{"version": "v1", "created": "Fri, 4 Aug 2017 18:11:24 GMT"}], "update_date": "2017-11-07", "authors_parsed": [["Riaz", "Faisal", ""], ["Niazi", "Muaz A.", ""]]}, {"id": "1708.01636", "submitter": "Muaz Niazi", "authors": "Aisha D. Farooqui, Muaz A. Niazi", "title": "Game theory models for communication between agents: a review", "comments": "31 pages, 7 figures", "journal-ref": "Complex Adaptive Systems Modeling, 4(1), 13. (2016)", "doi": "10.1186/s40294-016-0026-7", "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the real world, agents or entities are in a continuous state of\ninteractions. These inter- actions lead to various types of complexity\ndynamics. One key difficulty in the study of complex agent interactions is the\ndifficulty of modeling agent communication on the basis of rewards. Game theory\noffers a perspective of analysis and modeling these interactions. Previously,\nwhile a large amount of literature is available on game theory, most of it is\nfrom specific domains and does not cater for the concepts from an agent- based\nperspective. Here in this paper, we present a comprehensive multidisciplinary\nstate-of-the-art review and taxonomy of game theory models of complex\ninteractions between agents.\n", "versions": [{"version": "v1", "created": "Fri, 4 Aug 2017 18:37:27 GMT"}], "update_date": "2017-08-08", "authors_parsed": [["Farooqui", "Aisha D.", ""], ["Niazi", "Muaz A.", ""]]}, {"id": "1708.01910", "submitter": "Hamidou Tembine", "authors": "Brian Powers and Michalis Smyrnakis and Hamidou Tembine", "title": "Empathy in Bimatrix Games", "comments": "24 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although the definition of what empathetic preferences exactly are is still\nevolving, there is a general consensus in the psychology, science and\nengineering communities that the evolution toward players' behaviors in\ninteractive decision-making problems will be accompanied by the exploitation of\ntheir empathy, sympathy, compassion, antipathy, spitefulness, selfishness,\naltruism, and self-abnegating states in the payoffs. In this article, we study\none-shot bimatrix games from a psychological game theory viewpoint. A new\nempathetic payoff model is calculated to fit empirical observations and both\npure and mixed equilibria are investigated. For a realized empathy structure,\nthe bimatrix game is categorized among four generic class of games. Number of\ninteresting results are derived. A notable level of involvement can be observed\nin the empathetic one-shot game compared the non-empathetic one and this holds\neven for games with dominated strategies. Partial altruism can help in breaking\nsymmetry, in reducing payoff-inequality and in selecting social welfare and\nmore efficient outcomes. By contrast, partial spite and self-abnegating may\nworsen payoff equity. Empathetic evolutionary game dynamics are introduced to\ncapture the resulting empathetic evolutionarily stable strategies under wide\nrange of revision protocols including Brown-von Neumann-Nash, Smith, imitation,\nreplicator, and hybrid dynamics. Finally, mutual support and Berge solution are\ninvestigated and their connection with empathetic preferences are established.\nWe show that pure altruism is logically inconsistent, only by balancing it with\nsome partial selfishness does it create a consistent psychology.\n", "versions": [{"version": "v1", "created": "Sun, 6 Aug 2017 17:01:41 GMT"}], "update_date": "2017-08-08", "authors_parsed": [["Powers", "Brian", ""], ["Smyrnakis", "Michalis", ""], ["Tembine", "Hamidou", ""]]}, {"id": "1708.01927", "submitter": "Muaz Niazi", "authors": "Faisal Riaz, Muaz A. Niazi", "title": "Emotion Controlled Spectrum Mobility Scheme for Efficient Syntactic\n  Interoperability In Cognitive Radio Based Internet of Vehicles", "comments": "33 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.AI cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blind spots are one of the causes of road accidents in the hilly and flat\nareas. These blind spot accidents can be decreased by establishing an Internet\nof Vehicles (IoV) using Vehicle-2-Vehicle (V2V) and Vehicle-2-Infrastrtructure\n(V2I) communication systems. But the problem with these IoV is that most of\nthem are using DSRC or single Radio Access Technology (RAT) as a wireless\ntechnology, which has been proven to be failed for efficient communication\nbetween vehicles. Recently, Cognitive Radio (CR) based IoV have to be proven\nbest wireless communication systems for vehicular networks. However, the\nspectrum mobility is a challenging task to keep CR based vehicular networks\ninteroperable and has not been addressed sufficiently in existing research. In\nour previous research work, the Cognitive Radio Site (CR-Site) has been\nproposed as in-vehicle CR-device, which can be utilized to establish efficient\nIoV systems. H In this paper, we have introduced the Emotions Inspired\nCognitive Agent (EIC_Agent) based spectrum mobility mechanism in CR-Site and\nproposed a novel emotions controlled spectrum mobility scheme for efficient\nsyntactic interoperability between vehicles. For this purpose, a probabilistic\ndeterministic finite automaton using fear factor is proposed to perform\nefficient spectrum mobility using fuzzy logic. In addition, the quantitative\ncomputation of different fear intensity levels has been performed with the help\nof fuzzy logic. The system has been tested using active data from different GSM\nservice providers on Mangla-Mirpur road. This is supplemented by extensive\nsimulation experiments which validate the proposed scheme for CR based\nhigh-speed vehicular networks. The qualitative comparison with the\nexisting-state-of the-art has proven the superiority of the proposed emotions\ncontrolled syntactic interoperable spectrum mobility scheme within cognitive\nradio based IoV systems.\n", "versions": [{"version": "v1", "created": "Sun, 6 Aug 2017 19:40:50 GMT"}], "update_date": "2017-08-08", "authors_parsed": [["Riaz", "Faisal", ""], ["Niazi", "Muaz A.", ""]]}, {"id": "1708.02543", "submitter": "Amit Jacob Fanani", "authors": "Amit Jacob Fanani, Itay Harel", "title": "Impossibility of $n-1$-strong-equllibrium for Distributed Consensus with\n  Rational Agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An algorithm for $n-1$-strong-equillibrium for distributed consensus in a\nring with rational agents was proposed by Afek et al. (2014). A proof of\nimpossibility of $n-1$-strong-equillibrium for distributed consensus in every\ntopology with rational agents, when $n$ is even, is presented. Furthermore, we\nshow that the algorithm proposed by Afek et al. is the only algorithm which can\nsolve the problem when $n$ is odd. Finally, we prove that the proposed\nalgorithm provides a $n-2$-strong-equillibrium in a synchronous ring when $n$\nis even.\n", "versions": [{"version": "v1", "created": "Tue, 8 Aug 2017 16:15:05 GMT"}], "update_date": "2017-08-17", "authors_parsed": [["Fanani", "Amit Jacob", ""], ["Harel", "Itay", ""]]}, {"id": "1708.02737", "submitter": "Marco Scarsini", "authors": "Riccardo Colini-Baldeschi, Max Klimm, and Marco Scarsini", "title": "Demand-Independent Optimal Tolls", "comments": "18 pages, 5 figures", "journal-ref": null, "doi": "10.4230/LIPIcs.ICALP.2018.151", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wardrop equilibria in nonatomic congestion games are in general inefficient\nas they do not induce an optimal flow that minimizes the total travel time.\nNetwork tolls are a prominent and popular way to induce an optimum flow in\nequilibrium. The classical approach to find such tolls is marginal cost pricing\nwhich requires the exact knowledge of the demand on the network. In this paper,\nwe investigate under which conditions demand-independent optimum tolls exist\nthat induce the system optimum flow for any travel demand in the network. We\ngive several characterizations for the existence of such tolls both in terms of\nthe cost structure and the network structure of the game. Specifically we show\nthat demand-independent optimum tolls exist if and only if the edge cost\nfunctions are shifted monomials as used by the Bureau of Public Roads.\nMoreover, non-negative demand-independent optimum tolls exist when the network\nis a directed acyclic multi-graph. Finally, we show that any network with a\nsingle origin-destination pair admits demand-independent optimum tolls that,\nalthough not necessarily non-negative, satisfy a budget constraint.\n", "versions": [{"version": "v1", "created": "Wed, 9 Aug 2017 07:10:42 GMT"}, {"version": "v2", "created": "Sat, 17 Feb 2018 09:46:41 GMT"}], "update_date": "2019-01-03", "authors_parsed": [["Colini-Baldeschi", "Riccardo", ""], ["Klimm", "Max", ""], ["Scarsini", "Marco", ""]]}, {"id": "1708.03097", "submitter": "Enrique Areyan Viqueira", "authors": "Enrique Areyan Viqueira, Amy Greenwald, Victor Naroditskiy", "title": "On Approximate Welfare- and Revenue-Maximizing Equilibria for\n  Size-Interchangeable Bidders", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a Walrasian equilibrium (WE), all bidders are envy-free (EF), meaning that\ntheir allocation maximizes their utility; and the market clears (MC), meaning\nthat the price of unallocated goods is zero. EF is desirable to ensure the\nlong-term viability of the market. MC ensures that demand meets supply. Any\nallocation that is part of a WE is also welfare-maximizing; however, it need\nnot be revenue-maximizing. Furthermore, WE need not exist, e.g., in markets\nwhere bidders have combinatorial valuations. The traditional approach to\nsimultaneously addressing both existence and low revenue is to relax the MC\ncondition and instead require the price of unallocated goods be some, positive\nreserve price. The resulting solution concept, known as Envy-Free Pricing\n(EFP), has been studied in some special cases, e.g., single-minded bidders. In\nthis paper, we go one step further; we relax EF as well as MC. We propose a\nrelaxation of the EF condition where only winners are envy-free, and further\nrelax the MC condition so that unallocated goods are priced at least at the\nreserve. We call this new solution concept Restricted Envy-Free Pricing (REFP).\nWe investigate what REFP entails for single-minded bidders, and show that for\nsize-interchangeable bidders (a generalization of single-minded introduced in\nthis paper) we can compute a REFP in polynomial time, given a fixed allocation.\nAs in the study of EFP, we remain interested in maximizing seller revenue.\nInstead of computing an outcome that simultaneously yields an allocation and\ncorresponding prices, one could first solve for an allocation that respects a\nreserve price, and then solve for a corresponding set of supporting prices,\neach one at least the reserve. This two-step process fails in the case of EFP\nsince, given a fixed allocation, envy-free prices need not exist. However,\nrestricted envy-free prices always exist...\n", "versions": [{"version": "v1", "created": "Thu, 10 Aug 2017 06:53:48 GMT"}], "update_date": "2017-08-11", "authors_parsed": [["Viqueira", "Enrique Areyan", ""], ["Greenwald", "Amy", ""], ["Naroditskiy", "Victor", ""]]}, {"id": "1708.03200", "submitter": "Lin Gao", "authors": "Lin Gao, Jianwei Huang", "title": "Achieving an Efficient and Fair Equilibrium Through Taxation", "comments": "This manuscript serves as the technical report for the paper with the\n  same title published in APCC 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that a game equilibrium can be far from efficient or fair,\ndue to the misalignment between individual and social objectives. The focus of\nthis paper is to design a new mechanism framework that induces an efficient and\nfair equilibrium in a general class of games. To achieve this goal, we propose\na taxation framework, which first imposes a tax on each player based on the\nperceived payoff (income), and then redistributes the collected tax to other\nplayers properly. By turning the tax rate, this framework spans the continuum\nspace between strategic interactions (of selfish players) and altruistic\ninteractions (of unselfish players), hence provides rich modeling\npossibilities. The key challenge in the design of this framework is the proper\ntaxing rule (i.e., the tax exemption and tax rate) that induces the desired\nequilibrium in a wide range of games. First, we propose a flat tax rate (i.e.,\na single tax rate for all players), which is necessary and sufficient for\nachieving an efficient equilibrium in any static strategic game with common\nknowledge. Then, we provide several tax exemption rules that achieve some\ntypical fairness criterions (such as the Max-min fairness) at the equilibrium.\nWe further illustrate the implementation of the framework in the game of\nPrisoners' Dilemma.\n", "versions": [{"version": "v1", "created": "Thu, 10 Aug 2017 13:13:24 GMT"}], "update_date": "2017-08-11", "authors_parsed": [["Gao", "Lin", ""], ["Huang", "Jianwei", ""]]}, {"id": "1708.03259", "submitter": "Yiru Zhang", "authors": "Yiru Zhang (1), Tassadit Bouadi (1), Arnaud Martin (1) ((1) DRUID,\n  UR1)", "title": "Preference fusion and Condorcet's Paradox under uncertainty", "comments": "International Conference on Information Fusion, Jul 2017, Xi'an,\n  China", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Facing an unknown situation, a person may not be able to firmly elicit\nhis/her preferences over different alternatives, so he/she tends to express\nuncertain preferences. Given a community of different persons expressing their\npreferences over certain alternatives under uncertainty, to get a collective\nrepresentative opinion of the whole community, a preference fusion process is\nrequired. The aim of this work is to propose a preference fusion method that\ncopes with uncertainty and escape from the Condorcet paradox. To model\npreferences under uncertainty, we propose to develop a model of preferences\nbased on belief function theory that accurately describes and captures the\nuncertainty associated with individual or collective preferences. This work\nimproves and extends the previous results. This work improves and extends the\ncontribution presented in a previous work. The benefits of our contribution are\ntwofold. On the one hand, we propose a qualitative and expressive preference\nmodeling strategy based on belief-function theory which scales better with the\nnumber of sources. On the other hand, we propose an incremental distance-based\nalgorithm (using Jousselme distance) for the construction of the collective\npreference order to avoid the Condorcet Paradox.\n", "versions": [{"version": "v1", "created": "Wed, 9 Aug 2017 12:25:36 GMT"}], "update_date": "2017-08-11", "authors_parsed": [["Zhang", "Yiru", ""], ["Bouadi", "Tassadit", ""], ["Martin", "Arnaud", ""]]}, {"id": "1708.03871", "submitter": "Tom Everitt", "authors": "Tobias W\\\"angberg, Mikael B\\\"o\\\"ors, Elliot Catt, Tom Everitt, Marcus\n  Hutter", "title": "A Game-Theoretic Analysis of the Off-Switch Game", "comments": null, "journal-ref": "Artificial General Intelligence: 10th International Conference,\n  AGI 2017, Melbourne, VIC, Australia, August 15-18, 2017, Proceedings, pages\n  167-177", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The off-switch game is a game theoretic model of a highly intelligent robot\ninteracting with a human. In the original paper by Hadfield-Menell et al.\n(2016), the analysis is not fully game-theoretic as the human is modelled as an\nirrational player, and the robot's best action is only calculated under\nunrealistic normality and soft-max assumptions. In this paper, we make the\nanalysis fully game theoretic, by modelling the human as a rational player with\na random utility function. As a consequence, we are able to easily calculate\nthe robot's best action for arbitrary belief and irrationality assumptions.\n", "versions": [{"version": "v1", "created": "Sun, 13 Aug 2017 07:54:00 GMT"}], "update_date": "2017-08-15", "authors_parsed": [["Wängberg", "Tobias", ""], ["Böörs", "Mikael", ""], ["Catt", "Elliot", ""], ["Everitt", "Tom", ""], ["Hutter", "Marcus", ""]]}, {"id": "1708.04081", "submitter": "Barnab\\'e Monnot", "authors": "Barnab\\'e Monnot, Francisco Benita, Georgios Piliouras", "title": "Routing Games in the Wild: Efficiency, Equilibration and Regret\n  (Large-Scale Field Experiments in Singapore)", "comments": "22 pages, 9 figures, this article supersedes arXiv:1703.01599v2", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Routing games are amongst the most well studied domains of game theory. How\nrelevant are these pen-and-paper calculations to understanding the reality of\neveryday traffic routing? We focus on a semantically rich dataset that captures\ndetailed information about the daily behavior of thousands of Singaporean\ncommuters and examine the following basic questions: (i) Does the traffic\nequilibrate? (ii) Is the system behavior consistent with latency minimizing\nagents? (iii) Is the resulting system efficient? In order to capture the\nefficiency of the traffic network in a way that agrees with our everyday\nintuition we introduce a new metric, the stress of catastrophe, which reflects\nthe combined inefficiencies of both tragedy of the commons as well as price of\nanarchy effects.\n", "versions": [{"version": "v1", "created": "Mon, 14 Aug 2017 11:35:50 GMT"}], "update_date": "2017-08-15", "authors_parsed": [["Monnot", "Barnabé", ""], ["Benita", "Francisco", ""], ["Piliouras", "Georgios", ""]]}, {"id": "1708.04109", "submitter": "Kitty Meeks", "authors": "Kitty Meeks and Baharak Rastegari", "title": "Solving Hard Stable Matching Problems Involving Groups of Similar Agents", "comments": "Results on SMTI appear in proceedings of WINE 2018; Section 6\n  contains work in progress", "journal-ref": null, "doi": "10.1007/978-3-030-04612-5_21", "report-no": null, "categories": "cs.GT cs.CC cs.DS cs.MA math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many important stable matching problems are known to be NP-hard, even when\nstrong restrictions are placed on the input. In this paper we seek to identify\nstructural properties of instances of stable matching problems which will allow\nus to design efficient algorithms using elementary techniques. We focus on the\nsetting in which all agents involved in some matching problem can be\npartitioned into k different types, where the type of an agent determines his\nor her preferences, and agents have preferences over types (which may be\nrefined by more detailed preferences within a single type). This situation\nwould arise in practice if agents form preferences solely based on some small\ncollection of agents' attributes. We also consider a generalisation in which\neach agent may consider some small collection of other agents to be\nexceptional, and rank these in a way that is not consistent with their types;\nthis could happen in practice if agents have prior contact with a small number\nof candidates. We show that (for the case without exceptions), several\nwell-studied NP-hard stable matching problems including Max SMTI (that of\nfinding the maximum cardinality stable matching in an instance of stable\nmarriage with ties and incomplete lists) belong to the parameterised complexity\nclass FPT when parameterised by the number of different types of agents needed\nto describe the instance. For Max SMTI this tractability result can be extended\nto the setting in which each agent promotes at most one `exceptional' candidate\nto the top of his/her list (when preferences within types are not refined), but\nthe problem remains NP-hard if preference lists can contain two or more\nexceptions and the exceptional candidates can be placed anywhere in the\npreference lists, even if the number of types is bounded by a constant.\n", "versions": [{"version": "v1", "created": "Mon, 14 Aug 2017 13:15:19 GMT"}, {"version": "v2", "created": "Thu, 13 Dec 2018 14:56:55 GMT"}], "update_date": "2018-12-14", "authors_parsed": [["Meeks", "Kitty", ""], ["Rastegari", "Baharak", ""]]}, {"id": "1708.04699", "submitter": "Jason Hartline", "authors": "Shuchi Chawla, Jason D. Hartline, Denis Nekipelov", "title": "Mechanism Redesign", "comments": "This paper combines and improves upon results from manuscripts\n  \"Mechanism Design for Data Science\" (arXiv:1404.5971) and \"A/B Testing of\n  Auctions\" (arXiv:1606.00908)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops the theory of mechanism redesign by which an auctioneer\ncan reoptimize an auction based on bid data collected from previous iterations\nof the auction on bidders from the same market. We give a direct method for\nestimation of the revenue of a counterfactual auction from the bids in the\ncurrent auction. The estimator is a simple weighted order statistic of the bids\nand has the optimal error rate. Two applications of our estimator are A/B\ntesting (a.k.a., randomized controlled trials) and instrumented optimization\n(i.e., revenue optimization subject to being able to do accurate inference of\nany counterfactual auction revenue).\n", "versions": [{"version": "v1", "created": "Tue, 15 Aug 2017 21:51:47 GMT"}], "update_date": "2017-08-17", "authors_parsed": [["Chawla", "Shuchi", ""], ["Hartline", "Jason D.", ""], ["Nekipelov", "Denis", ""]]}, {"id": "1708.04881", "submitter": "Hiroshi Hirai", "authors": "Hiroshi Hirai and Ryosuke Sato", "title": "Polyhedral Clinching Auctions for Two-sided Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a new model and two mechanisms for auctions in\ntwo-sided markets of buyers and sellers, where budget constraints are imposed\non buyers. Our model incorporates polymatroidal environments, and is applicable\nto a wide variety of models that include multiunit auctions, matching markets\nand reservation exchange markets. Our mechanisms are build on polymatroidal\nnetwork flow model by Lawler and Martel, and enjoy various nice properties such\nas incentive compatibility of buyers, individual rationality, pareto\noptimality, strong budget balance. The first mechanism is a simple\n\"reduce-to-recover\" algorithm that reduces the market to be one-sided, applies\nthe polyhedral clinching auction by Goel et al, and lifts the resulting\nallocation to the original two-sided market via polymatroidal network flow. The\nsecond mechanism is a two-sided generalization of the polyhedral clinching\nauction, which improves the first mechanism in terms of the fairness of revenue\nsharing on sellers. Both mechanisms are implemented by polymatroid algorithms.\nWe demonstrate how our framework is applied to internet display ad auctions.\n", "versions": [{"version": "v1", "created": "Tue, 15 Aug 2017 00:26:36 GMT"}, {"version": "v2", "created": "Fri, 14 Sep 2018 02:26:02 GMT"}], "update_date": "2018-09-17", "authors_parsed": [["Hirai", "Hiroshi", ""], ["Sato", "Ryosuke", ""]]}, {"id": "1708.04956", "submitter": "Venkata Sriram Siddhardh (Sid) Nadendla", "authors": "Venkata Sriram Siddhardh Nadendla, Emrah Akyol, Cedric Langbort, Tamer\n  Ba\\c{s}ar", "title": "Strategic Communication Between Prospect Theoretic Agents over a\n  Gaussian Test Channel", "comments": "6 pages, 3 figures, Accepted to MILCOM-2017, Corrections made in the\n  new version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IT cs.MA cs.SI cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we model a Stackelberg game in a simple Gaussian test channel\nwhere a human transmitter (leader) communicates a source message to a human\nreceiver (follower). We model human decision making using prospect theory\nmodels proposed for continuous decision spaces. Assuming that the value\nfunction is the squared distortion at both the transmitter and the receiver, we\nanalyze the effects of the weight functions at both the transmitter and the\nreceiver on optimal communication strategies, namely encoding at the\ntransmitter and decoding at the receiver, in the Stackelberg sense. We show\nthat the optimal strategies for the behavioral agents in the Stackelberg sense\nare identical to those designed for unbiased agents. At the same time, we also\nshow that the prospect-theoretic distortions at both the transmitter and the\nreceiver are both larger than the expected distortion, thus making behavioral\nagents less contended than unbiased agents. Consequently, the presence of\ncognitive biases increases the need for transmission power in order to achieve\na given distortion at both transmitter and receiver.\n", "versions": [{"version": "v1", "created": "Mon, 14 Aug 2017 21:57:10 GMT"}, {"version": "v2", "created": "Fri, 29 Sep 2017 02:56:37 GMT"}], "update_date": "2017-10-02", "authors_parsed": [["Nadendla", "Venkata Sriram Siddhardh", ""], ["Akyol", "Emrah", ""], ["Langbort", "Cedric", ""], ["Başar", "Tamer", ""]]}, {"id": "1708.05565", "submitter": "Yu Wang", "authors": "Yu Wang, Jiayi Liu, Yuxiang Liu, Jun Hao, Yang He, Jinghe Hu, Weipeng\n  P. Yan, Mantian Li", "title": "LADDER: A Human-Level Bidding Agent for Large-Scale Real-Time Online\n  Auctions", "comments": "8 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.CL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present LADDER, the first deep reinforcement learning agent that can\nsuccessfully learn control policies for large-scale real-world problems\ndirectly from raw inputs composed of high-level semantic information. The agent\nis based on an asynchronous stochastic variant of DQN (Deep Q Network) named\nDASQN. The inputs of the agent are plain-text descriptions of states of a game\nof incomplete information, i.e. real-time large scale online auctions, and the\nrewards are auction profits of very large scale. We apply the agent to an\nessential portion of JD's online RTB (real-time bidding) advertising business\nand find that it easily beats the former state-of-the-art bidding policy that\nhad been carefully engineered and calibrated by human experts: during JD.com's\nJune 18th anniversary sale, the agent increased the company's ads revenue from\nthe portion by more than 50%, while the advertisers' ROI (return on investment)\nalso improved significantly.\n", "versions": [{"version": "v1", "created": "Fri, 18 Aug 2017 11:25:30 GMT"}, {"version": "v2", "created": "Fri, 1 Sep 2017 14:05:09 GMT"}], "update_date": "2017-09-04", "authors_parsed": [["Wang", "Yu", ""], ["Liu", "Jiayi", ""], ["Liu", "Yuxiang", ""], ["Hao", "Jun", ""], ["He", "Yang", ""], ["Hu", "Jinghe", ""], ["Yan", "Weipeng P.", ""], ["Li", "Mantian", ""]]}, {"id": "1708.05741", "submitter": "Nof Abu-Zainab", "authors": "Nof Abuzainab and Walid Saad", "title": "Dynamic Connectivity Game for Adversarial Internet of Battlefield Things\n  Systems", "comments": "accepted in IEEE Internet of Things Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the problem of network connectivity is studied for an\nadversarial Internet of Battlefield Things (IoBT) system in which an attacker\naims at disrupting the connectivity of the network by choosing to compromise\none of the IoBT nodes at each time epoch. To counter such attacks, an IoBT\ndefender attempts to reestablish the IoBT connectivity by either deploying new\nIoBT nodes or by changing the roles of existing nodes. This problem is\nformulated as a dynamic multistage Stackelberg connectivity game that extends\nclassical connectivity games and that explicitly takes into account the\ncharacteristics and requirements of the IoBT network. In particular, the\ndefender's payoff captures the IoBT latency as well as the sum of weights of\ndisconnected nodes at each stage of the game. Due to the dependence of the\nattacker's and defender's actions at each stage of the game on the network\nstate, the feedback Stackelberg solution (FSE) is used to solve the IoBT\nconnectivity game. Then, sufficient conditions under which the IoBT system will\nremain connected, when the FSE solution is used, are determined analytically.\nNumerical results show that the expected number of disconnected sensors, when\nthe FSE solution is used, decreases up to 62% compared to a baseline scenario\nin which a Stackelberg game with no feedback is used, and up to 57% compared to\na baseline equal probability policy.\n", "versions": [{"version": "v1", "created": "Fri, 18 Aug 2017 19:28:24 GMT"}, {"version": "v2", "created": "Fri, 22 Dec 2017 00:35:33 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Abuzainab", "Nof", ""], ["Saad", "Walid", ""]]}, {"id": "1708.05908", "submitter": "Stojan Trajanovski", "authors": "Stojan Trajanovski, Fernando A. Kuipers, Yezekael Hayel, Eitan Altman\n  and Piet Van Mieghem", "title": "Designing virus-resistant, high-performance networks: a game-formation\n  approach", "comments": "accepted for publication in IEEE Transactions on Control of Network\n  Systems", "journal-ref": null, "doi": "10.1109/TCNS.2017.2747840", "report-no": null, "categories": "cs.GT cs.NI cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing an optimal network topology while balancing multiple, possibly\nconflicting objectives like cost, performance, and resiliency to viruses is a\nchallenging endeavor, let alone in the case of decentralized network formation.\nWe therefore propose a game-formation technique where each player aims to\nminimize its cost in installing links, the probability of being infected by a\nvirus and the sum of hopcounts on its shortest paths to all other nodes.\n  In this article, we (1) determine the Nash Equilibria and the Price of\nAnarchy for our novel network formation game, (2) demonstrate that the Price of\nAnarchy (PoA) is usually low, which suggests that (near-)optimal topologies can\nbe formed in a decentralized way, and (3) give suggestions for practitioners\nfor those cases where the PoA is high and some centralized control/incentives\nare advisable.\n", "versions": [{"version": "v1", "created": "Sat, 19 Aug 2017 22:48:39 GMT"}, {"version": "v2", "created": "Thu, 24 Aug 2017 23:12:48 GMT"}, {"version": "v3", "created": "Sun, 1 Oct 2017 16:26:07 GMT"}], "update_date": "2017-10-03", "authors_parsed": [["Trajanovski", "Stojan", ""], ["Kuipers", "Fernando A.", ""], ["Hayel", "Yezekael", ""], ["Altman", "Eitan", ""], ["Van Mieghem", "Piet", ""]]}, {"id": "1708.06499", "submitter": "Thang Nguyen Kim", "authors": "Nguyen Kim Thang", "title": "Game Efficiency through Linear Programming Duality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The efficiency of a game is typically quantified by the price of anarchy\n(PoA), defined as the worst ratio of the objective function value of an\nequilibrium --- solution of the game --- and that of an optimal outcome. Given\nthe tremendous impact of tools from mathematical programming in the design of\nalgorithms and the similarity of the price of anarchy and different measures\nsuch as the approximation and competitive ratios, it is intriguing to develop a\nduality-based method to characterize the efficiency of games.\n  In the paper, we present an approach based on linear programming duality to\nstudy the efficiency of games. We show that the approach provides a general\nrecipe to analyze the efficiency of games and also to derive concepts leading\nto improvements. The approach is particularly appropriate to bound the PoA.\nSpecifically, in our approach the dual programs naturally lead to competitive\nPoA bounds that are (almost) optimal for several classes of games. The approach\nindeed captures the smoothness framework and also some current non-smooth\ntechniques/concepts. We show the applicability to the wide variety of games and\nenvironments, from congestion games to Bayesian welfare, from full-information\nsettings to incomplete-information ones.\n", "versions": [{"version": "v1", "created": "Tue, 22 Aug 2017 05:24:21 GMT"}], "update_date": "2017-08-23", "authors_parsed": [["Thang", "Nguyen Kim", ""]]}, {"id": "1708.07580", "submitter": "Haris Aziz", "authors": "Haris Aziz and Barton Lee", "title": "The Expanding Approvals Rule: Improving Proportional Representation and\n  Monotonicity", "comments": "Change in title plus several edits over the previous version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proportional representation (PR) is often discussed in voting settings as a\nmajor desideratum. For the past century or so, it is common both in practice\nand in the academic literature to jump to single transferable vote (STV) as the\nsolution for achieving PR. Some of the most prominent electoral reform\nmovements around the globe are pushing for the adoption of STV. It has been\ntermed a major open problem to design a voting rule that satisfies the same PR\nproperties as STV and better monotonicity properties. In this paper, we first\npresent a taxonomy of proportional representation axioms for general weak order\npreferences, some of which generalise and strengthen previously introduced\nconcepts. We then present a rule called Expanding Approvals Rule (EAR) that\nsatisfies properties stronger than the central PR axiom satisfied by STV, can\nhandle indifferences in a convenient and computationally efficient manner, and\nalso satisfies better candidate monotonicity properties. In view of this, our\nproposed rule seems to be a compelling solution for achieving proportional\nrepresentation in voting settings.\n", "versions": [{"version": "v1", "created": "Fri, 25 Aug 2017 00:10:43 GMT"}, {"version": "v2", "created": "Mon, 4 Jun 2018 13:16:25 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Aziz", "Haris", ""], ["Lee", "Barton", ""]]}, {"id": "1708.07715", "submitter": "Dennis Kraft", "authors": "Susanne Albers, Dennis Kraft", "title": "The Price of Uncertainty in Present-Biased Planning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tendency to overestimate immediate utility is a common cognitive bias. As\na result people behave inconsistently over time and fail to reach long-term\ngoals. Behavioral economics tries to help affected individuals by implementing\nexternal incentives. However, designing robust incentives is often difficult\ndue to imperfect knowledge of the parameter $\\beta \\in (0,1]$ quantifying a\nperson's present bias. Using the graphical model of Kleinberg and Oren, we\napproach this problem from an algorithmic perspective. Based on the assumption\nthat the only information about $\\beta$ is its membership in some set $B\n\\subset (0,1]$, we distinguish between two models of uncertainty: one in which\n$\\beta$ is fixed and one in which it varies over time. As our main result we\nshow that the conceptual loss of efficiency incurred by incentives in the form\nof penalty fees is at most $2$ in the former and $1 + \\max B/\\min B$ in the\nlatter model. We also give asymptotically matching lower bounds and\napproximation algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 25 Aug 2017 12:51:55 GMT"}], "update_date": "2017-08-28", "authors_parsed": [["Albers", "Susanne", ""], ["Kraft", "Dennis", ""]]}, {"id": "1708.07916", "submitter": "Simon Rubinstein-Salzedo", "authors": "Simon Rubinstein-Salzedo and Yifan Zhu", "title": "The Asymmetric Colonel Blotto Game", "comments": "Comments welcome!", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper explores the Nash equilibria of a variant of the Colonel Blotto\ngame, which we call the Asymmetric Colonel Blotto game. In the Colonel Blotto\ngame, two players simultaneously distribute forces across $n$ battlefields.\nWithin each battlefield, the player that allocates the higher level of force\nwins. The payoff of the game is the proportion of wins on the individual\nbattlefields. In the asymmetric version, the levels of force distributed to the\nbattlefields must be nondecreasing. In this paper, we find a family of Nash\nequilibria for the case with three battlefields and equal levels of force and\nprove the uniqueness of the marginal distributions. We also find the unique\nequilibrium payoff for all possible levels of force in the case with two\nbattlefields, and obtain partial results for the unique equilibrium payoff for\nasymmetric levels of force in the case with three battlefields.\n", "versions": [{"version": "v1", "created": "Sat, 26 Aug 2017 01:59:48 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Rubinstein-Salzedo", "Simon", ""], ["Zhu", "Yifan", ""]]}, {"id": "1708.08274", "submitter": "Lin Gao", "authors": "Xiaoru Zhang, Lin Gao, Bin Cao, Zhang Li, Mengjing Wang", "title": "A Double Auction Mechanism for Mobile Crowd Sensing with Data Reuse", "comments": "This manuscript serves as the online technical report for the paper\n  published in IEEE GLOBECOM 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Crowd Sensing (MCS) is a new paradigm of sensing, which can achieve a\nflexible and scalable sensing coverage with a low deployment cost, by employing\nmobile users/devices to perform sensing tasks. In this work, we propose a novel\nMCS framework with data reuse, where multiple tasks with common data\nrequirement can share (reuse) the common data with each other through an MCS\nplatform. We study the optimal assignment of mobile users and tasks (with data\nreuse) systematically, under both information symmetry and asymmetry, depending\non whether the user cost and the task valuation are public information. In the\nformer case, we formulate the assignment problem as a generalized Knapsack\nproblem and solve the problem by using classic algorithms. In the latter case,\nwe propose a truthful and optimal double auction mechanism, built upon the\nabove Knapsack assignment problem, to elicit the private information of both\nusers and tasks and meanwhile achieve the same optimal assignment as under\ninformation symmetry. Simulation results show by allowing data reuse among\ntasks, the social welfare can be increased up to 100~380%, comparing with those\nwithout data reuse. We further show that the proposed double auction is not\nbudget balance for the auctioneer, mainly due to the data reuse among tasks. To\nthis end, we further introduce a reserve price into the double auction (for\neach data item) to achieve a desired tradeoff between the budget balance and\nthe social efficiency.\n", "versions": [{"version": "v1", "created": "Mon, 28 Aug 2017 11:34:17 GMT"}], "update_date": "2017-08-29", "authors_parsed": [["Zhang", "Xiaoru", ""], ["Gao", "Lin", ""], ["Cao", "Bin", ""], ["Li", "Zhang", ""], ["Wang", "Mengjing", ""]]}, {"id": "1708.08819", "submitter": "Thomas Unterthiner", "authors": "Thomas Unterthiner, Bernhard Nessler, Calvin Seward, G\\\"unter\n  Klambauer, Martin Heusel, Hubert Ramsauer, Sepp Hochreiter", "title": "Coulomb GANs: Provably Optimal Nash Equilibria via Potential Fields", "comments": "Published as a conference paper at ICLR (International Conference on\n  Learning Representations) 2018. Implementation available at\n  https://github.com/bioinf-jku/coulomb_gan", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generative adversarial networks (GANs) evolved into one of the most\nsuccessful unsupervised techniques for generating realistic images. Even though\nit has recently been shown that GAN training converges, GAN models often end up\nin local Nash equilibria that are associated with mode collapse or otherwise\nfail to model the target distribution. We introduce Coulomb GANs, which pose\nthe GAN learning problem as a potential field of charged particles, where\ngenerated samples are attracted to training set samples but repel each other.\nThe discriminator learns a potential field while the generator decreases the\nenergy by moving its samples along the vector (force) field determined by the\ngradient of the potential field. Through decreasing the energy, the GAN model\nlearns to generate samples according to the whole target distribution and does\nnot only cover some of its modes. We prove that Coulomb GANs possess only one\nNash equilibrium which is optimal in the sense that the model distribution\nequals the target distribution. We show the efficacy of Coulomb GANs on a\nvariety of image datasets. On LSUN and celebA, Coulomb GANs set a new state of\nthe art and produce a previously unseen variety of different samples.\n", "versions": [{"version": "v1", "created": "Tue, 29 Aug 2017 15:22:03 GMT"}, {"version": "v2", "created": "Mon, 30 Oct 2017 09:43:53 GMT"}, {"version": "v3", "created": "Tue, 30 Jan 2018 11:54:35 GMT"}], "update_date": "2018-01-31", "authors_parsed": [["Unterthiner", "Thomas", ""], ["Nessler", "Bernhard", ""], ["Seward", "Calvin", ""], ["Klambauer", "Günter", ""], ["Heusel", "Martin", ""], ["Ramsauer", "Hubert", ""], ["Hochreiter", "Sepp", ""]]}, {"id": "1708.08831", "submitter": "James Wright", "authors": "Daniel G. Goldstein, R. Preston McAfee, Siddharth Suri, James R.\n  Wright", "title": "Learning in the Repeated Secretary Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the classical secretary problem, one attempts to find the maximum of an\nunknown and unlearnable distribution through sequential search. In many\nreal-world searches, however, distributions are not entirely unknown and can be\nlearned through experience. To investigate learning in such a repeated\nsecretary problem we conduct a large-scale behavioral experiment in which\npeople search repeatedly from fixed distributions. In contrast to prior\ninvestigations that find no evidence for learning in the classical scenario, in\nthe repeated setting we observe substantial learning resulting in near-optimal\nstopping behavior. We conduct a Bayesian comparison of multiple behavioral\nmodels which shows that participants' behavior is best described by a class of\nthreshold-based models that contains the theoretically optimal strategy.\nFitting such a threshold-based model to data reveals players' estimated\nthresholds to be surprisingly close to the optimal thresholds after only a\nsmall number of games.\n", "versions": [{"version": "v1", "created": "Tue, 29 Aug 2017 15:41:41 GMT"}], "update_date": "2017-08-30", "authors_parsed": [["Goldstein", "Daniel G.", ""], ["McAfee", "R. Preston", ""], ["Suri", "Siddharth", ""], ["Wright", "James R.", ""]]}, {"id": "1708.08907", "submitter": "Yannai A. Gonczarowski", "authors": "Yannai A. Gonczarowski", "title": "Bounding the Menu-Size of Approximately Optimal Auctions via\n  Optimal-Transport Duality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The question of the minimum menu-size for approximate (i.e.,\nup-to-$\\varepsilon$) Bayesian revenue maximization when selling two goods to an\nadditive risk-neutral quasilinear buyer was introduced by Hart and Nisan\n(2013), who give an upper bound of $O(\\frac{1}{\\varepsilon^4})$ for this\nproblem. Using the optimal-transport duality framework of Daskalakis et al.\n(2013, 2015), we derive the first lower bound for this problem - of\n$\\Omega(\\frac{1}{\\sqrt[4]{\\varepsilon}})$, even when the values for the two\ngoods are drawn i.i.d. from \"nice\" distributions, establishing how to reason\nabout approximately optimal mechanisms via this duality framework. This bound\nimplies, for any fixed number of goods, a tight bound of\n$\\Theta(\\log\\frac{1}{\\varepsilon})$ on the minimum deterministic communication\ncomplexity guaranteed to suffice for running some approximately\nrevenue-maximizing mechanism, thereby completely resolving this problem. As a\nsecondary result, we show that under standard economic assumptions on\ndistributions, the above upper bound of Hart and Nisan (2013) can be\nstrengthened to $O(\\frac{1}{\\varepsilon^2})$.\n", "versions": [{"version": "v1", "created": "Tue, 29 Aug 2017 17:48:59 GMT"}, {"version": "v2", "created": "Fri, 3 Nov 2017 12:11:57 GMT"}, {"version": "v3", "created": "Wed, 11 Apr 2018 01:05:49 GMT"}, {"version": "v4", "created": "Wed, 11 Jul 2018 12:56:50 GMT"}], "update_date": "2018-07-12", "authors_parsed": [["Gonczarowski", "Yannai A.", ""]]}, {"id": "1708.09020", "submitter": "Abbas Kazerouni", "authors": "Abbas Kazerouni and Benjamin Van Roy", "title": "Learning to Price with Reference Effects", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As a firm varies the price of a product, consumers exhibit reference effects,\nmaking purchase decisions based not only on the prevailing price but also the\nproduct's price history. We consider the problem of learning such behavioral\npatterns as a monopolist releases, markets, and prices products. This context\ncalls for pricing decisions that intelligently trade off between maximizing\nrevenue generated by a current product and probing to gain information for\nfuture benefit. Due to dependence on price history, realized demand can reflect\ndelayed consequences of earlier pricing decisions. As such, inference entails\nattribution of outcomes to prior decisions and effective exploration requires\nplanning price sequences that yield informative future outcomes. Despite the\nconsiderable complexity of this problem, we offer a tractable systematic\napproach. In particular, we frame the problem as one of reinforcement learning\nand leverage Thompson sampling. We also establish a regret bound that provides\ngraceful guarantees on how performance improves as data is gathered and how\nthis depends on the complexity of the demand model. We illustrate merits of the\napproach through simulations.\n", "versions": [{"version": "v1", "created": "Tue, 29 Aug 2017 20:40:10 GMT"}], "update_date": "2017-08-31", "authors_parsed": [["Kazerouni", "Abbas", ""], ["Van Roy", "Benjamin", ""]]}, {"id": "1708.09122", "submitter": "Lin Gao", "authors": "Xiaoyan Mo, Zhang Li, Lin Gao, Bin Cao, Tingting Zhang, Tong Wang", "title": "Technical Report for \"User-Centric Participatory Sensing: A Game\n  Theoretic Analysis\"", "comments": "This manuscript serves as the online technical report for the paper\n  published in IEEE GLOBECOM 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Participatory sensing (PS) is a novel and promising sensing network paradigm\nfor achieving a flexible and scalable sensing coverage with a low deploying\ncost, by encouraging mobile users to participate and contribute their\nsmartphones as sensors. In this work, we consider a general PS system model\nwith location-dependent and time-sensitive tasks, which generalizes the\nexisting models in the literature. We focus on the task scheduling in the\nuser-centric PS system, where each participating user will make his individual\ntask scheduling decision (including both the task selection and the task\nexecution order) distributively. Specifically, we formulate the interaction of\nusers as a strategic game called Task Scheduling Game (TSG) and perform a\ncomprehensive game-theoretic analysis. First, we prove that the proposed TSG\ngame is a potential game, which guarantees the existence of Nash equilibrium\n(NE). Then, we analyze the efficiency loss and the fairness index at the NE.\nOur analysis shows the efficiency at NE may increase or decrease with the\nnumber of users, depending on the level of competition. This implies that it is\nnot always better to employ more users in the user-centric PS system, which is\nimportant for the system designer to determine the optimal number of users to\nbe employed in a practical system.\n", "versions": [{"version": "v1", "created": "Wed, 30 Aug 2017 05:26:38 GMT"}], "update_date": "2017-08-31", "authors_parsed": [["Mo", "Xiaoyan", ""], ["Li", "Zhang", ""], ["Gao", "Lin", ""], ["Cao", "Bin", ""], ["Zhang", "Tingting", ""], ["Wang", "Tong", ""]]}, {"id": "1708.09570", "submitter": "Radhika Arava", "authors": "Radhika Arava", "title": "Social Network Analysis Using Coordination Games", "comments": "23 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Communities typically capture homophily as people of the same community share\nmany common features. This paper is motivated by the problem of community\ndetection in social networks, as it can help improve our understanding of the\nnetwork topology and the spread of information. Given the selfish nature of\nhumans to align with like-minded people, we employ game theoretic models and\nalgorithms to detect communities in this paper. Specifically, we employ\ncoordination games to represent interactions between individuals in a social\nnetwork. We represent the problem of community detection as a graph\ncoordination game. We provide a novel and scalable two phased approach to\ncompute an accurate overlapping community structure in the given network. We\nevaluate our algorithm against the best existing methods for community\ndetection and show that our algorithm improves significantly on benchmark\nnetworks (real and synthetic) with respect to standard Normalised Mutual\nInformation measure.\n", "versions": [{"version": "v1", "created": "Thu, 31 Aug 2017 05:36:37 GMT"}], "update_date": "2017-09-01", "authors_parsed": [["Arava", "Radhika", ""]]}]