[{"id": "1002.0298", "submitter": "Jayanthkumar Kannan", "authors": "Jayanthkumar Kannan, Petros Maniatis, Byung-Gon Chun", "title": "A Data Capsule Framework For Web Services: Providing Flexible Data\n  Access Control To Users", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces the notion of a secure data capsule, which refers to an\nencapsulation of sensitive user information (such as a credit card number)\nalong with code that implements an interface suitable for the use of such\ninformation (such as charging for purchases) by a service (such as an online\nmerchant). In our capsule framework, users provide their data in the form of\nsuch capsules to web services rather than raw data. Capsules can be deployed in\na variety of ways, either on a trusted third party or the user's own computer\nor at the service itself, through the use of a variety of hardware or software\nmodules, such as a virtual machine monitor or trusted platform module: the only\nrequirement is that the deployment mechanism must ensure that the user's data\nis only accessed via the interface sanctioned by the user. The framework\nfurther allows an user to specify policies regarding which services or machines\nmay host her capsule, what parties are allowed to access the interface, and\nwith what parameters. The combination of interface restrictions and policy\ncontrol lets us bound the impact of an attacker who compromises the service to\ngain access to the user's capsule or a malicious insider at the service itself.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2010 18:31:06 GMT"}], "update_date": "2010-02-02", "authors_parsed": [["Kannan", "Jayanthkumar", ""], ["Maniatis", "Petros", ""], ["Chun", "Byung-Gon", ""]]}, {"id": "1002.3329", "submitter": "Ashley Smith", "authors": "M.Tarighi, S.A.Motamedi and S.Sharifian", "title": "A new model for virtual machine migration in virtualized cluster server\n  based on Fuzzy Decision Making", "comments": "Journal of Telecommunications,Volume 1, Issue 1, pp40-51, February\n  2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we show that performance of the virtualized cluster servers\ncould be improved through intelligent decision over migration time of Virtual\nMachines across heterogeneous physical nodes of a cluster server. The cluster\nserves a variety range of services from Web Service to File Service. Some of\nthem are CPU-Intensive while others are RAM-Intensive and so on. Virtualization\nhas many advantages such as less hardware cost, cooling cost, more\nmanageability. One of the key benefits is better load balancing by using of VM\nmigration between hosts. To migrate, we must know which virtual machine needs\nto be migrated and when this relocation has to be done and, moreover, which\nhost must be destined. To relocate VMs from overloaded servers to underloaded\nones, we need to sort nodes from the highest volume to the lowest. There are\nsome models to finding the most overloaded node, but they have some\nshortcomings. The focus of this paper is to present a new method to migrate VMs\nbetween cluster nodes using TOPSIS algorithm - one of the most efficient Multi\nCriteria Decision Making techniques- to make more effective decision over whole\nactive servers of the Cluster and find the most loaded serversTo evaluate the\nperformance improvement resulted from this model, we used cluster Response time\nand Unbalanced Factor.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2010 17:52:17 GMT"}], "update_date": "2010-02-18", "authors_parsed": [["Tarighi", "M.", ""], ["Motamedi", "S. A.", ""], ["Sharifian", "S.", ""]]}]