[{"id": "2009.00146", "submitter": "Ioannis Kordonis", "authors": "Ioannis Kordonis, Athanasios-Rafail Lagos, George P. Papavassilopoulos", "title": "Nash Social Distancing Games with Equity Constraints: How Inequality\n  Aversion Affects the Spread of Epidemics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a game-theoretic model describing voluntary social\ndistancing during the spread of an epidemic. The payoffs of the agents depend\non the social distancing they practice and on the probability of getting\ninfected. We consider two types of agents, the non-vulnerable agents who have a\nsmall cost if they get infected, and the vulnerable agents who have a higher\ncost. For the modeling of the epidemic outbreak, we consider a variant of the\nSIR (Susceptible-Infected-Removed) model involving populations of susceptible,\ninfected, and removed persons of vulnerable and non-vulnerable types. The Nash\nequilibria of this social distancing game are studied. The main contribution of\nthis work is the analysis of the case where the players, desiring to achieve a\nlow social inequality, pose a bound on the variance of the payoffs. In this\ncase, we introduce and characterize a notion of Generalized Nash Equilibrium\n(GNE) for games with a continuum of players. Through numerical studies, we show\nthat inequality constraints result in a slower spread of the epidemic and an\nimproved cost for the vulnerable players. Furthermore, it is possible that\ninequality constraints are beneficial for non-vulnerable players as well.\n", "versions": [{"version": "v1", "created": "Mon, 31 Aug 2020 23:28:52 GMT"}, {"version": "v2", "created": "Sat, 3 Apr 2021 17:42:18 GMT"}], "update_date": "2021-04-06", "authors_parsed": [["Kordonis", "Ioannis", ""], ["Lagos", "Athanasios-Rafail", ""], ["Papavassilopoulos", "George P.", ""]]}, {"id": "2009.00162", "submitter": "Yue Guan", "authors": "Yue Guan, Qifan Zhang, Panagiotis Tsiotras", "title": "Learning Nash Equilibria in Zero-Sum Stochastic Games via\n  Entropy-Regularized Policy Approximation", "comments": "Accepted at IJCAI-21", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT cs.SY eess.SY stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the use of policy approximations to reduce the computational cost\nof learning Nash equilibria in zero-sum stochastic games. We propose a new\nQ-learning type algorithm that uses a sequence of entropy-regularized soft\npolicies to approximate the Nash policy during the Q-function updates. We prove\nthat under certain conditions, by updating the regularized Q-function, the\nalgorithm converges to a Nash equilibrium. We also demonstrate the proposed\nalgorithm's ability to transfer previous training experiences, enabling the\nagents to adapt quickly to new environments. We provide a dynamic\nhyper-parameter scheduling scheme to further expedite convergence. Empirical\nresults applied to a number of stochastic games verify that the proposed\nalgorithm converges to the Nash equilibrium, while exhibiting a major speed-up\nover existing algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2020 01:03:44 GMT"}, {"version": "v2", "created": "Sun, 27 Jun 2021 04:26:01 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Guan", "Yue", ""], ["Zhang", "Qifan", ""], ["Tsiotras", "Panagiotis", ""]]}, {"id": "2009.00198", "submitter": "Daniel Lazar", "authors": "Daniel A. Lazar and Ramtin Pedarsani", "title": "Optimal Tolling for Multitype Mixed Autonomous Traffic Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When selfish users share a road network and minimize their individual travel\ncosts, the equilibrium they reach can be worse than the socially optimal\nrouting. Tolls are often used to mitigate this effect in traditional congestion\ngames, where all vehicle contribute identically to congestion. However, with\nthe proliferation of autonomous vehicles and driver-assistance technology,\nvehicles become heterogeneous in how they contribute to road latency. This\nmagnifies the potential inefficiencies due to selfish routing and invalidates\ntraditional tolling methods. To address this, we consider a network of parallel\nroads where the latency on each road is an affine function of the quantity of\nflow of each vehicle type. We provide tolls (which differentiate between\nvehicle types) which are guaranteed to minimize social cost at equilibrium. The\ntolls are a function of a calculated optimal routing; to enable this tolling,\nwe prove that some element in the set of optimal routings has a lack of cycles\nin a graph representing the way vehicles types share roads. We then show that\nunless a planner can differentiate between vehicle types in the tolls given,\nthe resulting equilibrium can be unboundedly worse than the optimal routing,\nand that marginal cost tolling fails in our setting.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2020 03:09:37 GMT"}], "update_date": "2020-09-02", "authors_parsed": [["Lazar", "Daniel A.", ""], ["Pedarsani", "Ramtin", ""]]}, {"id": "2009.00511", "submitter": "Andrikopoulos Athanasios", "authors": "Athanasios Andrikopoulos, Ioannis Gounaridis", "title": "On Stoltenberg's quasi-uniform completion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GN cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we give a new completion for quasi-uniform spaces which\ngeneralizes the completion theories of Doitchinov [8] and Stoltenberg [20]. The\npresented completion theory is very well-behaved and extends the completion\ntheory of uniform spaces in a natural way. That is, the definition of Cauchy\nnet and the constructed completion coincide with the classical in the case of\nuniform spaces. The main contribution this completion theory makes is the\nnotion of the cut of nets which generalize the idea of Doitchinov for the\nnotion of-Cauchy net [1]\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2020 15:15:06 GMT"}], "update_date": "2020-09-02", "authors_parsed": [["Andrikopoulos", "Athanasios", ""], ["Gounaridis", "Ioannis", ""]]}, {"id": "2009.00578", "submitter": "Mathieu Lauri\\`ere", "authors": "Ren\\'e Carmona and Kenza Hamidouche and Mathieu Lauri\\`ere and Zongjun\n  Tan", "title": "Linear-Quadratic Zero-Sum Mean-Field Type Games: Optimality Conditions\n  and Policy Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, zero-sum mean-field type games (ZSMFTG) with linear dynamics\nand quadratic cost are studied under infinite-horizon discounted utility\nfunction. ZSMFTG are a class of games in which two decision makers whose\nutilities sum to zero, compete to influence a large population of\nindistinguishable agents. In particular, the case in which the transition and\nutility functions depend on the state, the action of the controllers, and the\nmean of the state and the actions, is investigated. The optimality conditions\nof the game are analysed for both open-loop and closed-loop controls, and\nexplicit expressions for the Nash equilibrium strategies are derived. Moreover,\ntwo policy optimization methods that rely on policy gradient are proposed for\nboth model-based and sample-based frameworks. In the model-based case, the\ngradients are computed exactly using the model, whereas they are estimated\nusing Monte-Carlo simulations in the sample-based case. Numerical experiments\nare conducted to show the convergence of the utility function as well as the\ntwo players' controls.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2020 17:08:24 GMT"}], "update_date": "2020-09-02", "authors_parsed": [["Carmona", "René", ""], ["Hamidouche", "Kenza", ""], ["Laurière", "Mathieu", ""], ["Tan", "Zongjun", ""]]}, {"id": "2009.01360", "submitter": "Djordje Gligorijevic", "authors": "Djordje Gligorijevic, Tian Zhou, Bharatbhushan Shetty, Brendan Kitts,\n  Shengjun Pan, Junwei Pan, Aaron Flores", "title": "Bid Shading in The Brave New World of First-Price Auctions", "comments": "In Proceedings of the 29th ACM International Conference on\n  Information and Knowledge Management (CIKM'20), October 19-23, 2020, Virtual\n  Event, Ireland", "journal-ref": null, "doi": "10.1145/3340531.3412689", "report-no": null, "categories": "cs.GT cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online auctions play a central role in online advertising, and are one of the\nmain reasons for the industry's scalability and growth. With great changes in\nhow auctions are being organized, such as changing the second- to first-price\nauction type, advertisers and demand platforms are compelled to adapt to a new\nvolatile environment. Bid shading is a known technique for preventing\noverpaying in auction systems that can help maintain the strategy equilibrium\nin first-price auctions, tackling one of its greatest drawbacks. In this study,\nwe propose a machine learning approach of modeling optimal bid shading for\nnon-censored online first-price ad auctions. We clearly motivate the approach\nand extensively evaluate it in both offline and online settings on a major\ndemand side platform. The results demonstrate the superiority and robustness of\nthe new approach as compared to the existing approaches across a range of\nperformance metrics.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2020 21:48:21 GMT"}], "update_date": "2020-09-04", "authors_parsed": [["Gligorijevic", "Djordje", ""], ["Zhou", "Tian", ""], ["Shetty", "Bharatbhushan", ""], ["Kitts", "Brendan", ""], ["Pan", "Shengjun", ""], ["Pan", "Junwei", ""], ["Flores", "Aaron", ""]]}, {"id": "2009.01446", "submitter": "Abu Reyan Ahmed", "authors": "Saad Al Muttakee, Abu Reyan Ahmed, Md. Saidur Rahman", "title": "New Results and Bounds on Online Facility Assignment Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider an online facility assignment problem where a set of facilities $F =\n\\{ f_1, f_2, f_3, \\cdots, f_{|F|} \\}$ of equal capacity $l$ is situated on a\nmetric space and customers arrive one by one in an online manner on that space.\nWe assign a customer $c_i$ to a facility $f_j$ before a new customer $c_{i+1}$\narrives. The cost of this assignment is the distance between $c_i$ and $f_j$.\nThe objective of this problem is to minimize the sum of all assignment costs.\nRecently Ahmed et al. (TCS, 806, pp. 455-467, 2020) studied the problem where\nthe facilities are situated on a line and computed competitive ratio of\n\"Algorithm Greedy\" which assigns the customer to the nearest available\nfacility. They computed competitive ratio of algorithm named \"Algorithm\nOptimal-Fill\" which assigns the new customer considering optimal assignment of\nall previous customers. They also studied the problem where the facilities are\nsituated on a connected unweighted graph.\n  In this paper we first consider that $F$ is situated on the vertices of a\nconnected unweighted grid graph $G$ of size $r \\times c$ and customers arrive\none by one having positions on the vertices of $G$. We show that Algorithm\nGreedy has competitive ratio $r \\times c + r + c$ and Algorithm Optimal-Fill\nhas competitive ratio $O(r \\times c)$. We later show that the competitive ratio\nof Algorithm Optimal-Fill is $2|F|$ for any arbitrary graph. Our bound is tight\nand better than the previous result. We also consider the facilities are\ndistributed arbitrarily on a plane and provide an algorithm for the scenario.\nWe also provide an algorithm that has competitive ratio $(2n-1)$. Finally, we\nconsider a straight line metric space and show that no algorithm for the online\nfacility assignment problem has competitive ratio less than $9.001$.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2020 04:33:53 GMT"}], "update_date": "2020-09-04", "authors_parsed": [["Muttakee", "Saad Al", ""], ["Ahmed", "Abu Reyan", ""], ["Rahman", "Md. Saidur", ""]]}, {"id": "2009.01574", "submitter": "Attila Szolnoki", "authors": "Marcell Blahota, Istvan Blahota, and Attila Szolnoki", "title": "Equal partners do better in defensive alliances", "comments": "7 two-column pages, 6 figures, accepted for publication in EPL", "journal-ref": "EPL 131 (2020) 58002", "doi": "10.1209/0295-5075/131/58002", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech cs.GT nlin.PS physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyclic dominance offers not just a way to maintain biodiversity, but also\nserves as a sort of defensive alliance against an external invader.\nInterestingly, a new level of competition can be observed when two cyclic loops\nare present. Here the inner invasion speed plays a decisive role on the\nevolutionary outcome, because faster invasion rate provides an evolutionary\nadvantage to an alliance. In this Letter we demonstrate that the heterogeneity\nof inner invasion rates makes an alliance vulnerable against a loop where group\nmembers are equal. Quite surprisingly, a loop where invasion rates are uniform\ncan still dominate an alliance formed by heteregeneous rates even if the\naverage speed of invasion is significantly higher in the latter group. At a\nspecific range of parameter space, when intergroup invasion or the average\ninner invasion is moderate, the heterogeneous alliance with higher internal\ninvasion speed may prevail, or the system terminates onto a novel 4- or\n5-species solution.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2020 10:41:06 GMT"}], "update_date": "2020-09-21", "authors_parsed": [["Blahota", "Marcell", ""], ["Blahota", "Istvan", ""], ["Szolnoki", "Attila", ""]]}, {"id": "2009.01668", "submitter": "Robert Prentner", "authors": "Robert Prentner", "title": "A Predictive Strategy for the Iterated Prisoner's Dilemma", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The iterated prisoner's dilemma is a game that produces many\ncounter-intuitive and complex behaviors in a social environment, based on very\nsimple basic rules. It illustrates that cooperation can be a good thing even in\na competitive world, that individual fitness needs not to be the most important\ncriteria of success, and that some strategies are very strong in a direct\nconfrontation but could still perform poorly on average or are evolutionarily\nunstable. In this contribution, we present a strategy -- PREDICTOR -- which\nappears to be \"sentient\" and chooses to cooperate when playing against some\nstrategies, but defects when playing against others, without the need to record\n\"tags\" for its opponents or an involved decision-making mechanism. To be able\nto operate in the highly-contextual environment, as modeled by the iterated\nprisoner's dilemma, PREDICTOR learns from its experience to choose optimal\nactions by modeling its opponent and predicting a (fictive) future.\n  It is shown that PREDICTOR is an efficient strategy for playing the iterated\nprisoner's dilemma and is simple to implement. In a simulated and\nrepresentative tournament, it achieves high average scores and wins the\ntournament for various parameter settings. PREDICTOR thereby relies on a brief\nphase of exploration to improve its model, and it can evolve morality from\nintrinsically selfish behavior.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2020 13:53:28 GMT"}, {"version": "v2", "created": "Fri, 4 Sep 2020 04:10:50 GMT"}], "update_date": "2020-09-07", "authors_parsed": [["Prentner", "Robert", ""]]}, {"id": "2009.01676", "submitter": "Yongge Wang", "authors": "Yongge Wang", "title": "Automated Market Makers for Decentralized Finance (DeFi)", "comments": "14 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.DM cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper compares mathematical models for automated market makers including\nlogarithmic market scoring rule (LMSR), liquidity sensitive LMSR (LS-LMSR),\nconstant product/mean/sum, and others. It is shown that though LMSR may not be\na good model for Decentralized Finance (DeFi) applications, LS-LMSR has several\nadvantages over constant product/mean based automated market makers. However,\nLS-LMSR requires complicated computation (i.e., logarithm and exponentiation)\nand the cost function curve is concave. In certain DeFi applications, it is\npreferred to have computationally efficient cost functions with convex curves\nto conform with the principle of supply and demand. This paper proposes and\nanalyzes constant circle/ellipse based cost functions for automated market\nmakers. The proposed cost functions are computationally efficient (only\nrequires multiplication and square root calculation) and have several\nadvantages over widely deployed constant product cost functions. For example,\nthe proposed market makers are more robust against front-runner (slippage)\nattacks.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2020 13:58:13 GMT"}, {"version": "v2", "created": "Fri, 11 Sep 2020 15:35:15 GMT"}], "update_date": "2020-09-14", "authors_parsed": [["Wang", "Yongge", ""]]}, {"id": "2009.01970", "submitter": "Christopher Griffin", "authors": "Yunong Chen and Andrew Belmonte and Christopher Griffin", "title": "Imitation of Success Leads to Cost of Living Mediated Fairness in the\n  Ultimatum Game", "comments": "11 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mechanism behind the emergence of cooperation in both biological and\nsocial systems is currently not understood. In particular, human behavior in\nthe Ultimatum game is almost always irrational, preferring mutualistic sharing\nstrategies, while chimpanzees act rationally and selfishly. However, human\nbehavior varies with geographic and cultural differences leading to distinct\nbehaviors. In this paper, we analyze a social imitation model that incorporates\ninternal energy caches (e.g., food/money savings), cost of living, death, and\nreproduction. We show that when imitation (and death) occurs, a natural\ncorrelation between selfishness and cost of living emerges. However, in all\nsocieties that do not collapse, non-Nash sharing strategies emerge as the de\nfacto result of imitation. We explain these results by constructing a\nmean-field approximation of the internal energy cache informed by time-varying\ndistributions extracted from experimental data. Results from a meta-analysis on\ngeographically diverse ultimatum game studies in humans, show the proposed\nmodel captures some of the qualitative aspects of the real-world data and\nsuggests further experimentation.\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2020 00:59:08 GMT"}, {"version": "v2", "created": "Mon, 23 Nov 2020 23:59:43 GMT"}], "update_date": "2020-11-25", "authors_parsed": [["Chen", "Yunong", ""], ["Belmonte", "Andrew", ""], ["Griffin", "Christopher", ""]]}, {"id": "2009.02033", "submitter": "Yuki Oyama", "authors": "Yuki Oyama, Yusuke Hara, Takashi Akamatsu", "title": "Markovian Traffic Equilibrium Assignment based on Network Generalized\n  Extreme Value Model", "comments": "35 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study establishes a novel framework of Markovian traffic equilibrium\nassignment based on the network generalized extreme value (NGEV) model, which\nwe call NGEV equilibrium assignment. The use of the NGEV model in traffic\nassignment has recently been proposed and enables capturing the path\ncorrelation without explicit path enumeration. However, the NGEV equilibrium\nassignment has never been investigated in the literature, which has limited the\npractical applicability of the NGEV-based models. We address this gap by\nproviding the necessary development for the NGEV equilibrium assignment. We\nfirst show that the NGEV assignment can be formulated and solved under the same\npath algebra with the Markovian traffic assignment models. We then provide the\nequivalent optimization formulations to the NGEV equilibrium assignment, from\nwhich both primal and dual types of solution algorithms are derived. In\nparticular, we are the first to propose an efficient algorithm based on an\naccelerated gradient method in the traffic assignment field. The convergence\nand complementary relationship of the proposed primal-dual algorithms are shown\nthrough numerical experiments.\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2020 07:28:58 GMT"}, {"version": "v2", "created": "Wed, 21 Apr 2021 13:19:59 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Oyama", "Yuki", ""], ["Hara", "Yusuke", ""], ["Akamatsu", "Takashi", ""]]}, {"id": "2009.02146", "submitter": "Mathieu Lauri\\`ere", "authors": "Ren\\'e Carmona and Kenza Hamidouche and Mathieu Lauri\\`ere and Zongjun\n  Tan", "title": "Policy Optimization for Linear-Quadratic Zero-Sum Mean-Field Type Games", "comments": "arXiv admin note: text overlap with arXiv:2009.00578", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, zero-sum mean-field type games (ZSMFTG) with linear dynamics\nand quadratic utility are studied under infinite-horizon discounted utility\nfunction. ZSMFTG are a class of games in which two decision makers whose\nutilities sum to zero, compete to influence a large population of agents. In\nparticular, the case in which the transition and utility functions depend on\nthe state, the action of the controllers, and the mean of the state and the\nactions, is investigated. The game is analyzed and explicit expressions for the\nNash equilibrium strategies are derived. Moreover, two policy optimization\nmethods that rely on policy gradient are proposed for both model-based and\nsample-based frameworks. In the first case, the gradients are computed exactly\nusing the model whereas they are estimated using Monte-Carlo simulations in the\nsecond case. Numerical experiments show the convergence of the two players'\ncontrols as well as the utility function when the two algorithms are used in\ndifferent scenarios.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2020 13:49:08 GMT"}], "update_date": "2020-09-07", "authors_parsed": [["Carmona", "René", ""], ["Hamidouche", "Kenza", ""], ["Laurière", "Mathieu", ""], ["Tan", "Zongjun", ""]]}, {"id": "2009.02605", "submitter": "Ashkan Zehfroosh", "authors": "Ashkan Zehfroosh and Herbert G. Tanner", "title": "PAC Reinforcement Learning Algorithm for General-Sum Markov Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a theoretical framework for probably approximately\ncorrect (PAC) multi-agent reinforcement learning (MARL) algorithms for Markov\ngames. The paper offers an extension to the well-known Nash Q-learning\nalgorithm, using the idea of delayed Q-learning, in order to build a new PAC\nMARL algorithm for general-sum Markov games. In addition to guiding the design\nof a provably PAC MARL algorithm, the framework enables checking whether an\narbitrary MARL algorithm is PAC. Comparative numerical results demonstrate\nperformance and robustness.\n", "versions": [{"version": "v1", "created": "Sat, 5 Sep 2020 21:54:27 GMT"}], "update_date": "2020-09-09", "authors_parsed": [["Zehfroosh", "Ashkan", ""], ["Tanner", "Herbert G.", ""]]}, {"id": "2009.02690", "submitter": "Nimrod Talmon", "authors": "Piotr Skowron, Arkadii Slinko, Stanis{\\l}aw Szufa, Nimrod Talmon", "title": "Participatory Budgeting with Cumulative Votes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In participatory budgeting we are given a set of projects---each with a cost,\nan available budget, and a set of voters who in some form express their\npreferences over the projects. The goal is to select---based on voter\npreferences---a subset of projects whose total cost does not exceed the budget.\nWe propose several aggregation methods based on the idea of cumulative votes,\ne.g., for the setting when each voter is given one coin and she specifies how\nthis coin should be split among the projects. We compare our aggregation\nmethods based on (1) axiomatic properties, and (2) computer simulations. We\nidentify one method, Minimal Transfers over Costs, that demonstrates\nparticularly desirable behavior. In particular, it significantly improves on\nexisting methods, satisfies a strong notion of proportionality, and, thus, is\npromising to be used in practice.\n", "versions": [{"version": "v1", "created": "Sun, 6 Sep 2020 09:46:14 GMT"}], "update_date": "2020-09-08", "authors_parsed": [["Skowron", "Piotr", ""], ["Slinko", "Arkadii", ""], ["Szufa", "Stanisław", ""], ["Talmon", "Nimrod", ""]]}, {"id": "2009.03074", "submitter": "Benjamin Monmege", "authors": "Thomas Brihaye, Gilles Geeraerts, Axel Haddad, Engel Lefaucheux,\n  Benjamin Monmege", "title": "One-Clock Priced Timed Games with Negative Weights", "comments": "arXiv admin note: substantial text overlap with arXiv:1507.03786", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Priced timed games are two-player zero-sum games played on priced timed\nautomata (whose locations and transitions are labeled by weights modelling the\nprice of spending time in a state and executing an action, respectively). The\ngoals of the players are to minimise and maximise the price to reach a target\nlocation, respectively. We consider priced timed games with one clock and\narbitrary integer weights and show that, for an important subclass of theirs\n(the so-called simple priced timed games), one can compute, in exponential\ntime, the optimal values that the players can achieve, with their associated\noptimal strategies. As side results, we also show that one-clock priced timed\ngames are determined and that we can use our result on simple priced timed\ngames to solve the more general class of so-called negative-reset-acyclic\npriced timed games (with arbitrary integer weights and one clock). The\ndecidability status of the full class of priced timed games with one-clock and\narbitrary integer weights still remains open.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2020 13:01:40 GMT"}, {"version": "v2", "created": "Wed, 21 Apr 2021 17:05:30 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Brihaye", "Thomas", ""], ["Geeraerts", "Gilles", ""], ["Haddad", "Axel", ""], ["Lefaucheux", "Engel", ""], ["Monmege", "Benjamin", ""]]}, {"id": "2009.03193", "submitter": "Azlan Iqbal", "authors": "Azlan Iqbal", "title": "An Algorithm for Automatically Updating a Forsyth-Edwards Notation\n  String Without an Array Board Representation", "comments": "6 pages, 6 figures, 4 tables, 1 appendix section; presented at the\n  8th International Conference on Information Technology and Multimedia on 24th\n  August 2020 (final version published by IEEE Xplore)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an algorithm that correctly updates the Forsyth-Edwards Notation\n(FEN) chessboard character string after any move is made without the need for\nan intermediary array representation of the board. In particular, this relates\nto software that have to do with chess, certain chess variants and possibly\neven similar board games with comparable position representation. Even when\nperformance may be equal or inferior to using arrays, the algorithm still\nprovides an accurate and viable alternative to accomplishing the same thing, or\nwhen there may be a need for additional or side processing in conjunction with\narrays. Furthermore, the end result (i.e. an updated FEN string) is immediately\nready for export to any other internal module or external program, unlike with\nan intermediary array which needs to be first converted into a FEN string for\nexport purposes. The algorithm is especially useful when there are no existing\narray-based modules to represent a visual board as it can do without them\nentirely. We provide examples that demonstrate the correctness of the algorithm\ngiven a variety of positions involving castling, en passant and pawn promotion.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2020 09:13:58 GMT"}, {"version": "v2", "created": "Wed, 25 Nov 2020 04:26:35 GMT"}], "update_date": "2020-11-26", "authors_parsed": [["Iqbal", "Azlan", ""]]}, {"id": "2009.03607", "submitter": "Jerry Anunrojwong", "authors": "Jerry Anunrojwong, Yiling Chen, Bo Waggoner, Haifeng Xu", "title": "Computing Equilibria of Prediction Markets via Persuasion", "comments": null, "journal-ref": "Proceedings of the 15th Conference on Web and Internet Economics\n  (WINE 2019), pp. 45-56", "doi": "10.1007/978-3-030-35389-6_4", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the computation of equilibria in prediction markets in perhaps the\nmost fundamental special case with two players and three trading opportunities.\nTo do so, we show equivalence of prediction market equilibria with those of a\nsimpler signaling game with commitment introduced by Kong and Schoenebeck\n(2018). We then extend their results by giving computationally efficient\nalgorithms for additional parameter regimes. Our approach leverages a new\nconnection between prediction markets and Bayesian persuasion, which also\nreveals interesting conceptual insights.\n", "versions": [{"version": "v1", "created": "Tue, 8 Sep 2020 09:37:45 GMT"}], "update_date": "2020-09-09", "authors_parsed": [["Anunrojwong", "Jerry", ""], ["Chen", "Yiling", ""], ["Waggoner", "Bo", ""], ["Xu", "Haifeng", ""]]}, {"id": "2009.03634", "submitter": "Cong Chen", "authors": "Cong Chen, Yinfeng Xu", "title": "The curse of rationality in sequential scheduling games", "comments": "Extended abstract to appear in WINE 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the emphases on computability issues in research of algorithmic game\ntheory, the limited computational capacity of players have received far less\nattention. This work examines how different levels of players' computational\nability (or \"rationality\") impact the outcomes of sequential scheduling games.\nSurprisingly, our results show that a lower level of rationality of players may\nlead to better equilibria. More specifically, we characterize the sequential\nprice of anarchy (SPoA) under two different models of bounded rationality,\nnamely, players with $k$-lookahead and simple-minded players. The model in\nwhich players have $k$-lookahead interpolates between the \"perfect rationality\"\n($k=n-1$) and \"online greedy\" ($k=0$). Our results show that the inefficiency\nof equilibria (SPoA) increases in $k$ the degree of lookahead: $\\mathrm{SPoA} =\nO (k^2)$ for two machines and $\\mathrm{SPoA} = O\\left(2^k \\min \\{mk,n\\}\\right)$\nfor $m$ machines, where $n$ is the number of players. Moreover, when players\nare simple-minded, the SPoA is exactly $m$, which coincides with the\nperformance of \"online greedy\".\n", "versions": [{"version": "v1", "created": "Tue, 8 Sep 2020 10:45:28 GMT"}, {"version": "v2", "created": "Wed, 9 Sep 2020 09:04:43 GMT"}], "update_date": "2020-09-10", "authors_parsed": [["Chen", "Cong", ""], ["Xu", "Yinfeng", ""]]}, {"id": "2009.03719", "submitter": "Wenjia Ba", "authors": "Wenjia Ba, Haim Mendelson and Mingxi Zhu", "title": "Sales Policies for a Virtual Assistant", "comments": "37 pages, 8 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the implications of selling through a voice-based virtual assistant\n(VA). The seller has a set of products available and the VA decides which\nproduct to offer and at what price, seeking to maximize its revenue, consumer-\nor total-surplus. The consumer is impatient and rational, seeking to maximize\nher expected utility given the information available to her. The VA selects\nproducts based on the consumer's request and other information available to it\nand then presents them sequentially. Once a product is presented and priced,\nthe consumer evaluates it and decides whether to make a purchase. The\nconsumer's valuation of each product comprises a pre-evaluation value, which is\ncommon knowledge, and a post-evaluation component which is private to the\nconsumer. We solve for the equilibria and develop efficient algorithms for\nimplementing the solution. We examine the effects of information asymmetry on\nthe outcomes and study how incentive misalignment depends on the distribution\nof private valuations. We find that monotone rankings are optimal in the cases\nof a highly patient or impatient consumer and provide a good approximation for\nother levels of patience. The relationship between products' expected\nvaluations and prices depends on the consumer's patience level and is monotone\nincreasing (decreasing) when the consumer is highly impatient (patient). Also,\nthe seller's share of total surplus decreases in the amount of private\ninformation. We compare the VA to a traditional web-based interface, where\nmultiple products are presented simultaneously on each page. We find that\nwithin a page, the higher-value products are priced lower than the lower-value\nproducts when the private valuations are exponentially distributed. Finally,\nthe web-based interface generally achieves higher profits for the seller than a\nVA due to the greater commitment power inherent in its presentation.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2020 22:05:23 GMT"}], "update_date": "2020-09-09", "authors_parsed": [["Ba", "Wenjia", ""], ["Mendelson", "Haim", ""], ["Zhu", "Mingxi", ""]]}, {"id": "2009.04114", "submitter": "Yuhao Zhang", "authors": "Zhiyi Huang, Qiankun Zhang, Yuhao Zhang", "title": "Adwords in a Panorama", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Three decades ago, Karp, Vazirani, and Vazirani (STOC 1990) defined the\nonline matching problem and gave an optimal $1-\\frac{1}{e} \\approx\n0.632$-competitive algorithm. Fifteen years later, Mehta, Saberi, Vazirani, and\nVazirani (FOCS 2005) introduced the first generalization called AdWords driven\nby online advertising and obtained the optimal $1-\\frac{1}{e}$ competitive\nratio in the special case of small bids. It has been open ever since whether\nthere is an algorithm for general bids better than the $0.5$-competitive greedy\nalgorithm. This paper presents a $0.5016$-competitive algorithm for AdWords,\nanswering this open question on the positive end. The algorithm builds on\nseveral ingredients, including a combination of the online primal dual\nframework and the configuration linear program of matching problems recently\nexplored by Huang and Zhang (STOC 2020), a novel formulation of AdWords which\nwe call the panorama view, and a generalization of the online correlated\nselection by Fahrbach, Huang, Tao, and Zadimorghaddam (FOCS 2020) which we call\nthe panoramic online correlated selection.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2020 05:57:36 GMT"}, {"version": "v2", "created": "Thu, 10 Sep 2020 06:59:34 GMT"}, {"version": "v3", "created": "Fri, 27 Nov 2020 13:03:13 GMT"}], "update_date": "2020-11-30", "authors_parsed": [["Huang", "Zhiyi", ""], ["Zhang", "Qiankun", ""], ["Zhang", "Yuhao", ""]]}, {"id": "2009.04336", "submitter": "Gabriele Farina", "authors": "Gabriele Farina and Tuomas Sandholm", "title": "Polynomial-Time Computation of Optimal Correlated Equilibria in\n  Two-Player Extensive-Form Games with Public Chance Moves and Beyond", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unlike normal-form games, where correlated equilibria have been studied for\nmore than 45 years, extensive-form correlation is still generally not well\nunderstood. Part of the reason for this gap is that the sequential nature of\nextensive-form games allows for a richness of behaviors and incentives that are\nnot possible in normal-form settings. This richness translates to a\nsignificantly different complexity landscape surrounding extensive-form\ncorrelated equilibria. As of today, it is known that finding an optimal\nextensive-form correlated equilibrium (EFCE), extensive-form coarse correlated\nequilibrium (EFCCE), or normal-form coarse correlated equilibrium (NFCCE) in a\ntwo-player extensive-form game is computationally tractable when the game does\nnot include chance moves, and intractable when the game involves chance moves.\nIn this paper we significantly refine this complexity threshold by showing\nthat, in two-player games, an optimal correlated equilibrium can be computed in\npolynomial time, provided that a certain condition is satisfied. We show that\nthe condition holds, for example, when all chance moves are public, that is,\nboth players observe all chance moves. This implies that an optimal EFCE, EFCCE\nand NFCCE can be computed in polynomial time in the game size in two-player\ngames with public chance moves, providing the biggest positive complexity\nresult surrounding extensive-form correlation in more than a decade.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2020 14:51:58 GMT"}], "update_date": "2020-09-10", "authors_parsed": [["Farina", "Gabriele", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "2009.04350", "submitter": "Muhammad Aneeq Uz Zaman", "authors": "Muhammad Aneeq uz Zaman, Kaiqing Zhang, Erik Miehling, and Tamer\n  Ba\\c{s}ar", "title": "Reinforcement Learning in Non-Stationary Discrete-Time Linear-Quadratic\n  Mean-Field Games", "comments": "To appear in CDC 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.GT cs.LG cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study large population multi-agent reinforcement learning\n(RL) in the context of discrete-time linear-quadratic mean-field games\n(LQ-MFGs). Our setting differs from most existing work on RL for MFGs, in that\nwe consider a non-stationary MFG over an infinite horizon. We propose an\nactor-critic algorithm to iteratively compute the mean-field equilibrium (MFE)\nof the LQ-MFG. There are two primary challenges: i) the non-stationarity of the\nMFG induces a linear-quadratic tracking problem, which requires solving a\nbackwards-in-time (non-causal) equation that cannot be solved by standard\n(causal) RL algorithms; ii) Many RL algorithms assume that the states are\nsampled from the stationary distribution of a Markov chain (MC), that is, the\nchain is already mixed, an assumption that is not satisfied for real data\nsources. We first identify that the mean-field trajectory follows linear\ndynamics, allowing the problem to be reformulated as a linear quadratic\nGaussian problem. Under this reformulation, we propose an actor-critic\nalgorithm that allows samples to be drawn from an unmixed MC. Finite-sample\nconvergence guarantees for the algorithm are then provided. To characterize the\nperformance of our algorithm in multi-agent RL, we have developed an error\nbound with respect to the Nash equilibrium of the finite-population game.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2020 15:17:52 GMT"}, {"version": "v2", "created": "Thu, 10 Sep 2020 18:41:17 GMT"}, {"version": "v3", "created": "Thu, 1 Oct 2020 15:41:33 GMT"}], "update_date": "2020-10-02", "authors_parsed": [["Zaman", "Muhammad Aneeq uz", ""], ["Zhang", "Kaiqing", ""], ["Miehling", "Erik", ""], ["Başar", "Tamer", ""]]}, {"id": "2009.04425", "submitter": "Chryssis Georgiou", "authors": "Chryssis Georgiou and Marios Mavronicolas and Burkhard Monien", "title": "(In)Existence of Equilibria for 2-Players, 2-Values Games with Concave\n  Valuations", "comments": "34 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider 2-players, 2-values minimization games where the players' costs\ntake on two values, $a,b$, $a<b$. The players play mixed strategies and their\ncosts are evaluated by unimodal valuations. This broad class of valuations\nincludes all concave, one-parameter functions $\\mathsf{F}: [0,1]\\rightarrow\n\\mathbb{R}$ with a unique maximum point. Our main result is an impossibility\nresult stating that: If the maximum is obtained in $(0,1)$ and\n$\\mathsf{F}\\left(\\frac{1}{2}\\right)\\ne b$, then there exists a 2-players,\n2-values game without $\\mathsf{F}$-equilibrium.\n  The counterexample game used for the impossibility result belongs to a new\nclass of very sparse 2-players, 2-values bimatrix games which we call normal\ngames. In an attempt to investigate the remaining case\n$\\mathsf{F}\\left(\\frac{1}{2}\\right) = b$, we show that:\n  - Every normal, $n$-strategies game has an ${\\mathsf{F}}$-equilibrium when\n${\\mathsf{F}}\\left( \\frac{1}{2} \\right) = b$. We present a linear time\nalgorithm for computing such an equilibrium.\n  - For 2-players, 2-values games with 3 strategies we have that if\n$\\mathsf{F}\\left(\\frac{1}{2}\\right) \\le b$, then every 2-players, 2-values,\n3-strategies game has an $\\mathsf{F}$-equilibrium; if\n$\\mathsf{F}\\left(\\frac{1}{2}\\right) > b$, then there exists a normal 2-players,\n2-values, 3-strategies game without $\\mathsf{F}$-equilibrium.\n  To the best of our knowledge, this work is the first to provide an (almost\ncomplete) answer on whether there is, for a given concave function\n$\\mathsf{F}$, a counterexample game without $\\mathsf{F}$-equilibrium.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2020 17:15:55 GMT"}], "update_date": "2020-09-10", "authors_parsed": [["Georgiou", "Chryssis", ""], ["Mavronicolas", "Marios", ""], ["Monien", "Burkhard", ""]]}, {"id": "2009.04981", "submitter": "Mattia Bianchi", "authors": "Mattia Bianchi and Sergio Grammatico", "title": "Nash equilibrium seeking under partial-decision information over\n  directed communication networks", "comments": "To appear in the 59th Conference on Decision and Control (CDC 2020)", "journal-ref": null, "doi": "10.1109/CDC42340.2020.9304267", "report-no": null, "categories": "math.OC cs.DC cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the Nash equilibrium problem in a partial-decision information\nscenario. Specifically, each agent can only receive information from some\nneighbors via a communication network, while its cost function depends on the\nstrategies of possibly all agents. In particular, while the existing methods\nassume undirected or balanced communication, in this paper we allow for\nnon-balanced, directed graphs. We propose a fully-distributed pseudo-gradient\nscheme, which is guaranteed to converge with linear rate to a Nash equilibrium,\nunder strong monotonicity and Lipschitz continuity of the game mapping. Our\nalgorithm requires global knowledge of the communication structure, namely of\nthe Perron-Frobenius eigenvector of the adjacency matrix and of a certain\nconstant related to the graph connectivity. Therefore, we adapt the procedure\nto setups where the network is not known in advance, by computing the\neigenvector online and by means of vanishing step sizes.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2020 16:44:04 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Bianchi", "Mattia", ""], ["Grammatico", "Sergio", ""]]}, {"id": "2009.05018", "submitter": "David Grimsman", "authors": "David Grimsman, Joshua H. Seaton, Jason R. Marden, Philip N. Brown", "title": "The Cost of Denied Observation in Multiagent Submodular Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DC cs.SY eess.SY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  A popular formalism for multiagent control applies tools from game theory,\ncasting a multiagent decision problem as a cooperation-style game in which\nindividual agents make local choices to optimize their own local utility\nfunctions in response to the observable choices made by other agents. When the\nsystem-level objective is submodular maximization, it is known that if every\nagent can observe the action choice of all other agents, then all Nash\nequilibria of a large class of resulting games are within a factor of $2$ of\noptimal; that is, the price of anarchy is $1/2$. However, little is known if\nagents cannot observe the action choices of other relevant agents. To study\nthis, we extend the standard game-theoretic model to one in which a subset of\nagents either become \\emph{blind} (unable to observe others' choices) or\n\\emph{isolated} (blind, and also invisible to other agents), and we prove exact\nexpressions for the price of anarchy as a function of the number of compromised\nagents. When $k$ agents are compromised (in any combination of blind or\nisolated), we show that the price of anarchy for a large class of utility\nfunctions is exactly $1/(2+k)$. We then show that if agents use marginal-cost\nutility functions and at least $1$ of the compromised agents is blind (rather\nthan isolated), the price of anarchy improves to $1/(1+k)$. We also provide\nsimulation results demonstrating the effects of these observation denials in a\ndynamic setting.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2020 17:33:11 GMT"}, {"version": "v2", "created": "Thu, 24 Sep 2020 18:11:49 GMT"}], "update_date": "2020-09-28", "authors_parsed": [["Grimsman", "David", ""], ["Seaton", "Joshua H.", ""], ["Marden", "Jason R.", ""], ["Brown", "Philip N.", ""]]}, {"id": "2009.05124", "submitter": "Geng Zhao", "authors": "Itai Ashlagi, Mark Braverman, Amin Saberi, Clayton Thomas, Geng Zhao", "title": "Tiered Random Matching Markets: Rank is Proportional to Popularity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the stable marriage problem in two-sided markets with randomly\ngenerated preferences. We consider agents on each side divided into a constant\nnumber of \"soft tiers\", which intuitively indicate the quality of the agent.\nSpecifically, every agent within a tier has the same public score, and agents\non each side have preferences independently generated proportionally to the\npublic scores of the other side.\n  We compute the expected average rank which agents in each tier have for their\npartners in the men-optimal stable matching, and prove concentration results\nfor the average rank in asymptotically large markets. Furthermore, we show that\ndespite having a significant effect on ranks, public scores do not strongly\ninfluence the probability of an agent matching to a given tier of the other\nside. This generalizes results of [Pittel 1989] which correspond to uniform\npreferences. The results quantitatively demonstrate the effect of competition\ndue to the heterogeneous attractiveness of agents in the market, and we give\nthe first explicit calculations of rank beyond uniform markets.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2020 19:49:51 GMT"}, {"version": "v2", "created": "Tue, 12 Jan 2021 21:30:56 GMT"}], "update_date": "2021-01-14", "authors_parsed": [["Ashlagi", "Itai", ""], ["Braverman", "Mark", ""], ["Saberi", "Amin", ""], ["Thomas", "Clayton", ""], ["Zhao", "Geng", ""]]}, {"id": "2009.05518", "submitter": "Modibo Camara", "authors": "Modibo Camara, Jason Hartline, Aleck Johnsen", "title": "Mechanisms for a No-Regret Agent: Beyond the Common Prior", "comments": "To appear in FOCS 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A rich class of mechanism design problems can be understood as\nincomplete-information games between a principal who commits to a policy and an\nagent who responds, with payoffs determined by an unknown state of the world.\nTraditionally, these models require strong and often-impractical assumptions\nabout beliefs (a common prior over the state). In this paper, we dispense with\nthe common prior. Instead, we consider a repeated interaction where both the\nprincipal and the agent may learn over time from the state history. We\nreformulate mechanism design as a reinforcement learning problem and develop\nmechanisms that attain natural benchmarks without any assumptions on the\nstate-generating process. Our results make use of novel behavioral assumptions\nfor the agent -- centered around counterfactual internal regret -- that capture\nthe spirit of rationality without relying on beliefs.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2020 16:41:20 GMT"}], "update_date": "2020-09-14", "authors_parsed": [["Camara", "Modibo", ""], ["Hartline", "Jason", ""], ["Johnsen", "Aleck", ""]]}, {"id": "2009.05823", "submitter": "Shivika Narang", "authors": "Shivika Narang, Arpita Biswas, Y Narahari", "title": "On Achieving Fairness and Stability in Many-to-One Matchings", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The past few years have seen a surge of work on fairness in social choice\nliterature. This paper initiates the study of finding a stable many-to-one\nmatching, under cardinal valuations, while satisfying fairness among the agents\non either side. Specifically, motivated by several real-world settings, we\nfocus on leximin optimal fairness and seek leximin optimality over many-to-one\nstable matchings. We first consider the special case of ranked valuations where\nall agents on each side have the same preference orders or rankings over the\nagents on the other side (but not necessarily the same valuations). For this\nspecial case, we provide a complete characterisation of the space of stable\nmatchings. This leads to FaSt, a novel and efficient algorithm to compute a\nleximin optimal stable matching under ranked isometric valuations (where, for\neach pair of agents, the valuation of one agent for the other is the same). The\nrunning time of FaSt is linear in the number of edges. Building upon FaSt, we\npresent an efficient algorithm, FaSt-Gen, that finds the leximin optimal stable\nmatching for ranked but otherwise unconstrained valuations. The running time of\nFaSt-Gen is quadratic in the number of edges. We next establish that, in the\nabsence of rankings, finding a leximin optimal stable matching is NP-Hard, even\nunder isometric valuations. In fact, when additivity and non-negativity are the\nonly assumptions on the valuations, we show that, unless P=NP, no efficient\npolynomial factor approximation is possible. When additivity is relaxed to\nsubmodularity, we find that not even an exponential approximation is possible.\n", "versions": [{"version": "v1", "created": "Sat, 12 Sep 2020 16:28:00 GMT"}, {"version": "v2", "created": "Sat, 13 Feb 2021 18:41:13 GMT"}, {"version": "v3", "created": "Thu, 15 Jul 2021 12:13:15 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Narang", "Shivika", ""], ["Biswas", "Arpita", ""], ["Narahari", "Y", ""]]}, {"id": "2009.06086", "submitter": "Yuanyi Zhong", "authors": "Yuanyi Zhong, Yuan Zhou, Jian Peng", "title": "Efficient Competitive Self-Play Policy Optimization", "comments": "18 pages (10 for main text, 2 for reference, 8 for appendix)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reinforcement learning from self-play has recently reported many successes.\nSelf-play, where the agents compete with themselves, is often used to generate\ntraining data for iterative policy improvement. In previous work, heuristic\nrules are designed to choose an opponent for the current learner. Typical rules\ninclude choosing the latest agent, the best agent, or a random historical\nagent. However, these rules may be inefficient in practice and sometimes do not\nguarantee convergence even in the simplest matrix games. In this paper, we\npropose a new algorithmic framework for competitive self-play reinforcement\nlearning in two-player zero-sum games. We recognize the fact that the Nash\nequilibrium coincides with the saddle point of the stochastic payoff function,\nwhich motivates us to borrow ideas from classical saddle point optimization\nliterature. Our method trains several agents simultaneously, and intelligently\ntakes each other as opponent based on simple adversarial rules derived from a\nprincipled perturbation-based saddle optimization method. We prove\ntheoretically that our algorithm converges to an approximate equilibrium with\nhigh probability in convex-concave games under standard assumptions. Beyond the\ntheory, we further show the empirical superiority of our method over baseline\nmethods relying on the aforementioned opponent-selection heuristics in matrix\ngames, grid-world soccer, Gomoku, and simulated robot sumo, with neural net\npolicy function approximators.\n", "versions": [{"version": "v1", "created": "Sun, 13 Sep 2020 21:01:38 GMT"}], "update_date": "2020-09-15", "authors_parsed": [["Zhong", "Yuanyi", ""], ["Zhou", "Yuan", ""], ["Peng", "Jian", ""]]}, {"id": "2009.06117", "submitter": "Kiran Vodrahalli", "authors": "Christos Papadimitriou, Kiran Vodrahalli, Mihalis Yannakakis", "title": "The Platform Design Problem", "comments": "updated with more results", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.LG cs.MA econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On-line firms deploy suites of software platforms, where each platform is\ndesigned to interact with users during a certain activity, such as browsing,\nchatting, socializing, emailing, driving, etc. The economic and incentive\nstructure of this exchange, as well as its algorithmic nature, have not been\nexplored to our knowledge. We model this interaction as a Stackelberg game\nbetween a Designer and one or more Agents. We model an Agent as a Markov chain\nwhose states are activities; we assume that the Agent's utility is a linear\nfunction of the steady-state distribution of this chain. The Designer may\ndesign a platform for each of these activities/states; if a platform is adopted\nby the Agent, the transition probabilities of the Markov chain are affected,\nand so is the objective of the Agent. The Designer's utility is a linear\nfunction of the steady state probabilities of the accessible states minus the\ndevelopment cost of the platforms. The underlying optimization problem of the\nAgent -- how to choose the states for which to adopt the platform -- is an MDP.\nIf this MDP has a simple yet plausible structure (the transition probabilities\nfrom one state to another only depend on the target state and the recurrent\nprobability of the current state) the Agent's problem can be solved by a greedy\nalgorithm. The Designer's optimization problem (designing a custom suite for\nthe Agent so as to optimize, through the Agent's optimum reaction, the\nDesigner's revenue), is NP-hard to approximate within any finite ratio;\nhowever, the special case, while still NP-hard, has an FPTAS. These results\ngeneralize from a single Agent to a distribution of Agents with finite support,\nas well as to the setting where the Designer must find the best response to the\nexisting strategies of other Designers. We discuss other implications of our\nresults and directions of future research.\n", "versions": [{"version": "v1", "created": "Sun, 13 Sep 2020 23:53:19 GMT"}, {"version": "v2", "created": "Tue, 13 Jul 2021 02:14:44 GMT"}], "update_date": "2021-07-14", "authors_parsed": [["Papadimitriou", "Christos", ""], ["Vodrahalli", "Kiran", ""], ["Yannakakis", "Mihalis", ""]]}, {"id": "2009.06136", "submitter": "Zhe Feng", "authors": "Zhe Feng, Guru Guruganesh, Christopher Liaw, Aranyak Mehta, Abhishek\n  Sethi", "title": "Convergence Analysis of No-Regret Bidding Algorithms in Repeated\n  Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The connection between games and no-regret algorithms has been widely studied\nin the literature. A fundamental result is that when all players play no-regret\nstrategies, this produces a sequence of actions whose time-average is a\ncoarse-correlated equilibrium of the game. However, much less is known about\nequilibrium selection in the case that multiple equilibria exist.\n  In this work, we study the convergence of no-regret bidding algorithms in\nauctions. Besides being of theoretical interest, bidding dynamics in auctions\nis an important question from a practical viewpoint as well. We study repeated\ngame between bidders in which a single item is sold at each time step and the\nbidder's value is drawn from an unknown distribution. We show that if the\nbidders use any mean-based learning rule then the bidders converge with high\nprobability to the truthful pure Nash Equilibrium in a second price auction, in\nVCG auction in the multi-slot setting and to the Bayesian Nash equilibrium in a\nfirst price auction. We note mean-based algorithms cover a wide variety of\nknown no-regret algorithms such as Exp3, UCB, $\\epsilon$-Greedy etc. Also, we\nanalyze the convergence of the individual iterates produced by such learning\nalgorithms, as opposed to the time-average of the sequence. Our experiments\ncorroborate our theoretical findings and also find a similar convergence when\nwe use other strategies such as Deep Q-Learning.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2020 01:32:29 GMT"}], "update_date": "2020-09-15", "authors_parsed": [["Feng", "Zhe", ""], ["Guruganesh", "Guru", ""], ["Liaw", "Christopher", ""], ["Mehta", "Aranyak", ""], ["Sethi", "Abhishek", ""]]}, {"id": "2009.06224", "submitter": "Yuanyuan Shi", "authors": "Yuanyuan Shi, Baosen Zhang", "title": "Multi-Agent Reinforcement Learning in Cournot Games", "comments": "IEEE Conference on Decision and Control (CDC), 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LG cs.MA cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we study the interaction of strategic agents in continuous\naction Cournot games with limited information feedback. Cournot game is the\nessential market model for many socio-economic systems where agents learn and\ncompete without the full knowledge of the system or each other. We consider the\ndynamics of the policy gradient algorithm, which is a widely adopted continuous\ncontrol reinforcement learning algorithm, in concave Cournot games. We prove\nthe convergence of policy gradient dynamics to the Nash equilibrium when the\nprice function is linear or the number of agents is two. This is the first\nresult (to the best of our knowledge) on the convergence property of learning\nalgorithms with continuous action spaces that do not fall in the no-regret\nclass.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2020 06:53:21 GMT"}], "update_date": "2020-09-15", "authors_parsed": [["Shi", "Yuanyuan", ""], ["Zhang", "Baosen", ""]]}, {"id": "2009.06373", "submitter": "Huale Li", "authors": "Huale Li, Xuan Wang, Fengwei Jia, Yifan Li, Yulin Wu, Jiajia Zhang,\n  Shuhan Qi", "title": "RLCFR: Minimize Counterfactual Regret by Deep Reinforcement Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Counterfactual regret minimization (CFR) is a popular method to deal with\ndecision-making problems of two-player zero-sum games with imperfect\ninformation. Unlike existing studies that mostly explore for solving larger\nscale problems or accelerating solution efficiency, we propose a framework,\nRLCFR, which aims at improving the generalization ability of the CFR method. In\nthe RLCFR, the game strategy is solved by the CFR in a reinforcement learning\nframework. And the dynamic procedure of iterative interactive strategy updating\nis modeled as a Markov decision process (MDP). Our method, RLCFR, then learns a\npolicy to select the appropriate way of regret updating in the process of\niteration. In addition, a stepwise reward function is formulated to learn the\naction policy, which is proportional to how well the iteration strategy is at\neach step. Extensive experimental results on various games have shown that the\ngeneralization ability of our method is significantly improved compared with\nexisting state-of-the-art methods.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2020 14:20:33 GMT"}], "update_date": "2020-09-15", "authors_parsed": [["Li", "Huale", ""], ["Wang", "Xuan", ""], ["Jia", "Fengwei", ""], ["Li", "Yifan", ""], ["Wu", "Yulin", ""], ["Zhang", "Jiajia", ""], ["Qi", "Shuhan", ""]]}, {"id": "2009.06394", "submitter": "Jack Geary", "authors": "Jack Geary and Subramanian Ramamoorthy and Henry Gouk", "title": "Resolving Conflict in Decision-Making for Autonomous Driving", "comments": "11 pages, 7 figures. arXiv admin note: text overlap with\n  arXiv:2007.07182", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Recent work on decision making and planning for autonomous driving has made\nuse of game theoretic methods to model interaction between agents. We\ndemonstrate that methods based on the Stackelberg game formulation of this\nproblem are susceptible to an issue that we refer to as conflict. Our results\nshow that when conflict occurs, it causes sub-optimal and potentially dangerous\nbehaviour. In response, we develop a theoretical framework for analysing the\nextent to which such methods are impacted by conflict, and apply this framework\nto several existing approaches modelling interaction between agents. Moreover,\nwe propose Augmented Altruism, a novel approach to modelling interaction\nbetween players in a Stackelberg game, and show that it is less prone to\nconflict than previous techniques. Finally, we investigate the behavioural\nassumptions that underpin our approach by performing experiments with human\nparticipants. The results show that our model explains human decision-making\nbetter than existing game-theoretic models of interactive driving.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2020 21:26:21 GMT"}, {"version": "v2", "created": "Wed, 10 Mar 2021 16:29:49 GMT"}], "update_date": "2021-03-11", "authors_parsed": [["Geary", "Jack", ""], ["Ramamoorthy", "Subramanian", ""], ["Gouk", "Henry", ""]]}, {"id": "2009.06543", "submitter": "Alexandros A. Voudouris", "authors": "Georgios Amanatidis, Georgios Birmpas, Aris Filos-Ratsikas, Alexandros\n  A. Voudouris", "title": "A Few Queries Go a Long Way: Information-Distortion Tradeoffs in\n  Matching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the one-sided matching problem, where n agents have preferences\nover n items, and these preferences are induced by underlying cardinal\nvaluation functions. The goal is to match every agent to a single item so as to\nmaximize the social welfare. Most of the related literature, however, assumes\nthat the values of the agents are not a priori known, and only access to the\nordinal preferences of the agents over the items is provided. Consequently,\nthis incomplete information leads to loss of efficiency, which is measured by\nthe notion of distortion. In this paper, we further assume that the agents can\nanswer a small number of queries, allowing us partial access to their values.\nWe study the interplay between elicited cardinal information (measured by the\nnumber of queries per agent) and distortion for one-sided matching, as well as\na wide range of well-studied related problems. Qualitatively, our results show\nthat with a limited number of queries, it is possible to obtain significant\nimprovements over the classic setting, where only access to ordinal information\nis given.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2020 16:13:10 GMT"}], "update_date": "2020-09-15", "authors_parsed": [["Amanatidis", "Georgios", ""], ["Birmpas", "Georgios", ""], ["Filos-Ratsikas", "Aris", ""], ["Voudouris", "Alexandros A.", ""]]}, {"id": "2009.06790", "submitter": "Julien Grand-Cl\\'ement", "authors": "Julien Grand-Cl\\'ement, Christian Kroer", "title": "First-Order Methods for Wasserstein Distributionally Robust MDP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Markov decision processes (MDPs) are known to be sensitive to parameter\nspecification. Distributionally robust MDPs alleviate this issue by allowing\nfor \\emph{ambiguity sets} which give a set of possible distributions over\nparameter sets. The goal is to find an optimal policy with respect to the\nworst-case parameter distribution. We propose a framework for solving\nDistributionally robust MDPs via first-order methods, and instantiate it for\nseveral types of Wasserstein ambiguity sets. By developing efficient proximal\nupdates, our algorithms achieve a convergence rate of\n$O\\left(NA^{2.5}S^{3.5}\\log(S)\\log(\\epsilon^{-1})\\epsilon^{-1.5} \\right)$ for\nthe number of kernels $N$ in the support of the nominal distribution, states\n$S$, and actions $A$; this rate varies slightly based on the Wasserstein setup.\nOur dependence on $N,A$ and $S$ is significantly better than existing methods,\nwhich have a complexity of $O\\left(N^{3.5}A^{3.5}S^{4.5}\\log^{2}(\\epsilon^{-1})\n\\right)$. Numerical experiments show that our algorithm is significantly more\nscalable than state-of-the-art approaches across several domains.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2020 23:30:10 GMT"}, {"version": "v2", "created": "Mon, 3 May 2021 18:03:09 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Grand-Clément", "Julien", ""], ["Kroer", "Christian", ""]]}, {"id": "2009.06806", "submitter": "David Rey", "authors": "Haoning Xi, Wei Liu, David Rey, S. Travis Waller, Philip Kilby", "title": "Incentive-compatible mechanisms for online resource allocation in\n  mobility-as-a-service systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of `Everything-as-a-Service', the transportation sector has\nbeen evolving towards user-centric business models in which customized services\nand mode-agnostic mobility resources are priced in a unified framework. Yet, in\nthe vast majority of studies on Mobility as a Service (MaaS) systems, mobility\nresource pricing is based on segmented travel modes, e.g. private vehicle,\npublic transit and shared mobility services. This study attempts to address\nthis research gap by introducing innovative auction-based online MaaS\nmechanisms where users can bid for any amount of mode-agnostic mobility\nresources based on their willingness to pay and preferences. We take the\nperspective of a MaaS regulator which aims to maximize social welfare by\nallocating mobility resources to users. We propose two mechanisms which allow\nusers to either pay for the immediate use of mobility service (pay-as-you-go),\nor to subscribe to mobility service packages (pay-as-a-package). We cast the\nproposed auction-based mechanisms as online resource allocation problems where\nusers compete for MaaS resources and bid for travel time per trip. We propose\n(integer-) linear programming formulations to accommodate user bids based on\navailable mobility resources in an online optimization approach. We show that\nthe proposed MaaS mechanisms are incentive-compatible, develop customized\nonline algorithms and derive performance bounds based on competitive analysis.\nExtensive numerical simulations are conducted on large scale instances\ngenerated from realistic mobility data, which highlight the benefits of the\nproposed MaaS mechanisms and the effectiveness of the proposed online\noptimization approaches.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2020 00:52:01 GMT"}, {"version": "v2", "created": "Mon, 29 Mar 2021 03:28:28 GMT"}], "update_date": "2021-03-30", "authors_parsed": [["Xi", "Haoning", ""], ["Liu", "Wei", ""], ["Rey", "David", ""], ["Waller", "S. Travis", ""], ["Kilby", "Philip", ""]]}, {"id": "2009.06831", "submitter": "EPTCS", "authors": "Neil Ghani (University of Strathclyde), Clemens Kupke (University of\n  Strathclyde), Alasdair Lambert (University of Strathclyde), Fredrik Nordvall\n  Forsberg (University of Strathclyde)", "title": "Compositional Game Theory with Mixed Strategies: Probabilistic Open\n  Games Using a Distributive Law", "comments": "In Proceedings ACT 2019, arXiv:2009.06334", "journal-ref": "EPTCS 323, 2020, pp. 95-105", "doi": "10.4204/EPTCS.323.7", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend the open games framework for compositional game theory to encompass\nalso mixed strategies, making essential use of the discrete probability\ndistribution monad. We show that the resulting games form a symmetric monoidal\ncategory, which can be used to compose probabilistic games in parallel and\nsequentially. We also consider morphisms between games, and show that intuitive\nconstructions give rise to functors and adjunctions between pure and\nprobabilistic open games.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2020 02:14:36 GMT"}], "update_date": "2020-09-16", "authors_parsed": [["Ghani", "Neil", "", "University of Strathclyde"], ["Kupke", "Clemens", "", "University of\n  Strathclyde"], ["Lambert", "Alasdair", "", "University of Strathclyde"], ["Forsberg", "Fredrik Nordvall", "", "University of Strathclyde"]]}, {"id": "2009.06856", "submitter": "Anilesh Kollagunta Krishnaswamy", "authors": "Ashish Goel, Anilesh K. Krishnaswamy, Sukolsak Sakshuwong, Tanja\n  Aitamurto", "title": "Knapsack Voting for Participatory Budgeting", "comments": null, "journal-ref": null, "doi": "10.1145/3340230", "report-no": null, "categories": "cs.GT cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the question of aggregating the preferences of voters in the\ncontext of participatory budgeting. We scrutinize the voting method currently\nused in practice, underline its drawbacks, and introduce a novel scheme\ntailored to this setting, which we call \"Knapsack Voting\". We study its\nstrategic properties - we show that it is strategy-proof under a natural model\nof utility (a dis-utility given by the $\\ell_1$ distance between the outcome\nand the true preference of the voter), and \"partially\" strategy-proof under\ngeneral additive utilities. We extend Knapsack Voting to more general settings\nwith revenues, deficits or surpluses, and prove a similar strategy-proofness\nresult. To further demonstrate the applicability of our scheme, we discuss its\nimplementation on the digital voting platform that we have deployed in\npartnership with the local government bodies in many cities across the nation.\nFrom voting data thus collected, we present empirical evidence that Knapsack\nVoting works well in practice.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2020 03:58:03 GMT"}], "update_date": "2020-09-16", "authors_parsed": [["Goel", "Ashish", ""], ["Krishnaswamy", "Anilesh K.", ""], ["Sakshuwong", "Sukolsak", ""], ["Aitamurto", "Tanja", ""]]}, {"id": "2009.06965", "submitter": "Renming Liu", "authors": "Renming Liu (1), Siyu Chen (2), Yu Jiang (1), Ravi Seshadri (3), Moshe\n  E. Ben-Akiva (2), Carlos Lima Azevedo (1) ((1) DTU Management, Technical\n  University of Denmark, Denmark, (2) CEE, Massachusetts Institute of\n  Technology, United States, (3) Singapore-MIT Alliance for Research and\n  Technology, Singapore)", "title": "Managing network congestion with a tradable credit scheme: a trip-based\n  MFD approach", "comments": "44 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study investigates the efficiency and effectiveness of an area-based\ntradable credit scheme (TCS) using the trip-based Macroscopic Fundamental\nDiagram model for the morning commute problem. In the proposed TCS, the\nregulator distributes initial credits to all travelers and designs a\ntime-varying and trip length specific credit tariff. Credits are traded between\ntravelers and the regulator via a credit market, and the credit price is\ndetermined by the demand and supply of credits. The heterogeneity of travelers\nis considered in terms of desired arrival time, trip length and departure-time\nchoice preferences. The TCS is incorporated into a day-to-day modelling\nframework to examine the travelers' learning process, the evolution of network,\nand the properties of the credit market. The existence of an equilibrium\nsolution and the uniqueness of the credit price at the equilibrium state are\nestablished analytically. Furthermore, an open-source simulation framework is\ndeveloped to validate the analytical properties of the proposed TCS and compare\nit with alternative control strategies in terms of mobility, network\nperformance, and social welfare. Bayesian optimization is then adopted to\noptimize the credit toll scheme. The numerical results demonstrate that the\nproposed TCS outperforms the no-control case and matches the performance of the\ntime-of-day pricing strategy, while maintaining revenue-neutral nature.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2020 10:15:23 GMT"}, {"version": "v2", "created": "Mon, 4 Jan 2021 10:25:05 GMT"}], "update_date": "2021-01-05", "authors_parsed": [["Liu", "Renming", ""], ["Chen", "Siyu", ""], ["Jiang", "Yu", ""], ["Seshadri", "Ravi", ""], ["Ben-Akiva", "Moshe E.", ""], ["Azevedo", "Carlos Lima", ""]]}, {"id": "2009.07384", "submitter": "Brian Zhang", "authors": "Brian Hu Zhang, Tuomas Sandholm", "title": "Finding and Certifying (Near-)Optimal Strategies in Black-Box\n  Extensive-Form Games", "comments": "AAAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Often -- for example in war games, strategy video games, and financial\nsimulations -- the game is given to us only as a black-box simulator in which\nwe can play it. In these settings, since the game may have unknown nature\naction distributions (from which we can only obtain samples) and/or be too\nlarge to expand fully, it can be difficult to compute strategies with\nguarantees on exploitability. Recent work \\cite{Zhang20:Small} resulted in a\nnotion of certificate for extensive-form games that allows exploitability\nguarantees while not expanding the full game tree. However, that work assumed\nthat the black box could sample or expand arbitrary nodes of the game tree at\nany time, and that a series of exact game solves (via, for example, linear\nprogramming) can be conducted to compute the certificate. Each of those two\nassumptions severely restricts the practical applicability of that method. In\nthis work, we relax both of the assumptions. We show that high-probability\ncertificates can be obtained with a black box that can do nothing more than\nplay through games, using only a regret minimizer as a subroutine. As a bonus,\nwe obtain an equilibrium-finding algorithm with $\\tilde O(1/\\sqrt{T})$\nconvergence rate in the extensive-form game setting that does not rely on a\nsampling strategy with lower-bounded reach probabilities (which MCCFR assumes).\nWe demonstrate experimentally that, in the black-box setting, our methods are\nable to provide nontrivial exploitability guarantees while expanding only a\nsmall fraction of the game tree.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2020 23:11:14 GMT"}, {"version": "v2", "created": "Wed, 16 Dec 2020 19:06:47 GMT"}, {"version": "v3", "created": "Wed, 17 Mar 2021 04:47:57 GMT"}], "update_date": "2021-03-18", "authors_parsed": [["Zhang", "Brian Hu", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "2009.07475", "submitter": "Lin Gao", "authors": "Zhiyuan Wang, Lin Gao, Tong Wang, Jingjing Luo", "title": "Monetizing Edge Service in Mobile Internet Ecosystem", "comments": "This is an online technical report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In mobile Internet ecosystem, Mobile Users (MUs) purchase wireless data\nservices from Internet Service Provider (ISP) to access to Internet and acquire\nthe interested content services (e.g., online game) from Content Provider (CP).\nThe popularity of intelligent functions (e.g., AI and 3D modeling) increases\nthe computation-intensity of the content services, leading to a growing\ncomputation pressure for the MUs' resource-limited devices. To this end, edge\ncomputing service is emerging as a promising approach to alleviate the MUs'\ncomputation pressure while keeping their quality-of-service, via offloading\nsome computation tasks of MUs to edge (computing) servers deployed at the local\nnetwork edge. Thus, Edge Service Provider (ESP), who deploys the edge servers\nand offers the edge computing service, becomes an upcoming new stakeholder in\nthe ecosystem. In this work, we study the economic interactions of MUs, ISP,\nCP, and ESP in the new ecosystem with edge computing service, where MUs can\nacquire the computation-intensive content services (offered by CP) and offload\nsome computation tasks, together with the necessary raw input data, to edge\nservers (deployed by ESP) through ISP. We first study the MU's Joint Content\nAcquisition and Task Offloading (J-CATO) problem, which aims to maximize his\nlong-term payoff. We derive the off-line solution with crucial insights, based\non which we design an online strategy with provable performance. Then, we study\nthe ESP's edge service monetization problem. We propose a pricing policy that\ncan achieve a constant fraction of the ex-post optimal revenue with an extra\nconstant loss for the ESP. Numerical results show that the edge computing\nservice can stimulate the MUs' content acquisition and improve the payoffs of\nMUs, ISP, and CP.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2020 05:21:04 GMT"}], "update_date": "2020-09-17", "authors_parsed": [["Wang", "Zhiyuan", ""], ["Gao", "Lin", ""], ["Wang", "Tong", ""], ["Luo", "Jingjing", ""]]}, {"id": "2009.07513", "submitter": "Kenji Yasunaga", "authors": "Maiki Fujita and Takeshi Koshiba and Kenji Yasunaga", "title": "Perfectly Secure Message Transmission against Rational Adversaries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Secure Message Transmission (SMT) is a two-party cryptographic protocol by\nwhich the sender can securely and reliably transmit messages to the receiver\nusing multiple channels. An adversary for SMT can corrupt a subset of the\nchannels and make eavesdropping and tampering over the channels. In this work,\nwe introduce a game-theoretic security model for SMT in which adversaries have\nsome preferences for the protocol execution. We define rational \"timid\"\nadversaries who prefer to violate the security requirements, but do not prefer\nthe tampering to be detected. Such adversaries could arise since they may fear\nlosing their corrupted channels for which they needed some cost or risks.\nFirst, we consider the basic setting in which a single adversary attacks the\nprotocol. We show that, even if all but one of the channels are corrupted, we\ncan construct perfect SMT protocols against rational adversaries. In the\ntraditional cryptographic setting, perfect SMT can be constructed only when the\nadversary corrupts a minority of the channels. Our results demonstrate a way of\ncircumventing the cryptographic impossibility results by a game-theoretic\napproach. Next, we study the setting in which all the channels can be corrupted\nby multiple adversaries who do not cooperate. Since we cannot hope for any\nsecurity if a single adversary corrupts all the channels or multiple\nadversaries cooperate maliciously, the scenario can arise from a game-theoretic\nmodel. We present several perfect SMT protocols, including a non-interactive\nprotocol based on the idea of cheater-identifiable secret sharing. We also\nstudy the scenario in which both malicious and rational adversaries exist.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2020 07:22:03 GMT"}, {"version": "v2", "created": "Wed, 2 Dec 2020 00:19:29 GMT"}], "update_date": "2020-12-03", "authors_parsed": [["Fujita", "Maiki", ""], ["Koshiba", "Takeshi", ""], ["Yasunaga", "Kenji", ""]]}, {"id": "2009.07982", "submitter": "Toby Walsh", "authors": "Toby Walsh", "title": "Strategy Proof Mechanisms for Facility Location at Limited Locations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Facility location problems often permit facilities to be located at any\nposition. But what if this is not the case in practice? What if facilities can\nonly be located at particular locations like a highway exit or close to a bus\nstop? We consider here the impact of such constraints on the location of\nfacilities on the performance of strategy proof mechanisms for locating\nfacilities.We study four different performance objectives: the total distance\nagents must travel to their closest facility, the maximum distance any agent\nmust travel to their closest facility, and the utilitarian and egalitarian\nwelfare.We show that constraining facilities to a limited set of locations\nmakes all four objectives harder to approximate in general.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2020 00:22:34 GMT"}, {"version": "v2", "created": "Wed, 21 Jul 2021 01:42:01 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Walsh", "Toby", ""]]}, {"id": "2009.07983", "submitter": "Toby Walsh", "authors": "Toby Walsh", "title": "Strategy Proof Mechanisms for Facility Location in Euclidean and\n  Manhattan Space", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the impact on mechanisms for facility location of moving from one\ndimension to two (or more) dimensions and Euclidean or Manhattan distances. We\nconsider three fundamental axiomatic properties: anonymity which is a basic\nfairness property, Pareto optimality which is one of the most important\nefficiency properties, and strategy proofness which ensures agents do not have\nan incentive to mis-report. We also consider how well such mechanisms can\napproximate the optimal welfare. Our results are somewhat negative. Moving from\none dimension to two (or more) dimensions often makes these axiomatic\nproperties more difficult to achieve. For example, with two facilities in\nEuclidean space or with just a single facility in Manhattan space, no mechanism\nis anonymous, Pareto optimal and strategy proof. By contrast, mechanisms on the\nline exist with all three properties.We also show that approximation ratios may\nincrease when moving to two (or more) dimensions. All our impossibility results\nare minimal. If we drop one of the three axioms (anonymity, Pareto optimality\nor strategy proofness) multiple mechanisms satisfy the other two axioms.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2020 00:25:55 GMT"}], "update_date": "2020-09-18", "authors_parsed": [["Walsh", "Toby", ""]]}, {"id": "2009.07984", "submitter": "Xiao-Yong Yan", "authors": "Hao Wang, Xiao-Yong Yan, Jinshan Wu", "title": "Free utility model for explaining the social gravity law", "comments": "9 pages, 2 figures", "journal-ref": "Journal of Statistical Mechanics: Theory and Experiment, 2021:\n  033418", "doi": "10.1088/1742-5468/abee18", "report-no": null, "categories": "physics.soc-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social gravity law widely exists in human travel, population migration,\ncommodity trade, information communication, scientific collaboration and so on.\nWhy is there such a simple law in many complex social systems is an interesting\nquestion. Although scientists from fields of statistical physics, complex\nsystems, economics and transportation science have explained the social gravity\nlaw, a theoretical explanation including two dominant mechanisms, namely\nindividual interaction and bounded rationality, is still lacking. Here we\npresent a free utility model, whose objective function is mathematically\nconsistent with the Helmholtz free energy in physics, from the perspective of\nindividual choice behavior to explain the social gravity law. The basic\nassumption is that bounded rational individuals interacting with each other\nwill trade off the expected utility and information-processing cost to maximize\ntheir own utility. The previous explanations of the social gravity law\nincluding the maximum entropy model, the free cost model, the Logit model and\nthe destination choice game model are all special cases under our model.\nFurther, we extend the free utility model to the network. This model not only\nhelps us to better understand the underlying mechanisms of spatial interaction\npatterns in complex social systems, but also provides a new perspective for\nunderstanding the potential function in game theory and the user equilibrium\nmodel in transportation science.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2020 00:28:46 GMT"}, {"version": "v2", "created": "Thu, 18 Feb 2021 08:55:43 GMT"}], "update_date": "2021-04-01", "authors_parsed": [["Wang", "Hao", ""], ["Yan", "Xiao-Yong", ""], ["Wu", "Jinshan", ""]]}, {"id": "2009.07986", "submitter": "Toby Walsh", "authors": "Toby Walsh", "title": "Strategy Proof Mechanisms for Facility Location with Capacity Limits", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important feature of many real world facility location problems are\ncapacity limits on the facilities. We show here how capacity constraints make\nit harder to design strategy proof mechanisms for facility location, but\ncounter-intuitively can improve the guarantees on how well we can approximate\nthe optimal solution.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2020 00:29:15 GMT"}], "update_date": "2020-09-18", "authors_parsed": [["Walsh", "Toby", ""]]}, {"id": "2009.08575", "submitter": "Scott Kominers", "authors": "Daniel M. Kane, Scott Duke Kominers", "title": "Prisoners, Rooms, and Lightswitches", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DM cs.GT math.CO math.HO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine a new variant of the classic prisoners and lightswitches puzzle: A\nwarden leads his $n$ prisoners in and out of $r$ rooms, one at a time, in some\norder, with each prisoner eventually visiting every room an arbitrarily large\nnumber of times. The rooms are indistinguishable, except that each one has $s$\nlightswitches; the prisoners win their freedom if at some point a prisoner can\ncorrectly declare that each prisoner has been in every room at least once. What\nis the minimum number of switches per room, $s$, such that the prisoners can\nmanage this? We show that if the prisoners do not know the switches' starting\nconfiguration, then they have no chance of escape -- but if the prisoners do\nknow the starting configuration, then the minimum sufficient $s$ is\nsurprisingly small. The analysis gives rise to a number of puzzling open\nquestions, as well.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2020 01:05:22 GMT"}], "update_date": "2020-09-21", "authors_parsed": [["Kane", "Daniel M.", ""], ["Kominers", "Scott Duke", ""]]}, {"id": "2009.08632", "submitter": "Sid Chi-Kin Chau", "authors": "Sid Chi-Kin Chau, Khaled Elbassioni and Yue Zhou", "title": "Approximately Socially-Optimal Decentralized Coalition Formation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coalition formation is a central part of social interactions. In the emerging\nera of social peer-to-peer interactions (e.g., sharing economy), coalition\nformation will be often carried out in a decentralized manner, based on\nparticipants' individual preferences. A likely outcome will be a stable\ncoalition structure, where no group of participants could cooperatively opt out\nto form another coalition that induces higher preferences to all its members.\nRemarkably, there exist a number of fair cost-sharing mechanisms (e.g.,\nequal-split, proportional-split, egalitarian and Nash bargaining solutions of\nbargaining games) that model practical cost-sharing applications with desirable\nproperties, such as the existence of a stable coalition structure with a small\nstrong price-of-anarchy (SPoA) to approximate the social optimum. In this\npaper, we close several gaps on the previous results of decentralized coalition\nformation: (1) We establish a logarithmic lower bound on SPoA, and hence, show\nseveral previously known fair cost-sharing mechanisms are the best practical\nmechanisms with minimal SPoA. (2) We improve the SPoA of egalitarian and Nash\nbargaining cost-sharing mechanisms to match the lower bound. (3) We derive the\nSPoA of a mix of different cost-sharing mechanisms. (4) We present a\ndecentralized algorithm to form a stable coalition structure. (5) Finally, we\napply our results to a novel application of peer-to-peer energy sharing that\nallows households to jointly utilize mutual energy resources. We also present\nand analyze an empirical study of decentralized coalition formation in a\nreal-world P2P energy sharing project.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2020 05:22:11 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2021 01:23:27 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Chau", "Sid Chi-Kin", ""], ["Elbassioni", "Khaled", ""], ["Zhou", "Yue", ""]]}, {"id": "2009.09259", "submitter": "Shengjun Pan", "authors": "Shengjun Pan, Brendan Kitts, Tian Zhou, Hao He, Bharatbhushan Shetty,\n  Aaron Flores, Djordje Gligorijevic, Junwei Pan, Tingyu Mao, San Gultekin and\n  Jianlong Zhang", "title": "Bid Shading by Win-Rate Estimation and Surplus Maximization", "comments": "AdKDD 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IR cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a new win-rate based bid shading algorithm (WR) that\ndoes not rely on the minimum-bid-to-win feedback from a Sell-Side Platform\n(SSP). The method uses a modified logistic regression to predict the profit\nfrom each possible shaded bid price. The function form allows fast maximization\nat run-time, a key requirement for Real-Time Bidding (RTB) systems. We report\nproduction results from this method along with several other algorithms. We\nfound that bid shading, in general, can deliver significant value to\nadvertisers, reducing price per impression to about 55% of the unshaded cost.\nFurther, the particular approach described in this paper captures 7% more\nprofit for advertisers, than do benchmark methods of just bidding the most\nprobable winning price. We also report 4.3% higher surplus than an industry\nSell-Side Platform shading service. Furthermore, we observed 3% - 7% lower\neCPM, eCPC and eCPA when the algorithm was integrated with budget controllers.\nWe attribute the gains above as being mainly due to the explicit maximization\nof the surplus function, and note that other algorithms can take advantage of\nthis same approach.\n", "versions": [{"version": "v1", "created": "Sat, 19 Sep 2020 15:46:54 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Pan", "Shengjun", ""], ["Kitts", "Brendan", ""], ["Zhou", "Tian", ""], ["He", "Hao", ""], ["Shetty", "Bharatbhushan", ""], ["Flores", "Aaron", ""], ["Gligorijevic", "Djordje", ""], ["Pan", "Junwei", ""], ["Mao", "Tingyu", ""], ["Gultekin", "San", ""], ["Zhang", "Jianlong", ""]]}, {"id": "2009.09336", "submitter": "Benjamin Plaut", "authors": "Sreenivas Gollapudi, Kostas Kollias, Benjamin Plaut", "title": "Almost Envy-free Repeated Matching in Two-sided Markets", "comments": "Accepted to WINE 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A two-sided market consists of two sets of agents, each of whom have\npreferences over the other (Airbnb, Upwork, Lyft, Uber, etc.). We propose and\nanalyze a repeated matching problem, where some set of matches occur on each\ntime step, and our goal is to ensure fairness with respect to the cumulative\nallocations over an infinite time horizon. Our main result is a polynomial-time\nalgorithm for additive, symmetric (v_i(j) = v_j(i)), and binary (v_i(j) \\in\n\\{a,1\\}) valuations that both (1) guarantees \"envy-freeness up to a single\nmatch\" (EF1) and (2) selects a maximum weight matching on each time step. Thus\nfor this class of valuations, fairness can be achieved without sacrificing\neconomic efficiency. This result holds even for \"dynamic valuations\", i.e.,\nvaluations that change over time. Although symmetry is a strong assumption, we\nshow that this result cannot be extended to asymmetric binary valuations: (1)\nand (2) together are impossible even when valuations do not change over time,\nand for dynamic valuations, even (1) alone is impossible. To our knowledge,\nthis is the first analysis of envy-freeness in a repeated matching setting.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2020 02:25:14 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Gollapudi", "Sreenivas", ""], ["Kollias", "Kostas", ""], ["Plaut", "Benjamin", ""]]}, {"id": "2009.09351", "submitter": "Benjamin Plaut", "authors": "Ashish Goel and Benjamin Plaut", "title": "Counteracting Inequality in Markets via Convex Pricing", "comments": "Accepted to WINE 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study market mechanisms for allocating divisible goods to competing agents\nwith quasilinear utilities. For \\emph{linear} pricing (i.e., the cost of a good\nis proportional to the quantity purchased), the First Welfare Theorem states\nthat Walrasian equilibria maximize the sum of agent valuations. This ensures\nefficiency, but can lead to extreme inequality across individuals. Many\nreal-world markets -- especially for water -- use \\emph{convex} pricing\ninstead, often known as increasing block tariffs (IBTs). IBTs are thought to\npromote equality, but there is a dearth of theoretical support for this claim.\n  In this paper, we study a simple convex pricing rule and show that the\nresulting equilibria are guaranteed to maximize a CES welfare function.\nFurthermore, a parameter of the pricing rule directly determines which CES\nwelfare function is implemented; by tweaking this parameter, the social planner\ncan precisely control the tradeoff between equality and efficiency. Our result\nholds for any valuations that are homogeneous, differentiable, and concave. We\nalso give an iterative algorithm for computing these pricing rules, derive a\ntruthful mechanism for the case of a single good, and discuss Sybil attacks.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2020 05:10:01 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Goel", "Ashish", ""], ["Plaut", "Benjamin", ""]]}, {"id": "2009.09352", "submitter": "Dong Xu", "authors": "Dong Xu, Chao Meng, Qingpeng Zhang, Puneet Bhardwaj, Young-Jun Son", "title": "A Hybrid Simulation-based Duopoly Game Framework for Analysis of Supply\n  Chain and Marketing Activities", "comments": "39 pages, 10 figures, 9 tables", "journal-ref": "In chapter 11 of book \"Applications of Multi-Criteria and Game\n  Theory Approaches\" published by Springer-Verlag and edited by L. Benyoucef et\n  al. (eds.), 2013", "doi": "10.1007/978-1-4471-5295-8", "report-no": null, "categories": "cs.GT cs.SY eess.SY stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A hybrid simulation-based framework involving system dynamics and agent-based\nsimulation is proposed to address duopoly game considering multiple strategic\ndecision variables and rich payoff, which cannot be addressed by traditional\napproaches involving closed-form equations. While system dynamics models are\nused to represent integrated production, logistics, and pricing determination\nactivities of duopoly companies, agent-based simulation is used to mimic\nenhanced consumer purchasing behavior considering advertisement, promotion\neffect, and acquaintance recommendation in the consumer social network. The\npayoff function of the duopoly companies is assumed to be the net profit based\non the total revenue and various cost items such as raw material, production,\ntransportation, inventory and backorder. A unique procedure is proposed to\nsolve and analyze the proposed simulation-based game, where the procedural\ncomponents include strategy refinement, data sampling, gaming solving, and\nperformance evaluation. First, design of experiment and estimated\nconformational value of information techniques are employed for strategy\nrefinement and data sampling, respectively. Game solving then focuses on pure\nstrategy equilibriums, and performance evaluation addresses game stability,\nequilibrium strictness, and robustness. A hypothetical case scenario involving\nsoft-drink duopoly on Coke and Pepsi is considered to illustrate and\ndemonstrate the proposed approach. Final results include P-values of\nstatistical tests, confidence intervals, and simulation steady state analysis\nfor different pure equilibriums.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2020 05:18:44 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Xu", "Dong", ""], ["Meng", "Chao", ""], ["Zhang", "Qingpeng", ""], ["Bhardwaj", "Puneet", ""], ["Son", "Young-Jun", ""]]}, {"id": "2009.09360", "submitter": "EPTCS", "authors": "Jean-Francois Raskin (Universit\\'e Libre de Bruxelles), Davide\n  Bresolin (Universit\\`a di Padova)", "title": "Proceedings 11th International Symposium on Games, Automata, Logics, and\n  Formal Verification", "comments": null, "journal-ref": "EPTCS 326, 2020", "doi": "10.4204/EPTCS.326", "report-no": null, "categories": "cs.LO cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 11th International Symposium on\nGames, Automata, Logic and Formal Verification (GandALF 2020). The symposium\ntook place as a fully online event on September 21-22, 2020. The GandALF\nsymposium was established by a group of Italian computer scientists interested\nin mathematical logic, automata theory, game theory, and their applications to\nthe specification, design, and verification of complex systems. Its aim is to\nprovide a forum where people from different areas, and possibly with different\nbackgrounds, can fruitfully interact. GandALF has a truly international spirit,\nas witnessed by the composition of the program and steering committee and by\nthe country distribution of the submitted papers.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2020 06:06:52 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Raskin", "Jean-Francois", "", "Université Libre de Bruxelles"], ["Bresolin", "Davide", "", "Università di Padova"]]}, {"id": "2009.09508", "submitter": "Pranav Garimidi", "authors": "Artem Baklanov, Pranav Garimidi, Vasilis Gkatzelis, Daniel Schoepflin", "title": "Achieving Proportionality up to the Maximin Item with Indivisible Goods", "comments": "Changes to wording throughout and changes to framing of section 8", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of fairly allocating indivisible goods and focus on the\nclassic fairness notion of proportionality. The indivisibility of the goods is\nlong known to pose highly non-trivial obstacles to achieving fairness, and a\nvery vibrant line of research has aimed to circumvent them using appropriate\nnotions of approximate fairness. Recent work has established that even\napproximate versions of proportionality (PROPx) may be impossible to achieve\neven for small instances, while the best known achievable approximations\n(PROP1) are much weaker. We introduce the notion of proportionality up to the\nmaximin item (PROPm) and show how to reach an allocation satisfying this notion\nfor any instance involving up to five agents with additive valuations. PROPm\nprovides a well-motivated middle-ground between PROP1 and PROPx, while also\ncapturing some elements of the well-studied maximin share (MMS) benchmark:\nanother relaxation of proportionality that has attracted a lot of attention.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2020 19:21:19 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2020 16:32:34 GMT"}, {"version": "v3", "created": "Thu, 14 Jan 2021 17:31:04 GMT"}], "update_date": "2021-01-15", "authors_parsed": [["Baklanov", "Artem", ""], ["Garimidi", "Pranav", ""], ["Gkatzelis", "Vasilis", ""], ["Schoepflin", "Daniel", ""]]}, {"id": "2009.09887", "submitter": "Wei Wang Dr.", "authors": "Mengnian Xu, Yanjiao Chen, Wei Wang", "title": "A Two-stage Game Framework to Secure Transmission in Two-Tier UAV\n  Networks", "comments": "to be appear in IEEE Transactions on Vehicular Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multi-UAV network is promising to extend conventional networks by\nproviding broader coverage and better reliability. Nevertheless, the broadcast\nnature of wireless signals and the broader coverage expose multi-UAV\ncommunications to the threats of passive eavesdroppers. Recent studies mainly\nfocus on securing a single legitimate link, or communications between a UAV and\nmultiple ground users in one/two-UAV-aided networks, while the physical layer\nsecrecy analysis for hierarchical multi-UAV networks is underexplored. In this\npaper, we investigate a general two-tier UAV network consisting of multiple UAV\ntransmitters (UTs) and multiple UAV receivers (URs) in the presence of multiple\nUAV eavesdroppers (UEs). To protect all legitimate UT-UR links against UEs at\nthe physical layer, we design a two-stage framework consisting of a UT-UR\nassociation stage and a cooperative transmission stage. Specifically, we\nformulate the secure transmission problem into a many-to-one matching game\nfollowed by an overlapping coalition formation (OCF) game, taking into account\nthe limited capabilities and the throughput requirements of URs, as well as the\ntransmission power constraints of UTs. A matching algorithm and an OCF\nalgorithm are proposed to solve these two sequential games whose convergences\nand stabilities are guaranteed theoretically. Simulation results show the\nsuperiority of our algorithms and the effectiveness of our two-stage game\nframework in the terms of secrecy performance.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 14:09:18 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Xu", "Mengnian", ""], ["Chen", "Yanjiao", ""], ["Wang", "Wei", ""]]}, {"id": "2009.09946", "submitter": "Giacomo Como", "authors": "Giacomo Como, St\\'ephane Durand, and Fabio Fagnani", "title": "Optimal Targeting in Super-Modular Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA cs.SY eess.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an optimal targeting problem for super-modular games with binary\nactions and finitely many players. The considered problem consists in the\nselection of a subset of players of minimum size such that, when the actions of\nthese players are forced to a controlled value while the others are left to\nrepeatedly play a best response action, the system will converge to the\ngreatest Nash equilibrium of the game. Our main contributions consist in\nshowing that the problem is NP-complete and in proposing an efficient iterative\nalgorithm with provable convergence properties for its solution. We discuss in\ndetail the special case of network coordination games and its relation with the\nnotion of cohesiveness. Finally, we show with simulations the strength of our\napproach with respect to naive heuristics based on classical network centrality\nmeasures.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 15:12:27 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Como", "Giacomo", ""], ["Durand", "Stéphane", ""], ["Fagnani", "Fabio", ""]]}, {"id": "2009.09990", "submitter": "Adam Sawyer", "authors": "Adam Sawyer and Seth Frey", "title": "Super-teams or fair leagues? Parity policies by powerful regulators\n  don't prevent capture", "comments": "20 pages, 2 tables, 3 figures, 1 supplementary figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.GT cs.SI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Much of modern society is founded on orchestrating institutions that produce\nsocial goods by fostering motivated teams, pitting them against each other, and\ndistributing the fruits of the arms races that ensue. However, even when the\n\"market maker\" is willing and able to maintain parity between teams, it may\nfail to maintain a level playing field, as some teams acquire enough advantage\nwithin the system to gain influence over it and institutionalize their\nadvantage. Using outcomes of over 60,000 games from four professional\nbasketball leagues and more than 100 years' worth of seasons, we compute the\nevolving rate of transitivity violations (A>B, B>C, but C>A) to measure the\nability of leagues to maintain parity between teams, and support the efficient\ngeneration and distribution of innovation. Comparing against a baseline of\nrandomly permuted outcomes, we find that basketball has become less competitive\nover time, suggesting that teams diverge in performance, and reflecting a\npossible failure of market makers to tame their overpowered teams. Our results\nsuggest that rich-get-richer dynamics are so pernicious that they can even\nemerge under the watch of a powerful administrator that is motivated to prevent\nthem.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 16:14:52 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2020 03:02:40 GMT"}], "update_date": "2020-09-23", "authors_parsed": [["Sawyer", "Adam", ""], ["Frey", "Seth", ""]]}, {"id": "2009.10009", "submitter": "Arnaud Cadas", "authors": "Arnaud Cadas, Josu Doncel, Jean-Michel Fourneau, Ana Bu\\v{s}i\\'c", "title": "Flexibility can hurt dynamic matching system performance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.PR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We study the performance of general dynamic matching models. This model is\ndefined by a connected graph, where nodes represent the class of items and the\nedges the compatibilities between items. Items of different classes arrive one\nby one to the system according to a given probability distribution. Upon\narrival, an item is matched with a compatible item according to the First Come\nFirst Served discipline and leave the system immediately, whereas it is\nenqueued with other items of the same class, if any. We show that such a model\nmay exhibit a non intuitive behavior: increasing the services ability by adding\nnew edges in the matching graph may lead to a larger average population. This\nis similar to a Braess paradox. We first consider a quasicomplete graph with\nfour nodes and we provide values of the probability distribution of the\narrivals such that when we add an edge the mean number of items is larger.\nThen, we consider an arbitrary matching graph and we show sufficient conditions\nfor the existence or non-existence of this paradox. We conclude that the analog\nto the Braess paradox in matching models is given when specific independent\nsets are in saturation, i.e., the system is close to the stability condition.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 16:33:19 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Cadas", "Arnaud", ""], ["Doncel", "Josu", ""], ["Fourneau", "Jean-Michel", ""], ["Bušić", "Ana", ""]]}, {"id": "2009.10020", "submitter": "Lorenzo Zino", "authors": "Giacomo Como, Fabio Fagnani, Lorenzo Zino", "title": "Imitation dynamics in population games on community networks", "comments": "12 pages, 5 figures. Under review", "journal-ref": null, "doi": "10.1109/TCNS.2020.3032873", "report-no": null, "categories": "eess.SY cs.GT cs.SY math.DS math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the asymptotic behavior of deterministic, continuous-time imitation\ndynamics for population games over networks. The basic assumption of this\nlearning mechanism -- encompassing the replicator dynamics -- is that players\nbelonging to a single population exchange information through pairwise\ninteractions, whereby they get aware of the actions played by the other players\nand the corresponding rewards. Using this information, they can revise their\ncurrent action, imitating the one of the players they interact with. The\npattern of interactions regulating the learning process is determined by a\ncommunity structure. First, the set of equilibrium points of such network\nimitation dynamics is characterized. Second, for the class of potential games\nand for undirected and connected community networks, global asymptotic\nconvergence is proved. In particular, our results guarantee convergence to a\nNash equilibrium from every fully supported initial population state in the\nspecial case when the Nash equilibria are isolated and fully supported.\nExamples and numerical simulations are offered to validate the theoretical\nresults and counterexamples are discussed for scenarios when the assumptions on\nthe community structure are not verified.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 16:54:12 GMT"}], "update_date": "2020-10-23", "authors_parsed": [["Como", "Giacomo", ""], ["Fagnani", "Fabio", ""], ["Zino", "Lorenzo", ""]]}, {"id": "2009.10033", "submitter": "Atrisha Sarkar", "authors": "Atrisha Sarkar, Krzysztof Czarnecki", "title": "Solution Concepts in Hierarchical Games under Bounded Rationality with\n  Applications to Autonomous Driving", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.MA cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With autonomous vehicles (AV) set to integrate further into regular human\ntraffic, there is an increasing consensus of treating AV motion planning as a\nmulti-agent problem. However, the traditional game theoretic assumption of\ncomplete rationality is too strong for the purpose of human driving, and there\nis a need for understanding human driving as a \\emph{bounded rational} activity\nthrough a behavioral game theoretic lens. To that end, we adapt three\nmetamodels of bounded rational behavior; two based on Quantal level-k and one\nbased on Nash equilibrium with quantal errors. We formalize the different\nsolution concepts that can be applied in the context of hierarchical games, a\nframework used in multi-agent motion planning, for the purpose of creating game\ntheoretic models of driving behavior. Furthermore, based on a contributed\ndataset of human driving at a busy urban intersection with a total of ~4k\nagents and ~44k decision points, we evaluate the behavior models on the basis\nof model fit to naturalistic data, as well as their predictive capacity. Our\nresults suggest that among the behavior models evaluated, modeling driving\nbehavior as pure strategy NE with quantal errors at the level of maneuvers with\nbounds sampling of actions at the level of trajectories provides the best fit\nto naturalistic driving behavior, and there is a significant impact of\nsituational factors on the performance of behavior models.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 17:13:50 GMT"}, {"version": "v2", "created": "Wed, 16 Dec 2020 20:00:54 GMT"}, {"version": "v3", "created": "Mon, 21 Dec 2020 17:10:49 GMT"}, {"version": "v4", "created": "Thu, 21 Jan 2021 17:49:20 GMT"}], "update_date": "2021-01-22", "authors_parsed": [["Sarkar", "Atrisha", ""], ["Czarnecki", "Krzysztof", ""]]}, {"id": "2009.10060", "submitter": "Benjamin Harsha", "authors": "Wenjie Bai, Jeremiah Blocki, Ben Harsha", "title": "Information Signaling: A Counter-Intuitive Defense Against Password\n  Cracking", "comments": "17 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce password strength information signaling as a novel, yet\ncounter-intuitive, defense mechanism against password cracking attacks. Recent\nbreaches have exposed billions of user passwords to the dangerous threat of\noffline password cracking attacks. An offline attacker can quickly check\nmillions (or sometimes billions/trillions) of password guesses by comparing\ntheir hash value with the stolen hash from a breached authentication server.\nThe attacker is limited only by the resources he is willing to invest. Our key\nidea is to have the authentication server store a (noisy) signal about the\nstrength of each user password for an offline attacker to find. Surprisingly,\nwe show that the noise distribution for the signal can often be tuned so that a\nrational (profit-maximizing) attacker will crack fewer passwords. The signaling\nscheme exploits the fact that password cracking is not a zero-sum game i.e.,\nthe attacker's profit is given by the value of the cracked passwords minus the\ntotal guessing cost. Thus, a well-defined signaling strategy will encourage the\nattacker to reduce his guessing costs by cracking fewer passwords. We use an\nevolutionary algorithm to compute the optimal signaling scheme for the\ndefender. As a proof-of-concept, we evaluate our mechanism on several password\ndatasets and show that it can reduce the total number of cracked passwords by\nup to $12\\%$ (resp. $5\\%$) of all users in defending against offline (resp.\nonline) attacks.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 17:51:46 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2020 02:50:14 GMT"}, {"version": "v3", "created": "Mon, 8 Mar 2021 20:43:41 GMT"}], "update_date": "2021-03-10", "authors_parsed": [["Bai", "Wenjie", ""], ["Blocki", "Jeremiah", ""], ["Harsha", "Ben", ""]]}, {"id": "2009.10061", "submitter": "Gabriele Farina", "authors": "Gabriele Farina and Andrea Celli and Nicola Gatti and Tuomas Sandholm", "title": "Faster Algorithms for Optimal Ex-Ante Coordinated Collusive Strategies\n  in Extensive-Form Zero-Sum Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We focus on the problem of finding an optimal strategy for a team of two\nplayers that faces an opponent in an imperfect-information zero-sum\nextensive-form game. Team members are not allowed to communicate during play\nbut can coordinate before the game. In that setting, it is known that the best\nthe team can do is sample a profile of potentially randomized strategies (one\nper player) from a joint (a.k.a. correlated) probability distribution at the\nbeginning of the game. In this paper, we first provide new modeling results\nabout computing such an optimal distribution by drawing a connection to a\ndifferent literature on extensive-form correlation. Second, we provide an\nalgorithm that computes such an optimal distribution by only using profiles\nwhere only one of the team members gets to randomize in each profile. We can\nalso cap the number of such profiles we allow in the solution. This begets an\nanytime algorithm by increasing the cap. We find that often a handful of\nwell-chosen such profiles suffices to reach optimal utility for the team. This\nenables team members to reach coordination through a relatively simple and\nunderstandable plan. Finally, inspired by this observation and leveraging\ntheoretical concepts that we introduce, we develop an efficient\ncolumn-generation algorithm for finding an optimal distribution for the team.\nWe evaluate it on a suite of common benchmark games. It is three orders of\nmagnitude faster than the prior state of the art on games that the latter can\nsolve and it can also solve several games that were previously unsolvable.\n", "versions": [{"version": "v1", "created": "Mon, 21 Sep 2020 17:51:57 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Farina", "Gabriele", ""], ["Celli", "Andrea", ""], ["Gatti", "Nicola", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "2009.10269", "submitter": "Tra Le Ms", "authors": "Tra Huong Thi Le, Nguyen H. Tran, Yan Kyaw Tun, Minh N. H. Nguyen,\n  Shashi Raj Pandey, Zhu Han, and Choong Seon Hong", "title": "An Incentive Mechanism for Federated Learning in Wireless Cellular\n  network: An Auction Approach", "comments": null, "journal-ref": "Paper-TW-Apr-20-0557(2020)", "doi": null, "report-no": null, "categories": "cs.LG cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Federated Learning (FL) is a distributed learning framework that can deal\nwith the distributed issue in machine learning and still guarantee high\nlearning performance. However, it is impractical that all users will sacrifice\ntheir resources to join the FL algorithm. This motivates us to study the\nincentive mechanism design for FL. In this paper, we consider a FL system that\ninvolves one base station (BS) and multiple mobile users. The mobile users use\ntheir own data to train the local machine learning model, and then send the\ntrained models to the BS, which generates the initial model, collects local\nmodels and constructs the global model. Then, we formulate the incentive\nmechanism between the BS and mobile users as an auction game where the BS is an\nauctioneer and the mobile users are the sellers. In the proposed game, each\nmobile user submits its bids according to the minimal energy cost that the\nmobile users experiences in participating in FL. To decide winners in the\nauction and maximize social welfare, we propose the primal-dual greedy auction\nmechanism. The proposed mechanism can guarantee three economic properties,\nnamely, truthfulness, individual rationality and efficiency. Finally, numerical\nresults are shown to demonstrate the performance effectiveness of our proposed\nmechanism.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2020 01:50:39 GMT"}], "update_date": "2020-09-23", "authors_parsed": [["Le", "Tra Huong Thi", ""], ["Tran", "Nguyen H.", ""], ["Tun", "Yan Kyaw", ""], ["Nguyen", "Minh N. H.", ""], ["Pandey", "Shashi Raj", ""], ["Han", "Zhu", ""], ["Hong", "Choong Seon", ""]]}, {"id": "2009.10320", "submitter": "Jugal Garg", "authors": "Jugal Garg, Thorben Tr\\\"obst, Vijay V. Vazirani", "title": "One-Sided Matching Markets with Endowments: Equilibria and Algorithms", "comments": "30 pages, 2 figures, added new results", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Arrow-Debreu extension of the classic Hylland-Zeckhauser scheme for a\none-sided matching market -- called ADHZ in this paper -- has natural\napplications but has instances which do not admit equilibria. By introducing\napproximation, we define the $\\epsilon$-approximate ADHZ model, and we give the\nfollowing results.\n  * Existence of equilibrium under linear utility functions. We prove that the\nequilibrium satisfies Pareto optimality, approximate envy-freeness, and\napproximate weak core stability.\n  * A combinatorial polynomial-time algorithm for an $\\epsilon$-approximate\nADHZ equilibrium for the case of dichotomous, and more generally bi-valued,\nutilities.\n  * An instance of ADHZ, with dichotomous utilities and a strongly connected\ndemand graph, which does not admit an equilibrium.\n  Since computing an equilibrium for HZ is likely to be highly intractable and\nbecause of the difficulty of extending HZ to more general utility functions,\nHosseini and Vazirani proposed (a rich collection of) Nash-bargaining-based\nmatching market models. For the dichotomous-utilities case of their model\nlinear Arrow-Debreu Nash bargaining one-sided matching market (1LAD), we give a\ncombinatorial, strongly polynomial-time algorithm and show that it admits a\nrational convex program.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2020 05:06:43 GMT"}, {"version": "v2", "created": "Mon, 28 Sep 2020 05:55:29 GMT"}, {"version": "v3", "created": "Tue, 20 Jul 2021 21:31:01 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Garg", "Jugal", ""], ["Tröbst", "Thorben", ""], ["Vazirani", "Vijay V.", ""]]}, {"id": "2009.10749", "submitter": "Jakob Weissteiner", "authors": "Jakob Weissteiner, Chris Wendler, Sven Seuken, Ben Lubin, Markus\n  P\\\"uschel", "title": "Fourier Analysis-based Iterative Combinatorial Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances in Fourier analysis have brought new tools to efficiently\nrepresent and learn set functions. In this paper, we bring the power of Fourier\nanalysis to the design of iterative combinatorial auctions. The key idea is to\napproximate the bidders' value functions using Fourier-sparse set functions,\nwhich can be computed using a relatively small number of queries. Since this\nnumber is still too large for real-world auctions, we propose a novel hybrid\nauction design: we first use neural networks to learn bidders' values and then\napply Fourier analysis to those learned representations. On a technical level,\nwe formulate a Fourier transform-based winner determination problem and derive\nits mixed integer program formulation. Based on this, we devise an iterative\nmechanism that asks Fourier-based queries. Our experimental evaluation shows\nthat our hybrid auction leads to a fairer distribution of social welfare among\nbidders and significantly reduces runtime, while matching the economic\nefficiency of state-of-the-art auction designs. With this paper, we are the\nfirst to leverage Fourier analysis in combinatorial auction design and lay the\nfoundation for future work in this area.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2020 18:09:47 GMT"}], "update_date": "2020-09-24", "authors_parsed": [["Weissteiner", "Jakob", ""], ["Wendler", "Chris", ""], ["Seuken", "Sven", ""], ["Lubin", "Ben", ""], ["Püschel", "Markus", ""]]}, {"id": "2009.10882", "submitter": "EPTCS", "authors": "Jan K\\v{r}et\\'insk\\'y, Emanuel Ramneantu, Alexander Slivinskiy,\n  Maximilian Weininger (Technical University of Munich)", "title": "Comparison of Algorithms for Simple Stochastic Games", "comments": "In Proceedings GandALF 2020, arXiv:2009.09360", "journal-ref": "EPTCS 326, 2020, pp. 131-148", "doi": "10.4204/EPTCS.326.9", "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simple stochastic games are turn-based 2.5-player zero-sum graph games with a\nreachability objective. The problem is to compute the winning probability as\nwell as the optimal strategies of both players. In this paper, we compare the\nthree known classes of algorithms -- value iteration, strategy iteration and\nquadratic programming -- both theoretically and practically. Further, we\nsuggest several improvements for all algorithms, including the first approach\nbased on quadratic programming that avoids transforming the stochastic game to\na stopping one. Our extensive experiments show that these improvements can lead\nto significant speed-ups. We implemented all algorithms in PRISM-games 3.0,\nthereby providing the first implementation of quadratic programming for solving\nsimple stochastic games.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2020 01:26:10 GMT"}], "update_date": "2020-09-24", "authors_parsed": [["Křetínský", "Jan", "", "Technical University of Munich"], ["Ramneantu", "Emanuel", "", "Technical University of Munich"], ["Slivinskiy", "Alexander", "", "Technical University of Munich"], ["Weininger", "Maximilian", "", "Technical University of Munich"]]}, {"id": "2009.10988", "submitter": "Pascal Lenzner", "authors": "Davide Bil\\`o, Tobias Friedrich, Pascal Lenzner, Anna Melnichenko,\n  Louise Molitor", "title": "Fair Tree Connection Games with Topology-Dependent Edge Cost", "comments": "Accepted at FSTTCS 2020, full version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How do rational agents self-organize when trying to connect to a common\ntarget? We study this question with a simple tree formation game which is\nrelated to the well-known fair single-source connection game by Anshelevich et\nal. (FOCS'04) and selfish spanning tree games by Gourv\\`es and Monnot\n(WINE'08). In our game agents correspond to nodes in a network that activate a\nsingle outgoing edge to connect to the common target node (possibly via other\nnodes). Agents pay for their path to the common target, and edge costs are\nshared fairly among all agents using an edge. The main novelty of our model is\ndynamic edge costs that depend on the in-degree of the respective endpoint.\nThis reflects that connecting to popular nodes that have increased internal\ncoordination costs is more expensive since they can charge higher prices for\ntheir routing service.\n  In contrast to related models, we show that equilibria are not guaranteed to\nexist, but we prove the existence for infinitely many numbers of agents.\nMoreover, we analyze the structure of equilibrium trees and employ these\ninsights to prove a constant upper bound on the Price of Anarchy as well as\nnon-trivial lower bounds on both the Price of Anarchy and the Price of\nStability. We also show that in comparison with the social optimum tree the\noverall cost of an equilibrium tree is more fairly shared among the agents.\nThus, we prove that self-organization of rational agents yields on average only\nslightly higher cost per agent compared to the centralized optimum, and at the\nsame time, it induces a more fair cost distribution. Moreover, equilibrium\ntrees achieve a beneficial trade-off between a low height and low maximum\ndegree, and hence these trees might be of independent interest from a\ncombinatorics point-of-view. We conclude with a discussion of promising\nextensions of our model.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2020 08:00:50 GMT"}], "update_date": "2020-09-24", "authors_parsed": [["Bilò", "Davide", ""], ["Friedrich", "Tobias", ""], ["Lenzner", "Pascal", ""], ["Melnichenko", "Anna", ""], ["Molitor", "Louise", ""]]}, {"id": "2009.11037", "submitter": "Kentaro Wada", "authors": "Takashi Akamatsu, Kentaro Wada, Takamasa Iryo, Shunsuke Hayashi", "title": "A new look at departure time choice equilibrium models with\n  heterogeneous users", "comments": "42 pages, 10 figures", "journal-ref": null, "doi": "10.1016/j.trb.2021.04.003", "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a systematic approach for analyzing the departure-time\nchoice equilibrium (DTCE) problem of a single bottleneck with heterogeneous\ncommuters. The approach is based on the fact that the DTCE is equivalently\nrepresented as a linear programming problem with a special structure, which can\nbe analytically solved by exploiting the theory of optimal transport combined\nwith a decomposition technique. By applying the proposed approach to several\ntypes of models with heterogeneous commuters, it is shown that (i) the\nessential condition for emerging equilibrium \"sorting patterns,\" which have\nbeen known in the literature, is that the schedule delay functions have the\n\"Monge property,\" (ii) the equilibrium problems with the Monge property can be\nsolved analytically, and (iii) the proposed approach can be applied to a more\ngeneral problem with more than two types of heterogeneities.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2020 10:15:16 GMT"}, {"version": "v2", "created": "Thu, 24 Sep 2020 07:31:37 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Akamatsu", "Takashi", ""], ["Wada", "Kentaro", ""], ["Iryo", "Takamasa", ""], ["Hayashi", "Shunsuke", ""]]}, {"id": "2009.11038", "submitter": "Taha Yasseri", "authors": "Vince J. Straub and Milena Tsvetkova and Taha Yasseri", "title": "The cost of coordination can exceed the benefit of collaboration in\n  performing complex tasks", "comments": "Under review; 26 pages + Supplementary Information", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY cs.GT nlin.AO physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collective decision-making is ubiquitous when observing the behavior of\nintelligent agents, including humans. However, there are inconsistencies in our\ntheoretical understanding of whether there is a collective advantage from\ninteracting with group members of varying levels of competence in solving\nproblems of varying complexity. Moreover, most existing experiments have relied\non highly stylized tasks, reducing the generality of their results. The present\nstudy narrows the gap between experimental control and realistic settings,\nreporting the results from an analysis of collective problem-solving in the\ncontext of a real-world citizen science task environment in which individuals\nwith manipulated differences in task-relevant training collaborated on the\nWildcam Gorongosa task, hosted by The Zooniverse. We find that dyads gradually\nimprove in performance but do not experience a collective benefit compared to\nindividuals in most situations; rather, the cost of team coordination to\nefficiency and speed is consistently larger than the leverage of having a\npartner, even if they are expertly trained. It is only in terms of accuracy in\nthe most complex tasks that having an additional expert significantly improves\nperformance upon that of non-experts. Our findings have important theoretical\nand applied implications for collective problem-solving: to improve efficiency,\none could prioritize providing task-relevant training and relying on trained\nexperts working alone over interaction and to improve accuracy, one could\ntarget the expertise of selectively trained individuals.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2020 10:18:26 GMT"}, {"version": "v2", "created": "Sat, 2 Jan 2021 12:10:28 GMT"}], "update_date": "2021-01-05", "authors_parsed": [["Straub", "Vince J.", ""], ["Tsvetkova", "Milena", ""], ["Yasseri", "Taha", ""]]}, {"id": "2009.11225", "submitter": "Aditya Jyoti Paul", "authors": "Aditya Jyoti Paul", "title": "Randomized fast no-loss expert system to play tic tac toe like a human", "comments": "Author's version of the paper published in IET Cognitive Computation\n  and Systems. For the journal-typeset version, please see\n  https://doi.org/10.1049/ccs.2020.0018", "journal-ref": "Cognitive Computation and Systems, Volume 2, Issue 4, December\n  2020, pp. 231 - 241", "doi": "10.1049/ccs.2020.0018", "report-no": null, "categories": "cs.AI cs.GT cs.HC cs.MA", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper introduces a blazingly fast, no-loss expert system for Tic Tac Toe\nusing Decision Trees called T3DT, that tries to emulate human gameplay as\nclosely as possible. It does not make use of any brute force, minimax or\nevolutionary techniques, but is still always unbeatable. In order to make the\ngameplay more human-like, randomization is prioritized and T3DT randomly\nchooses one of the multiple optimal moves at each step. Since it does not need\nto analyse the complete game tree at any point, T3DT is exceptionally faster\nthan any brute force or minimax algorithm, this has been shown theoretically as\nwell as empirically from clock-time analyses in this paper. T3DT also doesn't\nneed the data sets or the time to train an evolutionary model, making it a\npractical no-loss approach to play Tic Tac Toe.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2020 15:41:10 GMT"}, {"version": "v2", "created": "Tue, 10 Nov 2020 23:37:32 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Paul", "Aditya Jyoti", ""]]}, {"id": "2009.11545", "submitter": "Debasis Mishra", "authors": "Sushil Bikhchandani and Debasis Mishra", "title": "Selling Two Identical Objects", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well-known that optimal (i.e., revenue-maximizing) selling mechanisms\nin multidimensional type spaces may involve randomization. We obtain conditions\nunder which deterministic mechanisms are optimal for selling two identical,\nindivisible objects to a single buyer. We analyze two settings: (i) decreasing\nmarginal values (DMV) and (ii) increasing marginal values (IMV). Thus, the\nvalues of the buyer for the two units are not independent.\n  We show that under a well-known condition on distributions~(due to McAfee and\nMcMillan (1988)), (a) it is optimal to sell the first unit deterministically in\nthe DMV model and (b) it is optimal to bundle (which is a deterministic\nmechanism) in the IMV model. Under a stronger sufficient condition on\ndistributions, a deterministic mechanism is optimal in the DMV model.\n  Our results apply to heterogeneous objects when there is a specified sequence\nin which the two objects must be sold.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2020 08:24:30 GMT"}, {"version": "v2", "created": "Fri, 6 Nov 2020 01:57:37 GMT"}, {"version": "v3", "created": "Thu, 25 Feb 2021 06:28:31 GMT"}, {"version": "v4", "created": "Fri, 26 Feb 2021 11:22:46 GMT"}], "update_date": "2021-03-01", "authors_parsed": [["Bikhchandani", "Sushil", ""], ["Mishra", "Debasis", ""]]}, {"id": "2009.11580", "submitter": "Emilien Macault", "authors": "Emilien Macault, Marco Scarsini, Tristan Tomala", "title": "Bayesian Learning in Dynamic Non-atomic Routing Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a discrete-time nonatomic routing game with variable demand and\nuncertain costs. Given a routing network with single origin and destination,\nthe cost function of each edge depends on some uncertain persistent state\nparameter. At every period, a random traffc demand is routed through the\nnetwork according to a Bayes-Wardrop equilibrium. The realized costs are\npublicly observed and the Bayesian belief about the state parameter is updated.\nWe say that there is strong learning when beliefs converge to the truth and\nweak learning when the equilibrium flow converges to the complete-information\nflow. We characterize the networks for which learning occurs. We prove that\nthese networks have a series-parallel structure and provide a counterexample to\nprove that the condition is necessary.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2020 10:13:05 GMT"}, {"version": "v2", "created": "Tue, 2 Mar 2021 17:18:25 GMT"}], "update_date": "2021-03-03", "authors_parsed": [["Macault", "Emilien", ""], ["Scarsini", "Marco", ""], ["Tomala", "Tristan", ""]]}, {"id": "2009.11638", "submitter": "EPTCS", "authors": "Aniello Murano, Sasha Rubin, Martin Zimmermann", "title": "Optimal Strategies in Weighted Limit Games", "comments": "In Proceedings GandALF 2020, arXiv:2009.09360. Full version at\n  arXiv:2008.11562", "journal-ref": "EPTCS 326, 2020, pp. 114-130", "doi": "10.4204/EPTCS.326.8", "report-no": null, "categories": "cs.GT cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove the existence and computability of optimal strategies in weighted\nlimit games, zero-sum infinite-duration games with a B\\\"uchi-style winning\ncondition requiring to produce infinitely many play prefixes that satisfy a\ngiven regular specification. Quality of plays is measured in the maximal weight\nof infixes between successive play prefixes that satisfy the specification.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2020 01:25:47 GMT"}], "update_date": "2020-09-25", "authors_parsed": [["Murano", "Aniello", ""], ["Rubin", "Sasha", ""], ["Zimmermann", "Martin", ""]]}, {"id": "2009.11689", "submitter": "Agustin G. Bonifacio", "authors": "Agust\\'in G. Bonifacio, Elena Inarra and Pablo Neme", "title": "Non-convergence to stability in coalition formation games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of convergence to stability in coalition formation games\nin which the strategies of each agent are coalitions in which she can\nparticipate and outcomes are coalition structures. Given a natural blocking\ndynamic, an absorbing set is a minimum set of coalition structures that once\nreached is never abandoned. The coexistence of single and non-single absorbing\nsets is what causes lack of convergence to stability. To characterize games in\nwhich both types of set are present, we first relate circularity among\ncoalitions in preferences (rings) with circularity among coalition structures\n(cycles) and show that there is a ring in preferences if and only if there is a\ncycle in coalition structures. Then we identify a special configuration of\noverlapping rings in preferences characterizing games that lack convergence to\nstability. Finally, we apply our findings to the study of games induced by\nsharing rules.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2020 13:48:18 GMT"}], "update_date": "2020-09-25", "authors_parsed": [["Bonifacio", "Agustín G.", ""], ["Inarra", "Elena", ""], ["Neme", "Pablo", ""]]}, {"id": "2009.11727", "submitter": "The Anh Han", "authors": "Ogbo Ndidi Bianca, Aiman Elgarig, The Anh Han", "title": "Evolution of Coordination in Pairwise and Multi-player Interactions via\n  Prior Commitments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.GT math-ph math.MP nlin.AO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Upon starting a collective endeavour, it is important to understand your\npartners' preferences and how strongly they commit to a common goal.\nEstablishing a prior commitment or agreement in terms of posterior benefits and\nconsequences from those engaging in it provides an important mechanism for\nsecuring cooperation. Resorting to methods from Evolutionary Game Theory (EGT),\nhere we analyse how prior commitments can also be adopted as a tool for\nenhancing coordination when its outcomes exhibit an asymmetric payoff\nstructure, in both pairwise and multiparty interactions. Arguably, coordination\nis more complex to achieve than cooperation since there might be several\ndesirable collective outcomes in a coordination problem (compared to mutual\ncooperation, the only desirable collective outcome in cooperation dilemmas).\nOur analysis, both analytically and via numerical simulations, shows that\nwhether prior commitment would be a viable evolutionary mechanism for enhancing\ncoordination and the overall population social welfare strongly depends on the\ncollective benefit and severity of competition, and more importantly, how\nasymmetric benefits are resolved in a commitment deal. Moreover, in multiparty\ninteractions, prior commitments prove to be crucial when a high level of group\ndiversity is required for optimal coordination. The results are robust for\ndifferent selection intensities. Overall, our analysis provides new insights\ninto the complexity and beauty of behavioral evolution driven by humans'\ncapacity for commitment, as well as for the design of self-organised and\ndistributed multi-agent systems for ensuring coordination among autonomous\nagents.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2020 14:36:49 GMT"}, {"version": "v2", "created": "Thu, 17 Dec 2020 12:21:52 GMT"}], "update_date": "2020-12-18", "authors_parsed": [["Bianca", "Ogbo Ndidi", ""], ["Elgarig", "Aiman", ""], ["Han", "The Anh", ""]]}, {"id": "2009.11841", "submitter": "Kangning Wang", "authors": "Reza Alijani, Siddhartha Banerjee, Kamesh Munagala and Kangning Wang", "title": "The Limits of an Information Intermediary in Auction Design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the limits of an information intermediary in Bayesian auctions.\nFormally, we consider the standard single-item auction, with a\nrevenue-maximizing seller and $n$ buyers with independent private values; in\naddition, we now have an intermediary who knows the buyers' true values, and\ncan map these to a public signal so as to try to increase buyer surplus. This\nmodel was proposed by Bergemann et al., who present a signaling scheme for the\nsingle-buyer setting that raises the optimal consumer surplus, by guaranteeing\nthe item is always sold while ensuring the seller gets the same revenue as\nwithout signaling. Our work aims to understand how this result ports to the\nsetting with multiple buyers.\n  Our first result is an impossibility: We show that such a signaling scheme\nneed not exist even for $n=2$ buyers with $2$-point valuation distributions.\nIndeed, no signaling scheme can always allocate the item to the highest-valued\nbuyer while preserving any non-trivial fraction of the original consumer\nsurplus; further, no signaling scheme can achieve consumer surplus better than\na factor of $\\frac{1}{2}$ compared to the maximum achievable. These results are\nexistential (and not computational) impossibilities, and thus provide a sharp\nseparation between the single and multi-buyer settings.\n  On the positive side, for discrete valuation distributions, we develop\nsignaling schemes with good approximation guarantees for the consumer surplus\ncompared to the maximum achievable, in settings where either the number of\nagents, or the support size of valuations, is small. Formally, for i.i.d.\nbuyers, we present an $O(\\min(\\log n, K))$-approximation where $K$ is the\nsupport size of the valuations. Moreover, for general distributions, we present\nan $O(\\min(n \\log n, K^2))$-approximation. Our signaling schemes are\nconceptually simple and computable in polynomial (in $n$ and $K$) time.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2020 17:40:19 GMT"}], "update_date": "2020-09-25", "authors_parsed": [["Alijani", "Reza", ""], ["Banerjee", "Siddhartha", ""], ["Munagala", "Kamesh", ""], ["Wang", "Kangning", ""]]}, {"id": "2009.11867", "submitter": "Samuel Dooley", "authors": "Samuel Dooley, John P. Dickerson", "title": "The Affiliate Matching Problem: On Labor Markets where Firms are Also\n  Interested in the Placement of Previous Workers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.AI cs.CY cs.DS cs.GT q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many labor markets, workers and firms are connected via affiliative\nrelationships. A management consulting firm wishes to both accept the best new\nworkers but also place its current affiliated workers at strong firms.\nSimilarly, a research university wishes to hire strong job market candidates\nwhile also placing its own candidates at strong peer universities. We model\nthis affiliate matching problem in a generalization of the classic stable\nmarriage setting by permitting firms to state preferences over not just which\nworkers to whom they are matched, but also to which firms their affiliated\nworkers are matched. Based on results from a human survey, we find that\nparticipants (acting as firms) give preference to their own affiliate workers\nin surprising ways that violate some assumptions of the classical stable\nmarriage problem. This motivates a nuanced discussion of how stability could be\ndefined in affiliate matching problems; we give an example of a marketplace\nwhich admits a stable match under one natural definition of stability, and does\nnot for that same marketplace under a different, but still natural, definition.\nWe conclude by setting a research agenda toward the creation of a centralized\nclearing mechanism in this general setting.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2020 01:27:47 GMT"}], "update_date": "2020-09-28", "authors_parsed": [["Dooley", "Samuel", ""], ["Dickerson", "John P.", ""]]}, {"id": "2009.12105", "submitter": "Simon Scherrer", "authors": "Simon Scherrer, Markus Legner, Adrian Perrig, Stefan Schmid", "title": "Incentivizing Stable Path Selection in Future Internet Architectures", "comments": "38th International Symposium on Computer Performance, Modeling,\n  Measurements and Evaluation (PERFORMANCE 2020)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By delegating path control to end-hosts, future Internet architectures offer\nflexibility for path selection. However, there is a concern that the\ndistributed routing decisions by end-hosts, in particular load-adaptive\nrouting, can lead to oscillations if path selection is performed without\ncoordination or accurate load information. Prior research has addressed this\nproblem by devising path-selection policies that lead to stability. However,\nlittle is known about the viability of these policies in the Internet context,\nwhere selfish end-hosts can deviate from a prescribed policy if such a\ndeviation is beneficial fromtheir individual perspective. In order to achieve\nnetwork stability in future Internet architectures, it is essential that\nend-hosts have an incentive to adopt a stability-oriented path-selection\npolicy. In this work, we perform the first incentive analysis of the\nstability-inducing path-selection policies proposed in the literature. Building\non a game-theoretic model of end-host path selection, we show that these\npolicies are in fact incompatible with the self-interest of end-hosts, as these\nstrategies make it worthwhile to pursue an oscillatory path-selection strategy.\nTherefore, stability in networks with selfish end-hosts must be enforced by\nincentive-compatible mechanisms. We present two such mechanisms and formally\nprove their incentive compatibility.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2020 09:48:35 GMT"}], "update_date": "2020-09-28", "authors_parsed": [["Scherrer", "Simon", ""], ["Legner", "Markus", ""], ["Perrig", "Adrian", ""], ["Schmid", "Stefan", ""]]}, {"id": "2009.12114", "submitter": "Debasis Mishra", "authors": "Komal Malik and Debasis Mishra", "title": "Pareto efficient combinatorial auctions: dichotomous preferences without\n  quasilinearity", "comments": null, "journal-ref": "Journal of Economic Theory, 191 (2021), 105128", "doi": "10.1016/j.jet.2020.105128", "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a combinatorial auction model where preferences of agents over\nbundles of objects and payments need not be quasilinear. However, we restrict\nthe preferences of agents to be dichotomous. An agent with dichotomous\npreference partitions the set of bundles of objects as acceptable} and\nunacceptable, and at the same payment level, she is indifferent between bundles\nin each class but strictly prefers acceptable to unacceptable bundles. We show\nthat there is no Pareto efficient, dominant strategy incentive compatible\n(DSIC), individually rational (IR) mechanism satisfying no subsidy if the\ndomain of preferences includes all dichotomous preferences. However, a\ngeneralization of the VCG mechanism is Pareto efficient, DSIC, IR and satisfies\nno subsidy if the domain of preferences contains only positive income effect\ndichotomous preferences. We show the tightness of this result: adding any\nnon-dichotomous preference (satisfying some natural properties) to the domain\nof quasilinear dichotomous preferences brings back the impossibility result.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2020 10:27:08 GMT"}], "update_date": "2021-02-26", "authors_parsed": [["Malik", "Komal", ""], ["Mishra", "Debasis", ""]]}, {"id": "2009.12185", "submitter": "Tom\\'a\\v{s} Kroupa", "authors": "Luk\\'a\\v{s} Adam, Rostislav Hor\\v{c}\\'ik, Tom\\'a\\v{s} Kasl,\n  Tom\\'a\\v{s} Kroupa", "title": "Double Oracle Algorithm for Computing Equilibria in Continuous Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many efficient algorithms have been designed to recover Nash equilibria of\nvarious classes of finite games. Special classes of continuous games with\ninfinite strategy spaces, such as polynomial games, can be solved by\nsemidefinite programming. In general, however, continuous games are not\ndirectly amenable to computational procedures. In this contribution, we develop\nan iterative strategy generation technique for finding a Nash equilibrium in a\nwhole class of continuous two-person zero-sum games with compact strategy sets.\nThe procedure, which is called the double oracle algorithm, has been\nsuccessfully applied to large finite games in the past. We prove the\nconvergence of the double oracle algorithm to a Nash equilibrium. Moreover, the\nalgorithm is guaranteed to recover an approximate equilibrium in finitely-many\nsteps. Our numerical experiments show that it outperforms fictitious play on\nseveral examples of games appearing in the literature. In particular, we\nprovide a detailed analysis of experiments with a version of the continuous\nColonel Blotto game.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2020 12:42:08 GMT"}, {"version": "v2", "created": "Wed, 30 Sep 2020 16:12:53 GMT"}], "update_date": "2020-10-01", "authors_parsed": [["Adam", "Lukáš", ""], ["Horčík", "Rostislav", ""], ["Kasl", "Tomáš", ""], ["Kroupa", "Tomáš", ""]]}, {"id": "2009.12210", "submitter": "Felipe S. Abrah\\~ao", "authors": "Felipe S. Abrah\\~ao, Klaus Wehmuth, Artur Ziviani", "title": "Emergence of complex data from simple local rules in a network game", "comments": "arXiv admin note: text overlap with arXiv:1708.09149", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT cs.MA cs.SI cs.SY eess.SY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As one of the main subjects of investigation in data science, network science\nhas been demonstrated a wide range of applications to real-world networks\nanalysis and modeling. For example, the pervasive presence of structural or\ntopological characteristics, such as the small-world phenomenon,\nsmall-diameter, scale-free properties, or fat-tailed degree distribution were\none of the underlying pillars fostering the study of complex networks. Relating\nthese phenomena with other emergent properties in complex systems became a\nsubject of central importance. By introducing new implications on the interface\nbetween data science and complex systems science with the purpose of tackling\nsome of these issues, in this article we present a model for a network game\nplayed by complex networks in which nodes are computable systems. In\nparticular, we present and discuss how some network topological properties and\nsimple local communication rules are able to generate a phase transition with\nrespect to the emergence of incompressible data.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2020 19:43:27 GMT"}], "update_date": "2020-09-28", "authors_parsed": [["Abrahão", "Felipe S.", ""], ["Wehmuth", "Klaus", ""], ["Ziviani", "Artur", ""]]}, {"id": "2009.12213", "submitter": "Qi Dai", "authors": "Qi Dai, Xunnong Xu, Wen Guo, Suzhou Huang, Dimitar Filev", "title": "Towards a Systematic Computational Framework for Modeling Multi-Agent\n  Decision-Making at Micro Level for Smart Vehicles in a Smart World", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a multi-agent based computational framework for modeling\ndecision-making and strategic interaction at micro level for smart vehicles in\na smart world. The concepts of Markov game and best response dynamics are\nheavily leveraged. Our aim is to make the framework conceptually sound and\ncomputationally practical for a range of realistic applications, including\nmicro path planning for autonomous vehicles. To this end, we first convert the\nwould-be stochastic game problem into a closely related deterministic one by\nintroducing risk premium in the utility function for each individual agent. We\nshow how the sub-game perfect Nash equilibrium of the simplified deterministic\ngame can be solved by an algorithm based on best response dynamics. In order to\nbetter model human driving behaviors with bounded rationality, we seek to\nfurther simplify the solution concept by replacing the Nash equilibrium\ncondition with a heuristic and adaptive optimization with finite look-ahead\nanticipation. In addition, the algorithm corresponding to the new solution\nconcept drastically improves the computational efficiency. To demonstrate how\nour approach can be applied to realistic traffic settings, we conduct a\nsimulation experiment: to derive merging and yielding behaviors on a\ndouble-lane highway with an unexpected barrier. Despite assumption differences\ninvolved in the two solution concepts, the derived numerical solutions show\nthat the endogenized driving behaviors are very similar. We also briefly\ncomment on how the proposed framework can be further extended in a number of\ndirections in our forthcoming work, such as behavioral calibration using real\ntraffic video data, computational mechanism design for traffic policy\noptimization, and so on.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2020 13:05:28 GMT"}], "update_date": "2020-09-28", "authors_parsed": [["Dai", "Qi", ""], ["Xu", "Xunnong", ""], ["Guo", "Wen", ""], ["Huang", "Suzhou", ""], ["Filev", "Dimitar", ""]]}, {"id": "2009.12405", "submitter": "Xizhi Tan", "authors": "Vasilis Gkatzelis, Alexandros Psomas, Xizhi Tan", "title": "Fair and Efficient Online Allocations with Normalized Valuations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A set of divisible resources becomes available over a sequence of rounds and\nneeds to be allocated immediately and irrevocably. Our goal is to distribute\nthese resources to maximize fairness and efficiency. Achieving any non-trivial\nguarantees in an adversarial setting is impossible. However, we show that\nnormalizing the agent values, a very common assumption in fair division, allows\nus to escape this impossibility. Our main result is an online algorithm for the\ncase of two agents that ensures the outcome is envy-free while guaranteeing\n91.6% of the optimal social welfare. We also show that this is near-optimal:\nthere is no envy-free algorithm that guarantees more than 93.3% of the optimal\nsocial welfare.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2020 19:09:59 GMT"}], "update_date": "2020-09-29", "authors_parsed": [["Gkatzelis", "Vasilis", ""], ["Psomas", "Alexandros", ""], ["Tan", "Xizhi", ""]]}, {"id": "2009.12629", "submitter": "Youzhi Zhang", "authors": "Youzhi Zhang, Bo An, Jakub \\v{C}ern\\'y", "title": "Computing Ex Ante Coordinated Team-Maxmin Equilibria in Zero-Sum\n  Multiplayer Extensive-Form Games", "comments": "AAAI 2021. This paper also is a part of the thesis: Youzhi Zhang,\n  February 2020. Computing Team-Maxmin Equilibria in Zero-Sum Multiplayer\n  Games. PhD Thesis,\n  https://personal.ntu.edu.sg/boan/thesis/Zhang_Youzhi_PhD_Thesis.pdf", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computational game theory has many applications in the modern world in both\nadversarial situations and the optimization of social good. While there exist\nmany algorithms for computing solutions in two-player interactions, finding\noptimal strategies in multiplayer interactions efficiently remains an open\nchallenge. This paper focuses on computing the multiplayer Team-Maxmin\nEquilibrium with Coordination device (TMECor) in zero-sum extensive-form games.\nTMECor models scenarios when a team of players coordinates ex ante against an\nadversary. Such situations can be found in card games (e.g., in Bridge and\nPoker), when a team works together to beat a target player but communication is\nprohibited; and also in real world, e.g., in forest-protection operations, when\ncoordinated groups have limited contact during interdicting illegal loggers.\nThe existing algorithms struggle to find a TMECor efficiently because of their\nhigh computational costs. To compute a TMECor in larger games, we make the\nfollowing key contributions: (1) we propose a hybrid-form strategy\nrepresentation for the team, which preserves the set of equilibria; (2) we\nintroduce a column-generation algorithm with a guaranteed finite-time\nconvergence in the infinite strategy space based on a novel best-response\noracle; (3) we develop an associated-representation technique for the exact\nrepresentation of the multilinear terms in the best-response oracle; and (4) we\nexperimentally show that our algorithm is several orders of magnitude faster\nthan prior state-of-the-art algorithms in large games.\n", "versions": [{"version": "v1", "created": "Sat, 26 Sep 2020 15:56:07 GMT"}, {"version": "v2", "created": "Wed, 7 Oct 2020 13:53:33 GMT"}, {"version": "v3", "created": "Thu, 12 Nov 2020 17:10:33 GMT"}, {"version": "v4", "created": "Sat, 12 Dec 2020 16:22:52 GMT"}, {"version": "v5", "created": "Sat, 13 Feb 2021 21:51:39 GMT"}, {"version": "v6", "created": "Sun, 18 Jul 2021 22:06:36 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Zhang", "Youzhi", ""], ["An", "Bo", ""], ["Černý", "Jakub", ""]]}, {"id": "2009.12871", "submitter": "Francsico Benita", "authors": "Francisco Benita, Vittorio Bil\\`o, Barnab\\'e Monnot, Georgios\n  Piliouras and Cosimo Vinci", "title": "Data-Driven Models of Selfish Routing: Why Price of Anarchy Does Depend\n  on Network Topology", "comments": "Accepted to WINE 2020: The 16th Conference on Web and Internet\n  Economics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate traffic routing both from the perspective of real world data\nas well as theory. First, we reveal through data analytics a natural but\npreviously uncaptured regularity of real world routing behavior. Agents only\nconsider, in their strategy sets, paths whose free-flow costs (informally their\nlengths) are within a small multiplicative $(1+\\theta)$ constant of the optimal\nfree-flow cost path connecting their source and destination where\n$\\theta\\geq0$. In the case of Singapore, $\\theta=1$ is a good estimate of\nagents' route (pre)selection mechanism. In contrast, in Pigou networks the\nratio of the free-flow costs of the routes and thus $\\theta$ is infinite, so\nalthough such worst case networks are mathematically simple they correspond to\nartificial routing scenarios with little resemblance to real world conditions,\nopening the possibility of proving much stronger Price of Anarchy guarantees by\nexplicitly studying their dependency on $\\theta$. We provide an exhaustive\nanalysis of this question by providing provably tight bounds on PoA($\\theta$)\nfor arbitrary classes of cost functions both in the case of general\ncongestion/routing games as well as in the special case of path-disjoint\nnetworks. For example, in the case of the standard Bureau of Public Roads (BPR)\ncost model, $c_e(x)= a_e x^4+b_e$ and more generally quartic cost functions,\nthe standard PoA bound for $\\theta=\\infty$ is $2.1505$ (Roughgarden, 2003) and\nit is tight both for general networks as well as path-disjoint and even\nparallel-edge networks. In comparison, in the case of $\\theta=1$, the PoA in\nthe case of general networks is only $1.6994$, whereas for\npath-disjoint/parallel-edge networks is even smaller ($1.3652$), showing that\nboth the route geometries as captured by the parameter $\\theta$ as well as the\nnetwork topology have significant effects on PoA (Figure 1).\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2020 15:22:33 GMT"}], "update_date": "2020-09-29", "authors_parsed": [["Benita", "Francisco", ""], ["Bilò", "Vittorio", ""], ["Monnot", "Barnabé", ""], ["Piliouras", "Georgios", ""], ["Vinci", "Cosimo", ""]]}, {"id": "2009.12903", "submitter": "Haifeng Xu", "authors": "James Nachbar and Haifeng Xu", "title": "The Power of Signaling and its Intrinsic Connection to the Price of\n  Anarchy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A basic lesson from game theory is that strategic behavior often renders the\nequilibrium outcome inefficient. The recent literature of information design --\na.k.a. signaling or persuasion -- looks to improve equilibria by providing\ncarefully-tuned information to players in order to influence their actions.\nMost previous studies have focused on the question of designing optimal\nsignaling schemes. This work departs from previous research by considering a\ndescriptive question and looks to quantitatively characterize the power of\nsignaling (PoS), i.e., how much a signaling designer can improve her objective\nof the equilibrium outcome. We consider four signaling schemes with increasing\npower: full information, optimal public signaling, optimal private signaling\nand optimal ex-ante private signaling. Our main result is a clean and tight\ncharacterization of the additional power each signaling scheme has over its\nimmediate predecessor above in the broad classes of cost-minimization and\npayoff-maximization games where: (1) all players minimize non-negative cost\nfunctions or maximize non-negative payoff functions; (2) the signaling designer\n(naturally) optimizes the sum of players' utilities. We prove that the\nadditional power of signaling -- defined as the worst-case ratio between the\nequilibrium objectives of two consecutive signaling schemes in the above list\n-- is bounded precisely by the well-studied notion of the price of anarchy of\nthe corresponding games. Moreover, we show that all these bounds are tight.\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2020 17:27:10 GMT"}], "update_date": "2020-09-29", "authors_parsed": [["Nachbar", "James", ""], ["Xu", "Haifeng", ""]]}, {"id": "2009.12920", "submitter": "Yining Wang", "authors": "Xi Chen and David Simchi-Levi and Yining Wang", "title": "Privacy-Preserving Dynamic Personalized Pricing with Demand Learning", "comments": "Final version. Accepted to Management Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The prevalence of e-commerce has made detailed customers' personal\ninformation readily accessible to retailers, and this information has been\nwidely used in pricing decisions. When involving personalized information, how\nto protect the privacy of such information becomes a critical issue in\npractice. In this paper, we consider a dynamic pricing problem over $T$ time\nperiods with an \\emph{unknown} demand function of posted price and personalized\ninformation. At each time $t$, the retailer observes an arriving customer's\npersonal information and offers a price. The customer then makes the purchase\ndecision, which will be utilized by the retailer to learn the underlying demand\nfunction. There is potentially a serious privacy concern during this process: a\nthird party agent might infer the personalized information and purchase\ndecisions from price changes from the pricing system. Using the fundamental\nframework of differential privacy from computer science, we develop a\nprivacy-preserving dynamic pricing policy, which tries to maximize the retailer\nrevenue while avoiding information leakage of individual customer's information\nand purchasing decisions. To this end, we first introduce a notion of\n\\emph{anticipating} $(\\varepsilon, \\delta)$-differential privacy that is\ntailored to dynamic pricing problem. Our policy achieves both the privacy\nguarantee and the performance guarantee in terms of regret. Roughly speaking,\nfor $d$-dimensional personalized information, our algorithm achieves the\nexpected regret at the order of $\\tilde{O}(\\varepsilon^{-1} \\sqrt{d^3 T})$,\nwhen the customers' information is adversarially chosen. For stochastic\npersonalized information, the regret bound can be further improved to\n$\\tilde{O}(\\sqrt{d^2T} + \\varepsilon^{-2} d^2)$\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2020 18:32:34 GMT"}, {"version": "v2", "created": "Sun, 25 Jul 2021 18:53:42 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Chen", "Xi", ""], ["Simchi-Levi", "David", ""], ["Wang", "Yining", ""]]}, {"id": "2009.12936", "submitter": "Noah Burrell", "authors": "Noah Burrell, Grant Schoenebeck", "title": "Relaxing Common Belief for Social Networks", "comments": "31 pages. To be published in the proceedings of the 12th Innovations\n  in Theoretical Computer Science Conference (ITCS 2021). First replacement\n  added Acknowledgments. Second replacement added publication information,\n  changed formatting to match publication version, added higher-resolution\n  figures, and fixed minor errors and typos discovered during review", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a relaxation of common belief called factional belief that is\nsuitable for the analysis of strategic coordination on social networks. We show\nhow this definition can be used to analyze revolt games on general graphs,\nincluding by giving an efficient algorithm that characterizes a structural\nresult about the possible equilibria of such games. This extends prior work on\ncommon knowledge and common belief, which has been too restrictive for use in\nunderstanding strategic coordination and cooperation in social network\nsettings.\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2020 20:17:29 GMT"}, {"version": "v2", "created": "Wed, 30 Sep 2020 18:28:02 GMT"}, {"version": "v3", "created": "Fri, 18 Dec 2020 22:13:26 GMT"}], "update_date": "2020-12-22", "authors_parsed": [["Burrell", "Noah", ""], ["Schoenebeck", "Grant", ""]]}, {"id": "2009.13021", "submitter": "Young-San Lin", "authors": "Tao Jiang, Young-San Lin, Thanh Nguyen", "title": "Market Equilibrium in Multi-tier Supply Chain Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a sequential decision model over multi-tier supply chain networks\nand show that in particular, for series parallel networks, there is a unique\nequilibrium. We provide a linear time algorithm to compute the equilibrium and\nstudy the impact and invariant of the network structure to the total trade flow\nand social welfare.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2020 02:26:26 GMT"}], "update_date": "2020-09-29", "authors_parsed": [["Jiang", "Tao", ""], ["Lin", "Young-San", ""], ["Nguyen", "Thanh", ""]]}, {"id": "2009.13051", "submitter": "Justin Terry", "authors": "Justin K Terry, Nathaniel Grammel, Benjamin Black, Ananth Hari,\n  Caroline Horsch, Luis Santos", "title": "Agent Environment Cycle Games", "comments": "This work of this paper has been merged into the paper \"PettingZoo:\n  Gym for Multi-Agent Reinforcement Learning\" arXiv:2009.14471", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.GT cs.MA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Partially Observable Stochastic Games (POSGs) are the most general and common\nmodel of games used in Multi-Agent Reinforcement Learning (MARL). We argue that\nthe POSG model is conceptually ill suited to software MARL environments, and\noffer case studies from the literature where this mismatch has led to severely\nunexpected behavior. In response to this, we introduce the Agent Environment\nCycle Games (AEC Games) model, which is more representative of software\nimplementation. We then prove it's as an equivalent model to POSGs. The AEC\ngames model is also uniquely useful in that it can elegantly represent both all\nforms of MARL environments, whereas for example POSGs cannot elegantly\nrepresent strictly turn based games like chess.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2020 04:02:08 GMT"}, {"version": "v2", "created": "Mon, 15 Feb 2021 19:06:59 GMT"}, {"version": "v3", "created": "Sat, 1 May 2021 14:24:22 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Terry", "Justin K", ""], ["Grammel", "Nathaniel", ""], ["Black", "Benjamin", ""], ["Hari", "Ananth", ""], ["Horsch", "Caroline", ""], ["Santos", "Luis", ""]]}, {"id": "2009.13104", "submitter": "Debasis Mishra", "authors": "Sulagna Dasgupta and Debasis Mishra", "title": "Ordinal Bayesian incentive compatibility in random assignment model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the consequences of weakening the notion of incentive\ncompatibility from strategy-proofness to ordinal Bayesian incentive\ncompatibility (OBIC) in the random assignment model. If the common prior of the\nagents is a uniform prior, then a large class of random mechanisms are OBIC\nwith respect to this prior -- this includes the probabilistic serial mechanism.\nWe then introduce a robust version of OBIC: a mechanism is locally robust OBIC\nif it is OBIC with respect all independent priors in some neighborhood of a\ngiven independent prior. We show that every locally robust OBIC mechanism\nsatisfying a mild property called elementary monotonicity is strategy-proof.\nThis leads to a strengthening of the impossibility result in Bogomolnaia and\nMoulin (2001): if there are at least four agents, there is no locally robust\nOBIC and ordinally efficient mechanism satisfying equal treatment of equals.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2020 07:24:49 GMT"}, {"version": "v2", "created": "Sun, 16 May 2021 11:12:22 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Dasgupta", "Sulagna", ""], ["Mishra", "Debasis", ""]]}, {"id": "2009.13160", "submitter": "Maria Kleshnina", "authors": "M. Kleshnina, K. Kaveh and K. Chatterjee", "title": "The role of behavioural plasticity in finite vs infinite populations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary game theory has proven to be an elegant framework providing many\nfruitful insights in population dynamics and human behaviour. Here, we focus on\nthe aspect of behavioural plasticity and its effect on the evolution of\npopulations. We consider games with only two strategies in both well-mixed\ninfinite and finite populations settings. We assume that individuals might\nexhibit behavioural plasticity referred to as incompetence of players. We study\nthe effect of such heterogeneity on the outcome of local interactions and,\nultimately, on global competition. For instance, a strategy that was dominated\nbefore can become desirable from the selection perspective when behavioural\nplasticity is taken into account. Furthermore, it can ease conditions for a\nsuccessful fixation in infinite populations' invasions. We demonstrate our\nfindings on the examples of Prisoners' Dilemma and Snowdrift game, where we\ndefine conditions under which cooperation can be promoted.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2020 09:14:58 GMT"}], "update_date": "2020-09-29", "authors_parsed": [["Kleshnina", "M.", ""], ["Kaveh", "K.", ""], ["Chatterjee", "K.", ""]]}, {"id": "2009.13521", "submitter": "Ben Adler", "authors": "Ben Adler", "title": "Zero Knowledge Games", "comments": "27 pages, 5 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Zero-knowledge strategies as a form of inference and reasoning operate using\nthe concept of zero-knowledge signaling, such that any imperfect recall or\nincomplete information can be attenuated for. The resulting effect of\nstructuring a continuous game within a zero-knowledge strategy demonstrates the\nability to infer, within acceptable probabilities, which approximate stage a\nplayer is in. This occurs only when an uninformed player attempts non-revealing\nstrategies, resulting in a higher probability of failing to appear informed.\nThus, an opposing player understanding their opponent is uninformed can choose\na more optimal strategy. In cases where an informed player chooses a\nnon-revealing strategy, introducing a hedge algebra as a doxastic heuristic\ninforms feasibility levels of trust. A counter strategy employing such a hedge\nalgebra facilitates optimal outcomes for both players, provided the trust is\nwell placed. Given indefinite, finite sub-games leading to continued\ninteractions based on trust, extensions to continuous games are feasible.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2020 16:04:52 GMT"}, {"version": "v2", "created": "Tue, 13 Apr 2021 19:50:06 GMT"}], "update_date": "2021-04-15", "authors_parsed": [["Adler", "Ben", ""]]}, {"id": "2009.13605", "submitter": "Manuel Beyeler", "authors": "Manuel Beyeler, Gianluca Brero, Benjamin Lubin, Sven Seuken", "title": "iMLCA: Machine Learning-powered Iterative Combinatorial Auctions with\n  Interval Bidding", "comments": "22 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the design of iterative combinatorial auctions for domains with a\nlarge number of items. In such domains, preference elicitation is a major\nchallenge because the bundle space grows exponentially in the number of items.\nTo keep preference elicitation manageable, recent work has employed machine\nlearning (ML) algorithms that identify a small set of bundles to query from\neach bidder. However, a major limitation of this prior work is that bidders\nmust submit exact values for the queried bundles, which can be quite costly for\nthem. To address this, we propose iMLCA, a new ML-powered auction with interval\nbidding (i.e., where bidders submit upper and lower bounds for the queried\nbundles). To steer the auction towards an efficient allocation, we introduce a\nnew price-based activity rule, asking bidders to tighten bounds on relevant\nbundles only. The activity rule is designed such that the auctioneer receives\nenough information about bidders' preferences to achieve high efficiency and\ngood incentives, while minimizing elicitation costs. Our experiments show that\niMLCA, despite only eliciting interval bids, achieves almost the same\nallocative efficiency as the prior auction design that required bidders to\nsubmit exact values. Finally, we show that iMLCA beats the well-known\ncombinatorial clock auction in a realistically-sized domain.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2020 20:13:27 GMT"}, {"version": "v2", "created": "Sat, 15 May 2021 14:46:50 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Beyeler", "Manuel", ""], ["Brero", "Gianluca", ""], ["Lubin", "Benjamin", ""], ["Seuken", "Sven", ""]]}, {"id": "2009.13632", "submitter": "Nicolas Markey", "authors": "Nathalie Bertrand, Nicolas Markey, Suman Sadhukhan, and Ocan Sankur", "title": "Dynamic network congestion games", "comments": "Full version of a paper to appear at FSTTCS 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Congestion games are a classical type of games studied in game theory, in\nwhich n players choose a resource, and their individual cost increases with the\nnumber of other players choosing the same resource. In network congestion games\n(NCGs), the resources correspond to simple paths in a graph, e.g. representing\nrouting options from a source to a target. In this paper, we introduce a\nvariant of NCGs, referred to as dynamic NCGs: in this setting, players take\ntransitions synchronously, they select their next transitions dynamically, and\nthey are charged a cost that depends on the number of players simultaneously\nusing the same transition.\n  We study, from a complexity perspective, standard concepts of game theory in\ndynamic NCGs: social optima, Nash equilibria, and subgame perfect equilibria.\nOur contributions are the following: the existence of a strategy profile with\nsocial cost bounded by a constant is in PSPACE and NP-hard. (Pure) Nash\nequilibria always exist in dynamic NCGs; the existence of a Nash equilibrium\nwith bounded cost can be decided in EXPSPACE, and computing a witnessing\nstrategy profile can be done in doubly-exponential time. The existence of a\nsubgame perfect equilibrium with bounded cost can be decided in 2EXPSPACE, and\na witnessing strategy profile can be computed in triply-exponential time.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2020 21:18:21 GMT"}], "update_date": "2020-09-30", "authors_parsed": [["Bertrand", "Nathalie", ""], ["Markey", "Nicolas", ""], ["Sadhukhan", "Suman", ""], ["Sankur", "Ocan", ""]]}, {"id": "2009.13697", "submitter": "Mengyuan Lee", "authors": "Mengyuan Lee, Seyyedali Hosseinalipour, Christopher G. Brinton,\n  Guanding Yu, and Huaiyu Dai", "title": "A Fast Graph Neural Network-Based Method for Winner Determination in\n  Multi-Unit Combinatorial Auctions", "comments": "Accepted by Transactions on Cloud Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The combinatorial auction (CA) is an efficient mechanism for resource\nallocation in different fields, including cloud computing. It can obtain high\neconomic efficiency and user flexibility by allowing bidders to submit bids for\ncombinations of different items instead of only for individual items. However,\nthe problem of allocating items among the bidders to maximize the auctioneers\"\nrevenue, i.e., the winner determination problem (WDP), is NP-complete to solve\nand inapproximable. Existing works for WDPs are generally based on mathematical\noptimization techniques and most of them focus on the single-unit WDP, where\neach item only has one unit. On the contrary, few works consider the multi-unit\nWDP in which each item may have multiple units. Given that the multi-unit WDP\nis more complicated but prevalent in cloud computing, we propose leveraging\nmachine learning (ML) techniques to develop a novel low-complexity algorithm\nfor solving this problem with negligible revenue loss. Specifically, we model\nthe multi-unit WDP as an augmented bipartite bid-item graph and use a graph\nneural network (GNN) with half-convolution operations to learn the probability\nof each bid belonging to the optimal allocation. To improve the sample\ngeneration efficiency and decrease the number of needed labeled instances, we\npropose two different sample generation processes. We also develop two novel\ngraph-based post-processing algorithms to transform the outputs of the GNN into\nfeasible solutions. Through simulations on both synthetic instances and a\nspecific virtual machine (VM) allocation problem in a cloud computing platform,\nwe validate that our proposed method can approach optimal performance with low\ncomplexity and has good generalization ability in terms of problem size and\nuser-type distribution.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2020 00:22:37 GMT"}, {"version": "v2", "created": "Mon, 21 Dec 2020 15:31:41 GMT"}], "update_date": "2020-12-22", "authors_parsed": [["Lee", "Mengyuan", ""], ["Hosseinalipour", "Seyyedali", ""], ["Brinton", "Christopher G.", ""], ["Yu", "Guanding", ""], ["Dai", "Huaiyu", ""]]}, {"id": "2009.13741", "submitter": "Aditya Saraf", "authors": "Aditya Saraf, Anna R. Karlin, and Jamie Morgenstern", "title": "Competition Alleviates Present Bias in Task Completion", "comments": "20 pages, 8 figures. To be published in Web and Internet Economics\n  (WINE) 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We build upon recent work [Kleinberg and Oren, 2014, Kleinberg et al., 2016,\n2017] that considers present biased agents, who place more weight on costs they\nmust incur now than costs they will incur in the future. They consider a graph\ntheoretic model where agents must complete a task and show that present biased\nagents can take exponentially more expensive paths than optimal. We propose a\ntheoretical model that adds competition into the mix -- two agents compete to\nfinish a task first. We show that, in a wide range of settings, a small amount\nof competition can alleviate the harms of present bias. This can help explain\nwhy biased agents may not perform so poorly in naturally competitive settings,\nand can guide task designers on how to protect present biased agents from harm.\nOur work thus paints a more positive picture than much of the existing\nliterature on present bias.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2020 03:07:16 GMT"}], "update_date": "2020-09-30", "authors_parsed": [["Saraf", "Aditya", ""], ["Karlin", "Anna R.", ""], ["Morgenstern", "Jamie", ""]]}, {"id": "2009.13802", "submitter": "Benjamin Golub", "authors": "Benjamin Golub and Stephen Morris", "title": "Expectations, Networks, and Conventions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In coordination games and speculative over-the-counter financial markets,\nsolutions depend on higher-order average expectations: agents' expectations\nabout what counterparties, on average, expect their counterparties to think,\netc. We offer a unified analysis of these objects and their limits, for general\ninformation structures, priors, and networks of counterparty relationships. Our\nkey device is an interaction structure combining the network and agents'\nbeliefs, which we analyze using Markov methods. This device allows us to nest\nclassical beauty contests and network games within one model and unify their\nresults. Two applications illustrate the techniques: The first characterizes\nwhen slight optimism about counterparties' average expectations leads to\ncontagion of optimism and extreme asset prices. The second describes the\ntyranny of the least-informed: agents coordinating on the prior expectations of\nthe one with the worst private information, despite all having nearly common\ncertainty, based on precise private signals, of the ex post optimal action.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2020 06:21:16 GMT"}], "update_date": "2020-09-30", "authors_parsed": [["Golub", "Benjamin", ""], ["Morris", "Stephen", ""]]}, {"id": "2009.14171", "submitter": "Niclas Boehmer", "authors": "Niclas Boehmer and Klaus Heeger", "title": "A Fine-Grained View on Stable Many-To-One Matching Problems with Lower\n  and Upper Quotas", "comments": "Accepted to WINE 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Hospital Residents problem with lower and upper quotas ($HR-Q^U_L$),\nthe goal is to find a stable matching of residents to hospitals where the\nnumber of residents matched to a hospital is either between its lower and upper\nquota or zero [Bir\\'o et al., TCS 2010]. We analyze this problem from a\nparameterized perspective using several natural parameters such as the number\nof hospitals and the number of residents. Moreover, we present a\npolynomial-time algorithm that finds a stable matching if it exists on\ninstances with maximum lower quota two. Alongside $HR-Q^U_L$, we also consider\ntwo closely related models of independent interest, namely, the special case of\n$HR-Q^U_L$ where each hospital has only a lower quota but no upper quota and\nthe variation of $HR-Q^U_L$ where hospitals do not have preferences over\nresidents, which is also known as the House Allocation problem with lower and\nupper quotas. Lastly, we investigate how the parameterized complexity of these\nthree models changes if preferences may contain ties.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2020 17:35:24 GMT"}, {"version": "v2", "created": "Tue, 2 Mar 2021 11:06:31 GMT"}], "update_date": "2021-03-03", "authors_parsed": [["Boehmer", "Niclas", ""], ["Heeger", "Klaus", ""]]}, {"id": "2009.14191", "submitter": "Klaus Heeger", "authors": "Robert Bredereck, Klaus Heeger, Du\\v{s}an Knop, Rolf Niedermeier", "title": "Multidimensional Stable Roommates with Master List", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Since the early days of research in algorithms and complexity, the\ncomputation of stable matchings is a core topic. While in the classic setting\nthe goal is to match up two agents (either from different \"gender\" (this is\nStable Marriage) or \"unrestricted\" (this is Stable Roommates)), Knuth [1976]\ntriggered the study of three- or multidimensional cases. Here, we focus on the\nstudy of Multidimensional Stable Roommates, known to be NP-hard since the early\n1990's. Many NP-hardness results, however, rely on very general input instances\nthat do not occur in at least some of the specific application scenarios. With\nthe quest for identifying islands of tractability for Multidimensional Stable\nRoommates, we study the case of master lists. Here, as natural in applications\nwhere agents express their preferences based on \"objective\" scores, one roughly\nspeaking assumes that all agent preferences are \"derived from\" a central master\nlist, implying that the individual agent preferences shall be similar. Master\nlists have been frequently studied in the two-dimensional (classic) stable\nmatching case, but seemingly almost never for the multidimensional case. This\nwork, also relying on methods from parameterized algorithm design and\ncomplexity analysis, performs a first systematic study of Multidimensional\nStable Roommates under the assumption of master lists.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2020 17:57:35 GMT"}, {"version": "v2", "created": "Thu, 1 Oct 2020 17:46:20 GMT"}, {"version": "v3", "created": "Thu, 1 Apr 2021 10:57:13 GMT"}], "update_date": "2021-04-02", "authors_parsed": [["Bredereck", "Robert", ""], ["Heeger", "Klaus", ""], ["Knop", "Dušan", ""], ["Niedermeier", "Rolf", ""]]}, {"id": "2009.14730", "submitter": "Fang-Yi Yu", "authors": "Grant Schoenebeck and Fang-Yi Yu", "title": "Learning and Strongly Truthful Multi-Task Peer Prediction: A Variational\n  Approach", "comments": "39 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer prediction mechanisms incentivize agents to truthfully report their\nsignals even in the absence of verification by comparing agents' reports with\nthose of their peers. In the detail-free multi-task setting, agents respond to\nmultiple independent and identically distributed tasks, and the mechanism does\nnot know the prior distribution of agents' signals. The goal is to provide an\n$\\epsilon$-strongly truthful mechanism where truth-telling rewards agents\n\"strictly\" more than any other strategy profile (with $\\epsilon$ additive\nerror), and to do so while requiring as few tasks as possible. We design a\nfamily of mechanisms with a scoring function that maps a pair of reports to a\nscore. The mechanism is strongly truthful if the scoring function is \"prior\nideal,\" and $\\epsilon$-strongly truthful as long as the scoring function is\nsufficiently close to the ideal one. This reduces the above mechanism design\nproblem to a learning problem -- specifically learning an ideal scoring\nfunction. We leverage this reduction to obtain the following three results. 1)\nWe show how to derive good bounds on the number of tasks required for different\ntypes of priors. Our reduction applies to myriad continuous signal space\nsettings. This is the first peer-prediction mechanism on continuous signals\ndesigned for the multi-task setting. 2) We show how to turn a soft-predictor of\nan agent's signals (given the other agents' signals) into a mechanism. This\nallows the practical use of machine learning algorithms that give good results\neven when many agents provide noisy information. 3) For finite signal spaces,\nwe obtain $\\epsilon$-strongly truthful mechanisms on any stochastically\nrelevant prior, which is the maximal possible prior. In contrast, prior work\nonly achieves a weaker notion of truthfulness (informed truthfulness) or\nrequires stronger assumptions on the prior.\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2020 15:09:56 GMT"}], "update_date": "2020-10-01", "authors_parsed": [["Schoenebeck", "Grant", ""], ["Yu", "Fang-Yi", ""]]}, {"id": "2009.14793", "submitter": "Edin Husic", "authors": "Jugal Garg, Edin Husic and Laszlo A. Vegh", "title": "Approximating Nash Social Welfare under Rado Valuations", "comments": "44 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.DS cs.MA math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of approximating maximum Nash social welfare (NSW)\nwhile allocating a set of indivisible items to $n$ agents. The NSW is a popular\nobjective that provides a balanced tradeoff between the often conflicting\nrequirements of fairness and efficiency, defined as the weighted geometric mean\nof agents' valuations. For the symmetric additive case of the problem, where\nagents have the same weight with additive valuations, the first constant-factor\napproximation algorithm was obtained in 2015. This led to a flurry of work\nobtaining constant-factor approximation algorithms for the symmetric case under\nmild generalizations of additive, and $O(n)$-approximation algorithms for more\ngeneral valuations and for the asymmetric case.\n  In this paper, we make significant progress towards both symmetric and\nasymmetric NSW problems. We present the first constant-factor approximation\nalgorithm for the symmetric case under Rado valuations. Rado valuations form a\ngeneral class of valuation functions that arise from maximum cost independent\nmatching problems, including as special cases assignment (OXS) valuations and\nweighted matroid rank functions. Furthermore, our approach also gives the first\nconstant-factor approximation algorithm for the asymmetric case under Rado\nvaluations, provided that the maximum ratio between the weights is bounded by a\nconstant.\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2020 17:07:51 GMT"}], "update_date": "2020-10-02", "authors_parsed": [["Garg", "Jugal", ""], ["Husic", "Edin", ""], ["Vegh", "Laszlo A.", ""]]}, {"id": "2009.14820", "submitter": "Tanner Fiez", "authors": "Tanner Fiez, Lillian Ratliff", "title": "Gradient Descent-Ascent Provably Converges to Strict Local Minmax\n  Equilibria with a Finite Timescale Separation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT cs.SY eess.SY stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the role that a finite timescale separation parameter $\\tau$ has on\ngradient descent-ascent in two-player non-convex, non-concave zero-sum games\nwhere the learning rate of player 1 is denoted by $\\gamma_1$ and the learning\nrate of player 2 is defined to be $\\gamma_2=\\tau\\gamma_1$. Existing work\nanalyzing the role of timescale separation in gradient descent-ascent has\nprimarily focused on the edge cases of players sharing a learning rate ($\\tau\n=1$) and the maximizing player approximately converging between each update of\nthe minimizing player ($\\tau \\rightarrow \\infty$). For the parameter choice of\n$\\tau=1$, it is known that the learning dynamics are not guaranteed to converge\nto a game-theoretically meaningful equilibria in general. In contrast, Jin et\nal. (2020) showed that the stable critical points of gradient descent-ascent\ncoincide with the set of strict local minmax equilibria as\n$\\tau\\rightarrow\\infty$. In this work, we bridge the gap between past work by\nshowing there exists a finite timescale separation parameter $\\tau^{\\ast}$ such\nthat $x^{\\ast}$ is a stable critical point of gradient descent-ascent for all\n$\\tau \\in (\\tau^{\\ast}, \\infty)$ if and only if it is a strict local minmax\nequilibrium. Moreover, we provide an explicit construction for computing\n$\\tau^{\\ast}$ along with corresponding convergence rates and results under\ndeterministic and stochastic gradient feedback. The convergence results we\npresent are complemented by a non-convergence result: given a critical point\n$x^{\\ast}$ that is not a strict local minmax equilibrium, then there exists a\nfinite timescale separation $\\tau_0$ such that $x^{\\ast}$ is unstable for all\n$\\tau\\in (\\tau_0, \\infty)$. Finally, we empirically demonstrate on the CIFAR-10\nand CelebA datasets the significant impact timescale separation has on training\nperformance.\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2020 17:51:28 GMT"}], "update_date": "2020-10-01", "authors_parsed": [["Fiez", "Tanner", ""], ["Ratliff", "Lillian", ""]]}]