[{"id": "1605.00136", "submitter": "Liad Blumrosen", "authors": "Moshe Babaioff, Liad Blumrosen and Noam Nisan", "title": "Networks of Complements", "comments": "An extended abstract will appear in ICALP 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a network of sellers, each selling a single product, where the\ngraph structure represents pair-wise complementarities between products. We\nstudy how the network structure affects revenue and social welfare of\nequilibria of the pricing game between the sellers. We prove positive and\nnegative results, both of \"Price of Anarchy\" and of \"Price of Stability\" type,\nfor special families of graphs (paths, cycles) as well as more general ones\n(trees, graphs). We describe best-reply dynamics that converge to non-trivial\nequilibrium in several families of graphs, and we use these dynamics to prove\nthe existence of approximately-efficient equilibria.\n", "versions": [{"version": "v1", "created": "Sat, 30 Apr 2016 17:01:09 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Babaioff", "Moshe", ""], ["Blumrosen", "Liad", ""], ["Nisan", "Noam", ""]]}, {"id": "1605.00167", "submitter": "Bahman Kalantari", "authors": "Bahman Kalantari", "title": "Approximating Nash Equilibrium Via Multilinear Minimax", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nash equilibrium} (NE) can be stated as a formal theorem on a multilinear\nform, free of game theory terminology. On the other hand, inspired by this\nformalism, we state and prove a {\\it multilinear minimax theorem}, a\ngeneralization of von Neumann's bilinear minimax theorem. As in the bilinear\ncase, the proof is based on relating the underlying optimizations to a\nprimal-dual pair of linear programming problems, albeit more complicated LPs.\nThe theorem together with its proof is of independent interest. Next, we use\nthe theorem to associate to a multilinear form in NE a {\\it multilinear minimax\nrelaxation} (MMR), where the primal-dual pair of solutions induce an\napproximate equilibrium point that provides a nontrivial upper bound on a\nconvex combination of {\\it expected payoffs} in any NE solution. In fact we\nshow any positive probability vector associated to the players induces a\ncorresponding {\\it diagonally-scaled} MMR approximate equilibrium with its\nassociated upper bound. By virtue of the proof of the multilinear minimax\ntheorem, MMR solution can be computed in polynomial-time. On the other hand, it\nis known that even in bimatrix games NE is {\\it PPAD-complete}, a complexity\nclass in NP not known to be in P. The quality of MMR solution and the\nefficiency of solving the underlying LPs are the subject of further\ninvestigation. However, as shown in a separate article, for a large set of test\nproblems in bimatrix games, not only the MMR payoffs for both players are\nbetter than any NE payoffs, so is the computing time of MMR in contrast with\nthat of Lemke-Howsen algorithm. In large size problems the latter algorithm\neven fails to produce a Nash equilibrium. In summary, solving MMR provides a\nworthy approximation even if Nash equilibrium is shown to be computable in\npolynomial-time.\n", "versions": [{"version": "v1", "created": "Sat, 30 Apr 2016 21:07:16 GMT"}, {"version": "v2", "created": "Fri, 5 Jul 2019 17:47:26 GMT"}], "update_date": "2019-07-08", "authors_parsed": [["Kalantari", "Bahman", ""]]}, {"id": "1605.00306", "submitter": "Doha Hamza", "authors": "Doha Hamza, Jeff S. Shamma", "title": "BLMA: A Blind Matching Algorithm with Application to Cognitive Radio\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a two-sided matching problem with a defined notion of pairwise\nstability. We propose a distributed blind matching algorithm (BLMA) to solve\nthe problem. We prove the solution produced by BLMA will converge to an\n$\\epsilon$-pairwise stable outcome with probability one. We then consider a\nmatching problem in cognitive radio networks. Secondary users (SUs) are allowed\naccess time to the spectrum belonging to the primary users (PUs) provided that\nthey relay primary messages. We propose a realization of the BLMA to produce an\n$\\epsilon$-pairwise stable solution assuming quasi-convex and quasi-concave\nutilities. In the case of more general utility forms, we show another BLMA\nrealization to provide a stable solution. Furthermore, we propose negotiation\nmechanism to bias the algorithm towards one side of the market. We use this\nmechanism to protect the exclusive rights of the PUs to the spectrum. In all\nsuch implementations of the BLMA, we impose a limited information exchange in\nthe network so that agents can only calculate their own utilities, but no\ninformation is available about the utilities of any other users in the network.\n", "versions": [{"version": "v1", "created": "Sun, 1 May 2016 20:25:25 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Hamza", "Doha", ""], ["Shamma", "Jeff S.", ""]]}, {"id": "1605.00601", "submitter": "Brian Swenson", "authors": "Brian Swenson, Ceyhun Eksin, Soummya Kar, Alejandro Ribeiro", "title": "Distributed Inertial Best-Response Dynamics", "comments": null, "journal-ref": null, "doi": "10.1109/TAC.2018.2817161", "report-no": null, "categories": "cs.SY cs.GT", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The note considers the problem of computing pure Nash equilibrium (NE)\nstrategies in distributed (i.e., network-based) settings. The paper studies a\nclass of inertial best response dynamics based on the fictitious play (FP)\nalgorithm. It is shown that inertial best response dynamics are robust to\ninformational limitations common in distributed settings. Fully distributed\nvariants of FP with inertia and joint strategy FP with inertia are developed\nand convergence is proven to the set of pure NE. The distributed algorithms\nrely on consensus methods. Results are validated using numerical simulations.\n", "versions": [{"version": "v1", "created": "Mon, 2 May 2016 18:23:18 GMT"}, {"version": "v2", "created": "Fri, 6 Jan 2017 19:52:14 GMT"}, {"version": "v3", "created": "Tue, 3 Apr 2018 15:14:23 GMT"}], "update_date": "2018-04-04", "authors_parsed": [["Swenson", "Brian", ""], ["Eksin", "Ceyhun", ""], ["Kar", "Soummya", ""], ["Ribeiro", "Alejandro", ""]]}, {"id": "1605.00977", "submitter": "Vikas Vikram Singh", "authors": "Vikas Vikram Singh and N. Hemachandra", "title": "Blackwell-Nash Equilibrium for Discrete and Continuous Time Stochastic\n  Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider both discrete and continuous time finite state-action stochastic\ngames. In discrete time stochastic games, it is known that a stationary\nBlackwell-Nash equilibrium (BNE) exists for a single controller additive reward\n(SC-AR) stochastic game which is a special case of a general stochastic game.\nWe show that, in general, the additive reward condition is needed for the\nexistence of a BNE. We give an example of a single controller stochastic game\nwhich does not satisfy additive reward condition. We show that this example\ndoes not have a stationary BNE. For a general discrete time discounted\nstochastic game we give two different sets of conditions and show that a\nstationary Nash equilibrium that satisfies any set of conditions is a BNE. One\nof these sets of conditions weakens a set of conditions available in the\nliterature. For continuous time stochastic games, we give an example that does\nnot have a stationary BNE. In fact, this example is a single controller\ncontinuous time stochastic game. Then, we introduce a continuous time SC-AR\nstochastic game. We show that there always exists a stationary deterministic\nBNE for continuous time SC-AR stochastic game. For a general continuous time\ndiscounted stochastic game we give two different sets of conditions and show\nthat a Nash equilibrium that satisfies any set of conditions is a BNE.\n", "versions": [{"version": "v1", "created": "Tue, 3 May 2016 16:43:29 GMT"}], "update_date": "2016-05-04", "authors_parsed": [["Singh", "Vikas Vikram", ""], ["Hemachandra", "N.", ""]]}, {"id": "1605.01021", "submitter": "Yuqing Kong", "authors": "Yuqing Kong and Grant Schoenebeck", "title": "An Information Theoretic Framework For Designing Information Elicitation\n  Mechanisms That Reward Truth-telling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the setting where information cannot be verified, we propose a simple yet\npowerful information theoretical framework---the Mutual Information\nParadigm---for information elicitation mechanisms. Our framework pays every\nagent a measure of mutual information between her signal and a peer's signal.\nWe require that the mutual information measurement has the key property that\nany \"data processing\" on the two random variables will decrease the mutual\ninformation between them. We identify such information measures that generalize\nShannon mutual information.\n  Our Mutual Information Paradigm overcomes the two main challenges in\ninformation elicitation without verification: (1) how to incentivize effort and\navoid agents colluding to report random or identical responses (2) how to\nmotivate agents who believe they are in the minority to report truthfully.\n  Aided by the information measures we found, (1) we use the paradigm to design\na family of novel mechanisms where truth-telling is a dominant strategy and any\nother strategy will decrease every agent's expected payment (in the\nmulti-question, detail free, minimal setting where the number of questions is\nlarge); (2) we show the versatility of our framework by providing a unified\ntheoretical understanding of existing mechanisms---Peer Prediction [Miller\n2005], Bayesian Truth Serum [Prelec 2004], and Dasgupta and Ghosh [2013]---by\nmapping them into our framework such that theoretical results of those existing\nmechanisms can be reconstructed easily.\n  We also give an impossibility result which illustrates, in a certain sense,\nthe the optimality of our framework.\n", "versions": [{"version": "v1", "created": "Tue, 3 May 2016 18:51:23 GMT"}, {"version": "v2", "created": "Wed, 17 Jan 2018 22:42:38 GMT"}], "update_date": "2018-01-19", "authors_parsed": [["Kong", "Yuqing", ""], ["Schoenebeck", "Grant", ""]]}, {"id": "1605.01220", "submitter": "Maciej Drwal", "authors": "Maciej Drwal", "title": "Optimal Design of Robust Combinatorial Mechanisms for Substitutable\n  Goods", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider multidimensional mechanism design problem for\nselling discrete substitutable items to a group of buyers. Previous work on\nthis problem mostly focus on stochastic description of valuations used by the\nseller. However, in certain applications, no prior information regarding\nbuyers' preferences is known. To address this issue, we consider uncertain\nvaluations and formulate the problem in a robust optimization framework: the\nobjective is to minimize the maximum regret. For a special case of\nrevenue-maximizing pricing problem we present a solution method based on\nmixed-integer linear programming formulation.\n", "versions": [{"version": "v1", "created": "Wed, 4 May 2016 10:56:59 GMT"}, {"version": "v2", "created": "Wed, 18 May 2016 15:03:14 GMT"}, {"version": "v3", "created": "Wed, 14 Dec 2016 17:41:05 GMT"}, {"version": "v4", "created": "Wed, 4 Jan 2017 16:25:28 GMT"}], "update_date": "2017-01-05", "authors_parsed": [["Drwal", "Maciej", ""]]}, {"id": "1605.01236", "submitter": "Joseph Y. Halpern", "authors": "Joseph Y. Halpern, Yoram Moses", "title": "Characterizing Solution Concepts in Terms of Common Knowledge of\n  Rationality", "comments": "To appear in International Journal of Game Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Characterizations of Nash equilibrium, correlated equilibrium, and\nrationalizability in terms of common knowledge of rationality are well known.\nAnalogous characterizations of sequential equilibrium, (trembling hand) perfect\nequilibrium, and quasi-perfect equilibrium using results of Halpern [2009].\n", "versions": [{"version": "v1", "created": "Wed, 4 May 2016 11:49:43 GMT"}], "update_date": "2016-05-05", "authors_parsed": [["Halpern", "Joseph Y.", ""], ["Moses", "Yoram", ""]]}, {"id": "1605.01451", "submitter": "Panayotis Mertikopoulos", "authors": "Panayotis Mertikopoulos and Aris L. Moustakas and Anna Tzanakaki", "title": "Boltzmann meets Nash: Energy-efficient routing in optical networks under\n  uncertainty", "comments": "24 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the massive deployment of power-hungry data centers for service\nprovisioning, we examine the problem of routing in optical networks with the\naim of minimizing traffic-driven power consumption. To tackle this issue,\nrouting must take into account energy efficiency as well as capacity\nconsiderations; moreover, in rapidly-varying network environments, this must be\naccomplished in a real-time, distributed manner that remains robust in the\npresence of random disturbances and noise. In view of this, we derive a pricing\nscheme whose Nash equilibria coincide with the network's socially optimum\nstates, and we propose a distributed learning method based on the Boltzmann\ndistribution of statistical mechanics. Using tools from stochastic calculus, we\nshow that the resulting Boltzmann routing scheme exhibits remarkable\nconvergence properties under uncertainty: specifically, the long-term average\nof the network's power consumption converges within $\\varepsilon$ of its\nminimum value in time which is at most $\\tilde O(1/\\varepsilon^2)$,\nirrespective of the fluctuations' magnitude; additionally, if the network\nadmits a strict, non-mixing optimum state, the algorithm converges to it -\nagain, no matter the noise level. Our analysis is supplemented by extensive\nnumerical simulations which show that Boltzmann routing can lead to a\nsignificant decrease in power consumption over basic, shortest-path routing\nschemes in realistic network conditions.\n", "versions": [{"version": "v1", "created": "Wed, 4 May 2016 22:55:17 GMT"}], "update_date": "2016-05-06", "authors_parsed": [["Mertikopoulos", "Panayotis", ""], ["Moustakas", "Aris L.", ""], ["Tzanakaki", "Anna", ""]]}, {"id": "1605.01510", "submitter": "Pieter Kleer", "authors": "Pieter Kleer, Guido Sch\\\"afer", "title": "The Impact of Worst-Case Deviations in Non-Atomic Network Routing Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a unifying model to study the impact of worst-case latency\ndeviations in non-atomic selfish routing games. In our model, latencies are\nsubject to (bounded) deviations which are taken into account by the players.\nThe quality deterioration caused by such deviations is assessed by the\n$\\textit{Deviation Ratio}$, i.e., the worst-case ratio of the cost of a Nash\nflow with respect to deviated latencies and the cost of a Nash flow with\nrespect to the unaltered latencies. This notion is inspired by the\n$\\textit{Price of Risk Aversion}$ recently studied by Nikolova and Stier-Moses.\nHere we generalize their model and results. In particular, we derive tight\nbounds on the Deviation Ratio for multi-commodity instances with a common\nsource and arbitrary non-negative and non-decreasing latency functions. These\nbounds exhibit a linear dependency on the size of the network (besides other\nparameters). In contrast, we show that for general multi-commodity networks an\nexponential dependency is inevitable. We also improve recent smoothness results\nto bound the Price of Risk Aversion.\n", "versions": [{"version": "v1", "created": "Thu, 5 May 2016 07:19:16 GMT"}, {"version": "v2", "created": "Wed, 22 Jun 2016 08:22:24 GMT"}], "update_date": "2016-06-23", "authors_parsed": [["Kleer", "Pieter", ""], ["Schäfer", "Guido", ""]]}, {"id": "1605.02054", "submitter": "Matt Weinberg", "authors": "Constantinos Daskalakis, Nikhil R. Devanur, S. Matthew Weinberg", "title": "Revenue Maximization and Ex-Post Budget Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of a revenue-maximizing seller with m items for sale\nto n additive bidders with hard budget constraints, assuming that the seller\nhas some prior distribution over bidder values and budgets. The prior may be\ncorrelated across items and budgets of the same bidder, but is assumed\nindependent across bidders. We target mechanisms that are Bayesian Incentive\nCompatible, but that are ex-post Individually Rational and ex-post budget\nrespecting. Virtually no such mechanisms are known that satisfy all these\nconditions and guarantee any revenue approximation, even with just a single\nitem. We provide a computationally efficient mechanism that is a\n$3$-approximation with respect to all BIC, ex-post IR, and ex-post budget\nrespecting mechanisms. Note that the problem is NP-hard to approximate better\nthan a factor of 16/15, even in the case where the prior is a point mass\n\\cite{ChakrabartyGoel}. We further characterize the optimal mechanism in this\nsetting, showing that it can be interpreted as a distribution over virtual\nwelfare maximizers.\n  We prove our results by making use of a black-box reduction from mechanism to\nalgorithm design developed by \\cite{CaiDW13b}. Our main technical contribution\nis a computationally efficient $3$-approximation algorithm for the algorithmic\nproblem that results by an application of their framework to this problem. The\nalgorithmic problem has a mixed-sign objective and is NP-hard to optimize\nexactly, so it is surprising that a computationally efficient approximation is\npossible at all. In the case of a single item ($m=1$), the algorithmic problem\ncan be solved exactly via exhaustive search, leading to a computationally\nefficient exact algorithm and a stronger characterization of the optimal\nmechanism as a distribution over virtual value maximizers.\n", "versions": [{"version": "v1", "created": "Fri, 6 May 2016 19:36:54 GMT"}], "update_date": "2016-05-09", "authors_parsed": [["Daskalakis", "Constantinos", ""], ["Devanur", "Nikhil R.", ""], ["Weinberg", "S. Matthew", ""]]}, {"id": "1605.02330", "submitter": "Kundan Kandhway", "authors": "Siddhartha Sarma, Kundan Kandhway, Joy Kuri", "title": "Robust Energy Harvesting Based on a Stackelberg Game", "comments": "5 pages, 6 figures. Extended version of an article that has been\n  published in IEEE Wireless Communications Letters. Published version can be\n  accessed at http://dx.doi.org/10.1109/LWC.2016.2555901", "journal-ref": "IEEE Wireless Communications Letters, Volume 5, Issue 3, pages\n  336-339, June 2016", "doi": "10.1109/LWC.2016.2555901", "report-no": null, "categories": "cs.IT cs.GT cs.MA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a Stackelberg game between a base station and a multi-antenna power\nbeacon for wireless energy harvesting in a multiple sensor node scenario.\nAssuming imperfect CSI between the sensor nodes and the power beacon, we\npropose a utility function that is based on throughput non-outage probability\nat the base station. We provide an analytical solution for the equilibrium in\ncase of a single sensor node. For the general case consisting of multiple\nsensor nodes, we provide upper and lower bounds on the power and price\n(players' strategies). We compare the bounds with solutions resulting from an\nexhaustive search and a relaxed semidefinite program, and find the upper bound\nto be tight.\n", "versions": [{"version": "v1", "created": "Sun, 8 May 2016 16:26:20 GMT"}], "update_date": "2016-10-27", "authors_parsed": [["Sarma", "Siddhartha", ""], ["Kandhway", "Kundan", ""], ["Kuri", "Joy", ""]]}, {"id": "1605.02402", "submitter": "Chathurika Mediwaththe", "authors": "Chathurika P. Mediwaththe, David B. Smith", "title": "Game-theoretic Demand-side Management Robust to Non-Ideal Consumer\n  Behavior in Smart Grid", "comments": "6 Pages, 5 figures, accepted for IEEE International Symposium on\n  Industrial Electronics 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates effects of realistic, non-ideal, decisions of energy\nusers as to whether to participate in an energy trading system proposed for\ndemand-side management of a residential community. The energy trading system\nadopts a non-cooperative Stackelberg game between a community energy storage\n(CES) device and users with rooftop photovoltaic panels where the CES operator\nis the leader and the users are the followers. Participating users determine\ntheir optimal energy trading starting time to minimize their personal daily\nenergy costs while subjectively viewing their opponents' actions. Following a\nnon-cooperative game, we study the subjective behavior of users when they\ndecide on energy trading starting time using prospect theory. We show that\ndepending on the decisions of participating-time, the proposed energy trading\nsystem has a unique Stackelberg equilibrium at which the CES operator maximizes\ntheir revenue while users minimize their personal energy costs attaining a Nash\nequilibrium. Simulation results confirm that the benefits of the energy trading\nsystem are robust to decisions of participating-time that significantly deviate\nfrom complete rationality.\n", "versions": [{"version": "v1", "created": "Mon, 9 May 2016 02:23:35 GMT"}], "update_date": "2016-05-10", "authors_parsed": [["Mediwaththe", "Chathurika P.", ""], ["Smith", "David B.", ""]]}, {"id": "1605.02489", "submitter": "Gal Bahar", "authors": "Gal Bahar, Itai Arieli, Rann Smorodinsky, Moshe Tennenholtz", "title": "Multi-Issue Social Learning", "comments": "Accepted to Mathematical social sciences journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider social learning where agents can only observe part of the\npopulation (modeled as neighbors on an undirected graph), face many decision\nproblems, and arrival order of the agents is unknown. The central question we\npose is whether there is a natural observability graph that prevents the\ninformation cascade phenomenon. We introduce the `celebrities graph' and prove\nthat indeed it allows for proper information aggregation in large populations\neven when the order at which agents decide is random and even when different\nissues are decided in different orders.\n", "versions": [{"version": "v1", "created": "Mon, 9 May 2016 09:24:06 GMT"}, {"version": "v2", "created": "Wed, 4 Jul 2018 16:15:35 GMT"}, {"version": "v3", "created": "Sun, 2 Feb 2020 11:23:32 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Bahar", "Gal", ""], ["Arieli", "Itai", ""], ["Smorodinsky", "Rann", ""], ["Tennenholtz", "Moshe", ""]]}, {"id": "1605.02651", "submitter": "Steven Miller", "authors": "Steve Miller and Joshua Knowles", "title": "A minimal model for the emergence of cooperation in randomly growing\n  networks", "comments": "Accepted (and presented) for European Conference on Artificial Life\n  (ECAL) 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperation is observed widely in nature and is thought an essential\ncomponent of many evolutionary processes, yet the mechanisms by which it arises\nand persists are still unclear. Among several theories, network reciprocity --\na model of inhomogeneous social interactions -- has been proposed as an\nenabling mechanism to explain the emergence of cooperation. Existing\nevolutionary models of this mechanism have tended to focus on highly\nheterogeneous (scale-free) networks, hence typically assume preferential\nattachment mechanisms, and consequently the prerequisite that individuals have\nglobal network knowledge. Within an evolutionary game theoretic context, using\nthe weak prisoner's dilemma as a metaphor for cooperation, we present a minimal\nmodel which describes network growth by chronological random addition of new\nnodes, combined with regular attrition of less fit members of the population.\nSpecifically our model does not require that agents have access to global\ninformation and does not assume scale-free network structure or a preferential\nattachment mechanism. Further our model supports the emergence of cooperation\nfrom initially non-cooperative populations. By reducing dependency on a number\nof assumptions, this model offers broad applicability and as such may support\nan explanation of the emergence of cooperation in early evolutionary\ntransitions, where few assumptions can be made.\n", "versions": [{"version": "v1", "created": "Mon, 9 May 2016 16:45:04 GMT"}], "update_date": "2016-05-10", "authors_parsed": [["Miller", "Steve", ""], ["Knowles", "Joshua", ""]]}, {"id": "1605.03081", "submitter": "Marco Scarsini", "authors": "Riccardo Colini-Baldeschi, Roberto Cominetti, and Marco Scarsini", "title": "On the Price of Anarchy of Highly Congested Nonatomic Network Games", "comments": "26 pages, 6 figures", "journal-ref": null, "doi": "10.1007/978-3-662-53354-3_10", "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider nonatomic network games with one source and one destination. We\nexamine the asymptotic behavior of the price of anarchy as the inflow\nincreases. In accordance with some empirical observations, we show that, under\nsuitable conditions, the price of anarchy is asymptotic to one. We show with\nsome counterexamples that this is not always the case. The counterexamples\noccur in very simple parallel graphs.\n", "versions": [{"version": "v1", "created": "Tue, 10 May 2016 16:19:08 GMT"}], "update_date": "2017-04-04", "authors_parsed": [["Colini-Baldeschi", "Riccardo", ""], ["Cominetti", "Roberto", ""], ["Scarsini", "Marco", ""]]}, {"id": "1605.03281", "submitter": "Hamidou Tembine", "authors": "Boualem Djehiche and Alain Tcheukam and Hamidou Tembine", "title": "Mean-Field-Type Games in Engineering", "comments": "84 pages, 24 figures, 183 references. to appear in AIMS 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A mean-field-type game is a game in which the instantaneous payoffs and/or\nthe state dynamics functions involve not only the state and the action profile\nbut also the joint distributions of state-action pairs. This article presents\nsome engineering applications of mean-field-type games including road traffic\nnetworks, multi-level building evacuation, millimeter wave wireless\ncommunications, distributed power networks, virus spread over networks, virtual\nmachine resource management in cloud networks, synchronization of oscillators,\nenergy-efficient buildings, online meeting and mobile crowdsensing.\n", "versions": [{"version": "v1", "created": "Wed, 11 May 2016 04:54:07 GMT"}, {"version": "v2", "created": "Fri, 29 Sep 2017 08:36:19 GMT"}, {"version": "v3", "created": "Wed, 29 Nov 2017 17:16:03 GMT"}], "update_date": "2017-11-30", "authors_parsed": [["Djehiche", "Boualem", ""], ["Tcheukam", "Alain", ""], ["Tembine", "Hamidou", ""]]}, {"id": "1605.03811", "submitter": "Romain Brenguier", "authors": "Romain Brenguier and Vojt\\v{e}ch Forejt", "title": "Decidability Results for Multi-objective Stochastic Games", "comments": "35 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study stochastic two-player turn-based games in which the objective of one\nplayer is to ensure several infinite-horizon total reward objectives, while the\nother player attempts to spoil at least one of the objectives. The games have\npreviously been shown not to be determined, and an approximation algorithm for\ncomputing a Pareto curve has been given. The major drawback of the existing\nalgorithm is that it needs to compute Pareto curves for finite horizon\nobjectives (for increasing length of the horizon), and the size of these Pareto\ncurves can grow unboundedly, even when the infinite-horizon Pareto curve is\nsmall. By adapting existing results, we first give an algorithm that computes\nthe Pareto curve for determined games. Then, as the main result of the paper,\nwe show that for the natural class of stopping games and when there are two\nreward objectives, the problem of deciding whether a player can ensure\nsatisfaction of the objectives with given thresholds is decidable. The result\nrelies on intricate and novel proof which shows that the Pareto curves contain\nonly finitely many points. As a consequence, we get that the two-objective\ndiscounted-reward problem for unrestricted class of stochastic games is\ndecidable.\n", "versions": [{"version": "v1", "created": "Thu, 12 May 2016 13:44:57 GMT"}], "update_date": "2016-05-13", "authors_parsed": [["Brenguier", "Romain", ""], ["Forejt", "Vojtěch", ""]]}, {"id": "1605.03826", "submitter": "Oren Ben-Zwi", "authors": "Oren Ben-Zwi", "title": "Walrasian's Characterization and a Universal Ascending Auction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a novel characterization of all Walrasian price vectors in terms\nof forbidden over- and under demanded sets for monotone gross substitute\ncombinatorial auctions.\n  For ascending and descending auctions we suggest a universal framework for\nfinding the minimum or maximum Walrasian price vectors for monotone gross\nsubstitute combinatorial auctions. An ascending (descending) auction is\nguaranteed to find the minimum (maximum) Walrasian if and only if it follows\nthe suggested framework.\n", "versions": [{"version": "v1", "created": "Thu, 12 May 2016 14:25:14 GMT"}], "update_date": "2016-05-13", "authors_parsed": [["Ben-Zwi", "Oren", ""]]}, {"id": "1605.03838", "submitter": "Gali Noti", "authors": "Noam Nisan and Gali Noti", "title": "An Experimental Evaluation of Regret-Based Econometrics", "comments": "WWW 2017, April 3--7, 2017, Perth, Australia", "journal-ref": null, "doi": "10.1145/3038912.3052621", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using data obtained in a controlled ad-auction experiment that we ran, we\nevaluate the regret-based approach to econometrics that was recently suggested\nby Nekipelov, Syrgkanis, and Tardos (EC 2015). We found that despite the weak\nregret-based assumptions, the results were (at least) as accurate as those\nobtained using classic equilibrium-based assumptions. En route we studied to\nwhat extent humans actually minimize regret in our ad auction, and found a\nsignificant difference between the \"high types\" (players with a high valuation)\nwho indeed rationally minimized regret and the \"low types\" who significantly\noverbid. We suggest that correcting for these biases and adjusting the\nregret-based econometric method may improve the accuracy of estimated values.\n", "versions": [{"version": "v1", "created": "Thu, 12 May 2016 14:43:41 GMT"}, {"version": "v2", "created": "Sun, 26 Feb 2017 14:45:22 GMT"}], "update_date": "2017-02-28", "authors_parsed": [["Nisan", "Noam", ""], ["Noti", "Gali", ""]]}, {"id": "1605.04004", "submitter": "Saeed Seddighin", "authors": "Sina Dehghani, MohammadTaghi Hajiaghayi, Hamid Mahini, Saeed Seddighin", "title": "Price of Competition and Dueling Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study competition in a general framework introduced by Immorlica et al.\nand answer their main open question. Immorlica et al. considered classic\noptimization problems in terms of competition and introduced a general class of\ngames called dueling games. They model this competition as a zero-sum game,\nwhere two players are competing for a user's satisfaction. In their main and\nmost natural game, the ranking duel, a user requests a webpage by submitting a\nquery and players output an ordering over all possible webpages based on the\nsubmitted query. The user tends to choose the ordering which displays her\nrequested webpage in a higher rank. The goal of both players is to maximize the\nprobability that her ordering beats that of her opponent and gets the user's\nattention. Immorlica et al. show this game directs both players to provide\nsuboptimal search results. However, they leave the following as their main open\nquestion: \"does competition between algorithms improve or degrade expected\nperformance?\" In this paper, we resolve this question for the ranking duel and\na more general class of dueling games.\n  More precisely, we study the quality of orderings in a competition between\ntwo players. This game is a zero-sum game, and thus any Nash equilibrium of the\ngame can be described by minimax strategies. Let the value of the user for an\nordering be a function of the position of her requested item in the\ncorresponding ordering, and the social welfare for an ordering be the expected\nvalue of the corresponding ordering for the user. We propose the price of\ncompetition which is the ratio of the social welfare for the worst minimax\nstrategy to the social welfare obtained by a social planner. We use this\ncriterion for analyzing the quality of orderings in the ranking duel. We prove\nthe quality of minimax results is surprisingly close to that of the optimum\nsolution.\n", "versions": [{"version": "v1", "created": "Thu, 12 May 2016 22:50:36 GMT"}, {"version": "v2", "created": "Wed, 3 Aug 2016 13:36:13 GMT"}, {"version": "v3", "created": "Sun, 18 Dec 2016 08:29:24 GMT"}], "update_date": "2016-12-20", "authors_parsed": [["Dehghani", "Sina", ""], ["Hajiaghayi", "MohammadTaghi", ""], ["Mahini", "Hamid", ""], ["Seddighin", "Saeed", ""]]}, {"id": "1605.04026", "submitter": "Georgios Amanatidis", "authors": "Georgios Amanatidis, Georgios Birmpas and Evangelos Markakis", "title": "On Truthful Mechanisms for Maximin Share Allocations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a fair division problem with indivisible items, namely the\ncomputation of maximin share allocations. Given a set of $n$ players, the\nmaximin share of a single player is the best she can guarantee to herself, if\nshe would partition the items in any way she prefers, into $n$ bundles, and\nthen receive her least desirable bundle. The objective then is to find an\nallocation, so that each player is guaranteed her maximin share. Previous works\nhave studied this problem mostly algorithmically, providing constant factor\napproximation algorithms. In this work we embark on a mechanism design approach\nand investigate the existence of truthful mechanisms. We propose three models\nregarding the information that the mechanism attempts to elicit from the\nplayers, based on the cardinal and ordinal representation of preferences. We\nestablish positive and negative (impossibility) results for each model and\nhighlight the limitations imposed by truthfulness on the approximability of the\nproblem. Finally, we pay particular attention to the case of two players, which\nalready leads to challenging questions.\n", "versions": [{"version": "v1", "created": "Fri, 13 May 2016 01:32:24 GMT"}], "update_date": "2016-05-16", "authors_parsed": [["Amanatidis", "Georgios", ""], ["Birmpas", "Georgios", ""], ["Markakis", "Evangelos", ""]]}, {"id": "1605.04233", "submitter": "Seth Frey", "authors": "Seth Frey, Paul L. Williams, Dominic K. Albino", "title": "Information encryption in the expert management of strategic uncertainty", "comments": "21 pages, 3 figures, 12 page SI", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strategic agents in incomplete-information environments have a conflicted\nrelationship with uncertainty: it can keep them unpredictable to their\nopponents, but it must also be overcome to predict the actions of those\nopponents. We use a multivariate generalization of information theory to\ncharacterize the information processing behavior of strategic reasoning\nexperts. We compare expert and novice poker players --- \"sharks\" and \"fish\" ---\nover 1.75 million hands of online two-player No-Limit Texas Hold'em (NLHE).\nComparing the effects of privately known and publicly signaled information on\nwagering behavior, we find that the behavior of sharks coheres with information\nthat emerges only from the interaction of public and private sources ---\n\"synergistic\" information that does not exist in either source alone. This\nimplies that the effect of public information on shark behavior is better\nencrypted: it cannot be reconstructed without access to the hidden state of\nprivate cards. Integrative information processing affects not only one's own\nstrategic behavior, but the ability of others to predict it. By characterizing\nthe informational structure of complex strategic interactions, we offer a\ndetailed account of how experts extract, process, and conceal valuable\ninformation in high-uncertainty, high-stakes competitive environments.\n", "versions": [{"version": "v1", "created": "Fri, 13 May 2016 16:11:00 GMT"}], "update_date": "2016-05-16", "authors_parsed": [["Frey", "Seth", ""], ["Williams", "Paul L.", ""], ["Albino", "Dominic K.", ""]]}, {"id": "1605.04381", "submitter": "Hisao Tamaki", "authors": "Hisao Tamaki", "title": "Finalizing tentative matches from truncated preference lists", "comments": "29 pages, 3 figures, 2 tables. Simulation results added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the standard hospitals/residents problem, or the two-sided\nmany-to-one stable matching problem, and assume that the true preference lists\nof both sides are complete and strict. The lists actually submitted, however,\nare truncated. Let I be such a truncated instance. When we apply the\nresident-proposing deferred acceptance algorithm of Gale and Shapley to I, the\nalgorithm produces a set of tentative matches (resident-hospital pairs). We say\nthat a tentative match in this set is finalizable in I if it is in the\nresident-optimal stable matching for every completion of I (a complete instance\nof which I is a truncation). We study the problem we call FTM (Finalizability\nof Tentative Matches) of deciding if a given tentative match is finalizable in\na given truncated instance. We first show that FTM is coNP-complete, even in\nthe stable marriage case where the quota of each hospital is restricted to be\n1.\n  We then introduce and study a special case: we say that a truncated instance\nis resident-minimal, if further truncation of the preference lists of the\nresidents inevitably changes the set of tentative matches. Resident-minimal\ninstances are not only practically motivated but also useful in natural\nbacktrack computations for the general case. We give a computationally useful\ncharacterization of negative instances of FTM in this special case, which, for\ninstance, can be used to formulate an integer program for FTM. For the stable\nmarriage case, in particular, this characterization yields a polynomial time\nalgorithm to solve FTM for resident-minimal instances. On the other hand, we\nshow that FTM remains coNP-complete for resident-minimal instances, if the\nmaximum quota of the hospitals is 2 or larger.\n  We also give a polynomial-time decidable sufficient condition for a tentative\nmatch to be finalizable in the general case.\n", "versions": [{"version": "v1", "created": "Sat, 14 May 2016 05:14:45 GMT"}, {"version": "v2", "created": "Wed, 7 Dec 2016 05:58:39 GMT"}], "update_date": "2016-12-08", "authors_parsed": [["Tamaki", "Hisao", ""]]}, {"id": "1605.04399", "submitter": "Maria  Serna", "authors": "Xavier Molinero and Fabi\\'an Riquelme and Maria Serna", "title": "Measuring satisfaction in societies with opinion leaders and mediators", "comments": "29 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An opinion leader-follower model (OLF) is a two-action collective\ndecision-making model for societies, in which three kinds of actors are\nconsidered: \"opinion leaders\", \"followers\", and \"independent actors\". In OLF\nthe initial decision of the followers can be modified by the influence of the\nleaders. Once the final decision is set, a collective decision is taken\napplying the simple majority rule. We consider a generalization of \\OLF, the\ngOLF models which allow collective decision taken by rules different from the\nsingle majority rule. Inspired in this model we define two new families of\ncollective decision-making models associated with cooperative influence games.\nWe define the \"oblivious\" and \"non-oblivious\" influence models. We show that\ngOLF models are non-oblivious influence models played on a two layered\nbipartite influence graph.\n  Together with OLF models, the Satisfaction measure was introduced and\nstudied. We analyze the computational complexity of the satisfaction measure\nfor gOLF models and the other collective decision-making models introduced in\nthe paper. We show that computing the satisfaction measure is #P-hard in all\nthe considered models except for the basic OLF inwhich the complexity remains\nopen. On the other hand, we provide two subfamilies of decision models in which\nthe satisfaction measure can be computed in polynomial time.\n  Exploiting the relationship with influence games, we can relate the\nsatisfaction measure with the Rae index of an associated simple game. The Rae\nindex is closely related to the Banzhaf value. Thus, our results also extend\nthe families of simple games for which computing the Rae index and the Banzhaf\nvalue is computationally hard.\n", "versions": [{"version": "v1", "created": "Sat, 14 May 2016 09:33:00 GMT"}], "update_date": "2016-05-17", "authors_parsed": [["Molinero", "Xavier", ""], ["Riquelme", "Fabián", ""], ["Serna", "Maria", ""]]}, {"id": "1605.04674", "submitter": "Angelo Fanelli", "authors": "Ioannis Caragiannis and Angelo Fanelli", "title": "An almost ideal coordination mechanism for unrelated machine scheduling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coordination mechanisms aim to mitigate the impact of selfishness when\nscheduling jobs to different machines. Such a mechanism defines a scheduling\npolicy within each machine and naturally induces a game among the selfish job\nowners. The desirable properties of a coordination mechanism includes\nsimplicity in its definition and efficiency of the outcomes of the induced\ngame. We present a broad class of coordination mechanisms for unrelated machine\nscheduling that are simple to define and we identify one of its members\n(mechanism \\Dcoord) that is superior to all known mechanisms. \\Dcoord\\ induces\npotential games with logarithmic price of anarchy and only constant price of\nstability. Both bounds are almost optimal.\n", "versions": [{"version": "v1", "created": "Mon, 16 May 2016 08:15:28 GMT"}], "update_date": "2016-05-17", "authors_parsed": [["Caragiannis", "Ioannis", ""], ["Fanelli", "Angelo", ""]]}, {"id": "1605.05114", "submitter": "Arkadii Slinko", "authors": "Liam O'Dwyer and Arkadii Slinko", "title": "Growth of Dimension in Complete Simple Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of dimension in simple games was introduced as a measure of the\nremoteness of a given game from a weighted game. Taylor and Zwicker (1993)\ndemonstrated that the dimension of a simple game can grow exponentially in the\nnumber of players. However, the problem of worst-case growth of the dimension\nin complete games was left open. Freixas and Puente (2008) showed that complete\ngames of arbitrary dimension exist and, in particular, their examples\ndemonstrate that the worst-case growth of dimension in complete games is at\nleast linear. In this paper, using a novel technique of Kurz and Napel (2016),\nwe demonstrate that the worst-case growth of dimension in complete simple games\nis exponential in the number of players.\n", "versions": [{"version": "v1", "created": "Tue, 17 May 2016 11:14:55 GMT"}], "update_date": "2016-05-18", "authors_parsed": [["O'Dwyer", "Liam", ""], ["Slinko", "Arkadii", ""]]}, {"id": "1605.06368", "submitter": "Andrea Tagarelli", "authors": "Marco Alberto Javarone, Roberto Interdonato, Andrea Tagarelli", "title": "Modeling Evolutionary Dynamics of Lurking in Social Networks", "comments": "13 pages, 5 figures. Accepted at CompleNet 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lurking is a complex user-behavioral phenomenon that occurs in all\nlarge-scale online communities and social networks. It generally refers to the\nbehavior characterizing users that benefit from the information produced by\nothers in the community without actively contributing back to the production of\nsocial content. The amount and evolution of lurkers may strongly affect an\nonline social environment, therefore understanding the lurking dynamics and\nidentifying strategies to curb this trend are relevant problems. In this\nregard, we introduce the Lurker Game, i.e., a model for analyzing the\ntransitions from a lurking to a non-lurking (i.e., active) user role, and vice\nversa, in terms of evolutionary game theory. We evaluate the proposed Lurker\nGame by arranging agents on complex networks and analyzing the system\nevolution, seeking relations between the network topology and the final\nequilibrium of the game. Results suggest that the Lurker Game is suitable to\nmodel the lurking dynamics, showing how the adoption of rewarding mechanisms\ncombined with the modeling of hypothetical heterogeneity of users' interests\nmay lead users in an online community towards a cooperative behavior.\n", "versions": [{"version": "v1", "created": "Fri, 20 May 2016 14:17:29 GMT"}], "update_date": "2016-05-23", "authors_parsed": [["Javarone", "Marco Alberto", ""], ["Interdonato", "Roberto", ""], ["Tagarelli", "Andrea", ""]]}, {"id": "1605.06491", "submitter": "Matjaz Perc", "authors": "Marco A. Amaral, Lucas Wardil, Matjaz Perc, Jafferson K. L. da Silva", "title": "Evolutionary mixed games in structured populations: Cooperation and the\n  benefits of heterogeneity", "comments": "8 two-column pages, 9 figures; accepted for publication in Physical\n  Review E", "journal-ref": "Phys. Rev. E 93 (2016) 042304", "doi": "10.1103/PhysRevE.93.042304", "report-no": null, "categories": "physics.soc-ph cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary games on networks traditionally involve the same game at each\ninteraction. Here we depart from this assumption by considering mixed games,\nwhere the game played at each interaction is drawn uniformly at random from a\nset of two different games. While in well-mixed populations the random mixture\nof the two games is always equivalent to the average single game, in structured\npopulations this is not always the case. We show that the outcome is in fact\nstrongly dependent on the distance of separation of the two games in the\nparameter space. Effectively, this distance introduces payoff heterogeneity,\nand the average game is returned only if the heterogeneity is small. For higher\nlevels of heterogeneity the distance to the average game grows, which often\ninvolves the promotion of cooperation. The presented results support preceding\nresearch that highlights the favorable role of heterogeneity regardless of its\norigin, and they also emphasize the importance of the population structure in\namplifying facilitators of cooperation.\n", "versions": [{"version": "v1", "created": "Fri, 20 May 2016 19:54:08 GMT"}], "update_date": "2016-05-23", "authors_parsed": [["Amaral", "Marco A.", ""], ["Wardil", "Lucas", ""], ["Perc", "Matjaz", ""], ["da Silva", "Jafferson K. L.", ""]]}, {"id": "1605.06564", "submitter": "Sanjoy Das", "authors": "M. Nazif Faqiry, Sanjoy Das", "title": "Double-Sided Energy Auction Equilibrium Under Price Anticipation", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the problem of proportionally fair double sided\nenergy auction involving buying and selling agents. The grid is assumed to be\noperating under islanded mode. A distributed auction algorithm that can be\nimplemented by an aggregator, as well as a possible approach by which the\nagents may approximate price anticipation is considered. Equilibrium conditions\narising due to price anticipation is analyzed. A modified auction to mitigate\nthe resulting loss in efficiency due to such behavior is suggested. This\nmodified auction allows the aggregate social welfare of the agents to be\narbitrarily close to that attainable with price taking agents. Next,\nequilibrium conditions when the aggregator collects a surcharge price per unit\nof energy traded is examined. A biobjective optimization problem is identified\nthat takes into account both the agents social welfare as well as the\naggregator revenue from the surcharge. Results of extensive simulations, which\ncorroborate the theoretical analysis, are reported.\n", "versions": [{"version": "v1", "created": "Sat, 21 May 2016 00:25:40 GMT"}], "update_date": "2016-05-24", "authors_parsed": [["Faqiry", "M. Nazif", ""], ["Das", "Sanjoy", ""]]}, {"id": "1605.06821", "submitter": "Ebrahim Moradi Shahrivar", "authors": "Ebrahim Moradi Shahrivar and Shreyas Sundaram", "title": "The Game-Theoretic Formation of Interconnections Between Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a network design game where the objective of the players is to\ndesign the interconnections between the nodes of two different networks $G_1$\nand $G_2$ in order to maximize certain local utility functions. In this\nsetting, each player is associated with a node in $G_1$ and has functional\ndependencies on certain nodes in $G_2$. We use a distance-based utility for the\nplayers in which the goal of each player is to purchase a set of edges\n(incident to its associated node) such that the sum of the distances between\nits associated node and the nodes it depends on in $G_2$ is minimized. We\nconsider a heterogeneous set of players (i.e., players have their own costs and\nbenefits for constructing edges). We show that finding a best response of a\nplayer in this game is NP-hard. Despite this, we characterize some properties\nof the best response actions which are helpful in determining a Nash\nequilibrium for certain instances of this game. In particular, we prove\nexistence of pure Nash equilibria in this game when $G_2$ contains a star\nsubgraph, and provide an algorithm that outputs such an equilibrium for any set\nof players. Finally, we show that the price of anarchy in this game can be\narbitrarily large.\n", "versions": [{"version": "v1", "created": "Sun, 22 May 2016 17:10:06 GMT"}, {"version": "v2", "created": "Wed, 21 Dec 2016 00:37:53 GMT"}], "update_date": "2016-12-22", "authors_parsed": [["Shahrivar", "Ebrahim Moradi", ""], ["Sundaram", "Shreyas", ""]]}, {"id": "1605.07107", "submitter": "Tejas Bodas", "authors": "Tejas Bodas, D. Manjunath", "title": "Revenue Maximization in Service Systems with Heterogeneous Customers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider revenue maximization problem for a two server\nsystem in the presence of heterogeneous customers. We assume that the customers\ndiffer in their cost for unit delay and this is modeled as a continuous random\nvariable with a distribution $F.$ We also assume that each server charges an\nadmission price to each customer that decide to join its queue. We first\nconsider the monopoly problem where both the servers belong to a single\noperator. The heterogeneity of the customer makes the analysis of the problem\ndifficult. The difficulty lies in the inability to characterize the equilibrium\nqueue arrival rates as a function of the admission prices. We provide an\nequivalent formulation with the queue arrival rates as the optimization\nvariable simplifying the analysis for revenue rate maximization for the\nmonopoly. We then consider the duopoly problem where each server competes with\nthe other server to maximize its revenue rate. For the duopoly problem, the\ninterest is to obtain the set of admission prices satisfying the Nash\nequilibrium conditions. While the problem is in general difficult to analyze,\nwe consider the special case when the two servers are identical. For such a\nduopoly system, we obtain the necessary condition for existence of symmetric\nNash equilibrium of the admission prices. The knowledge of the distribution $F$\ncharacterizing the heterogeneity of the customers is necessary to solve the\nmonopoly and the duopoly problem. However, for most practical scenarios, the\nfunctional form of $F$ may not be known to the system operator and in such\ncases, the revenue maximizing prices cannot be determined. In the last part of\nthe paper, we provide a simple method to estimate the distribution $F$ by\nsuitably varying the admission prices. We illustrate the method with some\nnumerical examples.\n", "versions": [{"version": "v1", "created": "Mon, 23 May 2016 17:29:07 GMT"}], "update_date": "2016-05-24", "authors_parsed": [["Bodas", "Tejas", ""], ["Manjunath", "D.", ""]]}, {"id": "1605.07483", "submitter": "Amir Ban", "authors": "Amir Ban, Yossi Azar, Yishay Mansour", "title": "When should an expert make a prediction?", "comments": "Full version of paper to appear at EC'16 Maastricht", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a setting where in a known future time, a certain continuous\nrandom variable will be realized. There is a public prediction that gradually\nconverges to its realized value, and an expert that has access to a more\naccurate prediction. Our goal is to study {\\em when} should the expert reveal\nhis information, assuming that his reward is based on a logarithmic market\nscoring rule (i.e., his reward is proportional to the gain in log-likelihood of\nthe realized value).\n  Our contributions are: (1) we characterize the expert's optimal policy and\nshow that it is threshold based. (2) we analyze the expert's asymptotic\nexpected optimal reward and show a tight connection to the Law of the Iterated\nLogarithm, and (3) we give an efficient dynamic programming algorithm to\ncompute the optimal policy.\n", "versions": [{"version": "v1", "created": "Tue, 24 May 2016 14:39:34 GMT"}], "update_date": "2016-05-25", "authors_parsed": [["Ban", "Amir", ""], ["Azar", "Yossi", ""], ["Mansour", "Yishay", ""]]}, {"id": "1605.07753", "submitter": "Edon Kelmendi", "authors": "Edon Kelmendi (LaBRI), Hugo Gimbert (LaBRI)", "title": "Deciding Maxmin Reachability in Half-Blind Stochastic Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two-player, turn-based, stochastic games with reachability conditions are\nconsidered, where the maximizer has no information (he is blind) and is\nrestricted to deterministic strategies whereas the minimizer is perfectly\ninformed. We ask the question of whether the game has maxmin 1, in other words\nwe ask whether for all $\\epsilon>0$ there exists a deterministic strategy for\nthe (blind) maximizer such that against all the strategies of the minimizer, it\nis possible to reach the set of final states with probability larger than\n$1-\\epsilon$. This problem is undecidable in general, but we define a class of\ngames, called leaktight half-blind games where the problem becomes decidable.\nWe also show that mixed strategies in general are stronger for both players and\nthat optimal strategies for the minimizer might require infinite-memory.\n", "versions": [{"version": "v1", "created": "Wed, 25 May 2016 06:53:44 GMT"}], "update_date": "2016-05-26", "authors_parsed": [["Kelmendi", "Edon", "", "LaBRI"], ["Gimbert", "Hugo", "", "LaBRI"]]}, {"id": "1605.07774", "submitter": "Po-An Chen", "authors": "Po-An Chen, Chi-Jen Lu", "title": "Generalized Mirror Descents in Congestion Games", "comments": "In Artificial Intelligence, Volume 241, Dec 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Different types of dynamics have been studied in repeated game play, and one\nof them which has received much attention recently consists of those based on\n\"no-regret\" algorithms from the area of machine learning. It is known that\ndynamics based on generic no-regret algorithms may not converge to Nash\nequilibria in general, but to a larger set of outcomes, namely coarse\ncorrelated equilibria. Moreover, convergence results based on generic no-regret\nalgorithms typically use a weaker notion of convergence: the convergence of the\naverage plays instead of the actual plays. Some work has been done showing that\nwhen using a specific no-regret algorithm, the well-known multiplicative\nupdates algorithm, convergence of actual plays to equilibria can be shown and\nbetter quality of outcomes in terms of the price of anarchy can be reached for\natomic congestion games and load balancing games. Are there more cases of\nnatural no-regret dynamics that perform well in suitable classes of games in\nterms of convergence and quality of outcomes that the dynamics converge to?\n  We answer this question positively in the bulletin-board model by showing\nthat when employing the mirror-descent algorithm, a well-known generic\nno-regret algorithm, the actual plays converge quickly to equilibria in\nnonatomic congestion games. Furthermore, the bandit model considers a probably\nmore realistic and prevalent setting with only partial information, in which at\neach time step each player only knows the cost of her own currently played\nstrategy, but not any costs of unplayed strategies. For the class of atomic\ncongestion games, we propose a family of bandit algorithms based on the\nmirror-descent algorithms previously presented, and show that when each player\nindividually adopts such a bandit algorithm, their joint (mixed) strategy\nprofile quickly converges with implications.\n", "versions": [{"version": "v1", "created": "Wed, 25 May 2016 08:32:48 GMT"}, {"version": "v2", "created": "Thu, 13 Oct 2016 02:51:10 GMT"}], "update_date": "2016-10-14", "authors_parsed": [["Chen", "Po-An", ""], ["Lu", "Chi-Jen", ""]]}, {"id": "1605.07896", "submitter": "Diodato Ferraioli", "authors": "Vincenzo Auletta, Diodato Ferraioli, Ashutosh Rai, Giannicola Scarpa,\n  Andreas Winter", "title": "Belief-Invariant and Quantum Equilibria in Games of Incomplete\n  Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Drawing on ideas from game theory and quantum physics, we investigate\nnonlocal correlations from the point of view of equilibria in games of\nincomplete information. These equilibria can be classified in decreasing power\nas communication equilibria, belief-invariant equilibria, and correlated\nequilibria, all of which contain the familiar Nash equilibria. The notion of\nbelief-invariant equilibrium appeared in game theory in the 90s. However, the\nclass of non-signalling correlations associated to belief-invariance arose\nnaturally already in the 80s in the foundations of quantum mechanics. In the\npresent work, we explain and unify these two origins of the idea and study the\nabove classes of equilibria, together with quantum correlated equilibria, using\ntools from quantum information but the language of (algorithmic) game theory.\nWe present a general framework of belief-invariant communication equilibria,\nwhich contains correlated equilibria and quantum correlated equilibria as\nspecial cases. Our framework also contains the theory of Bell inequalities and\ntheir violations due to non-locality, which is a question of intense interest\nin the foundations of quantum mechanics, and it was indeed the original\nmotivation for the aforementioned studies. Moreover, in our framework we can\nalso model quantum games where players have conflicting interests, a recent\ndeveloping topic in physics. We then use our framework to show new results\nrelated to the social welfare of equilibria. Namely, we exhibit a game where\nbelief-invariance is socially better than any correlated equilibrium, and a\ngame where all non-belief-invariant communication equilibria have a suboptimal\nsocial welfare. We also show that optimal social welfare can sometimes be\nachieved by quantum mechanical correlations, which do not need an informed\nmediator to be implemented, and go beyond the classical shared randomness\napproach.\n", "versions": [{"version": "v1", "created": "Wed, 25 May 2016 14:24:00 GMT"}, {"version": "v2", "created": "Wed, 24 Aug 2016 09:05:13 GMT"}, {"version": "v3", "created": "Thu, 23 Mar 2017 16:25:17 GMT"}, {"version": "v4", "created": "Wed, 12 May 2021 09:43:17 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Auletta", "Vincenzo", ""], ["Ferraioli", "Diodato", ""], ["Rai", "Ashutosh", ""], ["Scarpa", "Giannicola", ""], ["Winter", "Andreas", ""]]}, {"id": "1605.08143", "submitter": "David Lee", "authors": "Ashish Goel and David T. Lee", "title": "Towards large-scale deliberative decision-making: small groups and the\n  importance of triads", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CY cs.DS cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though deliberation is a critical component of democratic decision-making,\nexisting deliberative processes do not scale to large groups of people.\nMotivated by this, we propose a model in which large-scale decision-making\ntakes place through a sequence of small group interactions. Our model considers\na group of participants, each having an opinion which together form a graph. We\nshow that for median graphs, a class of graphs including grids and trees, it is\npossible to use a small number of three-person interactions to tightly\napproximate the wisdom of the crowd, defined here to be the generalized median\nof participant opinions, even when agents are strategic. Interestingly, we also\nshow that this sharply contrasts with small groups of size two, for which we\nprove an impossibility result. Specifically, we show that it is impossible to\nuse sequences of two-person interactions satisfying natural axioms to find a\ntight approximation of the generalized median, even when agents are\nnon-strategic. Our results demonstrate the potential of small group\ninteractions for reaching global decision-making properties.\n", "versions": [{"version": "v1", "created": "Thu, 26 May 2016 05:04:21 GMT"}, {"version": "v2", "created": "Sun, 5 Jun 2016 01:47:15 GMT"}], "update_date": "2016-06-07", "authors_parsed": [["Goel", "Ashish", ""], ["Lee", "David T.", ""]]}, {"id": "1605.08682", "submitter": "Uzay \\c{C}etin", "authors": "Uzay Cetin and Haluk O. Bingol", "title": "The Dose of the Threat Makes the Resistance for Cooperation", "comments": null, "journal-ref": "Advances in Complex Systems, Volume 19, Issue 08, 2016", "doi": "10.1142/S0219525916500156", "report-no": null, "categories": "physics.soc-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose to reformulate the payoff matrix structure of Prisoner's Dilemma\nGame, by introducing threat and greed factors, and show their effect on the\nco-evolution of memory and cooperation. Our findings are as follows. (i) Memory\nprotects cooperation. (ii) To our surprise, greater memory size is unfavorable\nto evolutionary success when there is no threat. In the absence of threat,\nsubsequent generations lose their memory and are consequently invaded by\ndefectors. (iii) In contrast, the presence of an appropriate level of threat\ntriggers the emergence of a self-protection mechanism for cooperation, which\nmanifests itself as an increase in memory size within subsequent generations.\nOn the evolutionary level, memory size acts like an immune response of the\ngenerations against aggressive defection. (iv) Even more extreme threat results\nagain in defection. Our findings boil down to the following: The dose of the\nthreat makes the resistance for cooperation.\n", "versions": [{"version": "v1", "created": "Sat, 21 May 2016 12:11:42 GMT"}, {"version": "v2", "created": "Fri, 23 Sep 2016 13:23:45 GMT"}, {"version": "v3", "created": "Wed, 14 Dec 2016 20:41:58 GMT"}], "update_date": "2017-04-20", "authors_parsed": [["Cetin", "Uzay", ""], ["Bingol", "Haluk O.", ""]]}, {"id": "1605.08840", "submitter": "Song Zuo", "authors": "Vahab Mirrokni, Renato Paes Leme, Pingzhong Tang, Song Zuo", "title": "Optimal dynamic mechanisms with ex-post IR via bank accounts", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lately, the problem of designing multi-stage dynamic mechanisms has been\nshown to be both theoretically challenging and practically important. In this\npaper, we consider the problem of designing revenue optimal dynamic mechanism\nfor a setting where an auctioneer sells a set of items to a buyer in multiple\nstages. At each stage, there could be multiple items for sale but each item can\nonly appear in one stage. The type of the buyer at each stage is thus a\nmulti-dimensional vector characterizing the buyer's valuations of the items at\nthat stage and is assumed to be stage-wise independent.\n  In particular, we propose a novel class of mechanisms called bank account\nmechanisms. Roughly, a bank account mechanism is no different from any\nstage-wise individual mechanism except for an augmented structure called bank\naccount, a real number for each node that summarizes the history so far. We\nfirst establish that the optimal revenue from any dynamic mechanism in this\nsetting can be achieved by a bank account mechanism, and we provide a simple\ncharacterization of the set of incentive compatible and ex-post individually\nrational bank account mechanisms. Based on these characterizations, we then\ninvestigate the problem of finding the (approximately) optimal bank account\nmechanisms. We prove that there exists a simple, randomized bank account\nmechanism that approximates optimal revenue up to a constant factor. Our result\nis general and can accommodate previous approximation results in single-shot\nmulti-dimensional mechanism design. Based on the previous mechanism, we further\nshow that there exists a deterministic bank account mechanism that achieves\nconstant-factor approximation as well. Finally, we consider the problem of\ncomputing optimal mechanisms when the type space is discrete and provide an\nFPTAS via linear and dynamic programming.\n", "versions": [{"version": "v1", "created": "Sat, 28 May 2016 03:44:52 GMT"}, {"version": "v2", "created": "Wed, 6 Jul 2016 00:50:19 GMT"}], "update_date": "2016-07-07", "authors_parsed": [["Mirrokni", "Vahab", ""], ["Leme", "Renato Paes", ""], ["Tang", "Pingzhong", ""], ["Zuo", "Song", ""]]}, {"id": "1605.08863", "submitter": "Suiqian Luo", "authors": "Suiqian Luo, Pingzhong Tang, Chenggang Wu, Jianyang Zeng", "title": "Approximation of barter exchanges with cycle length constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the clearing problem in the barter exchange market. The problem,\ndescribed in the terminology of graph theory, is to find a set of\nvertex-disjoint, length-restricted cycles that maximize the total weight in a\nweighted digraph. The problem has previously been shown to be NP-hard. We\nadvance the understanding of this problem by the following contributions.\n  We prove three constant inapproximability results for this problem. For the\nweighted graphs, we prove that it is NP-hard to approximate the clearing\nproblem within a factor of 14/13 under general length constraints and within a\nfactor of 434/433 when the cycle length is not longer than 3. For the\nunweighted graphs, we prove that this problem is NP-hard to approximate within\na factor of 698/697.\n  For the unweighted graphs when the cycle length is not longer than 3, we\ndesign and implement two simple and practical algorithms. Experiments on\nsimulated data suggest that these algorithms yield excellent performances.\n", "versions": [{"version": "v1", "created": "Sat, 28 May 2016 09:00:20 GMT"}], "update_date": "2016-05-31", "authors_parsed": [["Luo", "Suiqian", ""], ["Tang", "Pingzhong", ""], ["Wu", "Chenggang", ""], ["Zeng", "Jianyang", ""]]}, {"id": "1605.09012", "submitter": "Yuval Rabani", "authors": "Krishnamurthy Dvijotham and Yuval Rabani and Leonard J. Schulman", "title": "Market Dynamics of Best-Response with Lookahead", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One attractive approach to market dynamics is the level $k$ model in which a\nlevel $0$ player adopts a very simple response to current conditions, a level\n$1$ player best-responds to a model in which others take level $0$ actions, and\nso forth. (This is analogous to $k$-ply exploration of game trees in AI, and to\nreceding-horizon control in control theory.) If players have deterministic\nmental models with this kind of finite-level response, there is obviously no\nway their mental models can all be consistent. Nevertheless, there is\nexperimental evidence that people act this way in many situations, motivating\nthe question of what the dynamics of such interactions lead to.\n  We address this question in the setting of Fisher Markets with constant\nelasticities of substitution (CES) utilities, in the weak gross substitutes\n(WGS) regime. We show that despite the inconsistency of the mental models, and\neven if players' models change arbitrarily from round to round, the market\nconverges to its unique equilibrium. (We show this for both synchronous and\nasynchronous discrete-time updates.) Moreover, the result is computationally\nfeasible in the sense that the convergence rate is linear, i.e., the distance\nto equilibrium decays exponentially fast. To the best of our knowledge, this is\nthe first result that demonstrates, in Fisher markets, convergence at any rate\nfor dynamics driven by a plausible model of seller incentives. Even for the\nsimple case of (level $0$) best-response dynamics, where we observe that\nconvergence at some rate can be derived from recent results in convex\noptimization, our result is the first to demonstrate a linear rate of\nconvergence.\n", "versions": [{"version": "v1", "created": "Sun, 29 May 2016 14:54:25 GMT"}], "update_date": "2016-05-31", "authors_parsed": [["Dvijotham", "Krishnamurthy", ""], ["Rabani", "Yuval", ""], ["Schulman", "Leonard J.", ""]]}, {"id": "1605.09171", "submitter": "Guillaume Basse", "authors": "Guillaume W. Basse, Hossein Azari Soufiani and Diane Lambert", "title": "Randomization and The Pernicious Effects of Limited Budgets on Auction\n  Experiments", "comments": "Appeared in Proceedings of the 19th International Conference on\n  Artificial Intelligence and Statistics (AISTATS) 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Buyers (e.g., advertisers) often have limited financial and processing\nresources, and so their participation in auctions is throttled. Changes to\nauctions may affect bids or throttling and any change may affect what winners\npay. This paper shows that if an A/B experiment affects only bids, then the\nobserved treatment effect is unbiased when all the bidders in an auction are\nrandomly assigned to A or B but it can be severely biased otherwise, even in\nthe absence of throttling. Experiments that affect throttling algorithms can\nalso be badly biased, but the bias can be substantially reduced if the budget\nfor each advertiser in the experiment is allocated to separate pots for the A\nand B arms of the experiment.\n", "versions": [{"version": "v1", "created": "Mon, 30 May 2016 10:52:19 GMT"}], "update_date": "2016-05-31", "authors_parsed": [["Basse", "Guillaume W.", ""], ["Soufiani", "Hossein Azari", ""], ["Lambert", "Diane", ""]]}, {"id": "1605.09194", "submitter": "Ragnar Freij-Hollanti", "authors": "Sofonias Hailu, Ragnar Freij-Hollanti, Alexis A. Dowhuszko, and Olav\n  Tirkkonen", "title": "Network Resource Sharing Games with Instantaneous Reciprocity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a generic strategic network resource sharing game between a set of\nplayers representing operators. The players negotiate which sets of players\nshare given resources, serving users with varying sensitivity to interference.\nWe prove that the proposed game has a Nash equilibrium, to which a greedily\nplayed game converges. Furthermore, simulation results show that, when applied\nto inter-operator spectrum sharing in small-cell indoor office environment, the\nconvergence is fast and there is a significant performance improvement for the\noperators when compared to the default resource usage configuration.\n", "versions": [{"version": "v1", "created": "Mon, 30 May 2016 12:22:48 GMT"}], "update_date": "2016-05-31", "authors_parsed": [["Hailu", "Sofonias", ""], ["Freij-Hollanti", "Ragnar", ""], ["Dowhuszko", "Alexis A.", ""], ["Tirkkonen", "Olav", ""]]}, {"id": "1605.09497", "submitter": "Nicholas Mattei", "authors": "Andres Abeliuk, Haris Aziz, Gerardo Berbeglia, Serge Gaspers, Petr\n  Kalina, Nicholas Mattei, Dominik Peters, Paul Stursberg, Pascal Van\n  Hentenryck, Toby Walsh", "title": "Interdependent Scheduling Games", "comments": "Accepted to IJCAI 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model of interdependent scheduling games in which each player\ncontrols a set of services that they schedule independently. A player is free\nto schedule his own services at any time; however, each of these services only\nbegins to accrue reward for the player when all predecessor services, which may\nor may not be controlled by the same player, have been activated. This model,\nwhere players have interdependent services, is motivated by the problems faced\nin planning and coordinating large-scale infrastructures, e.g., restoring\nelectricity and gas to residents after a natural disaster or providing medical\ncare in a crisis when different agencies are responsible for the delivery of\nstaff, equipment, and medicine. We undertake a game-theoretic analysis of this\nsetting and in particular consider the issues of welfare maximization,\ncomputing best responses, Nash dynamics, and existence and computation of Nash\nequilibria.\n", "versions": [{"version": "v1", "created": "Tue, 31 May 2016 04:54:46 GMT"}], "update_date": "2016-06-01", "authors_parsed": [["Abeliuk", "Andres", ""], ["Aziz", "Haris", ""], ["Berbeglia", "Gerardo", ""], ["Gaspers", "Serge", ""], ["Kalina", "Petr", ""], ["Mattei", "Nicholas", ""], ["Peters", "Dominik", ""], ["Stursberg", "Paul", ""], ["Van Hentenryck", "Pascal", ""], ["Walsh", "Toby", ""]]}, {"id": "1605.09548", "submitter": "Sigal Oren", "authors": "Noga Alon, Michal Feldman, Yishay Mansour, Sigal Oren and Moshe\n  Tennenholtz", "title": "Dynamics of Evolving Social Groups", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exclusive social groups are ones in which the group members decide whether or\nnot to admit a candidate to the group. Examples of exclusive social groups\ninclude academic departments and fraternal organizations. In the present paper\nwe introduce an analytic framework for studying the dynamics of exclusive\nsocial groups. In our model, every group member is characterized by his\nopinion, which is represented as a point on the real line. The group evolves in\ndiscrete time steps through a voting process carried out by the group's\nmembers. Due to homophily, each member votes for the candidate who is more\nsimilar to him (i.e., closer to him on the line). An admission rule is then\napplied to determine which candidate, if any, is admitted. We consider several\nnatural admission rules including majority and consensus.\n  We ask: how do different admission rules affect the composition of the group\nin the long term? We study both growing groups (where new members join old\nones) and fixed-size groups (where new members replace those who quit). Our\nanalysis reveals intriguing phenomena and phase transitions, some of which are\nquite counterintuitive.\n", "versions": [{"version": "v1", "created": "Tue, 31 May 2016 09:50:27 GMT"}], "update_date": "2016-06-01", "authors_parsed": [["Alon", "Noga", ""], ["Feldman", "Michal", ""], ["Mansour", "Yishay", ""], ["Oren", "Sigal", ""], ["Tennenholtz", "Moshe", ""]]}, {"id": "1605.09733", "submitter": "Ariel Schvartzman", "authors": "Jon Schneider, Ariel Schvartzman, S. Matthew Weinberg", "title": "Condorcet-Consistent and Approximately Strategyproof Tournament Rules", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the manipulability of tournament rules for round-robin\ntournaments of $n$ competitors. Specifically, $n$ competitors are competing for\na prize, and a tournament rule $r$ maps the result of all $\\binom{n}{2}$\npairwise matches (called a tournament, $T$) to a distribution over winners.\nRule $r$ is Condorcet-consistent if whenever $i$ wins all $n-1$ of her matches,\n$r$ selects $i$ with probability $1$.\n  We consider strategic manipulation of tournaments where player $j$ might\nthrow their match to player $i$ in order to increase the likelihood that one of\nthem wins the tournament. Regardless of the reason why $j$ chooses to do this,\nthe potential for manipulation exists as long as $\\Pr[r(T) = i]$ increases by\nmore than $\\Pr[r(T) = j]$ decreases. Unfortunately, it is known that every\nCondorcet-consistent rule is manipulable (Altman and Kleinberg). In this work,\nwe address the question of how manipulable Condorcet-consistent rules must\nnecessarily be - by trying to minimize the difference between the increase in\n$\\Pr[r(T) = i]$ and decrease in $\\Pr[r(T) = j]$ for any potential manipulating\npair.\n  We show that every Condorcet-consistent rule is in fact $1/3$-manipulable,\nand that selecting a winner according to a random single elimination bracket is\nnot $\\alpha$-manipulable for any $\\alpha > 1/3$. We also show that many\npreviously studied tournament formats are all $1/2$-manipulable, and the\npopular class of Copeland rules (any rule that selects a player with the most\nwins) are all in fact $1$-manipulable, the worst possible. Finally, we consider\nextensions to match-fixing among sets of more than two players.\n", "versions": [{"version": "v1", "created": "Tue, 31 May 2016 17:25:30 GMT"}], "update_date": "2016-06-01", "authors_parsed": [["Schneider", "Jon", ""], ["Schvartzman", "Ariel", ""], ["Weinberg", "S. Matthew", ""]]}, {"id": "1605.09761", "submitter": "Federico Echenique", "authors": "Christopher P. Chambers and Federico Echenique", "title": "A characterization of combinatorial demand", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that combinatorial demand functions are characterized by two\nproperties: continuity and the law of demand.\n", "versions": [{"version": "v1", "created": "Tue, 31 May 2016 18:46:13 GMT"}, {"version": "v2", "created": "Fri, 10 Jun 2016 19:38:43 GMT"}], "update_date": "2016-06-13", "authors_parsed": [["Chambers", "Christopher P.", ""], ["Echenique", "Federico", ""]]}]