[{"id": "1208.0408", "submitter": "Sergey Andreyev", "authors": "Sergey Andreyev", "title": "Fixed Interfaces, Adaptive Interfaces... What is next? Total movability\n  - a new paradigm for the user interface", "comments": "9 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Users can't talk with computers in their natural language (machine codes), so\nthere are interfaces that allow such communication. 40 years ago the outcome of\ncomputer programs was in the form of long listings covered by numbers and even\nthe format of those numbers was determined by developers. Throughout the latest\n25 years: program views and results are shown in a wide variety of shapes and\nvariants, but all these possibilities are predefined and fixed in code by\ndevelopers; nothing outside of their approved solutions is allowed. My vision\nfrom now on into the future: developers are responsible only for correct work\nof a program (calculations, link with the database, etc.) and suggest a good\ndefault interface, but not determine all possible scenarios; only users decide\nWHAT, WHEN, and HOW to show. This will be a revolution in our dealing with\ncomputers, but there are obvious questions. How this step can be made? Do all\nusers need such change? Is it going to be a burden for users or a welcome\nrevolution?\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2012 06:27:23 GMT"}], "update_date": "2012-08-03", "authors_parsed": [["Andreyev", "Sergey", ""]]}, {"id": "1208.0590", "submitter": "Partha Pratim Ray", "authors": "Partha Pratim Ray", "title": "Translation of Bengali Terms in Mobile Phones: a Simplified Approach\n  Based on the Prescriptions of Conventional Accent Understand Ability", "comments": "ISSN 2249-2593", "journal-ref": "International Journal of Computer and Organization Trends (IJCOT)\n  2(1) 33-38 (2012)", "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Technology is the making, usage and knowledge of tools, techniques, crafts,\nsystems or methods of organization in order to solve a problem or serve some\npurpose. This is true for humanitarian issues also. Such as the issue of\nlanguage and its primitive attraction for its native speakers which is visible\nin the cases of the language spoken at home, outside home, in its choice of\nnewspapers, and TV channels. Everyone finds to accomplish its need by the same\nway. Example includes the preference of using mobile phones in English. The\nsatisfactory answer to this tendency may be the lack of finding the\ntranslations in native language---Bengali terms used in current mobile phones\nare hard to understand by users. I have investigated various mobile phone\nmodels available in Indian market which have lot of problems in Bengali\ninterpretation. I have sort out the root cause of this problem to be the\nconventional accent understand ability. Depending on this I have created a set\nof equivalent terms that I hope to be simpler in use. In this paper I have\nperformed experiments to compare the new terms to the available ones. Our\nfindings show that the newly derived terms do better in term of performance\nthan to current ones. It has also been seen that acceptance of Bengali terms in\nmobile phones might grow if the parameter of simpler and conventional accent\nunderstand ability are met while designing.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2012 16:58:39 GMT"}], "update_date": "2012-08-06", "authors_parsed": [["Ray", "Partha Pratim", ""]]}, {"id": "1208.1679", "submitter": "Ou Wu", "authors": "Ou Wu", "title": "Color Assessment and Transfer for Web Pages", "comments": "10pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CV cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Colors play a particularly important role in both designing and accessing Web\npages. A well-designed color scheme improves Web pages' visual aesthetic and\nfacilitates user interactions. As far as we know, existing color assessment\nstudies focus on images; studies on color assessment and editing for Web pages\nare rare. This paper investigates color assessment for Web pages based on\nexisting online color theme-rating data sets and applies this assessment to Web\ncolor edit. This study consists of three parts. First, we study the extraction\nof a Web page's color theme. Second, we construct color assessment models that\nscore the color compatibility of a Web page by leveraging machine learning\ntechniques. Third, we incorporate the learned color assessment model into a new\napplication, namely, color transfer for Web pages. Our study combines\ntechniques from computer graphics, Web mining, computer vision, and machine\nlearning. Experimental results suggest that our constructed color assessment\nmodels are effective, and useful in the color transfer for Web pages, which has\nreceived little attention in both Web mining and computer graphics communities.\n", "versions": [{"version": "v1", "created": "Tue, 7 Aug 2012 02:24:36 GMT"}], "update_date": "2012-08-16", "authors_parsed": [["Wu", "Ou", ""]]}, {"id": "1208.3323", "submitter": "Pietro Murano Dr", "authors": "Pietro Murano, Tanvi Sethi", "title": "Anthropomorphic User Interface Feedback in a Sewing Context and\n  Affordances", "comments": "(IJACSA) International Journal of Advanced Computer Science and\n  Applications,Vol. 2, No. 4, 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of the authors' research is to gain better insights into the\neffectiveness and user satisfaction of anthropomorphism at the user interface.\nTherefore, this paper presents a between users experiment and the results in\nthe context of anthropomorphism at the user interface and the giving of\ninstruction for learning sewing stitches. Two experimental conditions were\nused, where the information for learning sewing stitches was the same. However\nthe manner of presentation was varied. Therefore one condition was\nanthropomorphic and the other was non-anthropomorphic. Also the work is closely\nlinked with Hartson's theory of affordances applied to user interfaces. The\nresults suggest that facilitation of the affordances in an anthropomorphic user\ninterface lead to statistically significant results in terms of effectiveness\nand user satisfaction in the sewing context. Further some violation of the\naffordances leads to an interface being less usable in terms of effectiveness\nand user satisfaction.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2012 09:27:49 GMT"}], "update_date": "2012-08-17", "authors_parsed": [["Murano", "Pietro", ""], ["Sethi", "Tanvi", ""]]}, {"id": "1208.3394", "submitter": "Gregory D. Saxton", "authors": "Seungahn Nah and Gregory D. Saxton", "title": "Modeling the adoption and use of social media by nonprofit organizations", "comments": "Seungahn Nah and Gregory D. Saxton. (in press). Modeling the adoption\n  and use of social media by nonprofit organizations. New Media & Society,\n  forthcoming", "journal-ref": null, "doi": "10.1177/1461444812452411", "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study examines what drives organizational adoption and use of social\nmedia through a model built around four key factors - strategy, capacity,\ngovernance, and environment. Using Twitter, Facebook, and other data on 100\nlarge US nonprofit organizations, the model is employed to examine the\ndeterminants of three key facets of social media utilization: 1) adoption, 2)\nfrequency of use, and 3) dialogue. We find that organizational strategies,\ncapacities, governance features, and external pressures all play a part in\nthese social media adoption and utilization outcomes. Through its integrated,\nmulti-disciplinary theoretical perspective, this study thus helps foster\nunderstanding of which types of organizations are able and willing to adopt and\njuggle multiple social media accounts, to use those accounts to communicate\nmore frequently with their external publics, and to build relationships with\nthose publics through the sending of dialogic messages.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2012 15:17:15 GMT"}], "update_date": "2012-08-17", "authors_parsed": [["Nah", "Seungahn", ""], ["Saxton", "Gregory D.", ""]]}, {"id": "1208.5024", "submitter": "An Do", "authors": "An H. Do, Po T. Wang, Christine E. King, Sophia N. Chun, Zoran Nenadic", "title": "Brain-Computer Interface Controlled Robotic Gait Orthosis", "comments": "Supplementary video (http://www.youtube.com/watch?v=W97Z8fEAQ7g and\n  http://www.youtube.com/watch?v=HXNCwonhjG8)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reliance on wheelchairs after spinal cord injury (SCI) leads to many medical\nco-morbidities. Treatment of these conditions contributes to the majority of\nSCI health care costs. Restoring able-body-like ambulation after SCI may reduce\nthe incidence of these conditions, and increase independence and quality of\nlife. However, no biomedical solution exists that can reverse this lost\nneurological function, and hence novel methods are needed. Brain-computer\ninterface (BCI) controlled lower extremity prosthesis may constitute one such\nnovel approach.\n  One subject with able-body and one with paraplegia due to SCI underwent\nelectroencephalogram (EEG) recording while engaged in alternating epochs of\nidling and walking kinesthetic motor imagery (KMI). These data were analyzed to\ngenerate an EEG prediction model for online BCI operation. A commercial robotic\ngait orthosis (RoGO) system (treadmill suspended), was interfaced with the BCI\ncomputer. In an online test, the subjects were tasked to ambulate using the\nBCI-RoGO system when prompted by computerized cues. The performance of this\nsystem was assessed with cross-correlation analysis, and omission and false\nalarm rates.\n  The offline accuracy of the EEG prediction model averaged 86.3%. The\ncross-correlation between instructional cues and BCI-RoGO walking epochs\naveraged 0.812 +/- 0.048 (p-value<10^-4). There were on average 0.8 false\nalarms per session and no omissions.\n  This is the first time a person with parapegia due to SCI regained basic\nbrain-controlled ambulation, thereby indicating that restoring brain-controlled\nambulation is feasible. Future work will test this system in a population of\nindividuals with SCI. If successful, this may justify future development of\ninvasive BCI-controlled lower extremity prostheses. This system may also be\napplied to incomplete SCI to improve neurological outcomes beyond those of\nstandard physiotherapy.\n", "versions": [{"version": "v1", "created": "Fri, 24 Aug 2012 18:07:43 GMT"}, {"version": "v2", "created": "Sun, 16 Sep 2012 21:30:05 GMT"}, {"version": "v3", "created": "Mon, 26 Aug 2013 06:59:25 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Do", "An H.", ""], ["Wang", "Po T.", ""], ["King", "Christine E.", ""], ["Chun", "Sophia N.", ""], ["Nenadic", "Zoran", ""]]}, {"id": "1208.6057", "submitter": "An Do", "authors": "Po T. Wang, Christine E. King, Luis A. Chui, An H. Do, Zoran Nenadic", "title": "Self-paced brain-computer interface control of ambulation in a virtual\n  reality environment", "comments": "20 pages, 7 figures, link to video supplementary material\n  (http://youtu.be/GXmovT3BxEo)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objective: Spinal cord injury (SCI) often leaves affected individuals unable\nto ambulate. Electroencephalogramme (EEG) based brain-computer interface (BCI)\ncontrolled lower extremity prostheses may restore intuitive and able-body-like\nambulation after SCI. To test its feasibility, the authors developed and tested\na novel EEG-based, data-driven BCI system for intuitive and self-paced control\nof the ambulation of an avatar within a virtual reality environment (VRE).\n  Approach: Eight able-bodied subjects and one with SCI underwent the following\n10-min training session: subjects alternated between idling and walking\nkinaesthetic motor imageries (KMI) while their EEG were recorded and analysed\nto generate subject-specific decoding models. Subjects then performed a\ngoal-oriented online task, repeated over 5 sessions, in which they utilised the\nKMI to control the linear ambulation of an avatar and make 10 sequential stops\nat designated points within the VRE.\n  Main results: The average offline training performance across subjects was\n77.2 +/- 9.5%, ranging from 64.3% (p = 0.00176) to 94.5% (p = 6.26*10^-23),\nwith chance performance being 50%. The average online performance was 8.4 +/-\n1.0 (out of 10) successful stops and 303 +/- 53 sec completion time (perfect =\n211 sec). All subjects achieved performances significantly different than those\nof random walk (p < 0.05) in 44 of the 45 online sessions.\n  Significance: By using a data-driven machine learning approach to decode\nusers' KMI, this BCIVRE system enabled intuitive and purposeful self-paced\ncontrol of ambulation after only a 10-minute training. The ability to achieve\nsuch BCI control with minimal training indicates that the implementation of\nfuture BCI-lower extremity prosthesis systems may be feasible.\n", "versions": [{"version": "v1", "created": "Thu, 30 Aug 2012 00:58:22 GMT"}], "update_date": "2012-08-31", "authors_parsed": [["Wang", "Po T.", ""], ["King", "Christine E.", ""], ["Chui", "Luis A.", ""], ["Do", "An H.", ""], ["Nenadic", "Zoran", ""]]}]