[{"id": "2106.00157", "submitter": "Bei Wang", "authors": "Lin Yan, Talha Bin Masood, Raghavendra Sridharamurthy, Farhan Rasheed,\n  Vijay Natarajan, Ingrid Hotz, Bei Wang", "title": "Scalar Field Comparison with Topological Descriptors: Properties and\n  Applications for Scientific Visualization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In topological data analysis and visualization, topological descriptors such\nas persistence diagrams, merge trees, contour trees, Reeb graphs, and\nMorse-Smale complexes play an essential role in capturing the shape of scalar\nfield data. We present a state-of-the-art report on scalar field comparison\nusing topological descriptors. We provide a taxonomy of existing approaches\nbased on visualization tasks associated with three categories of data: single\nfields, time-varying fields, and ensembles. These tasks include symmetry\ndetection, periodicity detection, key event/feature detection, feature\ntracking, clustering, and structure statistics. Our main contributions include\nthe formulation of a set of desirable mathematical and computational properties\nof comparative measures, and the classification of visualization tasks and\napplications that are enabled by these measures.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jun 2021 00:34:18 GMT"}], "update_date": "2021-06-02", "authors_parsed": [["Yan", "Lin", ""], ["Masood", "Talha Bin", ""], ["Sridharamurthy", "Raghavendra", ""], ["Rasheed", "Farhan", ""], ["Natarajan", "Vijay", ""], ["Hotz", "Ingrid", ""], ["Wang", "Bei", ""]]}, {"id": "2106.00220", "submitter": "Nicholas Sharp", "authors": "Mark Gillespie, Nicholas Sharp, Keenan Crane", "title": "Integer Coordinates for Intrinsic Geometry Processing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we present a general, efficient, and provably robust\nrepresentation for intrinsic triangulations. These triangulations have emerged\nas a powerful tool for robust geometry processing of surface meshes, taking a\nlow-quality mesh and retriangulating it with high-quality intrinsic triangles.\nHowever, existing representations either support only edge flips, or do not\noffer a robust procedure to recover the common subdivision, that is, how the\nintrinsic triangulation sits along the original surface. To build a\ngeneral-purpose robust structure, we extend the framework of normal\ncoordinates, which have been deeply studied in topology, as well as the more\nrecent idea of roundabouts from geometry processing, to support a variety of\nmesh processing operations like vertex insertions, edge splits, etc. The basic\nidea is to store an integer per mesh edge counting the number of times a curve\ncrosses that edge. We show that this paradigm offers a highly effective\nrepresentation for intrinsic triangulations with strong robustness guarantees.\nThe resulting data structure is general and efficient, while offering a\nguarantee of always encoding a valid subdivision. Among other things, this\nallows us to generate a high-quality intrinsic Delaunay refinement of all\nmanifold meshes in the challenging Thingi10k dataset for the first time. This\nenables a broad class of existing surface geometry algorithms to be applied\nout-of-the-box to low-quality triangulations.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jun 2021 04:23:04 GMT"}], "update_date": "2021-06-02", "authors_parsed": [["Gillespie", "Mark", ""], ["Sharp", "Nicholas", ""], ["Crane", "Keenan", ""]]}, {"id": "2106.00623", "submitter": "Arindam Khan", "authors": "Waldo Galvez, Arindam Khan, Mathieu Mari, Tobias Momke, Madhusudhan\n  Reddy, Andreas Wiese", "title": "A 3-Approximation Algorithm for Maximum Independent Set of Rectangles", "comments": "41 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the Maximum Independent Set of Rectangles (MISR) problem, where we\nare given a set of axis-parallel rectangles in the plane and the goal is to\nselect a subset of non-overlapping rectangles of maximum cardinality. In a\nrecent breakthrough, Mitchell [2021] obtained the first constant-factor\napproximation algorithm for MISR. His algorithm achieves an approximation ratio\nof 10 and it is based on a dynamic program that intuitively recursively\npartitions the input plane into special polygons called corner-clipped\nrectangles, without intersecting certain special horizontal line segments\ncalled fences.\n  In this paper, we present a 3-approximation algorithm for MISR which is based\non a similar recursive partitioning scheme. First, we use a partition into a\nmore general class of axis-parallel polygons with constant complexity each,\nwhich allows us to provide an arguably simpler analysis and at the same time\nalready improves the approximation ratio to 6. Then, using a more elaborate\ncharging scheme and a recursive partitioning into general axis-parallel\npolygons with constant complexity, we improve our approximation ratio to 3. In\nparticular, our partitioning uses more general fences that can be sequences of\nup to O(1) line segments each. This and our other new ideas may be useful for\nfuture work towards a PTAS for MISR.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jun 2021 16:34:15 GMT"}, {"version": "v2", "created": "Sat, 3 Jul 2021 13:18:14 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Galvez", "Waldo", ""], ["Khan", "Arindam", ""], ["Mari", "Mathieu", ""], ["Momke", "Tobias", ""], ["Reddy", "Madhusudhan", ""], ["Wiese", "Andreas", ""]]}, {"id": "2106.00715", "submitter": "Dan Reznik", "authors": "Mark Helman, Dominique Laurain, Dan Reznik, Ronaldo Garcia", "title": "A Theory for Locus Ellipticity of Poncelet 3-Periodic Centers", "comments": "14 pages, 5 figures, 3 tables, and 5 video links", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.MG cs.CG cs.RO math.AG math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a theory which predicts the ellipticity of a triangle center's\nlocus over a Poncelet 3-periodic family. We show that if the triangle center\ncan be expressed as a fixed affine combination of barycenter, circumcenter, and\na third, stationary point over some family, then its locus will be an ellipse.\nTaking billiard 3-periodics as an example, the third point is the mittenpunkt.\nWe derive conditions under which a locus degenerates to a segment or is a\ncircle. We show a locus turning number is either plus or minus 3 and predict\nits movement monotonicity with respect to vertices of the 3-periodic family.\nFinally, we derive a (long) expression for the loci of the incenter and\nexcenters over a generic Poncelet 3-periodic family, showing they are roots of\na quartic. We conjecture (i) those loci are convex, and (ii) that they can only\nbe ellipses if the pair is confocal, i.e., within a 1d subspace of the 5d space\nof ellipse pairs which admit 3-periodics.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jun 2021 18:14:24 GMT"}, {"version": "v2", "created": "Tue, 8 Jun 2021 11:54:14 GMT"}], "update_date": "2021-06-09", "authors_parsed": [["Helman", "Mark", ""], ["Laurain", "Dominique", ""], ["Reznik", "Dan", ""], ["Garcia", "Ronaldo", ""]]}, {"id": "2106.01215", "submitter": "Talha Bin Masood", "authors": "Talha Bin Masood, Signe Sidwall Thygesen, Mathieu Linares, Alexei I.\n  Abrikosov, Vijay Natarajan, Ingrid Hotz", "title": "Visual Analysis of Electronic Densities and Transitions in Molecules", "comments": "15 pages, 9 figures, To appear in EuroVis 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CG physics.chem-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The study of electronic transitions within a molecule connected to the\nabsorption or emission of light is a common task in the process of the design\nof new materials. The transitions are complex quantum mechanical processes and\na detailed analysis requires a breakdown of these processes into components\nthat can be interpreted via characteristic chemical properties. We approach\nthese tasks by providing a detailed analysis of the electron density field.\nThis entails methods to quantify and visualize electron localization and\ntransfer from molecular subgroups combining spatial and abstract\nrepresentations. The core of our method uses geometric segmentation of the\nelectronic density field coupled with a graph-theoretic formulation of charge\ntransfer between molecular subgroups. The design of the methods has been guided\nby the goal of providing a generic and objective analysis following fundamental\nconcepts. We illustrate the proposed approach using several case studies\ninvolving the study of electronic transitions in different molecular systems.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2021 15:07:02 GMT"}], "update_date": "2021-06-03", "authors_parsed": [["Masood", "Talha Bin", ""], ["Thygesen", "Signe Sidwall", ""], ["Linares", "Mathieu", ""], ["Abrikosov", "Alexei I.", ""], ["Natarajan", "Vijay", ""], ["Hotz", "Ingrid", ""]]}, {"id": "2106.01236", "submitter": "Darryl Hill", "authors": "Prosenjit Bose (1), Darryl Hill (1), Aur\\'elien Ooms ((1) Carleton\n  University)", "title": "Improved Spanning on Theta-5", "comments": "21 pages, 30 figures, to be published in the proceedings of WADS\n  2021, The 17th Algorithms and Data Structures Symposium", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show an upper bound of $\\frac{\n  \\sin\\left(\\frac{3\\pi}{10}\\right)\n  }{\n  \\sin\\left(\\frac{2\\pi}{5}\\right)-\\sin\\left(\\frac{3\\pi}{10}\\right)\n  }\n  <5.70$ on the spanning ratio of $\\Theta_5$-graphs, improving on the previous\nbest known upper bound of $9.96$ [Bose, Morin, van Renssen, and Verdonschot.\nThe Theta-5-graph is a spanner. Computational Geometry, 2015.]\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2021 15:36:50 GMT"}], "update_date": "2021-06-03", "authors_parsed": [["Bose", "Prosenjit", ""], ["Hill", "Darryl", ""], ["Ooms", "Aurélien", ""]]}, {"id": "2106.01524", "submitter": "Robyn Brooks", "authors": "Robin Belton, Robyn Brooks, Stefania Ebli, Lisbeth Fajstrup, Brittany\n  Terese Fasy, Nicole Sanderson, and Elizabeth Vidaurre", "title": "Combinatorial Conditions for Directed Collapsing", "comments": "22 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AT cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this article is to study directed collapsibility of directed\nEuclidean cubical complexes. One application of this is in the nontrivial task\nof verifying the execution of concurrent programs. The classical definition of\ncollapsibility involves certain conditions on a pair of cubes of the complex.\nThe direction of the space can be taken into account by requiring that the past\nlinks of vertices remain homotopy equivalent after collapsing. We call this\ntype of collapse a link-preserving directed collapse. In this paper, we give\ncombinatorially equivalent conditions for preserving the topology of the links,\nallowing for the implementation of an algorithm for collapsing a directed\nEuclidean cubical complex. Furthermore, we give conditions for when\nlink-preserving directed collapses preserve the contractability and\nconnectedness of directed path spaces, as well as examples when link-preserving\ndirected collapses do not preserve the number of connected components of the\npath space between the minimum and a given vertex.\n", "versions": [{"version": "v1", "created": "Thu, 3 Jun 2021 01:11:36 GMT"}], "update_date": "2021-06-04", "authors_parsed": [["Belton", "Robin", ""], ["Brooks", "Robyn", ""], ["Ebli", "Stefania", ""], ["Fajstrup", "Lisbeth", ""], ["Fasy", "Brittany Terese", ""], ["Sanderson", "Nicole", ""], ["Vidaurre", "Elizabeth", ""]]}, {"id": "2106.02335", "submitter": "Mikkel Abrahamsen", "authors": "Mikkel Abrahamsen", "title": "Covering Polygons is Even Harder", "comments": "41 pages, 32 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CC cs.CV cs.GR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In the MINIMUM CONVEX COVER (MCC) problem, we are given a simple polygon\n$\\mathcal P$ and an integer $k$, and the question is if there exist $k$ convex\npolygons whose union is $\\mathcal P$. It is known that MCC is\n$\\mathsf{NP}$-hard [Culberson & Reckhow: Covering polygons is hard, FOCS\n1988/Journal of Algorithms 1994] and in $\\exists\\mathbb{R}$ [O'Rourke: The\ncomplexity of computing minimum convex covers for polygons, Allerton 1982]. We\nprove that MCC is $\\exists\\mathbb{R}$-hard, and the problem is thus\n$\\exists\\mathbb{R}$-complete. In other words, the problem is equivalent to\ndeciding whether a system of polynomial equations and inequalities with integer\ncoefficients has a real solution.\n  If a cover for our constructed polygon exists, then so does a cover\nconsisting entirely of triangles. As a byproduct, we therefore also establish\nthat it is $\\exists\\mathbb{R}$-complete to decide whether $k$ triangles cover a\ngiven polygon.\n  The issue that it was not known if finding a minimum cover is in\n$\\mathsf{NP}$ has repeatedly been raised in the literature, and it was\nmentioned as a \"long-standing open question\" already in 2001 [Eidenbenz &\nWidmayer: An approximation algorithm for minimum convex cover with logarithmic\nperformance guarantee, ESA 2001/SIAM Journal on Computing 2003]. We prove that\nassuming the widespread belief that $\\mathsf{NP}\\neq\\exists\\mathbb{R}$, the\nproblem is not in $\\mathsf{NP}$.\n  An implication of the result is that many natural approaches to finding small\ncovers are bound to give suboptimal solutions in some cases, since irrational\ncoordinates of arbitrarily high algebraic degree can be needed for the corners\nof the pieces in an optimal solution.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jun 2021 08:29:48 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Abrahamsen", "Mikkel", ""]]}, {"id": "2106.02397", "submitter": "Tillmann Miltzow", "authors": "Tillmann Miltzow and Reinier F. Schmiermann", "title": "On Classifying Continuous Constraint Satisfaction problems", "comments": "40 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.CG cs.CL cs.DM cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A continuous constraint satisfaction problem (CCSP) is a constraint\nsatisfaction problem (CSP) with a domain $U \\subset \\mathbb{R}$. We engage in a\nsystematic study to classify CCSPs that are complete of the Existential Theory\nof the Reals, i.e., ER-complete. To define this class, we first consider the\nproblem ETR, which also stands for Existential Theory of the Reals. In an\ninstance of this problem we are given some sentence of the form $\\exists x_1,\n\\ldots, x_n \\in \\mathbb{R} : \\Phi(x_1, \\ldots, x_n)$, where $\\Phi$ is a\nwell-formed quantifier-free formula consisting of the symbols $\\{0, 1, +,\n\\cdot, \\geq, >, \\wedge, \\vee, \\neg\\}$, the goal is to check whether this\nsentence is true. Now the class ER is the family of all problems that admit a\npolynomial-time reduction to ETR. It is known that NP $\\subseteq$ ER\n$\\subseteq$ PSPACE.\n  We restrict our attention on CCSPs with addition constraints ($x + y = z$)\nand some other mild technical condition. Previously, it was shown that\nmultiplication constraints ($x \\cdot y = z$), squaring constraints ($x^2 = y$),\nor inversion constraints ($x\\cdot y = 1$) are sufficient to establish\nER-completeness. We extend this in the strongest possible sense for equality\nconstraints as follows. We show that CCSPs (with addition constraints and some\nother mild technical condition) that have any one well-behaved curved equality\nconstraint ($f(x,y) = 0$) are ER-complete. We further extend our results to\ninequality constraints. We show that any well-behaved convexly curved and any\nwell-behaved concavely curved inequality constraint ($f(x,y) \\geq 0$ and\n$g(x,y) \\geq 0$) imply ER-completeness on the class of such CCSPs.\n  We apply our findings to geometric packing and answer an open question by\nAbrahamsen et al. [FOCS 2020]. Namely, we establish ER-completeness of packing\nconvex pieces into a square container under rotations and translations.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jun 2021 10:23:48 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Miltzow", "Tillmann", ""], ["Schmiermann", "Reinier F.", ""]]}, {"id": "2106.02538", "submitter": "Niklas Hellmer", "authors": "Pawe{\\l} D{\\l}otko and Niklas Hellmer", "title": "Bottleneck Profiles and Discrete Prokhorov Metrics for Persistence\n  Diagrams", "comments": "27 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.AT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In topological data analysis (TDA), persistence diagrams have been a\nsuccesful tool. To compare them, Wasserstein and Bottleneck distances are\ncommonly used. We address the shortcomings of these metrics and show a way to\ninvestigate them in a systematic way by introducing bottleneck profiles. This\nleads to a notion of discrete Prokhorov metrics for persistence diagrams as a\ngeneralization of the Bottleneck distance. They satisfy a stability result and\nbounds with respect to Wasserstein metrics. We provide algorithms to compute\nthe newly introduced quantities and end with an discussion about experiments.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jun 2021 15:07:39 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Dłotko", "Paweł", ""], ["Hellmer", "Niklas", ""]]}, {"id": "2106.02839", "submitter": "Jonathan Klawitter", "authors": "Jonathan Klawitter, Tamara Mchedlidze", "title": "Upward planar drawings with two slopes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In an upward planar 2-slope drawing of a digraph, edges are drawn as\nstraight-line segments in the upward direction without crossings using only two\ndifferent slopes. We investigate whether a given upward planar digraph admits\nsuch a drawing and, if so, how to construct it. For the fixed embedding\nscenario, we give a simple characterisation and a linear-time construction by\nadopting algorithms from orthogonal drawings. For the variable embedding\nscenario, we describe a linear-time algorithm for single-source digraphs, a\nquartic-time algorithm for series-parallel digraphs, and a fixed-parameter\ntractable algorithm for general digraphs. For the latter two classes, we make\nuse of SPQR-trees and the notion of upward spirality. As an application of this\ndrawing style, we show how to draw an upward planar phylogenetic network with\ntwo slopes such that all leaves lie on a horizontal line.\n", "versions": [{"version": "v1", "created": "Sat, 5 Jun 2021 08:47:42 GMT"}], "update_date": "2021-06-08", "authors_parsed": [["Klawitter", "Jonathan", ""], ["Mchedlidze", "Tamara", ""]]}, {"id": "2106.02871", "submitter": "Evgeniy Vodolazskiy", "authors": "Evgeniy Vodolazskiy", "title": "Discrete Frechet distance for closed curves", "comments": "14 pages, 4 figures, 3 algorithms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The paper presents a discrete variation of the Frechet distance between\nclosed curves, which can be seen as an approximation of the continuous measure.\nA rather straightforward approach to compute the discrete Frechet distance\nbetween two closed sequences of m and n points using binary search takes O(mn\nlog mn) time. We present an algorithm that takes O(mn log* mn) time, where log*\nis the iterated logarithm.\n", "versions": [{"version": "v1", "created": "Sat, 5 Jun 2021 11:08:42 GMT"}], "update_date": "2021-06-08", "authors_parsed": [["Vodolazskiy", "Evgeniy", ""]]}, {"id": "2106.03503", "submitter": "Tilo Strutz", "authors": "Tilo Strutz", "title": "The Distance Transform and its Computation", "comments": "24 pages, 22 figures, 1 table, 9 listings", "journal-ref": null, "doi": null, "report-no": "TECHP/2021/06", "categories": "cs.CV cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distance transformation is an image processing technique used for many\ndifferent applications. Related to a binary image, the general idea is to\ndetermine the distance of all background points to the nearest object point (or\nvice versa). In this tutorial, different approaches are explained in detail and\ncompared using examples. Corresponding source code is provided to facilitate\nown investigations. A particular objective of this tutorial is to clarify the\ndifference between arbitrary distance transforms and exact Euclidean distance\ntransformations.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2021 10:46:26 GMT"}], "update_date": "2021-06-08", "authors_parsed": [["Strutz", "Tilo", ""]]}, {"id": "2106.03514", "submitter": "Tong Fu", "authors": "Tong Fu, Rapha\\\"elle Chaine, Julie Digne", "title": "Baseline Skinning for Point Sets of Articulated Bodies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  General skinning techniques aim to deform the surface of an articulated model\nfollowing the pose change of a skeleton. Their rapidity makes them ideal tools\nfor real-time animation purposes. However, popular skinning algorithms are\nsimple, but they tend to generate undesirable geometric artefacts. In our work,\nwe consider skeletons given in the form of sphere-mesh models controlling both\nthe pose and morphology of the shape that is either described as a mesh or a\nraw point set. We propose a novel skinning method that encodes the point set\ndetails above a bundle of baselines covering the sphere-mesh. In particular, we\npropose a geometrical model of the baseline and detail direction evolution\nduring bone twisting and joints bending rotations. Our approach works directly\non point sets and thus preserves the accuracy of the initial sampling. It\nfurther avoids computing a weight per point or a costly explicit muscle\nmodelling step. We evaluate our method on several articulated body point sets,\nshowing that it creates fewer artefacts than classical methods.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2021 11:09:59 GMT"}], "update_date": "2021-06-08", "authors_parsed": [["Fu", "Tong", ""], ["Chaine", "Raphaëlle", ""], ["Digne", "Julie", ""]]}, {"id": "2106.03557", "submitter": "Andre Schulz", "authors": "Sarah Carmesin and Andr\\'e Schulz", "title": "Arrangements of orthogonal circles with many intersections", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An arrangement of circles in which circles intersect only in angles of\n$\\pi/2$ is called an \\emph{arrangement of orthogonal circles}. We show that in\nthe case that no two circles are nested, the intersection graph of such an\narrangement is planar. The same result holds for arrangement of circles that\nintersect in an angle of at most $\\pi/2$.\n  For the general case we prove that the maximal number of edges in an\nintersection graph of an arrangement of orthogonal circles lies in between $4n\n- O\\left(\\sqrt{n}\\right)$ and $\\left(4+\\frac{5}{11}\\right)n$, for $n$ being the\nnumber of circles. Based on the lower bound we can also improve the bound for\nthe number of triangles in arrangements of orthogonal circles to $(3 +\n5/9)n-O\\left(\\sqrt{n}\\right)$.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2021 12:37:12 GMT"}], "update_date": "2021-06-08", "authors_parsed": [["Carmesin", "Sarah", ""], ["Schulz", "André", ""]]}, {"id": "2106.04289", "submitter": "Rahul Gangopadhyay", "authors": "Elena Arseneva, Rahul Gangopadhyay and Aleksandra Istomina", "title": "Morphing tree drawings in a small 3D grid", "comments": "30 pages, corrected version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  We study crossing-free grid morphs for planar tree drawings using 3D. A morph\nconsists of morphing steps, where vertices move simultaneously along\nstraight-line trajectories at constant speed. A crossing-free morph is known\nbetween two drawings of an $n$-vertex planar graph $G$ with $\\mathcal{O}(n)$\nmorphing steps and sometimes $\\Omega(n)$ steps is necessary even when $G$ is a\npath [Alamdari et al., 2017], while using 3D can reduce the number of steps to\n$\\mathcal{O}(\\log n)$ for an $n$-vertex tree [Arseneva et al., 2019]. However,\nthese morphs do not bound one practical parameter, the resolution. Recently\n[Barrera-Cruz et al., 2019] a 2D crossing-free morph was devised between two\nplanar drawings of an $n$-vertex tree in $\\mathcal{O}(n)$ steps with polynomial\nresolution, that is, all intermediate drawings are grid drawings on a grid of\npolynomial size. Can the number of steps in this setting be reduced\nsubstantially by using 3D? We answer this question in affirmative and present a\n3D non-crossing morph between two planar grid drawings of an $n$-vertex tree in\n$\\mathcal{O}(\\sqrt{n} \\log n)$ morphing steps. Each intermediate drawing lies\nin a $3D$ grid of polynomial volume.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2021 12:35:08 GMT"}, {"version": "v2", "created": "Sun, 13 Jun 2021 10:37:32 GMT"}, {"version": "v3", "created": "Thu, 15 Jul 2021 17:04:19 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Arseneva", "Elena", ""], ["Gangopadhyay", "Rahul", ""], ["Istomina", "Aleksandra", ""]]}, {"id": "2106.04521", "submitter": "Dan Reznik", "authors": "Iverton Darlan and Dan Reznik", "title": "An App for Visual Exploration, Discovery, and Sharing of Poncelet\n  3-Periodic Phenomena", "comments": "19 pages, 20 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR cs.CG math.DS math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a browser-based application built for the real-time visualization\nof the beauteous dynamic geometry of Poncelet 3-periodic families. The focus is\non highly responsive, visually smooth, \"live\" experimentation with old and new\nphenomena involving loci of triangle centers and/or metric invariants. Another\nfocus is on the production of beautiful color-filled images of loci. Once a\nlive browser-based simulation is defined, it can be easily shared with\ncolleagues and/or inserted as links in publications, eliminating the need of\ntime-consuming video production and uploads.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2021 16:59:19 GMT"}, {"version": "v2", "created": "Thu, 10 Jun 2021 15:15:25 GMT"}], "update_date": "2021-06-11", "authors_parsed": [["Darlan", "Iverton", ""], ["Reznik", "Dan", ""]]}, {"id": "2106.04941", "submitter": "Federico L\\'opez", "authors": "Federico L\\'opez, Beatrice Pozzetti, Steve Trettel, Michael Strube,\n  Anna Wienhard", "title": "Symmetric Spaces for Graph Embeddings: A Finsler-Riemannian Approach", "comments": "28 pages. Accepted at ICML 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Learning faithful graph representations as sets of vertex embeddings has\nbecome a fundamental intermediary step in a wide range of machine learning\napplications. We propose the systematic use of symmetric spaces in\nrepresentation learning, a class encompassing many of the previously used\nembedding targets. This enables us to introduce a new method, the use of\nFinsler metrics integrated in a Riemannian optimization scheme, that better\nadapts to dissimilar structures in the graph. We develop a tool to analyze the\nembeddings and infer structural properties of the data sets. For\nimplementation, we choose Siegel spaces, a versatile family of symmetric\nspaces. Our approach outperforms competitive baselines for graph reconstruction\ntasks on various synthetic and real-world datasets. We further demonstrate its\napplicability on two downstream tasks, recommender systems and node\nclassification.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2021 09:33:33 GMT"}], "update_date": "2021-06-10", "authors_parsed": [["López", "Federico", ""], ["Pozzetti", "Beatrice", ""], ["Trettel", "Steve", ""], ["Strube", "Michael", ""], ["Wienhard", "Anna", ""]]}, {"id": "2106.04973", "submitter": "Eunjin Oh", "authors": "Shinwoo An and Eunjin Oh", "title": "Reachability Problems for Transmission Graphs", "comments": "To appear in WADS2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Let $P$ be a set of $n$ points in the plane where each point $p$ of $P$ is\nassociated with a radius $r_p>0$.The transmission graph $G=(P,E)$ of $P$ is\ndefined as the directed graph such that $E$ contains an edge from $p$ to $q$ if\nand only if $|pq|\\leq r_p$ for any two points $p$ and $q$ in $P$, where $|pq|$\ndenotes the Euclidean distance between $p$ and $q$. In this paper, we present a\ndata structure of size $O(n^{5/3})$ such that for any two points in $P$, we can\ncheck in $O(n^{2/3})$ time if there is a path in $G$ between the two points.\nThis is the first data structure for answering reachability queries whose\nperformance depends only on $n$ but not on the number of edges.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2021 10:39:33 GMT"}], "update_date": "2021-06-10", "authors_parsed": [["An", "Shinwoo", ""], ["Oh", "Eunjin", ""]]}, {"id": "2106.05145", "submitter": "Elena Farahbakhsh Touli", "authors": "Elena Farahbakhsh Touli, Oscar Lindberg", "title": "Relative Clustering Coefficient", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we relatively extend the definition of global clustering\ncoefficient to another clustering, which we call it relative clustering\ncoefficient. The idea of this definition is to ignore the edges in the network\nthat the probability of having an edge is 0. Here, we also consider a model as\nan example that using relative clustering coefficient is better than global\nclustering coefficient for comparing networks and also checking the properties\nof the networks.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2021 15:39:35 GMT"}], "update_date": "2021-06-10", "authors_parsed": [["Touli", "Elena Farahbakhsh", ""], ["Lindberg", "Oscar", ""]]}, {"id": "2106.05161", "submitter": "Seungbae Bang", "authors": "Rinat Abdrashitov, Seungbae Bang, David I.W. Levin, Karan Singh, Alec\n  Jacobson", "title": "Interactive Modelling of Volumetric Musculoskeletal Anatomy", "comments": "13 pages, 20 figures, SIGGRAPH 2021", "journal-ref": "ACM Trans. Graph., Vol. 40, No. 4, Article 122. Publication date:\n  August 2021", "doi": "10.1145/3450626.3459769", "report-no": null, "categories": "cs.GR cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We present a new approach for modelling musculoskeletal anatomy. Unlike\nprevious methods, we do not model individual muscle shapes as geometric\nprimitives (polygonal meshes, NURBS etc.). Instead, we adopt a volumetric\nsegmentation approach where every point in our volume is assigned to a muscle,\nfat, or bone tissue. We provide an interactive modelling tool where the user\ncontrols the segmentation via muscle curves and we visualize the muscle shapes\nusing volumetric rendering. Muscle curves enable intuitive yet powerful control\nover the muscle shapes. This representation allows us to automatically handle\nintersections between different tissues (musclemuscle, muscle-bone, and\nmuscle-skin) during the modelling and automates computation of muscle fiber\nfields. We further introduce a novel algorithm for converting the volumetric\nmuscle representation into tetrahedral or surface geometry for use in\ndownstream tasks. Additionally, we introduce an interactive skeleton authoring\ntool that allows the users to create skeletal anatomy starting from only a skin\nmesh using a library of bone parts.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2021 16:08:56 GMT"}], "update_date": "2021-06-10", "authors_parsed": [["Abdrashitov", "Rinat", ""], ["Bang", "Seungbae", ""], ["Levin", "David I. W.", ""], ["Singh", "Karan", ""], ["Jacobson", "Alec", ""]]}, {"id": "2106.05363", "submitter": "Sariel Har-Peled", "authors": "Sariel Har-Peled, Joseph Rogge", "title": "On Clusters that are Separated but Large", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  $\\renewcommand{\\Re}{\\mathbb{R}}$Given a set $P$ of $n$ points in $\\Re^d$,\nconsider the problem of computing $k$ subsets of $P$ that form clusters that\nare well-separated from each other, and each of them is large (cardinality\nwise). We provide tight upper and lower bounds, and corresponding algorithms,\non the quality of separation, and the size of the clusters that can be\ncomputed, as a function of $n,d,k,s$, and $\\Phi$, where $s$ is the desired\nseparation, and $\\Phi$ is the spread of the point set $P$.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2021 20:00:45 GMT"}], "update_date": "2021-06-11", "authors_parsed": [["Har-Peled", "Sariel", ""], ["Rogge", "Joseph", ""]]}, {"id": "2106.05436", "submitter": "Mengyuan Fang", "authors": "Mengyuan Fang, Luliang Tang, Zihan Kan, Xue Yang, Tao Pei, Qingquan\n  Li, Chaokui Li", "title": "An adaptive Origin-Destination flows cluster-detecting method to\n  identify urban mobility trends", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Origin-Destination (OD) flow, as an abstract representation of the object`s\nmovement or interaction, has been used to reveal the urban mobility and\nhuman-land interaction pattern. As an important spatial analysis approach, the\nclustering methods of point events have been extended to OD flows to identify\nthe dominant trends and spatial structures of urban mobility. However, the\nexisting methods for OD flow cluster-detecting are limited both in specific\nspatial scale and the uncertain result due to different parameters setting,\nwhich is difficult for complicated OD flows clustering under spatial\nheterogeneity. To address these limitations, in this paper, we proposed a novel\nOD flows cluster-detecting method based on the OPTICS algorithm which can\nidentify OD flow clusters with various aggregation scales. The method can\nadaptively determine parameter value from the dataset without prior knowledge\nand artificial intervention. Experiments indicated that our method outperformed\nthree state-of-the-art methods with more accurate and complete of clusters and\nless noise. As a case study, our method is applied to identify the potential\nroutes for public transport service settings by detecting OD flow clusters\nwithin urban travel data.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2021 00:14:54 GMT"}], "update_date": "2021-06-11", "authors_parsed": [["Fang", "Mengyuan", ""], ["Tang", "Luliang", ""], ["Kan", "Zihan", ""], ["Yang", "Xue", ""], ["Pei", "Tao", ""], ["Li", "Qingquan", ""], ["Li", "Chaokui", ""]]}, {"id": "2106.05638", "submitter": "Justin Dallant", "authors": "Jean Cardinal, Justin Dallant and John Iacono", "title": "An Instance-optimal Algorithm for Bichromatic Rectangular Visibility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Afshani, Barbay and Chan (2017) introduced the notion of instance-optimal\nalgorithm in the order-oblivious setting. An algorithm A is instance-optimal in\nthe order-oblivious setting for a certain class of algorithms A* if the\nfollowing hold:\n  - A takes as input a sequence of objects from some domain;\n  - for any instance $\\sigma$ and any algorithm A' in A*, the runtime of A on\n$\\sigma$ is at most a constant factor removed from the runtime of A' on the\nworst possible permutation of $\\sigma$. If we identify permutations of a\nsequence as representing the same instance, this essentially states that A is\noptimal on every possible input (and not only in the worst case).\n  We design instance-optimal algorithms for the problem of reporting, given a\nbichromatic set of points in the plane S, all pairs consisting of points of\ndifferent color which span an empty axis-aligned rectangle (or reporting all\npoints which appear in such a pair). This problem has applications for\ntraining-set reduction in nearest-neighbour classifiers. It is also related to\nthe problem consisting of finding the decision boundaries of a euclidean\nnearest-neighbour classifier, for which Bremner et al. (2005) gave an optimal\noutput-sensitive algorithm.\n  By showing the existence of an instance-optimal algorithm in the\norder-oblivious setting for this problem we push the methods of Afshani et al.\ncloser to their limits by adapting and extending them to a setting which\nexhibits highly non-local features. Previous problems for which\ninstance-optimal algorithms were proven to exist were based solely on local\nrelationships between points in a set.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2021 10:23:22 GMT"}, {"version": "v2", "created": "Thu, 24 Jun 2021 12:07:51 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Cardinal", "Jean", ""], ["Dallant", "Justin", ""], ["Iacono", "John", ""]]}, {"id": "2106.05734", "submitter": "Matthias Wolf", "authors": "Lukas Barth, Benjamin Niedermann, Ignaz Rutter, Matthias Wolf", "title": "A Topology-Shape-Metrics Framework for Ortho-Radial Graph Drawing", "comments": "submitted to the journal Discrete & Computational Geometry. arXiv\n  admin note: text overlap with arXiv:1903.05048", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Orthogonal drawings, i.e., embeddings of graphs into grids, are a classic\ntopic in Graph Drawing. Often the goal is to find a drawing that minimizes the\nnumber of bends on the edges. A key ingredient for bend minimization algorithms\nis the existence of an orthogonal representation that describes such drawings\ncombinatorially by only listing the angles between the edges around each vertex\nand the directions of bends on the edges, but neglecting any kind of geometric\ninformation such as vertex coordinates or edge lengths.\n  We generalize this idea to ortho-radial representations of ortho-radial\ndrawings, which are embeddings into an ortho-radial grid, whose gridlines are\nconcentric circles around the origin and straight-line spokes emanating from\nthe origin but excluding the origin itself. Unlike the orthogonal case, there\nexist ortho-radial representations that do not admit a corresponding drawing,\nfor example so-called strictly monotone cycles. An ortho-radial drawing is\ncalled valid if it does not contain a strictly monotone cycle. Our first result\nis that an ortho-radial representation admits a corresponding drawing if and\nonly if it is valid. Previously such a characterization was only known for\northo-radial drawings of paths, cycles, and theta graphs, and in the special\ncase of rectangular drawings of cubic graphs, where the contour of each face is\nrequired to be a rectangle. Further, we give a quadratic-time algorithm that\ntests for an ortho-radial representation whether it is valid, and we show how\nto draw a valid ortho-radial representation in the same running time.\n  Altogether, this reduces the problem of computing a minimum-bend ortho-radial\ndrawing to the task of computing a valid ortho-radial representation with the\nminimum number of bends, and hence establishes an ortho-radial analogue of the\ntopology-shape-metrics framework for planar orthogonal drawings by Tamassia.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2021 13:32:58 GMT"}], "update_date": "2021-06-11", "authors_parsed": [["Barth", "Lukas", ""], ["Niedermann", "Benjamin", ""], ["Rutter", "Ignaz", ""], ["Wolf", "Matthias", ""]]}, {"id": "2106.06020", "submitter": "Maurice Weiler", "authors": "Maurice Weiler, Patrick Forr\\'e, Erik Verlinde, Max Welling", "title": "Coordinate Independent Convolutional Networks -- Isometry and Gauge\n  Equivariant Convolutions on Riemannian Manifolds", "comments": "The implementation of orientation independent M\\\"obius convolutions\n  is publicly available at https://github.com/mauriceweiler/MobiusCNNs", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CG cs.CV stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Motivated by the vast success of deep convolutional networks, there is a\ngreat interest in generalizing convolutions to non-Euclidean manifolds. A major\ncomplication in comparison to flat spaces is that it is unclear in which\nalignment a convolution kernel should be applied on a manifold. The underlying\nreason for this ambiguity is that general manifolds do not come with a\ncanonical choice of reference frames (gauge). Kernels and features therefore\nhave to be expressed relative to arbitrary coordinates. We argue that the\nparticular choice of coordinatization should not affect a network's inference\n-- it should be coordinate independent. A simultaneous demand for coordinate\nindependence and weight sharing is shown to result in a requirement on the\nnetwork to be equivariant under local gauge transformations (changes of local\nreference frames). The ambiguity of reference frames depends thereby on the\nG-structure of the manifold, such that the necessary level of gauge\nequivariance is prescribed by the corresponding structure group G. Coordinate\nindependent convolutions are proven to be equivariant w.r.t. those isometries\nthat are symmetries of the G-structure. The resulting theory is formulated in a\ncoordinate free fashion in terms of fiber bundles. To exemplify the design of\ncoordinate independent convolutions, we implement a convolutional network on\nthe M\\\"obius strip. The generality of our differential geometric formulation of\nconvolutional networks is demonstrated by an extensive literature review which\nexplains a large number of Euclidean CNNs, spherical CNNs and CNNs on general\nsurfaces as specific instances of coordinate independent convolutions.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2021 19:54:19 GMT"}], "update_date": "2021-06-14", "authors_parsed": [["Weiler", "Maurice", ""], ["Forré", "Patrick", ""], ["Verlinde", "Erik", ""], ["Welling", "Max", ""]]}, {"id": "2106.06469", "submitter": "Songzhu Zheng", "authors": "Songzhu Zheng, Yikai Zhang, Hubert Wagner, Mayank Goswami, Chao Chen", "title": "Topological Detection of Trojaned Neural Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep neural networks are known to have security issues. One particular threat\nis the Trojan attack. It occurs when the attackers stealthily manipulate the\nmodel's behavior through Trojaned training samples, which can later be\nexploited.\n  Guided by basic neuroscientific principles we discover subtle -- yet critical\n-- structural deviation characterizing Trojaned models. In our analysis we use\ntopological tools. They allow us to model high-order dependencies in the\nnetworks, robustly compare different networks, and localize structural\nabnormalities. One interesting observation is that Trojaned models develop\nshort-cuts from input to output layers.\n  Inspired by these observations, we devise a strategy for robust detection of\nTrojaned models. Compared to standard baselines it displays better performance\non multiple benchmarks.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jun 2021 15:48:16 GMT"}], "update_date": "2021-06-14", "authors_parsed": [["Zheng", "Songzhu", ""], ["Zhang", "Yikai", ""], ["Wagner", "Hubert", ""], ["Goswami", "Mayank", ""], ["Chen", "Chao", ""]]}, {"id": "2106.07292", "submitter": "Andreas Ott", "authors": "Michael Bleher, Lukas Hahn, Juan Angel Patino-Galindo, Mathieu\n  Carriere, Ulrich Bauer, Raul Rabadan, Andreas Ott", "title": "Topology identifies emerging adaptive mutations in SARS-CoV-2", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CG q-bio.GN q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The COVID-19 pandemic has lead to a worldwide effort to characterize its\nevolution through the mapping of mutations in the genome of the coronavirus\nSARS-CoV-2. Ideally, one would like to quickly identify new mutations that\ncould confer adaptive advantages (e.g. higher infectivity or immune evasion) by\nleveraging the large number of genomes. One way of identifying adaptive\nmutations is by looking at convergent mutations, mutations in the same genomic\nposition that occur independently. However, the large number of currently\navailable genomes precludes the efficient use of phylogeny-based techniques.\nHere, we establish a fast and scalable Topological Data Analysis approach for\nthe early warning and surveillance of emerging adaptive mutations based on\npersistent homology. It identifies convergent events merely by their\ntopological footprint and thus overcomes limitations of current phylogenetic\ninference techniques. This allows for an unbiased and rapid analysis of large\nviral datasets. We introduce a new topological measure for convergent evolution\nand apply it to the GISAID dataset as of February 2021, comprising 303,651\nhigh-quality SARS-CoV-2 isolates collected since the beginning of the pandemic.\nWe find that topologically salient mutations on the receptor-binding domain\nappear in several variants of concern and are linked with an increase in\ninfectivity and immune escape, and for many adaptive mutations the topological\nsignal precedes an increase in prevalence. We show that our method effectively\nidentifies emerging adaptive mutations at an early stage. By localizing\ntopological signals in the dataset, we extract geo-temporal information about\nthe early occurrence of emerging adaptive mutations. The identification of\nthese mutations can help to develop an alert system to monitor mutations of\nconcern and guide experimentalists to focus the study of specific circulating\nvariants.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jun 2021 10:38:40 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Bleher", "Michael", ""], ["Hahn", "Lukas", ""], ["Patino-Galindo", "Juan Angel", ""], ["Carriere", "Mathieu", ""], ["Bauer", "Ulrich", ""], ["Rabadan", "Raul", ""], ["Ott", "Andreas", ""]]}, {"id": "2106.07459", "submitter": "Josef Tkadlec", "authors": "Adrian Dumitrescu, Josef Tkadlec", "title": "Piercing All Translates of a Set of Axis-Parallel Rectangles", "comments": "14 pages, 4 figures, to appear in Proceedings of IWOCA 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  For a given shape $S$ in the plane, one can ask what is the lowest possible\ndensity of a point set $P$ that pierces (``intersects'', ``hits'') all\ntranslates of $S$. This is equivalent to determining the covering density of\n$S$ and as such is well studied. Here we study the analogous question for\nfamilies of shapes where the connection to covering no longer exists. That is,\nwe require that a single point set $P$ simultaneously pierces each translate of\neach shape from some family $\\mathcal F$. We denote the lowest possible density\nof such an $\\mathcal F$-piercing point set by $\\pi_T(\\mathcal F)$.\nSpecifically, we focus on families $\\mathcal F$ consisting of axis-parallel\nrectangles. When $|\\mathcal F|=2$ we exactly solve the case when one rectangle\nis more squarish than $2\\times 1$, and give bounds (within $10\\,\\%$ of each\nother) for the remaining case when one rectangle is wide and the other one is\ntall. When $|\\mathcal F|\\ge 2$ we present a linear-time constant-factor\napproximation algorithm for computing $\\pi_T(\\mathcal F)$ (with ratio $1.895$).\n", "versions": [{"version": "v1", "created": "Mon, 14 Jun 2021 14:35:39 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Dumitrescu", "Adrian", ""], ["Tkadlec", "Josef", ""]]}, {"id": "2106.08843", "submitter": "Abu Reyan Ahmed", "authors": "Kathryn Gray, Mingwei Li, Reyan Ahmed, Stephen Kobourov", "title": "Visualizing Evolving Trees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Evolving trees arise in many real-life scenarios from computer file systems\nand dynamic call graphs, to fake news propagation and disease spread. Most\nlayout algorithms for static trees, however, do not work well in an evolving\nsetting (e.g., they are not designed to be stable between time steps). Dynamic\ngraph layout algorithms are better suited to this task, although they often\nintroduce unnecessary edge crossings. With this in mind we propose two methods\nfor visualizing evolving trees that guarantee no edge crossings, while\noptimizing (1) desired edge length realization, (2) layout compactness, and (3)\nstability. We evaluate the two new methods, along with four prior approaches\n(two static and two dynamic), on real-world datasets using quantitative\nmetrics: stress, desired edge length realization, layout compactness,\nstability, and running time. The new methods are fully functional and available\non github.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jun 2021 15:01:29 GMT"}], "update_date": "2021-06-17", "authors_parsed": [["Gray", "Kathryn", ""], ["Li", "Mingwei", ""], ["Ahmed", "Reyan", ""], ["Kobourov", "Stephen", ""]]}, {"id": "2106.09972", "submitter": "Yuichi Ike", "authors": "Yasuhiko Asao, Yuichi Ike", "title": "Curvature of point clouds through principal component analysis", "comments": "22 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we study curvature-like feature value of data sets in\nEuclidean spaces. First we formulate such curvature functions with desirable\nproperties under the manifold hypothesis. Then we make a test property for the\nvalidity of the curvature function by the law of large numbers, and check it\nfor the function we construct by numerical experiments. These experiments also\nsuggest us to conjecture that mean of the curvature of sample manifolds\ncoincides with the curvature of the mean manifold. Our construction is based on\nthe dimension estimation by the principal component analysis and the Gaussian\ncurvature of hypersurfaces. Our function depends on provisional parameters\n$\\varepsilon, \\delta$, and we suggest to deal with the resulting functions as a\nfunction of these parameters to get some robustness. As an application, we\npropose a method to decompose data sets into some parts reflecting local\nstructure. For this, we embed the data sets into higher dimensional Euclidean\nspace by using curvature values and cluster them in the embedded space. We also\ngive some computational experiments that support effectiveness of our methods.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2021 07:52:41 GMT"}], "update_date": "2021-06-21", "authors_parsed": [["Asao", "Yasuhiko", ""], ["Ike", "Yuichi", ""]]}, {"id": "2106.09974", "submitter": "Bahram Sadeghi Bigham", "authors": "Bahram Sadeghi Bigham", "title": "Separating Geometric Data with Minimum Cost: Two Disjoint Convex Hulls", "comments": "A new paper related to Convex Hull, Algorithm, Clustering, Binary\n  Sensor Network, SAT and Separation Axis Theorem", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In this study, a geometric version of an NP-hard problem (\"Almost $2-SAT$\"\nproblem) is introduced which has potential applications in clustering,\nseparation axis, binary sensor networks, shape separation, image processing,\netc. Furthermore, it has been illustrated that the new problem known as \"Two\nDisjoint Convex Hulls\" can be solved in polynomial time due to some\ncombinatorial aspects and geometric properties. For this purpose, an $O(n^2)$\nalgorithm has also been presented which employs the Separating Axis Theorem\n(SAT) and the duality of points/lines.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2021 07:55:08 GMT"}], "update_date": "2021-06-21", "authors_parsed": [["Bigham", "Bahram Sadeghi", ""]]}, {"id": "2106.10149", "submitter": "Michelle Cordier", "authors": "Michelle Cordier, Meaghan Wheeler", "title": "Searching for Point Locations using Lines", "comments": "13 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Versions of the following problem appear in several topics such as Gamma\nKnife radiosurgery, studying objects with the X-ray transform, the 3SUM\nproblem, and the $k$-linear degeneracy testing. Suppose there are $n$ points on\na plane whose specific locations are unknown. We are given all the lines that\ngo through the points with a given slope. We show that the minimum number of\nslopes needed, in general, to find all the point locations is $n+1$ and we\nprovide an algorithm to do so.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2021 14:28:15 GMT"}], "update_date": "2021-06-21", "authors_parsed": [["Cordier", "Michelle", ""], ["Wheeler", "Meaghan", ""]]}, {"id": "2106.10659", "submitter": "Sajjad Ghobadi Babi", "authors": "Mansoor Davoodi, Esmaeil Delfaraz, Sajjad Ghobadi, and Mahtab Masoori", "title": "Hole Detection and Healing in Hybrid Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although monitoring and covering are fundamental goals of a wireless sensor\nnetwork (WSN), the accidental death of sensors or the running out of their\nenergy would result in holes in the WSN. Such holes have the potential to\ndisrupt the primary functions of WSNs. This paper investigates the hole\ndetection and healing problems in hybrid WSNs with non-identical sensor sensing\nranges. In particular, we aim to propose centralized algorithms for detecting\nholes in a given region and maximizing the area covered by a WSN in the\npresence of environmental obstacles. To precisely identify the boundary of the\nholes, we use an additively weighted Voronoi diagram and a polynomial-time\nalgorithm.Furthermore, since this problem is known to be computationally\ndifficult, we propose a centralized greedy 1/2-approximation algorithm to\nmaximize the area covered by sensors. Finally, we implement the algorithms and\nrun simulations to show that our approximation algorithm efficiently covers the\nholes by moving the mobile sensors.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jun 2021 09:10:38 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Davoodi", "Mansoor", ""], ["Delfaraz", "Esmaeil", ""], ["Ghobadi", "Sajjad", ""], ["Masoori", "Mahtab", ""]]}, {"id": "2106.10751", "submitter": "Hannah Alpert", "authors": "H. Alpert, R. Barnes, S. Bell, A. Mauro, N. Nevo, N. Tucker, H. Yang", "title": "Routing by matching on convex pieces of grid graphs", "comments": "32 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The routing number is a graph invariant introduced by Alon, Chung, and Graham\nin 1994, and it has been studied for trees and other classes of graphs such as\nhypercubes. It gives the minimum number of routing steps needed to sort a set\nof distinct tokens, placed one on each vertex, where each routing step swaps a\nset of disjoint pairs of adjacent tokens. Our main theorem generalizes the\nknown estimate that a rectangular grid graph R with width w(R) and height h(R)\nhas routing number rt(R) in O(w(R)+h(R)). We show that for the subgraph P of\nthe infinite square lattice enclosed by any convex polygon, its routing number\nrt(P) is in O(w(P)+h(P)).\n", "versions": [{"version": "v1", "created": "Sun, 20 Jun 2021 21:09:12 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Alpert", "H.", ""], ["Barnes", "R.", ""], ["Bell", "S.", ""], ["Mauro", "A.", ""], ["Nevo", "N.", ""], ["Tucker", "N.", ""], ["Yang", "H.", ""]]}, {"id": "2106.11092", "submitter": "Jittat Fakcharoenphol", "authors": "Jittat Fakcharoenphol, Nonthaphat Wongwattanakij", "title": "A PTAS for $k$-hop MST on the Euclidean plane: Improving Dependency on\n  $k$", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For any $\\epsilon>0$, Laue and Matijevi\\'{c} [CCCG'07, IPL'08] give a PTAS\nfor finding a $(1+\\epsilon)$-approximate solution to the $k$-hop MST problem in\nthe Euclidean plane that runs in time $(n/\\epsilon)^{O(k/\\epsilon)}$. In this\npaper, we present an algorithm that runs in time $(n/\\epsilon)^{O(\\log k\n\\cdot(1/\\epsilon)^2\\cdot\\log^2(1/\\epsilon))}$. This gives an improvement on the\ndependency on $k$ on the exponent, while having a worse dependency on\n$\\epsilon$. As in Laue and Matijevi\\'{c}, we follow the framework introduced by\nArora for Euclidean TSP. Our key ingredients include exponential distance\nscaling and compression of dynamic programming state tables.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jun 2021 13:20:23 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Fakcharoenphol", "Jittat", ""], ["Wongwattanakij", "Nonthaphat", ""]]}, {"id": "2106.11621", "submitter": "Nathan van Beusekom", "authors": "Nathan van Beusekom, Kevin Buchin, Hidde Koerts, Wouter Meulemans,\n  Benjamin Rodatz, Bettina Speckmann", "title": "Near-Delaunay Metrics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study metrics that assess how close a triangulation is to being a Delaunay\ntriangulation, for use in contexts where a good triangulation is desired but\nconstraints (e.g., maximum degree) prevent the use of the Delaunay\ntriangulation itself. Our near-Delaunay metrics derive from common Delaunay\nproperties and satisfy a basic set of design criteria, such as being invariant\nunder similarity transformations. We compare the metrics, showing that each can\nmake different judgments as to which triangulation is closer to Delaunay. We\nalso present a preliminary experiment, showing how optimizing for these metrics\nunder different constraints gives similar, but not necessarily identical\nresults, on random and constructed small point sets.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2021 09:11:26 GMT"}], "update_date": "2021-06-23", "authors_parsed": [["van Beusekom", "Nathan", ""], ["Buchin", "Kevin", ""], ["Koerts", "Hidde", ""], ["Meulemans", "Wouter", ""], ["Rodatz", "Benjamin", ""], ["Speckmann", "Bettina", ""]]}, {"id": "2106.11626", "submitter": "Bal\\'azs Ludm\\'any", "authors": "Bal\\'azs Ludm\\'any and Zsolt L\\'angi and G\\'abor Domokos", "title": "Morse-Smale complexes on convex polyhedra", "comments": "19 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.CO math.MG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Motivated by applications in geomorphology, the aim of this paper is to\nextend Morse-Smale theory from smooth functions to the radial distance function\n(measured from an internal point), defining a convex polyhedron in\n3-dimensional Euclidean space. The resulting polyhedral Morse-Smale complex may\nbe regarded, on one hand, as a generalization of the Morse-Smale complex of the\nsmooth radial distance function defining a smooth, convex body, on the other\nhand, it could be also regarded as a generalization of the Morse-Smale complex\nof the piecewise linear parallel distance function (measured from a plane),\ndefining a polyhedral surface. Beyond similarities, our paper also highlights\nthe marked differences between these three problems and it also includes the\ndesign, implementation and testing of an explicit algorithm computing the\nMorse-Smale complex on a convex polyhedron.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2021 09:25:22 GMT"}], "update_date": "2021-06-23", "authors_parsed": [["Ludmány", "Balázs", ""], ["Lángi", "Zsolt", ""], ["Domokos", "Gábor", ""]]}, {"id": "2106.11884", "submitter": "Francesco Vaccarino", "authors": "Alessandro De Gregorio, Marco Guerra, Sara Scaramuccia and Francesco\n  Vaccarino", "title": "Parallel decomposition of persistence modules through interval bases", "comments": "37 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AT cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an algorithm to decompose any finite-type persistence module\nwith coefficients in a field into what we call an {\\em interval basis}. This\nconstruction yields both the standard persistence pairs of Topological Data\nAnalysis (TDA), as well as a special set of generators inducing the interval\ndecomposition of the Structure theorem. The computation of this basis can be\ndistributed over the steps in the persistence module. This construction works\nfor general persistence modules on a field $\\mathbb{F}$, not necessarily\nderiving from persistent homology. We subsequently provide a parallel algorithm\nto build a persistent homology module over $\\mathbb{R}$ by leveraging the Hodge\ndecomposition, thus providing new motivation to explore the interplay between\nTDA and the Hodge Laplacian.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2021 15:54:52 GMT"}], "update_date": "2021-06-23", "authors_parsed": [["De Gregorio", "Alessandro", ""], ["Guerra", "Marco", ""], ["Scaramuccia", "Sara", ""], ["Vaccarino", "Francesco", ""]]}, {"id": "2106.12322", "submitter": "Louis Esperet", "authors": "Louis Esperet, S\\'ebastien Julliot, Arnaud de Mesmay", "title": "Distributed coloring and the local structure of unit-disk graphs", "comments": "23 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CG math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coloring unit-disk graphs efficiently is an important problem in the global\nand distributed setting, with applications in radio channel assignment problems\nwhen the communication relies on omni-directional antennas of the same power.\nIn this context it is important to bound not only the complexity of the\ncoloring algorithms, but also the number of colors used. In this paper, we\nconsider two natural distributed settings. In the location-aware setting (when\nnodes know their coordinates in the plane), we give a constant time distributed\nalgorithm coloring any unit-disk graph $G$ with at most\n$(3+\\epsilon)\\omega(G)+6$ colors, for any constant $\\epsilon>0$, where\n$\\omega(G)$ is the clique number of $G$. This improves upon a classical\n3-approximation algorithm for this problem, for all unit-disk graphs whose\nchromatic number significantly exceeds their clique number. When nodes do not\nknow their coordinates in the plane, we give a distributed algorithm in the\nLOCAL model that colors every unit-disk graph $G$ with at most $5.68\\omega(G)$\ncolors in $O(2^{\\sqrt{\\log \\log n}})$ rounds. Moreover, when $\\omega(G)=O(1)$,\nthe algorithm runs in $O(\\log^* n)$ rounds. This algorithm is based on a study\nof the local structure of unit-disk graphs, which is of independent interest.\nWe conjecture that every unit-disk graph $G$ has average degree at most\n$4\\omega(G)$, which would imply the existence of a $O(\\log n)$ round algorithm\ncoloring any unit-disk graph $G$ with (approximatively) $4\\omega(G)$ colors.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2021 11:36:41 GMT"}], "update_date": "2021-06-24", "authors_parsed": [["Esperet", "Louis", ""], ["Julliot", "Sébastien", ""], ["de Mesmay", "Arnaud", ""]]}, {"id": "2106.12385", "submitter": "Khaled Elbassioni", "authors": "Khaled Elbassioni and Saurabh Ray", "title": "Threshold Rounding for the Standard LP Relaxation of some Geometric\n  Stabbing Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the rectangle stabbing problem, we are given a set $\\cR$ of axis-aligned\nrectangles in $\\RR^2$, and the objective is to find a minimum-cardinality set\nof horizontal and/or vertical lines such that each rectangle is intersected by\none of these lines. The standard LP relaxation for this problem is known to\nhave an integrality gap of 2, while a better intergality gap of 1.58.. is known\nfor the special case when $\\cR$ is a set of horizontal segments. In this paper,\nwe consider two more special cases: when $\\cR$ is a set of horizontal and\nvertical segments, and when $\\cR$ is a set of unit squares. We show that the\nintegrality gap of the standard LP relaxation in both cases is stricly less\nthan $2$. Our rounding technique is based on a generalization of the {\\it\nthreshold rounding} idea used by Kovaleva and Spieksma (SIAM J. Disc. Math\n2006), which may prove useful for rounding the LP relaxations of other\ngeometric covering problems.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2021 13:26:58 GMT"}], "update_date": "2021-06-24", "authors_parsed": [["Elbassioni", "Khaled", ""], ["Ray", "Saurabh", ""]]}, {"id": "2106.12655", "submitter": "Ante Qu", "authors": "Ante Qu and Doug L. James", "title": "Fast Linking Numbers for Topology Verification of Loopy Structures", "comments": "Published at Siggraph 2021. Copyright (C) 2021 Association for\n  Computing Machinery. Paper webpage and code at\n  https://graphics.stanford.edu/papers/fastlinkingnumbers/", "journal-ref": "ACM Trans. Graph. 40, 4, Article 106 (August 2021), 19 pages", "doi": "10.1145/3450626.3459778", "report-no": null, "categories": "cs.GR cs.CG", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  It is increasingly common to model, simulate, and process complex materials\nbased on loopy structures, such as in yarn-level cloth garments, which possess\ntopological constraints between inter-looping curves. While the input model may\nsatisfy specific topological linkages between pairs of closed loops, subsequent\nprocessing may violate those topological conditions. In this paper, we explore\na family of methods for efficiently computing and verifying linking numbers\nbetween closed curves, and apply these to applications in geometry processing,\nanimation, and simulation, so as to verify that topological invariants are\npreserved during and after processing of the input models. Our method has three\nstages: (1) we identify potentially interacting loop-loop pairs, then (2)\ncarefully discretize each loop's spline curves into line segments so as to\nenable (3) efficient linking number evaluation using accelerated kernels based\non either counting projected segment-segment crossings, or by evaluating the\nGauss linking integral using direct or fast summation methods (Barnes-Hut or\nfast multipole methods). We evaluate CPU and GPU implementations of these\nmethods on a suite of test problems, including yarn-level cloth and chainmail,\nthat involve significant processing: physics-based relaxation and animation,\nuser-modeled deformations, curve compression and reparameterization. We show\nthat topology errors can be efficiently identified to enable more robust\nprocessing of loopy structures.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2021 20:52:37 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Qu", "Ante", ""], ["James", "Doug L.", ""]]}, {"id": "2106.12856", "submitter": "Tobias Weinzierl", "authors": "Maximilien Gadouleau, Tobias Weinzierl", "title": "The maximum discrete surface-to-volume ratio of space-filling curve\n  partitions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Space-filling curves (SFCs) are used in high performance computing to\ndistribute a computational domain or its mesh, respectively, amongst different\ncompute units, i.e.~cores or nodes or accelerators. The part of the domain\nallocated to each compute unit is called a partition. Besides the balancing of\nthe work, the communication cost to exchange data between units determines the\nquality of a chosen partition. This cost can be approximated by the\nsurface-to-volume ratio of partitions: the volume represents the amount of\nlocal work, while the surface represents the amount of data to be transmitted.\nEmpirical evidence suggests that space-filling curves yield advantageous\nsurface-to-volume ratios. Formal proofs are available only for regular grids.\nWe investigate the surface-to-volume ratio of space-filling curve partitions\nfor adaptive grids and derive the maximum surface-to-volume ratio as a function\nof the number of cells in the partition. In order to prove our main theorem, we\nconstruct a new framework for the study of adaptive grids, notably introducing\nthe concepts of a shape and of classified partitions. The new methodological\nframework yields insight about the SFC-induced partition character even if the\ngrids refine rather aggressively in localised areas: it quantifies the obtained\nsurface-to-volume ratio. This framework thus has the potential to guide the\ndesign of better load balancing algorithms on the long term.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2021 09:34:01 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Gadouleau", "Maximilien", ""], ["Weinzierl", "Tobias", ""]]}, {"id": "2106.12969", "submitter": "Justin Dallant", "authors": "Jean Cardinal, Justin Dallant and John Iacono", "title": "Approximability of (Simultaneous) Class Cover for Boxes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Bereg et al. (2012) introduced the Boxes Class Cover problem, which has its\nroots in classification and clustering applications: Given a set of n points in\nthe plane, each colored red or blue, find the smallest cardinality set of\naxis-aligned boxes whose union covers the red points without covering any blue\npoint. In this paper we give an alternative proof of APX-hardness for this\nproblem, which also yields an explicit lower bound on its approximability. Our\nproof also directly applies when restricted to sets of points in general\nposition and to the case where so-called half-strips are considered instead of\nboxes, which is a new result.\n  We also introduce a symmetric variant of this problem, which we call\nSimultaneous Boxes Class Cover and can be stated as follows: Given a set S of n\npoints in the plane, each colored red or blue, find the smallest cardinality\nset of axis-aligned boxes which together cover S such that all boxes cover only\npoints of the same color and no box covering a red point intersects a box\ncovering a blue point. We show that this problem is also APX-hard and give a\npolynomial-time constant-factor approximation algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2021 12:38:22 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Cardinal", "Jean", ""], ["Dallant", "Justin", ""], ["Iacono", "John", ""]]}, {"id": "2106.13397", "submitter": "Youjia Zhou", "authors": "Youjia Zhou, Methun Kamruzzaman, Patrick Schnable, Bala\n  Krishnamoorthy, Ananth Kalyanaraman, Bei Wang", "title": "Pheno-Mapper: An Interactive Toolbox for the Visual Exploration of\n  Phenomics Data", "comments": "This is a preprint version. For a published version, please refer to\n  ACM DOI: 10.1145/3459930.3469511", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.HC math.AT q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High-throughput technologies to collect field data have made observations\npossible at scale in several branches of life sciences. The data collected can\nrange from the molecular level (genotypes) to physiological (phenotypic traits)\nand environmental observations (e.g., weather, soil conditions). These vast\nswathes of data, collectively referred to as phenomics data, represent a\ntreasure trove of key scientific knowledge on the dynamics of the underlying\nbiological system. However, extracting information and insights from these\ncomplex datasets remains a significant challenge owing to their\nmultidimensionality and lack of prior knowledge about their complex structure.\nIn this paper, we present Pheno-Mapper, an interactive toolbox for the\nexploratory analysis and visualization of large-scale phenomics data. Our\napproach uses the mapper framework to perform a topological analysis of the\ndata, and subsequently render visual representations with built-in data\nanalysis and machine learning capabilities. We demonstrate the utility of this\nnew tool on real-world plant (e.g., maize) phenomics datasets. In comparison to\nexisting approaches, the main advantage of Pheno-Mapper is that it provides\nrich, interactive capabilities in the exploratory analysis of phenomics data,\nand it integrates visual analytics with data analysis and machine learning in\nan easily extensible way. In particular, Pheno-Mapper allows the interactive\nselection of subpopulations guided by a topological summary of the data and\napplies data mining and machine learning to these selected subpopulations for\nin-depth exploration.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2021 02:55:45 GMT"}, {"version": "v2", "created": "Tue, 6 Jul 2021 05:08:50 GMT"}], "update_date": "2021-07-07", "authors_parsed": [["Zhou", "Youjia", ""], ["Kamruzzaman", "Methun", ""], ["Schnable", "Patrick", ""], ["Krishnamoorthy", "Bala", ""], ["Kalyanaraman", "Ananth", ""], ["Wang", "Bei", ""]]}, {"id": "2106.13439", "submitter": "Bogdan Armaselu", "authors": "Bogdan Armaselu", "title": "Extensions of the Maximum Bichromatic Separating Rectangle Problem", "comments": "14 pages, 14 figures, full version of CCCG paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we study two extensions of the maximum bichromatic separating\nrectangle (MBSR) problem introduced in \\cite{Armaselu-CCCG, Armaselu-arXiv}.\nOne of the extensions, introduced in \\cite{Armaselu-FWCG}, is called\n\\textit{MBSR with outliers} or MBSR-O, and is a more general version of the\nMBSR problem in which the optimal rectangle is allowed to contain up to $k$\noutliers, where $k$ is given as part of the input. For MBSR-O, we improve the\nprevious known running time bounds of $O(k^7 m \\log m + n)$ to $O(k^3 m + m\n\\log m + n)$. The other extension is called \\textit{MBSR among circles} or\nMBSR-C and asks for the largest axis-aligned rectangle separating red points\nfrom blue unit circles. For MBSR-C, we provide an algorithm that runs in $O(m^2\n+ n)$ time.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2021 05:45:28 GMT"}], "update_date": "2021-06-28", "authors_parsed": [["Armaselu", "Bogdan", ""]]}, {"id": "2106.13589", "submitter": "Michael Lesnick", "authors": "H{\\aa}vard Bakke Bjerkevik and Michael Lesnick", "title": "$\\ell^p$-Distances on Multiparameter Persistence Modules", "comments": "43 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AT cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated both by theoretical and practical considerations in topological\ndata analysis, we generalize the $p$-Wasserstein distance on barcodes to\nmultiparameter persistence modules. For each $p\\in [1,\\infty]$, we in fact\nintroduce two such generalizations $d_{\\mathcal I}^p$ and $d_{\\mathcal M}^p$,\nsuch that $d_{\\mathcal I}^\\infty$ equals the interleaving distance and\n$d_{\\mathcal M}^\\infty$ equals the matching distance. We show that $d_{\\mathcal\nM}^p\\leq d_{\\mathcal I}^p$ for all $p\\in [1,\\infty]$, extending an observation\nof Landi in the $p=\\infty$ case. We observe that the distances $d_{\\mathcal\nM}^p$ can be efficiently approximated. Finally, we show that on 1- or\n2-parameter persistence modules over prime fields, $d_{\\mathcal I}^p$ is the\nuniversal (i.e., largest) metric satisfying a natural stability property; our\nresult extends a stability result of Skraba and Turner for the $p$-Wasserstein\ndistance on barcodes in the 1-parameter case, and is also a close analogue of a\nuniversality property for the interleaving distance given by the second author.\nIn a companion paper, we apply some of these results to study the stability of\n($2$-parameter) multicover persistent homology.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2021 12:40:19 GMT"}], "update_date": "2021-06-28", "authors_parsed": [["Bjerkevik", "Håvard Bakke", ""], ["Lesnick", "Michael", ""]]}, {"id": "2106.13620", "submitter": "Annika Bonerath", "authors": "Annika Bonerath and Jan-Henrik Haunert and Joseph S. B. Mitchell and\n  Benjamin Niedermann", "title": "Shortcut Hulls: Vertex-restricted Outer Simplifications of Polygons", "comments": "Appears in the Proceedings of 33rd Canadian Conference on\n  Computational Geometry, 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $P$ be a crossing-free polygon and $\\mathcal C$ a set of shortcuts, where\neach shortcut is a directed straight-line segment connecting two vertices of\n$P$. A shortcut hull of $P$ is another crossing-free polygon that encloses $P$\nand whose oriented boundary is composed of elements from $\\mathcal C$. Shortcut\nhulls find their application in geo-related problems such as the simplification\nof contour lines. We aim at a shortcut hull that linearly balances the enclosed\narea and perimeter. If no holes in the shortcut hull are allowed, the problem\nadmits a straight-forward solution via shortest paths. For the more challenging\ncase that the shortcut hull may contain holes, we present a polynomial-time\nalgorithm that is based on computing a constrained, weighted triangulation of\nthe input polygon's exterior. We use this problem as a starting point for\ninvestigating further variants, e.g., restricting the number of edges or bends.\nWe demonstrate that shortcut hulls can be used for drawing the rough extent of\npoint sets as well as for the schematization of polygons.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2021 13:18:02 GMT"}], "update_date": "2021-06-28", "authors_parsed": [["Bonerath", "Annika", ""], ["Haunert", "Jan-Henrik", ""], ["Mitchell", "Joseph S. B.", ""], ["Niedermann", "Benjamin", ""]]}, {"id": "2106.13851", "submitter": "Jeff M Phillips", "authors": "Michael Matheny and Jeff M. Phillips", "title": "Approximate Maximum Halfspace Discrepancy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Consider the geometric range space $(X, \\mathcal{H}_d)$ where $X \\subset\n\\mathbb{R}^d$ and $\\mathcal{H}_d$ is the set of ranges defined by\n$d$-dimensional halfspaces. In this setting we consider that $X$ is the\ndisjoint union of a red and blue set. For each halfspace $h \\in \\mathcal{H}_d$\ndefine a function $\\Phi(h)$ that measures the \"difference\" between the fraction\nof red and fraction of blue points which fall in the range $h$. In this context\nthe maximum discrepancy problem is to find the $h^* = \\arg \\max_{h \\in (X,\n\\mathcal{H}_d)} \\Phi(h)$. We aim to instead find an $\\hat{h}$ such that\n$\\Phi(h^*) - \\Phi(\\hat{h}) \\le \\varepsilon$. This is the central problem in\nlinear classification for machine learning, in spatial scan statistics for\nspatial anomaly detection, and shows up in many other areas. We provide a\nsolution for this problem in $O(|X| + (1/\\varepsilon^d) \\log^4\n(1/\\varepsilon))$ time, which improves polynomially over the previous best\nsolutions. For $d=2$ we show that this is nearly tight through conditional\nlower bounds. For different classes of $\\Phi$ we can either provide a\n$\\Omega(|X|^{3/2 - o(1)})$ time lower bound for the exact solution with a\nreduction to APSP, or an $\\Omega(|X| + 1/\\varepsilon^{2-o(1)})$ lower bound for\nthe approximate solution with a reduction to 3SUM.\n  A key technical result is a $\\varepsilon$-approximate halfspace range\ncounting data structure of size $O(1/\\varepsilon^d)$ with $O(\\log\n(1/\\varepsilon))$ query time, which we can build in $O(|X| + (1/\\varepsilon^d)\n\\log^4 (1/\\varepsilon))$ time.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2021 19:14:45 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Matheny", "Michael", ""], ["Phillips", "Jeff M.", ""]]}, {"id": "2106.14086", "submitter": "Jeff Erickson", "authors": "Jeff Erickson and Patrick Lin", "title": "Planar and Toroidal Morphs Made Easier", "comments": "19 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present simpler algorithms for two closely related morphing problems, both\nbased on the barycentric interpolation paradigm introduced by Floater and\nGotsman, which is in turn based on Floater's asymmetric extension of Tutte's\nclassical spring-embedding theorem. First, we give a much simpler algorithm to\nconstruct piecewise-linear morphs between planar straight-line graphs.\nSpecifically, given isomorphic straight-line drawings $\\Gamma_0$ and $\\Gamma_1$\nof the same 3-connected planar graph $G$, with the same convex outer face, we\nconstruct a morph from $\\Gamma_0$ to $\\Gamma_1$ that consists of $O(n)$\nunidirectional morphing steps, in $O(n^{1+\\omega/2})$ time. Our algorithm\nentirely avoids the classical edge-collapsing strategy dating back to Cairns;\ninstead, in each morphing step, we interpolate the pair of weights associated\nwith a single edge. Second, we describe a natural extension of barycentric\ninterpolation to geodesic graphs on the flat torus. Barycentric interpolation\ncannot be applied directly in this setting, because the linear systems defining\nintermediate vertex positions are not necessarily solvable. We describe a\nsimple scaling strategy that circumvents this issue. Computing the appropriate\nscaling requires $O(n^{\\omega/2})$ time, after which we can can compute the\ndrawing at any point in the morph in $O(n^{\\omega/2})$ time. Our algorithm is\nconsiderably simpler than the recent algorithm of Chambers et al.\n(arXiv:2007.07927) and produces more natural morphs. Our techniques also yield\na simple proof of a conjecture of Connelly et al. for geodesic torus\ntriangulations.\n", "versions": [{"version": "v1", "created": "Sat, 26 Jun 2021 20:30:42 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Erickson", "Jeff", ""], ["Lin", "Patrick", ""]]}, {"id": "2106.14176", "submitter": "Eunjin Oh", "authors": "Kyungjin Cho and Eunjin Oh", "title": "Linear-Time Approximation Scheme for k-Means Clustering of Affine\n  Subspaces", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we present a linear-time approximation scheme for $k$-means\nclustering of \\emph{incomplete} data points in $d$-dimensional Euclidean space.\nAn \\emph{incomplete} data point with $\\Delta>0$ unspecified entries is\nrepresented as an axis-parallel affine subspaces of dimension $\\Delta$. The\ndistance between two incomplete data points is defined as the Euclidean\ndistance between two closest points in the axis-parallel affine subspaces\ncorresponding to the data points. We present an algorithm for $k$-means\nclustering of axis-parallel affine subspaces of dimension $\\Delta$ that yields\nan $(1+\\epsilon)$-approximate solution in $O(nd)$ time. The constants hidden\nbehind $O(\\cdot)$ depend only on $\\Delta, \\epsilon$ and $k$. This improves the\n$O(n^2 d)$-time algorithm by Eiben et al.[SODA'21] by a factor of $n$.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jun 2021 09:27:22 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Cho", "Kyungjin", ""], ["Oh", "Eunjin", ""]]}, {"id": "2106.14185", "submitter": "Mincheol Kim", "authors": "Mincheol Kim, Hee-Kap Ahn", "title": "Minimum-Link Shortest Paths for Polygons amidst Rectilinear Obstacles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider two axis-aligned rectilinear simple polygons in the domain\nconsisting of axis-aligned rectilinear obstacles in the plane such that the\nbounding boxes, one for each obstacle and one for each polygon, are disjoint.\nWe present an algorithm that computes a minimum-link rectilinear shortest path\nconnecting the two polygons in $O((N+n)\\log (N+n))$ time using $O(N+n)$ space,\nwhere $n$ is the number of vertices in the domain and $N$ is the total number\nof vertices of the two polygons.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jun 2021 10:20:35 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Kim", "Mincheol", ""], ["Ahn", "Hee-Kap", ""]]}, {"id": "2106.14195", "submitter": "Jaroslav Macke", "authors": "J. Macke, J. Sedlar, M. Olsak, J. Urban, J. Sivic", "title": "Learning to solve geometric construction problems from images", "comments": "16 pages, 7 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.AI cs.CG cs.LG cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We describe a purely image-based method for finding geometric constructions\nwith a ruler and compass in the Euclidea geometric game. The method is based on\nadapting the Mask R-CNN state-of-the-art image processing neural architecture\nand adding a tree-based search procedure to it. In a supervised setting, the\nmethod learns to solve all 68 kinds of geometric construction problems from the\nfirst six level packs of Euclidea with an average 92% accuracy. When evaluated\non new kinds of problems, the method can solve 31 of the 68 kinds of Euclidea\nproblems. We believe that this is the first time that a purely image-based\nlearning has been trained to solve geometric construction problems of this\ndifficulty.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jun 2021 10:47:41 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Macke", "J.", ""], ["Sedlar", "J.", ""], ["Olsak", "M.", ""], ["Urban", "J.", ""], ["Sivic", "J.", ""]]}, {"id": "2106.14262", "submitter": "Rachana Madhukara", "authors": "Vincent Bian, Erik Demaine, and Rachana Madhukara", "title": "Edge-Unfolding Prismatoids: Tall or Rectangular Base", "comments": "5 pages, 7 figures, CCCG 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how to edge-unfold a new class of convex polyhedra, specifically a\nnew class of prismatoids (the convex hull of two parallel convex polygons,\ncalled the top and base), by constructing a nonoverlapping \"petal unfolding\" in\ntwo new cases: (1) when the top and base are sufficiently far from each other;\nand (2) when the base is a rectangle and all other faces are nonobtuse\ntriangles. The latter result extends a previous result by O'Rourke that the\npetal unfolding of a prismatoid avoids overlap when the base is a triangle\n(possibly obtuse) and all other faces are nonobtuse triangles. We also\nillustrate the difficulty of extending this result to a general quadrilateral\nbase by giving a counterexample to our technique.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jun 2021 15:45:26 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Bian", "Vincent", ""], ["Demaine", "Erik", ""], ["Madhukara", "Rachana", ""]]}, {"id": "2106.14451", "submitter": "Pilar Cano", "authors": "Sujoy Bhore, Prosenjit Bose, Pilar Cano, Jean Cardinal, and John\n  Iacono", "title": "Dynamic Schnyder Woods", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  A realizer, commonly known as Schnyder woods, of a triangulation is a\npartition of its interior edges into three oriented rooted trees. A flip in a\nrealizer is a local operation that transforms one realizer into another. Two\ntypes of flips in a realizer have been introduced: colored flips and cycle\nflips. A corresponding flip graph is defined for each of these two types of\nflips. The vertex sets are the realizers, and two realizers are adjacent if\nthey can be transformed into each other by one flip. In this paper we study the\nrelation between these two types of flips and their corresponding flip graphs.\nWe show that a cycle flip can be obtained from linearly many colored flips. We\nalso prove an upper bound of $O(n^2)$ on the diameter of the flip graph of\nrealizers defined by colored flips. In addition, a data structure is given to\ndynamically maintain a realizer over a sequence of colored flips which supports\nqueries, including getting a node's barycentric coordinates, in $O(\\log n)$\ntime per flip or query.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2021 08:11:08 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Bhore", "Sujoy", ""], ["Bose", "Prosenjit", ""], ["Cano", "Pilar", ""], ["Cardinal", "Jean", ""], ["Iacono", "John", ""]]}, {"id": "2106.14728", "submitter": "Guilherme D. da Fonseca", "authors": "Lo\\\"ic Crombez, Guilherme D. da Fonseca, Yan Gerard", "title": "Greedy and Local Search Heuristics to Build Area-Optimal Polygons", "comments": "Second place at CG:SHOP 2019 challenge", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present our heuristic solutions to the problems of finding\nthe maximum and minimum area polygons with a given set of vertices. Our\nsolutions are based mostly on two simple algorithmic paradigms: greedy method\nand local search. The greedy heuristic starts with a simple polygon and adds\nvertices one by one, according to a weight function. A crucial ingredient to\nobtain good solutions is the choice of an appropriate weight function that\navoids long edges. The local search part consists of moving consecutive\nvertices to another location in the polygonal chain. We also discuss the\ndifferent implementation techniques that are necessary to reduce the running\ntime.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2021 13:58:55 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Crombez", "Loïc", ""], ["da Fonseca", "Guilherme D.", ""], ["Gerard", "Yan", ""]]}, {"id": "2106.14730", "submitter": "Philip Caplan", "authors": "Philip Claude Caplan", "title": "Higher-dimensional power diagrams for semi-discrete optimal transport", "comments": "29th International Meshing Roundtable", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Efficient algorithms for solving optimal transport problems are important for\nmeasuring and optimizing distances between functions. In the $L^2$\nsemi-discrete context, this problem consists of finding a map from a continuous\ndensity function to a discrete set of points so as to minimize the transport\ncost, using the squared Euclidean distance as the cost function. This has\nimportant applications in image stippling, clustering, resource allocation and\nin generating blue noise point distributions for rendering. Recent algorithms\nhave been developed for solving the semi-discrete problem in $2d$ and $3d$,\nhowever, algorithms in higher dimensions have yet to be demonstrated, which\nrely on the efficient calculation of the power diagram (Laguerre diagram) in\nhigher dimensions. Here, we introduce an algorithm for computing power\ndiagrams, which extends to any topological dimension. We first evaluate the\nperformance of the algorithm in $2d-6d$. We then restrict our attention to\nfour-dimensional settings, demonstrating that our power diagrams can be used to\nsolve optimal quantization and semi-discrete optimal transport problems,\nwhereby a prescribed mass of each power cell is achieved by computing an\noptimized power diagram.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2021 14:00:09 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Caplan", "Philip Claude", ""]]}, {"id": "2106.14935", "submitter": "Katharina Klost", "authors": "Haim Kaplan, Alexander Kauer, Katharina Klost, Kristin Knorr, Wolfgang\n  Mulzer, Liam Roditty and Paul Seiferth", "title": "Dynamic Connectivity in Disk Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Let $S$ be a set of $n$ sites, each associated with a point in $\\mathbb{R}^2$\nand a radius $r_s$ and let $\\mathcal{D}(S)$ be the disk graph on $S$. We\nconsider the problem of designing data structures that maintain the\nconnectivity structure of $\\mathcal{D}(S)$ while allowing the insertion and\ndeletion of sites. For unit disk graphs we describe a data structure that has\n$O(\\log^2n)$ amortized update time and $O((\\log n)/(\\log\\log n))$ amortized\nquery time.\n  For disk graphs where the ratio $\\Psi$ between the largest and smallest\nradius is bounded, we consider the decremental and the incremental case\nseparately, in addition to the fully dynamic case. In the fully dynamic case we\nachieve amortized $O(\\Psi \\lambda_6(\\log n) \\log^{9}n)$ update time and $O(\\log\nn)$ query time, where $\\lambda_s(n)$ is the maximum length of a\nDavenport-Schinzel sequence of order $s$ on $n$ symbols. This improves the\nupdate time of the currently best known data structure by a factor of $\\Psi$ at\nthe cost of an additional $O(\\log \\log n)$ factor in the query time. In the\nincremental case we manage to achieve a logarithmic dependency on $\\Psi$ with a\ndata structure with $O(\\alpha(n))$ query and $O(\\log\\Psi \\lambda_6(\\log n)\n\\log^{9}n)$ update time.\n  For the decremental setting we first develop a new dynamic data structure\nthat allows us to maintain two sets $B$ and $P$ of disks, such than at a\ndeletion of a disk from $B$ we can efficiently report all disks in $P$ that no\nlonger intersect any disk of $B$. Having this data structure at hand, we get\ndecremental data structures with an amortized query time of $O((\\log n)/(\\log\n\\log n))$ supporting $m$ deletions in $O((n\\log^{5}n + m \\log^{9}n)\n\\lambda_6(\\log n) + n\\log\\Psi\\log^4n)$ overall time for bounded radius ratio\n$\\Psi$ and $O(( n\\log^{6} n + m \\log^{10}n) \\lambda_6(\\log n))$ for general\ndisk graphs.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2021 18:32:33 GMT"}], "update_date": "2021-06-30", "authors_parsed": [["Kaplan", "Haim", ""], ["Kauer", "Alexander", ""], ["Klost", "Katharina", ""], ["Knorr", "Kristin", ""], ["Mulzer", "Wolfgang", ""], ["Roditty", "Liam", ""], ["Seiferth", "Paul", ""]]}, {"id": "2106.15234", "submitter": "Hadi Khodabandeh", "authors": "David Eppstein, Hadi Khodabandeh", "title": "Optimal Spanners for Unit Ball Graphs in Doubling Metrics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Resolving an open question from 2006, we prove the existence of light-weight\nbounded-degree spanners for unit ball graphs in the metrics of bounded doubling\ndimension, and we design a simple $\\mathcal{O}(\\log^*n)$-round distributed\nalgorithm that given a unit ball graph $G$ with $n$ vertices and a positive\nconstant $\\epsilon < 1$ finds a $(1+\\epsilon)$-spanner with constant bounds on\nits maximum degree and its lightness using only 2-hop neighborhood information.\nThis immediately improves the algorithm of Damian, Pandit, and Pemmaraju which\nruns in $\\mathcal{O}(\\log^*n)$ rounds but has a $\\mathcal{O}(\\log \\Delta)$\nbound on its lightness, where $\\Delta$ is the ratio of the length of the\nlongest edge in $G$ to the length of the shortest edge. We further study the\nproblem in the two dimensional Euclidean plane and we provide a construction\nwith similar properties that has a constant average number of edge intersection\nper node. This is the first distributed low-intersection topology control\nalgorithm to the best of our knowledge. Our distributed algorithms rely on the\nmaximal independent set algorithm of Schneider and Wattenhofer that runs in\n$\\mathcal{O}(\\log^*n)$ rounds of communication. If a maximal independent set is\nknown beforehand, our algorithms run in constant number of rounds.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2021 10:36:37 GMT"}], "update_date": "2021-06-30", "authors_parsed": [["Eppstein", "David", ""], ["Khodabandeh", "Hadi", ""]]}, {"id": "2106.15566", "submitter": "Lunjia Hu", "authors": "Moses Charikar, Lunjia Hu", "title": "Near-Optimal Explainable $k$-Means for All Dimensions", "comments": "31 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CG cs.DS stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many clustering algorithms are guided by certain cost functions such as the\nwidely-used $k$-means cost. These algorithms divide data points into clusters\nwith often complicated boundaries, creating difficulties in explaining the\nclustering decision. In a recent work, Dasgupta, Frost, Moshkovitz, and\nRashtchian (ICML'20) introduced explainable clustering, where the cluster\nboundaries are axis-parallel hyperplanes and the clustering is obtained by\napplying a decision tree to the data. The central question here is: how much\ndoes the explainability constraint increase the value of the cost function?\n  Given $d$-dimensional data points, we show an efficient algorithm that finds\nan explainable clustering whose $k$-means cost is at most $k^{1 -\n2/d}\\mathrm{poly}(d\\log k)$ times the minimum cost achievable by a clustering\nwithout the explainability constraint, assuming $k,d\\ge 2$. Combining this with\nan independent work by Makarychev and Shan (ICML'21), we get an improved bound\nof $k^{1 - 2/d}\\mathrm{polylog}(k)$, which we show is optimal for every choice\nof $k,d\\ge 2$ up to a poly-logarithmic factor in $k$. For $d = 2$ in\nparticular, we show an $O(\\log k\\log\\log k)$ bound, improving exponentially\nover the previous best bound of $\\widetilde O(k)$.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2021 16:59:03 GMT"}], "update_date": "2021-06-30", "authors_parsed": [["Charikar", "Moses", ""], ["Hu", "Lunjia", ""]]}, {"id": "2106.15585", "submitter": "Erik Demaine", "authors": "Erik D. Demaine, Jayson Lynch, Mikhail Rudoy, Yushi Uno", "title": "Yin-Yang Puzzles are NP-complete", "comments": "10 pages, 11 figures. Proceedings of CCCG 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove NP-completeness of Yin-Yang / Shiromaru-Kuromaru pencil-and-paper\npuzzles. Viewed as a graph partitioning problem, we prove NP-completeness of\npartitioning a rectangular grid graph into two induced trees (normal Yin-Yang),\nor into two induced connected subgraphs (Yin-Yang without $2 \\times 2$ rule),\nsubject to some vertices being pre-assigned to a specific tree/subgraph.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2021 17:21:16 GMT"}], "update_date": "2021-06-30", "authors_parsed": [["Demaine", "Erik D.", ""], ["Lynch", "Jayson", ""], ["Rudoy", "Mikhail", ""], ["Uno", "Yushi", ""]]}, {"id": "2106.15596", "submitter": "Hung Le", "authors": "Hung Le and Shay Solomon", "title": "Towards a Unified Theory of Light Spanners I: Fast (Yet Optimal)\n  Constructions", "comments": "55 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Seminal works on light spanners over the years provide spanners with optimal\nor near-optimal lightness in various graph classes, such as in general graphs,\nEuclidean spanners, and minor-free graphs. Two shortcomings of all previous\nwork on light spanners are: (1) The techniques are ad hoc per graph class, and\nthus can't be applied broadly (e.g., some require large stretch and are thus\nsuitable to general graphs, while others are naturally suitable to stretch $1 +\n\\epsilon$). (2) The runtimes of these constructions are almost always\nsub-optimal, and usually far from optimal.\n  This work aims at initiating a unified theory of light spanners by presenting\na single framework that can be used to construct light spanners in a variety of\ngraph classes. This theory is developed in two papers. The current paper is the\nfirst of the two -- it lays the foundations of the theory of light spanners and\nthen applies it to design fast constructions with optimal lightness for several\ngraph classes. Our new constructions are significantly faster than the\nstate-of-the-art for every examined graph class; moreover, our runtimes are\nnear-linear and usually optimal.\n  Specifically, this paper includes the following results: (i) An $O(m\n\\alpha(m,n))$-time construction of $(2k-1)(1+\\epsilon)$-spanner with lightness\n$O(n^{1/k})$ for general graphs; (ii) An $O(n\\log n)$-time construction of\nEuclidean $(1+\\epsilon)$-spanners with lightness and degree both bounded by\nconstants in the basic algebraic computation tree (ACT) model. This\nconstruction resolves a major problem in the area of geometric spanners, which\nwas open for three decades; (iii) An $O(n\\log n)$-time construction of\n$(1+\\epsilon)$-spanners with constant lightness and degree, in the ACT model\nfor unit disk graphs; (iv) a linear-time algorithm for constructing\n$(1+\\epsilon)$-spanners with constant lightness for minor-free graphs.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2021 17:32:22 GMT"}, {"version": "v2", "created": "Fri, 2 Jul 2021 21:10:55 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Le", "Hung", ""], ["Solomon", "Shay", ""]]}, {"id": "2106.15885", "submitter": "Pohsuan Chen", "authors": "Jyun-Yu Chen and Po-Hsuan Chen", "title": "Optimal Construction for Time-Convex Hull with Two Orthogonal Highways\n  in the L1-metric", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider the time-convex hull problem in the presence of two orthogonal\nhighways H. In this problem, the travelling speed on the highway is faster than\noff the highway, and the time-convex hull of a point set P is the closure of P\nwith respect to the inclusion of shortest time-paths. In this paper, we provide\nthe algorithm for constructing the time-convex hull with two orthogonal\nhighways. We reach the optimal result of O(n log n) time for arbitrary highway\nspeed in the L1-metric. For the L2-metric with infinite highway speed, we hit\nthe goal of O(n log n) time as well.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2021 08:19:49 GMT"}], "update_date": "2021-07-01", "authors_parsed": [["Chen", "Jyun-Yu", ""], ["Chen", "Po-Hsuan", ""]]}]