[{"id": "1007.0118", "submitter": "Mubashir Husain Rehmani", "authors": "Mubashir Husain Rehmani", "title": "Channel Assortment Strategy for Reliable Communication in Multi-Hop\n  Cognitive Radio Networks", "comments": null, "journal-ref": "In Proceedings of the 11th IEEE International Symposium on a World\n  of Wireless, Mobile and Multimedia Networks (IEEE WoWMoM 2010), Extended\n  Abstract, Montreal, QC, Canada, 14- 17 June 2010", "doi": "10.1109/WOWMOM.2010.5534972", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a channel assortment strategy for Reliable\nCommunication in Multi-Hop Cognitive Radio Networks.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 10:17:29 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Rehmani", "Mubashir Husain", ""]]}, {"id": "1007.0123", "submitter": "Mubashir Husain Rehmani", "authors": "Mubashir Husain Rehmani, Aline Carneiro Viana, Hicham Khalife, and\n  Serge Fdida", "title": "Adaptive and occupancy-based channel selection for unreliable cognitive\n  radio networks", "comments": null, "journal-ref": "Rencontres Francophones sur les Aspects Algorithmiques des\n  Telecommunications (ALGOTEL) 2009, du 16 au 19 juin 2009, Carry Le Rouet,\n  France", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an adaptive and occupancy-based channel selection\nfor unreliable cognitive radio networks.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 10:26:50 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Rehmani", "Mubashir Husain", ""], ["Viana", "Aline Carneiro", ""], ["Khalife", "Hicham", ""], ["Fdida", "Serge", ""]]}, {"id": "1007.0126", "submitter": "Mubashir Husain Rehmani", "authors": "Mubashir Husain Rehmani, Aline Carneiro Viana, Hicham Khalife, and\n  Serge Fdida", "title": "A Cognitive Radio Based Internet Access Framework for Disaster Response\n  Network Deployment", "comments": null, "journal-ref": null, "doi": null, "report-no": "INRIA Research Report RR-7285, May 2010", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a cognitive radio based Internet access framework\nfor disaster response network deployment in challenged environments. The\nproposed architectural framework is designed to help the existent but partially\ndamaged networks to restore their connectivity and to connect them to the\nglobal Internet. This architectural framework provides the basis to develop\nalgorithms and protocols for the future cognitive radio network deployments in\nchallenged environments.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 10:42:11 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Rehmani", "Mubashir Husain", ""], ["Viana", "Aline Carneiro", ""], ["Khalife", "Hicham", ""], ["Fdida", "Serge", ""]]}, {"id": "1007.0128", "submitter": "Mubashir Husain Rehmani", "authors": "Mubashir Husain Rehmani, Aline Carneiro Viana, Hicham Khalife, and\n  Serge Fdida", "title": "Toward Reliable Contention-aware Data Dissemination in Multi-hop\n  Cognitive Radio Ad Hoc Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": "INRIA Research Report RR-7288, December 2009", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a new channel selection strategy for reliable\ncontentionaware data dissemination in multi-hop cognitive radio network. The\nkey challenge here is to select channels providing a good tradeoff between\nconnectivity and contention. In other words, channels with good opportunities\nfor communication due to (1) low primary radio nodes (PRs) activities, and (2)\nlimited contention of cognitive ratio nodes (CRs) acceding that channel, have\nto be selected. Thus, by dynamically exploring residual resources on channels\nand by monitoring the number of CRs on a particular channel, SURF allows\nbuilding a connected network with limited contention where reliable\ncommunication can take place. Through simulations, we study the performance of\nSURF when compared with three other related approaches. Simulation results\nconfirm that our approach is effective in selecting the best channels for\nefficient and reliable multi-hop data dissemination.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 10:51:04 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Rehmani", "Mubashir Husain", ""], ["Viana", "Aline Carneiro", ""], ["Khalife", "Hicham", ""], ["Fdida", "Serge", ""]]}, {"id": "1007.0144", "submitter": "Tansu Alpcan", "authors": "Tansu Alpcan, Lacra Pavel and Nem Stefanovic", "title": "An Optimization and Control Theoretic Approach to Noncooperative Game\n  Design", "comments": "Earlier versions of this work have appeared partly in the\n  International Conference on Game Theory for Networks (GameNets), in Istanbul,\n  Turkey in May 2009 and Conference on Decision and Control (CDC), Shanghai,\n  China, in December 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates design of noncooperative games from an optimization\nand control theoretic perspective. Pricing mechanisms are used as a design tool\nto ensure that the Nash equilibrium of a fairly general class of noncooperative\ngames satisfies certain global objectives such as welfare maximization or\nachieving a certain level of quality-of-service (QoS). The class of games\nconsidered provide a theoretical basis for decentralized resource allocation\nand control problems including network congestion control, wireless uplink\npower control, and optical power control. The game design problem is analyzed\nunder different knowledge assumptions (full versus limited information) and\ndesign objectives (QoS versus utility maximization) for separable and\nnon-separable utility functions. The ``price of anarchy'' is shown not to be an\ninherent feature of full-information games that incorporate pricing mechanisms.\nMoreover, a simple linear pricing is shown to be sufficient for design of Nash\nequilibrium according to a chosen global objective for a fairly general class\nof games. Stability properties of the game and pricing dynamics are studied\nunder the assumption of time-scale separation and in two separate time-scales.\nThus, sufficient conditions are derived, which allow the designer to place the\nNash equilibrium solution or to guide the system trajectory to a desired region\nor point. The obtained results are illustrated with a number of examples.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 12:17:30 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Alpcan", "Tansu", ""], ["Pavel", "Lacra", ""], ["Stefanovic", "Nem", ""]]}, {"id": "1007.0409", "submitter": "Dimple Juneja Dr.", "authors": "Natarajan Meghanathan, Leslie Milton", "title": "A Performance Comparison of Stability, Load-Balancing and Power-Aware\n  Routing Protocols for Mobile Ad Hoc Networks", "comments": "http://ijict.org/index.php/ijoat/article/view/performance-comparison-manet-routing-protocols", "journal-ref": "International Journal of Advancements in Technology, Vol 1, No 1\n  (2010)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The high-level contribution of this paper is a simulation-based detailed\nperformance comparison of three different classes of routing protocols for\nmobile ad hoc networks: stability-based routing, power-aware routing and\nload-balanced routing. We choose the Flow-Oriented Routing protocol (FORP), the\ntraffic interference based Load Balancing Routing (LBR) protocol and Min-Max\nBattery Cost Routing (MMBCR) as representatives of the stability-based routing,\nload-balancing and power-aware routing protocols respectively. Among the three\nrouting protocols, FORP incurs the least number of route transitions; while LBR\nincurs the smallest hop count and lowest end-to-end delay per data packet.\nEnergy consumed per node is the least for MMBCR, closely followed by LBR. MMBCR\nis the most fair in terms of node usage and hence it incurs the largest time\nfor first node failure. FORP tends to repeatedly use nodes lying on the stable\npath and hence is the most unfair of the three routing protocols and it incurs\nthe smallest value for the time of first node failure. As we measure the\nfailure times of up to the first five nodes in the network, we observe that LBR\nincurs the maximum improvement in the lifetime of the nodes and MMBCR incurs\nthe least improvement beyond the time of first node failure.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 09:35:44 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Meghanathan", "Natarajan", ""], ["Milton", "Leslie", ""]]}, {"id": "1007.0410", "submitter": "Dimple Juneja Dr.", "authors": "Pooja Saini", "title": "Impact Of Mobility and Transmission Range On The Performance of Backoff\n  Algorithms For IEEE 802.11-Based Multi-hop Mobile Ad hoc Networks", "comments": "http://ijict.org/index.php/ijoat/article/view/impact-of-mobility-on-ieee-802-11-manets", "journal-ref": "International Journal of Advancements in Technology, Vol 1, No 1\n  (2010)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In IEEE 802.11 Wireless Local Area Networks (WLANs), network nodes\nexperiencing collisions on the shared channel need to backoff for a random\nperiod of time, which is uniformly selected from the Contention Window (CW).\nThis contention window is dynamically controlled by the Backoff algorithm.\nFirst step to design a an efficient backoff algorithm for multi-hop ad hoc\nnetwork is to analysis of the existing backoff algorithms in multi-hop ad hoc\nnetworks. Thus, in this paper, we considered two important multi-hop adhoc\nnetwork scenarios: (a) Node Mobility Scenario and (b) Transmission Range\nScenario and analyze and evaluate both the impact of mobility (i.e. node speed)\nand the impact of transmission range of nodes on the performance of various\nbackoff algorithms\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 09:29:44 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Saini", "Pooja", ""]]}, {"id": "1007.0411", "submitter": "Dimple Juneja Dr.", "authors": "Addepalli V.N Krishna, A Vinay Babu", "title": "Role of Statistical tests in Estimation of the Security of a New\n  Encryption Algorithm", "comments": "http://ijict.org/index.php/ijoat/article/view/statistical-tests-for-encryption-algorithm", "journal-ref": "International Journal of Advancements in Technology, Vol 1, No 1\n  (2010)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Encryption study basically deals with three levels of algorithms. The first\nalgorithm deals with encryption mechanism, second deals with decryption\nMechanism and the third discusses about the generation of keys and sub keys\nused in the encryption study. In the given study, a new algorithm is discussed.\nThe algorithm executes a series of steps and generates a sequence. This\nsequence is being used as sub key to be mapped to plain text to generate cipher\ntext. The strength of the encryption & Decryption process depends on the\nstrength of sequence generated against crypto analysis.. In this part of work\nsome statistical tests like Uniformity tests, Universal tests & Repetition\ntests are tried on the sequence generated to test the strength of it.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 09:27:09 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Krishna", "Addepalli V. N", ""], ["Babu", "A Vinay", ""]]}, {"id": "1007.0413", "submitter": "Dimple Juneja Dr.", "authors": "Dimple Juneja, Neha Arora", "title": "An Ant Based Framework for Preventing DDoS Attack in Wireless Sensor\n  Networks", "comments": "ISSN : 0976-4860 (Online).\n  http://ijict.org/index.php/ijoat/article/view/ant-based-framework-ddos-wsn", "journal-ref": "International Journal of Advancements in Technology (IJoAT), Vol\n  1, No 1 (2010)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Security and Privacy are two important parameters that need to be considered\nwhen dealing with wireless sensor networks as WSN operate in an unattended\nenvironment and carry sensitive information critical to the application.\nHowever, applying security techniques that consume minimum resources is still a\nchallenge and this paper makes an attempt to address the same. One of the major\nattacks in sensor network is denial of service attack that not only diminishes\nthe network capacity but also affects the reliability of information being\ntransmitted. This work is an extension of our previous work which could\nsuccessfully detect DDoS using ants. However, no emphasis was made towards the\nprevention mechanism. In this paper an ant-based framework that exploits the\nsignificance of stateless and stateful signatures and hence preserving the\nlegtimate packets only, thereby discarding the contaminated packets has been\nproposed.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2010 09:18:03 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Juneja", "Dimple", ""], ["Arora", "Neha", ""]]}, {"id": "1007.0507", "submitter": "Sundeep Rangan", "authors": "Sundeep Rangan", "title": "Femto-Macro Cellular Interference Control with Subband Scheduling and\n  Interference Cancelation", "comments": "8 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A significant technical challenge in deploying femtocells is controlling the\ninterference from the underlay of femtos onto the overlay of macros. This paper\npresents a novel interference control method where the macrocell bandwidth is\npartitioned into subbands, and the short-range femtocell links adaptively\nallocate their power across the subbands based on a load-spillage power control\nmethod. The scheme can improve rate distribution in the macro network while\nalso providing opportunities for short-range communication as well. Moreover,\nthe proposed scheme requires minimal interference coordination communication\nbetween the femtos and macros, which is one of the main challenges in femtocell\nsystems. Also, simulations show certain advantages over simpler\northogonalization schemes or power control schemes without subband\npartitioning. Further modest gains may also be possible with interference\ncancelation.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jul 2010 18:27:51 GMT"}, {"version": "v2", "created": "Sun, 11 Jul 2010 23:31:37 GMT"}], "update_date": "2010-07-13", "authors_parsed": [["Rangan", "Sundeep", ""]]}, {"id": "1007.0522", "submitter": "Ahmed Badr", "authors": "Ahmed Badr, Ashish Khisti, Emin Martinian", "title": "Diversity Embedded Streaming Erasure Codes (DE-SCo): Constructions and\n  Optimality", "comments": "JSAC, May 2011, Special Issue on Trading Rate for Delay at the\n  Transport and Application Layers, Shorter version will appear in Globecom\n  2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Streaming erasure codes guarantee that each source packet is recovered within\na fixed delay at the receiver over a burst-erasure channel. This paper\nintroduces a new class of streaming codes: Diversity Embedded Streaming Erasure\nCodes (DE-SCo), that provide a flexible tradeoff between the channel quality\nand receiver delay. When the channel conditions are good, the source stream is\nrecovered with a low delay, whereas when the channel conditions are poor the\nsource stream is still recovered, albeit with a larger delay. Information\ntheoretic analysis of the underlying burst-erasure broadcast channel reveals\nthat DE-SCo achieve the minimum possible delay for the weaker user, without\nsacrificing the single-user optimal performance of the stronger user. Our\nconstructions are explicit, incur polynomial time encoding and decoding\ncomplexity and outperform random linear codes over burst-erasure channels.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jul 2010 02:14:49 GMT"}, {"version": "v2", "created": "Mon, 21 Feb 2011 15:26:09 GMT"}], "update_date": "2011-02-22", "authors_parsed": [["Badr", "Ahmed", ""], ["Khisti", "Ashish", ""], ["Martinian", "Emin", ""]]}, {"id": "1007.0528", "submitter": "Huy Nguyen", "authors": "Huy Nguyen and Rong Zheng", "title": "Binary Independent Component Analysis with OR Mixtures", "comments": "Manuscript submitted to IEEE Transactions on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2011.2144975", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Independent component analysis (ICA) is a computational method for separating\na multivariate signal into subcomponents assuming the mutual statistical\nindependence of the non-Gaussian source signals. The classical Independent\nComponents Analysis (ICA) framework usually assumes linear combinations of\nindependent sources over the field of realvalued numbers R. In this paper, we\ninvestigate binary ICA for OR mixtures (bICA), which can find applications in\nmany domains including medical diagnosis, multi-cluster assignment, Internet\ntomography and network resource management. We prove that bICA is uniquely\nidentifiable under the disjunctive generation model, and propose a\ndeterministic iterative algorithm to determine the distribution of the latent\nrandom variables and the mixing matrix. The inverse problem concerning\ninferring the values of latent variables are also considered along with noisy\nmeasurements. We conduct an extensive simulation study to verify the\neffectiveness of the propose algorithm and present examples of real-world\napplications where bICA can be applied.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jul 2010 06:38:48 GMT"}, {"version": "v2", "created": "Sun, 19 Dec 2010 19:47:03 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Nguyen", "Huy", ""], ["Zheng", "Rong", ""]]}, {"id": "1007.0730", "submitter": "Frederic Thouin", "authors": "Frederic Thouin, Mark Coates, Michael Rabbat", "title": "Large scale probabilistic available bandwidth estimation", "comments": "Submitted to Computer Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The common utilization-based definition of available bandwidth and many of\nthe existing tools to estimate it suffer from several important weaknesses: i)\nmost tools report a point estimate of average available bandwidth over a\nmeasurement interval and do not provide a confidence interval; ii) the commonly\nadopted models used to relate the available bandwidth metric to the measured\ndata are invalid in almost all practical scenarios; iii) existing tools do not\nscale well and are not suited to the task of multi-path estimation in\nlarge-scale networks; iv) almost all tools use ad-hoc techniques to address\nmeasurement noise; and v) tools do not provide enough flexibility in terms of\naccuracy, overhead, latency and reliability to adapt to the requirements of\nvarious applications. In this paper we propose a new definition for available\nbandwidth and a novel framework that addresses these issues. We define\nprobabilistic available bandwidth (PAB) as the largest input rate at which we\ncan send a traffic flow along a path while achieving, with specified\nprobability, an output rate that is almost as large as the input rate. PAB is\nexpressed directly in terms of the measurable output rate and includes\nadjustable parameters that allow the user to adapt to different application\nrequirements. Our probabilistic framework to estimate network-wide\nprobabilistic available bandwidth is based on packet trains, Bayesian\ninference, factor graphs and active sampling. We deploy our tool on the\nPlanetLab network and our results show that we can obtain accurate estimates\nwith a much smaller measurement overhead compared to existing approaches.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jul 2010 17:42:44 GMT"}], "update_date": "2010-07-06", "authors_parsed": [["Thouin", "Frederic", ""], ["Coates", "Mark", ""], ["Rabbat", "Michael", ""]]}, {"id": "1007.0917", "submitter": "Bela Genge", "authors": "Gyula Farkas, Bela Genge, Piroska Haller", "title": "A Platform for Implementing Secure Wireless Ad Hoc Networks", "comments": "Proceedings of the 2nd conference on Recent Achievements in\n  Mechatronics, Automation, Computer Science and Robotics, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  We propose a new platform for implementing secure wireless ad hoc networks.\nOur proposal is based on a modular architecture, with the software stack\nconstructed directly on the Ethernet layer. Within our platform we use a new\nsecurity protocol that we designed to ensure mutual authentication between\nnodes and a secure key exchange. The correctness of the proposed security\nprotocol is ensured by Guttman's authentication tests.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2010 15:11:44 GMT"}], "update_date": "2010-07-07", "authors_parsed": [["Farkas", "Gyula", ""], ["Genge", "Bela", ""], ["Haller", "Piroska", ""]]}, {"id": "1007.0920", "submitter": "Bela Genge", "authors": "Bela Genge and Piroska Haller", "title": "End-Host Distribution in Application-Layer Multicast: Main Issues and\n  Solutions", "comments": "9th RoEduNet IEEE International Conference, Sibiu, Romania, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Application-layer multicast implements the multicast functionality at the\napplication layer. The main goal of application-layer multicast is to construct\nand maintain efficient distribution structures between end-hosts. In this paper\nwe focus on the implementation of an application-layer multicast distribution\nalgorithm. We observe that the total time required to measure network latency\nover TCP is influenced dramatically by the TCP connection time. We argue that\nend-host distribution is not only influenced by the quality of network links\nbut also by the time required to make connections between nodes. We provide\nseveral solutions to decrease the total end-host distribution time.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2010 15:16:38 GMT"}], "update_date": "2010-07-07", "authors_parsed": [["Genge", "Bela", ""], ["Haller", "Piroska", ""]]}, {"id": "1007.0960", "submitter": "Gautam Thakur", "authors": "Gautam S. Thakur, Udayan Kumar, Ahmed Helmy, Wei-Jen Hsu", "title": "Analysis of Spatio-Temporal Preferences and Encounter Statistics for DTN\n  Performance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatio-temporal preferences and encounter statistics provide realistic\nmeasures to understand mobile user's behavioral preferences and transfer\nopportunities in Delay Tolerant Networks (DTNs). The time dependent behavior\nand periodic reappearances at specific locations can approximate future online\npresence while encounter statistics can aid to forward the routing decisions.\nIt is theoretically shown that such characteristics heavily affect the\nperformance of routing protocols. Therefore, mobility models demonstrating such\ncharacteristics are also expected to show identical routing performance.\nHowever, we argue models despite capturing these properties deviate from their\nexpected routing performance. We use realistic traces to validate this\nobservation on two mobility models. Our empirical results for epidemic routing\nshow those models' largely differ (delay 67% & reachability 79%) from the\nobserved values. This in-turn call for two important activities: (i) Analogous\nto routing, explore structural properties on a Global scale (ii) Design new\nmobility models that capture them.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2010 17:15:15 GMT"}], "update_date": "2010-07-07", "authors_parsed": [["Thakur", "Gautam S.", ""], ["Kumar", "Udayan", ""], ["Helmy", "Ahmed", ""], ["Hsu", "Wei-Jen", ""]]}, {"id": "1007.1100", "submitter": "Jalaluddin Qureshi", "authors": "Chuan Heng Foh, Jianfei Cai, and Jalaluddin Qureshi", "title": "Collision Codes: Decoding Superimposed BPSK Modulated Wireless\n  Transmissions", "comments": null, "journal-ref": null, "doi": "10.1109/CCNC.2010.5421745", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The introduction of physical layer network coding gives rise to the concept\nof turning a collision of transmissions on a wireless channel useful. In the\nidea of physical layer network coding, two synchronized simultaneous packet\ntransmissions are carefully encoded such that the superimposed transmission can\nbe decoded to produce a packet which is identical to the bitwise binary sum of\nthe two transmitted packets. This paper explores the decoding of superimposed\ntransmission resulted by multiple synchronized simultaneous transmissions. We\ndevise a coding scheme that achieves the identification of individual\ntransmission from the synchronized superimposed transmission. A mathematical\nproof for the existence of such a coding scheme is given.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2010 10:34:34 GMT"}], "update_date": "2010-07-08", "authors_parsed": [["Foh", "Chuan Heng", ""], ["Cai", "Jianfei", ""], ["Qureshi", "Jalaluddin", ""]]}, {"id": "1007.1194", "submitter": "Omar Mehanna", "authors": "Omar Mehanna and Ahmed Sultan", "title": "Inter-Sensing Time Optimization in Cognitive Radio Networks", "comments": "9 pages, 4 figures, submitted to IEEE transactions on Mobile\n  Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a set of primary channels that operate in an unslotted fashion,\nswitching activity at random times. A secondary user senses the primary\nchannels searching for transmission opportunities. If a channel is sensed to be\nfree, the secondary terminal transmits, and if sensed to be busy, the secondary\ntransmitter remains silent.We solve the problem of determining the optimal time\nafter which a primary channel needs to be sensed again depending on the sensing\noutcome. The objective is to find the inter-sensing times such that the mean\nsecondary throughput is maximized while imposing a constraint over the maximum\ntolerable interference inflicted on the primary network. Our numerical results\nshow that by optimizing the sensing-dependent inter-sensing times, our proposed\nscheme reduces the impact of sensing errors caused by false alarm and\nmisdetection and outperforms the case of a single sensing period.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2010 17:32:41 GMT"}], "update_date": "2010-07-08", "authors_parsed": [["Mehanna", "Omar", ""], ["Sultan", "Ahmed", ""]]}, {"id": "1007.1255", "submitter": "Jubin Jose", "authors": "Jubin Jose and Sriram Vishwanath", "title": "Queue-Architecture and Stability Analysis in Cooperative Relay Networks", "comments": "16 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An abstraction of the physical layer coding using bit pipes that are coupled\nthrough data-rates is insufficient to capture notions such as node cooperation\nin cooperative relay networks. Consequently, network-stability analyses based\non such abstractions are valid for non-cooperative schemes alone and\nmeaningless for cooperative schemes. Motivated from this, this paper develops a\nframework that brings the information-theoretic coding scheme together with\nnetwork-stability analysis. This framework does not constrain the system to any\nparticular achievable scheme, i.e., the relays can use any cooperative coding\nstrategy of its choice, be it amplify/compress/quantize or any\nalter-and-forward scheme. The paper focuses on the scenario when coherence\nduration is of the same order of the packet/codeword duration, the channel\ndistribution is unknown and the fading state is only known causally. The main\ncontributions of this paper are two-fold: first, it develops a low-complexity\nqueue-architecture to enable stable operation of cooperative relay networks,\nand, second, it establishes the throughput optimality of a simple network\nalgorithm that utilizes this queue-architecture.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2010 22:40:08 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Jose", "Jubin", ""], ["Vishwanath", "Sriram", ""]]}, {"id": "1007.1264", "submitter": "Huy Nguyen", "authors": "Huy Nguyen, Tam Van Nguyen, Dong Il Kim, and Deokjai Choi", "title": "Network Traffic Anomalies Detection and Identification with Flow\n  Monitoring", "comments": "Presented at 5th International Conference on Wireless and Optical\n  Communications Networks (WOCN'08) May 5-7, 2008, Surabaya, East Java\n  Indonesia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network management and security is currently one of the most vibrant research\nareas, among which, research on detecting and identifying anomalies has\nattracted a lot of interest. Researchers are still struggling to find an\neffective and lightweight method for anomaly detection purpose. In this paper,\nwe propose a simple, robust method that detects network anomalous traffic data\nbased on flow monitoring. Our method works based on monitoring the four\npredefined metrics that capture the flow statistics of the network. In order to\nprove the power of the new method, we did build an application that detects\nnetwork anomalies using our method. And the result of the experiments proves\nthat by using the four simple metrics from the flow data, we do not only\neffectively detect but can also identify the network traffic anomalies.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 00:06:53 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Nguyen", "Huy", ""], ["Van Nguyen", "Tam", ""], ["Kim", "Dong Il", ""], ["Choi", "Deokjai", ""]]}, {"id": "1007.1265", "submitter": "Huy Nguyen", "authors": "Tam Van Nguyen, Wontaek Lim, Huy Nguyen, and Deokjai Choi", "title": "Context Awareness Framework Based on Contextual Graph", "comments": "Presented at The 5th International Conference on Wireless and Optical\n  Communications Networks (WOCN'08) May 5-7, 2008, Surabaya, East Java\n  Indonesia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays computing becomes increasingly mobile and pervasive. One of the\nimportant steps in pervasive computing is context-awareness. Context-aware\npervasive systems rely on information about the context and user preferences to\nadapt their behavior. However, context-aware applications do not always behave\nas user's desire, and can cause users to feel dissatisfied with unexpected\nactions. To solve these problems, context-aware systems must provide mechanisms\nto adapt automatically when the context changes significantly. The interesting\ncharacteristic of context is its own behaviors which depend on various aspects\nof the surrounding contexts. This paper uses contextual graphs to solve the\nproblem \"the mutual relationships among the contexts\". We describe the most\nrelevant work in this area, as well as ongoing research on developing\ncontext-aware system for ubiquitous computing based on contextual graph. The\nusage of contextual graph in context-awareness is expected to make it effective\nfor developers to develop various applications with the need of context\nreasoning.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 00:14:09 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Van Nguyen", "Tam", ""], ["Lim", "Wontaek", ""], ["Nguyen", "Huy", ""], ["Choi", "Deokjai", ""]]}, {"id": "1007.1266", "submitter": "Huy Nguyen", "authors": "Huy Nguyen and Deokjai Choi", "title": "Network Anomaly Detection: Flow-based or Packet-based Approach?", "comments": "Published on Chonnam National University Networking Journal, Gwangju,\n  Korea June 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most critical tasks for network administrator is to ensure system\nuptime and availability. For the network security, anomaly detection systems,\nalong with firewalls and intrusion prevention systems are the must-have tools.\nSo far in the field of network anomaly detection, people are working on two\ndifferent approaches. One is flow-based; usually rely on network elements to\nmake so-called flow information available for analysis. The second approach is\npacket-based; which directly analyzes the data packet information for the\ndetection of anomalies. This paper describes the main differences between the\ntwo approaches through an in-depth analysis. We try to answer the question of\nwhen and why an approach is better than the other. The answer is critical for\nnetwork administrators to make their choices in deploying a defending system,\nsecuring the network and ensuring business continuity.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 00:19:13 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Nguyen", "Huy", ""], ["Choi", "Deokjai", ""]]}, {"id": "1007.1268", "submitter": "Huy Nguyen", "authors": "Huy Nguyen and Deokjai Choi", "title": "Application of Data Mining to Network Intrusion Detection: Classifier\n  Selection Model", "comments": "Presented at The 11th Asia-Pacific Network Operations and Management\n  Symposium (APNOMS 2008)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As network attacks have increased in number and severity over the past few\nyears, intrusion detection system (IDS) is increasingly becoming a critical\ncomponent to secure the network. Due to large volumes of security audit data as\nwell as complex and dynamic properties of intrusion behaviors, optimizing\nperformance of IDS becomes an important open problem that is receiving more and\nmore attention from the research community. The uncertainty to explore if\ncertain algorithms perform better for certain attack classes constitutes the\nmotivation for the reported herein. In this paper, we evaluate performance of a\ncomprehensive set of classifier algorithms using KDD99 dataset. Based on\nevaluation results, best algorithms for each attack category is chosen and two\nclassifier algorithm selection models are proposed. The simulation result\ncomparison indicates that noticeable performance improvement and real-time\nintrusion detection can be achieved as we apply the proposed models to detect\ndifferent kinds of network attacks.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 00:23:40 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Nguyen", "Huy", ""], ["Choi", "Deokjai", ""]]}, {"id": "1007.1270", "submitter": "Huy Nguyen", "authors": "Huy Nguyen, Tam Van Nguyen, and Deokjai Choi", "title": "How to Maximize User Satisfaction Degree in Multi-service IP Networks", "comments": "Presented at The First Asia Conference on Intelligent Information and\n  Database Systems April, 1-3, 2009, Dong Hoi City, Quang Binh province,\n  Vietnam", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bandwidth allocation is a fundamental problem in communication networks. With\ncurrent network moving towards the Future Internet model, the problem is\nfurther intensified as network traffic demanding far from exceeds network\nbandwidth capability. Maintaining a certain user satisfaction degree therefore\nbecomes a challenge research topic. In this paper, we deal with the problem by\nproposing BASMIN, a novel bandwidth allocation scheme that aims to maximize\nnetwork user's happiness. We also defined a new metric for evaluating network\nuser satisfaction degree: network worth. A three-step evaluation process is\nthen conducted to compare BASMIN efficiency with other three popular bandwidth\nallocation schemes. Throughout the tests, we experienced BASMIN's advantages\nover the others; we even found out that one of the most widely used bandwidth\nallocation schemes, in fact, is not effective at all.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 00:47:16 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Nguyen", "Huy", ""], ["Van Nguyen", "Tam", ""], ["Choi", "Deokjai", ""]]}, {"id": "1007.1272", "submitter": "Huy Nguyen", "authors": "Huy Nguyen, Rong Zheng, and Zhu Han", "title": "Binary is Good: A Binary Inference Framework for Primary User Separation\n  in Cognitive Radio Networks", "comments": "Withdrawn for updating as a new submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Primary users (PU) separation concerns with the issues of distinguishing and\ncharacterizing primary users in cognitive radio (CR) networks. We argue the\nneed for PU separation in the context of collaborative spectrum sensing and\nmonitor selection. In this paper, we model the observations of monitors as\nboolean OR mixtures of underlying binary latency sources for PUs, and devise a\nnovel binary inference algorithm for PU separation. Simulation results show\nthat without prior knowledge regarding PUs' activities, the algorithm achieves\nhigh inference accuracy. An interesting implication of the proposed algorithm\nis the ability to effectively represent n independent binary sources via\n(correlated) binary vectors of logarithmic length.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 01:28:34 GMT"}, {"version": "v2", "created": "Thu, 19 Apr 2012 22:56:33 GMT"}], "update_date": "2012-04-23", "authors_parsed": [["Nguyen", "Huy", ""], ["Zheng", "Rong", ""], ["Han", "Zhu", ""]]}, {"id": "1007.1273", "submitter": "Huy Nguyen", "authors": "Tam Van Nguyen, Wontaek Lim, Huy Nguyen, Deokjai Choi, and Chilwoo Lee", "title": "Context Ontology Implementation for Smart Home", "comments": "Presented at The 2nd International Conference on Ubiquitous\n  Information Technologies & Applications (ICUT'07) Java Island, Indonesia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Context awareness is one of the important fields in ubiquitous computing.\nSmart Home, a specific instance of ubiquitous computing, provides every family\nwith opportunities to enjoy the power of hi-tech home living. Discovering that\nrelationship among user, activity and context data in home environment is\nsemantic, therefore, we apply ontology to model these relationships and then\nreason them as the semantic information. In this paper, we present the\nrealization of smart home's context-aware system based on ontology. We discuss\nthe current challenges in realizing the ontology context base. These challenges\ncan be listed as collecting context information from heterogeneous sources,\nsuch as devices, agents, sensors into ontology, ontology management, ontology\nquerying, and the issue related to environment database explosion.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 01:29:52 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Van Nguyen", "Tam", ""], ["Lim", "Wontaek", ""], ["Nguyen", "Huy", ""], ["Choi", "Deokjai", ""], ["Lee", "Chilwoo", ""]]}, {"id": "1007.1274", "submitter": "Huy Nguyen", "authors": "Tam Van Nguyen, Huy Nguyen, and Deokjai Choi", "title": "Development of a Context Aware Virtual Smart Home Simulator", "comments": "Presented at 3rd International Conference on Ubiquitous Information\n  Technologies & Applications (ICUT'08)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Context awareness is the most important research area in ubiquitous\ncomputing. In particular, for smart home, context awareness attempts to bring\nthe best services to the home habitants. However, the implementation in the\nreal environment is not easy and takes a long time from building the scratch.\nThus, to support the implementation in the real smart home, it is necessary to\ndemonstrate that thing can be done in the simulator in which context\ninformation can be created by virtual sensors instead of physical sensors. In\nthis paper, we propose ISS, an Interactive Smart home Simulator system aiming\nat controlling and simulating the behavior of an intelligent house. The\ndeveloped system aims to provide architects, designers a simulation and useful\ntool for understanding the interaction between environment, people and the\nimpact of embedded and pervasive technology on in daily life. In this research,\nthe smart house is considered as an environment made up of independent and\ndistributed devices interacting to support user's goals and tasks. Therefore,\nby using ISS, the developer can realize the relationship among virtual home\nspace, surrounded environment, use and home appliances.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 01:51:17 GMT"}], "update_date": "2010-07-09", "authors_parsed": [["Van Nguyen", "Tam", ""], ["Nguyen", "Huy", ""], ["Choi", "Deokjai", ""]]}, {"id": "1007.1473", "submitter": "Xinyu Xing", "authors": "Xinyu Xing, Jianxun Dang, Richard Han, Xue Liu, Shivakant Mishra", "title": "Intrusions into Privacy in Video Chat Environments: Attacks and\n  Countermeasures", "comments": "8 pages, submitted to WPES", "journal-ref": null, "doi": null, "report-no": "Technical Report CU-CS 1069-10", "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Video chat systems such as Chatroulette have become increasingly popular as a\nway to meet and converse one-on-one via video and audio with other users online\nin an open and interactive manner. At the same time, security and privacy\nconcerns inherent in such communication have been little explored. This paper\npresents one of the first investigations of the privacy threats found in such\nvideo chat systems, identifying three such threats, namely de-anonymization\nattacks, phishing attacks, and man-in-the-middle attacks. The paper further\ndescribes countermeasures against each of these attacks.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2010 21:38:54 GMT"}], "update_date": "2010-07-12", "authors_parsed": [["Xing", "Xinyu", ""], ["Dang", "Jianxun", ""], ["Han", "Richard", ""], ["Liu", "Xue", ""], ["Mishra", "Shivakant", ""]]}, {"id": "1007.1548", "submitter": "Konstantin Avrachenkov", "authors": "Konstantin Avrachenkov (INRIA Sophia Antipolis), Evsey Morozov", "title": "Stability Analysis of GI/G/c/K Retrial Queue with Constant Retrial Rate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a GI/G/c/K-type retrial queueing system with constant retrial\nrate. The system consists of a primary queue and an orbit queue. The primary\nqueue has $c$ identical servers and can accommodate the maximal number of $K$\njobs. If a newly arriving job finds the full primary queue, it joins the orbit.\nThe original primary jobs arrive to the system according to a renewal process.\nThe jobs have general i.i.d. service times. A job in front of the orbit queue\nretries to enter the primary queue after an exponentially distributed time\nindependent of the orbit queue length. Telephone exchange systems, Medium\nAccess Protocols and short TCP transfers are just some applications of the\nproposed queueing system. For this system we establish minimal sufficient\nstability conditions. Our model is very general. In addition, to the known\nparticular cases (e.g., M/G/1/1 or M/M/c/c systems), the proposed model covers\nas particular cases the deterministic service model and the Erlang model with\nconstant retrial rate. The latter particular cases have not been considered in\nthe past. The obtained stability conditions have clear probabilistic\ninterpretation.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2010 10:04:48 GMT"}], "update_date": "2010-07-26", "authors_parsed": [["Avrachenkov", "Konstantin", "", "INRIA Sophia Antipolis"], ["Morozov", "Evsey", ""]]}, {"id": "1007.1559", "submitter": "Dhruv Srivastava", "authors": "Dhruv Srivastva", "title": "An ICT based solution to make mines safer", "comments": "ICT: Information and communication Technologies,33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concern for the human security inside mines is as old as the mining itself.\nHowever, ICT (Information and communication technologies), which has impacted\nhuman life in so many ways has not been much used for making mines safer. We\npropose a method that has been practically implemented which can enhance mine\nsafety enormously. It is based on integration of wireless sensor network with\nan external network through a gateway.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2010 11:04:02 GMT"}], "update_date": "2010-07-12", "authors_parsed": [["Srivastva", "Dhruv", ""]]}, {"id": "1007.1611", "submitter": "Thomas Kesselheim", "authors": "Thomas Kesselheim", "title": "A Constant-Factor Approximation for Wireless Capacity Maximization with\n  Power Control in the SINR Model", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In modern wireless networks, devices are able to set the power for each\ntransmission carried out. Experimental but also theoretical results indicate\nthat such power control can improve the network capacity significantly. We\nstudy this problem in the physical interference model using SINR constraints.\n  In the SINR capacity maximization problem, we are given n pairs of senders\nand receivers, located in a metric space (usually a so-called fading metric).\nThe algorithm shall select a subset of these pairs and choose a power level for\neach of them with the objective of maximizing the number of simultaneous\ncommunications. This is, the selected pairs have to satisfy the SINR\nconstraints with respect to the chosen powers.\n  We present the first algorithm achieving a constant-factor approximation in\nfading metrics. The best previous results depend on further network parameters\nsuch as the ratio of the maximum and the minimum distance between a sender and\nits receiver. Expressed only in terms of n, they are (trivial) Omega(n)\napproximations.\n  Our algorithm still achieves an O(log n) approximation if we only assume to\nhave a general metric space rather than a fading metric. Furthermore, by using\nstandard techniques the algorithm can also be used in single-hop and multi-hop\nscheduling scenarios. Here, we also get polylog(n) approximations.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2010 15:37:28 GMT"}, {"version": "v2", "created": "Thu, 26 Aug 2010 14:16:14 GMT"}], "update_date": "2010-08-27", "authors_parsed": [["Kesselheim", "Thomas", ""]]}, {"id": "1007.1626", "submitter": "Juan Jose Jaramillo", "authors": "Juan Jose Jaramillo, R. Srikant and Lei Ying", "title": "Scheduling for Optimal Rate Allocation in Ad Hoc Networks With\n  Heterogeneous Delay Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the problem of scheduling in single-hop wireless networks\nwith real-time traffic, where every packet arrival has an associated deadline\nand a minimum fraction of packets must be transmitted before the end of the\ndeadline. Using optimization and stochastic network theory we propose a\nframework to model the quality of service (QoS) requirements under delay\nconstraints. The model allows for fairly general arrival models with\nheterogeneous constraints. The framework results in an optimal scheduling\nalgorithm which fairly allocates data rates to all flows while meeting\nlong-term delay demands. We also prove that under a simplified scenario our\nsolution translates into a greedy strategy that makes optimal decisions with\nlow complexity.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2010 17:12:34 GMT"}], "update_date": "2010-07-12", "authors_parsed": [["Jaramillo", "Juan Jose", ""], ["Srikant", "R.", ""], ["Ying", "Lei", ""]]}, {"id": "1007.1735", "submitter": "Ahmed Badr", "authors": "Ahmed Badr, Ashish Khisti and Emin Martinian", "title": "Diversity Embedded Streaming Erasure Codes (DE-SCo): Constructions and\n  Optimality", "comments": "Globecom 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Streaming erasure codes encode a source stream to guarantee that each source\npacket is recovered within a fixed delay at the receiver over a burst-erasure\nchannel. This paper introduces diversity embedded streaming erasure codes\n(DE-SCo), that provide a flexible tradeoff between the channel quality and\nreceiver delay. When the channel conditions are good, the source stream is\nrecovered with a low delay, whereas when the channel conditions are poor the\nsource stream is still recovered, albeit with a larger delay. Information\ntheoretic analysis of the underlying burst-erasure broadcast channel reveals\nthat DE-SCo achieve the minimum possible delay for the weaker user, without\nsacrificing the performance of the stronger user. A larger class of multicast\nstreaming erasure codes (MU-SCo) that achieve optimal tradeoff between rate,\ndelay and erasure-burst length is also constructed.\n", "versions": [{"version": "v1", "created": "Sat, 10 Jul 2010 18:02:49 GMT"}], "update_date": "2010-07-13", "authors_parsed": [["Badr", "Ahmed", ""], ["Khisti", "Ashish", ""], ["Martinian", "Emin", ""]]}, {"id": "1007.1802", "submitter": "Shlomi Dolev", "authors": "Noga Alon, Hagit Attiya, Shlomi Dolev, Swan Dubois, Maria Gradinariu,\n  Sebastien Tixeuil", "title": "Practically Stabilizing Atomic Memory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A self-stabilizing simulation of a single-writer multi-reader atomic register\nis presented. The simulation works in asynchronous message-passing systems, and\nallows processes to crash, as long as at least a majority of them remain\nworking. A key element in the simulation is a new combinatorial construction of\na bounded labeling scheme that can accommodate arbitrary labels, i.e.,\nincluding those not generated by the scheme itself.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jul 2010 21:00:58 GMT"}, {"version": "v2", "created": "Sat, 31 Jul 2010 15:04:40 GMT"}], "update_date": "2010-08-03", "authors_parsed": [["Alon", "Noga", ""], ["Attiya", "Hagit", ""], ["Dolev", "Shlomi", ""], ["Dubois", "Swan", ""], ["Gradinariu", "Maria", ""], ["Tixeuil", "Sebastien", ""]]}, {"id": "1007.1946", "submitter": "Yossi Kanizo", "authors": "Yossi Kanizo, David Hay, Isaac Keslassy", "title": "Maximum Bipartite Matching Size And Application to Cuckoo Hashing", "comments": "14 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cuckoo hashing with a stash is a robust multiple choice hashing scheme with\nhigh memory utilization that can be used in many network device applications.\nUnfortunately, for memory loads beyond 0.5, little is known on its performance.\n  In this paper, we analyze its average performance over such loads. We tackle\nthis problem by recasting the problem as an analysis of the expected maximum\nmatching size of a given random bipartite graph. We provide exact results for\nany finite system, and also deduce asymptotic results as the memory size\nincreases. We further consider other variants of this problem, and finally\nevaluate the performance of our models on Internet backbone traces. More\ngenerally, our results give a tight lower bound on the size of the stash needed\nfor any multiple-choice hashing scheme.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2010 17:23:57 GMT"}, {"version": "v2", "created": "Tue, 9 Aug 2011 12:14:34 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Kanizo", "Yossi", ""], ["Hay", "David", ""], ["Keslassy", "Isaac", ""]]}, {"id": "1007.2120", "submitter": "Pat Morin", "authors": "Evangelos Kranakis, Danny Krizanc, Pat Morin, Lata Narayanan, and\n  Ladislav Stacho", "title": "A Tight Bound on the Maximum Interference of Random Sensors in the\n  Highway Model", "comments": "8 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider $n$ sensors whose positions are represented by $n$ uniform,\nindependent and identically distributed random variables assuming values in the\nopen unit interval $(0,1)$. A natural way to guarantee connectivity in the\nresulting sensor network is to assign to each sensor as its range, the maximum\nof the two possible distances to its two neighbors. The interference at a given\nsensor is defined as the number of sensors that have this sensor within their\nrange. In this paper we prove that the expected maximum interference of the\nsensors is $\\Theta (\\sqrt{\\ln n})$.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2010 14:49:18 GMT"}], "update_date": "2010-07-14", "authors_parsed": [["Kranakis", "Evangelos", ""], ["Krizanc", "Danny", ""], ["Morin", "Pat", ""], ["Narayanan", "Lata", ""], ["Stacho", "Ladislav", ""]]}, {"id": "1007.2280", "submitter": "Guoqiang Zhang", "authors": "Guoqiang Zhang and Bruno Quoitin and Shi Zhou", "title": "Phase Changes in the Evolution of the IPv4 and IPv6 AS-Level Internet\n  Topologies", "comments": "12 pages, 21 figures; G. Zhang et al.,Phase changes in the evolution\n  of the IPv4 and IPv6 AS-Level Internet topologies, Comput. Commun. (2010)", "journal-ref": null, "doi": "10.1016/j.comcom.2010.06.004", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we investigate the evolution of the IPv4 and IPv6 Internet\ntopologies at the autonomous system (AS) level over a long period of time.We\nprovide abundant empirical evidence that there is a phase transition in the\ngrowth trend of the two networks. For the IPv4 network, the phase change\noccurred in 2001. Before then the network's size grew exponentially, and\nthereafter it followed a linear growth. Changes are also observed around the\nsame time for the maximum node degree, the average node degree and the average\nshortest path length. For the IPv6 network, the phase change occurred in late\n2006. It is notable that the observed phase transitions in the two networks are\ndifferent, for example the size of IPv6 network initially grew linearly and\nthen shifted to an exponential growth. Our results show that following decades\nof rapid expansion up to the beginning of this century, the IPv4 network has\nnow evolved into a mature, steady stage characterised by a relatively slow\ngrowth with a stable network structure; whereas the IPv6 network, after a slow\nstartup process, has just taken off to a full speed growth. We also provide\ninsight into the possible impact of IPv6-over-IPv4 tunneling deployment scheme\non the evolution of the IPv6 network. The Internet topology generators so far\nare based on an inexplicit assumption that the evolution of Internet follows\nnon-changing dynamic mechanisms. This assumption, however, is invalidated by\nour results.Our work reveals insights into the Internet evolution and provides\ninputs to future AS-Level Internet models.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2010 08:56:57 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Zhang", "Guoqiang", ""], ["Quoitin", "Bruno", ""], ["Zhou", "Shi", ""]]}, {"id": "1007.2327", "submitter": "Michal Kryczka", "authors": "Ruben Cuevas, Michal Kryczka, Angel Cuevas, Sebastian Kaune, Carmen\n  Guerrero, Reza Rejaie", "title": "Is Content Publishing in BitTorrent Altruistic or Profit-Driven", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BitTorrent is the most popular P2P content delivery application where\nindividual users share various type of content with tens of thousands of other\nusers. The growing popularity of BitTorrent is primarily due to the\navailability of valuable content without any cost for the consumers. However,\napart from required resources, publishing (sharing) valuable (and often\ncopyrighted) content has serious legal implications for user who publish the\nmaterial (or publishers). This raises a question that whether (at least major)\ncontent publishers behave in an altruistic fashion or have other incentives\nsuch as financial. In this study, we identify the content publishers of more\nthan 55k torrents in 2 major BitTorrent portals and examine their behavior. We\ndemonstrate that a small fraction of publishers are responsible for 66% of\npublished content and 75% of the downloads. Our investigations reveal that\nthese major publishers respond to two different profiles. On one hand,\nantipiracy agencies and malicious publishers publish a large amount of fake\nfiles to protect copyrighted content and spread malware respectively. On the\nother hand, content publishing in BitTorrent is largely driven by companies\nwith financial incentive. Therefore, if these companies lose their interest or\nare unable to publish content, BitTorrent traffic/portals may disappear or at\nleast their associated traffic will significantly reduce.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2010 13:40:22 GMT"}, {"version": "v2", "created": "Thu, 22 Jul 2010 10:56:31 GMT"}], "update_date": "2010-07-23", "authors_parsed": [["Cuevas", "Ruben", ""], ["Kryczka", "Michal", ""], ["Cuevas", "Angel", ""], ["Kaune", "Sebastian", ""], ["Guerrero", "Carmen", ""], ["Rejaie", "Reza", ""]]}, {"id": "1007.2401", "submitter": "Bernat Gaston", "authors": "Bernat Gaston and Jaume Pujol", "title": "Double Circulant Minimum Storage Regenerating Codes", "comments": "This paper has been withdrawn by the authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A newer version will appear soon\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2010 19:39:52 GMT"}, {"version": "v2", "created": "Thu, 15 Jul 2010 18:13:03 GMT"}, {"version": "v3", "created": "Fri, 26 Nov 2010 10:07:13 GMT"}, {"version": "v4", "created": "Mon, 29 Nov 2010 10:34:09 GMT"}], "update_date": "2010-11-30", "authors_parsed": [["Gaston", "Bernat", ""], ["Pujol", "Jaume", ""]]}, {"id": "1007.2814", "submitter": "Pedro Pinto", "authors": "Pedro C. Pinto, Moe Z. Win", "title": "A Unifying Framework for Local Throughput in Wireless Networks", "comments": "Submitted for journal publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the increased competition for the electromagnetic spectrum, it is\nimportant to characterize the impact of interference in the performance of a\nwireless network, which is traditionally measured by its throughput. This paper\npresents a unifying framework for characterizing the local throughput in\nwireless networks. We first analyze the throughput of a probe link from a\nconnectivity perspective, in which a packet is successfully received if it does\nnot collide with other packets from nodes within its reach (called the audible\ninterferers). We then characterize the throughput from a\nsignal-to-interference-plus-noise ratio (SINR) perspective, in which a packet\nis successfully received if the SINR exceeds some threshold, considering the\ninterference from all emitting nodes in the network. Our main contribution is\nto generalize and unify various results scattered throughout the literature. In\nparticular, the proposed framework encompasses arbitrary wireless propagation\neffects (e.g, Nakagami-m fading, Rician fading, or log-normal shadowing), as\nwell as arbitrary traffic patterns (e.g., slotted-synchronous,\nslotted-asynchronous, or exponential-interarrivals traffic), allowing us to\ndraw more general conclusions about network performance than previously\navailable in the literature.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jul 2010 17:04:15 GMT"}], "update_date": "2010-07-19", "authors_parsed": [["Pinto", "Pedro C.", ""], ["Win", "Moe Z.", ""]]}, {"id": "1007.2980", "submitter": "Satish N. Srirama", "authors": "Satish Narayana Srirama", "title": "Publishing and Discovery of Mobile Web Services in Peer to Peer Networks", "comments": "First International Workshop on Mobile Services and Personalized\n  Environments (MSPE'06), November 16-17, 2006, pp. 15-28. Lecture Notes in\n  Informatics, GI", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is now feasible to host Web Services on a mobile device due to the\nadvances in cellular devices and mobile communication technologies. However,\nthe reliability, usability and responsiveness of the Mobile Hosts depend on\nvarious factors including the characteristics of available network,\ncomputational resources, and better means of searching the services provided by\nthem. P2P enhances the adoption of Mobile Host in commercial environments.\nMobile Hosts in P2P can collaboratively share the resources of individual\npeers. P2P also enhances the service discovery of huge number of Web Services\npossible with Mobile Hosts. Advanced features like post filtering with weight\nof keywords and context-awareness can also be exploited to select the best\npossible mobile Web Service. This paper proposes the concept of Mobile Hosts in\nP2P networks and identifies the means of publishing and discovery of Web\nServices in mobile P2P networks.\n", "versions": [{"version": "v1", "created": "Sun, 18 Jul 2010 09:07:30 GMT"}], "update_date": "2010-07-20", "authors_parsed": [["Srirama", "Satish Narayana", ""]]}, {"id": "1007.2981", "submitter": "Satish N. Srirama", "authors": "Satish Narayana Srirama, Matthias Jarke, Wolfgang Prinz", "title": "A Mediation Framework for Mobile Web Service Provisioning", "comments": "Proceedings of 2006 Middleware for Web Services (MWS 2006) Workshop @\n  10th International IEEE EDOC Conference \"The Enterprise Computing\n  Conference\", October 16, 2006, pp. 14-17. IEEE Computer Society", "journal-ref": null, "doi": "10.1109/EDOCW.2006.9", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web Services and mobile data services are the newest trends in information\nsystems engineering in wired and wireless domains, respectively. Web Services\nhave a broad range of service distributions while mobile phones have large and\nexpanding user base. To address the confluence of Web Services and pervasive\nmobile devices and communication environments, a basic mobile Web Service\nprovider was developed for smart phones. The performance of this Mobile Host\nwas also analyzed in detail. Further analysis of the Mobile Host to provide\nproper QoS and to check Mobile Host's feasibility in the P2P networks,\nidentified the necessity of a mediation framework. The paper describes the\nresearch conducted with the Mobile Host, identifies the tasks of the mediation\nframework and then discusses the feasible realization details of such a mobile\nWeb Services mediation framework.\n", "versions": [{"version": "v1", "created": "Sun, 18 Jul 2010 09:22:31 GMT"}], "update_date": "2010-07-20", "authors_parsed": [["Srirama", "Satish Narayana", ""], ["Jarke", "Matthias", ""], ["Prinz", "Wolfgang", ""]]}, {"id": "1007.3058", "submitter": "Ghassan Samara", "authors": "Ghassan Samara, Sureswaran Ramadas, Wafaa A.H. Al-Salihy", "title": "Safety Message Power Transmission Control for Vehicular Ad hoc Networks", "comments": null, "journal-ref": "Journal of Computer Science 6 (10): 1027-1032, 2010 ISSN\n  1549-3636, 2010 Science Publications", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular Ad hoc Networks (VANET) is one of the most challenging research\narea in the field of Mobile Ad Hoc Networks. In this research we proposed a\ndynamic power adjustment protocol that will be used for sending the periodical\nsafety message. (Beacon)based on the analysis of the channel status depending\non the channel congestion and the power used for transmission. The Beacon Power\nControl (BPC) protocol first sensed and examined the percentage of the channel\ncongestion, the result obtained was used to adjust the transmission power for\nthe safety message to reach the optimal power. This will lead to decrease the\ncongestion in the channel and achieve good channel performance and beacon\ndissemination.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2010 03:05:36 GMT"}], "update_date": "2010-07-20", "authors_parsed": [["Samara", "Ghassan", ""], ["Ramadas", "Sureswaran", ""], ["Al-Salihy", "Wafaa A. H.", ""]]}, {"id": "1007.3229", "submitter": "Pradeepa  BK", "authors": "Pradeepa BK and Joy Kuri", "title": "Aggregate Download Throughput for TCP-controlled long file transfers in\n  a WLAN with multiple STA-AP association rates", "comments": "Double columns, 3 pages, 3 figures, typos updated", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider several WLAN stations associated at rates r1, r2, ..., rk with an\nAccess Point. Each station is downloading a long file from a local server,\nlocated on the LAN to which the AP is attached. We model these simultaneous\nTCP-controlled transfers using a Markov Chain. Our analytical approach leads to\na procedure to compute aggregate download throughput numerically, and the\nresults match simulations very well.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2010 18:13:56 GMT"}, {"version": "v2", "created": "Mon, 21 Feb 2011 03:32:08 GMT"}], "update_date": "2011-02-22", "authors_parsed": [["BK", "Pradeepa", ""], ["Kuri", "Joy", ""]]}, {"id": "1007.3336", "submitter": "Pegah Sattari", "authors": "Pegah Sattari, Christina Fragouli, Athina Markopoulou", "title": "Active Topology Inference using Network Coding", "comments": null, "journal-ref": null, "doi": "10.1016/j.phycom.2012.02.006", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our goal is to infer the topology of a network when (i) we can send probes\nbetween sources and receivers at the edge of the network and (ii) intermediate\nnodes can perform simple network coding operations, i.e., additions. Our key\nintuition is that network coding introduces topology-dependent correlation in\nthe observations at the receivers, which can be exploited to infer the\ntopology. For undirected tree topologies, we design hierarchical clustering\nalgorithms, building on our prior work. For directed acyclic graphs (DAGs),\nfirst we decompose the topology into a number of two-source, two-receiver\n(2-by-2) subnetwork components and then we merge these components to\nreconstruct the topology. Our approach for DAGs builds on prior work on\ntomography, and improves upon it by employing network coding to accurately\ndistinguish among all different 2-by-2 components. We evaluate our algorithms\nthrough simulation of a number of realistic topologies and compare them to\nactive tomographic techniques without network coding. We also make connections\nbetween our approach and alternatives, including passive inference, traceroute,\nand packet marking.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2010 05:00:00 GMT"}, {"version": "v2", "created": "Wed, 6 Feb 2013 07:50:16 GMT"}], "update_date": "2013-02-07", "authors_parsed": [["Sattari", "Pegah", ""], ["Fragouli", "Christina", ""], ["Markopoulou", "Athina", ""]]}, {"id": "1007.3341", "submitter": "Timur Sultanov", "authors": "T.G. Sultanov, A.M. Sukhov", "title": "Simulation technique for available bandwidth estimation", "comments": null, "journal-ref": null, "doi": "10.1109/EMS.2010.88", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper proposes a method for measuring available bandwidth, based on\ntesting network packets of various sizes (Variable Packet Size method, VPS).\nThe boundaries of applicability of the model have been found, which are based\non the accuracy of measurements of packet delays, also we have derived a\nformula of measuring the upper limit of bandwidth. The computer simulation has\nbeen performed and relationship between the measurement error of available\nbandwidth and the number of measurements has been found. Experimental\nverification with the use of RIPE Test Box measuring system has shown that the\nsuggested method has advantages over existing measurement techniques. Pathload\nutility has been chosen as an alternative technique of measurement, and to\nensure reliable results statistics by SNMP agent has been withdrawn directly\nfrom the router.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2010 05:27:58 GMT"}], "update_date": "2011-02-18", "authors_parsed": [["Sultanov", "T. G.", ""], ["Sukhov", "A. M.", ""]]}, {"id": "1007.3631", "submitter": "Satish N. Srirama", "authors": "Satish Narayana Srirama and Matthias Jarke and Wolfgang Prinz", "title": "Mobile Web Service Discovery in Peer to Peer Networks", "comments": "5th International Workshop on Ubiquitous Mobile Information and\n  Collaboration Systems (UMICS 2007) @ 19th International Conference on\n  Advanced Information Systems Engineering (CAiSE'07), June 11-12, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The advanced features of today's smart phones and hand held devices, like the\nincreased memory and processing capabilities, allowed them to act even as\ninformation providers. Thus a smart phone hosting web services is not a fancy\nanymore. But the relevant discovery of these services provided by the smart\nphones has became quite complex, because of the volume of services possible\nwith each Mobile Host providing some services. Centralized registries have\nsevere drawbacks in such a scenario and alternate means of service discovery\nare to be addressed. P2P domain with it resource sharing capabilities comes\nquite handy and here in this paper we provide an alternate approach to UDDI\nregistry for discovering mobile web services. The services are published into\nthe P2P network as JXTA modules and the discovery issues of these module\nadvertisements are addressed. The approach also provides alternate means of\nidentifying the Mobile Host.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2010 12:32:43 GMT"}], "update_date": "2010-07-22", "authors_parsed": [["Srirama", "Satish Narayana", ""], ["Jarke", "Matthias", ""], ["Prinz", "Wolfgang", ""]]}, {"id": "1007.3640", "submitter": "Satish N. Srirama", "authors": "Satish Narayana Srirama and Matthias Jarke and Wolfgang Prinz and\n  Kiran Pendyala", "title": "Security Aware Mobile Web Service Provisioning", "comments": "Proceedings of International Conference for Internet Technology and\n  Secured Transactions (ICITST-2006), September 11-13, 2006, pp. 48-56.\n  Published by e.Centre for Infonomics, ISBN 0-9546628-2-2", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile data services in combination with profluent web services are seemingly\nthe path breaking domain in current information research. Effectively, these\nmobile web services will pave the way for exciting performance and security\nchallenges, the core need-to-be-addressed issues. On security front, though a\nlot of standardized security specifications and implementations exist for web\nservices in the wired networks, not much has been analysed and standardized in\nthe wireless environments. This paper addresses some of the critical challenges\nin providing security to the mobile web service domain. We first explore mobile\nweb services and their key security issues, with special focus on provisioning\nbased on a mobile web service provider realized by us. Later we discuss\nstate-of-the-art security awareness in the wired and wireless web services, and\nfinally address the realization of security for the mobile web service\nprovisioning with performance analysis results.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2010 12:56:58 GMT"}], "update_date": "2010-07-22", "authors_parsed": [["Srirama", "Satish Narayana", ""], ["Jarke", "Matthias", ""], ["Prinz", "Wolfgang", ""], ["Pendyala", "Kiran", ""]]}, {"id": "1007.3644", "submitter": "Satish N. Srirama", "authors": "Satish Narayana Srirama and Matthias Jarke and Wolfgang Prinz", "title": "A Performance Evaluation of Mobile Web Services Security", "comments": "3rd International Conference on Web Information Systems and\n  Technologies (WEBIST 2007), March 3-6, 2007, pp. 386-392. INSTICC Press", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is now feasible to host basic web services on a smart phone due to the\nadvances in wireless devices and mobile communication technologies. The market\ncapture of mobile web services also has increased significantly, in the past\nyears. While the applications are quite welcoming, the ability to provide\nsecure and reliable communication in the vulnerable and volatile mobile ad-hoc\ntopologies is vastly becoming necessary. Even though a lot of standardized\nsecurity specifications like WS-Security, SAML exist for web services in the\nwired networks, not much has been analyzed and standardized in the wireless\nenvironments. In this paper we give our analysis of adapting some of the\nsecurity standards, especially WS-Security to the cellular domain, with\nperformance statistics. The performance latencies are obtained and analyzed\nwhile observing the performance and quality of service of our Mobile Host.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2010 13:14:15 GMT"}], "update_date": "2010-07-22", "authors_parsed": [["Srirama", "Satish Narayana", ""], ["Jarke", "Matthias", ""], ["Prinz", "Wolfgang", ""]]}, {"id": "1007.3649", "submitter": "Satish N. Srirama", "authors": "Satish Narayana Srirama and Anton Naumenko", "title": "Secure Communication and Access Control for Mobile Web Service\n  Provisioning", "comments": "Proceedings of the First International Conference on Security of\n  Information and Networks (SIN 2007), May 8-10, 2007. Trafford Publishing,\n  Canada", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is now feasible to host basic web services on a smart phone due to the\nadvances in wireless devices and mobile communication technologies. While the\napplications are quite welcoming, the ability to provide secure and reliable\ncommunication in the vulnerable and volatile mobile ad-hoc topologies is vastly\nbecoming necessary. The paper mainly addresses the details and issues in\nproviding secured communication and access control for the mobile web service\nprovisioning domain. While the basic message-level security can be provided,\nproviding proper access control mechanisms for the Mobile Host still poses a\ngreat challenge. This paper discusses details of secure communication and\nproposes the distributed semantics-based authorization mechanism.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2010 13:20:33 GMT"}], "update_date": "2010-07-22", "authors_parsed": [["Srirama", "Satish Narayana", ""], ["Naumenko", "Anton", ""]]}, {"id": "1007.4002", "submitter": "Pedro Pinto", "authors": "Pedro C. Pinto, Moe Z. Win", "title": "Continuum Percolation in the Intrinsically Secure Communications Graph", "comments": "Accepted in the IEEE International Symposium on Information Theory\n  and its Applications (ISITA'10), Taichung, Taiwan, Oct. 2010", "journal-ref": null, "doi": "10.1109/ISITA.2010.5649155", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The intrinsically secure communications graph (iS-graph) is a random graph\nwhich captures the connections that can be securely established over a\nlarge-scale network, in the presence of eavesdroppers. It is based on\nprinciples of information-theoretic security, widely accepted as the strictest\nnotion of security. In this paper, we are interested in characterizing the\nglobal properties of the iS-graph in terms of percolation on the infinite\nplane. We prove the existence of a phase transition in the Poisson iS-graph,\nwhereby an unbounded component of securely connected nodes suddenly arises as\nwe increase the density of legitimate nodes. Our work shows that long-range\ncommunication in a wireless network is still possible when a secrecy constraint\nis present.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2010 20:26:12 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Pinto", "Pedro C.", ""], ["Win", "Moe Z.", ""]]}, {"id": "1007.4053", "submitter": "Harry  Enke", "authors": "Harry Enke (AIP), Matthias Steinmetz (AIP), Hans-Martin Adorf (MPA),\n  Alexander Beck-Ratzka (AEI), Frank Breitling (AIP), Thomas Bruesemeister\n  (ZAH), Arthur Carlson (MPE), Torsten Ensslin (MPA), Mikael Hoegqvist (ZIB),\n  Iliya Nickelt (AIP), Thomas Radke (AEI), Alexander Reinefeld (ZIB), Angelika\n  Reiser (TUM), Tobias Scholl (TUM), Rainer Spurzem (ZAH, NAOC), Juergen\n  Steinacker (ZAH), Wolfgang Voges (MPE), Joachim Wambsganss (ZAH), Steve White\n  (AIP)", "title": "AstroGrid-D: Grid Technology for Astronomical Science", "comments": "14 pages, 12 figures Subjects: data analysis, image processing,\n  robotic telescopes, simulations, grid. Accepted for publication in New\n  Astronomy", "journal-ref": "New Astron.16:79-93,2011", "doi": "10.1016/j.newast.2010.07.005", "report-no": null, "categories": "cs.DC astro-ph.IM cs.DB cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present status and results of AstroGrid-D, a joint effort of\nastrophysicists and computer scientists to employ grid technology for\nscientific applications. AstroGrid-D provides access to a network of\ndistributed machines with a set of commands as well as software interfaces. It\nallows simple use of computer and storage facilities and to schedule or monitor\ncompute tasks and data management. It is based on the Globus Toolkit middleware\n(GT4). Chapter 1 describes the context which led to the demand for advanced\nsoftware solutions in Astrophysics, and we state the goals of the project. We\nthen present characteristic astrophysical applications that have been\nimplemented on AstroGrid-D in chapter 2. We describe simulations of different\ncomplexity, compute-intensive calculations running on multiple sites, and\nadvanced applications for specific scientific purposes, such as a connection to\nrobotic telescopes. We can show from these examples how grid execution improves\ne.g. the scientific workflow. Chapter 3 explains the software tools and\nservices that we adapted or newly developed. Section 3.1 is focused on the\nadministrative aspects of the infrastructure, to manage users and monitor\nactivity. Section 3.2 characterises the central components of our architecture:\nThe AstroGrid-D information service to collect and store metadata, a file\nmanagement system, the data management system, and a job manager for automatic\nsubmission of compute tasks. We summarise the successfully established\ninfrastructure in chapter 4, concluding with our future plans to establish\nAstroGrid-D as a platform of modern e-Astronomy.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2010 06:50:52 GMT"}], "update_date": "2014-11-21", "authors_parsed": [["Enke", "Harry", "", "AIP"], ["Steinmetz", "Matthias", "", "AIP"], ["Adorf", "Hans-Martin", "", "MPA"], ["Beck-Ratzka", "Alexander", "", "AEI"], ["Breitling", "Frank", "", "AIP"], ["Bruesemeister", "Thomas", "", "ZAH"], ["Carlson", "Arthur", "", "MPE"], ["Ensslin", "Torsten", "", "MPA"], ["Hoegqvist", "Mikael", "", "ZIB"], ["Nickelt", "Iliya", "", "AIP"], ["Radke", "Thomas", "", "AEI"], ["Reinefeld", "Alexander", "", "ZIB"], ["Reiser", "Angelika", "", "TUM"], ["Scholl", "Tobias", "", "TUM"], ["Spurzem", "Rainer", "", "ZAH, NAOC"], ["Steinacker", "Juergen", "", "ZAH"], ["Voges", "Wolfgang", "", "MPE"], ["Wambsganss", "Joachim", "", "ZAH"], ["White", "Steve", "", "AIP"]]}, {"id": "1007.4065", "submitter": "Mubashir Husain Rehmani", "authors": "Mubashir Husain Rehmani, Sidney Doria, and Mustapha Reda Senouci", "title": "A Tutorial on the Implementation of Ad-hoc On Demand Distance Vector\n  (AODV) Protocol in Network Simulator (NS-2)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Network Simulator (NS-2) is a most widely used network simulator. It has\nthe capabilities to simulate a range of networks including wired and wireless\nnetworks. In this tutorial, we present the implementation of Ad Hoc On-Demand\nDistance Vector (AODV) Protocol in NS-2. This tutorial is targeted to the\nnovice user who wants to understand the implementation of AODV Protocol in\nNS-2.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2010 08:16:58 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2010 13:08:17 GMT"}], "update_date": "2010-07-27", "authors_parsed": [["Rehmani", "Mubashir Husain", ""], ["Doria", "Sidney", ""], ["Senouci", "Mustapha Reda", ""]]}, {"id": "1007.4066", "submitter": "Mubashir Husain Rehmani", "authors": "Zeeshan Ali Khan and Mubashir Husain Rehmani", "title": "A Tutorial on Broadcasting Packets over Multiple-Channels in a\n  Multi-Inferface Network Setting in NS-2", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the proliferation of cheaper electronic devices, wireless communication\nover multiple-channels in a multi-interface network is now possible. For\ninstace, wireless sensor nodes can now operate over multiplechannels. Moreover,\ncognitive radio sensor networks are also evolving, which also operates over\nmultiple-channels. In the market, we can find antennas that can support the\noperation of multiple channels, for e.g. the cc2420 antenna that is used for\ncommunication between wireless sensor nodes consists of 16 programmable\nchannels. The proper utilization of multiple-channels reduces the interference\nbetween the nodes and increase the network throughput. Recently, a Cognitive\nRadio Cognitive Network (CRCN) patch for NS-2 simulator has proposed to support\nmulti-channel multi-interface capability in NS-2. In this tutorial, we consider\nhow to simulate a multi-channel multiinterface wireless network using the NS-2\nsimulator. This tutorial is trageted to the novice users who wants to\nunderstand the implementation of multi-channel multi-interface in NS-2. We take\nthe Cognitive Radio Cognitive Network (CRCN) patch for NS-2 simulator and\ndemonstrate broadcasting over multiple-channels in a multi-interface network\nsetting. In our seeting, node braodcasts the Hello packets to its neighbors.\nNeighboring nodes receive the Hello packets if and only if they are tuned to\nthe same channel. We demonstrate through example that the tuning of receivers\ncan be done in two fashions.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2010 08:20:25 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2010 13:02:50 GMT"}], "update_date": "2010-07-27", "authors_parsed": [["Khan", "Zeeshan Ali", ""], ["Rehmani", "Mubashir Husain", ""]]}, {"id": "1007.4068", "submitter": "Mubashir Husain Rehmani", "authors": "Mubashir Husain Rehmani and Aline Carneiro Viana (Supervisor)", "title": "Decoupling data dissemination from the mobile sink's trajectory in\n  wireless sensor networks: Current Research and Open Issues", "comments": null, "journal-ref": null, "doi": null, "report-no": "Masters Thesis, Laboratory of Signals and Systems, Supelec and\n  University of Paris Sud-11, July 2008", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this report, firstly, we presents state of the art survey on Data\nManagement and Data Dissemination techniques with Mobile Sink. Moreover we\nclassify these techniques into two ample sub-categories. Under this\nclassification, we identify, review, compare, and highlight these techniques\nand their pros and cons. We do a SWOT (Strength, Weaknesses, Opportunities,\nThreats) analysis of each scheme. We also discuss where each scheme is\nappropriate.\n  Secondly, we presents a new distributed data management scheme which is based\nupon Random Walk Based Membership Service to facilitate Data Dissemination in\nMobile Sink based Wireless Sensor Networks. Our proposed scheme efficiently\ndeals with the aforementioned problems and we also compare the characteristics\nof our proposed scheme with the state-of-the-art data-dissemination schemes. We\npropose using Random Walks (RWs) with uniformly distributed views to\ndisseminate data through the WSN with a controlled overhead. This is performed\nby the use of a Random Walk Based Membership Service - the RaWMS. Our proposal\nsolves then the problems generated when (a) all nodes are storage motes, being\nno aggregation performed (b) one center node plays the role of storage mote and\naggregates data from all the other nodes (c) replication is performed on all\nnodes in the network.\n  To the best of our knowledge, we are the first to propose an efficient data\ndissemination approach (in terms of overhead, adaptiveness and\nrepresentativeness) to allow a mobile sink to gather a representative view of\nthe monitored region covered by n sensor nodes by only visiting any m nodes,\nwhere hopefully m << n.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2010 08:36:43 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2010 15:32:23 GMT"}], "update_date": "2010-07-27", "authors_parsed": [["Rehmani", "Mubashir Husain", "", "Supervisor"], ["Viana", "Aline Carneiro", "", "Supervisor"]]}, {"id": "1007.4109", "submitter": "Dhruv Srivastava", "authors": "Dhruv Srivastava", "title": "An Application-oriented Model for Wireless Sensor Networks integrated\n  with Telecom Infra", "comments": "This paper has been withdrawn by the author. 8pages, 9figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper aims to propose a significant way of remote access and real time\nmonitoring of a particular geographic area by integrating wireless sensor\nclouds with existing Telecom infrastructure and applications built around them\nthrough a gateway. This utility is very potent for environment monitoring in\nharsh and inaccessible places like mines, nuclear reactors, etc. We demonstrate\na scaled down version of multi-hop network of wireless sensor nodes and its\nintegration with existing telecom network infrastructure via a gateway.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2010 12:03:55 GMT"}, {"version": "v2", "created": "Sat, 4 Sep 2010 08:28:59 GMT"}, {"version": "v3", "created": "Wed, 8 Sep 2010 13:22:03 GMT"}], "update_date": "2010-09-09", "authors_parsed": [["Srivastava", "Dhruv", ""]]}, {"id": "1007.4286", "submitter": "Krishna Jagannathan", "authors": "Krishna Jagannathan, Mihalis Markakis, Eytan Modiano, John N.\n  Tsitsiklis", "title": "Queue Length Asymptotics for Generalized Max-Weight Scheduling in the\n  presence of Heavy-Tailed Traffic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the asymptotic behavior of the steady-state queue length\ndistribution under generalized max-weight scheduling in the presence of\nheavy-tailed traffic. We consider a system consisting of two parallel queues,\nserved by a single server. One of the queues receives heavy-tailed traffic, and\nthe other receives light-tailed traffic. We study the class of throughput\noptimal max-weight-alpha scheduling policies, and derive an exact asymptotic\ncharacterization of the steady-state queue length distributions. In particular,\nwe show that the tail of the light queue distribution is heavier than a\npower-law curve, whose tail coefficient we obtain explicitly. Our asymptotic\ncharacterization also contains an intuitively surprising result - the\ncelebrated max-weight scheduling policy leads to the worst possible tail of the\nlight queue distribution, among all non-idling policies. Motivated by the above\nnegative result regarding the max-weight-alpha policy, we analyze a\nlog-max-weight (LMW) scheduling policy. We show that the LMW policy guarantees\nan exponentially decaying light queue tail, while still being throughput\noptimal.\n", "versions": [{"version": "v1", "created": "Sat, 24 Jul 2010 22:20:54 GMT"}], "update_date": "2010-07-27", "authors_parsed": [["Jagannathan", "Krishna", ""], ["Markakis", "Mihalis", ""], ["Modiano", "Eytan", ""], ["Tsitsiklis", "John N.", ""]]}, {"id": "1007.4301", "submitter": "Rafit Izhak Ratzin", "authors": "Rafit Izhak-Ratzin and Hyunggon Park and Mihaela van der Schaar", "title": "Reinforcement Learning in BitTorrent Systems", "comments": "12 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent research efforts have shown that the popular BitTorrent protocol does\nnot provide fair resource reciprocation and may allow free-riding. In this\npaper, we propose a BitTorrent-like protocol that replaces the peer selection\nmechanisms in the regular BitTorrent protocol with a novel reinforcement\nlearning (RL) based mechanism. Due to the inherent opration of P2P systems,\nwhich involves repeated interactions among peers over a long period of time,\nthe peers can efficiently identify free-riders as well as desirable\ncollaborators by learning the behavior of their associated peers. Thus, it can\nhelp peers improve their download rates and discourage free-riding, while\nimproving fairness in the system. We model the peers' interactions in the\nBitTorrent-like network as a repeated interaction game, where we explicitly\nconsider the strategic behavior of the peers. A peer, which applies the\nRL-based mechanism, uses a partial history of the observations on associated\npeers' statistical reciprocal behaviors to determine its best responses and\nestimate the corresponding impact on its expected utility. The policy\ndetermines the peer's resource reciprocations with other peers, which would\nmaximize the peer's long-term performance, thereby making foresighted\ndecisions. We have implemented the proposed reinforcement-learning based\nmechanism and incorporated it into an existing BitTorrent client. We have\nperformed extensive experiments on a controlled Planetlab test bed. Our results\nconfirm that our proposed protocol (1) promotes fairness in terms of incentives\nto each peer's contribution e.g. high capacity peers improve their download\ncompletion time by up to 33\\%, (2) improves the system stability and robustness\ne.g. reducing the peer selection luctuations by 57\\%, and (3) discourages\nfree-riding e.g. peers reduce by 64\\% their upload to \\FR, in comparison to the\nregular \\BT~protocol.\n", "versions": [{"version": "v1", "created": "Sun, 25 Jul 2010 06:43:38 GMT"}], "update_date": "2010-07-27", "authors_parsed": [["Izhak-Ratzin", "Rafit", ""], ["Park", "Hyunggon", ""], ["van der Schaar", "Mihaela", ""]]}, {"id": "1007.4389", "submitter": "Stefan Schmid", "authors": "Andrea Richa, Christian Scheideler, Stefan Schmid, Jin Zhang", "title": "AntiJam: Efficient Medium Access despite Adaptive and Reactive Jamming", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intentional interference constitutes a major threat for communication\nnetworks operating over a shared medium where availability is imperative.\nJamming attacks are often simple and cheap to implement. In particular, today's\njammers can perform physical carrier sensing in order to disrupt communication\nmore efficiently, specially in a network of simple wireless devices such as\nsensor nodes, which usually operate over a single frequency (or a limited\nfrequency band) and which cannot benefit from the use of spread spectrum or\nother more advanced technologies. This article proposes the medium access (MAC)\nprotocol \\textsc{AntiJam} that is provably robust against a powerful reactive\nadversary who can jam a $(1-\\epsilon)$-portion of the time steps, where\n$\\epsilon$ is an arbitrary constant. The adversary uses carrier sensing to make\ninformed decisions on when it is most harmful to disrupt communications;\nmoreover, we allow the adversary to be adaptive and to have complete knowledge\nof the entire protocol history. Our MAC protocol is able to make efficient use\nof the non-jammed time periods and achieves an asymptotically optimal,\n$\\Theta{(1)}$-competitive throughput in this harsh scenario. In addition,\n\\textsc{AntiJam} features a low convergence time and has good fairness\nproperties. Our simulation results validate our theoretical results and also\nshow that our algorithm manages to guarantee constant throughput where the\n802.11 MAC protocol basically fails to deliver any packets.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2010 08:07:38 GMT"}, {"version": "v2", "created": "Fri, 30 Jul 2010 06:12:49 GMT"}, {"version": "v3", "created": "Wed, 9 Feb 2011 17:37:52 GMT"}, {"version": "v4", "created": "Thu, 3 Mar 2011 08:05:04 GMT"}], "update_date": "2011-03-04", "authors_parsed": [["Richa", "Andrea", ""], ["Scheideler", "Christian", ""], ["Schmid", "Stefan", ""], ["Zhang", "Jin", ""]]}, {"id": "1007.4724", "submitter": "Apoorva Jindal", "authors": "Apoorva Jindal and Konstantinos Psounis and Mingyan Liu", "title": "CapEst: A Measurement-based Approach to Estimating Link Capacity in\n  Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Estimating link capacity in a wireless network is a complex task because the\navailable capacity at a link is a function of not only the current arrival rate\nat that link, but also of the arrival rate at links which interfere with that\nlink as well as of the nature of interference between these links. Models which\naccurately characterize this dependence are either too computationally complex\nto be useful or lack accuracy. Further, they have a high implementation\noverhead and make restrictive assumptions, which makes them inapplicable to\nreal networks.\n  In this paper, we propose CapEst, a general, simple yet accurate,\nmeasurement-based approach to estimating link capacity in a wireless network.\nTo be computationally light, CapEst allows inaccuracy in estimation; however,\nusing measurements, it can correct this inaccuracy in an iterative fashion and\nconverge to the correct estimate. Our evaluation shows that CapEst always\nconverged to within 5% of the correct value in less than 18 iterations. CapEst\nis model-independent, hence, is applicable to any MAC/PHY layer and works with\nauto-rate adaptation. Moreover, it has a low implementation overhead, can be\nused with any application which requires an estimate of residual capacity on a\nwireless link and can be implemented completely at the network layer without\nany support from the underlying chipset.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jul 2010 14:01:08 GMT"}], "update_date": "2010-07-28", "authors_parsed": [["Jindal", "Apoorva", ""], ["Psounis", "Konstantinos", ""], ["Liu", "Mingyan", ""]]}, {"id": "1007.4840", "submitter": "Qiao Li", "authors": "Qiao Li, Rohit Negi", "title": "Greedy Maximal Scheduling in Wireless Networks", "comments": "6 pages, 3 figures. A shorter version will appear in IEEE Globecom\n  2010", "journal-ref": null, "doi": "10.1109/GLOCOM.2010.5683487", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider greedy scheduling algorithms in wireless networks,\ni.e., the schedules are computed by adding links greedily based on some\npriority vector. Two special cases are considered: 1) Longest Queue First (LQF)\nscheduling, where the priorities are computed using queue lengths, and 2)\nStatic Priority (SP) scheduling, where the priorities are pre-assigned. We\nfirst propose a closed-form lower bound stability region for LQF scheduling,\nand discuss the tightness result in some scenarios. We then propose an lower\nbound stability region for SP scheduling with multiple priority vectors, as\nwell as a heuristic priority assignment algorithm, which is related to the\nwell-known Expectation-Maximization (EM) algorithm. The performance gain of the\nproposed heuristic algorithm is finally confirmed by simulations.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jul 2010 22:57:43 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Li", "Qiao", ""], ["Negi", "Rohit", ""]]}, {"id": "1007.4853", "submitter": "Nadir Farhi", "authors": "Nadir Farhi and Bruno Gaujal", "title": "Performance bounds in wormhole routing, a network calculus approach", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a model of performance bound calculus on feedforward networks\nwhere data packets are routed under wormhole routing discipline. We are\ninterested in determining maximum end-to-end delays and backlogs of messages or\npackets going from a source node to a destination node, through a given virtual\npath in the network. Our objective here is to give a network calculus approach\nfor calculating the performance bounds. First we propose a new concept of\ncurves that we call packet curves. The curves permit to model constraints on\npacket lengths of a given data flow, when the lengths are allowed to be\ndifferent. Second, we use this new concept to propose an approach for\ncalculating residual services for data flows served under non preemptive\nservice disciplines. Third, we model a binary switch (with two input ports and\ntwo output ports), where data is served under wormhole discipline. We present\nour approach for computing the residual services and deduce the worst case\nbounds for flows passing through a wormhole binary switch. Finally, we\nillustrate this approach in numerical examples, and show how to extend it to\nfeedforward networks.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jul 2010 23:47:58 GMT"}, {"version": "v2", "created": "Tue, 3 Aug 2010 14:10:38 GMT"}], "update_date": "2010-08-04", "authors_parsed": [["Farhi", "Nadir", ""], ["Gaujal", "Bruno", ""]]}, {"id": "1007.5032", "submitter": "Thomas Kesselheim", "authors": "Martin Hoefer, Thomas Kesselheim, Berthold V\\\"ocking", "title": "Approximation Algorithms for Secondary Spectrum Auctions", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study combinatorial auctions for the secondary spectrum market. In this\nmarket, short-term licenses shall be given to wireless nodes for communication\nin their local neighborhood. In contrast to the primary market, channels can be\nassigned to multiple bidders, provided that the corresponding devices are well\nseparated such that the interference is sufficiently low. Interference\nconflicts are described in terms of a conflict graph in which the nodes\nrepresent the bidders and the edges represent conflicts such that the feasible\nallocations for a channel correspond to the independent sets in the conflict\ngraph.\n  In this paper, we suggest a novel LP formulation for combinatorial auctions\nwith conflict graph using a non-standard graph parameter, the so-called\ninductive independence number. Taking into account this parameter enables us to\nbypass the well-known lower bound of \\Omega(n^{1-\\epsilon}) on the\napproximability of independent set in general graphs with n nodes (bidders). We\nachieve significantly better approximation results by showing that interference\nconstraints for wireless networks yield conflict graphs with bounded inductive\nindependence number.\n  Our framework covers various established models of wireless communication,\ne.g., the protocol or the physical model. For the protocol model, we achieve an\nO(\\sqrt{k})-approximation, where k is the number of available channels. For the\nmore realistic physical model, we achieve an O(\\sqrt{k} \\log^2 n) approximation\nbased on edge-weighted conflict graphs. Combining our approach with the the\nLP-based framework of Lavi and Swamy, we obtain incentive compatible mechanisms\nfor general bidders with arbitrary valuations on bundles of channels specified\nin terms of demand oracles.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jul 2010 16:59:53 GMT"}, {"version": "v2", "created": "Thu, 29 Jul 2010 10:51:16 GMT"}, {"version": "v3", "created": "Thu, 28 Apr 2011 14:16:40 GMT"}], "update_date": "2011-04-29", "authors_parsed": [["Hoefer", "Martin", ""], ["Kesselheim", "Thomas", ""], ["Vöcking", "Berthold", ""]]}, {"id": "1007.5080", "submitter": "Przemyslaw Pawelczak", "authors": "Jihoon Park, Przemys{\\l}aw Pawe{\\l}czak, P\\r{a}l Gr{\\o}nsund, Danijela\n  \\v{C}abri\\'c", "title": "Analysis Framework for Opportunistic Spectrum OFDMA and its Application\n  to the IEEE 802.22 Standard", "comments": null, "journal-ref": "IEEE Transactions on Vehicular Technology, vol. 61, no. 5, pp.\n  2271-2293, 2012", "doi": "10.1109/TVT.2012.2188550", "report-no": null, "categories": "cs.NI cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an analytical model that enables throughput evaluation of\nOpportunistic Spectrum Orthogonal Frequency Division Multiple Access (OS-OFDMA)\nnetworks. The core feature of the model, based on a discrete time Markov chain,\nis the consideration of different channel and subchannel allocation strategies\nunder different Primary and Secondary user types, traffic and priority levels.\nThe analytical model also assesses the impact of different spectrum sensing\nstrategies on the throughput of OS-OFDMA network. The analysis applies to the\nIEEE 802.22 standard, to evaluate the impact of two-stage spectrum sensing\nstrategy and varying temporal activity of wireless microphones on the IEEE\n802.22 throughput. Our study suggests that OS-OFDMA with subchannel notching\nand channel bonding could provide almost ten times higher throughput compared\nwith the design without those options, when the activity and density of\nwireless microphones is very high. Furthermore, we confirm that OS-OFDMA\nimplementation without subchannel notching, used in the IEEE 802.22, is able to\nsupport real-time and non-real-time quality of service classes, provided that\nwireless microphones temporal activity is moderate (with approximately one\nwireless microphone per 3,000 inhabitants with light urban population density\nand short duty cycles). Finally, two-stage spectrum sensing option improves\nOS-OFDMA throughput, provided that the length of spectrum sensing at every\nstage is optimized using our model.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jul 2010 22:25:55 GMT"}, {"version": "v2", "created": "Thu, 24 Mar 2011 18:58:24 GMT"}, {"version": "v3", "created": "Wed, 29 Aug 2012 08:32:32 GMT"}], "update_date": "2012-08-30", "authors_parsed": [["Park", "Jihoon", ""], ["Pawełczak", "Przemysław", ""], ["Grønsund", "Pål", ""], ["Čabrić", "Danijela", ""]]}, {"id": "1007.5089", "submitter": "EPTCS", "authors": "Mayleen Lacouture (ASCOLA Research Team (Mines de Nantes-INRIA, LINA)\n  - Ecole des Mines de Nantes, France), Herv\\'e Grall (ASCOLA Research Team\n  (Mines de Nantes-INRIA, LINA) - Ecole des Mines de Nantes, France), Thomas\n  Ledoux (ASCOLA Research Team (Mines de Nantes-INRIA, LINA) - INRIA\n  Rennes-Bretagne Atlantique, France)", "title": "CREOLE: a Universal Language for Creating, Requesting, Updating and\n  Deleting Resources", "comments": "In Proceedings FOCLASA 2010, arXiv:1007.4993", "journal-ref": "EPTCS 30, 2010, pp. 16-30", "doi": "10.4204/EPTCS.30.2", "report-no": null, "categories": "cs.PL cs.NI cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of Service-Oriented Computing, applications can be developed\nfollowing the REST (Representation State Transfer) architectural style. This\nstyle corresponds to a resource-oriented model, where resources are manipulated\nvia CRUD (Create, Request, Update, Delete) interfaces. The diversity of CRUD\nlanguages due to the absence of a standard leads to composition problems\nrelated to adaptation, integration and coordination of services. To overcome\nthese problems, we propose a pivot architecture built around a universal\nlanguage to manipulate resources, called CREOLE, a CRUD Language for Resource\nEdition. In this architecture, scripts written in existing CRUD languages, like\nSQL, are compiled into Creole and then executed over different CRUD interfaces.\nAfter stating the requirements for a universal language for manipulating\nresources, we formally describe the language and informally motivate its\ndefinition with respect to the requirements. We then concretely show how the\narchitecture solves adaptation, integration and coordination problems in the\ncase of photo management in Flickr and Picasa, two well-known service-oriented\napplications. Finally, we propose a roadmap for future work.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 00:12:43 GMT"}], "update_date": "2010-07-30", "authors_parsed": [["Lacouture", "Mayleen", "", "ASCOLA Research Team"], ["Grall", "Hervé", "", "ASCOLA Research Team"], ["Ledoux", "Thomas", "", "ASCOLA Research Team"]]}, {"id": "1007.5139", "submitter": "Secretary  Ijaia", "authors": "Anuradha Banerjee (1) and Paramartha Dutta (2) ((1) Kalyani Govt.\n  Engg. College, India and (2) Visva-Bharati University, India)", "title": "Reputation-Based Attack-Resistant Cooperation Stimulation (RACS) For\n  Mobile Ad hoc Networks", "comments": "20 pages, 4 figures", "journal-ref": "International Journal of Artificial Intelligence & Applications\n  1.3 (2010) 71-90", "doi": "10.5121/ijaia.2010.1306", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In mobile ad hoc networks (MANET), nodes usually belong to different\nauthorities and pursue different goals. In order to maximize their own\nperformance, nodes in such networks tend to be selfish and are not willing to\nforward packets for benefit of others. Meanwhile, some nodes may behave\nmaliciously and try to disrupt the network through wasting other nodes\nresources in a very large scale. In this article, we present a reputation-based\nattack resistant cooperation stimulation (RACS) system which ensures that\ndamage caused by malicious nodes can be bounded and cooperation among the\nselfish nodes can be enforced. Mathematical analyses of the system as well as\nthe simulation results have confirmed effectiveness of our proposed system.\nRACS is completely self-organizing and distributed. It does not require any\ntamper-proof hardware or central management policy.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 07:54:51 GMT"}], "update_date": "2010-07-30", "authors_parsed": [["Banerjee", "Anuradha", ""], ["Dutta", "Paramartha", ""]]}, {"id": "1007.5165", "submitter": "Secretary Iju", "authors": "R. Shankar (1), Timothy Rajkumar.K (2) and P.Dananjayan (2) ((1) Sri\n  Manakula Vinayagar Engineering College and (2) Pondicherry Engineering\n  College, India)", "title": "Security Enhancement With Optimal QOS Using EAP-AKA In Hybrid Coupled\n  3G-WLAN Convergence Network", "comments": "12 pages, 5 figures", "journal-ref": "International Journal Of UbiComp 1.3 (2010) 31-42", "doi": "10.5121/iju.2010.1303", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The third generation partnership project (3GPP) has addressed the feasibility\nof interworking and specified the interworking architecture and security\narchitecture for third generation (3G)-wireless local area network (WLAN), it\nis developing, system architecture evolution (SAE)/ long term evolution (LTE)\narchitecture, for the next generation mobile communication system. To provide a\nsecure 3G-WLAN interworking in the SAE/LTE architecture, Extensible\nauthentication protocol-authentication and key agreement (EAP-AKA) is used.\nHowever, EAP-AKA have several vulnerabilities. Therefore, this paper not only\nanalyses the threats and attacks in 3G-WLAN interworking but also proposes a\nnew authentication and key agreement protocol based on EAP-AKA. The proposed\nprotocol combines elliptic curve Diffie-Hellman (ECDH) with symmetric key\ncryptosystem to overcome the vulnerabilities. The proposed protocol is used in\nhybrid coupled 3G-WLAN convergence network to analyse its efficiency in terms\nof QoS metrics, the results obtained using OPNET 14.5 shows that the proposed\nprotocol outperforms existing interworking protocols both in security and QoS.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 09:39:23 GMT"}], "update_date": "2010-07-30", "authors_parsed": [["Shankar", "R.", ""], ["K", "Timothy Rajkumar.", ""], ["Dananjayan", "P.", ""]]}, {"id": "1007.5168", "submitter": "Secretary Iju", "authors": "R.Valli and P.Dananjayan (Pondicherry Engineering College, India)", "title": "A Non-Cooperative Game Theoretical Approach For Power Control In Virtual\n  MIMO Wireless Sensor Network", "comments": "12 pages, 8 figures", "journal-ref": "International Journal Of UbiComp 1.3 (2010) 44-55", "doi": "10.5121/iju.2010.1304", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Power management is one of the vital issue in wireless sensor networks, where\nthe lifetime of the network relies on battery powered nodes. Transmitting at\nhigh power reduces the lifetime of both the nodes and the network. One\nefficient way of power management is to control the power at which the nodes\ntransmit. In this paper, a virtual multiple input multiple output wireless\nsensor network (VMIMO-WSN)communication architecture is considered and the\npower control of sensor nodes based on the approach of game theory is\nformulated. The use of game theory has proliferated, with a broad range of\napplications in wireless sensor networking. Approaches from game theory can be\nused to optimize node level as well as network wide performance. The game here\nis categorized as an incomplete information game, in which the nodes do not\nhave complete information about the strategies taken by other nodes. For\nvirtual multiple input multiple output wireless sensor network architecture\nconsidered, the Nash equilibrium is used to decide the optimal power level at\nwhich a node needs to transmit, to maximize its utility. Outcome shows that the\ngame theoretic approach considered for VMIMO-WSN architecture achieves the best\nutility, by consuming less power.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 09:47:06 GMT"}], "update_date": "2010-07-30", "authors_parsed": [["Valli", "R.", "", "Pondicherry Engineering College, India"], ["Dananjayan", "P.", "", "Pondicherry Engineering College, India"]]}, {"id": "1007.5170", "submitter": "Samir Medina Perlaza", "authors": "Samir M. Perlaza and Hamidou Tembine and Samson Lasaulce and Merouane\n  Debbah", "title": "Satisfaction Equilibrium: A General Framework for QoS Provisioning in\n  Self-Configuring Networks", "comments": "Accepted for publication in Globecom 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is concerned with the concept of equilibrium and quality of\nservice (QoS) provisioning in self-configuring wireless networks with\nnon-cooperative radio devices (RD). In contrast with the Nash equilibrium (NE),\nwhere RDs are interested in selfishly maximizing its QoS, we present a concept\nof equilibrium, named satisfaction equilibrium (SE), where RDs are interested\nonly in guaranteing a minimum QoS. We provide the conditions for the existence\nand the uniqueness of the SE. Later, in order to provide an equilibrium\nselection framework for the SE, we introduce the concept of effort or cost of\nsatisfaction, for instance, in terms of transmit power levels, constellation\nsizes, etc. Using the idea of effort, the set of efficient SE (ESE) is defined.\nAt the ESE, transmitters satisfy their minimum QoS incurring in the lowest\neffort. We prove that contrary to the (generalized) NE, at least one ESE always\nexists whenever the network is able to simultaneously support the individual\nQoS requests. Finally, we provide a fully decentralized algorithm to allow\nself-configuring networks to converge to one of the SE relying only on local\ninformation.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 09:50:46 GMT"}], "update_date": "2010-07-30", "authors_parsed": [["Perlaza", "Samir M.", ""], ["Tembine", "Hamidou", ""], ["Lasaulce", "Samson", ""], ["Debbah", "Merouane", ""]]}, {"id": "1007.5218", "submitter": "Caihong Kai", "authors": "Cai Hong Kai, Soung Chang Liew", "title": "Applications of Belief Propagation in CSMA Wireless Networks", "comments": "A technical report of The Chinese University of Hong Kong", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The belief propagation (BP) algorithm is an efficient way to solve\n\"inference\" problems in graphical models, such as Bayesian networks and Markov\nrandom fields. The system-state probability distribution of CSMA wireless\nnetworks is a Markov random field. An interesting question is how BP can help\nthe analysis and design of CSMA wireless networks. This paper explores three\nsuch applications. First, we show how BP can be used to compute the throughputs\nof different links in the network given their access intensities, defined as\nthe mean packet transmission time divided by the mean backoff countdown time.\nSecond, we propose an inverse-BP algorithm to solve the reverse problem: how to\nset the access intensities of different links to meet their target throughputs?\nThird, we introduce a BP-adaptive CSMA algorithm to find the link access\nintensities that can achieve optimal system utility. BP solves the three\nproblems with exact results in tree networks. It may, however, lose accuracy in\nnetworks with a loopy contention graph. We show how a generalized version of\nBP, GBP, can be designed to solve the three problems with high accuracy for\nnetworks with a loopy contention graph. Importantly, we show how the BP and GBP\nalgorithms in this paper can be implemented in a distributed manner, making\nthem useful in practical CSMA network opera-tion.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 13:51:28 GMT"}, {"version": "v2", "created": "Tue, 17 Aug 2010 14:57:05 GMT"}, {"version": "v3", "created": "Thu, 19 Aug 2010 03:53:27 GMT"}, {"version": "v4", "created": "Thu, 14 Jul 2011 14:35:01 GMT"}], "update_date": "2011-07-15", "authors_parsed": [["Kai", "Cai Hong", ""], ["Liew", "Soung Chang", ""]]}, {"id": "1007.5239", "submitter": "Wei Chen", "authors": "Wei Chen, Yue Wang, Minghua Chen, and Soung Chang Liew", "title": "TCP Reno over Adaptive CSMA", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  An interesting distributed adaptive CSMA MAC protocol, called adaptive CSMA,\nwas proposed recently to schedule any strictly feasible achievable rates inside\nthe capacity region. Of particular interest is the fact that the adaptive CSMA\ncan achieve a system utility arbitrarily close to that is achievable under a\ncentral scheduler. However, a specially designed transport-layer rate\ncontroller is needed for this result. An outstanding question is whether the\nwidely-installed TCP Reno is compatible with adaptive CSMA and can achieve the\nsame result. The answer to this question will determine how close to practical\ndeployment adaptive CSMA is. Our answer is yes and no. First, we observe that\nrunning TCP Reno directly over adaptive CSMA results in severe starvation\nproblems. Effectively, its performance is no better than that of TCP Reno over\nlegacy CSMA (IEEE 802.11), and the potentials of adaptive CSMA cannot be\nrealized. Fortunately, we find that multi-connection TCP Reno over adaptive\nCSMA with active queue management can materialize the advantages of adaptive\nCSMA. NS-2 simulations demonstrate that our solution can alleviate starvation\nand achieve fair and efficient rate allocation. Multi-connection TCP can be\nimplemented at either application or transport layer. Application-layer\nimplementation requires no kernel modification, making the solution readily\ndeployable in networks running adaptive CSMA.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 14:49:16 GMT"}, {"version": "v2", "created": "Mon, 2 Aug 2010 05:29:57 GMT"}], "update_date": "2010-08-03", "authors_parsed": [["Chen", "Wei", ""], ["Wang", "Yue", ""], ["Chen", "Minghua", ""], ["Liew", "Soung Chang", ""]]}, {"id": "1007.5240", "submitter": "Paolo Santi", "authors": "Josep Diaz, Alberto Marchetti-Spaccamela, Dieter Mitsche, Paolo Santi,\n  and Julinda Stefa", "title": "Social-Aware Forwarding Improves Routing Performance in Pocket Switched\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several social-aware forwarding strategies have been recently introduced in\nopportunistic networks, and proved effective in considerably in- creasing\nrouting performance through extensive simulation studies based on real-world\ndata. However, this performance improvement comes at the expense of storing a\nconsiderable amount of state information (e.g, history of past encounters) at\nthe nodes. Hence, whether the benefits on routing performance comes directly\nfrom the social-aware forwarding mechanism, or indirectly by the fact state\ninformation is exploited is not clear. Thus, the question of whether\nsocial-aware forwarding by itself is effective in improving opportunistic\nnetwork routing performance remained unaddressed so far. In this paper, we give\na first, positive answer to the above question, by investigating the expected\nmessage delivery time as the size of the net- work grows larger.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jul 2010 19:51:54 GMT"}, {"version": "v2", "created": "Fri, 17 Feb 2012 08:12:43 GMT"}], "update_date": "2012-02-20", "authors_parsed": [["Diaz", "Josep", ""], ["Marchetti-Spaccamela", "Alberto", ""], ["Mitsche", "Dieter", ""], ["Santi", "Paolo", ""], ["Stefa", "Julinda", ""]]}, {"id": "1007.5255", "submitter": "Soung Liew", "authors": "Soung Chang Liew, Jialiang Zhang, Chi-Kin Chau, Minghua Chen", "title": "Analysis of Frequency-Agile CSMA Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes and analyzes the performance of a simple frequency-agile\nCSMA MAC protocol. In this MAC, a node carrier-senses multiple frequency\nchannels simultaneously, and it takes the first opportunity to transmit on any\none of the channels when allowed by the CSMA backoff mechanism. We show that\nthe frequency-agile MAC can effectively 1) boost throughput and 2) remove\ntemporal starvation. Furthermore, the MAC can be implemented on the existing\nmultiple-frequency setup in Wi-Fi using multi-radio technology, and it can\nco-exist with the legacy MAC using single radio. This paper provides exact\nstationary throughput analysis for regular 1D and thin-strip 2D CSMA networks\nusing a \"transfer-matrix\" approach. In addition, accurate approximations are\ngiven for 2D grid networks. Our closed-form formulas accurately quantify the\nthroughput gain of frequency-agile CSMA. To characterize temporal starvation,\nwe use the metric of \"mean residual access time\" (MRAT). Our simulations and\nclosed-form approximations indicate that the frequency-agile MAC can totally\neliminate temporal starvation in 2D grid networks, reducing its MRAT by orders\nof magnitude. Finally, this paper presents a \"coloring theorem\" to justify the\nuse of the frequency-agile MAC in general network topologies. Our analysis and\ntheorem suggest that with enough frequency channels, the frequency-agile MAC\ncan effectively decouple the detrimental interactions between neighboring links\nresponsible for low throughput and starvation.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 16:09:12 GMT"}], "update_date": "2010-07-30", "authors_parsed": [["Liew", "Soung Chang", ""], ["Zhang", "Jialiang", ""], ["Chau", "Chi-Kin", ""], ["Chen", "Minghua", ""]]}, {"id": "1007.5341", "submitter": "Panagiotis Pantazopoulos", "authors": "Panagiotis Pantazopoulos, Merkourios Karaliopoulos and Ioannis\n  Stavrakakis", "title": "Scalable distributed service migration via Complex Networks Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With social networking sites providing increasingly richer context,\nUser-Centric Service (UCS) creation is expected to explode following a similar\nsuccess path to User-Generated Content. One of the major challenges in this\nemerging highly user-centric networking paradigm is how to make these exploding\nin numbers yet, individually, of vanishing demand services available in a\ncost-effective manner. Of prime importance to the latter (and focus of this\npaper) is the determination of the optimal location for hosting a UCS. Taking\ninto account the particular characteristics of UCS, we formulate the problem as\na facility location problem and devise a distributed and highly scalable\nheuristic solution to it.\n  Key to the proposed approach is the introduction of a novel metric drawing on\nComplex Network Analysis. Given a current location of UCS, this metric helps to\na) identify a small subgraph of nodes with high capacity to act as service\ndemand concentrators; b) project on them a reduced yet accurate view of the\nglobal demand distribution that preserves the key attraction forces on UCS;\nand, ultimately, c) pave the service migration path towards its optimal\nlocation in the network. The proposed iterative UCS migration algorithm, called\ncDSMA, is extensively evaluated over synthetic and real-world network\ntopologies. Our results show that cDSMA achieves high accuracy, fast\nconvergence, remarkable insensitivity to the size and diameter of the network\nand resilience to inaccurate estimates of demands for UCS across the network.\nIt is also shown to clearly outperform local-search heuristics for service\nmigration that constrain the subgraph to the immediate neighbourhood of the\nnode currently hosting UCS.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2010 21:55:21 GMT"}, {"version": "v2", "created": "Mon, 2 Aug 2010 19:59:03 GMT"}], "update_date": "2010-08-03", "authors_parsed": [["Pantazopoulos", "Panagiotis", ""], ["Karaliopoulos", "Merkourios", ""], ["Stavrakakis", "Ioannis", ""]]}, {"id": "1007.5425", "submitter": "Zhong Fan", "authors": "Zhong Fan", "title": "Distributed Demand Response and User Adaptation in Smart Grids", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper proposes a distributed framework for demand response and user\nadaptation in smart grid networks. In particular, we borrow the concept of\ncongestion pricing in Internet traffic control and show that pricing\ninformation is very useful to regulate user demand and hence balance network\nload. User preference is modeled as a willingness to pay parameter which can be\nseen as an indicator of differential quality of service. Both analysis and\nsimulation results are presented to demonstrate the dynamics and convergence\nbehavior of the algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jul 2010 12:16:45 GMT"}], "update_date": "2010-08-02", "authors_parsed": [["Fan", "Zhong", ""]]}, {"id": "1007.5459", "submitter": "John Whitbeck", "authors": "John Whitbeck, Yoann Lopez, J\\'er\\'emie Leguay, Vania Conan, Marcelo\n  Dias de Amorim", "title": "Relieving the Wireless Infrastructure: When Opportunistic Networks Meet\n  Guaranteed Delays", "comments": "Accepted at IEEE WoWMoM 2011 conference", "journal-ref": null, "doi": "10.1109/WoWMoM.2011.5986466", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Major wireless operators are nowadays facing network capacity issues in\nstriving to meet the growing demands of mobile users. At the same time,\n3G-enabled devices increasingly benefit from ad hoc radio connectivity (e.g.,\nWi-Fi). In this context of hybrid connectivity, we propose Push-and-track, a\ncontent dissemination framework that harnesses ad hoc communication\nopportunities to minimize the load on the wireless infrastructure while\nguaranteeing tight delivery delays. It achieves this through a control loop\nthat collects user-sent acknowledgements to determine if new copies need to be\nreinjected into the network through the 3G interface. Push-and-Track includes\nmultiple strategies to determine how many copies of the content should be\ninjected, when, and to whom. The short delay-tolerance of common content, such\nas news or road traffic updates, make them suitable for such a system. Based on\na realistic large-scale vehicular dataset from the city of Bologna composed of\nmore than 10,000 vehicles, we demonstrate that Push-and-Track consistently\nmeets its delivery objectives while reducing the use of the 3G network by over\n90%.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jul 2010 14:26:53 GMT"}, {"version": "v2", "created": "Sat, 4 Dec 2010 21:44:42 GMT"}, {"version": "v3", "created": "Mon, 30 May 2011 20:17:57 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Whitbeck", "John", ""], ["Lopez", "Yoann", ""], ["Leguay", "Jérémie", ""], ["Conan", "Vania", ""], ["de Amorim", "Marcelo Dias", ""]]}]