[{"id": "1208.1774", "submitter": "Leonid Litinskii", "authors": "L. B. Litinskii, B. V. Kryzhanovsky, and A. Fonarev", "title": "Operator formalism for optical neural network based on the parametrical\n  four-wave mixing process", "comments": "5 pages,without figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we develop a formalism allowing us to describe operating of a\nnetwork based on the parametrical four-wave mixing process that is well-known\nin nonlinear optics. The recognition power of a network using parametric\nneurons operating with q different frequencies is considered. It is shown that\nthe storage capacity of such a network is higher compared with the Potts-glass\nmodels.\n", "versions": [{"version": "v1", "created": "Wed, 8 Aug 2012 20:17:42 GMT"}], "update_date": "2012-08-10", "authors_parsed": [["Litinskii", "L. B.", ""], ["Kryzhanovsky", "B. V.", ""], ["Fonarev", "A.", ""]]}, {"id": "1208.3620", "submitter": "Oliver  Pabst", "authors": "Oliver Pabst, Torsten Schmidt", "title": "Sinusoidal analysis of memristor bridge circuit-rectifier for low\n  frequencies", "comments": "6 pages, 14 figures; A new paper reference is included. It is cited\n  and described shortly at top of section V", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.mtrl-sci cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reasoned by its dynamical behavior, the memristor enables a lot of new\napplications in analog circuit design. Since some realizations are shown (e.g.\n2007 by Hewlett Packard), the development of applications with memristors\nbecomes more and more interesting. Whereas most of the research was done in the\ndirection of memristor applications in neural networks and storage devices,\nless publications deal with practical applications of analog memristive\ncircuits. But this topic is also promising further applications. Therefore,\nthis article proposes a frequency dependent rectifier memristor bridge for\ndifferent purposes (e.g. using as a programmable synaptic membrane voltage\ngenerator for Spike-Time-Dependent-Plasticity) and describes the circuit\ntheory. In this context it is shown that the Picard Iteration is one\npossibility to solve the system of nonlinear state equations of memristor\ncircuits analytically. An intuitive picture of how a memristor works in a\nnetwork in general is given as well. In this context some research on the\ndynamical behavior of a HP memristor should be done.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2012 11:54:53 GMT"}, {"version": "v2", "created": "Mon, 18 Feb 2013 15:33:12 GMT"}], "update_date": "2013-02-19", "authors_parsed": [["Pabst", "Oliver", ""], ["Schmidt", "Torsten", ""]]}, {"id": "1208.5425", "submitter": "Mona Arabzadeh", "authors": "Mona Arabzadeh, Morteza Saheb Zamani, Mehdi Sedighi, Mehdi Saeedi", "title": "Depth-Optimized Reversible Circuit Synthesis", "comments": "13 pages, 6 figures, 5 tables; Quantum Information Processing (QINP)\n  journal, 2012", "journal-ref": "Quantum Information Processing: Volume 12, Issue 4 (2013), Page\n  1677-1699", "doi": "10.1007/s11128-012-0482-8", "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, simultaneous reduction of circuit depth and synthesis cost of\nreversible circuits in quantum technologies with limited interaction is\naddressed. We developed a cycle-based synthesis algorithm which uses negative\ncontrols and limited distance between gate lines. To improve circuit depth, a\nnew parallel structure is introduced in which before synthesis a set of\ndisjoint cycles are extracted from the input specification and distributed into\nsome subsets. The cycles of each subset are synthesized independently on\ndifferent sets of ancillae. Accordingly, each disjoint set can be synthesized\nby different synthesis methods. Our analysis shows that the best worst-case\nsynthesis cost of reversible circuits in the linear nearest neighbor\narchitecture is improved by the proposed approach. Our experimental results\nreveal the effectiveness of the proposed approach to reduce cost and circuit\ndepth for several benchmarks.\n", "versions": [{"version": "v1", "created": "Mon, 27 Aug 2012 15:48:17 GMT"}], "update_date": "2016-11-11", "authors_parsed": [["Arabzadeh", "Mona", ""], ["Zamani", "Morteza Saheb", ""], ["Sedighi", "Mehdi", ""], ["Saeedi", "Mehdi", ""]]}]