[{"id": "1712.00270", "submitter": "Bal\\'azs Pej\\'o", "authors": "Balazs Pejo, Qiang Tang, Gergely Biczok", "title": "Together or Alone: The Price of Privacy in Collaborative Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning algorithms have reached mainstream status and are widely\ndeployed in many applications. The accuracy of such algorithms depends\nsignificantly on the size of the underlying training dataset; in reality a\nsmall or medium sized organization often does not have the necessary data to\ntrain a reasonably accurate model. For such organizations, a realistic solution\nis to train their machine learning models based on their joint dataset (which\nis a union of the individual ones). Unfortunately, privacy concerns prevent\nthem from straightforwardly doing so. While a number of privacy-preserving\nsolutions exist for collaborating organizations to securely aggregate the\nparameters in the process of training the models, we are not aware of any work\nthat provides a rational framework for the participants to precisely balance\nthe privacy loss and accuracy gain in their collaboration. In this paper, by\nfocusing on a two-player setting, we model the collaborative training process\nas a two-player game where each player aims to achieve higher accuracy while\npreserving the privacy of its own dataset. We introduce the notion of Price of\nPrivacy, a novel approach for measuring the impact of privacy protection on the\naccuracy in the proposed framework. Furthermore, we develop a game-theoretical\nmodel for different player types, and then either find or prove the existence\nof a Nash Equilibrium with regard to the strength of privacy protection for\neach player. Using recommendation systems as our main use case, we demonstrate\nhow two players can make practical use of the proposed theoretical framework,\nincluding setting up the parameters and approximating the non-trivial Nash\nEquilibrium.\n", "versions": [{"version": "v1", "created": "Fri, 1 Dec 2017 10:55:57 GMT"}, {"version": "v2", "created": "Wed, 28 Feb 2018 14:56:18 GMT"}, {"version": "v3", "created": "Fri, 24 Aug 2018 06:39:34 GMT"}], "update_date": "2018-08-27", "authors_parsed": [["Pejo", "Balazs", ""], ["Tang", "Qiang", ""], ["Biczok", "Gergely", ""]]}, {"id": "1712.00557", "submitter": "Aaron Tuor", "authors": "Aaron Tuor, Ryan Baerwolf, Nicolas Knowles, Brian Hutchinson, Nicole\n  Nichols, Rob Jasper", "title": "Recurrent Neural Network Language Models for Open Vocabulary Event-Level\n  Cyber Anomaly Detection", "comments": "8 pages, To appear in proceedings of AAAI-2018 Artificial\n  Intelligence in Cyber Security Workshop", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automated analysis methods are crucial aids for monitoring and defending a\nnetwork to protect the sensitive or confidential data it hosts. This work\nintroduces a flexible, powerful, and unsupervised approach to detecting\nanomalous behavior in computer and network logs, one that largely eliminates\ndomain-dependent feature engineering employed by existing methods. By treating\nsystem logs as threads of interleaved \"sentences\" (event log lines) to train\nonline unsupervised neural network language models, our approach provides an\nadaptive model of normal network behavior. We compare the effectiveness of both\nstandard and bidirectional recurrent neural network language models at\ndetecting malicious activity within network log data. Extending these models,\nwe introduce a tiered recurrent architecture, which provides context by\nmodeling sequences of users' actions over time. Compared to Isolation Forest\nand Principal Components Analysis, two popular anomaly detection algorithms, we\nobserve superior performance on the Los Alamos National Laboratory Cyber\nSecurity dataset. For log-line-level red team detection, our best performing\ncharacter-based model provides test set area under the receiver operator\ncharacteristic curve of 0.98, demonstrating the strong fine-grained anomaly\ndetection performance of this approach on open vocabulary logging sources.\n", "versions": [{"version": "v1", "created": "Sat, 2 Dec 2017 06:08:35 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Tuor", "Aaron", ""], ["Baerwolf", "Ryan", ""], ["Knowles", "Nicolas", ""], ["Hutchinson", "Brian", ""], ["Nichols", "Nicole", ""], ["Jasper", "Rob", ""]]}, {"id": "1712.00673", "submitter": "Xuanqing Liu", "authors": "Xuanqing Liu, Minhao Cheng, Huan Zhang, Cho-Jui Hsieh", "title": "Towards Robust Neural Networks via Random Self-ensemble", "comments": "ECCV 2018 camera ready", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent studies have revealed the vulnerability of deep neural networks: A\nsmall adversarial perturbation that is imperceptible to human can easily make a\nwell-trained deep neural network misclassify. This makes it unsafe to apply\nneural networks in security-critical applications. In this paper, we propose a\nnew defense algorithm called Random Self-Ensemble (RSE) by combining two\nimportant concepts: {\\bf randomness} and {\\bf ensemble}. To protect a targeted\nmodel, RSE adds random noise layers to the neural network to prevent the strong\ngradient-based attacks, and ensembles the prediction over random noises to\nstabilize the performance. We show that our algorithm is equivalent to ensemble\nan infinite number of noisy models $f_\\epsilon$ without any additional memory\noverhead, and the proposed training procedure based on noisy stochastic\ngradient descent can ensure the ensemble model has a good predictive\ncapability. Our algorithm significantly outperforms previous defense techniques\non real data sets. For instance, on CIFAR-10 with VGG network (which has 92\\%\naccuracy without any attack), under the strong C\\&W attack within a certain\ndistortion tolerance, the accuracy of unprotected model drops to less than\n10\\%, the best previous defense technique has $48\\%$ accuracy, while our method\nstill has $86\\%$ prediction accuracy under the same level of attack. Finally,\nour method is simple and easy to integrate into any neural network.\n", "versions": [{"version": "v1", "created": "Sat, 2 Dec 2017 22:26:12 GMT"}, {"version": "v2", "created": "Wed, 1 Aug 2018 00:44:31 GMT"}], "update_date": "2018-08-02", "authors_parsed": [["Liu", "Xuanqing", ""], ["Cheng", "Minhao", ""], ["Zhang", "Huan", ""], ["Hsieh", "Cho-Jui", ""]]}, {"id": "1712.00699", "submitter": "Rajeev Ranjan", "authors": "Rajeev Ranjan, Swami Sankaranarayanan, Carlos D. Castillo and Rama\n  Chellappa", "title": "Improving Network Robustness against Adversarial Attacks with Compact\n  Convolution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though Convolutional Neural Networks (CNNs) have surpassed human-level\nperformance on tasks such as object classification and face verification, they\ncan easily be fooled by adversarial attacks. These attacks add a small\nperturbation to the input image that causes the network to misclassify the\nsample. In this paper, we focus on neutralizing adversarial attacks by compact\nfeature learning. In particular, we show that learning features in a closed and\nbounded space improves the robustness of the network. We explore the effect of\nL2-Softmax Loss, that enforces compactness in the learned features, thus\nresulting in enhanced robustness to adversarial perturbations. Additionally, we\npropose compact convolution, a novel method of convolution that when\nincorporated in conventional CNNs improves their robustness. Compact\nconvolution ensures feature compactness at every layer such that they are\nbounded and close to each other. Extensive experiments show that Compact\nConvolutional Networks (CCNs) neutralize multiple types of attacks, and perform\nbetter than existing methods in defending adversarial attacks, without\nincurring any additional training overhead compared to CNNs.\n", "versions": [{"version": "v1", "created": "Sun, 3 Dec 2017 03:09:31 GMT"}, {"version": "v2", "created": "Thu, 22 Mar 2018 21:45:44 GMT"}], "update_date": "2018-03-26", "authors_parsed": [["Ranjan", "Rajeev", ""], ["Sankaranarayanan", "Swami", ""], ["Castillo", "Carlos D.", ""], ["Chellappa", "Rama", ""]]}, {"id": "1712.00735", "submitter": "Takeshi Koshiba", "authors": "Takeshi Koshiba", "title": "Fourier-based Function Secret Sharing with General Access Structure", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Function secret sharing (FSS) scheme is a mechanism that calculates a\nfunction f(x) for x in {0,1}^n which is shared among p parties, by using\ndistributed functions f_i:{0,1}^n -> G, where G is an Abelian group, while the\nfunction f:{0,1}^n -> G is kept secret to the parties. Ohsawa et al. in 2017\nobserved that any function f can be described as a linear combination of the\nbasis functions by regarding the function space as a vector space of dimension\n2^n and gave new FSS schemes based on the Fourier basis. All existing FSS\nschemes are of (p,p)-threshold type. That is, to compute f(x), we have to\ncollect f_i(x) for all the distributed functions. In this paper, as in the\nsecret sharing schemes, we consider FSS schemes with any general access\nstructure. To do this, we observe that Fourier-based FSS schemes by Ohsawa et\nal. are compatible with linear secret sharing scheme. By incorporating the\ntechniques of linear secret sharing with any general access structure into the\nFourier-based FSS schemes, we show Fourier-based FSS schemes with any general\naccess structure.\n", "versions": [{"version": "v1", "created": "Sun, 3 Dec 2017 09:34:31 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Koshiba", "Takeshi", ""]]}, {"id": "1712.00775", "submitter": "Petar Bojovi\\'c D.", "authors": "P. D. Bojovic, K. Savic", "title": "Analiza bezbednosnih mehanizama OSPF protokola", "comments": "in Serbian. Published on e-RAF Journal on Computing (e-RAF JoC), 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The security of the service and the system depends on the security of each of\nthem components of this system. An attack on the routing protocol may be\ninaccurate functioning of the computer network. In some cases this is possible\nThe attacker comes to data or artificial information for which he is not\nentitled. OSPF protocol is the most commonly used connection protocol. U In\nthis paper, we conducted an OSPF security analysis and described it security\nmechanisms.\n  ----- Bezbednost nekog servisa i sistema zavisi od bezbednosti svake\nkomponente tog sistema. Napad na protokol rutiranja mo\\v{z}e proizvesti\nneispravno funkcionisanje ra\\v{c}unarske mre\\v{z}e. U pojedinim slu\\v{c}ajevima\nmogu\\'ce je da napada\\v{c} do{\\dj}e do podataka ili umetne podatke za koje nema\npravo. OSPF protokol je najrasprostranjeniji protokol stanja linka (link-state\nprotocol). U ovom radu izvr\\v{s}ili smo analizu bezbednosti OSPF protokola i\nopisali njegove bezbednosne mehanizme.\n", "versions": [{"version": "v1", "created": "Sun, 3 Dec 2017 14:41:00 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Bojovic", "P. D.", ""], ["Savic", "K.", ""]]}, {"id": "1712.00841", "submitter": "Rudra Prasad Baksi", "authors": "Rudra Prasad Baksi and Shambhu J. Upadhyaya", "title": "Kidemonas: The Silent Guardian", "comments": "Secure Knowledge Management 2017, Tampa, FL,\n  http://skmworkshop.wixsite.com/home/program", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advanced Persistent Threats or APTs are big challenges to the security of\ngovernment organizations or industry systems. These threats may result in\nstealth attacks, but if the attack is confronted before the attacker end goal\nhas been achieved, the attackers could become aggressive by changing the mode\nof attack or by resorting to some form of contingency plan, which might cause\nunexpected damage. Therefore, the attack detection and the notification to the\nsystem administrator should be done surreptitiously. This paper presents an\narchitecture, called Kidemonas, to silently detect the threat and secretly\nreport it to the user or the system administrator. This way the attacker is\ndeceived into carrying out the attack, without sending any clear signal so that\nthe defender can buy time to develop countermeasures to deal with the attack.\nWe consider several attack scenarios and perform a security analysis to\ndemonstrate the features of Kidemonas.\n", "versions": [{"version": "v1", "created": "Sun, 3 Dec 2017 21:17:24 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Baksi", "Rudra Prasad", ""], ["Upadhyaya", "Shambhu J.", ""]]}, {"id": "1712.00848", "submitter": "Alberto Pedrouzo-Ulloa", "authors": "Alberto Pedrouzo-Ulloa, Juan Ram\\'on Troncoso-Pastoriza, Fernando\n  P\\'erez-Gonz\\'alez", "title": "Multivariate Cryptosystems for Secure Processing of Multidimensional\n  Signals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multidimensional signals like 2-D and 3-D images or videos are inherently\nsensitive signals which require privacy-preserving solutions when processed in\nuntrustworthy environments, but their efficient encrypted processing is\nparticularly challenging due to their structure, dimensionality and size. This\nwork introduces a new cryptographic hard problem denoted m-RLWE (multivariate\nRing Learning with Errors) which generalizes RLWE, and proposes several\nrelinearization-based techniques to efficiently convert signals with different\nstructures and dimensionalities. The proposed hard problem and the developed\ntechniques give support to lattice cryptosystems that enable encrypted\nprocessing of multidimensional signals and efficient conversion between\ndifferent structures. We show an example cryptosystem and prove that it\noutperforms its RLWE counterpart in terms of security against basis-reduction\nattacks, efficiency and cipher expansion for encrypted image processing, and we\nexemplify some of the proposed transformation techniques in critical and\nubiquitous block-based processing applications\n", "versions": [{"version": "v1", "created": "Sun, 3 Dec 2017 22:58:31 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Pedrouzo-Ulloa", "Alberto", ""], ["Troncoso-Pastoriza", "Juan Ramón", ""], ["Pérez-González", "Fernando", ""]]}, {"id": "1712.00871", "submitter": "Chris Culnane Dr", "authors": "Chris Culnane, Benjamin I. P. Rubinstein, Vanessa Teague", "title": "Vulnerabilities in the use of similarity tables in combination with\n  pseudonymisation to preserve data privacy in the UK Office for National\n  Statistics' Privacy-Preserving Record Linkage", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the course of a survey of privacy-preserving record linkage, we reviewed\nthe approach taken by the UK Office for National Statistics (ONS) as described\nin their series of reports \"Beyond 2011\". Our review identifies a number of\nmatters of concern. Some of the issues discovered are sufficiently severe to\npresent a risk to privacy.\n", "versions": [{"version": "v1", "created": "Mon, 4 Dec 2017 01:43:41 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Culnane", "Chris", ""], ["Rubinstein", "Benjamin I. P.", ""], ["Teague", "Vanessa", ""]]}, {"id": "1712.01066", "submitter": "Tribhuvanesh Orekondy", "authors": "Tribhuvanesh Orekondy, Mario Fritz, Bernt Schiele", "title": "Connecting Pixels to Privacy and Utility: Automatic Redaction of Private\n  Information in Images", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CR cs.CY cs.SI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Images convey a broad spectrum of personal information. If such images are\nshared on social media platforms, this personal information is leaked which\nconflicts with the privacy of depicted persons. Therefore, we aim for automated\napproaches to redact such private information and thereby protect privacy of\nthe individual. By conducting a user study we find that obfuscating the image\nregions related to the private information leads to privacy while retaining\nutility of the images. Moreover, by varying the size of the regions different\nprivacy-utility trade-offs can be achieved. Our findings argue for a \"redaction\nby segmentation\" paradigm. Hence, we propose the first sizable dataset of\nprivate images \"in the wild\" annotated with pixel and instance level labels\nacross a broad range of privacy classes. We present the first model for\nautomatic redaction of diverse private information.\n", "versions": [{"version": "v1", "created": "Mon, 4 Dec 2017 13:35:39 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Orekondy", "Tribhuvanesh", ""], ["Fritz", "Mario", ""], ["Schiele", "Bernt", ""]]}, {"id": "1712.01102", "submitter": "George Kesidis", "authors": "Neda Nasiriani, Yuquan Shan, George Kesidis, Takis Konstantopoulos,\n  Daniel Fleck, Angelos Stavrou", "title": "Moving-target Defense against Botnet Reconnaissance and an Adversarial\n  Coupon-Collection Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a cloud based multiserver system consisting of a set of replica\napplication servers behind a set of proxy (indirection) servers which interact\ndirectly with clients over the Internet. We study a proactive moving-target\ndefense to thwart a DDoS attacker's reconnaissance phase and consequently\nreduce the attack's impact. The defense is effectively a moving-target (motag)\ntechnique in which the proxies dynamically change. The system is evaluated\nusing an AWS prototype of HTTP redirection and by numerical evaluations of an\nadversarial coupon-collector mathematical model, the latter allowing\nlarger-scale extrapolations.\n", "versions": [{"version": "v1", "created": "Mon, 4 Dec 2017 14:45:09 GMT"}, {"version": "v2", "created": "Sun, 10 Dec 2017 22:33:13 GMT"}, {"version": "v3", "created": "Thu, 26 Apr 2018 15:19:22 GMT"}], "update_date": "2018-04-27", "authors_parsed": [["Nasiriani", "Neda", ""], ["Shan", "Yuquan", ""], ["Kesidis", "George", ""], ["Konstantopoulos", "Takis", ""], ["Fleck", "Daniel", ""], ["Stavrou", "Angelos", ""]]}, {"id": "1712.01139", "submitter": "Eylon Yogev", "authors": "Merav Parter and Eylon Yogev", "title": "Distributed Algorithms Made Secure: A Graph Theoretic Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the area of distributed graph algorithms a number of network's entities\nwith local views solve some computational task by exchanging messages with\ntheir neighbors. Quite unfortunately, an inherent property of most existing\ndistributed algorithms is that throughout the course of their execution, the\nnodes get to learn not only their own output but rather learn quite a lot on\nthe inputs or outputs of many other entities. This leakage of information might\nbe a major obstacle in settings where the output (or input) of network's\nindividual is a private information. In this paper, we introduce a new\nframework for \\emph{secure distributed graph algorithms} and provide the first\n\\emph{general compiler} that takes any \"natural\" non-secure distributed\nalgorithm that runs in $r$ rounds, and turns it into a secure algorithm that\nruns in $\\widetilde{O}(r \\cdot D \\cdot poly(\\Delta))$ rounds where $\\Delta$ is\nthe maximum degree in the graph and $D$ is its diameter. The security of the\ncompiled algorithm is information-theoretic but holds only against a\nsemi-honest adversary that controls a single node in the network.\n  This compiler is made possible due to a new combinatorial structure called\n\\emph{private neighborhood trees}: a collection of $n$ trees\n$T(u_1),\\ldots,T(u_n)$, one for each vertex $u_i \\in V(G)$, such that each tree\n$T(u_i)$ spans the neighbors of $u_i$ {\\em without going through $u_i$}.\nIntuitively, each tree $T(u_i)$ allows all neighbors of $u_i$ to exchange a\n\\emph{secret} that is hidden from $u_i$, which is the basic graph\ninfrastructure of the compiler. In a $(d,c)$-private neighborhood trees each\ntree $T(u_i)$ has depth at most $d$ and each edge $e \\in G$ appears in at most\n$c$ different trees. We show a construction of private neighborhood trees with\n$d=\\widetilde{O}(\\Delta \\cdot D)$ and $c=\\widetilde{O}(D)$.\n", "versions": [{"version": "v1", "created": "Mon, 4 Dec 2017 15:08:38 GMT"}, {"version": "v2", "created": "Fri, 23 Feb 2018 11:50:03 GMT"}, {"version": "v3", "created": "Thu, 2 Aug 2018 18:39:42 GMT"}, {"version": "v4", "created": "Sun, 9 Dec 2018 12:49:29 GMT"}, {"version": "v5", "created": "Sun, 13 Jan 2019 20:28:17 GMT"}], "update_date": "2019-01-15", "authors_parsed": [["Parter", "Merav", ""], ["Yogev", "Eylon", ""]]}, {"id": "1712.01145", "submitter": "Xiaoyong Yuan", "authors": "Ruimin Sun, Xiaoyong Yuan, Pan He, Qile Zhu, Aokun Chen, Andre Gregio,\n  Daniela Oliveira, Xiaolin Li", "title": "Learning Fast and Slow: PROPEDEUTICA for Real-time Malware Detection", "comments": "17 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce and evaluate PROPEDEUTICA, a novel methodology\nand framework for efficient and effective real-time malware detection,\nleveraging the best of conventional machine learning (ML) and deep learning\n(DL) algorithms. In PROPEDEUTICA, all software processes in the system start\nexecution subjected to a conventional ML detector for fast classification. If a\npiece of software receives a borderline classification, it is subjected to\nfurther analysis via more performance expensive and more accurate DL methods,\nvia our newly proposed DL algorithm DEEPMALWARE. Further, we introduce delays\nto the execution of software subjected to deep learning analysis as a way to\n\"buy time\" for DL analysis and to rate-limit the impact of possible malware in\nthe system. We evaluated PROPEDEUTICA with a set of 9,115 malware samples and\n877 commonly used benign software samples from various categories for the\nWindows OS. Our results show that the false positive rate for conventional ML\nmethods can reach 20%, and for modern DL methods it is usually below 6%.\nHowever, the classification time for DL can be 100X longer than conventional ML\nmethods. PROPEDEUTICA improved the detection F1-score from 77.54% (conventional\nML method) to 90.25%, and reduced the detection time by 54.86%. Further, the\npercentage of software subjected to DL analysis was approximately 40% on\naverage. Further, the application of delays in software subjected to ML reduced\nthe detection time by approximately 10%. Finally, we found and discussed a\ndiscrepancy between the detection accuracy offline (analysis after all traces\nare collected) and on-the-fly (analysis in tandem with trace collection). Our\ninsights show that conventional ML and modern DL-based malware detectors in\nisolation cannot meet the needs of efficient and effective malware detection:\nhigh accuracy, low false positive rate, and short classification time.\n", "versions": [{"version": "v1", "created": "Mon, 4 Dec 2017 15:30:03 GMT"}], "update_date": "2017-12-21", "authors_parsed": [["Sun", "Ruimin", ""], ["Yuan", "Xiaoyong", ""], ["He", "Pan", ""], ["Zhu", "Qile", ""], ["Chen", "Aokun", ""], ["Gregio", "Andre", ""], ["Oliveira", "Daniela", ""], ["Li", "Xiaolin", ""]]}, {"id": "1712.01210", "submitter": "Jeffrey Quesnelle", "authors": "Jeffrey Quesnelle", "title": "On the linkability of Zcash transactions", "comments": "5 pages, 9 figures, 1 appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Zcash is a fork of Bitcoin with optional anonymity features. While\ntransparent transactions are fully linkable, shielded transactions use\nzero-knowledge proofs to obscure the parties and amounts of the transactions.\nFirst, we observe various metrics regarding the usage of shielded addresses.\nMoreover, we show that most coins sent to shielded addresses are later sent\nback to transparent addresses. We then search for round-trip transactions,\nwhere the same, or nearly the same number of coins are sent from a transparent\naddress, to a shielded address, and back again to a transparent address. We\nargue that such behavior exhibits high linkability, especially when they occur\nnearby temporally. Using this heuristic our analysis matched 31.5% of all coins\nsent to shielded addresses.\n", "versions": [{"version": "v1", "created": "Mon, 4 Dec 2017 17:29:07 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Quesnelle", "Jeffrey", ""]]}, {"id": "1712.01214", "submitter": "Saurabh Bagchi", "authors": "Shreyas Sen, Jinkyu Koo and Saurabh Bagchi", "title": "TRIFECTA: Security, Energy-Efficiency, and Communication Capacity\n  Comparison for Wireless IoT Devices", "comments": "Awaiting publication in IEEE Internet Computing magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The widespread proliferation of sensor nodes in the era of Internet of Things\n(IoT) coupled with increasing sensor fidelity and data acquisition modality is\nexpected to generate 3+ Exabytes of data per day by 2018. Since most of these\nIoT devices will be wirelessly connected at the last few feet, wireless\ncommunication is an integral part of the future IoT scenario. The\never-shrinking size of unit computation (Moore's Law) and continued\nimprovements in efficient communication (Shannon's Law) is expected to harness\nthe true potential of the IoT revolution and produce dramatic societal impact.\nHowever, reducing size of IoT nodes and lack of significant improvement in\nenergy-storage density leads to reducing energy-availability. Moreover, smaller\nsize and energy means less resources available for securing IoT nodes, making\nthe energy-sparse low-cost leaf nodes of the network as prime targets for\nattackers. In this paper, we survey six prominent wireless technologies with\nrespect to the three dimensions - security, energy efficiency, and\ncommunication capacity. We point out the state-of-the-art, open issues, and the\nroad ahead for promising research directions.\n", "versions": [{"version": "v1", "created": "Thu, 23 Nov 2017 01:42:33 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Sen", "Shreyas", ""], ["Koo", "Jinkyu", ""], ["Bagchi", "Saurabh", ""]]}, {"id": "1712.01448", "submitter": "Georgios Bakirtzis", "authors": "Georgios Bakirtzis, Bryan T. Carter, Cody H. Fleming, Carl R. Elks", "title": "MISSION AWARE: Evidence-Based, Mission-Centric Cybersecurity Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently, perimeter-based approaches are the mainstay of cybersecurity.\nWhile this paradigm is necessary, there is mounting evidence of its\ninsufficiency with respect to sophisticated and coordinated attacks. In\ncontrast to perimeter-based security, mission-centric cybersecurity provides\nawareness of how attacks can influence mission success and therefore focuses\nresources for mitigating vulnerabilities and protecting critical assets. This\nis strategic as opposed to tactical perimeter-based cybersecurity. We propose\nMISSION AWARE, which assists in the identification of parts of a system that\ndestabilize the overall mission of the system if compromised. MSSION AWARE\nstarts with a structured elicitation process that leads to hazards analysis. It\nemploys hierarchical modeling methods to capture mission requirements,\nadmissible functional behaviors, and system architectures. It then generates\nevidence---attacks applicable to elements that directly correlate with mission\nsuccess. Finally, MISSION AWARE traces evidence back to mission requirements to\ndetermine the evidence with the highest impact relative to mission objectives.\n", "versions": [{"version": "v1", "created": "Tue, 5 Dec 2017 02:30:05 GMT"}], "update_date": "2017-12-06", "authors_parsed": [["Bakirtzis", "Georgios", ""], ["Carter", "Bryan T.", ""], ["Fleming", "Cody H.", ""], ["Elks", "Carl R.", ""]]}, {"id": "1712.01524", "submitter": "Janardhan Kulkarni", "authors": "Bolin Ding, Janardhan Kulkarni, Sergey Yekhanin", "title": "Collecting Telemetry Data Privately", "comments": "To appear in NIPS 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The collection and analysis of telemetry data from users' devices is\nroutinely performed by many software companies. Telemetry collection leads to\nimproved user experience but poses significant risks to users' privacy. Locally\ndifferentially private (LDP) algorithms have recently emerged as the main tool\nthat allows data collectors to estimate various population statistics, while\npreserving privacy. The guarantees provided by such algorithms are typically\nvery strong for a single round of telemetry collection, but degrade rapidly\nwhen telemetry is collected regularly. In particular, existing LDP algorithms\nare not suitable for repeated collection of counter data such as daily app\nusage statistics. In this paper, we develop new LDP mechanisms geared towards\nrepeated collection of counter data, with formal privacy guarantees even after\nbeing executed for an arbitrarily long period of time. For two basic analytical\ntasks, mean estimation and histogram estimation, our LDP mechanisms for\nrepeated data collection provide estimates with comparable or even the same\naccuracy as existing single-round LDP collection mechanisms. We conduct\nempirical evaluation on real-world counter datasets to verify our theoretical\nresults. Our mechanisms have been deployed by Microsoft to collect telemetry\nacross millions of devices.\n", "versions": [{"version": "v1", "created": "Tue, 5 Dec 2017 08:32:18 GMT"}], "update_date": "2017-12-06", "authors_parsed": [["Ding", "Bolin", ""], ["Kulkarni", "Janardhan", ""], ["Yekhanin", "Sergey", ""]]}, {"id": "1712.01598", "submitter": "Chuadhry Mujeeb Ahmed", "authors": "Chuadhry Mujeeb Ahmed, Aditya Mathur and Martin Ochoa", "title": "NoiSense: Detecting Data Integrity Attacks on Sensor Measurements using\n  Hardware based Fingerprints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years fingerprinting of various physical and logical devices has\nbeen proposed with the goal of uniquely identifying users or devices of\nmainstream IT systems such as PCs, Laptops and smart phones. On the other hand,\nthe application of such techniques in Cyber-Physical Systems (CPS) is less\nexplored due to various reasons, such as difficulty of direct access to\ncritical systems and the cost involved in faithfully reproducing realistic\nscenarios. In this work we evaluate the feasibility of using fingerprinting\ntechniques in the context of realistic Industrial Control Systems related to\nwater treatment and distribution. Based on experiments conducted with 44\nsensors of six different types, it is shown that noise patterns due to\nmicroscopic imperfections in hardware manufacturing can be used to uniquely\nidentify sensors in a CPS with up to 97% accuracy. The proposed technique can\nbe used in to detect physical attacks, such as the replacement of legitimate\nsensors by faulty or manipulated sensors. We also show that, unexpectedly,\nsensor fingerprinting can effectively detect advanced physical attacks such as\nanalog sensor spoofing due to variations in received energy at the transducer\nof an active sensor. Also, it can be leveraged to construct a novel\nchallenge-response protocol that exposes cyber-attacks.\n", "versions": [{"version": "v1", "created": "Tue, 5 Dec 2017 12:18:50 GMT"}], "update_date": "2017-12-06", "authors_parsed": [["Ahmed", "Chuadhry Mujeeb", ""], ["Mathur", "Aditya", ""], ["Ochoa", "Martin", ""]]}, {"id": "1712.01611", "submitter": "Soubhagya Sutar", "authors": "Soubhagya Sutar, Arnab Raha, and Vijay Raghunathan", "title": "Memory-based Combination PUFs for Device Authentication in Embedded\n  Systems", "comments": "7 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Embedded systems play a crucial role in fueling the growth of the\nInternet-of-Things (IoT) in application domains such as healthcare, home\nautomation, transportation, etc. However, their increasingly network-connected\nnature, coupled with their ability to access potentially sensitive/confidential\ninformation, has given rise to many security and privacy concerns. An\nadditional challenge is the growing number of counterfeit components in these\ndevices, resulting in serious reliability and financial implications.\nPhysically Unclonable Functions (PUFs) are a promising security primitive to\nhelp address these concerns. Memory-based PUFs are particularly attractive as\nthey require minimal or no additional hardware for their operation. However,\ncurrent memory-based PUFs utilize only a single memory technology for\nconstructing the PUF, which has several disadvantages including making them\nvulnerable to security attacks. In this paper, we propose the design of a new\nmemory-based combination PUF that intelligently combines two memory\ntechnologies, SRAM and DRAM, to overcome these shortcomings. The proposed\ncombination PUF exhibits high entropy, supports a large number of\nchallenge-response pairs, and is intrinsically reconfigurable. We have\nimplemented the proposed combination PUF using a Terasic TR4-230 FPGA board and\nseveral off-the-shelf SRAMs and DRAMs. Experimental results demonstrate\nsubstantial improvements over current memory-based PUFs including the ability\nto resist various attacks. Extensive authentication tests across a wide\ntemperature range (20 - 60 deg. Celsius) and accelerated aging (12 months)\ndemonstrate the robustness of the proposed design, which achieves a 100%\ntrue-positive rate and 0% false-positive rate for authentication across these\nparameter ranges.\n", "versions": [{"version": "v1", "created": "Tue, 5 Dec 2017 13:13:29 GMT"}], "update_date": "2017-12-06", "authors_parsed": [["Sutar", "Soubhagya", ""], ["Raha", "Arnab", ""], ["Raghunathan", "Vijay", ""]]}, {"id": "1712.01785", "submitter": "Kexin Pei", "authors": "Kexin Pei, Yinzhi Cao, Junfeng Yang, Suman Jana", "title": "Towards Practical Verification of Machine Learning: The Case of Computer\n  Vision Systems", "comments": "16 pages, 11 tables, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the increasing usage of machine learning (ML) techniques in security-\nand safety-critical domains, such as autonomous systems and medical diagnosis,\nensuring correct behavior of ML systems, especially for different corner cases,\nis of growing importance. In this paper, we propose a generic framework for\nevaluating security and robustness of ML systems using different real-world\nsafety properties. We further design, implement and evaluate VeriVis, a\nscalable methodology that can verify a diverse set of safety properties for\nstate-of-the-art computer vision systems with only blackbox access. VeriVis\nleverage different input space reduction techniques for efficient verification\nof different safety properties. VeriVis is able to find thousands of safety\nviolations in fifteen state-of-the-art computer vision systems including ten\nDeep Neural Networks (DNNs) such as Inception-v3 and Nvidia's Dave self-driving\nsystem with thousands of neurons as well as five commercial third-party vision\nAPIs including Google vision and Clarifai for twelve different safety\nproperties. Furthermore, VeriVis can successfully verify local safety\nproperties, on average, for around 31.7% of the test images. VeriVis finds up\nto 64.8x more violations than existing gradient-based methods that, unlike\nVeriVis, cannot ensure non-existence of any violations. Finally, we show that\nretraining using the safety violations detected by VeriVis can reduce the\naverage number of violations up to 60.2%.\n", "versions": [{"version": "v1", "created": "Tue, 5 Dec 2017 17:49:18 GMT"}, {"version": "v2", "created": "Wed, 6 Dec 2017 21:30:44 GMT"}, {"version": "v3", "created": "Sat, 16 Dec 2017 00:30:53 GMT"}], "update_date": "2017-12-19", "authors_parsed": [["Pei", "Kexin", ""], ["Cao", "Yinzhi", ""], ["Yang", "Junfeng", ""], ["Jana", "Suman", ""]]}, {"id": "1712.01939", "submitter": "Fehmi Jaafar", "authors": "Darine Ameyed, Fehmi Jaafar, and Jaouhar Fattahi", "title": "A Slow Read attack Using Cloud", "comments": "Electronics, Computers and Artificial Intelligence (ECAI), 2015 7th\n  International Conference on Electronics, Computers and Artificial\n  Intelligence (ECAI)", "journal-ref": null, "doi": "10.1109/ECAI.2015.7301202", "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Cloud computing relies on sharing computing resources rather than having\nlocal servers or personal devices to handle applications. Nowadays, cloud\ncomputing has become one of the fastest growing fields in information\ntechnology. However, several new security issues of cloud computing have\nemerged due to its service delivery models. In this paper, we discuss the case\nof distributed denial-of-service (DDoS) attack using Cloud resources. First, we\nshow how such attack using a cloud platform could not be detected by previous\ntechniques. Then we present a tricky solution based on the cloud as well.\n", "versions": [{"version": "v1", "created": "Tue, 5 Dec 2017 21:41:00 GMT"}], "update_date": "2017-12-07", "authors_parsed": [["Ameyed", "Darine", ""], ["Jaafar", "Fehmi", ""], ["Fattahi", "Jaouhar", ""]]}, {"id": "1712.02084", "submitter": "Pierre-Francois Marteau", "authors": "Pierre-Fran\\c{c}ois Marteau (EXPRESSION)", "title": "Sequence Covering for Efficient Host-Based Intrusion Detection", "comments": null, "journal-ref": null, "doi": "10.1109/TIFS.2018.2868614", "report-no": null, "categories": "cs.CR cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a new similarity measure, the covering similarity, that\nwe formally define for evaluating the similarity between a symbolic sequence\nand a set of symbolic sequences. A pair-wise similarity can also be directly\nderived from the covering similarity to compare two symbolic sequences. An\nefficient implementation to compute the covering similarity is proposed that\nuses a suffix tree data-structure, but other implementations, based on suffix\narray for instance, are possible and possibly necessary for handling large\nscale problems. We have used this similarity to isolate attack sequences from\nnormal sequences in the scope of Host-based Intrusion Detection. We have\nassessed the covering similarity on two well-known benchmarks in the field. In\nview of the results reported on these two datasets for the state of the art\nmethods, and according to the comparative study we have carried out based on\nthree challenging similarity measures commonly used for string processing or in\nbioinformatics, we show that the covering similarity is particularly relevant\nto address the detection of anomalies in sequences of system calls\n", "versions": [{"version": "v1", "created": "Wed, 6 Dec 2017 08:49:42 GMT"}, {"version": "v2", "created": "Fri, 24 Aug 2018 09:58:49 GMT"}], "update_date": "2018-10-30", "authors_parsed": [["Marteau", "Pierre-François", "", "EXPRESSION"]]}, {"id": "1712.02104", "submitter": "Siming Wan", "authors": "Feng Shu, Siming Wan, Shihao Yan, Qian Wang, Yongpeng Wu, Riqing Chen,\n  Jun Li, and Jinhui Lu", "title": "Secure Directional Modulation to Enhance Physical Layer Security in IoT\n  Networks", "comments": "9 pages, 12 figures, IoT", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, an adaptive and robust null-space projection (AR-NSP) scheme is\nproposed for secure transmission with artificial noise (AN)-aided directional\nmodulation (DM) in wireless networks. The proposed scheme is carried out in\nthree steps. Firstly, the directions of arrival (DOAs) of the signals from the\ndesired user and eavesdropper are estimated by the Root Multiple Signal\nClassificaiton (Root-MUSIC) algorithm and the related signal-to-noise ratios\n(SNRs) are estimated based on the ratio of the corresponding eigenvalue to the\nminimum eigenvalue of the covariance matrix of the received signals. In the\nsecond step, the value intervals of DOA estimation errors are predicted based\non the DOA and SNR estimations. Finally, a robust NSP beamforming DM system is\ndesigned according to the afore-obtained estimations and predictions. Our\nexamination shows that the proposed scheme can significantly outperform the\nconventional non-adaptive robust scheme and non-robust NSP scheme in terms of\nachieving a much lower bit error rate (BER) at the desired user and a much\nhigher secrecy rate (SR). In addition, the BER and SR performance gains\nachieved by the proposed scheme relative to other schemes increase with the\nvalue range of DOA estimation error.\n", "versions": [{"version": "v1", "created": "Wed, 6 Dec 2017 09:43:32 GMT"}, {"version": "v2", "created": "Thu, 25 Jan 2018 03:25:24 GMT"}], "update_date": "2018-01-26", "authors_parsed": [["Shu", "Feng", ""], ["Wan", "Siming", ""], ["Yan", "Shihao", ""], ["Wang", "Qian", ""], ["Wu", "Yongpeng", ""], ["Chen", "Riqing", ""], ["Li", "Jun", ""], ["Lu", "Jinhui", ""]]}, {"id": "1712.02167", "submitter": "Dragoi Vlad", "authors": "Vlad Dragoi and Herv\\'e Tal\\'e Kalachi", "title": "Cryptanalysis of a public key encryption scheme based on QC-LDPC and\n  QC-MDPC codes", "comments": "To be published in IEEE Communications Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This letter presents a cryptanalysis of the modified McEliece cryptosystem\nrecently proposed by Moufek, Guenda and Gulliver [24]. The system is based on\nthe juxtaposition of quasi-cyclic LDPC and quasi-cyclic MDPC codes. The idea of\nour attack is to find an alternative permutation matrix together with an\nequivalent LDPC code which allow the decoding of any cipher-text with a very\nhigh probability. We also apply a recent technique to determine weak keys [4]\nfor this scheme. The results show that the probability of weak keys is high\nenough that this variant can be ruled out as a possible secure encryption\nscheme.\n", "versions": [{"version": "v1", "created": "Wed, 6 Dec 2017 12:57:42 GMT"}], "update_date": "2017-12-07", "authors_parsed": [["Dragoi", "Vlad", ""], ["Kalachi", "Hervé Talé", ""]]}, {"id": "1712.02193", "submitter": "Emiliano De Cristofaro", "authors": "Alexandros Mittos and Bradley Malin and Emiliano De Cristofaro", "title": "Systematizing Genome Privacy Research: A Privacy-Enhancing Technologies\n  Perspective", "comments": "To appear in the Proceedings on Privacy Enhancing Technologies\n  (PoPETs), Vol. 2019, Issue 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rapid advances in human genomics are enabling researchers to gain a better\nunderstanding of the role of the genome in our health and well-being,\nstimulating hope for more effective and cost efficient healthcare. However,\nthis also prompts a number of security and privacy concerns stemming from the\ndistinctive characteristics of genomic data. To address them, a new research\ncommunity has emerged and produced a large number of publications and\ninitiatives.\n  In this paper, we rely on a structured methodology to contextualize and\nprovide a critical analysis of the current knowledge on privacy-enhancing\ntechnologies used for testing, storing, and sharing genomic data, using a\nrepresentative sample of the work published in the past decade. We identify and\ndiscuss limitations, technical challenges, and issues faced by the community,\nfocusing in particular on those that are inherently tied to the nature of the\nproblem and are harder for the community alone to address. Finally, we report\non the importance and difficulty of the identified challenges based on an\nonline survey of genome data privacy experts\n", "versions": [{"version": "v1", "created": "Wed, 6 Dec 2017 14:22:57 GMT"}, {"version": "v2", "created": "Fri, 17 Aug 2018 16:10:31 GMT"}], "update_date": "2018-08-20", "authors_parsed": [["Mittos", "Alexandros", ""], ["Malin", "Bradley", ""], ["De Cristofaro", "Emiliano", ""]]}, {"id": "1712.02217", "submitter": "Yang Luo", "authors": "Yang Luo, Qixun Zhang, Qingni Shen, Hongzhi Liu, Zhonghai Wu", "title": "Android Multi-Level System Permission Management Approach", "comments": "9 pages, in Chinese, 3 figures", "journal-ref": "Ruan Jian Xue Bao/Journal of Software, 2015, 26(Suppl.(2)):\n  263-271", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the expansion of the market share occupied by the Android platform,\nsecurity issues (especially application security) have become attention focus\nof researchers. In fact, the existing methods lack the capabilities to manage\napplication permissions without root privilege. This study proposes a dynamic\nmanagement mechanism of Android application permissions based on security\npolicies. The paper first describes the permissions by security policies, then\nimplementes permission checking code and request evaluation algorithm in\nAndroid framework layer. Experimental results indicate that the presented\napproach succeeds in permission management of Android applications, and its\nsystem overhead is low, which makes it an effective method for Android\npermission management.\n", "versions": [{"version": "v1", "created": "Wed, 6 Dec 2017 15:04:05 GMT"}], "update_date": "2017-12-07", "authors_parsed": [["Luo", "Yang", ""], ["Zhang", "Qixun", ""], ["Shen", "Qingni", ""], ["Liu", "Hongzhi", ""], ["Wu", "Zhonghai", ""]]}, {"id": "1712.02328", "submitter": "Omid Poursaeed", "authors": "Omid Poursaeed, Isay Katsman, Bicheng Gao, Serge Belongie", "title": "Generative Adversarial Perturbations", "comments": "CVPR 2018, camera-ready version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CR cs.LG cs.NE stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose novel generative models for creating adversarial\nexamples, slightly perturbed images resembling natural images but maliciously\ncrafted to fool pre-trained models. We present trainable deep neural networks\nfor transforming images to adversarial perturbations. Our proposed models can\nproduce image-agnostic and image-dependent perturbations for both targeted and\nnon-targeted attacks. We also demonstrate that similar architectures can\nachieve impressive results in fooling classification and semantic segmentation\nmodels, obviating the need for hand-crafting attack methods for each task.\nUsing extensive experiments on challenging high-resolution datasets such as\nImageNet and Cityscapes, we show that our perturbations achieve high fooling\nrates with small perturbation norms. Moreover, our attacks are considerably\nfaster than current iterative methods at inference time.\n", "versions": [{"version": "v1", "created": "Wed, 6 Dec 2017 18:52:12 GMT"}, {"version": "v2", "created": "Wed, 4 Apr 2018 01:18:08 GMT"}, {"version": "v3", "created": "Fri, 6 Jul 2018 06:50:03 GMT"}], "update_date": "2018-07-09", "authors_parsed": [["Poursaeed", "Omid", ""], ["Katsman", "Isay", ""], ["Gao", "Bicheng", ""], ["Belongie", "Serge", ""]]}, {"id": "1712.02483", "submitter": "Mozhgan Azimpourkivi", "authors": "Mozhgan Azimpourkivi, Umut Topkara, Bogdan Carbunar", "title": "A Secure Mobile Authentication Alternative to Biometrics", "comments": "14 pages", "journal-ref": "Annual Computer Security Applications Conference (ACSAC) 2017", "doi": "10.1145/3134600.3134619", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biometrics are widely used for authentication in consumer devices and\nbusiness settings as they provide sufficiently strong security, instant\nverification and convenience for users. However, biometrics are hard to keep\nsecret, stolen biometrics pose lifelong security risks to users as they cannot\nbe reset and re-issued, and transactions authenticated by biometrics across\ndifferent systems are linkable and traceable back to the individual identity.\nIn addition, their cost-benefit analysis does not include personal implications\nto users, who are least prepared for the imminent negative outcomes, and are\nnot often given equally convenient alternative authentication options.\n  We introduce ai.lock, a secret image based authentication method for mobile\ndevices which uses an imaging sensor to reliably extract authentication\ncredentials similar to biometrics. Despite lacking the regularities of\nbiometric image features, we show that ai.lock consistently extracts features\nacross authentication attempts from general user captured images, to\nreconstruct credentials that can match and exceed the security of biometrics\n(EER = 0.71%). ai.lock only stores a hash of the object's image. We measure the\nsecurity of ai.lock against brute force attacks on more than 3.5 billion\nauthentication instances built from more than 250,000 images of real objects,\nand 100,000 synthetically generated images using a generative adversarial\nnetwork trained on object images. We show that the ai.lock Shannon entropy is\nsuperior to a fingerprint based authentication built into popular mobile\ndevices.\n", "versions": [{"version": "v1", "created": "Thu, 7 Dec 2017 03:42:36 GMT"}, {"version": "v2", "created": "Tue, 21 Aug 2018 16:45:07 GMT"}], "update_date": "2018-08-22", "authors_parsed": [["Azimpourkivi", "Mozhgan", ""], ["Topkara", "Umut", ""], ["Carbunar", "Bogdan", ""]]}, {"id": "1712.02529", "submitter": "Mark Scanlon", "authors": "Mark Scanlon", "title": "Enabling the Remote Acquisition of Digital Forensic Evidence through\n  Secure Data Transmission and Verification", "comments": "A Thesis submitted in 2009 to the National University of Ireland,\n  Dublin for the degree of M.Sc. (Research) in the School of Computer Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Providing the ability to any law enforcement officer to remotely transfer an\nimage from any suspect computer directly to a forensic laboratory for analysis,\ncan only help to greatly reduce the time wasted by forensic investigators in\nconducting on-site collection of computer equipment. RAFT (Remote Acquisition\nForensic Tool) is a system designed to facilitate forensic investigators by\nremotely gathering digital evidence. This is achieved through the\nimplementation of a secure, verifiable client/server imaging architecture. The\nRAFT system is designed to be relatively easy to use, requiring minimal\ntechnical knowledge on behalf of the user. One of the key focuses of RAFT is to\nensure that the evidence it gathers remotely is court admissible. This is\nachieved by ensuring that the image taken using RAFT is verified to be\nidentical to the original evidence on a suspect computer.\n", "versions": [{"version": "v1", "created": "Thu, 7 Dec 2017 08:10:05 GMT"}], "update_date": "2017-12-08", "authors_parsed": [["Scanlon", "Mark", ""]]}, {"id": "1712.02549", "submitter": "Nicolas Ruiz", "authors": "Nicolas Ruiz", "title": "A multiplicative masking method for preserving the skewness of the\n  original micro-records", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Masking methods for the safe dissemination of microdata consist of distorting\nthe original data while preserving a pre-defined set of statistical properties\nin the microdata. For continuous variables, available methodologies rely\nessentially on matrix masking and in particular on adding noise to the original\nvalues, using more or less refined procedures depending on the extent of\ninformation that one seeks to preserve. Almost all of these methods make use of\nthe critical assumption that the original datasets follow a normal distribution\nand/or that the noise has such a distribution. This assumption is, however,\nrestrictive in the sense that few variables follow empirically a Gaussian\npattern: the distribution of household income, for example, is positively\nskewed, and this skewness is essential information that has to be considered\nand preserved. This paper addresses these issues by presenting a simple\nmultiplicative masking method that preserves skewness of the original data\nwhile offering a sufficient level of disclosure risk control. Numerical\nexamples are provided, leading to the suggestion that this method could be\nwell-suited for the dissemination of a broad range of microdata, including\nthose based on administrative and business records.\n", "versions": [{"version": "v1", "created": "Thu, 7 Dec 2017 09:30:12 GMT"}], "update_date": "2017-12-08", "authors_parsed": [["Ruiz", "Nicolas", ""]]}, {"id": "1712.02557", "submitter": "Nicolas Ruiz", "authors": "Nicolas Ruiz", "title": "A general cipher for individual data anonymization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the years, the literature on individual data anonymization has burgeoned\nin many directions. Borrowing from several areas of other sciences, the current\ndiversity of concepts, models and tools available contributes to understanding\nand fostering individual data dissemination in a privacy-preserving way, as\nwell as unleashing new sources of information for the benefits of society at\nlarge. However, such diversity doesn't come without some difficulties.\nCurrently, the task of selecting the optimal analytical environment to conduct\nanonymization is complicated by the multitude of available choices. Based on\nrecent contributions from the literature and inspired by cryptography, this\npaper proposes the first cipher for data anonymization. The functioning of this\ncipher shows that, in fact, every anonymization method can be viewed as a\ngeneral form of rank swapping with unconstrained permutation structures. Beyond\nall the currently existing methods that it can mimic, this cipher offers a new\nway to practice data anonymization, notably by performing anonymization in an\nex ante way, instead of being engaged in several ex post evaluations and\niterations to reach the protection and information properties sought after.\nMoreover, the properties of this cipher point to some previously unknown\ngeneral insights into the task of data anonymization considered at a general\nlevel of functioning. Finally, and to make the cipher operational, this paper\nproposes the introduction of permutation menus in data anonymization, where\nrecently developed universal measures of disclosure risk and information loss\nare used ex ante for the calibration of permutation keys. To justify the\nrelevance of their uses, a theoretical characterization of these measures is\nalso proposed.\n", "versions": [{"version": "v1", "created": "Thu, 7 Dec 2017 10:29:03 GMT"}], "update_date": "2017-12-08", "authors_parsed": [["Ruiz", "Nicolas", ""]]}, {"id": "1712.02617", "submitter": "Piotr Tysowski", "authors": "Piotr K. Tysowski, Xinhua Ling, Norbert L\\\"utkenhaus, Michele Mosca", "title": "The Engineering of a Scalable Multi-Site Communications System Utilizing\n  Quantum Key Distribution (QKD)", "comments": null, "journal-ref": null, "doi": "10.1088/2058-9565/aa9a5d", "report-no": null, "categories": "cs.CR cs.NI quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum Key Distribution (QKD) is a means of generating keys between a pair\nof computing hosts that is theoretically secure against cryptanalysis, even by\na quantum computer. Although there is much active research into improving the\nQKD technology itself, there is still significant work to be done to apply\nengineering methodology and determine how it can be practically built to scale\nwithin an enterprise IT environment. Significant challenges exist in building a\npractical key management service for use in a metropolitan network. QKD is\ngenerally a point-to-point technique only and is subject to steep performance\nconstraints. The integration of QKD into enterprise-level computing has been\nresearched, to enable quantum-safe communication. A novel method for\nconstructing a key management service is presented that allows arbitrary\ncomputing hosts on one site to establish multiple secure communication sessions\nwith the hosts of another site. A key exchange protocol is proposed where\nsymmetric private keys are granted to hosts while satisfying the scalability\nneeds of an enterprise population of users. The key management service operates\nwithin a layered architectural style that is able to interoperate with various\nunderlying QKD implementations. Variable levels of security for the host\npopulation are enforced through a policy engine. A network layer provides key\ngeneration across a network of nodes connected by quantum links. Scheduling and\nrouting functionality allows quantum key material to be relayed across trusted\nnodes. Optimizations are performed to match the real-time host demand for key\nmaterial with the capacity afforded by the infrastructure. The result is a\nflexible and scalable architecture that is suitable for enterprise use and\nindependent of any specific QKD technology.\n", "versions": [{"version": "v1", "created": "Thu, 7 Dec 2017 13:47:13 GMT"}], "update_date": "2017-12-08", "authors_parsed": [["Tysowski", "Piotr K.", ""], ["Ling", "Xinhua", ""], ["Lütkenhaus", "Norbert", ""], ["Mosca", "Michele", ""]]}, {"id": "1712.02875", "submitter": "Irina Pashchenko", "authors": "Irina Pashchenko", "title": "One More Way to Encrypt a Message", "comments": "33 pages, 5 formulas, 3 C++ programs", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work describes an example of an application of a novel method for\nsymmetric cryptography. Its purpose is to show how a regular message can be\nencrypted and then decrypted in an easy, yet secure way. The encrypting method\nintroduced in this work is different from others because it involves decimals\nas well as integers, encrypting the same initial message differently every\ntime, and inserting misleading digits into every encrypted message, thus making\nthe task of breaking the code even harder. A C++ program was written to support\neach chapter.\n", "versions": [{"version": "v1", "created": "Thu, 7 Dec 2017 22:06:18 GMT"}], "update_date": "2017-12-11", "authors_parsed": [["Pashchenko", "Irina", ""]]}, {"id": "1712.02969", "submitter": "Ali Dorri", "authors": "Ali Dorri, Salil S. Kanhere, Raja Jurdak, Praveen Gauravaram", "title": "LSB: A Lightweight Scalable BlockChain for IoT Security and Privacy", "comments": null, "journal-ref": "Journal of Parallel and Distributed Computing Volume 134, December\n  2019, Pages 180-197", "doi": "10.1016/j.jpdc.2019.08.005", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BlockChain (BC) has attracted tremendous attention due to its immutable\nnature and the associated security and privacy benefits. BC has the potential\nto overcome security and privacy challenges of Internet of Things (IoT).\nHowever, BC is computationally expensive, has limited scalability and incurs\nsignificant bandwidth overheads and delays which are not suited to the IoT\ncontext. We propose a tiered Lightweight Scalable BC (LSB) that is optimized\nfor IoT requirements. We explore LSB in a smart home setting as a\nrepresentative example for broader IoT applications. Low resource devices in a\nsmart home benefit from a centralized manager that establishes shared keys for\ncommunication and processes all incoming and outgoing requests. LSB achieves\ndecentralization by forming an overlay network where high resource devices\njointly manage a public BC that ensures end-to-end privacy and security. The\noverlay is organized as distinct clusters to reduce overheads and the cluster\nheads are responsible for managing the public BC. LSB incorporates several\noptimizations which include algorithms for lightweight consensus, distributed\ntrust and throughput management. Qualitative arguments demonstrate that LSB is\nresilient to several security attacks. Extensive simulations show that LSB\ndecreases packet overhead and delay and increases BC scalability compared to\nrelevant baselines.\n", "versions": [{"version": "v1", "created": "Fri, 8 Dec 2017 07:40:35 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Dorri", "Ali", ""], ["Kanhere", "Salil S.", ""], ["Jurdak", "Raja", ""], ["Gauravaram", "Praveen", ""]]}, {"id": "1712.03031", "submitter": "Thomas Hupperich", "authors": "Thomas Hupperich, Dennis Tatang, Nicolai Wilkop, Thorsten Holz", "title": "An Empirical Study on Price Differentiation Based on System Fingerprints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Price differentiation describes a marketing strategy to determine the price\nof goods on the basis of a potential customer's attributes like location,\nfinancial status, possessions, or behavior. Several cases of online price\ndifferentiation have been revealed in recent years. For example, different\npricing based on a user's location was discovered for online office supply\nchain stores and there were indications that offers for hotel rooms are priced\nhigher for Apple users compared to Windows users at certain online booking\nwebsites. One potential source for relevant distinctive features are\n\\emph{system fingerprints}, i.\\,e., a technique to recognize users' systems by\nidentifying unique attributes such as the source IP address or system\nconfiguration. In this paper, we shed light on the ecosystem of pricing at\nonline platforms and aim to detect if and how such platform providers make use\nof price differentiation based on digital system fingerprints. We designed and\nimplemented an automated price scanner capable of disguising itself as an\narbitrary system, leveraging real-world system fingerprints, and searched for\nprice differences related to different features (e.\\,g., user location,\nlanguage setting, or operating system). This system allows us to explore price\ndifferentiation cases and expose those characteristic features of a system that\nmay influence a product's price.\n", "versions": [{"version": "v1", "created": "Fri, 8 Dec 2017 11:24:10 GMT"}], "update_date": "2017-12-11", "authors_parsed": [["Hupperich", "Thomas", ""], ["Tatang", "Dennis", ""], ["Wilkop", "Nicolai", ""], ["Holz", "Thorsten", ""]]}, {"id": "1712.03141", "submitter": "Battista Biggio", "authors": "Battista Biggio and Fabio Roli", "title": "Wild Patterns: Ten Years After the Rise of Adversarial Machine Learning", "comments": "Accepted for publication on Pattern Recognition, 2018", "journal-ref": null, "doi": "10.1016/j.patcog.2018.07.023", "report-no": null, "categories": "cs.CV cs.CR cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Learning-based pattern classifiers, including deep networks, have shown\nimpressive performance in several application domains, ranging from computer\nvision to cybersecurity. However, it has also been shown that adversarial input\nperturbations carefully crafted either at training or at test time can easily\nsubvert their predictions. The vulnerability of machine learning to such wild\npatterns (also referred to as adversarial examples), along with the design of\nsuitable countermeasures, have been investigated in the research field of\nadversarial machine learning. In this work, we provide a thorough overview of\nthe evolution of this research area over the last ten years and beyond,\nstarting from pioneering, earlier work on the security of non-deep learning\nalgorithms up to more recent work aimed to understand the security properties\nof deep learning algorithms, in the context of computer vision and\ncybersecurity tasks. We report interesting connections between these\napparently-different lines of work, highlighting common misconceptions related\nto the security evaluation of machine-learning algorithms. We review the main\nthreat models and attacks defined to this end, and discuss the main limitations\nof current work, along with the corresponding future challenges towards the\ndesign of more secure learning algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 8 Dec 2017 15:59:41 GMT"}, {"version": "v2", "created": "Thu, 19 Jul 2018 08:27:23 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Biggio", "Battista", ""], ["Roli", "Fabio", ""]]}, {"id": "1712.03158", "submitter": "Thijs Laarhoven", "authors": "Thijs Laarhoven", "title": "Graph-based time-space trade-offs for approximate near neighbors", "comments": "26 pages, 4 figures", "journal-ref": "34th International Symposium on Computational Geometry (SoCG), pp.\n  57:1-57:14, 2018", "doi": "10.4230/LIPIcs.SoCG.2018.57", "report-no": null, "categories": "cs.DS cs.CC cs.CG cs.CR cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We take a first step towards a rigorous asymptotic analysis of graph-based\napproaches for finding (approximate) nearest neighbors in high-dimensional\nspaces, by analyzing the complexity of (randomized) greedy walks on the\napproximate near neighbor graph. For random data sets of size $n = 2^{o(d)}$ on\nthe $d$-dimensional Euclidean unit sphere, using near neighbor graphs we can\nprovably solve the approximate nearest neighbor problem with approximation\nfactor $c > 1$ in query time $n^{\\rho_q + o(1)}$ and space $n^{1 + \\rho_s +\no(1)}$, for arbitrary $\\rho_q, \\rho_s \\geq 0$ satisfying \\begin{align} (2c^2 -\n1) \\rho_q + 2 c^2 (c^2 - 1) \\sqrt{\\rho_s (1 - \\rho_s)} \\geq c^4. \\end{align}\nGraph-based near neighbor searching is especially competitive with hash-based\nmethods for small $c$ and near-linear memory, and in this regime the asymptotic\nscaling of a greedy graph-based search matches the recent optimal hash-based\ntrade-offs of Andoni-Laarhoven-Razenshteyn-Waingarten [SODA'17]. We further\nstudy how the trade-offs scale when the data set is of size $n =\n2^{\\Theta(d)}$, and analyze asymptotic complexities when applying these results\nto lattice sieving.\n", "versions": [{"version": "v1", "created": "Fri, 8 Dec 2017 16:26:22 GMT"}], "update_date": "2019-10-04", "authors_parsed": [["Laarhoven", "Thijs", ""]]}, {"id": "1712.03163", "submitter": "Valdemar \\v{S}v\\'abensk\\'y", "authors": "Valdemar \\v{S}v\\'abensk\\'y and Jan Vykopal", "title": "Challenges Arising from Prerequisite Testing in Cybersecurity Games", "comments": "ACM SIGCSE 2018 conference, 6 pages, 4 figures, 4 tables", "journal-ref": null, "doi": "10.1145/3159450.3159454", "report-no": null, "categories": "cs.CY cs.CR cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cybersecurity games are an attractive and popular method of active learning.\nHowever, the majority of current games are created for advanced players, which\noften leads to frustration in less experienced learners. Therefore, we decided\nto focus on a diagnostic assessment of participants entering the games. We\nassume that information about the players' knowledge, skills, and experience\nenables tutors or learning environments to suitably assist participants with\ngame challenges and maximize learning in their virtual adventure. In this\npaper, we present a pioneering experiment examining the predictive value of a\nshort quiz and self-assessment for identifying learners' readiness before\nplaying a cybersecurity game. We hypothesized that these predictors would model\nplayers' performance. A linear regression analysis showed that the game\nperformance can be accurately predicted by well-designed prerequisite testing,\nbut not by self-assessment. At the same time, we identified major challenges\nrelated to the design of pretests for cybersecurity games: calibrating test\nquestions with respect to the skills relevant for the game, minimizing the\nquiz's length while maximizing its informative value, and embedding the pretest\nin the game. Our results are relevant for educational researchers and\ncybersecurity instructors of students at all learning levels.\n", "versions": [{"version": "v1", "created": "Fri, 8 Dec 2017 16:36:02 GMT"}], "update_date": "2017-12-11", "authors_parsed": [["Švábenský", "Valdemar", ""], ["Vykopal", "Jan", ""]]}, {"id": "1712.03327", "submitter": "Xinyu Lei", "authors": "Xinyu Lei, Guan-Hua Tu, Alex X. Liu, Kamran Ali, Chi-Yu Li, Tian Xie", "title": "The Insecurity of Home Digital Voice Assistants -- Amazon Alexa as a\n  Case Study", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Home Digital Voice Assistants (HDVAs) are getting popular in recent years.\nUsers can control smart devices and get living assistance through those HDVAs\n(e.g., Amazon Alexa, Google Home) using voice. In this work, we study the\ninsecurity of HDVA service by using Amazon Alexa as a case study. We disclose\nthree security vulnerabilities which root in the insecure access control of\nAlexa services. We then exploit them to devise two proof-of-concept attacks,\nhome burglary and fake order, where the adversary can remotely command the\nvictim's Alexa device to open a door or place an order from Amazon.com. The\ninsecure access control is that the Alexa device not only relies on a\nsingle-factor authentication but also takes voice commands even if no people\nare around. We thus argue that HDVAs should have another authentication factor,\na physical presence based access control; that is, they can accept voice\ncommands only when any person is detected nearby. To this end, we devise a\nVirtual Security Button (VSButton), which leverages the WiFi technology to\ndetect indoor human motions. Once any indoor human motion is detected, the\nAlexa device is enabled to accept voice commands. Our evaluation results show\nthat it can effectively differentiate indoor motions from the cases of no\nmotion and outdoor motions in both the laboratory and real world settings.\n", "versions": [{"version": "v1", "created": "Sat, 9 Dec 2017 01:37:34 GMT"}, {"version": "v2", "created": "Sun, 8 Apr 2018 17:45:26 GMT"}, {"version": "v3", "created": "Tue, 12 Nov 2019 19:26:35 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Lei", "Xinyu", ""], ["Tu", "Guan-Hua", ""], ["Liu", "Alex X.", ""], ["Ali", "Kamran", ""], ["Li", "Chi-Yu", ""], ["Xie", "Tian", ""]]}, {"id": "1712.03405", "submitter": "Mohammad Khodaei", "authors": "Mohammad Khodaei, Andreas Messing, and Panos Papadimitratos", "title": "RHyTHM: A Randomized Hybrid Scheme To Hide in the Mobile Crowd", "comments": "4 pages, 4 figures, IEEE Vehicular Networking Conference (VNC),\n  November 27-29, 2017, Torino, Italy", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Any on-demand pseudonym acquisition strategy is problematic should the\nconnectivity to the credential management infrastructure be intermittent. If a\nvehicle runs out of pseudonyms with no connectivity to refill its pseudonym\npool, one solution is the on-the-fly generation of pseudonyms, e.g., leveraging\nanonymous authentication. However, such a vehicle would stand out in the crowd:\none can simply distinguish pseudonyms, thus signed messages, based on the\npseudonym issuer signature, link them and track the vehicle. To address this\nchallenge, we propose a randomized hybrid scheme, RHyTHM, to enable vehicles to\nremain operational when disconnected without compromising privacy: vehicles\nwith valid pseudonyms help others to enhance their privacy by randomly joining\nthem in using on-the-fly self-certified pseudonyms along with aligned\nlifetimes. This way, the privacy of disconnected users is enhanced with a\nreasonable computational overhead.\n", "versions": [{"version": "v1", "created": "Sat, 9 Dec 2017 15:52:45 GMT"}], "update_date": "2017-12-12", "authors_parsed": [["Khodaei", "Mohammad", ""], ["Messing", "Andreas", ""], ["Papadimitratos", "Panos", ""]]}, {"id": "1712.03455", "submitter": "Mark Scanlon", "authors": "Mark Scanlon", "title": "Study of Peer-to-Peer Network Based Cybercrime Investigation:\n  Application on Botnet Technologies", "comments": "This is a thesis submitted in fulfilment of a PhD in Digital\n  Forensics and Cybercrime Investigation in the School of Computer Science,\n  University College Dublin in October 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The scalable, low overhead attributes of Peer-to-Peer (P2P) Internet\nprotocols and networks lend themselves well to being exploited by criminals to\nexecute a large range of cybercrimes. The types of crimes aided by P2P\ntechnology include copyright infringement, sharing of illicit images of\nchildren, fraud, hacking/cracking, denial of service attacks and virus/malware\npropagation through the use of a variety of worms, botnets, malware, viruses\nand P2P file sharing. This project is focused on study of active P2P nodes\nalong with the analysis of the undocumented communication methods employed in\nmany of these large unstructured networks. This is achieved through the design\nand implementation of an efficient P2P monitoring and crawling toolset. The\nrequirement for investigating P2P based systems is not limited to the more\nobvious cybercrimes listed above, as many legitimate P2P based applications may\nalso be pertinent to a digital forensic investigation, e.g, voice over IP,\ninstant messaging, etc. Investigating these networks has become increasingly\ndifficult due to the broad range of network topologies and the ever increasing\nand evolving range of P2P based applications. In this work we introduce the\nUniversal P2P Network Investigation Framework (UP2PNIF), a framework which\nenables significantly faster and less labour intensive investigation of newly\ndiscovered P2P networks through the exploitation of the commonalities in P2P\nnetwork functionality. In combination with a reference database of known\nnetwork characteristics, it is envisioned that any known P2P network can be\ninstantly investigated using the framework, which can intelligently determine\nthe best investigation methodology and greatly expedite the evidence gathering\nprocess. A proof of concept tool was developed for conducting investigations on\nthe BitTorrent network.\n", "versions": [{"version": "v1", "created": "Sun, 10 Dec 2017 00:18:58 GMT"}], "update_date": "2017-12-12", "authors_parsed": [["Scanlon", "Mark", ""]]}, {"id": "1712.03483", "submitter": "Pedro Silva", "authors": "Pedro Silva, Sepehr Akhavan-Masouleh and Li Li", "title": "Improving Malware Detection Accuracy by Extracting Icon Information", "comments": "Full version. IEEE MIPR 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Detecting PE malware files is now commonly approached using statistical and\nmachine learning models. While these models commonly use features extracted\nfrom the structure of PE files, we propose that icons from these files can also\nhelp better predict malware. We propose an innovative machine learning approach\nto extract information from icons. Our proposed approach consists of two steps:\n1) extracting icon features using summary statics, histogram of gradients\n(HOG), and a convolutional autoencoder, 2) clustering icons based on the\nextracted icon features. Using publicly available data and by using machine\nlearning experiments, we show our proposed icon clusters significantly boost\nthe efficacy of malware prediction models. In particular, our experiments show\nan average accuracy increase of 10% when icon clusters are used in the\nprediction model.\n", "versions": [{"version": "v1", "created": "Sun, 10 Dec 2017 08:15:12 GMT"}], "update_date": "2017-12-12", "authors_parsed": [["Silva", "Pedro", ""], ["Akhavan-Masouleh", "Sepehr", ""], ["Li", "Li", ""]]}, {"id": "1712.03623", "submitter": "David Barrera", "authors": "David Barrera, Ian Molloy, Heqing Huang", "title": "IDIoT: Securing the Internet of Things like it's 1994", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over 20 billion Internet of Things devices are set to come online by 2020.\nProtecting such a large number of underpowered, UI-less, network-connected\ndevices will require a new security paradigm. We argue that solutions dependent\non vendor cooperation such as secure coding and platform changes are unlikely\nto provide adequate defenses for the majority of devices. Similarly, regulation\napproaches face a number implementation challenges which limit their\neffectiveness. As part of the new paradigm, we propose IDIoT, a network\nsecurity policy enforcement framework for IoT devices. IDIoT prevents\nwidespread network attacks by restricting IoT devices to only their necessary\nnetwork behavior. IDIoT is simple and effective, building on decades of\ntried-and-true network security principles without requiring changes to the\ndevices or cloud infrastructure.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 01:58:49 GMT"}], "update_date": "2017-12-12", "authors_parsed": [["Barrera", "David", ""], ["Molloy", "Ian", ""], ["Huang", "Heqing", ""]]}, {"id": "1712.03650", "submitter": "Samira Samadi", "authors": "Samira Samadi, Santosh Vempala, Adam Tauman Kalai", "title": "Usability of Humanly Computable Passwords", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reusing passwords across multiple websites is a common practice that\ncompromises security. Recently, Blum and Vempala have proposed password\nstrategies to help people calculate, in their heads, passwords for different\nsites without dependence on third-party tools or external devices. Thus far,\nthe security and efficiency of these \"mental algorithms\" has been analyzed only\ntheoretically. But are such methods usable? We present the first usability\nstudy of humanly computable password strategies, involving a learning phase (to\nlearn a password strategy), then a rehearsal phase (to login to a few\nwebsites), and multiple follow-up tests. In our user study, with training,\nparticipants were able to calculate a deterministic eight-character password\nfor an arbitrary new website in under 20 seconds.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 05:52:47 GMT"}, {"version": "v2", "created": "Thu, 24 May 2018 21:59:00 GMT"}], "update_date": "2018-05-28", "authors_parsed": [["Samadi", "Samira", ""], ["Vempala", "Santosh", ""], ["Kalai", "Adam Tauman", ""]]}, {"id": "1712.03659", "submitter": "Hoang Dinh Thai DTH", "authors": "Kongrath Suankaewmanee, Dinh Thai Hoang, Dusit Niyato, Suttinee\n  Sawadsitang, Ping Wang, and Zhu Han", "title": "Performance Analysis and Application of Mobile Blockchain", "comments": "6 pages, 10 figures, IEEE ICNC Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile security has become more and more important due to the boom of mobile\ncommerce (m-commerce). However, the development of m-commerce is facing many\nchallenges regarding data security problems. Recently, blockchain has been\nintroduced as an effective security solution deployed successfully in many\napplications in practice, such as, Bitcoin, cloud computing, and\nInternet-of-Things. However, the blockchain technology has not been adopted and\nimplemented widely in m-commerce because its mining processes usually require\nto be performed on standard computing units, e.g., computers. Therefore, in\nthis paper, we introduce a new m-commerce application using blockchain\ntechnology, namely, MobiChain, to secure transactions in the m-commerce.\nEspecially, in the MobiChain application, the mining processes can be executed\nefficiently on mobile devices using our proposed Android core module. Through\nreal experiments, we evaluate the performance of the proposed model and show\nthat blockchain will be an efficient security solution for future m-commerce.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 06:49:40 GMT"}], "update_date": "2017-12-12", "authors_parsed": [["Suankaewmanee", "Kongrath", ""], ["Hoang", "Dinh Thai", ""], ["Niyato", "Dusit", ""], ["Sawadsitang", "Suttinee", ""], ["Wang", "Ping", ""], ["Han", "Zhu", ""]]}, {"id": "1712.03713", "submitter": "Emmanouil Vasilomanolakis", "authors": "Emmanouil Vasilomanolakis, Jan Helge Wolf, Leon B\\\"ock, Shankar\n  Karuppayah, Max M\\\"uhlh\\\"auser", "title": "I Trust my Zombies: A Trust-enabled Botnet", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Defending against botnets has always been a cat and mouse game.\nCyber-security researchers and government agencies attempt to detect and take\ndown botnets by playing the role of the cat. In this context, a lot of work has\nbeen done towards reverse engineering certain variants of malware families as\nwell as understanding the network protocols of botnets to identify their\nweaknesses (if any) and exploit them. While this is necessary, such an approach\noffers the botmasters the ability to quickly counteract the defenders by simply\nperforming small changes in their arsenals.\n  We attempt a different approach by actually taking the role of the Botmaster,\nto eventually anticipate his behavior. That said, in this paper, we present a\nnovel computational trust mechanism for fully distributed botnets that allows\nfor a resilient and stealthy management of the infected machines (zombies). We\nexploit the highly researched area of computational trust to create an\nautonomous mechanism that ensures the avoidance of common botnet tracking\nmechanisms such as sensors and crawlers. In our futuristic botnet, zombies are\nboth smart and cautious. They are cautious in the sense that they are careful\nwith whom they communicate with. Moreover, they are smart enough to learn from\ntheir experiences and infer whether their fellow zombies are indeed who they\nclaim to be and not government agencies' spies. We study different\ncomputational trust models, mainly based on Bayesian inference, to evaluate\ntheir advantages and disadvantages in the context of a distributed botnet.\nFurthermore, we show, via our experimental results, that our approach is\nsignificantly stronger than any technique that has been seen in botnets to\ndate.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 10:46:23 GMT"}], "update_date": "2017-12-12", "authors_parsed": [["Vasilomanolakis", "Emmanouil", ""], ["Wolf", "Jan Helge", ""], ["Böck", "Leon", ""], ["Karuppayah", "Shankar", ""], ["Mühlhäuser", "Max", ""]]}, {"id": "1712.03943", "submitter": "Carlton Shepherd", "authors": "Carlton Shepherd, Raja Naeem Akram, Konstantinos Markantonakis", "title": "EmLog: Tamper-Resistant System Logging for Constrained Devices with TEEs", "comments": "Accepted at the 11th IFIP International Conference on Information\n  Security Theory and Practice (WISTP '17)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Remote mobile and embedded devices are used to deliver increasingly impactful\nservices, such as medical rehabilitation and assistive technologies. Secure\nsystem logging is beneficial in these scenarios to aid audit and forensic\ninvestigations particularly if devices bring harm to end-users. Logs should be\ntamper-resistant in storage, during execution, and when retrieved by a trusted\nremote verifier. In recent years, Trusted Execution Environments (TEEs) have\nemerged as the go-to root of trust on constrained devices for isolated\nexecution of sensitive applications. Existing TEE-based logging systems,\nhowever, focus largely on protecting server-side logs and offer little\nprotection to constrained source devices. In this paper, we introduce EmLog --\na tamper-resistant logging system for constrained devices using the\nGlobalPlatform TEE. EmLog provides protection against complex software\nadversaries and offers several additional security properties over past\nschemes. The system is evaluated across three log datasets using an\noff-the-shelf ARM development board running an open-source,\nGlobalPlatform-compliant TEE. On average, EmLog runs with low run-time memory\noverhead (1MB heap and stack), 430--625 logs/second throughput, and five-times\npersistent storage overhead versus unprotected logs.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 18:49:08 GMT"}, {"version": "v2", "created": "Fri, 15 Dec 2017 16:41:54 GMT"}, {"version": "v3", "created": "Tue, 19 Dec 2017 03:20:19 GMT"}], "update_date": "2017-12-20", "authors_parsed": [["Shepherd", "Carlton", ""], ["Akram", "Raja Naeem", ""], ["Markantonakis", "Konstantinos", ""]]}, {"id": "1712.03947", "submitter": "Vladimir Edemskiy", "authors": "Vladimir Edemskiy", "title": "The linear complexity of new binary cyclotomic sequences of period $p^n$", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we determine the linear complexity of a class of new binary\ncyclotomic sequences of period pn constructed by Z. Xiao et al. (Des. Codes\nCryptogr. DOI 10.1007/s10623-017-0408-7) and prove their conjecture about high\nlinear complexity of these sequences.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 18:53:31 GMT"}], "update_date": "2017-12-13", "authors_parsed": [["Edemskiy", "Vladimir", ""]]}, {"id": "1712.04006", "submitter": "Alexander Bagnall", "authors": "Alexander Bagnall, Razvan Bunescu, Gordon Stewart", "title": "Training Ensembles to Detect Adversarial Examples", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new ensemble method for detecting and classifying adversarial\nexamples generated by state-of-the-art attacks, including DeepFool and C&W. Our\nmethod works by training the members of an ensemble to have low classification\nerror on random benign examples while simultaneously minimizing agreement on\nexamples outside the training distribution. We evaluate on both MNIST and\nCIFAR-10, against oblivious and both white- and black-box adversaries.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 20:30:11 GMT"}], "update_date": "2017-12-13", "authors_parsed": [["Bagnall", "Alexander", ""], ["Bunescu", "Razvan", ""], ["Stewart", "Gordon", ""]]}, {"id": "1712.04130", "submitter": "Michael Erdmann", "authors": "Michael Erdmann", "title": "Topology of Privacy: Lattice Structures and Information Bubbles for\n  Inference and Obfuscation", "comments": "154 pages, 76 figures, main narrative written for a general audience,\n  detailed proofs in appendices", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information has intrinsic geometric and topological structure, arising from\nrelative relationships beyond absolute values or types. For instance, the fact\nthat two people share a meal describes a relationship independent of the meal's\ningredients. Multiple such relationships give rise to relations and their\nlattices. Lattices have topology. That topology informs the ways in which\ninformation may be observed, hidden, inferred, and dissembled.\n  Dowker's Theorem establishes a homotopy equivalence between two simplicial\ncomplexes derived from a relation. From a privacy perspective, one complex\ndescribes individuals with common attributes, the other describes attributes\nshared by individuals. The homotopy equivalence produces a lattice. An element\nin the lattice consists of two components, one being a set of individuals, the\nother being a set of attributes. The lattice operations join and meet each\namount to set intersection in one component and set union followed by a\npotentially privacy-puncturing inference in the other component.\n  Privacy loss appears as simplicial collapse of free faces. Such collapse is\nlocal, but the property of fully preserving both attribute and association\nprivacy requires a global condition: a particular kind of spherical hole. By\nlooking at the link of an identifiable individual in its encompassing Dowker\ncomplex, one can characterize that individual's attribute privacy via another\nsphere condition. Even when long-term attribute privacy is impossible, homology\nprovides lower bounds on how an individual may defer identification, when that\nindividual has control over how to reveal attributes. Intuitively, the idea is\nto first reveal information that could otherwise be inferred. This last result\nhighlights privacy as a dynamic process. Privacy loss may be cast as gradient\nflow. Harmonic flow for privacy preservation may be fertile ground for future\nresearch.\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 04:57:55 GMT"}], "update_date": "2017-12-13", "authors_parsed": [["Erdmann", "Michael", ""]]}, {"id": "1712.04248", "submitter": "Jonas Rauber", "authors": "Wieland Brendel, Jonas Rauber, Matthias Bethge", "title": "Decision-Based Adversarial Attacks: Reliable Attacks Against Black-Box\n  Machine Learning Models", "comments": "Published as a conference paper at the Sixth International Conference\n  on Learning Representations (ICLR 2018)\n  https://openreview.net/forum?id=SyZI0GWCZ", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.CR cs.CV cs.LG cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many machine learning algorithms are vulnerable to almost imperceptible\nperturbations of their inputs. So far it was unclear how much risk adversarial\nperturbations carry for the safety of real-world machine learning applications\nbecause most methods used to generate such perturbations rely either on\ndetailed model information (gradient-based attacks) or on confidence scores\nsuch as class probabilities (score-based attacks), neither of which are\navailable in most real-world scenarios. In many such cases one currently needs\nto retreat to transfer-based attacks which rely on cumbersome substitute\nmodels, need access to the training data and can be defended against. Here we\nemphasise the importance of attacks which solely rely on the final model\ndecision. Such decision-based attacks are (1) applicable to real-world\nblack-box models such as autonomous cars, (2) need less knowledge and are\neasier to apply than transfer-based attacks and (3) are more robust to simple\ndefences than gradient- or score-based attacks. Previous attacks in this\ncategory were limited to simple models or simple datasets. Here we introduce\nthe Boundary Attack, a decision-based attack that starts from a large\nadversarial perturbation and then seeks to reduce the perturbation while\nstaying adversarial. The attack is conceptually simple, requires close to no\nhyperparameter tuning, does not rely on substitute models and is competitive\nwith the best gradient-based attacks in standard computer vision tasks like\nImageNet. We apply the attack on two black-box algorithms from Clarifai.com.\nThe Boundary Attack in particular and the class of decision-based attacks in\ngeneral open new avenues to study the robustness of machine learning models and\nraise new questions regarding the safety of deployed machine learning systems.\nAn implementation of the attack is available as part of Foolbox at\nhttps://github.com/bethgelab/foolbox .\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 11:36:26 GMT"}, {"version": "v2", "created": "Fri, 16 Feb 2018 14:40:42 GMT"}], "update_date": "2018-02-19", "authors_parsed": [["Brendel", "Wieland", ""], ["Rauber", "Jonas", ""], ["Bethge", "Matthias", ""]]}, {"id": "1712.04263", "submitter": "Ghassan Samara", "authors": "Ghassan Samara, Yousef Al-Raba'nah", "title": "Security Issues in Vehicular Ad Hoc Networks (VANET): a survey", "comments": null, "journal-ref": "International Journal of Sciences & Applied Research, 2015", "doi": null, "report-no": "IJSAR, 2(4), 2015; 50-55", "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular Ad Hoc Networks (VANET) is a technology that has been recently\nemerged, and bring a lot of interests. VANET can be used to improve road\nsafety, reduce road traffic, serve interests of its users, and provide\nemergency services. The security is one of the most important issues in VANET,\nit is considered a critical point in the development of robust VANET systems.\nIn this paper, a diverse types of security challenges and requirements of VANET\nwill be discussed, and a set of possible solutions for VANET security problems\nand attacks will be presented and analyzed. Also this paper will propose a new\nprotocol that is called the reply protocol, this protocol aims to protect VANET\nagainst several attacks.\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 12:29:22 GMT"}], "update_date": "2017-12-13", "authors_parsed": [["Samara", "Ghassan", ""], ["Al-Raba'nah", "Yousef", ""]]}, {"id": "1712.04402", "submitter": "Ignacio Martin", "authors": "Ignacio Mart\\'in, Jos\\'e Alberto Hern\\'andez, Alfonso Mu\\~noz, Antonio\n  Guzm\\'an", "title": "Android Malware Characterization using Metadata and Machine Learning\n  Techniques", "comments": "4 figures, 2 tables and 8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Android Malware has emerged as a consequence of the increasing popularity of\nsmartphones and tablets. While most previous work focuses on inherent\ncharacteristics of Android apps to detect malware, this study analyses indirect\nfeatures and meta-data to identify patterns in malware applications. Our\nexperiments show that: (1) the permissions used by an application offer only\nmoderate performance results; (2) other features publicly available at Android\nMarkets are more relevant in detecting malware, such as the application\ndeveloper and certificate issuer, and (3) compact and efficient classifiers can\nbe constructed for the early detection of malware applications prior to code\ninspection or sandboxing.\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 17:39:33 GMT"}], "update_date": "2017-12-13", "authors_parsed": [["Martín", "Ignacio", ""], ["Hernández", "José Alberto", ""], ["Muñoz", "Alfonso", ""], ["Guzmán", "Antonio", ""]]}, {"id": "1712.04417", "submitter": "Binanda Sengupta", "authors": "Binanda Sengupta and Sushmita Ruj", "title": "Keyword-Based Delegable Proofs of Storage", "comments": "A preliminary version of this work has been published in\n  International Conference on Information Security Practice and Experience\n  (ISPEC 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud users (clients) with limited storage capacity at their end can\noutsource bulk data to the cloud storage server. A client can later access her\ndata by downloading the required data files. However, a large fraction of the\ndata files the client outsources to the server is often archival in nature that\nthe client uses for backup purposes and accesses less frequently. An untrusted\nserver can thus delete some of these archival data files in order to save some\nspace (and allocate the same to other clients) without being detected by the\nclient (data owner). Proofs of storage enable the client to audit her data\nfiles uploaded to the server in order to ensure the integrity of those files.\nIn this work, we introduce one type of (selective) proofs of storage that we\ncall keyword-based delegable proofs of storage, where the client wants to audit\nall her data files containing a specific keyword (e.g., \"important\"). Moreover,\nit satisfies the notion of public verifiability where the client can delegate\nthe auditing task to a third-party auditor who audits the set of files\ncorresponding to the keyword on behalf of the client. We formally define the\nsecurity of a keyword-based delegable proof-of-storage protocol. We construct\nsuch a protocol based on an existing proof-of-storage scheme and analyze the\nsecurity of our protocol. We argue that the techniques we use can be applied\natop any existing publicly verifiable proof-of-storage scheme for static data.\nFinally, we discuss the efficiency of our construction.\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 18:18:55 GMT"}, {"version": "v2", "created": "Thu, 14 Dec 2017 13:40:49 GMT"}, {"version": "v3", "created": "Tue, 2 Jan 2018 16:34:44 GMT"}, {"version": "v4", "created": "Wed, 21 Feb 2018 10:31:29 GMT"}, {"version": "v5", "created": "Sun, 25 Feb 2018 10:47:56 GMT"}, {"version": "v6", "created": "Sun, 3 Jun 2018 13:28:01 GMT"}, {"version": "v7", "created": "Sun, 10 Jun 2018 16:58:13 GMT"}, {"version": "v8", "created": "Tue, 25 Sep 2018 13:16:55 GMT"}], "update_date": "2018-09-26", "authors_parsed": [["Sengupta", "Binanda", ""], ["Ruj", "Sushmita", ""]]}, {"id": "1712.04501", "submitter": "Jason Gross", "authors": "Jason N. Gross, Cagri Kilic, Todd E. Humphreys", "title": "Maximum-Likelihood Power-Distortion Monitoring for GNSS Signal\n  Authentication", "comments": null, "journal-ref": "2018 IEEE Transactions on Aerospace and Electronic Systems", "doi": "10.1109/TAES.2018.2848318", "report-no": null, "categories": "eess.SP cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an extension to the so-called PD detector. The PD detector jointly\nmonitors received power and correlation profile distortion to detect the\npresence of GNSS carry-off-type spoofing, jamming, or multipath. We show that\nclassification performance can be significantly improved by replacing the PD\ndetector's symmetric-difference-based distortion measurement with one based on\nthe post-fit residuals of the maximum-likelihood estimate of a single-signal\ncorrelation function model. We call the improved technique the PD-ML detector.\nIn direct comparison with the PD detector, the PD-ML detector exhibits improved\nclassification accuracy when tested against an extensive library of recorded\nfield data. In particular, it is (1) significantly more accurate at\ndistinguishing a spoofing attack from a jamming attack, (2) better at\ndistinguishing multipath-afflicted data from interference-free data, and (3)\nless likely to issue a false alarm by classifying multipath as spoofing. The\nPD-ML detector achieves this improved performance at the expense of additional\ncomputational complexity.\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 20:30:01 GMT"}, {"version": "v2", "created": "Thu, 22 Mar 2018 14:07:23 GMT"}, {"version": "v3", "created": "Mon, 14 May 2018 15:09:15 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Gross", "Jason N.", ""], ["Kilic", "Cagri", ""], ["Humphreys", "Todd E.", ""]]}, {"id": "1712.04544", "submitter": "Mark Scanlon", "authors": "David Lillis, Frank Breitinger and Mark Scanlon", "title": "Hierarchical Bloom Filter Trees for Approximate Matching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DS", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Bytewise approximate matching algorithms have in recent years shown\nsignificant promise in de- tecting files that are similar at the byte level.\nThis is very useful for digital forensic investigators, who are regularly faced\nwith the problem of searching through a seized device for pertinent data. A\ncommon scenario is where an investigator is in possession of a collection of\n\"known-illegal\" files (e.g. a collection of child abuse material) and wishes to\nfind whether copies of these are stored on the seized device. Approximate\nmatching addresses shortcomings in traditional hashing, which can only find\nidentical files, by also being able to deal with cases of merged files,\nembedded files, partial files, or if a file has been changed in any way.\n  Most approximate matching algorithms work by comparing pairs of files, which\nis not a scalable approach when faced with large corpora. This paper\ndemonstrates the effectiveness of using a \"Hierarchical Bloom Filter Tree\"\n(HBFT) data structure to reduce the running time of\ncollection-against-collection matching, with a specific focus on the MRSH-v2\nalgorithm. Three experiments are discussed, which explore the effects of\ndifferent configurations of HBFTs. The proposed approach dramatically reduces\nthe number of pairwise comparisons required, and demonstrates substantial speed\ngains, while maintaining effectiveness.\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 21:44:18 GMT"}], "update_date": "2017-12-14", "authors_parsed": [["Lillis", "David", ""], ["Breitinger", "Frank", ""], ["Scanlon", "Mark", ""]]}, {"id": "1712.04560", "submitter": "Israel Cole Mr", "authors": "Israel Cole, Liswani Sibamba, Abdi Hilowle, and Jaye Jallow", "title": "IT Risk Assessment for Group6 Healthcare Clinic Report", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information security and privacy in the healthcare sector is an issue of\ngrowing importance. The adoption of digital patient records, increased\nregulation, provider consolidation and the increasing need for information\nexchange between patients, providers and payers, all point towards the need for\nbetter information security. We critically survey the literature on information\nsecurity and privacy in healthcare, published in information systems journals\nas well as many other related disciplines including health informatics, public\nhealth, law, medicine, and the trade press and industry reports\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 22:56:15 GMT"}], "update_date": "2017-12-14", "authors_parsed": [["Cole", "Israel", ""], ["Sibamba", "Liswani", ""], ["Hilowle", "Abdi", ""], ["Jallow", "Jaye", ""]]}, {"id": "1712.04649", "submitter": "Theodosios Mourouzis", "authors": "Theodosis Mourouzis, Chrysostomos Filipou", "title": "The Blockchain Revolution: Insights from Top-Management", "comments": "26 pages, 22 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is an exploration of Blockchain technology that is growing in popularity\nand it seems to be able to disrupt a plethora of industries. A research is\nbeing conducted to examine Blockchain potential to be adopted by enterprises\nfrom different sectors as well as the parameters that could affect its\nadoption. Mostly known as the technology that underpins Bitcoin, this concept\nraised a significant interest within various markets. Blockchain offers a new\napproach to valued information management and sharing and it is introduced as a\nsolution against the inefficiencies that affect the industry. Experts,\ninfrastructure providers and banks can now work on this technology and explore\nits uses. This is a new technology journey with obstacles that will need to be\novercome and it can not be clear yet what will eventually arise. Professionals\nfrom around the world express their views on the adoption of Blockchain by\norganisations and how these plan to support its deployment. Thoughts are shared\nin terms of the required budget and the parameters that can impact its\nadoption. There is a great interest in Blockchain technology and its\nrevolutionary potential to modernize the world economy and this is only the\nbeginning.\n", "versions": [{"version": "v1", "created": "Wed, 13 Dec 2017 08:14:19 GMT"}], "update_date": "2017-12-14", "authors_parsed": [["Mourouzis", "Theodosis", ""], ["Filipou", "Chrysostomos", ""]]}, {"id": "1712.04817", "submitter": "Dasari Kalyani", "authors": "D Siva Santosh Kumar, Dasari Kalyani", "title": "Secure Encryption scheme with key exchange for Two server Architecture", "comments": "4 pages, one figure, ICASETM-17 conference", "journal-ref": "IJERCSE, Volume 4, Issue 11, November 2017", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the distributed environment, authentication and key exchange mechanisms\nplay a major role. In general, for authentication, the client and the server\nmutually exchange a common cryptographic key. In earlier, passwords were stored\non a single server. If an intruder gains access to the server by using some\nmalicious attacks, then all the passwords stored in the database be\ncompromised. So the e-commerce application security is endangered. In order to\nimprove the efficiency and performance of the authentication scheme, we\nintroduce multiple servers to store the passwords and participate in the key\nexchange and authentication schemes. This ensures entire systems' security even\nif a single server is compromised. The randomly generated nonce for each\nsession corresponding to two-level security mechanism where the scope of an\nattacker pretends as legitimate user and login to the system is completely\nrestricted. In this method, passwords are stored in their equivalent hash\nvalues and stored on multiple servers. This makes the attacker difficult to\nreverse engineer and intercept to determine the password even from segments of\nhash value. In this paper, we model a safe and secure password-based\nauthentication scheme using a key exchange.\n", "versions": [{"version": "v1", "created": "Wed, 29 Nov 2017 03:52:36 GMT"}], "update_date": "2017-12-14", "authors_parsed": [["Kumar", "D Siva Santosh", ""], ["Kalyani", "Dasari", ""]]}, {"id": "1712.05090", "submitter": "Yunkai Liu", "authors": "Zhao-Hui Du, Zhiwei Ying, Zhenke Ma, Yufei Mai, Phoebe Wang, Jesse Liu\n  and Jesse Fang", "title": "Secure Encrypted Virtualization is Unsecure", "comments": "10 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Virtualization has become more important since cloud computing is getting\nmore and more popular than before. There is an increasing demand for security\namong the cloud customers. AMD plans to provide Secure Encrypted Virtualization\n(SEV) technology in its latest processor EPYC to protect virtual machines by\nencrypting its memory but without integrity protection. In this paper, we\nanalyzed the weakness in the SEV design due to lack of integrity protection\nthus it is not so secure. Using different design flaw in physical address-based\ntweak algorithm to protect against ciphertext block move attacks, we found a\nrealistic attack against SEV which could obtain the root privilege of an\nencrypted virtual machine protected by SEV. A demo to simulate the attack\nagainst a virtual machine protected by SEV is done in a Ryzen machine which\nsupports Secure Memory Encryption (SME) technology since SEV enabled machine is\nstill not available in market.\n", "versions": [{"version": "v1", "created": "Thu, 14 Dec 2017 04:16:56 GMT"}], "update_date": "2017-12-15", "authors_parsed": [["Du", "Zhao-Hui", ""], ["Ying", "Zhiwei", ""], ["Ma", "Zhenke", ""], ["Mai", "Yufei", ""], ["Wang", "Phoebe", ""], ["Liu", "Jesse", ""], ["Fang", "Jesse", ""]]}, {"id": "1712.05099", "submitter": "Zhihong Liu", "authors": "Zhihong Liu, Jiajia Liu, Yong Zeng, Li Yang, and Jianfeng Ma", "title": "The Sound and the Fury: Hiding Communications in Noisy Wireless Networks\n  with Interference Uncertainty", "comments": "13 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Covert communication can prevent the adversary from knowing that a wireless\ntransmission has occurred. In the additive white Gaussian noise channels, a\nsquare root law is obtained and the result shows that Alice can reliably and\ncovertly transmit $\\mathcal{O}(\\sqrt{n})$ bits to Bob in $n$ channel uses. If\nadditional \"friendly\" node near the adversary can inject artificial noise to\naid Alice in hiding her transmission attempt, covert throughput can be\nimproved, i.e., Alice can covertly transmit\n$\\mathcal{O}(\\min\\{n,\\lambda^{\\alpha/2}\\sqrt{n}\\})$ bits to Bob over $n$ uses\nof the channel ($\\lambda$ is the density of friendly nodes and $\\alpha$ is the\npath loss exponent of wireless channels). In this paper, we consider the covert\ncommunication in a noisy wireless network, where Bob and the adversary Willie\nnot only experience the background noise, but also the aggregated interference\nfrom other transmitters. Our results show that uncertainty in interference\nexperienced by Willie is beneficial to Alice. When the distance between Alice\nand Willie $d_{a,w}=\\omega(n^{\\delta/4})$ ($\\delta=2/\\alpha$ is stability\nexponent), Alice can reliably and covertly transmit\n$\\mathcal{O}(\\log_2\\sqrt{n})$ bits to Bob in $n$ channel uses. Although the\ncovert throughput is lower than the square root law and the friendly jamming\nscheme, the spatial throughput is higher. From the network perspective, the\ncommunications are hidden in \"the sound and the fury\" of noisy wireless\nnetworks, and what Willie sees is merely a \"shadow\" wireless network. He knows\nfor certain that some nodes are transmitting, but he cannot catch anyone\nred-handed.\n", "versions": [{"version": "v1", "created": "Thu, 14 Dec 2017 05:56:02 GMT"}, {"version": "v2", "created": "Mon, 25 Dec 2017 12:38:16 GMT"}, {"version": "v3", "created": "Fri, 9 Mar 2018 06:44:29 GMT"}], "update_date": "2018-03-12", "authors_parsed": [["Liu", "Zhihong", ""], ["Liu", "Jiajia", ""], ["Zeng", "Yong", ""], ["Yang", "Li", ""], ["Ma", "Jianfeng", ""]]}, {"id": "1712.05419", "submitter": "Catherine Wong", "authors": "Catherine Wong", "title": "DANCin SEQ2SEQ: Fooling Text Classifiers with Adversarial Text Example\n  Generation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning models are powerful but fallible. Generating adversarial\nexamples - inputs deliberately crafted to cause model misclassification or\nother errors - can yield important insight into model assumptions and\nvulnerabilities. Despite significant recent work on adversarial example\ngeneration targeting image classifiers, relatively little work exists exploring\nadversarial example generation for text classifiers; additionally, many\nexisting adversarial example generation algorithms require full access to\ntarget model parameters, rendering them impractical for many real-world\nattacks. In this work, we introduce DANCin SEQ2SEQ, a GAN-inspired algorithm\nfor adversarial text example generation targeting largely black-box text\nclassifiers. We recast adversarial text example generation as a reinforcement\nlearning problem, and demonstrate that our algorithm offers preliminary but\npromising steps towards generating semantically meaningful adversarial text\nexamples in a real-world attack scenario.\n", "versions": [{"version": "v1", "created": "Thu, 14 Dec 2017 19:00:57 GMT"}], "update_date": "2017-12-18", "authors_parsed": [["Wong", "Catherine", ""]]}, {"id": "1712.05441", "submitter": "Jeffrey Pawlick", "authors": "Jeffrey Pawlick, Edward Colbert, and Quanyan Zhu", "title": "A Game-Theoretic Taxonomy and Survey of Defensive Deception for\n  Cybersecurity and Privacy", "comments": "To Appear in ACM Cumputing Surveys (CSUR)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyberattacks on both databases and critical infrastructure have threatened\npublic and private sectors. Ubiquitous tracking and wearable computing have\ninfringed upon privacy. Advocates and engineers have recently proposed using\ndefensive deception as a means to leverage the information asymmetry typically\nenjoyed by attackers as a tool for defenders. The term deception, however, has\nbeen employed broadly and with a variety of meanings. In this paper, we survey\n24 articles from 2008-2018 that use game theory to model defensive deception\nfor cybersecurity and privacy. Then we propose a taxonomy that defines six\ntypes of deception: perturbation, moving target defense, obfuscation, mixing,\nhoney-x, and attacker engagement. These types are delineated by their\ninformation structures, agents, actions, and duration: precisely concepts\ncaptured by game theory. Our aims are to rigorously define types of defensive\ndeception, to capture a snapshot of the state of the literature, to provide a\nmenu of models which can be used for applied research, and to identify\npromising areas for future work. Our taxonomy provides a systematic foundation\nfor understanding different types of defensive deception commonly encountered\nin cybersecurity and privacy.\n", "versions": [{"version": "v1", "created": "Thu, 14 Dec 2017 20:34:03 GMT"}, {"version": "v2", "created": "Fri, 8 Mar 2019 20:47:33 GMT"}, {"version": "v3", "created": "Wed, 22 May 2019 13:16:23 GMT"}], "update_date": "2019-05-23", "authors_parsed": [["Pawlick", "Jeffrey", ""], ["Colbert", "Edward", ""], ["Zhu", "Quanyan", ""]]}, {"id": "1712.05493", "submitter": "Zhiyuan Wan", "authors": "Zhiyuan Wan, David Lo, Xin Xia, Liang Cai, and Shanping Li", "title": "Mining Sandboxes for Linux Containers", "comments": "11 pages, IEEE International Conference on Software Testing,\n  Verification and Validation (ICST 2017)", "journal-ref": null, "doi": "10.1109/ICST.2017.16", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A container is a group of processes isolated from other groups via distinct\nkernel namespaces and resource allocation quota. Attacks against containers\noften leverage kernel exploits through system call interface. In this paper, we\npresent an approach that mines sandboxes for containers. We first explore the\nbehaviors of a container by leveraging automatic testing, and extract the set\nof system calls accessed during testing. The set of system calls then results\nas a sandbox of the container. The mined sandbox restricts the container's\naccess to system calls which are not seen during testing and thus reduces the\nattack surface. In the experiment, our approach requires less than eleven\nminutes to mine sandbox for each of the containers. The enforcement of mined\nsandboxes does not impact the regular functionality of a container and incurs\nlow performance overhead.\n", "versions": [{"version": "v1", "created": "Fri, 15 Dec 2017 00:54:21 GMT"}], "update_date": "2017-12-18", "authors_parsed": [["Wan", "Zhiyuan", ""], ["Lo", "David", ""], ["Xia", "Xin", ""], ["Cai", "Liang", ""], ["Li", "Shanping", ""]]}, {"id": "1712.05526", "submitter": "Xinyun Chen", "authors": "Xinyun Chen, Chang Liu, Bo Li, Kimberly Lu, Dawn Song", "title": "Targeted Backdoor Attacks on Deep Learning Systems Using Data Poisoning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep learning models have achieved high performance on many tasks, and thus\nhave been applied to many security-critical scenarios. For example, deep\nlearning-based face recognition systems have been used to authenticate users to\naccess many security-sensitive applications like payment apps. Such usages of\ndeep learning systems provide the adversaries with sufficient incentives to\nperform attacks against these systems for their adversarial purposes. In this\nwork, we consider a new type of attacks, called backdoor attacks, where the\nattacker's goal is to create a backdoor into a learning-based authentication\nsystem, so that he can easily circumvent the system by leveraging the backdoor.\nSpecifically, the adversary aims at creating backdoor instances, so that the\nvictim learning system will be misled to classify the backdoor instances as a\ntarget label specified by the adversary. In particular, we study backdoor\npoisoning attacks, which achieve backdoor attacks using poisoning strategies.\nDifferent from all existing work, our studied poisoning strategies can apply\nunder a very weak threat model: (1) the adversary has no knowledge of the model\nand the training set used by the victim system; (2) the attacker is allowed to\ninject only a small amount of poisoning samples; (3) the backdoor key is hard\nto notice even by human beings to achieve stealthiness. We conduct evaluation\nto demonstrate that a backdoor adversary can inject only around 50 poisoning\nsamples, while achieving an attack success rate of above 90%. We are also the\nfirst work to show that a data poisoning attack can create physically\nimplementable backdoors without touching the training process. Our work\ndemonstrates that backdoor poisoning attacks pose real threats to a learning\nsystem, and thus highlights the importance of further investigation and\nproposing defense strategies against them.\n", "versions": [{"version": "v1", "created": "Fri, 15 Dec 2017 04:26:26 GMT"}], "update_date": "2017-12-18", "authors_parsed": [["Chen", "Xinyun", ""], ["Liu", "Chang", ""], ["Li", "Bo", ""], ["Lu", "Kimberly", ""], ["Song", "Dawn", ""]]}, {"id": "1712.05627", "submitter": "Chris Culnane Dr", "authors": "Chris Culnane, Benjamin I. P. Rubinstein, Vanessa Teague", "title": "Health Data in an Open World", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the aim of informing sound policy about data sharing and privacy, we\ndescribe successful re-identification of patients in an Australian\nde-identified open health dataset. As in prior studies of similar datasets, a\nfew mundane facts often suffice to isolate an individual. Some people can be\nidentified by name based on publicly available information. Decreasing the\nprecision of the unit-record level data, or perturbing it statistically, makes\nre-identification gradually harder at a substantial cost to utility. We also\nexamine the value of related datasets in improving the accuracy and confidence\nof re-identification. Our re-identifications were performed on a 10% sample\ndataset, but a related open Australian dataset allows us to infer with high\nconfidence that some individuals in the sample have been correctly\nre-identified. Finally, we examine the combination of the open datasets with\nsome commercial datasets that are known to exist but are not in our possession.\nWe show that they would further increase the ease of re-identification.\n", "versions": [{"version": "v1", "created": "Fri, 15 Dec 2017 11:36:24 GMT"}], "update_date": "2017-12-18", "authors_parsed": [["Culnane", "Chris", ""], ["Rubinstein", "Benjamin I. P.", ""], ["Teague", "Vanessa", ""]]}, {"id": "1712.05727", "submitter": "Mark Scanlon", "authors": "Erwin van de Wiel, Mark Scanlon and Nhien-An Le-Khac", "title": "Network Intell: Enabling the Non-Expert Analysis of Large Volumes of\n  Intercepted Network Traffic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In criminal investigations, telecommunication wiretaps have become a common\ntechnique used by law enforcement. While phone-based wiretapping is well\ndocumented and the procedure for their execution are well known, the same\ncannot be said for Internet taps. Lawfully intercepted network traffic often\ncontains a lot of encrypted traffic making it increasingly difficult to find\nuseful information inside the traffic captured. The advent of\nInternet-of-Things further complicates the process for non-technical\ninvestigators. The current level of complexity of intercepted network traffic\nis close to a point where data cannot be analysed without supervision of a\ndigital investigator with advanced network knowledge. Current investigations\nfocus on analysing all traffic in a chronological manner and are predominately\nconducted on the data contents of the intercepted traffic. This approach often\nbecomes overly arduous when the amount of data to be analysed becomes very\nlarge. In this paper, we propose a novel approach to analyse large amounts of\nintercepted network traffic based on network metadata. Our approach\nsignificantly reduces the duration of the analysis and also produces an insight\nview of analysing results for the non-technical investigator. We also test our\napproach with a large sample of network traffic data.\n", "versions": [{"version": "v1", "created": "Fri, 15 Dec 2017 16:15:56 GMT"}, {"version": "v2", "created": "Sat, 27 Jan 2018 09:53:19 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["van de Wiel", "Erwin", ""], ["Scanlon", "Mark", ""], ["Le-Khac", "Nhien-An", ""]]}, {"id": "1712.05745", "submitter": "Pol Van Aubel", "authors": "Pol Van Aubel (1), Kostas Papagiannopoulos (1), {\\L}ukasz Chmielewski\n  (2), Christian Doerr (3) ((1) Radboud University, Digital Security Group, (2)\n  Riscure BV, Delft, the Netherlands, (3) Delft University of Technology,\n  Department of Intelligent Systems)", "title": "Side-channel based intrusion detection for industrial control systems", "comments": "12 pages, 7 figures. For associated code, see\n  https://polvanaubel.com/research/em-ics/code/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Industrial Control Systems are under increased scrutiny. Their security is\nhistorically sub-par, and although measures are being taken by the\nmanufacturers to remedy this, the large installed base of legacy systems cannot\neasily be updated with state-of-the-art security measures. We propose a system\nthat uses electromagnetic side-channel measurements to detect behavioural\nchanges of the software running on industrial control systems. To demonstrate\nthe feasibility of this method, we show it is possible to profile and\ndistinguish between even small changes in programs on Siemens S7-317 PLCs,\nusing methods from cryptographic side-channel analysis.\n", "versions": [{"version": "v1", "created": "Fri, 15 Dec 2017 16:45:10 GMT"}], "update_date": "2017-12-18", "authors_parsed": [["Van Aubel", "Pol", ""], ["Papagiannopoulos", "Kostas", ""], ["Chmielewski", "Łukasz", ""], ["Doerr", "Christian", ""]]}, {"id": "1712.05888", "submitter": "Ios Kotsogiannis", "authors": "Stelios Doudalis, Ios Kotsogiannis, Samuel Haney, Ashwin\n  Machanavajjhala, and Sharad Mehrotra", "title": "One-sided Differential Privacy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the problem of privacy-preserving data sharing,\nwherein only a subset of the records in a database are sensitive, possibly\nbased on predefined privacy policies. Existing solutions, viz, differential\nprivacy (DP), are over-pessimistic and treat all information as sensitive.\nAlternatively, techniques, like access control and personalized differential\nprivacy, reveal all non-sensitive records truthfully, and they indirectly leak\ninformation about sensitive records through exclusion attacks.\n  Motivated by the limitations of prior work, we introduce the notion of\none-sided differential privacy (OSDP). We formalize the exclusion attack and we\nshow how OSDP protects against it. OSDP offers differential privacy like\nguarantees, but only to the sensitive records. OSDP allows the truthful release\nof a subset of the non-sensitive records. The sample can be used to support\napplications that must output true data, and is well suited for publishing\ncomplex types of data, e.g. trajectories. Though some non-sensitive records are\nsuppressed to avoid exclusion attacks, our experiments show that the\nsuppression results in a small loss in utility in most cases. Additionally, we\npresent a recipe for turning DP mechanisms for answering counting queries into\nOSDP techniques for the same task. Our OSDP algorithms leverage the presence of\nnon-sensitive records and are able to offer up to a 25x improvement in accuracy\nover state-of-the-art DP-solutions.\n", "versions": [{"version": "v1", "created": "Sat, 16 Dec 2017 01:29:27 GMT"}], "update_date": "2017-12-19", "authors_parsed": [["Doudalis", "Stelios", ""], ["Kotsogiannis", "Ios", ""], ["Haney", "Samuel", ""], ["Machanavajjhala", "Ashwin", ""], ["Mehrotra", "Sharad", ""]]}, {"id": "1712.05908", "submitter": "Shoufu Luo", "authors": "Shoufu Luo and Sven Dietrich", "title": "Fingerprinting Cryptographic Protocols with Key Exchange using an\n  Entropy Measure", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Encryption has increasingly been used in all applications for various\npurposes, but it also brings big challenges to network security. In this paper,\nwe take first steps towards addressing some of these chal- lenges by\nintroducing a novel system to identify key exchange protocols, which are\nusually required if encryption keys are not pre-shared. We ob- served that key\nexchange protocols yield certain patterns of high-entropy data blocks, e.g. as\nfound in key material. We propose a multi-resolution approach of accurately\ndetecting high-entropy data blocks and a method of generating scalable\nfingerprints for cryptographic protocols. We pro- vide experimental evidence\nthat our approach has great potential for identifying cryptographic protocols\nby their unique key exchanges, and furthermore for detecting malware traffic\nthat includes customized key exchange protocols.\n", "versions": [{"version": "v1", "created": "Sat, 16 Dec 2017 06:24:50 GMT"}], "update_date": "2017-12-19", "authors_parsed": [["Luo", "Shoufu", ""], ["Dietrich", "Sven", ""]]}, {"id": "1712.05913", "submitter": "Thai Hoang Dinh DTH", "authors": "Dinh Thai Hoang, Dusit Niyato, Ping Wang, Shaun Shuxun Wang, Diep\n  Nguyen, and Eryk Dutkiewicz", "title": "A Stochastic Programming Approach for Risk Management in Mobile Cloud\n  Computing", "comments": "6 pages, 4 figures, 4 tables, WCNC 2018 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The development of mobile cloud computing has brought many benefits to mobile\nusers as well as cloud service providers. However, mobile cloud computing is\nfacing some challenges, especially security-related problems due to the growing\nnumber of cyberattacks which can cause serious losses. In this paper, we\npropose a dynamic framework together with advanced risk management strategies\nto minimize losses caused by cyberattacks to a cloud service provider. In\nparticular, this framework allows the cloud service provider to select\nappropriate security solutions, e.g., security software/hardware implementation\nand insurance policies, to deal with different types of attacks. Furthermore,\nthe stochastic programming approach is adopted to minimize the expected total\nloss for the cloud service provider under its financial capability and\nuncertainty of attacks and their potential losses. Through numerical\nevaluation, we show that our approach is an effective tool in not only dealing\nwith cyberattacks under uncertainty, but also minimizing the total loss for the\ncloud service provider given its available budget.\n", "versions": [{"version": "v1", "created": "Sat, 16 Dec 2017 07:18:46 GMT"}], "update_date": "2017-12-19", "authors_parsed": [["Hoang", "Dinh Thai", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""], ["Wang", "Shaun Shuxun", ""], ["Nguyen", "Diep", ""], ["Dutkiewicz", "Eryk", ""]]}, {"id": "1712.05914", "submitter": "Thai Hoang Dinh DTH", "authors": "Khoi Khac Nguyen, Dinh Thai Hoang, Dusit Niyato, Ping Wang, Diep\n  Nguyen, and Eryk Dutkiewicz", "title": "Cyberattack Detection in Mobile Cloud Computing: A Deep Learning\n  Approach", "comments": "6 pages, 3 figures, 1 table, WCNC 2018 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the rapid growth of mobile applications and cloud computing, mobile\ncloud computing has attracted great interest from both academia and industry.\nHowever, mobile cloud applications are facing security issues such as data\nintegrity, users' confidentiality, and service availability. A preventive\napproach to such problems is to detect and isolate cyber threats before they\ncan cause serious impacts to the mobile cloud computing system. In this paper,\nwe propose a novel framework that leverages a deep learning approach to detect\ncyberattacks in mobile cloud environment. Through experimental results, we show\nthat our proposed framework not only recognizes diverse cyberattacks, but also\nachieves a high accuracy (up to 97.11%) in detecting the attacks. Furthermore,\nwe present the comparisons with current machine learning-based approaches to\ndemonstrate the effectiveness of our proposed solution.\n", "versions": [{"version": "v1", "created": "Sat, 16 Dec 2017 07:24:55 GMT"}], "update_date": "2017-12-19", "authors_parsed": [["Nguyen", "Khoi Khac", ""], ["Hoang", "Dinh Thai", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""], ["Nguyen", "Diep", ""], ["Dutkiewicz", "Eryk", ""]]}, {"id": "1712.05919", "submitter": "Jack Stokes", "authors": "Jack W. Stokes, De Wang, Mady Marinescu, Marc Marino, Brian Bussone", "title": "Attack and Defense of Dynamic Analysis-Based, Adversarial Neural Malware\n  Classification Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently researchers have proposed using deep learning-based systems for\nmalware detection. Unfortunately, all deep learning classification systems are\nvulnerable to adversarial attacks. Previous work has studied adversarial\nattacks against static analysis-based malware classifiers which only classify\nthe content of the unknown file without execution. However, since the majority\nof malware is either packed or encrypted, malware classification based on\nstatic analysis often fails to detect these types of files. To overcome this\nlimitation, anti-malware companies typically perform dynamic analysis by\nemulating each file in the anti-malware engine or performing in-depth scanning\nin a virtual machine. These strategies allow the analysis of the malware after\nunpacking or decryption. In this work, we study different strategies of\ncrafting adversarial samples for dynamic analysis. These strategies operate on\nsparse, binary inputs in contrast to continuous inputs such as pixels in\nimages. We then study the effects of two, previously proposed defensive\nmechanisms against crafted adversarial samples including the distillation and\nensemble defenses. We also propose and evaluate the weight decay defense.\nExperiments show that with these three defensive strategies, the number of\nsuccessfully crafted adversarial samples is reduced compared to a standard\nbaseline system without any defenses. In particular, the ensemble defense is\nthe most resilient to adversarial attacks. Importantly, none of the defenses\nsignificantly reduce the classification accuracy for detecting malware.\nFinally, we demonstrate that while adding additional hidden layers to neural\nmodels does not significantly improve the malware classification accuracy, it\ndoes significantly increase the classifier's robustness to adversarial attacks.\n", "versions": [{"version": "v1", "created": "Sat, 16 Dec 2017 08:22:34 GMT"}], "update_date": "2017-12-19", "authors_parsed": [["Stokes", "Jack W.", ""], ["Wang", "De", ""], ["Marinescu", "Mady", ""], ["Marino", "Marc", ""], ["Bussone", "Brian", ""]]}, {"id": "1712.05958", "submitter": "Ibbad Hafeez", "authors": "Ibbad Hafeez, Aaron Yi Ding, Markku Antikainen, Sasu Tarkoma", "title": "Toward Secure Edge Networks Taming Device to Device (D2D) Communication\n  in IoT", "comments": "Appeared in 12th International Conference on Network and System\n  Security, NSS, August 2018\n  (http://www4.comp.polyu.edu.hk/~nss2018/program.html)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growing popularity of Internet-of-Things (IoT) has created the need for\nnetwork-based traffic anomaly detection systems that could identify misbehaving\ndevices. In this work, we propose a lightweight technique, IoT-guard, for\nidentifying malicious traffic flows. IoT-guard uses semi-supervised learning to\ndistinguish between malicious and benign device behaviours using the network\ntraffic generated by devices. In order to achieve this, we extracted 39\nfeatures from network logs and discard any features containing redundant\ninformation. After feature selection, fuzzy C-Mean (FCM) algorithm was trained\nto obtain clusters discriminating benign traffic from malicious traffic. We\nstudied the feature scores in these clusters and use this information to\npredict the type of new traffic flows. IoT-guard was evaluated using a\nreal-world testbed with more than 30 devices. The results show that IoTguard\nachieves high accuracy (98%), in differentiating various types of malicious and\nbenign traffic, with low false positive rates. Furthermore, it has low resource\nfootprint and can operate on OpenWRT enabled access points and COTS computing\nboards.\n", "versions": [{"version": "v1", "created": "Sat, 16 Dec 2017 13:25:30 GMT"}, {"version": "v2", "created": "Tue, 16 Oct 2018 09:28:15 GMT"}], "update_date": "2018-10-17", "authors_parsed": [["Hafeez", "Ibbad", ""], ["Ding", "Aaron Yi", ""], ["Antikainen", "Markku", ""], ["Tarkoma", "Sasu", ""]]}, {"id": "1712.06239", "submitter": "Xiao-Shan Gao", "authors": "Yu-Ao Chen and Xiao-Shan Gao", "title": "Quantum Algorithms for Boolean Equation Solving and Quantum Algebraic\n  Attack on Cryptosystems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC cs.CR cs.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decision of whether a Boolean equation system has a solution is an NPC\nproblem and finding a solution is NP hard. In this paper, we present a quantum\nalgorithm to decide whether a Boolean equation system FS has a solution and\ncompute one if FS does have solutions with any given success probability. The\nruntime complexity of the algorithm is polynomial in the size of FS and the\ncondition number of FS. As a consequence, we give a polynomial-time quantum\nalgorithm for solving Boolean equation systems if their condition numbers are\nsmall, say polynomial in the size of FS. We apply our quantum algorithm for\nsolving Boolean equations to the cryptanalysis of several important\ncryptosystems: the stream cipher Trivum, the block cipher AES, the hash\nfunction SHA-3/Keccak, and the multivariate public key cryptosystems, and show\nthat they are secure under quantum algebraic attack only if the condition\nnumbers of the corresponding equation systems are large. This leads to a new\ncriterion for designing cryptosystems that can against the attack of quantum\ncomputers: their corresponding equation systems must have large condition\nnumbers.\n", "versions": [{"version": "v1", "created": "Mon, 18 Dec 2017 03:34:10 GMT"}, {"version": "v2", "created": "Wed, 4 Apr 2018 09:17:31 GMT"}, {"version": "v3", "created": "Mon, 6 Aug 2018 02:33:16 GMT"}], "update_date": "2018-08-07", "authors_parsed": [["Chen", "Yu-Ao", ""], ["Gao", "Xiao-Shan", ""]]}, {"id": "1712.06438", "submitter": "Xiaoqi Li", "authors": "Ting Chen, Xiaoqi Li, Ying Wang, Jiachi Chen, Zihao Li, Xiapu Luo, Man\n  Ho Au, Xiaosong Zhang", "title": "An Adaptive Gas Cost Mechanism for Ethereum to Defend Against\n  Under-Priced DoS Attacks", "comments": null, "journal-ref": "In International Conference on Information Security Practice and\n  Experience (ISPEC 2017)", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The gas mechanism in Ethereum charges the execution of every operation to\nensure that smart contracts running in EVM (Ethereum Virtual Machine) will be\neventually terminated. Failing to properly set the gas costs of EVM operations\nallows attackers to launch DoS attacks on Ethereum. Although Ethereum recently\nadjusted the gas costs of EVM operations to defend against known DoS attacks,\nit remains unknown whether the new setting is proper and how to configure it to\ndefend against unknown DoS attacks. In this paper, we make the first step to\naddress this challenging issue by first proposing an emulation-based framework\nto automatically measure the resource consumptions of EVM operations. The\nresults reveal that Ethereum's new setting is still not proper. Moreover, we\nobtain an insight that there may always exist exploitable under-priced\noperations if the cost is fixed. Hence, we propose a novel gas cost mechanism,\nwhich dynamically adjusts the costs of EVM operations according to the number\nof executions, to thwart DoS attacks. This method punishes the operations that\nare executed much more frequently than before and lead to high gas costs. To\nmake our solution flexible and secure and avoid frequent update of Ethereum\nclient, we design a special smart contract that collaborates with the updated\nEVM for dynamic parameter adjustment. Experimental results demonstrate that our\nmethod can effectively thwart both known and unknown DoS attacks with flexible\nparameter settings. Moreover, our method only introduces negligible additional\ngas consumption for benign users.\n", "versions": [{"version": "v1", "created": "Mon, 18 Dec 2017 14:57:11 GMT"}, {"version": "v2", "created": "Wed, 4 Nov 2020 17:02:15 GMT"}], "update_date": "2020-11-05", "authors_parsed": [["Chen", "Ting", ""], ["Li", "Xiaoqi", ""], ["Wang", "Ying", ""], ["Chen", "Jiachi", ""], ["Li", "Zihao", ""], ["Luo", "Xiapu", ""], ["Au", "Man Ho", ""], ["Zhang", "Xiaosong", ""]]}, {"id": "1712.06646", "submitter": "George Kesidis", "authors": "David J. Miller and Yulia Wang and George Kesidis", "title": "When Not to Classify: Anomaly Detection of Attacks (ADA) on DNN\n  Classifiers at Test Time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A significant threat to the recent, wide deployment of machine learning-based\nsystems, including deep neural networks (DNNs), is adversarial learning\nattacks. We analyze possible test-time evasion-attack mechanisms and show that,\nin some important cases, when the image has been attacked, correctly\nclassifying it has no utility: i) when the image to be attacked is (even\narbitrarily) selected from the attacker's cache; ii) when the sole recipient of\nthe classifier's decision is the attacker. Moreover, in some application\ndomains and scenarios it is highly actionable to detect the attack irrespective\nof correctly classifying in the face of it (with classification still performed\nif no attack is detected). We hypothesize that, even if human-imperceptible,\nadversarial perturbations are machine-detectable. We propose a purely\nunsupervised anomaly detector (AD) that, unlike previous works: i) models the\njoint density of a deep layer using highly suitable null hypothesis density\nmodels (matched in particular to the non- negative support for RELU layers);\nii) exploits multiple DNN layers; iii) leverages a \"source\" and \"destination\"\nclass concept, source class uncertainty, the class confusion matrix, and DNN\nweight information in constructing a novel decision statistic grounded in the\nKullback-Leibler divergence. Tested on MNIST and CIFAR-10 image databases under\nthree prominent attack strategies, our approach outperforms previous detection\nmethods, achieving strong ROC AUC detection accuracy on two attacks and better\naccuracy than recently reported for a variety of methods on the strongest (CW)\nattack. We also evaluate a fully white box attack on our system. Finally, we\nevaluate other important performance measures, such as classification accuracy,\nversus detection rate and attack strength.\n", "versions": [{"version": "v1", "created": "Mon, 18 Dec 2017 19:48:04 GMT"}, {"version": "v2", "created": "Thu, 28 Jun 2018 02:40:33 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Miller", "David J.", ""], ["Wang", "Yulia", ""], ["Kesidis", "George", ""]]}, {"id": "1712.06793", "submitter": "Han Guoan", "authors": "Liang Xiao, Guoan Han, Donghua Jiang, Hongzi Zhu, Yanyong Zhang, H.\n  Vincent Poor", "title": "Two-dimensional Anti-jamming Mobile Communication Based on Reinforcement\n  Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By using smart radio devices, a jammer can dynamically change its jamming\npolicy based on opposing security mechanisms; it can even induce the mobile\ndevice to enter a specific communication mode and then launch the jamming\npolicy accordingly. On the other hand, mobile devices can exploit spread\nspectrum and user mobility to address both jamming and interference. In this\npaper, a two-dimensional anti-jamming mobile communication scheme is proposed\nin which a mobile device leaves a heavily jammed/interfered-with frequency or\narea. It is shown that, by applying reinforcement learning techniques, a mobile\ndevice can achieve an optimal communication policy without the need to know the\njamming and interference model and the radio channel model in a dynamic game\nframework. More specifically, a hotbooting deep Q-network based two-dimensional\nmobile communication scheme is proposed that exploits experiences in similar\nscenarios to reduce the exploration time at the beginning of the game, and\napplies deep convolutional neural network and macro-action techniques to\naccelerate the learning speed in dynamic situations. Several real-world\nscenarios are simulated to evaluate the proposed method. These simulation\nresults show that our proposed scheme can improve both the\nsignal-to-interference-plus-noise ratio of the signals and the utility of the\nmobile devices against cooperative jamming compared with benchmark schemes.\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 06:01:31 GMT"}], "update_date": "2017-12-20", "authors_parsed": [["Xiao", "Liang", ""], ["Han", "Guoan", ""], ["Jiang", "Donghua", ""], ["Zhu", "Hongzi", ""], ["Zhang", "Yanyong", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1712.06804", "submitter": "Lei Yu", "authors": "Lei Yu and Vincent Y. F. Tan", "title": "Asymptotic Coupling and Its Applications in Information Theory", "comments": "To appear in the IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A coupling of two distributions $P_{X}$ and $P_{Y}$ is a joint distribution\n$P_{XY}$ with marginal distributions equal to $P_{X}$ and $P_{Y}$. Given\nmarginals $P_{X}$ and $P_{Y}$ and a real-valued function $f$ of the joint\ndistribution $P_{XY}$, what is its minimum over all couplings $P_{XY}$ of\n$P_{X}$ and $P_{Y}$? We study the asymptotics of such coupling problems with\ndifferent $f$'s and with $X$ and $Y$ replaced by $X^{n}=(X_{1},\\ldots,X_{n})$\nand $Y^{n}=(Y_{1},\\ldots,Y_{n})$ where $X_{i}$ and $Y_{i}$ are i.i.d.\\ copies\nof random variables $X$ and $Y$ with distributions $P_{X}$ and $P_{Y}$\nrespectively. These include the maximal coupling, minimum distance coupling,\nmaximal guessing coupling, and minimum entropy coupling problems. We\ncharacterize the limiting values of these coupling problems as $n$ tends to\ninfinity. We show that they typically converge at least exponentially fast to\ntheir limits. Moreover, for the problems of maximal coupling and minimum\nexcess-distance probability coupling, we also characterize (or bound) the\noptimal convergence rates (exponents). Furthermore, for the maximal guessing\ncoupling problem we show that it is equivalent to the distribution\napproximation problem. Therefore, some existing results for the latter problem\ncan be used to derive the asymptotics of the maximal guessing coupling problem.\nWe also study the asymptotics of the maximal guessing coupling problem for two\n\\emph{general} sources and a generalization of this problem, named the\n\\emph{maximal guessing coupling through a channel problem}. We apply the\npreceding results to several new information-theoretic problems, including\nexact intrinsic randomness, exact resolvability, channel capacity with input\ndistribution constraint, and perfect stealth and secrecy communication.\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 07:18:15 GMT"}, {"version": "v2", "created": "Tue, 17 Jul 2018 07:29:15 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Yu", "Lei", ""], ["Tan", "Vincent Y. F.", ""]]}, {"id": "1712.06850", "submitter": "Johan Mazel", "authors": "Johan Mazel, Richard Garnier, Kensuke Fukuda", "title": "A comparison of web privacy protection techniques", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A comparison of web privacy protection techniques\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 10:21:36 GMT"}], "update_date": "2017-12-20", "authors_parsed": [["Mazel", "Johan", ""], ["Garnier", "Richard", ""], ["Fukuda", "Kensuke", ""]]}, {"id": "1712.06951", "submitter": "Yan Ke", "authors": "Ming-ming Liu, Min-qing Zhang, Jia Liu, Ying-nan Zhang, Yan Ke", "title": "Coverless Information Hiding Based on Generative adversarial networks", "comments": "arXiv admin note: text overlap with arXiv:1703.05502 by other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional image steganography modifies the content of the image more or\nless, it is hard to resist the detection of image steganalysis tools. To\naddress this problem, a novel method named generative coverless information\nhiding method based on generative adversarial networks is proposed in this\npaper. The main idea of the method is that the class label of generative\nadversarial networks is replaced with the secret information as a driver to\ngenerate hidden image directly, and then extract the secret information from\nthe hidden image through the discriminator. It's the first time that the\ncoverless information hiding is achieved by generative adversarial networks.\nCompared with the traditional image steganography, this method does not modify\nthe content of the original image. therefore, this method can resist image\nsteganalysis tools effectively. In terms of steganographic capacity,\nanti-steganalysis, safety and reliability, the experimen shows that this hidden\nalgorithm performs well.\n", "versions": [{"version": "v1", "created": "Mon, 18 Dec 2017 06:00:57 GMT"}], "update_date": "2017-12-20", "authors_parsed": [["Liu", "Ming-ming", ""], ["Zhang", "Min-qing", ""], ["Liu", "Jia", ""], ["Zhang", "Ying-nan", ""], ["Ke", "Yan", ""]]}, {"id": "1712.06997", "submitter": "Li Yang", "authors": "Huiqin Xie, Li Yang", "title": "Quantum impossible differential and truncated differential cryptanalysis", "comments": "33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional cryptography is suffering a huge threat from the development of\nquantum computing. While many currently used public-key cryptosystems would be\nbroken by Shor's algorithm, the effect of quantum computing on symmetric ones\nis still unclear. The security of symmetric ciphers relies heavily on the\ndevelopment of cryptanalytic tools. Thus, in order to accurately evaluate the\nsecurity of symmetric primitives in the post-quantum world, it is significant\nto improve classical cryptanalytic methods using quantum algorithms. In this\npaper, we focus on two variants of differential cryptanalysis: truncated\ndifferential cryptanalysis and impossible differential cryptanalysis. Based on\nthe fact that Bernstein-Vazirani algorithm can be used to find the linear\nstructures of Boolean functions, we propose two quantum algorithms that can be\nused to find high-probability truncated differentials and impossible\ndifferentials of block ciphers, respectively. We rigorously prove the validity\nof the algorithms and analyze their complexity. Our algorithms treat all rounds\nof the reduced cipher as a whole and only concerns the input and output\ndifferences at its both ends, instead of specific differential characteristics.\nTherefore, to a certain extent, they alleviate the weakness of conventional\ndifferential cryptanalysis, namely the difficulties in finding differential\ncharacteristics as the number of rounds increases.\n", "versions": [{"version": "v1", "created": "Mon, 18 Dec 2017 02:37:11 GMT"}, {"version": "v2", "created": "Mon, 23 Jul 2018 07:29:41 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Xie", "Huiqin", ""], ["Yang", "Li", ""]]}, {"id": "1712.07008", "submitter": "Ardhendu Shekhar Tripathy", "authors": "Ardhendu Tripathy and Ye Wang and Prakash Ishwar", "title": "Privacy-Preserving Adversarial Networks", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.GT cs.LG math.IT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a data-driven framework for optimizing privacy-preserving data\nrelease mechanisms to attain the information-theoretically optimal tradeoff\nbetween minimizing distortion of useful data and concealing specific sensitive\ninformation. Our approach employs adversarially-trained neural networks to\nimplement randomized mechanisms and to perform a variational approximation of\nmutual information privacy. We validate our Privacy-Preserving Adversarial\nNetworks (PPAN) framework via proof-of-concept experiments on discrete and\ncontinuous synthetic data, as well as the MNIST handwritten digits dataset. For\nsynthetic data, our model-agnostic PPAN approach achieves tradeoff points very\nclose to the optimal tradeoffs that are analytically-derived from model\nknowledge. In experiments with the MNIST data, we visually demonstrate a\nlearned tradeoff between minimizing the pixel-level distortion versus\nconcealing the written digit.\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 15:53:45 GMT"}, {"version": "v2", "created": "Wed, 9 Jan 2019 13:49:31 GMT"}, {"version": "v3", "created": "Wed, 12 Jun 2019 14:42:37 GMT"}], "update_date": "2019-06-13", "authors_parsed": [["Tripathy", "Ardhendu", ""], ["Wang", "Ye", ""], ["Ishwar", "Prakash", ""]]}, {"id": "1712.07021", "submitter": "Yi-Peng Wei", "authors": "Yi-Peng Wei and Karim Banawan and Sennur Ulukus", "title": "Cache-Aided Private Information Retrieval with Partially Known Uncoded\n  Prefetching: Fundamental Limits", "comments": "Submitted for publication, December 2017. arXiv admin note:\n  substantial text overlap with arXiv:1709.01056", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of private information retrieval (PIR) from $N$\nnon-colluding and replicated databases, when the user is equipped with a cache\nthat holds an uncoded fraction $r$ of the symbols from each of the $K$ stored\nmessages in the databases. This model operates in a two-phase scheme, namely,\nthe prefetching phase where the user acquires side information and the\nretrieval phase where the user privately downloads the desired message. In the\nprefetching phase, the user receives $\\frac{r}{N}$ uncoded fraction of each\nmessage from the $n$th database. This side information is known only to the\n$n$th database and unknown to the remaining databases, i.e., the user possesses\n\\emph{partially known} side information. We investigate the optimal normalized\ndownload cost $D^*(r)$ in the retrieval phase as a function of $K$, $N$, $r$.\nWe develop lower and upper bounds for the optimal download cost. The bounds\nmatch in general for the cases of very low caching ratio ($r \\leq\n\\frac{1}{N^{K-1}}$) and very high caching ratio ($r \\geq\n\\frac{K-2}{N^2-3N+KN}$). We fully characterize the optimal download cost\ncaching ratio tradeoff for $K=3$. For general $K$, $N$, and $r$, we show that\nthe largest gap between the achievability and the converse bounds is\n$\\frac{5}{32}$.\n", "versions": [{"version": "v1", "created": "Mon, 18 Dec 2017 18:50:42 GMT"}], "update_date": "2017-12-20", "authors_parsed": [["Wei", "Yi-Peng", ""], ["Banawan", "Karim", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1712.07107", "submitter": "Xiaoyong Yuan", "authors": "Xiaoyong Yuan, Pan He, Qile Zhu, Xiaolin Li", "title": "Adversarial Examples: Attacks and Defenses for Deep Learning", "comments": "Github: https://github.com/chbrian/awesome-adversarial-examples-dl", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR cs.CV stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With rapid progress and significant successes in a wide spectrum of\napplications, deep learning is being applied in many safety-critical\nenvironments. However, deep neural networks have been recently found vulnerable\nto well-designed input samples, called adversarial examples. Adversarial\nexamples are imperceptible to human but can easily fool deep neural networks in\nthe testing/deploying stage. The vulnerability to adversarial examples becomes\none of the major risks for applying deep neural networks in safety-critical\nenvironments. Therefore, attacks and defenses on adversarial examples draw\ngreat attention. In this paper, we review recent findings on adversarial\nexamples for deep neural networks, summarize the methods for generating\nadversarial examples, and propose a taxonomy of these methods. Under the\ntaxonomy, applications for adversarial examples are investigated. We further\nelaborate on countermeasures for adversarial examples and explore the\nchallenges and the potential solutions.\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 18:44:07 GMT"}, {"version": "v2", "created": "Fri, 5 Jan 2018 15:51:54 GMT"}, {"version": "v3", "created": "Sat, 7 Jul 2018 02:32:57 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Yuan", "Xiaoyong", ""], ["He", "Pan", ""], ["Zhu", "Qile", ""], ["Li", "Xiaolin", ""]]}, {"id": "1712.07196", "submitter": "Thomas Steinke", "authors": "Vitaly Feldman, Thomas Steinke", "title": "Calibrating Noise to Variance in Adaptive Data Analysis", "comments": "Accepted for presentation at Conference on Learning Theory (COLT)\n  2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR cs.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Datasets are often used multiple times and each successive analysis may\ndepend on the outcome of previous analyses. Standard techniques for ensuring\ngeneralization and statistical validity do not account for this adaptive\ndependence. A recent line of work studies the challenges that arise from such\nadaptive data reuse by considering the problem of answering a sequence of\n\"queries\" about the data distribution where each query may depend arbitrarily\non answers to previous queries.\n  The strongest results obtained for this problem rely on differential privacy\n-- a strong notion of algorithmic stability with the important property that it\n\"composes\" well when data is reused. However the notion is rather strict, as it\nrequires stability under replacement of an arbitrary data element. The simplest\nalgorithm is to add Gaussian (or Laplace) noise to distort the empirical\nanswers. However, analysing this technique using differential privacy yields\nsuboptimal accuracy guarantees when the queries have low variance. Here we\npropose a relaxed notion of stability that also composes adaptively. We\ndemonstrate that a simple and natural algorithm based on adding noise scaled to\nthe standard deviation of the query provides our notion of stability. This\nimplies an algorithm that can answer statistical queries about the dataset with\nsubstantially improved accuracy guarantees for low-variance queries. The only\nprevious approach that provides such accuracy guarantees is based on a more\ninvolved differentially private median-of-means algorithm and its analysis\nexploits stronger \"group\" stability of the algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 20:42:39 GMT"}, {"version": "v2", "created": "Mon, 11 Jun 2018 19:14:14 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Feldman", "Vitaly", ""], ["Steinke", "Thomas", ""]]}, {"id": "1712.07211", "submitter": "Delaram Kahrobaei", "authors": "Jean-Charles Faug`ere, Kelsey Horan, Delaram Kahrobaei, Marc Kaplan,\n  Elham Kashefi, Ludovic Perret", "title": "Fast Quantum Algorithm for Solving Multivariate Quadratic Equations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In August 2015 the cryptographic world was shaken by a sudden and surprising\nannouncement by the US National Security Agency NSA concerning plans to\ntransition to post-quantum algorithms. Since this announcement post-quantum\ncryptography has become a topic of primary interest for several standardization\nbodies. The transition from the currently deployed public-key algorithms to\npost-quantum algorithms has been found to be challenging in many aspects. In\nparticular the problem of evaluating the quantum-bit security of such\npost-quantum cryptosystems remains vastly open. Of course this question is of\nprimarily concern in the process of standardizing the post-quantum\ncryptosystems. In this paper we consider the quantum security of the problem of\nsolving a system of {\\it $m$ Boolean multivariate quadratic equations in $n$\nvariables} (\\MQb); a central problem in post-quantum cryptography. When $n=m$,\nunder a natural algebraic assumption, we present a Las-Vegas quantum algorithm\nsolving \\MQb{} that requires the evaluation of, on average, $O(2^{0.462n})$\nquantum gates. To our knowledge this is the fastest algorithm for solving\n\\MQb{}.\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 21:06:06 GMT"}], "update_date": "2017-12-21", "authors_parsed": [["Faug`ere", "Jean-Charles", ""], ["Horan", "Kelsey", ""], ["Kahrobaei", "Delaram", ""], ["Kaplan", "Marc", ""], ["Kashefi", "Elham", ""], ["Perret", "Ludovic", ""]]}, {"id": "1712.07473", "submitter": "Mikhail Kudinov", "authors": "Vadim Popov, Mikhail Kudinov, Irina Piontkovskaya, Petr Vytovtov and\n  Alex Nevidomsky", "title": "Differentially Private Distributed Learning for Language Modeling Tasks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the big challenges in machine learning applications is that training\ndata can be different from the real-world data faced by the algorithm. In\nlanguage modeling, users' language (e.g. in private messaging) could change in\na year and be completely different from what we observe in publicly available\ndata. At the same time, public data can be used for obtaining general knowledge\n(i.e. general model of English). We study approaches to distributed fine-tuning\nof a general model on user private data with the additional requirements of\nmaintaining the quality on the general data and minimization of communication\ncosts. We propose a novel technique that significantly improves prediction\nquality on users' language compared to a general model and outperforms gradient\ncompression methods in terms of communication efficiency. The proposed\nprocedure is fast and leads to an almost 70% perplexity reduction and 8.7\npercentage point improvement in keystroke saving rate on informal English\ntexts. We also show that the range of tasks our approach is applicable to is\nnot limited by language modeling only. Finally, we propose an experimental\nframework for evaluating differential privacy of distributed training of\nlanguage models and show that our approach has good privacy guarantees.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 13:28:13 GMT"}, {"version": "v2", "created": "Fri, 29 Dec 2017 14:10:05 GMT"}, {"version": "v3", "created": "Tue, 6 Mar 2018 13:10:31 GMT"}], "update_date": "2018-03-07", "authors_parsed": [["Popov", "Vadim", ""], ["Kudinov", "Mikhail", ""], ["Piontkovskaya", "Irina", ""], ["Vytovtov", "Petr", ""], ["Nevidomsky", "Alex", ""]]}, {"id": "1712.07557", "submitter": "Robin Geyer", "authors": "Robin C. Geyer, Tassilo Klein, Moin Nabi", "title": "Differentially Private Federated Learning: A Client Level Perspective", "comments": "NIPS 2017 Workshop: Machine Learning on the Phone and other Consumer\n  Devices", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Federated learning is a recent advance in privacy protection. In this\ncontext, a trusted curator aggregates parameters optimized in decentralized\nfashion by multiple clients. The resulting model is then distributed back to\nall clients, ultimately converging to a joint representative model without\nexplicitly having to share the data. However, the protocol is vulnerable to\ndifferential attacks, which could originate from any party contributing during\nfederated optimization. In such an attack, a client's contribution during\ntraining and information about their data set is revealed through analyzing the\ndistributed model. We tackle this problem and propose an algorithm for client\nsided differential privacy preserving federated optimization. The aim is to\nhide clients' contributions during training, balancing the trade-off between\nprivacy loss and model performance. Empirical studies suggest that given a\nsufficiently large number of participating clients, our proposed procedure can\nmaintain client-level differential privacy at only a minor cost in model\nperformance.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 16:28:37 GMT"}, {"version": "v2", "created": "Thu, 1 Mar 2018 10:12:27 GMT"}], "update_date": "2018-03-02", "authors_parsed": [["Geyer", "Robin C.", ""], ["Klein", "Tassilo", ""], ["Nabi", "Moin", ""]]}, {"id": "1712.07564", "submitter": "Oguzhan Ersoy", "authors": "Oguzhan Ersoy, Zhijie Ren, Zekeriya Erkin and Reginald L. Lagendijk", "title": "Transaction Propagation on Permissionless Blockchains: Incentive and\n  Routing Mechanisms", "comments": "2018 Crypto Valley Conference on Blockchain Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Existing permissionless blockchain solutions rely on peer-to-peer propagation\nmechanisms, where nodes in a network transfer transaction they received to\ntheir neighbors. Unfortunately, there is no explicit incentive for such\ntransaction propagation. Therefore, existing propagation mechanisms will not be\nsustainable in a fully decentralized blockchain with rational nodes. In this\nwork, we formally define the problem of incentivizing nodes for transaction\npropagation. We propose an incentive mechanism where each node involved in the\npropagation of a transaction receives a share of the transaction fee. We also\nshow that our proposal is Sybil-proof. Furthermore, we combine the incentive\nmechanism with smart routing to reduce the communication and storage costs at\nthe same time. The proposed routing mechanism reduces the redundant transaction\npropagation from the size of the network to a factor of average shortest path\nlength. The routing mechanism is built upon a specific type of consensus\nprotocol where the round leader who creates the transaction block is known in\nadvance. Note that our routing mechanism is a generic one and can be adopted\nindependently from the incentive mechanism.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 16:37:13 GMT"}, {"version": "v2", "created": "Thu, 14 Jun 2018 14:53:02 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["Ersoy", "Oguzhan", ""], ["Ren", "Zhijie", ""], ["Erkin", "Zekeriya", ""], ["Lagendijk", "Reginald L.", ""]]}, {"id": "1712.07601", "submitter": "Mehran Alidoost Nia", "authors": "Mehran Alidoost Nia, Eduard Babulak, Benjamin Fabian, and Reza\n  Ebrahimi Atani", "title": "An Analytical Perspective to Traffic Engineering in Anonymous\n  Communication Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Anonymous communication systems (ACS) offer privacy and anonymity through the\nInternet. They are mostly free tools and are popular among users all over the\nworld. In the recent years, anonymity applications faced many problems\nregarding traffic engineering methods. Even though they ensure privacy under\nsome conditions, their anonymity will be endangered by high performance\nprocessing units. To address these issues, this study is devoted to\ninvestigating traffic-engineering methods in anonymous communication systems,\nand proposes an analytical view of the current issues in ACS privacy and\nanonymity. Our study also indicates new types of solutions for these current\nissues with ACS.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 17:33:25 GMT"}], "update_date": "2017-12-21", "authors_parsed": [["Nia", "Mehran Alidoost", ""], ["Babulak", "Eduard", ""], ["Fabian", "Benjamin", ""], ["Atani", "Reza Ebrahimi", ""]]}, {"id": "1712.07671", "submitter": "Justin Doak", "authors": "Justin E. Doak (JD), Joe B. Ingram, Sam A. Mulder, John H. Naegle,\n  Jonathan A. Cox, James B. Aimone, Kevin R. Dixon, Conrad D. James, David R.\n  Follett", "title": "Tracking Cyber Adversaries with Adaptive Indicators of Compromise", "comments": "This was presented at the 4th Annual Conf. on Computational Science &\n  Computational Intelligence (CSCI'17) held Dec 14-16, 2017 in Las Vegas,\n  Nevada, USA", "journal-ref": "This will be in the proceedings of the 4th Annual Conf. on\n  Computational Science & Computational Intelligence (CSCI'17) held Dec 14-16,\n  2017 in Las Vegas, Nevada, USA", "doi": null, "report-no": "SAND2017-12402 C", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A forensics investigation after a breach often uncovers network and host\nindicators of compromise (IOCs) that can be deployed to sensors to allow early\ndetection of the adversary in the future. Over time, the adversary will change\ntactics, techniques, and procedures (TTPs), which will also change the data\ngenerated. If the IOCs are not kept up-to-date with the adversary's new TTPs,\nthe adversary will no longer be detected once all of the IOCs become invalid.\nTracking the Known (TTK) is the problem of keeping IOCs, in this case regular\nexpressions (regexes), up-to-date with a dynamic adversary. Our framework\nsolves the TTK problem in an automated, cyclic fashion to bracket a previously\ndiscovered adversary. This tracking is accomplished through a data-driven\napproach of self-adapting a given model based on its own detection\ncapabilities.\n  In our initial experiments, we found that the true positive rate (TPR) of the\nadaptive solution degrades much less significantly over time than the naive\nsolution, suggesting that self-updating the model allows the continued\ndetection of positives (i.e., adversaries). The cost for this performance is in\nthe false positive rate (FPR), which increases over time for the adaptive\nsolution, but remains constant for the naive solution. However, the difference\nin overall detection performance, as measured by the area under the curve\n(AUC), between the two methods is negligible. This result suggests that\nself-updating the model over time should be done in practice to continue to\ndetect known, evolving adversaries.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 19:04:28 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Doak", "Justin E.", "", "JD"], ["Ingram", "Joe B.", ""], ["Mulder", "Sam A.", ""], ["Naegle", "John H.", ""], ["Cox", "Jonathan A.", ""], ["Aimone", "James B.", ""], ["Dixon", "Kevin R.", ""], ["James", "Conrad D.", ""], ["Follett", "David R.", ""]]}, {"id": "1712.07672", "submitter": "Reza Hooshmand", "authors": "Reza Hooshmand, Masoumeh Koochak Shooshtari, Mohammad Reza Aref", "title": "PKC-PC: A Variant of the McEliece Public Key Cryptosystem based on Polar\n  Codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Polar codes are novel and efficient error correcting codes with low encoding\nand decoding complexities. These codes have a channel dependent generator\nmatrix which is determined by the code dimension, code length and transmission\nchannel parameters. This paper studies a variant of the McEliece public key\ncryptosystem based on polar codes, called \"PKC-PC\". Due to the fact that the\nstructure of polar codes' generator matrix depends on the parameters of\nchannel, we used an efficient approach to conceal their generator matrix. Then,\nby the help of the characteristics of polar codes and also introducing an\nefficient approach, we reduced the public and private key sizes of the PKC-PC\nand increased its information rate compared to the McEliece cryptosystem. It\nwas shown that polar codes are able to yield an increased security level\nagainst conventional attacks and possible vulnerabilities on the code-based\npublic key cryptosystems. Moreover, it is indicated that the security of the\nPKC-PC is reduced to solve NP-complete problems. Compared to other post-quantum\npublic key schemes, we believe that the PKC-PC is a promising candidate for\nNIST post-quantum crypto standardization.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 19:04:50 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Hooshmand", "Reza", ""], ["Shooshtari", "Masoumeh Koochak", ""], ["Aref", "Mohammad Reza", ""]]}, {"id": "1712.07694", "submitter": "Somnath Chakrabarti", "authors": "Somnath Chakrabarti, Brandon Baker, Mona Vij", "title": "Intel SGX Enabled Key Manager Service with OpenStack Barbican", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protecting data in the cloud continues to gain in importance, with encryption\nbeing used to achieve the desired data protection. While there is desire to use\nencryption, various cloud components do not want to deal with key management,\nwhich points to a strong need for a separate key management system. OpenStack\nBarbican is a platform developed by the OpenStack community aimed at providing\ncryptographic functions useful for all environments, including large ephemeral\nclouds. Barbican exposes REST APIs designed for the secure storage,\nprovisioning and management of secrets such as passwords, encryption keys, and\nX.509 certificates, and supports plugins for a variety of crypto solutions in\nthe backend. Crypto plugins store secrets as encrypted blobs within the\nBarbican database. Software based crypto plugins offer a scalable solution, but\nare vulnerable to system software attacks. Hardware Security Module or HSM\nplugins offer strong security guarantees, but they are expensive and don't\nscale well. We propose to build an Intel Software Guard Extension or SGX based\nsoftware crypto plugin that offers security similar to an HSM with the low cost\nand scalability of a software based solution. We extend OpenStack Barbican API\nto support attestation of an Intel SGX crypto plugin, to allow clients higher\nconfidence in the software they are using for storing keys. In addition, the\nAPI provides support for mutual attestation for Intel SGX enabled clients,\nmulti-user key distribution, and extensions for protecting the confidentiality\nand integrity of the backend database.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 20:19:37 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Chakrabarti", "Somnath", ""], ["Baker", "Brandon", ""], ["Vij", "Mona", ""]]}, {"id": "1712.07740", "submitter": "Ibbad Hafeez", "authors": "Ibbad Hafeez, Aaron Yi Ding, Sasu Tarkoma", "title": "Securing Edge Networks with Securebox", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The number of mobile and IoT devices connected to home and enterprise\nnetworks is growing fast. These devices offer new services and experiences for\nthe users; however, they also present new classes of security threats\npertaining to data and device safety and user privacy. In this article, we\nfirst analyze the potential threats presented by these devices connected to\nedge networks. We then propose Securebox: a new cloud-driven, low cost\nSecurity-as-a-Service solution that applies Software-Defined Networking (SDN)\nto improve network monitoring, security and management. Securebox enables\nremote management of networks through a cloud security service (CSS) with\nminimal user intervention required. To reduce costs and improve the\nscalability, Securebox is based on virtualized middleboxes provided by CSS. Our\nproposal differs from the existing solutions by integrating the SDN and cloud\ninto a unified edge security solution, and by offering a collaborative\nprotection mechanism that enables rapid security policy dissemination across\nall connected networks in mitigating new threats or attacks detected by the\nsystem. We have implemented two Securebox prototypes, using a low-cost\nRaspberry-PI and off-the-shelf fanless PC. Our system evaluation has shown that\nSecurebox can achieve automatic network security and be deployed incrementally\nto the infrastructure with low management overhead.\n", "versions": [{"version": "v1", "created": "Wed, 20 Dec 2017 22:47:19 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Hafeez", "Ibbad", ""], ["Ding", "Aaron Yi", ""], ["Tarkoma", "Sasu", ""]]}, {"id": "1712.07770", "submitter": "Seonmo Kim", "authors": "Seonmo Kim and Stephen McCamant", "title": "Bit-Vector Model Counting using Statistical Estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Approximate model counting for bit-vector SMT formulas (generalizing \\#SAT)\nhas many applications such as probabilistic inference and quantitative\ninformation-flow security, but it is computationally difficult. Adding random\nparity constraints (XOR streamlining) and then checking satisfiability is an\neffective approximation technique, but it requires a prior hypothesis about the\nmodel count to produce useful results. We propose an approach inspired by\nstatistical estimation to continually refine a probabilistic estimate of the\nmodel count for a formula, so that each XOR-streamlined query yields as much\ninformation as possible. We implement this approach, with an approximate\nprobability model, as a wrapper around an off-the-shelf SMT solver or SAT\nsolver. Experimental results show that the implementation is faster than the\nmost similar previous approaches which used simpler refinement strategies. The\ntechnique also lets us model count formulas over floating-point constraints,\nwhich we demonstrate with an application to a vulnerability in differential\nprivacy mechanisms.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 02:05:25 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Kim", "Seonmo", ""], ["McCamant", "Stephen", ""]]}, {"id": "1712.07805", "submitter": "Kang Li", "authors": "Qixue Xiao, Kang Li, Deyue Zhang, Yier Jin", "title": "Wolf in Sheep's Clothing - The Downscaling Attack Against Deep Learning\n  Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers security risks buried in the data processing pipeline in\ncommon deep learning applications. Deep learning models usually assume a fixed\nscale for their training and input data. To allow deep learning applications to\nhandle a wide range of input data, popular frameworks, such as Caffe,\nTensorFlow, and Torch, all provide data scaling functions to resize input to\nthe dimensions used by deep learning models. Image scaling algorithms are\nintended to preserve the visual features of an image after scaling. However,\ncommon image scaling algorithms are not designed to handle human crafted\nimages. Attackers can make the scaling outputs look dramatically different from\nthe corresponding input images.\n  This paper presents a downscaling attack that targets the data scaling\nprocess in deep learning applications. By carefully crafting input data that\nmismatches with the dimension used by deep learning models, attackers can\ncreate deceiving effects. A deep learning application effectively consumes data\nthat are not the same as those presented to users. The visual inconsistency\nenables practical evasion and data poisoning attacks to deep learning\napplications. This paper presents proof-of-concept attack samples to popular\ndeep-learning-based image classification applications. To address the\ndownscaling attacks, the paper also suggests multiple potential mitigation\nstrategies.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 06:17:43 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Xiao", "Qixue", ""], ["Li", "Kang", ""], ["Zhang", "Deyue", ""], ["Jin", "Yier", ""]]}, {"id": "1712.07816", "submitter": "Mohammad Shahrad", "authors": "Mohammad Shahrad, Arsalan Mosenia, Liwei Song, Mung Chiang, David\n  Wentzlaff, Prateek Mittal", "title": "Acoustic Denial of Service Attacks on HDDs", "comments": "8 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Among storage components, hard disk drives (HDDs) have become the most\ncommonly-used type of non-volatile storage due to their recent technological\nadvances, including, enhanced energy efficacy and significantly-improved areal\ndensity. Such advances in HDDs have made them an inevitable part of numerous\ncomputing systems, including, personal computers, closed-circuit television\n(CCTV) systems, medical bedside monitors, and automated teller machines (ATMs).\nDespite the widespread use of HDDs and their critical role in real-world\nsystems, there exist only a few research studies on the security of HDDs. In\nparticular, prior research studies have discussed how HDDs can potentially leak\ncritical private information through acoustic or electromagnetic emanations.\nBorrowing theoretical principles from acoustics and mechanics, we propose a\nnovel denial-of-service (DoS) attack against HDDs that exploits a physical\nphenomenon, known as acoustic resonance. We perform a comprehensive examination\nof physical characteristics of several HDDs and create acoustic signals that\ncause significant vibrations in HDD's internal components. We demonstrate that\nsuch vibrations can negatively influence the performance of HDDs embedded in\nreal-world systems. We show the feasibility of the proposed attack in two\nreal-world case studies, namely, personal computers and CCTVs.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 07:42:46 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Shahrad", "Mohammad", ""], ["Mosenia", "Arsalan", ""], ["Song", "Liwei", ""], ["Chiang", "Mung", ""], ["Wentzlaff", "David", ""], ["Mittal", "Prateek", ""]]}, {"id": "1712.07882", "submitter": "Felix Schuster", "authors": "Manuel Costa, Lawrence Esswood, Olga Ohrimenko, Felix Schuster, Sameer\n  Wagh", "title": "The Pyramid Scheme: Oblivious RAM for Trusted Processors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern processors, e.g., Intel SGX, allow applications to isolate secret code\nand data in encrypted memory regions called enclaves. While encryption\neffectively hides the contents of memory, the sequence of address references\nissued by the secret code leaks information. This is a serious problem because\nthese leaks can easily break the confidentiality guarantees of enclaves.\n  In this paper, we explore Oblivious RAM (ORAM) designs that prevent these\ninformation leaks under the constraints of modern SGX processors. Most ORAMs\nare a poor fit for these processors because they have high constant overhead\nfactors or require large private memories, which are not available in these\nprocessors. We address these limitations with a new hierarchical ORAM\nconstruction, the Pyramid ORAM, that is optimized towards online bandwidth cost\nand small blocks. It uses a new hashing scheme that circumvents the complexity\nof previous hierarchical schemes.\n  We present an efficient x64-optimized implementation of Pyramid ORAM that\nuses only the processor's registers as private memory. We compare Pyramid ORAM\nwith Circuit ORAM, a state-of-the-art tree-based ORAM scheme that also uses\nconstant private memory. Pyramid ORAM has better online asymptotical complexity\nthan Circuit ORAM. Our implementation of Pyramid ORAM and Circuit ORAM\nvalidates this: as all hierarchical schemes, Pyramid ORAM has high variance of\naccess latencies; although latency can be high for some accesses, for typical\nconfigurations Pyramid ORAM provides access latencies that are 8X better than\nCircuit ORAM for 99% of accesses. Although the best known hierarchical ORAM has\nbetter asymptotical complexity, Pyramid ORAM has significantly lower constant\noverhead factors, making it the preferred choice in practice.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 11:32:03 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Costa", "Manuel", ""], ["Esswood", "Lawrence", ""], ["Ohrimenko", "Olga", ""], ["Schuster", "Felix", ""], ["Wagh", "Sameer", ""]]}, {"id": "1712.08062", "submitter": "Earlence T Fernandes", "authors": "Kevin Eykholt, Ivan Evtimov, Earlence Fernandes, Bo Li, Dawn Song,\n  Tadayoshi Kohno, Amir Rahmati, Atul Prakash, Florian Tramer", "title": "Note on Attacking Object Detectors with Adversarial Stickers", "comments": "Short Note: The full version of this paper was accepted to USENIX\n  WOOT 2018, and is available at arXiv:1807.07769", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep learning has proven to be a powerful tool for computer vision and has\nseen widespread adoption for numerous tasks. However, deep learning algorithms\nare known to be vulnerable to adversarial examples. These adversarial inputs\nare created such that, when provided to a deep learning algorithm, they are\nvery likely to be mislabeled. This can be problematic when deep learning is\nused to assist in safety critical decisions. Recent research has shown that\nclassifiers can be attacked by physical adversarial examples under various\nphysical conditions. Given the fact that state-of-the-art objection detection\nalgorithms are harder to be fooled by the same set of adversarial examples,\nhere we show that these detectors can also be attacked by physical adversarial\nexamples. In this note, we briefly show both static and dynamic test results.\nWe design an algorithm that produces physical adversarial inputs, which can\nfool the YOLO object detector and can also attack Faster-RCNN with relatively\nhigh success rate based on transferability. Furthermore, our algorithm can\ncompress the size of the adversarial inputs to stickers that, when attached to\nthe targeted object, result in the detector either mislabeling or not detecting\nthe object a high percentage of the time. This note provides a small set of\nresults. Our upcoming paper will contain a thorough evaluation on other object\ndetectors, and will present the algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 16:33:01 GMT"}, {"version": "v2", "created": "Mon, 23 Jul 2018 19:37:07 GMT"}], "update_date": "2018-07-25", "authors_parsed": [["Eykholt", "Kevin", ""], ["Evtimov", "Ivan", ""], ["Fernandes", "Earlence", ""], ["Li", "Bo", ""], ["Song", "Dawn", ""], ["Kohno", "Tadayoshi", ""], ["Rahmati", "Amir", ""], ["Prakash", "Atul", ""], ["Tramer", "Florian", ""]]}, {"id": "1712.08222", "submitter": "Sadegh Farhang", "authors": "Sadegh Farhang and Aron Laszka and Jens Grossklags", "title": "An Economic Study of the Effect of Android Platform Fragmentation on\n  Security Updates", "comments": "22nd International Conference on Financial Cryptography and Data\n  Security (FC 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vendors in the Android ecosystem typically customize their devices by\nmodifying Android Open Source Project (AOSP) code, adding in-house developed\nproprietary software, and pre-installing third-party applications. However,\nresearch has documented how various security problems are associated with this\ncustomization process.\n  We develop a model of the Android ecosystem utilizing the concepts of game\ntheory and product differentiation to capture the competition involving two\nvendors customizing the AOSP platform. We show how the vendors are incentivized\nto differentiate their products from AOSP and from each other, and how prices\nare shaped through this differentiation process. We also consider two types of\nconsumers: security-conscious consumers who understand and care about security,\nand na\\\"ive consumers who lack the ability to correctly evaluate security\nproperties of vendor-supplied Android products or simply ignore security. It is\nevident that vendors shirk on security investments in the latter case.\n  Regulators such as the U.S. Federal Trade Commission have sanctioned Android\nvendors for underinvestment in security, but the exact effects of these\nsanctions are difficult to disentangle with empirical data. Here, we model the\nimpact of a regulator-imposed fine that incentivizes vendors to match a minimum\nsecurity standard. Interestingly, we show how product prices will decrease for\nthe same cost of customization in the presence of a fine, or a higher level of\nregulator-imposed minimum security.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 21:36:46 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Farhang", "Sadegh", ""], ["Laszka", "Aron", ""], ["Grossklags", "Jens", ""]]}, {"id": "1712.08250", "submitter": "Jiefeng Chen", "authors": "Jiefeng Chen, Zihang Meng, Changtian Sun, Wei Tang, Yinglun Zhu", "title": "ReabsNet: Detecting and Revising Adversarial Examples", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though deep neural network has hit a huge success in recent studies and\napplica- tions, it still remains vulnerable to adversarial perturbations which\nare imperceptible to humans. To address this problem, we propose a novel\nnetwork called ReabsNet to achieve high classification accuracy in the face of\nvarious attacks. The approach is to augment an existing classification network\nwith a guardian network to detect if a sample is natural or has been\nadversarially perturbed. Critically, instead of simply rejecting adversarial\nexamples, we revise them to get their true labels. We exploit the observation\nthat a sample containing adversarial perturbations has a possibility of\nreturning to its true class after revision. We demonstrate that our ReabsNet\noutperforms the state-of-the-art defense method under various adversarial\nattacks.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 23:24:37 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Chen", "Jiefeng", ""], ["Meng", "Zihang", ""], ["Sun", "Changtian", ""], ["Tang", "Wei", ""], ["Zhu", "Yinglun", ""]]}, {"id": "1712.08305", "submitter": "Aditi Roy", "authors": "Aditi Roy, Tzipora Halevi and Nasir Memon", "title": "An HMM-based Multi-sensor Approach for Continuous Mobile Authentication", "comments": null, "journal-ref": null, "doi": "10.1109/MILCOM.2015.7357626", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the increased popularity of smart phones, there is a greater need to\nhave a robust authentication mechanism that handles various security threats\nand privacy leakages effectively. This paper studies continuous authentication\nfor touch interface based mobile devices. A Hidden Markov Model (HMM) based\nbehavioral template training approach is presented, which does not require\ntraining data from other subjects other than the owner of the mobile device and\ncan get updated with new data over time. The gesture patterns of the user are\nmodeled from multiple sensors - touch, accelerometer and gyroscope data using a\ncontinuous left-right HMM. The approach models the tap and stroke patterns of a\nuser since these are the basic and most frequently used interactions on a\nmobile device. To evaluate the effectiveness of the proposed method a new data\nset has been created from 42 users who interacted with off-the-shelf\napplications on their smart phones. Results show that the performance of the\nproposed approach is promising and potentially better than other\nstate-of-the-art approaches.\n", "versions": [{"version": "v1", "created": "Fri, 22 Dec 2017 05:10:05 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Roy", "Aditi", ""], ["Halevi", "Tzipora", ""], ["Memon", "Nasir", ""]]}, {"id": "1712.08307", "submitter": "Aditi Roy", "authors": "Aditi Roy, Tzipora Halevi and Nasir Memon", "title": "An HMM-based behavior modeling approach for continuous mobile\n  authentication", "comments": null, "journal-ref": null, "doi": "10.1109/ICASSP.2014.6854310", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies continuous authentication for touch interface based mobile\ndevices. A Hidden Markov Model (HMM) based behavioral template training\napproach is presented, which does not require training data from other subjects\nother than the owner of the mobile. The stroke patterns of a user are modeled\nusing a continuous left-right HMM. The approach models the horizontal and\nvertical scrolling patterns of a user since these are the basic and mostly used\ninteractions on a mobile device. The effectiveness of the proposed method is\nevaluated through extensive experiments using the Toucha-lytics database which\ncomprises of touch data over time. The results show that the performance of the\nproposed approach is better than the state-of-the-art method.\n", "versions": [{"version": "v1", "created": "Fri, 22 Dec 2017 05:25:06 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Roy", "Aditi", ""], ["Halevi", "Tzipora", ""], ["Memon", "Nasir", ""]]}, {"id": "1712.08427", "submitter": "Mustafa Al-Bassam", "authors": "Mustafa Al-Bassam, Sarah Meiklejohn", "title": "Contour: A Practical System for Binary Transparency", "comments": "International Workshop on Cryptocurrencies and Blockchain Technology\n  (CBT), 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transparency is crucial in security-critical applications that rely on\nauthoritative information, as it provides a robust mechanism for holding these\nauthorities accountable for their actions. A number of solutions have emerged\nin recent years that provide transparency in the setting of certificate\nissuance, and Bitcoin provides an example of how to enforce transparency in a\nfinancial setting. In this work we shift to a new setting, the distribution of\nsoftware package binaries, and present a system for so-called \"binary\ntransparency.\" Our solution, Contour, uses proactive methods for providing\ntransparency, privacy, and availability, even in the face of persistent\nman-in-the-middle attacks. We also demonstrate, via benchmarks and a test\ndeployment for the Debian software repository, that Contour is the only system\nfor binary transparency that satisfies the efficiency and coordination\nrequirements that would make it possible to deploy today.\n", "versions": [{"version": "v1", "created": "Fri, 22 Dec 2017 13:04:27 GMT"}, {"version": "v2", "created": "Tue, 7 Aug 2018 16:31:48 GMT"}], "update_date": "2018-08-08", "authors_parsed": [["Al-Bassam", "Mustafa", ""], ["Meiklejohn", "Sarah", ""]]}, {"id": "1712.08519", "submitter": "Raoul Strackx", "authors": "Raoul Strackx, Frank Piessens", "title": "The Heisenberg Defense: Proactively Defending SGX Enclaves against\n  Page-Table-Based Side-Channel Attacks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protected-module architectures (PMAs) have been proposed to provide strong\nisolation guarantees, even on top of a compromised system. Unfortunately, Intel\nSGX -- the only publicly available high-end PMA -- has been shown to only\nprovide limited isolation. An attacker controlling the untrusted page tables,\ncan learn enclave secrets by observing its page access patterns.\n  Fortifying existing protected-module architectures in a real-world setting\nagainst side-channel attacks is an extremely difficult task as system software\n(hypervisor, operating system, ...) needs to remain in full control over the\nunderlying hardware. Most state-of-the-art solutions propose a reactive defense\nthat monitors for signs of an attack. Such approaches unfortunately cannot\ndetect the most novel attacks, suffer from false-positives, and place an\nextraordinary heavy burden on enclave-developers when an attack is detected.\n  We present Heisenberg, a proactive defense that provides complete protection\nagainst page table based side channels. We guarantee that any attack will\neither be prevented or detected automatically before {\\em any} sensitive\ninformation leaks. Consequently, Heisenberg can always securely resume enclave\nexecution -- even when the attacker is still present in the system.\n  We present two implementations. Heisenberg-HW relies on very limited hardware\nfeatures to defend against page-table-based attacks. We use the x86/SGX\nplatform as an example, but the same approach can be applied when\nprotected-module architectures are ported to different platforms as well.\n  Heisenberg-SW avoids these hardware modifications and can readily be applied.\nUnfortunately, it's reliance on Intel Transactional Synchronization Extensions\n(TSX) may lead to significant performance overhead under real-life conditions.\n", "versions": [{"version": "v1", "created": "Fri, 22 Dec 2017 15:32:29 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Strackx", "Raoul", ""], ["Piessens", "Frank", ""]]}, {"id": "1712.08583", "submitter": "Umang Natubhai Yadav", "authors": "Umang Yadav, Sherif N Abbas, Dimitrios Hatzinakos", "title": "Evaluation of PPG Biometrics for Authentication in different states", "comments": "Accepted at 11th IAPR/IEEE International Conference on Biometrics,\n  2018. 6 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Amongst all medical biometric traits, Photoplethysmograph (PPG) is the\neasiest to acquire. PPG records the blood volume change with just combination\nof Light Emitting Diode and Photodiode from any part of the body. With IoT and\nsmart homes' penetration, PPG recording can easily be integrated with other\nvital wearable devices. PPG represents peculiarity of hemodynamics and\ncardiovascular system for each individual. This paper presents non-fiducial\nmethod for PPG based biometric authentication. Being a physiological signal,\nPPG signal alters with physical/mental stress and time. For robustness, these\nvariations cannot be ignored. While, most of the previous works focused only on\nsingle session, this paper demonstrates extensive performance evaluation of PPG\nbiometrics against single session data, different emotions, physical exercise\nand time-lapse using Continuous Wavelet Transform (CWT) and Direct Linear\nDiscriminant Analysis (DLDA). When evaluated on different states and datasets,\nequal error rate (EER) of $0.5\\%$-$6\\%$ was achieved for $45$-$60$s average\ntraining time. Our CWT/DLDA based technique outperformed all other\ndimensionality reduction techniques and previous work.\n", "versions": [{"version": "v1", "created": "Fri, 22 Dec 2017 17:29:31 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Yadav", "Umang", ""], ["Abbas", "Sherif N", ""], ["Hatzinakos", "Dimitrios", ""]]}, {"id": "1712.08618", "submitter": "Dimitrios Sisiaridis", "authors": "Dimitrios Sisiaridis and Olivier Markowitch", "title": "Feature Extraction and Feature Selection: Reducing Data Complexity with\n  Apache Spark", "comments": null, "journal-ref": "International Journal of Network Security & Its Applications\n  (IJNSA), Vol.9, No.6, November 2017", "doi": null, "report-no": null, "categories": "cs.DB cs.CR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Feature extraction and feature selection are the first tasks in\npre-processing of input logs in order to detect cyber security threats and\nattacks while utilizing machine learning. When it comes to the analysis of\nheterogeneous data derived from different sources, these tasks are found to be\ntime-consuming and difficult to be managed efficiently. In this paper, we\npresent an approach for handling feature extraction and feature selection for\nsecurity analytics of heterogeneous data derived from different network\nsensors. The approach is implemented in Apache Spark, using its python API,\nnamed pyspark.\n", "versions": [{"version": "v1", "created": "Mon, 11 Dec 2017 21:02:21 GMT"}], "update_date": "2017-12-27", "authors_parsed": [["Sisiaridis", "Dimitrios", ""], ["Markowitch", "Olivier", ""]]}, {"id": "1712.08713", "submitter": "Fnu Suya", "authors": "Fnu Suya, Yuan Tian, David Evans, Paolo Papotti", "title": "Query-limited Black-box Attacks to Classifiers", "comments": "5 Pages, 2017 NIPS workshop on machine learning and computer security\n  (12/08/2017-12/09/2017)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study black-box attacks on machine learning classifiers where each query\nto the model incurs some cost or risk of detection to the adversary. We focus\nexplicitly on minimizing the number of queries as a major objective.\nSpecifically, we consider the problem of attacking machine learning classifiers\nsubject to a budget of feature modification cost while minimizing the number of\nqueries, where each query returns only a class and confidence score. We\ndescribe an approach that uses Bayesian optimization to minimize the number of\nqueries, and find that the number of queries can be reduced to approximately\none tenth of the number needed through a random strategy for scenarios where\nthe feature modification cost budget is low.\n", "versions": [{"version": "v1", "created": "Sat, 23 Dec 2017 04:40:47 GMT"}], "update_date": "2017-12-27", "authors_parsed": [["Suya", "Fnu", ""], ["Tian", "Yuan", ""], ["Evans", "David", ""], ["Papotti", "Paolo", ""]]}, {"id": "1712.08886", "submitter": "Pinhui Ke", "authors": "Zhifan Ye, Pinhui Ke, Chenhuang Wu", "title": "A further study on the linear complexity of new binary cyclotomic\n  sequence of length $p^r$", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a conjecture on the linear complexity of a new class of generalized\ncyclotomic binary sequences of period $p^r$ was proposed by Z. Xiao et al.\n(Des. Codes Cryptogr., DOI 10.1007/s10623-017-0408-7). Later, for the case $f$\nbeing the form $2^r$ with $r\\ge 1$, Vladimir Edemskiy proved the conjecture\n(arXiv:1712.03947). In this paper, under the assumption of $2^{p-1} \\not\\equiv\n1 \\bmod p^2$ and $\\gcd(\\frac{p-1}{{\\rm {ord}}_{p}(2)},f)=1$, the conjecture\nproposed by Z. Xiao et al. is proved for a general $f$ by using the Euler\nquotient. Actually, a generic construction of $p^r$-periodic binary sequence\nbased on the generalized cyclotomy is introduced in this paper, which admits a\nflexible support set and includes Xiao's construction as a special case, and\nthen an efficient method to compute the linear complexity of the sequence by\nthe generic construction is presented, based on which the conjecture proposed\nby Z. Xiao et al. could be easily proved under the aforementioned assumption.\n", "versions": [{"version": "v1", "created": "Sun, 24 Dec 2017 08:14:31 GMT"}, {"version": "v2", "created": "Thu, 15 Mar 2018 06:27:15 GMT"}], "update_date": "2018-03-16", "authors_parsed": [["Ye", "Zhifan", ""], ["Ke", "Pinhui", ""], ["Wu", "Chenhuang", ""]]}, {"id": "1712.08940", "submitter": "Sanam Ghorbani Lyastani", "authors": "Sanam Ghorbani Lyastani, Michael Schilling, Sascha Fahl, Sven Bugiel,\n  Michael Backes", "title": "Studying the Impact of Managers on Password Strength and Reuse", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite their well-known security problems, passwords are still the incumbent\nauthentication method for virtually all online services. To remedy the\nsituation, end-users are very often referred to password managers as a solution\nto the password reuse and password weakness problems. However, to date the\nactual impact of password managers on password security and reuse has not been\nstudied systematically.\n  In this paper, we provide the first large-scale study of the password\nmanagers' influence on users' real-life passwords. From 476 participants of an\nonline survey on users' password creation and management strategies, we recruit\n170 participants that allowed us to monitor their passwords in-situ through a\nbrowser plugin. In contrast to prior work, we collect the passwords' entry\nmethods (e.g., human or password manager) in addition to the passwords and\ntheir metrics. Based on our collected data and our survey, we gain a more\ncomplete picture of the factors that influence our participants' passwords'\nstrength and reuse. We quantify for the first time that password managers\nindeed benefit the password strength and uniqueness, however, also our results\nalso suggest that those benefits depend on the users' strategies and that\nmanagers without password generators rather aggravate the existing problems.\n", "versions": [{"version": "v1", "created": "Sun, 24 Dec 2017 15:52:41 GMT"}], "update_date": "2017-12-27", "authors_parsed": [["Lyastani", "Sanam Ghorbani", ""], ["Schilling", "Michael", ""], ["Fahl", "Sascha", ""], ["Bugiel", "Sven", ""], ["Backes", "Michael", ""]]}, {"id": "1712.08996", "submitter": "ElMouatez Billah Karbab", "authors": "ElMouatez Billah Karbab, Mourad Debbabi, Abdelouahid Derhab, Djedjiga\n  Mouheb", "title": "Android Malware Detection using Deep Learning on API Method Sequences", "comments": "17 pages, submitted to Elsevier Digital Investigations Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Android OS experiences a blazing popularity since the last few years. This\npredominant platform has established itself not only in the mobile world but\nalso in the Internet of Things (IoT) devices. This popularity, however, comes\nat the expense of security, as it has become a tempting target of malicious\napps. Hence, there is an increasing need for sophisticated, automatic, and\nportable malware detection solutions. In this paper, we propose MalDozer, an\nautomatic Android malware detection and family attribution framework that\nrelies on sequences classification using deep learning techniques. Starting\nfrom the raw sequence of the app's API method calls, MalDozer automatically\nextracts and learns the malicious and the benign patterns from the actual\nsamples to detect Android malware. MalDozer can serve as a ubiquitous malware\ndetection system that is not only deployed on servers, but also on mobile and\neven IoT devices. We evaluate MalDozer on multiple Android malware datasets\nranging from 1K to 33K malware apps, and 38K benign apps. The results show that\nMalDozer can correctly detect malware and attribute them to their actual\nfamilies with an F1-Score of 96%-99% and a false positive rate of 0.06%-2%,\nunder all tested datasets and settings.\n", "versions": [{"version": "v1", "created": "Mon, 25 Dec 2017 03:26:21 GMT"}], "update_date": "2017-12-27", "authors_parsed": [["Karbab", "ElMouatez Billah", ""], ["Debbabi", "Mourad", ""], ["Derhab", "Abdelouahid", ""], ["Mouheb", "Djedjiga", ""]]}, {"id": "1712.09082", "submitter": "Ahmad Beirami", "authors": "Arman Rezaee and Ahmad Beirami and Ali Makhdoumi and Muriel Medard and\n  Ken Duffy", "title": "Guesswork Subject to a Total Entropy Budget", "comments": "In Proc. of Allerton 2017 (19 pages, 4 figures)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an abstraction of computational security in password protected\nsystems where a user draws a secret string of given length with i.i.d.\ncharacters from a finite alphabet, and an adversary would like to identify the\nsecret string by querying, or guessing, the identity of the string. The concept\nof a \"total entropy budget\" on the chosen word by the user is natural,\notherwise the chosen password would have arbitrary length and complexity. One\nintuitively expects that a password chosen from the uniform distribution is\nmore secure. This is not the case, however, if we are considering only the\naverage guesswork of the adversary when the user is subject to a total entropy\nbudget. The optimality of the uniform distribution for the user's secret string\nholds when we have also a budget on the guessing adversary. We suppose that the\nuser is subject to a \"total entropy budget\" for choosing the secret string,\nwhereas the computational capability of the adversary is determined by his\n\"total guesswork budget.\" We study the regime where the adversary's chances are\nexponentially small in guessing the secret string chosen subject to a total\nentropy budget. We introduce a certain notion of uniformity and show that a\nmore uniform source will provide better protection against the adversary in\nterms of his chances of success in guessing the secret string. In contrast, the\naverage number of queries that it takes the adversary to identify the secret\nstring is smaller for the more uniform secret string subject to the same total\nentropy budget.\n", "versions": [{"version": "v1", "created": "Mon, 25 Dec 2017 14:53:05 GMT"}], "update_date": "2017-12-27", "authors_parsed": [["Rezaee", "Arman", ""], ["Beirami", "Ahmad", ""], ["Makhdoumi", "Ali", ""], ["Medard", "Muriel", ""], ["Duffy", "Ken", ""]]}, {"id": "1712.09136", "submitter": "Yunhui Long", "authors": "Yunhui Long, Vincent Bindschaedler, Carl A. Gunter", "title": "Towards Measuring Membership Privacy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning models are increasingly made available to the masses through\npublic query interfaces. Recent academic work has demonstrated that malicious\nusers who can query such models are able to infer sensitive information about\nrecords within the training data. Differential privacy can thwart such attacks,\nbut not all models can be readily trained to achieve this guarantee or to\nachieve it with acceptable utility loss. As a result, if a model is trained\nwithout differential privacy guarantee, little is known or can be said about\nthe privacy risk of releasing it. In this work, we investigate and analyze\nmembership attacks to understand why and how they succeed. Based on this\nunderstanding, we propose Differential Training Privacy (DTP), an empirical\nmetric to estimate the privacy risk of publishing a classier when methods such\nas differential privacy cannot be applied. DTP is a measure of a classier with\nrespect to its training dataset, and we show that calculating DTP is efficient\nin many practical cases. We empirically validate DTP using state-of-the-art\nmachine learning models such as neural networks trained on real-world datasets.\nOur results show that DTP is highly predictive of the success of membership\nattacks and therefore reducing DTP also reduces the privacy risk. We advocate\nfor DTP to be used as part of the decision-making process when considering\npublishing a classifier. To this end, we also suggest adopting the DTP-1\nhypothesis: if a classifier has a DTP value above 1, it should not be\npublished.\n", "versions": [{"version": "v1", "created": "Mon, 25 Dec 2017 22:23:28 GMT"}], "update_date": "2017-12-27", "authors_parsed": [["Long", "Yunhui", ""], ["Bindschaedler", "Vincent", ""], ["Gunter", "Carl A.", ""]]}, {"id": "1712.09145", "submitter": "Lei Zhang", "authors": "Lei Zhang, Futai Zhang, Wei Wu", "title": "A Provably Secure Ring Signature Scheme in Certificateless Cryptography", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ring signature is a kind of group-oriented signature. It allows a member of a\ngroup to sign messages on behalf of the group without revealing his/her\nidentity. Certificateless public key cryptography was first introduced by\nAl-Riyami and Paterson in Asiacrypt 2003. In certificateless cryptography, it\ndoes not require the use of certificates to guarantee the authenticity of\nusers' public keys. Meanwhile, certificateless cryptography does not have the\nkey escrow problem, which seems to be inherent in the Identity-based\ncryptography. In this paper, we propose a concrete certificateless ring\nsignature scheme. The security models of certificateless ring signature are\nalso formalized. Our new scheme is provably secure in the random oracle model,\nwith the assumption that the Computational Diffie-Hellman problem is hard. In\naddition, we also show that a generic construction of certificateless ring\nsignature is insecure against the key replacement attack defined in our\nsecurity models.\n", "versions": [{"version": "v1", "created": "Mon, 25 Dec 2017 23:55:33 GMT"}], "update_date": "2017-12-27", "authors_parsed": [["Zhang", "Lei", ""], ["Zhang", "Futai", ""], ["Wu", "Wei", ""]]}, {"id": "1712.09196", "submitter": "Ajil Jalal", "authors": "Ajil Jalal, Andrew Ilyas, Constantinos Daskalakis, Alexandros G.\n  Dimakis", "title": "The Robust Manifold Defense: Adversarial Training using Generative\n  Models", "comments": "Added pseudo code for defense-gan break", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CR cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new type of attack for finding adversarial examples for image\nclassifiers. Our method exploits spanners, i.e. deep neural networks whose\ninput space is low-dimensional and whose output range approximates the set of\nimages of interest. Spanners may be generators of GANs or decoders of VAEs. The\nkey idea in our attack is to search over latent code pairs to find ones that\ngenerate nearby images with different classifier outputs. We argue that our\nattack is stronger than searching over perturbations of real images. Moreover,\nwe show that our stronger attack can be used to reduce the accuracy of\nDefense-GAN to 3\\%, resolving an open problem from the well-known paper by\nAthalye et al. We combine our attack with normal adversarial training to obtain\nthe most robust known MNIST classifier, significantly improving the state of\nthe art against PGD attacks. Our formulation involves solving a min-max\nproblem, where the min player sets the parameters of the classifier and the max\nplayer is running our attack, and is thus searching for adversarial examples in\nthe {\\em low-dimensional} input space of the spanner.\n  All code and models are available at\n\\url{https://github.com/ajiljalal/manifold-defense.git}\n", "versions": [{"version": "v1", "created": "Tue, 26 Dec 2017 07:28:14 GMT"}, {"version": "v2", "created": "Fri, 31 May 2019 14:42:03 GMT"}, {"version": "v3", "created": "Tue, 4 Jun 2019 13:23:51 GMT"}, {"version": "v4", "created": "Thu, 4 Jul 2019 15:26:38 GMT"}, {"version": "v5", "created": "Wed, 10 Jul 2019 03:51:45 GMT"}], "update_date": "2019-07-11", "authors_parsed": [["Jalal", "Ajil", ""], ["Ilyas", "Andrew", ""], ["Daskalakis", "Constantinos", ""], ["Dimakis", "Alexandros G.", ""]]}, {"id": "1712.09259", "submitter": "Aditya Ahuja", "authors": "Aditya Ahuja", "title": "Intention Games: Towards Strategic Coexistence between Partially Honest\n  and Blind Players", "comments": "19 pages, 2 figures; major revision to the game with new examples", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strategic interactions between competitive entities are generally considered\nfrom the perspective of complete revelation of benefits achieved from those\ninteractions, in the form of public payoff functions and/or beliefs, in the\nannounced games. However, there exist strategic interplays between competitors\nwhere the players have a choice to strategise under the availability of private\npayoffs, in similar competitive settings. In this contribution, we propose a\nformal framework for a competitive ecosystem where each player is permitted to\ndefect from publicly optimal strategies under certain private payoffs greater\nthan announced payoffs, given that these defections have certain acceptable\nbounds in the long run as agreed by all players. We call this game theoretic\nconstruction an Intention Game. We formally define an Intention Game, and\nnotions of participational equilibria that exist in such interactions that\npermit public defections. We compare Intention Games with conventional\nstrategic form games, and demonstrate a type-theoretic construction of\nIntention Games. In a partially honest setting, we give Intention Game\ninstances of a Cournot competition, secure interactions between mobile\napplications, an Internet services' data sourcing competition between Internet\nservice providers through content delivery networks, and a Bitcoin mining\ncompetition. We give a use of Intention Games to determine player participation\nin a cryptographic protocol. Finally, we demonstrate the possibility of a dual\nmodel of the Intention Games framework.\n", "versions": [{"version": "v1", "created": "Tue, 26 Dec 2017 13:02:46 GMT"}, {"version": "v2", "created": "Tue, 11 Feb 2020 07:10:09 GMT"}], "update_date": "2020-02-12", "authors_parsed": [["Ahuja", "Aditya", ""]]}, {"id": "1712.09289", "submitter": "Alexander Poremba", "authors": "Alexander Poremba", "title": "Quantum Learning Algorithms and Post-Quantum Cryptography", "comments": "108 pages. Master's thesis collaboration between QMATH, University of\n  Copenhagen, and Heidelberg University", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum algorithms have demonstrated promising speed-ups over classical\nalgorithms in the context of computational learning theory - despite the\npresence of noise. In this work, we give an overview of recent quantum\nspeed-ups, revisit the Bernstein-Vazirani algorithm in a new learning problem\nextension over an arbitrary cyclic group and discuss applications in\ncryptography, such as the Learning with Errors problem.\n  We turn to post-quantum cryptography and investigate attacks in which an\nadversary is given quantum access to a classical encryption scheme. In\nparticular, we consider new notions of security under non-adaptive quantum\nchosen-ciphertext attacks and propose symmetric-key encryption schemes based on\nquantum-secure pseudorandom functions that fulfil our definitions. In order to\nprove security, we introduce novel relabeling techniques and show that, in an\noracle model with an arbitrary advice state, no quantum algorithm making\nsuperposition queries can reliably distinguish between the class of functions\nthat are randomly relabeled at a small subset of the domain.\n  Finally, we discuss current progress in quantum computing technology,\nparticularly with a focus on implementations of quantum algorithms on the\nion-trap architecture, and shed light on the relevance and effectiveness of\ncommon noise models adopted in computational learning theory.\n", "versions": [{"version": "v1", "created": "Tue, 26 Dec 2017 15:46:22 GMT"}, {"version": "v2", "created": "Mon, 1 Jan 2018 23:20:46 GMT"}, {"version": "v3", "created": "Sun, 17 Jun 2018 21:20:41 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Poremba", "Alexander", ""]]}, {"id": "1712.09333", "submitter": "Thibault de Valroger", "authors": "Thibault de Valroger", "title": "Practical Implementation of a Deep Random Generator", "comments": "28 pages, 3 pages of Annex. V3: Addition of a more precise and more\n  efficient method to generate recursively each new distribution in the Deep\n  Random Generator. Addition of an Annex with an impossibility result. arXiv\n  admin note: substantial text overlap with arXiv:1507.08258", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have introduced in former work the concept of Deep Randomness and its\ninterest to design Unconditionally Secure communication protocols. We have in\nparticular given an example of such protocol and introduced how to design a\nDeep Random Generator associated to that protocol. Deep Randomness is a form of\nrandomness in which, at each draw of random variable, not only the result is\nunpredictable bu also the distribution is unknown to any observer. In this\narticle, we remind formal definition of Deep Randomness, and we expose two\npractical algorithmic methods to implement a Deep Random Generator within a\nclassical computing resource. We also discuss their performances and their\nparameters.\n", "versions": [{"version": "v1", "created": "Fri, 22 Dec 2017 19:39:39 GMT"}, {"version": "v2", "created": "Sun, 30 Sep 2018 13:31:04 GMT"}, {"version": "v3", "created": "Sun, 6 Jan 2019 17:55:42 GMT"}], "update_date": "2019-01-09", "authors_parsed": [["de Valroger", "Thibault", ""]]}, {"id": "1712.09424", "submitter": "Jan Vykopal", "authors": "Jan Vykopal, Radek O\\v{s}lej\\v{s}ek, Karol\\'ina Bursk\\'a, Krist\\'ina\n  Z\\'akop\\v{c}anov\\'a", "title": "Timely Feedback in Unstructured Cybersecurity Exercises", "comments": "6 pages; SIGCSE '18, Baltimore, MD, USA", "journal-ref": null, "doi": "10.1145/3159450.3159561", "report-no": null, "categories": "cs.CR cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyber defence exercises are intensive, hands-on learning events for teams of\nprofessionals who gain or develop their skills to successfully prevent and\nrespond to cyber attacks. The exercises mimic the real-life, routine operation\nof an organization which is being attacked by an unknown offender. Teams of\nlearners receive very limited immediate feedback from the instructors during\nthe exercise; they can usually see only a scoreboard showing the aggregated\ngain or loss of points for particular tasks. An in-depth analysis of learners'\nactions requires considerable human effort, which results in days or weeks of\ndelay. The intensive experience is thus not followed by proper feedback\nfacilitating actual learning, and this diminishes the effect of the exercise.\n  In this initial work, we investigate how to provide valuable feedback to\nlearners right after the exercise without any unnecessary delay. Based on the\nscoring system of a cyber defence exercise, we have developed a new feedback\ntool that presents an interactive, personalized timeline of exercise events. We\ndeployed this tool during an international exercise, where we monitored\nparticipants' interactions and gathered their reflections. The results show\nthat learners did use the new tool and rated it positively. Since this new\nfeature is not bound to a particular defence exercise, it can be applied to all\nexercises that employ scoring based on the evaluation of individual exercise\nobjectives. As a result, it enables the learner to immediately reflect on the\nexperience gained.\n", "versions": [{"version": "v1", "created": "Tue, 26 Dec 2017 21:29:19 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Vykopal", "Jan", ""], ["Ošlejšek", "Radek", ""], ["Burská", "Karolína", ""], ["Zákopčanová", "Kristína", ""]]}, {"id": "1712.09491", "submitter": "Arjun Nitin Bhagoji", "authors": "Arjun Nitin Bhagoji, Warren He, Bo Li, Dawn Song", "title": "Exploring the Space of Black-box Attacks on Deep Neural Networks", "comments": "25 pages, 7 figures, 10 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR cs.CV", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Existing black-box attacks on deep neural networks (DNNs) so far have largely\nfocused on transferability, where an adversarial instance generated for a\nlocally trained model can \"transfer\" to attack other learning models. In this\npaper, we propose novel Gradient Estimation black-box attacks for adversaries\nwith query access to the target model's class probabilities, which do not rely\non transferability. We also propose strategies to decouple the number of\nqueries required to generate each adversarial sample from the dimensionality of\nthe input. An iterative variant of our attack achieves close to 100%\nadversarial success rates for both targeted and untargeted attacks on DNNs. We\ncarry out extensive experiments for a thorough comparative evaluation of\nblack-box attacks and show that the proposed Gradient Estimation attacks\noutperform all transferability based black-box attacks we tested on both MNIST\nand CIFAR-10 datasets, achieving adversarial success rates similar to well\nknown, state-of-the-art white-box attacks. We also apply the Gradient\nEstimation attacks successfully against a real-world Content Moderation\nclassifier hosted by Clarifai. Furthermore, we evaluate black-box attacks\nagainst state-of-the-art defenses. We show that the Gradient Estimation attacks\nare very effective even against these defenses.\n", "versions": [{"version": "v1", "created": "Wed, 27 Dec 2017 04:39:02 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Bhagoji", "Arjun Nitin", ""], ["He", "Warren", ""], ["Li", "Bo", ""], ["Song", "Dawn", ""]]}, {"id": "1712.09623", "submitter": "Mouhammd Alkasassbeh", "authors": "Mouhammd Alkasassbeh", "title": "An empirical evaluation for the intrusion detection features based on\n  machine learning and feature selection methods", "comments": null, "journal-ref": "Journal of Theoretical and Applied Information Technology 30th\n  November 2017 -- Vol. 95. No. 22 -- 2017", "doi": null, "report-no": null, "categories": "cs.NI cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the great developments in information technology, particularly the\nInternet, computer networks, global information exchange, and its positive\nimpact in all areas of daily life, it has also contributed to the development\nof penetration and intrusion which forms a high risk to the security of\ninformation organizations, government agencies, and causes large economic\nlosses. There are many techniques designed for protection such as firewall and\nintrusion detection systems (IDS). IDS is a set of software and/or hardware\ntechniques used to detect hacker's activities in computer systems. Two types of\nanomalies are used in IDS to detect intrusive activities different from normal\nuser behavior. Misuse relies on the knowledge base that contains all known\nattack techniques and intrusion is discovered through research in this\nknowledge base. Artificial intelligence techniques have been introduced to\nimprove the performance of these systems. The importance of IDS is to identify\nunauthorized access attempting to compromise confidentiality, integrity or\navailability of the computer network. This paper investigates the Intrusion\nDetection (ID) problem using three machine learning algorithms namely, BayesNet\nalgorithm, Multi-Layer Perceptron (MLP), and Support Vector Machine (SVM). The\nalgorithms are applied on a real, Management Information Based (MIB) dataset\nthat is collected from real life environment. To enhance the detection process\naccuracy, a set of feature selection approaches is used; Infogain (IG), ReleifF\n(RF), and Genetic Search (GS). Our experiments show that the three feature\nselection methods have enhanced the classification performance. GS with\nbayesNet, MLP and SVM give high accuracy rates, more specifically the BayesNet\nwith the GS accuracy rate is 99.9%.\n", "versions": [{"version": "v1", "created": "Wed, 27 Dec 2017 16:39:55 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Alkasassbeh", "Mouhammd", ""]]}, {"id": "1712.09722", "submitter": "Robert Malaney", "authors": "Nedasadat Hosseinidehaj, Robert Malaney, Soon Xin Ng and Lajos Hanzo", "title": "Satellite-Based Continuous-Variable Quantum Communications:\n  State-of-the-Art and a Predictive Outlook", "comments": "Submitted to IEEE Communications Surveys and Tutorials. Contains\n  updated references", "journal-ref": "Published in IEEE Communications Surveys & Tutorials 2019", "doi": "10.1109/COMST.2018.2864557", "report-no": null, "categories": "quant-ph cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent launch of the Micius quantum-enabled satellite heralds a major\nstep forward for long-range quantum communication. Using single-photon\ndiscrete-variable quantum states, this exciting new development proves beyond\nany doubt that all of the quantum protocols previously deployed over limited\nranges in terrestrial experiments can, in fact, be translated to global\ndistances via the use of low-orbit satellites. In this work, we survey the\nimminent extension of space-based quantum communication to the\ncontinuous-variable regime - the quantum regime perhaps most closely related to\nclassical wireless communications. The CV regime offers the potential for\nincreased communication performance and represents the next major step forward\nfor quantum communications and the development of the global quantum internet.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 00:51:46 GMT"}, {"version": "v2", "created": "Tue, 9 Jan 2018 01:35:23 GMT"}], "update_date": "2019-08-08", "authors_parsed": [["Hosseinidehaj", "Nedasadat", ""], ["Malaney", "Robert", ""], ["Ng", "Soon Xin", ""], ["Hanzo", "Lajos", ""]]}, {"id": "1712.09795", "submitter": "Michael Bargury", "authors": "Michael Bargury, Roy Levin and Royi Ronen", "title": "Learning to Customize Network Security Rules", "comments": "5 pages, 5 figures, one table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security is a major concern for organizations who wish to leverage cloud\ncomputing. In order to reduce security vulnerabilities, public cloud providers\noffer firewall functionalities. When properly configured, a firewall protects\ncloud networks from cyber-attacks. However, proper firewall configuration\nrequires intimate knowledge of the protected system, high expertise and\non-going maintenance.\n  As a result, many organizations do not use firewalls effectively, leaving\ntheir cloud resources vulnerable. In this paper, we present a novel supervised\nlearning method, and prototype, which compute recommendations for firewall\nrules. Recommendations are based on sampled network traffic meta-data (NetFlow)\ncollected from a public cloud provider. Labels are extracted from firewall\nconfigurations deemed to be authored by experts. NetFlow is collected from\nnetwork routers, avoiding expensive collection from cloud VMs, as well as\nrelieving privacy concerns.\n  The proposed method captures network routines and dependencies between\nresources and firewall configuration. The method predicts IPs to be allowed by\nthe firewall. A grouping algorithm is subsequently used to generate a\nmanageable number of IP ranges. Each range is a parameter for a firewall rule.\n  We present results of experiments on real data, showing ROC AUC of 0.92,\ncompared to 0.58 for an unsupervised baseline. The results prove the hypothesis\nthat firewall rules can be automatically generated based on router data, and\nthat an automated method can be effective in blocking a high percentage of\nmalicious traffic.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 09:22:15 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Bargury", "Michael", ""], ["Levin", "Roy", ""], ["Ronen", "Royi", ""]]}, {"id": "1712.09829", "submitter": "Domingo Gomez-Perez", "authors": "Domingo Gomez-Perez and Gu\\'ena\\\"el Renault", "title": "A Probabilistic Analysis on a Lattice Attack against DSA", "comments": "18 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analyzing the security of cryptosystems under attacks based on the malicious\nmodification of memory registers is a research topic of high importance. This\ntype of attacks may affect the randomness of the secret parameters by forcing a\nlimited number of bits to a certain value which can be unknown to the attacker.\nIn this context, we revisit the attack on DSA presented by Faug\\`ere, Goyet and\nRenault during the conference SAC 2012: we simplify their method and we provide\na probabilistic approach in opposition to the heuristic proposed in the former\nto measure the limits of the attack. More precisely, the main problem is\nformulated as the search for a closest vector to a lattice, then we study the\ndistribution of the vectors with bounded norms in a this family of lattices and\nwe apply the result to predict the behavior of the attack. We validated this\napproach by computational experiments.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 11:33:05 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Gomez-Perez", "Domingo", ""], ["Renault", "Guénaël", ""]]}, {"id": "1712.09831", "submitter": "Aleksey Fedorov", "authors": "A.V. Duplinskiy, E.O. Kiktenko, N.O. Pozhar, M.N. Anufriev, R.P.\n  Ermakov, A.I. Kotov, A.V. Brodskiy, R.R. Yunusov, V.L. Kurochkin, A.K.\n  Fedorov, and Y.V. Kurochkin", "title": "Quantum-secured data transmission in urban fibre-optic communication\n  lines", "comments": "4 pages, 3 figures", "journal-ref": "J. Russ. Laser Res. 39, 113 (2018)", "doi": "10.1007/s10946-018-9697-1", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum key distribution (QKD) provides theoretic information security in\ncommunications based on the laws of quantum physics. In this work, we report an\nimplementation of quantum-secured data transmission in the infrastructure of\nSberbank of Russia in standard communication lines in Moscow. The experiment is\nrealized on the basis of already deployed urban fiber-optics communication\nchannels with significant losses. We realize the decoy-state BB84 QKD protocol\nusing the one-way scheme with polarization encoding for generating keys.\nQuantum-generated keys are then used for continuous key renewal in the hardware\ndevices for establishing a quantum-secured VPN Tunnel between two offices of\nSberbank. The hybrid approach used offers possibilities for long-term\nprotection of the transmitted data; it is promising for integrating into the\nalready existing information security infrastructure.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 11:34:32 GMT"}, {"version": "v2", "created": "Sun, 3 Jun 2018 10:43:12 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Duplinskiy", "A. V.", ""], ["Kiktenko", "E. O.", ""], ["Pozhar", "N. O.", ""], ["Anufriev", "M. N.", ""], ["Ermakov", "R. P.", ""], ["Kotov", "A. I.", ""], ["Brodskiy", "A. V.", ""], ["Yunusov", "R. R.", ""], ["Kurochkin", "V. L.", ""], ["Fedorov", "A. K.", ""], ["Kurochkin", "Y. V.", ""]]}, {"id": "1712.09859", "submitter": "Hengchuan Tan", "authors": "Hengchuan Tan, Maode Ma, Houda Labiod (INFRES), Aymen Boudguiga (IRT\n  SystemX), Jun Zhang (INFRES), Peter Han Joo Chong (AUT)", "title": "A Secure and Authenticated Key Management Protocol (SA-KMP) for\n  Vehicular Networks", "comments": null, "journal-ref": "IEEE Transactions on Vehicular Technology, Institute of Electrical\n  and Electronics Engineers, 2016, 65 (12), pp.9570 - 9584", "doi": "10.1109/TVT.2016.2621354", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Public key infrastructure (PKI) is the most widely used security mechanism\nfor securing communications over the network. However, there are known\nperformance issues, making it unsuitable for use in vehicular networks. In this\npaper, we propose a secure and authenticated key management protocol (SA-KMP)\nto overcome the shortcomings of the PKI. The SA-KMP scheme distributes\nrepository containing the bindings of the en-tity's identity and its\ncorresponding public key to each vehicle and road side unit. By doing so,\ncertificate exchanges and certificate revocation lists are eliminated.\nFurthermore, the SA-KMP scheme uses symmetric keys derived based on a\n3-D-matrix-based key agreement scheme to reduce the high computational costs of\nusing asymmetric cryptography. We demonstrate the efficiency of the SA-KMP\nthrough performance evaluations in terms of transmission and storage overhead,\nnetwork latency, and key generation time. Analytical results show that the\nSA-KMP is more scalable and outperforms the certificate-based PKI. Simulation\nresults indicate that the key generation time of the SA-KMP scheme is less than\nthat of the existing Elliptic Curve Diffie--Hellman and Diffie--Hellman\nprotocols. In addition, we use Proverif to prove that the SA-KMP scheme is\nsecure against an active attacker under the Dolev and Yao model and further\nshow that the SA-KMP scheme is secure against denial of service, collusion\nattacks, and a wide range of other malicious attacks.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 13:55:54 GMT"}], "update_date": "2019-05-01", "authors_parsed": [["Tan", "Hengchuan", "", "INFRES"], ["Ma", "Maode", "", "INFRES"], ["Labiod", "Houda", "", "INFRES"], ["Boudguiga", "Aymen", "", "IRT\n  SystemX"], ["Zhang", "Jun", "", "INFRES"], ["Chong", "Peter Han Joo", "", "AUT"]]}, {"id": "1712.09862", "submitter": "Hengchuan Tan", "authors": "Heng Chuan Tan, Maode Ma, Houda Labiod (INFRES), Peter Han Joo Chong\n  (AUT), Jun Zhang (INFRES)", "title": "A non-biased trust model for wireless mesh networks", "comments": null, "journal-ref": "International Journal of Communication Systems, Wiley, 2016, 30\n  (9)", "doi": "10.1002/dac.3200", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Trust models that rely on recommendation trusts are vulnerable to badmouthing\nand ballot-stuffing attacks. To cope with these attacks, existing trust models\nuse different trust aggregation techniques to process the recommendation trusts\nand combine them with the direct trust values to form a combined trust value.\nHowever, these trust models are biased as recommendation trusts that deviate\ntoo much from one's own opinion are discarded. In this paper, we propose a\nnon-biased trust model that considers every recommendation trusts available\nregardless they are good or bad. Our trust model is based on a combination of 2\ntechniques: the dissimilarity test and the Dempster-Shafer Theory. The\ndissimilarity test determines the amount of conflict between 2 trust records,\nwhereas the Dempster-Shafer Theory assigns belief functions based on the\nresults of the dissimilarity test. Numerical results show that our trust model\nis robust against reputation-based attacks when compared to trust aggregation\ntechniques such as the linear opinion pooling, subjective logic model,\nentropy-based probability model, and regression analysis. In addition, our\nmodel has been extensively tested using network simulator NS-3 in an\nInfrastructure-based wireless mesh networks and a Hybrid-based wireless mesh\nnetworks to demonstrate that it can mitigate blackhole and grayhole attacks.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 14:00:33 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Tan", "Heng Chuan", "", "INFRES"], ["Ma", "Maode", "", "INFRES"], ["Labiod", "Houda", "", "INFRES"], ["Chong", "Peter Han Joo", "", "AUT"], ["Zhang", "Jun", "", "INFRES"]]}, {"id": "1712.09864", "submitter": "Hengchuan Tan", "authors": "Hengchuan Tan, Maode Ma, Houda Labiod (INFRES), Peter Han Joo Chong", "title": "TEDS: A Trusted Entropy and Dempster Shafer Mechanism for Routing in\n  Wireless Mesh Networks", "comments": null, "journal-ref": "MOBILITY 2014 The Fourth International Conference on Mobile\n  Services, Resources, and Users, Jul 2014, Paris, France", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Mesh Networks (WMNs) have emerged as a key technology for the next\ngeneration of wireless networking due to its self-forming, self-organizing and\nself-healing properties. However, due to the multi-hop nature of communications\nin WMN, we cannot assume that all nodes in the network are cooperative. Nodes\nmay drop all of the data packets they received to mount a Denial of Service\n(DoS) attack. In this paper, we proposed a lightweight trust detection\nmechanism called Trusted Entropy and Dempster Shafer (TEDS) to mitigate the\neffects of blackhole attacks. This novel idea combines entropy function and\nDempster Shafer belief theory to derive a trust rating for a node. If the trust\nrating of a node is less than a threshold, it will be blacklisted and isolated\nfrom the network. In this way, the network can be assured of a secure end to\nend path free of malicious nodes for data forwarding. Our proposed idea has\nbeen extensively tested in simulation using network simulator NS-3 and\nsimulation results show that we are able to improve the packet delivery ratio\nwith slight increase in normalized routing overhead.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 14:02:08 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Tan", "Hengchuan", "", "INFRES"], ["Ma", "Maode", "", "INFRES"], ["Labiod", "Houda", "", "INFRES"], ["Chong", "Peter Han Joo", ""]]}, {"id": "1712.09916", "submitter": "Fatemeh Afghah", "authors": "Fatemeh Afghah, Bertrand Cambou, Masih Abedini, Sherali Zeadally", "title": "A ReRAM Physically Unclonable Function (ReRAM PUF)-based Approach to\n  Enhance Authentication Security in Software Defined Wireless Networks", "comments": "16 pages, 10 figures, submitted to Springer International Journal of\n  Wireless Information Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The exponentially increasing number of ubiquitous wireless devices connected\nto the Internet in Internet of Things (IoT) networks highlights the need for a\nnew paradigm of data flow management in such large-scale networks under\nsoftware defined wireless networking (SDWN). The limited power and computation\ncapability available at IoT devices as well as the centralized management and\ndecision-making approach in SDWN introduce a whole new set of security threats\nto the networks. In particular, the authentication mechanism between the\ncontrollers and the forwarding devices in SDWNs is a key challenge from both\nsecrecy and integrity aspects. Conventional authentication protocols based on\npublic key infrastructure (PKI) are no longer sufficient for these networks\nconsidering the large-scale and heterogeneity nature of the networks as well as\ntheir deployment cost, and security vulnerabilities due to key distribution and\nstorage. We propose a novel security protocol based on physical unclonable\nfunctions (PUFs) known as hardware security primitives to enhance the\nauthentication security in SDWNs. In this approach, digital PUFs are developed\nusing the inherent randomness of the nanomaterials of Resistive Random Access\nMemory (ReRAM) that are embedded in most IoT devices to enable a secure\nauthentication and access control in these networks. These PUFs are developed\nbased on a novel approach of multi-states, in which the natural drifts due to\nthe physical variations in the environment are predicted to reduce the\npotential errors in challenge-response pairs of PUFs being tested in different\nsituations. We also proposed a PUF-based PKI protocol to secure the controller\nin SDWNs. The performance of the developed ReRAM-based PUFs are evaluated in\nthe experimental results.\n", "versions": [{"version": "v1", "created": "Thu, 21 Dec 2017 18:54:36 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Afghah", "Fatemeh", ""], ["Cambou", "Bertrand", ""], ["Abedini", "Masih", ""], ["Zeadally", "Sherali", ""]]}, {"id": "1712.10155", "submitter": "Jerome Darmont", "authors": "Varunya Attasena, J\\'er\\^ome Darmont (ERIC), Nouria Harbi (ERIC)", "title": "Secret Sharing for Cloud Data Security", "comments": null, "journal-ref": "The International Journal on Very Large Databases,\n  Springer-Verlag, 2017, 26 (5), pp.657-681", "doi": "10.1007/s00778-017-0470-9", "report-no": null, "categories": "cs.DB cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing helps reduce costs, increase business agility and deploy\nsolutions with a high return on investment for many types of applications.\nHowever, data security is of premium importance to many users and often\nrestrains their adoption of cloud technologies. Various approaches, i.e., data\nencryption, anonymization, replication and verification, help enforce different\nfacets of data security. Secret sharing is a particularly interesting\ncryptographic technique. Its most advanced variants indeed simultaneously\nenforce data privacy, availability and integrity, while allowing computation on\nencrypted data. The aim of this paper is thus to wholly survey secret sharing\nschemes with respect to data security, data access and costs in the\npay-as-you-go paradigm.\n", "versions": [{"version": "v1", "created": "Fri, 29 Dec 2017 09:10:21 GMT"}], "update_date": "2018-01-01", "authors_parsed": [["Attasena", "Varunya", "", "ERIC"], ["Darmont", "Jérôme", "", "ERIC"], ["Harbi", "Nouria", "", "ERIC"]]}, {"id": "1712.10193", "submitter": "Xi Zhao", "authors": "Xi Zhao, Yong Ding, Quanyu Zhao", "title": "A multi-candidate electronic voting scheme with unlimited participants", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper a new multi-candidate electronic voting scheme is constructed\nwith unlimited participants. The main idea is to express a ballot to allow\nvoting for up to k out of the m candidates and unlimited participants. The\npurpose of vote is to select more than one winner among $m$ candidates. Our\nresult is complementary to the result by Sun peiyong$'$ s scheme, in the sense,\ntheir scheme is not amenable for large-scale electronic voting due to flaw of\nballot structure. In our scheme the vote is split and hidden, and tallying is\nmade for $G\\ddot{o}del$ encoding in decimal base without any trusted third\nparty, and the result does not rely on any traditional cryptography or\ncomputational intractable assumption. Thus the proposed scheme not only solves\nthe problem of ballot structure, but also achieves the security including\nperfect ballot secrecy, receipt-free, robustness, fairness and\ndispute-freeness.\n", "versions": [{"version": "v1", "created": "Fri, 29 Dec 2017 11:52:23 GMT"}], "update_date": "2018-01-01", "authors_parsed": [["Zhao", "Xi", ""], ["Ding", "Yong", ""], ["Zhao", "Quanyu", ""]]}, {"id": "1712.10222", "submitter": "Simina Br\\^anzei", "authors": "Simina Br\\^anzei and Erel Segal-Halevi and Aviv Zohar", "title": "How to Charge Lightning", "comments": "Presented at Scaling Bitcoin 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Off-chain transaction channels represent one of the leading techniques to\nscale the transaction throughput in cryptocurrencies. However, the economic\neffect of transaction channels on the system has not been explored much until\nnow. We study the economics of Bitcoin transaction channels, and present a\nframework for an economic analysis of the lightning network and its effect on\ntransaction fees on the blockchain. Our framework allows us to reason about\ndifferent patterns of demand for transactions and different topologies of the\nlightning network, and to derive the resulting fees for transacting both on and\noff the blockchain.\n  Our initial results indicate that while the lightning network does allow for\na substantially higher number of transactions to pass through the system, it\ndoes not necessarily provide higher fees to miners, and as a result may in fact\nlead to lower participation in mining within the system.\n", "versions": [{"version": "v1", "created": "Fri, 29 Dec 2017 13:33:46 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Brânzei", "Simina", ""], ["Segal-Halevi", "Erel", ""], ["Zohar", "Aviv", ""]]}]