[{"id": "1303.0031", "submitter": "Anatoly Manita", "authors": "Anatoly Manita", "title": "Time Scales in Probabilistic Models of Wireless Sensor Networks", "comments": "31 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.DC cs.MA math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a stochastic model of clock synchronization in a wireless network\nconsisting of N sensors interacting with one dedicated accurate time server.\nFor large N we find an estimate of the final time sychronization error for\nglobal and relative synchronization. Main results concern a behavior of the\nnetwork on different time scales $t=t_N \\to \\infty$, $N \\to \\infty$. We discuss\nexistence of phase transitions and find exact time scales on which an effective\nclock synchronization of the system takes place.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2013 21:53:55 GMT"}], "update_date": "2013-03-04", "authors_parsed": [["Manita", "Anatoly", ""]]}, {"id": "1303.0071", "submitter": "EPTCS", "authors": "Fabio Mogavero (Universit\\`a degli Studi di Napoli Federico II),\n  Aniello Murano (Universit\\`a degli Studi di Napoli Federico II), Moshe Y.\n  Vardi (Rice University)", "title": "Proceedings 1st International Workshop on Strategic Reasoning", "comments": null, "journal-ref": "EPTCS 112, 2013", "doi": "10.4204/EPTCS.112", "report-no": null, "categories": "cs.GT cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 1st International Workshop on\nStrategic Reasoning 2013 (SR 2013), held in Rome (Italy), March 1617, 2013. The\nSR workshop aims to bring together researchers, possibly with different\nbackgrounds, working on various aspects of strategic reasoning in computer\nscience, both from a theoretical and a practical point of view. This year SR\nhas hosted four outstanding invited talks by Krishnendu Chatterjee, Alessio R.\nLomuscio, Jean-Francois Raskin, and Michael Wooldridge. Moreover, the program\ncommittee selected 13 papers among the 23 contributions submitted. Almost all\nof them have been revised by three reviews and the contributions have been\nselected according to quality and relevance to the topics of the workshop.\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2013 02:56:53 GMT"}], "update_date": "2013-03-04", "authors_parsed": [["Mogavero", "Fabio", "", "Università degli Studi di Napoli Federico II"], ["Murano", "Aniello", "", "Università degli Studi di Napoli Federico II"], ["Vardi", "Moshe Y.", "", "Rice University"]]}, {"id": "1303.0789", "submitter": "EPTCS", "authors": "Nils Bulling (Clausthal University of Technology), Valentin Goranko\n  (Technical University of Denmark)", "title": "How to Be Both Rich and Happy: Combining Quantitative and Qualitative\n  Strategic Reasoning about Multi-Player Games (Extended Abstract)", "comments": "In Proceedings SR 2013, arXiv:1303.0071", "journal-ref": "EPTCS 112, 2013, pp. 33-41", "doi": "10.4204/EPTCS.112.8", "report-no": null, "categories": "cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a logical framework combining a game-theoretic study of abilities\nof agents to achieve quantitative objectives in multi-player games by\noptimizing payoffs or preferences on outcomes with a logical analysis of the\nabilities of players for achieving qualitative objectives of players, i.e.,\nreaching or maintaining game states with desired properties. We enrich\nconcurrent game models with payoffs for the normal form games associated with\nthe states of the model and propose a quantitative extension of the logic ATL*\nenabling the combination of quantitative and qualitative reasoning.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 19:06:01 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Bulling", "Nils", "", "Clausthal University of Technology"], ["Goranko", "Valentin", "", "Technical University of Denmark"]]}, {"id": "1303.0791", "submitter": "EPTCS", "authors": "Marta Kwiatkowska (University of Oxford), David Parker (University of\n  Birmingham), Aistis Simaitis (University of Oxford)", "title": "Strategic Analysis of Trust Models for User-Centric Networks", "comments": "In Proceedings SR 2013, arXiv:1303.0071", "journal-ref": "EPTCS 112, 2013, pp. 53-59", "doi": "10.4204/EPTCS.112.10", "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a strategic analysis of a trust model that has recently been\nproposed for promoting cooperative behaviour in user-centric networks. The\nmechanism for cooperation is based on a combination of reputation and virtual\ncurrency schemes in which service providers reward paying customers and punish\nnon-paying ones by adjusting their reputation, and hence the price they pay for\nservices. We model and analyse this system using PRISM-games, a tool that\nperforms automated verification and strategy synthesis for stochastic\nmulti-player games using the probabilistic alternating-time temporal logic with\nrewards (rPATL). We construct optimal strategies for both service users and\nproviders, which expose potential risks of the cooperation mechanism and which\nwe use to devise improvements that counteract these risks.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 19:06:16 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Kwiatkowska", "Marta", "", "University of Oxford"], ["Parker", "David", "", "University of\n  Birmingham"], ["Simaitis", "Aistis", "", "University of Oxford"]]}, {"id": "1303.0792", "submitter": "EPTCS", "authors": "Truls Pedersen (Dept. of Information science and media studies,\n  University of Bergen, Norway), Sjur Dyrkolbotn (Durham Law School, Durham\n  University, United Kingdom), Piotr Ka\\'zmierczak (Dept. of Computing,\n  Mathematics and Physics, Bergen University College, Norway), Erik Parmann\n  (Dept. of Informatics, University of Bergen, Norway)", "title": "Concurrent Game Structures with Roles", "comments": "In Proceedings SR 2013, arXiv:1303.0071", "journal-ref": "EPTCS 112, 2013, pp. 61-69", "doi": "10.4204/EPTCS.112.11", "report-no": null, "categories": "cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the following paper we present a new semantics for the well-known\nstrategic logic ATL. It is based on adding roles to concurrent game structures,\nthat is at every state, each agent belongs to exactly one role, and the role\nspecifies what actions are available to him at that state. We show advantages\nof the new semantics, provide motivating examples based on sensor networks, and\nanalyze model checking complexity.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 19:06:24 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Pedersen", "Truls", "", "Dept. of Information science and media studies,\n  University of Bergen, Norway"], ["Dyrkolbotn", "Sjur", "", "Durham Law School, Durham\n  University, United Kingdom"], ["Kaźmierczak", "Piotr", "", "Dept. of Computing,\n  Mathematics and Physics, Bergen University College, Norway"], ["Parmann", "Erik", "", "Dept. of Informatics, University of Bergen, Norway"]]}, {"id": "1303.0793", "submitter": "EPTCS", "authors": "Simon Busard (UCLouvain, Belgium), Charles Pecheur (UCLouvain,\n  Belgium), Hongyang Qu (University of Oxford, UK), Franco Raimondi (Middlesex\n  University, UK)", "title": "Reasoning about Strategies under Partial Observability and Fairness\n  Constraints", "comments": "In Proceedings SR 2013, arXiv:1303.0071", "journal-ref": "EPTCS 112, 2013, pp. 71-79", "doi": "10.4204/EPTCS.112.12", "report-no": null, "categories": "cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A number of extensions exist for Alternating-time Temporal Logic; some of\nthese mix strategies and partial observability but, to the best of our\nknowledge, no work provides a unified framework for strategies, partial\nobservability and fairness constraints. In this paper we propose ATLK^F_po, a\nlogic mixing strategies under partial observability and epistemic properties of\nagents in a system with fairness constraints on states, and we provide a model\nchecking algorithm for it.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 19:06:32 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Busard", "Simon", "", "UCLouvain, Belgium"], ["Pecheur", "Charles", "", "UCLouvain,\n  Belgium"], ["Qu", "Hongyang", "", "University of Oxford, UK"], ["Raimondi", "Franco", "", "Middlesex\n  University, UK"]]}, {"id": "1303.0794", "submitter": "EPTCS", "authors": "Dimitar P. Guelev (Institute of Mathematics and Informatics, Bulgarian\n  Academy of Sciences)", "title": "Reducing Validity in Epistemic ATL to Validity in Epistemic CTL", "comments": "In Proceedings SR 2013, arXiv:1303.0071", "journal-ref": "EPTCS 112, 2013, pp. 81-89", "doi": "10.4204/EPTCS.112.13", "report-no": null, "categories": "cs.LO cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a validity preserving translation from a subset of epistemic\nAlternating-time Temporal Logic (ATL) to epistemic Computation Tree Logic\n(CTL). The considered subset of epistemic ATL is known to have the finite model\nproperty and decidable model-checking. This entails the decidability of\nvalidity but the implied algorithm is unfeasible. Reducing the validity problem\nto that in a corresponding system of CTL makes the techniques for automated\ndeduction for that logic available for the handling of the apparently more\ncomplex system of ATL.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 19:06:40 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Guelev", "Dimitar P.", "", "Institute of Mathematics and Informatics, Bulgarian\n  Academy of Sciences"]]}, {"id": "1303.2173", "submitter": "Pedro Henrique Juliano Nardelli", "authors": "Pedro H. J. Nardelli, Carlos H. Morais de Lima, Hirley Alves, Paulo\n  Cardieri and Matti Latva-aho", "title": "Throughput Analysis of Cognitive Wireless Networks with Poisson\n  Distributed Nodes Based on Location Information", "comments": "Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.MA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper provides a statistical characterization of the individual\nachievable rates in bits/s/Hz and the spatial throughput of bipolar Poisson\nwireless networks in bits/s/Hz/m$^2$. We assume that all transmitters have a\ncognitive ability to know the distance to their receiver's closest interferers\nso they can individually tune their coding rates to avoid outage events for\neach spatial realization. Considering that the closest interferer approximates\nthe aggregate interference of all transmitters treated as noise, we derive\nclosed-form expressions for the probability density function of the achievable\nrates under two decoding rules: treating interference as noise, and jointly\ndetecting the strongest interfering signals treating the others as noise. Based\non these rules and the bipolar model, we approximate the expected maximum\nspatial throughput, showing the best performance of the latter decoding rule.\nThese results are also compared to the reference scenario where the\ntransmitters do not have cognitive ability, coding their messages at\npredetermined rates that are chosen to optimize the expected spatial throughput\n-- regardless of particular realizations -- which yields outages. We prove\nthat, when the same decoding rule and network density are considered, the\ncognitive spatial throughput always outperforms the other option.\n", "versions": [{"version": "v1", "created": "Sat, 9 Mar 2013 06:16:02 GMT"}, {"version": "v2", "created": "Wed, 1 Jan 2014 07:05:15 GMT"}, {"version": "v3", "created": "Sun, 27 Apr 2014 16:54:01 GMT"}], "update_date": "2014-04-29", "authors_parsed": [["Nardelli", "Pedro H. J.", ""], ["de Lima", "Carlos H. Morais", ""], ["Alves", "Hirley", ""], ["Cardieri", "Paulo", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1303.2789", "submitter": "Hussein Saad", "authors": "Hussein Saad, Amr Mohamed and Tamer ElBatt", "title": "A Cooperative Q-learning Approach for Real-time Power Allocation in\n  Femtocell Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address the problem of distributed interference management\nof cognitive femtocells that share the same frequency range with macrocells\n(primary user) using distributed multi-agent Q-learning. We formulate and solve\nthree problems representing three different Q-learning algorithms: namely,\ncentralized, distributed and partially distributed power control using\nQ-learning (CPC-Q, DPC-Q and PDPC-Q). CPCQ, although not of practical interest,\ncharacterizes the global optimum. Each of DPC-Q and PDPC-Q works in two\ndifferent learning paradigms: Independent (IL) and Cooperative (CL). The former\nis considered the simplest form for applying Qlearning in multi-agent\nscenarios, where all the femtocells learn independently. The latter is the\nproposed scheme in which femtocells share partial information during the\nlearning process in order to strike a balance between practical relevance and\nperformance. In terms of performance, the simulation results showed that the CL\nparadigm outperforms the IL paradigm and achieves an aggregate femtocells\ncapacity that is very close to the optimal one. For the practical relevance\nissue, we evaluate the robustness and scalability of DPC-Q, in real time, by\ndeploying new femtocells in the system during the learning process, where we\nshowed that DPC-Q in the CL paradigm is scalable to large number of femtocells\nand more robust to the network dynamics compared to the IL paradigm\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2013 07:00:04 GMT"}], "update_date": "2013-03-13", "authors_parsed": [["Saad", "Hussein", ""], ["Mohamed", "Amr", ""], ["ElBatt", "Tamer", ""]]}, {"id": "1303.3827", "submitter": "Jo\\~ao Em\\'ilio Almeida", "authors": "Jo\\~ao Ribeiro, Jo\\~ao Em\\'ilio Almeida, Rosaldo J. F. Rossetti,\n  Ant\\'onio Coelho, Ant\\'onio Le\\c{c}a Coelho", "title": "Towards a serious games evacuation simulator", "comments": "26th European Conference on Modelling and Simulation ECMS 2012,\n  Koblenz, Germany; ISBN: 978-0-9564944-4-3", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evacuation of complex buildings is a challenge under any circumstances.\nFire drills are a way of training and validating evacuation plans. However,\nsometimes these plans are not taken seriously by their participants. It is also\ndifficult to have the financial and time resources required. In this scenario,\nserious games can be used as a tool for training, planning and evaluating\nemergency plans. In this paper a prototype of a serious games evacuation\nsimulator is presented. To make the environment as realistic as possible, 3D\nmodels were made using Blender and loaded onto Unity3D, a popular game engine.\nThis framework provided us with the appropriate simulation environment. Some\nexperiences were made and results show that this tool has potential for\npractitioners and planners to use it for training building occupants.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2013 16:53:29 GMT"}], "update_date": "2013-03-18", "authors_parsed": [["Ribeiro", "João", ""], ["Almeida", "João Emílio", ""], ["Rossetti", "Rosaldo J. F.", ""], ["Coelho", "António", ""], ["Coelho", "António Leça", ""]]}, {"id": "1303.3828", "submitter": "Jo\\~ao Em\\'ilio Almeida", "authors": "Jo\\~ao Ribeiro, Jo\\~ao Em\\'ilio Almeida, Rosaldo J. F. Rossetti,\n  Ant\\'onio Coelho, Ant\\'onio Le\\c{c}a Coelho", "title": "Using Serious Games to Train Evacuation Behaviour", "comments": "CISTI 2012 - 7 Conferencia Ib\\'erica de Sistemas y Tecnolog\\'ias de\n  Informaci\\'on, pp 771-776, Madrid, Spain. ISBN: 978-989-96247-6-4", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Emergency evacuation plans and evacuation drills are mandatory in public\nbuildings in many countries. Their importance is considerable when it comes to\nguarantee safety and protection during a crisis. However, sometimes\ndiscrepancies arise between the goals of the plan and its outcomes, because\npeople find it hard to take them very seriously, or due to the financial and\ntime resources required. Serious games are a possible solution to tackle this\nproblem. They have been successfully applied in different areas such as health\ncare and education, since they can simulate an environment/task quite\naccurately, making them a practical alternative to real-life simulations. This\npaper presents a serious game developed using Unity3D to recreate a virtual\nfire evacuation training tool. The prototype application was deployed which\nallowed the validation by user testing. A sample of 30 individuals tested the\nevacuating scenario, having to leave the building during a fire in the shortest\ntime possible. Results have shown that users effectively end up learning some\nevacuation procedures from the activity, even if only to look for emergency\nsigns indicating the best evacuation paths. It was also evidenced that users\nwith higher video game experience had a significantly better performance.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2013 16:58:00 GMT"}], "update_date": "2013-03-18", "authors_parsed": [["Ribeiro", "João", ""], ["Almeida", "João Emílio", ""], ["Rossetti", "Rosaldo J. F.", ""], ["Coelho", "António", ""], ["Coelho", "António Leça", ""]]}, {"id": "1303.4692", "submitter": "Jo\\~ao Em\\'ilio Almeida", "authors": "Jo\\~ao E. Almeida, Rosaldo J. F. Rosseti, Ant\\'onio Le\\c{c}a Coelho", "title": "Crowd Simulation Modeling Applied to Emergency and Evacuation\n  Simulations using Multi-Agent Systems", "comments": "DSIE'11 - 6th Doctoral Symposium on Informatics Engineering, FEUP -\n  Engineering Faculty of Porto University, Porto", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years crowd modeling has become increasingly important both in the\ncomputer games industry and in emergency simulation. This paper discusses some\naspects of what has been accomplished in this field, from social sciences to\nthe computer implementation of modeling and simulation. Problem overview is\ndescribed including some of the most common techniques used. Multi-Agent\nSystems is stated as the preferred approach for emergency evacuation\nsimulations. A framework is proposed based on the work of Fangqin and Aizhu\nwith extensions to include some BDI aspects. Future work includes expansion of\nthe model's features and implementation of a prototype for validation of the\npropose methodology.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2013 15:58:26 GMT"}], "update_date": "2013-03-20", "authors_parsed": [["Almeida", "João E.", ""], ["Rosseti", "Rosaldo J. F.", ""], ["Coelho", "António Leça", ""]]}, {"id": "1303.4695", "submitter": "Jo\\~ao Em\\'ilio Almeida", "authors": "Jo\\~ao Em\\'ilio Almeida, Zafeiris Kokkinogenis, Rosaldo J. F. Rossetti", "title": "NetLogo Implementation of an Evacuation Scenario", "comments": "WISA'2012 (Fourth Workshop on Intelligent Systems and Applications),\n  Madrid, Spain. ISBN: 978-1-4673-2843-2", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of evacuating crowded closed spaces, such as discotheques, public\nexhibition pavilions or concert houses, has become increasingly important and\ngained attention both from practitioners and from public authorities. A\nsimulation implementation using NetLogo, an agent-based simulation framework\nthat permits the quickly creation of prototypes, is presented. Our aim is to\nprove that this model developed using NetLogo, albeit simple can be expanded\nand adapted for fire safety experts test various scenarios and validate the\noutcome of their design. Some preliminary experiments are carried out, whose\nresults are presented, validated and discussed so as to illustrate their\nefficiency. Finally, we draw some conclusions and point out ways in which this\nwork can be further extended.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2013 17:01:47 GMT"}], "update_date": "2013-03-20", "authors_parsed": [["Almeida", "João Emílio", ""], ["Kokkinogenis", "Zafeiris", ""], ["Rossetti", "Rosaldo J. F.", ""]]}, {"id": "1303.5029", "submitter": "Giuseppe Vizzari", "authors": "Stefania Bandini and Andrea Gorrini and Giuseppe Vizzari", "title": "Towards an Integrated Approach to Crowd Analysis and Crowd Synthesis: a\n  Case Study and First Results", "comments": "Preprint submitted to Pattern Recognition Letters March 20, 2013", "journal-ref": null, "doi": "10.1016/j.patrec.2013.10.003", "report-no": null, "categories": "cs.MA physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Studies related to crowds of pedestrians, both those of theoretical nature\nand application oriented ones, have generally focused on either the analysis or\nthe synthesis of the phenomena related to the interplay between individual\npedestrians, each characterised by goals, preferences and potentially relevant\nrelationships with others, and the environment in which they are situated. The\ncases in which these activities have been systematically integrated for a\nmutual benefit are still very few compared to the corpus of crowd related\nliterature. This paper presents a case study of an integrated approach to the\ndefinition of an innovative model for pedestrian and crowd simulation (on the\nside of synthesis) that was actually motivated and supported by the analyses of\nempirical data acquired from both experimental settings and observations in\nreal world scenarios. In particular, we will introduce a model for the adaptive\nbehaviour of pedestrians that are also members of groups, that strive to\nmaintain their cohesion even in difficult (e.g. high density) situations. The\npaper will show how the synthesis phase also provided inputs to the analysis of\nempirical data, in a virtuous circle.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 19:03:26 GMT"}], "update_date": "2013-11-07", "authors_parsed": [["Bandini", "Stefania", ""], ["Gorrini", "Andrea", ""], ["Vizzari", "Giuseppe", ""]]}, {"id": "1303.6091", "submitter": "Anna Zygmunt", "authors": "Jaros{\\l}aw Ko\\'zlak, Anna Zygmunt", "title": "Agent-based modelling of social organisations", "comments": "International Conference on Complex, Intelligent and Software\n  Intensive Systems, CISIS 2011, June 30 - July 2, 2011, Korean Bible\n  University, Seoul, Korea, pp. 467-472", "journal-ref": "IEEE Computer Society, 2011", "doi": null, "report-no": null, "categories": "cs.SI cs.MA physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the paper, the model of the society represented by a social network and\nthe model of a multi-agent system built on the basis of this, is presented. The\nparticular aim of the system is to predict the evolution of a society and an\nanalysis of the communities that appear, their characteristic features and\nreasons for coming into being. As an example of application, an analysis was\nmade of a social portal which makes it possible to offer and reserve places in\nrooms for travelling tourists\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2013 11:17:29 GMT"}], "update_date": "2016-10-05", "authors_parsed": [["Koźlak", "Jarosław", ""], ["Zygmunt", "Anna", ""]]}, {"id": "1303.6094", "submitter": "Anna Zygmunt", "authors": "Jaros{\\l}aw Ko\\'zlak, Anna Zygmunt, Edward Nawarecki", "title": "Modelling and analysing relations between entities using the\n  multi-agents and social network approaches", "comments": null, "journal-ref": "IEEE 2012", "doi": null, "report-no": null, "categories": "cs.SI cs.MA physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, the concept of a system for analysing social relations between\nentities using the social network analysis and multi-agent system approaches is\npresented. The following problems especially appear within the domain of our\ninterests: identification of the most influential individuals in a given\nsociety, identification of roles played by the given individuals in that\nsociety and the recognition of groups of individuals strongly connected with\none another. For the analysis of these problems, two application domains are\nselected: an analysis of data regarding phone calls and analysis of Internet\nWeblogs.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2013 11:32:08 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Koźlak", "Jarosław", ""], ["Zygmunt", "Anna", ""], ["Nawarecki", "Edward", ""]]}, {"id": "1303.6106", "submitter": "Anna Zygmunt", "authors": "Anna Zygmunt, Jaros{\\l}aw Ko\\'zlak, Leszek Siwik", "title": "Agent-based environment for knowledge integration", "comments": "Computational Science - ICCS 2009, 9th International Conference,\n  Baton Rouge, LA, USA, May 25-27, 2009, Proceedings, Part II, pp. 885-894", "journal-ref": "ICCS 2009, LNCS 5545, 2009", "doi": "10.1007/978-3-642-01973-9", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Representing knowledge with the use of ontology description languages offers\nseveral advantages arising from knowledge reusability, possibilities of\ncarrying out reasoning processes and the use of existing concepts of knowledge\nintegration. In this work we are going to present an environment for the\nintegration of knowledge expressed in such a way. Guaranteeing knowledge\nintegration is an important element during the development of the Semantic Web.\nThanks to this, it is possible to obtain access to services which offer\nknowledge contained in various distributed databases associated with\nsemantically described web portals. We will present the advantages of the\nmulti-agent approach while solving this problem. Then, we will describe an\nexample of its application in systems supporting company management knowledge\nin the process of constructing supply-chains.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2013 12:03:44 GMT"}], "update_date": "2013-04-09", "authors_parsed": [["Zygmunt", "Anna", ""], ["Koźlak", "Jarosław", ""], ["Siwik", "Leszek", ""]]}, {"id": "1303.7103", "submitter": "Federico Penna", "authors": "Federico Penna, Slawomir Stanczak", "title": "Decentralized Eigenvalue Algorithms for Distributed Signal Detection in\n  Cognitive Networks", "comments": "Submitted to IEEE JSAC Cognitive Radio Series", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we derive and analyze two algorithms -- referred to as\ndecentralized power method (DPM) and decentralized Lanczos algorithm (DLA) --\nfor distributed computation of one (the largest) or multiple eigenvalues of a\nsample covariance matrix over a wireless network. The proposed algorithms,\nbased on sequential average consensus steps for computations of matrix-vector\nproducts and inner vector products, are first shown to be equivalent to their\ncentralized counterparts in the case of exact distributed consensus. Then,\nclosed-form expressions of the error introduced by non-ideal consensus are\nderived for both algorithms. The error of the DPM is shown to vanish\nasymptotically under given conditions on the sequence of consensus errors.\nFinally, we consider applications to spectrum sensing in cognitive radio\nnetworks, and we show that virtually all eigenvalue-based tests proposed in the\nliterature can be implemented in a distributed setting using either the DPM or\nthe DLA. Simulation results are presented that validate the effectiveness of\nthe proposed algorithms in conditions of practical interest (large-scale\nnetworks, small number of samples, and limited number of iterations).\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 11:42:28 GMT"}], "update_date": "2013-03-29", "authors_parsed": [["Penna", "Federico", ""], ["Stanczak", "Slawomir", ""]]}, {"id": "1303.7377", "submitter": "Neeraj Kumar Sharma", "authors": "Vibha Gaur, Neeraj Kumar Sharma, Punam Bedi", "title": "Evaluating Reputation Systems for Agent Mediated e-Commerce", "comments": "5 pages. arXiv admin note: text overlap with arXiv:1110.3961", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agent mediated e-commerce involves buying and selling on Internet through\nsoftware agents. The success of an agent mediated e-commerce system lies in the\nunderlying reputation management system which is used to improve the quality of\nservices in e-market environment. A reputation system encourages the honest\nbehaviour of seller agents and discourages the malicious behaviour of dishonest\nseller agents in the e-market where actual traders never meet each other. This\npaper evaluates various reputation systems for assigning reputation rating to\nsoftware agents acting on behalf of buyers and sellers in e-market. These\nmodels are analysed on the basis of a number of features viz. reputation\ncomputation and their defence mechanisms against different attacks. To address\nthe problems of traditional reputation systems which are relatively static in\nnature, this paper identifies characteristics of a dynamic reputation framework\nwhich ensures judicious use of information sharing for inter-agent cooperation\nand also associates the reputation of an agent with the value of a transaction\nso that the market approaches an equilibrium state and dishonest agents are\nweeded out of the market.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2013 12:28:40 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Gaur", "Vibha", ""], ["Sharma", "Neeraj Kumar", ""], ["Bedi", "Punam", ""]]}]