[{"id": "0705.0374", "submitter": "Razvan Radulescu M.D.", "authors": "Razvan T. Radulescu, Angelika Jahn, Daniela Hellmann and Gregor\n  Weirich", "title": "Immunohistochemical pitfalls in the demonstration of insulin-degrading\n  enzyme in normal and neoplastic human tissues", "comments": "17 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": null, "abstract": "  Previously, we have identified the cytoplasmic zinc metalloprotease\ninsulin-degrading enzyme(IDE) in human tissues by an immunohistochemical method\ninvolving no antigen retrieval (AR) by pressure cooking to avoid artifacts by\nendogenous biotin exposure and a detection kit based on the labeled\nstreptavidin biotin (LSAB) method. Thereby, we also employed 3% hydrogen\nperoxide(H2O2) for the inhibition of endogenous peroxidase activity and\nincubated the tissue sections with the biotinylated secondary antibody at room\ntemperature (RT). We now add the immunohistochemical details that had led us to\nthis optimized procedure as they also bear a more general relevance when\ndemonstrating intracellular tissue antigens. Our most important result is that\nendogenous peroxidase inhibition by 0.3% H2O2 coincided with an apparently\npositive IDE staining in an investigated breast cancer specimen whereas\ncombining a block by 3% H2O2 with an incubation of the biotinylated secondary\nantibody at RT, yet not at 37 degrees Celsius, revealed this specimen as almost\nentirely IDE-negative. Our present data caution against three different\nimmunohistochemical pitfalls that might cause falsely positive results and\nartifacts when using an LSAB- and peroxidase-based detection method: pressure\ncooking for AR, insufficient quenching of endogenous peroxidases and heating of\ntissue sections while incubating with biotinylated secondary antibodies.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2007 20:56:59 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Radulescu", "Razvan T.", ""], ["Jahn", "Angelika", ""], ["Hellmann", "Daniela", ""], ["Weirich", "Gregor", ""]]}, {"id": "0705.0666", "submitter": "Tom Michoel", "authors": "Tom Michoel, Steven Maere, Eric Bonnet, Anagha Joshi, Yvan Saeys, Tim\n  Van den Bulcke, Koenraad Van Leemput, Piet van Remortel, Martin Kuiper,\n  Kathleen Marchal, Yves Van de Peer", "title": "Validating module network learning algorithms using simulated data", "comments": "13 pages, 6 figures + 2 pages, 2 figures supplementary information", "journal-ref": "BMC Bioinformatics 2007, 8(Suppl 2):S5", "doi": "10.1186/1471-2105-8-S2-S5", "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": null, "abstract": "  In recent years, several authors have used probabilistic graphical models to\nlearn expression modules and their regulatory programs from gene expression\ndata. Here, we demonstrate the use of the synthetic data generator SynTReN for\nthe purpose of testing and comparing module network learning algorithms. We\nintroduce a software package for learning module networks, called LeMoNe, which\nincorporates a novel strategy for learning regulatory programs. Novelties\ninclude the use of a bottom-up Bayesian hierarchical clustering to construct\nthe regulatory programs, and the use of a conditional entropy measure to assign\nregulators to the regulation program nodes. Using SynTReN data, we test the\nperformance of LeMoNe in a completely controlled situation and assess the\neffect of the methodological changes we made with respect to an existing\nsoftware package, namely Genomica. Additionally, we assess the effect of\nvarious parameters, such as the size of the data set and the amount of noise,\non the inference performance. Overall, application of Genomica and LeMoNe to\nsimulated data sets gave comparable results. However, LeMoNe offers some\nadvantages, one of them being that the learning process is considerably faster\nfor larger data sets. Additionally, we show that the location of the regulators\nin the LeMoNe regulation programs and their conditional entropy may be used to\nprioritize regulators for functional validation, and that the combination of\nthe bottom-up clustering strategy with the conditional entropy-based assignment\nof regulators improves the handling of missing or hidden regulators.\n", "versions": [{"version": "v1", "created": "Fri, 4 May 2007 16:18:59 GMT"}], "update_date": "2007-11-15", "authors_parsed": [["Michoel", "Tom", ""], ["Maere", "Steven", ""], ["Bonnet", "Eric", ""], ["Joshi", "Anagha", ""], ["Saeys", "Yvan", ""], ["Bulcke", "Tim Van den", ""], ["Van Leemput", "Koenraad", ""], ["van Remortel", "Piet", ""], ["Kuiper", "Martin", ""], ["Marchal", "Kathleen", ""], ["Van de Peer", "Yves", ""]]}, {"id": "0705.1019", "submitter": "Shenbing Kuang", "authors": "Shenbing Kuang, Jiafu Wang, Ting Zeng, Aiyin Cao", "title": "Theoretical Analysis of Subthreshold Oscillatory Behaviors in Nonlinear\n  Autonomous Systems", "comments": "4 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  We have developed a linearization method to investigate the subthreshold\noscillatory behaviors in nonlinear autonomous systems. By considering firstly\nthe neuronal system as an example, we show that this theoretical approach can\npredict quantitatively the subthreshold oscillatory activities, including the\ndamping coefficients and the oscillatory frequencies which are in good\nagreement with those observed in experiments. Then we generalize the\nlinearization method to an arbitrary autonomous nonlinear system. The detailed\nextension of this theoretical approach is also presented and further discussed.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2007 00:48:55 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Kuang", "Shenbing", ""], ["Wang", "Jiafu", ""], ["Zeng", "Ting", ""], ["Cao", "Aiyin", ""]]}, {"id": "0705.1030", "submitter": "Stephen Quake", "authors": "H. Christina Fan and Stephen R. Quake", "title": "Detection of Aneuploidy with Digital PCR", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  The widespread use of genetic testing in high risk pregnancies has created\nstrong interest in rapid and accurate molecular diagnostics for common\nchromosomal aneuploidies. We show here that digital polymerase chain reaction\n(dPCR) can be used for accurate measurement of trisomy 21 (Down's Syndrome),\nthe most common human aneuploidy. dPCR is generally applicable to any\naneuploidy, does not depend on allelic distribution or gender, and is able to\ndetect signals in the presence of mosaics or contaminating maternal DNA.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2007 05:08:53 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Fan", "H. Christina", ""], ["Quake", "Stephen R.", ""]]}, {"id": "0705.1389", "submitter": "Yurie Okabe", "authors": "Yurie Okabe, Yuu Yagi, and Masaki Sasai", "title": "Effects of the DNA state fluctuation on single-cell dynamics of\n  self-regulating gene", "comments": "18 pages, 5 figures", "journal-ref": null, "doi": "10.1063/1.2768353", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": null, "abstract": "  A dynamical mean-field theory is developed to analyze stochastic single-cell\ndynamics of gene expression. By explicitly taking account of nonequilibrium and\nnonadiabatic features of the DNA state fluctuation, two-time correlation\nfunctions and response functions of single-cell dynamics are derived. The\nmethod is applied to a self-regulating gene to predict a rich variety of\ndynamical phenomena such as anomalous increase of relaxation time and\noscillatory decay of correlations. Effective \"temperature\" defined as the ratio\nof the correlation to the response in the protein number is small when the DNA\nstate change is frequent, while it grows large when the DNA state change is\ninfrequent, indicating the strong enhancement of noise in the latter case.\n", "versions": [{"version": "v1", "created": "Thu, 10 May 2007 05:50:16 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Okabe", "Yurie", ""], ["Yagi", "Yuu", ""], ["Sasai", "Masaki", ""]]}, {"id": "0705.1490", "submitter": "Emidio Capriotti", "authors": "Emidio Capriotti, Piero Fariselli, Ivan Rossi and Rita Casadio", "title": "A three-state prediction of single point mutations on protein stability\n  changes", "comments": "Text: 9 pages, Figures: 9 pages, Tables: 1 page, Supplemetary\n  Material: 1 page", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.QM", "license": null, "abstract": "  A basic question of protein structural studies is to which extent mutations\naffect the stability. This question may be addressed starting from sequence\nand/or from structure. In proteomics and genomics studies prediction of protein\nstability free energy change (DDG) upon single point mutation may also help the\nannotation process. The experimental SSG values are affected by uncertainty as\nmeasured by standard deviations. Most of the DDG values are nearly zero (about\n32% of the DDG data set ranges from -0.5 to 0.5 Kcal/mol) and both the value\nand sign of DDG may be either positive or negative for the same mutation\nblurring the relationship among mutations and expected DDG value. In order to\novercome this problem we describe a new predictor that discriminates between 3\nmutation classes: destabilizing mutations (DDG<-0.5 Kcal/mol), stabilizing\nmutations (DDG>0.5 Kcal/mol) and neutral mutations (-0.5<=DDG<=0.5 Kcal/mol).\nIn this paper a support vector machine starting from the protein sequence or\nstructure discriminates between stabilizing, destabilizing and neutral\nmutations. We rank all the possible substitutions according to a three state\nclassification system and show that the overall accuracy of our predictor is as\nhigh as 52% when performed starting from sequence information and 58% when the\nprotein structure is available, with a mean value correlation coefficient of\n0.30 and 0.39, respectively. These values are about 20 points per cent higher\nthan those of a random predictor.\n", "versions": [{"version": "v1", "created": "Thu, 10 May 2007 14:37:34 GMT"}, {"version": "v2", "created": "Wed, 23 May 2007 08:49:48 GMT"}], "update_date": "2007-06-13", "authors_parsed": [["Capriotti", "Emidio", ""], ["Fariselli", "Piero", ""], ["Rossi", "Ivan", ""], ["Casadio", "Rita", ""]]}, {"id": "0705.1535", "submitter": "Nicolas Ferey", "authors": "Nicolas F\\'erey (LIMSI), Pierre-Emmanuel Gros (LIMSI), Joan H\\'erisson\n  (LIMSI), Rachid Gherbi (LIMSI)", "title": "Visual Data Mining of Genomic Databases by Immersive Graph-Based\n  Exploration", "comments": null, "journal-ref": "Visual Data Mining of Genomic Databases by Immersive Graph-Based\n  Exploration (2005) 4", "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  Biologists are leading current research on genome characterization\n(sequencing, alignment, transcription), providing a huge quantity of raw data\nabout many genome organisms. Extracting knowledge from this raw data is an\nimportant process for biologists, using usually data mining approaches.\nHowever, it is difficult to deals with these genomic information using actual\nbioinformatics data mining tools, because data are heterogeneous, huge in\nquantity and geographically distributed. In this paper, we present a new\napproach between data mining and virtual reality visualization, called visual\ndata mining. Indeed Virtual Reality becomes ripe, with efficient display\ndevices and intuitive interaction in an immersive context. Moreover, biologists\nuse to work with 3D representation of their molecules, but in a desktop\ncontext. We present a software solution, Genome3DExplorer, which addresses the\nproblem of genomic data visualization, of scene management and interaction.\nThis solution is based on a well-adapted graphical and interaction paradigm,\nwhere local and global topological characteristics of data are easily visible,\non the contrary to traditional genomic database browsers, always focused on the\nzoom and details level.\n", "versions": [{"version": "v1", "created": "Thu, 10 May 2007 19:09:08 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Férey", "Nicolas", "", "LIMSI"], ["Gros", "Pierre-Emmanuel", "", "LIMSI"], ["Hérisson", "Joan", "", "LIMSI"], ["Gherbi", "Rachid", "", "LIMSI"]]}, {"id": "0705.2057", "submitter": "Nikolai Sinitsyn", "authors": "N. A. Sinitsyn and I. Nemenman", "title": "The unified geometric theory of mesoscopic stochastic pumps and\n  reversible ratchets", "comments": "5 pages", "journal-ref": "Phys. Rev. Lett. 99, 220408 (2007)", "doi": "10.1103/PhysRevLett.99.220408", "report-no": "LAUR- 07-0243", "categories": "cond-mat.stat-mech q-bio.QM", "license": null, "abstract": "  We construct a unifying theory of geometric effects in mesoscopic stochastic\nkinetics. We demonstrate that the adiabatic pump and the reversible ratchet\neffects, as well as similar new phenomena in other domains, such as in\nepidemiology, all follow from geometric phase contributions to the effective\naction in the stochastic path integral representation of the moment generating\nfunction. The theory provides the universal technique for identification,\nprediction and calculation of pump-like phenomena in an arbitrary mesoscopic\nstochastic framework.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2007 00:01:17 GMT"}, {"version": "v2", "created": "Thu, 6 Dec 2007 23:33:01 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Sinitsyn", "N. A.", ""], ["Nemenman", "I.", ""]]}, {"id": "0705.2092", "submitter": "Erik Volz", "authors": "Erik Volz", "title": "SIR dynamics in random networks with heterogeneous connectivity", "comments": "25 pages, 6 figures. Greatly revised version of arXiv:physics/0508160", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": null, "abstract": "  Random networks with specified degree distributions have been proposed as\nrealistic models of population structure, yet the problem of dynamically\nmodeling SIR-type epidemics in random networks remains complex. I resolve this\ndilemma by showing how the SIR dynamics can be modeled with a system of three\nnonlinear ODE's. The method makes use of the probability generating function\n(PGF) formalism for representing the degree distribution of a random network\nand makes use of network-centric quantities such as the number of edges in a\nwell-defined category rather than node-centric quantities such as the number of\ninfecteds or susceptibles. The PGF provides a simple means of translating\nbetween network and node-centric variables and determining the epidemic\nincidence at any time. The theory also provides a simple means of tracking the\nevolution of the degree distribution among susceptibles or infecteds. The\nequations are used to demonstrate the dramatic effects that the degree\ndistribution plays on the final size of an epidemic as well as the speed with\nwhich it spreads through the population. Power law degree distributions are\nobserved to generate an almost immediate expansion phase yet have a smaller\nfinal size compared to homogeneous degree distributions such as the Poisson.\nThe equations are compared to stochastic simulations, which show good agreement\nwith the theory. Finally, the dynamic equations provide an alternative way of\ndetermining the epidemic threshold where large-scale epidemics are expected to\noccur, and below which epidemic behavior is limited to finite-sized outbreaks.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2007 08:16:56 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Volz", "Erik", ""]]}, {"id": "0705.2105", "submitter": "Erik Volz", "authors": "Erik Volz and Lauren Ancel Meyers", "title": "SIR epidemics in dynamic contact networks", "comments": "20 pages, 4 figures. Submitted to Proc. Roy. Soc. B", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": null, "abstract": "  Contact patterns in populations fundamentally influence the spread of\ninfectious diseases. Current mathematical methods for epidemiological\nforecasting on networks largely assume that contacts between individuals are\nfixed, at least for the duration of an outbreak. In reality, contact patterns\nmay be quite fluid, with individuals frequently making and breaking social or\nsexual relationships. Here we develop a mathematical approach to predicting\ndisease transmission on dynamic networks in which each individual has a\ncharacteristic behavior (typical contact number), but the identities of their\ncontacts change in time. We show that dynamic contact patterns shape\nepidemiological dynamics in ways that cannot be adequately captured in static\nnetwork models or mass-action models. Our new model interpolates smoothly\nbetween static network models and mass-action models using a mixing parameter,\nthereby providing a bridge between disparate classes of epidemiological models.\nUsing epidemiological and sexual contact data from an Atlanta high school, we\nthen demonstrate the utility of this method for forecasting and controlling\nsexually transmitted disease outbreaks.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2007 09:40:40 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Volz", "Erik", ""], ["Meyers", "Lauren Ancel", ""]]}, {"id": "0705.2143", "submitter": "Fabrizio Lillo", "authors": "Fabrizio Lillo and Marco Span\\'o", "title": "Inverted and mirror repeats in model nucleotide sequences", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.76.041914", "report-no": null, "categories": "q-bio.GN q-bio.QM", "license": null, "abstract": "  We analytically and numerically study the probabilistic properties of\ninverted and mirror repeats in model sequences of nucleic acids. We consider\nboth perfect and non-perfect repeats, i.e. repeats with mismatches and gaps.\nThe considered sequence models are independent identically distributed (i.i.d.)\nsequences, Markov processes and long range sequences. We show that the number\nof repeats in correlated sequences is significantly larger than in i.i.d.\nsequences and that this discrepancy increases exponentially with the repeat\nlength for long range sequences.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2007 13:37:17 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Lillo", "Fabrizio", ""], ["Spanó", "Marco", ""]]}, {"id": "0705.2485", "submitter": "Bodie Crossingham", "authors": "Bodie Crossingham and Tshilidzi Marwala", "title": "Using Genetic Algorithms to Optimise Rough Set Partition Sizes for HIV\n  Data Analysis", "comments": "10 pages, 1 figure, Update Bibliography", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.AI q-bio.QM", "license": null, "abstract": "  In this paper, we present a method to optimise rough set partition sizes, to\nwhich rule extraction is performed on HIV data. The genetic algorithm\noptimisation technique is used to determine the partition sizes of a rough set\nin order to maximise the rough sets prediction accuracy. The proposed method is\ntested on a set of demographic properties of individuals obtained from the\nSouth African antenatal survey. Six demographic variables were used in the\nanalysis, these variables are; race, age of mother, education, gravidity,\nparity, and age of father, with the outcome or decision being either HIV\npositive or negative. Rough set theory is chosen based on the fact that it is\neasy to interpret the extracted rules. The prediction accuracy of equal width\nbin partitioning is 57.7% while the accuracy achieved after optimising the\npartitions is 72.8%. Several other methods have been used to analyse the HIV\ndata and their results are stated and compared to that of rough set theory\n(RST).\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2007 07:02:23 GMT"}], "update_date": "2007-06-25", "authors_parsed": [["Crossingham", "Bodie", ""], ["Marwala", "Tshilidzi", ""]]}, {"id": "0705.2594", "submitter": "Tibor Antal", "authors": "Tibor Antal, P. L. Krapivsky, and Kirone Mallick", "title": "Molecular Spiders in One Dimension", "comments": "14 pages, 2 figures", "journal-ref": "Journal of Statistical Mechanics P08027 (2007)", "doi": "10.1088/1742-5468/2007/08/P08027", "report-no": null, "categories": "cond-mat.stat-mech math.PR q-bio.QM", "license": null, "abstract": "  Molecular spiders are synthetic bio-molecular systems which have \"legs\" made\nof short single-stranded segments of DNA. Spiders move on a surface covered\nwith single-stranded DNA segments complementary to legs. Different mappings are\nestablished between various models of spiders and simple exclusion processes.\nFor spiders with simple gait and varying number of legs we compute the\ndiffusion coefficient; when the hopping is biased we also compute their\nvelocity.\n", "versions": [{"version": "v1", "created": "Fri, 18 May 2007 19:52:35 GMT"}], "update_date": "2007-08-25", "authors_parsed": [["Antal", "Tibor", ""], ["Krapivsky", "P. L.", ""], ["Mallick", "Kirone", ""]]}, {"id": "0705.2596", "submitter": "Tibor Antal", "authors": "Tibor Antal and P. L. Krapivsky", "title": "Molecular Spiders with Memory", "comments": "10 pages, 3 figures", "journal-ref": "Physical Review E 76, 021121 (2007)", "doi": "10.1103/PhysRevE.76.021121", "report-no": null, "categories": "cond-mat.stat-mech math.PR q-bio.QM", "license": null, "abstract": "  Synthetic bio-molecular spiders with \"legs\" made of single-stranded segments\nof DNA can move on a surface which is also covered by single-stranded segments\nof DNA complementary to the leg DNA. In experimental realizations, when a leg\ndetaches from a segment of the surface for the first time it alters that\nsegment, and legs subsequently bound to these altered segments more weakly.\nInspired by these experiments we investigate spiders moving along a\none-dimensional substrate, whose legs leave newly visited sites at a slower\nrate than revisited sites. For a random walk (one-leg spider) the slowdown does\nnot effect the long time behavior. For a bipedal spider, however, the slowdown\ngenerates an effective bias towards unvisited sites, and the spider behaves\nsimilarly to the excited walk. Surprisingly, the slowing down of the spider at\nnew sites increases the diffusion coefficient and accelerates the growth of the\nnumber of visited sites.\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2007 20:12:44 GMT"}], "update_date": "2007-08-25", "authors_parsed": [["Antal", "Tibor", ""], ["Krapivsky", "P. L.", ""]]}, {"id": "0705.2646", "submitter": "Martin Weigt", "authors": "Michele Leone, Sumedha, Martin Weigt", "title": "Clustering by soft-constraint affinity propagation: Applications to\n  gene-expression data", "comments": "11 pages, supplementary material:\n  http://isiosf.isi.it/~weigt/scap_supplement.pdf", "journal-ref": "Bioinformatics 23, 2708 (2007)", "doi": "10.1093/bioinformatics/btm414", "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech physics.data-an", "license": null, "abstract": "  Motivation: Similarity-measure based clustering is a crucial problem\nappearing throughout scientific data analysis. Recently, a powerful new\nalgorithm called Affinity Propagation (AP) based on message-passing techniques\nwas proposed by Frey and Dueck \\cite{Frey07}. In AP, each cluster is identified\nby a common exemplar all other data points of the same cluster refer to, and\nexemplars have to refer to themselves. Albeit its proved power, AP in its\npresent form suffers from a number of drawbacks. The hard constraint of having\nexactly one exemplar per cluster restricts AP to classes of regularly shaped\nclusters, and leads to suboptimal performance, {\\it e.g.}, in analyzing gene\nexpression data. Results: This limitation can be overcome by relaxing the AP\nhard constraints. A new parameter controls the importance of the constraints\ncompared to the aim of maximizing the overall similarity, and allows to\ninterpolate between the simple case where each data point selects its closest\nneighbor as an exemplar and the original AP. The resulting soft-constraint\naffinity propagation (SCAP) becomes more informative, accurate and leads to\nmore stable clustering. Even though a new {\\it a priori} free-parameter is\nintroduced, the overall dependence of the algorithm on external tuning is\nreduced, as robustness is increased and an optimal strategy for parameter\nselection emerges more naturally. SCAP is tested on biological benchmark data,\nincluding in particular microarray data related to various cancer types. We\nshow that the algorithm efficiently unveils the hierarchical cluster structure\npresent in the data sets. Further on, it allows to extract sparse gene\nexpression signatures for each cluster.\n", "versions": [{"version": "v1", "created": "Fri, 18 May 2007 08:22:05 GMT"}, {"version": "v2", "created": "Thu, 29 Nov 2007 16:40:18 GMT"}], "update_date": "2007-11-29", "authors_parsed": [["Leone", "Michele", ""], ["Sumedha", "", ""], ["Weigt", "Martin", ""]]}, {"id": "0705.2711", "submitter": "F\\`elix Campelo", "authors": "F. Campelo and A. Hernandez-Machado", "title": "Shape instabilities in vesicles: a phase-field model", "comments": null, "journal-ref": "Eur. Phys. J. Special Topics, 143: 101-108 (2007)", "doi": "10.1140/epjst/e2007-00077-y", "report-no": null, "categories": "cond-mat.soft q-bio.QM", "license": null, "abstract": "  A phase field model for dealing with shape instabilities in fluid membrane\nvesicles is presented. This model takes into account the Canham-Helfrich\nbending energy with spontaneous curvature. A dynamic equation for the\nphase-field is also derived. With this model it is possible to see the vesicle\nshape deformation dynamically, when some external agent instabilizes the\nmembrane, for instance, inducing an inhomogeneous spontaneous curvature. The\nnumerical scheme used is detailed and some stationary shapes are shown together\nwith a shape diagram for vesicles of spherical topology and no spontaneous\ncurvature, in agreement with known results.\n", "versions": [{"version": "v1", "created": "Fri, 18 May 2007 14:29:42 GMT"}], "update_date": "2007-07-26", "authors_parsed": [["Campelo", "F.", ""], ["Hernandez-Machado", "A.", ""]]}, {"id": "0705.3188", "submitter": "Eduardo D. Sontag", "authors": "Murat Arcak and Eduardo D. Sontag", "title": "A passivity-based stability criterion for a class of interconnected\n  systems and applications to biochemical reaction networks", "comments": "See http://www.math.rutgers.edu/~sontag/PUBDIR/index.html for related\n  (p)reprints", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  This paper presents a stability test for a class of interconnected nonlinear\nsystems motivated by biochemical reaction networks. One of the main results\ndetermines global asymptotic stability of the network from the diagonal\nstability of a \"dissipativity matrix\" which incorporates information about the\npassivity properties of the subsystems, the interconnection structure of the\nnetwork, and the signs of the interconnection terms. This stability test\nencompasses the \"secant criterion\" for cyclic networks presented in our\nprevious paper, and extends it to a general interconnection structure\nrepresented by a graph. A second main result allows one to accommodate state\nproducts. This extension makes the new stability criterion applicable to a\nbroader class of models, even in the case of cyclic systems. The new stability\ntest is illustrated on a mitogen activated protein kinase (MAPK) cascade model,\nand on a branched interconnection structure motivated by metabolic networks.\nFinally, another result addresses the robustness of stability in the presence\nof diffusion terms in a compartmental system made out of identical systems.\n", "versions": [{"version": "v1", "created": "Tue, 22 May 2007 15:14:37 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Arcak", "Murat", ""], ["Sontag", "Eduardo D.", ""]]}, {"id": "0705.3373", "submitter": "Anirban Banerjee", "authors": "Anirban Banerjee and J\\\"urgen Jost", "title": "Laplacian Spectrum and Protein-Protein Interaction Networks", "comments": "7 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.data-an q-bio.PE", "license": null, "abstract": "  From the spectral plot of the (normalized) graph Laplacian, the essential\nqualitative properties of a network can be simultaneously deduced. Given a\nclass of empirical networks, reconstruction schemes for elucidating the\nevolutionary dynamics leading to those particular data can then be developed.\nThis method is exemplified for protein-protein interaction networks. Traces of\ntheir evolutionary history of duplication and divergence processes are\nidentified. In particular, we can identify typical specific features that\nrobustly distinguish protein-protein interaction networks from other classes of\nnetworks, in spite of possible statistical fluctuations of the underlying data.\n", "versions": [{"version": "v1", "created": "Wed, 23 May 2007 13:34:45 GMT"}], "update_date": "2007-05-24", "authors_parsed": [["Banerjee", "Anirban", ""], ["Jost", "Jürgen", ""]]}, {"id": "0705.3473", "submitter": "Alex Barnett", "authors": "A. H. Barnett and P. R. Moorcroft", "title": "Analytic steady-state space use patterns and rapid computations in\n  mechanistic home range analysis", "comments": "14 pages, 7 figures, submit to J. Math. Biol", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  Mechanistic home range models are important tools in modeling animal dynamics\nin spatially-complex environments. We introduce a class of stochastic models\nfor animal movement in a habitat of varying preference. Such models interpolate\nbetween spatially-implicit resource selection analysis (RSA) and\nadvection-diffusion models, possessing these two models as limiting cases. We\nfind a closed-form solution for the steady-state (equilibrium) probability\ndistribution u* using a factorization of the redistribution operator into\nsymmetric and diagonal parts. How space use is controlled by the preference\nfunction w then depends on the characteristic width of the redistribution\nkernel: when w changes rapidly compared to this width, u* ~ w, whereas on\nglobal scales large compared to this width, u* ~ w^2. We analyse the behavior\nat discontinuities in w which occur at habitat type boundaries. We simulate the\ndynamics of space use given two-dimensional prey-availability data and explore\nthe effect of the redistribution kernel width. Our factorization allows such\nnumerical simulations to be done extremely fast; we expect this to aid the\ncomputationally-intensive task of model parameter fitting and inverse modeling.\n", "versions": [{"version": "v1", "created": "Wed, 23 May 2007 21:53:04 GMT"}], "update_date": "2007-05-25", "authors_parsed": [["Barnett", "A. H.", ""], ["Moorcroft", "P. R.", ""]]}, {"id": "0705.4429", "submitter": "Stefano Marino", "authors": "Stefano Marino", "title": "A successive sub-grouping method for multiple sequence alignments\n  analysis", "comments": "11 pages, 7 figures, the M_Al program is downloadable at\n  http://xoomer.alice.it/marinostefano/", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  A novel approach to protein multiple sequence alignment is discussed:\nsubstantially this method counterparts with substitution matrix based methods\n(like Blosum or PAM based methods), and implies a more deterministic approach\nto chemical/physical sub-grouping of amino acids . Amino acids (aa) are divided\ninto sub-groups with successive derivations, that result in a clustering based\non the considered property. The properties can be user defined or chosen\nbetween default schemes, like those used in the analysis described here.\nStarting from an initial set of the 20 naturally occurring amino acids, they\nare successively divided on the basis of their polarity/hydrophobic index, with\nincreasing resolution up to four level of subdivision. Other schemes of\nsubdivision are possible: in this thesis work it was employed also a scheme\nbased on physical/structural properties (solvent exposure, lateral chain\nmobility and secondary structure tendency), that have been compared to the\nchemical scheme with testing purposes. In the method described in this chapter,\nthe total score for each position in the alignment accounts for different\ndegree of similarity between amino acids. The scoring value result form the\ncontribution of each level of selectivity for every individual property\nconsidered. Simply the method (called M_Al) analyse the n sequence alignment\nposition per position and assigns a score which have contributes by aa identity\nplus a composed valuation of the chemical or of the structural affinity between\nthe n aligned amino acids. This method has been implemented in a series of\nprograms written in python language; these programs have been tested in some\nbiological cases, with benchmark purposes.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2007 16:55:59 GMT"}, {"version": "v2", "created": "Wed, 30 May 2007 21:51:07 GMT"}, {"version": "v3", "created": "Thu, 7 Jun 2007 17:34:11 GMT"}], "update_date": "2007-06-07", "authors_parsed": [["Marino", "Stefano", ""]]}, {"id": "0705.4634", "submitter": "Carlo Piermarocchi", "authors": "Diego Calzolari, Giovanni Paternostro, Patrick L. Harrington Jr.,\n  Carlo Piermarocchi, and Phillip M. Duxbury", "title": "Selective control of the apoptosis signaling network in heterogeneous\n  cell populations", "comments": "14 pages, 16 figures. Accepted for publication in PLoS ONE", "journal-ref": "PLoS ONE 2(6): e547 (2007)", "doi": "10.1371/journal.pone.0000547", "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech", "license": null, "abstract": "  Selective control in a population is the ability to control a member of the\npopulation while leaving the other members relatively unaffected. The concept\nof selective control is developed using cell death or apoptosis in\nheterogeneous cell populations as an example. Apoptosis signaling in\nheterogeneous cells is described by an ensemble of gene networks with identical\ntopology but different link strengths. Selective control depends on the\nstatistics of signaling in the ensemble of networks and we analyse the effects\nof superposition, non-linearity and feedback on these statistics. Parallel\npathways promote normal statistics while series pathways promote skew\ndistributions which in the most extreme cases become log-normal. We also show\nthat feedback and non-linearity can produce bimodal signaling statistics, as\ncan discreteness and non-linearity. Two methods for optimizing selective\ncontrol are presented. The first is an exhaustive search method and the second\nis a linear programming based approach. Though control of a single gene in the\nsignaling network yields little selectivity, control of a few genes typically\nyields higher levels of selectivity. The statistics of gene combinations\nsusceptible to selective control is studied and is used to identify general\ncontrol strategies. We found that selectivity is promoted by acting on the\nleast sensitive nodes in the case of weak populations, while selective control\nof robust populations is optimized through perturbations of more sensitive\nnodes. High throughput experiments with heterogeneous cell lines could be\ndesigned in an analogous manner, with the further possibility of incorporating\nthe selectivity optimization process into a closed-loop control system.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2007 15:51:56 GMT"}], "update_date": "2014-07-29", "authors_parsed": [["Calzolari", "Diego", ""], ["Paternostro", "Giovanni", ""], ["Harrington", "Patrick L.", "Jr."], ["Piermarocchi", "Carlo", ""], ["Duxbury", "Phillip M.", ""]]}]