[{"id": "0706.0001", "submitter": "Z. C. Tu", "authors": "Z. C. Tu and Z. C. Ou-Yang", "title": "Elastic theory of low-dimensional continua and its applications in bio-\n  and nano-structures", "comments": "Review article for J. Comput. Theor. Nanosci., 27 pages, 15 figures", "journal-ref": "J. Comput. Theor. Nanosci. 5, 422-448 (2008)", "doi": null, "report-no": null, "categories": "cond-mat.soft cond-mat.mtrl-sci math-ph math.MP physics.bio-ph q-bio.QM", "license": null, "abstract": "  This review presents the elastic theory of low-dimensional (one- and\ntwo-dimensional) continua and its applications in bio- and nano-structures.\nFirst, the curve and surface theory, as the geometric representation of the\nlow-dimensional continua, is briefly described through Cartan moving frame\nmethod. The elastic theory of Kirchhoff rod, Helfrich rod, bending-soften rod,\nfluid membrane, and solid shell is revisited. Secondly, the application and\navailability of the elastic theory of low-dimensional continua in\nbio-structures, including short DNA rings, lipid membranes, and cell membranes,\nare discussed. The kink stability of short DNA rings is addressed by using the\ntheory of Kirchhoff rod, Helfrich rod, and bending-soften rod. The lipid\nmembranes obey the theory of fluid membrane. A cell membrane is simplified as a\ncomposite shell of lipid bilayer and membrane skeleton, which is a little\nsimilar to the solid shell. It is found that the membrane skeleton enhances\nhighly the mechanical stability of cell membranes. Thirdly, the application and\navailability of the elastic theory of low-dimensional continua in\nnano-structures, including graphene and carbon nanotubes, are discussed. A\nrevised Lenosky lattice model is proposed based on the local density\napproximation. Its continuum form up to the second order terms of curvatures\nand strains is the same as the free energy of 2D solid shells. Several typical\nmechanical properties of carbon nanotubes are revisited and investigated based\non this continuum form. It is possible to avoid introducing the controversial\nconcepts, the Young's modulus and thickness of graphene and single-walled\ncarbon nanotubes, with this continuum form.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2007 12:10:57 GMT"}, {"version": "v2", "created": "Sun, 1 Jun 2008 15:46:15 GMT"}], "update_date": "2015-01-20", "authors_parsed": [["Tu", "Z. C.", ""], ["Ou-Yang", "Z. C.", ""]]}, {"id": "0706.0113", "submitter": "Anirban Banerjee", "authors": "Anirban Banerjee and J\\\"urgen Jost", "title": "Graph spectra as a systematic tool in computational biology", "comments": "12 pages, 3 figures, Discrete Applied Mathematics, to appear", "journal-ref": "Discrete Applied Mathematics, 157(10), 2425-2431,(2009)", "doi": null, "report-no": null, "categories": "nlin.AO q-bio.QM", "license": null, "abstract": "  We present the spectrum of the (normalized) graph Laplacian as a systematic\ntool for the investigation of networks, and we describe basic properties of\neigenvalues and eigenfunctions. Processes of graph formation like motif joining\nor duplication leave characteristic traces in the spectrum. This can suggest\nhypotheses about the evolution of a graph representing biological data. To this\ndata, we analyze several biological networks in terms of rough qualitative data\nof their spectra.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2007 09:38:52 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Banerjee", "Anirban", ""], ["Jost", "Jürgen", ""]]}, {"id": "0706.0118", "submitter": "Diana Fusco", "authors": "D. Fusco, B. Bassetti, P. Jona, M. Cosentino Lagomarsino", "title": "DIA-MCIS. An Importance Sampling Network Randomizer for Network Motif\n  Discovery and Other Topological Observables in Transcription Networks", "comments": "6 pages and 1 figure, included supplementary mathematical notes", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  Transcription networks, and other directed networks can be characterized by\nsome topological observables such as for example subgraph occurrence (network\nmotifs). In order to perform such kind of analysis, it is necessary to be able\nto generate suitable randomized network ensembles. Typically, one considers\nnull networks with the same degree sequences of the original ones. The commonly\nused algorithms sometimes have long convergence times, and sampling problems.\nWe present here an alternative, based on a variant of the importance sampling\nMontecarlo developed by Chen et al. [1].\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2007 10:25:53 GMT"}], "update_date": "2007-06-04", "authors_parsed": [["Fusco", "D.", ""], ["Bassetti", "B.", ""], ["Jona", "P.", ""], ["Lagomarsino", "M. Cosentino", ""]]}, {"id": "0706.0294", "submitter": "Edoardo Airoldi", "authors": "Edoardo M Airoldi, David M Blei, Stephen E Fienberg, Eric P Xing", "title": "Mixed membership analysis of high-throughput interaction studies:\n  Relational data", "comments": "22 pages, 6 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": null, "abstract": "  In this paper, we consider the statistical analysis of a protein interaction\nnetwork. We propose a Bayesian model that uses a hierarchy of probabilistic\nassumptions about the way proteins interact with one another in order to: (i)\nidentify the number of non-observable functional modules; (ii) estimate the\ndegree of membership of proteins to modules; and (iii) estimate typical\ninteraction patterns among the functional modules themselves. Our model\ndescribes large amount of (relational) data using a relatively small set of\nparameters that we can reliably estimate with an efficient inference algorithm.\nWe apply our methodology to data on protein-to-protein interactions in\nsaccharomyces cerevisiae to reveal proteins' diverse functional roles. The case\nstudy provides the basis for an overview of which scientific questions can be\naddressed using our methods, and for a discussion of technical issues.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jun 2007 03:09:03 GMT"}, {"version": "v2", "created": "Thu, 15 Nov 2007 19:54:01 GMT"}], "update_date": "2007-11-15", "authors_parsed": [["Airoldi", "Edoardo M", ""], ["Blei", "David M", ""], ["Fienberg", "Stephen E", ""], ["Xing", "Eric P", ""]]}, {"id": "0706.0760", "submitter": "Jing Qin", "authors": "Emma Y. Jin, Jing Qin and Christian M. Reidys", "title": "Neutral Networks of Sequence to Shape Maps", "comments": "24 pages,4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM math-ph math.CO math.MP q-bio.BM", "license": null, "abstract": "  In this paper we present a novel framework for sequence to shape maps. These\ncombinatorial maps realize exponentially many shapes, and have preimages which\ncontain extended connected subgraphs of diameter n (neutral networks). We prove\nthat all basic properties of RNA folding maps also hold for combinatorial maps.\nOur construction is as follows: suppose we are given a graph $H$ over the $\\{1\n>...,n\\}$ and an alphabet of nucleotides together with a symmetric relation\n$\\mathcal{R}$, implied by base pairing rules. Then the shape of a sequence of\nlength n is the maximal H subgraph in which all pairs of nucleotides incident\nto H-edges satisfy $\\mathcal{R}$. Our main result is to prove the existence of\nat least $\\sqrt{2}^{n-1}$ shapes with extended neutral networks, i.e. shapes\nthat have a preimage with diameter $n$ and a connected component of size at\nleast $(\\frac{1+\\sqrt{5}}{2})^n+(\\frac{1-\\sqrt{5}}{2})^n$. Furthermore, we show\nthat there exists a certain subset of shapes which carries a natural graph\nstructure. In this graph any two shapes are connected by a path of shapes with\nrespective neutral networks of distance one. We finally discuss our results and\nprovide a comparison with RNA folding maps.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jun 2007 04:21:12 GMT"}, {"version": "v2", "created": "Sat, 4 Aug 2007 07:53:26 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Jin", "Emma Y.", ""], ["Qin", "Jing", ""], ["Reidys", "Christian M.", ""]]}, {"id": "0706.1198", "submitter": "Anirban Banerjee", "authors": "Anirban Banerjee and J\\\"urgen Jost", "title": "Spectral plots and the representation and interpretation of biological\n  data", "comments": "15 pages, 7 figures", "journal-ref": "Theory in Biosciences, 126(1), 15-21, (2007)", "doi": "10.1007/s12064-007-0005-9", "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  It is basic question in biology and other fields to identify the char-\nacteristic properties that on one hand are shared by structures from a\nparticular realm, like gene regulation, protein-protein interaction or neu- ral\nnetworks or foodwebs, and that on the other hand distinguish them from other\nstructures. We introduce and apply a general method, based on the spectrum of\nthe normalized graph Laplacian, that yields repre- sentations, the spectral\nplots, that allow us to find and visualize such properties systematically. We\npresent such visualizations for a wide range of biological networks and compare\nthem with those for networks derived from theoretical schemes. The differences\nthat we find are quite striking and suggest that the search for universal\nproperties of biological networks should be complemented by an understanding of\nmore specific features of biological organization principles at different\nscales.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2007 16:52:48 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Banerjee", "Anirban", ""], ["Jost", "Jürgen", ""]]}, {"id": "0706.1293", "submitter": "Natalia Kudryavtseva", "authors": "N.P. Bondar, I.L. Kovalenko, D.F. Avgustinovich, N.N. Kudryavtseva", "title": "Influence of experimental context on the development of anhedonia in\n  male mice imposed to chronic social stress", "comments": "9 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  Anhedonia is one of the key symptoms of depression in humans. Consumption of\n1% sucrose solution supplemented with 0.2% vanillin was studied in two\nexperimental contexts in male mice living under chronic social stress induced\nby daily experience of defeats in agonistic interactions and leading to\ndevelopment of depression. In the first experiment, vanillin sucrose solution\nwas made available as an option of water during 10 days to mice living in group\nhome cages. Then the mice were subjected to social defeat stress and during\nstress exposure they were provided with both vanillin sucrose solution and\nwater using a free two bottles choice paradigm. In the other experiment,\nvanillin sucrose solution were first offered to mice after 8 days of exposure\nto social defeat stress. Males familiar with vanillin sucrose solution showed\nvanillin sucrose preference while experiencing defeat stress: consumption of\nvanillin sucrose solution was about 70% of total liquid consumption. However,\nthe consumption of vanillin sucrose solution per gram of body weight in mice\nimposed to social stress during 20 days was significantly lower than in control\nmales. In the second experiment, males after 8 days of social defeat stress\nwere found to consume significantly less vanillin sucrose solution as compared\nwith control males. On average during two weeks of measurements, vanillin\nsucrose solution intake was less than 20% of total liquid consumption in males\nwith symptoms of depression and anxiety. Consumption per gram of body weight\nalso appeared to be significantly lower than in control group. Influence of the\nexperimental context on the development of anhedonia, which was measured by the\nreduction in sucrose solution intake by chronically stressed male mice, has\nbeen discussed.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jun 2007 08:12:55 GMT"}, {"version": "v2", "created": "Sat, 16 Jun 2007 08:20:15 GMT"}, {"version": "v3", "created": "Sat, 10 May 2008 08:45:09 GMT"}], "update_date": "2008-05-10", "authors_parsed": [["Bondar", "N. P.", ""], ["Kovalenko", "I. L.", ""], ["Avgustinovich", "D. F.", ""], ["Kudryavtseva", "N. N.", ""]]}, {"id": "0706.2024", "submitter": "Eben Kenah", "authors": "Eben Kenah, Marc Lipsitch, James M. Robins", "title": "Generation interval contraction and epidemic data analysis", "comments": "20 pages, 5 figures; to appear in Mathematical Biosciences", "journal-ref": "Mathematical Biosciences 213(1): 71-79 (May, 2008)", "doi": null, "report-no": null, "categories": "q-bio.QM math.PR stat.AP", "license": null, "abstract": "  The generation interval is the time between the infection time of an infected\nperson and the infection time of his or her infector. Probability density\nfunctions for generation intervals have been an important input for epidemic\nmodels and epidemic data analysis. In this paper, we specify a general\nstochastic SIR epidemic model and prove that the mean generation interval\ndecreases when susceptible persons are at risk of infectious contact from\nmultiple sources. The intuition behind this is that when a susceptible person\nhas multiple potential infectors, there is a ``race'' to infect him or her in\nwhich only the first infectious contact leads to infection. In an epidemic, the\nmean generation interval contracts as the prevalence of infection increases. We\ncall this global competition among potential infectors. When there is rapid\ntransmission within clusters of contacts, generation interval contraction can\nbe caused by a high local prevalence of infection even when the global\nprevalence is low. We call this local competition among potential infectors.\nUsing simulations, we illustrate both types of competition.\n  Finally, we show that hazards of infectious contact can be used instead of\ngeneration intervals to estimate the time course of the effective reproductive\nnumber in an epidemic. This approach leads naturally to partial likelihoods for\nepidemic data that are very similar to those that arise in survival analysis,\nopening a promising avenue of methodological research in infectious disease\nepidemiology.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2007 02:00:03 GMT"}, {"version": "v2", "created": "Fri, 7 Dec 2007 02:02:05 GMT"}, {"version": "v3", "created": "Thu, 21 Feb 2008 00:44:47 GMT"}], "update_date": "2008-07-02", "authors_parsed": [["Kenah", "Eben", ""], ["Lipsitch", "Marc", ""], ["Robins", "James M.", ""]]}, {"id": "0706.2040", "submitter": "Edoardo Airoldi", "authors": "Edoardo M Airoldi", "title": "Getting started in probabilistic graphical models", "comments": "12 pages, 1 figure", "journal-ref": "Airoldi EM (2007) Getting started in probabilistic graphical\n  models. PLoS Comput Biol 3(12): e252", "doi": "10.1371/journal.pcbi.0030252", "report-no": null, "categories": "q-bio.QM cs.LG physics.soc-ph stat.ME stat.ML", "license": null, "abstract": "  Probabilistic graphical models (PGMs) have become a popular tool for\ncomputational analysis of biological data in a variety of domains. But, what\nexactly are they and how do they work? How can we use PGMs to discover patterns\nthat are biologically relevant? And to what extent can PGMs help us formulate\nnew hypotheses that are testable at the bench? This note sketches out some\nanswers and illustrates the main ideas behind the statistical approach to\nbiological pattern discovery.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2007 14:52:06 GMT"}, {"version": "v2", "created": "Sat, 10 Nov 2007 19:25:59 GMT"}], "update_date": "2010-02-22", "authors_parsed": [["Airoldi", "Edoardo M", ""]]}, {"id": "0706.2126", "submitter": "Thierry Cachat", "authors": "Eugene Asarin (LIAFA), Thierry Cachat (LIAFA), Alexander Seliverstov\n  (IITP), Tayssir Touili (LIAFA), Vassily Lyubetsky (IITP)", "title": "Attenuation Regulation as a Term Rewriting System", "comments": "to appear", "journal-ref": "Proceedings of the Second International Conference on Algebraic\n  Biology (06/07/2007) 12", "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  The classical attenuation regulation of gene expression in bacteria is\nconsidered. We propose to represent the secondary RNA structure in the leader\nregion of a gene or an operon by a term, and we give a probabilistic term\nrewriting system modeling the whole process of such a regulation.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2007 13:59:59 GMT"}], "update_date": "2007-06-15", "authors_parsed": [["Asarin", "Eugene", "", "LIAFA"], ["Cachat", "Thierry", "", "LIAFA"], ["Seliverstov", "Alexander", "", "IITP"], ["Touili", "Tayssir", "", "LIAFA"], ["Lyubetsky", "Vassily", "", "IITP"]]}, {"id": "0706.2285", "submitter": "Michele Caselle", "authors": "L. Martignetti and M. Caselle", "title": "Universal power law behaviors in genomic sequences and evolutionary\n  models", "comments": "15 pages, 3 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.76.021902", "report-no": null, "categories": "q-bio.GN cond-mat.other physics.bio-ph q-bio.QM", "license": null, "abstract": "  We study the length distribution of a particular class of DNA sequences known\nas 5'UTR exons. These exons belong to the messanger RNA of protein coding\ngenes, but they are not coding (they are located upstream of the coding portion\nof the mRNA) and are thus less constrained from an evolutionary point of view.\nWe show that both in mouse and in human these exons show a very clean power law\ndecay in their length distribution and suggest a simple evolutionary model\nwhich may explain this finding. We conjecture that this power law behaviour\ncould indeed be a general feature of higher eukaryotes.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2007 12:46:27 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Martignetti", "L.", ""], ["Caselle", "M.", ""]]}, {"id": "0706.2328", "submitter": "Ophir Flomenbom", "authors": "Ophir Flomenbom, Robert J. Silbey", "title": "Unique mechanisms from finite two-state trajectories", "comments": null, "journal-ref": "E. Barkai, F. L. H. Brown, M. Orrit & H. Yang Eds. THEORY AND\n  EVALUATION OF SINGLE-MOLECULE SIGNALS, (October, 2008)", "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.other q-bio.OT", "license": null, "abstract": "  Single molecule data made of on and off events are ubiquitous. Famous\nexamples include enzyme turnover, probed via fluorescence, and opening and\nclosing of ion-channel, probed via the flux of ions. The data reflects the\ndynamics in the underlying multi-substate on-off kinetic scheme (KS) of the\nprocess, but the determination of the underlying KS is difficult, and sometimes\neven impossible, due to the loss of information in the mapping of the\nmutli-dimensional KS onto two dimensions. A way to deal with this problem\nconsiders canonical (unique) forms. (Unique canonical form is constructed from\nan infinitely long trajectory, but many KSs.) Here we introduce canonical forms\nof reduced dimensions that can handle any KS (i.e. also KSs with symmetry and\nirreversible transitions). We give the mapping of KSs into reduced dimensions\nforms, which is based on topology of KSs, and the tools for extracting the\nreduced dimensions form from finite data. The canonical forms of reduced\ndimensions constitute a powerful tool in discriminating between KSs.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2007 16:17:11 GMT"}, {"version": "v2", "created": "Fri, 31 Aug 2007 22:27:44 GMT"}], "update_date": "2010-08-16", "authors_parsed": [["Flomenbom", "Ophir", ""], ["Silbey", "Robert J.", ""]]}, {"id": "0706.2549", "submitter": "Massimo Pica Ciamarra", "authors": "Massimo Pica Ciamarra, Gennaro Miele, Leopoldo Milano, Mario Nicodemi,\n  Giancarlo Raiconi", "title": "A statistical mechanics approach to reverse engineering: sparsity and\n  biological priors on gene regulatory networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": null, "abstract": "  The important task of determining the connectivity of gene networks, and at a\nmore detailed level even the kind of interaction existing between genes, can\nnowadays be tackled by microarraylike technologies. Yet, there is still a large\namount of unknowns with respect to the amount of data provided by a single\nmicroarray experiment, and therefore reliable gene network retrieval procedures\nmust integrate all of the available biological knowledge, even if coming from\ndifferent sources and of different nature. In this paper we present a reverse\nengineering algorithm able to reveal the underlying gene network by using\ntime-series dataset on gene expressions considering the system response to\ndifferent perturbations. The approach is able to determine the sparsity of the\ngene network, and to take into account possible {\\it a priori} biological\nknowledge on it. The validity of the reverse engineering approach is\nhighlighted through the deduction of the topology of several {\\it simulated}\ngene networks, where we also discuss how the performance of the algorithm\nimproves enlarging the amount of data or if any a priori knowledge is\nconsidered. We also apply the algorithm to experimental data on a nine gene\nnetwork in {\\it Escherichia coli\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2007 08:25:04 GMT"}], "update_date": "2007-06-19", "authors_parsed": [["Ciamarra", "Massimo Pica", ""], ["Miele", "Gennaro", ""], ["Milano", "Leopoldo", ""], ["Nicodemi", "Mario", ""], ["Raiconi", "Giancarlo", ""]]}, {"id": "0706.2867", "submitter": "Kaushik Majumdar", "authors": "Kaushik Majumdar", "title": "Outline of a novel architecture for cortical computation", "comments": "21 pages, four figures", "journal-ref": null, "doi": "10.1007/s11571-007-9034-9", "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": null, "abstract": "  In this paper a novel architecture for cortical computation has been\nproposed. This architecture is composed of computing paths consisting of\nneurons and synapses only. These paths have been decomposed into lateral,\nlongitudinal and vertical components. Cortical computation has then been\ndecomposed into lateral computation (LaC), longitudinal computation (LoC) and\nvertical computation (VeC). It has been shown that various loop structures in\nthe cortical circuit play important roles in cortical computation as well as in\nmemory storage and retrieval, keeping in conformity with the molecular basis of\nshort and long term memory. A new learning scheme for the brain has also been\nproposed and how it is implemented within the proposed architecture has been\nexplained. A number of mathematical results about the architecture have been\nproposed, many of which without proof.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2007 20:13:09 GMT"}, {"version": "v2", "created": "Wed, 12 Dec 2007 10:55:48 GMT"}], "update_date": "2007-12-12", "authors_parsed": [["Majumdar", "Kaushik", ""]]}, {"id": "0706.3090", "submitter": "Sergei Mukhin I", "authors": "I.N. Krivonos and S.I. Mukhin", "title": "Flexible-to-semiflexible chain crossover on the pressure-area isotherm\n  of lipid bilayer", "comments": "31 pages; 7 figures; submitted to JETP", "journal-ref": null, "doi": "10.1007/s11447-008-1011-6", "report-no": null, "categories": "q-bio.QM q-bio.BM", "license": null, "abstract": "  We found theoretically that competition between ~Kq^4 and ~Qq^2 terms in the\nFourier transformed conformational energy of a single lipid chain, in\ncombination with inter-chain entropic repulsion in the hydrophobic part of the\nlipid (bi)layer, may cause a crossover on the bilayer pressure-area isotherm\nP(A)~(A-A_0)^{-n}. The crossover manifests itself in the transition from n=5/3\nto n=3. Our microscopic model represents a single lipid molecule as a worm-like\nchain with finite irreducible cross-section area A_0, flexural rigidity K and\nstretching modulus Q in a parabolic potential with self-consistent curvature\nB(A) formed by entropic interactions between hydrocarbon chains in the lipid\nlayer. The crossover area per lipid A* obeys relation Q^2/(KB(A*))~1 . We\npredict a peculiar possibility to deduce effective elastic moduli K and Q of\nthe individual hydrocarbon chain from the analysis of the isotherm possessing\nsuch crossover. Also calculated is crossover-related behavior of the area\ncompressibility modulus K_a, equilibrium area per lipid A_t, and chain order\nparameter S.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2007 06:43:32 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Krivonos", "I. N.", ""], ["Mukhin", "S. I.", ""]]}, {"id": "0706.3234", "submitter": "Edgar Delgado-Eckert MS", "authors": "Edgar Delgado-Eckert", "title": "Reverse engineering time discrete finite dynamical systems: A feasible\n  undertaking?", "comments": "Submitted to journal, currently under review", "journal-ref": "PLoS ONE, 4(3), 2009", "doi": "10.1371/journal.pone.0004939.", "report-no": null, "categories": "q-bio.QM math.DS q-bio.MN", "license": null, "abstract": "  With the advent of high-throughput profiling methods, interest in reverse\nengineering the structure and dynamics of biochemical networks is high.\nRecently an algorithm for reverse engineering of biochemical networks was\ndeveloped by Laubenbacher and Stigler. It is a top-down approach using time\ndiscrete dynamical systems. One of its key steps includes the choice of a term\norder. The aim of this paper is to identify minimal requirements on data sets\nto be used with this algorithm and to characterize optimal data sets. We found\nminimal requirements on a data set based on how many terms the functions to be\nreverse engineered display. Furthermore, we identified optimal data sets, which\nwe characterized using a geometric property called \"general position\".\nMoreover, we developed a constructive method to generate optimal data sets,\nprovided a codimensional condition is fulfilled. In addition, we present a\ngeneralization of their algorithm that does not depend on the choice of a term\norder. For this method we derived a formula for the probability of finding the\ncorrect model, provided the data set used is optimal. We analyzed the\nasymptotic behavior of the probability formula for a growing number of\nvariables n (i.e. interacting chemicals). Unfortunately, this formula converges\nto zero as fast as r^(q^n), where q is a natural number and 0<r<1. Therefore,\neven if an optimal data set is used and the restrictions in using term orders\nare overcome, the reverse engineering problem remains unfeasible, unless\nprodigious amounts of data are available. Such large data sets are\nexperimentally impossible to generate with today's technologies.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2007 22:52:50 GMT"}], "update_date": "2010-01-18", "authors_parsed": [["Delgado-Eckert", "Edgar", ""]]}, {"id": "0706.3589", "submitter": "Janos Locsei", "authors": "J. T. Locsei", "title": "Persistence of direction increases the drift velocity of run and tumble\n  chemotaxis", "comments": "17 pages, 5 figures", "journal-ref": "J. Math. Biol. 55, 2007, 41-60", "doi": "10.1007/s00285-007-0080-z", "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  Escherichia coli is a motile bacterium that moves up a chemoattractant\ngradient by performing a biased random walk composed of alternating runs and\ntumbles. Previous models of run and tumble chemotaxis neglect one or more\nfeatures of the motion, namely (i) a cell cannot directly detect a\nchemoattractant gradient but rather makes temporal comparisons of\nchemoattractant concentration, (ii) rather than being entirely random, tumbles\nexhibit persistence of direction, meaning that the new direction after a tumble\nis more likely to be in the forward hemisphere, and (iii) rotational Brownian\nmotion makes it impossible for an E. coli cell to swim in a straight line\nduring a run. This paper presents an analytic calculation of the chemotactic\ndrift velocity taking account of (i), (ii) and (iii), for weak chemotaxis. The\nanalytic results are verified by Monte Carlo simulation. The results reveal a\nsynergy between temporal comparisons and persistence that enhances the drift\nvelocity, while rotational Brownian motion reduces the drift velocity.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 08:42:01 GMT"}], "update_date": "2007-06-26", "authors_parsed": [["Locsei", "J. T.", ""]]}, {"id": "0706.3676", "submitter": "Marcin Molski", "authors": "Marcin Molski and Jerzy Konarski", "title": "On the Gompertzian dynamics of growth and self-organization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  Comment on the Waliszewski's article \"A principle of fractal-sto-chastic\ndualism and Gompertzian dynamics of growth and self-organization\" (BioSystems\n82 (2005)61-73) is presented. It has been proved that the main idea of this\nwork that Gompertzian dynamics is governed by the Schr\\\"{o}dinger-like equation\nincluding anharmonic Morse potential has been already introduced by Molski and\nKonarski in 2003. Some inconsistencies and mathematical errors in the\nWaliszewski's model are also pointed out.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 17:11:09 GMT"}], "update_date": "2007-06-26", "authors_parsed": [["Molski", "Marcin", ""], ["Konarski", "Jerzy", ""]]}, {"id": "0706.3681", "submitter": "Marcin Molski", "authors": "Marcin Molski", "title": "On the Classification Scheme for Phenomenological Universalities in\n  Growth Problems in Physics and Other Sciences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  Comment on \"Classification Scheme for Phenomenological Universalities in\nGrowth Problems in Physics and Other Sciences\" by P. Castorina, P. P. Delsanto\nand C. Guiot, Phys. Rev. Lett. {\\bf 96}, 188701 (2006) is presented. It has\nbeen proved that the West-like function of growth derived by the authors is\nincorrect and the approach does not take into account the growth of the\nbiological systems undergoing atrophy or demographic and economic systems\nundergoing involution or regression. A simple extension of the model, which\npermits derivation of the so far unknown involuted Gompertz function of growth\nis proposed.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 17:40:10 GMT"}], "update_date": "2007-06-26", "authors_parsed": [["Molski", "Marcin", ""]]}, {"id": "0706.3684", "submitter": "Pete Donnell", "authors": "Pete Donnell, Murad Banaji and Stephen Baigent", "title": "Stability in generic mitochondrial models", "comments": "22 pages, 1 figure. Submitted to Mathematical Biosciences", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.SC", "license": null, "abstract": "  In this paper, we use a variety of mathematical techniques to explore\nexistence, local stability, and global stability of equilibria in abstract\nmodels of mitochondrial metabolism. The class of models constructed is defined\nby the biological description of the system, with minimal mathematical\nassumptions. The key features are an electron transport chain coupled to a\nprocess of charge translocation across a membrane. In the absence of charge\ntranslocation these models have previously been shown to behave in a very\nsimple manner with a single, globally stable equilibrium. We show that with\ncharge translocation the conclusion about a unique equilibrium remains true,\nbut local and global stability do not necessarily follow. In sufficiently low\ndimensions - i.e. for short electron transport chains - it is possible to make\nclaims about local and global stability of the equilibrium. On the other hand,\nfor longer chains, these general claims are no longer valid. Some particular\nconditions which ensure stability of the equilibrium for chains of arbitrary\nlength are presented.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 17:55:06 GMT"}], "update_date": "2007-06-26", "authors_parsed": [["Donnell", "Pete", ""], ["Banaji", "Murad", ""], ["Baigent", "Stephen", ""]]}, {"id": "0706.3743", "submitter": "Kilho Eom", "authors": "Kilho Eom, Tae Yun Kwon, Dae Sung Yoon, Hong Lim Lee, Tae Song Kim", "title": "Dynamical Response of Nanomechanical Resonators to Biomolecular\n  Interactions", "comments": "17 page, 4 figures, accepted for publication at PRB. Physical Review\n  B, accepted", "journal-ref": null, "doi": "10.1103/PhysRevB.76.113408", "report-no": null, "categories": "cond-mat.soft q-bio.QM", "license": null, "abstract": "  We studied the dynamical response of a nanomechanical resonator to\nbiomolecular (e.g. DNA) adsorptions on a resonator's surface by using a\ntheoretical model, which considers the Hamiltonian H such that the potential\nenergy consists of elastic bending energy of a resonator and the potential\nenergy for biomolecular interactions. It was shown that the resonant frequency\nshift of a resonator due to biomolecular adsorption depends on not only the\nmass of adsorbed biomolecules but also the biomolecular interactions.\nSpecifically, for dsDNA adsorption on a resonator's surface, the resonant\nfrequency shift is also dependent on the ionic strength of a solvent, implying\nthe role of molecular interactions on the dynamic behavior of a resonator. This\nindicates that nanomechanical resonators may enable one to quantify the\nbiomolecular mass, implying the enumeration of biomolecules, as well as gain\ninsight into intermolecular interactions between adsorbed biomolecules on the\nsurface.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jun 2007 01:53:33 GMT"}, {"version": "v2", "created": "Tue, 24 Jul 2007 15:20:17 GMT"}, {"version": "v3", "created": "Fri, 17 Aug 2007 05:55:52 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Eom", "Kilho", ""], ["Kwon", "Tae Yun", ""], ["Yoon", "Dae Sung", ""], ["Lee", "Hong Lim", ""], ["Kim", "Tae Song", ""]]}]