[{"id": "0708.0171", "submitter": "Jean-Philippe Vert", "authors": "Pierre Mah\\'e (XRCE), Jean-Philippe Vert (CB)", "title": "Virtual screening with support vector machines and structure kernels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG", "license": null, "abstract": "  Support vector machines and kernel methods have recently gained considerable\nattention in chemoinformatics. They offer generally good performance for\nproblems of supervised classification or regression, and provide a flexible and\ncomputationally efficient framework to include relevant information and prior\nknowledge about the data and problems to be handled. In particular, with kernel\nmethods molecules do not need to be represented and stored explicitly as\nvectors or fingerprints, but only to be compared to each other through a\ncomparison function technically called a kernel. While classical kernels can be\nused to compare vector or fingerprint representations of molecules, completely\nnew kernels were developed in the recent years to directly compare the 2D or 3D\nstructures of molecules, without the need for an explicit vectorization step\nthrough the extraction of molecular descriptors. While still in their infancy,\nthese approaches have already demonstrated their relevance on several toxicity\nprediction and structure-activity relationship problems.\n", "versions": [{"version": "v1", "created": "Wed, 1 Aug 2007 19:13:52 GMT"}], "update_date": "2007-08-02", "authors_parsed": [["Mahé", "Pierre", "", "XRCE"], ["Vert", "Jean-Philippe", "", "CB"]]}, {"id": "0708.0370", "submitter": "David Anderson", "authors": "David F. Anderson", "title": "A modified Next Reaction Method for simulating chemical systems with\n  time dependent propensities and delays", "comments": "25 pages, 1 figure. Some minor changes made to add clarity", "journal-ref": null, "doi": "10.1063/1.2799998", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": null, "abstract": "  Chemical reaction systems with a low to moderate number of molecules are\ntypically modeled as discrete jump Markov processes. These systems are\noftentimes simulated with methods that produce statistically exact sample paths\nsuch as the Gillespie Algorithm or the Next Reaction Method. In this paper we\nmake explicit use of the fact that the initiation times of the reactions can be\nrepresented as the firing times of independent, unit rate Poisson processes\nwith internal times given by integrated propensity functions. Using this\nrepresentation we derive a modified Next Reaction Method and, in a way that\nachieves efficiency over existing approaches for exact simulation, extend it to\nsystems with time dependent propensities as well as to systems with delays.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2007 16:19:10 GMT"}, {"version": "v2", "created": "Fri, 31 Aug 2007 19:45:03 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Anderson", "David F.", ""]]}, {"id": "0708.0377", "submitter": "David Anderson", "authors": "David F. Anderson", "title": "Incorporating postleap checks in tau-leaping", "comments": "Final version. Minor changes", "journal-ref": null, "doi": "10.1063/1.2819665", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By explicitly representing the reaction times of discrete chemical systems as\nthe firing times of independent, unit rate Poisson processes, we develop a new\nadaptive tau-leaping procedure. The procedure developed is novel in that\naccuracy is guaranteed by performing postleap checks. Because the\nrepresentation we use separates the randomness of the model from the state of\nthe system, we are able to perform the postleap checks in such a way that the\nstatistics of the sample paths generated will not be biased by the rejections\nof leaps. Further, since any leap condition is ensured with a probability of\none, the simulation method naturally avoids negative population values\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2007 16:36:27 GMT"}, {"version": "v2", "created": "Tue, 25 Sep 2007 03:59:25 GMT"}, {"version": "v3", "created": "Tue, 30 Oct 2007 01:47:58 GMT"}, {"version": "v4", "created": "Mon, 18 Aug 2008 15:34:52 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Anderson", "David F.", ""]]}, {"id": "0708.0505", "submitter": "Luca Di Gaspero PhD", "authors": "Luca Di Gaspero, Andrea Roli", "title": "A preliminary analysis on metaheuristics methods applied to the\n  Haplotype Inference Problem", "comments": "22 pages, 4 figures Technical Report: DEIS - Alma Mater Studiorum,\n  University of Bologna no. DEIS-LIA-006-07", "journal-ref": null, "doi": null, "report-no": "DEIS-LIA-006-07", "categories": "cs.AI cs.CE cs.DM q-bio.QM", "license": null, "abstract": "  Haplotype Inference is a challenging problem in bioinformatics that consists\nin inferring the basic genetic constitution of diploid organisms on the basis\nof their genotype. This information allows researchers to perform association\nstudies for the genetic variants involved in diseases and the individual\nresponses to therapeutic agents.\n  A notable approach to the problem is to encode it as a combinatorial problem\n(under certain hypotheses, such as the pure parsimony criterion) and to solve\nit using off-the-shelf combinatorial optimization techniques. The main methods\napplied to Haplotype Inference are either simple greedy heuristic or exact\nmethods (Integer Linear Programming, Semidefinite Programming, SAT encoding)\nthat, at present, are adequate only for moderate size instances.\n  We believe that metaheuristic and hybrid approaches could provide a better\nscalability. Moreover, metaheuristics can be very easily combined with problem\nspecific heuristics and they can also be integrated with tree-based search\ntechniques, thus providing a promising framework for hybrid systems in which a\ngood trade-off between effectiveness and efficiency can be reached.\n  In this paper we illustrate a feasibility study of the approach and discuss\nsome relevant design issues, such as modeling and design of approximate solvers\nthat combine constructive heuristics, local search-based improvement strategies\nand learning mechanisms. Besides the relevance of the Haplotype Inference\nproblem itself, this preliminary analysis is also an interesting case study\nbecause the formulation of the problem poses some challenges in modeling and\nhybrid metaheuristic solver design that can be generalized to other problems.\n", "versions": [{"version": "v1", "created": "Fri, 3 Aug 2007 12:49:21 GMT"}], "update_date": "2007-08-06", "authors_parsed": [["Di Gaspero", "Luca", ""], ["Roli", "Andrea", ""]]}, {"id": "0708.1256", "submitter": "Jose-Luis Aragon", "authors": "J. L\\'opez-Sauceda and J.L. Arag\\'on", "title": "Eutacticity in sea urchin evolution", "comments": "17 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  An eutactic star, in a n-dimensional space, is a set of N vectors which can\nbe viewed as the projection of N orthogonal vectors in a N-dimensional space.\nBy adequately associating a star of vectors to a particular sea urchin we\npropose that a measure of the eutacticity of the star constitutes a measure of\nthe regularity of the sea urchin. Then we study changes of regularity\n(eutacticity) in a macroevolutive and taxonomic level of sea urchins belonging\nto the Echinoidea Class. An analysis considering changes through geological\ntime suggests a high degree of regularity in the shape of these organisms\nthrough their evolution. Rare deviations from regularity measured in\nHolasteroida order are discussed.\n", "versions": [{"version": "v1", "created": "Thu, 9 Aug 2007 18:31:07 GMT"}], "update_date": "2007-08-10", "authors_parsed": [["López-Sauceda", "J.", ""], ["Aragón", "J. L.", ""]]}, {"id": "0708.1341", "submitter": "David Hsu", "authors": "David Hsu, Murielle Hsu, He Huang and Erwin B. Montgomery, Jr", "title": "An algorithm for detecting oscillatory behavior in discretized data: the\n  damped-oscillator oscillator detector", "comments": "20 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": null, "abstract": "  We present a simple algorithm for detecting oscillatory behavior in discrete\ndata. The data is used as an input driving force acting on a set of simulated\ndamped oscillators. By monitoring the energy of the simulated oscillators, we\ncan detect oscillatory behavior in data. In application to in vivo deep brain\nbasal ganglia recordings, we found sharp peaks in the spectrum at 20 and 70 Hz.\nThe algorithm is also compared to the conventional fast Fourier transform and\ncircular statistics techniques using computer generated model data, and is\nfound to be comparable to or better than fast Fourier transform in test cases.\nCircular statistics performed poorly in our tests.\n", "versions": [{"version": "v1", "created": "Thu, 9 Aug 2007 21:14:11 GMT"}], "update_date": "2012-08-27", "authors_parsed": [["Hsu", "David", ""], ["Hsu", "Murielle", ""], ["Huang", "He", ""], ["Montgomery,", "Erwin B.", "Jr"]]}, {"id": "0708.1439", "submitter": "Walton Gutierrez", "authors": "Walton R. Gutierrez", "title": "The Optimal Form of Distribution Networks Applied to the Kidney and Lung", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": null, "abstract": "  A model is proposed to minimize the total volume of the main distribution\nnetworks of fluids in relation to the organ form. The minimization analysis\nshows that the overall exterior form of distribution networks is a modified\nellipsoid, a geometric form that is a good approximation to the external\nanatomy of the kidney and lung. The variational procedure implementing this\nminimization is similar to the traditional isoperimetric theorems of geometry.\n  A revised version of this preprint that expands Section 4 will be published\nin the Journal of Biological Systems, World Scientific Publishing.\n", "versions": [{"version": "v1", "created": "Fri, 10 Aug 2007 14:53:39 GMT"}], "update_date": "2007-08-13", "authors_parsed": [["Gutierrez", "Walton R.", ""]]}, {"id": "0708.1865", "submitter": "Pan-Jun Kim", "authors": "Pan-Jun Kim, Dong-Yup Lee, Tae Yong Kim, Kwang Ho Lee, Hawoong Jeong,\n  Sang Yup Lee, Sunwon Park", "title": "Metabolite essentiality elucidates robustness of Escherichia coli\n  metabolism", "comments": "Supplements available at\n  http://stat.kaist.ac.kr/publication/2007/PJKim_pnas_supplement.pdf", "journal-ref": "Proc. Natl. Acad. Sci. USA. 104 13638 (2007)", "doi": "10.1073/pnas.0703262104", "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.QM", "license": null, "abstract": "  Complex biological systems are very robust to genetic and environmental\nchanges at all levels of organization. Many biological functions of Escherichia\ncoli metabolism can be sustained against single-gene or even multiple-gene\nmutations by using redundant or alternative pathways. Thus, only a limited\nnumber of genes have been identified to be lethal to the cell. In this regard,\nthe reaction-centric gene deletion study has a limitation in understanding the\nmetabolic robustness. Here, we report the use of flux-sum, which is the\nsummation of all incoming or outgoing fluxes around a particular metabolite\nunder pseudo-steady state conditions, as a good conserved property for\nelucidating such robustness of E. coli from the metabolite point of view. The\nfunctional behavior, as well as the structural and evolutionary properties of\nmetabolites essential to the cell survival, was investigated by means of a\nconstraints-based flux analysis under perturbed conditions. The essential\nmetabolites are capable of maintaining a steady flux-sum even against severe\nperturbation by actively redistributing the relevant fluxes. Disrupting the\nflux-sum maintenance was found to suppress cell growth. This approach of\nanalyzing metabolite essentiality provides insight into cellular robustness and\nconcomitant fragility, which can be used for several applications, including\nthe development of new drugs for treating pathogens.\n", "versions": [{"version": "v1", "created": "Tue, 14 Aug 2007 11:38:00 GMT"}], "update_date": "2007-08-30", "authors_parsed": [["Kim", "Pan-Jun", ""], ["Lee", "Dong-Yup", ""], ["Kim", "Tae Yong", ""], ["Lee", "Kwang Ho", ""], ["Jeong", "Hawoong", ""], ["Lee", "Sang Yup", ""], ["Park", "Sunwon", ""]]}, {"id": "0708.1899", "submitter": "Hernan Garcia", "authors": "Hernan G. Garcia, Jan\\'e Kondev, Nigel Orme, Julie A. Theriot, Rob\n  Phillips", "title": "A First Exposure to Statistical Mechanics for Life Scientists", "comments": "27 pages, 16 figures. Submitted to American Journal of Physics", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": null, "abstract": "  Statistical mechanics is one of the most powerful and elegant tools in the\nquantitative sciences. One key virtue of statistical mechanics is that it is\ndesigned to examine large systems with many interacting degrees of freedom,\nproviding a clue that it might have some bearing on the analysis of the\nmolecules of living matter. As a result of data on biological systems becoming\nincreasingly quantitative, there is a concomitant demand that the models set\nforth to describe biological systems be themselves quantitative. We describe\nhow statistical mechanics is part of the quantitative toolkit that is needed to\nrespond to such data. The power of statistical mechanics is not limited to\ntraditional physical and chemical problems and there are a host of interesting\nways in which these ideas can be applied in biology. This article reports on\nour efforts to teach statistical mechanics to life science students and\nprovides a framework for others interested in bringing these tools to a\nnontraditional audience in the life sciences.\n", "versions": [{"version": "v1", "created": "Tue, 14 Aug 2007 15:23:48 GMT"}], "update_date": "2007-08-15", "authors_parsed": [["Garcia", "Hernan G.", ""], ["Kondev", "Jané", ""], ["Orme", "Nigel", ""], ["Theriot", "Julie A.", ""], ["Phillips", "Rob", ""]]}, {"id": "0708.2121", "submitter": "Ashok Palaniappan", "authors": "Ashok Palaniappan", "title": "Detection of an ancient principle and an elegant solution to the protein\n  classification problem", "comments": "13p", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.BM q-bio.QM", "license": null, "abstract": "  This work is concerned with the development of a well-founded, theoretically\njustified, and least complicated metric for the classification of proteins with\nreference to enzymes. As the signature of an enzyme family, a catalytic domain\nis easily fingerprinted. Given that the classification problem has so far\nseemed intractable, a classification schema derived from the catalytic domain\nwould be satisfying. Here I show that there exists a natural ab initio if\nnonobvious basis to theorize that the catalytic domain of an enzyme is uniquely\ninformative about its regulation. This annotates its function. Based on this\nhypothesis, a method that correctly classifies potassium ion channels into\ntheir respective subfamilies is described. To put the principle on firmer\nground, extra validation was sought and obtained through co-evolutionary\nanalyses. The co-evolutionary analyses reveal a departure from the notion that\npotassium ion channel proteins are functionally modular. This finding is\ndiscussed in light of the prevailing notion of domain. These studies establish\nthat significant co-evolution of the catalytic domain of a gene with its\nconjoint domain is a specialized, necessary process following fusion and\nswapping events in evolution. Instances of this discovery are likely to be\nfound pervasive in protein science.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2007 16:58:25 GMT"}], "update_date": "2007-08-17", "authors_parsed": [["Palaniappan", "Ashok", ""]]}, {"id": "0708.2124", "submitter": "Mike Steel Prof.", "authors": "Mike Steel and Allen Rodrigo", "title": "Maximum Likelihood Supertrees", "comments": "13 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": null, "abstract": "  We analyse a maximum-likelihood approach for combining phylogenetic trees\ninto a larger `supertree'. This is based on a simple exponential model of\nphylogenetic error, which ensures that ML supertrees have a simple\ncombinatorial description (as a median tree, minimising a weighted sum of\ndistances to the input trees). We show that this approach to ML supertree\nreconstruction is statistically consistent (it converges on the true species\nsupertree as more input trees are combined), in contrast to the widely-used MRP\nmethod, which we show can be statistically inconsistent under the exponential\nerror model. We also show that this statistical consistency extends to an ML\napproach for constructing species supertrees from gene trees. In this setting,\nincomplete lineage sorting (due to coalescence rates of homologous genes being\nlower than speciation rates) has been shown to lead to gene trees that are\nfrequently different from species trees, and this can confound efforts to\nreconstruct the species phylogeny correctly.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2007 03:11:01 GMT"}], "update_date": "2007-08-17", "authors_parsed": [["Steel", "Mike", ""], ["Rodrigo", "Allen", ""]]}, {"id": "0708.2384", "submitter": "Indranil Mitra Mr", "authors": "Indranil Mitra, Sisir Roy, Gary Hastings", "title": "Co-operativity in neurons and the role of noise in brain", "comments": "12 Pages, Updated Version, SPIE 2007 Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": null, "abstract": "  In view of some recent results in case of the dopaminergic neurons exhibiting\nlong range correlations in VTA of the limbic brain we are interested to find\nout whether any stochastic nonlinear response may be reproducible in the nano\nscales usimg the results of quantum mechanics. We have developed a scheme to\ninvestigate this situation in this paper by taking into consideration the\nSchrodinger equation (SE) in an arbitrary manifold with a metric, which is in\nsome sense a special case of the heat kernel equation. The special case of this\nheat kernel equation is the diffusion equation, which may reproduce some key\nphenomena of the neural activities. We make a dual equivalent circuit model of\nSE and incorporate non commutativity and noise inside the circuit scheme. The\nbehaviour of the circuit elements with interesting limits are investigated. The\nmost bizarre part is the long range response of the model by dint of the\nCentral Limit Theorem, which is responsible for coherent behaviour of a large\nassembly of neurons.\n", "versions": [{"version": "v1", "created": "Wed, 15 Aug 2007 14:47:57 GMT"}], "update_date": "2007-08-20", "authors_parsed": [["Mitra", "Indranil", ""], ["Roy", "Sisir", ""], ["Hastings", "Gary", ""]]}, {"id": "0708.3181", "submitter": "Rudolf A. Roemer", "authors": "Chi-Tin Shih, Stephan Roche, Rudolf A. R\\\"omer", "title": "Point Mutations Effects on Charge Transport Properties of the\n  Tumor-Suppressor Gene p53", "comments": "4.1 PR style pages with 5 figures included", "journal-ref": "Phys. Rev. Lett. 100, 018105 (2008)", "doi": "10.1103/PhysRevLett.100.018105", "report-no": null, "categories": "q-bio.GN cond-mat.soft q-bio.QM", "license": null, "abstract": "  We report on a theoretical study of point mutations effects on charge\ntransfer properties in the DNA sequence of the tumor-suppressor p53 gene. On\nthe basis of effective single-strand or double-strand tight-binding models\nwhich simulate hole propagation along the DNA, a statistical analysis of charge\ntransmission modulations associated with all possible point mutations is\nperformed. We find that in contrast to non-cancerous mutations, mutation\nhotspots tend to result in significantly weaker {\\em changes of transmission\nproperties}. This suggests that charge transport could play a significant role\nfor DNA-repairing deficiency yielding carcinogenesis.\n", "versions": [{"version": "v1", "created": "Thu, 23 Aug 2007 13:57:58 GMT"}], "update_date": "2008-01-09", "authors_parsed": [["Shih", "Chi-Tin", ""], ["Roche", "Stephan", ""], ["Römer", "Rudolf A.", ""]]}, {"id": "0708.3509", "submitter": "Vahid Rezania", "authors": "Vahid Rezania and Jack Tuszynski", "title": "Modeling polymerization of microtubules: a quantum mechanical approach", "comments": "19 pages, 1 figure", "journal-ref": "Physica A, Vol. 387, 5795 - 5809 (2008)", "doi": null, "report-no": null, "categories": "q-bio.BM cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper a quantum mechanical description of the assembly/disassembly\nprocess for microtubules is proposed. We introduce creation and annihilation\noperators that raise or lower the microtubule length by a tubulin layer.\nFollowing that, the Hamiltonian and corresponding equations of motion for the\nquantum fields are derived that describe the dynamics of microtubules. These\nHeisenberg-type equations are then transformed to semi-classical equations\nusing the method of coherent structures. We find that the dynamics of a\nmicrotubule can be mathematically expressed via a cubic-quintic nonlinear\nSchr\\\"{o}dinger (NLS) equation. We show that a vortex filament, a generic\nsolution of the NLS equation, exhibits linear growth/shrinkage in time as well\nas temporal fluctuations about some mean value which is qualitatively similar\nto the dynamic instability of microtubules.\n", "versions": [{"version": "v1", "created": "Mon, 27 Aug 2007 19:07:57 GMT"}, {"version": "v2", "created": "Wed, 22 Oct 2008 15:47:29 GMT"}], "update_date": "2008-10-22", "authors_parsed": [["Rezania", "Vahid", ""], ["Tuszynski", "Jack", ""]]}, {"id": "0708.3627", "submitter": "Walter Nadler", "authors": "Walter Nadler, Ulrich H. E. Hansmann", "title": "Optimizing Replica Exchange Moves For Molecular Dynamics", "comments": "4 pages, 3 figures; revised version (1 figure added), PRE in press", "journal-ref": null, "doi": "10.1103/PhysRevE.76.057102", "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech physics.comp-ph q-bio.BM", "license": null, "abstract": "  In this short note we sketch the statistical physics framework of the replica\nexchange technique when applied to molecular dynamics simulations. In\nparticular, we draw attention to generalized move sets that allow a variety of\noptimizations as well as new applications of the method.\n", "versions": [{"version": "v1", "created": "Mon, 27 Aug 2007 15:18:03 GMT"}, {"version": "v2", "created": "Tue, 28 Aug 2007 09:18:00 GMT"}, {"version": "v3", "created": "Tue, 16 Oct 2007 09:26:27 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Nadler", "Walter", ""], ["Hansmann", "Ulrich H. E.", ""]]}, {"id": "0708.4065", "submitter": "Manoj Gopalakrishnan", "authors": "Shivam Ghosh (St.Stephens College, Delhi), Manoj Gopalakrishnan (HRI,\n  Allahabad), Kimberly Forsten-Williams (Virginia Tech)", "title": "Self-consistent theory of reversible ligand binding to a spherical cell", "comments": "23 pages with 4 figures", "journal-ref": "Phys. Biol. 4 344-354 (2007)", "doi": "10.1088/1478-3975/4/4/010", "report-no": null, "categories": "q-bio.SC cond-mat.stat-mech q-bio.QM", "license": null, "abstract": "  In this article, we study the kinetics of reversible ligand binding to\nreceptors on a spherical cell surface using a self-consistent stochastic\ntheory. Binding, dissociation, diffusion and rebinding of ligands are\nincorporated into the theory in a systematic manner. We derive explicitly the\ntime evolution of the ligand-bound receptor fraction p(t) in various regimes .\nContrary to the commonly accepted view, we find that the well-known\nBerg-Purcell scaling for the association rate is modified as a function of\ntime. Specifically, the effective on-rate changes non-monotonically as a\nfunction of time and equals the intrinsic rate at very early as well as late\ntimes, while being approximately equal to the Berg-Purcell value at\nintermediate times. The effective dissociation rate, as it appears in the\nbinding curve or measured in a dissociation experiment, is strongly modified by\nrebinding events and assumes the Berg-Purcell value except at very late times,\nwhere the decay is algebraic and not exponential. In equilibrium, the ligand\nconcentration everywhere in the solution is the same and equals its spatial\nmean, thus ensuring that there is no depletion in the vicinity of the cell.\nImplications of our results for binding experiments and numerical simulations\nof ligand-receptor systems are also discussed.\n", "versions": [{"version": "v1", "created": "Thu, 30 Aug 2007 03:15:42 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Ghosh", "Shivam", "", "St.Stephens College, Delhi"], ["Gopalakrishnan", "Manoj", "", "HRI,\n  Allahabad"], ["Forsten-Williams", "Kimberly", "", "Virginia Tech"]]}, {"id": "0708.4212", "submitter": "Frank Schweitzer", "authors": "Adrian M. Seufert, Frank Schweitzer", "title": "Aggregate Dynamics in an Evolutionary Network Model", "comments": null, "journal-ref": "International Journal of Modern Physics C, vol. 18, no. 10 (2007),\n  pp. 1659-1674", "doi": "10.1142/S0129183107011649", "report-no": null, "categories": "q-bio.PE nlin.AO q-bio.MN q-bio.QM", "license": null, "abstract": "  We analyze a model of interacting agents (e.g. prebiotic chemical species)\nwhich are represended by nodes of a network, whereas their interactions are\nmapped onto directed links between these nodes. On a fast time scale, each\nagent follows an eigendynamics based on catalytic support from other nodes,\nwhereas on a much slower time scale the network evolves through selection and\nmutation of its nodes-agent. In the first part of the paper, we explain the\ndynamics of the model by means of characteristic snapshots of the network\nevolution and confirm earlier findings on crashes an recoveries in the network\nstructure. In the second part, we focus on the aggregate behavior of the\nnetwork dynamics. We show that the disruptions in the network structure are\nsmoothed out, so that the average evolution can be described by a growth regime\nfollowed by a saturation regime, without an initial random regime. For the\nsaturation regime, we obtain a logarithmic scaling between the average\nconnectivity per node $\\mean{l}_{s}$ and a parameter $m$, describing the\naverage incoming connectivity, which is independent of the system size $N$.\n", "versions": [{"version": "v1", "created": "Thu, 30 Aug 2007 18:04:22 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Seufert", "Adrian M.", ""], ["Schweitzer", "Frank", ""]]}]