[{"id": "0807.0051", "submitter": "Cynthia Vinzant", "authors": "Cynthia Vinzant", "title": "Lower Bounds for Optimal Alignments of Binary Sequences", "comments": "12 pages, 3 figures, submitted to Discrete Applied Mathematics", "journal-ref": "Discrete Applied Math. 157:15 (2009), pp. 3341-3346", "doi": "10.1016/j.dam.2009.06.028", "report-no": null, "categories": "q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In parametric sequence alignment, optimal alignments of two sequences are\ncomputed as a function of the penalties for mismatches and spaces, producing\nmany different optimal alignments. Here we give a 3/(2^{7/3}\\pi^{2/3})n^{2/3}\n+O(n^{1/3} \\log n) lower bound on the maximum number of distinct optimal\nalignment summaries of length-n binary sequences. This shows that the upper\nbound given by Gusfield et. al. is tight over all alphabets, thereby disproving\nthe \"square root of n conjecture\". Thus the maximum number of distinct optimal\nalignment summaries (i.e. vertices of the alignment polytope) over all pairs of\nlength-n sequences is Theta(n^{2/3}).\n", "versions": [{"version": "v1", "created": "Tue, 1 Jul 2008 01:29:06 GMT"}, {"version": "v2", "created": "Tue, 18 Jan 2011 16:41:55 GMT"}], "update_date": "2011-01-19", "authors_parsed": [["Vinzant", "Cynthia", ""]]}, {"id": "0807.0076", "submitter": "Nicolas Destainville", "authors": "Nicolas Destainville (LPT, IPBS), Aude Sauliere (IPBS), Laurence\n  Salome (IPBS)", "title": "Comment to the Paper of Michael J. Saxton: \"A Biological Interpretation\n  of Transient Anomalous Subdiffusion. I. Qualitative Model\"", "comments": "To appear in Biophysical Journal", "journal-ref": "Biophys. J. 95, 3117 (2008)", "doi": "10.1529/biophysj.108.136739", "report-no": null, "categories": "q-bio.SC cond-mat.soft q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper, Michael J. Saxton proposes to interpret as anomalous\ndiffusion the occurrence of apparent transient sub-diffusive regimes in\nmean-squared displacements (MSD) plots, calculated from experimental\ntrajectories of molecules diffusing in living cells, acquired by Single\nParticle (or Molecule) Tracking techniques (SPT or SMT). In this Comment,\nwithout questioning the existence of sub-diffusive behaviors, which certainly\nplay a key role in numbers of mechanisms in living systems, we point out that\nthe data used by J.M. Saxton can as well be fitted by a simple law, resulting\nfrom confined diffusion at short times, with a slower free diffusion\nsuperimposed at larger times. When visualizing MSD plots, the transition from\nshort-term diffusion confined in domains of size L, to slower, longer-term free\ndiffusion, can be confused with anomalous diffusion over several orders of\nmagnitude of time.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jul 2008 07:49:56 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Destainville", "Nicolas", "", "LPT, IPBS"], ["Sauliere", "Aude", "", "IPBS"], ["Salome", "Laurence", "", "IPBS"]]}, {"id": "0807.0087", "submitter": "Francesc Rossell\\'o", "authors": "Gabriel Cardona, Merce Llabres, Francesc Rossello, Gabriel Valiente", "title": "Path lengths in tree-child time consistent hybridization networks", "comments": "31 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DM q-bio.QM", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Hybridization networks are representations of evolutionary histories that\nallow for the inclusion of reticulate events like recombinations,\nhybridizations, or lateral gene transfers. The recent growth in the number of\nhybridization network reconstruction algorithms has led to an increasing\ninterest in the definition of metrics for their comparison that can be used to\nassess the accuracy or robustness of these methods. In this paper we establish\nsome basic results that make it possible the generalization to tree-child time\nconsistent (TCTC) hybridization networks of some of the oldest known metrics\nfor phylogenetic trees: those based on the comparison of the vectors of path\nlengths between leaves. More specifically, we associate to each hybridization\nnetwork a suitably defined vector of `splitted' path lengths between its\nleaves, and we prove that if two TCTC hybridization networks have the same such\nvectors, then they must be isomorphic. Thus, comparing these vectors by means\nof a metric for real-valued vectors defines a metric for TCTC hybridization\nnetworks. We also consider the case of fully resolved hybridization networks,\nwhere we prove that simpler, `non-splitted' vectors can be used.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jul 2008 09:13:32 GMT"}], "update_date": "2008-07-06", "authors_parsed": [["Cardona", "Gabriel", ""], ["Llabres", "Merce", ""], ["Rossello", "Francesc", ""], ["Valiente", "Gabriel", ""]]}, {"id": "0807.0247", "submitter": "Catherine Beauchemin", "authors": "Amy L. Bauer, Catherine A.A. Beauchemin, and Alan S. Perelson", "title": "Agent-Based Modeling of Host-Pathogen Systems: The Successes and\n  Challenges", "comments": "LaTeX, 12 pages, 1 EPS figure, uses document class REVTeX 4, and\n  packages hyperref, xspace, graphics, amsmath, verbatim, and SIunits", "journal-ref": "Information Sciences, Volume 179, Issue 10, 29 April 2009, Pages\n  1379-1389", "doi": "10.1016/j.ins.2008.11.012", "report-no": null, "categories": "q-bio.CB q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agent-based models have been employed to describe numerous processes in\nimmunology. Simulations based on these types of models have been used to\nenhance our understanding of immunology and disease pathology. We review\nvarious agent-based models relevant to host-pathogen systems and discuss their\ncontributions to our understanding of biological processes. We then point out\nsome limitations and challenges of agent-based models and encourage efforts\ntowards reproducibility and model validation.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jul 2008 22:01:21 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Bauer", "Amy L.", ""], ["Beauchemin", "Catherine A. A.", ""], ["Perelson", "Alan S.", ""]]}, {"id": "0807.0673", "submitter": "Satoru Morita", "authors": "Satoru Morita, Kei-ichi Tainaka, Hiroyasu Nagata, and Jin Yoshimura", "title": "Population Uncertainty in Model Ecosystem: Analysis by Stochastic\n  Differential Equation", "comments": "16 pages, 4 figure, submitted to J. Phys. Soc. Jpn", "journal-ref": "Journal of the Physical Society of Japan, 77, 093801 1-4 (2008)", "doi": "10.1143/JPSJ.77.093801", "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Perturbation experiments are carried out by contact process and its\nmean-field version. Here, the mortality rate is increased or decreased\nsuddenly. It is known that the fluctuation enhancement (FE) occurs after the\nperturbation, where FE means a population uncertainty. In the present paper, we\ndevelop a new theory of stochastic differential equation. The agreement between\nthe theory and the mean-field simulation is almost perfect. This theory enables\nus to find much stronger FE than reported previously. We discuss the population\nuncertainty in the recovering process of endangered species.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jul 2008 03:00:19 GMT"}], "update_date": "2012-07-20", "authors_parsed": [["Morita", "Satoru", ""], ["Tainaka", "Kei-ichi", ""], ["Nagata", "Hiroyasu", ""], ["Yoshimura", "Jin", ""]]}, {"id": "0807.0715", "submitter": "Bob Eisenberg", "authors": "R. S. Eisenberg", "title": "Atomic Biology, Electrostatics, and Ionic Channels", "comments": "This is a submission without substantive change of a chapter in the\n  hard to find book, \"New Developments and Theoretical Studies of Proteins\"\n  World Scientific Publishing Philadelphia, Edited by Ron Elber, published in\n  1996 ISBN-10:9810221967; ISBN-13:978-9810221966. RS Eisenberg is also known\n  as Bob Eisenberg. Headers and Footers have been modified in versions 2 and 3", "journal-ref": "New Developments and Theoretical Studies of Proteins, Ed. Ron\n  Elber, World Scientific Publishing, Philadelphia (1996) ISBN-10:9810221967;\n  ISBN-13:978-9810221966", "doi": null, "report-no": null, "categories": "q-bio.BM physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I believe an atomic biology is needed to supplement present day molecular\nbiology, if we are to design and understand proteins, as well as define, make,\nand use them. Topics in the paper are molecular biology and atomic biology.\nElectrodiffusion in the open channel. Electrodiffusion in mixed electrolytes.\nModels of permeation. State Models of Permeation are Inconsistent with the\nElectric Field. Making models in atomic biology. Molecular dynamics. Temporal\nLimitations; Spatial Limitations; Periodic boundary conditions. Hierarchy of\nmodels of the open channel. Stochastic Motion of the Channel. Langevin\nDynamics. Simulations of the Reaction Path: the Permion. Chemical reactions.\nWhat was wrong? Back to the hierarchy: Occam's razor can slit your throat.\nPoisson-Nernst-Planck PNP Models Flux Ratios; Pumping by Field Coupling. Gating\nin channels of one conformation. Gating by Field Switching; Gating Current;\nGating in Branched Channels; Blocking. Back to the hierarchy: Linking levels.\nIs there a theory? At what level will the adaptation be found? Simplicity,\nevolution, and natural function.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jul 2008 10:35:06 GMT"}, {"version": "v2", "created": "Mon, 13 May 2013 17:46:24 GMT"}, {"version": "v3", "created": "Wed, 15 May 2013 17:04:59 GMT"}], "update_date": "2013-05-16", "authors_parsed": [["Eisenberg", "R. S.", ""]]}, {"id": "0807.0721", "submitter": "Bob Eisenberg", "authors": "Bob Eisenberg", "title": "Permeation as a Diffusion Process", "comments": "This is a posting of a paper written in 2000, for the Biophysics\n  Textbook On Line Channels, Receptors, and Transporters Louis J. DeFelice,\n  Volume Editor which is hard to find. Bob Eisenberg is also known as RS\n  Eisenberg", "journal-ref": "Chapter 4 in Biophysics Textbook On Line Channels, Receptors, and\n  Transporters Louis J. DeFelice, Volume Editor, 2000", "doi": null, "report-no": null, "categories": "q-bio.BM physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper shows how the diffusive movement of ions through a channel protein\ncan be described as a chemical reaction over an arbitrary shaped potential\nbarrier. The result is simple and intuitive but without approximation beyond\nthe electrodiffusion description of ion movement.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jul 2008 11:21:20 GMT"}], "update_date": "2008-07-10", "authors_parsed": [["Eisenberg", "Bob", ""]]}, {"id": "0807.0742", "submitter": "Lucio Colombi Ciacchi", "authors": "Lucy Heady, Marivi Fernandez-Serra, Ricardo L. Mancera, Sian Joyce,\n  Ashok R. Venkitaraman, Emilio Artacho, Chris-Kriton Skylaris, Lucio Colombi\n  Ciacchi, Mike C. Payne", "title": "Novel structural features of CDK inhibition revealed by an ab initio\n  computational method combined with dynamic simulations", "comments": null, "journal-ref": "Journal of Medicinal Chemistry 49, 5141-5153 (2006)", "doi": "10.1021/jm060190+", "report-no": null, "categories": "physics.bio-ph physics.comp-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rational development of specific inhibitors for the ~500 protein kinases\nencoded in the human genome is impeded by a poor understanding of the\nstructural basis for the activity and selectivity of small molecules that\ncompete for ATP binding. Combining classical dynamic simulations with a novel\nab initio computational approach linear-scalable to molecular interactions\ninvolving thousands of atoms, we have investigated the binding of five distinct\ninhibitors to the cyclin-dependent kinase CDK2. We report here that\npolarization and dynamic hydrogen bonding effects, so far undetected by\ncrystallography, affect both their activity and selectivity. The effects arise\nfrom the specific solvation patterns of water molecules in the ATP binding\npocket or the intermittent formation of hydrogen bonds during the dynamics of\nCDK/inhibitor interactions and explain the unexpectedly high potency of certain\ninhibitors such as\n3-(3H-imidazol-4-ylmethylene)-5-methoxy-1,3-dihydro-indol-2-one (SU9516). The\nLys89 residue in the ATP-binding pocket of CDK2 is observed to form temporary\nhydrogen bonds with the three most potent inhibitors. This residue is replaced\nin CDK4 by Thr89, whose shorter side-chain cannot form similar bonds,\nexplaining the relative selectivity of the inhibitors for CDK2. Our results\nprovide a generally applicable computational method for the analysis of\nbiomolecular structures and reveal hitherto unrecognized features of the\ninteraction between protein kinases and their inhibitors\n", "versions": [{"version": "v1", "created": "Fri, 4 Jul 2008 12:48:15 GMT"}], "update_date": "2008-07-08", "authors_parsed": [["Heady", "Lucy", ""], ["Fernandez-Serra", "Marivi", ""], ["Mancera", "Ricardo L.", ""], ["Joyce", "Sian", ""], ["Venkitaraman", "Ashok R.", ""], ["Artacho", "Emilio", ""], ["Skylaris", "Chris-Kriton", ""], ["Ciacchi", "Lucio Colombi", ""], ["Payne", "Mike C.", ""]]}, {"id": "0807.1013", "submitter": "Maria Davidich", "authors": "Maria Davidich, Stefan Bornholdt", "title": "From differential equations to Boolean networks: A Case Study in\n  modeling regulatory networks", "comments": "17 pages, 3 Tables, 3 Figs. Submitted to Journal of Theoretical\n  Biology", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.CB q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Methods of modeling cellular regulatory networks as diverse as differential\nequations and Boolean networks co-exist, however, without any closer\ncorrespondence to each other. With the example system of the fission yeast cell\ncycle control network, we here set the two approaches in relation to each\nother. We find that the Boolean network can be formulated as a specific\ncoarse-grained limit of the more detailed differential network model for this\nsystem. This lays the mathematical foundation on which Boolean networks can be\napplied to biological regulatory networks in a controlled way.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jul 2008 13:34:13 GMT"}, {"version": "v2", "created": "Mon, 7 Jul 2008 20:38:29 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Davidich", "Maria", ""], ["Bornholdt", "Stefan", ""]]}, {"id": "0807.1216", "submitter": "Ayaka Sakata", "authors": "Ayaka Sakata, Koji Hukushima and Kunihiko Kaneko", "title": "Funnel landscape and mutational robustness as a result of evolution\n  under thermal noise", "comments": "4pages, 4figures", "journal-ref": "Phys. Rev. Lett. 102, (2009)", "doi": "10.1103/PhysRevLett.102.148101", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In biological systems, expression dynamics to shape a fitted phenotype for\nfunction has evolved through mutations to genes, as observed in the evolution\nof funnel landscape in protein. We study this evolutionary process with a\nstatistical-mechanical model of interacting spins, where the fitted phenotype\nis represented by a configuration of a given set of \"target spins\" and\ninteraction matrix J among spins is genotype evolving over generations. The\nexpression dynamics is given by stochastic process with temperature T_S to\ndecrease energy for a given set of J. The evolution of J is also stochastic\nwith temperature T_J, following mutation in J and selection based on a fitness\ngiven by configurations of the target spins. Below a certain temperature\nT_S^{c2}, the highly adapted J evolves, whereasanother phase transition\ncharacterised by frustration occurs at T_S^{c1}<T_S^{c2}. At temperature lower\nthan T_S^{c1}, the Hamiltonian exhibits a spin-glass like phase, where the\ndynamics requires long time steps to produce the fitted phenotype, and the\nfitness often decreases drastically by single mutation. In contrast, in the\nintermediate temperature phase between T_S^{c1} and T_S^{c2}, the evolved\ngenotypes, that have no frustration around the target spins (we call \"local\nMattis state\"), give a funnel-like rapid expression dynamics and are robust to\nmutation. These results imply that evolution under thermal noise beyond a\ncertain level leads to funnel dynamics and mutational robustness. We will\nexplain its mechanism with the statistical-mechanical method.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jul 2008 13:43:20 GMT"}, {"version": "v2", "created": "Tue, 3 Mar 2009 01:37:44 GMT"}, {"version": "v3", "created": "Tue, 7 Apr 2009 01:21:57 GMT"}], "update_date": "2009-04-07", "authors_parsed": [["Sakata", "Ayaka", ""], ["Hukushima", "Koji", ""], ["Kaneko", "Kunihiko", ""]]}, {"id": "0807.1655", "submitter": "Artem Novozhilov S", "authors": "Faina S. Berezovskaya, Georgy P. Karev, Artem S. Novozhilov", "title": "Pure cross-diffusion models: Implications for traveling wave solutions", "comments": "11 pages, 5 figues", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE nlin.PS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An analysis of traveling wave solutions of pure cross-diffusion systems,\ni.e., systems that lack reaction and self-diffusion terms, is presented. Using\nthe qualitative theory of phase plane analysis the conditions for existence of\ndifferent types of wave solutions are formulated. In particular, it is shown\nthat family of wave trains is a generic phenomenon in pure cross-diffusion\nsystems. The results can be used for construction and analysis of different\nmathematical models describing systems with directional movement.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jul 2008 14:16:15 GMT"}], "update_date": "2008-07-11", "authors_parsed": [["Berezovskaya", "Faina S.", ""], ["Karev", "Georgy P.", ""], ["Novozhilov", "Artem S.", ""]]}, {"id": "0807.1699", "submitter": "Swarnendu Tripathi", "authors": "Swarnendu Tripathi and John J. Portman", "title": "Inherent flexibility determines the transition mechanisms of the\n  EF-hands of Calmodulin", "comments": "17 pages, 7 figures", "journal-ref": null, "doi": "10.1073/pnas.0806872106", "report-no": null, "categories": "q-bio.QM q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore how inherent flexibility of a protein molecule influences the\nmechanism controlling the kinetics of allosteric transitions using a\nvariational model inspired from work in protein folding. The striking\ndifferences in the predicted transition mechanism for the opening of the two\ndomains of calmodulin (CaM) emphasizes that inherent flexibility is key to\nunderstanding the complex conformational changes that occur in proteins. In\nparticular, the C-terminal domain of CaM (cCaM) which is inherently less\nflexible than its N-terminal domain (nCaM) reveals \"cracking\" or local partial\nunfolding during the open/closed transition. This result is in harmony with the\npicture that cracking relieves local stresses due to conformational\ndeformations of a sufficiently rigid protein. We also compare the\nconformational transition in a recently studied \"even-odd\" paired fragment of\nCaM. Our results rationalize the different relative binding affinities of the\nEF-hands in the engineered fragment compared to the intact \"odd-even\" paired\nEF-hands (nCaM and cCaM) in terms of changes in flexibility along the\ntransition route. Aside from elucidating general theoretical ideas about the\ncracking mechanism, these studies also emphasize how the remarkable intrinsic\nplasticity of CaM underlies conformational dynamics essential for its diverse\nfunctions.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jul 2008 16:44:12 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Tripathi", "Swarnendu", ""], ["Portman", "John J.", ""]]}, {"id": "0807.1750", "submitter": "Claudio Landim", "authors": "C. Landim, R. D. Portugal, B. F. Svaiter", "title": "A Markovian growth dynamics on rooted binary trees evolving according to\n  the Gompertz curve", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB math-ph math.MP q-bio.QM stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by biological dynamics, we consider a growth Markov process taking\nvalues on the space of rooted binary trees, similar to the Aldous-Shields\nmodel. Fix $n\\ge 1$ and $\\beta>0$. We start at time 0 with the tree composed of\na root only. At any time, each node with no descendants, independently from the\nother nodes, produces two successors at rate $\\beta(n-k)/n$, where $k$ is the\ndistance from the node to the root. Denote by $Z_n(t)$ the number of nodes with\nno descendants at time $t$ and let $T_n = \\beta^{-1} n \\ln(n /\\ln 4) + (\\ln\n2)/(2 \\beta)$. We prove that $2^{-n} Z_n(T_n + n \\tau)$, $\\tau\\in\\bb R$,\nconverges to the Gompertz curve $\\exp (- (\\ln 2) e^{-\\beta \\tau})$. We also\nprove a central limit theorem for the martingale associated to $Z_n(t)$.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jul 2008 22:00:46 GMT"}, {"version": "v2", "created": "Fri, 13 Jul 2012 13:21:09 GMT"}], "update_date": "2012-08-14", "authors_parsed": [["Landim", "C.", ""], ["Portugal", "R. D.", ""], ["Svaiter", "B. F.", ""]]}, {"id": "0807.1756", "submitter": "Mike Steel Prof.", "authors": "Mike Steel, Laszlo Szekely, Elchanan Mossel", "title": "Phylogenetic information complexity: Is testing a tree easier than\n  finding it?", "comments": "15 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Phylogenetic trees describe the evolutionary history of a group of\npresent-day species from a common ancestor. These trees are typically\nreconstructed from aligned DNA sequence data. In this paper we analytically\naddress the following question: is the amount of sequence data required to\naccurately reconstruct a tree significantly more than the amount required to\ntest whether or not a candidate tree was the `true' tree? By `significantly',\nwe mean that the two quantities behave the same way as a function of the number\nof species being considered. We prove that, for a certain type of model, the\namount of information required is not significantly different; while for\nanother type of model, the information required to test a tree is independent\nof the number of leaves, while that required to reconstruct it grows with this\nnumber. Our results combine probabilistic and combinatorial arguments.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jul 2008 23:22:42 GMT"}], "update_date": "2008-07-14", "authors_parsed": [["Steel", "Mike", ""], ["Szekely", "Laszlo", ""], ["Mossel", "Elchanan", ""]]}, {"id": "0807.1759", "submitter": "Vladimir Ivancevic", "authors": "Vladimir G. Ivancevic", "title": "New Mechanics of Generic Musculo-Skeletal Injury", "comments": "13 pages, 1 figure, latex - major corrections", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prediction and prevention of musculo-skeletal injuries is an important aspect\nof preventive health science. Using as an example a human knee joint, this\npaper proposes a new coupled-loading-rate hypothesis, which states that a\ngeneric cause of any musculo-skeletal injury is a Euclidean jolt, or\nSE(3)-jolt, an impulsive loading that hits a joint in several coupled\ndegrees-of-freedom simultaneously. Informally, it is a rate-of-change of joint\nacceleration in all 6-degrees-of-freedom simultaneously, times the\ncorresponding portion of the body mass. In the case of a human knee, this\nhappens when most of the body mass is on one leg with a semi-flexed knee -- and\nthen, caused by some external shock, the knee suddenly `jerks'; this can happen\nin running, skiing, sports games (e.g., soccer, rugby) and various\ncrashes/impacts. To show this formally, based on the previously defined\ncovariant force law and its application to traumatic brain injury (Ivancevic,\n2008), we formulate the coupled Newton--Euler dynamics of human joint motions\nand derive from it the corresponding coupled SE(3)-jolt dynamics of the joint\nin case. The SE(3)-jolt is the main cause of two forms of discontinuous joint\ninjury: (i) mild rotational disclinations and (ii) severe translational\ndislocations. Both the joint disclinations and dislocations, as caused by the\nSE(3)-jolt, are described using the Cosserat multipolar viscoelastic continuum\njoint model.\n  Keywords: musculo-skeletal injury, coupled-loading--rate hypothesis, coupled\nNewton-Euler dynamics, Euclidean jolt dynamics, joint dislocations and\ndisclinations\n", "versions": [{"version": "v1", "created": "Fri, 11 Jul 2008 01:24:45 GMT"}, {"version": "v2", "created": "Thu, 14 Aug 2008 04:16:31 GMT"}, {"version": "v3", "created": "Tue, 18 Nov 2008 02:32:22 GMT"}, {"version": "v4", "created": "Thu, 18 Dec 2008 02:01:20 GMT"}, {"version": "v5", "created": "Thu, 9 Apr 2009 00:48:15 GMT"}], "update_date": "2009-04-09", "authors_parsed": [["Ivancevic", "Vladimir G.", ""]]}, {"id": "0807.1833", "submitter": "Natali Gulbahce", "authors": "Natali Gulbahce and Sune Lehmann", "title": "The art of community detection", "comments": "10 pages, 2 figures. to appear in Bioessays", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Networks in nature possess a remarkable amount of structure. Via a series of\ndata-driven discoveries, the cutting edge of network science has recently\nprogressed from positing that the random graphs of mathematical graph theory\nmight accurately describe real networks to the current viewpoint that networks\nin nature are highly complex and structured entities. The identification of\nhigh order structures in networks unveils insights into their functional\norganization. Recently, Clauset, Moore, and Newman, introduced a new algorithm\nthat identifies such heterogeneities in complex networks by utilizing the\nhierarchy that necessarily organizes the many levels of structure. Here, we\nanchor their algorithm in a general community detection framework and discuss\nthe future of community detection.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jul 2008 12:13:05 GMT"}], "update_date": "2008-07-14", "authors_parsed": [["Gulbahce", "Natali", ""], ["Lehmann", "Sune", ""]]}, {"id": "0807.1898", "submitter": "Marco Cosentino Lagomarsino", "authors": "M. Cosentino Lagomarsino, A.L. Sellerio, P.D. Heijning, B. Bassetti", "title": "Universal Features in the Genome-level Evolution of Protein Domains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein domains are found on genomes with notable statistical distributions,\nwhich bear a high degree of similarity. Previous work has shown how these\ndistributions can be accounted for by simple models, where the main ingredients\nare probabilities of duplication, innovation, and loss of domains. However, no\none so far has addressed the issue that these distributions follow definite\ntrends depending on protein-coding genome size only. We present a stochastic\nduplication/innovation model, falling in the class of so-called Chinese\nRestaurant Processes, able to explain this feature of the data. Using only two\nuniversal parameters, related to a minimal number of domains and to the\nrelative weight of innovation to duplication, the model reproduces two\nimportant aspects: (a) the populations of domain classes (the sets, related to\nhomology classes, containing realizations of the same domain in different\nproteins) follow common power-laws whose cutoff is dictated by genome size, and\n(b) the number of domain families is universal and markedly sublinear in genome\nsize. An important ingredient of the model is that the innovation probability\ndecreases with genome size. We propose the possibility to interpret this as a\nglobal constraint given by the cost of expanding an increasingly complex\ninteractome.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jul 2008 17:36:26 GMT"}], "update_date": "2008-07-14", "authors_parsed": [["Lagomarsino", "M. Cosentino", ""], ["Sellerio", "A. L.", ""], ["Heijning", "P. D.", ""], ["Bassetti", "B.", ""]]}, {"id": "0807.2376", "submitter": "Sarika Jalan", "authors": "Sarika Jalan", "title": "Spectral analysis of deformed random networks", "comments": "accepted for publication in Phys. Rev. E (replaced with the final\n  version)", "journal-ref": "Phys. Rev. E 80, 046101 (2009)", "doi": "10.1103/PhysRevE.80.046101", "report-no": null, "categories": "cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study spectral behavior of sparsely connected random networks under the\nrandom matrix framework. Sub-networks without any connection among them form a\nnetwork having perfect community structure. As connections among the\nsub-networks are introduced, the spacing distribution shows a transition from\nthe Poisson statistics to the Gaussian orthogonal ensemble statistics of random\nmatrix theory. The eigenvalue density distribution shows a transition to the\nWigner's semicircular behavior for a completely deformed network. The range for\nwhich spectral rigidity, measured by the Dyson-Mehta $\\Delta_3$ statistics,\nfollows the Gaussian orthogonal ensemble statistics depends upon the\ndeformation of the network from the perfect community structure. The spacing\ndistribution is particularly useful to track very slight deformations of the\nnetwork from a perfect community structure, whereas the density distribution\nand the $\\Delta_3$ statistics remain identical to the undeformed network. On\nthe other hand the $\\Delta_3$ statistics is useful for the larger deformation\nstrengths. Finally, we analyze the spectrum of a protein-protein interaction\nnetwork for Helicobacter, and compare the spectral behavior with those of the\nmodel networks.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jul 2008 13:54:04 GMT"}, {"version": "v2", "created": "Fri, 11 Sep 2009 09:40:53 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Jalan", "Sarika", ""]]}, {"id": "0807.2995", "submitter": "Michael Yampolsky", "authors": "Michael Yampolsky, Oleksandr Shlakhter, Carolyn M. Salafia, Danielle\n  Haas", "title": "Mean surface shape of a human placenta", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The chorionic plate (or \"fetal surface\") of the human placenta is drawn as\nround, with the umbilical cord inserted roughly at the center, but variability\nof this shape is common. The average shape of the chorionic plate has never\nbeen established. The goal of this work is to measure the average shape in a\nbirth cohort.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jul 2008 16:00:01 GMT"}], "update_date": "2008-07-21", "authors_parsed": [["Yampolsky", "Michael", ""], ["Shlakhter", "Oleksandr", ""], ["Salafia", "Carolyn M.", ""], ["Haas", "Danielle", ""]]}, {"id": "0807.3038", "submitter": "Jan Biro Dr", "authors": "Jan C Biro", "title": "Design and Production of Specifically and with High Affinity Reacting\n  Peptides", "comments": "18 pages including 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: A partially random target selection method was developed to\ndesign and produce affinity reagents (target) to any protein query. It is based\non the recent concept of Proteomic Code (for review see Biro, 2007 [1]) which\nsuggests that significant number of amino acids in specifically interacting\nproteins are coded by partially complementary codons. It means that the 1st and\n3rd residues of codons coding many co-locating amino acids are complementary\nbut the 2nd may but not necessarily complementary: like 5'-AXG-3'/3'-CXT-5'\ncodon pair, where X is any nucleotide.\n  Results: A mixture of 45 residue long, reverse, partially complementary\noligonucleotide sequences (target pool) were synthesized to selected epitopes\nof query mRNA sequences. The 2nd codon residues were randomized. The target\noligonucleotide pool was inserted into vectors, expressed and the protein\nproducts were screened for affinity to the query in Bacterial Two-Hybrid\nSystem. The best clones were used for larger-scale protein syntheses and\ncharacterization. It was possible to design and produce specific and with high\naffinity reacting (Kd:100 nM) oligopeptide reagents to GAL4 query\noligopeptides.\n  Conclusions: Second codon residue randomization is a promising method to\ndesign and produce affinity peptides to any protein sequences. The method has\nthe potential to be a rapid, inexpensive, high throughput, non-immunoglobulin\nbased alternative to recent in vivo antibody generating procedures.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jul 2008 23:05:53 GMT"}], "update_date": "2008-07-22", "authors_parsed": [["Biro", "Jan C", ""]]}, {"id": "0807.3185", "submitter": "Anirban Banerjee", "authors": "Anirban Banerjee", "title": "Structural distance and evolutionary relationship of networks", "comments": "16 pages, 6 figures, 1 table", "journal-ref": "BioSystems, 107(3), 186-196, (2012)", "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech physics.data-an q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary mechanism in a self-organized system cause some functional\nchanges that force to adapt new conformation of the interaction pattern between\nthe components of that system. Measuring the structural differences one can\nretrace the evolutionary relation between two systems. We present a method to\nquantify the topological distance between two networks of different sizes,\nfinding that the architectures of the networks are more similar within the same\nclass than the outside of their class. With 43 cellular networks of different\nspecies, we show that the evolutionary relationship can be elucidated from the\nstructural distances.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jul 2008 20:55:18 GMT"}, {"version": "v2", "created": "Wed, 2 Dec 2009 17:42:21 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Banerjee", "Anirban", ""]]}, {"id": "0807.3300", "submitter": "Jan Biro Dr", "authors": "Jan C. Biro", "title": "Correlation between nucleotide composition and folding energy of coding\n  sequences with special attention to wobble bases", "comments": "14 pages including 6 figures and 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: The secondary structure and complexity of mRNA influences its\naccessibility to regulatory molecules (proteins, micro-RNAs), its stability and\nits level of expression. The mobile elements of the RNA sequence, the wobble\nbases, are expected to regulate the formation of structures encompassing coding\nsequences.\n  Results: The sequence/folding energy (FE) relationship was studied by\nstatistical, bioinformatic methods in 90 CDS containing 26,370 codons. I found\nthat the FE (dG) associated with coding sequences is significant and negative\n(407 kcal/1000 bases, mean +/- S.E.M.) indicating that these sequences are able\nto form structures. However, the FE has only a small free component, less than\n10% of the total. The contribution of the 1st and 3rd codon bases to the FE is\nlarger than the contribution of the 2nd (central) bases. It is possible to\nachieve a ~ 4-fold change in FE by altering the wobble bases in synonymous\ncodons. The sequence/FE relationship can be described with a simple algorithm,\nand the total FE can be predicted solely from the sequence composition of the\nnucleic acid. The contributions of different synonymous codons to the FE are\nadditive and one codon cannot replace another. The accumulated contributions of\nsynonymous codons of an amino acid to the total folding energy of an mRNA is\nstrongly correlated to the relative amount of that amino acid in the translated\nprotein.\n  Conclusion: Synonymous codons are not interchangable with regard to their\nrole in determining the mRNA FE and the relative amounts of amino acids in the\ntranslated protein, even if they are indistinguishable in respect of amino acid\ncoding.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jul 2008 16:27:46 GMT"}], "update_date": "2008-07-22", "authors_parsed": [["Biro", "Jan C.", ""]]}, {"id": "0807.3350", "submitter": "Bradly  Alicea", "authors": "Bradly Alicea", "title": "Evaluating Intraspecific Variation and Interspecific Diversity:\n  comparing humans and fish species", "comments": "Masters thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The analysis of eight molecular datasets involving human and teleost examples\nalong with morphological samples from several groups of Neotropical electric\nfish (Order: Gymnotiformes) were used in this thesis to test the dynamics of\nboth intraspecific variation and interspecific diversity. In terms of\ninvestigating molecular interspecific diversity among humans, two experimental\nexercises were performed. A cladistic exchange experiment tested for the extent\nof discontinuity and interbreeding between H. sapiens and neanderthal\npopulations. As part of the same question, another experimental exercise tested\nthe amount of molecular variance resulting from simulations which treated\nneanderthals as being either a local population of modern humans or as a\ndistinct subspecies. Finally, comparisons of hominid populations over time with\nfish species helped to define what constitutes taxonomically relevant\ndifferences between morphological populations as expressed among both trait\nsize ranges and through growth patterns that begin during ontogeny. Compared to\nthe subdivision found within selected teleost species, H. sapiens molecular\ndata exhibited little variation and discontinuity between geographical regions.\nResults of the two experimental exercises concluded that neanderthals exhibit\ntaxonomic distance from modern H. sapiens. However, this distance was not so\ngreat as to exclude the possibility of interbreeding between the two\nsubspecific groups. Finally, a series of characters were analyzed among species\nof Neotropical electric fish. These analyses were compared with hominid\nexamples to determine what constituted taxonomically relevant differences\nbetween populations as expressed among specific morphometric traits that\ndevelop during the juvenile phase.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jul 2008 01:29:45 GMT"}, {"version": "v2", "created": "Thu, 28 Nov 2013 07:45:08 GMT"}], "update_date": "2013-12-02", "authors_parsed": [["Alicea", "Bradly", ""]]}, {"id": "0807.3387", "submitter": "Jeremy Sumner", "authors": "J. G. Sumner and M. A. Charleston", "title": "Phylogenetic estimation with partial likelihood tensors", "comments": "20 pages, 7 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.DS q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an alternative method for calculating likelihoods in molecular\nphylogenetics. Our method is based on partial likelihood tensors, which are\ngeneralizations of partial likelihood vectors, as used in Felsenstein's\napproach. Exploiting a lexicographic sorting and partial likelihood tensors, it\nis possible to obtain significant computational savings. We show this on a\nrange of simulated data by enumerating all numerical calculations that are\nrequired by our method and the standard approach.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jul 2008 04:24:11 GMT"}], "update_date": "2008-07-23", "authors_parsed": [["Sumner", "J. G.", ""], ["Charleston", "M. A.", ""]]}, {"id": "0807.3901", "submitter": "Jan Biro Dr", "authors": "Jan C Biro", "title": "Studies on the Origin and Evolution of Codon Bias", "comments": "24 pages including 10 figures and 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: There is a 3-fold redundancy in the Genetic Code; most amino\nacids are encoded by more than one codon. These synonymous codons are not used\nequally; there is a Codon Usage Bias (CUB). This article will provide novel\ninformation about the origin and evolution of this bias.\n  Results: Codon Usage Bias (CUB, defined here as deviation from equal usage of\nsynonymous codons) was studied in 113 species. The average CUB was 29.3 +/-\n1.1% (S.E.M, n=113) of the theoretical maximum and declined progressively with\nevolution and increasing genome complexity. A Pan-Genomic Codon Usage Frequency\n(CUF) Table was constructed to describe genome-wide relationships among codons.\nSignificant correlations were found between the number of synonymous codons and\n(i) the frequency of the respective amino acids (ii) the size of CUB. Numerous,\nstatistically highly significant, internal correlations were found among codons\nand the nucleic acids they comprise. These strong correlations made it possible\nto predict missing synonymous codons (wobble bases) reliably from the remaining\ncodons or codon residues.\n  Conclusions: The results put the concept of \"codon bias\" into a novel\nperspective. The internal connectivity of codons indicates that all synonymous\ncodons might be integrated parts of the Genetic Code with equal importance in\nmaintaining its functional integrity.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jul 2008 14:46:32 GMT"}], "update_date": "2008-07-25", "authors_parsed": [["Biro", "Jan C", ""]]}, {"id": "0807.4014", "submitter": "Vladimir Ivancevic", "authors": "Vladimir G. Ivancevic and Tijana T. Ivancevic", "title": "Geometrical Bioelectrodynamics", "comments": "38 pages, 7 figures, Latex", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes rigorous geometrical treatment of bioelectrodynamics,\nunderpinning two fast-growing biomedical research fields: bioelectromagnetism,\nwhich deals with the ability of life to produce its own electromagnetism, and\nbioelectromagnetics, which deals with the effect on life from external\nelectromagnetism.\n  Keywords: Bioelectrodynamics, exterior geometrical machinery, Dirac-Feynman\nquantum electrodynamics, functional electrical stimulation\n", "versions": [{"version": "v1", "created": "Fri, 25 Jul 2008 07:47:45 GMT"}, {"version": "v2", "created": "Mon, 28 Jul 2008 01:55:12 GMT"}, {"version": "v3", "created": "Fri, 26 Sep 2008 02:55:25 GMT"}], "update_date": "2008-09-26", "authors_parsed": [["Ivancevic", "Vladimir G.", ""], ["Ivancevic", "Tijana T.", ""]]}, {"id": "0807.4042", "submitter": "Emilio Hernandez-Garcia", "authors": "E. Alejandro Herrada (1), Claudio J. Tessone (2), Konstantin Klemm\n  (3), Victor M. Eguiluz (1), Emilio Hernandez-Garcia (1), Carlos M. Duarte (4)\n  ((1)IFISC, Mallorca, Spain; (2)ETH Zurich, Switzerland; (3)Bioinformatics\n  Leipzig, Germany; (4)IMEDEA, Mallorca, Spain)", "title": "Universal scaling in the branching of the Tree of Life", "comments": "6 pages + 19 of Supporting Information", "journal-ref": "PLoS ONE 3, e2757 (2008)", "doi": "10.1371/journal.pone.0002757", "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Understanding the patterns and processes of diversification of life in the\nplanet is a key challenge of science. The Tree of Life represents such\ndiversification processes through the evolutionary relationships among the\ndifferent taxa, and can be extended down to intra-specific relationships. Here\nwe examine the topological properties of a large set of interspecific and\nintraspecific phylogenies and show that the branching patterns follow\nallometric rules conserved across the different levels in the Tree of Life, all\nsignificantly departing from those expected from the standard null models. The\nfinding of non-random universal patterns of phylogenetic differentiation\nsuggests that similar evolutionary forces drive diversification across the\nbroad range of scales, from macro-evolutionary to micro-evolutionary processes,\nshaping the diversity of life on the planet.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jul 2008 09:49:07 GMT"}], "update_date": "2011-06-16", "authors_parsed": [["Herrada", "E. Alejandro", ""], ["Tessone", "Claudio J.", ""], ["Klemm", "Konstantin", ""], ["Eguiluz", "Victor M.", ""], ["Hernandez-Garcia", "Emilio", ""], ["Duarte", "Carlos M.", ""]]}, {"id": "0807.4272", "submitter": "Tijana Ivancevic", "authors": "Tijana T. Ivancevic, Murk J. Bottema and Lakhmi C. Jain", "title": "A Theoretical Model of Chaotic Attractor in Tumor Growth and Metastasis", "comments": "17 pages, 7 figures, Latex", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a novel chaotic reaction-diffusion model of cellular\ntumor growth and metastasis. The model is based on the multiscale diffusion\ncancer-invasion model (MDCM) and formulated by introducing strong nonlinear\ncoupling into the MDCM. The new model exhibits temporal chaotic behavior (which\nresembles the classical Lorenz strange attractor) and yet retains all the\ncharacteristics of the MDCM diffusion model. It mathematically describes both\nthe processes of carcinogenesis and metastasis, as well as the sensitive\ndependence of cancer evolution on initial conditions and parameters. On the\nbasis of this chaotic tumor-growth model, a generic concept of carcinogenesis\nand metastasis is formulated.\n  Keywords: reaction-diffusion tumor growth model, chaotic attractor, sensitive\ndependence on initial tumor characteristics\n", "versions": [{"version": "v1", "created": "Sun, 27 Jul 2008 04:54:40 GMT"}], "update_date": "2008-07-29", "authors_parsed": [["Ivancevic", "Tijana T.", ""], ["Bottema", "Murk J.", ""], ["Jain", "Lakhmi C.", ""]]}, {"id": "0807.4279", "submitter": "Tijana Ivancevic", "authors": "Tijana T. Ivancevic, Lakhmi C. Jain, John Pattison and Alex Hariz", "title": "Preterm Birth Analysis Using Nonlinear Methods (a preliminary study)", "comments": "21 pages, 5 figures, Latex", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this report we review modern nonlinearity methods that can be used in the\npreterm birth analysis. The nonlinear analysis of uterine contraction signals\ncan provide information regarding physiological changes during the menstrual\ncycle and pregnancy. This information can be used both for the preterm birth\nprediction and the preterm labor control.\n  Keywords: preterm birth, complex data analysis, nonlinear methods\n", "versions": [{"version": "v1", "created": "Sun, 27 Jul 2008 07:43:14 GMT"}], "update_date": "2008-07-29", "authors_parsed": [["Ivancevic", "Tijana T.", ""], ["Jain", "Lakhmi C.", ""], ["Pattison", "John", ""], ["Hariz", "Alex", ""]]}, {"id": "0807.4729", "submitter": "Adrian Melott", "authors": "Adrian L. Melott (University of Kansas)", "title": "Long-term cycles in the history of life: Periodic biodiversity in the\n  Paleobiology Database", "comments": "Published in PLoS ONE. 5 pages, 3 figures. Version with live links,\n  discussion available at\n  http://www.plosone.org/article/info:doi/10.1371/journal.pone.0004044#top", "journal-ref": "PLoS ONE 3(12): e4044. (2008)", "doi": "10.1371/journal.pone.0004044", "report-no": null, "categories": "q-bio.PE astro-ph physics.bio-ph physics.data-an physics.geo-ph q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Time series analysis of fossil biodiversity of marine invertebrates in the\nPaleobiology Database (PBDB) shows a significant periodicity at approximately\n63 My, in agreement with previous analyses based on the Sepkoski database. I\ndiscuss how this result did not appear in a previous analysis of the PBDB. The\nexistence of the 63 My periodicity, despite very different treatment of\nsystematic error in both PBDB and Sepkoski databases strongly argues for\nconsideration of its reality in the fossil record. Cross-spectral analysis of\nthe two datasets finds that a 62 My periodicity coincides in phase by 1.6 My,\nequivalent to better than the errors in either measurement. Consequently, the\ntwo data sets not only contain the same strong periodicity, but its peaks and\nvalleys closely correspond in time. Two other spectral peaks appear in the PBDB\nanalysis, but appear to be artifacts associated with detrending and with the\nincreased interval length. Sampling-standardization procedures implemented by\nthe PBDB collaboration suggest that the signal is not an artifact of sampling\nbias. Further work should focus on finding the cause of the 62 My periodicity.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jul 2008 20:01:51 GMT"}, {"version": "v2", "created": "Fri, 1 Aug 2008 14:23:30 GMT"}, {"version": "v3", "created": "Fri, 26 Sep 2008 19:56:34 GMT"}, {"version": "v4", "created": "Tue, 25 Nov 2008 13:36:31 GMT"}, {"version": "v5", "created": "Sat, 13 Dec 2008 23:51:16 GMT"}, {"version": "v6", "created": "Wed, 24 Dec 2008 14:59:10 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Melott", "Adrian L.", "", "University of Kansas"]]}, {"id": "0807.5031", "submitter": "Hiizu Nakanishi", "authors": "Hiizu Nakanishi, Namiko Mitarai, and Kim Sneppen", "title": "Dynamical Analysis on Gene Activity in the Presence of Repressors and an\n  Interfering Promoter", "comments": "supplement is attached", "journal-ref": null, "doi": "10.1529/biophysj.108.132894", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transcription is regulated through interplay between transcription factors,\nan RNA polymerase(RNAP), and a promoter. Even for a simple repressive\ntranscription factor that disturbs promoter activity at the initial binding of\nRNAP, its repression level is not determined solely by the dissociation\nconstant of transcription factor but is sensitive to the time scales of\nprocesses in RNAP. We first analyse the promoter activity under strong\nrepression by a slow binding repressor, in which case transcriptions occur in a\nburst, followed by a long quiescent period while a repressor binds to the\noperator; the number of transcriptions, the bursting and the quiescent times\nare estimated by reaction rates. We then examine interference effect from an\nopposing promoter, using the correlation function of transcription initiations\nfor a single promoter. The interference is shown to de-repress the promoter\nbecause RNAP's from the opposing promoter most likely encounter the repressor\nand remove it in case of strong repression. This de-repression mechanism should\nbe especially prominent for the promoters that facilitate fast formation of\nopen complex with the repressor whose binding rate is slower than about 1/sec.\nFinally, we discuss possibility of this mechanism for high activity of promoter\nPR in the hyp-mutant of lambda phage.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jul 2008 10:55:36 GMT"}, {"version": "v2", "created": "Mon, 4 Aug 2008 02:29:29 GMT"}, {"version": "v3", "created": "Sun, 10 Aug 2008 12:05:38 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Nakanishi", "Hiizu", ""], ["Mitarai", "Namiko", ""], ["Sneppen", "Kim", ""]]}]