[{"id": "0912.0041", "submitter": "Mike Steel Prof.", "authors": "Mike Steel", "title": "Can we avoid 'SIN' in the house of 'No Common Mechanism'?", "comments": "33 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 'no common mechanism' (NCM) models of character evolution, each character\ncan evolve on a phylogenetic tree under a partially or totally separate process\n(e.g. with its own branch lengths).\n  In such cases, the usual conditions that suffice to establish the statistical\nconsistency of tree reconstruction by methods such as maximum likelihood (ML)\nbreak down, suggesting that such methods may be prone to statistical\ninconsistency (SIN). In this paper we ask whether we can avoid SIN for tree\ntopology reconstruction when adopting such models, either by using ML or any\nother method that could be devised. We prove that it is possible to avoid SIN\nfor certain NCM models, but not for others, and the results depend delicately\non the tree reconstruction method employed. We also describe the biological\nrelevance of some recent mathematical results for the more usual 'common\nmechanism' setting. Our results are not intended to justify NCM, rather to set\nin place a framework within which such questions can be formally addressed.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2009 23:58:38 GMT"}], "update_date": "2009-12-02", "authors_parsed": [["Steel", "Mike", ""]]}, {"id": "0912.0157", "submitter": "Mauro Mobilia", "authors": "Mauro Mobilia and Michael Assaf", "title": "Fixation in Evolutionary Games under Non-Vanishing Selection", "comments": "4 figures, to appear in EPL (Europhysics Letters)", "journal-ref": "EPL Vol. 91, 10002 (2010)", "doi": "10.1209/0295-5075/91/10002", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.AO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most striking effect of fluctuations in evolutionary game theory\nis the possibility for mutants to fixate (take over) an entire population.\nHere, we generalize a recent WKB-based theory to study fixation in evolutionary\ngames under non-vanishing selection, and investigate the relation between\nselection intensity w and demographic (random) fluctuations. This allows the\naccurate treatment of large fluctuations and yields the probability and mean\ntimes of fixation beyond the weak selection limit. The power of the theory is\ndemonstrated on prototypical models of cooperation dilemmas with multiple\nabsorbing states. Our predictions compare excellently with numerical\nsimulations and, for finite w, significantly improve over those of the\nFokker-Planck approximation.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2009 13:55:05 GMT"}, {"version": "v2", "created": "Thu, 4 Feb 2010 18:47:15 GMT"}, {"version": "v3", "created": "Mon, 21 Jun 2010 19:16:29 GMT"}], "update_date": "2010-08-27", "authors_parsed": [["Mobilia", "Mauro", ""], ["Assaf", "Michael", ""]]}, {"id": "0912.0750", "submitter": "Aran Nayebi", "authors": "Aran Nayebi", "title": "Fast matrix multiplication techniques based on the Adleman-Lipton model", "comments": "To appear in the International Journal of Computer Engineering\n  Research. Minor changes made to make the preprint as similar as possible to\n  the published version", "journal-ref": "International Journal of Computer Engineering Research,\n  3(1):10-19, January 2012", "doi": "10.5897/IJCER10.016", "report-no": null, "categories": "q-bio.QM cs.DS cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On distributed memory electronic computers, the implementation and\nassociation of fast parallel matrix multiplication algorithms has yielded\nastounding results and insights. In this discourse, we use the tools of\nmolecular biology to demonstrate the theoretical encoding of Strassen's fast\nmatrix multiplication algorithm with DNA based on an $n$-moduli set in the\nresidue number system, thereby demonstrating the viability of computational\nmathematics with DNA. As a result, a general scalable implementation of this\nmodel in the DNA computing paradigm is presented and can be generalized to the\napplication of \\emph{all} fast matrix multiplication algorithms on a DNA\ncomputer. We also discuss the practical capabilities and issues of this\nscalable implementation. Fast methods of matrix computations with DNA are\nimportant because they also allow for the efficient implementation of other\nalgorithms (i.e. inversion, computing determinants, and graph theory) with DNA.\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2009 23:04:18 GMT"}, {"version": "v2", "created": "Sun, 5 Sep 2010 16:43:23 GMT"}, {"version": "v3", "created": "Wed, 16 Feb 2011 15:44:55 GMT"}, {"version": "v4", "created": "Sat, 28 May 2011 16:25:32 GMT"}, {"version": "v5", "created": "Mon, 19 Dec 2011 04:17:30 GMT"}], "update_date": "2012-02-10", "authors_parsed": [["Nayebi", "Aran", ""]]}, {"id": "0912.1277", "submitter": "Kyung Myriam Kroll", "authors": "K. Myriam Kroll, Gerard T. Barkema, Enrico Carlon", "title": "Linear model for fast background subtraction in oligonucleotide\n  microarrays", "comments": "21 pages, 5 figures", "journal-ref": "Algorithms for Molecular Biology 2009, 4:15", "doi": "10.1186/1748-7188-4-15", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One important preprocessing step in the analysis of microarray data is\nbackground subtraction. In high-density oligonucleotide arrays this is\nrecognized as a crucial step for the global performance of the data analysis\nfrom raw intensities to expression values.\n  We propose here an algorithm for background estimation based on a model in\nwhich the cost function is quadratic in a set of fitting parameters such that\nminimization can be performed through linear algebra. The model incorporates\ntwo effects: 1) Correlated intensities between neighboring features in the chip\nand 2) sequence-dependent affinities for non-specific hybridization fitted by\nan extended nearest-neighbor model.\n  The algorithm has been tested on 360 GeneChips from publicly available data\nof recent expression experiments. The algorithm is fast and accurate. Strong\ncorrelations between the fitted values for different experiments as well as\nbetween the free-energy parameters and their counterparts in aqueous solution\nindicate that the model captures a significant part of the underlying physical\nchemistry.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2009 15:53:13 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Kroll", "K. Myriam", ""], ["Barkema", "Gerard T.", ""], ["Carlon", "Enrico", ""]]}, {"id": "0912.1387", "submitter": "Jan Hoh", "authors": "William F. Heinz, Jeffrey L. Werbin, Eaton Lattman, Jan H. Hoh", "title": "Computing spatial information from Fourier coefficient distributions", "comments": "23 Pages, 11 Figures (whereof 4 pages and 4 figures in Auxiliary\n  Material)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an approach to computing spatial information based on Fourier\ncoefficient distributions. The Fourier transform (FT) of an image contains a\ncomplete description of the image, and the values of the FT coefficients are\nuniquely associated with that image. For an image where the distribution of\npixels is uncorrelated, the FT coefficients are normally distributed and\nuncorrelated. Further, the probability distribution for the FT coefficients of\nsuch an image can readily be obtained by Parseval's theorem. We take advantage\nof these properties to compute the spatial information in an image by\ndetermining the probability of each coefficient (both real and imaginary parts)\nin the FT, then using the Shannon formalism to calculate information. By using\nthe probability distribution obtained from Parseval's theorem, an effective\ndistance from the completely uncorrelated or most uncertain case is obtained.\nThe resulting quantity is an information computed in k-space (kSI). This\napproach provides a robust, facile and highly flexible framework for\nquantifying spatial information in images and other types of data (of arbitrary\ndimensions). The kSI metric is tested on a 2D Ising ferromagnet, and the\ntemperature-dependent phase transition is accurately determined from the\nspatial information in configurations of the system.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2009 02:06:31 GMT"}], "update_date": "2009-12-09", "authors_parsed": [["Heinz", "William F.", ""], ["Werbin", "Jeffrey L.", ""], ["Lattman", "Eaton", ""], ["Hoh", "Jan H.", ""]]}, {"id": "0912.1637", "submitter": "Joshua Vogelstein", "authors": "Joshua T. Vogelstein, Adam M. Packer, Tim A. Machado, Tanya Sippy,\n  Baktash Babadi, Rafael Yuste, Liam Paninski", "title": "Fast non-negative deconvolution for spike train inference from\n  population calcium imaging", "comments": "22 pages, 10 figures", "journal-ref": null, "doi": "10.1152/jn.01073.2009", "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Calcium imaging for observing spiking activity from large populations of\nneurons are quickly gaining popularity. While the raw data are fluorescence\nmovies, the underlying spike trains are of interest. This work presents a fast\nnon-negative deconvolution filter to infer the approximately most likely spike\ntrain for each neuron, given the fluorescence observations. This algorithm\noutperforms optimal linear deconvolution (Wiener filtering) on both simulated\nand biological data. The performance gains come from restricting the inferred\nspike trains to be positive (using an interior-point method), unlike the Wiener\nfilter. The algorithm is fast enough that even when imaging over 100 neurons,\ninference can be performed on the set of all observed traces faster than\nreal-time. Performing optimal spatial filtering on the images further refines\nthe estimates. Importantly, all the parameters required to perform the\ninference can be estimated using only the fluorescence data, obviating the need\nto perform joint electrophysiological and imaging calibration experiments.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2009 19:19:19 GMT"}], "update_date": "2011-02-21", "authors_parsed": [["Vogelstein", "Joshua T.", ""], ["Packer", "Adam M.", ""], ["Machado", "Tim A.", ""], ["Sippy", "Tanya", ""], ["Babadi", "Baktash", ""], ["Yuste", "Rafael", ""], ["Paninski", "Liam", ""]]}, {"id": "0912.2089", "submitter": "Franziska Hinkelmann", "authors": "Franziska Hinkelmann and Reinhard Laubenbacher", "title": "Boolean Models of Bistable Biological Systems", "comments": null, "journal-ref": null, "doi": "10.3934/dcdss.2011.4.1443", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents an algorithm for approximating certain types of dynamical\nsystems given by a system of ordinary delay differential equations by a Boolean\nnetwork model. Often Boolean models are much simpler to understand than complex\ndifferential equations models. The motivation for this work comes from\nmathematical systems biology. While Boolean mechanisms do not provide\ninformation about exact concentration rates or time scales, they are often\nsufficient to capture steady states and other key dynamics. Due to their\nintuitive nature, such models are very appealing to researchers in the life\nsciences. This paper is focused on dynamical systems that exhibit bistability\nand are desc ribedby delay equations. It is shown that if a certain motif\nincluding a feedback loop is present in the wiring diagram of the system, the\nBoolean model captures the bistability of molecular switches. The method is\nappl ied to two examples from biology, the lac operon and the phage lambda\nlysis/lysogeny switch.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2009 20:31:14 GMT"}], "update_date": "2011-05-10", "authors_parsed": [["Hinkelmann", "Franziska", ""], ["Laubenbacher", "Reinhard", ""]]}, {"id": "0912.2288", "submitter": "Hugo Gabriel Eyherabide", "authors": "Hugo Gabriel Eyherabide, Ines Samengo", "title": "The information transmitted by spike patterns in single neurons", "comments": "To be published in Journal of Physiology Paris 2009", "journal-ref": null, "doi": "10.1016/j.jphysparis.2009.11.018", "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spike patterns have been reported to encode sensory information in several\nbrain areas. Here we assess the role of specific patterns in the neural code,\nby comparing the amount of information transmitted with different choices of\nthe readout neural alphabet. This allows us to rank several alternative\nalphabets depending on the amount of information that can be extracted from\nthem. One can thereby identify the specific patterns that constitute the most\nprominent ingredients of the code. We finally discuss the interplay of\ncategorical and temporal information in the amount of synergy or redundancy in\nthe neural code.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 17:29:02 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Eyherabide", "Hugo Gabriel", ""], ["Samengo", "Ines", ""]]}, {"id": "0912.2551", "submitter": "EPTCS", "authors": "Paolo Ballarini (CoSBi), Michele Forlin (CoSBi), Tommaso Mazza\n  (CoSBi), Davide Prandi (CoSBi)", "title": "Efficient Parallel Statistical Model Checking of Biochemical Networks", "comments": null, "journal-ref": "EPTCS 14, 2009, pp. 47-61", "doi": "10.4204/EPTCS.14.4", "report-no": null, "categories": "cs.CE cs.DC cs.LO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of verifying stochastic models of biochemical\nnetworks against behavioral properties expressed in temporal logic terms. Exact\nprobabilistic verification approaches such as, for example, CSL/PCTL model\nchecking, are undermined by a huge computational demand which rule them out for\nmost real case studies. Less demanding approaches, such as statistical model\nchecking, estimate the likelihood that a property is satisfied by sampling\nexecutions out of the stochastic model. We propose a methodology for\nefficiently estimating the likelihood that a LTL property P holds of a\nstochastic model of a biochemical network. As with other statistical\nverification techniques, the methodology we propose uses a stochastic\nsimulation algorithm for generating execution samples, however there are three\nkey aspects that improve the efficiency: first, the sample generation is driven\nby on-the-fly verification of P which results in optimal overall simulation\ntime. Second, the confidence interval estimation for the probability of P to\nhold is based on an efficient variant of the Wilson method which ensures a\nfaster convergence. Third, the whole methodology is designed according to a\nparallel fashion and a prototype software tool has been implemented that\nperforms the sampling/verification process in parallel over an HPC\narchitecture.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2009 23:33:01 GMT"}], "update_date": "2009-12-15", "authors_parsed": [["Ballarini", "Paolo", "", "CoSBi"], ["Forlin", "Michele", "", "CoSBi"], ["Mazza", "Tommaso", "", "CoSBi"], ["Prandi", "Davide", "", "CoSBi"]]}, {"id": "0912.2577", "submitter": "Sebastian Roch", "authors": "Alexandr Andoni and Constantinos Daskalakis and Avinatan Hassidim and\n  Sebastien Roch", "title": "Global Alignment of Molecular Sequences via Ancestral State\n  Reconstruction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.DS math.ST q-bio.PE q-bio.QM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular phylogenetic techniques do not generally account for such common\nevolutionary events as site insertions and deletions (known as indels). Instead\ntree building algorithms and ancestral state inference procedures typically\nrely on substitution-only models of sequence evolution. In practice these\nmethods are extended beyond this simplified setting with the use of heuristics\nthat produce global alignments of the input sequences--an important problem\nwhich has no rigorous model-based solution. In this paper we consider a new\nversion of the multiple sequence alignment in the context of stochastic indel\nmodels. More precisely, we introduce the following {\\em trace reconstruction\nproblem on a tree} (TRPT): a binary sequence is broadcast through a tree\nchannel where we allow substitutions, deletions, and insertions; we seek to\nreconstruct the original sequence from the sequences received at the leaves of\nthe tree. We give a recursive procedure for this problem with strong\nreconstruction guarantees at low mutation rates, providing also an alignment of\nthe sequences at the leaves of the tree. The TRPT problem without indels has\nbeen studied in previous work (Mossel 2004, Daskalakis et al. 2006) as a\nbootstrapping step towards obtaining optimal phylogenetic reconstruction\nmethods. The present work sets up a framework for extending these works to\nevolutionary models with indels.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2009 05:37:42 GMT"}], "update_date": "2011-09-07", "authors_parsed": [["Andoni", "Alexandr", ""], ["Daskalakis", "Constantinos", ""], ["Hassidim", "Avinatan", ""], ["Roch", "Sebastien", ""]]}, {"id": "0912.2717", "submitter": "Carlos Escudero", "authors": "Carlos Escudero", "title": "Some open questions concerning biological growth", "comments": "Invited article in \"The Mathematics of Darwin\", special issue of\n  Arbor (CSIC Press)", "journal-ref": "Invited chapter in the special volume ''The Mathematics of\n  Darwin'' of Arbor (CSIC Press), edited by Manuel de Leon Rodriguez and Juan\n  Jose Lopez Velazquez; Arbor Vol. 186, No. 746 (2010)", "doi": null, "report-no": null, "categories": "cond-mat.stat-mech math-ph math.MP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We briefly review the properties of radially growing interfaces and their\nconnection to biological growth. We focus on simplified models which result\nfrom the abstraction of only considering domain growth and not the interface\ncurvature. Linear equations can be exactly solved and the phenomenology of\ngrowth can be inferred from the explicit solutions. Nonlinear equations pose\ninteresting open questions that are summarized herein.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2009 19:54:18 GMT"}], "update_date": "2011-10-04", "authors_parsed": [["Escudero", "Carlos", ""]]}, {"id": "0912.2905", "submitter": "Jie Xu", "authors": "Jie Xu and Daniel Attinger", "title": "Drop on demand in a microfluidic chip", "comments": null, "journal-ref": "Xu, J. and D. Attinger, Drop on demand in a microfluidic chip.\n  Journal of Micromechanics and Microengineering, 2008. 18: p. 065020", "doi": "10.1088/0960-1317/18/6/065020", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we introduce the novel technique of in-chip drop on demand,\nwhich consists in dispensing picoliter to nanoliter drops on demand directly in\nthe liquid-filled channels of a polymer microfluidic chip, at frequencies up to\n2.5 kHz and with precise volume control. The technique involves a PDMS chip\nwith one or several microliter-size chambers driven by piezoelectric actuators.\nIndividual aqueous microdrops are dispensed from the chamber to a main\ntransport channel filled with an immiscible fluid, in a process analogous to\natmospheric drop on demand dispensing. In this article, the drop formation\nprocess is characterized with respect to critical dispense parameters such as\nthe shape and duration of the driving pulse, and the size of both the fluid\nchamber and the nozzle. Several features of the in-chip drop on demand\ntechnique with direct relevance to lab on a chip applications are presented and\ndiscussed, such as the precise control of the dispensed volume, the ability to\nmerge drops of different reagents and the ability to move a drop from the\nshooting area of one nozzle to another for multi-step reactions. The\npossibility to drive the microfluidic chip with inexpensive audio electronics\ninstead of research-grade equipment is also examined and verified. Finally, we\nshow that the same piezoelectric technique can be used to generate a single gas\nbubble on demand in a microfluidic chip.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2009 14:26:57 GMT"}], "update_date": "2009-12-16", "authors_parsed": [["Xu", "Jie", ""], ["Attinger", "Daniel", ""]]}, {"id": "0912.2955", "submitter": "Pan-Jun Kim", "authors": "Caroline B. Milne, Pan-Jun Kim, James A. Eddy, Nathan D. Price", "title": "Accomplishments in Genome-Scale In Silico Modeling for Industrial and\n  Medical Biotechnology", "comments": "Highlighted in \"In this issue\" section of Biotechnology Journal\n  12/2009", "journal-ref": "Biotechnol. J. 4, 1653 (2009)", "doi": "10.1002/biot.200900234", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Driven by advancements in high-throughput biological technologies and the\ngrowing number of sequenced genomes, the construction of in silico models at\nthe genome scale has provided powerful tools to investigate a vast array of\nbiological systems and applications. Here, we review comprehensively the uses\nof such models in industrial and medical biotechnology, including biofuel\ngeneration, food production, and drug development. While the use of in silico\nmodels is still in its early stages for delivering to industry, significant\ninitial successes have been achieved. For the cases presented here,\ngenome-scale models predict engineering strategies to enhance properties of\ninterest in an organism or to inhibit harmful mechanisms of pathogens. Going\nforward, genome-scale in silico models promise to extend their application and\nanalysis scope to become a transformative tool in biotechnology.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2009 17:13:55 GMT"}], "update_date": "2009-12-16", "authors_parsed": [["Milne", "Caroline B.", ""], ["Kim", "Pan-Jun", ""], ["Eddy", "James A.", ""], ["Price", "Nathan D.", ""]]}, {"id": "0912.3208", "submitter": "Ralph Stern", "authors": "Ralph Stern", "title": "The Risk Distribution Curve and its Derivatives", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risk stratification is most directly and informatively summarized as a risk\ndistribution curve. From this curve the ROC curve, predictiveness curve, and\nother curves depicting risk stratification can be derived, demonstrating that\nthey present similar information. A mathematical expression for the ROC curve\nAUC is derived which clarifies how this measure of discrimination quantifies\nthe overlap between patients who have and don't have events. This expression is\nused to define the positive correlation between the dispersion of the risk\ndistribution curve and the ROC curve AUC. As more disperse risk distributions\nand greater separation between patients with and without events characterize\nsuperior risk stratification, the ROC curve AUC provides useful information.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2009 17:28:08 GMT"}], "update_date": "2009-12-17", "authors_parsed": [["Stern", "Ralph", ""]]}, {"id": "0912.3426", "submitter": "Hugo Gabriel Eyherabide", "authors": "Hugo Gabriel Eyherabide, Ariel Rokem, Andreas V.M. Herz, Ines Samengo", "title": "Bursts generate a non-reducible spike pattern code", "comments": null, "journal-ref": "Frontiers in Neuroscience Vol. 3 Issue 1 2009", "doi": "10.3389/neuro.01.002.2009", "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  At the single-neuron level, precisely timed spikes can either constitute\nfiring-rate codes or spike-pattern codes that utilize the relative timing\nbetween consecutive spikes. There has been little experimental support for the\nhypothesis that such temporal patterns contribute substantially to information\ntransmission. By using grasshopper auditory receptors as a model system, we\nshow that correlations between spikes can be used to represent behaviorally\nrelevant stimuli. The correlations reflect the inner structure of the spike\ntrain: a succession of burst-like patterns. We demonstrate that bursts with\ndifferent spike counts encode different stimulus features, such that about 20%\nof the transmitted information corresponds to discriminating between different\nfeatures, and the remaining 80% is used to allocate these features in time. In\nthis spike-pattern code, the what and the when of the stimuli are encoded in\nthe duration of each burst and the time of burst onset, respectively. Given the\nubiquity of burst firing, we expect similar findings also for other neural\nsystems.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2009 15:08:58 GMT"}], "update_date": "2009-12-18", "authors_parsed": [["Eyherabide", "Hugo Gabriel", ""], ["Rokem", "Ariel", ""], ["Herz", "Andreas V. M.", ""], ["Samengo", "Ines", ""]]}, {"id": "0912.3461", "submitter": "Susan Khor", "authors": "Susan Khor", "title": "Application of Graph Coloring to Biological Networks", "comments": null, "journal-ref": "IET Syst. Biol. -- May 2010 -- Volume 4, Issue 3, p.185-192", "doi": "10.1049/iet-syb.2009.0038", "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the application of graph coloring to biological networks,\nspecifically protein-protein interaction (PPI) networks. First, we find that\ngiven similar conditions (i.e. number of nodes, number of links, degree\ndistribution and clustering), fewer colors are needed to color disassortative\n(high degree nodes tend to connect to low degree nodes and vice versa) than\nassortative networks. Fewer colors create fewer independent sets which in turn\nimply higher concurrency potential for a network. Since PPI networks tend to be\ndisassortative, we suggest that in addition to functional specificity and\nstability proposed previously by Maslov and Sneppen (Science 296, 2002), the\ndisassortative nature of PPI networks may promote the ability of cells to\nperform multiple, crucial and functionally diverse tasks concurrently. Second,\nsince graph coloring is closely related to the presence of cliques in a graph,\nthe significance of node coloring information to the problem of identifying\nprotein complexes, i.e. dense subgraphs in a PPI network, is investigated. We\nfind that for PPI networks where 1% to 11% of nodes participate in at least one\nidentified protein complex, such as H. sapien (DIP20070219, DIP20081014 and\nHPRD070609), DSATUR (a well-known complete graph coloring algorithm) node\ncoloring information can improve the quality (homogeneity and separation) of\ninitial candidate complexes. This finding may help to improve existing protein\ncomplex detection methods, and/or suggest new methods.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2009 17:01:13 GMT"}], "update_date": "2010-05-25", "authors_parsed": [["Khor", "Susan", ""]]}, {"id": "0912.3464", "submitter": "Sebastian Ahnert", "authors": "S. E. Ahnert, I. G. Johnston, T. M. A. Fink, J. P. K. Doye, and A. A.\n  Louis", "title": "Self-assembly, modularity and physical complexity", "comments": "9 pages, submitted for publication", "journal-ref": "Physical Review E 82, 026117 (2010)", "doi": "10.1103/PhysRevE.82.026117", "report-no": null, "categories": "cond-mat.stat-mech q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a quantitative measure of physical complexity, based on the amount\nof information required to build a given physical structure through\nself-assembly. Our procedure can be adapted to any given geometry, and thus to\nany given type of physical system. We illustrate our approach using\nself-assembling polyominoes, and demonstrate the breadth of its potential\napplications by quantifying the physical complexity of molecules and protein\ncomplexes. This measure is particularly well suited for the detection of\nsymmetry and modularity in the underlying structure, and allows for a\nquantitative definition of structural modularity. Furthermore we use our\napproach to show that symmetric and modular structures are favoured in\nbiological self-assembly, for example of protein complexes. Lastly, we also\nintroduce the notions of joint, mutual and conditional complexity, which\nprovide a useful distance measure between physical structures.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2009 17:03:42 GMT"}, {"version": "v2", "created": "Tue, 12 Jan 2010 12:05:28 GMT"}], "update_date": "2010-09-02", "authors_parsed": [["Ahnert", "S. E.", ""], ["Johnston", "I. G.", ""], ["Fink", "T. M. A.", ""], ["Doye", "J. P. K.", ""], ["Louis", "A. A.", ""]]}, {"id": "0912.3482", "submitter": "Luca Ciandrini", "authors": "L. Ciandrini, I. Stansfield, M. C. Romano", "title": "Role of the particle's stepping cycle in an asymmetric exclusion\n  process: A model of mRNA translation", "comments": "9 pages, 9 figures", "journal-ref": "Phys. Rev. E 81, 051904 (2010)", "doi": "10.1103/PhysRevE.81.051904", "report-no": null, "categories": "q-bio.SC cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Messenger RNA translation is often studied by means of statistical-mechanical\nmodels based on the Asymmetric Simple Exclusion Process (ASEP), which considers\nhopping particles (the ribosomes) on a lattice (the polynucleotide chain). In\nthis work we extend this class of models and consider the two fundamental steps\nof the ribosome's biochemical cycle following a coarse-grained perspective. In\norder to achieve a better understanding of the underlying biological processes\nand compare the theoretical predictions with experimental results, we provide a\ndescription lying between the minimal ASEP-like models and the more detailed\nmodels, which are analytically hard to treat. We use a mean-field approach to\nstudy the dynamics of particles associated with an internal stepping cycle. In\nthis framework it is possible to characterize analytically different phases of\nthe system (high density, low density or maximal current phase). Crucially, we\nshow that the transitions between these different phases occur at different\nparameter values than the equivalent transitions in a standard ASEP, indicating\nthe importance of including the two fundamental steps of the ribosome's\nbiochemical cycle into the model.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2009 18:34:32 GMT"}, {"version": "v2", "created": "Mon, 3 May 2010 20:56:51 GMT"}], "update_date": "2010-05-06", "authors_parsed": [["Ciandrini", "L.", ""], ["Stansfield", "I.", ""], ["Romano", "M. C.", ""]]}, {"id": "0912.3952", "submitter": "Ophir Flomenbom", "authors": "Ophir Flomenbom", "title": "Making it possible: constructing a reliable mechanism from a finite\n  trajectory", "comments": "To appear in: Advances in Chemical Physics (2010)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.soft", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deducing an underlying multi-substate on-off kinetic scheme (KS) from the\nstatistical properties of a two-state trajectory is the aim from many\nexperiments in biophysics and chemistry, such as, ion channel recordings,\nenzymatic activity and structural dynamics of bio-molecules. Doing so is almost\nalways impossible, as the mapping of a KS into a two-state trajectory leads to\nthe loss of information about the KS (almost always). Here, we present the\noptimal way to solve this problem. It is based on unique forms of reduced\ndimensions (RD). RD forms are on-off networks with connections only between\nsubstates of different states, where the connections can have multi-exponential\nwaiting time probability density functions (WT-PDFs). A RD form has the\nsimplest toplogy that can reproduce a given data. In theory, only a single RD\nform can be constructed from the full data (hence its uniqueness), still this\ntask is not easy when dealing with finite data. For doing so, a toolbox made of\nknown statistical methods in data analysis and new statistical methods and\nnumerical algorithms develped for this problem is presented. Our toolbox is\nself-contained: it builds a mechanism based only on the information it extracts\nfrom the data. The implementation of the toolbox on the data is fast. The\ntoolbox is automated and is available for academic research upon electronic\nrequest.\n", "versions": [{"version": "v1", "created": "Sun, 20 Dec 2009 01:37:54 GMT"}, {"version": "v2", "created": "Thu, 18 Feb 2010 10:54:54 GMT"}, {"version": "v3", "created": "Sat, 14 Aug 2010 21:06:05 GMT"}], "update_date": "2011-04-11", "authors_parsed": [["Flomenbom", "Ophir", ""]]}, {"id": "0912.3954", "submitter": "Denis Tolkunov", "authors": "Denis Tolkunov, Alexandre V. Morozov", "title": "Nucleosome positioning and energetics: Recent advances in genomic and\n  computational studies", "comments": "41 pages, 11 figures", "journal-ref": "Advances in Protein Chemistry and Structural Biology, Volume 79\n  (2010) Pages 1-57", "doi": null, "report-no": null, "categories": "q-bio.GN cond-mat.soft q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chromatin is a complex of DNA, RNA and proteins whose primary function is to\npackage genomic DNA into the tight confines of a cell nucleus. A fundamental\nrepeating unit of chromatin is the nucleosome, an octamer of histone proteins\naround which 147 base pairs of DNA are wound in almost two turns of a\nleft-handed superhelix. Chromatin is a dynamic structure which exerts profound\ninfluence on regulation of gene expression and other cellular functions. These\nchromatin-directed processes are facilitated by optimizing nucleosome positions\nthroughout the genome and by remodeling nucleosomes in response to various\nexternal and internal signals such as environmental perturbations. Here we\ndiscuss large-scale maps of nucleosome positions made available through recent\nadvances in parallel high-throughput sequencing and microarray technologies. We\nshow that these maps reveal common features of nucleosome organization in\neukaryotic genomes. We also survey computational models designed to predict\nnucleosome formation scores or energies, and demonstrate how these predictions\ncan be used to position multiple nucleosome on the genome without steric\noverlap.\n", "versions": [{"version": "v1", "created": "Sun, 20 Dec 2009 02:04:02 GMT"}], "update_date": "2012-06-21", "authors_parsed": [["Tolkunov", "Denis", ""], ["Morozov", "Alexandre V.", ""]]}, {"id": "0912.4060", "submitter": "Daniel Soudry", "authors": "Daniel Soudry, Ron Meir", "title": "History dependent dynamics in a generic model of ion channels - an\n  analytic study", "comments": "Several small modifications and corrections were made to last\n  version, due to reviewer comments. The only major change - we added two\n  further sub-sections in Methods (sections 4.1.4 and 4.3.3) and one section\n  (G) in the Supplementary Information.", "journal-ref": "Front.Comput.Neurosci.4:3.(2010)", "doi": "10.3389/fncom.2010.00003", "report-no": null, "categories": "q-bio.SC q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent experiments have demonstrated that the timescale of adaptation of\nsingle neurons and ion channel populations to stimuli slows down as the length\nof stimulation increases; in fact, no upper bound on temporal time-scales seems\nto exist in such systems. Furthermore, patch clamp experiments on single ion\nchannels have hinted at the existence of large, mostly unobservable,\ninactivation state spaces within a single ion channel. This raises the question\nof the relation between this multitude of inactivation states and the observed\nbehavior. In this work we propose a minimal model for ion channel dynamics\nwhich does not assume any specific structure of the inactivation state space.\nThe model is simple enough to render an analytical study possible. This leads\nto a clear and concise explanation of the experimentally observed exponential\nhistory-dependent relaxation in sodium channels in a voltage clamp setting, and\nshows that their recovery rate from slow inactivation must be voltage\ndependent. Furthermore, we predict that history-dependent relaxation cannot be\ncreated by overly sparse spiking activity. While the model was created with ion\nchannel populations in mind, its simplicity and genericalness render it a good\nstarting point for modeling similar effects in other systems, and for scaling\nup to higher levels such as single neurons which are also known to exhibit\nmultiple time scales.\n", "versions": [{"version": "v1", "created": "Sun, 20 Dec 2009 22:47:39 GMT"}, {"version": "v2", "created": "Wed, 28 Apr 2010 18:59:27 GMT"}], "update_date": "2010-04-29", "authors_parsed": [["Soudry", "Daniel", ""], ["Meir", "Ron", ""]]}, {"id": "0912.4710", "submitter": "Vladimir Privman", "authors": "Valber Pedrosa, Dmitriy Melnikov, Marcos Pita, Jan Halamek, Vladimir\n  Privman, Aleksandr Simonian, Evgeny Katz", "title": "Enzymatic Logic Gates with Noise-Reducing Sigmoid Response", "comments": "14 pages, 2 figures, PDF", "journal-ref": "International Journal of Unconventional Computing 6, 451-460\n  (2010)", "doi": null, "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biochemical computing is an emerging field of unconventional computing that\nattempts to process information with biomolecules and biological objects using\ndigital logic. In this work we survey filtering in general, in biochemical\ncomputing, and summarize the experimental realization of an AND logic gate with\nsigmoid response in one of the inputs. The logic gate is realized with\nelectrode-immobilized glucose-6-phosphate dehydrogenase enzyme that catalyzes a\nreaction corresponding to the Boolean AND functions. A kinetic model is also\ndeveloped and used to evaluate the extent to which the performance of the\nexperimentally realized logic gate is close to optimal.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2009 19:04:10 GMT"}, {"version": "v2", "created": "Sat, 9 Oct 2010 14:48:39 GMT"}], "update_date": "2011-02-15", "authors_parsed": [["Pedrosa", "Valber", ""], ["Melnikov", "Dmitriy", ""], ["Pita", "Marcos", ""], ["Halamek", "Jan", ""], ["Privman", "Vladimir", ""], ["Simonian", "Aleksandr", ""], ["Katz", "Evgeny", ""]]}, {"id": "0912.4760", "submitter": "Greg Stephens", "authors": "Greg J Stephens, Bethany Johnson-Kerner, William Bialek, William S Ryu", "title": "From modes to movement in the behavior of C. elegans", "comments": null, "journal-ref": "PLoS ONE 5(11): e13914 (2010)", "doi": "10.1371/journal.pone.0013914", "report-no": null, "categories": "q-bio.NC physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Organisms move through the world by changing their shape, and here we explore\nthe mapping from shape space to movements in the nematode C. elegans as it\ncrawls on a planar agar surface. We characterize the statistics of the\ntrajectories through the correlation functions of the orientation angular\nvelocity, orientation angle and the mean-squared displacement, and we find that\nthe loss of orientational memory has significant contributions from both\nabrupt, large amplitude turning events and the continuous dynamics between\nthese events. Further, we demonstrate long-time persistence of orientational\nmemory in the intervals between abrupt turns. Building on recent work\ndemonstrating that C. elegans movements are restricted to a low-dimensional\nshape space, we construct a map from the dynamics in this shape space to the\ntrajectory of the worm along the agar. We use this connection to illustrate\nthat changes in the continuous dynamics reveal subtle differences in movement\nstrategy that occur among mutants defective in two classes of dopamine\nreceptors.\n", "versions": [{"version": "v1", "created": "Thu, 24 Dec 2009 00:47:57 GMT"}], "update_date": "2016-01-05", "authors_parsed": [["Stephens", "Greg J", ""], ["Johnson-Kerner", "Bethany", ""], ["Bialek", "William", ""], ["Ryu", "William S", ""]]}, {"id": "0912.5175", "submitter": "William Bialek", "authors": "Thierry Mora, Aleksandra Walczak, William Bialek and Curtis G. Callan\n  Jr", "title": "Maximum entropy models for antibody diversity", "comments": null, "journal-ref": "PNAS 107(12) 5405-5410 (2010)", "doi": "10.1073/pnas.1001705107", "report-no": null, "categories": "q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recognition of pathogens relies on families of proteins showing great\ndiversity. Here we construct maximum entropy models of the sequence repertoire,\nbuilding on recent experiments that provide a nearly exhaustive sampling of the\nIgM sequences in zebrafish. These models are based solely on pairwise\ncorrelations between residue positions, but correctly capture the higher order\nstatistical properties of the repertoire. Exploiting the interpretation of\nthese models as statistical physics problems, we make several predictions for\nthe collective properties of the sequence ensemble: the distribution of\nsequences obeys Zipf's law, the repertoire decomposes into several clusters,\nand there is a massive restriction of diversity due to the correlations. These\npredictions are completely inconsistent with models in which amino acid\nsubstitutions are made independently at each site, and are in good agreement\nwith the data. Our results suggest that antibody diversity is not limited by\nthe sequences encoded in the genome, and may reflect rapid adaptation to\nantigenic challenges. This approach should be applicable to the study of the\nglobal properties of other protein families.\n", "versions": [{"version": "v1", "created": "Mon, 28 Dec 2009 14:42:08 GMT"}], "update_date": "2011-11-28", "authors_parsed": [["Mora", "Thierry", ""], ["Walczak", "Aleksandra", ""], ["Bialek", "William", ""], ["Callan", "Curtis G.", "Jr"]]}, {"id": "0912.5193", "submitter": "Ricardo Silva", "authors": "Ricardo Silva, Katherine Heller, Zoubin Ghahramani, Edoardo M. Airoldi", "title": "Ranking relations using analogies in biological and information networks", "comments": "Published in at http://dx.doi.org/10.1214/09-AOAS321 the Annals of\n  Applied Statistics (http://www.imstat.org/aoas/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Statistics 2010, Vol. 4, No. 2, 615-644", "doi": "10.1214/09-AOAS321", "report-no": "IMS-AOAS-AOAS321", "categories": "stat.ME cs.LG physics.soc-ph q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analogical reasoning depends fundamentally on the ability to learn and\ngeneralize about relations between objects. We develop an approach to\nrelational learning which, given a set of pairs of objects\n$\\mathbf{S}=\\{A^{(1)}:B^{(1)},A^{(2)}:B^{(2)},\\ldots,A^{(N)}:B ^{(N)}\\}$,\nmeasures how well other pairs A:B fit in with the set $\\mathbf{S}$. Our work\naddresses the following question: is the relation between objects A and B\nanalogous to those relations found in $\\mathbf{S}$? Such questions are\nparticularly relevant in information retrieval, where an investigator might\nwant to search for analogous pairs of objects that match the query set of\ninterest. There are many ways in which objects can be related, making the task\nof measuring analogies very challenging. Our approach combines a similarity\nmeasure on function spaces with Bayesian analysis to produce a ranking. It\nrequires data containing features of the objects of interest and a link matrix\nspecifying which relationships exist; no further attributes of such\nrelationships are necessary. We illustrate the potential of our method on text\nanalysis and information networks. An application on discovering functional\ninteractions between pairs of proteins is discussed in detail, where we show\nthat our approach can work in practice even if a small set of protein pairs is\nprovided.\n", "versions": [{"version": "v1", "created": "Mon, 28 Dec 2009 17:56:50 GMT"}, {"version": "v2", "created": "Mon, 8 Nov 2010 11:52:09 GMT"}, {"version": "v3", "created": "Thu, 29 Aug 2013 06:50:07 GMT"}], "update_date": "2013-08-30", "authors_parsed": [["Silva", "Ricardo", ""], ["Heller", "Katherine", ""], ["Ghahramani", "Zoubin", ""], ["Airoldi", "Edoardo M.", ""]]}, {"id": "0912.5232", "submitter": "William Bialek", "authors": "Greg J. Stephens, William S. Ryu and William Bialek", "title": "The emergence of stereotyped behaviors in C. elegans", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Animal behaviors are sometimes decomposable into discrete, stereotyped\nelements. In one model, such behaviors are triggered by specific commands; in\nthe extreme case, the discreteness of behavior is traced to the discreteness of\naction potentials in the individual command neurons. We use the crawling\nbehavior of the nematode C. elegans to explore the opposite extreme, in which\ndiscreteness and stereotypy emerges from the dynamics of the entire behavior. A\nsimple stochastic model for the worm's continuously changing body shape during\ncrawling has attractors corresponding to forward and backward motion;\nnoise-driven transitions between these attractors correspond to abrupt\nreversals. We show that, with no free parameters, this model generates\nreversals at a rate within error bars of that observed experimentally, and the\nrelatively stereotyped trajectories in the neighborhood of the reversal also\nare predicted correctly.\n", "versions": [{"version": "v1", "created": "Tue, 29 Dec 2009 01:19:45 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Stephens", "Greg J.", ""], ["Ryu", "William S.", ""], ["Bialek", "William", ""]]}, {"id": "0912.5315", "submitter": "Peter Waddell", "authors": "Peter J. Waddell and Timothy Herston", "title": "Expectation-Maximization (EM) Algorithms for Mapping Short Reads\n  Illustrated with FAIRE data and the TP53-WRAP53 Gene Region", "comments": "17 pages, 3 figures, 1 table all incorporated in one pdf", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Huge numbers of short reads are being generated for mapping back to the\ngenome to discover the frequency of transcripts, miRNAs, DNAase hypersensitive\nsites, FAIRE regions, nucleosome occupancy, etc. Since these reads are\ntypically short (e.g., 36 base pairs) and since many eukaryotic genomes,\nincluding humans, have highly repetitive sequences then many of these reads map\nto two or more locations in the genome. Current mapping of these reads, grading\nthem according to 0, 1 or 2 mismatches wastes a great deal of information.\nThese short sequences are typically mapped with no account of the accuracy of\nthe sequence, even in company software when per base error rates are being\nreported by another part of the machine. Further, multiply mapping locations\nare frequently discarded altogether or allocated with no regard to where other\nreads are accumulating. Here we show how to combine probabilistic mapping of\nreads with an EM algorithm to iteratively improve the empirical likelihood of\nthe allocation of short reads. Mapping using LAST takes into account the per\nbase accuracy of the read, plus insertions and deletions, plus anticipated\noccasional errors or SNPs with respect to the parent genome. The probabilistic\nEM algorithm iteratively allocates reads based on the proportion of reads\nmapping within windows on the previous cycle, along with any prior information\non where the read best maps. The methods are illustrated with FAIRE ENCODE data\nlooking at the very important head-to-head gene combination of TP53 and WRAP\n53.\n", "versions": [{"version": "v1", "created": "Tue, 29 Dec 2009 15:27:24 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Waddell", "Peter J.", ""], ["Herston", "Timothy", ""]]}, {"id": "0912.5381", "submitter": "Duygu Balcan", "authors": "Berkin Malkoc, Duygu Balcan, Ayse Erzan", "title": "Information content based model for the topological properties of the\n  gene regulatory network of Escherichia coli", "comments": "58 pages, 3 tables, 22 figures. In press, Journal of Theoretical\n  Biology (2009).", "journal-ref": "Journal of Theoretical Biology 263 (2010) 281-294", "doi": "10.1016/j.jtbi.2009.11.017", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gene regulatory networks (GRN) are being studied with increasingly precise\nquantitative tools and can provide a testing ground for ideas regarding the\nemergence and evolution of complex biological networks. We analyze the global\nstatistical properties of the transcriptional regulatory network of the\nprokaryote Escherichia coli, identifying each operon with a node of the\nnetwork. We propose a null model for this network using the content-based\napproach applied earlier to the eukaryote Saccharomyces cerevisiae. (Balcan et\nal., 2007) Random sequences that represent promoter regions and binding\nsequences are associated with the nodes. The length distributions of these\nsequences are extracted from the relevant databases. The network is constructed\nby testing for the occurrence of binding sequences within the promoter regions.\nThe ensemble of emergent networks yields an exponentially decaying in-degree\ndistribution and a putative power law dependence for the out-degree\ndistribution with a flat tail, in agreement with the data. The clustering\ncoefficient, degree-degree correlation, rich club coefficient and k-core\nvisualization all agree qualitatively with the empirical network to an extent\nnot yet achieved by any other computational model, to our knowledge. The\nsignificant statistical differences can point the way to further research into\nnon-adaptive and adaptive processes in the evolution of the E. coli GRN.\n", "versions": [{"version": "v1", "created": "Tue, 29 Dec 2009 22:47:53 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Malkoc", "Berkin", ""], ["Balcan", "Duygu", ""], ["Erzan", "Ayse", ""]]}]