[{"id": "1011.0200", "submitter": "Max Alekseyev", "authors": "Max A. Alekseyev, Pavel A. Pevzner", "title": "Limited Lifespan of Fragile Regions in Mammalian Evolution", "comments": null, "journal-ref": "Lecture Notes in Computer Science 6398 (2010), pp. 198-215", "doi": "10.1007/978-3-642-16181-0_17", "report-no": null, "categories": "q-bio.GN q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important question in genome evolution is whether there exist fragile\nregions (rearrangement hotspots) where chromosomal rearrangements are happening\nover and over again. Although nearly all recent studies supported the existence\nof fragile regions in mammalian genomes, the most comprehensive phylogenomic\nstudy of mammals (Ma et al. (2006) Genome Research 16, 1557-1565) raised some\ndoubts about their existence. We demonstrate that fragile regions are subject\nto a \"birth and death\" process, implying that fragility has limited\nevolutionary lifespan. This finding implies that fragile regions migrate to\ndifferent locations in different mammals, explaining why there exist only a few\nchromosomal breakpoints shared between different lineages. The birth and death\nof fragile regions phenomenon reinforces the hypothesis that rearrangements are\npromoted by matching segmental duplications and suggests putative locations of\nthe currently active fragile regions in the human genome.\n", "versions": [{"version": "v1", "created": "Sun, 31 Oct 2010 20:02:06 GMT"}], "update_date": "2010-11-02", "authors_parsed": [["Alekseyev", "Max A.", ""], ["Pevzner", "Pavel A.", ""]]}, {"id": "1011.0241", "submitter": "Christopher Hillar", "authors": "Guy Isely, Christopher J. Hillar, Friedrich T. Sommer", "title": "Deciphering subsampled data: adaptive compressive sampling as a\n  principle of brain communication", "comments": "9 pages, NIPS 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new algorithm is proposed for a) unsupervised learning of sparse\nrepresentations from subsampled measurements and b) estimating the parameters\nrequired for linearly reconstructing signals from the sparse codes. We verify\nthat the new algorithm performs efficient data compression on par with the\nrecent method of compressive sampling. Further, we demonstrate that the\nalgorithm performs robustly when stacked in several stages or when applied in\nundercomplete or overcomplete situations. The new algorithm can explain how\nneural populations in the brain that receive subsampled input through fiber\nbottlenecks are able to form coherent response properties.\n", "versions": [{"version": "v1", "created": "Mon, 1 Nov 2010 03:23:52 GMT"}], "update_date": "2010-11-02", "authors_parsed": [["Isely", "Guy", ""], ["Hillar", "Christopher J.", ""], ["Sommer", "Friedrich T.", ""]]}, {"id": "1011.0322", "submitter": "Mauro Mobilia", "authors": "Michael Assaf, Mauro Mobilia", "title": "Fixation of a Deleterious Allele under Mutation Pressure and Finite\n  Selection Intensity", "comments": "26 pages, 5 figures. Accepted by the Journal of Theoretical Biology", "journal-ref": "J. Theor. Biol. 275, 93-103 (2011)", "doi": "10.1016/j.jtbi.2011.01.025", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.AO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mean fixation time of a deleterious mutant allele is studied beyond the\ndiffusion approximation. As in Kimura's classical work [M. Kimura, Proc. Natl.\nAcad. Sci. U.S.A. Vol.77, 522 (1980)], that was motivated by the problem of\nfixation in the presence of amorphic or hypermorphic mutations, we consider a\ndiallelic model at a single locus comprising a wild-type A and a mutant allele\nA' produced irreversibly from A at small uniform rate v. The relative fitnesses\nof the mutant homozygotes A'A', mutant heterozygotes A'A and wild-type\nhomozygotes AA are 1-s, 1-h and 1, respectively, where it is assumed that v<<\ns. Here, we adopt an approach based on the direct treatment of the underlying\nMarkov chain (birth-death process) obeyed by the allele frequency (whose\ndynamics is prescribed by the Moran model), which allows to accurately account\nfor the effects of large fluctuations. After a general description of the\ntheory, we focus on the case of a deleterious mutant allele (i.e. s>0) and\ndiscuss three situations: when the mutant is (i) completely dominant (s=h);\n(ii) completely recessive (h=0), and (iii) semi-dominant (h=s/2). Our\ntheoretical predictions for the mean fixation time and the quasi-stationary\ndistribution of the mutant population in the coexistence state, are shown to be\nin excellent agreement with numerical simulations. Furthermore, when s is\nfinite, we demonstrate that our results are superior to those of the diffusion\ntheory that is shown to be an accurate approximation only when N_e s^2 << 1,\nwhere N_e is the effective population size.\n", "versions": [{"version": "v1", "created": "Mon, 1 Nov 2010 14:02:54 GMT"}, {"version": "v2", "created": "Wed, 19 Jan 2011 11:52:53 GMT"}], "update_date": "2011-02-22", "authors_parsed": [["Assaf", "Michael", ""], ["Mobilia", "Mauro", ""]]}, {"id": "1011.0487", "submitter": "EPTCS", "authors": "Andrew Phillips (Microsoft Research), Matthew Lakin (Microsoft\n  Research), Lo\\\"ic Paulev\\'e (Ecole Centrale de Nantes)", "title": "Stochastic Simulation of Process Calculi for Biology", "comments": "In Proceedings MeCBIC 2010, arXiv:1011.0051", "journal-ref": "EPTCS 40, 2010, pp. 1-5", "doi": "10.4204/EPTCS.40.1", "report-no": null, "categories": "cs.PL cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological systems typically involve large numbers of components with\ncomplex, highly parallel interactions and intrinsic stochasticity. To model\nthis complexity, numerous programming languages based on process calculi have\nbeen developed, many of which are expressive enough to generate unbounded\nnumbers of molecular species and reactions. As a result of this expressiveness,\nsuch calculi cannot rely on standard reaction-based simulation methods, which\nrequire fixed numbers of species and reactions. Rather than implementing custom\nstochastic simulation algorithms for each process calculus, we propose to use a\ngeneric abstract machine that can be instantiated to a range of process calculi\nand a range of reaction-based simulation algorithms. The abstract machine\nfunctions as a just-in-time compiler, which dynamically updates the set of\npossible reactions and chooses the next reaction in an iterative cycle. In this\nshort paper we give a brief summary of the generic abstract machine, and show\nhow it can be instantiated with the stochastic simulation algorithm known as\nGillespie's Direct Method. We also discuss the wider implications of such an\nabstract machine, and outline how it can be used to simulate multiple calculi\nsimultaneously within a common framework.\n", "versions": [{"version": "v1", "created": "Tue, 2 Nov 2010 01:29:04 GMT"}], "update_date": "2010-11-03", "authors_parsed": [["Phillips", "Andrew", "", "Microsoft Research"], ["Lakin", "Matthew", "", "Microsoft\n  Research"], ["Paulevé", "Loïc", "", "Ecole Centrale de Nantes"]]}, {"id": "1011.0490", "submitter": "EPTCS", "authors": "Yifei Bao (Department of Computer Science, Stevens Institute of\n  Technology), Adriana Compagnoni (Department of Computer Science, Stevens\n  Institute of Technology), Joseph Glavy (Department of Chemical Biology and\n  Biomedical Engineering, Stevens Institute of Technology), Tommy White\n  (Department of Chemical Biology and Biomedical Engineering, Stevens Institute\n  of Technology)", "title": "Computational Modeling for the Activation Cycle of G-proteins by\n  G-protein-coupled Receptors", "comments": "In Proceedings MeCBIC 2010, arXiv:1011.0051", "journal-ref": "EPTCS 40, 2010, pp. 39-53", "doi": "10.4204/EPTCS.40.4", "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we survey five different computational modeling methods. For\ncomparison, we use the activation cycle of G-proteins that regulate cellular\nsignaling events downstream of G-protein-coupled receptors (GPCRs) as a driving\nexample. Starting from an existing Ordinary Differential Equations (ODEs)\nmodel, we implement the G-protein cycle in the stochastic Pi-calculus using\nSPiM, as Petri-nets using Cell Illustrator, in the Kappa Language using\nCellucidate, and in Bio-PEPA using the Bio-PEPA eclipse plug in. We also\nprovide a high-level notation to abstract away from communication primitives\nthat may be unfamiliar to the average biologist, and we show how to translate\nhigh-level programs into stochastic Pi-calculus processes and chemical\nreactions.\n", "versions": [{"version": "v1", "created": "Tue, 2 Nov 2010 01:29:21 GMT"}], "update_date": "2010-11-03", "authors_parsed": [["Bao", "Yifei", "", "Department of Computer Science, Stevens Institute of\n  Technology"], ["Compagnoni", "Adriana", "", "Department of Computer Science, Stevens\n  Institute of Technology"], ["Glavy", "Joseph", "", "Department of Chemical Biology and\n  Biomedical Engineering, Stevens Institute of Technology"], ["White", "Tommy", "", "Department of Chemical Biology and Biomedical Engineering, Stevens Institute\n  of Technology"]]}, {"id": "1011.0492", "submitter": "EPTCS", "authors": "Diletta Cacciagrano (School of Science and Technology - University of\n  Camerino), Flavio Corradini (School of Science and Technology - University of\n  Camerino), Emanuela Merelli (School of Science and Technology - University of\n  Camerino), Luca Tesei (School of Science and Technology - University of\n  Camerino)", "title": "Multiscale Bone Remodelling with Spatial P Systems", "comments": "In Proceedings MeCBIC 2010, arXiv:1011.0051", "journal-ref": "EPTCS 40, 2010, pp. 70-84", "doi": "10.4204/EPTCS.40.6", "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many biological phenomena are inherently multiscale, i.e. they are\ncharacterized by interactions involving different spatial and temporal scales\nsimultaneously. Though several approaches have been proposed to provide\n\"multilayer\" models, only Complex Automata, derived from Cellular Automata,\nnaturally embed spatial information and realize multiscaling with\nwell-established inter-scale integration schemas. Spatial P systems, a variant\nof P systems in which a more geometric concept of space has been added, have\nseveral characteristics in common with Cellular Automata. We propose such a\nformalism as a basis to rephrase the Complex Automata multiscaling approach\nand, in this perspective, provide a 2-scale Spatial P system describing bone\nremodelling. The proposed model not only results to be highly faithful and\nexpressive in a multiscale scenario, but also highlights the need of a deep and\nformal expressiveness study involving Complex Automata, Spatial P systems and\nother promising multiscale approaches, such as our shape-based one already\nresulted to be highly faithful.\n", "versions": [{"version": "v1", "created": "Tue, 2 Nov 2010 01:29:39 GMT"}], "update_date": "2010-11-03", "authors_parsed": [["Cacciagrano", "Diletta", "", "School of Science and Technology - University of\n  Camerino"], ["Corradini", "Flavio", "", "School of Science and Technology - University of\n  Camerino"], ["Merelli", "Emanuela", "", "School of Science and Technology - University of\n  Camerino"], ["Tesei", "Luca", "", "School of Science and Technology - University of\n  Camerino"]]}, {"id": "1011.0493", "submitter": "EPTCS", "authors": "Giulio Caravagna (Dipartimento di Informatica, Universita di Pisa,\n  italy.), Jane Hillston (Laboratory for Foundations of Computer Science, The\n  University of Edinburgh, Scotland.)", "title": "Modeling biological systems with delays in Bio-PEPA", "comments": "In Proceedings MeCBIC 2010, arXiv:1011.0051", "journal-ref": "EPTCS 40, 2010, pp. 85-101", "doi": "10.4204/EPTCS.40.7", "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Delays in biological systems may be used to model events for which the\nunderlying dynamics cannot be precisely observed, or to provide abstraction of\nsome behavior of the system resulting more compact models. In this paper we\nenrich the stochastic process algebra Bio-PEPA, with the possibility of\nassigning delays to actions, yielding a new non-Markovian process algebra:\nBio-PEPAd. This is a conservative extension meaning that the original syntax of\nBio-PEPA is retained and the delay specification which can now be associated\nwith actions may be added to existing Bio-PEPA models. The semantics of the\nfiring of the actions with delays is the delay-as-duration approach, earlier\npresented in papers on the stochastic simulation of biological systems with\ndelays. These semantics of the algebra are given in the Starting-Terminating\nstyle, meaning that the state and the completion of an action are observed as\ntwo separate events, as required by delays. Furthermore we outline how to\nperform stochastic simulation of Bio-PEPAd systems and how to automatically\ntranslate a Bio-PEPAd system into a set of Delay Differential Equations, the\ndeterministic framework for modeling of biological systems with delays. We end\nthe paper with two example models of biological systems with delays to\nillustrate the approach.\n", "versions": [{"version": "v1", "created": "Tue, 2 Nov 2010 01:29:42 GMT"}], "update_date": "2010-11-03", "authors_parsed": [["Caravagna", "Giulio", "", "Dipartimento di Informatica, Universita di Pisa,\n  italy."], ["Hillston", "Jane", "", "Laboratory for Foundations of Computer Science, The\n  University of Edinburgh, Scotland."]]}, {"id": "1011.0494", "submitter": "EPTCS", "authors": "Mario Coppo (Dipartimento di Informatica, Universit\\`a di Torino),\n  Ferruccio Damiani (Dipartimento di Informatica, Universit\\`a di Torino),\n  Maurizio Drocco (Dipartimento di Informatica, Universit\\`a di Torino), Elena\n  Grassi (Dipartimento di Informatica, Universit\\`a di Torino), Eva Sciacca\n  (Dipartimento di Informatica, Universit\\`a di Torino), Salvatore Spinella\n  (Dipartimento di Informatica, Universit\\`a di Torino), Angelo Troina\n  (Dipartimento di Informatica, Universit\\`a di Torino)", "title": "Hybrid Calculus of Wrapped Compartments", "comments": "In Proceedings MeCBIC 2010, arXiv:1011.0051", "journal-ref": "EPTCS 40, 2010, pp. 102-120", "doi": "10.4204/EPTCS.40.8", "report-no": null, "categories": "cs.PL cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The modelling and analysis of biological systems has deep roots in\nMathematics, specifically in the field of ordinary differential equations\n(ODEs). Alternative approaches based on formal calculi, often derived from\nprocess algebras or term rewriting systems, provide a quite complementary way\nto analyze the behaviour of biological systems. These calculi allow to cope in\na natural way with notions like compartments and membranes, which are not easy\n(sometimes impossible) to handle with purely numerical approaches, and are\noften based on stochastic simulation methods. Recently, it has also become\nevident that stochastic effects in regulatory networks play a crucial role in\nthe analysis of such systems. Actually, in many situations it is necessary to\nuse stochastic models. For example when the system to be described is based on\nthe interaction of few molecules, when we are at the presence of a chemical\ninstability, or when we want to simulate the functioning of a pool of entities\nwhose compartmentalised structure evolves dynamically. In contrast, stable\nmetabolic networks, involving a large number of reagents, for which the\ncomputational cost of a stochastic simulation becomes an insurmountable\nobstacle, are efficiently modelled with ODEs. In this paper we define a hybrid\nsimulation method, combining the stochastic approach with ODEs, for systems\ndescribed in CWC, a calculus on which we can express the compartmentalisation\nof a biological system whose evolution is defined by a set of rewrite rules.\n", "versions": [{"version": "v1", "created": "Tue, 2 Nov 2010 01:29:51 GMT"}], "update_date": "2010-11-03", "authors_parsed": [["Coppo", "Mario", "", "Dipartimento di Informatica, Università di Torino"], ["Damiani", "Ferruccio", "", "Dipartimento di Informatica, Università di Torino"], ["Drocco", "Maurizio", "", "Dipartimento di Informatica, Università di Torino"], ["Grassi", "Elena", "", "Dipartimento di Informatica, Università di Torino"], ["Sciacca", "Eva", "", "Dipartimento di Informatica, Università di Torino"], ["Spinella", "Salvatore", "", "Dipartimento di Informatica, Università di Torino"], ["Troina", "Angelo", "", "Dipartimento di Informatica, Università di Torino"]]}, {"id": "1011.0669", "submitter": "Robert Rosenbaum", "authors": "Robert Rosenbaum, Jianfu Ma, Fabien Marpeau, Aditya Barua, Kresimir\n  Josic", "title": "Finite volume and asymptotic methods for stochastic neuron models with\n  correlated inputs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a pair of stochastic integrate and fire neurons receiving\ncorrelated stochastic inputs. The evolution of this system can be described by\nthe corresponding Fokker-Planck equation with non-trivial boundary conditions\nresulting from the refractory period and firing threshold. We propose a finite\nvolume method that is orders of magnitude faster than the Monte Carlo methods\ntraditionally used to model such systems. The resulting numerical\napproximations are proved to be accurate, nonnegative and integrate to 1. We\nalso approximate the transient evolution of the system using an\nOrnstein--Uhlenbeck process, and use the result to examine the properties of\nthe joint output of cell pairs. The results suggests that the joint output of a\ncell pair is most sensitive to changes in input variance, and less sensitive to\nchanges in input mean and correlation.\n", "versions": [{"version": "v1", "created": "Tue, 2 Nov 2010 16:41:12 GMT"}, {"version": "v2", "created": "Mon, 13 Dec 2010 16:37:43 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Rosenbaum", "Robert", ""], ["Ma", "Jianfu", ""], ["Marpeau", "Fabien", ""], ["Barua", "Aditya", ""], ["Josic", "Kresimir", ""]]}, {"id": "1011.0765", "submitter": "David Lukatsky", "authors": "Ariel Afek, Eugene I. Shakhnovich, and David B. Lukatsky", "title": "Multi-scale sequence correlations increase proteome structural disorder\n  and promiscuity", "comments": null, "journal-ref": "Journal of Molecular Biology 409 (2011) pp. 439-449", "doi": "10.1016/j.jmb.2011.03.056", "report-no": null, "categories": "q-bio.BM q-bio.GN q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Numerous experiments demonstrate a high level of promiscuity and structural\ndisorder in organismal proteomes. Here we ask the question what makes a protein\npromiscuous, i.e., prone to non-specific interactions, and structurally\ndisordered. We predict that multi-scale correlations of amino acid positions\nwithin protein sequences statistically enhance the propensity for promiscuous\nintra- and inter-protein binding. We show that sequence correlations between\namino acids of the same type are statistically enhanced in structurally\ndisordered proteins and in hubs of organismal proteomes. We also show that\nstructurally disordered proteins possess a significantly higher degree of\nsequence order than structurally ordered proteins. We develop an analytical\ntheory for this effect and predict the robustness of our conclusions with\nrespect to the amino acid composition and the form of the microscopic potential\nbetween the interacting sequences. Our findings have implications for\nunderstanding molecular mechanisms of protein aggregation diseases induced by\nthe extension of sequence repeats.\n", "versions": [{"version": "v1", "created": "Tue, 2 Nov 2010 22:40:59 GMT"}, {"version": "v2", "created": "Mon, 9 May 2011 09:37:52 GMT"}], "update_date": "2011-05-10", "authors_parsed": [["Afek", "Ariel", ""], ["Shakhnovich", "Eugene I.", ""], ["Lukatsky", "David B.", ""]]}, {"id": "1011.1212", "submitter": "Jose Vilar", "authors": "J. M. G. Vilar and L. Saiz", "title": "CplexA: a Mathematica package to study macromolecular-assembly control\n  of gene expression", "comments": "28 pages. Includes Mathematica, Matlab, and Python implementation\n  tutorials. Software can be downloaded at http://cplexa.sourceforge.net/", "journal-ref": null, "doi": "10.1093/bioinformatics/btq328", "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech cs.CE physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Summary: Macromolecular assembly vertebrates essential cellular processes,\nsuch as gene regulation and signal transduction. A major challenge for\nconventional computational methods to study these processes is tackling the\nexponential increase of the number of configurational states with the number of\ncomponents. CplexA is a Mathematica package that uses functional programming to\nefficiently compute probabilities and average properties over such\nexponentially large number of states from the energetics of the interactions.\nThe package is particularly suited to study gene expression at complex\npromoters controlled by multiple, local and distal, DNA binding sites for\ntranscription factors. Availability: CplexA is freely available together with\ndocumentation at http://sourceforge.net/projects/cplexa/.\n", "versions": [{"version": "v1", "created": "Thu, 4 Nov 2010 16:59:09 GMT"}, {"version": "v2", "created": "Thu, 13 Dec 2012 16:31:45 GMT"}, {"version": "v3", "created": "Sun, 6 Jan 2013 14:23:03 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Vilar", "J. M. G.", ""], ["Saiz", "L.", ""]]}, {"id": "1011.1280", "submitter": "Vittore F. Scolari", "authors": "Vittore F. Scolari and Bruno Bassetti and Bianca Sclavi and Marco\n  Cosentino Lagomarsino", "title": "Gene clusters reflecting macrodomain structure respond to nucleoid\n  perturbations", "comments": "Article: first 24 pages, 3 figures Supplementary methods: 1 page, 1\n  figure Supplementary results: 14 pages, 11 figures", "journal-ref": null, "doi": "10.1039/C0MB00213E", "report-no": null, "categories": "q-bio.GN q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Focusing on the DNA-bridging nucleoid proteins Fis and H-NS, and integrating\nseveral independent experimental and bioinformatic data sources, we investigate\nthe links between chromosomal spatial organization and global transcriptional\nregulation. By means of a novel multi-scale spatial aggregation analysis, we\nuncover the existence of contiguous clusters of nucleoid-perturbation sensitive\ngenes along the genome, whose expression is affected by a combination of\ntopological DNA state and nucleoid-shaping protein occupancy. The clusters\ncorrelate well with the macrodomain structure of the genome. The most\nsignificant of them lay symmetrically at the edges of the ter macrodomain and\ninvolve all of the flagellar and chemotaxis machinery, in addition to key\nregulators of biofilm formation, suggesting that the regulation of the physical\nstate of the chromosome by the nucleoid proteins plays an important role in\ncoordinating the transcriptional response leading to the switch between a\nmotile and a biofilm lifestyle.\n", "versions": [{"version": "v1", "created": "Thu, 4 Nov 2010 21:58:16 GMT"}], "update_date": "2010-12-17", "authors_parsed": [["Scolari", "Vittore F.", ""], ["Bassetti", "Bruno", ""], ["Sclavi", "Bianca", ""], ["Lagomarsino", "Marco Cosentino", ""]]}, {"id": "1011.1470", "submitter": "Luca Ferretti", "authors": "Luca Ferretti, Giacomo Marmorini, Sebastian Ramos-Onsins", "title": "Properties of neutrality tests based on allele frequency spectrum", "comments": "42 pages, 3 figures, elsarticle", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the main necessities for population geneticists is the availability of\nstatistical tools that enable to accept or reject the neutral Wright-Fisher\nmodel with high power. A number of statistical tests have been developed to\ndetect specific deviations from the null frequency spectrum in different\ndirections (i.e., Tajima's D, Fu and Li's F and D test, Fay and Wu's H).\nRecently, a general framework was proposed to generate all neutrality tests\nthat are linear functions of the frequency spectrum. In this framework, a\nfamily of optimal tests was developed to have almost maximum power against a\nspecific alternative evolutionary scenario. Following these developments, in\nthis paper we provide a thorough discussion of linear and nonlinear neutrality\ntests. First, we present the general framework for linear tests and emphasize\nthe importance of the property of scalability with the sample size (that is,\nthe results of the tests should not depend on the sample size), which, if\nmissing, can guide to errors in data interpretation. The motivation and\nstructure of linear optimal tests are discussed. In a further generalization,\nwe develop a general framework for nonlinear neutrality tests and we derive\nnonlinear optimal tests for polynomials of any degree in the frequency\nspectrum.\n", "versions": [{"version": "v1", "created": "Fri, 5 Nov 2010 18:16:24 GMT"}], "update_date": "2010-11-08", "authors_parsed": [["Ferretti", "Luca", ""], ["Marmorini", "Giacomo", ""], ["Ramos-Onsins", "Sebastian", ""]]}, {"id": "1011.2025", "submitter": "Audrey Qiuyan Fu", "authors": "Audrey Qiuyan Fu, Diane P. Genereux, Reinhard St\\\"oger, Charles D.\n  Laird, Matthew Stephens", "title": "Statistical inference of transmission fidelity of DNA methylation\n  patterns over somatic cell divisions in mammals", "comments": "Published in at http://dx.doi.org/10.1214/09-AOAS297 the Annals of\n  Applied Statistics (http://www.imstat.org/aoas/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Statistics 2010, Vol. 4, No. 2, 871-892", "doi": "10.1214/09-AOAS297", "report-no": "IMS-AOAS-AOAS297", "categories": "stat.AP q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop Bayesian inference methods for a recently-emerging type of\nepigenetic data to study the transmission fidelity of DNA methylation patterns\nover cell divisions. The data consist of parent-daughter double-stranded DNA\nmethylation patterns with each pattern coming from a single cell and\nrepresented as an unordered pair of binary strings. The data are technically\ndifficult and time-consuming to collect, putting a premium on an efficient\ninference method. Our aim is to estimate rates for the maintenance and de novo\nmethylation events that gave rise to the observed patterns, while accounting\nfor measurement error. We model data at multiple sites jointly, thus using\nwhole-strand information, and considerably reduce confounding between\nparameters. We also adopt a hierarchical structure that allows for variation in\nrates across sites without an explosion in the effective number of parameters.\nOur context-specific priors capture the expected stationarity, or\nnear-stationarity, of the stochastic process that generated the data analyzed\nhere. This expected stationarity is shown to greatly increase the precision of\nthe estimation. Applying our model to a data set collected at the human FMR1\nlocus, we find that measurement errors, generally ignored in similar studies,\noccur at a nontrivial rate (inappropriate bisulfite conversion error: 1.6$%$\nwith 80$%$ CI: 0.9--2.3$%$). Accounting for these errors has a substantial\nimpact on estimates of key biological parameters. The estimated average failure\nof maintenance rate and daughter de novo rate decline from 0.04 to 0.024 and\nfrom 0.14 to 0.07, respectively, when errors are accounted for. Our results\nalso provide evidence that de novo events may occur on both parent and daughter\nstrands: the median parent and daughter de novo rates are 0.08 (80$%$ CI:\n0.04--0.13) and 0.07 (80$%$ CI: 0.04--0.11), respectively.\n", "versions": [{"version": "v1", "created": "Tue, 9 Nov 2010 10:19:42 GMT"}], "update_date": "2016-08-14", "authors_parsed": [["Fu", "Audrey Qiuyan", ""], ["Genereux", "Diane P.", ""], ["Stöger", "Reinhard", ""], ["Laird", "Charles D.", ""], ["Stephens", "Matthew", ""]]}, {"id": "1011.2071", "submitter": "Steven Duplij", "authors": "Diana Duplij (Institute of Molecular Biology and Genetics, Kiev,\n  Ukraine)", "title": "Comparative analysis of the nucleotide composition biases in exons and\n  introns of human genes", "comments": "8 pages, 2 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The nucleotide composition of human genes with a special emphasis on\ntranscription-related strand asymmetries is analyzed. Such asymmetries may be\nassociated with different mutational rates in two principal factors. The first\none is transcription-coupled repair and the second one is the selective\npressure related to optimization of the translation efficiency. The former\nfactor affects both coding and noncoding regions of a gene, while the latter\nfactor is applicable only to the coding regions. Compositional asymmetries\ncalculated at the third position of a codon in coding (exons) and noncoding\n(introns, UTR, upstream and downstream) regions of human genes are compared. It\nis shown that the keto-skew (excess of the frequencies of G and T nucleotides\nover the frequencies of A and C nucleotides in the same strand) is most\npronounced in intronic regions, less pronounced in coding regions, and has near\nzero values in untranscribed regions. The keto-skew correlates with the level\nof gene expression in germ-line cells in both introns and exons. We propose to\nuse the results of our analysis to estimate the contribution of different\nevolutionary factors to the transcription-related compositional biases.\n", "versions": [{"version": "v1", "created": "Tue, 9 Nov 2010 13:11:31 GMT"}], "update_date": "2010-11-10", "authors_parsed": [["Duplij", "Diana", "", "Institute of Molecular Biology and Genetics, Kiev,\n  Ukraine"]]}, {"id": "1011.2087", "submitter": "Qunhua Li", "authors": "Qunhua Li, Michael J. MacCoss, Matthew Stephens", "title": "A nested mixture model for protein identification using mass\n  spectrometry", "comments": "Published in at http://dx.doi.org/10.1214/09-AOAS316 the Annals of\n  Applied Statistics (http://www.imstat.org/aoas/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Statistics 2010, Vol. 4, No. 2, 962-987", "doi": "10.1214/09-AOAS316", "report-no": "IMS-AOAS-AOAS316", "categories": "stat.AP physics.bio-ph q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mass spectrometry provides a high-throughput way to identify proteins in\nbiological samples. In a typical experiment, proteins in a sample are first\nbroken into their constituent peptides. The resulting mixture of peptides is\nthen subjected to mass spectrometry, which generates thousands of spectra, each\ncharacteristic of its generating peptide. Here we consider the problem of\ninferring, from these spectra, which proteins and peptides are present in the\nsample. We develop a statistical approach to the problem, based on a nested\nmixture model. In contrast to commonly used two-stage approaches, this model\nprovides a one-stage solution that simultaneously identifies which proteins are\npresent, and which peptides are correctly identified. In this way our model\nincorporates the evidence feedback between proteins and their constituent\npeptides. Using simulated data and a yeast data set, we compare and contrast\nour method with existing widely used approaches (PeptideProphet/ProteinProphet)\nand with a recently published new approach, HSM. For peptide identification,\nour single-stage approach yields consistently more accurate results. For\nprotein identification the methods have similar accuracy in most settings,\nalthough we exhibit some scenarios in which the existing methods perform\npoorly.\n", "versions": [{"version": "v1", "created": "Tue, 9 Nov 2010 13:55:30 GMT"}], "update_date": "2010-11-10", "authors_parsed": [["Li", "Qunhua", ""], ["MacCoss", "Michael J.", ""], ["Stephens", "Matthew", ""]]}, {"id": "1011.2605", "submitter": "Sergei Nechaev", "authors": "S.K. Nechaev, M.V. Tamm, O.V. Valba", "title": "Sequence matching algorithms and pairing of noncoding RNAs", "comments": "23 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new statistical method of alignment of two heteropolymers which can form\nhierarchical cloverleaf-like secondary structures is proposed. This offers a\nnew constructive algorithm for quantitative determination of binding free\nenergy of two noncoding RNAs with arbitrary primary sequences. The alignment of\nncRNAs differs from the complete alignment of two RNA sequences: in ncRNA case\nwe align only the sequences of nucleotides which constitute pairs between two\ndifferent RNAs, while the secondary structure of each RNA comes into play only\nby the combinatorial factors affecting the entropc contribution of each\nmolecule to the total cost function. The proposed algorithm is based on two\nobservations: i) the standard alignment problem is considered as a\nzero-temperature limit of a more general statistical problem of binding of two\nassociating heteropolymer chains; ii) this last problem is generalized onto the\nsequences with hierarchical cloverleaf-like structures (i.e. of RNA-type).\nTaking zero-temperature limit at the very end we arrive at the desired \"cost\nfunction\" of the system with account for entropy of side cactus-like loops.\nMoreover, we have demonstrated in detail how our algorithm enables to solve the\n\"structure recovery\" problem. Namely, we can predict in zero-temperature limit\nthe cloverleaf-like (i.e. secondary) structure of interacting ncRNAs by knowing\nonly their primary sequences.\n", "versions": [{"version": "v1", "created": "Thu, 11 Nov 2010 10:26:42 GMT"}], "update_date": "2010-11-12", "authors_parsed": [["Nechaev", "S. K.", ""], ["Tamm", "M. V.", ""], ["Valba", "O. V.", ""]]}, {"id": "1011.2699", "submitter": "Sang Hoon Lee", "authors": "Sang Hoon Lee, Pan-Jun Kim, Hawoong Jeong", "title": "Global organization of protein complexome in the yeast Saccharomyces\n  cerevisiae", "comments": "48 pages, 6 figures, 3 tables, 8 additional files (3 supporting\n  tables and 5 supporting figures) on the Web", "journal-ref": "BMC Syst. Biol. 5, 126 (2011)", "doi": "10.1186/1752-0509-5-126", "report-no": null, "categories": "q-bio.QM physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proteins in organisms, rather than act alone, usually form protein complexes\nto perform cellular functions. We analyze the topological network structure of\nprotein complexes and their component proteins in the budding yeast in terms of\nthe bipartite network and its projections, where the complexes and proteins are\nits two distinct components. Compared to conventional protein-protein\ninteraction networks, the networks from the protein complexes show more\nhomogeneous structures than those of the binary protein interactions, implying\nthe formation of complexes that cause a relatively more uniform number of\ninteraction partners. In addition, we suggest a new optimization method to\ndetermine the abundance and function of protein complexes, based on the\ninformation of their global organization. Estimating abundance and biological\nfunctions is of great importance for many researches, by providing a\nquantitative description of cell behaviors, instead of just a \"catalogues\" of\nthe lists of protein interactions. With our new optimization method, we present\ngenome-wide assignments of abundance and biological functions for complexes, as\nwell as previously unknown abundance and functions of proteins, which can\nprovide significant information for further investigations in proteomics. It is\nstrongly supported by a number of biologically relevant examples, such as the\nrelationship between the cytoskeleton proteins and signal transduction and the\nmetabolic enzyme Eno2's involvement in the cell division process. We believe\nthat our methods and findings are applicable not only to the specific area of\nproteomics, but also to much broader areas of systems biology with the concept\nof optimization principle.\n", "versions": [{"version": "v1", "created": "Thu, 11 Nov 2010 16:18:03 GMT"}, {"version": "v2", "created": "Mon, 11 Apr 2011 18:32:49 GMT"}, {"version": "v3", "created": "Thu, 11 Aug 2011 17:14:49 GMT"}, {"version": "v4", "created": "Mon, 15 Aug 2011 10:35:04 GMT"}], "update_date": "2011-08-16", "authors_parsed": [["Lee", "Sang Hoon", ""], ["Kim", "Pan-Jun", ""], ["Jeong", "Hawoong", ""]]}, {"id": "1011.2969", "submitter": "David Kelly", "authors": "David Kelly, Mark Dillingham, Andrew Hudson and Karoline Wiesner", "title": "Inferring hidden Markov models from noisy time sequences: a method to\n  alleviate degeneracy in molecular dynamics", "comments": "19 pages, 9 figures", "journal-ref": "PLoS ONE 7(1): e29703 2012", "doi": "10.1371/journal.pone.0029703", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new method for inferring hidden Markov models from noisy time\nsequences without the necessity of assuming a model architecture, thus allowing\nfor the detection of degenerate states. This is based on the statistical\nprediction techniques developed by Crutchfield et al., and generates so called\ncausal state models, equivalent to hidden Markov models. This method is\napplicable to any continuous data which clusters around discrete values and\nexhibits multiple transitions between these values such as tethered particle\nmotion data or Fluorescence Resonance Energy Transfer (FRET) spectra. The\nalgorithms developed have been shown to perform well on simulated data,\ndemonstrating the ability to recover the model used to generate the data under\nhigh noise, sparse data conditions and the ability to infer the existence of\ndegenerate states. They have also been applied to new experimental FRET data of\nHolliday Junction dynamics, extracting the expected two state model and\nproviding values for the transition rates in good agreement with previous\nresults and with results obtained using existing maximum likelihood based\nmethods.\n", "versions": [{"version": "v1", "created": "Fri, 12 Nov 2010 16:10:24 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Kelly", "David", ""], ["Dillingham", "Mark", ""], ["Hudson", "Andrew", ""], ["Wiesner", "Karoline", ""]]}, {"id": "1011.2998", "submitter": "Dezhe Jin", "authors": "Dezhe Z. Jin and Alexay A. Kozhevnikov", "title": "A compact statistical model of the song syntax in Bengalese finch", "comments": null, "journal-ref": "Jin DZ, Kozhevnikov AA (2011) A Compact Statistical Model of the\n  Song Syntax in Bengalese Finch. PLoS Comput Biol 7(3): e1001108", "doi": "10.1371/journal.pcbi.1001108", "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Songs of many songbird species consist of variable sequences of a finite\nnumber of syllables. A common approach for characterizing the syntax of these\ncomplex syllable sequences is to use transition probabilities between the\nsyllables. This is equivalent to the Markov model, in which each syllable is\nassociated with one state, and the transition probabilities between the states\ndo not depend on the state transition history. Here we analyze the song syntax\nin a Bengalese finch. We show that the Markov model fails to capture the\nstatistical properties of the syllable sequences. Instead, a state transition\nmodel that accurately describes the statistics of the syllable sequences\nincludes adaptation of the self-transition probabilities when states are\nrepeatedly revisited, and allows associations of more than one state to the\nsame syllable. Such a model does not increase the model complexity\nsignificantly. Mathematically, the model is a partially observable Markov model\nwith adaptation (POMMA). The success of the POMMA supports the branching chain\nnetwork hypothesis of how syntax is controlled within the premotor song nucleus\nHVC, and suggests that adaptation and many-to-one mapping from neural\nsubstrates to syllables are important features of the neural control of complex\nsong syntax.\n", "versions": [{"version": "v1", "created": "Fri, 12 Nov 2010 18:09:36 GMT"}], "update_date": "2013-08-22", "authors_parsed": [["Jin", "Dezhe Z.", ""], ["Kozhevnikov", "Alexay A.", ""]]}, {"id": "1011.4199", "submitter": "Soumya Banerjee", "authors": "Melanie Moses and Soumya Banerjee", "title": "Biologically Inspired Design Principles for Scalable, Robust, Adaptive,\n  Decentralized Search and Automated Response (RADAR)", "comments": "8 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.DC cs.SY math.OC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed search problems are ubiquitous in Artificial Life (ALife). Many\ndistributed search problems require identifying a rare and previously unseen\nevent and producing a rapid response. This challenge amounts to finding and\nremoving an unknown needle in a very large haystack. Traditional computational\nsearch models are unlikely to find, nonetheless, appropriately respond to,\nnovel events, particularly given data distributed across multiple platforms in\na variety of formats and sources with variable and unknown reliability.\nBiological systems have evolved solutions to distributed search and response\nunder uncertainty. Immune systems and ant colonies efficiently scale up\nmassively parallel search with automated response in highly dynamic\nenvironments, and both do so using distributed coordination without centralized\ncontrol. These properties are relevant to ALife, where distributed, autonomous,\nrobust and adaptive control is needed to design robot swarms, mobile computing\nnetworks, computer security systems and other distributed intelligent systems.\nThey are also relevant for searching, tracking the spread of ideas, and\nunderstanding the impact of innovations in online social networks. We review\ndesign principles for Scalable Robust, Adaptive, Decentralized search with\nAutomated Response (Scalable RADAR) in biology. We discuss how biological RADAR\nscales up efficiently, and then discuss in detail how modular search in the\nimmune system can be mimicked or built upon in ALife. Such search mechanisms\nare particularly useful when components have limited capacity to communicate\nand social or physical distance makes long distance communication more costly.\n", "versions": [{"version": "v1", "created": "Thu, 18 Nov 2010 14:34:34 GMT"}, {"version": "v2", "created": "Thu, 24 Feb 2011 18:21:34 GMT"}], "update_date": "2011-02-25", "authors_parsed": [["Moses", "Melanie", ""], ["Banerjee", "Soumya", ""]]}, {"id": "1011.4245", "submitter": "Diego Fernandez Slezak", "authors": "Diego Fernandez Slezak, Cecilia Suarez, Guillermo A. Cecchi, Guillermo\n  Marshall and Gustavo Stolovitzky", "title": "When the optimal is not the best: parameter estimation in complex\n  biological models", "comments": null, "journal-ref": "Fernandez Slezak D, Su\\'arez C, Cecchi GA, Marshall G, Stolovitzky\n  G, 2010 When the Optimal Is Not the Best: Parameter Estimation in Complex\n  Biological Models. PLoS ONE 5(10): e13283", "doi": "10.1371/journal.pone.0013283", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: The vast computational resources that became available during the\npast decade enabled the development and simulation of increasingly complex\nmathematical models of cancer growth. These models typically involve many free\nparameters whose determination is a substantial obstacle to model development.\nDirect measurement of biochemical parameters in vivo is often difficult and\nsometimes impracticable, while fitting them under data-poor conditions may\nresult in biologically implausible values.\n  Results: We discuss different methodological approaches to estimate\nparameters in complex biological models. We make use of the high computational\npower of the Blue Gene technology to perform an extensive study of the\nparameter space in a model of avascular tumor growth. We explicitly show that\nthe landscape of the cost function used to optimize the model to the data has a\nvery rugged surface in parameter space. This cost function has many local\nminima with unrealistic solutions, including the global minimum corresponding\nto the best fit.\n  Conclusions: The case studied in this paper shows one example in which model\nparameters that optimally fit the data are not necessarily the best ones from a\nbiological point of view. To avoid force-fitting a model to a dataset, we\npropose that the best model parameters should be found by choosing, among\nsuboptimal parameters, those that match criteria other than the ones used to\nfit the model. We also conclude that the model, data and optimization approach\nform a new complex system, and point to the need of a theory that addresses\nthis problem more generally.\n", "versions": [{"version": "v1", "created": "Thu, 18 Nov 2010 17:58:20 GMT"}], "update_date": "2010-11-19", "authors_parsed": [["Slezak", "Diego Fernandez", ""], ["Suarez", "Cecilia", ""], ["Cecchi", "Guillermo A.", ""], ["Marshall", "Guillermo", ""], ["Stolovitzky", "Gustavo", ""]]}, {"id": "1011.4682", "submitter": "Andrea Roli", "authors": "Andrea Roli, Stefano Benedettini, Roberto Serra and Marco Villani", "title": "Analysis of attractor distances in Random Boolean Networks", "comments": "9 pages, 6 figures. Presented at WIRN 2010 - Italian workshop on\n  neural networks, May 2010. To appear in a volume published by IOS Press", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE nlin.CD physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the properties of the distance between attractors in Random Boolean\nNetworks, a prominent model of genetic regulatory networks. We define three\ndistance measures, upon which attractor distance matrices are constructed and\ntheir main statistic parameters are computed. The experimental analysis shows\nthat ordered networks have a very clustered set of attractors, while chaotic\nnetworks' attractors are scattered; critical networks show, instead, a pattern\nwith characteristics of both ordered and chaotic networks.\n", "versions": [{"version": "v1", "created": "Sun, 21 Nov 2010 17:39:27 GMT"}], "update_date": "2010-11-23", "authors_parsed": [["Roli", "Andrea", ""], ["Benedettini", "Stefano", ""], ["Serra", "Roberto", ""], ["Villani", "Marco", ""]]}, {"id": "1011.5108", "submitter": "Fabien Campillo", "authors": "Fabien Campillo (INRIA Sophia Antipolis - INRA/SupAgro UMR 0729 MISTEA\n  - Montpellier), Marc Joannides (INRIA Sophia Antipolis - INRA/SupAgro UMR\n  0729 MISTEA - Montpellier, I3M), Ir\\`ene Larramendy (I3M)", "title": "Stochastic models of the chemostat", "comments": null, "journal-ref": "N&deg; RR-7458 (2010)", "doi": null, "report-no": "RR-7458", "categories": "q-bio.QM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the modeling of the dynamics of the chemostat at its very source.\nThe chemostat is classically represented as a system of ordinary differential\nequations. Our goal is to establish a stochastic model that is valid at the\nscale immediately preceding the one corresponding to the deterministic model.\nAt a microscopic scale we present a pure jump stochastic model that gives rise,\nat the macroscopic scale, to the ordinary differential equation model. At an\nintermediate scale, an approximation diffusion allows us to propose a model in\nthe form of a system of stochastic differential equations. We expound the\nmechanism to switch from one model to another, together with the associated\nsimulation procedures. We also describe the domain of validity of the different\nmodels.\n", "versions": [{"version": "v1", "created": "Mon, 22 Nov 2010 10:30:20 GMT"}, {"version": "v2", "created": "Wed, 6 Jul 2011 05:47:22 GMT"}], "update_date": "2011-07-07", "authors_parsed": [["Campillo", "Fabien", "", "INRIA Sophia Antipolis - INRA/SupAgro UMR 0729 MISTEA\n  - Montpellier"], ["Joannides", "Marc", "", "INRIA Sophia Antipolis - INRA/SupAgro UMR\n  0729 MISTEA - Montpellier, I3M"], ["Larramendy", "Irène", "", "I3M"]]}, {"id": "1011.5466", "submitter": "Ilya M. Nemenman", "authors": "Ilya Nemenman", "title": "Information theory and adaptation", "comments": "To appear as Chapter 5 of \"Quantitative Biology: From Molecular to\n  Cellular Systems\", ME Wall, ed. (Taylor and Francis, 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this Chapter, we ask questions (1) What is the right way to measure the\nquality of information processing in a biological system? and (2) What can\nreal-life organisms do in order to improve their performance in\ninformation-processing tasks? We then review the body of work that investigates\nthese questions experimentally, computationally, and theoretically in\nbiological domains as diverse as cell biology, population biology, and\ncomputational neuroscience\n", "versions": [{"version": "v1", "created": "Wed, 24 Nov 2010 19:49:58 GMT"}], "update_date": "2010-11-25", "authors_parsed": [["Nemenman", "Ilya", ""]]}, {"id": "1011.5778", "submitter": "Tobias Marschall", "authors": "Tobias Marschall and Inke Herms and Hans-Michael Kaltenbach and Sven\n  Rahmann", "title": "Probabilistic Arithmetic Automata and their Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present probabilistic arithmetic automata (PAAs), a general model to\ndescribe chains of operations whose operands depend on chance, along with two\ndifferent algorithms to exactly calculate the distribution of the results\nobtained by such probabilistic calculations. PAAs provide a unifying framework\nto approach many problems arising in computational biology and elsewhere. Here,\nwe present five different applications, namely (1) pattern matching statistics\non random texts, including the computation of the distribution of occurrence\ncounts, waiting time and clump size under HMM background models; (2) exact\nanalysis of window-based pattern matching algorithms; (3) sensitivity of\nfiltration seeds used to detect candidate sequence alignments; (4) length and\nmass statistics of peptide fragments resulting from enzymatic cleavage\nreactions; and (5) read length statistics of 454 sequencing reads. The\ndiversity of these applications indicates the flexibility and unifying\ncharacter of the presented framework.\n  While the construction of a PAA depends on the particular application, we\nsingle out a frequently applicable construction method for pattern statistics:\nWe introduce deterministic arithmetic automata (DAAs) to model deterministic\ncalculations on sequences, and demonstrate how to construct a PAA from a given\nDAA and a finite-memory random text model. We show how to transform a finite\nautomaton into a DAA and then into the corresponding PAA.\n", "versions": [{"version": "v1", "created": "Fri, 26 Nov 2010 13:13:08 GMT"}], "update_date": "2010-11-29", "authors_parsed": [["Marschall", "Tobias", ""], ["Herms", "Inke", ""], ["Kaltenbach", "Hans-Michael", ""], ["Rahmann", "Sven", ""]]}, {"id": "1011.6062", "submitter": "Philippe Marcq", "authors": "N. Yoshinaga, J.-F. Joanny, J. Prost and P. Marcq", "title": "Polarity patterns of stress fibers", "comments": "5 pages, 3 figures", "journal-ref": "Phys. Rev. Lett. 105, 238103 (2010)", "doi": "10.1103/PhysRevLett.105.238103", "report-no": null, "categories": "q-bio.QM cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stress fibers are contractile actomyosin bundles commonly observed in the\ncytoskeleton of metazoan cells. The spatial profile of the polarity of actin\nfilaments inside contractile actomyosin bundles is either monotonic (graded) or\nperiodic (alternating). In the framework of linear irreversible thermodynamics,\nwe write the constitutive equations for a polar, active, elastic\none-dimensional medium. An analysis of the resulting equations for the dynamics\nof polarity shows that the transition from graded to alternating polarity\npatterns is a nonequilibrium Lifshitz point. Active contractility is a\nnecessary condition for the emergence of sarcomeric, alternating polarity\npatterns.\n", "versions": [{"version": "v1", "created": "Sun, 28 Nov 2010 17:00:47 GMT"}], "update_date": "2010-12-09", "authors_parsed": [["Yoshinaga", "N.", ""], ["Joanny", "J. -F.", ""], ["Prost", "J.", ""], ["Marcq", "P.", ""]]}, {"id": "1011.6627", "submitter": "Yi-Kuo Yu", "authors": "Gelio Alves and Yi-Kuo Yu", "title": "Combining independent, arbitrarily weighted P-values: a new solution to\n  an old problem using a novel expansion with controllable accuracy", "comments": "16 pages, no figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST q-bio.QM stat.TH", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Good's formula and Fisher's method are frequently used for combining\nindependent P-values. Interestingly, the equivalent of Good's formula already\nemerged in 1910 and mathematical expressions relevant to even more general\nsituations have been repeatedly derived, albeit in different context. We\nprovide here a novel derivation and show how the analytic formula obtained\nreduces to the two aforementioned ones as special cases. The main novelty of\nthis paper, however, is the explicit treatment of nearly degenerate weights,\nwhich are known to cause numerical instabilities. We derive a controlled\nexpansion, in powers of differences in inverse weights, that provides both\naccurate statistics and stable numerics.\n", "versions": [{"version": "v1", "created": "Tue, 30 Nov 2010 17:56:19 GMT"}], "update_date": "2010-12-01", "authors_parsed": [["Alves", "Gelio", ""], ["Yu", "Yi-Kuo", ""]]}]