[{"id": "1104.0025", "submitter": "Chris Adami", "authors": "Christoph Adami, Jifeng Qian, Matthew Rupp, and Arend Hintze", "title": "Information content of colored motifs in complex networks", "comments": "21 pages, 8 figures, to appear in Artificial Life", "journal-ref": "Artificial Life 17 (2011) 375-390", "doi": "10.1162/artl_a_00045", "report-no": null, "categories": "q-bio.QM cs.IT math.IT nlin.AO q-bio.MN q-bio.NC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study complex networks in which the nodes of the network are tagged with\ndifferent colors depending on the functionality of the nodes (colored graphs),\nusing information theory applied to the distribution of motifs in such\nnetworks. We find that colored motifs can be viewed as the building blocks of\nthe networks (much more so than the uncolored structural motifs can be) and\nthat the relative frequency with which these motifs appear in the network can\nbe used to define the information content of the network. This information is\ndefined in such a way that a network with random coloration (but keeping the\nrelative number of nodes with different colors the same) has zero color\ninformation content. Thus, colored motif information captures the\nexceptionality of coloring in the motifs that is maintained via selection. We\nstudy the motif information content of the C. elegans brain as well as the\nevolution of colored motif information in networks that reflect the interaction\nbetween instructions in genomes of digital life organisms. While we find that\ncolored motif information appears to capture essential functionality in the C.\nelegans brain (where the color assignment of nodes is straightforward) it is\nnot obvious whether the colored motif information content always increases\nduring evolution, as would be expected from a measure that captures network\ncomplexity. For a single choice of color assignment of instructions in the\ndigital life form Avida, we find rather that colored motif information content\nincreases or decreases during evolution, depending on how the genomes are\norganized, and therefore could be an interesting tool to dissect genomic\nrearrangements.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 20:35:44 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Adami", "Christoph", ""], ["Qian", "Jifeng", ""], ["Rupp", "Matthew", ""], ["Hintze", "Arend", ""]]}, {"id": "1104.0341", "submitter": "David R. Bickel", "authors": "David R. Bickel", "title": "Small-scale inference: Empirical Bayes and confidence methods for as few\n  as a single comparison", "comments": "Corrected Figures 1-2", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME math.ST q-bio.QM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By restricting the possible values of the proportion of null hypotheses that\nare true, the local false discovery rate (LFDR) can be estimated using as few\nas one comparison. The proportion of proteins with equivalent abundance was\nestimated to be about 20% for patient group I and about 90% for group II. The\nsimultaneously-estimated LFDRs give approximately the same inferences as\nindividual-protein confidence levels for group I but are much closer to\nindividual-protein LFDR estimates for group II. Simulations confirm that\nconfidence-based inference or LFDR-based inference performs markedly better for\nlow or high proportions of true null hypotheses, respectively.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2011 22:37:16 GMT"}, {"version": "v2", "created": "Wed, 11 May 2011 20:13:22 GMT"}], "update_date": "2011-05-13", "authors_parsed": [["Bickel", "David R.", ""]]}, {"id": "1104.0489", "submitter": "Jun O'Hara", "authors": "Jun O'Hara", "title": "Ideal, best packing, and energy minimizing double helices", "comments": "10 pages, 16 figures, to appear in Progress of Theoretical Physics\n  Supplement. Minor change and reference updated", "journal-ref": "Progress of Theoretical Physics Supplement 191 (2011) 215-224", "doi": "10.1143/PTPS.191.215", "report-no": null, "categories": "physics.comp-ph math.DG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study optimal double helices with straight axes (or the fattest tubes\naround them) computationally using three kinds of functionals; ideal ones using\nropelength, best volume packing ones, and energy minimizers using two\none-parameter families of interaction energies between two strands of types\n$r^{-\\alpha}$ and $\\frac1r\\exp(-kr)$. We compare the numerical results with\nexperimental data of DNA.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2011 08:16:59 GMT"}, {"version": "v2", "created": "Tue, 26 Apr 2011 13:11:02 GMT"}], "update_date": "2016-03-21", "authors_parsed": [["O'Hara", "Jun", ""]]}, {"id": "1104.0541", "submitter": "Vladimir Chechetkin R.", "authors": "V.R. Chechetkin", "title": "Spectral sum rules and search for periodicities in DNA sequences", "comments": "10 pages, 0 figures", "journal-ref": "Physics Letters A, 2011, V. 375, N 16, pp. 1729-1732", "doi": "10.1016/j.physleta.2011.03.007", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Periodic patterns play the important regulatory and structural roles in\ngenomic DNA sequences. Commonly, the underlying periodicities should be\nunderstood in a broad statistical sense, since the corresponding periodic\npatterns have been strongly distorted by the random point mutations and\ninsertions/deletions during molecular evolution. The latent periodicities in\nDNA sequences can be efficiently displayed by Fourier transform. The criteria\nof significance for observed periodicities are obtained via the comparison\nversus the counterpart characteristics of the reference random sequences. We\nshow that the restrictions imposed on the significance criteria by the rigorous\nspectral sum rules can be rationally described with De Finetti distribution.\nThis distribution provides the convenient intermediate asymptotic form between\nRayleigh distribution and exact combinatoric theory.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2011 12:20:27 GMT"}], "update_date": "2011-04-05", "authors_parsed": [["Chechetkin", "V. R.", ""]]}, {"id": "1104.0543", "submitter": "Vladimir Chechetkin R.", "authors": "V.R. Chechetkin", "title": "Kinetics of binding and geometry of cells on molecular biochips", "comments": "10 pages, 1 figure", "journal-ref": "Physics Letters A, 2007, V. 366, N 4-5, pp. 460-465", "doi": "10.1016/j.physleta.2007.01.079", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine how the shape of cells and the geometry of experiment affect the\nreaction-diffusion kinetics at the binding between target and probe molecules\non molecular biochips. In particular, we compare the binding kinetics for the\nprobes immobilized on surface of the semispherical and flat circular cells, the\nlimit of thin slab of analyte solution over probe cell as well as hemispherical\ngel pads and cells printed in gel slab over a substrate. It is shown that\nhemispherical geometry provides significantly faster binding kinetics and\nensures more spatially homogeneous distribution of local (from a pixel) signals\nover a cell in the transient regime. The advantage of using thin slabs with\nsmall volume of analyte solution may be hampered by the much longer binding\nkinetics needing the auxiliary mixing devices. Our analysis proves that the\nshape of cells and the geometry of experiment should be included to the list of\nessential factors at biochip designing.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2011 12:30:36 GMT"}], "update_date": "2011-04-05", "authors_parsed": [["Chechetkin", "V. R.", ""]]}, {"id": "1104.0979", "submitter": "Rhiju Das", "authors": "Wipapat Kladwang, Christopher C. VanLang, Pablo Cordero, and Rhiju Das", "title": "Two-dimensional chemical mapping for non-coding RNAs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-coding RNA molecules fold into precise base pairing patterns to carry out\ncritical roles in genetic regulation and protein synthesis. We show here that\ncoupling systematic mutagenesis with high-throughput SHAPE chemical mapping\nenables accurate base pair inference of domains from ribosomal RNA, ribozymes,\nand riboswitches. For a six-RNA benchmark that challenged prior\nchemical/computational methods, this mutate-and-map strategy gives secondary\nstructures in agreement with crystallographic data (2 % error rates), including\na blind test on a double-glycine riboswitch. Through modeling of partially\nordered RNA states, the method enables the first test of an 'interdomain\nhelix-swap' hypothesis for ligand-binding cooperativity in a glycine\nriboswitch. Finally, the mutate-and-map data report on tertiary contacts within\nnon-coding RNAs; coupled with the Rosetta/FARFAR algorithm, these data give\nnucleotide-resolution three-dimensional models (5.7 {\\AA} helix RMSD) of an\nadenine riboswitch. These results highlight the promise of a two-dimensional\nchemical strategy for inferring the secondary and tertiary structures that\nunderlie non-coding RNA behavior.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2011 00:35:26 GMT"}], "update_date": "2011-04-07", "authors_parsed": [["Kladwang", "Wipapat", ""], ["VanLang", "Christopher C.", ""], ["Cordero", "Pablo", ""], ["Das", "Rhiju", ""]]}, {"id": "1104.1090", "submitter": "Juergen Reingruber", "authors": "Juergen Reingruber and David Holcman", "title": "The Narrow Escape problem in a flat cylindrical microdomain with\n  application to diffusion in the synaptic cleft", "comments": "24 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mean first passage time (MFPT) for a Brownian particle to reach a small\ntarget in cellular microdomains is a key parameter for chemical activation.\nAlthough asymptotic estimations of the MFPT are available for various\ngeometries, these formula cannot be applied to degenerated structures where one\ndimension of is much smaller compared to the others. Here we study the narrow\nescape time (NET) problem for a Brownian particle to reach a small target\nlocated on the surface of a flat cylinder, where the cylinder height is\ncomparable to the target size, and much smaller than the cylinder radius. When\nthe cylinder is sealed, we estimate the MFPT for a Brownian particle to hit a\nsmall disk located centrally on the lower surface. For a laterally open\ncylinder, we estimate the conditional probability and the conditional MFPT to\nreach the small disk before exiting through the lateral opening. We apply our\nresults to diffusion in the narrow synaptic cleft, and compute the fraction and\nthe mean time for neurotransmitters to find their specific receptors located on\nthe postsynaptic terminal. Finally, we confirm our formulas with Brownian\nsimulations.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2011 13:20:03 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Reingruber", "Juergen", ""], ["Holcman", "David", ""]]}, {"id": "1104.1106", "submitter": "Vladimir Ivancevic", "authors": "Vladimir G. Ivancevic and Tijana T. Ivancevic", "title": "Lecture Notes in Lie Groups", "comments": "74 pages, 7 figures, added medical applications", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DG math-ph math.MP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These lecture notes in Lie Groups are designed for a 1--semester third year\nor graduate course in mathematics, physics, engineering, chemistry or biology.\nThis landmark theory of the 20th Century mathematics and physics gives a\nrigorous foundation to modern dynamics, as well as field and gauge theories in\nphysics, engineering and biomechanics. We give both physical and medical\nexamples of Lie groups. The only necessary background for comprehensive reading\nof these notes are advanced calculus and linear algebra.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2011 14:08:56 GMT"}, {"version": "v2", "created": "Thu, 7 Apr 2011 03:20:56 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Ivancevic", "Vladimir G.", ""], ["Ivancevic", "Tijana T.", ""]]}, {"id": "1104.1274", "submitter": "Michal Komorowski", "authors": "Michal Komorowski, Maria J. Costa, David A. Rand, Michael Stumpf", "title": "Sensitivity, robustness and identifiability in stochastic chemical\n  kinetics models", "comments": null, "journal-ref": null, "doi": "10.1073/pnas.1015814108", "report-no": null, "categories": "stat.AP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel and simple method to numerically calculate Fisher\nInformation Matrices for stochastic chemical kinetics models. The linear noise\napproximation is used to derive model equations and a likelihood function which\nleads to an efficient computational algorithm. Our approach reduces the problem\nof calculating the Fisher Information Matrix to solving a set of ordinary\ndifferential equations. {This is the first method to compute Fisher Information\nfor stochastic chemical kinetics models without the need for Monte Carlo\nsimulations.} This methodology is then used to study sensitivity, robustness\nand parameter identifiability in stochastic chemical kinetics models. We show\nthat significant differences exist between stochastic and deterministic models\nas well as between stochastic models with time-series and time-point\nmeasurements. We demonstrate that these discrepancies arise from the\nvariability in molecule numbers, correlations between species, and temporal\ncorrelations and show how this approach can be used in the analysis and design\nof experiments probing stochastic processes at the cellular level. The\nalgorithm has been implemented as a Matlab package and is available from the\nauthors upon request.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2011 09:07:39 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Komorowski", "Michal", ""], ["Costa", "Maria J.", ""], ["Rand", "David A.", ""], ["Stumpf", "Michael", ""]]}, {"id": "1104.1538", "submitter": "Sven Herrmann", "authors": "Sven Herrmann and Vincent Moulton", "title": "Trees, Tight-Spans and Point Configuration", "comments": "21 pages, 2 figures", "journal-ref": "Discrete Mathematics, 312 (2012), 2506-2521", "doi": "10.1016/j.disc.2012.05.003", "report-no": null, "categories": "math.CO math.MG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tight-spans of metrics were first introduced by Isbell in 1964 and\nrediscovered and studied by others, most notably by Dress, who gave them this\nname. Subsequently, it was found that tight-spans could be defined for more\ngeneral maps, such as directed metrics and distances, and more recently for\ndiversities. In this paper, we show that all of these tight-spans as well as\nsome related constructions can be defined in terms of point configurations.\nThis provides a useful way in which to study these objects in a unified and\nsystematic way. We also show that by using point configurations we can recover\nresults concerning one-dimensional tight-spans for all of the maps we consider,\nas well as extend these and other results to more general maps such as\nsymmetric and unsymmetric maps.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2011 10:10:27 GMT"}, {"version": "v2", "created": "Wed, 6 Jun 2012 23:11:29 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Herrmann", "Sven", ""], ["Moulton", "Vincent", ""]]}, {"id": "1104.1775", "submitter": "Arni S.R. Srinivasa Rao", "authors": "Arni S.R. Srinivasa Rao", "title": "Biometric Cards for Indian Population: Role of Mathematical Models in\n  Assisting and Planning", "comments": "Short note", "journal-ref": "Arni S. R. Srinivasa Rao (2011): Biometric Cards for Indian\n  Population: Role of Mathematical Models in Assisting and Planning Asian\n  Population Studies, 7:3, 295-300. Publisher: Routledge: Taylor & Francis\n  Group", "doi": "10.1080/17441730.2011.608991", "report-no": null, "categories": "stat.AP q-bio.OT q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical models could be helpful in assisting the Indian Government's new\ninitiative of issuing biometric cards to its citizens. In this note, we look\ninto the role of mathematical models in estimating the missing, non-enumerated\npopulation numbers, estimating annual numbers of cards required by age, gender\nand regions in India. The linkage between National Population Register and\nbiometric cards is also highlighted. See technical Appendices. There are other\nscientific issues, namely, electronic, data storage management, identity\nverification etc, which we do not address in this paper.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2011 15:19:46 GMT"}, {"version": "v2", "created": "Mon, 25 Apr 2011 15:35:54 GMT"}, {"version": "v3", "created": "Thu, 28 Apr 2011 10:37:02 GMT"}], "update_date": "2011-10-11", "authors_parsed": [["Rao", "Arni S. R. Srinivasa", ""]]}, {"id": "1104.1803", "submitter": "Anahita Mirtabatabaei", "authors": "Anahita Mirtabatabaei, Francesco Bullo, Mustafa Khammash", "title": "Flow Cytometry Based State Aggregation of a Stochastic Model of Protein\n  Expression", "comments": "7 pages, submitted to CDC2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we introduce the new approach \"fluorescence grid based\naggregation (FGBA)\" to justify a dynamical model of protein expression using\nexperimental fluorescence histograms. In this approach, first, we describe the\ndynamics of the gene-protein system by a chemical master equation (CME), while\nthe protein production rates are unknown. Then, we aggregate the states of the\nCME into unknown group sizes. We show that these unknown values can be replaced\nby the data from the experimental fluorescence histograms. Consequently, final\nprobability distributions correspond to the experimental fluorescence\nhistograms.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2011 21:00:45 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Mirtabatabaei", "Anahita", ""], ["Bullo", "Francesco", ""], ["Khammash", "Mustafa", ""]]}, {"id": "1104.1923", "submitter": "Nan M. Laird", "authors": "Nan M. Laird", "title": "The EM Algorithm in Genetics, Genomics and Public Health", "comments": "Published in at http://dx.doi.org/10.1214/08-STS270 the Statistical\n  Science (http://www.imstat.org/sts/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Statistical Science 2010, Vol. 25, No. 4, 450-457", "doi": "10.1214/08-STS270", "report-no": "IMS-STS-STS270", "categories": "stat.ME q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The popularity of the EM algorithm owes much to the 1977 paper by Dempster,\nLaird and Rubin. That paper gave the algorithm its name, identified the general\nform and some key properties of the algorithm and established its broad\napplicability in scientific research. This review gives a nontechnical\nintroduction to the algorithm for a general scientific audience, and presents a\nfew examples characteristic of its application.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2011 12:07:03 GMT"}], "update_date": "2011-04-12", "authors_parsed": [["Laird", "Nan M.", ""]]}, {"id": "1104.2180", "submitter": "Xiaodan Fan", "authors": "Xiaodan Fan, Yuan Yuan, Jun S. Liu", "title": "The EM Algorithm and the Rise of Computational Biology", "comments": "Published in at http://dx.doi.org/10.1214/09-STS312 the Statistical\n  Science (http://www.imstat.org/sts/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Statistical Science 2010, Vol. 25, No. 4, 476-491", "doi": "10.1214/09-STS312", "report-no": "IMS-STS-STS312", "categories": "stat.ME q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past decade computational biology has grown from a cottage industry\nwith a handful of researchers to an attractive interdisciplinary field,\ncatching the attention and imagination of many quantitatively-minded\nscientists. Of interest to us is the key role played by the EM algorithm during\nthis transformation. We survey the use of the EM algorithm in a few important\ncomputational biology problems surrounding the \"central dogma\"; of molecular\nbiology: from DNA to RNA and then to proteins. Topics of this article include\nsequence motif discovery, protein sequence alignment, population genetics,\nevolutionary models and mRNA expression microarray data analysis.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2011 12:08:54 GMT"}], "update_date": "2011-04-13", "authors_parsed": [["Fan", "Xiaodan", ""], ["Yuan", "Yuan", ""], ["Liu", "Jun S.", ""]]}, {"id": "1104.2225", "submitter": "Celia Blanco", "authors": "Celia Blanco and David Hochberg", "title": "Chiral polymerization: symmetry breaking and entropy production in\n  closed systems", "comments": null, "journal-ref": "Phys. Chem. Chem. Phys., 2011, 13, 839-849", "doi": "10.1039/C0CP00992J", "report-no": null, "categories": "q-bio.QM physics.bio-ph physics.chem-ph q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solve numerically a kinetic model of chiral polymerization in systems\nclosed to matter and energy flow, paying special emphasis to its ability to\namplify the small initial enantiomeric excesses due to the internal and\nunavoidable statistical fluctuations. The reaction steps are assumed to be\nreversible, implying a thermodynamic constraint among some of the rate\nconstants. Absolute asymmetric synthesis is achieved in this scheme. The system\ncan persist for long times in quasi- stationary chiral asymmetric states before\nracemizing. Strong inhibition leads to long-period chiral oscillations in the\nenantiomeric excesses of the longest homopolymer chains. We also calculate the\nentropy production {\\sigma} per unit volume and show that {\\sigma} increases to\na peak value either before or in the vicinity of the chiral symmetry breaking\ntransition.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2011 14:21:57 GMT"}], "update_date": "2017-03-15", "authors_parsed": [["Blanco", "Celia", ""], ["Hochberg", "David", ""]]}, {"id": "1104.2229", "submitter": "Celia Blanco", "authors": "Celia Blanco, Michael Stich and David Hochberg", "title": "Temporary mirror symmetry breaking and chiral excursions in open and\n  closed systems", "comments": null, "journal-ref": "Chemical Physics Letters 505 (2011) 140-147", "doi": "10.1016/j.cplett.2011.02.032", "report-no": null, "categories": "physics.chem-ph cond-mat.soft q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The reversible Frank model is capable of amplifying the initial small\nstatistical deviations from the idealized racemic composition. This temporary\namplification can be interpreted as a chiral excursion in a dynamic phase\nspace. It is well known that if the system is open to matter and energy\nexchange, a permanently chiral state can be reached asymptotically, while the\nfinal state is necessarily racemic if the system is closed. In this work, we\ncombine phase space analysis, stability analysis and numerical simulations to\nstudy the initial chiral excursions and determine how they depend on whether\nthe system is open, semi-open or closed.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2011 14:37:55 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Blanco", "Celia", ""], ["Stich", "Michael", ""], ["Hochberg", "David", ""]]}, {"id": "1104.2515", "submitter": "Alain Barrat", "authors": "L. Isella, M. Romano, A. Barrat, C. Cattuto, V. Colizza, W. Van den\n  Broeck, F. Gesualdo, E. Pandolfi, L. Rav\\`a, C. Rizzo, A.E. Tozzi", "title": "Close encounters in a pediatric ward: measuring face-to-face proximity\n  and mixing patterns with wearable sensors", "comments": null, "journal-ref": "PLoS ONE 6(2): e17144 (2011)", "doi": "10.1371/journal.pone.0017144", "report-no": null, "categories": "q-bio.QM cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nosocomial infections place a substantial burden on health care systems and\nrepresent a major issue in current public health, requiring notable efforts for\nits prevention. Understanding the dynamics of infection transmission in a\nhospital setting is essential for tailoring interventions and predicting the\nspread among individuals. Mathematical models need to be informed with accurate\ndata on contacts among individuals. We used wearable active Radio-Frequency\nIdentification Devices to detect face-to-face contacts among individuals with a\nspatial resolution of about 1.5 meters, and a time resolution of 20 seconds.\nThe study was conducted in a general pediatrics hospital ward, during a\none-week period, and included 119 participants. Nearly 16,000 contacts were\nrecorded during the study, with a median of approximately 20 contacts per\nparticipants per day. Overall, 25% of the contacts involved a ward assistant,\n23% a nurse, 22% a patient, 22% a caregiver, and 8% a physician. The majority\nof contacts were of brief duration, but long and frequent contacts especially\nbetween patients and caregivers were also found. In the setting under study,\ncaregivers do not represent a significant potential for infection spread to a\nlarge number of individuals, as their interactions mainly involve the\ncorresponding patient. Nurses would deserve priority in prevention strategies\ndue to their central role in the potential propagation paths of infections. Our\nstudy shows the feasibility of accurate and reproducible measures of the\npattern of contacts in a hospital setting. The results are particularly useful\nfor the study of the spread of respiratory infections, for monitoring critical\npatterns, and for setting up tailored prevention strategies. Proximity-sensing\ntechnology should be considered as a valuable tool for measuring such patterns\nand evaluating nosocomial prevention strategies in specific settings.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2011 14:42:48 GMT"}], "update_date": "2011-04-14", "authors_parsed": [["Isella", "L.", ""], ["Romano", "M.", ""], ["Barrat", "A.", ""], ["Cattuto", "C.", ""], ["Colizza", "V.", ""], ["Broeck", "W. Van den", ""], ["Gesualdo", "F.", ""], ["Pandolfi", "E.", ""], ["Ravà", "L.", ""], ["Rizzo", "C.", ""], ["Tozzi", "A. E.", ""]]}, {"id": "1104.2616", "submitter": "Pascal Grange", "authors": "Pascal Grange, Partha P. Mitra", "title": "Algorithmic choice of coordinates for injections into the brain:\n  encoding a neuroanatomical atlas on a grid", "comments": "13 pages, LaTeX", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.med-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given an atlas of the brain and a number of injections to be performed in\norder to map out the connections between parts of the brain, we propose an\nalgorithm to compute the coordinates of the injections. The algorithm is\ndesigned to sample the brain in the most homogeneous way compatible with the\nseparation of brain regions. It can be applied to other species for which a\nneuroanatomical atlas is available. The computation is tested on the annotation\nat a resolution of 25 microns corresponding to the Allen Reference Atlas, which\nis hierarchical and consists of 209 regions. The resulting injection\ncoordinates are being used for the injection protocol of the Mouse Brain\nArchitecture project. Due to its large size and layered structure, the cerebral\ncortex is treated in a separate algorithm, which is more adapted to its\ngeometry.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2011 20:46:43 GMT"}], "update_date": "2011-04-15", "authors_parsed": [["Grange", "Pascal", ""], ["Mitra", "Partha P.", ""]]}, {"id": "1104.2854", "submitter": "Harold P. de Vladar", "authors": "Harold P. de Vladar and Nick H. Barton", "title": "The contribution of statistical physics to evolutionary biology", "comments": "18 pages, 3 figures, glossary. Accepted in Trend in Ecology and\n  Evolution (to appear in print in August 2011)", "journal-ref": null, "doi": "10.1016/j.tree.2011.04.002", "report-no": null, "categories": "q-bio.PE nlin.AO nlin.PS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary biology shares many concepts with statistical physics: both deal\nwith populations, whether of molecules or organisms, and both seek to simplify\nevolution in very many dimensions. Often, methodologies have undergone parallel\nand independent development, as with stochastic methods in population genetics.\nWe discuss aspects of population genetics that have embraced methods from\nphysics: amongst others, non-equilibrium statistical mechanics, travelling\nwaves, and Monte-Carlo methods have been used to study polygenic evolution,\nrates of adaptation, and range expansions. These applications indicate that\nevolutionary biology can further benefit from interactions with other areas of\nstatistical physics, for example, by following the distribution of paths taken\nby a population through time.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2011 18:14:50 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["de Vladar", "Harold P.", ""], ["Barton", "Nick H.", ""]]}, {"id": "1104.2871", "submitter": "Tobias Reichenbach", "authors": "Tobias Reichenbach and A. J. Hudspeth", "title": "Unidirectional mechanical amplification as a design principle for an\n  active microphone", "comments": "4 pages, 3 figures plus supplementary information", "journal-ref": "Phys. Rev. Lett. 106, 158701 (2011)", "doi": "10.1103/PhysRevLett.106.158701", "report-no": null, "categories": "physics.ins-det physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Amplification underlies the operation of many biological and engineering\nsystems. Simple electrical, optical, and mechanical amplifiers are reciprocal:\nthe backward coupling of the output to the input equals the forward coupling of\nthe input to the output. Unidirectional amplifiers that occur often in\nelectrical and optical systems are special non-reciprocal devices in which the\noutput does not couple back to the input even though the forward coupling\npersists. Here we propose a scheme for unidirectional mechanical amplification\nthat we utilize to construct an active microphone. We show that amplification\nimproves the microphone's threshold for detecting weak signals and that\nunidirectionality prevents distortion.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2011 18:56:40 GMT"}], "update_date": "2011-04-15", "authors_parsed": [["Reichenbach", "Tobias", ""], ["Hudspeth", "A. J.", ""]]}, {"id": "1104.2995", "submitter": "Inken Wohlers", "authors": "Inken Wohlers (MAC4), Rumen Andonov (INRIA - IRISA), Gunnar W. Klau\n  (MAC4)", "title": "Algorithm engineering for optimal alignment of protein structure\n  distance matrices", "comments": null, "journal-ref": "Optimization Letters (2011)", "doi": "10.1007/s11590-011-0313-3", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein structural alignment is an important problem in computational\nbiology. In this paper, we present first successes on provably optimal pairwise\nalignment of protein inter-residue distance matrices, using the popular Dali\nscoring function. We introduce the structural alignment problem formally, which\nenables us to express a variety of scoring functions used in previous work as\nspecial cases in a unified framework. Further, we propose the first\nmathematical model for computing optimal structural alignments based on dense\ninter-residue distance matrices. We therefore reformulate the problem as a\nspecial graph problem and give a tight integer linear programming model. We\nthen present algorithm engineering techniques to handle the huge integer linear\nprograms of real-life distance matrix alignment problems. Applying these\ntechniques, we can compute provably optimal Dali alignments for the very first\ntime.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2011 09:17:16 GMT"}], "update_date": "2011-04-18", "authors_parsed": [["Wohlers", "Inken", "", "MAC4"], ["Andonov", "Rumen", "", "INRIA - IRISA"], ["Klau", "Gunnar W.", "", "MAC4"]]}, {"id": "1104.3360", "submitter": "Shiladitya Banerjee", "authors": "Shiladitya Banerjee, M. Cristina Marchetti and Kristian\n  M\\\"uller-Nedebock", "title": "Motor-driven Dynamics of Cytoskeletal FIlaments in Motility Assays", "comments": "13 pages, 8 figures, 1 Table", "journal-ref": "Phys. Rev. E 84, 011914 (2011)", "doi": "10.1103/PhysRevE.84.011914", "report-no": null, "categories": "cond-mat.stat-mech q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We model analytically the dynamics of a cytoskeletal filament in a motility\nassay. The filament is described as rigid rod free to slide in two dimensions.\nThe motor proteins consist of polymeric tails tethered to the plane and modeled\nas linear springs and motor heads that bind to the filament. As in related\nmodels of rigid and soft two-state motors, the binding/unbinding dynamics of\nthe motor heads and the dependence of the transition rates on the load exerted\nby the motor tails play a crucial role in controlling the filament's dynamics.\nOur work shows that the filament effectively behaves as a self-propelled rod at\nlong times, but with non-Markovian noise sources arising from the coupling to\nthe motor binding/unbinding dynamics. The effective propulsion force of the\nfilament and the active renormalization of the various friction and diffusion\nconstants are calculated in terms of microscopic motor and filament parameters.\nThese quantities could be probed by optical force microscopy.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2011 23:32:09 GMT"}, {"version": "v2", "created": "Tue, 19 Apr 2011 12:02:41 GMT"}, {"version": "v3", "created": "Fri, 10 Jun 2011 14:44:10 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Banerjee", "Shiladitya", ""], ["Marchetti", "M. Cristina", ""], ["Müller-Nedebock", "Kristian", ""]]}, {"id": "1104.3559", "submitter": "Bradly  Alicea", "authors": "Bradly Alicea", "title": "The \"Machinery\" of Biocomplexity: understanding non-optimal\n  architectures in biological systems", "comments": "16 pages, 8 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM nlin.AO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One popular assumption regarding biological systems is that traits have\nevolved to be optimized with respect to function. This is a standard goal in\nevolutionary computation, and while not always embraced in the biological\nsciences, is an underlying assumption of what happens when fitness is\nmaximized. The implication of this is that a signaling pathway or phylogeny\nshould show evidence of minimizing the number of steps required to produce a\nbiochemical product or phenotypic adaptation. In this paper, it will be shown\nthat a principle of \"maximum intermediate steps\" may also characterize complex\nbiological systems, especially those in which extreme historical contingency or\na combination of mutation and recombination are key features. The contribution\nto existing literature is two-fold: demonstrating both the potential for\nnon-optimality in engineered systems with \"lifelike\" attributes, and the\nunderpinnings of non-optimality in naturalistic contexts.\n  This will be demonstrated by using the Rube Goldberg Machine (RGM) analogy.\nMechanical RGMs will be introduced, and their relationship to conceptual\nbiological RGMs. Exemplars of these biological RGMs and their evolution (e.g.\nintroduction of mutations and recombination-like inversions) will be\ndemonstrated using block diagrams and interconnections with complex networks\n(called convolution architectures). The conceptual biological RGM will then be\nmapped to an artificial vascular system, which can be modeled using\nmicrofluidic-like structures. Theoretical expectations will be presented,\nparticularly regarding whether or not maximum intermediate steps equates to the\nrescue or reuse of traits compromised by previous mutations or inversions.\nConsiderations for future work and applications will then be discussed,\nincluding the incorporation of such convolution architectures into complex\nnetworks.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2011 18:44:26 GMT"}, {"version": "v2", "created": "Wed, 27 Apr 2011 18:36:42 GMT"}, {"version": "v3", "created": "Thu, 28 Apr 2011 19:15:15 GMT"}, {"version": "v4", "created": "Mon, 19 Aug 2013 15:51:34 GMT"}, {"version": "v5", "created": "Sat, 13 Sep 2014 01:32:25 GMT"}], "update_date": "2014-09-16", "authors_parsed": [["Alicea", "Bradly", ""]]}, {"id": "1104.3665", "submitter": "Remi Monasson", "authors": "Simona Cocco (LPS), Remi Monasson (LPTENS), Vitor Sessak (LPTENS)", "title": "High-Dimensional Inference with the generalized Hopfield Model:\n  Principal Component Analysis and Corrections", "comments": "Physical Review E: Statistical, Nonlinear, and Soft Matter Physics\n  (2011) to appear", "journal-ref": null, "doi": "10.1103/PhysRevE.83.051123", "report-no": null, "categories": "cond-mat.stat-mech q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of inferring the interactions between a set of N\nbinary variables from the knowledge of their frequencies and pairwise\ncorrelations. The inference framework is based on the Hopfield model, a special\ncase of the Ising model where the interaction matrix is defined through a set\nof patterns in the variable space, and is of rank much smaller than N. We show\nthat Maximum Lik elihood inference is deeply related to Principal Component\nAnalysis when the amp litude of the pattern components, xi, is negligible\ncompared to N^1/2. Using techniques from statistical mechanics, we calculate\nthe corrections to the patterns to the first order in xi/N^1/2. We stress that\nit is important to generalize the Hopfield model and include both attractive\nand repulsive patterns, to correctly infer networks with sparse and strong\ninteractions. We present a simple geometrical criterion to decide how many\nattractive and repulsive patterns should be considered as a function of the\nsampling noise. We moreover discuss how many sampled configurations are\nrequired for a good inference, as a function of the system size, N and of the\namplitude, xi. The inference approach is illustrated on synthetic and\nbiological data.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2011 08:01:25 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Cocco", "Simona", "", "LPS"], ["Monasson", "Remi", "", "LPTENS"], ["Sessak", "Vitor", "", "LPTENS"]]}, {"id": "1104.3707", "submitter": "Cedric Ginestet", "authors": "Cedric E. Ginestet, Thomas E. Nichols, Ed T. Bullmore, Andrew Simmons", "title": "Brain Network Analysis: Separating Cost from Topology using\n  Cost-integration", "comments": "Accepted for publication in PLoS one, in June 2011", "journal-ref": null, "doi": "10.1371/journal.pone.0021570", "report-no": null, "categories": "q-bio.MN q-bio.NC q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A statistically principled way of conducting weighted network analysis is\nstill lacking. Comparison of different populations of weighted networks is hard\nbecause topology is inherently dependent on wiring cost, where cost is defined\nas the number of edges in an unweighted graph. In this paper, we evaluate the\nbenefits and limitations associated with using cost-integrated topological\nmetrics. Our focus is on comparing populations of weighted undirected graphs\nusing global efficiency. We evaluate different approaches to the comparison of\nweighted networks that differ in mean association weight. Our key result shows\nthat integrating over cost is equivalent to controlling for any monotonic\ntransformation of the weight set of a weighted graph. That is, when integrating\nover cost, we eliminate the differences in topology that may be due to a\nmonotonic transformation of the weight set. Our result holds for any unweighted\ntopological measure. Cost-integration is therefore helpful in disentangling\ndifferences in cost from differences in topology. By contrast, we show that the\nuse of the weighted version of a topological metric does not constitute a valid\napproach to this problem. Indeed, we prove that, under mild conditions, the use\nof the weighted version of global efficiency is equivalent to simply comparing\nweighted costs. Thus, we recommend the reporting of (i) differences in weighted\ncosts and (ii) differences in cost-integrated topological measures. We\ndemonstrate the application of these techniques in a re-analysis of an fMRI\nworking memory task. Finally, we discuss the limitations of integrating\ntopology over cost, which may pose problems when some weights are zero, when\nmultiplicities exist in the ranks of the weights, and when one expects subtle\ncost-dependent topological differences, which could be masked by\ncost-integration.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2011 10:56:44 GMT"}, {"version": "v2", "created": "Thu, 9 Jun 2011 05:49:51 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Ginestet", "Cedric E.", ""], ["Nichols", "Thomas E.", ""], ["Bullmore", "Ed T.", ""], ["Simmons", "Andrew", ""]]}, {"id": "1104.3783", "submitter": "Aldo Di Biasio", "authors": "Aldo Di Biasio, Elena Agliari, Adriano Barra and Raffaella Burioni", "title": "Mean-field cooperativity in chemical kinetics", "comments": "25 pages, 4 figures", "journal-ref": "Theoretical Chemistry Accounts (2012)", "doi": "10.1007/s00214-012-1104-3", "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech physics.chem-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider cooperative reactions and we study the effects of the interaction\nstrength among the system components on the reaction rate, hence realizing a\nconnection between microscopic and macroscopic observables. Our approach is\nbased on statistical mechanics models and it is developed analytically via\nmean-field techniques. First of all, we show that, when the coupling strength\nis set positive, the model is able to consistently recover all the various\ncooperative measures previously introduced, hence obtaining a single unifying\nframework. Furthermore, we introduce a criterion to discriminate between weak\nand strong cooperativity, based on a measure of \"susceptibility\". We also\nproperly extend the model in order to account for multiple attachments\nphenomena: this is realized by incorporating within the model $p$-body\ninteractions, whose non-trivial cooperative capability is investigated too.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2011 15:45:35 GMT"}], "update_date": "2012-06-07", "authors_parsed": [["Di Biasio", "Aldo", ""], ["Agliari", "Elena", ""], ["Barra", "Adriano", ""], ["Burioni", "Raffaella", ""]]}, {"id": "1104.4304", "submitter": "Jason Graham", "authors": "Jason M. Graham and Bruce P. Ayati and Prem S. Ramakrishnan and James\n  A. Martin", "title": "Towards a New Spatial Representation of Bone Remodeling", "comments": "Math. Biosci. Eng., 9(2), 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Irregular bone remodeling is associated with a number of bone diseases such\nas osteoporosis and multiple myeloma.\n  Computational and mathematical modeling can aid in therapy and treatment as\nwell as understanding fundamental biology. Different approaches to modeling\ngive insight into different aspects of a phenomena so it is useful to have an\narsenal of various computational and mathematical models.\n  Here we develop a mathematical representation of bone remodeling that can\neffectively describe many aspects of the complicated geometries and spatial\nbehavior observed.\n  There is a sharp interface between bone and marrow regions. Also the surface\nof bone moves in and out, i.e. in the normal direction, due to remodeling.\nBased on these observations we employ the use of a level-set function to\nrepresent the spatial behavior of remodeling. We elaborate on a temporal model\nfor osteoclast and osteoblast population dynamics to determine the change in\nbone mass which influences how the interface between bone and marrow changes.\n  We exhibit simulations based on our computational model that show the motion\nof the interface between bone and marrow as a consequence of bone remodeling.\nThe simulations show that it is possible to capture spatial behavior of bone\nremodeling in complicated geometries as they occur \\emph{in vitro} and \\emph{in\nvivo}.\n  By employing the level set approach it is possible to develop computational\nand mathematical representations of the spatial behavior of bone remodeling. By\nincluding in this formalism further details, such as more complex cytokine\ninteractions and accurate parameter values, it is possible to obtain\nsimulations of phenomena related to bone remodeling with spatial behavior much\nas \\emph{in vitro} and \\emph{in vivo}. This makes it possible to perform\n\\emph{in silica} experiments more closely resembling experimental observations.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2011 16:25:42 GMT"}, {"version": "v2", "created": "Mon, 12 Mar 2012 15:24:19 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Graham", "Jason M.", ""], ["Ayati", "Bruce P.", ""], ["Ramakrishnan", "Prem S.", ""], ["Martin", "James A.", ""]]}, {"id": "1104.4337", "submitter": "Rhiju Das", "authors": "Sungroh Yoon, Jinkyu Kim, Justine Hum, Hanjoo Kim, Seunghyun Park,\n  Wipapat Kladwang, and Rhiju Das", "title": "HiTRACE: High-throughput robust analysis for capillary electrophoresis", "comments": "Revised to include Supplement. Availability: HiTRACE is freely\n  available for download at http://hitrace.stanford.edu", "journal-ref": null, "doi": "10.1093/bioinformatics/btr277", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Capillary electrophoresis (CE) of nucleic acids is a workhorse\ntechnology underlying high-throughput genome analysis and large-scale chemical\nmapping for nucleic acid structural inference. Despite the wide availability of\nCE-based instruments, there remain challenges in leveraging their full power\nfor quantitative analysis of RNA and DNA structure, thermodynamics, and\nkinetics. In particular, the slow rate and poor automation of available\nanalysis tools have bottlenecked a new generation of studies involving hundreds\nof CE profiles per experiment.\n  Results: We propose a computational method called high-throughput robust\nanalysis for capillary electrophoresis (HiTRACE) to automate the key tasks in\nlarge-scale nucleic acid CE analysis, including the profile alignment that has\nheretofore been a rate-limiting step in the highest throughput experiments. We\nillustrate the application of HiTRACE on thirteen data sets representing 4\ndifferent RNAs, three chemical modification strategies, and up to 480 single\nmutant variants; the largest data sets each include 87,360 bands. By applying a\nseries of robust dynamic programming algorithms, HiTRACE outperforms prior\ntools in terms of alignment and fitting quality, as assessed by measures\nincluding the correlation between quantified band intensities between replicate\ndata sets. Furthermore, while the smallest of these data sets required 7 to 10\nhours of manual intervention using prior approaches, HiTRACE quantitation of\neven the largest data sets herein was achieved in 3 to 12 minutes. The HiTRACE\nmethod therefore resolves a critical barrier to the efficient and accurate\nanalysis of nucleic acid structure in experiments involving tens of thousands\nof electrophoretic bands.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2011 19:17:35 GMT"}, {"version": "v2", "created": "Fri, 22 Apr 2011 17:50:11 GMT"}, {"version": "v3", "created": "Thu, 12 May 2011 23:04:25 GMT"}], "update_date": "2011-05-16", "authors_parsed": [["Yoon", "Sungroh", ""], ["Kim", "Jinkyu", ""], ["Hum", "Justine", ""], ["Kim", "Hanjoo", ""], ["Park", "Seunghyun", ""], ["Kladwang", "Wipapat", ""], ["Das", "Rhiju", ""]]}, {"id": "1104.4338", "submitter": "Eben Kenah", "authors": "Eben Kenah", "title": "Nonparametric survival analysis of epidemic data", "comments": "30 pages, 6 figures", "journal-ref": "Journal of the Royal Statistical Society B 75(2): 277-303 (2013)", "doi": "10.1111/j.1467-9868.2012.01042.x", "report-no": null, "categories": "stat.ME q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops nonparametric methods for the survival analysis of\nepidemic data based on contact intervals. The contact interval from person i to\nperson j is the time between the onset of infectiousness in i and infectious\ncontact from i to j, where we define infectious contact as a contact sufficient\nto infect a susceptible individual. We show that the Nelson-Aalen estimator\nproduces an unbiased estimate of the contact interval cumulative hazard\nfunction when who-infects-whom is observed. When who-infects-whom is not\nobserved, we average the Nelson-Aalen estimates from all transmission networks\nconsistent with the observed data using an EM algorithm. This converges to a\nnonparametric MLE of the contact interval cumulative hazard function that we\ncall the marginal Nelson-Aalen estimate. We study the behavior of these methods\nin simulations and use them to analyze household surveillance data from the\n2009 influenza A(H1N1) pandemic. In an appendix, we show that these methods\nextend chain-binomial models to continuous time.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2011 19:18:14 GMT"}], "update_date": "2015-07-16", "authors_parsed": [["Kenah", "Eben", ""]]}, {"id": "1104.4524", "submitter": "Jinzhi Lei JL", "authors": "Jinzhi Lei", "title": "Stochastic Modeling in Systems Biology", "comments": "25 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many cellular behaviors are regulated by gene regulation networks, kinetics\nof which is one of the main subjects in the study of systems biology. Because\nof the low number molecules in these reacting systems, stochastic effects are\nsignificant. In recent years, stochasticity in modeling the kinetics of gene\nregulation networks have been drawing the attention of many researchers. This\npaper is a self contained review trying to provide an overview of stochastic\nmodeling. I will introduce the derivation of the main equations in modeling the\nbiochemical systems with intrinsic noise (chemical master equation, Fokker-Plan\nequation, reaction rate equation, chemical Langevin equation), and will discuss\nthe relations between these formulations. The mathematical formulations for\nsystems with fluctuations in kinetic parameters are also discussed. Finally, I\nwill introduce the exact stochastic simulation algorithm and the approximate\nexplicit tau-leaping method for making numerical simulations.\n", "versions": [{"version": "v1", "created": "Sat, 23 Apr 2011 01:41:18 GMT"}], "update_date": "2011-04-26", "authors_parsed": [["Lei", "Jinzhi", ""]]}, {"id": "1104.4549", "submitter": "Feng Gan", "authors": "Feng Gan, Gang Ye, Langxia Liu, Xiaohui Liu", "title": "A General Theory for Direct Quantitative Analysis of Antigen", "comments": "7pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A theory for direct quantitative analysis of an antigen is proposed. It is\nbased on a potential homogenous immunoreaction system. It establishes an\nequation to describe the concentration change of the antigen and antibody\ncomplex. A maximum point is found in the concentration profile of the complex\nwhich can be used to calculate the concentration of the antigen. An\nexperimental scheme was designed for a commercial time-resolved\nfluoroimmunoassay kit for HBsAg, which is based heterogeneous immunoreaction.\nThe results showed that the theory is practically applicable.\n", "versions": [{"version": "v1", "created": "Sat, 23 Apr 2011 11:37:58 GMT"}, {"version": "v2", "created": "Thu, 26 Jul 2012 06:46:12 GMT"}], "update_date": "2012-07-27", "authors_parsed": [["Gan", "Feng", ""], ["Ye", "Gang", ""], ["Liu", "Langxia", ""], ["Liu", "Xiaohui", ""]]}, {"id": "1104.4720", "submitter": "Hadi Poormohammadi", "authors": "Ruzbeh Tusserkani and Changiz Eslahchi and Hadi Poormohammadi and Azin\n  Azadi", "title": "TripNet: A Method for Constructing Phylogenetic Networks from Triplets", "comments": "12 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We present TripNet, a method for constructing phylogenetic networks from\ntriplets. We will present the motivations behind our approach and its\ntheoretical and empirical justification. To demonstrate the accuracy and\nefficiency of TripNet, we performed two simulations and also applied the method\nto five published data sets: Kreitman's data, a set of triplets from real yeast\ndata obtained from the Fungal Biodiversity Center in Utrecht, a collection of\n110 highly recombinant Salmonella multi-locus sequence typing sequences, and\nnrDNA ITS and cpDNA JSA sequence data of New Zealand alpine buttercups of\nRanunculus sect. Pseudadonis. Finally, we compare our results with those\nalready obtained by other authors using alternative methods. TripNet, data\nsets, and supplementary files are freely available for download at\n(www.bioinf.cs.ipm.ir/softwares/tripnet).\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 13:44:25 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Tusserkani", "Ruzbeh", ""], ["Eslahchi", "Changiz", ""], ["Poormohammadi", "Hadi", ""], ["Azadi", "Azin", ""]]}, {"id": "1104.4913", "submitter": "Andr\\'es D. Medus", "authors": "A. D. Medus and C. O. Dorso", "title": "Diseases spreading through individual based models with realistic\n  mobility patterns", "comments": "19 pages, 7 figures, submitted to PRE", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.bio-ph physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The individual-based models constitute a set of widely implemented tools to\nanalyze the incidence of individuals heterogeneities in the spread of an\ninfectious disease. In this work we focus our attention on human contacts\nheterogeneities through two of the main individual-based models: mobile agents\nand complex networks models. We introduce a novel mobile agents model in which\nindividuals make displacements with sizes according to a truncated power-law\ndistribution based on empirical evidence about human mobility. Besides, we\npresent a procedure to obtain an equivalent weighted contact network from the\nprevious mobile agents model, where the weights of the links are interpreted as\ncontact probabilities. From the topological analysis of the equivalent contact\nnetworks we show that small world characteristics are related with truncated\npower-law distribution for agent displacements. Finally, we show the\nequivalence between both approaches through some numerical experiments for the\nspread of an infectious disease.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 11:45:03 GMT"}], "update_date": "2011-04-27", "authors_parsed": [["Medus", "A. D.", ""], ["Dorso", "C. O.", ""]]}, {"id": "1104.5044", "submitter": "Mike Steel Prof.", "authors": "Vincent Moulton and Mike Steel", "title": "The 'Butterfly effect' in Cayley graphs, and its relevance for\n  evolutionary genomics", "comments": "17 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.DM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Suppose a finite set $X$ is repeatedly transformed by a sequence of\npermutations of a certain type acting on an initial element $x$ to produce a\nfinal state $y$. We investigate how 'different' the resulting state $y'$ to $y$\ncan be if a slight change is made to the sequence, either by deleting one\npermutation, or replacing it with another. Here the 'difference' between $y$\nand $y'$ might be measured by the minimum number of permutations of the\npermitted type required to transform $y$ to $y'$, or by some other metric. We\ndiscuss this first in the general setting of sensitivity to perturbation of\nwalks in Cayley graphs of groups with a specified set of generators. We then\ninvestigate some permutation groups and generators arising in computational\ngenomics, and the statistical implications of the findings.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2011 22:59:13 GMT"}], "update_date": "2011-04-28", "authors_parsed": [["Moulton", "Vincent", ""], ["Steel", "Mike", ""]]}, {"id": "1104.5216", "submitter": "Michael Courtney", "authors": "Simeon Cole-Fletcher, Lucas Marin-Salcedo, Ajaya Rana, and Michael\n  Courtney", "title": "Errors in Length-weight Parameters at FishBase.org", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To investigate possible errors, length-weight parameters from FishBase.org\nwere used to graph length-weight curves for six different species: channel\ncatfish, black crappie, largemouth bass, rainbow trout, flathead catfish, and\nlake trout along with the standard weight curves (Anderson and Neumann 1996,\nBister et al. 2000). Parameters noted as doubtful by FishBase were excluded.\nFor each species, variations in curves were noted, and the minimum and maximum\npredicted weights for a 30 cm long fish were compared with each other and with\nthe standard weight for that length. For lake trout, additional comparisons\nwere made between the parameters and study details reported in FishBase.org for\n6 of 8 length-weight relationships and those reported in the reference\n(Carlander 1969) for those 6 relationships. In all species studied, minimum and\nmaximum curves produced with the length-weight parameters at FishBase.org are\nnotably different from each other, and in many cases predict weights that are\nclearly absurd. For example, one set of parameters predicts a 30 cm rainbow\ntrout weighing 44 g. For 30 cm length, the range of weights (relative to the\nstandard weight) for each species are: channel catfish (31.4% to 193.1%), black\ncrappie (54.0% to 149.0%), largemouth bass (28.8% to 130.4%), rainbow trout\n(14.9% to 113.4%), flathead catfish (29.3% to 250.7%), and lake trout (44.0% to\n152.7%). Length-weight tables at FishBase.org are not generally reliable and\nthe on-line database contains dubious parameters. Assurance of quality probably\nwill require a systematic review with more careful and comprehensive methods\nthan those currently employed.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2011 19:01:41 GMT"}], "update_date": "2011-04-28", "authors_parsed": [["Cole-Fletcher", "Simeon", ""], ["Marin-Salcedo", "Lucas", ""], ["Rana", "Ajaya", ""], ["Courtney", "Michael", ""]]}, {"id": "1104.5429", "submitter": "Caroline Berard", "authors": "Caroline B\\'erard, Marie-Laure Martin-Magniette, V\\'eronique Brunaud,\n  S\\'ebastien Aubourg and St\\'ephane Robin", "title": "Unsupervised Classification for Tiling Arrays: ChIP-chip and\n  Transcriptome", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-bio.GN q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tiling arrays make possible a large scale exploration of the genome thanks to\nprobes which cover the whole genome with very high density until 2 000 000\nprobes. Biological questions usually addressed are either the expression\ndifference between two conditions or the detection of transcribed regions. In\nthis work we propose to consider simultaneously both questions as an\nunsupervised classification problem by modeling the joint distribution of the\ntwo conditions. In contrast to previous methods, we account for all available\ninformation on the probes as well as biological knowledge like annotation and\nspatial dependence between probes. Since probes are not biologically relevant\nunits we propose a classification rule for non-connected regions covered by\nseveral probes. Applications to transcriptomic and ChIP-chip data of\nArabidopsis thaliana obtained with a NimbleGen tiling array highlight the\nimportance of a precise modeling and the region classification.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2011 15:42:24 GMT"}], "update_date": "2011-04-29", "authors_parsed": [["Bérard", "Caroline", ""], ["Martin-Magniette", "Marie-Laure", ""], ["Brunaud", "Véronique", ""], ["Aubourg", "Sébastien", ""], ["Robin", "Stéphane", ""]]}, {"id": "1104.5510", "submitter": "Fahad Saeed", "authors": "Fahad Saeed, Trairak Pisitkun, Mark A. Knepper and Jason D. Hoffert", "title": "Mining Temporal Patterns from iTRAQ Mass Spectrometry(LC-MS/MS) Data", "comments": "12 pages, 10 figures, The Proceedings of the ISCA 3rd International\n  Conference on Bioinformatics and Computational Biology (BiCoB), pp 152-159\n  New Orleans, Louisiana, USA, March 23-25, 2011 (ISBN: 978-1-880843-81-9)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CE cs.DB cs.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large-scale proteomic analysis is emerging as a powerful technique in biology\nand relies heavily on data acquired by state-of-the-art mass spectrometers. As\nwith any other field in Systems Biology, computational tools are required to\ndeal with this ocean of data. iTRAQ (isobaric Tags for Relative and Absolute\nquantification) is a technique that allows simultaneous quantification of\nproteins from multiple samples. Although iTRAQ data gives useful insights to\nthe biologist, it is more complex to perform analysis and draw biological\nconclusions because of its multi-plexed design. One such problem is to find\nproteins that behave in a similar way (i.e. change in abundance) among various\ntime points since the temporal variations in the proteomics data reveal\nimportant biological information. Distance based methods such as Euclidian\ndistance or Pearson coefficient, and clustering techniques such as k-mean etc,\nare not able to take into account the temporal information of the series. In\nthis paper, we present an linear-time algorithm for clustering similar patterns\namong various iTRAQ time course data irrespective of their absolute values. The\nalgorithm, referred to as Temporal Pattern Mining(TPM), maps the data from a\nCartesian plane to a discrete binary plane. After the mapping a dynamic\nprogramming technique allows mining of similar data elements that are\ntemporally closer to each other. The proposed algorithm accurately clusters\niTRAQ data that are temporally closer to each other with more than 99%\naccuracy. Experimental results for different problem sizes are analyzed in\nterms of quality of clusters, execution time and scalability for large data\nsets. An example from our proteomics data is provided at the end to demonstrate\nthe performance of the algorithm and its ability to cluster temporal series\nirrespective of their distance from each other.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2011 20:41:43 GMT"}], "update_date": "2011-05-02", "authors_parsed": [["Saeed", "Fahad", ""], ["Pisitkun", "Trairak", ""], ["Knepper", "Mark A.", ""], ["Hoffert", "Jason D.", ""]]}]