[{"id": "1106.0134", "submitter": "Jean-Philippe Vert", "authors": "Fantine Mordelet (CBIO, CREST), Jean-Philippe Vert (CBIO)", "title": "ProDiGe: PRioritization Of Disease Genes with multitask machine learning\n  from positive and unlabeled examples", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Elucidating the genetic basis of human diseases is a central goal of genetics\nand molecular biology. While traditional linkage analysis and modern\nhigh-throughput techniques often provide long lists of tens or hundreds of\ndisease gene candidates, the identification of disease genes among the\ncandidates remains time-consuming and expensive. Efficient computational\nmethods are therefore needed to prioritize genes within the list of candidates,\nby exploiting the wealth of information available about the genes in various\ndatabases. Here we propose ProDiGe, a novel algorithm for Prioritization of\nDisease Genes. ProDiGe implements a novel machine learning strategy based on\nlearning from positive and unlabeled examples, which allows to integrate\nvarious sources of information about the genes, to share information about\nknown disease genes across diseases, and to perform genome-wide searches for\nnew disease genes. Experiments on real data show that ProDiGe outperforms\nstate-of-the-art methods for the prioritization of genes in human diseases.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jun 2011 09:56:49 GMT"}], "update_date": "2011-06-03", "authors_parsed": [["Mordelet", "Fantine", "", "CBIO, CREST"], ["Vert", "Jean-Philippe", "", "CBIO"]]}, {"id": "1106.0143", "submitter": "Marianne Rooman", "authors": "Jaroslav Albert, Marianne Rooman", "title": "Dynamic modeling of gene expression in prokaryotes: application to\n  glucose-lactose diauxie in Escherichia coli", "comments": "20 pages, 4 figures; Systems and Synthetic Biology 5 (2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coexpression of genes or, more generally, similarity in the expression\nprofiles poses an unsurmountable obstacle to inferring the gene regulatory\nnetwork (GRN) based solely on data from DNA microarray time series. Clustering\nof genes with similar expression profiles allows for a course-grained view of\nthe GRN and a probabilistic determination of the connectivity among the\nclusters. We present a model for the temporal evolution of a gene cluster\nnetwork which takes into account interactions of gene products with genes and,\nthrough a non-constant degradation rate, with other gene products. The number\nof model parameters is reduced by using polynomial functions to interpolate\ntemporal data points. In this manner, the task of parameter estimation is\nreduced to a system of linear algebraic equations, thus making the computation\ntime shorter by orders of magnitude. To eliminate irrelevant networks, we test\neach GRN for stability with respect to parameter variations, and impose\nrestrictions on its behavior near the steady state. We apply our model and\nmethods to DNA microarray time series' data collected on Escherichia coli\nduring glucose-lactose diauxie and infer the most probable cluster network for\ndifferent phases of the experiment.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jun 2011 10:59:20 GMT"}], "update_date": "2011-06-02", "authors_parsed": [["Albert", "Jaroslav", ""], ["Rooman", "Marianne", ""]]}, {"id": "1106.0236", "submitter": "Alessia Annibale", "authors": "A. Annibale and A.C.C. Coolen", "title": "What you see is not what you get: how sampling affects macroscopic\n  features of biological networks", "comments": "26 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use mathematical methods from the theory of tailored random graphs to\nstudy systematically the effects of sampling on topological features of large\nbiological signalling networks. Our aim in doing so is to increase our\nquantitative understanding of the relation between true biological networks and\nthe imperfect and often biased samples of these networks that are reported in\npublic data repositories and used by biomedical scientists. We derive exact\nexplicit formulae for degree distributions and degree correlation kernels of\nsampled networks, in terms of the degree distributions and degree correlation\nkernels of the underlying true network, for a broad family of sampling\nprotocols that include (un-)biased node and/or link undersampling as well as\n(un-)biased link oversampling. Our predictions are in excellent agreement with\nnumerical simulations.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jun 2011 16:35:14 GMT"}], "update_date": "2011-06-02", "authors_parsed": [["Annibale", "A.", ""], ["Coolen", "A. C. C.", ""]]}, {"id": "1106.0269", "submitter": "Jason McEwen", "authors": "A. Daducci, J. D. McEwen, D. Van De Ville, J.-Ph. Thiran, Y. Wiaux", "title": "Harmonic analysis of spherical sampling in diffusion MRI", "comments": "1 page, 2 figures, 19th Annual Meeting of International Society for\n  Magnetic Resonance in Medicine", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last decade diffusion MRI has become a powerful tool to non-invasively\nstudy white-matter integrity in the brain. Recently many research groups have\nfocused their attention on multi-shell spherical acquisitions with the aim of\neffectively mapping the diffusion signal with a lower number of q-space\nsamples, hence enabling a crucial reduction of acquisition time. One of the\nquantities commonly studied in this context is the so-called orientation\ndistribution function (ODF). In this setting, the spherical harmonic (SH)\ntransform has gained a great deal of popularity thanks to its ability to\nperform convolution operations efficiently and accurately, such as the\nFunk-Radon transform notably required for ODF computation from q-space data.\nHowever, if the q-space signal is described with an unsuitable angular\nresolution at any b-value probed, aliasing (or interpolation) artifacts are\nunavoidably created. So far this aspect has been tackled empirically and, to\nour knowledge, no study has addressed this problem in a quantitative approach.\nThe aim of the present work is to study more theoretically the efficiency of\nmulti-shell spherical sampling in diffusion MRI, in order to gain understanding\nin HYDI-like approaches, possibly paving the way to further optimization\nstrategies.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jun 2011 17:54:40 GMT"}], "update_date": "2011-06-02", "authors_parsed": [["Daducci", "A.", ""], ["McEwen", "J. D.", ""], ["Van De Ville", "D.", ""], ["Thiran", "J. -Ph.", ""], ["Wiaux", "Y.", ""]]}, {"id": "1106.1356", "submitter": "Oleg Kupervasser", "authors": "Simon Kogan, Zakharia Frenkel, Oleg Kupervasser and Zeev Volkovich", "title": "Hierarchy of protein loop-lock structures: a new server for the\n  decomposition of a protein structure into a set of closed loops", "comments": "11 pages, 4 figures", "journal-ref": "Computational Molecular Bioscience, Vol.3, No.1, March 2013", "doi": "10.4236/cmb.2013.31001", "report-no": null, "categories": "physics.chem-ph cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  HoPLLS (Hierarchy of protein loop-lock structures)\n(http://leah.haifa.ac.il/~skogan/Apache/mydata1/main.html) is a web server that\nidentifies closed loops - a structural basis for protein domain hierarchy. The\nserver is based on the loop-and-lock theory for structural organisation of\nnatural proteins. We describe this web server, the algorithms for the\ndecomposition of a 3D protein into loops and the results of scientific\ninvestigations into a structural \"alphabet\" of loops and locks.\n", "versions": [{"version": "v1", "created": "Sun, 5 Jun 2011 00:36:54 GMT"}, {"version": "v2", "created": "Wed, 27 Mar 2013 18:28:01 GMT"}], "update_date": "2013-03-28", "authors_parsed": [["Kogan", "Simon", ""], ["Frenkel", "Zakharia", ""], ["Kupervasser", "Oleg", ""], ["Volkovich", "Zeev", ""]]}, {"id": "1106.1620", "submitter": "Michal Komorowski", "authors": "Michal Komorowski, Jacek Miekisz, Michael P.H. Stumpf", "title": "Decomposing Noise in Biochemical Signalling Systems Highlights the Role\n  of Protein Degradation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The phenomena of stochasticity in biochemical processes have been intriguing\nlife scientists for the past few decades. We now know that living cells take\nadvantage of stochasticity in some cases and counteract stochastic effects in\nothers. The source of intrinsic stochasticity in biomolecular systems are\nrandom timings of individual reactions, which cumulatively drive the\nvariability in outputs of such systems. Despite the acknowledged relevance of\nstochasticity in the functioning of living cells no rigorous method have been\nproposed to precisely identify sources of variability. In this paper we propose\na novel methodology that allows us to calculate contributions of individual\nreactions into the variability of a system's output. We demonstrate that some\nreactions have dramatically different effects on noise than others.\nSurprisingly, in the class of open conversion systems that serve as an\napproximate model of signal transduction, the degradation of an output\ncontributes half of the total noise. We also demonstrate the importance of\ndegradation in other relevant systems and propose a degradation feedback\ncontrol mechanism that has the capability of an effective noise suppression.\nApplication of our method to some well studied biochemical systems such as:\ngene expression, Michaelis-Menten enzyme kinetics, and the p53 system indicates\nthat our methodology reveals an unprecedented insight into the origins of\nvariability in biochemical systems. For many systems an analytical\ndecomposition is not available; therefore the method has been implemented as a\nMatlab package and is available from the authors upon request.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jun 2011 18:53:38 GMT"}], "update_date": "2011-06-09", "authors_parsed": [["Komorowski", "Michal", ""], ["Miekisz", "Jacek", ""], ["Stumpf", "Michael P. H.", ""]]}, {"id": "1106.1752", "submitter": "Yasser Roudi", "authors": "John Hertz, Yasser Roudi, Joanna Tyrcha", "title": "Ising Models for Inferring Network Structure From Spike Data", "comments": "To appear in \"Principles of Neural Coding\", edited by Stefano Panzeri\n  and Rodrigo Quian Quiroga", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Now that spike trains from many neurons can be recorded simultaneously, there\nis a need for methods to decode these data to learn about the networks that\nthese neurons are part of. One approach to this problem is to adjust the\nparameters of a simple model network to make its spike trains resemble the data\nas much as possible. The connections in the model network can then give us an\nidea of how the real neurons that generated the data are connected and how they\ninfluence each other. In this chapter we describe how to do this for the\nsimplest kind of model: an Ising network. We derive algorithms for finding the\nbest model connection strengths for fitting a given data set, as well as faster\napproximate algorithms based on mean field theory. We test the performance of\nthese algorithms on data from model networks and experiments.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jun 2011 09:17:14 GMT"}], "update_date": "2011-06-10", "authors_parsed": [["Hertz", "John", ""], ["Roudi", "Yasser", ""], ["Tyrcha", "Joanna", ""]]}, {"id": "1106.2311", "submitter": "Jes\\'us M. Mir\\'o-Bueno", "authors": "Jes\\'us M. Mir\\'o-Bueno and Alfonso Rodr\\'iguez-Pat\\'on", "title": "A simple negative interaction in the positive transcriptional feedback\n  of a single gene is sufficient to produce reliable oscillations", "comments": "25 pages, 12 figures, 3 tables", "journal-ref": "PLoS ONE 6(11): e27414. (2011)", "doi": "10.1371/journal.pone.0027414", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Negative and positive transcriptional feedback loops are present in natural\nand synthetic genetic oscillators. A single gene with negative transcriptional\nfeedback needs a time delay and sufficiently strong nonlinearity in the\ntransmission of the feedback signal in order to produce biochemical rhythms. A\nsingle gene with only positive transcriptional feedback does not produce\noscillations. Here, we demonstrate that this single-gene network in conjunction\nwith a simple negative interaction can also easily produce rhythms. We examine\na model comprised of two well-differentiated parts. The first is a positive\nfeedback created by a protein that binds to the promoter of its own gene and\nactivates the transcription. The second is a negative interaction in which a\nrepressor molecule prevents this protein from binding to its promoter. A\nstochastic study shows that the system is robust to noise. A deterministic\nstudy identifies that the dynamics of the oscillator are mainly driven by two\ntypes of biomolecules: the protein, and the complex formed by the repressor and\nthis protein. The main conclusion of this paper is that a simple and usual\nnegative interaction, such as degradation, sequestration or inhibition, acting\non the positive transcriptional feedback of a single gene is a sufficient\ncondition to produce reliable oscillations. One gene is enough and the positive\ntranscriptional feedback signal does not need to activate a second repressor\ngene. This means that at the genetic level an explicit negative feedback loop\nis not necessary. The model needs neither cooperative binding reactions nor the\nformation of protein multimers. Therefore, our findings could help to clarify\nthe design principles of cellular clocks and constitute a new efficient tool\nfor engineering synthetic genetic oscillators.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jun 2011 14:10:56 GMT"}, {"version": "v2", "created": "Mon, 20 Jun 2011 18:48:18 GMT"}, {"version": "v3", "created": "Fri, 18 Nov 2011 19:49:50 GMT"}, {"version": "v4", "created": "Thu, 22 Dec 2011 15:51:43 GMT"}], "update_date": "2011-12-23", "authors_parsed": [["Miró-Bueno", "Jesús M.", ""], ["Rodríguez-Patón", "Alfonso", ""]]}, {"id": "1106.2370", "submitter": "Z. C. Tu", "authors": "Z. C. TU", "title": "Geometry of membranes", "comments": "Review for JGSP. 31 pages, 13 figures", "journal-ref": "Journal of Geometry and Symmetry in Physics 24 (2011) 45-75", "doi": null, "report-no": null, "categories": "cond-mat.soft math.DG physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This review reports some theoretical results on the Geometry of membranes.\nThe governing equations to describe equilibrium configurations of lipid\nvesicles, lipid membranes with free edges, and chiral lipid membranes are\nderived from the variation of free energies of these structures. Some analytic\nsolutions to these equations and their corresponding configurations are also\nshown.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jun 2011 02:06:16 GMT"}, {"version": "v2", "created": "Mon, 26 Dec 2011 05:02:16 GMT"}], "update_date": "2011-12-30", "authors_parsed": [["TU", "Z. C.", ""]]}, {"id": "1106.3247", "submitter": "Jaijeet Roychowdhury", "authors": "Jaijeet Roychowdhury", "title": "Hierarchical Abstraction of Phase Response Curves of Synchronized\n  Systems of Coupled Oscillators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.CD math.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that a group of injection-locked oscillators, each modelled using a\nnonlinear phase macromodel, responds as a single oscillator to small external\nperturbations. More precisely, we show that any group of injection-locked\noscillators has a single effective PRC [1] or PPV [2], [3] that characterises\nits phase/timing response to small external perturbations. This result\nconstitutes a foundation for understanding and predicting\nsynchronization/timing hierarchically in large, complex systems that arise in\nnature and engineering.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jun 2011 14:50:40 GMT"}, {"version": "v2", "created": "Sat, 8 Sep 2012 01:03:54 GMT"}], "update_date": "2012-09-11", "authors_parsed": [["Roychowdhury", "Jaijeet", ""]]}, {"id": "1106.3680", "submitter": "Michael Huber", "authors": "Michael Huber", "title": "Efficient Two-Stage Group Testing Algorithms for DNA Screening", "comments": "12 pages; accepted for ICALP 2011 Group Testing Workshop: Algorithms\n  and Data Structures for selection, identification and encoding (ICALP 2011\n  GT, Zurich)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CE cs.DS cs.IT math.CO math.IT q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Group testing algorithms are very useful tools for DNA library screening.\nBuilding on recent work by Levenshtein (2003) and Tonchev (2008), we construct\nin this paper new infinite classes of combinatorial structures, the existence\nof which are essential for attaining the minimum number of individual tests at\nthe second stage of a two-stage disjunctive testing algorithm.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jun 2011 19:07:29 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Huber", "Michael", ""]]}, {"id": "1106.3703", "submitter": "Artemy Kolchinsky", "authors": "Artemy Kolchinsky, Luis M. Rocha", "title": "Prediction and Modularity in Dynamical Systems", "comments": "v1 published in ECAL 2011 (European Conference on Artificial Life).\n  v2 fixes error in causal risk (number of parameters should be based on\n  training distribution)", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO cs.AI cs.IT cs.LG cs.SY math.IT q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Identifying and understanding modular organizations is centrally important in\nthe study of complex systems. Several approaches to this problem have been\nadvanced, many framed in information-theoretic terms. Our treatment starts from\nthe complementary point of view of statistical modeling and prediction of\ndynamical systems. It is known that for finite amounts of training data,\nsimpler models can have greater predictive power than more complex ones. We use\nthe trade-off between model simplicity and predictive accuracy to generate\noptimal multiscale decompositions of dynamical networks into weakly-coupled,\nsimple modules. State-dependent and causal versions of our method are also\nproposed.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jun 2011 04:20:16 GMT"}, {"version": "v2", "created": "Fri, 16 Jan 2015 06:53:24 GMT"}], "update_date": "2015-01-19", "authors_parsed": [["Kolchinsky", "Artemy", ""], ["Rocha", "Luis M.", ""]]}, {"id": "1106.3771", "submitter": "Yann Ponty", "authors": "Yann Ponty (INRIA Saclay - Ile de France, LIX), C\\'edric Saule (INRIA\n  Saclay - Ile de France, LRI, IRIC)", "title": "A Combinatorial Framework for Designing (Pseudoknotted) RNA Algorithms", "comments": null, "journal-ref": "11th Workshop on Algorithms in Bioinformatics (WABI'11) (2011)", "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend an hypergraph representation, introduced by Finkelstein and\nRoytberg, to unify dynamic programming algorithms in the context of RNA folding\nwith pseudoknots. Classic applications of RNA dynamic programming energy\nminimization, partition function, base-pair probabilities...) are reformulated\nwithin this framework, giving rise to very simple algorithms. This\nreformulation allows one to conceptually detach the conformation space/energy\nmodel -- captured by the hypergraph model -- from the specific application,\nassuming unambiguity of the decomposition. To ensure the latter property, we\npropose a new combinatorial methodology based on generating functions. We\nextend the set of generic applications by proposing an exact algorithm for\nextracting generalized moments in weighted distribution, generalizing a prior\ncontribution by Miklos and al. Finally, we illustrate our full-fledged\nprogramme on three exemplary conformation spaces (secondary structures,\nAkutsu's simple type pseudoknots and kissing hairpins). This readily gives sets\nof algorithms that are either novel or have complexity comparable to classic\nimplementations for minimization and Boltzmann ensemble applications of dynamic\nprogramming.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jun 2011 18:50:54 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Ponty", "Yann", "", "INRIA Saclay - Ile de France, LIX"], ["Saule", "Cédric", "", "INRIA\n  Saclay - Ile de France, LRI, IRIC"]]}, {"id": "1106.3791", "submitter": "Shanika Kuruppu Ms", "authors": "Shanika Kuruppu, Simon Puglisi and Justin Zobel", "title": "Reference Sequence Construction for Relative Compression of Genomes", "comments": "12 pages, 2 figures, to appear in the Proceedings of SPIRE2011 as a\n  short paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CE cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Relative compression, where a set of similar strings are compressed with\nrespect to a reference string, is a very effective method of compressing DNA\ndatasets containing multiple similar sequences. Relative compression is fast to\nperform and also supports rapid random access to the underlying data. The main\ndifficulty of relative compression is in selecting an appropriate reference\nsequence. In this paper, we explore using the dictionary of repeats generated\nby Comrad, Re-pair and Dna-x algorithms as reference sequences for relative\ncompression. We show this technique allows better compression and supports\nrandom access just as well. The technique also allows more general repetitive\ndatasets to be compressed using relative compression.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jun 2011 01:10:01 GMT"}], "update_date": "2011-06-21", "authors_parsed": [["Kuruppu", "Shanika", ""], ["Puglisi", "Simon", ""], ["Zobel", "Justin", ""]]}, {"id": "1106.3925", "submitter": "Oscar Alejandro Pinto", "authors": "Oscar A. Pinto, Miguel A. Mu\\~noz", "title": "Quasi-Neutral theory of epidemic outbreaks", "comments": "13 pages, 6 figures Accepted for publication in PLoS ONE the text\n  have been modified in orden to improve the figure's resolution", "journal-ref": "PLoS ONE 6(7): e21946. (2011)", "doi": "10.1371/journal.pone.0021946", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Some epidemics have been empirically observed to exhibit outbreaks of all\npossible sizes, i.e., to be scalefree or scale-invariant. Different\nexplanations for this finding have been put forward; among them there is a\nmodel for \"accidental pathogens\" which leads to power-law distributed outbreaks\nwithout apparent need of parameter fine tuning. This model has been claimed to\nbe related to self-organized criticality, and its critical properties have been\nconjectured to be related to directed percolation. Instead, we show that this\nis a (quasi) neutral model, analogous to those used in Population Genetics and\nEcology, with the same critical behavior as the voter-model, i.e. the theory of\naccidental pathogens is a (quasi)-neutral theory. This analogy allows us to\nexplain all the system phenomenology, including generic scale invariance and\nthe associated scaling exponents, in a parsimonious and simple way.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jun 2011 14:44:54 GMT"}, {"version": "v2", "created": "Thu, 23 Jun 2011 23:24:44 GMT"}, {"version": "v3", "created": "Sun, 4 Sep 2011 23:03:32 GMT"}], "update_date": "2011-09-06", "authors_parsed": [["Pinto", "Oscar A.", ""], ["Muñoz", "Miguel A.", ""]]}, {"id": "1106.4199", "submitter": "Jean-Philippe Vert", "authors": "Kevin Bleakley (INRIA Saclay - Ile de France), Jean-Philippe Vert\n  (CBIO)", "title": "The group fused Lasso for multiple change-point detection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the group fused Lasso for detection of multiple change-points\nshared by a set of co-occurring one-dimensional signals. Change-points are\ndetected by approximating the original signals with a constraint on the\nmultidimensional total variation, leading to piecewise-constant approximations.\nFast algorithms are proposed to solve the resulting optimization problems,\neither exactly or approximately. Conditions are given for consistency of both\nalgorithms as the number of signals increases, and empirical evidence is\nprovided to support the results on simulated and array comparative genomic\nhybridization data.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jun 2011 13:34:43 GMT"}], "update_date": "2011-06-23", "authors_parsed": [["Bleakley", "Kevin", "", "INRIA Saclay - Ile de France"], ["Vert", "Jean-Philippe", "", "CBIO"]]}, {"id": "1106.4317", "submitter": "Dimitris Vavoulis", "authors": "Dimitrios V. Vavoulis, Volko A. Straub, John A.D. Aston, Jianfeng Feng", "title": "A self-organizing state-space-model approach for parameter estimation in\n  Hodgkin-Huxley-type models of single neurons", "comments": null, "journal-ref": "Vavoulis DV, Straub VA, Aston JAD, Feng J (2012) A Self-Organizing\n  State-Space-Model Approach for Parameter Estimation in Hodgkin-Huxley-Type\n  Models of Single Neurons. PLoS Comput Biol 8(3): e1002401", "doi": "10.1371/journal.pcbi.1002401", "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Traditionally, parameter estimation in biophysical neuron and neural network\nmodels usually adopts a global search algorithm, often combined with a local\nsearch method in order to minimize the value of a cost function, which measures\nthe discrepancy between various features of the available experimental data and\nmodel output. In this study, we approach the problem of parameter estimation in\nconductance-based models of single neurons from a different perspective. By\nadopting a hidden-dynamical-systems formalism, we expressed parameter\nestimation as an inference problem in these systems, which can then be tackled\nusing well-established statistical inference methods. The particular method we\nused was Kitagawa's self-organizing state-space model, which was applied on a\nnumber of Hodgkin-Huxley models using simulated or actual electrophysiological\ndata. We showed that the algorithm can be used to estimate a large number of\nparameters, including maximal conductances, reversal potentials, kinetics of\nionic currents and measurement noise, based on low-dimensional experimental\ndata and sufficiently informative priors in the form of pre-defined constraints\nimposed on model parameters. The algorithm remained operational even when very\nnoisy experimental data were used. Importantly, by combining the\nself-organizing state-space model with an adaptive sampling algorithm akin to\nthe Covariance Matrix Adaptation Evolution Strategy we achieved a significant\nreduction in the variance of parameter estimates. The algorithm did not require\nthe explicit formulation of a cost function and it was straightforward to apply\non compartmental models and multiple data sets. Overall, the proposed\nmethodology is particularly suitable for resolving high-dimensional inference\nproblems based on noisy electrophysiological data and, therefore, a potentially\nuseful tool in the construction of biophysical neuron models.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jun 2011 20:04:52 GMT"}, {"version": "v2", "created": "Sat, 29 Oct 2011 23:18:59 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["Vavoulis", "Dimitrios V.", ""], ["Straub", "Volko A.", ""], ["Aston", "John A. D.", ""], ["Feng", "Jianfeng", ""]]}, {"id": "1106.4450", "submitter": "Matthias Jorg Fuhr", "authors": "M. J. Fuhr, C. St\\\"uhrk, B. M\\\"unch, F. W. M. R. Schwarze and M.\n  Schubert", "title": "Automated Quantification of the Impact of the Wood-decay fungus\n  Physisporinus vitreus on the Cell Wall Structure of Norway spruce by\n  Tomographic Microscopy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wood-decay fungi decompose their substrate by extracellular, degradative\nenzymes and play an important role in natural ecosystems by recycling carbon\nand minerals fixed in plants. Thereby, they cause significant damage to the\nwood structure and limit the use of wood as building material. Besides their\nrole as biodeteriorators wood-decay fungi can be used for biotechnological\npurposes, e.g. the white-rot fungus Physisporinus vitreus for improving the\nuptake of preservatives and wood-modification substances of refractory wood.\nTherefore, the visualization and the quantification of microscopic decay\npatterns are important for the study of the impact of wood-decay fungi in\ngeneral, as well as for wood-decay fungi and microorganisms with possible\napplications in biotechnology. In the present work, we developed a method for\nthe automated localization and quantification of microscopic cell wall elements\n(CWE) of Norway spruce wood such as bordered pits, intrinsic defects, hyphae or\nalterations induced by P. vitreus using high resolution X-ray computed\ntomographic microscopy. In addition to classical destructive wood anatomical\nmethods such as light or laser scanning microscopy, our method allows for the\nfirst time to compute the properties (e.g. area, orientation and\nsize-distribution) of CWE of the tracheids in a sample. This is essential for\nmodeling the influence of microscopic CWE to macroscopic properties such as\nwood strength and permeability.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jun 2011 14:01:34 GMT"}], "update_date": "2011-06-23", "authors_parsed": [["Fuhr", "M. J.", ""], ["Stührk", "C.", ""], ["Münch", "B.", ""], ["Schwarze", "F. W. M. R.", ""], ["Schubert", "M.", ""]]}, {"id": "1106.4490", "submitter": "David R. Bickel", "authors": "David R. Bickel", "title": "Simple estimators of false discovery rates given as few as one or two\n  p-values without strong parametric assumptions", "comments": null, "journal-ref": "Statistical Applications in Genetics and Molecular Biology 12,\n  529-543 (2013)", "doi": "10.1515/sagmb-2013-0003", "report-no": null, "categories": "stat.ME math.ST q-bio.QM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple comparison procedures that control a family-wise error rate or false\ndiscovery rate provide an achieved error rate as the adjusted p-value for each\nhypothesis tested. However, since such p-values are not probabilities that the\nnull hypotheses are true, empirical Bayes methods have been devised to estimate\nsuch posterior probabilities, called local false discovery rates (LFDRs) to\nemphasize the frequency interpretation of their priors. The main approaches to\nLFDR estimation, relying either on numerical algorithms to maximize likelihood\nor on the selection of smoothing parameters for nonparametric density\nestimation, lack the automatic nature of the methods of error rate control. To\nbegin filling the gap, this paper introduces automatic methods of LFDR\nestimation with proven asymptotic conservatism under the independence of\np-values but without strong parametric assumptions. Simulations indicate that\nthey remain conservative even for very small numbers of hypotheses. One of the\nproposed procedures enables interpreting the original FDR control rule in terms\nof LFDR estimation, thereby facilitating practical interpretation. The most\nconservative of the new procedures is applied to measured abundance levels of\n20 proteins.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jun 2011 16:00:25 GMT"}], "update_date": "2013-09-03", "authors_parsed": [["Bickel", "David R.", ""]]}, {"id": "1106.4600", "submitter": "Dennis Wylie", "authors": "Dennis Wylie", "title": "Perturbed and Permuted: Signal Integration in Network-Structured Dynamic\n  Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.dis-nn cs.SY math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological systems (among others) may respond to a large variety of distinct\nexternal stimuli, or signals. These perturbations will generally be presented\nto the system not singly, but in various combinations, so that a proper\nunderstanding of the system response requires assessment of the degree to which\nthe effects of one signal modulate the effects of another. This paper develops\na pair of structural metrics for sparse differential equation models of complex\ndynamic systems and demonstrates that said metrics correlate with proxies of\nthe susceptibility of one signal-response to be altered in the context of a\nsecond signal. One of these metrics may be interpreted as a normalized arc\ndensity in the neighborhood of certain influential nodes; this metric appears\nto correlate with increased independence of signal response.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jun 2011 00:06:46 GMT"}], "update_date": "2011-06-24", "authors_parsed": [["Wylie", "Dennis", ""]]}, {"id": "1106.4880", "submitter": "Ying Ding", "authors": "Qian Zhu, Yuyin Sun, Sashikiran Challa, Ying Ding, Michael S.\n  Lajiness, David J. Wild", "title": "Semantic Inference using Chemogenomics Data for Drug Discovery", "comments": "23 pages, 9 figures, 4 tables", "journal-ref": null, "doi": "10.1186/1471-2105-12-256", "report-no": null, "categories": "q-bio.QM cs.DL cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background Semantic Web Technology (SWT) makes it possible to integrate and\nsearch the large volume of life science datasets in the public domain, as\ndemonstrated by well-known linked data projects such as LODD, Bio2RDF, and\nChem2Bio2RDF. Integration of these sets creates large networks of information.\nWe have previously described a tool called WENDI for aggregating information\npertaining to new chemical compounds, effectively creating evidence paths\nrelating the compounds to genes, diseases and so on. In this paper we examine\nthe utility of automatically inferring new compound-disease associations (and\nthus new links in the network) based on semantically marked-up versions of\nthese evidence paths, rule-sets and inference engines.\n  Results Through the implementation of a semantic inference algorithm, rule\nset, Semantic Web methods (RDF, OWL and SPARQL) and new interfaces, we have\ncreated a new tool called Chemogenomic Explorer that uses networks of\nontologically annotated RDF statements along with deductive reasoning tools to\ninfer new associations between the query structure and genes and diseases from\nWENDI results. The tool then permits interactive clustering and filtering of\nthese evidence paths.\n  Conclusions We present a new aggregate approach to inferring links between\nchemical compounds and diseases using semantic inference. This approach allows\nmultiple evidence paths between compounds and diseases to be identified using a\nrule-set and semantically annotated data, and for these evidence paths to be\nclustered to show overall evidence linking the compound to a disease. We\nbelieve this is a powerful approach, because it allows compound-disease\nrelationships to be ranked by the amount of evidence supporting them.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jun 2011 03:21:56 GMT"}], "update_date": "2011-06-27", "authors_parsed": [["Zhu", "Qian", ""], ["Sun", "Yuyin", ""], ["Challa", "Sashikiran", ""], ["Ding", "Ying", ""], ["Lajiness", "Michael S.", ""], ["Wild", "David J.", ""]]}, {"id": "1106.4891", "submitter": "Ramon Grima", "authors": "Ramon Grima, Philipp Thomas, Arthur V. Straube", "title": "How accurate are the non-linear chemical Fokker-Planck and chemical\n  Langevin equations?", "comments": "39 pages, 3 figures, accepted for publication in J. Chem. Phys", "journal-ref": null, "doi": "10.1063/1.3625958", "report-no": null, "categories": "q-bio.QM cond-mat.mes-hall cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The chemical Fokker-Planck equation and the corresponding chemical Langevin\nequation are commonly used approximations of the chemical master equation.\nThese equations are derived from an uncontrolled, second-order truncation of\nthe Kramers-Moyal expansion of the chemical master equation and hence their\naccuracy remains to be clarified. We use the system-size expansion to show that\nchemical Fokker-Planck estimates of the mean concentrations and of the variance\nof the concentration fluctuations about the mean are accurate to order\n$\\Omega^{-3/2}$ for reaction systems which do not obey detailed balance and at\nleast accurate to order $\\Omega^{-2}$ for systems obeying detailed balance,\nwhere $\\Omega$ is the characteristic size of the system. Hence the chemical\nFokker-Planck equation turns out to be more accurate than the linear-noise\napproximation of the chemical master equation (the linear Fokker-Planck\nequation) which leads to mean concentration estimates accurate to order\n$\\Omega^{-1/2}$ and variance estimates accurate to order $\\Omega^{-3/2}$. This\nhigher accuracy is particularly conspicuous for chemical systems realized in\nsmall volumes such as biochemical reactions inside cells. A formula is also\nobtained for the approximate size of the relative errors in the concentration\nand variance predictions of the chemical Fokker-Planck equation, where the\nrelative error is defined as the difference between the predictions of the\nchemical Fokker-Planck equation and the master equation divided by the\nprediction of the master equation. For dimerization and enzyme-catalyzed\nreactions, the errors are typically less than few percent even when the\nsteady-state is characterized by merely few tens of molecules.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jun 2011 07:10:31 GMT"}, {"version": "v2", "created": "Thu, 28 Jul 2011 20:45:21 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Grima", "Ramon", ""], ["Thomas", "Philipp", ""], ["Straube", "Arthur V.", ""]]}, {"id": "1106.5061", "submitter": "Sharon Aviran", "authors": "Sharon Aviran, Julius B. Lucks, and Lior Pachter", "title": "RNA structure characterization from chemical mapping experiments", "comments": "8 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite great interest in solving RNA secondary structures due to their\nimpact on function, it remains an open problem to determine structure from\nsequence. Among experimental approaches, a promising candidate is the \"chemical\nmodification strategy\", which involves application of chemicals to RNA that are\nsensitive to structure and that result in modifications that can be assayed via\nsequencing technologies. One approach that can reveal paired nucleotides via\nchemical modification followed by sequencing is SHAPE, and it has been used in\nconjunction with capillary electrophoresis (SHAPE-CE) and high-throughput\nsequencing (SHAPE-Seq). The solution of mathematical inverse problems is needed\nto relate the sequence data to the modified sites, and a number of approaches\nhave been previously suggested for SHAPE-CE, and separately for SHAPE-Seq\nanalysis. Here we introduce a new model for inference of chemical modification\nexperiments, whose formulation results in closed-form maximum likelihood\nestimates that can be easily applied to data. The model can be specialized to\nboth SHAPE-CE and SHAPE-Seq, and therefore allows for a direct comparison of\nthe two technologies. We then show that the extra information obtained with\nSHAPE-Seq but not with SHAPE-CE is valuable with respect to ML estimation.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jun 2011 20:29:06 GMT"}, {"version": "v2", "created": "Wed, 29 Jun 2011 16:49:19 GMT"}], "update_date": "2011-06-30", "authors_parsed": [["Aviran", "Sharon", ""], ["Lucks", "Julius B.", ""], ["Pachter", "Lior", ""]]}, {"id": "1106.5313", "submitter": "Siddhartha Chakrabarty", "authors": "Gaurav Pachpute and Siddhartha P. Chakrabarty", "title": "Analysis of Hepatitis C Viral Dynamics Using Latin Hypercube Sampling", "comments": null, "journal-ref": null, "doi": "10.1016/j.cnsns.2012.03.035", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a mathematical model comprising of four coupled ordinary\ndifferential equations (ODEs) for studying the hepatitis C (HCV) viral\ndynamics. The model embodies the efficacies of a combination therapy of\ninterferon and ribavirin. A condition for the stability of the uninfected and\nthe infected steady states is presented. A large number of sample points for\nthe model parameters (which were physiologically feasible) were generated using\nLatin hypercube sampling. Analysis of our simulated values indicated\napproximately 24% cases as having an uninfected steady state. Statistical tests\nlike the chi-square-test and the Spearman's test were also done on the sample\nvalues. The results of these tests indicate a distinctly differently\ndistribution of certain parameter values and not in case of others, vis-a-vis,\nthe stability of the uninfected and the infected steady states.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jun 2011 06:44:53 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Pachpute", "Gaurav", ""], ["Chakrabarty", "Siddhartha P.", ""]]}, {"id": "1106.5778", "submitter": "Simon DeDeo", "authors": "Simon DeDeo", "title": "Effective Theories for Circuits and Automata", "comments": "11 pages, 9 figures", "journal-ref": "Chaos 21, 037106 (2011)", "doi": "10.1063/1.3640747", "report-no": "SFI Working Paper #11-09-47", "categories": "q-bio.QM cs.FL nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Abstracting an effective theory from a complicated process is central to the\nstudy of complexity. Even when the underlying mechanisms are understood, or at\nleast measurable, the presence of dissipation and irreversibility in\nbiological, computational and social systems makes the problem harder. Here we\ndemonstrate the construction of effective theories in the presence of both\nirreversibility and noise, in a dynamical model with underlying feedback. We\nuse the Krohn-Rhodes theorem to show how the composition of underlying\nmechanisms can lead to innovations in the emergent effective theory. We show\nhow dissipation and irreversibility fundamentally limit the lifetimes of these\nemergent structures, even though, on short timescales, the group properties may\nbe enriched compared to their noiseless counterparts.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jun 2011 19:46:42 GMT"}, {"version": "v2", "created": "Sun, 11 Sep 2011 19:45:24 GMT"}, {"version": "v3", "created": "Wed, 19 Oct 2011 17:20:52 GMT"}, {"version": "v4", "created": "Mon, 20 Feb 2012 17:19:05 GMT"}], "update_date": "2012-02-21", "authors_parsed": [["DeDeo", "Simon", ""]]}, {"id": "1106.5950", "submitter": "Cedric Ginestet", "authors": "Cedric E. Ginestet, Jonny O'Muircheartaigh, Owen G. O'Daly and Andrew\n  Simmons", "title": "Topological Randomness and Number of Edges Predict Modular Structure in\n  Functional Brain Networks", "comments": "Submitted as a letter to the Proceedings of the National Academy of\n  Sciences (PNAS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper, Bassett et al. (2011) have analyzed the static and dynamic\norganization of functional brain networks in humans. We here focus on the first\nclaim made in this paper, which states that the static modular structure of\nsuch networks is nested with respect to time. Bassett et al. (2011) argue that\nthis graded structure underlines a \"multiscale modular structure\". In this\nletter, however, we show that such a relationship is substantially mediated by\nan increase in the random variation of the correlation coefficients computed at\ndifferent time scales.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jun 2011 14:41:20 GMT"}], "update_date": "2011-06-30", "authors_parsed": [["Ginestet", "Cedric E.", ""], ["O'Muircheartaigh", "Jonny", ""], ["O'Daly", "Owen G.", ""], ["Simmons", "Andrew", ""]]}, {"id": "1106.6068", "submitter": "Benjamin Machta", "authors": "Sarah Veatch, Benjamin Machta, Sarah Shelby, Ethan Chiang, David\n  Holowka, and Barbara Baird", "title": "Correlation functions quantify super-resolution images and estimate\n  apparent clustering due to over-counting", "comments": "22 pages, 5 figures", "journal-ref": "PLoS ONE 7(2): e31457 (2012)", "doi": "10.1371/journal.pone.0031457", "report-no": null, "categories": "physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an analytical method to quantify clustering in super-resolution\nlocalization images of static surfaces in two dimensions. The method also\ndescribes how over-counting of labeled molecules contributes to apparent\nself-clustering and how the effective lateral resolution of an image can be\ndetermined. This treatment applies to clustering of proteins and lipids in\nmembranes, where there is significant interest in using super-resolution\nlocalization techniques to probe membrane heterogeneity. When images are\nquantified using pair correlation functions, the magnitude of apparent\nclustering due to over-counting will vary inversely with the surface density of\nlabeled molecules and does not depend on the number of times an average\nmolecule is counted. Over-counting does not yield apparent co-clustering in\ndouble label experiments when pair cross-correlation functions are measured. We\napply our analytical method to quantify the distribution of the IgE receptor\n(Fc{\\epsilon}RI) on the plasma membranes of chemically fixed RBL-2H3 mast cells\nfrom images acquired using stochastic optical reconstruction microscopy (STORM)\nand scanning electron microscopy (SEM). We find that apparent clustering of\nlabeled IgE bound to Fc{\\epsilon}RI detected with both methods arises from\nover-counting of individual complexes. Thus our results indicate that these\nreceptors are randomly distributed within the resolution and sensitivity limits\nof these experiments.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jun 2011 22:02:32 GMT"}], "update_date": "2012-03-13", "authors_parsed": [["Veatch", "Sarah", ""], ["Machta", "Benjamin", ""], ["Shelby", "Sarah", ""], ["Chiang", "Ethan", ""], ["Holowka", "David", ""], ["Baird", "Barbara", ""]]}]