[{"id": "1107.0261", "submitter": "Roberto Anglani", "authors": "P.F. Stifanelli, T.M. Creanza, R. Anglani, V.C. Liuzzi, S. Mukherjee,\n  N. Ancona", "title": "A comparative study of Gaussian Graphical Model approaches for genomic\n  data", "comments": "7 pages, 1 figure, RevTex4, version to appear in the proceedings of\n  1st International Workshop on Pattern Recognition, Proteomics, Structural\n  Biology and Bioinformatics: PR PS BB 2011, Ravenna, Italy, 13 September 2011", "journal-ref": null, "doi": null, "report-no": "BA-TH/643-11", "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The inference of networks of dependencies by Gaussian Graphical models on\nhigh-throughput data is an open issue in modern molecular biology. In this\npaper we provide a comparative study of three methods to obtain small sample\nand high dimension estimates of partial correlation coefficients: the\nMoore-Penrose pseudoinverse (PINV), residual correlation (RCM) and\ncovariance-regularized method $(\\ell_{2C})$. We first compare them on simulated\ndatasets and we find that PINV is less stable in terms of AUC performance when\nthe number of variables changes. The two regularized methods have comparable\nperformances but $\\ell_{2C}$ is much faster than RCM. Finally, we present the\nresults of an application of $\\ell_{2C}$ for the inference of a gene network\nfor isoprenoid biosynthesis pathways in Arabidopsis thaliana.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2011 16:00:29 GMT"}], "update_date": "2011-07-04", "authors_parsed": [["Stifanelli", "P. F.", ""], ["Creanza", "T. M.", ""], ["Anglani", "R.", ""], ["Liuzzi", "V. C.", ""], ["Mukherjee", "S.", ""], ["Ancona", "N.", ""]]}, {"id": "1107.0270", "submitter": "Thorsten Pr\\\"ustel", "authors": "Thorsten Pr\\\"ustel and Martin Meier-Schellersheim", "title": "Coarse-Grained Stochastic Particle-based Reaction-Diffusion Simulation\n  Algorithm", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech physics.chem-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, several particle-based stochastic simulation algorithms\n(PSSA) have been developed to study the spatially resolved dynamics of\nbiochemical networks at a molecular scale. A challenge all these approaches\nhave to address is to allow for simulations at cell-biologically relevant\ntimescales without neither neglecting important spatial and biochemical\nproperties of the simulated system nor introducing ad-hoc assumptions not based\non physical principles. Here we describe a PSSA that permits large time steps\nwhile still retaining a high degree of accuracy. The approach addresses the\ntypical disadvantage of Brownian dynamics, namely the need to use small time\nsteps to resolve bimolecular encounters accurately, by estimating the number of\notherwise unnoticed encounters with the help of the Green's functions of the\ndiffusion equation incorporating molecular interactions. This method has\npreviously been proposed for purely absorbing boundary conditions and\nirreversible bimolecular reactions. Building on those ideas, we developed a\ngeneral-purpose PSSA that is applicable to a broad class of reaction-diffusion\nproblems by incorporating reflective and radiation boundary conditions and\nreversible reactions. We furthermore discuss how reaction-diffusion systems on\n2D membranes can be described and derive small time expansions of the Green's\nfunctions that substantially speed up key calculations, particularly in the\nproblematic case of molecules in close proximity. Finally, we point out the\nformal relationship between our and exact algorithms. The proposed algorithm\nmay serve as an easily implementable and flexible, computationally efficient,\ncoarse-grained description of reaction-diffusion systems in 2D and 3D that\nnevertheless provides a stochastic, detailed representation at the level of\nindividual particle trajectories in space and time.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2011 16:30:44 GMT"}], "update_date": "2011-07-04", "authors_parsed": [["Prüstel", "Thorsten", ""], ["Meier-Schellersheim", "Martin", ""]]}, {"id": "1107.0406", "submitter": "Michael Courtney", "authors": "Mercedes Dexter, Kyle Van Alstine, Michael Courtney, Ya'el Courtney", "title": "Demonstrating an Improved Length-weight Model in Largemouth Bass, Chain\n  Pickerel, Yellow Perch, Black Crappie, and Brown Bullhead in Stilwell\n  Reservoir, West Point, New York", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The traditional power law model, W(L) = aL^b, is widely applied to describe\nweight (W) vs. length (L) in fish. The model, W(L) = (L/L1)^b, is proposed as\nan improvement. The Levenberg-Marquardt non-linear least squares technique is\nused to determine the best-fit parameters L1 and b. This model has the\nadvantages that L1 has the same units (length) independent of the value of the\nexponent and has an easily interpreted physical meaning as the typical length\nof a fish with one unit of weight. This proposed model is compared with the\ntraditional model on length-weight data sets for black crappie, largemouth\nbass, chain pickerel, yellow perch, and brown bullhead obtained from Stilwell\nReservoir, West Point, New York. The resulting best-fit parameters, parameter\nstandard errors, and covariances are compared between the two models. The\naverage relative weight for these species is determined, along with typical\nmeat yields for four species. For the five species, using the logarithmic\napproach and a linear least-squares, standard errors in the coefficient, a,\nrange from 60.2% to 136.5% for the traditional model. Using a non-linear least\nsquares technique to determine best fit parameters, the standard errors for the\ncoefficient, a, range from 68.5% to 164.0% in the traditional model. In the\nimproved model, standard errors in the parameter L1 range from 0.94% to 15.0%.\nThe covariance between a and b in the traditional model has a magnitude between\n0.999 and 1.000 in both linear and non-linear parameter estimation methods. In\nthe improved model, the covariances between L1 and b are smaller. The improved\nmodel, W(L) = (L/L1)^b, is preferable for weight vs. length in fish, because\nthe estimated parameter uncertainties and covariances are smaller in magnitude.\nFurthermore, the parameters both have consistent units and an easily\ninterpreted physical meaning.\n", "versions": [{"version": "v1", "created": "Sat, 2 Jul 2011 19:11:22 GMT"}], "update_date": "2011-07-05", "authors_parsed": [["Dexter", "Mercedes", ""], ["Van Alstine", "Kyle", ""], ["Courtney", "Michael", ""], ["Courtney", "Ya'el", ""]]}, {"id": "1107.0647", "submitter": "Jun Ohkubo", "authors": "Jun Ohkubo", "title": "Nonparametric model reconstruction for stochastic differential equation\n  from discretely observed time-series data", "comments": "10 pages, 4 figures", "journal-ref": "Phys. Rev. E. 84, 066702 (2011)", "doi": "10.1103/PhysRevE.84.066702", "report-no": null, "categories": "physics.bio-ph physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A scheme is developed for estimating state-dependent drift and diffusion\ncoefficients in a stochastic differential equation from time-series data. The\nscheme does not require to specify parametric forms for the drift and diffusion\ncoefficients in advance. In order to perform the nonparametric estimation, a\nmaximum likelihood method is combined with a concept based on a kernel density\nestimation. In order to deal with discrete observation or sparsity of the\ntime-series data, a local linearization method is employed, which enables a\nfast estimation.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jul 2011 15:02:26 GMT"}, {"version": "v2", "created": "Mon, 12 Dec 2011 07:22:51 GMT"}], "update_date": "2012-09-28", "authors_parsed": [["Ohkubo", "Jun", ""]]}, {"id": "1107.0900", "submitter": "Christian Breindl", "authors": "Christian Breindl, Daniella Schittler, Steffen Waldherr, Frank\n  Allg\\\"ower", "title": "Structural requirements and discrimination of cell differentiation\n  networks", "comments": "14 pages, 4 figures, will be presented at the IFAC world congress\n  2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical models of stem cell differentiation are commonly based upon the\nconcept of subsequent cell fate decisions, each controlled by a gene regulatory\nnetwork. These networks exhibit a multistable behavior and cause the system to\nswitch between qualitatively distinct stable steady states. However, the\nnetwork structure of such a switching module is often uncertain, and there is\nlack of knowledge about the exact reaction kinetics. In this paper, we\ntherefore perform an elementary study of small networks consisting of three\ninteracting transcriptional regulators responsible for cell differentiation: We\ninvestigate which network structures can reproduce a certain multistable\nbehavior, and how robustly this behavior is realized by each network. In order\nto approach these questions, we use a modeling framework which only uses\nqualitative information about the network, yet allows model discrimination as\nwell as to evaluate the robustness of the desired multistability properties. We\nreveal structural network properties which are necessary and sufficient to\nrealize distinct steady state patterns required for cell differentiation. Our\nresults also show that structural and robustness properties of the networks are\nrelated to each other.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2011 15:26:14 GMT"}], "update_date": "2011-07-06", "authors_parsed": [["Breindl", "Christian", ""], ["Schittler", "Daniella", ""], ["Waldherr", "Steffen", ""], ["Allgöwer", "Frank", ""]]}, {"id": "1107.0903", "submitter": "Ernest Montbrio", "authors": "Ernest Montbri\\'o and Diego Paz\\'o", "title": "Shear diversity prevents collective synchronization", "comments": null, "journal-ref": "Phys. Rev. Lett. 106, 254101 (2011)", "doi": "10.1103/PhysRevLett.106.254101", "report-no": null, "categories": "nlin.AO cond-mat.dis-nn nlin.SI q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large ensembles of heterogeneous oscillators often exhibit collective\nsynchronization as a result of mutual interactions. If the oscillators have\ndistributed natural frequencies and common shear (or nonisochronicity), the\ntransition from incoherence to collective synchronization is known to occur at\nlarge enough values of the coupling strength. However, here we demonstrate that\nshear diversity cannot be counterbalanced by diffusive coupling leading to\nsynchronization. We present the first analytical results for the Kuramoto model\nwith distributed shear, and show that the onset of collective synchronization\nis impossible if the width of the shear distribution exceeds a precise\nthreshold.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2011 15:28:33 GMT"}], "update_date": "2011-07-06", "authors_parsed": [["Montbrió", "Ernest", ""], ["Pazó", "Diego", ""]]}, {"id": "1107.1927", "submitter": "Michael DeSantis", "authors": "Shannon Kian Zareh, Michael C. DeSantis, Jonathan Kessler, Je-Luen Li,\n  Y. M. Wang", "title": "Single-image diffusion coefficient measurements of proteins in free\n  solution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM cond-mat.soft physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Diffusion coefficient measurements are important for many biological and\nmaterial investigations, such as particle dynamics, kinetics, and size\ndeterminations. Amongst current measurement methods, single particle tracking\n(SPT) offers the unique capability of providing location and diffusion\ninformation of a molecule simultaneously while using only femptomoles of\nsample. However, the temporal resolution of SPT is limited to seconds for\nsingle-color labeled samples. By directly imaging three dimensional (3D)\ndiffusing fluorescent proteins and studying the widths of their intensity\nprofiles, we determine the proteins' diffusion coefficients using single\nprotein images of sub-millisecond exposure times. This simple method improves\nthe temporal resolution of diffusion coefficient measurements to\nsub-millisecond, and can be readily applied to a range of particle sizes in SPT\ninvestigations and applications where diffusion coefficient measurements are\nneeded, such as reaction kinetics and particle size determinations.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jul 2011 02:26:52 GMT"}], "update_date": "2011-07-12", "authors_parsed": [["Zareh", "Shannon Kian", ""], ["DeSantis", "Michael C.", ""], ["Kessler", "Jonathan", ""], ["Li", "Je-Luen", ""], ["Wang", "Y. M.", ""]]}, {"id": "1107.2020", "submitter": "Jonathan Potts", "authors": "Jonathan R Potts, Stephen Harris and Luca Giuggioli", "title": "An anti-symmetric exclusion process for two particles on an infinite 1D\n  lattice", "comments": "19 pages, 5 figures", "journal-ref": "J. Phys. A: Math. Theor. 44 (2011) 485003", "doi": "10.1088/1751-8113/44/48/485003", "report-no": null, "categories": "math-ph math.MP physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A system of two biased, mutually exclusive random walkers on an infinite 1D\nlattice is studied whereby the intrinsic bias of one particle is equal and\nopposite to that of the other. The propogator for this system is solved exactly\nand expressions for the mean displacement and mean square displacement (MSD)\nare found. Depending on the nature of the intrinsic bias, the system's\nbehaviour displays two regimes, characterised by (i) the particles moving\ntowards each other and (ii) away from each other, both qualitatively different\nfrom the case of no bias. The continuous-space limit of the propogator is found\nand is shown to solve a Fokker-Planck equation for two biased, mutually\nexclusive Brownian particles with equal and opposite drift velocity.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jul 2011 13:30:02 GMT"}, {"version": "v2", "created": "Mon, 10 Oct 2011 09:34:21 GMT"}], "update_date": "2011-11-16", "authors_parsed": [["Potts", "Jonathan R", ""], ["Harris", "Stephen", ""], ["Giuggioli", "Luca", ""]]}, {"id": "1107.2181", "submitter": "David Anderson", "authors": "David F. Anderson and Desmond J. Higham", "title": "Multi-level Monte Carlo for continuous time Markov chains, with\n  applications in biochemical kinetics", "comments": "Improved description of the constants in statement of Theorems", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.NA q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how to extend a recently proposed multi-level Monte Carlo approach to\nthe continuous time Markov chain setting, thereby greatly lowering the\ncomputational complexity needed to compute expected values of functions of the\nstate of the system to a specified accuracy. The extension is non-trivial,\nexploiting a coupling of the requisite processes that is easy to simulate while\nproviding a small variance for the estimator. Further, and in a stark departure\nfrom other implementations of multi-level Monte Carlo, we show how to produce\nan unbiased estimator that is significantly less computationally expensive than\nthe usual unbiased estimator arising from exact algorithms in conjunction with\ncrude Monte Carlo. We thereby dramatically improve, in a quantifiable manner,\nthe basic computational complexity of current approaches that have many names\nand variants across the scientific literature, including the\nBortz-Kalos-Lebowitz algorithm, discrete event simulation, dynamic Monte Carlo,\nkinetic Monte Carlo, the n-fold way, the next reaction method,the\nresidence-time algorithm, the stochastic simulation algorithm, Gillespie's\nalgorithm, and tau-leaping. The new algorithm applies generically, but we also\ngive an example where the coupling idea alone, even without a multi-level\ndiscretization, can be used to improve efficiency by exploiting system\nstructure. Stochastically modeled chemical reaction networks provide a very\nimportant application for this work. Hence, we use this context for our\nnotation, terminology, natural scalings, and computational examples.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2011 02:38:05 GMT"}, {"version": "v2", "created": "Thu, 10 Nov 2011 19:22:15 GMT"}, {"version": "v3", "created": "Mon, 21 Nov 2011 21:33:54 GMT"}], "update_date": "2011-11-23", "authors_parsed": [["Anderson", "David F.", ""], ["Higham", "Desmond J.", ""]]}, {"id": "1107.2504", "submitter": "Thierry Huillet", "authors": "Thierry Huillet (LPTM)", "title": "A branching diffusion model of selection: from the neutral Wright-Fisher\n  case to the one including mutations", "comments": "To appear in: Intern. Math. Forum", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider diffusion processes x_{t} on the unit interval.\nDoob-transformation techniques consist of a selection of x_{t}-paths procedure.\nThe law of the transformed process is the one of a branching diffusion system\nof particles, each diffusing like a new process tilde{x}_{t}, superposing an\nadditional drift to the one of x_{t}. Killing and/or branching of\ntilde{x}_{t}-particles occur at some space-dependent rate lambda. For this\ntransformed process, so in the class of branching diffusions, the question\narises as to whether the particle system is sub-critical, critical or\nsuper-critical. In the first two cases, extinction occurs with probability one.\nWe apply this circle of ideas to diffusion processes arising in population\ngenetics. In this setup, the process x_{t} is a Wright-Fisher (WF) diffusion,\neither neutral or with mutations. We study a particular Doob transform which is\nbased on the exponential function in the usual fitness parameter sigma. We have\nin mind that this is an alternative way to introduce selection or fitness in\nboth WF-like diffusions, leading to branching diffusion models ideas. For this\nDoob-transform model of fitness, the usual selection drift sigma x(1-x) should\nbe superposed to the one of x_{t} to form tilde{x}_{t} which is the process\nthat can branch, binarily. In the first neutral case, there is a trade-off\nbetween branching events giving birth to new particles and absorption at the\nboundaries, killing the particles. Under our assumptions, the branching\ndiffusion process gets eventually globally extinct in finite time with\nexponential tails. In the second case with mutations, there is a trade-off\nbetween killing events removing some particles from the system and reflection\nat the boundaries where the particles survive. This branching diffusion process\nalso gets eventually globally extinct but in very long finite time with\npower-law tails. Our approach relies on the spectral expansion of the\ntransition probability kernels of both x_{t} and tilde{x}_{t}.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jul 2011 09:49:52 GMT"}], "update_date": "2011-07-15", "authors_parsed": [["Huillet", "Thierry", "", "LPTM"]]}, {"id": "1107.2778", "submitter": "Eleonora Alfinito Dr.", "authors": "Eleonora Alfinito, Jean-Francois Millithaler, Lino Reggiani, Nadia\n  Zine, and Nicole Jaffrezic-Renault", "title": "Human olfactory receptor 17-40 as active part of a nanobiosensor: A\n  microscopic investigation of its electrical properties", "comments": "6 pages, 6 figures, DOI:10.1039/c1ra00025", "journal-ref": "RCS Advances 2011", "doi": null, "report-no": null, "categories": "cond-mat.mes-hall cond-mat.soft physics.chem-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Increasing attention has been recently devoted to protein-based\nnanobiosensors. The main reason is the huge number of possible technological\napplications, going from drug detection to cancer early diagnosis. Their\noperating model is based on the protein activation and the corresponding\nconformational change, due to the capture of an external molecule, the\nso-called ligand. Recent measurements, performed with different techniques on\nhuman 17-40 olfactory receptor, evidenced a very narrow window of response in\nrespect of the odour concentration. This is a crucial point for understanding\nwhether the use of this olfactory receptor as sensitive part of a nanobiosensor\nis a good choice. In this paper we investigate the topological and electrical\nproperties of the human olfactory receptor 17-40 with the objective of\nproviding a microscopic interpretation of available experiments. To this\npurpose, we model the protein by means of a graph able to capture the mean\nfeatures of the 3D backbone structure. The graph is then associated with an\nequivalent impedance network, able to evaluate the impedance spectra of the\nolfactory receptor, in its native and activated state. We assume a topological\norigin of the different protein electrical responses to different ligand\nconcentrations: In this perspective all the experimental data are collected and\ninterpreted satisfactorily within a unified scheme, also useful for application\nto other proteins.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jul 2011 10:32:27 GMT"}], "update_date": "2011-07-15", "authors_parsed": [["Alfinito", "Eleonora", ""], ["Millithaler", "Jean-Francois", ""], ["Reggiani", "Lino", ""], ["Zine", "Nadia", ""], ["Jaffrezic-Renault", "Nicole", ""]]}, {"id": "1107.2798", "submitter": "Catherine Matias", "authors": "Ana Arribas-Gil, Catherine Matias (SG)", "title": "A context dependent pair hidden Markov model for statistical alignment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST q-bio.QM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article proposes a novel approach to statistical alignment of nucleotide\nsequences by introducing a context dependent structure on the substitution\nprocess in the underlying evolutionary model. We propose to estimate alignments\nand context dependent mutation rates relying on the observation of two\nhomologous sequences. The procedure is based on a generalized pair-hidden\nMarkov structure, where conditional on the alignment path, the nucleotide\nsequences follow a Markov distribution. We use a stochastic approximation\nexpectation maximization (saem) algorithm to give accurate estimators of\nparameters and alignments. We provide results both on simulated data and\nvertebrate genomes, which are known to have a high mutation rate from CG\ndinucleotide. In particular, we establish that the method improves the accuracy\nof the alignment of a human pseudogene and its functional gene.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jul 2011 12:11:06 GMT"}], "update_date": "2011-07-18", "authors_parsed": [["Arribas-Gil", "Ana", "", "SG"], ["Matias", "Catherine", "", "SG"]]}, {"id": "1107.2879", "submitter": "Mariano Beguerisse D\\'iaz", "authors": "Mariano Beguerisse-Diaz, Baojun Wang, Radhika Desikan, Mauricio\n  Barahona", "title": "Squeeze-and-Breathe Evolutionary Monte Carlo Optimisation with Local\n  Search Acceleration and its application to parameter fitting", "comments": "15 Pages, 3 Figures, 6 Tables; Availability: Matlab code available\n  from the authors upon request", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Estimating parameters from data is a key stage of the modelling\nprocess, particularly in biological systems where many parameters need to be\nestimated from sparse and noisy data sets. Over the years, a variety of\nheuristics have been proposed to solve this complex optimisation problem, with\ngood results in some cases yet with limitations in the biological setting.\n  Results: In this work, we develop an algorithm for model parameter fitting\nthat combines ideas from evolutionary algorithms, sequential Monte Carlo and\ndirect search optimisation. Our method performs well even when the order of\nmagnitude and/or the range of the parameters is unknown. The method refines\niteratively a sequence of parameter distributions through local optimisation\ncombined with partial resampling from a historical prior defined over the\nsupport of all previous iterations. We exemplify our method with biological\nmodels using both simulated and real experimental data and estimate the\nparameters efficiently even in the absence of a priori knowledge about the\nparameters.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jul 2011 17:52:39 GMT"}, {"version": "v2", "created": "Sun, 23 Oct 2011 15:10:58 GMT"}, {"version": "v3", "created": "Fri, 4 Nov 2011 17:08:36 GMT"}], "update_date": "2011-11-07", "authors_parsed": [["Beguerisse-Diaz", "Mariano", ""], ["Wang", "Baojun", ""], ["Desikan", "Radhika", ""], ["Barahona", "Mauricio", ""]]}, {"id": "1107.2903", "submitter": "Youval Dar", "authors": "Youval Dar, Benjamin Bairrington, Daniel Cox, Rajiv Singh", "title": "Model for competing pathways in protein-aggregation: role of membrane\n  bound proteins", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the biologically important and complex phenomena of A\\beta\\\npeptide aggregation in Alzheimer's disease, we introduce a model and simulation\nmethodology for studying protein aggregation that includes extra-cellular\naggregation, aggregation on the cell-surface assisted by a membrane bound\nprotein, and in addition, supply, clearance, production and sequestration of\npeptides and proteins. The model is used to produce equilibrium and\nkinetic-aggregation phase diagrams for aggregation onset and of reduced stable\nA\\beta\\ monomer concentrations due to aggregation. The methodology we\nimplemented permits modeling of a phenomenon involving orders of magnitude\ndifferences in time scales and concentrations which can be retained in the\nsimulation. We demonstrate how to identify ranges of parameter values that give\nmonomer concentration depletion upon aggregation similar to that observed in\nAlzheimer's disease. We show how very different behavior can be obtained as\nreaction parameters and protein concentrations vary, and discuss the difficulty\nreconciling results of experiments from two vastly different concentration\nregimes. The latter is an important general issue in relating in-vitro and mice\nbased experiments to humans.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jul 2011 19:33:46 GMT"}, {"version": "v2", "created": "Tue, 16 Oct 2012 05:57:47 GMT"}, {"version": "v3", "created": "Sun, 28 Apr 2013 07:49:27 GMT"}, {"version": "v4", "created": "Thu, 2 May 2013 21:49:26 GMT"}, {"version": "v5", "created": "Tue, 19 Jan 2016 05:39:58 GMT"}, {"version": "v6", "created": "Thu, 25 Aug 2016 05:50:33 GMT"}, {"version": "v7", "created": "Sun, 29 Jan 2017 06:45:08 GMT"}, {"version": "v8", "created": "Sun, 16 Jul 2017 06:04:24 GMT"}, {"version": "v9", "created": "Thu, 1 Mar 2018 07:39:10 GMT"}], "update_date": "2018-03-02", "authors_parsed": [["Dar", "Youval", ""], ["Bairrington", "Benjamin", ""], ["Cox", "Daniel", ""], ["Singh", "Rajiv", ""]]}, {"id": "1107.3112", "submitter": "Michael Courtney", "authors": "Joshua Daviscourt, Joshua Huertas, and Michael Courtney", "title": "An Assessment of Weight-Length Relationships for Muskellunge,Northern\n  Pike, and Chain Pickerel In Carlander's Handbook of Freshwater Fishery\n  Biology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Carlander's Handbook of Freshwater Fishery Biology (1969) contains life\nhistory data from many species of freshwater fish found in North America. It\nhas been cited over 1200 times and used to produce standard-weight curves for\nsome species. Recent work (Cole-Fletcher et al. 2011) suggests Carlander (1969)\ncontains numerous errors in listed weight-length equations. This paper assesses\nthe weight-length relationships listed in Carlander for muskellunge, northern\npike, and chain pickerel by comparing graphs of the weight vs. length equations\nwith other data listed and with standard weight curves published by independent\nsources. A number of discrepancies are identified through this analysis and new\nweight-length relationships are produced from listed data.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jul 2011 17:26:24 GMT"}], "update_date": "2011-07-18", "authors_parsed": [["Daviscourt", "Joshua", ""], ["Huertas", "Joshua", ""], ["Courtney", "Michael", ""]]}, {"id": "1107.3569", "submitter": "Charles Li", "authors": "Yipeng Yang, Y. Charles Li", "title": "A Monte Carlo Simulation on Clustering Dynamics of Social Amoebae", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB nlin.CD q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A discrete model for computer simulations of the clustering dynamics of\nSocial Amoebae is presented. This model incorporates the wavelike propagation\nof extracellular signaling cAMP, the sporadic firing of cells at early stage of\naggregation, the signal relaying as a response to stimulus, the inertia and\npurposeful random walk of the cell movement. A Monte Carlo simulation is run\nwhich shows the existence of potential equilibriums of mean and variance of\naggregation time. The simulation result of this model could well reproduce many\nphenomena observed by actual experiments.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 20:21:50 GMT"}, {"version": "v2", "created": "Mon, 13 May 2013 17:42:03 GMT"}], "update_date": "2013-05-14", "authors_parsed": [["Yang", "Yipeng", ""], ["Li", "Y. Charles", ""]]}, {"id": "1107.4220", "submitter": "Vladimir Chechetkin R.", "authors": "G.I. Kravatskaya, Y.V. Kravatsky, V.R. Chechetkin, V.G. Tumanyan", "title": "Coexistence of different base periodicities in prokaryotic genomes as\n  related to DNA curvature, supercoiling, and transcription", "comments": "23 pages, 6 figures, 2 tables", "journal-ref": null, "doi": "10.1016/j.ygeno.2011.06.006", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyzed the periodic patterns in E. coli promoters and compared the\ndistributions of the corresponding patterns in promoters and in the complete\ngenome to elucidate their function. Except the three-base periodicity,\ncoincident with that in the coding regions and growing stronger in the region\ndownstream from the transcriptions start (TS), all other salient periodicities\nare peaked upstream of TS. We found that helical periodicities with the lengths\nabout B-helix pitch ~10.2-10.5 bp and A-helix pitch ~10.8-11.1 bp coexist in\nthe genomic sequences. We mapped the distributions of stretches with A-, B-,\nand Z- like DNA periodicities onto E.coli genome. All three periodicities tend\nto concentrate within non-coding regions when their intensity becomes stronger\nand prevail in the promoter sequences. The comparison with available\nexperimental data indicates that promoters with the most pronounced\nperiodicities may be related to the supercoiling-sensitive genes.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2011 10:03:27 GMT"}], "update_date": "2011-07-22", "authors_parsed": [["Kravatskaya", "G. I.", ""], ["Kravatsky", "Y. V.", ""], ["Chechetkin", "V. R.", ""], ["Tumanyan", "V. G.", ""]]}, {"id": "1107.5338", "submitter": "Elisa Loza-Reyes Dr", "authors": "Elisa Loza-Reyes, Merrilee Hurn and Tony Robinson", "title": "Classification of molecular sequence data using Bayesian phylogenetic\n  mixture models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rate variation among the sites of a molecular sequence is commonly found in\napplications of phylogenetic inference. Several approaches exist to account for\nthis feature but they do not usually enable the investigator to pinpoint the\nsites that evolve under one or another rate of evolution in a straightforward\nmanner. The focus is on Bayesian phylogenetic mixture models, augmented with\nallocation variables, as tools for site classification and quantification of\nclassification uncertainty. The method does not rely on prior knowledge of site\nmembership to classes or even the number of classes. Furthermore, it does not\nrequire correlated sites to be next to one another in the sequence alignment,\nunlike some phylogenetic hidden Markov or change-point models. In the approach\npresented, model selection on the number and type of mixture components is\nconducted ahead of both model estimation and site classification; the\nsteppingstone sampler (SS) is used to select amongst competing mixture models.\nExample applications of simulated data and mitochondrial DNA of primates\nillustrate site classification via 'augmented' Bayesian phylogenetic mixtures.\nIn both examples, all mixtures outperform commonly-used models of among-site\nrate variation and models that do not account for rate heterogeneity. The\nexamples further demonstrate how site classification is readily available from\nthe analysis output. The method is directly relevant to the choice of\npartitions in Bayesian phylogenetics, and its application may lead to the\ndiscovery of structure not otherwise recognised in a molecular sequence\nalignment. Computational aspects of Bayesian phylogenetic model estimation are\ndiscussed, including the use of simple Markov chain Monte Carlo (MCMC) moves\nthat mix efficiently without tempering the chains.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2011 21:24:16 GMT"}, {"version": "v2", "created": "Tue, 28 Aug 2012 17:29:49 GMT"}, {"version": "v3", "created": "Mon, 8 Apr 2013 10:51:23 GMT"}, {"version": "v4", "created": "Tue, 9 Apr 2013 07:40:36 GMT"}, {"version": "v5", "created": "Wed, 22 May 2013 19:41:25 GMT"}], "update_date": "2013-05-23", "authors_parsed": [["Loza-Reyes", "Elisa", ""], ["Hurn", "Merrilee", ""], ["Robinson", "Tony", ""]]}, {"id": "1107.5349", "submitter": "Luca Pinello", "authors": "Luca Pinello", "title": "Multi Layer Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.DS cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This thesis presents a new methodology to analyze one-dimensional signals\ntrough a new approach called Multi Layer Analysis, for short MLA. It also\nprovides some new insights on the relationship between one-dimensional signals\nprocessed by MLA and tree kernels, test of randomness and signal processing\ntechniques. The MLA approach has a wide range of application to the fields of\npattern discovery and matching, computational biology and many other areas of\ncomputer science and signal processing. This thesis includes also some\napplications of this approach to real problems in biology and seismology.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2011 22:29:35 GMT"}], "update_date": "2011-07-28", "authors_parsed": [["Pinello", "Luca", ""]]}, {"id": "1107.5924", "submitter": "David \\v{S}afr\\'anek", "authors": "Lubos Brim and Jana Fabrikova and Sven Drazan and David Safranek", "title": "Reachability in Biochemical Dynamical Systems by Quantitative Discrete\n  Approximation", "comments": "Full version of a paper accepted to COMPMOD 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY math.OC q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper a novel computational technique for finite discrete\napproximation of continuous dynamical systems suitable for a significant class\nof biochemical dynamical systems is introduced. The method is parameterized in\norder to affect the imposed level of approximation provided that with\nincreasing parameter value the approximation converges to the original\ncontinuous system. By employing this approximation technique, we present\nalgorithms solving the reachability problem for biochemical dynamical systems.\nThe presented method and algorithms are evaluated on several exemplary\nbiological models and on a real case study. This is a full version of the paper\npublished in the proceedings of CompMod 2011.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jul 2011 10:51:15 GMT"}], "update_date": "2011-08-01", "authors_parsed": [["Brim", "Lubos", ""], ["Fabrikova", "Jana", ""], ["Drazan", "Sven", ""], ["Safranek", "David", ""]]}]