[{"id": "1108.0206", "submitter": "David Murrugarra", "authors": "David Murrugarra and Reinhard Laubenbacher", "title": "The Number of Multistate Nested Canalyzing Functions", "comments": "18 pages, 2 tables", "journal-ref": "Physica D: Nonlinear Phenomena, 241, 929-938, 2012", "doi": "10.1016/j.physd.2012.02.011", "report-no": null, "categories": "math.AG physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Identifying features of molecular regulatory networks is an important problem\nin systems biology. It has been shown that the combinatorial logic of such\nnetworks can be captured in many cases by special functions called nested\ncanalyzing in the context of discrete dynamic network models. It was also shown\nthat the dynamics of networks constructed from such functions has very special\nproperties that are consistent with what is known about molecular networks, and\nthat simplify analysis. It is important to know how restrictive this class of\nfunctions is, for instance for the purpose of network reverse-engineering. This\npaper contains a formula for the number of such functions and a comparison to\nthe class of all functions. In particular, it is shown that, as the number of\nvariables becomes large, the ratio of the number of nested canalyzing functions\nto the number of all functions converges to zero. This shows that the class of\nnested canalyzing functions is indeed very restrictive, indicating that\nmolecular networks have very special properties. The principal tool used for\nthis investigation is a description of these functions as polynomials and a\nparameterization of the class of all such polynomials in terms of relations on\ntheir coefficients.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jul 2011 22:01:44 GMT"}, {"version": "v2", "created": "Sun, 7 Aug 2011 00:08:37 GMT"}], "update_date": "2013-01-18", "authors_parsed": [["Murrugarra", "David", ""], ["Laubenbacher", "Reinhard", ""]]}, {"id": "1108.1772", "submitter": "Alain Rapaport", "authors": "Ihab Haidar (MISTEA), Fr\\'ed\\'eric G\\'erard (Eco\\&Sols), Alain\n  Rapaport (MISTEA, INRIA Sophia Antipolis)", "title": "Comparison of numerical simulations of reactive transport and\n  chemostat-like models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS physics.geo-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of the paper is to evaluate the ability of reactive transport\nmodels and their numerical implementations (such as MIN3P) to simulate simple\nmicrobial transformations in conditions of chemostat or gradostat models, that\nare popular in microbial ecology and waste treatment ecosystems. To make this\ncomparison, we first consider an abstract ecosystem composed of a single\nlimiting resource and a single microbial species that are carried by advection.\nIn a second stage, we consider another microbial species in competition for the\nsame limiting resource. Comparing the numerical solutions of the two models, we\nfound that the numerical accuracy of simulations of advective transport models\nperformed with MIN3P depends on the evolution of the concentrations of the\nmicrobial species: when the state of the system is close to a non-hyperbolic\nequilibrium, we observe a numerical inaccuracy that may be due to the\ndiscretization method used in numerical approximations of reactive transport\nequations. Therefore, one has to be cautious about the predictions given by the\nmodels.\n", "versions": [{"version": "v1", "created": "Fri, 5 Aug 2011 19:15:34 GMT"}, {"version": "v2", "created": "Sat, 13 Aug 2011 20:12:25 GMT"}], "update_date": "2011-08-16", "authors_parsed": [["Haidar", "Ihab", "", "MISTEA"], ["Gérard", "Frédéric", "", "Eco\\&Sols"], ["Rapaport", "Alain", "", "MISTEA, INRIA Sophia Antipolis"]]}, {"id": "1108.1979", "submitter": "Bohdan Kozarzewski", "authors": "B. Kozarzewski", "title": "Similarity of symbolic sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new numerical characterization of symbolic sequences is proposed. The\npartition of sequence based on Ke and Tong algorithm is a starting point.\nAlgorithm decomposes original sequence into set of distinct subsequences - a\npatterns. The set of subsequences common for two symbolic sequences (their\nintersection) is proposed as a measure of similarity between them. The new\nsimilarity measure works well for short (of tens letters) sequences and the\nvery long (of hundred thousand letters) as well. When applied to nucleotide or\nprotein sequences may help to trace possible evolutionary of species. As an\nillustration, similarity of several sets of nucleotide and amino acid sequences\nis examined.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 16:52:36 GMT"}, {"version": "v2", "created": "Wed, 7 Sep 2011 17:26:08 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Kozarzewski", "B.", ""]]}, {"id": "1108.2248", "submitter": "Gautam Pendse", "authors": "Gautam V. Pendse, David Borsook, Lino Becerra", "title": "A simple and objective method for reproducible resting state network\n  (RSN) detection in fMRI", "comments": "54 pages, 13 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0027594", "report-no": null, "categories": "stat.AP q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Spatial Independent Component Analysis (ICA) decomposes the time by space\nfunctional MRI (fMRI) matrix into a set of 1-D basis time courses and their\nassociated 3-D spatial maps that are optimized for mutual independence. When\napplied to resting state fMRI (rsfMRI), ICA produces several spatial\nindependent components (ICs) that seem to have biological relevance - the\nso-called resting state networks (RSNs). The ICA problem is well posed when the\ntrue data generating process follows a linear mixture of ICs model in terms of\nthe identifiability of the mixing matrix. However, the contrast function used\nfor promoting mutual independence in ICA is dependent on the finite amount of\nobserved data and is potentially non-convex with multiple local minima. Hence,\neach run of ICA could produce potentially different IC estimates even for the\nsame data. One technique to deal with this run-to-run variability of ICA was\nproposed by Yang et al. (2008) in their algorithm RAICAR which allows for the\nselection of only those ICs that have a high run-to-run reproducibility. We\npropose an enhancement to the original RAICAR algorithm that enables us to\nassign reproducibility p-values to each IC and allows for an objective\nassessment of both within subject and across subjects reproducibility. We call\nthe resulting algorithm RAICAR-N (N stands for null hypothesis test), and we\nhave applied it to publicly available human rsfMRI data (http://www.nitrc.org).\nOur reproducibility analyses indicated that many of the published RSNs in\nrsfMRI literature are highly reproducible. However, we found several other RSNs\nthat are highly reproducible but not frequently listed in the literature.\n", "versions": [{"version": "v1", "created": "Wed, 10 Aug 2011 19:02:29 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["Pendse", "Gautam V.", ""], ["Borsook", "David", ""], ["Becerra", "Lino", ""]]}, {"id": "1108.2538", "submitter": "Dionysios Barmpoutis", "authors": "Dionysios Barmpoutis and Richard M. Murray", "title": "Noise Propagation in Biological and Chemical Reaction Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe how noise propagates through a network by calculating the\nvariance of the outputs. Using stochastic calculus and dynamical systems\ntheory, we study the network topologies that accentuate or alleviate the effect\nof random variance in the network for both directed and undirected graphs.\nGiven a linear tree network, the variance in the output is a convex function of\nthe poles of the individual nodes. Cycles create correlations which in turn\nincrease the variance in the output. Feedforward and feedback have a limited\neffect on noise propagation when the respective cycles is sufficiently long.\nCrosstalk between the elements of different pathways helps reduce the output\nnoise, but makes the network slower. Next, we study the differences between\ndisturbances in the inputs and disturbances in the network parameters, and how\nthey propagate to the outputs. Finally, we show how noise correlations can\naffect the steady state of the system in chemical reaction networks with\nreactions of two or more reactants, each of which may be affected by\nindependent or correlated noise sources.\n", "versions": [{"version": "v1", "created": "Thu, 11 Aug 2011 23:53:48 GMT"}], "update_date": "2011-08-15", "authors_parsed": [["Barmpoutis", "Dionysios", ""], ["Murray", "Richard M.", ""]]}, {"id": "1108.3074", "submitter": "Ehtibar Dzhafarov", "authors": "Ehtibar N. Dzhafarov and Janne V. Kujala", "title": "Selectivity in Probabilistic Causality: Drawing Arrows from Inputs to\n  Stochastic Outputs", "comments": "25 pages; minor corrections with respect to the first version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI math.PR physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set of several inputs into a system (e.g., independent variables\ncharacterizing stimuli) and a set of several stochastically non-independent\noutputs (e.g., random variables describing different aspects of responses), how\ncan one determine, for each of the outputs, which of the inputs it is\ninfluenced by? The problem has applications ranging from modeling pairwise\ncomparisons to reconstructing mental processing architectures to conjoint\ntesting. A necessary and sufficient condition for a given pattern of selective\ninfluences is provided by the Joint Distribution Criterion, according to which\nthe problem of \"what influences what\" is equivalent to that of the existence of\na joint distribution for a certain set of random variables. For inputs and\noutputs with finite sets of values this criterion translates into a test of\nconsistency of a certain system of linear equations and inequalities (Linear\nFeasibility Test) which can be performed by means of linear programming. The\nJoint Distribution Criterion also leads to a metatheoretical principle for\ngenerating a broad class of necessary conditions (tests) for diagrams of\nselective influences. Among them is the class of distance-type tests based on\nthe observation that certain functionals on jointly distributed random\nvariables satisfy triangle inequality.\n", "versions": [{"version": "v1", "created": "Mon, 15 Aug 2011 14:03:55 GMT"}, {"version": "v2", "created": "Sat, 27 Aug 2011 23:28:43 GMT"}], "update_date": "2011-08-30", "authors_parsed": [["Dzhafarov", "Ehtibar N.", ""], ["Kujala", "Janne V.", ""]]}, {"id": "1108.3245", "submitter": "Eduardo D. Sontag", "authors": "Eduardo D. Sontag", "title": "Remarks on invariance of population distributions for systems with\n  equivariant internal dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For velocity-jump Markov processes with equivariant internal dynamics, we\nremark that population distributions are invariant. This provides a\nformalization of the fact that FCD (scale) and other symmetry invariant systems\nperform identical spatial searches under input transformations.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 14:17:34 GMT"}], "update_date": "2011-08-17", "authors_parsed": [["Sontag", "Eduardo D.", ""]]}, {"id": "1108.3312", "submitter": "Jiajia Dong", "authors": "R.K.P. Zia, J.J. Dong, B. Schmittmann", "title": "Modeling Translation in Protein Synthesis with TASEP: A Tutorial and\n  Recent Developments", "comments": "25 pages, 7 figures", "journal-ref": "Journal of Statistical Physics 2011", "doi": "10.1007/s10955-011-0183-1", "report-no": null, "categories": "cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The phenomenon of protein synthesis has been modeled in terms of totally\nasymmetric simple exclusion processes (TASEP) since 1968. In this article, we\nprovide a tutorial of the biological and mathematical aspects of this approach.\nWe also summarize several new results, concerned with limited resources in the\ncell and simple estimates for the current (protein production rate) of a TASEP\nwith inhomogeneous hopping rates, reflecting the characteristics of real genes.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 18:32:18 GMT"}], "update_date": "2011-08-17", "authors_parsed": [["Zia", "R. K. P.", ""], ["Dong", "J. J.", ""], ["Schmittmann", "B.", ""]]}, {"id": "1108.3426", "submitter": "Bogdan Aman", "authors": "Livio Bioglio, Cristina Calcagno, Mario Coppo, Ferruccio Damiani, Eva\n  Sciacca, Salvatore Spinella, Angelo Troina", "title": "A Spatial Calculus of Wrapped Compartments", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/05", "categories": "cs.LO cs.CE cs.ET q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Calculus of Wrapped Compartments (CWC) is a recently proposed modelling\nlanguage for the representation and simulation of biological systems behaviour.\nAlthough CWC has no explicit structure modelling a spatial geometry, its\ncompartment labelling feature can be exploited to model various examples of\nspatial interactions in a natural way. However, specifying large networks of\ncompartments may require a long modelling phase. In this work we present a\nsurface language for CWC that provides basic constructs for modelling spatial\ninteractions. These constructs can be compiled away to obtain a standard CWC\nmodel, thus exploiting the existing CWC simulation tool. A case study\nconcerning the modelling of Arbuscular Mychorrizal fungi growth is discussed.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:00:56 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Bioglio", "Livio", ""], ["Calcagno", "Cristina", ""], ["Coppo", "Mario", ""], ["Damiani", "Ferruccio", ""], ["Sciacca", "Eva", ""], ["Spinella", "Salvatore", ""], ["Troina", "Angelo", ""]]}, {"id": "1108.3434", "submitter": "Bogdan Aman", "authors": "Federico Buti, Massimo Callisto De Donato, Flavio Corradini, Emanuela\n  Merelli, Luca Tesei", "title": "Multiscale Modelling: A Mobile Membrane Approach", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/11", "categories": "cs.FL cs.ET q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, multiscale modelling is recognized as the most suitable way to\nstudy biological processes. Indeed, almost every phenomenon in nature exhibits\na multiscale behaviour, i.e., it is the outcome of interactions that occur at\ndifferent spatial and temporal scales. Although several ways to provide\n\"multilayer\" models have been proposed, only Complex Automata naturally embed\nspatial information and realize the multiscale approach with well-established\ninter-scale integration schemas. Recently, such approach has been restated in\nterms of Spatial P systems - a variant of P systems with a more geometric\nconcept of space.\n  In this work we discuss how mobile membranes, a variant of membrane systems\ninspired by the biological movements of endocytosis and exocytosis, can be\nefficaciously exploited to define a uniform multiscale coupling scheme relying\nonly on the features of the formalism itself.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:29:29 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Buti", "Federico", ""], ["De Donato", "Massimo Callisto", ""], ["Corradini", "Flavio", ""], ["Merelli", "Emanuela", ""], ["Tesei", "Luca", ""]]}, {"id": "1108.3495", "submitter": "Pierre Degond", "authors": "Emmanuel Boissard (IMT), Pierre Degond (IMT), S\\'ebastien Motsch", "title": "Trail formation based on directed pheromone deposition", "comments": null, "journal-ref": "Journal of Mathematical Biology, 66 (2013), pp. 1267-1301", "doi": "10.1007/s00285-012-0529-6", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an Individual-Based Model of ant-trail formation. The ants are\nmodeled as self-propelled particles which deposit directed pheromones and\ninteract with them through alignment interaction. The directed pheromones\nintend to model pieces of trails, while the alignment interaction translates\nthe tendency for an ant to follow a trail when it meets it. Thanks to adequate\nquantitative descriptors of the trail patterns, the existence of a phase\ntransition as the ant-pheromone interaction frequency is increased can be\nevidenced. Finally, we propose both kinetic and fluid descriptions of this\nmodel and analyze the capabilities of the fluid model to develop trail\npatterns. We observe that the development of patterns by fluid models require\nextra trail amplification mechanisms that are not needed at the\nIndividual-Based Model level.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 06:12:21 GMT"}], "update_date": "2014-04-08", "authors_parsed": [["Boissard", "Emmanuel", "", "IMT"], ["Degond", "Pierre", "", "IMT"], ["Motsch", "Sébastien", ""]]}, {"id": "1108.3690", "submitter": "Ralf Toenjes", "authors": "R. Toenjes, H. Kori", "title": "Synchronization of weakly perturbed Markov chain oscillators", "comments": "16 pages, 7 figures", "journal-ref": "Phys. Rev. E 84, 056206 (2011)", "doi": "10.1103/PhysRevE.84.056206", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.soft q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rate processes are simple and analytically tractable models for many\ndynamical systems which switch stochastically between a discrete set of quasi\nstationary states but they may also approximate continuous processes by coarse\ngrained, symbolic dynamics. In contrast to limit cycle oscillators which are\nweakly perturbed by noise, the stochasticity in such systems may be strong and\nmore complicated system topologies than the circle can be considered. Here we\nemploy second order, time dependent perturbation theory to derive expressions\nfor the mean frequency and phase diffusion constant of discrete state\noscillators coupled or driven through weakly time dependent transition rates.\nWe also describe a method of global control to optimize the response of the\nmean frequency in complex transition networks.\n", "versions": [{"version": "v1", "created": "Thu, 18 Aug 2011 08:59:07 GMT"}, {"version": "v2", "created": "Tue, 8 Nov 2011 07:43:20 GMT"}], "update_date": "2013-03-11", "authors_parsed": [["Toenjes", "R.", ""], ["Kori", "H.", ""]]}, {"id": "1108.3720", "submitter": "Indrani Bose", "authors": "Sayantari Ghosh, Subhasis Banerjee and Indrani Bose", "title": "Emergent Bistability : Effects of Additive and Multiplicative Noise", "comments": "16 pages, 11 figures, version accepted for publication in Eur. Phys.\n  J. E", "journal-ref": "Eur. Phys. J. E. (2012) 35: 11", "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Positive feedback and cooperativity in the regulation of gene expression are\ngenerally considered to be necessary for obtaining bistable expression states.\nRecently, a novel mechanism of bistability termed emergent bistability has been\nproposed which involves only positive feedback and no cooperativity in the\nregulation. An additional positive feedback loop is effectively generated due\nto the inhibition of cellular growth by the synthesized proteins. The\nmechanism, demonstrated for a synthetic circuit, may be prevalent in natural\nsystems also as some recent experimental results appear to suggest. In this\npaper, we study the effects of additive and multiplicative noise on the\ndynamics governing emergent bistability. The calculational scheme employed is\nbased on the Langevin and Fokker-Planck formalisms. The steady state\nprobability distributions of protein levels and the mean first passage times\nare computed for different noise strengths and system parameters. In the region\nof bistability, the bimodal probability distribution is shown to be a linear\ncombination of a lognormal and a Gaussian distribution. The variances of the\nindividual distributions and the relative weights of the distributions are\nfurther calculated for varying noise strengths and system parameters. The\nexperimental relevance of the model results is also pointed out.\n", "versions": [{"version": "v1", "created": "Thu, 18 Aug 2011 11:14:23 GMT"}, {"version": "v2", "created": "Mon, 30 Jan 2012 09:03:39 GMT"}], "update_date": "2012-10-22", "authors_parsed": [["Ghosh", "Sayantari", ""], ["Banerjee", "Subhasis", ""], ["Bose", "Indrani", ""]]}, {"id": "1108.4358", "submitter": "Gunnar W. Klau", "authors": "Mohammed El-Kebir and Jaap Heringa and Gunnar W. Klau", "title": "Lagrangian Relaxation Applied to Sparse Global Network Alignment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data on molecular interactions is increasing at a tremendous pace, while the\ndevelopment of solid methods for analyzing this network data is lagging behind.\nThis holds in particular for the field of comparative network analysis, where\none wants to identify commonalities between biological networks. Since\nbiological functionality primarily operates at the network level, there is a\nclear need for topology-aware comparison methods.\n  In this paper we present a method for global network alignment that is fast\nand robust, and can flexibly deal with various scoring schemes taking both\nnode-to-node correspondences as well as network topologies into account. It is\nbased on an integer linear programming formulation, generalizing the\nwell-studied quadratic assignment problem. We obtain strong upper and lower\nbounds for the problem by improving a Lagrangian relaxation approach and\nintroduce the software tool natalie 2.0, a publicly available implementation of\nour method. In an extensive computational study on protein interaction networks\nfor six different species, we find that our new method outperforms alternative\nstate-of-the-art methods with respect to quality and running time.\n", "versions": [{"version": "v1", "created": "Mon, 22 Aug 2011 15:52:10 GMT"}], "update_date": "2011-08-23", "authors_parsed": [["El-Kebir", "Mohammed", ""], ["Heringa", "Jaap", ""], ["Klau", "Gunnar W.", ""]]}, {"id": "1108.4715", "submitter": "Brian Williams Dr", "authors": "Brian G Williams", "title": "Determinants of sexual transmission of HV: implications for control", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The extent to which ART (anti-retroviral therapy) reduces HIV transmission\nhas received attention in recent years. Using data on the relationship between\ntransmission and viral load we show that transmission saturates at high viral\nloads. We fit a power-law model and an exponential converging to an asymptote.\nUsing data on the viral load in HIV-positive people we show that ART is likely\nto reduce transmission by 91.6% (81.7%-96.2%) under the first and 99.5%\n(98.5%-99.8%) under the second model.\n  The role of the acute phase in HIV transmission is still debated. High levels\nof transmission during the acute phase have been used to argue that failure to\nidentify people in the acute phase of HIV may compromise the impact of\ntreatment on preventing new infections and that having concurrent sexual\npartners during the acute phase is an important driver of the epidemic. We show\nthat the acute phase probably accounts for less than 1% of overall\ntransmission. We also show that even if a significant proportion of infections\nare transmitted during the acute phase, this will not compromise the impact of\ntreatment on population levels of transmission given the constraint implied by\nthe doubling time of the epidemic.\n  This analysis leads to other relevant conclusions. First, it is likely that\ndiscordant-couple studies significantly underestimate the risk of infection.\nSecond, attention should be paid to the variability in set point viral load\nwhich determines both the infectiousness of HIV-positive people and the\nvariability in the susceptibility of HIV-negative people. Third, if ART drugs\nare in short supply those with the highest viral load should be given priority,\nothers things including age, gender and opportunistic infections being equal,\nbut to reduce transmission ART should be offered to all those with a viral load\nabove about 10k/mm.3\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 22:49:09 GMT"}], "update_date": "2011-08-25", "authors_parsed": [["Williams", "Brian G", ""]]}, {"id": "1108.4746", "submitter": "Michael Stumpf", "authors": "Daniel SIlk, Paul D.W. Kirk, Chris P. Barnes, Tina Toni, Anna Rose,\n  Simon Moon, Margaret J. Dallman, Michael P.H. Stumpf", "title": "Designing Attractive Models via Automated Identification of Chaotic and\n  Oscillatory Dynamical Regimes", "comments": "19 pages, 4 figures", "journal-ref": null, "doi": "10.1038/ncomms1496", "report-no": null, "categories": "stat.AP math.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chaos and oscillations continue to capture the interest of both the\nscientific and public domains. Yet despite the importance of these qualitative\nfeatures, most attempts at constructing mathematical models of such phenomena\nhave taken an indirect, quantitative approach, e.g. by fitting models to a\nfinite number of data-points. Here we develop a qualitative inference framework\nthat allows us to both reverse engineer and design systems exhibiting these and\nother dynamical behaviours by directly specifying the desired characteristics\nof the underlying dynamical attractor. This change in perspective from\nquantitative to qualitative dynamics, provides fundamental and new insights\ninto the properties of dynamical systems.\n", "versions": [{"version": "v1", "created": "Wed, 24 Aug 2011 04:11:15 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["SIlk", "Daniel", ""], ["Kirk", "Paul D. W.", ""], ["Barnes", "Chris P.", ""], ["Toni", "Tina", ""], ["Rose", "Anna", ""], ["Moon", "Simon", ""], ["Dallman", "Margaret J.", ""], ["Stumpf", "Michael P. H.", ""]]}, {"id": "1108.4841", "submitter": "Alain Barrat", "authors": "Juliette Stehl\\'e, Nicolas Voirin, Alain Barrat, Ciro Cattuto,\n  Vittoria Colizza, Lorenzo Isella, Corinne R\\'egis, Jean-Fran\\c{c}ois Pinton,\n  Nagham Khanafer, Wouter Van den Broeck, Philippe Vanhems", "title": "Simulation of an SEIR infectious disease model on the dynamic contact\n  network of conference attendees", "comments": null, "journal-ref": "BMC Medicine 2011, 9:87", "doi": "10.1186/1741-7015-9-87", "report-no": null, "categories": "q-bio.QM physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The spread of infectious diseases crucially depends on the pattern of\ncontacts among individuals. Knowledge of these patterns is thus essential to\ninform models and computational efforts. Few empirical studies are however\navailable that provide estimates of the number and duration of contacts among\nsocial groups. Moreover, their space and time resolution are limited, so that\ndata is not explicit at the person-to-person level, and the dynamical aspect of\nthe contacts is disregarded. Here, we want to assess the role of data-driven\ndynamic contact patterns among individuals, and in particular of their temporal\naspects, in shaping the spread of a simulated epidemic in the population.\n  We consider high resolution data of face-to-face interactions between the\nattendees of a conference, obtained from the deployment of an infrastructure\nbased on Radio Frequency Identification (RFID) devices that assess mutual\nface-to-face proximity. The spread of epidemics along these interactions is\nsimulated through an SEIR model, using both the dynamical network of contacts\ndefined by the collected data, and two aggregated versions of such network, in\norder to assess the role of the data temporal aspects.\n  We show that, on the timescales considered, an aggregated network taking into\naccount the daily duration of contacts is a good approximation to the full\nresolution network, whereas a homogeneous representation which retains only the\ntopology of the contact network fails in reproducing the size of the epidemic.\n  These results have important implications in understanding the level of\ndetail needed to correctly inform computational models for the study and\nmanagement of real epidemics.\n", "versions": [{"version": "v1", "created": "Wed, 24 Aug 2011 13:52:28 GMT"}], "update_date": "2011-08-25", "authors_parsed": [["Stehlé", "Juliette", ""], ["Voirin", "Nicolas", ""], ["Barrat", "Alain", ""], ["Cattuto", "Ciro", ""], ["Colizza", "Vittoria", ""], ["Isella", "Lorenzo", ""], ["Régis", "Corinne", ""], ["Pinton", "Jean-François", ""], ["Khanafer", "Nagham", ""], ["Broeck", "Wouter Van den", ""], ["Vanhems", "Philippe", ""]]}, {"id": "1108.4936", "submitter": "Efraim Feinstein", "authors": "Julea Vlassakis, Efraim Feinstein, Darren Yang, Antoine Tilloy,\n  Dominic Weiller, Julian Kates-Harbeck, Vincent Coljee and Mara Prentiss", "title": "The Tension on dsDNA Bound to ssDNA/RecA Filaments May Play an Important\n  Role in Driving Efficient and Accurate Homology Recognition and Strand\n  Exchange", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.87.032702", "report-no": null, "categories": "physics.bio-ph q-bio.BM q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  It is well known that during homology recognition and strand exchange the\ndouble stranded DNA (dsDNA) in DNA/RecA filaments is highly extended, but the\nfunctional role of the extension has been unclear. We present an analytical\nmodel that calculates the distribution of tension in the extended dsDNA during\nstrand exchange. The model suggests that the binding of additional dsDNA base\npairs to the DNA/RecA filament alters the tension in dsDNA that was already\nbound to the filament, resulting in a non-linear increase in the mechanical\nenergy as a function of the number of bound base pairs. This collective\nmechanical response may promote homology stringency and underlie unexplained\nexperimental results.\n", "versions": [{"version": "v1", "created": "Wed, 24 Aug 2011 20:04:39 GMT"}, {"version": "v2", "created": "Tue, 7 Feb 2012 17:26:27 GMT"}, {"version": "v3", "created": "Tue, 6 Nov 2012 20:34:27 GMT"}], "update_date": "2013-03-14", "authors_parsed": [["Vlassakis", "Julea", ""], ["Feinstein", "Efraim", ""], ["Yang", "Darren", ""], ["Tilloy", "Antoine", ""], ["Weiller", "Dominic", ""], ["Kates-Harbeck", "Julian", ""], ["Coljee", "Vincent", ""], ["Prentiss", "Mara", ""]]}, {"id": "1108.5217", "submitter": "Hieu Dinh", "authors": "Dolly Sharma and Sanguthevar Rajasekaran and Hieu Dinh", "title": "An Experimental Comparison of PMSPrune and Other Algorithms for Motif\n  Search", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extracting meaningful patterns from voluminous amount of biological data is a\nvery big challenge. Motifs are biological patterns of great interest to\nbiologists. Many different versions of the motif finding problem have been\nidentified by researchers. Examples include the Planted $(l, d)$ Motif version,\nthose based on position-specific score matrices, etc. A comparative study of\nthe various motif search algorithms is very important for several reasons. For\nexample, we could identify the strengths and weaknesses of each. As a result,\nwe might be able to devise hybrids that will perform better than the individual\ncomponents. In this paper we (either directly or indirectly) compare the\nperformance of PMSprune (an algorithm based on the $(l, d)$ motif model) and\nseveral other algorithms in terms of seven measures and using well established\nbenchmarks\n  In this paper, we (directly or indirectly) compare the quality of motifs\npredicted by PMSprune and 14 other algorithms. We have employed several\nbenchmark datasets including the one used by Tompa, et.al. These comparisons\nshow that the performance of PMSprune is competitive when compared to the other\n14 algorithms tested.\n  We have compared (directly or indirectly) the performance of PMSprune and 14\nother algorithms using the Benchmark dataset provided by Tompa, et.al. It is\nobserved that both PMSprune and DME (an algorithm based on position-specific\nscore matrices) in general perform better than the 13 algorithms reported in\nTompa et. al.. Subsequently we have compared PMSprune and DME on other\nbenchmark data sets including ChIP-Chip, ChIP-seq, and ABS. Between PMSprune\nand DME, PMSprune performs better than DME on six measures. DME performs better\nthan PMSprune on one measure (namely, specificity).\n", "versions": [{"version": "v1", "created": "Fri, 26 Aug 2011 00:26:44 GMT"}], "update_date": "2011-08-29", "authors_parsed": [["Sharma", "Dolly", ""], ["Rajasekaran", "Sanguthevar", ""], ["Dinh", "Hieu", ""]]}, {"id": "1108.5397", "submitter": "Charles Bergeron PhD", "authors": "Charles Bergeron, Theresa Hepburn, C. Matthew Sundling, Michael Krein,\n  Bill Katt, Nagamani Sukumar, Curt M. Breneman, Kristin P. Bennett", "title": "Prediction of peptide bonding affinity: kernel methods for nonlinear\n  modeling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents regression models obtained from a process of blind\nprediction of peptide binding affinity from provided descriptors for several\ndistinct datasets as part of the 2006 Comparative Evaluation of Prediction\nAlgorithms (COEPRA) contest. This paper finds that kernel partial least\nsquares, a nonlinear partial least squares (PLS) algorithm, outperforms PLS,\nand that the incorporation of transferable atom equivalent features improves\npredictive capability.\n", "versions": [{"version": "v1", "created": "Fri, 26 Aug 2011 21:21:51 GMT"}], "update_date": "2011-08-30", "authors_parsed": [["Bergeron", "Charles", ""], ["Hepburn", "Theresa", ""], ["Sundling", "C. Matthew", ""], ["Krein", "Michael", ""], ["Katt", "Bill", ""], ["Sukumar", "Nagamani", ""], ["Breneman", "Curt M.", ""], ["Bennett", "Kristin P.", ""]]}, {"id": "1108.5746", "submitter": "Miroslaw Rewekant PhD MD", "authors": "Slawomir Piekarski and Miroslaw Rewekant", "title": "On drug transport after intravenous administration", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A mathematical model of a drug transport after rapid injection is given. It\ntakes into account three processes: - drug plasma protein binding in central\ncompartment - transport processes between the central compartment and the\nperipheral compartment - elimination of a drug from the central compartment. .\n", "versions": [{"version": "v1", "created": "Mon, 29 Aug 2011 20:33:45 GMT"}], "update_date": "2012-08-21", "authors_parsed": [["Piekarski", "Slawomir", ""], ["Rewekant", "Miroslaw", ""]]}]