[{"id": "1201.0158", "submitter": "Marc Lefranc", "authors": "Quentin Thommen (PhLAM), Benjamin Pfeuty (PhLAM), Florence Corellou\n  (LOMIC), Fran\\c{c}ois-Yves Bouget (LOMIC), Marc Lefranc (PhLAM)", "title": "Robust and flexible response of Ostreococcus tauri circadian clock to\n  light/dark cycles of varying photoperiod", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The green microscopic alga Ostreococcus tauri has recently emerged as a\npromising model for understanding how circadian clocks, which drive the daily\nbiological rythms of many organisms, synchronize to the day/night cycle in\nchanging weather and seasons. Here, we analyze translational reporter time\nseries data of its central clock genes CCA1 and TOC1 for a wide range of\ndaylight durations (photoperiods). The variation of temporal profiles with day\nduration is complex, with the two actors tracking different moments of the day.\nNevertheless, all profiles are accurately reproduced by a simple two-gene\ntranscriptional loop model whose parameters are affected by light only through\nthe photoperiod value. We show that this non-intuitive behavior allows the\ncircadian clock to combine flexibility and robustness to daylight fluctuations.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 17:37:25 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Thommen", "Quentin", "", "PhLAM"], ["Pfeuty", "Benjamin", "", "PhLAM"], ["Corellou", "Florence", "", "LOMIC"], ["Bouget", "François-Yves", "", "LOMIC"], ["Lefranc", "Marc", "", "PhLAM"]]}, {"id": "1201.0246", "submitter": "Yu Wu", "authors": "Yu Wu, Wenlian Lu, Wei Lin, Gareth Leng, Jianfeng Feng", "title": "Bifurcations of Emergent Bursting in a Neuronal Network", "comments": "7 figures, 1 table", "journal-ref": null, "doi": "10.1371/journal.pone.0038402", "report-no": null, "categories": "q-bio.QM math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently we routinely develop a complex neuronal network to explain observed\nbut often paradoxical phenomena based upon biological recordings. Here we\npresent a general approach to demonstrate how to mathematically tackle such a\ncomplex neuronal network so that we can fully understand the underlying\nmechanism. Using an oxytocin network developed earlier as an example, we show\nhow we can reduce a complex model with many variables to a tractable model with\ntwo variables, while retaining all key qualitative features of the model. The\napproach enables us to uncover how emergent synchronous bursting could arise\nfrom a neuronal network which embodies all known biological features.\nSurprisingly, the discovered mechanisms for bursting are similar to those found\nin other systems reported in the literature, and illustrate a generic way to\nexhibit emergent and multi-time scale spikes: at the membrane potential level\nand the firing rate level.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 10:59:56 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Wu", "Yu", ""], ["Lu", "Wenlian", ""], ["Lin", "Wei", ""], ["Leng", "Gareth", ""], ["Feng", "Jianfeng", ""]]}, {"id": "1201.0739", "submitter": "Thomas Risler", "authors": "Andrei S. Kozlov, Johannes Baumgart, Thomas Risler, Corstiaen P. C.\n  Versteegh and A. J. Hudspeth", "title": "Forces between clustered stereocilia minimize friction in the ear on a\n  subnanometre scale", "comments": "21 pages, including 3 figures. For supplementary information, please\n  see the online version of the article at http://www.nature.com/nature", "journal-ref": "Nature 474, 376-379 (2011)", "doi": "10.1038/nature10073", "report-no": null, "categories": "q-bio.SC physics.bio-ph physics.comp-ph physics.flu-dyn q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The detection of sound begins when energy derived from acoustic stimuli\ndeflects the hair bundles atop hair cells. As hair bundles move, the viscous\nfriction between stereocilia and the surrounding liquid poses a fundamental\nchallenge to the ear's high sensitivity and sharp frequency selectivity. Part\nof the solution to this problem lies in the active process that uses energy for\nfrequency-selective sound amplification. Here we demonstrate that a\ncomplementary part involves the fluid-structure interaction between the liquid\nwithin the hair bundle and the stereocilia. Using force measurement on a\ndynamically scaled model, finite-element analysis, analytical estimation of\nhydrodynamic forces, stochastic simulation and high-resolution interferometric\nmeasurement of hair bundles, we characterize the origin and magnitude of the\nforces between individual stereocilia during small hair-bundle deflections. We\nfind that the close apposition of stereocilia effectively immobilizes the\nliquid between them, which reduces the drag and suppresses the relative\nsqueezing but not the sliding mode of stereociliary motion. The obliquely\noriented tip links couple the mechanotransduction channels to this least\ndissipative coherent mode, whereas the elastic horizontal top connectors\nstabilize the structure, further reducing the drag. As measured from the\ndistortion products associated with channel gating at physiological stimulation\namplitudes of tens of nanometres, the balance of forces in a hair bundle\npermits a relative mode of motion between adjacent stereocilia that encompasses\nonly a fraction of a nanometre. A combination of high-resolution experiments\nand detailed numerical modelling of fluid-structure interactions reveals the\nphysical principles behind the basic structural features of hair bundles and\nshows quantitatively how these organelles are adapted to the needs of sensitive\nmechanotransduction.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 20:12:43 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Kozlov", "Andrei S.", ""], ["Baumgart", "Johannes", ""], ["Risler", "Thomas", ""], ["Versteegh", "Corstiaen P. C.", ""], ["Hudspeth", "A. J.", ""]]}, {"id": "1201.0913", "submitter": "Na-Rae Kim", "authors": "Na-Rae Kim and Chan-Byoung Chae", "title": "Novel Modulation Techniques using Isomers as Messenger Molecules for\n  Molecular Communication via Diffusion", "comments": "5 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CE cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose novel modulation techniques using isomers as\nmessenger molecules for nano communication via diffusion. To evaluate\nachievable rate performance, we compare the proposed techniques with\nconcentration-based and molecular-type-based methods. Analytical and numerical\nresults confirm that the proposed modulation techniques achieve higher data\ntransmission rate performance than conventional insulin based concepts.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 02:33:19 GMT"}], "update_date": "2012-01-05", "authors_parsed": [["Kim", "Na-Rae", ""], ["Chae", "Chan-Byoung", ""]]}, {"id": "1201.0940", "submitter": "Mathilde Bouvel", "authors": "Mathilde Bouvel, Cedric Chauve, Marni Mishna, Dominique Rossin", "title": "Average-case analysis of perfect sorting by reversals (Journal Version)", "comments": "A preliminary version of this work appeared in the proceedings of\n  Combinatorial Pattern Matching (CPM) 2009. See arXiv:0901.2847; Discrete\n  Mathematics, Algorithms and Applications, vol. 3(3), 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS math.CO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Perfect sorting by reversals, a problem originating in computational\ngenomics, is the process of sorting a signed permutation to either the identity\nor to the reversed identity permutation, by a sequence of reversals that do not\nbreak any common interval. B\\'erard et al. (2007) make use of strong interval\ntrees to describe an algorithm for sorting signed permutations by reversals.\nCombinatorial properties of this family of trees are essential to the algorithm\nanalysis. Here, we use the expected value of certain tree parameters to prove\nthat the average run-time of the algorithm is at worst, polynomial, and\nadditionally, for sufficiently long permutations, the sorting algorithm runs in\npolynomial time with probability one. Furthermore, our analysis of the subclass\nof commuting scenarios yields precise results on the average length of a\nreversal, and the average number of reversals.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 17:28:57 GMT"}], "update_date": "2012-01-05", "authors_parsed": [["Bouvel", "Mathilde", ""], ["Chauve", "Cedric", ""], ["Mishna", "Marni", ""], ["Rossin", "Dominique", ""]]}, {"id": "1201.2072", "submitter": "Ajit Kumar", "authors": "Ajit Kumar, Kre\\v{s}imir Josi\\'c", "title": "Piecewise linear models of chemical reaction networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that certain non-linear dynamical systems with non-linearities in the\nform of Hill functions, can be approximated by piecewise linear dynamical\nsystems. The resulting piecewise systems have closed form solutions that can be\nused to understand the behavior of the fully nonlinear system. We justify the\nreduction using geometric singular perturbation theory, and illustrate the\nresults in networks modeling a genetic switch and a genetic oscillator.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2012 15:16:52 GMT"}], "update_date": "2012-01-11", "authors_parsed": [["Kumar", "Ajit", ""], ["Josić", "Krešimir", ""]]}, {"id": "1201.2243", "submitter": "Cyrill Muratov", "authors": "Peter V. Gordon and Cyrill B. Muratov", "title": "Self-similarity and long-time behavior of solutions of the diffusion\n  equation with nonlinear absorption and a boundary source", "comments": null, "journal-ref": "Netw. Heterog. Media 7, 767-780 (2012)", "doi": "10.3934/nhm.2012.7.767", "report-no": null, "categories": "math.AP nlin.PS q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the long-time behavior of solutions of nonlinear\nreaction-diffusion equations describing formation of morphogen gradients, the\nconcentration fields of molecules acting as spatial regulators of cell\ndifferentiation in developing tissues. For the considered class of models, we\nestablish existence of a new type of ultra-singular self-similar solutions.\nThese solutions arise as limits of the solutions of the initial value problem\nwith zero initial data and infinitely strong source at the boundary. We prove\nexistence and uniqueness of such solutions in the suitable weighted energy\nspaces. Moreover, we prove that the obtained self-similar solutions are the\nlong-time limits of the solutions of the initial value problem with zero\ninitial data and a time-independent boundary source.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 05:15:06 GMT"}], "update_date": "2013-03-27", "authors_parsed": [["Gordon", "Peter V.", ""], ["Muratov", "Cyrill B.", ""]]}, {"id": "1201.2366", "submitter": "Santiago Trevi\\~no III", "authors": "Santiago Trevi\\~no and Yudong Sun and Tim F. Cooper and Kevin E.\n  Bassler", "title": "Robust Detection of Hierarchical Communities from Escherichia coli Gene\n  Expression Data", "comments": "Due to appear in PLoS Computational Biology. Supplementary Figure S1\n  was not uploaded but is available by contacting the author. 27 pages, 5\n  figures, 15 supplementary files", "journal-ref": null, "doi": "10.1371/journal.pcbi.1002391", "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Determining the functional structure of biological networks is a central goal\nof systems biology. One approach is to analyze gene expression data to infer a\nnetwork of gene interactions on the basis of their correlated responses to\nenvironmental and genetic perturbations. The inferred network can then be\nanalyzed to identify functional communities. However, commonly used algorithms\ncan yield unreliable results due to experimental noise, algorithmic\nstochasticity, and the influence of arbitrarily chosen parameter values.\nFurthermore, the results obtained typically provide only a simplistic view of\nthe network partitioned into disjoint communities and provide no information of\nthe relationship between communities. Here, we present methods to robustly\ndetect coregulated and functionally enriched gene communities and demonstrate\ntheir application and validity for Escherichia coli gene expression data.\nApplying a recently developed community detection algorithm to the network of\ninteractions identified with the context likelihood of relatedness (CLR)\nmethod, we show that a hierarchy of network communities can be identified.\nThese communities significantly enrich for gene ontology (GO) terms, consistent\nwith them representing biologically meaningful groups. Further, analysis of the\nmost significantly enriched communities identified several candidate new\nregulatory interactions. The robustness of our methods is demonstrated by\nshowing that a core set of functional communities is reliably found when\nartificial noise, modeling experimental noise, is added to the data. We find\nthat noise mainly acts conservatively, increasing the relatedness required for\na network link to be reliably assigned and decreasing the size of the core\ncommunities, rather than causing association of genes into new communities.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 18:12:04 GMT"}, {"version": "v2", "created": "Thu, 12 Jan 2012 02:21:09 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Treviño", "Santiago", ""], ["Sun", "Yudong", ""], ["Cooper", "Tim F.", ""], ["Bassler", "Kevin E.", ""]]}, {"id": "1201.3022", "submitter": "Sachin Talathi", "authors": "Roxana A. Stephanescu, R.G. Shivakeshavan, Sachin S. Talathi", "title": "Computational Models For Epilepsy", "comments": "4 figures", "journal-ref": "Seizure: European Journal of Epilepsy, 2012 Dec;21(10):748-59", "doi": "10.1016/j.seizure.2012.08.012", "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epilepsy is a neurological disease characterized by recurrent and spontaneous\nseizures. It affects approximately 50 million people worldwide. In majority of\nthe cases accurate diagnosis of the disease can be made without using any\ntechnologically advanced techniques and seizures are controlled using standard\ntreatment in the form of regular use of anti-epileptic drugs. However,\napproximately 30% of the patients suffer from medically refractory epilepsy,\nwherein seizures are not controlled by the use of anti-epileptic drugs.\nUnderstanding the mechanisms underlying these forms of drug resistant epileptic\nseizures and the development of alternative effective treatment strategies is a\nfundamental challenge in modern epilepsy research. In this context, the need\nfor integrative approaches combining various modalities of treatment strategies\nis high. Computational modeling has gained prominence in recent years as an\nimportant tool for tackling the complexity of the epileptic phenomenon. In this\nreview article we present a survey of different computational models for\nepilepsy and discuss how computer models can aid in our understanding of brain\nmechanisms in epilepsy and the development of new epilepsy treatment protocols.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jan 2012 14:49:09 GMT"}], "update_date": "2013-04-05", "authors_parsed": [["Stephanescu", "Roxana A.", ""], ["Shivakeshavan", "R. G.", ""], ["Talathi", "Sachin S.", ""]]}, {"id": "1201.3380", "submitter": "Chris Oates", "authors": "Chris. J. Oates, Steven. M. Hill and Sach Mukherjee", "title": "On the relationship between ODEs and DBNs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, Li et al. (Bioinformatics 27(19), 2686-91, 2011) proposed a method,\ncalled Differential Equation-based Local Dynamic Bayesian Network (DELDBN), for\nreverse engineering gene regulatory networks from time-course data. We commend\nthe authors for an interesting paper that draws attention to the close\nrelationship between dynamic Bayesian networks (DBNs) and differential\nequations (DEs). Their central claim is that modifying a DBN to model Euler\napproximations to the gradient rather than expression levels themselves is\nbeneficial for network inference. The empirical evidence provided is based on\ntime-course data with equally-spaced observations. However, as we discuss\nbelow, in the particular case of equally-spaced observations, Euler\napproximations and conventional DBNs lead to equivalent statistical models\nthat, absent artefacts due to the estimation procedure, yield networks with\nidentical inter-gene edge sets. Here, we discuss further the relationship\nbetween DEs and conventional DBNs and present new empirical results on\nunequally spaced data which demonstrate that modelling Euler approximations in\na DBN can lead to improved network reconstruction.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2012 21:47:45 GMT"}, {"version": "v2", "created": "Fri, 2 Mar 2012 20:46:19 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["Oates", "Chris. J.", ""], ["Hill", "Steven. M.", ""], ["Mukherjee", "Sach", ""]]}, {"id": "1201.3574", "submitter": "Reynaldo Daniel Pinto Ph.D.", "authors": "Caroline Garcia Forlim, Reynaldo Daniel Pinto", "title": "Noninvasive Realistic Stimulation/Recording of Freely Swimming Weakly\n  Electric Fish: Movement Detection and Discharge Entropy to Infer Fish\n  Behavior", "comments": "25 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Weakly electric fish are unique models in Neuroscience allowing\nexperimentalists to access, with non invasive techniques,a central nervous\nsystem generated spatio-temporal electric pattern of pulses with roles in at\nleast two complex and not yet completely understood\nabilities:electrocommunication and electrolocation. We developed an apparatus\nto allow realistic stimulation and simultaneous recording of electric pulses in\nfreely moving Gymnotus carapo for very long periods-several days. Voltage time\nseries from a 3dimensional array of sensitive dipoles that detects electric\nfield in several positions underwater were digitized and home made real-time\nsoftware allowed reliable recording of pulse timestamps,independently of the\nfish's position,and also to infer fish movement. A stimulus fish was mimicked\nby a dipole electrode that reproduced the voltage time series of real\nconspecific pulses,but according to timestamp sequences previously recorded\nthat could be chosen by the experimenter. Two independent variables were used\nto analyze fish behavior:the entropy of the recorded timestamp sequences and\nthe movement of the fish inferred from pulse amplitude variability at each\ndetection dipole. All fish presented very long transient exploratory behavior\n(about 8hours) when exposed to a new environment in the absence of stimuli.\nAfter the transient there were several intervals(5min-2hours),in which entropy\nvanished and no movement was observed, that could be associated with behavioral\nsleeping. Our experiments also revealed that fish are able to discriminate\nbetween real and random stimuli distributions by changing the timing\nprobability of the next discharge. Moreover,most fish presented behavioral\nsleep periods when the artificial fish timestamp sequence was random,but no\nfish showed any behavioral sleep period when the artificial fish fired\naccording to a real fish timestamp series.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jan 2012 17:55:18 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Forlim", "Caroline Garcia", ""], ["Pinto", "Reynaldo Daniel", ""]]}, {"id": "1201.3749", "submitter": "Steffen Waldherr", "authors": "Steffen Waldherr and Bernard Haasdonk", "title": "Efficient parametric analysis of the chemical master equation through\n  model order reduction", "comments": "23 pages, 8 figures, 2 tables", "journal-ref": "BMC Systems Biology 2012, 6:81", "doi": "10.1186/1752-0509-6-81", "report-no": null, "categories": "q-bio.QM math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Stochastic biochemical reaction networks are commonly modelled by\nthe chemical master equation, and can be simulated as first order linear\ndifferential equations through a finite state projection. Due to the very high\nstate space dimension of these equations, numerical simulations are\ncomputationally expensive. This is a particular problem for analysis tasks\nrequiring repeated simulations for different parameter values. Such tasks are\ncomputationally expensive to the point of infeasibility with the chemical\nmaster equation. Results: In this article, we apply parametric model order\nreduction techniques in order to construct accurate low-dimensional parametric\nmodels of the chemical master equation. These surrogate models can be used in\nvarious parametric analysis task such as identifiability analysis, parameter\nestimation, or sensitivity analysis. As biological examples, we consider two\nmodels for gene regulation networks, a bistable switch and a network displaying\nstochastic oscillations. Conclusions: The results show that the parametric\nmodel reduction yields efficient models of stochastic biochemical reaction\nnetworks, and that these models can be useful for systems biology applications\ninvolving parametric analysis problems such as parameter exploration,\noptimization, estimation or sensitivity analysis.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 10:41:12 GMT"}, {"version": "v2", "created": "Mon, 9 Jul 2012 15:36:07 GMT"}], "update_date": "2012-07-10", "authors_parsed": [["Waldherr", "Steffen", ""], ["Haasdonk", "Bernard", ""]]}, {"id": "1201.3867", "submitter": "Gregory Bowman", "authors": "Gregory R. Bowman", "title": "Improved coarse-graining of Markov state models via explicit\n  consideration of statistical uncertainty", "comments": null, "journal-ref": null, "doi": "10.1063/1.4755751", "report-no": null, "categories": "q-bio.BM physics.bio-ph physics.chem-ph physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Markov state models (MSMs)---or discrete-time master equation models---are a\npowerful way of modeling the structure and function of molecular systems like\nproteins. Unfortunately, MSMs with sufficiently many states to make a\nquantitative connection with experiments (often tens of thousands of states\neven for small systems) are generally too complicated to understand. Here, I\npresent a Bayesian agglomerative clustering engine (BACE) for coarse-graining\nsuch Markov models, thereby reducing their complexity and making them more\ncomprehensible. An important feature of this algorithm is its ability to\nexplicitly account for statistical uncertainty in model parameters that arises\nfrom finite sampling. This advance builds on a number of recent works\nhighlighting the importance of accounting for uncertainty in the analysis of\nMSMs and provides significant advantages over existing methods for\ncoarse-graining Markov state models. The closed-form expression I derive here\nfor determining which states to merge is equivalent to the generalized\nJensen-Shannon divergence, an important measure from information theory that is\nrelated to the relative entropy. Therefore, the method has an appealing\ninformation theoretic interpretation in terms of minimizing information loss.\nThe bottom-up nature of the algorithm likely makes it particularly well suited\nfor constructing mesoscale models. I also present an extremely efficient\nexpression for Bayesian model comparison that can be used to identify the most\nmeaningful levels of the hierarchy of models from BACE.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 18:08:08 GMT"}, {"version": "v2", "created": "Tue, 31 Jan 2012 18:34:11 GMT"}, {"version": "v3", "created": "Fri, 24 Feb 2012 21:57:51 GMT"}, {"version": "v4", "created": "Tue, 24 Jul 2012 17:53:08 GMT"}, {"version": "v5", "created": "Mon, 3 Sep 2012 22:15:16 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Bowman", "Gregory R.", ""]]}, {"id": "1201.3937", "submitter": "Jarad Niemi", "authors": "Michael D. Porter and Jarad B. Niemi and Brian J. Reich", "title": "Mixture Likelihood Ratio Scan Statistic for Disease Outbreak Detection", "comments": "The research was performed in connection with a technical contest put\n  on by the International Society for Disease Surveillance. The article was\n  prepared for a special edition of the journal Advances in Disease\n  Surveillance that never materialized", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Early detection of disease outbreaks is of paramount importance to\nimplementing intervention strategies to mitigate the severity and duration of\nthe outbreak. We build methodology that utilizes the characteristic profile of\ndisease outbreaks to reduce the time to detection and false positive rate. We\nmodel daily counts through a Poisson distribution with additive background plus\noutbreak components. The outbreak component has a parametric form with unknown\nunderlying parameters. A mixture likelihood ratio scan statistic is developed\nto maximize parameters over a window in time. This provides an alert statistic\nwith early time to detection and low false positive rate. The methodology is\ndemonstrated on three simulated data sets meant to represent E. coli,\nCryptosporidium, and Influenza outbreaks.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 21:59:02 GMT"}], "update_date": "2012-01-20", "authors_parsed": [["Porter", "Michael D.", ""], ["Niemi", "Jarad B.", ""], ["Reich", "Brian J.", ""]]}, {"id": "1201.4499", "submitter": "Alvaro Juan Ojeda Garcia", "authors": "Alvaro Juan Ojeda Garcia", "title": "Mathematical and computational modeling for describing the basic\n  behavior of free radicals and antioxidants within epithelial cells", "comments": "4 pages, 5 figures. Treball de Recerca, gener de 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The traditional methods of the biology, based on illustrative descriptions\nand linear logic explanations, are discussed. This work aims to improve this\napproach by introducing alternative tools to describe and represent complex\nbiological systems. Two models were developed, one mathematical and another\ncomputational, both were made in order to study the biological process between\nfree radicals and antioxidants. Each model was used to study the same process\nbut in different scenarios. The mathematical model was used to study the\nbiological process in an epithelial cells culture; this model was validated\nwith the experimental data of Anne Hanneken's research group from the\nDepartment of Molecular and Experimental Medicine, published by the journal\nInvestigative Ophthalmology and Visual Science in July 2006. The computational\nmodel was used to study the same process in an individual. The model was made\nusing C++ programming language, supported by the network theory of aging.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jan 2012 19:12:38 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Garcia", "Alvaro Juan Ojeda", ""]]}, {"id": "1201.4587", "submitter": "Konstantin Blyuss", "authors": "K. B. Blyuss, Y. N. Kyrychko", "title": "Stability and bifurcations in an epidemic model with varying immunity\n  period", "comments": "16 pages, 5 figures", "journal-ref": "Bull. Math. Biol. 72, 490-505 (2010)", "doi": "10.1007/s11538-009-9458-y", "report-no": null, "categories": "nlin.CD math.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An epidemic model with distributed time delay is derived to describe the\ndynamics of infectious diseases with varying immunity. It is shown that\nsolutions are always positive, and the model has at most two steady states:\ndisease-free and endemic. It is proved that the disease-free equilibrium is\nlocally and globally asymptotically stable. When an endemic equilibrium exists,\nit is possible to analytically prove its local and global stability using\nLyapunov functionals. Bifurcation analysis is performed using DDE-BIFTOOL and\ntraceDDE to investigate different dynamical regimes in the model using\nnumerical continuation for different values of system parameters and different\nintegral kernels.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 18:42:34 GMT"}], "update_date": "2012-09-21", "authors_parsed": [["Blyuss", "K. B.", ""], ["Kyrychko", "Y. N.", ""]]}, {"id": "1201.4591", "submitter": "Konstantin Blyuss", "authors": "K. B. Blyuss, S. Gupta", "title": "Stability and bifurcations in a model of antigenic variation in malaria", "comments": "14 pages, 5 figures", "journal-ref": "J. Math. Biol. 58, 923-937 (2009)", "doi": "10.1007/s00285-008-0204-0", "report-no": null, "categories": "nlin.CD math.DS q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the properties of a recently proposed model for antigenic\nvariation in malaria which incorporates multiple epitopes and both long-lasting\nand transient immune responses. We show that in the case of a vanishing decay\nrate for the long-lasting immune response, the system exhibits the so-called\n\"bifurcations without parameters\" due to the existence of a hypersurface of\nequilibria in the phase space. When the decay rate of the long-lasting immune\nresponse is different from zero, the hypersurface of equilibria degenerates,\nand a multitude of other steady states are born, many of which are related by a\npermutation symmetry of the system. The robustness of the fully symmetric state\nof the system was investigated by means of numerical computation of transverse\nLyapunov exponents. The results of this exercise indicate that for a vanishing\ndecay of long-lasting immune response, the fully symmetric state is not robust\nin the substantial part of the parameter space, and instead all variants\ndevelop their own temporal dynamics contributing to the overall time evolution.\nAt the same time, if the decay rate of the long-lasting immune response is\nincreased, the fully symmetric state can become robust provided the growth rate\nof the long-lasting immune response is rapid.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 19:15:09 GMT"}], "update_date": "2012-09-21", "authors_parsed": [["Blyuss", "K. B.", ""], ["Gupta", "S.", ""]]}, {"id": "1201.4618", "submitter": "Charalampos Tsourakakis", "authors": "Charalampos E. Tsourakakis", "title": "Perfect Reconstruction of Oncogenetic Trees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.DM math.CO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note we provide the necessary and sufficient conditions to uniquely\nreconstruct an oncogenetic tree.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2012 00:57:43 GMT"}], "update_date": "2012-10-18", "authors_parsed": [["Tsourakakis", "Charalampos E.", ""]]}, {"id": "1201.4914", "submitter": "Chandra Sekhar t", "authors": "T. Chandrasekhar, K. Thangavel, E. Elayaraja", "title": "Effective Clustering Algorithms for Gene Expression Data", "comments": "5 pages", "journal-ref": "International Journal of Computer Applications (0975 - 8887)\n  Volume 32 - No.4, October 2011", "doi": null, "report-no": null, "categories": "cs.CE q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Microarrays are made it possible to simultaneously monitor the expression\nprofiles of thousands of genes under various experimental conditions.\nIdentification of co-expressed genes and coherent patterns is the central goal\nin microarray or gene expression data analysis and is an important task in\nBioinformatics research. In this paper, K-Means algorithm hybridised with\nCluster Centre Initialization Algorithm (CCIA) is proposed Gene Expression\nData. The proposed algorithm overcomes the drawbacks of specifying the number\nof clusters in the K-Means methods. Experimental analysis shows that the\nproposed method performs well on gene Expression Data when compare with the\ntraditional K- Means clustering and Silhouette Coefficients cluster measure.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 06:37:49 GMT"}], "update_date": "2012-01-25", "authors_parsed": [["Chandrasekhar", "T.", ""], ["Thangavel", "K.", ""], ["Elayaraja", "E.", ""]]}, {"id": "1201.5082", "submitter": "Sayak Mukherjee", "authors": "Michael Dworkin, Sayak Mukherjee, Ciriyam Jayaprakash and Jayajit Das", "title": "Dramatic reduction of dimensionality in large biochemical networks due\n  to strong pair correlations", "comments": "22 pages, 4 figures, The supplementary material is available at\n  http://planetx.nationwidechildrens.org/~jayajit/, accepted for publication in\n  the Journal of Royal Society Interface", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.stat-mech q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large multidimensionality of high-throughput datasets pertaining to cell\nsignaling and gene regulation renders it difficult to extract mechanisms\nunderlying the complex kinetics involving various biochemical compounds (e.g.,\nproteins, lipids). Data-driven models often circumvent this difficulty by using\npair correlations of the protein expression levels to produce a small numbers\n(<10) of principal components, each a linear combination of the concentrations,\nto successfully model how cells respond to different stimuli. However, it is\nnot understood if this reduction is specific to a particular biological system\nor to nature of the stimuli used in these experiments. We study temporal\nchanges in pair correlations described by the covariance matrix between\ndifferent molecular species that evolve following deterministic mass action\nkinetics in large biologically relevant reaction networks and show that this\ndramatic reduction of dimensions (from hundreds to <5) arises from the strong\ncorrelations between different species at any time and is in sensitive of the\nform of the nonlinear interactions, network architecture and values of rate\nconstants and concentrations over a wide range. We relate temporal changes in\nthe eigenvalue spectrum of the covariance matrix to low-dimensional, local\nchanges in directions of the trajectory embedded in much larger dimensions\nusing elementary differential geometry. We illustrate how to extract\nbiologically relevant insights such as identifying significant time scales and\ngroups of correlated chemical species from our analysis. Our work provides for\nthe first time a theoretical underpinning for the successful experimental\nanalysis and points to way to extract mechanisms from large- scale high\nthroughput data sets.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 18:37:17 GMT"}], "update_date": "2012-01-25", "authors_parsed": [["Dworkin", "Michael", ""], ["Mukherjee", "Sayak", ""], ["Jayaprakash", "Ciriyam", ""], ["Das", "Jayajit", ""]]}, {"id": "1201.5428", "submitter": "Joshua Goldwyn", "authors": "Joshua H. Goldwyn, Jay T. Rubinstein, Eric Shea-Brown", "title": "A point process framework for modeling electrical stimulation of the\n  auditory nerve", "comments": "1 title page, 27 manuscript pages, 14 figures, 1 table, 1 appendix", "journal-ref": null, "doi": "10.1152/jn.00095.2012", "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Model-based studies of auditory nerve responses to electrical stimulation can\nprovide insight into the functioning of cochlear implants. Ideally, these\nstudies can identify limitations in sound processing strategies and lead to\nimproved methods for providing sound information to cochlear implant users. To\naccomplish this, models must accurately describe auditory nerve spiking while\navoiding excessive complexity that would preclude large-scale simulations of\npopulations of auditory nerve fibers and obscure insight into the mechanisms\nthat influence neural encoding of sound information. In this spirit, we develop\na point process model of the auditory nerve that provides a compact and\naccurate description of neural responses to electric stimulation. Inspired by\nthe framework of generalized linear models, the proposed model consists of a\ncascade of linear and nonlinear stages. We show how each of these stages can be\nassociated with biophysical mechanisms and related to models of neuronal\ndynamics. Moreover, we derive a semi-analytical procedure that uniquely\ndetermines each parameter in the model on the basis of fundamental statistics\nfrom recordings of single fiber responses to electric stimulation, including\nthreshold, relative spread, jitter, and chronaxie. The model also accounts for\nrefractory and summation effects that influence the responses of auditory nerve\nfibers to high pulse rate stimulation. Throughout, we compare model predictions\nto published physiological data and explain differences in auditory nerve\nresponses to high and low pulse rate stimulation. We close by performing an\nideal observer analysis of simulated spike trains in response to sinusoidally\namplitude modulated stimuli and find that carrier pulse rate does not affect\nmodulation detection thresholds.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 02:14:16 GMT"}], "update_date": "2015-08-07", "authors_parsed": [["Goldwyn", "Joshua H.", ""], ["Rubinstein", "Jay T.", ""], ["Shea-Brown", "Eric", ""]]}, {"id": "1201.5893", "submitter": "Ralph Brinks", "authors": "Ralph Brinks", "title": "A new stochastic differential equation modelling incidence and\n  prevalence with an application to systemic lupus erythematosus in England and\n  Wales, 1995", "comments": "10 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article reformulates a common illness-death model in terms of a new\nsystem of stochastical differential equations (SDEs). The SDEs are used to\nestimate epidemiological characteristics and burden of systemic lupus\nerythematosus in England and Wales in 1995.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2012 21:01:14 GMT"}], "update_date": "2012-01-31", "authors_parsed": [["Brinks", "Ralph", ""]]}, {"id": "1201.6321", "submitter": "Michael B\\\"orsch", "authors": "Marc Renz, Torsten Rendler, Michael Boersch", "title": "Diffusion properties of single FoF1-ATP synthases in a living bacterium\n  unraveled by localization microscopy", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": "10.1117/12.907089", "report-no": null, "categories": "physics.bio-ph q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  FoF1-ATP synthases in Escherichia coli (E. coli) bacteria are membrane-bound\nenzymes which use an internal proton-driven rotary double motor to catalyze the\nsynthesis of adenosine triphosphate (ATP). According to the 'chemiosmotic\nhypothesis', a series of proton pumps generate the necessary pH difference plus\nan electric potential across the bacterial plasma membrane. These proton pumps\nare redox-coupled membrane enzymes which are possibly organized in\nsupercomplexes, as shown for the related enzymes in the mitochondrial inner\nmembrane. We report diffusion measurements of single fluorescent FoF1-ATP\nsynthases in living E. coli by localization microscopy and single enzyme\ntracking to distinguish a monomeric enzyme from a supercomplex-associated form\nin the bacterial membrane. For quantitative mean square displacement (MSD)\nanalysis, the limited size of the observation area in the membrane with a\nsignificant membrane curvature had to be considered. The E. coli cells had a\ndiameter of about 500 nm and a length of about 2 to 3 \\mum. Because the surface\ncoordinate system yielded different localization precision, we applied a\nsliding observation window approach to obtain the diffusion coefficient D =\n0.072 \\mum2/s of FoF1-ATP synthase in living E. coli cells.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 18:55:19 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Renz", "Marc", ""], ["Rendler", "Torsten", ""], ["Boersch", "Michael", ""]]}]