[{"id": "1306.0069", "submitter": "Stephen Montgomery-Smith", "authors": "Stephen Montgomery-Smith, Francis J. Schmidt", "title": "Statistical Methods for Estimating Complexity from Competition\n  Experiments between Two Populations", "comments": null, "journal-ref": "Journal of Theoretical Biology, Volume 264, Issue 3, 7 June 2010,\n  Pages 1043-1046", "doi": "10.1016/j.bbr.2011.03.031", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Often a screening or selection experiment targets a cell or tissue, which\npresents many possible molecular targets and identifies a correspondingly large\nnumber of ligands. We describe a statistical method to extract an estimate of\nthe complexity or richness of the set of molecular targets from competition\nexperiments between distinguishable ligands, including aptamers derived from\ncombinatorial experiments (SELEX or phage display). In simulations, the\nnonparametric statistic provides a robust estimate of complexity from a 100x100\nmatrix of competition experiments, which is clearly feasible in high-throughput\nformat. The statistic and method are potentially applicable to other ligand\nbinding situations.\n", "versions": [{"version": "v1", "created": "Sat, 1 Jun 2013 03:14:59 GMT"}], "update_date": "2013-06-04", "authors_parsed": [["Montgomery-Smith", "Stephen", ""], ["Schmidt", "Francis J.", ""]]}, {"id": "1306.0150", "submitter": "Mauro Femminella", "authors": "Luca Felicetti, Mauro Femminella, Gianluca Reali", "title": "Simulation of Molecular Signaling in Blood Vessels: Software Design and\n  Application to Atherogenesis", "comments": "Submitted for publication to Nano Communication Networks, Elsevier", "journal-ref": "Nano Communication Networks Vol.4, No.3, September 2013", "doi": "10.1016/j.nancom.2013.06.002", "report-no": null, "categories": "cs.CE cond-mat.soft q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a software platform, named BiNS2, able to simulate\ndiffusion-based molecular communications with drift inside blood vessels. The\ncontribution of the paper is twofold. First a detailed description of the\nsimulator is given, under the software engineering point of view, by\nhighlighting the innovations and optimizations introduced. Their introduction\ninto the previous version of the BiNS simulator was needed to provide to\nfunctions for simulating molecular signaling and communication potentials\ninside bounded spaces. The second contribution consists of the analysis,\ncarried out by using BiNS2, of a specific communication process happening\ninside blood vessels, the atherogenesis, which is the initial phase of the\nformation of atherosclerotic plaques, due to the abnormal signaling between\nplatelets and endothelium. From a communication point of view, platelets act as\nmobile transmitters, endothelial cells are fixed receivers, sticky to the\nvessel walls, and the transmitted signal is made of bursts of molecules emitted\nby platelets. The simulator allows evaluating the channel latency and the\nfootprint on the vessel wall of the transmitted signal as a function of the\ntransmitter distance from the vessels wall, the signal strength, and the\nreceiver sensitivity.\n", "versions": [{"version": "v1", "created": "Sat, 1 Jun 2013 21:05:17 GMT"}], "update_date": "2013-08-16", "authors_parsed": [["Felicetti", "Luca", ""], ["Femminella", "Mauro", ""], ["Reali", "Gianluca", ""]]}, {"id": "1306.0180", "submitter": "Roland Bouffanais", "authors": "Roland Bouffanais, Jianmin Sun and Dick K. P. Yue", "title": "Physical limits on cellular directional mechanosensing", "comments": null, "journal-ref": "Phys. Rev. E, (87), 052716, 2013", "doi": "10.1103/PhysRevE.87.052716", "report-no": null, "categories": "physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many eukaryotic cells are able to perform directional mechanosensing by\ndirectly measuring minute spatial differences in the mechanical stress on their\nmembranes. Here, we explore the limits of a single mechanosensitive channel\nactivation using a two-state double-well model for the gating mechanism. We\nthen focus on the physical limits of directional mechanosensing by a single\ncell having multiple mechanosensors and subjected to a shear flow inducing a\nnonuniform membrane tension. Our results demonstrate that the accuracy in\nsensing the mechanostimulus direction not only increases with cell size and\nexposure to a signal, but also grows for cells with a near-critical membrane\nprestress. Finally, the existence of a nonlinear threshold effect,\nfundamentally limiting the cell's ability to effectively perform directional\nmechanosensing at a low signal-to-noise ratio, is uncovered.\n", "versions": [{"version": "v1", "created": "Sun, 2 Jun 2013 07:34:36 GMT"}], "update_date": "2013-06-04", "authors_parsed": [["Bouffanais", "Roland", ""], ["Sun", "Jianmin", ""], ["Yue", "Dick K. P.", ""]]}, {"id": "1306.0505", "submitter": "Juan Guan", "authors": "Kejia Chen, Bo Wang, Juan Guan, and Steve Granick", "title": "Diagnosing Heterogeneous Dynamics in Single Molecule/Particle\n  Trajectories with Multiscale Wavelets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.data-an physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a simple automated method to extract and quantify transient\nheterogeneous dynamical changes from large datasets generated in single\nmolecule/particle tracking experiments. Based on wavelet transform, the method\ntransforms raw data to locally match dynamics of interest. This is accomplished\nusing statistically adaptive universal thresholding, whose advantage is to\navoid a single arbitrary threshold that might conceal individual variability\nacross populations. How to implement this multiscale method is described,\nfocusing on local confined diffusion separated by transient transport periods\nor hopping events, with 3 specific examples: in cell biology, biotechnology,\nand glassy colloid dynamics. This computationally-efficient method can run\nroutinely on hundreds of millions of data points analyzed within an hour on a\ndesktop personal computer.\n", "versions": [{"version": "v1", "created": "Mon, 3 Jun 2013 17:12:20 GMT"}], "update_date": "2013-06-04", "authors_parsed": [["Chen", "Kejia", ""], ["Wang", "Bo", ""], ["Guan", "Juan", ""], ["Granick", "Steve", ""]]}, {"id": "1306.0697", "submitter": "Norbert Marwan", "authors": "Norbert Marwan, Yong Zou, Niels Wessel, Maik Riedl, J\\\"urgen Kurths", "title": "Estimating coupling directions in the cardio-respiratory system using\n  recurrence properties", "comments": null, "journal-ref": null, "doi": "10.1098/rsta.2011.0624", "report-no": null, "categories": "nlin.CD q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The asymmetry of coupling between complex systems can be studied by\nconditional probabilities of recurrence, which can be estimated by joint\nrecurrence plots. This approach is applied for the first time on experimental\ndata: time series of the human cardio-respiratory system in order to\ninvestigate the couplings between heart rate, mean arterial blood pressure, and\nrespiration. We find that the respiratory system couples towards the heart rate\nand the heart rate towards the mean arterial blood pressure. However, our\nanalysis could not detect a clear coupling direction between the mean arterial\nblood pressure and respiration.\n", "versions": [{"version": "v1", "created": "Tue, 4 Jun 2013 08:19:25 GMT"}], "update_date": "2013-06-05", "authors_parsed": [["Marwan", "Norbert", ""], ["Zou", "Yong", ""], ["Wessel", "Niels", ""], ["Riedl", "Maik", ""], ["Kurths", "Jürgen", ""]]}, {"id": "1306.0924", "submitter": "Tomaso Aste", "authors": "Ruggero Gramatica, T. Di Matteo, Stefano Giorgetti, Massimo Barbiani,\n  Dorian Bevec, Tomaso Aste", "title": "Graph theory enables drug repurposing. How a mathematical model can\n  drive the discovery of hidden Mechanisms of Action", "comments": "8 pages, 7 figures", "journal-ref": "PLoS ONE 9 (2013) e84912", "doi": "10.1371/journal.pone.0084912", "report-no": null, "categories": "q-bio.QM cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduced a methodology to efficiently exploit natural-language expressed\nbiomedical knowledge for repurposing existing drugs towards diseases for which\nthey were not initially intended. Leveraging on developments in Computational\nLinguistics and Graph Theory, a methodology is defined to build a graph\nrepresentation of knowledge, which is automatically analysed to discover hidden\nrelations between any drug and any disease: these relations are specific paths\namong the biomedical entities of the graph, representing possible Modes of\nAction for any given pharmacological compound. These paths are ranked according\nto their relevance, exploiting a measure induced by a stochastic process\ndefined on the graph. Here we show, providing real-world examples, how the\nmethod successfully retrieves known pathophysiological Mode of Actions and\nfinds new ones by meaningfully selecting and aggregating contributions from\nknown bio-molecular interactions. Applications of this methodology are\npresented, and prove the efficacy of the method for selecting drugs as\ntreatment options for rare diseases.\n", "versions": [{"version": "v1", "created": "Tue, 4 Jun 2013 20:41:23 GMT"}], "update_date": "2014-06-17", "authors_parsed": [["Gramatica", "Ruggero", ""], ["Di Matteo", "T.", ""], ["Giorgetti", "Stefano", ""], ["Barbiani", "Massimo", ""], ["Bevec", "Dorian", ""], ["Aste", "Tomaso", ""]]}, {"id": "1306.1181", "submitter": "Ralf Metzler", "authors": "Vladimir V. Palyulin, Aleksei V. Chechkin, and Ralf Metzler", "title": "Searching with and against the stream: Levy or Brown?", "comments": "5 pages, 4 figures, Supplementary Information contained in the source\n  files", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the efficiency of search processes based on Levy flights (LFs) with\npower-law distributed jump lengths in the presence of an external drift. While\nLFs turn out to be efficient search processes when relative to the starting\npoint the target is upstream, in the downstream scenario regular Brownian\nmotion turns out to be advantageous. This is caused by the occurrence of\nleapovers of LFs, due to which LFs typically overshoot a point in space. We\nestablish criteria when the combination of the external stream and the initial\ndistance between the starting point and the target favors LFs over regular\nBrownian search. Contrary to the common belief that LFs with a stable index\nalpha=1 are optimal, we find that the optimal alpha may range in the entire\ninterval (1,2) and even include Brownian motion as the overall most efficient\nsearch strategy.\n", "versions": [{"version": "v1", "created": "Wed, 5 Jun 2013 17:28:56 GMT"}], "update_date": "2013-06-06", "authors_parsed": [["Palyulin", "Vladimir V.", ""], ["Chechkin", "Aleksei V.", ""], ["Metzler", "Ralf", ""]]}, {"id": "1306.1390", "submitter": "Sarbaz H. A. Khoshnaw", "authors": "Sarbaz H. A. Khoshnaw", "title": "Reduction of Mathematical Models of Nuclear Receptor Binding to Promoter\n  Regions", "comments": "23 pages, 6 figures and 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study kinetic model of Nuclear Receptor Binding to Promoter Regions. This\nmodel is written as a system of ordinary differential equations. Model\nreduction techniques have been used to simplify chemical kinetics.In this case\nstudy, the technique of Pseudo-first order approximation is applied to simplify\nthe reaction rates. CellDesigner has been used to draw the structures of\nchemical reactions of Nuclear Receptor Binding to Promoter Regions. After model\nreduction, the general analytical solution for reduced model is given and the\nnumber of species and reactions are reduced from 9 species and 6 reactions to 6\nspecies and 5 reactions.\n", "versions": [{"version": "v1", "created": "Thu, 6 Jun 2013 12:21:19 GMT"}, {"version": "v2", "created": "Sat, 10 Aug 2013 18:51:00 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Khoshnaw", "Sarbaz H. A.", ""]]}, {"id": "1306.1685", "submitter": "Roland Schwarz", "authors": "Roland F Schwarz, Anne Trinh, Botond Sipos, James D Brenton, Nick\n  Goldman and Florian Markowetz", "title": "Phylogenetic quantification of intra-tumour heterogeneity", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1003535", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Intra-tumour heterogeneity (ITH) is the result of ongoing\nevolutionary change within each cancer. The expansion of genetically distinct\nsub-clonal populations may explain the emergence of drug resistance and if so\nwould have prognostic and predictive utility. However, methods for objectively\nquantifying ITH have been missing and are particularly difficult to establish\nin cancers where predominant copy number variation prevents accurate\nphylogenetic reconstruction owing to horizontal dependencies caused by long and\ncascading genomic rearrangements.\n  Results: To address these challenges we present MEDICC, a method for\nphylogenetic reconstruction and ITH quantification based on a Minimum Event\nDistance for Intra-tumour Copynumber Comparisons. Using a transducer-based\npairwise comparison function we determine optimal phasing of major and minor\nalleles, as well as evolutionary distances between samples, and are able to\nreconstruct ancestral genomes. Rigorous simulations and an extensive clinical\nstudy show the power of our method, which outperforms state-of-the-art\ncompetitors in reconstruction accuracy and additionally allows unbiased\nnumerical quantification of ITH.\n  Conclusions: Accurate quantification and evolutionary inference are essential\nto understand the functional consequences of ITH. The MEDICC algorithms are\nindependent of the experimental techniques used and are applicable to both\nnext-generation sequencing and array CGH data.\n", "versions": [{"version": "v1", "created": "Fri, 7 Jun 2013 10:50:44 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Schwarz", "Roland F", ""], ["Trinh", "Anne", ""], ["Sipos", "Botond", ""], ["Brenton", "James D", ""], ["Goldman", "Nick", ""], ["Markowetz", "Florian", ""]]}, {"id": "1306.1850", "submitter": "Ayad Ghany Ismaeel", "authors": "Ayad Ghany Ismaeel, Anar Auda Ablahad", "title": "Enhancement of a Novel Method for Mutational Disease Prediction using\n  Bioinformatics Techniques and Backpropagation Algorithm", "comments": "5 pages, 8 figures, 1 Table, conference or other essential info", "journal-ref": "International Journal of Scientific & Engineering Research, Volume\n  4, Issue 6, June 2013 pages 1169-1173", "doi": null, "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The noval method for mutational disease prediction using bioinformatics tools\nand datasets for diagnosis the malignant mutations with powerful Artificial\nNeural Network (Backpropagation Network) for classifying these malignant\nmutations are related to gene(s) (like BRCA1 and BRCA2) cause a disease (breast\ncancer). This noval method did not take in consideration just like adopted for\ndealing, analyzing and treat the gene sequences for extracting useful\ninformation from the sequence, also exceeded the environment factors which play\nimportant roles in deciding and calculating some of genes features in order to\nview its functional parts and relations to diseases. This paper is proposed an\nenhancement of a novel method as a first way for diagnosis and prediction the\ndisease by mutations considering and introducing multi other features show the\nalternations, changes in the environment as well as genes, comparing sequences\nto gain information about the structure or function of a query sequence, also\nproposing optimal and more accurate system for classification and dealing with\nspecific disorder using backpropagation with mean square rate 0.000000001.\nIndex Terms (Homology sequence, GC content and AT content, Bioinformatics,\nBackpropagation Network, BLAST, DNA Sequence, Protein Sequence)\n", "versions": [{"version": "v1", "created": "Fri, 7 Jun 2013 21:53:25 GMT"}], "update_date": "2013-06-11", "authors_parsed": [["Ismaeel", "Ayad Ghany", ""], ["Ablahad", "Anar Auda", ""]]}, {"id": "1306.2230", "submitter": "Lucio Floretta", "authors": "Lucio Floretta, Jonas Liechti, Alessandro Flammini and Paolo De Los\n  Rios", "title": "Stochastic fluctuations and the detectability limit of network\n  communities", "comments": "5 pages, 5 figures, correction of typos, improvement of the\n  bibliography and of the notation, general compression", "journal-ref": "Phys. Rev. E 88, 060801 (2013)", "doi": "10.1103/PhysRevE.88.060801", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.SI q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have analyzed the detectability limits of network communities in the\nframework of the popular Girvan and Newman benchmark. By carefully taking into\naccount the inevitable stochastic fluctuations that affect the construction of\neach and every instance of the benchmark, we come to the conclusions that the\nnative, putative partition of the network is completely lost even before the\nin-degree/out-degree ratio becomes equal to the one of a structure-less\nErd\\\"os-R\\'enyi network. We develop a simple iterative scheme, analytically\nwell described by an infinite branching-process, to provide an estimate of the\ntrue detectability limit. Using various algorithms based on modularity\noptimization, we show that all of them behave (semi-quantitatively) in the same\nway, with the same functional form of the detectability threshold as a function\nof the network parameters. Because the same behavior has also been found by\nfurther modularity-optimization methods and for methods based on different\nheuristics implementations, we conclude that indeed a correct definition of the\ndetectability limit must take into account the stochastic fluctuations of the\nnetwork construction.\n", "versions": [{"version": "v1", "created": "Mon, 10 Jun 2013 15:29:14 GMT"}, {"version": "v2", "created": "Tue, 18 Jun 2013 16:10:31 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Floretta", "Lucio", ""], ["Liechti", "Jonas", ""], ["Flammini", "Alessandro", ""], ["Rios", "Paolo De Los", ""]]}, {"id": "1306.2435", "submitter": "Ophir Flomenbom", "authors": "Ophir Flomenbom", "title": "Solving single molecules: filtering noisy discrete data made of photons\n  and other type of observables", "comments": "25 pages, 3 figures, 2 tables, 5 pages SI. submitted 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In numerous systems in biophysics and related fields, scientists measure\n(with very smart methods) individual molecules (e.g. biopolymers (proteins,\nDNA, RNA, etc), nano - crystals, ion channels), aiming at finding a model from\nthe data. But the noise is not solved accurately in not so few cases and this\nmay lead to misleading models. Here, we solve the noise. We consider two state\nphoton trajectories from any on off kinetic scheme (KS): the process emitting\nphotons with a rate {\\gamma}on when it is in the on state, and emitting with a\nrate {\\gamma}off when it is in the off state. We develop a filter that removes\nthe noise resulting in clean data also in cases where binning fails. The filter\nis a numerical algorithm with various new statistical treatments. It is based\non a new general likelihood function developed here, with observable dependent\nform. The filter can solve the noise, in the detectable region of the rate\nspace: that is, we also find a region where the data is \"too\" noisy.\nConsistency tests will find the region's type from the data. If the data is\nruled \"too noisy\", binning obviously fails, and one should apply simpler\nmethods on the raw data and realizing that the extracted information is\npartial. We show that not applying the filter while cleaning results in\nerroneous rates. This filter (with minor adjustments) can solve the noise in\nany discrete state trajectories, yet extensions are needed in \"tackling\" the\nnoise from other data, e.g. continuous data and FRET data.\n  The filter developed here is complementary with our previous projects in this\nfield, where we have solved clean two state data with the development of\nreduced dimensions forms (RDFs): only the combined procedures enabling building\nthe most accurate model from noisy trajectories from single molecules\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2013 06:53:37 GMT"}], "update_date": "2013-06-12", "authors_parsed": [["Flomenbom", "Ophir", ""]]}, {"id": "1306.2584", "submitter": "Dimitris Anastassiou", "authors": "Wei-Yi Cheng, Tai-Hsien Ou Yang, Hui Shen, Peter W. Laird, Dimitris\n  Anastassiou and the Cancer Genome Atlas Research Network", "title": "Multi-cancer molecular signatures and their interrelationships", "comments": "[07.11.2013 v2] Additional authors and acknowledgements for people\n  who contributed to the interpretation of attractor signatures. Summarized\n  table for all 18 signatures. Comments on possible functions", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although cancer is known to be characterized by several unifying biological\nhallmarks, systems biology has had limited success in identifying molecular\nsignatures present in in all types of cancer. The current availability of rich\ndata sets from many different cancer types provides an opportunity for thorough\ncomputational data mining in search of such common patterns. Here we report the\nidentification of 18 \"pan-cancer\" molecular signatures resulting from analysis\nof data sets containing values from mRNA expression, microRNA expression, DNA\nmethylation, and protein activity, from twelve different cancer types. The\nmembership of many of these signatures points to particular biological\nmechanisms related to cancer progression, suggesting that they represent\nimportant attributes of cancer in need of being elucidated for potential\napplications in diagnostic, prognostic and therapeutic products applicable to\nmultiple cancer types.\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2013 17:07:17 GMT"}, {"version": "v2", "created": "Thu, 11 Jul 2013 23:30:29 GMT"}], "update_date": "2013-07-15", "authors_parsed": [["Cheng", "Wei-Yi", ""], ["Yang", "Tai-Hsien Ou", ""], ["Shen", "Hui", ""], ["Laird", "Peter W.", ""], ["Anastassiou", "Dimitris", ""], ["Network", "the Cancer Genome Atlas Research", ""]]}, {"id": "1306.3392", "submitter": "Yue Wang", "authors": "Li Chen, Peter L. Choyke, Niya Wang, Robert Clarke, Zaver M.\n  Bhujwalla, Elizabeth M. C. Hillman, Yue Wang", "title": "Unsupervised deconvolution of dynamic imaging reveals intratumor\n  vascular heterogeneity", "comments": "Content: main manuscript, 31 pages", "journal-ref": null, "doi": "10.1371/journal.pone.0112143", "report-no": null, "categories": "q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intratumor heterogeneity is often manifested by vascular compartments with\ndistinct pharmacokinetics that cannot be resolved directly by in vivo dynamic\nimaging. We developed tissue-specific compartment modeling (TSCM), an\nunsupervised computational method of deconvolving dynamic imaging series from\nheterogeneous tumors that can improve vascular phenotyping in many biological\ncontexts. Applying TSCM to dynamic contrast-enhanced MRI of breast cancers\nrevealed characteristic intratumor vascular heterogeneity and therapeutic\nresponses that were otherwise undetectable.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2013 13:32:07 GMT"}, {"version": "v2", "created": "Wed, 3 Sep 2014 15:35:06 GMT"}, {"version": "v3", "created": "Thu, 4 Sep 2014 18:46:29 GMT"}], "update_date": "2017-02-08", "authors_parsed": [["Chen", "Li", ""], ["Choyke", "Peter L.", ""], ["Wang", "Niya", ""], ["Clarke", "Robert", ""], ["Bhujwalla", "Zaver M.", ""], ["Hillman", "Elizabeth M. C.", ""], ["Wang", "Yue", ""]]}, {"id": "1306.3535", "submitter": "James Anderson", "authors": "Abran Steele-Feldman and James J. Anderson", "title": "Simple learning models can illuminate biased results from choice\n  titration experiments", "comments": "20 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The choice titration procedure presents a subject with a repeated choice\nbetween a standard option that always provides the same reward and an adjusting\noption for which the reward schedule is adjusted based on the subjects previous\nchoices. The procedure is designed to determine the point of indifference\nbetween the two schedules which is then used to estimate a utility equivalence\npoint between the two options. Analyzing the titration procedure as a Markov\nbirth death process, we show that a large class of reinforcement learning\nmodels invariably generates a titration bias, and that the bias varies\nnon-linearly with the reward value. We treat several titration procedures,\npresenting analytic results for some simple learning models and simulation\nresults for more complex models. These results suggest that results from\ntitration experiments are likely to be biased and that inferences based on the\ntitration experiments may need to be reconsidered.\n", "versions": [{"version": "v1", "created": "Sat, 15 Jun 2013 00:50:36 GMT"}, {"version": "v2", "created": "Sat, 22 Jun 2013 17:49:33 GMT"}], "update_date": "2013-06-25", "authors_parsed": [["Steele-Feldman", "Abran", ""], ["Anderson", "James J.", ""]]}, {"id": "1306.3825", "submitter": "Jacek Tyburczyk", "authors": "Zdzislaw Burda, Jennifer Kornelsen, Maciej A. Nowak, Bartosz Porebski,\n  Uta Sboto-Frankenstein, Boguslaw Tomanek, Jacek Tyburczyk", "title": "Collective Correlations of Brodmann Areas fMRI Study with RMT-Denoising", "comments": null, "journal-ref": null, "doi": "10.5506/APhysPolB.44.1243", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study collective behavior of Brodmann regions of human cerebral cortex\nusing functional Magnetic Resonance Imaging (fMRI) and Random Matrix Theory\n(RMT). The raw fMRI data is mapped onto the cortex regions corresponding to the\nBrodmann areas with the aid of the Talairach coordinates. Principal Component\nAnalysis (PCA) of the Pearson correlation matrix for 41 different Brodmann\nregions is carried out to determine their collective activity in the idle state\nand in the active state stimulated by tapping. The collective brain activity is\nidentified through the statistical analysis of the eigenvectors to the largest\neigenvalues of the Pearson correlation matrix. The leading eigenvectors have a\nlarge participation ratio. This indicates that several Broadmann regions\ncollectively give rise to the brain activity associated with these\neigenvectors. We apply random matrix theory to interpret the underlying\nmultivariate data.\n", "versions": [{"version": "v1", "created": "Mon, 17 Jun 2013 12:01:13 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Burda", "Zdzislaw", ""], ["Kornelsen", "Jennifer", ""], ["Nowak", "Maciej A.", ""], ["Porebski", "Bartosz", ""], ["Sboto-Frankenstein", "Uta", ""], ["Tomanek", "Boguslaw", ""], ["Tyburczyk", "Jacek", ""]]}, {"id": "1306.4374", "submitter": "Juan Carlos del Alamo", "authors": "Juan C del Alamo, Ruedi Meili, Bego\\~na Alvarez-Gonzalez, Baldomero\n  Alonso-Latorre, Effie Bastounis, Richard Firtel, Juan C Lasheras", "title": "Three-Dimensional Quantification of Cellular Traction Forces and\n  Mechanosensing of Thin Substrata by Fourier Traction Force Microscopy", "comments": null, "journal-ref": "PLoS ONE 8(9): e69850, 2013", "doi": "10.1371/journal.pone.0069850", "report-no": null, "categories": "q-bio.QM cond-mat.soft q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a novel three-dimensional (3D) traction force microscopy (TFM)\nmethod motivated by the recent discovery that cells adhering on plane surfaces\nexert both in-plane and out-of-plane traction stresses. We measure the 3D\ndeformation of the substratum on a thin layer near its surface, and input this\ninformation into an exact analytical solution of the elastic equilibrium\nequation. These operations are performed in the Fourier domain with high\ncomputational efficiency, allowing to obtain the 3D traction stresses from raw\nmicroscopy images virtually in real time. We also characterize the error of\nprevious two-dimensional (2D) TFM methods that neglect the out-of-plane\ncomponent of the traction stresses. This analysis reveals that, under certain\ncombinations of experimental parameters (\\ie cell size, substratums' thickness\nand Poisson's ratio), the accuracy of 2D TFM methods is minimally affected by\nneglecting the out-of-plane component of the traction stresses. Finally, we\nconsider the cell's mechanosensing of substratum thickness by 3D traction\nstresses, finding that, when cells adhere on thin substrata, their out-of-plane\ntraction stresses can reach four times deeper into the substratum than their\nin-plane traction stresses. It is also found that the substratum stiffness\nsensed by applying out-of-plane traction stresses may be up to 10 times larger\nthan the stiffness sensed by applying in-plane traction stresses.\n", "versions": [{"version": "v1", "created": "Tue, 18 Jun 2013 22:04:59 GMT"}], "update_date": "2013-10-07", "authors_parsed": [["del Alamo", "Juan C", ""], ["Meili", "Ruedi", ""], ["Alvarez-Gonzalez", "Begoña", ""], ["Alonso-Latorre", "Baldomero", ""], ["Bastounis", "Effie", ""], ["Firtel", "Richard", ""], ["Lasheras", "Juan C", ""]]}, {"id": "1306.4493", "submitter": "Ezio Bartocci", "authors": "Ezio Bartocci, Luca Bortolussi, and Laura Nenzi", "title": "A temporal logic approach to modular design of synthetic biological\n  circuits", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.ET q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new approach for the design of a synthetic biological circuit\nwhose behaviour is specified in terms of signal temporal logic (STL) formulae.\nWe first show how to characterise with STL formulae the input/output behaviour\nof biological modules miming the classical logical gates (AND, NOT, OR). Hence,\nwe provide the regions of the parameter space for which these specifications\nare satisfied. Given a STL specification of the target circuit to be designed\nand the networks of its constituent components, we propose a methodology to\nconstrain the behaviour of each module, then identifying the subset of the\nparameter space in which those constraints are satisfied, providing also a\nmeasure of the robustness for the target circuit design. This approach, which\nleverages recent results on the quantitative semantics of Signal Temporal\nLogic, is illustrated by synthesising a biological implementation of an\nhalf-adder.\n", "versions": [{"version": "v1", "created": "Wed, 19 Jun 2013 11:29:01 GMT"}], "update_date": "2013-06-20", "authors_parsed": [["Bartocci", "Ezio", ""], ["Bortolussi", "Luca", ""], ["Nenzi", "Laura", ""]]}, {"id": "1306.4664", "submitter": "Michael Huber", "authors": "Michael Huber", "title": "Efficient Two-Stage Group Testing Algorithms for Genetic Screening", "comments": "14 pages; to appear in \"Algorithmica\". Part of this work has been\n  presented at the ICALP 2011 Group Testing Workshop; arXiv:1106.3680", "journal-ref": null, "doi": "10.1007/s00453-013-9791-2", "report-no": null, "categories": "cs.DS math.CO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Efficient two-stage group testing algorithms that are particularly suited for\nrapid and less-expensive DNA library screening and other large scale biological\ngroup testing efforts are investigated in this paper. The main focus is on\nnovel combinatorial constructions in order to minimize the number of individual\ntests at the second stage of a two-stage disjunctive testing procedure.\nBuilding on recent work by Levenshtein (2003) and Tonchev (2008), several new\ninfinite classes of such combinatorial designs are presented.\n", "versions": [{"version": "v1", "created": "Wed, 19 Jun 2013 19:51:05 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Huber", "Michael", ""]]}, {"id": "1306.5075", "submitter": "Luc Berthouze", "authors": "Maria Botcharova, Simon F Farmer and Luc Berthouze", "title": "A maximum likelihood based technique for validating detrended\n  fluctuation analysis (ML-DFA)", "comments": "22 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Detrended Fluctuation Analysis (DFA) is widely used to assess the presence of\nlong-range temporal correlations in time series. Signals with long-range\ntemporal correlations are typically defined as having a power law decay in\ntheir autocorrelation function. The output of DFA is an exponent, which is the\nslope obtained by linear regression of a log-log fluctuation plot against\nwindow size. However, if this fluctuation plot is not linear, then the\nunderlying signal is not self-similar, and the exponent has no meaning. There\nis currently no method for assessing the linearity of a DFA fluctuation plot.\nHere we present such a technique, called ML-DFA. We scale the DFA fluctuation\nplot to construct a likelihood function for a set of alternative models\nincluding polynomial, root, exponential, logarithmic and spline functions. We\nuse this likelihood function to determine the maximum likelihood and thus to\ncalculate values of the Akaike and Bayesian information criteria, which\nidentify the best fit model when the number of parameters involved is taken\ninto account and over-fitting is penalised. This ensures that, of the models\nthat fit well, the least complicated is selected as the best fit. We apply\nML-DFA to synthetic data from FARIMA processes and sine curves with DFA\nfluctuation plots whose form has been analytically determined, and to\nexperimentally collected neurophysiological data. ML-DFA assesses whether the\nhypothesis of a linear fluctuation plot should be rejected, and thus whether\nthe exponent can be considered meaningful. We argue that ML-DFA is essential to\nobtaining trustworthy results from DFA.\n", "versions": [{"version": "v1", "created": "Fri, 21 Jun 2013 08:38:32 GMT"}], "update_date": "2013-06-24", "authors_parsed": [["Botcharova", "Maria", ""], ["Farmer", "Simon F", ""], ["Berthouze", "Luc", ""]]}, {"id": "1306.5148", "submitter": "Antonio Scialdone", "authors": "Antonio Scialdone (1), Sam T. Mugford (1), Doreen Feike, Alastair\n  Skeffington, Philippa Borrill, Alexander Graf, Alison M. Smith, Martin Howard\n  ((1) contributed equally)", "title": "Arabidopsis plants perform arithmetic division to prevent starvation at\n  night", "comments": "To be published in eLIFE", "journal-ref": null, "doi": "10.7554/elife.00669", "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Photosynthetic starch reserves that accumulate in Arabidopsis leaves during\nthe day decrease approximately linearly with time at night to support\nmetabolism and growth. We find that the rate of decrease is adjusted to\naccommodate variation in the time of onset of darkness and starch content, such\nthat reserves last almost precisely until dawn. Generation of these dynamics\ntherefore requires an arithmetic division computation between the starch\ncontent and expected time to dawn. We introduce two novel chemical kinetic\nmodels capable of implementing analog arithmetic division. Predictions from the\nmodels are successfully tested in plants perturbed by a night-time light period\nor by mutations in starch degradation pathways. Our experiments indicate which\ncomponents of the starch degradation apparatus may be important for appropriate\narithmetic division. Our results are potentially relevant for any biological\nsystem dependent on a food reserve for survival over a predictable time period.\n", "versions": [{"version": "v1", "created": "Fri, 21 Jun 2013 14:22:13 GMT"}], "update_date": "2013-06-24", "authors_parsed": [["Scialdone", "Antonio", "", "contributed equally"], ["Mugford", "Sam T.", "", "contributed equally"], ["Feike", "Doreen", ""], ["Skeffington", "Alastair", ""], ["Borrill", "Philippa", ""], ["Graf", "Alexander", ""], ["Smith", "Alison M.", ""], ["Howard", "Martin", ""]]}, {"id": "1306.5202", "submitter": "Edward Baskerville", "authors": "Edward B. Baskerville, Trevor Bedford, Robert C. Reiner, and Mercedes\n  Pascual", "title": "Nonparametric Bayesian grouping methods for spatial time-series data", "comments": "11 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.ME", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We describe an approach for identifying groups of dynamically similar\nlocations in spatial time-series data based on a simple Markov transition\nmodel. We give maximum-likelihood, empirical Bayes, and fully Bayesian\nformulations of the model, and describe exhaustive, greedy, and MCMC-based\ninference methods. The approach has been employed successfully in several\nstudies to reveal meaningful relationships between environmental patterns and\ndisease dynamics.\n", "versions": [{"version": "v1", "created": "Fri, 21 Jun 2013 17:49:27 GMT"}], "update_date": "2013-06-24", "authors_parsed": [["Baskerville", "Edward B.", ""], ["Bedford", "Trevor", ""], ["Reiner", "Robert C.", ""], ["Pascual", "Mercedes", ""]]}, {"id": "1306.6206", "submitter": "Uwe Aickelin", "authors": "Grazziela P. Figueredo, Uwe Aickelin", "title": "Investigating Immune System Aging: System Dynamics and Agent-Based\n  Modeling", "comments": "Proceedings of the International Summer Computer Simulation\n  Conference 2010, 174-181, 2010. arXiv admin note: text overlap with\n  arXiv:1306.2898", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  System dynamics and agent based simulation models can both be used to model\nand understand interactions of entities within a population. Our modeling work\npresented here is concerned with understanding the suitability of the different\ntypes of simulation for the immune system aging problems and comparing their\nresults. We are trying to answer questions such as: How fit is the immune\nsystem given a certain age? Would an immune boost be of therapeutic value, e.g.\nto improve the effectiveness of a simultaneous vaccination? Understanding the\nprocesses of immune system aging and degradation may also help in development\nof therapies that reverse some of the damages caused thus improving life\nexpectancy. Therefore as a first step our research focuses on T cells; major\ncontributors to immune system functionality. One of the main factors\ninfluencing immune system aging is the output rate of naive T cells. Of further\ninterest is the number and phenotypical variety of these cells in an\nindividual, which will be the case study focused on in this paper.\n", "versions": [{"version": "v1", "created": "Wed, 26 Jun 2013 11:32:38 GMT"}], "update_date": "2013-06-27", "authors_parsed": [["Figueredo", "Grazziela P.", ""], ["Aickelin", "Uwe", ""]]}, {"id": "1306.6313", "submitter": "Jack O'Brien", "authors": "John O'Brien and Xavier Didelot and Zamin Iqbal and LucasAmenga-Etego\n  and Bartu Ahiska and Daniel Falush", "title": "A Bayesian approach to inferring the phylogenetic structure of\n  communities from metagenomic data", "comments": "25 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metagenomics provides a powerful new tool set for investigating evolutionary\ninteractions with the environment. However, an absence of model-based\nstatistical methods means that researchers are often not able to make full use\nof this complex information. We present a Bayesian method for inferring the\nphylogenetic relationship among related organisms found within metagenomic\nsamples. Our approach exploits variation in the frequency of taxa among samples\nto simultaneously infer each lineage haplotype, the phylogenetic tree\nconnecting them, and their frequency within each sample. Applications of the\nalgorithm to simulated data show that our method can recover a substantial\nfraction of the phylogenetic structure even in the presence of strong mixing\namong samples. We provide examples of the method applied to data from green\nsulfur bacteria recovered from an Antarctic lake, plastids from mixed\nPlasmodium falciparum infections, and virulent Neisseria meningitidis samples.\n", "versions": [{"version": "v1", "created": "Wed, 26 Jun 2013 18:48:55 GMT"}], "update_date": "2013-06-27", "authors_parsed": [["O'Brien", "John", ""], ["Didelot", "Xavier", ""], ["Iqbal", "Zamin", ""], ["LucasAmenga-Etego", "", ""], ["Ahiska", "Bartu", ""], ["Falush", "Daniel", ""]]}]