[{"id": "1401.0165", "submitter": "Robin Damion", "authors": "Robin A. Damion, Aleksandra Radjenovic, Eileen Ingham, Zhongmin Jin,\n  Michael E. Ries", "title": "Orthogonal invariant sets of the diffusion tensor and the development of\n  a curvilinear set suitable for low-anisotropy tissues", "comments": "14 pages, 1 table. Published in PLoS ONE (open access) but\n  reformatted here", "journal-ref": "PLoS ONE 8(11), e78798, 2013", "doi": "10.1371/journal.pone.0078798", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a curvilinear invariant set of the diffusion tensor which may be\napplied to Diffusion Tensor Imaging measurements on tissues and porous media.\nThis new set is an alternative to the more common invariants such as fractional\nanisotropy and the diffusion mode. The alternative invariant set possesses a\ndifferent structure to the other known invariant sets; the second and third\nmembers of the curvilinear set measure the degree of orthotropy and\noblateness/prolateness, respectively. The proposed advantage of these\ninvariants is that they may work well in situations of low diffusion anisotropy\nand isotropy, as is often observed in tissues such as cartilage.\n  We also explore the other orthogonal invariant sets in terms of their\ngeometry in relation to eigenvalue space; a cylindrical set, a spherical set\n(including fractional anisotropy and the mode), and a log-Euclidean set. These\nthree sets have a common structure. The first invariant measures the magnitude\nof the diffusion, the second and third invariants capture aspects of the\nanisotropy; the magnitude of the anisotropy and the shape of the diffusion\nellipsoid (the manner in which the anisotropy is realised). We also show a\nsimple method to prove the orthogonality of the invariants within a set.\n", "versions": [{"version": "v1", "created": "Tue, 31 Dec 2013 16:00:53 GMT"}], "update_date": "2014-01-03", "authors_parsed": [["Damion", "Robin A.", ""], ["Radjenovic", "Aleksandra", ""], ["Ingham", "Eileen", ""], ["Jin", "Zhongmin", ""], ["Ries", "Michael E.", ""]]}, {"id": "1401.0567", "submitter": "Attila Egri-Nagy", "authors": "Attila Egri-Nagy, Volker Gebhardt, Mark M. Tanaka, Andrew R. Francis", "title": "Group-theoretic models of the inversion process in bacterial genomes", "comments": "19 pages, 7 figures, in Press, Journal of Mathematical Biology", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The variation in genome arrangements among bacterial taxa is largely due to\nthe process of inversion. Recent studies indicate that not all inversions are\nequally probable, suggesting, for instance, that shorter inversions are more\nfrequent than longer, and those that move the terminus of replication are less\nprobable than those that do not. Current methods for establishing the inversion\ndistance between two bacterial genomes are unable to incorporate such\ninformation. In this paper we suggest a group-theoretic framework that in\nprinciple can take these constraints into account. In particular, we show that\nby lifting the problem from circular permutations to the affine symmetric\ngroup, the inversion distance can be found in polynomial time for a model in\nwhich inversions are restricted to acting on two regions. This requires the\nproof of new results in group theory, and suggests a vein of new combinatorial\nproblems concerning permutation groups on which group theorists will be needed\nto collaborate with biologists. We apply the new method to inferring distances\nand phylogenies for published Yersinia pestis data.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jan 2014 00:15:33 GMT"}], "update_date": "2014-01-06", "authors_parsed": [["Egri-Nagy", "Attila", ""], ["Gebhardt", "Volker", ""], ["Tanaka", "Mark M.", ""], ["Francis", "Andrew R.", ""]]}, {"id": "1401.1141", "submitter": "Anthony Fodor", "authors": "Kyle E. Kreth and Anthony A. Fodor", "title": "Covariance in protein multiple sequence alignments using groups of\n  columns", "comments": "11 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Algorithms that detect covariance between pairs of columns in multiple\nsequence alignments are commonly employed to predict functionally important\nresidues and structural contacts. However, the assumption that co-variance only\noccurs between individual residues in the protein is more driven by\ncomputational convenience rather than fundamental protein architecture. Here we\ndevelop a novel algorithm that defines a covariance score across two groups of\ncolumns where each group represents a stretch of contiguous columns in the\nalignment. We define a test set that consists of secondary structure elements\n({\\alpha}-helixes and {\\beta}-strands) across more than 1,100 PFAM families.\nUsing these alignments to predict segments that are physically close in\nstructure, we show that our method substantially out-performs approaches that\naggregate the results of algorithms that operate on individual column pairs.\nOur approach demonstrates that considering units of proteins beyond pairs of\ncolumns can improve the power and utility of covariance algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2014 17:07:01 GMT"}], "update_date": "2014-01-07", "authors_parsed": [["Kreth", "Kyle E.", ""], ["Fodor", "Anthony A.", ""]]}, {"id": "1401.1165", "submitter": "Bruno Valente", "authors": "Bruno Dourado Valente, Gota Morota, Guilherme Jordao Magalhaes Rosa,\n  Daniel Gianola, Kent Weigel", "title": "The causal meaning of genomic predictors and how it affects the\n  construction and comparison of genome-enabled selection models", "comments": null, "journal-ref": null, "doi": "10.1534/genetics.114.169490", "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The additive genetic effect is arguably the most important quantity inferred\nin animal and plant breeding analyses. The term effect indicates that it\nrepresents causal information, which is different from standard statistical\nconcepts as regression coefficient and association. The process of inferring\ncausal information is also different from standard statistical learning, as the\nformer requires causal (i.e. non-statistical) assumptions and involves extra\ncomplexities. Remarkably, the task of inferring genetic effects is largely seen\nas a standard regression/prediction problem, contradicting its label. This\nwidely accepted analysis approach is by itself insufficient for causal\nlearning, suggesting that causality is not the point for selection. Given this\nincongruence, it is important to verify if genomic predictors need to represent\ncausal effects to be relevant for selection decisions, especially because\napplying regression studies to answer causal questions may lead to wrong\nconclusions. The answer to this question defines if genomic selection models\nshould be constructed aiming maximum genomic predictive ability or aiming\nidentifiability of genetic causal effects. Here, we demonstrate that selection\nrelies on a causal effect from genotype to phenotype, and that genomic\npredictors are only useful for selection if they distinguish such effect from\nother sources of association. Conversely, genomic predictors capturing\nnon-causal signals provide information that is less relevant for selection\nregardless of the resulting predictive ability. Focusing on covariate choice\ndecision, simulated examples are used to show that predictive ability, which is\nthe criterion normally used to compare models, may not indicate the quality of\ngenomic predictors for selection. Additionally, we propose using alternative\ncriteria to construct models aiming for the identification of the genetic\ncausal effects.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 21:45:05 GMT"}], "update_date": "2015-04-27", "authors_parsed": [["Valente", "Bruno Dourado", ""], ["Morota", "Gota", ""], ["Rosa", "Guilherme Jordao Magalhaes", ""], ["Gianola", "Daniel", ""], ["Weigel", "Kent", ""]]}, {"id": "1401.1168", "submitter": "Carsten Maedler", "authors": "Pritiraj Mohanty, Yu Chen, Xihua Wang, Mi K. Hong, Carol L. Rosenberg,\n  David T. Weaver, Shyamsunder Erramilli", "title": "Field Effect Transistor Nanosensor for Breast Cancer Diagnostics", "comments": null, "journal-ref": "Invited Review in Biosensors and Molecular Technologies for Cancer\n  Diagnostics, edited by K. H. Herold and A. Rasooly (CRC Press, 2012)", "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Silicon nanochannel field effect transistor (FET) biosensors are one of the\nmost promising technologies in the development of highly sensitive and\nlabel-free analyte detection for cancer diagnostics. With their exceptional\nelectrical properties and small dimensions, silicon nanochannels are ideally\nsuited for extraordinarily high sensitivity. In fact, the high\nsurface-to-volume ratios of these systems make single molecule detection\npossible. Further, FET biosensors offer the benefits of high speed, low cost,\nand high yield manufacturing, without sacrificing the sensitivity typical for\ntraditional optical methods in diagnostics. Top down manufacturing methods\nleverage advantages in Complementary Metal Oxide Semiconductor (CMOS)\ntechnologies, making richly multiplexed sensor arrays a reality. Here, we\ndiscuss the fabrication and use of silicon nanochannel FET devices as\nbiosensors for breast cancer diagnosis and monitoring.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2014 19:05:45 GMT"}], "update_date": "2014-01-07", "authors_parsed": [["Mohanty", "Pritiraj", ""], ["Chen", "Yu", ""], ["Wang", "Xihua", ""], ["Hong", "Mi K.", ""], ["Rosenberg", "Carol L.", ""], ["Weaver", "David T.", ""], ["Erramilli", "Shyamsunder", ""]]}, {"id": "1401.1640", "submitter": "B\\\"{a}rbel Finkenst\\\"{a}dt", "authors": "B\\\"arbel Finkenst\\\"adt, Dan J. Woodcock, Michal Komorowski, Claire V.\n  Harper, Julian R. E. Davis, Mike R. H. White, David A. Rand", "title": "Quantifying intrinsic and extrinsic noise in gene transcription using\n  the linear noise approximation: An application to single cell data", "comments": "Published in at http://dx.doi.org/10.1214/13-AOAS669 the Annals of\n  Applied Statistics (http://www.imstat.org/aoas/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Statistics 2013, Vol. 7, No. 4, 1960-1982", "doi": "10.1214/13-AOAS669", "report-no": "IMS-AOAS-AOAS669", "categories": "stat.AP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A central challenge in computational modeling of dynamic biological systems\nis parameter inference from experimental time course measurements. However, one\nwould not only like to infer kinetic parameters but also study their\nvariability from cell to cell. Here we focus on the case where single-cell\nfluorescent protein imaging time series data are available for a population of\ncells. Based on van Kampen's linear noise approximation, we derive a dynamic\nstate space model for molecular populations which is then extended to a\nhierarchical model. This model has potential to address the sources of\nvariability relevant to single-cell data, namely, intrinsic noise due to the\nstochastic nature of the birth and death processes involved in reactions and\nextrinsic noise arising from the cell-to-cell variation of kinetic parameters.\nIn order to infer such a model from experimental data, one must also quantify\nthe measurement process where one has to allow for nonmeasurable molecular\nspecies as well as measurement noise of unknown level and variance. The\navailability of multiple single-cell time series data here provides a unique\ntestbed to fit such a model and quantify these different sources of variation\nfrom experimental data.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 10:06:25 GMT"}], "update_date": "2014-01-09", "authors_parsed": [["Finkenstädt", "Bärbel", ""], ["Woodcock", "Dan J.", ""], ["Komorowski", "Michal", ""], ["Harper", "Claire V.", ""], ["Davis", "Julian R. E.", ""], ["White", "Mike R. H.", ""], ["Rand", "David A.", ""]]}, {"id": "1401.1798", "submitter": "Juli\\'an Candia", "authors": "Juli\\'an Candia, Srujana Cherukuri, Yin Guo, Kshama A. Doshi, Jayanth\n  R. Banavar, Curt I. Civin, Wolfgang Losert", "title": "Uncovering low-dimensional, miR-based signatures of acute myeloid and\n  lymphoblastic leukemias with a machine-learning-driven network approach", "comments": "34 pages, 12 figures (contains Supporting Information). To appear in\n  Convergent Science Physical Oncology", "journal-ref": "Converg. Sci. Phys. Oncol. 1 (2015) 025002", "doi": "10.1088/2057-1739/1/2/025002", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Complex phenotypic differences among different acute leukemias cannot be\nfully captured by analyzing the expression levels of one single molecule, such\nas a miR, at a time, but requires systematic analysis of large sets of miRs.\nWhile a popular approach for analysis of such datasets is principal component\nanalysis (PCA), this method is not designed to optimally discriminate different\nphenotypes. Moreover, PCA and other low-dimensional representation methods\nyield linear or non-linear combinations of all measured miRs. Global human miR\nexpression was measured in AML, B-ALL, and T-ALL cell lines and patient RNA\nsamples. By systematically applying support vector machines to all measured\nmiRs taken in dyad and triad groups, we built miR networks using cell line data\nand validated our findings with primary patient samples. All the coordinately\ntranscribed members of the miR-23a cluster (which includes also miR-24 and\nmiR-27a), known to function as tumor suppressors of acute leukemias, appeared\nin the AML, B-ALL and T-ALL centric networks. Subsequent qRT-PCR analysis\nshowed that the most connected miR in the B-ALL-centric network, miR-708, is\nhighly and specifically expressed in B-ALLs, suggesting that miR-708 might\nserve as a biomarker for B-ALL. This approach is systematic, quantitative,\nscalable, and unbiased. Rather than a single signature, our approach yields a\nnetwork of signatures reflecting the redundant nature of biological signaling\npathways. The network representation allows for visual analysis of all\nsignatures by an expert and for future integration of additional information.\nFurthermore, each signature involves only small sets of miRs, such as dyads and\ntriads, which are well suited for in depth validation through laboratory\nexperiments such as loss- and gain-of-function assays designed to drive changes\nin leukemia cell survival, proliferation and differentiation.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 20:07:43 GMT"}, {"version": "v2", "created": "Fri, 22 Aug 2014 03:44:35 GMT"}, {"version": "v3", "created": "Sat, 21 Nov 2015 00:21:27 GMT"}], "update_date": "2015-12-23", "authors_parsed": [["Candia", "Julián", ""], ["Cherukuri", "Srujana", ""], ["Guo", "Yin", ""], ["Doshi", "Kshama A.", ""], ["Banavar", "Jayanth R.", ""], ["Civin", "Curt I.", ""], ["Losert", "Wolfgang", ""]]}, {"id": "1401.2397", "submitter": "Alicia Mart\\'inez-Gonz\\'alez", "authors": "Alicia Mart\\'inez-Gonz\\'alez, Mario Dur\\'an-Prado, Gabriel F. Calvo,\n  Francisco J. Alca\\'in, Luis A. P\\'erez-Romasanta and V\\'ictor M.\n  P\\'erez-Garc\\'ia", "title": "Combined therapies of antithrombotics and antioxidants delay in silico\n  brain tumor progression", "comments": "8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Glioblastoma multiforme, the most frequent type of primary brain tumor, is a\nrapidly evolving and spatially heterogeneous high-grade astrocytoma that\npresents areas of necrosis, hypercellularity and microvascular hyperplasia. The\naberrant vasculature leads to hypoxic areas and results in an increase of the\noxidative stress selecting for more invasive tumor cell phenotypes. In our\nstudy we assay in silico different therapeutic approaches which combine\nantithrombotics, antioxidants and standard radiotherapy. To do so, we have\ndeveloped a biocomputational model of glioblastoma multiforme that incorporates\nthe spatio-temporal interplay among two glioma cell phenotypes corresponding to\noxygenated and hypoxic cells, a necrotic core and the local vasculature whose\nresponse evolves with tumor progression. Our numerical simulations predict that\nsuitable combinations of antithrombotics and antioxidants may diminish, in a\nsynergetic way, oxidative stress and the subsequent hypoxic response. This\nnovel therapeutical strategy, with potentially low or no toxicity, might reduce\ntumor invasion and further sensitize glioblastoma multiforme to conventional\nradiotherapy or other cytotoxic agents, hopefully increasing median patient\noverall survival time.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 16:41:03 GMT"}], "update_date": "2014-01-13", "authors_parsed": [["Martínez-González", "Alicia", ""], ["Durán-Prado", "Mario", ""], ["Calvo", "Gabriel F.", ""], ["Alcaín", "Francisco J.", ""], ["Pérez-Romasanta", "Luis A.", ""], ["Pérez-García", "Víctor M.", ""]]}, {"id": "1401.2465", "submitter": "Victor M. Perez-Garcia", "authors": "Juan Belmonte-Beitia, Gabriel F. Calvo, Victor M. Perez-Garcia", "title": "Effective Particle Methods for Fisher-Kolmogorov Equations: Theory and\n  Applications to Brain Tumor Dynamics", "comments": null, "journal-ref": null, "doi": "10.1016/j.cnsns.2014.02.004", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extended systems governed by partial differential equations can, under\nsuitable conditions, be approximated by means of sets of ordinary differential\nequations for global quantities capturing the essential features of the systems\ndynamics. Here we obtain a small number of effective equations describing the\ndynamics of single-front and localized solutions of Fisher-Kolmogorov type\nequations. These solutions are parametrized by means of a minimal set of\ntime-dependent quantities for which ordinary differential equations ruling\ntheir dynamics are found. A comparison of the finite dimensional equations and\nthe dynamics of the full partial differential equation is made showing a very\ngood quantitative agreement with the dynamics of the partial differential\nequation. We also discuss some implications of our findings for the\nunderstanding of the growth progression of certain types of primary brain\ntumors and discuss possible extensions of our results to related equations\narising in different modelling scenarios.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 21:04:36 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Belmonte-Beitia", "Juan", ""], ["Calvo", "Gabriel F.", ""], ["Perez-Garcia", "Victor M.", ""]]}, {"id": "1401.2603", "submitter": "Victor M. Perez-Garcia", "authors": "Victor M. Perez-Garcia, Magdalena Bogdanska, Alicia Martinez-Gonzalez,\n  Juan Belmonte-Beitia, Philippe Schucht and Luis Perez-Romasanta", "title": "Delay effects in the response of low grade gliomas to radiotherapy: A\n  mathematical model and its therapeutical implications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Low grade gliomas (LGGs) are a group of primary brain tumors usually\nencountered in young patient populations. These tumors represent a difficult\nchallenge because many patients survive a decade or more and may be at a higher\nrisk for treatment-related complications. Specifically, radiation therapy is\nknown to have a relevant effect on survival but in many cases it can be\ndeferred to avoid side effects while maintaining its beneficial effect.\nHowever, a subset of low-grade gliomas manifests more aggressive clinical\nbehavior and requires earlier intervention. Moreover, the effectiveness of\nradiotherapy depends on the tumor characteristics. Recently Pallud et al.,\n[Neuro-oncology, 14(4):1-10, 2012], studied patients with LGGs treated with\nradiation therapy as a first line therapy. and found the counterintuitive\nresult that tumors with a fast response to the therapy had a worse prognosis\nthan those responding late. In this paper we construct a mathematical model\ndescribing the basic facts of glioma progression and response to radiotherapy.\nThe model provides also an explanation to the observations of Pallud et al.\nUsing the model we propose radiation fractionation schemes that might be\ntherapeutically useful by helping to evaluate the tumor malignancy while at the\nsame time reducing the toxicity associated to the treatment.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2014 10:23:02 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Perez-Garcia", "Victor M.", ""], ["Bogdanska", "Magdalena", ""], ["Martinez-Gonzalez", "Alicia", ""], ["Belmonte-Beitia", "Juan", ""], ["Schucht", "Philippe", ""], ["Perez-Romasanta", "Luis", ""]]}, {"id": "1401.2668", "submitter": "Jinbo Xu", "authors": "Jianzhu Ma, Sheng Wang, Zhiyong Wang and Jinbo Xu", "title": "MRFalign: Protein Homology Detection through Alignment of Markov Random\n  Fields", "comments": "Accepted by both RECOMB 2014 and PLOS Computational Biology", "journal-ref": null, "doi": "10.1371/journal.pcbi.1003500", "report-no": null, "categories": "q-bio.QM cs.CE cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sequence-based protein homology detection has been extensively studied and so\nfar the most sensitive method is based upon comparison of protein sequence\nprofiles, which are derived from multiple sequence alignment (MSA) of sequence\nhomologs in a protein family. A sequence profile is usually represented as a\nposition-specific scoring matrix (PSSM) or an HMM (Hidden Markov Model) and\naccordingly PSSM-PSSM or HMM-HMM comparison is used for homolog detection. This\npaper presents a new homology detection method MRFalign, consisting of three\nkey components: 1) a Markov Random Fields (MRF) representation of a protein\nfamily; 2) a scoring function measuring similarity of two MRFs; and 3) an\nefficient ADMM (Alternating Direction Method of Multipliers) algorithm aligning\ntwo MRFs. Compared to HMM that can only model very short-range residue\ncorrelation, MRFs can model long-range residue interaction pattern and thus,\nencode information for the global 3D structure of a protein family.\nConsequently, MRF-MRF comparison for remote homology detection shall be much\nmore sensitive than HMM-HMM or PSSM-PSSM comparison. Experiments confirm that\nMRFalign outperforms several popular HMM or PSSM-based methods in terms of both\nalignment accuracy and remote homology detection and that MRFalign works\nparticularly well for mainly beta proteins. For example, tested on the\nbenchmark SCOP40 (8353 proteins) for homology detection, PSSM-PSSM and HMM-HMM\nsucceed on 48% and 52% of proteins, respectively, at superfamily level, and on\n15% and 27% of proteins, respectively, at fold level. In contrast, MRFalign\nsucceeds on 57.3% and 42.5% of proteins at superfamily and fold level,\nrespectively. This study implies that long-range residue interaction patterns\nare very helpful for sequence-based homology detection. The software is\navailable for download at http://raptorx.uchicago.edu/download/.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2014 20:41:08 GMT"}, {"version": "v2", "created": "Wed, 15 Jan 2014 01:55:17 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Ma", "Jianzhu", ""], ["Wang", "Sheng", ""], ["Wang", "Zhiyong", ""], ["Xu", "Jinbo", ""]]}, {"id": "1401.2682", "submitter": "Chinmaya Gupta", "authors": "Chinmaya Gupta, Jos\\'e Manuel L\\'opez, Robert Azencott, Matthew R\n  Bennett, Kre\\v{s}imir Josi\\'c and William Ott", "title": "Modeling delay in genetic networks: From delay birth-death processes to\n  delay stochastic differential equations", "comments": null, "journal-ref": null, "doi": "10.1063/1.4878662", "report-no": null, "categories": "q-bio.MN math-ph math.MP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Delay is an important and ubiquitous aspect of many biochemical processes.\nFor example, delay plays a central role in the dynamics of genetic regulatory\nnetworks as it stems from the sequential assembly of first mRNA and then\nprotein. Genetic regulatory networks are therefore frequently modeled as\nstochastic birth-death processes with delay. Here we examine the relationship\nbetween delay birth-death processes and their appropriate approximating delay\nchemical Langevin equations. We prove that the distance between these two\ndescriptions, as measured by expectations of functionals of the processes,\nconverges to zero with increasing system size. Further, we prove that the delay\nbirth-death process converges to the thermodynamic limit as system size tends\nto infinity. Our results hold for both fixed delay and distributed delay.\nSimulations demonstrate that the delay chemical Langevin approximation is\naccurate even at moderate system sizes. It captures dynamical features such as\nthe spatial and temporal distributions of transition pathways in metastable\nsystems, oscillatory behavior in negative feedback circuits, and\ncross-correlations between nodes in a network. Overall, these results provide a\nfoundation for using delay stochastic differential equations to approximate the\ndynamics of birth-death processes with delay.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2014 23:42:44 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Gupta", "Chinmaya", ""], ["López", "José Manuel", ""], ["Azencott", "Robert", ""], ["Bennett", "Matthew R", ""], ["Josić", "Krešimir", ""], ["Ott", "William", ""]]}, {"id": "1401.2838", "submitter": "Edward Meeds", "authors": "Edward Meeds and Max Welling", "title": "GPS-ABC: Gaussian Process Surrogate Approximate Bayesian Computation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scientists often express their understanding of the world through a\ncomputationally demanding simulation program. Analyzing the posterior\ndistribution of the parameters given observations (the inverse problem) can be\nextremely challenging. The Approximate Bayesian Computation (ABC) framework is\nthe standard statistical tool to handle these likelihood free problems, but\nthey require a very large number of simulations. In this work we develop two\nnew ABC sampling algorithms that significantly reduce the number of simulations\nnecessary for posterior inference. Both algorithms use confidence estimates for\nthe accept probability in the Metropolis Hastings step to adaptively choose the\nnumber of necessary simulations. Our GPS-ABC algorithm stores the information\nobtained from every simulation in a Gaussian process which acts as a surrogate\nfunction for the simulated statistics. Experiments on a challenging realistic\nbiological problem illustrate the potential of these algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2014 14:02:37 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Meeds", "Edward", ""], ["Welling", "Max", ""]]}, {"id": "1401.3290", "submitter": "Brett T. McClintock", "authors": "Brett T. McClintock, Larissa L. Bailey, Brian P. Dreher, William A.\n  Link", "title": "Probit models for capture-recapture data subject to imperfect detection,\n  individual heterogeneity and misidentification", "comments": "Published in at http://dx.doi.org/10.1214/14-AOAS783 the Annals of\n  Applied Statistics (http://www.imstat.org/aoas/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Statistics 2014, Vol. 8, No. 4, 2461-2484", "doi": "10.1214/14-AOAS783", "report-no": "IMS-AOAS-AOAS783", "categories": "q-bio.QM q-bio.PE stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As noninvasive sampling techniques for animal populations have become more\npopular, there has been increasing interest in the development of\ncapture-recapture models that can accommodate both imperfect detection and\nmisidentification of individuals (e.g., due to genotyping error). However,\ncurrent methods do not allow for individual variation in parameters, such as\ndetection or survival probability. Here we develop misidentification models for\ncapture-recapture data that can simultaneously account for temporal variation,\nbehavioral effects and individual heterogeneity in parameters. To facilitate\nBayesian inference using our approach, we extend standard probit regression\ntechniques to latent multinomial models where the dimension and zeros of the\nresponse cannot be observed. We also present a novel Metropolis-Hastings within\nGibbs algorithm for fitting these models using Markov chain Monte Carlo. Using\nclosed population abundance models for illustration, we re-visit a DNA\ncapture-recapture population study of black bears in Michigan, USA and find\nevidence of misidentification due to genotyping error, as well as temporal,\nbehavioral and individual variation in detection probability. We also estimate\na salamander population of known size from laboratory experiments evaluating\nthe effectiveness of a marking technique commonly used for amphibians and fish.\nOur model was able to reliably estimate the size of this population and\nprovided evidence of individual heterogeneity in misidentification probability\nthat is attributable to variable mark quality. Our approach is more\ncomputationally demanding than previously proposed methods, but it provides the\nflexibility necessary for a much broader suite of models to be explored while\nproperly accounting for uncertainty introduced by misidentification and\nimperfect detection. In the absence of misidentification, our probit\nformulation also provides a convenient and efficient Gibbs sampler for Bayesian\nanalysis of traditional closed population capture-recapture data.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2014 19:14:31 GMT"}, {"version": "v2", "created": "Mon, 11 Aug 2014 18:44:53 GMT"}, {"version": "v3", "created": "Thu, 2 Oct 2014 20:59:51 GMT"}, {"version": "v4", "created": "Tue, 3 Feb 2015 12:47:54 GMT"}], "update_date": "2015-02-04", "authors_parsed": [["McClintock", "Brett T.", ""], ["Bailey", "Larissa L.", ""], ["Dreher", "Brian P.", ""], ["Link", "William A.", ""]]}, {"id": "1401.3531", "submitter": "Ben Fulcher", "authors": "Ben D. Fulcher and Nick S. Jones", "title": "Highly comparative feature-based time-series classification", "comments": null, "journal-ref": "IEEE Trans. Knowl. Data Eng. 26, 3026 (2014)", "doi": "10.1109/TKDE.2014.2316504", "report-no": null, "categories": "cs.LG cs.AI cs.DB physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A highly comparative, feature-based approach to time series classification is\nintroduced that uses an extensive database of algorithms to extract thousands\nof interpretable features from time series. These features are derived from\nacross the scientific time-series analysis literature, and include summaries of\ntime series in terms of their correlation structure, distribution, entropy,\nstationarity, scaling properties, and fits to a range of time-series models.\nAfter computing thousands of features for each time series in a training set,\nthose that are most informative of the class structure are selected using\ngreedy forward feature selection with a linear classifier. The resulting\nfeature-based classifiers automatically learn the differences between classes\nusing a reduced number of time-series properties, and circumvent the need to\ncalculate distances between time series. Representing time series in this way\nresults in orders of magnitude of dimensionality reduction, allowing the method\nto perform well on very large datasets containing long time series or time\nseries of different lengths. For many of the datasets studied, classification\nperformance exceeded that of conventional instance-based classifiers, including\none nearest neighbor classifiers using Euclidean distances and dynamic time\nwarping and, most importantly, the features selected provide an understanding\nof the properties of the dataset, insight that can guide further scientific\ninvestigation.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 09:41:50 GMT"}, {"version": "v2", "created": "Fri, 9 May 2014 00:05:57 GMT"}], "update_date": "2017-11-10", "authors_parsed": [["Fulcher", "Ben D.", ""], ["Jones", "Nick S.", ""]]}, {"id": "1401.3604", "submitter": "Hector Zenil", "authors": "Hector Zenil, Narsis A. Kiani, Jesper Tegn\\'er", "title": "Methods of Information Theory and Algorithmic Complexity for Network\n  Biology", "comments": "28 pages. Forthcoming in the journal Seminars in Cell and\n  Developmental Biology", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey and introduce concepts and tools located at the intersection of\ninformation theory and network biology. We show that Shannon's information\nentropy, compressibility and algorithmic complexity quantify different local\nand global aspects of synthetic and biological data. We show examples such as\nthe emergence of giant components in Erdos-Renyi random graphs, and the\nrecovery of topological properties from numerical kinetic properties simulating\ngene expression data. We provide exact theoretical calculations, numerical\napproximations and error estimations of entropy, algorithmic probability and\nKolmogorov complexity for different types of graphs, characterizing their\nvariant and invariant properties. We introduce formal definitions of complexity\nfor both labeled and unlabeled graphs and prove that the Kolmogorov complexity\nof a labeled graph is a good approximation of its unlabeled Kolmogorov\ncomplexity and thus a robust definition of graph complexity.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 14:34:00 GMT"}, {"version": "v2", "created": "Wed, 5 Feb 2014 17:36:26 GMT"}, {"version": "v3", "created": "Wed, 15 Oct 2014 10:17:00 GMT"}, {"version": "v4", "created": "Sat, 6 Dec 2014 21:51:24 GMT"}, {"version": "v5", "created": "Wed, 18 Feb 2015 15:30:35 GMT"}, {"version": "v6", "created": "Thu, 3 Dec 2015 14:17:19 GMT"}, {"version": "v7", "created": "Fri, 11 Dec 2015 11:34:23 GMT"}], "update_date": "2015-12-14", "authors_parsed": [["Zenil", "Hector", ""], ["Kiani", "Narsis A.", ""], ["Tegnér", "Jesper", ""]]}, {"id": "1401.3624", "submitter": "Olusola Kolebaje Mr", "authors": "Olusola Kolebaje, Emmanuel Oyewande and Babatunde Majolagbe", "title": "Numerical Solution of the Model for HIV Infection of Cd4+T Cells by\n  Using Multistage Differential Transform Method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Multistage Differential Transform Method (MDTM) is employed to solve the\nmodel for HIV infection of CD4+T cells. Comparing the numerical results to\nthose obtained by the classical fourth order Runge-Kutta method showed the\npreciseness and efficacy of the multistep differential transform method. The\nstudy shows that the method is a powerful and promising tool for solving\ncoupled systems of differential equations.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 00:17:16 GMT"}], "update_date": "2014-01-16", "authors_parsed": [["Kolebaje", "Olusola", ""], ["Oyewande", "Emmanuel", ""], ["Majolagbe", "Babatunde", ""]]}, {"id": "1401.4026", "submitter": "Christoph Zechner", "authors": "Christoph Zechner, Federico Wadehn, Heinz Koeppl", "title": "Sparse Learning of Markovian Population Models in Random Environments", "comments": "6 pages, 5 figures, under review", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Markovian population models are suitable abstractions to describe well-mixed\ninteracting particle systems in situation where stochastic fluctuations are\nsignificant due to the involvement of low copy particles. In molecular biology,\nmeasurements on the single-cell level attest to this stochasticity and one is\ntempted to interpret such measurements across an isogenic cell population as\ndifferent sample paths of one and the same Markov model. Over recent years\nevidence built up against this interpretation due to the presence of\ncell-to-cell variability stemming from factors other than intrinsic\nfluctuations. To account for this extrinsic variability, Markovian models in\nrandom environments need to be considered and a key emerging question is how to\nperform inference for such models. We model extrinsic variability by a random\nparametrization of all propensity functions. To detect which of those\npropensities have significant variability, we lay out a sparse learning\nprocedure captured by a hierarchical Bayesian model whose evidence function is\niteratively maximized using a variational Bayesian expectation-maximization\nalgorithm.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 13:48:07 GMT"}], "update_date": "2014-01-17", "authors_parsed": [["Zechner", "Christoph", ""], ["Wadehn", "Federico", ""], ["Koeppl", "Heinz", ""]]}, {"id": "1401.4289", "submitter": "Ralph Brinks", "authors": "Ralph Brinks", "title": "Incidence, recovery and prevalence of infectious diseases:\n  non-parametric disease model and application to influenza in Germany", "comments": "14 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we describe a non-parametric disease model that links the\ntemporal change of the prevalence of an infectious disease to the incidence and\nthe recovery rates. The model is only based on the common epidemiological\nmeasures incidence and recovery rate. As an application, the model is used to\ncalculate the prevalence of influenza in Germany for a hypothetical birth\ncohort during 2001 and 2013.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jan 2014 10:02:26 GMT"}], "update_date": "2014-01-20", "authors_parsed": [["Brinks", "Ralph", ""]]}, {"id": "1401.4417", "submitter": "Andrew Hone N.W.", "authors": "Andrew Hone and Kim Towler", "title": "Non-standard discretization of biological models", "comments": "17 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider certain types of discretization schemes for differential\nequations with quadratic nonlinearities, which were introduced by Kahan, and\nconsidered in a broader setting by Mickens. These methods have the property\nthat they preserve important structural features of the original systems, such\nas the behaviour of solutions near to fixed points, and also, where appropriate\n(e.g. for certain mechanical systems), the property of being volume-preserving,\nor preserving a symplectic/Poisson structure. Here we focus on the application\nof Kahan's method to models of biological systems, in particular to reaction\nkinetics governed by the Law of Mass Action, and present a general approach to\nbirational discretization, which is applied to population dynamics of\nLotka-Volterra type.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jan 2014 17:53:37 GMT"}], "update_date": "2014-01-20", "authors_parsed": [["Hone", "Andrew", ""], ["Towler", "Kim", ""]]}, {"id": "1401.4561", "submitter": "Krystyna Lukierska-Walasek", "authors": "K. Lukierska-Walasek, K. Topolski, K.Trojanowski", "title": "Hyperbolic statistics and entropy loss in the description of gene\n  distributions", "comments": "3 pages, 3 figures, improved presentation of figures and conclusions\n  somewhat changed", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Zipf's law implies the statistical distributions of hyperbolic type, which\ncan describe the properties of stability and entropy loss in linguistics. We\npresent the information theory from which follows that if the system is\ndescribed by distributions of hyperbolic type it leads to the possibility of\nentropy loss. We present the number of repetitions of genes in tne genomes for\nsome bacteria, as Borelia burgdorferi and Escherichia coli.\n  Distributions of repetitions of genes in genome appears to be represented by\ndistributions of hyperbolic type.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jan 2014 16:40:49 GMT"}, {"version": "v2", "created": "Fri, 28 Mar 2014 14:46:54 GMT"}], "update_date": "2014-03-31", "authors_parsed": [["Lukierska-Walasek", "K.", ""], ["Topolski", "K.", ""], ["Trojanowski", "K.", ""]]}, {"id": "1401.4832", "submitter": "Magnus Ekeberg", "authors": "Magnus Ekeberg, Tuomo Hartonen, Erik Aurell", "title": "Fast pseudolikelihood maximization for direct-coupling analysis of\n  protein structure from many homologous amino-acid sequences", "comments": "33 pages, 4 figures; M. Ekeberg and T. Hartonen are joint first\n  authors; code and supplementary information on http://plmdca.csc.kth.se/", "journal-ref": "Journal of Computational Physics 276 (2014) 341-356", "doi": "10.1016/j.jcp.2014.07.024", "report-no": null, "categories": "q-bio.QM physics.comp-ph physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Direct-Coupling Analysis is a group of methods to harvest information about\ncoevolving residues in a protein family by learning a generative model in an\nexponential family from data. In protein families of realistic size, this\nlearning can only be done approximately, and there is a trade-off between\ninference precision and computational speed. We here show that an earlier\nintroduced $l_2$-regularized pseudolikelihood maximization method called plmDCA\ncan be modified as to be easily parallelizable, as well as inherently faster on\na single processor, at negligible difference in accuracy. We test the new\nincarnation of the method on 148 protein families from the Protein Families\ndatabase (PFAM), one of the largest tests of this class of algorithms to date.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 09:15:01 GMT"}], "update_date": "2014-09-16", "authors_parsed": [["Ekeberg", "Magnus", ""], ["Hartonen", "Tuomo", ""], ["Aurell", "Erik", ""]]}, {"id": "1401.4913", "submitter": "Krishanu Deyasi", "authors": "Krishanu Deyasi, Shashankaditya Upadhyay, Anirban Banerjee", "title": "Communication on structure of biological networks", "comments": null, "journal-ref": "Pramana, Volume 86, Issue 3 , pp 617-635 (2016)", "doi": "10.1007/s12043-015-1035-3", "report-no": null, "categories": "q-bio.QM physics.soc-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Networks are widely used to represent interaction pattern among the\ncomponents in complex systems. Structures of real networks from differ- ent\ndomains may vary quite significantly. Since there is an interplay be- tween\nnetwork architecture and dynamics, structure plays an important role in\ncommunication and information spreading on a network. Here we investigate the\nunderlying undirected topology of different biological networks which support\nfaster spreading of information and are better in communication. We analyze the\ngood expansion property by using the spectral gap and communicability between\nnodes. Different epidemic models are also used to study the transmission of\ninformation in terms of disease spreading through individuals (nodes) in those\nnetworks. More- over, we explore the structural conformation and properties\nwhich may be responsible for better communication. Among all biological\nnetworks studied here, the undirected structure of neuronal networks not only\npos- sesses the small-world property but the same is expressed remarkably to a\nhigher degree than any randomly generated network which possesses the same\ndegree sequence. A relatively high percentage of nodes, in neuronal networks,\nform a higher core in their structure. Our study shows that the underlying\nundirected topology in neuronal networks is significantly qualitatively\ndifferent than the same from other biological networks and that they may have\nevolved in such a way that they inherit a (undirected) structure which is\nexcellent and robust in communication.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 14:19:44 GMT"}, {"version": "v2", "created": "Sun, 28 Dec 2014 09:21:38 GMT"}], "update_date": "2016-05-10", "authors_parsed": [["Deyasi", "Krishanu", ""], ["Upadhyay", "Shashankaditya", ""], ["Banerjee", "Anirban", ""]]}, {"id": "1401.4929", "submitter": "Andreas Milias-Argeitis", "authors": "Andreas Milias-Argeitis, John Lygeros, Mustafa Khammash", "title": "Variance reduction for steady-state simulation and sensitivity analysis\n  of stochastic chemical systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of estimating steady-state quantities associated to\nsystems of stochastic chemical kinetics. In most cases of interest these\nsystems are analytically intractable, and one has to resort to computational\nmethods to estimate stationary values of cost functions. In this work we\nconsider a previously introduced variance reduction method and present an\nalgorithm for its application in the context of stochastic chemical kinetics.\nUsing two numerical examples, we test the efficiency of the method for the\ncalculation of steady-state parametric sensitivities and evaluate its\nperformance in comparison to other estimation methods.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 14:58:49 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Milias-Argeitis", "Andreas", ""], ["Lygeros", "John", ""], ["Khammash", "Mustafa", ""]]}, {"id": "1401.5035", "submitter": "Quentin Grimonprez", "authors": "Quentin Grimonprez (INRIA Lille - Nord Europe), Alain Celisse (INRIA\n  Lille - Nord Europe), Meyling Cheok, Martin Figeac, Guillemette Marot (INRIA\n  Lille - Nord Europe, CERIM)", "title": "MPAgenomics : An R package for multi-patients analysis of genomic\n  markers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MPAgenomics, standing for multi-patients analysis (MPA) of genomic markers,\nis an R-package devoted to: (i) efficient segmentation, and (ii) genomic marker\nselection from multi-patient copy number and SNP data profiles. It provides\nwrappers from commonly used packages to facilitate their repeated (sometimes\ndifficult) use, offering an easy-to-use pipeline for beginners in R. The\nsegmentation of successive multiple profiles (finding losses and gains) is\nbased on a new automatic choice of influential parameters since default ones\nwere misleading in the original packages. Considering multiple profiles in the\nsame time, MPAgenomics wraps efficient penalized regression methods to select\nrelevant markers associated with a given response.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 19:58:38 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Grimonprez", "Quentin", "", "INRIA Lille - Nord Europe"], ["Celisse", "Alain", "", "INRIA\n  Lille - Nord Europe"], ["Cheok", "Meyling", "", "INRIA\n  Lille - Nord Europe, CERIM"], ["Figeac", "Martin", "", "INRIA\n  Lille - Nord Europe, CERIM"], ["Marot", "Guillemette", "", "INRIA\n  Lille - Nord Europe, CERIM"]]}, {"id": "1401.5130", "submitter": "Aaron Darling", "authors": "David Coil and Guillaume Jospin and Aaron E. Darling", "title": "A5-miseq: an updated pipeline to assemble microbial genomes from\n  Illumina MiSeq data", "comments": "This is a revision of a manuscript submitted to Bioinformatics as an\n  application note", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Open-source bacterial genome assembly remains inaccessible to\nmany biologists due to its complexity. Few software solutions exist that are\ncapable of automating all steps in the process of de novo genome assembly from\nIllumina data.\n  Results: A5-miseq can produce high quality microbial genome assemblies from\nas little as 20-fold sequence data coverage on a laptop computer without any\nparameter tuning. A5-miseq does this by automating the process of adapter\ntrimming, quality filtering, error correction, contig and scaffold generation,\nand detection of misassemblies. Unlike the original A5 pipeline, A5-miseq can\nuse long reads from the Illumina MiSeq, use read pairing information during\ncontig generation, and includes several improvements to read trimming. Together\nthese changes result in substantially improved assemblies that recover a more\ncomplete set of reference genes than previous methods.\n  Availability: A5-miseq is licensed under the GPL open source license. Source\ncode and precompiled binaries for Mac OS X 10.6+ and Linux 2.6.15+ are\navailable from http://sourceforge.net/projects/ngopt\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2014 00:34:24 GMT"}, {"version": "v2", "created": "Wed, 4 Jun 2014 12:21:24 GMT"}], "update_date": "2014-06-05", "authors_parsed": [["Coil", "David", ""], ["Jospin", "Guillaume", ""], ["Darling", "Aaron E.", ""]]}, {"id": "1401.5383", "submitter": "Rayan Chikhi", "authors": "Rayan Chikhi, Antoine Limasset, Shaun Jackman, Jared Simpson and Paul\n  Medvedev", "title": "On the representation of de Bruijn graphs", "comments": "Journal version (JCB). A preliminary version of this article was\n  published in the proceedings of RECOMB 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.DS q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The de Bruijn graph plays an important role in bioinformatics, especially in\nthe context of de novo assembly. However, the representation of the de Bruijn\ngraph in memory is a computational bottleneck for many assemblers. Recent\npapers proposed a navigational data structure approach in order to improve\nmemory usage. We prove several theoretical space lower bounds to show the\nlimitation of these types of approaches. We further design and implement a\ngeneral data structure (DBGFM) and demonstrate its use on a human whole-genome\ndataset, achieving space usage of 1.5 GB and a 46% improvement over previous\napproaches. As part of DBGFM, we develop the notion of frequency-based\nminimizers and show how it can be used to enumerate all maximal simple paths of\nthe de Bruijn graph using only 43 MB of memory. Finally, we demonstrate that\nour approach can be integrated into an existing assembler by modifying the\nABySS software to use DBGFM.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2014 16:55:02 GMT"}, {"version": "v2", "created": "Wed, 22 Jan 2014 16:53:37 GMT"}, {"version": "v3", "created": "Fri, 14 Feb 2014 22:55:09 GMT"}, {"version": "v4", "created": "Mon, 6 Oct 2014 12:39:56 GMT"}], "update_date": "2014-10-07", "authors_parsed": [["Chikhi", "Rayan", ""], ["Limasset", "Antoine", ""], ["Jackman", "Shaun", ""], ["Simpson", "Jared", ""], ["Medvedev", "Paul", ""]]}, {"id": "1401.5823", "submitter": "Samuel Gross", "authors": "Samuel M. Gross, Robert Tibshirani", "title": "Collaborative Regression", "comments": "13 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the scenario where one observes an outcome variable and sets of\nfeatures from multiple assays, all measured on the same set of samples. One\napproach that has been proposed for dealing with this type of data is ``sparse\nmultiple canonical correlation analysis'' (sparse mCCA). All of the current\nsparse mCCA techniques are biconvex and thus have no guarantees about reaching\na global optimum. We propose a method for performing sparse supervised\ncanonical correlation analysis (sparse sCCA), a specific case of sparse mCCA\nwhen one of the datasets is a vector. Our proposal for sparse sCCA is convex\nand thus does not face the same difficulties as the other methods. We derive\nefficient algorithms for this problem, and illustrate their use on simulated\nand real data.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2014 23:00:11 GMT"}], "update_date": "2014-01-24", "authors_parsed": [["Gross", "Samuel M.", ""], ["Tibshirani", "Robert", ""]]}, {"id": "1401.5901", "submitter": "Ralf Metzler", "authors": "Henning Kruesemann, Aljaz Godec, and Ralf Metzler", "title": "First passage statistics for aging diffusion in annealed and quenched\n  disorder", "comments": "5 pages, 4 Figures, RevTeX", "journal-ref": "Phys. Rev. E 89, 040101(R) (2014)", "doi": "10.1103/PhysRevE.89.040101", "report-no": null, "categories": "cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aging, the dependence of the dynamics of a physical process on the time $t_a$\nsince its original preparation, is observed in systems ranging from the motion\nof charge carriers in amorphous semiconductors over the blinking dynamics of\nquantum dots to the tracer dispersion in living biological cells. Here we study\nthe effects of aging on one of the most fundamental properties of a stochastic\nprocess, the first passage dynamics. We find that for an aging continuous time\nrandom walk process the scaling exponent of the density of first passage times\nchanges twice as the aging progresses and reveals an intermediate scaling\nregime. The first passage dynamics depends on $t_a$ differently for\nintermediate and strong aging. Similar crossovers are obtained for the first\npassage dynamics for a confined and driven particle. Comparison to the motion\nof an aged particle in the quenched trap model with a bias shows excellent\nagreement with our analytical findings. Our results demonstrate how first\npassage measurements can be used to unravel the age $t_a$ of a physical system.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 09:21:27 GMT"}], "update_date": "2014-12-24", "authors_parsed": [["Kruesemann", "Henning", ""], ["Godec", "Aljaz", ""], ["Metzler", "Ralf", ""]]}, {"id": "1401.5955", "submitter": "Soya Shinkai Dr.", "authors": "Soya Shinkai and Yuichi Togashi", "title": "Energetics of single active diffusion trajectories", "comments": "6 pages, 3 figures", "journal-ref": "EPL, 105 (2014) 30002", "doi": "10.1209/0295-5075/105/30002", "report-no": null, "categories": "cond-mat.soft cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The fundamental insight into Brownian motion by Einstein is that all\nsubstances exhibit continual fluctuations due to thermal agitation balancing\nwith the frictional resistance. However, even at thermal equilibrium,\nbiological activity can give rise to non-equilibrium fluctuations that cause\n``active diffusion\" in living cells. Because of the non-stationary and\nnon-equilibrium nature of such fluctuations, mean square displacement analysis,\nrelevant only to a steady state ensemble, may not be the most suitable choice\nas it depends on the choice of the ensemble; hence, a new analytical method for\ndescribing active diffusion is desired. Here we discuss the stochastic\nenergetics of a thermally fluctuating single active diffusion trajectory driven\nby non-thermal random forces. Heat dissipation, usually difficult to measure,\ncan be estimated from the active diffusion trajectory; guidelines on the\nanalysis such as criteria for the time resolution and driving force intensity\nare shown by a statistical test. This leads to the concept of an\n``instantaneous diffusion coefficient\" connected to heat dissipation that may\nbe used to analyse the activity and molecular transport mechanisms of living\nsystems.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 12:24:57 GMT"}], "update_date": "2014-02-19", "authors_parsed": [["Shinkai", "Soya", ""], ["Togashi", "Yuichi", ""]]}, {"id": "1401.6004", "submitter": "Clinton Goss Ph.D.", "authors": "Eric B. Miller and Clinton F. Goss", "title": "An Exploration of Physiological Responses to the Native American Flute", "comments": "17 pages, 7 figures, 4 tables, presented at ISQRMM 2013, Athens, GA,\n  July 26, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This pilot study explored physiological responses to playing and listening to\nthe Native American flute. Autonomic, electroencephalographic (EEG), and heart\nrate variability (HRV) metrics were recorded while participants (N = 15) played\nflutes and listened to several styles of music. Flute playing was accompanied\nby an 84% increase in HRV (p < .001). EEG theta (4-8 Hz) activity increased\nwhile playing flutes (p = .007) and alpha (8-12 Hz) increased while playing\nlower-pitched flutes (p = .009). Increase in alpha from baseline to the flute\nplaying conditions strongly correlated with experience playing Native American\nflutes (r = +.700). Wide-band beta (12-25 Hz) decreased from the silence\nconditions when listening to solo Native American flute music (p = .013). The\nfindings of increased HRV, increasing slow-wave rhythms, and decreased beta\nsupport the hypothesis that Native American flutes, particularly those with\nlower pitches, may have a role in music therapy contexts. We conclude that the\nNative American flute may merit a more prominent role in music therapy and that\na study of the effects of flute playing on clinical conditions, such as\npost-traumatic stress disorder (PTSD), asthma, chronic obstructive pulmonary\ndisease (COPD), hypertension, anxiety, and major depressive disorder, is\nwarranted.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2014 02:44:01 GMT"}, {"version": "v2", "created": "Fri, 24 Jan 2014 03:57:28 GMT"}], "update_date": "2014-01-27", "authors_parsed": [["Miller", "Eric B.", ""], ["Goss", "Clinton F.", ""]]}, {"id": "1401.6602", "submitter": "Daniel Rabosky", "authors": "Daniel L. Rabosky", "title": "Automatic detection of key innovations, rate shifts, and\n  diversity-dependence on phylogenetic trees", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0089543", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A number of methods have been developed to infer differential rates of\nspecies diversification through time and among clades using time-calibrated\nphylogenetic trees. However, we lack a general framework that can delineate and\nquantify heterogeneous mixtures of dynamic processes within single phylogenies.\nI developed a method that can identify arbitrary numbers of time-varying\ndiversification processes on phylogenies without specifying their locations in\nadvance. The method uses reversible-jump Markov Chain Monte Carlo to move\nbetween model subspaces that vary in the number of distinct diversification\nregimes. The model assumes that changes in evolutionary regimes occur across\nthe branches of phylogenetic trees under a compound Poisson process and\nexplicitly accounts for rate variation through time and among lineages. Using\nsimulated datasets, I demonstrate that the method can be used to quantify\ncomplex mixtures of time-dependent, diversity-dependent, and constant-rate\ndiversification processes. I compared the performance of the method to the\nMEDUSA model of rate variation among lineages. As an empirical example, I\nanalyzed the history of speciation and extinction during the radiation of\nmodern whales. The method described here will greatly facilitate the\nexploration of macroevolutionary dynamics across large phylogenetic trees,\nwhich may have been shaped by heterogeneous mixtures of distinct evolutionary\nprocesses.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jan 2014 01:28:52 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Rabosky", "Daniel L.", ""]]}, {"id": "1401.7125", "submitter": "Christian Kuehn", "authors": "Christian Kuehn and Gerd Zschaler and Thilo Gross", "title": "Early warning signs for saddle-escape transitions in complex networks", "comments": "revised version", "journal-ref": "Scientific Reports, Vol. 5, 13190, 2015", "doi": "10.1038/srep13190", "report-no": null, "categories": "nlin.AO math.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many real world systems are at risk of undergoing critical transitions,\nleading to sudden qualitative and sometimes irreversible regime shifts. The\ndevelopment of early warning signals is recognized as a major challenge. Recent\nprogress builds on a mathematical framework in which a real-world system is\ndescribed by a low-dimensional equation system with a small number of key\nvariables, where the critical transition often corresponds to a bifurcation.\nHere we show that in high-dimensional systems, containing many variables, we\nfrequently encounter an additional non-bifurcative saddle-type mechanism\nleading to critical transitions. This generic class of transitions has been\nmissed in the search for early-warnings up to now. In fact, the saddle-type\nmechanism also applies to low-dimensional systems with saddle-dynamics. Near a\nsaddle a system moves slowly and the state may be perceived as stable over\nsubstantial time periods. We develop an early warning sign for the saddle-type\ntransition. We illustrate our results in two network models and epidemiological\ndata. This work thus establishes a connection from critical transitions to\nnetworks and an early warning sign for a new type of critical transition. In\ncomplex models and big data we anticipate that saddle-transitions will be\nencountered frequently in the future.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jan 2014 10:07:03 GMT"}, {"version": "v2", "created": "Thu, 8 Jan 2015 10:02:24 GMT"}], "update_date": "2017-02-28", "authors_parsed": [["Kuehn", "Christian", ""], ["Zschaler", "Gerd", ""], ["Gross", "Thilo", ""]]}, {"id": "1401.7457", "submitter": "Ruibang Luo", "authors": "Chi-Man Liu, Ruibang Luo, Tak-Wah Lam", "title": "GPU-Accelerated BWT Construction for Large Collection of Short Reads", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.DC cs.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in DNA sequencing technology have stimulated the development of\nalgorithms and tools for processing very large collections of short strings\n(reads). Short-read alignment and assembly are among the most well-studied\nproblems. Many state-of-the-art aligners, at their core, have used the\nBurrows-Wheeler transform (BWT) as a main-memory index of a reference genome\n(typical example, NCBI human genome). Recently, BWT has also found its use in\nstring-graph assembly, for indexing the reads (i.e., raw data from DNA\nsequencers). In a typical data set, the volume of reads is tens of times of the\nsequenced genome and can be up to 100 Gigabases. Note that a reference genome\nis relatively stable and computing the index is not a frequent task. For reads,\nthe index has to computed from scratch for each given input. The ability of\nefficient BWT construction becomes a much bigger concern than before. In this\npaper, we present a practical method called CX1 for constructing the BWT of\nvery large string collections. CX1 is the first tool that can take advantage of\nthe parallelism given by a graphics processing unit (GPU, a relative cheap\ndevice providing a thousand or more primitive cores), as well as simultaneously\nthe parallelism from a multi-core CPU and more interestingly, from a cluster of\nGPU-enabled nodes. Using CX1, the BWT of a short-read collection of up to 100\nGigabases can be constructed in less than 2 hours using a machine equipped with\na quad-core CPU and a GPU, or in about 43 minutes using a cluster with 4 such\nmachines (the speedup is almost linear after excluding the first 16 minutes for\nloading the reads from the hard disk). The previously fastest tool BRC is\nmeasured to take 12 hours to process 100 Gigabases on one machine; it is\nnon-trivial how BRC can be parallelized to take advantage a cluster of\nmachines, let alone GPUs.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2014 10:06:07 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Liu", "Chi-Man", ""], ["Luo", "Ruibang", ""], ["Lam", "Tak-Wah", ""]]}, {"id": "1401.7492", "submitter": "Nikita Polianskii", "authors": "A. Dyachkov", "title": "Lectures on DNA Codes", "comments": "24 pages, 2 figures", "journal-ref": "A. Dyachkov, P. Vilenkin, I. Ismagilov, R. Sarbayev, A. Macula, D.\n  Torney, P. White, \"On dna codes\"// Problems of Information Transmission, vol.\n  41, no. 4, pp. 349-367, 2005", "doi": null, "report-no": null, "categories": "cs.IT math.IT q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For $q$-ary $n$-sequences, we develop the concept of similarity functions\nthat can be used (for $q=4$) to model a thermodynamic similarity on DNA\nsequences. A similarity function is identified by the length of a longest\ncommon subsequence between two $q$-ary $n$-sequences. Codes based on similarity\nfunctions are called DNA codes. DNA codes are important components in\nbiomolecular computing and other biotechnical applications that employ DNA\nhybridization assays. The main aim of the given lecture notes -- to discuss\nlower bounds on the rate of optimal DNA codes for a biologically motivated\nsimilarity function called a block similarity and for the conventional deletion\nsimilarity function used in the theory of error-correcting codes. We also\npresent constructions of suboptimal DNA codes based on the parity-check code\ndetecting one error in the Hamming metric.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2014 12:37:45 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Dyachkov", "A.", ""]]}, {"id": "1401.7803", "submitter": "Ben Shirt-Ediss", "authors": "Ben Shirt-Ediss, Kepa Ruiz-Mirazo, Fabio Mavelli and Ricard V. Sol\\'e", "title": "Modelling Lipid Competition Dynamics in Heterogeneous Protocell\n  Populations", "comments": "15 pages, 6 figures, 1 table", "journal-ref": null, "doi": "10.1038/srep05675", "report-no": null, "categories": "q-bio.QM q-bio.SC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In addressing the origins of Darwinian evolution, recent experimental work\nhas been focussed on the discovery of simple physical effects which would\nprovide a relevant selective advantage to protocells competing with each other\nfor a limited supply of lipid. In particular, data coming from Szostak's lab\nsuggest that the transition from simple prebiotically plausible lipid membranes\nto more complex and heterogeneous ones, closer to real biomembranes, may have\nbeen driven by changes in the fluidity of the membrane and its affinity for the\navailable amphiphilic compound, which in turn would involve changes in vesicle\ngrowth dynamics. Earlier work from the same group reported osmotically-driven\ncompetition effects, whereby swelled vesicles grow at the expense of isotonic\nones. In this paper, we try to expand on these experimental studies by\nproviding a simple mathematical model of a population of competing vesicles,\nstudied at the level of lipid kinetics. In silico simulations of the model are\nable to reproduce qualitatively and often quantitatively the experimentally\nreported competition effects in both scenarios. We also develop a method for\nnumerically solving the equilibrium of a population of competing model\nvesicles, which is quite general and applicable to different vesicle kinetics\nschemes.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2014 11:31:11 GMT"}], "update_date": "2014-07-15", "authors_parsed": [["Shirt-Ediss", "Ben", ""], ["Ruiz-Mirazo", "Kepa", ""], ["Mavelli", "Fabio", ""], ["Solé", "Ricard V.", ""]]}, {"id": "1401.7972", "submitter": "Charalampos Chrysanthakopoulos A.", "authors": "Charalampos A. Chrysanthakopoulos", "title": "Predicting the Next Maxima Incidents of the Seasonally Forced SEIR\n  Epidemic Model", "comments": "6 pages, 3 figures, 2 tables, typos added", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper aims at predicting the next maxima values of the state variables\nof the seasonal SEIR epidemic model and their in-between time intervals.\nLorenz's method of analogues is applied on the attractor formed by the maxima\nof the corresponding state variables. It is found that both quantities are\ncharacterized by a high degree of predictability in the case of the chaotic\nregime of the parameter space.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2014 20:23:24 GMT"}, {"version": "v2", "created": "Fri, 31 Jan 2014 14:06:50 GMT"}], "update_date": "2014-02-03", "authors_parsed": [["Chrysanthakopoulos", "Charalampos A.", ""]]}, {"id": "1401.8028", "submitter": "Mercedes P\\'erez Mill\\'an", "authors": "Mercedes P\\'erez Mill\\'an and Alicia Dickenstein", "title": "Implicit dose-response curves", "comments": "The final publication is available at Springer via\n  http://dx.doi.org/10.1007/s00285-014-0809-4", "journal-ref": null, "doi": "10.1007/s00285-014-0809-4", "report-no": null, "categories": "q-bio.QM math.AG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop tools from computational algebraic geometry for the study of\nsteady state features of autonomous polynomial dynamical systems via\nelimination of variables. In particular, we obtain nontrivial bounds for the\nsteady state concentration of a given species in biochemical reaction networks\nwith mass-action kinetics. This species is understood as the output of the\nnetwork and we thus bound the maximal response of the system. The improved\nbounds give smaller starting boxes to launch numerical methods. We apply our\nresults to the sequential enzymatic network studied in Markevich et al.(2004)\nto find nontrivial upper bounds for the different substrate concentrations at\nsteady state.\n  Our approach does not require any simulation, analytical expression to\ndescribe the output in terms of the input, or the absence of multistationarity.\nInstead, we show how to extract information from effectively computable\nimplicit dose-response curves with the use of resultants and discriminants. We\nmoreover illustrate in the application to an enzymatic network, the relation\nbetween the exact implicit dose-response curve we obtain symbolically and the\nstandard hysteresis diagram provided by a numerical solver.\n  The setting and tools we propose could yield many other results adapted to\nany autonomous polynomial dynamical system, beyond those where it is possible\nto get explicit expressions.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2014 23:25:46 GMT"}, {"version": "v2", "created": "Fri, 11 Jul 2014 10:25:00 GMT"}], "update_date": "2014-07-14", "authors_parsed": [["Millán", "Mercedes Pérez", ""], ["Dickenstein", "Alicia", ""]]}]