[{"id": "1611.00054", "submitter": "Eugene Postnikov", "authors": "Anastasia I. Lavrova, Eugene B. Postnikov, Andrey Yu. Zyubin, Svetlana\n  V. Babak", "title": "ODE and Random Boolean networks in application to modelling of\n  6-mercaptopurine metabolism", "comments": "9 pages; 2 figure; 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider two approaches to modelling of cell metabolism of\n6-mercaptopurine, which is one of the important chemotherapy drugs used for\ntreating of acute lymphocytic leukemia: kinetic ordinary differential equations\nand random Boolean networks, and analyse their interplay with respect to taking\ninto account ATP concentration as a key parameter of switching between\ndifferent pathways. It is shown that Boolean networks, which allow for avoiding\ncomplexity of general kinetic modelling, preserve an opportunity to the\nreproduction of the principal switching mechanism. To keep a detailed\nquantitative measure of the control parameter, a combined Boolean-ODE method is\nproposed.\n", "versions": [{"version": "v1", "created": "Mon, 31 Oct 2016 21:34:46 GMT"}], "update_date": "2016-11-02", "authors_parsed": [["Lavrova", "Anastasia I.", ""], ["Postnikov", "Eugene B.", ""], ["Zyubin", "Andrey Yu.", ""], ["Babak", "Svetlana V.", ""]]}, {"id": "1611.00103", "submitter": "Yongcheng Zhou", "authors": "Melissa R. Adkins and Y. C. Zhou", "title": "Geodesic curvature driven surface microdomain formation", "comments": "31 pages", "journal-ref": null, "doi": "10.1016/j.jcp.2017.05.029", "report-no": null, "categories": "q-bio.QM cond-mat.soft", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lipid bilayer membranes are not uniform and clusters of lipids in a more\nordered state exist within the generally disorder lipid milieu of the membrane.\nThese clusters of ordered lipids microdomains are now referred to as lipid\nrafts. Recent reports attribute the formation of these microdomains to the\ngeometrical and molecular mechanical mismatch of lipids of different species on\nthe boundary. Here we introduce the geodesic curvature to characterize the\ngeometry of the domain boundary, and develop a geodesic curvature energy model\nto describe the formation of these microdomains as a result of energy\nminimization. Our model accepts the intrinsic geodesic curvature of any binary\nlipid mixture as an input, and will produce microdomains of the given geodesic\ncurvature as demonstrated by three sets of numerical simulations. Our results\nare in contrast to the surface phase separation predicted by the classical\nsurface Cahn-Hilliard equation, which tends to generate large domains as a\nresult of the minimizing line tension. Our model provides a direct and\nquantified description of the structure inhomogeneity of lipid bilayer\nmembrane, and can be coupled to the investigations of biological processes on\nmembranes for which such inhomogeneity plays essential roles.\n", "versions": [{"version": "v1", "created": "Tue, 1 Nov 2016 02:01:41 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Adkins", "Melissa R.", ""], ["Zhou", "Y. C.", ""]]}, {"id": "1611.00313", "submitter": "Joaquin Rapela", "authors": "Joaquin Rapela and Marissa Westerfield and Jeanne Townsend and Scott\n  Makeig", "title": "A new foreperiod effect on single-trial phase coherence. Part I:\n  existence and relevance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Expecting events in time leads to more efficient behavior. A remarkable early\nfinding in the study of temporal expectancy is the foreperiod effect on\nreaction times; i.e., the influence or reaction time of the time period between\na warning signal and an imperative stimulus to which subjects are instructed to\nrespond as quickly as possible. Recently it has been shown that the phase of\noscillatory activity preceding stimulus presentation is related to behavior.\nHere we connect both of these findings by reporting a novel foreperiod effect\non the inter-trial phase coherence of the electroencephalogram (EEG) triggered\nby stimuli to which subjects are instructed not to respond. Inter-trial phase\ncoherence has been used to describe regularities in phases of groups of trials\ntime locked to an event of interest. We propose a single-trial measure of\ninter-trial phase coherence and prove its soundness. Equipped with this\nmeasure, and using a multivariate decoding method, we demonstrate that the\nforeperiod duration in and audiovisual attention-shifting task modulates\nsingle-trial phase coherence. In principle, this modulation could be an\nartifact of the decoding method used to detect it. We show that this is not the\ncase, since the modulation can also be observed using a simple averaging\nmethod. We show that the strength of this modulation correlates with subject\nbehavior (both error rates and mean-reaction times). We anticipate that the new\nforeperiod effect on inter-trial phase coherence, and the decoding method used\nhere to detect it, will be important tools to understand cognition at the\nsingle-trial level. In Part II of this manuscript, we support this claim, by\nshowing that changes in attention modulate the strength of the new foreperiod\neffect on a trial-by-trial basis.\n", "versions": [{"version": "v1", "created": "Fri, 26 Aug 2016 18:50:12 GMT"}], "update_date": "2016-11-02", "authors_parsed": [["Rapela", "Joaquin", ""], ["Westerfield", "Marissa", ""], ["Townsend", "Jeanne", ""], ["Makeig", "Scott", ""]]}, {"id": "1611.00962", "submitter": "Marco Frasca", "authors": "Marco Frasca and Nicol\\`o Cesa Bianchi", "title": "Multitask Protein Function Prediction Through Task Dissimilarity", "comments": "12 pages, 5 figures", "journal-ref": null, "doi": "10.1109/TCBB.2017.2684127", "report-no": null, "categories": "stat.ML cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automated protein function prediction is a challenging problem with\ndistinctive features, such as the hierarchical organization of protein\nfunctions and the scarcity of annotated proteins for most biological functions.\nWe propose a multitask learning algorithm addressing both issues. Unlike\nstandard multitask algorithms, which use task (protein functions) similarity\ninformation as a bias to speed up learning, we show that dissimilarity\ninformation enforces separation of rare class labels from frequent class\nlabels, and for this reason is better suited for solving unbalanced protein\nfunction prediction problems. We support our claim by showing that a multitask\nextension of the label propagation algorithm empirically works best when the\ntask relatedness information is represented using a dissimilarity matrix as\nopposed to a similarity matrix. Moreover, the experimental comparison carried\nout on three model organism shows that our method has a more stable performance\nin both \"protein-centric\" and \"function-centric\" evaluation settings.\n", "versions": [{"version": "v1", "created": "Thu, 3 Nov 2016 11:40:59 GMT"}], "update_date": "2019-04-09", "authors_parsed": [["Frasca", "Marco", ""], ["Bianchi", "Nicolò Cesa", ""]]}, {"id": "1611.01037", "submitter": "Valery Kirzhner", "authors": "Valery Kirzhner, Zeev Volkovich, Renata Avros and Katerina Korenblat", "title": "Analysis of Metagenome Composition by the Method of Random Primers", "comments": "18 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metagenome, a mixture of different genomes (as a rule, bacterial), represents\na pattern, and the analysis of its composition is, currently, one of the\nchallenging problems of bioinformatics. In the present study, the possibility\nof evaluating metagenome composition by DNA-marker methods is investigated.\nThese methods are based on using primers, short nucleic acid fragments. Each\nprimer picks out of the tested genome the fragment set specific just for this\ngenome, which is called its spectrum (for the given primer) and is used for\nidentifying the genome. The DNA-marker method, applied to a metagenome, also\ngives its spectrum, which, obviously, represents the union of the spectra of\nall genomes belonging to the metagenome. Thus each primer provides a projection\nof the genomes and of the metagenome onto the corresponding spectra set. Here\nwe propose to apply the random projection (random primer) approach for\nanalyzing metagenome composition and present some estimates of the method\neffectiveness for the case of Random Amplified Polymorphic DNA (RAPD)\ntechnology.\n", "versions": [{"version": "v1", "created": "Wed, 2 Nov 2016 18:43:14 GMT"}], "update_date": "2016-11-04", "authors_parsed": [["Kirzhner", "Valery", ""], ["Volkovich", "Zeev", ""], ["Avros", "Renata", ""], ["Korenblat", "Katerina", ""]]}, {"id": "1611.01114", "submitter": "Lingfei Wang", "authors": "Lingfei Wang and Tom Michoel", "title": "Efficient and accurate causal inference with hidden confounders from\n  genome-transcriptome variation data", "comments": "New result and method sections added. 38 pages, 4 figures, 1 table.\n  Supplementary: 20 pages, 10 figures, 2 tables", "journal-ref": "PLoS Comput Biol 13(8): e1005703 (2017)", "doi": "10.1371/journal.pcbi.1005703", "report-no": null, "categories": "q-bio.GN q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mapping gene expression as a quantitative trait using whole genome-sequencing\nand transcriptome analysis allows to discover the functional consequences of\ngenetic variation. We developed a novel method and ultra-fast software Findr\nfor higly accurate causal inference between gene expression traits using\ncis-regulatory DNA variations as causal anchors, which improves current methods\nby taking into account hidden confounders and weak regulations. Findr\noutperformed existing methods on the DREAM5 Systems Genetics challenge and on\nthe prediction of microRNA and transcription factor targets in human\nlymphoblastoid cells, while being nearly a million times faster. Findr is\npublicly available at https://github.com/lingfeiwang/findr\n", "versions": [{"version": "v1", "created": "Thu, 3 Nov 2016 18:05:22 GMT"}, {"version": "v2", "created": "Sun, 6 Nov 2016 22:40:00 GMT"}, {"version": "v3", "created": "Mon, 17 Apr 2017 17:28:33 GMT"}], "update_date": "2017-08-23", "authors_parsed": [["Wang", "Lingfei", ""], ["Michoel", "Tom", ""]]}, {"id": "1611.01173", "submitter": "William Gilpin", "authors": "William Gilpin, Vivek N. Prakash, Manu Prakash", "title": "Vortex arrays and ciliary tangles underlie the feeding-swimming tradeoff\n  in starfish larvae", "comments": "16 pages, 4 figures, Nature Physics (2016)", "journal-ref": null, "doi": "10.1038/nphys3981", "report-no": null, "categories": "physics.flu-dyn physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many marine invertebrates have larval stages covered in linear arrays of\nbeating cilia, which propel the animal while simultaneously entraining\nplanktonic prey. These bands are strongly conserved across taxa spanning four\nmajor superphyla, and they are responsible for the unusual morphologies of many\ninvertebrate larvae. However, few studies have investigated their underlying\nhydrodynamics. Here, we study the ciliary bands of starfish larvae, and\ndiscover a beautiful pattern of slowly-evolving vortices that surrounds the\nswimming animals. Closer inspection of the bands reveals unusual ciliary\n\"tangles\" analogous to topological defects that break up and re-form as the\nanimal adjusts its swimming stroke. Quantitative experiments and modeling\ndemonstrate that these vortices create a physical tradeoff between feeding and\nswimming in heterogenous environments, which manifests as distinct flow\npatterns or \"eigen-strokes\" representing each behavior---potentially\nimplicating neuronal control of cilia. This quantitative interplay between\nlarval form and hydrodynamic function may generalize to other invertebrates\nwith ciliary bands, and illustrates the potential effects of active boundary\nconditions in other biological and synthetic systems.\n", "versions": [{"version": "v1", "created": "Thu, 3 Nov 2016 20:10:14 GMT"}, {"version": "v2", "created": "Mon, 13 Feb 2017 01:12:01 GMT"}], "update_date": "2017-02-14", "authors_parsed": [["Gilpin", "William", ""], ["Prakash", "Vivek N.", ""], ["Prakash", "Manu", ""]]}, {"id": "1611.02482", "submitter": "Roland Kr\\\"amer", "authors": "Ulrich Warttinger, Roland Kr\\\"amer", "title": "Quantification of heparin in complex matrices (including urine) using a\n  mix-and-read fluorescence assay", "comments": "Article, 16 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heparin is an important anticoagulant drug, about one billion doses are\nproduced annually. It is a polydisperse sulfated polysaccharide, and the\ninherent heterogeneity makes the analysis of heparin difficult. The global\ncrisis resulting from adulterated heparin in 2008 has drawn renewed attention\nto the challenges that are associated with the quality control and\ncharacterization of this complex biological medicine from natural sources. The\npresent study addresses the need for simple and user-friendly analytical\nmethods for the fast and accurate quantification of heparin in complex\nmatrices. Direct quantification of heparin in the low microgram per mL range\nwas accomplished using a specific commercially available assay based on the\nfluorescent molecular probe Heparin Red, simply by mixing the heparin\ncontaining sample and a reagent solution in a 96-well microplate followed by\nfluorescence readout. A screening of typical impurities in raw heparin\n(selected other glycosaminoglycans, residual nucleic acids and proteins),\nrelated to the extraction from animal tissues, as well as of components of the\nurine matrix (inorganic salts, amino acids, trace proteins) revealed that these\ncompounds even in large excess have no or very little effect on the accuracy of\nheparin determination. Heparin spike detection in urine, a biological\nmulticomponent matrix, also showed good accuracy. We envision applications of\nthis mix-and-read assay in the process and quality control in heparin\nmanufacturing, but also in pharmacokinetic studies as a convenient tool for\nmeasuring of the urinary excretion of heparins.\n", "versions": [{"version": "v1", "created": "Tue, 8 Nov 2016 11:29:04 GMT"}], "update_date": "2016-11-09", "authors_parsed": [["Warttinger", "Ulrich", ""], ["Krämer", "Roland", ""]]}, {"id": "1611.02945", "submitter": "Nasser Ghadiri", "authors": "Maryam Lotfi Shahreza, Nasser Ghadiri, Seyed Rasul Mossavi, Jaleh\n  Varshosaz, James Green", "title": "Heter-LP: A heterogeneous label propagation algorithm and its\n  application in drug repositioning", "comments": null, "journal-ref": null, "doi": "10.1016/j.jbi.2017.03.006", "report-no": null, "categories": "q-bio.QM cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Drug repositioning offers an effective solution to drug discovery, saving\nboth time and resources by finding new indications for existing drugs.\nTypically, a drug takes effect via its protein targets in the cell. As a\nresult, it is necessary for drug development studies to conduct an\ninvestigation into the interrelationships of drugs, protein targets, and\ndiseases. Although previous studies have made a strong case for the\neffectiveness of integrative network-based methods for predicting these\ninterrelationships, little progress has been achieved in this regard within\ndrug repositioning research. Moreover, the interactions of new drugs and\ntargets (lacking any known targets and drugs, respectively) cannot be\naccurately predicted by most established methods. In this paper, we propose a\nnovel semi-supervised heterogeneous label propagation algorithm named Heter-LP,\nwhich applies both local as well as global network features for data\nintegration. To predict drug-target, disease-target, and drug-disease\nassociations, we use information about drugs, diseases, and targets as\ncollected from multiple sources at different levels. Our algorithm integrates\nthese various types of data into a heterogeneous network and implements a label\npropagation algorithm to find new interactions. Statistical analyses of 10-fold\ncross-validation results and experimental analysis support the effectiveness of\nthe proposed algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 8 Nov 2016 20:18:57 GMT"}], "update_date": "2018-11-26", "authors_parsed": [["Shahreza", "Maryam Lotfi", ""], ["Ghadiri", "Nasser", ""], ["Mossavi", "Seyed Rasul", ""], ["Varshosaz", "Jaleh", ""], ["Green", "James", ""]]}, {"id": "1611.03144", "submitter": "Arnaud Poret", "authors": "Arnaud Poret, Carito Guziolowski", "title": "Therapeutic target discovery using Boolean network attractors:\n  improvements of kali", "comments": null, "journal-ref": "Royal Society Open Science, The Royal Society, 2018, 5 (2)", "doi": "10.1098/rsos.171852", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In a previous article, an algorithm for identifying therapeutic targets in\nBoolean networks modeling pathological mechanisms was introduced. In the\npresent article, the improvements made on this algorithm, named kali, are\ndescribed. These improvements are i) the possibility to work on asynchronous\nBoolean networks, ii) a finer assessment of therapeutic targets and iii) the\npossibility to use multivalued logic. kali assumes that the attractors of a\ndynamical system, such as a Boolean network, are associated with the phenotypes\nof the modeled biological system. Given a logic-based model of pathological\nmechanisms, kali searches for therapeutic targets able to reduce the\nreachability of the attractors associated with pathological phenotypes, thus\nreducing their likeliness. kali is illustrated on an example network and used\non a biological case study. The case study is a published logic-based model of\nbladder tumorigenesis from which kali returns consistent results. However, like\nany computational tool, kali can predict but can not replace human expertise:\nit is a supporting tool for coping with the complexity of biological systems in\nthe field of drug discovery.\n", "versions": [{"version": "v1", "created": "Thu, 10 Nov 2016 01:08:33 GMT"}, {"version": "v2", "created": "Wed, 8 Nov 2017 14:03:27 GMT"}, {"version": "v3", "created": "Mon, 8 Jan 2018 17:24:12 GMT"}], "update_date": "2018-03-13", "authors_parsed": [["Poret", "Arnaud", ""], ["Guziolowski", "Carito", ""]]}, {"id": "1611.03227", "submitter": "Vincenzo Lagani", "authors": "Vincenzo Lagani, Giorgos Athineou, Alessio Farcomeni, Michail Tsagris,\n  Ioannis Tsamardinos", "title": "Feature Selection with the R Package MXM: Discovering\n  Statistically-Equivalent Feature Subsets", "comments": "Accepted for publication in Journal of Statistical Software", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The statistically equivalent signature (SES) algorithm is a method for\nfeature selection inspired by the principles of constrained-based learning of\nBayesian Networks. Most of the currently available feature-selection methods\nreturn only a single subset of features, supposedly the one with the highest\npredictive power. We argue that in several domains multiple subsets can achieve\nclose to maximal predictive accuracy, and that arbitrarily providing only one\nhas several drawbacks. The SES method attempts to identify multiple, predictive\nfeature subsets whose performances are statistically equivalent. Under that\nrespect SES subsumes and extends previous feature selection algorithms, like\nthe max-min parent children algorithm. SES is implemented in an homonym\nfunction included in the R package MXM, standing for mens ex machina, meaning\n'mind from the machine' in Latin. The MXM implementation of SES handles several\ndata-analysis tasks, namely classification, regression and survival analysis.\nIn this paper we present the SES algorithm, its implementation, and provide\nexamples of use of the SES function in R. Furthermore, we analyze three\npublicly available data sets to illustrate the equivalence of the signatures\nretrieved by SES and to contrast SES against the state-of-the-art feature\nselection method LASSO. Our results provide initial evidence that the two\nmethods perform comparably well in terms of predictive accuracy and that\nmultiple, equally predictive signatures are actually present in real world\ndata.\n", "versions": [{"version": "v1", "created": "Thu, 10 Nov 2016 09:08:41 GMT"}], "update_date": "2016-11-11", "authors_parsed": [["Lagani", "Vincenzo", ""], ["Athineou", "Giorgos", ""], ["Farcomeni", "Alessio", ""], ["Tsagris", "Michail", ""], ["Tsamardinos", "Ioannis", ""]]}, {"id": "1611.03361", "submitter": "Carlos Martinez Mr.", "authors": "Carlos Alberto Mart\\'inez, Kshitij Khare, Syed Rahman, Mauricio A.\n  Elzo", "title": "Modelling correlated marker effects in genome-wide prediction via\n  Gaussian concentration graph models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In genome-wide prediction, independence of marker allele substitution effects\nis typically assumed; however, since early stages of this technology it has\nbeen known that nature points to correlated effects. In statistics, graphical\nmodels have been identified as a useful and powerful tool for covariance\nestimation in high dimensional problems and it is an area that has recently\nexperienced a great expansion. In particular, Gaussian concentration graph\nmodels (GCGM) have been widely studied. These are models in which the\ndistribution of a set of random variables, the marker effects in this case, is\nassumed to be Markov with respect to an undirected graph G. In this paper,\nBayesian (Bayes G and Bayes G-D) and frequentist (GML-BLUP) methods adapting\nthe theory of GCGM to genome-wide prediction were developed. Different\napproaches to define the graph G based on domain-specific knowledge were\nproposed, and two propositions and a corollary establishing conditions to find\ndecomposable graphs were proven. These methods were implemented in small\nsimulated and real datasets. In our simulations, scenarios where correlations\namong allelic substitution effects were expected to arise due to various causes\nwere considered, and graphs were defined on the basis of physical marker\npositions. Results showed improvements in correlation between phenotypes and\npredicted breeding values and accuracies of predicted breeding values when\naccounting for partially correlated allele substitution effects. Extensions to\nthe multiallelic loci case were described and some possible refinements\nincorporating more flexible priors in the Bayesian setting were discussed. Our\nmodels are promising because they allow incorporation of biological information\nin the prediction process, and because they are more flexible and general than\nother models accounting for correlated marker effects that have been proposed\npreviously.\n", "versions": [{"version": "v1", "created": "Thu, 10 Nov 2016 15:50:53 GMT"}, {"version": "v2", "created": "Wed, 5 Apr 2017 21:13:07 GMT"}, {"version": "v3", "created": "Wed, 20 Sep 2017 15:35:09 GMT"}], "update_date": "2017-09-21", "authors_parsed": [["Martínez", "Carlos Alberto", ""], ["Khare", "Kshitij", ""], ["Rahman", "Syed", ""], ["Elzo", "Mauricio A.", ""]]}, {"id": "1611.03890", "submitter": "Guido D'Amico", "authors": "Guido D'Amico, Raul Rabadan, Matthew Kleban", "title": "A Theory of Taxonomy", "comments": "7+13 pages, 5 figures. Comments welcome", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.SI physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A taxonomy is a standardized framework to classify and organize items into\ncategories. Hierarchical taxonomies are ubiquitous, ranging from the\nclassification of organisms to the file system on a computer. Characterizing\nthe typical distribution of items within taxonomic categories is an important\nquestion with applications in many disciplines. Ecologists have long sought to\naccount for the patterns observed in species-abundance distributions (the\nnumber of individuals per species found in some sample), and computer\nscientists study the distribution of files per directory. Is there a universal\nstatistical distribution describing how many items are typically found in each\ncategory in large taxonomies? Here, we analyze a wide array of large,\nreal-world datasets -- including items lost and found on the New York City\ntransit system, library books, and a bacterial microbiome -- and discover such\nan underlying commonality. A simple, non-parametric branching model that\nrandomly categorizes items and takes as input only the total number of items\nand the total number of categories successfully reproduces the abundance\ndistributions in these datasets. This result may shed light on patterns in\nspecies-abundance distributions long observed in ecology. The model also\npredicts the number of taxonomic categories that remain unrepresented in a\nfinite sample.\n", "versions": [{"version": "v1", "created": "Fri, 4 Nov 2016 19:25:49 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["D'Amico", "Guido", ""], ["Rabadan", "Raul", ""], ["Kleban", "Matthew", ""]]}, {"id": "1611.04030", "submitter": "Konstantin Blyuss", "authors": "N. Sherborne, J.C. Miller, K.B. Blyuss, I.Z. Kiss", "title": "Mean-field models for non-Markovian epidemics on networks: from\n  edge-based compartmental to pairwise models", "comments": "24 pages, 4 figures, submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a novel extension of the edge-based compartmental model\nfor epidemics with arbitrary distributions of transmission and recovery times.\nUsing the message passing approach we also derive a new pairwise-like model for\nepidemics with Markovian transmission and an arbitrary recovery period. The new\npairwise-like model allows one to formally prove that the message passing and\nedge-based compartmental models are equivalent in the case of Markovian\ntransmission and arbitrary recovery processes. The edge-based and message\npassing models are conjectured to also be equivalent for arbitrary transmission\nprocesses; we show the first step of a full proof of this. The new\npairwise-like model encompasses many existing well-known models that can be\nobtained by appropriate reductions. It is also amenable to a relatively\nstraightforward numerical implementation. We test the theoretical results by\ncomparing the numerical solutions of the various pairwise-like models to\nresults based on explicit stochastic network simulations.\n", "versions": [{"version": "v1", "created": "Sat, 12 Nov 2016 18:13:32 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Sherborne", "N.", ""], ["Miller", "J. C.", ""], ["Blyuss", "K. B.", ""], ["Kiss", "I. Z.", ""]]}, {"id": "1611.04077", "submitter": "Christoph Adami", "authors": "Christoph Adami, Jory Schossau, and Arend Hintze", "title": "The Reasonable Effectiveness of Agent-Based Simulations in Evolutionary\n  Game Theory", "comments": "5 pages. To appear in Physics of Life Reviews", "journal-ref": "Physics of Life Reviews 19 (2016) 38-42", "doi": "10.1016/j.plrev.2016.11.005", "report-no": null, "categories": "q-bio.PE cs.GT nlin.AO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is a Reply to comments published in Physics of Life Reviews, on our\narticle \"Evolutionary game theory using agent-based methods\" (Physics of Life\nReviews, 2016, arXiv:1404.0994).\n", "versions": [{"version": "v1", "created": "Sun, 13 Nov 2016 03:54:34 GMT"}], "update_date": "2016-12-07", "authors_parsed": [["Adami", "Christoph", ""], ["Schossau", "Jory", ""], ["Hintze", "Arend", ""]]}, {"id": "1611.04193", "submitter": "Stuart Hagler", "authors": "Stuart Hagler", "title": "Patterns of Selection of Human Movements III: Energy Efficiency,\n  Mechanical Advantage, and Walking Gait", "comments": "21 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human movements are physical processes combining the classical mechanics of\nthe human body moving in space and the biomechanics of the muscles generating\nthe forces acting on the body under sophisticated sensory-motor control. One\nway to characterize movement performance is through measures of energy\nefficiency that relate the mechanical energy of the body and metabolic energy\nexpended by the muscles. We expect the practical utility of such measures to be\ngreater when human subjects execute movements that maximize energy efficiency.\nWe therefore seek to understand if and when subjects select movements with that\nmaximizing energy efficiency. We proceed using a model-based approach to\ndescribe movements which perform a task requiring the body to add or remove\nexternal mechanical work to or from an object. We use the specific example of\nwalking gaits doing external mechanical work by pulling a cart, and estimate\nthe relationship between the avg. walking speed and avg. step length. In the\nlimit where no external work is done, we find that the estimated maximum energy\nefficiency walking gait is much slower than the walking gaits healthy adults\ntypically select. We then modify the situation of the walking gait by\nintroducing an idealized mechanical device that creates an adjustable\nmechanical advantage. The walking gaits that maximize the energy efficiency\nusing the optimal mechanical advantage are again much slower than the walking\ngaits healthy adults typically select. We finally modify the situation so that\nthe avg. walking speed is fixed and derive the pattern of the avg. step length\nand mechanical advantage that maximize energy efficiency.\n", "versions": [{"version": "v1", "created": "Sun, 13 Nov 2016 21:16:15 GMT"}, {"version": "v2", "created": "Thu, 24 Nov 2016 22:50:17 GMT"}, {"version": "v3", "created": "Sun, 9 Dec 2018 19:52:31 GMT"}], "update_date": "2018-12-11", "authors_parsed": [["Hagler", "Stuart", ""]]}, {"id": "1611.04281", "submitter": "Johannes Berg", "authors": "Johannes Berg", "title": "Statistical mechanics of the inverse Ising problem and the optimal\n  objective function", "comments": "16 pages", "journal-ref": null, "doi": "10.1088/1742-5468/aa7df6", "report-no": null, "categories": "cond-mat.dis-nn q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The inverse Ising problem seeks to reconstruct the parameters of an Ising\nHamiltonian on the basis of spin configurations sampled from the Boltzmann\nmeasure. Over the last decade, many applications of the inverse Ising problem\nhave arisen, driven by the advent of large-scale data across different\nscientific disciplines. Recently, strategies to solve the inverse Ising problem\nbased on convex optimisation have proven to be very successful. These\napproaches maximise particular objective functions with respect to the model\nparameters. Examples are the pseudolikelihood method and interaction screening.\nIn this paper, we establish a link between approaches to the inverse Ising\nproblem based on convex optimisation and the statistical physics of disordered\nsystems. We characterise the performance of an arbitrary objective function and\ncalculate the objective function which optimally reconstructs the model\nparameters. We evaluate the optimal objective function within a\nreplica-symmetric ansatz and compare the results of the optimal objective\nfunction with other reconstruction methods. Apart from giving a theoretical\nunderpinning to solving the inverse Ising problem by convex optimisation, the\noptimal objective function outperforms state-of-the-art methods, albeit by a\nsmall margin.\n", "versions": [{"version": "v1", "created": "Mon, 14 Nov 2016 08:30:47 GMT"}, {"version": "v2", "created": "Tue, 31 Jan 2017 07:43:13 GMT"}, {"version": "v3", "created": "Wed, 31 May 2017 13:37:28 GMT"}, {"version": "v4", "created": "Fri, 30 Jun 2017 07:31:10 GMT"}], "update_date": "2017-09-13", "authors_parsed": [["Berg", "Johannes", ""]]}, {"id": "1611.04634", "submitter": "Jason McClelland", "authors": "Jason McClelland, David Koslicki", "title": "EMDUnifrac: Exact Linear Time Computation of the Unifrac Metric and\n  Identification of Differentially Abundant Organisms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Both the weighted and unweighted Unifrac distances have been very\nsuccessfully employed to assess if two communities differ, but do not give any\ninformation about how two communities differ. We take advantage of recent\nobservations that the Unifrac metric is equivalent to the so-called earth\nmover's distance (also known as the Kantorovich-Rubinstein metric) to develop\nan algorithm that not only computes the Unifrac distance in linear time and\nspace, but also simultaneously finds which operational taxonomic units are\nresponsible for the observed differences between samples. This allows the\nalgorithm, called EMDUnifrac, to determine why given samples are different, not\njust if they are different, and with no added computational burden. EMDUnifrac\ncan be utilized on any distribution on a tree, and so is particularly suitable\nto analyzing both operational taxonomic units derived from amplicon sequencing,\nas well as community profiles resulting from classifying whole genome shotgun\nmetagenomes. The EMDUnifrac source code (written in python) is freely available\nat: https://github.com/dkoslicki/EMDUnifrac.\n", "versions": [{"version": "v1", "created": "Mon, 14 Nov 2016 21:56:31 GMT"}], "update_date": "2016-11-16", "authors_parsed": [["McClelland", "Jason", ""], ["Koslicki", "David", ""]]}, {"id": "1611.04743", "submitter": "Ronan M.T. Fleming Dr", "authors": "Laurent Heirendt, Ronan M.T. Fleming, Ines Thiele", "title": "DistributedFBA.jl: High-level, high-performance flux balance analysis in\n  Julia", "comments": "2 pages, 1 figure. Supplementary Material: 1 page", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation:\n  Flux balance analysis, and its variants, are widely used methods for\npredicting steady-state reaction rates in biochemical reaction networks. The\nexploration of high dimensional networks with such methods is currently\nhampered by software performance limitations.\n  Results:\n  DistributedFBA.jl is a high-level, high-performance, open-source\nimplementation of flux balance analysis in Julia. It is tailored to solve\nmultiple flux balance analyses on a subset or all the reactions of large and\nhuge-scale networks, on any number of threads or nodes.\n  Availability:\n  The code and benchmark data are freely available on\nhttp://github.com/opencobra/COBRA.jl. The documentation can be found at\nhttp://opencobra.github.io/COBRA.jl\n", "versions": [{"version": "v1", "created": "Tue, 15 Nov 2016 08:53:45 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Heirendt", "Laurent", ""], ["Fleming", "Ronan M. T.", ""], ["Thiele", "Ines", ""]]}, {"id": "1611.05080", "submitter": "Hugo Gabriel Eyherabide Dr", "authors": "Hugo Gabriel Eyherabide", "title": "Neural stochastic codes, encoding and decoding", "comments": "The additional material and some of the theorems have been integrated\n  within the main results of the manuscript, and few typos have been corrected", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.IT math.IT q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding brain function, constructing computational models and\nengineering neural prosthetics require assessing two problems, namely encoding\nand decoding, but their relation remains controversial. For decades, the\nencoding problem has been shown to provide insight into the decoding problem,\nfor example, by upper bounding the decoded information. However, here we show\nthat this need not be the case when studying response aspects beyond noise\ncorrelations, and trace back the actual causes of this major departure from\ntraditional views. To that end, we reformulate the encoding and decoding\nproblems from the observer or organism perspective. In addition, we study the\nrole of spike-time precision and response discrimination, among other response\naspects, using stochastic transformations of the neural responses, here called\nstochastic codes. Our results show that stochastic codes may cause different\ninformation losses when used to describe neural responses and when employed to\ntrain optimal decoders. Therefore, we conclude that response aspects beyond\nnoise correlations may play different roles in encoding and decoding. In\npractice, our results show for the first time that decoders constructed\nlow-quality descriptions of response aspects may operate optimally on\nhigh-quality descriptions and vice versa, thereby potentially yielding\nexperimental and computational savings, as well as new opportunities for\nsimplifying the design of computational brain models and neural prosthetics.\n", "versions": [{"version": "v1", "created": "Tue, 15 Nov 2016 22:26:50 GMT"}, {"version": "v2", "created": "Fri, 13 Jan 2017 11:19:12 GMT"}], "update_date": "2017-01-16", "authors_parsed": [["Eyherabide", "Hugo Gabriel", ""]]}, {"id": "1611.05082", "submitter": "Hugo Jacquin", "authors": "Hugo Jacquin, Amy Gilson, Eugene Shakhnovich, Simona Cocco, R\\'emi\n  Monasson", "title": "Benchmarking inverse statistical approaches for protein structure and\n  design with exactly solvable models", "comments": "Supplementary Information available at\n  http://journals.plos.org/ploscompbiol/article?id=10.1371%2Fjournal.pcbi.1004889", "journal-ref": "PLoS Comput. Biol. 12(5): e1004889 (2016)", "doi": "10.1371/journal.pcbi.1004889", "report-no": null, "categories": "q-bio.BM cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inverse statistical approaches to determine protein structure and function\nfrom Multiple Sequence Alignments (MSA) are emerging as powerful tools in\ncomputational biology. However the underlying assumptions of the relationship\nbetween the inferred effective Potts Hamiltonian and real protein structure and\nenergetics remain untested so far. Here we use lattice protein model (LP) to\nbenchmark those inverse statistical approaches. We build MSA of highly stable\nsequences in target LP structures, and infer the effective pairwise Potts\nHamiltonians from those MSA. We find that inferred Potts Hamiltonians reproduce\nmany important aspects of 'true' LP structures and energetics. Careful analysis\nreveals that effective pairwise couplings in inferred Potts Hamiltonians depend\nnot only on the energetics of the native structure but also on competing folds;\nin particular, the coupling values reflect both positive design (stabilization\nof native conformation) and negative design (destabilization of competing\nfolds). In addition to providing detailed structural information, the inferred\nPotts models used as protein Hamiltonian for design of new sequences are able\nto generate with high probability completely new sequences with the desired\nfolds, which is not possible using independent-site models. Those are\nremarkable results as the effective LP Hamiltonians used to generate MSA are\nnot simple pairwise models due to the competition between the folds. Our\nfindings elucidate the reasons for the success of inverse approaches to the\nmodelling of proteins from sequence data, and their limitations.\n", "versions": [{"version": "v1", "created": "Tue, 15 Nov 2016 22:32:11 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Jacquin", "Hugo", ""], ["Gilson", "Amy", ""], ["Shakhnovich", "Eugene", ""], ["Cocco", "Simona", ""], ["Monasson", "Rémi", ""]]}, {"id": "1611.05149", "submitter": "Srividya Iyer-Biswas", "authors": "Farshid Jafarpour, Charles S. Wright, Herman Gudjonson, Jedidiah\n  Riebling, Emma Dawson, Klevin Lo, Aretha Fiebig, Sean Crosson, Aaron R.\n  Dinner, and Srividya Iyer-Biswas", "title": "Bridging the time scales of single-cell and population dynamics", "comments": null, "journal-ref": "Phys. Rev. X 8, 021007 (2018)", "doi": "10.1103/PhysRevX.8.021007", "report-no": null, "categories": "q-bio.QM cond-mat.soft q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How are granular details of stochastic growth and division of individual\ncells reflected in smooth deterministic growth of population numbers? We\nprovide an integrated, multiscale perspective of microbial growth dynamics by\nformulating a data-validated theoretical framework that accounts for\nobservables at both single-cell and population scales. We derive exact\nanalytical complete time-dependent solutions to cell-age distributions and\npopulation growth rates as functionals of the underlying interdivision time\ndistributions, for symmetric and asymmetric cell division. These results\nprovide insights into the surprising implications of stochastic single-cell\ndynamics for population growth. Using our results for asymmetric division, we\ndeduce the time to transition from the reproductively quiescent (swarmer) to\nreplication-competent (stalked) stage of the {\\em Caulobacter crescentus}\nlifecycle. Remarkably, population numbers can spontaneously oscillate with\ntime. We elucidate the physics leading to these population oscillations. For\n{\\em C. crescentus} cells, we show that a simple measurement of the population\ngrowth rate, for a given growth condition, is sufficient to characterize the\ncondition-specific cellular unit of time, and thus yields the mean\n(single-cell) growth and division timescales, fluctuations in cell division\ntimes, the cell age distribution, and the quiescence timescale.\n", "versions": [{"version": "v1", "created": "Wed, 16 Nov 2016 05:24:11 GMT"}, {"version": "v2", "created": "Mon, 21 Nov 2016 21:02:07 GMT"}, {"version": "v3", "created": "Sat, 20 Jan 2018 21:19:13 GMT"}], "update_date": "2018-04-11", "authors_parsed": [["Jafarpour", "Farshid", ""], ["Wright", "Charles S.", ""], ["Gudjonson", "Herman", ""], ["Riebling", "Jedidiah", ""], ["Dawson", "Emma", ""], ["Lo", "Klevin", ""], ["Fiebig", "Aretha", ""], ["Crosson", "Sean", ""], ["Dinner", "Aaron R.", ""], ["Iyer-Biswas", "Srividya", ""]]}, {"id": "1611.05669", "submitter": "Vasilis Andreadakis Mr", "authors": "Ioannis Smyrnakis, Vassilios Andreadakis, Vassilios Selimis, Michail\n  Kalaitzakis, Theodora Bachourou, Georgios Kaloutsakis, George D. Kymionis,\n  Stelios Smirnakis, Ioannis M. Aslanides", "title": "RADAR: A Novel Fast-Screening Method for Reading Difficulties with\n  Special Focus on Dyslexia", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0182597", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dyslexia is a developmental learning disorder of single word reading accuracy\nand/or fluency, with compelling research directed towards understanding the\ncontributions of the visual system. While dyslexia is not an oculomotor\ndisease, readers with dyslexia have shown different eye movements than\ntypically developing students during text reading. Readers with dyslexia\nexhibit longer and more frequent fixations, shorter saccade lengths, more\nbackward refixations than typical readers. Furthermore, readers with dyslexia\nare known to have difficulty in reading long words, lower skipping rate of\nshort words, and high gaze duration on many words. It is an open question\nwhether it is possible to harness these distinctive oculomotor scanning\npatterns observed during reading in order to develop a screening tool that can\nreliably identify struggling readers, who may be candidates for dyslexia. Here,\nwe introduce a novel, fast, objective, non-invasive method, named Rapid\nAssessment of Difficulties and Abnormalities in Reading (RADAR) that screens\nfor features associated with the aberrant visual scanning of reading text seen\nin dyslexia. Eye tracking parameter measurements that are stable under retest\nand have high discriminative power, as indicated by their ROC curves, were\nobtained during silent text reading. These parameters were combined to derive a\ntotal reading score (TRS) that can reliably separate readers with dyslexia from\ntypical readers. We tested TRS in a group of school-age children ranging from\n8.5 to 12.5 years of age. TRS achieved 94.2% correct classification of children\ntested. Specifically, 35 out of 37 control (specificity 94.6%) and 30 out of 32\nreaders with dyslexia (sensitivity 93.8%) were classified correctly using\nRADAR, under a circular validation condition where the individual evaluated was\nnot included in the test construction group.\n", "versions": [{"version": "v1", "created": "Thu, 17 Nov 2016 13:05:55 GMT"}, {"version": "v2", "created": "Fri, 18 Nov 2016 12:50:23 GMT"}, {"version": "v3", "created": "Thu, 24 Nov 2016 09:27:23 GMT"}, {"version": "v4", "created": "Mon, 9 Jan 2017 16:36:01 GMT"}], "update_date": "2017-11-01", "authors_parsed": [["Smyrnakis", "Ioannis", ""], ["Andreadakis", "Vassilios", ""], ["Selimis", "Vassilios", ""], ["Kalaitzakis", "Michail", ""], ["Bachourou", "Theodora", ""], ["Kaloutsakis", "Georgios", ""], ["Kymionis", "George D.", ""], ["Smirnakis", "Stelios", ""], ["Aslanides", "Ioannis M.", ""]]}, {"id": "1611.06065", "submitter": "Maude Pupin", "authors": "Qassim Esmaeel, Maude Pupin (CRIStAL, BONSAI), Nam Phuong Kieu,\n  Gabrielle Chataign\\'e, Max B\\'echet, Jovana Deravel, Fran\\c{c}ois Krier,\n  Monica H\\\"ofte, Philippe Jacques, Val\\'erie Lecl\\`ere (CRIStAL, BONSAI)", "title": "Burkholderia genome mining for nonribosomal peptide synthetases reveals\n  a great potential for novel siderophores and lipopeptides synthesis", "comments": null, "journal-ref": "MicrobiologyOpen, 2016, 5 (3), pp.512 - 526", "doi": "10.1002/mbo3.347", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Burkholderia is an important genus encompassing a variety of species,\nincluding pathogenic strains as well as strains that promote plant growth. We\nhave carried out a global strategy, which combined two complementary\napproaches. The first one is genome guided with deep analysis of genome\nsequences and the second one is assay guided with experiments to support the\npredictions obtained in silico. This efficient screening for new secondary\nmetabolites, performed on 48 gapless genomes of Burkholderia species, revealed\na total of 161 clusters containing nonribosomal peptide synthetases (NRPSs),\nwith the potential to synthesize at least 11 novel products. Most of them are\nsiderophores or lipopeptides, two classes of products with potential\napplication in biocontrol. The strategy led to the identification, for the\nfirst time, of the cluster for cepaciachelin biosynthesis in the genome of\nBurkholderia ambifaria AMMD and a cluster corresponding to a new\nmalleobactin-like siderophore, called phymabactin, was identified in\nBurkholderia phymatum STM815 genome. In both cases, the siderophore was\nproduced when the strain was grown in iron-limited conditions. Elsewhere, the\ncluster for the antifungal burkholdin was detected in the genome of B.\nambifaria AMMD and also Burkholderia sp. KJ006. Burkholderia pseudomallei\nstrains harbor the genetic potential to produce a novel lipopeptide called\nburkhomycin, containing a peptidyl moiety of 12 monomers. A mixture of\nlipopeptides produced by Burkholderia rhizoxinica lowered the surface tension\nof the supernatant from 70 to 27 mN/m. The production of nonribosomal secondary\nmetabolites seems related to the three phylogenetic groups obtained from 16S\nrRNA sequences. Moreover, the genome-mining approach gave new insights into the\nnonribosomal synthesis exemplified by the identification of dual C/E domains in\nlipopeptide NRPSs, up to now essentially found in Pseudomonas strains.\n", "versions": [{"version": "v1", "created": "Fri, 18 Nov 2016 13:28:43 GMT"}], "update_date": "2016-11-21", "authors_parsed": [["Esmaeel", "Qassim", "", "CRIStAL, BONSAI"], ["Pupin", "Maude", "", "CRIStAL, BONSAI"], ["Kieu", "Nam Phuong", "", "CRIStAL, BONSAI"], ["Chataigné", "Gabrielle", "", "CRIStAL, BONSAI"], ["Béchet", "Max", "", "CRIStAL, BONSAI"], ["Deravel", "Jovana", "", "CRIStAL, BONSAI"], ["Krier", "François", "", "CRIStAL, BONSAI"], ["Höfte", "Monica", "", "CRIStAL, BONSAI"], ["Jacques", "Philippe", "", "CRIStAL, BONSAI"], ["Leclère", "Valérie", "", "CRIStAL, BONSAI"]]}, {"id": "1611.06127", "submitter": "Sai Teja Pusuluri", "authors": "Sai Teja Pusuluri, Alex Hunter Lang, Pankaj Mehta, Horacio Emilio\n  Castillo", "title": "Controlling energy landscapes with correlations between minima", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural network models have been used to construct energy landscapes for\nmodeling biological phenomena, in which the minima of the landscape correspond\nto memory patterns stored by the network. Here, we show that dynamic properties\nof those landscapes, such as the sizes of the basins of attraction and the\ndensity of stable and metastable states, depend strongly on the correlations\nbetween the memory patterns and can be altered by introducing hierarchical\nstructures. Our findings suggest dynamic features of energy landscapes can be\ncontrolled by choosing the correlations between patterns\n", "versions": [{"version": "v1", "created": "Thu, 17 Nov 2016 20:14:08 GMT"}], "update_date": "2016-11-21", "authors_parsed": [["Pusuluri", "Sai Teja", ""], ["Lang", "Alex Hunter", ""], ["Mehta", "Pankaj", ""], ["Castillo", "Horacio Emilio", ""]]}, {"id": "1611.06618", "submitter": "Nan Xu", "authors": "Nan Xu, Peter C. Doershuck", "title": "3D Reconstruction of Heterogeneous Virus Particles with Statistical\n  Geometric Symmetry", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 3-D reconstruction problems, the image data obtained from cryo electron\nmicroscopy is the projection of many heterogeneous instances of the object\nunder study (e.g., a virus). When the object is heterogeneous but has an\noverall symmetry, it is natural to describe the object as stochastic with\nsymmetrical statistics. This paper presents a maximum likelihood reconstruction\napproach which allows each object to lack symmetry while constraining the {\\it\nstatistics} of the ensemble of objects to have symmetry. This algorithm is\ndemonstrated on bacteriophage HK97 and is contrasted with an existing algorithm\nin which each object, while still heterogeneous, has the symmetry.\nReconstruction results show that the proposed algorithm eliminates\nlong-standing distortions in previous heterogeneity calculations associated\nwith symmetry axes, and provides estimates that make more biologically sense\nthan the estimates of existing algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 21 Nov 2016 00:38:23 GMT"}], "update_date": "2016-11-22", "authors_parsed": [["Xu", "Nan", ""], ["Doershuck", "Peter C.", ""]]}, {"id": "1611.06651", "submitter": "He Yang", "authors": "He Yang, Hengyong Yu and Ge Wang", "title": "Deep Learning for the Classification of Lung Nodules", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CV cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep learning, as a promising new area of machine learning, has attracted a\nrapidly increasing attention in the field of medical imaging. Compared to the\nconventional machine learning methods, deep learning requires no hand-tuned\nfeature extractor, and has shown a superior performance in many visual object\nrecognition applications. In this study, we develop a deep convolutional neural\nnetwork (CNN) and apply it to thoracic CT images for the classification of lung\nnodules. We present the CNN architecture and classification accuracy for the\noriginal images of lung nodules. In order to understand the features of lung\nnodules, we further construct new datasets, based on the combination of\nartificial geometric nodules and some transformations of the original images,\nas well as a stochastic nodule shape model. It is found that simplistic\ngeometric nodules cannot capture the important features of lung nodules.\n", "versions": [{"version": "v1", "created": "Mon, 21 Nov 2016 05:12:44 GMT"}, {"version": "v2", "created": "Sat, 26 Nov 2016 21:43:48 GMT"}], "update_date": "2016-11-29", "authors_parsed": [["Yang", "He", ""], ["Yu", "Hengyong", ""], ["Wang", "Ge", ""]]}, {"id": "1611.06889", "submitter": "Juan Miguel P\\'erez Rosas", "authors": "J. M. P\\'erez, M. Jofre, P. Mart\\'inez, M. A. Y\\'a\\~nez, V. Catalan,\n  A. Parker, M. Veldhuis, V. Pruneri", "title": "CMOS based image cytometry for detection of phytoplankton in ballast\n  water", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an image cytometer (I-CYT) for the analysis of phytoplankton in\nfresh and marine water environments. A linear quantification of cell numbers\nwas observed covering several orders of magnitude using cultures of Tetraselmis\nand Nannochloropsis measured by autofluorescence in a laboratory environment.\nWe assessed the functionality of the system outside the laboratory by\nphytoplankton quantification of samples taken from a marine water environment\n(Dutch Wadden Sea, The Netherlands) and a fresh water environment (Lake Ijssel,\nThe Netherlands). The I-CYT was also employed to study the effects of two\nballast water treatment systems (BWTS), based on chlorine electrolysis and UV\nsterilization, with the analysis including the vitality of the phytoplankton.\nFor comparative study and benchmarking of the I-CYT, a standard flow cytometer\nwas used. Our results prove a limit of detection (LOD) of 10 cells/ml with an\naccuracy between 0.7 and 0.5 log, and a correlation of 88.29% in quantification\nand 96.21% in vitality, with respect to the flow cytometry results.\n", "versions": [{"version": "v1", "created": "Mon, 21 Nov 2016 16:35:41 GMT"}], "update_date": "2016-11-23", "authors_parsed": [["Pérez", "J. M.", ""], ["Jofre", "M.", ""], ["Martínez", "P.", ""], ["Yáñez", "M. A.", ""], ["Catalan", "V.", ""], ["Parker", "A.", ""], ["Veldhuis", "M.", ""], ["Pruneri", "V.", ""]]}, {"id": "1611.07140", "submitter": "Ruoshi Yuan", "authors": "Ying Tang, Ruoshi Yuan, Gaowei Wang, Xiaomei Zhu, and Ping Ao", "title": "Potential landscape of high dimensional nonlinear stochastic dynamics\n  with large noise", "comments": "14 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantifying stochastic processes is essential to understand many natural\nphenomena, particularly in biology, including cell-fate decision in\ndevelopmental processes as well as genesis and progression of cancers. While\nvarious attempts have been made to construct potential landscape in high\ndimensional systems and to estimate rare transitions, they are practically\nlimited to cases where either noise is small or detailed balance condition\nholds. A general and practical approach to investigate nonequilibrium systems\ntypically subject to finite or large multiplicative noise and breakdown of\ndetailed balance remains elusive. Here, we formulate a computational framework\nto address this important problem. The current approach is based on a least\naction principle to efficiently calculate potential landscapes of systems under\narbitrary noise strength and without detailed balance. With the deterministic\nstability structure preserving A-type stochastic integration, the potential\nbarrier between different (local) stable stables is directly computable. We\ndemonstrate our approach in a numerically accurate manner through solvable\nexamples. We further apply the method to investigate the role of noise on tumor\nheterogeneity in a 38 dimensional network model for prostate cancer, and\nprovide a new strategy on controlling cell populations by manipulating noise\nstrength.\n", "versions": [{"version": "v1", "created": "Tue, 22 Nov 2016 03:49:45 GMT"}, {"version": "v2", "created": "Tue, 27 Jun 2017 05:50:39 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Tang", "Ying", ""], ["Yuan", "Ruoshi", ""], ["Wang", "Gaowei", ""], ["Zhu", "Xiaomei", ""], ["Ao", "Ping", ""]]}, {"id": "1611.07537", "submitter": "Matthew Friedlander D", "authors": "Matthew Friedlander and Adrian Dobra and Helene Massam and Laurent\n  Briollais", "title": "Analyzing Genome-wide Association Study Data with the R Package genMOSS", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.CO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The R package (R Core Team (2016)) genMOSS is specifically designed for the\nBayesian analysis of genome-wide association study data. The package implements\nthe mode oriented stochastic search (MOSS) procedure as well as a simple moving\nwindow approach to identify combinations of single nucleotide polymorphisms\nassociated with a response. The prior used in Bayesian computations is the\ngeneralized hyper Dirichlet.\n", "versions": [{"version": "v1", "created": "Tue, 22 Nov 2016 21:08:28 GMT"}], "update_date": "2016-11-24", "authors_parsed": [["Friedlander", "Matthew", ""], ["Dobra", "Adrian", ""], ["Massam", "Helene", ""], ["Briollais", "Laurent", ""]]}, {"id": "1611.07588", "submitter": "Ashkan Zeinalzadeh", "authors": "Ashkan Zeinalzadeh, Tom Wenska, Gordon Okimoto", "title": "A Neural Network Model to Classify Liver Cancer Patients Using Data\n  Expansion and Compression", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a neural network model to classify liver cancer patients into\nhigh-risk and low-risk groups using genomic data. Our approach provides a novel\ntechnique to classify big data sets using neural network models. We preprocess\nthe data before training the neural network models. We first expand the data\nusing wavelet analysis. We then compress the wavelet coefficients by mapping\nthem onto a new scaled orthonormal coordinate system. Then the data is used to\ntrain a neural network model that enables us to classify cancer patients into\ntwo different classes of high-risk and low-risk patients. We use the\nleave-one-out approach to build a neural network model. This neural network\nmodel enables us to classify a patient using genomic data as a high-risk or\nlow-risk patient without any information about the survival time of the\npatient. The results from genomic data analysis are compared with survival time\nanalysis. It is shown that the expansion and compression of data using wavelet\nanalysis and singular value decomposition (SVD) is essential to train the\nneural network model.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2016 00:11:41 GMT"}, {"version": "v2", "created": "Fri, 25 Nov 2016 18:02:21 GMT"}], "update_date": "2016-11-28", "authors_parsed": [["Zeinalzadeh", "Ashkan", ""], ["Wenska", "Tom", ""], ["Okimoto", "Gordon", ""]]}, {"id": "1611.07640", "submitter": "Yann Dujardin", "authors": "Yann Dujardin, Iadine Chades", "title": "Solving multi-objective optimization problems in conservation with the\n  reference point method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Managing biodiversity extinction crisis requires wise decision-making\nprocesses able to account for the limited of resources available. In most\ndecision problems in conservation biology, several conflicting objectives have\nto be taken into account. Most methods used in conservation either provide\nsuboptimal solutions or use strong assumptions about the decision-maker's\npreferences. Our paper reviews some of the existing approaches to solve\nmulti-objective decision problems and presents new multi-objective linear\nprogramming formulations of two multi-objective optimization problems in\nconservation, allowing the use of a reference point approach. Reference point\napproaches solve multi-objective optimization problems by interactively\nrepresenting the preferences of the decision-maker with a point in the criteria\nspace, called the reference point. We modelled and solved the following two\nconservation problems: a dynamic multi-species management problem under\nuncertainty and a spatial allocation resource management problem. Results show\nthat the reference point method outperforms classic methods while illustrating\nthe use of an interactive methodology for solving combinatorial problems with\nmultiple objectives. The method is general and can be adapted to a wide range\nof ecological combinatorial problems.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2016 04:56:18 GMT"}], "update_date": "2016-11-24", "authors_parsed": [["Dujardin", "Yann", ""], ["Chades", "Iadine", ""]]}, {"id": "1611.07677", "submitter": "Claus Metzner", "authors": "Patrick Krauss, Claus Metzner, Achim Schilling, Konstantin Tziridis,\n  Maximilian Traxdorf and Holger Schulze", "title": "A statistical method for analyzing and comparing spatiotemporal cortical\n  activation patterns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new statistical method to analyze multichannel steady-state\nlocal field potentials (LFP) recorded within different sensory cortices of\ndifferent rodent species. Our spatiotemporal multi-dimensional cluster\nstatistics (MCS) method enables statistical analyzing and comparing clusters of\ndata points in n-dimensional space. We demonstrate that using this approach\nstimulus-specific attractor-like spatiotemporal activity patterns can be\ndetected and be significantly different from each other during stimulation with\nlong-lasting stimuli. Our method may be applied to other types of multichannel\nneuronal data, like EEG, MEG or spiking responses and used for the development\nof new read-out algorithms of brain activity and by that opens new perspectives\nfor the development of brain-computer interfaces.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2016 08:08:17 GMT"}], "update_date": "2016-11-24", "authors_parsed": [["Krauss", "Patrick", ""], ["Metzner", "Claus", ""], ["Schilling", "Achim", ""], ["Tziridis", "Konstantin", ""], ["Traxdorf", "Maximilian", ""], ["Schulze", "Holger", ""]]}, {"id": "1611.07776", "submitter": "David Lukatsky", "authors": "Matan Goldshtein and David B. Lukatsky", "title": "Specificity-determining DNA triplet code for positioning of human\n  pre-initiation complex", "comments": null, "journal-ref": null, "doi": "10.1016/j.bpj.2017.04.023", "report-no": null, "categories": "q-bio.BM q-bio.GN q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion that transcription factors bind DNA only through specific,\nconsensus binding sites has been recently questioned. In a pioneering study by\nPugh and Venters no specific consensus motif for the positioning of the human\npre-initiation complex (PIC) has been identified. Here, we reveal that\nnonconsensus, statistical, DNA triplet code provides specificity for the\npositioning of the human PIC. In particular, we reveal a highly non-random,\nstatistical pattern of repetitive nucleotide triplets that correlates with the\ngenome-wide binding preferences of PIC measured by Chip-exo. We analyze the\ntriplet enrichment and depletion near the transcription start site (TSS) and\nidentify triplets that have the strongest effect on PIC-DNA nonconsensus\nbinding. Our results constitute a proof-of-concept for a new design principle\nfor protein-DNA recognition in the human genome, which can lead to a better\nmechanistic understanding of transcriptional regulation.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2016 13:07:49 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Goldshtein", "Matan", ""], ["Lukatsky", "David B.", ""]]}, {"id": "1611.07788", "submitter": "Ralf Metzler", "authors": "A. Godec and R. Metzler", "title": "Universal proximity effect in target search kinetics in the\n  few-encounter limit", "comments": "13 pages, 3 figures, RevTeX, Supplemental material in source files", "journal-ref": "Physical Review X 6, 041037 (2016)", "doi": null, "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When does a diffusing particle reach its target for the first time? This\nfirst-passage time (FPT) problem is central to the kinetics of molecular\nreactions in chemistry and molecular biology. Here we explain the behavior of\nsmooth FPT densities, for which all moments are finite, and demonstrate\nuniversal yet generally non-Poissonian long-time asymptotics for a broad\nvariety of transport processes. While Poisson-like asymptotics arise\ngenerically in the presence of an effective repulsion in the immediate vicinity\nof the target, a time-scale separation between direct and reflected indirect\ntrajectories gives rise to a universal proximity effect: Direct paths, heading\nmore or less straight from the point of release to the target, become typical\nand focused, with a narrow spread of the corresponding first passage times.\nConversely, statistically dominant indirect paths exploring the system size\ntend to be massively dissimilar. The initial distance to the target\nparticularly impacts gene regulatory or competitive stochastic processes, for\nwhich often few binding events determine the regulatory outcome. The proximity\neffect is independent of details of the transport, highlighting the robust\ncharacter of the FPT features uncovered here.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2016 13:41:35 GMT"}], "update_date": "2016-11-24", "authors_parsed": [["Godec", "A.", ""], ["Metzler", "R.", ""]]}, {"id": "1611.07801", "submitter": "Daniel Jacob", "authors": "Daniel Jacob, Catherine Deborde, Marie Lefebvre, Mickael Maucourt,\n  Anick Moing", "title": "NMRProcFlow: A graphical and interactive tool dedicated to 1D spectra\n  processing for NMR-based metabolomics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concerning NMR-based metabolomics, 1D spectra processing often requires an\nexpert eye for disentangling the intertwined peaks, and so far the best way is\nto proceed interactively with a spectra viewer. NMRProcFlow is a graphical and\ninteractive 1D NMR (1H \\& 13C) spectra processing tool dedicated to metabolic\nfingerprinting and targeted metabolomic, covering all spectra processing steps\nincluding baseline correction, chemical shift calibration, alignment. It does\nnot require programming skills. Biologists and NMR spectroscopists can easily\ninteract and develop synergies by visualizing the NMR spectra along with their\ncorresponding experimental-factor levels, thus setting a bridge between\nexperimental design and subsequent statistical analyses.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2016 13:59:57 GMT"}], "update_date": "2016-11-24", "authors_parsed": [["Jacob", "Daniel", ""], ["Deborde", "Catherine", ""], ["Lefebvre", "Marie", ""], ["Maucourt", "Mickael", ""], ["Moing", "Anick", ""]]}, {"id": "1611.08956", "submitter": "Amir Toor", "authors": "V Koparde, B Abdul Razzaq, T Suntum, R Sabo, A Scalora, M Serrano, M\n  Jameson-Lee, C Hall, D Kobulnicky, N Sheth, J Sampson, C Roberts, G Buck, M\n  Neale, A Toor", "title": "Dynamical System Modeling to Simulate Donor T Cell Response to Whole\n  Exome Sequencing-Derived Recipient Peptides: Understanding Randomness in\n  Clinical Outcomes Following Stem Cell Transplantation", "comments": null, "journal-ref": "PLoS One. 2017 Dec 1;12(12):e0187771", "doi": "10.1371/journal.pone.0187771", "report-no": null, "categories": "q-bio.QM q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Alloreactivity following stem cell transplantation (SCT) is difficult to\npredict in patients undergoing transplantation from HLA matched donors. In this\nstudy we performed whole exome sequencing of SCT donor-recipient pairs (DRP).\nThis allowed determination of entire library of alloreactive peptide sequences\nwhich would bind HLA class I molecules in each DRP. Utilizing the HLA binding\naffinity (IC50) and tissue expression levels of the parent proteins, an\naggregate donor T cell response to the recipient alloreactive peptides was\ncalculated using a vector-operator dynamical system model. Marked variability\nin the simulated CD8+ T cell responses was observed in all the donor recipient\npairs.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2016 02:02:40 GMT"}], "update_date": "2019-12-17", "authors_parsed": [["Koparde", "V", ""], ["Razzaq", "B Abdul", ""], ["Suntum", "T", ""], ["Sabo", "R", ""], ["Scalora", "A", ""], ["Serrano", "M", ""], ["Jameson-Lee", "M", ""], ["Hall", "C", ""], ["Kobulnicky", "D", ""], ["Sheth", "N", ""], ["Sampson", "J", ""], ["Roberts", "C", ""], ["Buck", "G", ""], ["Neale", "M", ""], ["Toor", "A", ""]]}, {"id": "1611.09086", "submitter": "Krishna Agarwal", "authors": "Krishna Agarwal and Radek Mach\\'a\\v{n}", "title": "Multiple Signal Classification Algorithm for super-resolution\n  fluorescence microscopy", "comments": "28 pages, 29 figures, Nature Communications, 2016", "journal-ref": null, "doi": "10.1038/ncomms13752", "report-no": null, "categories": "q-bio.QM physics.bio-ph physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Super-resolution microscopy is providing unprecedented insights into biology\nby resolving details much below the diffraction limit. State-of-the-art Single\nMolecule Localization Microscopy (SMLM) techniques for super-resolution are\nrestricted by long acquisition and computational times, or the need of special\nfluorophores or chemical environments. Here, we propose a novel statistical\nsuper-resolution technique of wide-field fluorescence microscopy called\nMUltiple SIgnal Classification ALgorithm (MUSICAL) which has several advantages\nover SMLM techniques. MUSICAL provides resolution down to at least 50 nm, has\nlow requirements on number of frames and excitation power and works even at\nhigh fluorophore concentrations. Further, it works with any fluorophore that\nexhibits blinking on the time scale of the recording. We compare imaging\nresults of MUSICAL with SMLM and four contemporary statistical super-resolution\nmethods for experiments of in-vitro actin filaments and datasets provided by\nindependent research groups. Results show comparable or superior performance of\nMUSICAL. We also demonstrate super-resolution at time scales of 245 ms (using\n49 frames at acquisition rate of 200 frames per second) in samples of live-cell\nmicrotubules and live-cell actin filaments.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2016 11:52:11 GMT"}, {"version": "v2", "created": "Sun, 11 Dec 2016 17:12:46 GMT"}], "update_date": "2016-12-13", "authors_parsed": [["Agarwal", "Krishna", ""], ["Macháň", "Radek", ""]]}, {"id": "1611.09410", "submitter": "Alain Franc", "authors": "J.-M. Frigerio, F. Rimet, A. Bouchez, E. Chancerel, P. Chaumeil, F.\n  Salin, S. Th\\'erond, M. Kahlert and A. Franc", "title": "diagno-syst: a tool for accurate inventories in metabarcoding", "comments": "16 pages, 3 tables, 2 figures, and 5 ancillary files", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metabarcoding on amplicons is rapidly expanding as a method to produce\nmolecular based inventories of microbial communities. Here, we work on\nfreshwater diatoms, which are microalgae possibly inventoried both on a\nmorphological and a molecular basis. We have developed an algorithm, in a\nprogram called diagno-syst, based a the notion of informative read, which\ncarries out supervised clustering of reads by mapping them exactly one by one\non all reads of a well curated and taxonomically annotated reference database.\nThis program has been run on a HPC (and HTC) infrastructure to address\ncomputation load. We compare optical and molecular based inventories on 10\nsamples from L\\'eman lake, and 30 from Swedish rivers. We track all\npossibilities of mismatches between both approaches, and compare the results\nwith standard pipelines (with heuristics) like Mothur. We find that the\ncomparison with optics is more accurate when using exact calculations, at the\nprice of a heavier computation load. It is crucial when studying the long tail\nof biodiversity, which may be overestimated by pipelines or algorithms using\nheuristics instead (more false positive). This work supports the analysis that\nthese methods will benefit from progress in, first, building an agreement\nbetween molecular based and morphological based systematics and, second, having\nas complete as possible publicly available reference databases.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2016 22:15:55 GMT"}], "update_date": "2016-11-30", "authors_parsed": [["Frigerio", "J. -M.", ""], ["Rimet", "F.", ""], ["Bouchez", "A.", ""], ["Chancerel", "E.", ""], ["Chaumeil", "P.", ""], ["Salin", "F.", ""], ["Thérond", "S.", ""], ["Kahlert", "M.", ""], ["Franc", "A.", ""]]}, {"id": "1611.09542", "submitter": "Felix Xiaofeng Ye", "authors": "Jeremiah Li, Felix X.-F. Ye, Hong Qian and Sui Huang", "title": "Time Dependent Saddle Node Bifurcation: Breaking Time and the Point of\n  No Return in a Non-Autonomous Model of Critical Transitions", "comments": null, "journal-ref": null, "doi": "10.1016/j.physd.2019.02.005", "report-no": null, "categories": "q-bio.QM math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a growing awareness that catastrophic phenomena in biology and\nmedicine can be mathematically represented in terms of saddle-node\nbifurcations. In particular, the term `tipping', or critical transition has in\nrecent years entered the discourse of the general public in relation to\necology, medicine, and public health. The saddle-node bifurcation and its\nassociated theory of catastrophe as put forth by Thom and Zeeman has seen\napplications in a wide range of fields including molecular biophysics,\nmesoscopic physics, and climate science. In this paper, we investigate a simple\nmodel of a non-autonomous system with a time-dependent parameter $p(\\tau)$ and\nits corresponding `dynamic' (time-dependent) saddle-node bifurcation by the\nmodern theory of non-autonomous dynamical systems. We show that the actual\npoint of no return for a system undergoing tipping can be significantly delayed\nin comparison to the {\\em breaking time} $\\hat{\\tau}$ at which the\ncorresponding autonomous system with a time-independent parameter $p_{a}=\np(\\hat{\\tau})$ undergoes a bifurcation. A dimensionless parameter\n$\\alpha=\\lambda p_0^3V^{-2}$ is introduced, in which $\\lambda$ is the curvature\nof the autonomous saddle-node bifurcation according to parameter $p(\\tau)$,\nwhich has an initial value of $p_{0}$ and a constant rate of change $V$. We\nfind that the breaking time $\\hat{\\tau}$ is always less than the actual point\nof no return $\\tau^*$ after which the critical transition is irreversible;\nspecifically, the relation $\\tau^*-\\hat{\\tau}\\simeq 2.338(\\lambda\nV)^{-\\frac{1}{3}}$ is analytically obtained. For a system with a small $\\lambda\nV$, there exists a significant window of opportunity $(\\hat{\\tau},\\tau^*)$\nduring which rapid reversal of the environment can save the system from\ncatastrophe.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2016 09:55:54 GMT"}, {"version": "v2", "created": "Wed, 11 Jan 2017 11:36:14 GMT"}, {"version": "v3", "created": "Thu, 3 Jan 2019 17:44:10 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Li", "Jeremiah", ""], ["Ye", "Felix X. -F.", ""], ["Qian", "Hong", ""], ["Huang", "Sui", ""]]}, {"id": "1611.09820", "submitter": "Saptarshi Das", "authors": "Shre Kumar Chatterjee, Saptarshi Das, Koushik Maharatna, Elisa Masi,\n  Luisa Santopolo, Stefano Mancuso and Andrea Vitaletti", "title": "Exploring Strategies for Classification of External Stimuli Using\n  Statistical Features of the Plant Electrical Response", "comments": "22 pages, 7 figures, 9 tables", "journal-ref": "Journal of the Royal Society Interface, vol. 12, no. 104, pp.\n  20141225, March 2015", "doi": "10.1098/rsif.2014.1225", "report-no": null, "categories": "physics.bio-ph q-bio.QM stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Plants sense their environment by producing electrical signals which in\nessence represent changes in underlying physiological processes. These\nelectrical signals, when monitored, show both stochastic and deterministic\ndynamics. In this paper, we compute 11 statistical features from the raw\nnon-stationary plant electrical signal time series to classify the stimulus\napplied (causing the electrical signal). By using different discriminant\nanalysis based classification techniques, we successfully establish that there\nis enough information in the raw electrical signal to classify the stimuli. In\nthe process, we also propose two standard features which consistently give good\nclassification results for three types of stimuli - Sodium Chloride (NaCl),\nSulphuric Acid (H2SO4) and Ozone (O3). This may facilitate reduction in the\ncomplexity involved in computing all the features for online classification of\nsimilar external stimuli in future.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2016 20:16:11 GMT"}], "update_date": "2016-11-30", "authors_parsed": [["Chatterjee", "Shre Kumar", ""], ["Das", "Saptarshi", ""], ["Maharatna", "Koushik", ""], ["Masi", "Elisa", ""], ["Santopolo", "Luisa", ""], ["Mancuso", "Stefano", ""], ["Vitaletti", "Andrea", ""]]}]