[{"id": "1704.00063", "submitter": "Zixuan Cang", "authors": "Zixuan Cang and Guo-Wei Wei", "title": "TopologyNet: Topology based deep convolutional neural networks for\n  biomolecular property predictions", "comments": "20 pages, 8 figures, 5 tables", "journal-ref": null, "doi": "10.1371/journal.pcbi.1005690", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although deep learning approaches have had tremendous success in image, video\nand audio processing, computer vision, and speech recognition, their\napplications to three-dimensional (3D) biomolecular structural data sets have\nbeen hindered by the entangled geometric complexity and biological complexity.\nWe introduce topology, i.e., element specific persistent homology (ESPH), to\nuntangle geometric complexity and biological complexity. ESPH represents 3D\ncomplex geometry by one-dimensional (1D) topological invariants and retains\ncrucial biological information via a multichannel image representation. It is\nable to reveal hidden structure-function relationships in biomolecules. We\nfurther integrate ESPH and convolutional neural networks to construct a\nmultichannel topological neural network (TopologyNet) for the predictions of\nprotein-ligand binding affinities and protein stability changes upon mutation.\nTo overcome the limitations to deep learning arising from small and noisy\ntraining sets, we present a multitask topological convolutional neural network\n(MT-TCNN). We demonstrate that the present TopologyNet architectures outperform\nother state-of-the-art methods in the predictions of protein-ligand binding\naffinities, globular protein mutation impacts, and membrane protein mutation\nimpacts.\n", "versions": [{"version": "v1", "created": "Fri, 31 Mar 2017 21:25:20 GMT"}], "update_date": "2017-11-01", "authors_parsed": [["Cang", "Zixuan", ""], ["Wei", "Guo-Wei", ""]]}, {"id": "1704.00351", "submitter": "Nina Golyandina E.", "authors": "Theodore Alexandrov, Nina Golyandina, David Holloway, Alex Shlemov,\n  and Alexander Spirov", "title": "Two-exponential models of gene expression patterns for noisy\n  experimental data", "comments": null, "journal-ref": "Journal of Computational Biology (2018) Vol. 25, No. 11, p.\n  1220-1230", "doi": "10.1089/cmb.2017.0063", "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Spatial pattern formation of the primary anterior-posterior\nmorphogenetic gradient of the transcription factor Bicoid (Bcd) has been\nstudied experimentally and computationally for many years. Bcd specifies\npositional information for the downstream segmentation genes, affecting the fly\nbody plan. More recently, a number of researchers have focused on the\npatterning dynamics of the underlying bcd mRNA gradient, which is translated\ninto Bcd protein. New, more accurate techniques for visualizing bcd mRNA need\nto be combined with quantitative signal extraction techniques to reconstruct\nthe bcd mRNA distribution.\n  Results: Here, we present a robust technique for quantifying gradients with a\ntwo-exponential model. This approach: 1) has natural, biologically relevant\nparameters; and 2) is invariant to linear transformations of the data which can\narise due to variation in experimental conditions (e.g. microscope settings,\nnon-specific background signal). This allows us to quantify bcd mRNA gradient\nvariability from embryo to embryo (important for studying the robustness of\ndevelopmental regulatory networks); sort out atypical gradients; and classify\nembryos to developmental stage by quantitative gradient parameters.\n", "versions": [{"version": "v1", "created": "Sun, 2 Apr 2017 19:09:39 GMT"}], "update_date": "2019-06-27", "authors_parsed": [["Alexandrov", "Theodore", ""], ["Golyandina", "Nina", ""], ["Holloway", "David", ""], ["Shlemov", "Alex", ""], ["Spirov", "Alexander", ""]]}, {"id": "1704.00572", "submitter": "Christoph Herold", "authors": "Christoph Herold", "title": "Mapping of Deformation to Apparent Young's Modulus in Real-Time\n  Deformability Cytometry", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As described in the work of Mietke et al. (1) the deformation (defined as 1 -\ncircularity [see (2)]) of a purely elastic, spherical object deformed in a\nreal-time deformability cytometry (RT-DC) experiment can be mapped to its\napparent Young's Modulus. This note is supposed to help a fast and correct\nmapping of RT-DC results - namely, deformation and size - to values of the\napparent Young's Modulus E.\n", "versions": [{"version": "v1", "created": "Mon, 3 Apr 2017 13:29:24 GMT"}], "update_date": "2017-04-04", "authors_parsed": [["Herold", "Christoph", ""]]}, {"id": "1704.00793", "submitter": "Jinghao Lu", "authors": "Jinghao Lu, Chunyuan Li, Fan Wang", "title": "Seeds Cleansing CNMF for Spatiotemporal Neural Signals Extraction of\n  Miniscope Imaging Data", "comments": "14 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Miniscope calcium imaging is increasingly being used to monitor large\npopulations of neuronal activities in freely behaving animals. However, due to\nthe high background and low signal-to-noise ratio of the single-photon based\nimaging used in this technique, extraction of neural signals from the large\nnumbers of imaged cells automatically has remained challenging. Here we\ndescribe a highly accurate framework for automatically identifying activated\nneurons and extracting calcium signals from the miniscope imaging data, seeds\ncleansing Constrained Nonnegative Matrix Factorization (sc-CNMF). This sc-CNMF\nextends the conventional CNMF with two new modules: i) a neural enhancing\nmodule to overcome miniscope-specific limitations, and ii) a seeds cleansing\nmodule combining LSTM to rigorously select and cleanse the set of seeds for\ndetecting regions-of-interest. Our sc-CNMF yields highly stable and superior\nperformance in analyzing miniscope calcium imaging data compared to existing\nmethods.\n", "versions": [{"version": "v1", "created": "Mon, 3 Apr 2017 20:10:00 GMT"}], "update_date": "2017-04-05", "authors_parsed": [["Lu", "Jinghao", ""], ["Li", "Chunyuan", ""], ["Wang", "Fan", ""]]}, {"id": "1704.00878", "submitter": "Shixiang Wan", "authors": "Shixiang Wan, Quan Zou", "title": "HAlign-II: efficient ultra-large multiple sequence alignment and\n  phylogenetic tree reconstruction with distributed and parallel computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple sequence alignment (MSA) plays a key role in biological sequence\nanalyses, especially in phylogenetic tree construction. Extreme increase in\nnext-generation sequencing results in shortage of efficient ultra-large\nbiological sequence alignment approaches for coping with different sequence\ntypes. Distributed and parallel computing represents a crucial technique for\naccelerating ultra-large sequence analyses. Based on HAlign and Spark\ndistributed computing system, we implement a highly cost-efficient and\ntime-efficient HAlign-II tool to address ultra-large multiple biological\nsequence alignment and phylogenetic tree construction. After comparing with\nmost available state-of-the-art methods, our experimental results indicate the\nfollowing: 1) HAlign-II can efficiently carry out MSA and construct\nphylogenetic trees with ultra-large biological sequences; 2) HAlign-II shows\nextremely high memory efficiency and scales well with increases in computing\nresource; 3) HAlign-II provides a user-friendly web server based on our\ndistributed computing infrastructure. HAlign-II with open-source codes and\ndatasets was established at http://lab.malab.cn/soft/halign.\n", "versions": [{"version": "v1", "created": "Tue, 4 Apr 2017 05:49:04 GMT"}], "update_date": "2017-04-05", "authors_parsed": [["Wan", "Shixiang", ""], ["Zou", "Quan", ""]]}, {"id": "1704.01297", "submitter": "Sawon  Pratiher", "authors": "S Pratiher, S Chatterjee, R Bose", "title": "Automated Diagnosis of Epilepsy Employing Multifractal Detrended\n  Fluctuation Analysis Based Features", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV nlin.AO nlin.CD q-bio.QM stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This contribution reports an application of MultiFractal Detrended\nFluctuation Analysis, MFDFA based novel feature extraction technique for\nautomated detection of epilepsy. In fractal geometry, Multifractal Detrended\nFluctuation Analysis MFDFA is a popular technique to examine the\nself-similarity of a nonlinear, chaotic and noisy time series. In the present\nresearch work, EEG signals representing healthy, interictal (seizure free) and\nictal activities (seizure) are acquired from an existing available database.\nThe acquired EEG signals of different states are at first analyzed using MFDFA.\nTo requisite the time series singularity quantification at local and global\nscales, a novel set of fourteen different features. Suitable feature ranking\nemploying students t-test has been done to select the most statistically\nsignificant features which are henceforth being used as inputs to a support\nvector machines (SVM) classifier for the classification of different EEG\nsignals. Eight different classification problems have been presented in this\npaper and it has been observed that the overall classification accuracy using\nMFDFA based features are reasonably satisfactory for all classification\nproblems. The performance of the proposed method are also found to be quite\ncommensurable and in some cases even better when compared with the results\npublished in existing literature studied on the similar data set.\n", "versions": [{"version": "v1", "created": "Wed, 5 Apr 2017 08:00:14 GMT"}], "update_date": "2017-04-06", "authors_parsed": [["Pratiher", "S", ""], ["Chatterjee", "S", ""], ["Bose", "R", ""]]}, {"id": "1704.01395", "submitter": "Luca Quaroni", "authors": "Luca Quaroni, Katarzyna Pogoda, Joanna-Wiltowska Zuber, Wojciech\n  Kwiatek", "title": "Mid-Infrared Spectroscopy and Microscopy of Subcellular Structures in\n  Eukaryotic Cells with Atomic Force Microscopy - Infrared Spectroscopy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Atomic Force Microscopy - Infrared (AFM-IR) spectroscopy allows spectroscopic\nstudies in the mid-infrared spectral region with a spatial resolution better\nthan 50 nm. We show that the high spatial resolution can be used to perform\nspectroscopic and imaging studies at the subcellular level in fixed eukaryotic\ncells. We collect AFM-IR images of subcellular structures that include lipid\ndroplets, vesicles and cytoskeletal filaments, by relying on the intrinsic\ncontrast from IR light absorption. We also obtain AFM-IR absorption spectra of\nindividual structures. Most spectra show features that are recognizable in the\nIR absorption spectra of cells and tissue obtained with FTIR technology,\nincluding absorption bands characteristic of phospholipids and polypeptides. We\nalso observe sharp spectral features that we attribute to the nonlinear\nphotothermal response of the system and we propose that they can be used to\nperform sensitive spectroscopy on the nanoscale.\n", "versions": [{"version": "v1", "created": "Wed, 5 Apr 2017 13:09:10 GMT"}], "update_date": "2017-04-06", "authors_parsed": [["Quaroni", "Luca", ""], ["Pogoda", "Katarzyna", ""], ["Zuber", "Joanna-Wiltowska", ""], ["Kwiatek", "Wojciech", ""]]}, {"id": "1704.01418", "submitter": "Jeremy Sumner", "authors": "Jeremy G Sumner", "title": "Multiplicatively closed Markov models must form Lie algebras", "comments": "v2: 6 pages. Minimality condition included in Property 0 to close gap\n  in the proof of main result. To appear in the ANZIAM Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR math.ST q-bio.PE q-bio.QM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that the probability substitution matrices obtained from a\ncontinuous-time Markov chain form a multiplicatively closed set if and only if\nthe rate matrices associated to the chain form a linear space spanning a Lie\nalgebra. The key original contribution we make is to overcome an obstruction,\ndue to the presence of inequalities that are unavoidable in the probabilistic\napplication, that prevents free manipulation of terms in the\nBaker-Campbell-Haursdorff formula.\n", "versions": [{"version": "v1", "created": "Tue, 4 Apr 2017 02:24:09 GMT"}, {"version": "v2", "created": "Fri, 1 Sep 2017 03:07:40 GMT"}], "update_date": "2017-09-04", "authors_parsed": [["Sumner", "Jeremy G", ""]]}, {"id": "1704.01841", "submitter": "Greg Gloor Dr", "authors": "Jia R. Wu, Jean M. Macklaim, Briana L. Genge, and Gregory B. Gloor", "title": "Finding the centre: corrections for asymmetry in high-throughput\n  sequencing datasets", "comments": "Preliminary conference paper for CoDaWork 2017. Outlines asymmetry\n  correction incorporated into the Bioconductor package ALDEx2", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High throughput sequencing is a technology that allows for the generation of\nmillions of reads of genomic data regarding a study of interest, and data from\nhigh throughput sequencing platforms are usually count compositions. Subsequent\nanalysis of such data can yield information on tran- scription profiles,\nmicrobial diversity, or even relative cellular abundance in culture. Because of\nthe high cost of acquisition, the data are usually sparse, and always contain\nfar fewer observations than variables. However, an under-appreciated pathology\nof these data are their often unbalanced nature: i.e, there is often systematic\nvariation between groups simply due to presence or absence of features, and\nthis variation is important to the biological interpretation of the data. A\nsimple example would be comparing transcriptomes of yeast cells with and\nwithout a gene knockout. This causes samples in the comparison groups to\nexhibit widely varying centres. This work extends a previously described\nlog-ratio transformation method that allows for variable comparisons between\nsamples in a Bayesian compositional context. We demonstrate the pathology in\nmodelled and real unbalanced experimental designs to show how this dramatically\ncauses both false negative and false positive inference. We then introduce\nseveral approaches to demonstrate how the pathologies can be addressed. An\nextreme example is presented where only the use of a predefined basis is\nappropriate. The transformations are implemented as an extension to a general\ncompositional data analysis tool known as ALDEx2 which is available on\nBioconductor.\n", "versions": [{"version": "v1", "created": "Thu, 6 Apr 2017 13:41:48 GMT"}], "update_date": "2017-04-07", "authors_parsed": [["Wu", "Jia R.", ""], ["Macklaim", "Jean M.", ""], ["Genge", "Briana L.", ""], ["Gloor", "Gregory B.", ""]]}, {"id": "1704.02007", "submitter": "We Chen", "authors": "Zhe Sun, Ting Wang, Ke Deng, Xiao-Feng Wang, Robert Lafyatis, Ying\n  Ding, Ming Hu, Wei Chen", "title": "DIMM-SC: A Dirichlet mixture model for clustering droplet-based single\n  cell transcriptomic data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Single cell transcriptome sequencing (scRNA-Seq) has become a\nrevolutionary tool to study cellular and molecular processes at single cell\nresolution. Among existing technologies, the recently developed droplet-based\nplatform enables efficient parallel processing of thousands of single cells\nwith direct counting of transcript copies using Unique Molecular Identifier\n(UMI). Despite the technology advances, statistical methods and computational\ntools are still lacking for analyzing droplet-based scRNA-Seq data.\nParticularly, model-based approaches for clustering large-scale single cell\ntranscriptomic data are still under-explored. Methods: We developed DIMM-SC, a\nDirichlet Mixture Model for clustering droplet-based Single Cell transcriptomic\ndata. This approach explicitly models UMI count data from scRNA-Seq experiments\nand characterizes variations across different cell clusters via a Dirichlet\nmixture prior. An expectation-maximization algorithm is used for parameter\ninference. Results: We performed comprehensive simulations to evaluate DIMM-SC\nand compared it with existing clustering methods such as K-means, CellTree and\nSeurat. In addition, we analyzed public scRNA-Seq datasets with known cluster\nlabels and in-house scRNA-Seq datasets from a study of systemic sclerosis with\nprior biological knowledge to benchmark and validate DIMM-SC. Both simulation\nstudies and real data applications demonstrated that overall, DIMM-SC achieves\nsubstantially improved clustering accuracy and much lower clustering\nvariability compared to other existing clustering methods. More importantly, as\na model-based approach, DIMM-SC is able to quantify the clustering uncertainty\nfor each single cell, facilitating rigorous statistical inference and\nbiological interpretations, which are typically unavailable from existing\nclustering methods.\n", "versions": [{"version": "v1", "created": "Thu, 6 Apr 2017 20:01:29 GMT"}], "update_date": "2017-04-10", "authors_parsed": [["Sun", "Zhe", ""], ["Wang", "Ting", ""], ["Deng", "Ke", ""], ["Wang", "Xiao-Feng", ""], ["Lafyatis", "Robert", ""], ["Ding", "Ying", ""], ["Hu", "Ming", ""], ["Chen", "Wei", ""]]}, {"id": "1704.02069", "submitter": "Eric Lock", "authors": "Adam Kaplan and Eric F. Lock", "title": "Prediction with Dimension Reduction of Multiple Molecular Data Sources\n  for Patient Survival", "comments": "11 pages, 9 figures", "journal-ref": "Cancer Informatics, 16: 1-11, 2017", "doi": "10.1177/1176935117718517", "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Predictive modeling from high-dimensional genomic data is often preceded by a\ndimension reduction step, such as principal components analysis (PCA). However,\nthe application of PCA is not straightforward for multi-source data, wherein\nmultiple sources of 'omics data measure different but related biological\ncomponents. In this article we utilize recent advances in the dimension\nreduction of multi-source data for predictive modeling. In particular, we apply\nexploratory results from Joint and Individual Variation Explained (JIVE), an\nextension of PCA for multi-source data, for prediction of differing response\ntypes. We conduct illustrative simulations to illustrate the practical\nadvantages and interpretability of our approach. As an application example we\nconsider predicting survival for Glioblastoma Multiforme (GBM) patients from\nthree data sources measuring mRNA expression, miRNA expression, and DNA\nmethylation. We also introduce a method to estimate JIVE scores for new samples\nthat were not used in the initial dimension reduction, and study its\ntheoretical properties; this method is implemented in the R package R.JIVE on\nCRAN, in the function 'jive.predict'.\n", "versions": [{"version": "v1", "created": "Fri, 7 Apr 2017 02:01:32 GMT"}, {"version": "v2", "created": "Mon, 17 Jul 2017 22:13:32 GMT"}], "update_date": "2017-07-19", "authors_parsed": [["Kaplan", "Adam", ""], ["Lock", "Eric F.", ""]]}, {"id": "1704.02577", "submitter": "Myrl Marmarelis", "authors": "Myrl G. Marmarelis", "title": "Efficient and Robust Polylinear Analysis of Noisy Time Series", "comments": "6 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A method is proposed to generate an optimal fit of a number of connected\nlinear trend segments onto time-series data. To be able to efficiently handle\nmany lines, the method employs a stochastic search procedure to determine\noptimal transition point locations. Traditional methods use exhaustive grid\nsearches, which severely limit the scale of the problems for which they can be\nutilized. The proposed approach is tried against time series with severe noise\nto demonstrate its robustness, and then it is applied to real medical data as\nan illustrative example.\n", "versions": [{"version": "v1", "created": "Sun, 9 Apr 2017 09:15:15 GMT"}], "update_date": "2017-04-11", "authors_parsed": [["Marmarelis", "Myrl G.", ""]]}, {"id": "1704.02846", "submitter": "Sael Lee", "authors": "Jaya Thomas and Lee Sael", "title": "Multi-Kernel LS-SVM Based Bio-Clinical Data Integration: Applications to\n  Ovarian Cancer", "comments": "27 pages, 7 figures, extends the work presented in 6th International\n  Conference on Emerging Databases, accepted for publication in the IJDBM", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The medical research facilitates to acquire a diverse type of data from the\nsame individual for particular cancer. Recent studies show that utilizing such\ndiverse data results in more accurate predictions. The major challenge faced is\nhow to utilize such diverse data sets in an effective way. In this paper, we\nintroduce a multiple kernel based pipeline for integrative analysis of\nhigh-throughput molecular data (somatic mutation, copy number alteration, DNA\nmethylation and mRNA) and clinical data. We apply the pipeline on Ovarian\ncancer data from TCGA. After multiple kernels have been generated from the\nweighted sum of individual kernels, it is used to stratify patients and predict\nclinical outcomes. We examine the survival time, vital status, and neoplasm\ncancer status of each subtype to verify how well they cluster. We have also\nexamined the power of molecular and clinical data in predicting dichotomized\noverall survival data and to classify the tumor grade for the cancer samples.\nIt was observed that the integration of various data types yields higher\nlog-rank statistics value. We were also able to predict clinical status with\nhigher accuracy as compared to using individual data types.\n", "versions": [{"version": "v1", "created": "Mon, 10 Apr 2017 13:15:36 GMT"}, {"version": "v2", "created": "Tue, 10 Oct 2017 05:17:06 GMT"}], "update_date": "2017-10-11", "authors_parsed": [["Thomas", "Jaya", ""], ["Sael", "Lee", ""]]}, {"id": "1704.03002", "submitter": "Peter Schuck", "authors": "Peter Schuck and Sumit K. Chaturvedi", "title": "Sedimentation of rapidly interacting multicomponent systems", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.soft physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The biophysical analysis of dynamically formed multi-protein complexes in\nsolution presents a formidable technical challenge. Sedimentation velocity (SV)\nanalytical ultracentrifugation achieves strongly size-dependent hydrodynamic\nresolution of different size species, and can be combined with multi-component\ndetection by exploiting different spectral properties or temporally modulated\nsignals from photoswitchable proteins. Coexisting complexes arising from self-\nor hetero-associations that can be distinguished in SV allow measurement of\ntheir stoichiometry, affinity, and cooperativity. However, assemblies that are\nshort-lived on the time-scale of sedimentation (t1/2 < 100 sec) will exhibit an\nas of yet unexplored pattern of sedimentation boundaries governed by coupled\nco-migration of the entire system. Here, we present a theory for\nmulti-component sedimentation of rapidly interacting systems, which reveals\nsimple underlying physical principles, offers a quantitative framework for\nanalysis, thereby extending the dynamic range of SV for studying\nmulti-component interactions\n", "versions": [{"version": "v1", "created": "Mon, 10 Apr 2017 18:24:09 GMT"}], "update_date": "2017-04-12", "authors_parsed": [["Schuck", "Peter", ""], ["Chaturvedi", "Sumit K.", ""]]}, {"id": "1704.03009", "submitter": "Jay Newby", "authors": "Jay M. Newby, Alison M. Schaefer, Phoebe T. Lee, M. Gregory Forest,\n  and Samuel K. Lai", "title": "Convolutional neural networks automate detection for tracking of\n  submicron scale particles in 2D and 3D", "comments": null, "journal-ref": null, "doi": "10.1073/pnas.1804420115", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Particle tracking is a powerful biophysical tool that requires conversion of\nlarge video files into position time series, i.e. traces of the species of\ninterest for data analysis. Current tracking methods, based on a limited set of\ninput parameters to identify bright objects, are ill-equipped to handle the\nspectrum of spatiotemporal heterogeneity and poor signal-to-noise ratios\ntypically presented by submicron species in complex biological environments.\nExtensive user involvement is frequently necessary to optimize and execute\ntracking methods, which is not only inefficient but introduces user bias. To\ndevelop a fully automated tracking method, we developed a convolutional neural\nnetwork for particle localization from image data, comprised of over 6,000\nparameters, and employed machine learning techniques to train the network on a\ndiverse portfolio of video conditions. The neural network tracker provides\nunprecedented automation and accuracy, with exceptionally low false positive\nand false negative rates on both 2D and 3D simulated videos and 2D experimental\nvideos of difficult-to-track species.\n", "versions": [{"version": "v1", "created": "Mon, 10 Apr 2017 18:39:46 GMT"}, {"version": "v2", "created": "Sat, 6 Oct 2018 18:32:09 GMT"}], "update_date": "2018-10-09", "authors_parsed": [["Newby", "Jay M.", ""], ["Schaefer", "Alison M.", ""], ["Lee", "Phoebe T.", ""], ["Forest", "M. Gregory", ""], ["Lai", "Samuel K.", ""]]}, {"id": "1704.03548", "submitter": "Peng Yang", "authors": "Peng Yang", "title": "Computational Approaches for Disease Gene Identification", "comments": "PhD thesis, Nanyang Technological University, May 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Identifying disease genes from human genome is an important and fundamental\nproblem in biomedical research. Despite many publications of machine learning\nmethods applied to discover new disease genes, it still remains a challenge\nbecause of the pleiotropy of genes, the limited number of confirmed disease\ngenes among whole genome and the genetic heterogeneity of diseases. Recent\napproaches have applied the concept of 'guilty by association' to investigate\nthe association between a disease phenotype and its causative genes, which\nmeans that candidate genes with similar characteristics as known disease genes\nare more likely to be associated with diseases. However, due to the imbalance\nissues (few genes are experimentally confirmed as disease related genes within\nhuman genome) in disease gene identification, semi-supervised approaches, like\nlabel propagation approaches and positive-unlabeled learning, are used to\nidentify candidate disease genes via making use of unknown genes for training -\ntypically in the scenario of a small amount of confirmed disease genes (labeled\ndata) with a large amount of unknown genome (unlabeled data). The performance\nof Disease gene prediction models are limited by potential bias of single\nlearning models and incompleteness and noise of single biological data sources,\ntherefore ensemble learning models are applied via combining multiple diverse\nbiological sources and learning models to obtain better predictive performance.\nIn this thesis, we propose three computational models for identifying candidate\ndisease genes.\n", "versions": [{"version": "v1", "created": "Tue, 11 Apr 2017 21:52:39 GMT"}, {"version": "v2", "created": "Sun, 21 May 2017 22:11:31 GMT"}], "update_date": "2017-05-23", "authors_parsed": [["Yang", "Peng", ""]]}, {"id": "1704.03834", "submitter": "Sael Lee", "authors": "Jaya Thomas and Lee Sael", "title": "Deep Neural Network Based Precursor microRNA Prediction on Eleven\n  Species", "comments": "6 pages, 2 figures, extended from BigComp2017 short paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MicroRNA (miRNA) are small non-coding RNAs that regulates the gene expression\nat the post-transcriptional level. Determining whether a sequence segment is\nmiRNA is experimentally challenging. Also, experimental results are sensitive\nto the experimental environment. These limitations inspire the development of\ncomputational methods for predicting the miRNAs. We propose a deep learning\nbased classification model, called DP-miRNA, for predicting precursor miRNA\nsequence that contains the miRNA sequence. The feature set based Restricted\nBoltzmann Machine method, which we call DP-miRNA, uses 58 features that are\ncategorized into four groups: sequence features, folding measures, stem-loop\nfeatures and statistical feature. We evaluate the performance of the DP-miRNA\non eleven twelve data sets of varying species, including the human. The deep\nneural network based classification outperformed support vector machine, neural\nnetwork, naive Baye's classifiers, k-nearest neighbors, random forests, and a\nhybrid system combining support vector machine and genetic algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 10 Apr 2017 13:38:01 GMT"}], "update_date": "2017-04-13", "authors_parsed": [["Thomas", "Jaya", ""], ["Sael", "Lee", ""]]}, {"id": "1704.03863", "submitter": "Jordan Horowitz", "authors": "Jordan M. Horowitz and Rahul V. Kulkarni", "title": "Stochastic gene expression conditioned on large deviations", "comments": "10 pages, 2 figures, to appear in Physical Biology", "journal-ref": "Phys. Biol. 14 (2017) 03LT01", "doi": "10.1088/1478-3975/aa6d89", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The intrinsic stochasticity of gene expression can give rise to large\nfluctuations and rare events that drive phenotypic variation in a population of\ngenetically identical cells. Characterizing the fluctuations that give rise to\nsuch rare events motivates the analysis of large deviations in stochastic\nmodels of gene expression. Recent developments in non-equilibrium statistical\nmechanics have led to a framework for analyzing Markovian processes conditioned\non rare events and for representing such processes by conditioning-free driven\nMarkovian processes. We use this framework, in combination with approaches\nbased on queueing theory, to analyze a general class of stochastic models of\ngene expression. Modeling gene expression as a Batch Markovian Arrival Process\n(BMAP), we derive exact analytical results quantifying large deviations of\ntime-integrated random variables such as promoter activity fluctuations. We\nfind that the conditioning-free driven process can also be represented by a\nBMAP that has the same form as the original process, but with renormalized\nparameters. The results obtained can be used to quantify the likelihood of\nlarge deviations, to characterize system fluctuations conditional on rare\nevents and to identify combinations of model parameters that can give rise to\ndynamical phase transitions in system dynamics.\n", "versions": [{"version": "v1", "created": "Wed, 12 Apr 2017 17:54:26 GMT"}], "update_date": "2017-05-24", "authors_parsed": [["Horowitz", "Jordan M.", ""], ["Kulkarni", "Rahul V.", ""]]}, {"id": "1704.03947", "submitter": "Hamed Azami", "authors": "Hamed Azami, Alberto Fernandez, and Javier Escudero", "title": "Multivariate Multiscale Dispersion Entropy of Biomedical Times Series", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objective: Due to the non-linearity of numerous biomedical signals,\nnon-linear analysis of multi-channel time series, notably multivariate\nmultiscale entropy (mvMSE), has been extensively used in biomedical signal\nprocessing. However, mvMSE has three drawbacks: 1) mvMSE values are either\nundefined or unreliable for short signals; 2) mvMSE is not fast enough for\nreal-time applications; and 3) the computation of mvMSE for signals with a\nlarge number of channels requires the storage of a huge number of elements.\nMethods: To deal with these problems and improve the stability of mvMSE, we\nintroduce multivariate multiscale dispersion entropy (MDE - mvMDE) as an\nextension of our recently developed MDE, to quantify the complexity of\nmultivariate time series. Results: We assess mvMDE, in comparison with mvMSE\nand multivariate multiscale fuzzy entropy (mvMFE), on correlated and\nuncorrelated multi-channel noise signals, bivariate autoregressive processes,\nand three biomedical datasets. The results show that mvMDE takes into account\ndependencies in patterns across both the time and spatial domains. The mvMDE,\nmvMSE, and mvMFE methods are consistent in that they lead to similar\nconclusions about the underlying physiological conditions. However, the\nproposed mvMDE discriminates various physiological states of the biomedical\nrecordings better than mvMSE and mvMFE. In addition, for both the short and\nlong time series, the mvMDE-based results are noticeably more stable than the\nmvMSE- and mvMFE-based ones. Conclusion: For short multivariate time series,\nmvMDE, unlike mvMSE, does not result in undefined values. Furthermore, mvMDE is\nnoticeably faster than mvMFE and mvMSE and also needs to store a considerably\nsmaller number of elements. Significance: Due to its ability to detect\ndifferent kinds of dynamics of multivariate signals, mvMDE has great potential\nto analyse various physiological signals.\n", "versions": [{"version": "v1", "created": "Wed, 12 Apr 2017 22:37:07 GMT"}], "update_date": "2017-04-14", "authors_parsed": [["Azami", "Hamed", ""], ["Fernandez", "Alberto", ""], ["Escudero", "Javier", ""]]}, {"id": "1704.04039", "submitter": "Vladimir Golkov", "authors": "Vladimir Golkov, Marcin J. Skwark, Atanas Mirchev, Georgi Dikov,\n  Alexander R. Geanes, Jeffrey Mendenhall, Jens Meiler and Daniel Cremers", "title": "3D Deep Learning for Biological Function Prediction from Physical Fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM cs.LG q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Predicting the biological function of molecules, be it proteins or drug-like\ncompounds, from their atomic structure is an important and long-standing\nproblem. Function is dictated by structure, since it is by spatial interactions\nthat molecules interact with each other, both in terms of steric\ncomplementarity, as well as intermolecular forces. Thus, the electron density\nfield and electrostatic potential field of a molecule contain the \"raw\nfingerprint\" of how this molecule can fit to binding partners. In this paper,\nwe show that deep learning can predict biological function of molecules\ndirectly from their raw 3D approximated electron density and electrostatic\npotential fields. Protein function based on EC numbers is predicted from the\napproximated electron density field. In another experiment, the activity of\nsmall molecules is predicted with quality comparable to state-of-the-art\ndescriptor-based methods. We propose several alternative computational models\nfor the GPU with different memory and runtime requirements for different sizes\nof molecules and of databases. We also propose application-specific\nmulti-channel data representations. With future improvements of training\ndatasets and neural network settings in combination with complementary\ninformation sources (sequence, genomic context, expression level), deep\nlearning can be expected to show its generalization power and revolutionize the\nfield of molecular function prediction.\n", "versions": [{"version": "v1", "created": "Thu, 13 Apr 2017 09:11:23 GMT"}], "update_date": "2017-04-14", "authors_parsed": [["Golkov", "Vladimir", ""], ["Skwark", "Marcin J.", ""], ["Mirchev", "Atanas", ""], ["Dikov", "Georgi", ""], ["Geanes", "Alexander R.", ""], ["Mendenhall", "Jeffrey", ""], ["Meiler", "Jens", ""], ["Cremers", "Daniel", ""]]}, {"id": "1704.04105", "submitter": "Chao Wang", "authors": "Chao Wang and Tie Zhou", "title": "On Iterative Algorithms for Quantitative Photoacoustic Tomography in the\n  Radiative Transport Regime", "comments": "21 pages, 44 figures", "journal-ref": null, "doi": "10.1088/1361-6420/aa89c5", "report-no": null, "categories": "q-bio.QM math.NA math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we describe the numerical reconstruction method for\nquantitative photoacoustic tomography (QPAT) based on the radiative transfer\nequation (RTE), which models light propagation more accurately than diffusion\napproximation (DA). We investigate the reconstruction of absorption coefficient\nand/or scattering coefficient of biological tissues. Given the scattering\ncoefficient, an improved fixed-point iterative method is proposed to retrieve\nthe absorption coefficient for its cheap computational cost. And we prove the\nconvergence. To retrieve two coefficients simultaneously, Barzilai-Borwein (BB)\nmethod is applied. Since the reconstruction of optical coefficients involves\nthe solution of original and adjoint RTEs in the framework of optimization, an\nefficient solver with high accuracy is improved from~\\cite{Gao}. Simulation\nexperiments illustrate that the improved fixed-point iterative method and the\nBB method are the comparative methods for QPAT in two cases.\n", "versions": [{"version": "v1", "created": "Fri, 7 Apr 2017 05:27:34 GMT"}, {"version": "v2", "created": "Sat, 20 May 2017 03:23:09 GMT"}, {"version": "v3", "created": "Sat, 9 Sep 2017 08:17:36 GMT"}], "update_date": "2017-10-25", "authors_parsed": [["Wang", "Chao", ""], ["Zhou", "Tie", ""]]}, {"id": "1704.04355", "submitter": "Andrew Francis", "authors": "Guilherme S. Rodrigues, Andrew R. Francis, Scott A. Sisson, Mark M.\n  Tanaka", "title": "Inferences on the acquisition of multidrug resistance in\n  \\emph{Mycobacterium tuberculosis} using molecular epidemiological data", "comments": "32 pages, 6 figures. This manuscript will appear as a chapter in the\n  Handbook of Approximate Bayesian Computation", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the rates of drug resistance acquisition in a natural\npopulation using molecular epidemiological data from Bolivia. First, we study\nthe rate of direct acquisition of double resistance from the double sensitive\nstate within patients and compare it to the rates of evolution to single\nresistance. In particular, we address whether or not double resistance can\nevolve directly from a double sensitive state within a given host. Second, we\naim to understand whether the differences in mutation rates to rifampicin and\nisoniazid resistance translate to the epidemiological scale. Third, we estimate\nthe proportion of MDR TB cases that are due to the transmission of MDR strains\ncompared to acquisition of resistance through evolution. To address these\nproblems we develop a model of TB transmission in which we track the evolution\nof resistance to two drugs and the evolution of VNTR loci. However, the\navailable data is incomplete, in that it is recorded only {for a fraction of\nthe population and} at a single point in time. The likelihood function induced\nby the proposed model is computationally prohibitive to evaluate and\naccordingly impractical to work with directly. We therefore approach\nstatistical inference using approximate Bayesian computation techniques.\n", "versions": [{"version": "v1", "created": "Fri, 14 Apr 2017 05:53:58 GMT"}], "update_date": "2017-04-17", "authors_parsed": [["Rodrigues", "Guilherme S.", ""], ["Francis", "Andrew R.", ""], ["Sisson", "Scott A.", ""], ["Tanaka", "Mark M.", ""]]}, {"id": "1704.04445", "submitter": "Chen Liu", "authors": "Chen Liu, Michael Malek, Ivan K. H. Poon, Lanzhou Jiang, Colin J. R.\n  Sheppard, Ann Roberts, Harry Quiney, Douguo Zhang, Xiaocong Yuan, Jiao Lin,\n  Christian Depeursinge, Pierre Marquet, Shan Shan Kou", "title": "Label-free three-dimensional (3D) structural imaging in live cells using\n  intrinsic optical refractive index", "comments": "20 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we report a method for visualization of volumetric structural\ninformation of live biological samples with no exogenous contrast agents. The\nprocess is made possible through a technique that involves generation,\nsynthesis and analysis of three-dimensional (3D) Fourier components of light\ndiffracted by the sample. This leads to the direct recovery of quantitative\ncellular morphology with no iterative procedures for reduced computational\ncomplexity. Combing with the fact that the technique is easily adaptive to any\nimaging platform and requires minimum sample preparation, our proposed method\nis particularly promising for observing fast, volumetric and dynamic events\npreviously only accessible through staining methods.\n", "versions": [{"version": "v1", "created": "Fri, 14 Apr 2017 15:01:52 GMT"}], "update_date": "2017-04-17", "authors_parsed": [["Liu", "Chen", ""], ["Malek", "Michael", ""], ["Poon", "Ivan K. H.", ""], ["Jiang", "Lanzhou", ""], ["Sheppard", "Colin J. R.", ""], ["Roberts", "Ann", ""], ["Quiney", "Harry", ""], ["Zhang", "Douguo", ""], ["Yuan", "Xiaocong", ""], ["Lin", "Jiao", ""], ["Depeursinge", "Christian", ""], ["Marquet", "Pierre", ""], ["Kou", "Shan Shan", ""]]}, {"id": "1704.04454", "submitter": "Jake Taylor-King", "authors": "Jake P. Taylor-King, Etienne Baratchart, Andrew Dhawan, Elizabeth A.\n  Coker, Inga Hansine Rye, Hege Russnes, S. Jon Chapman, David Basanta, and\n  Andriy Marusyk", "title": "Simulated Ablation for Detection of Cells Impacting Paracrine Signalling\n  in Histology Analysis", "comments": "17 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intra-tumour phenotypic heterogeneity limits accuracy of clinical diagnostics\nand hampers the efficiency of anti-cancer therapies. Dealing with this cellular\nheterogeneity requires adequate understanding of its sources, which is\nextremely difficult, as phenotypes of tumour cells integrate hardwired\n(epi)mutational differences with the dynamic responses to microenvironmental\ncues. The later come in form of both direct physical interactions, as well as\ninputs from gradients of secreted signalling molecules. Furthermore, tumour\ncells can not only receive microenvironmental cues, but also produce them.\nDespite high biological and clinical importance of understanding spatial\naspects of paracrine signaling, adequate research tools are largely lacking.\nHere, a partial differential equation (PDE) based mathematical model is\ndeveloped that mimics the process of cell ablation. This model suggests how\neach cell might contribute to the microenvironment by either absorbing or\nsecreting diffusible factors, and quantifies the extent to which observed\nintensities can be explained via diffusion mediated signalling. The model\nallows for the separation of phenotypic responses to signalling gradients\nwithin tumour microenvironments from the combined influence of responses\nmediated by direct physical contact and hardwired (epi)genetic differences. The\ndifferential equation is solved around cell membrane outlines using a finite\nelement method (FEM). The method is applied to a multi-channel\nimmunofluorescence in situ hybridization (iFISH) stained breast cancer\nhistological specimen and correlations are investigated between: HER2 gene\namplification; HER2 protein expression; and cell interaction with the\ndiffusible microenvironment. This approach allows partial deconvolution of the\ncomplex inputs...\n", "versions": [{"version": "v1", "created": "Fri, 14 Apr 2017 15:27:29 GMT"}], "update_date": "2017-04-17", "authors_parsed": [["Taylor-King", "Jake P.", ""], ["Baratchart", "Etienne", ""], ["Dhawan", "Andrew", ""], ["Coker", "Elizabeth A.", ""], ["Rye", "Inga Hansine", ""], ["Russnes", "Hege", ""], ["Chapman", "S. Jon", ""], ["Basanta", "David", ""], ["Marusyk", "Andriy", ""]]}, {"id": "1704.04718", "submitter": "Xu Youjun Xu Youjun", "authors": "Youjun Xu, Jianfeng Pei, Luhua Lai", "title": "Deep Learning Based Regression and Multi-class Models for Acute Oral\n  Toxicity Prediction with Automatic Chemical Feature Extraction", "comments": "36 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For quantitative structure-property relationship (QSPR) studies in\nchemoinformatics, it is important to get interpretable relationship between\nchemical properties and chemical features. However, the predictive power and\ninterpretability of QSPR models are usually two different objectives that are\ndifficult to achieve simultaneously. A deep learning architecture using\nmolecular graph encoding convolutional neural networks (MGE-CNN) provided a\nuniversal strategy to construct interpretable QSPR models with high predictive\npower. Instead of using application-specific preset molecular descriptors or\nfingerprints, the models can be resolved using raw and pertinent features\nwithout manual intervention or selection. In this study, we developed acute\noral toxicity (AOT) models of compounds using the MGE-CNN architecture as a\ncase study. Three types of high-level predictive models: regression model\n(deepAOT-R), multi-classification model (deepAOT-C) and multi-task model\n(deepAOT-CR) for AOT evaluation were constructed. These models highly\noutperformed previously reported models. For the two external datasets\ncontaining 1673 (test set I) and 375 (test set II) compounds, the R2 and mean\nabsolute error (MAE) of deepAOT-R on the test set I were 0.864 and 0.195, and\nthe prediction accuracy of deepAOT-C was 95.5% and 96.3% on the test set I and\nII, respectively. The two external prediction accuracy of deepAOT-CR is 95.0%\nand 94.1%, while the R2 and MAE are 0.861 and 0.204 for test set I,\nrespectively.\n", "versions": [{"version": "v1", "created": "Sun, 16 Apr 2017 04:17:32 GMT"}, {"version": "v2", "created": "Wed, 26 Apr 2017 02:10:10 GMT"}, {"version": "v3", "created": "Thu, 4 May 2017 09:52:38 GMT"}], "update_date": "2017-05-05", "authors_parsed": [["Xu", "Youjun", ""], ["Pei", "Jianfeng", ""], ["Lai", "Luhua", ""]]}, {"id": "1704.05128", "submitter": "Carlos Martinez Mr.", "authors": "Carlos Alberto Mart\\'inez, Kshitij Khare, Mauricio A. Elzo", "title": "BIBI: Bayesian Inference of Breed Composition", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this paper was to develop statistical models to estimate\nindividual breed composition based on the previously proposed idea of\nregressing discrete random variables corresponding to counts of reference\nalleles of biallelic molecular markers located across the genome on the allele\nfrequencies of each marker in the pure (base) breeds. Some of the existing\nregression-based methods do not guarantee that estimators of breed composition\nwill lie in the appropriate parameter space and none of them account for\nuncertainty about allele frequencies in the pure breeds, that is, uncertainty\nabout the design matrix. In order to overcome these limitations, we proposed\ntwo Bayesian generalized linear models. For each individual, both models assume\nthat the counts of the reference allele at each marker locus follow independent\nBinomial distributions, use the logit link, and pose a Dirichlet prior over the\nvector of regression coefficients (which corresponds to breed composition).\nThis prior guarantees that point estimators of breed composition like the\nposterior mean pertain to the appropriate space. The difference between these\nmodels is that model termed BIBI does not account for uncertainty about the\ndesign matrix, while model termed BIBI2 accounts for such an uncertainty by\nassigning independent Beta priors to the entries of this matrix. We implemented\nthese models in a multibreed Angus-Brahman population. Posterior means were\nused as point estimators of breed composition. In addition, the ordinary least\nsquares estimator proposed by Kuehn et al. (2011) (OLSK) was also computed.\nBIBI and BIBI2 estimated breed composition more accurately than OLSK, and BIBI2\nhad an 8.3% improvement in accuracy as compared to BIBI.\n", "versions": [{"version": "v1", "created": "Mon, 17 Apr 2017 21:14:23 GMT"}, {"version": "v2", "created": "Tue, 26 Sep 2017 23:56:46 GMT"}], "update_date": "2017-09-28", "authors_parsed": [["Martínez", "Carlos Alberto", ""], ["Khare", "Kshitij", ""], ["Elzo", "Mauricio A.", ""]]}, {"id": "1704.05452", "submitter": "Zhenke Wu", "authors": "Zhenke Wu, Livia Casciola-Rosen, Ami A. Shah, Antony Rosen, Scott\n  Zeger", "title": "Estimating AutoAntibody Signatures to Detect Autoimmune Disease Patient\n  Subsets", "comments": "Appendix containing algorithmic details and extra figures can be\n  found here:\n  http://zhenkewu.com/assets/pdfs/papers/wu-2017-gel-preprocessing_supp.pdf", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autoimmune diseases are characterized by highly specific immune responses\nagainst molecules in self-tissues. Different autoimmune diseases are\ncharacterized by distinct immune responses, making autoantibodies useful for\ndiagnosis and prediction. In many diseases, the targets of autoantibodies are\nincompletely defined. Although the technologies for autoantibody discovery have\nadvanced dramatically over the past decade, each of these techniques generates\nhundreds of possibilities, which are onerous and expensive to validate. We set\nout to establish a method to greatly simplify autoantibody discovery, using a\npre-filtering step to define subgroups with similar specificities based on\nmigration of radiolabeled, immunoprecipitated proteins on sodium dodecyl\nsulfate (SDS) gels and autoradiography [$\\textbf{G}$el\n$\\textbf{E}$lectrophoresis and band detection on $\\textbf{A}$utoradiograms\n(GEA)]. Human recognition of patterns is not optimal when the patterns are\ncomplex or scattered across many samples. Multiple sources of errors -\nincluding irrelevant intensity differences and warping of gels - have\nchallenged automation of pattern discovery from autoradiograms.\n  In this paper, we address these limitations using a Bayesian hierarchical\nmodel with shrinkage priors for pattern alignment and spatial dewarping. The\nBayesian model combines information from multiple gel sets and corrects spatial\nwarping for coherent estimation of autoantibody signatures defined by presence\nor absence of a grid of landmark proteins. We show the pre-processing creates\nmore clearly separated clusters and improves the accuracy of autoantibody\nsubset detection via hierarchical clustering. Finally, we demonstrate the\nutility of the proposed methods with GEA data from scleroderma patients.\n", "versions": [{"version": "v1", "created": "Tue, 18 Apr 2017 05:02:15 GMT"}, {"version": "v2", "created": "Fri, 4 Aug 2017 05:06:12 GMT"}], "update_date": "2017-08-07", "authors_parsed": [["Wu", "Zhenke", ""], ["Casciola-Rosen", "Livia", ""], ["Shah", "Ami A.", ""], ["Rosen", "Antony", ""], ["Zeger", "Scott", ""]]}, {"id": "1704.05906", "submitter": "Eugene Postnikov", "authors": "Eugene B. Postnikov, Maria O. Tsoy, Maxim A. Kurochkin, Dmitry E.\n  Postnov", "title": "A fast method for the detection of vascular structure in images, based\n  on the continuous wavelet transform with the Morlet wavelet having a low\n  central frequency", "comments": "6 pages, 3 figures", "journal-ref": "Proc. SPIE (2017) 10337", "doi": "10.1117/12.2268427", "report-no": null, "categories": "q-bio.QM math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A manual measurement of blood vessels diameter is a conventional component of\nroutine visual assessment of microcirculation, say, during optical\ncapillaroscopy. However, many modern optical methods for blood flow\nmeasurements demand the reliable procedure for a fully automated detection of\nvessels and estimation of their diameter that is a challenging task.\nSpecifically, if one measure the velocity of red blood cells by means of laser\nspeckle imaging, then visual measurements become impossible, while the\nvelocity-based estimation has their own limitations. One of promising\napproaches is based on fast switching of illumination type, but it drastically\nreduces the observation time, and hence, the achievable quality of images. In\nthe present work we address this problem proposing an alternative method for\nthe processing of noisy images of vascular structure, which extracts the mask\ndenoting locations of vessels, based on the application of the continuous\nwavelet transform with the Morlet wavelet having small central frequencies.\nSuch a method combines a reasonable accuracy with the possibility of fast\ndirect implementation to images. Discussing the latter, we describe in details\na new MATLAB program code realization for the CWT with the Morlet wavelet,\nwhich does not use loops completely replaced with element-by-element operations\nthat drastically reduces the computation time.\n", "versions": [{"version": "v1", "created": "Wed, 19 Apr 2017 19:29:48 GMT"}], "update_date": "2017-04-21", "authors_parsed": [["Postnikov", "Eugene B.", ""], ["Tsoy", "Maria O.", ""], ["Kurochkin", "Maxim A.", ""], ["Postnov", "Dmitry E.", ""]]}, {"id": "1704.05912", "submitter": "Konstantin Blyuss", "authors": "G.O. Agaba, Y.N. Kyrychko, K.B. Blyuss", "title": "Time-delayed SIS epidemic model with population awareness", "comments": "15 pages, 5 figures", "journal-ref": "Ecol. Compl. 31, 50-56 (2017)", "doi": "10.1016/j.ecocom.2017.03.002", "report-no": null, "categories": "q-bio.PE nlin.CD q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyses the dynamics of infectious disease with a concurrent\nspread of disease awareness. The model includes local awareness due to contacts\nwith aware individuals, as well as global awareness due to reported cases of\ninfection and awareness campaigns. We investigate the effects of time delay in\nresponse of unaware individuals to available information on the epidemic\ndynamics by establishing conditions for the Hopf bifurcation of the endemic\nsteady state of the model. Analytical results are supported by numerical\nbifurcation analysis and simulations.\n", "versions": [{"version": "v1", "created": "Wed, 19 Apr 2017 19:45:52 GMT"}], "update_date": "2017-04-21", "authors_parsed": [["Agaba", "G. O.", ""], ["Kyrychko", "Y. N.", ""], ["Blyuss", "K. B.", ""]]}, {"id": "1704.05942", "submitter": "Adam Gosztolai", "authors": "Adam Gosztolai, J\\\"org Schumacher, Volker Behrends, Jacob G Bundy,\n  Franziska Heydenreich, Mark H Bennett, Martin Buck, Mauricio Barahona", "title": "GlnK facilitates the dynamic regulation of bacterial nitrogen\n  assimilation", "comments": null, "journal-ref": null, "doi": "10.1016/j.bpj.2017.04.012", "report-no": null, "categories": "q-bio.SC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ammonium assimilation in E. coli is regulated by two paralogous proteins\n(GlnB and GlnK), which orchestrate interactions with regulators of gene\nexpression, transport proteins and metabolic pathways. Yet how they conjointly\nmodulate the activity of glutamine synthetase (GS), the key enzyme for nitrogen\nassimilation, is poorly understood. We combine experiments and theory to study\nthe dynamic roles of GlnB and GlnK during nitrogen starvation and upshift. We\nmeasure time-resolved in vivo concentrations of metabolites, total and\npost-translationally modified proteins, and develop a concise biochemical model\nof GlnB and GlnK that incorporates competition for active and allosteric sites,\nas well as functional sequestration of GlnK. The model predicts the responses\nof GS, GlnB and GlnK under time-varying external ammonium level in the wild\ntype and two genetic knock-outs. Our results show that GlnK is tightly\nregulated under nitrogen-rich conditions, yet it is expressed during ammonium\nrun-out and starvation. This suggests a role for GlnK as a buffer of nitrogen\nshock after starvation, and provides a further functional link between nitrogen\nand carbon metabolisms.\n", "versions": [{"version": "v1", "created": "Wed, 19 Apr 2017 21:56:43 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Gosztolai", "Adam", ""], ["Schumacher", "Jörg", ""], ["Behrends", "Volker", ""], ["Bundy", "Jacob G", ""], ["Heydenreich", "Franziska", ""], ["Bennett", "Mark H", ""], ["Buck", "Martin", ""], ["Barahona", "Mauricio", ""]]}, {"id": "1704.06530", "submitter": "Qixia Yuan", "authors": "Andrzej Mizera and Jun Pang and Hongyang Qu and Qixia Yuan", "title": "Taming Asynchrony for Attractor Detection in Large Boolean Networks\n  (Technical Report)", "comments": "28 pages, version 3 (correct a mistake in Table 2)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.DC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Boolean networks is a well-established formalism for modelling biological\nsystems. A vital challenge for analysing a Boolean network is to identify all\nthe attractors. This becomes more challenging for large asynchronous Boolean\nnetworks, due to the asynchronous updating scheme. Existing methods are\nprohibited due to the well-known state-space explosion problem in large Boolean\nnetworks. In this paper, we tackle this challenge by proposing a SCC-based\ndecomposition method. We prove the correctness of our proposed method and\ndemonstrate its efficiency with two real-life biological networks.\n", "versions": [{"version": "v1", "created": "Thu, 20 Apr 2017 16:52:26 GMT"}, {"version": "v2", "created": "Wed, 7 Jun 2017 08:39:57 GMT"}, {"version": "v3", "created": "Tue, 13 Jun 2017 13:28:02 GMT"}], "update_date": "2017-06-14", "authors_parsed": [["Mizera", "Andrzej", ""], ["Pang", "Jun", ""], ["Qu", "Hongyang", ""], ["Yuan", "Qixia", ""]]}, {"id": "1704.07207", "submitter": "Jinbo Xu", "authors": "Zhen Li, Sheng Wang, Yizhou Yu and Jinbo Xu", "title": "Predicting membrane protein contacts from non-membrane proteins by deep\n  transfer learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM cs.LG cs.NE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computational prediction of membrane protein (MP) structures is very\nchallenging partially due to lack of sufficient solved structures for homology\nmodeling. Recently direct evolutionary coupling analysis (DCA) sheds some light\non protein contact prediction and accordingly, contact-assisted folding, but\nDCA is effective only on some very large-sized families since it uses\ninformation only in a single protein family. This paper presents a deep\ntransfer learning method that can significantly improve MP contact prediction\nby learning contact patterns and complex sequence-contact relationship from\nthousands of non-membrane proteins (non-MPs). Tested on 510 non-redundant MPs,\nour deep model (learned from only non-MPs) has top L/10 long-range contact\nprediction accuracy 0.69, better than our deep model trained by only MPs (0.63)\nand much better than a representative DCA method CCMpred (0.47) and the CASP11\nwinner MetaPSICOV (0.55). The accuracy of our deep model can be further\nimproved to 0.72 when trained by a mix of non-MPs and MPs. When only contacts\nin transmembrane regions are evaluated, our method has top L/10 long-range\naccuracy 0.62, 0.57, and 0.53 when trained by a mix of non-MPs and MPs, by\nnon-MPs only, and by MPs only, respectively, still much better than MetaPSICOV\n(0.45) and CCMpred (0.40). All these results suggest that sequence-structure\nrelationship learned by our deep model from non-MPs generalizes well to MP\ncontact prediction. Improved contact prediction also leads to better\ncontact-assisted folding. Using only top predicted contacts as restraints, our\ndeep learning method can fold 160 and 200 of 510 MPs with TMscore>0.6 when\ntrained by non-MPs only and by a mix of non-MPs and MPs, respectively, while\nCCMpred and MetaPSICOV can do so for only 56 and 77 MPs, respectively. Our\ncontact-assisted folding also greatly outperforms homology modeling.\n", "versions": [{"version": "v1", "created": "Mon, 24 Apr 2017 13:27:22 GMT"}], "update_date": "2017-05-11", "authors_parsed": [["Li", "Zhen", ""], ["Wang", "Sheng", ""], ["Yu", "Yizhou", ""], ["Xu", "Jinbo", ""]]}, {"id": "1704.07259", "submitter": "Ankit Gupta", "authors": "Ankit Gupta, Jan Mikelson and Mustafa Khammash", "title": "A finite state projection algorithm for the stationary solution of the\n  chemical master equation", "comments": "8 figures", "journal-ref": null, "doi": "10.1063/1.5006484", "report-no": null, "categories": "q-bio.QM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The chemical master equation (CME) is frequently used in systems biology to\nquantify the effects of stochastic fluctuations that arise due to biomolecular\nspecies with low copy numbers. The CME is a system of ordinary differential\nequations that describes the evolution of probability density for each\npopulation vector in the state-space of the stochastic reaction dynamics. For\nmany examples of interest, this state-space is infinite, making it difficult to\nobtain exact solutions of the CME. To deal with this problem, the Finite State\nProjection (FSP) algorithm was developed by Munsky and Khammash (Jour. Chem.\nPhys. 2006), to provide approximate solutions to the CME by truncating the\nstate-space. The FSP works well for finite time-periods but it cannot be used\nfor estimating the stationary solutions of CMEs, which are often of interest in\nsystems biology. The aim of this paper is to develop a version of FSP which we\nrefer to as the stationary FSP (sFSP) that allows one to obtain accurate\napproximations of the stationary solutions of a CME by solving a finite\nlinear-algebraic system that yields the stationary distribution of a\ncontinuous-time Markov chain over the truncated state-space. We derive bounds\nfor the approximation error incurred by sFSP and we establish that under\ncertain stability conditions, these errors can be made arbitrarily small by\nappropriately expanding the truncated state-space. We provide several examples\nto illustrate our sFSP method and demonstrate its efficiency in estimating the\nstationary distributions. In particular, we show that using a quantised tensor\ntrain (QTT) implementation of our sFSP method, problems admitting more than 100\nmillion states can be efficiently solved.\n", "versions": [{"version": "v1", "created": "Mon, 24 Apr 2017 14:41:38 GMT"}, {"version": "v2", "created": "Wed, 26 Jul 2017 14:56:25 GMT"}, {"version": "v3", "created": "Wed, 20 Sep 2017 15:52:32 GMT"}], "update_date": "2017-10-25", "authors_parsed": [["Gupta", "Ankit", ""], ["Mikelson", "Jan", ""], ["Khammash", "Mustafa", ""]]}, {"id": "1704.07753", "submitter": "Winston Guess Mr", "authors": "W. P. Guess (1 and 2), B. D. Reddy (1 and 3), A. McBride (1 and 4), B.\n  Spottiswoode (5 and 6), J. Downs (7), T. Franz (5 and 8) ((1) Centre for\n  Research in Computational and Applied Mechanics (CERECAM), University of Cape\n  Town, South Africa, (2) Department of Mechanical Engineering, Faculty of\n  Engineering and the Built Environment, University of Cape Town, South Africa\n  (3) Department of Mathematics and Applied Mathematics, University of Cape\n  Town, South Africa (4) Infrastructure and Environment, School of Engineering,\n  The University of Glasgow, Scotland (5) Division of Biomedical Engineering,\n  Department of Human Biology, Faculty of Health Sciences, University of Cape\n  Town, South Africa (6) Siemens Medical Solutions USA Inc., Malvern, USA (7)\n  Division of General Surgery, Department of Surgery, Groote Schuur Hospital,\n  Cape Town, South Africa (8) Bioengineering Science Research Group,\n  Engineering Sciences, Faculty of Engineering and the Environment, University\n  of Southampton, UK)", "title": "Fluid-structure interaction modelling and stabilisation of a\n  patient-specific arteriovenous access fistula", "comments": "21 pages, 6 png figures, 11 pdf figures, uses myarX.cls", "journal-ref": null, "doi": "10.1007/s10237-017-0973-8", "report-no": null, "categories": "physics.med-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A patient-specific fluid-structure interaction (FSI) model of a\nphase-contrast magnetic resonance angiography (PC-MRA) imaged arteriovenous\nfistula is presented. The numerical model is developed and simulated using a\ncommercial multiphysics simulation package where a semi-implicit FSI coupling\nscheme combines a finite volume method blood flow model and a finite element\nmethod vessel wall model. A pulsatile mass-flow boundary condition is\nprescribed at the artery inlet of the model, and a three-element Windkessel\nmodel at the artery and vein outlets. The FSI model is freely available for\nanalysis and extension. This work shows the effectiveness of combining a number\nof stabilisation techniques to simultaneously overcome the added-mass effect\nand optimise the efficiency of the overall model. The PC-MRA data, fluid model,\nand FSI model results show almost identical flow features in the fistula; this\napplies in particular to a flow recirculation region in the vein that could\npotentially lead to fistula failure.\n", "versions": [{"version": "v1", "created": "Tue, 25 Apr 2017 15:54:33 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Guess", "W. P.", "", "1 and 2"], ["Reddy", "B. D.", "", "1 and 3"], ["McBride", "A.", "", "1 and 4"], ["Spottiswoode", "B.", "", "5 and 6"], ["Downs", "J.", "", "5 and 8"], ["Franz", "T.", "", "5 and 8"]]}, {"id": "1704.08062", "submitter": "Gianna Vivaldo", "authors": "Gianna Vivaldo and Elisa Masi and Cosimo Taiti and Guido Caldarelli\n  and Stefano Mancuso", "title": "Beyond the network of plants volatile organic compounds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Plants emission of volatile organic compounds (VOCs) is involved in a wide\nclass of ecological functions, as VOCs play a crucial role in plants\ninteractions with biotic and abiotic factors. Accordingly, they vary widely\nacross species and underpin differences in ecological strategy. In this paper,\nVOCs spontaneously emitted by 109 plant species (belonging to 56 different\nfamilies) have been qualitatively and quantitatively analysed in order to\nclassify plants species. By using bipartite networks methodology, based on\nrecent advancements in Complex Network Theory, and through the application of\ncomplementary classical and advanced community detection algorithms, the\npossibility to classify species according to chemical classes such as terpenes\nand sulfur compounds is suggested. This indicates complex network analysis as\nan advantageous methodology to uncover plants relationships also related to the\nway they react to the environment where they evolve and adapt.\n", "versions": [{"version": "v1", "created": "Wed, 26 Apr 2017 11:25:30 GMT"}], "update_date": "2017-04-27", "authors_parsed": [["Vivaldo", "Gianna", ""], ["Masi", "Elisa", ""], ["Taiti", "Cosimo", ""], ["Caldarelli", "Guido", ""], ["Mancuso", "Stefano", ""]]}, {"id": "1704.08193", "submitter": "Spiros Denaxas", "authors": "Vaclav Papez, Spiros Denaxas, Harry Hemingway", "title": "Evaluating openEHR for storing computable representations of electronic\n  health record phenotyping algorithms", "comments": "30th IEEE International Symposium on Computer-Based Medical Systems -\n  IEEE CBMS 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electronic Health Records (EHR) are data generated during routine clinical\ncare. EHR offer researchers unprecedented phenotypic breadth and depth and have\nthe potential to accelerate the pace of precision medicine at scale. A main EHR\nuse-case is creating phenotyping algorithms to define disease status, onset and\nseverity. Currently, no common machine-readable standard exists for defining\nphenotyping algorithms which often are stored in human-readable formats. As a\nresult, the translation of algorithms to implementation code is challenging and\nsharing across the scientific community is problematic. In this paper, we\nevaluate openEHR, a formal EHR data specification, for computable\nrepresentations of EHR phenotyping algorithms.\n", "versions": [{"version": "v1", "created": "Thu, 20 Apr 2017 20:54:19 GMT"}, {"version": "v2", "created": "Thu, 27 Apr 2017 07:18:10 GMT"}], "update_date": "2017-04-28", "authors_parsed": [["Papez", "Vaclav", ""], ["Denaxas", "Spiros", ""], ["Hemingway", "Harry", ""]]}, {"id": "1704.08907", "submitter": "Maria Bruna", "authors": "Martin Robinson and Maria Bruna", "title": "Particle-based and Meshless Methods with Aboria", "comments": null, "journal-ref": "SoftwareX 6 (2017)", "doi": "10.1016/j.softx.2017.07.002", "report-no": null, "categories": "cs.MS cond-mat.soft q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aboria is a powerful and flexible C++ library for the implementation of\nparticle-based numerical methods. The particles in such methods can represent\nactual particles (e.g. Molecular Dynamics) or abstract particles used to\ndiscretise a continuous function over a domain (e.g. Radial Basis Functions).\nAboria provides a particle container, compatible with the Standard Template\nLibrary, spatial search data structures, and a Domain Specific Language to\nspecify non-linear operators on the particle set. This paper gives an overview\nof Aboria's design, an example of use, and a performance benchmark.\n", "versions": [{"version": "v1", "created": "Fri, 28 Apr 2017 12:49:43 GMT"}, {"version": "v2", "created": "Wed, 11 Oct 2017 20:50:12 GMT"}], "update_date": "2017-10-13", "authors_parsed": [["Robinson", "Martin", ""], ["Bruna", "Maria", ""]]}, {"id": "1704.08933", "submitter": "Ankit Gupta", "authors": "Ankit Gupta, Andreas Milias-Argeitis and Mustafa Khammash", "title": "Dynamic disorder in simple enzymatic reactions induces stochastic\n  amplification of substrate", "comments": "7 Figures", "journal-ref": null, "doi": "10.1098/rsif.2017.0311", "report-no": null, "categories": "q-bio.QM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A growing amount of evidence points to the fact that many enzymes exhibit\nfluctuations in their catalytic activity, which are associated with\nconformational changes on a broad range of timescales. The experimental study\nof this phenomenon, termed dynamic disorder, has become possible due to\nadvances in single-molecule enzymology measurement techniques, through which\nthe catalytic activity of individual enzyme molecules can be tracked in time.\nThe biological role and importance of these fluctuations in a system with a\nsmall number of enzymes such as a living cell have only recently started being\nexplored. In this work, we examine a simple stochastic reaction system\nconsisting of an inflowing substrate and an enzyme with a randomly fluctuating\ncatalytic reaction rate that converts the substrate into an outflowing product.\nTo describe analytically the effect of rate fluctuations on the average\nsubstrate abundance at steady-state, we derive an explicit formula that\nconnects the relative speed of enzymatic fluctuations with the mean substrate\nlevel. We demonstrate that the relative speed of rate fluctuations can have a\ndramatic effect on the mean substrate, and lead to large positive deviations\nfrom predictions based on the assumption of deterministic enzyme activity. Our\nresults also establish an interesting connection between the amplification\neffect and the mixing properties of the Markov process describing the enzymatic\nactivity fluctuations, which can be used to easily predict the fluctuation\nspeed above which such deviations become negligible. As the techniques of\nsingle-molecule enzymology continuously evolve, it may soon be possible to\nstudy the stochastic phenomena due to enzymatic activity fluctuations within\nliving cells. Our work can be used to formulate experimentally testable\nhypotheses regarding the magnitude of these fluctuations, as well as their\nphenotypic consequences.\n", "versions": [{"version": "v1", "created": "Fri, 28 Apr 2017 13:51:49 GMT"}, {"version": "v2", "created": "Thu, 27 Jul 2017 09:13:20 GMT"}], "update_date": "2017-07-28", "authors_parsed": [["Gupta", "Ankit", ""], ["Milias-Argeitis", "Andreas", ""], ["Khammash", "Mustafa", ""]]}, {"id": "1704.08994", "submitter": "Jian-Jun Shu", "authors": "Jian-Jun Shu, Kian-Yan Yong", "title": "Fourier-based classification of protein secondary structures", "comments": null, "journal-ref": "Biochemical and Biophysical Research Communications, Vol. 485, No.\n  4, pp. 731-735, 2017", "doi": "10.1016/j.bbrc.2017.02.117", "report-no": null, "categories": "q-bio.QM q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The correct prediction of protein secondary structures is one of the key\nissues in predicting the correct protein folded shape, which is used for\ndetermining gene function. Existing methods make use of amino acids properties\nas indices to classify protein secondary structures, but are faced with a\nsignificant number of misclassifications. The paper presents a technique for\nthe classification of protein secondary structures based on protein\n\"signal-plotting\" and the use of the Fourier technique for digital signal\nprocessing. New indices are proposed to classify protein secondary structures\nby analyzing hydrophobicity profiles. The approach is simple and\nstraightforward. Results show that the more types of protein secondary\nstructures can be classified by means of these newly-proposed indices.\n", "versions": [{"version": "v1", "created": "Fri, 28 Apr 2017 16:20:50 GMT"}], "update_date": "2017-05-01", "authors_parsed": [["Shu", "Jian-Jun", ""], ["Yong", "Kian-Yan", ""]]}, {"id": "1704.09021", "submitter": "Xin Liu", "authors": "Xin Liu and Mahesan Niranjan", "title": "Parameter Estimation in Computational Biology by Approximate Bayesian\n  Computation coupled with Sensitivity Analysis", "comments": "17 pages, 5 figures. Under submission to Bioinformatics", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We address the problem of parameter estimation in models of systems biology\nfrom noisy observations. The models we consider are characterized by\nsimultaneous deterministic nonlinear differential equations whose parameters\nare either taken from in vitro experiments, or are hand-tuned during the model\ndevelopment process to reproduces observations from the system. We consider the\nfamily of algorithms coming under the Bayesian formulation of Approximate\nBayesian Computation (ABC), and show that sensitivity analysis could be\ndeployed to quantify the relative roles of different parameters in the system.\nParameters to which a system is relatively less sensitive (known as sloppy\nparameters) need not be estimated to high precision, while the values of\nparameters that are more critical (stiff parameters) need to be determined with\ncare. A tradeoff between computational complexity and the accuracy with which\nthe posterior distribution may be probed is an important characteristic of this\nclass of algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 28 Apr 2017 17:33:10 GMT"}], "update_date": "2017-05-01", "authors_parsed": [["Liu", "Xin", ""], ["Niranjan", "Mahesan", ""]]}]