[{"id": "1911.00075", "submitter": "Chen Li", "authors": "Chen Li, Yang Ding, Nick Gravish, Ryan D. Maladen, Andrew Masse, Paul\n  B. Umbanhowar, Haldun Komsuoglu, Daniel E. Koditschek, and Daniel I. Goldman", "title": "Towards a terramechanics for bio-inspired locomotion in granular\n  environments", "comments": null, "journal-ref": "ASCE Earth & Space Conference (2012), 264-273", "doi": "10.1061/9780784412190.031", "report-no": null, "categories": "physics.bio-ph cond-mat.soft cs.SY eess.SY physics.flu-dyn q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Granular media (GM) present locomotor challenges for terrestrial and\nextraterrestrial devices because they can flow and solidify in response to\nlocalized intrusion of wheels, limbs, and bodies. While the development of\nairplanes and submarines is aided by understanding of hydrodynamics,\nfundamental theory does not yet exist to describe the complex interactions of\nlocomotors with GM. In this paper, we use experimental, computational, and\ntheoretical approaches to develop a terramechanics for bio-inspired locomotion\nin granular environments. We use a fluidized bed to prepare GM with a desired\nglobal packing fraction, and use empirical force measurements and the Discrete\nElement Method (DEM) to elucidate interaction mechanics during\nlocomotion-relevant intrusions in GM such as vertical penetration and\nhorizontal drag. We develop a resistive force theory (RFT) to account for more\ncomplex intrusions. We use these force models to understand the locomotor\nperformance of two bio-inspired robots moving on and within GM.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 19:45:39 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Li", "Chen", ""], ["Ding", "Yang", ""], ["Gravish", "Nick", ""], ["Maladen", "Ryan D.", ""], ["Masse", "Andrew", ""], ["Umbanhowar", "Paul B.", ""], ["Komsuoglu", "Haldun", ""], ["Koditschek", "Daniel E.", ""], ["Goldman", "Daniel I.", ""]]}, {"id": "1911.00079", "submitter": "Chen Li", "authors": "Chen Li, Tingnan Zhang, Daniel I. Goldman", "title": "A resistive force model of legged locomotion on granular media", "comments": null, "journal-ref": "Adaptive Mobile Robotics, pp. 433-440 (2012)", "doi": "10.1142/9789814415958_0056", "report-no": null, "categories": "physics.bio-ph cond-mat.soft physics.flu-dyn q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compared to agile legged animals, wheeled and tracked vehicles often suffer\nlarge performance loss on granular surfaces like sand and gravel. Understanding\nthe mechanics of legged locomotion on granular media can aid the development of\nlegged robots with improved mobility on granular surfaces; however, no general\nforce model yet exists for granular media to predict ground reaction forces\nduring complex limb intrusions. Inspired by a recent study of sand-swimming, we\ndevelop a resistive force model in the vertical plane for legged locomotion on\ngranular media. We divide an intruder of complex morphology and kinematics,\ne.g., a bio-inspired robot L-leg rotated through uniform granular media\n(loosely packed ~ 1 mm diameter poppy seeds), into small segments, and measure\nstresses as a function of depth, orientation, and direction of motion using a\nmodel leg segment. Summation of segmental forces over the intruder predicts the\nnet forces on both an L-leg and a reversed L-leg rotated through granular media\nwith better accuracy than using simple one-dimensional penetration and drag\nforce models. A multi-body dynamic simulation using the resistive force model\npredicts the speeds of a small legged robot (15 cm, 150 g) moving on granular\nmedia using both L-legs and reversed L-legs.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 19:50:55 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Li", "Chen", ""], ["Zhang", "Tingnan", ""], ["Goldman", "Daniel I.", ""]]}, {"id": "1911.00325", "submitter": "Marzio Pennisi", "authors": "Giulia Russo, Francesco Pappalardo, Miguel A. Juarez, Marzio Pennisi,\n  Pere Joan Cardona, Rhea Coler, Epifanio Fichera, Marco Viceconti", "title": "Evaluation of the efficacy of RUTI and ID93/GLA-SE vaccines in\n  tuberculosis treatment: in silico trial through UISS-TB simulator", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Tuberculosis (TB) is one of the deadliest diseases worldwide, with 1,5\nmillion fatalities every year along with potential devastating effects on\nsociety, families and individuals. To address this alarming burden, vaccines\ncan play a fundamental role, even though to date no fully effective TB vaccine\nreally exists. Current treatments involve several combinations of antibiotics\nadministered to TB patients for up to two years, leading often to financial\nissues and reduced therapy adherence. Along with this, the development and\nspread of drug-resistant TB strains is another big complicating matter. Faced\nwith these challenges, there is an urgent need to explore new vaccination\nstrategies in order to boost immunity against tuberculosis and shorten the\nduration of treatment. Computational modeling represents an extraordinary way\nto simulate and predict the outcome of vaccination strategies, speeding up the\narduous process of vaccine pipeline development and relative time to market.\nHere, we present EU - funded STriTuVaD project computational platform able to\npredict the artificial immunity induced by RUTI and ID93/GLA-SE, two specific\ntuberculosis vaccines. Such an in silico trial will be validated through a\nphase 2b clinical trial. Moreover, STriTuVaD computational framework is able to\ninform of the reasons for failure should the vaccinations strategies against M.\ntuberculosis under testing found not efficient, which will suggest possible\nimprovements.\n", "versions": [{"version": "v1", "created": "Sat, 26 Oct 2019 12:42:52 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Russo", "Giulia", ""], ["Pappalardo", "Francesco", ""], ["Juarez", "Miguel A.", ""], ["Pennisi", "Marzio", ""], ["Cardona", "Pere Joan", ""], ["Coler", "Rhea", ""], ["Fichera", "Epifanio", ""], ["Viceconti", "Marco", ""]]}, {"id": "1911.00356", "submitter": "Chen Jia", "authors": "Chen Jia", "title": "Kinetic foundation of the zero-inflated negative binomial model for\n  single-cell RNA sequencing data", "comments": "19 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Single-cell RNA sequencing data have complex features such as dropout events,\nover-dispersion, and high-magnitude outliers, resulting in complicated\nprobability distributions of mRNA abundances that are statistically\ncharacterized in terms of a zero-inflated negative binomial (ZINB) model. Here\nwe provide a mesoscopic kinetic foundation of the widely used ZINB model based\non the biochemical reaction kinetics underlying transcription. Using multiscale\nmodeling and simplification techniques, we show that the ZINB distribution of\nmRNA abundance and the phenomenon of transcriptional bursting naturally emerge\nfrom a three-state stochastic transcription model. We further reveal a\nnontrivial quantitative relation between dropout events and transcriptional\nbursting, which provides novel insights into how and to what extent the burst\nsize and burst frequency could reduce the dropout rate. Three different\nbiophysical origins of over-dispersion are also clarified at the single-cell\nlevel.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 13:06:55 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Jia", "Chen", ""]]}, {"id": "1911.00421", "submitter": "Chen Li", "authors": "Chen Li, Toni W\\\"ohrl, Han K. Lam, Robert J. Full", "title": "Cockroaches use diverse strategies to self-right on the ground", "comments": null, "journal-ref": "Journal of Experimental Biology (2019), 222, jeb186080", "doi": "10.1242/jeb.186080", "report-no": null, "categories": "physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Terrestrial animals often must self-right from an upside-down orientation on\nthe ground to survive. Here, we compared self-righting strategies of the\nMadagascar hissing, American, and discoid cockroaches on a challenging flat,\nrigid, low-friction surface to quantify the mechanical principles. All three\nspecies almost always self-righted (97% probability) when given time (30\nseconds), frequently self-righted (63%) on the first attempt, and on that\nattempt did so in one second or less. When successful, two of the three species\ngained and used pitch and/or roll rotational kinetic energy to overcome\npotential energy barriers (American 63% of all attempts and discoid 78%). By\ncontrast, the largest, heaviest, wingless cockroach (Madagascar hissing) relied\nfar less on the energy of motion and was the slowest to self-right. Two of the\nthree species used rolling strategies to overcome low potential energy\nbarriers. Successful righting attempts had greater rolling rotation than failed\nattempts as the center of mass rose to the highest position. Madagascar hissing\ncockroaches rolled using body deformation (98% of all trials) and the American\ncockroach relied on leg forces (93%). By contrast, the discoid cockroach\novercame higher and a wider range of potential energy barriers with\nsimultaneous pitching and rolling using wings (46% of all trials) and legs\n(49%) equally to self-right. Our quantification revealed the performance\nadvantages of using rotational kinetic energy to overcome the potential energy\nbarrier and rolling more to lower it, while maintaining diverse strategies for\nground-based self-righting.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 15:25:39 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Li", "Chen", ""], ["Wöhrl", "Toni", ""], ["Lam", "Han K.", ""], ["Full", "Robert J.", ""]]}, {"id": "1911.00515", "submitter": "Gustav M{\\aa}rtensson", "authors": "Gustav M{\\aa}rtensson, Daniel Ferreira, Tobias Granberg, Lena\n  Cavallin, Ketil Oppedal, Alessandro Padovani, Irena Rektorova, Laura Bonanni,\n  Matteo Pardini, Milica Kramberger, John-Paul Taylor, Jakub Hort, J\\'on\n  Sn{\\ae}dal, Jaime Kulisevsky, Frederic Blanc, Angelo Antonini, Patrizia\n  Mecocci, Bruno Vellas, Magda Tsolaki, Iwona K{\\l}oszewska, Hilkka Soininen,\n  Simon Lovestone, Andrew Simmons, Dag Aarsland, Eric Westman", "title": "The reliability of a deep learning model in clinical out-of-distribution\n  MRI data: a multicohort study", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": "10.1016/j.media.2020.101714", "report-no": null, "categories": "physics.med-ph cs.CV cs.LG eess.IV q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep learning (DL) methods have in recent years yielded impressive results in\nmedical imaging, with the potential to function as clinical aid to\nradiologists. However, DL models in medical imaging are often trained on public\nresearch cohorts with images acquired with a single scanner or with strict\nprotocol harmonization, which is not representative of a clinical setting. The\naim of this study was to investigate how well a DL model performs in unseen\nclinical data sets---collected with different scanners, protocols and disease\npopulations---and whether more heterogeneous training data improves\ngeneralization. In total, 3117 MRI scans of brains from multiple dementia\nresearch cohorts and memory clinics, that had been visually rated by a\nneuroradiologist according to Scheltens' scale of medial temporal atrophy\n(MTA), were included in this study. By training multiple versions of a\nconvolutional neural network on different subsets of this data to predict MTA\nratings, we assessed the impact of including images from a wider distribution\nduring training had on performance in external memory clinic data. Our results\nshowed that our model generalized well to data sets acquired with similar\nprotocols as the training data, but substantially worse in clinical cohorts\nwith visibly different tissue contrasts in the images. This implies that future\nDL studies investigating performance in out-of-distribution (OOD) MRI data need\nto assess multiple external cohorts for reliable results. Further, by including\ndata from a wider range of scanners and protocols the performance improved in\nOOD data, which suggests that more heterogeneous training data makes the model\ngeneralize better. To conclude, this is the most comprehensive study to date\ninvestigating the domain shift in deep learning on MRI data, and we advocate\nrigorous evaluation of DL models on clinical data prior to being certified for\ndeployment.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 15:52:16 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Mårtensson", "Gustav", ""], ["Ferreira", "Daniel", ""], ["Granberg", "Tobias", ""], ["Cavallin", "Lena", ""], ["Oppedal", "Ketil", ""], ["Padovani", "Alessandro", ""], ["Rektorova", "Irena", ""], ["Bonanni", "Laura", ""], ["Pardini", "Matteo", ""], ["Kramberger", "Milica", ""], ["Taylor", "John-Paul", ""], ["Hort", "Jakub", ""], ["Snædal", "Jón", ""], ["Kulisevsky", "Jaime", ""], ["Blanc", "Frederic", ""], ["Antonini", "Angelo", ""], ["Mecocci", "Patrizia", ""], ["Vellas", "Bruno", ""], ["Tsolaki", "Magda", ""], ["Kłoszewska", "Iwona", ""], ["Soininen", "Hilkka", ""], ["Lovestone", "Simon", ""], ["Simmons", "Andrew", ""], ["Aarsland", "Dag", ""], ["Westman", "Eric", ""]]}, {"id": "1911.00625", "submitter": "Hui Xue PhD", "authors": "Hui Xue, Rhodri Davies, Louis AE Brown, Kristopher D Knott, Tushar\n  Kotecha, Marianna Fontana, Sven Plein, James C Moon, Peter Kellman", "title": "Automated Inline Analysis of Myocardial Perfusion MRI with Deep Learning", "comments": "This work has been submitted to Radiology: Artificial Intelligence\n  for possible publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CV eess.IV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent development of quantitative myocardial blood flow (MBF) mapping allows\ndirect evaluation of absolute myocardial perfusion, by computing pixel-wise\nflow maps. Clinical studies suggest quantitative evaluation would be more\ndesirable for objectivity and efficiency. Objective assessment can be further\nfacilitated by segmenting the myocardium and automatically generating reports\nfollowing the AHA model. This will free user interaction for analysis and lead\nto a 'one-click' solution to improve workflow. This paper proposes a deep\nneural network based computational workflow for inline myocardial perfusion\nanalysis. Adenosine stress and rest perfusion scans were acquired from three\nhospitals. Training set included N=1,825 perfusion series from 1,034 patients.\nIndependent test set included 200 scans from 105 patients. Data were\nconsecutively acquired at each site. A convolution neural net (CNN) model was\ntrained to provide segmentation for LV cavity, myocardium and right ventricular\nby processing incoming 2D+T perfusion Gd series. Model outputs were compared to\nmanual ground-truth for accuracy of segmentation and flow measures derived on\nglobal and per-sector basis. The trained models were integrated onto MR\nscanners for effective inference. Segmentation accuracy and myocardial flow\nmeasures were compared between CNN models and manual ground-truth. The mean\nDice ratio of CNN derived myocardium was 0.93 +/- 0.04. Both global flow and\nper-sector values showed no significant difference, compared to manual results.\nThe AHA 16 segment model was automatically generated and reported on the MR\nscanner. As a result, the fully automated analysis of perfusion flow mapping\nwas achieved. This solution was integrated on the MR scanner, enabling\n'one-click' analysis and reporting of myocardial blood flow.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 01:33:56 GMT"}, {"version": "v2", "created": "Fri, 29 May 2020 14:22:58 GMT"}], "update_date": "2020-06-01", "authors_parsed": [["Xue", "Hui", ""], ["Davies", "Rhodri", ""], ["Brown", "Louis AE", ""], ["Knott", "Kristopher D", ""], ["Kotecha", "Tushar", ""], ["Fontana", "Marianna", ""], ["Plein", "Sven", ""], ["Moon", "James C", ""], ["Kellman", "Peter", ""]]}, {"id": "1911.00978", "submitter": "John Vastola", "authors": "John J. Vastola", "title": "Solving the chemical master equation for monomolecular reaction systems\n  analytically: a Doi-Peliti path integral view", "comments": "61 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The chemical master equation (CME) is a fundamental description of\ninteracting molecules commonly used to model chemical kinetics and noisy gene\nregulatory networks. Exact time-dependent solutions of the CME -- which\ntypically consists of infinitely many coupled differential equations -- are\nrare, and are valuable for numerical benchmarking and getting intuition for the\nbehavior of more complicated systems. Jahnke and Huisinga's landmark\ncalculation of the exact time-dependent solution of the CME for monomolecular\nreaction systems is one of the most general analytic results known; however, it\nis hard to generalize, because it relies crucially on properties of\nmonomolecular reactions. In this paper, we rederive Jahnke and Huisinga's\nresult on the time-dependent probability distribution and moments of\nmonomolecular reaction systems using the Doi-Peliti path integral approach,\nwhich reduces solving the CME to evaluating many integrals. While the\nDoi-Peliti approach is less intuitive, it is also more mechanical, and hence\neasier to generalize. To illustrate how the Doi-Peliti approach can go beyond\nthe method of Jahnke and Huisinga, we also find an explicit and exact\ntime-dependent solution to a problem involving an autocatalytic reaction that\nJahnke and Huisinga identified as not solvable using their method. We also find\na formal exact time-dependent solution for any CME whose list of reactions\ninvolves only zero and first order reactions, which may be the most general\nresult currently known.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2019 21:45:07 GMT"}, {"version": "v2", "created": "Tue, 2 Feb 2021 22:40:40 GMT"}], "update_date": "2021-02-04", "authors_parsed": [["Vastola", "John J.", ""]]}, {"id": "1911.00996", "submitter": "Shigang Liu", "authors": "Shigang Liu, Jun Zhang, Yang Xiang, Wanlei Zhou, Dongxi Xiang", "title": "A Study of Data Pre-processing Techniques for Imbalanced Biomedical Data\n  Classification", "comments": "This paper is scheduled for inclusion in V16 N3 2020, International\n  Journal of Bioinformatics Research and Applications (IJBRA)", "journal-ref": "V16 N3, International Journal of Bioinformatics Research and\n  Applications (IJBRA), 2020", "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Biomedical data are widely accepted in developing prediction models for\nidentifying a specific tumor, drug discovery and classification of human\ncancers. However, previous studies usually focused on different classifiers,\nand overlook the class imbalance problem in real-world biomedical datasets.\nThere are a lack of studies on evaluation of data pre-processing techniques,\nsuch as resampling and feature selection, on imbalanced biomedical data\nlearning. The relationship between data pre-processing techniques and the data\ndistributions has never been analysed in previous studies. This article mainly\nfocuses on reviewing and evaluating some popular and recently developed\nresampling and feature selection methods for class imbalance learning. We\nanalyse the effectiveness of each technique from data distribution perspective.\nExtensive experiments have been done based on five classifiers, four\nperformance measures, eight learning techniques across twenty real-world\ndatasets. Experimental results show that: (1) resampling and feature selection\ntechniques exhibit better performance using support vector machine (SVM)\nclassifier. However, resampling and Feature Selection techniques perform poorly\nwhen using C4.5 decision tree and Linear discriminant analysis classifiers; (2)\nfor datasets with different distributions, techniques such as Random\nundersampling and Feature Selection perform better than other data\npre-processing methods with T Location-Scale distribution when using SVM and\nKNN (K-nearest neighbours) classifiers. Random oversampling outperforms other\nmethods on Negative Binomial distribution using Random Forest classifier with\nlower level of imbalance ratio; (3) Feature Selection outperforms other data\npre-processing methods in most cases, thus, Feature Selection with SVM\nclassifier is the best choice for imbalanced biomedical data learning.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 00:32:32 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Liu", "Shigang", ""], ["Zhang", "Jun", ""], ["Xiang", "Yang", ""], ["Zhou", "Wanlei", ""], ["Xiang", "Dongxi", ""]]}, {"id": "1911.01240", "submitter": "Chen Li", "authors": "Sean W. Gart, Thomas W. Mitchel, Chen Li", "title": "Snakes partition their body to traverse large steps stably", "comments": null, "journal-ref": "Journal of Experimental Biology (2019), 222, jeb185991", "doi": "10.1242/jeb.185991", "report-no": null, "categories": "physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many snakes live in deserts, forests, and river valleys and traverse\nchallenging 3-D terrain like rocks, felled trees, and rubble, with obstacles as\nlarge as themselves and variable surface properties. By contrast, apart from\nbranch cantilevering, burrowing, swimming, and gliding, laboratory studies of\nsnake locomotion focused on that on simple flat surfaces. Here, to begin to\nunderstand snake locomotion in complex 3-D terrain, we study how the variable\nkingsnake, a terrestrial generalist, traversed a large step of variable surface\nfriction and step height (up to 30% snout-vent length). The snake traversed by\npartitioning its body into three sections with distinct functions. Body\nsections below and above the step oscillated laterally on horizontal surfaces\nfor propulsion, while the body section in between cantilevered in a vertical\nplane to bridge the large height increase. As the animal progressed, these\nthree sections traveled down its body, conforming overall body shape to the\nstep. In addition, the snake adjusted the partitioned gait in response to\nincrease in step height and decrease in surface friction, at the cost of\nreduced speed. As surface friction decreased, body movement below and above the\nstep changed from a continuous lateral undulation with little slip to an\nintermittent oscillatory movement with much slip, and initial head lift-off\nbecame closer to the step. Given these adjustments, body partitioning allowed\nthe snake to be always stable, even when initially cantilevering but before\nreaching the surface above. Such a partitioned gait may be generally useful for\ndiverse, complex 3-D terrain.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 14:23:52 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Gart", "Sean W.", ""], ["Mitchel", "Thomas W.", ""], ["Li", "Chen", ""]]}, {"id": "1911.01304", "submitter": "Nathan Gold", "authors": "Nathan Gold, Christophe L. Herry, Xiaogang Wang, Martin G. Frasch", "title": "Fetal cardiovascular decompensation during labor predicted from the\n  individual heart rate: a prospective study in fetal sheep near term and the\n  impact of low sampling rate", "comments": null, "journal-ref": "Front. Pediatr. 2021", "doi": "10.3389/fped.2021.593889", "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We present a novel computerized fetal heart rate intrapartum algorithm for\nearly and individualized prediction of fetal cardiovascular decompensation, a\nkey event in the causal chain leading to brain injury. This real-time machine\nlearning algorithm performs well on noisy fetal heart rate data and requires ~2\nhours to train on the individual fetal heart rate tracings in the first stage\nof labor; once trained, the algorithm predicts the event of fetal\ncardiovascular decompensation with 92% sensitivity. We show that the\nalgorithm's performance suffers reducing sensitivity to 67% when the fetal\nheart rate is acquired at the sampling rate of 4 Hz used in ultrasound\ncardiotocographic monitors compared to the electrocardiogram(ECG)-derived\nsignals as can be acquired from maternal abdominal ECG.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 16:12:57 GMT"}, {"version": "v2", "created": "Tue, 5 Nov 2019 21:28:33 GMT"}], "update_date": "2021-04-21", "authors_parsed": [["Gold", "Nathan", ""], ["Herry", "Christophe L.", ""], ["Wang", "Xiaogang", ""], ["Frasch", "Martin G.", ""]]}, {"id": "1911.01477", "submitter": "Farzad Khalvati", "authors": "Khashayar Namdar, Isha Gujrathi, Masoom A. Haider, Farzad Khalvati", "title": "Evolution-based Fine-tuning of CNNs for Prostate Cancer Detection", "comments": "Accepted for the 33rd Conference on Neural Information Processing\n  Systems (NeurIPS 2019), Medical Imaging Meets NEURIPS Workshop", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Convolutional Neural Networks (CNNs) have been used for automated detection\nof prostate cancer where Area Under Receiver Operating Characteristic (ROC)\ncurve (AUC) is usually used as the performance metric. Given that AUC is not\ndifferentiable, common practice is to train the CNN using a loss functions\nbased on other performance metrics such as cross entropy and monitoring AUC to\nselect the best model. In this work, we propose to fine-tune a trained CNN for\nprostate cancer detection using a Genetic Algorithm to achieve a higher AUC.\nOur dataset contained 6-channel Diffusion-Weighted MRI slices of prostate. On a\ncohort of 2,955 training, 1,417 validation, and 1,334 test slices, we reached\ntest AUC of 0.773; a 9.3% improvement compared to the base CNN model.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 20:40:29 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Namdar", "Khashayar", ""], ["Gujrathi", "Isha", ""], ["Haider", "Masoom A.", ""], ["Khalvati", "Farzad", ""]]}, {"id": "1911.01797", "submitter": "Chen Li", "authors": "Chen Li, Andrew O. Pullin, Duncan W. Haldane, Han K. Lam, Ronald S.\n  Fearing, and Robert J. Full", "title": "Terradynamically streamlined shapes in animals and robots enhances\n  traversability through densely cluttered terrain", "comments": null, "journal-ref": "Bioinspiration & Biomimetics (2015), 10, 046003", "doi": "10.1088/1748-3190/10/4/046003", "report-no": null, "categories": "physics.bio-ph cs.SY eess.SY q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many animals, modern aircraft, and underwater vehicles use streamlined body\nshapes that reduce fluid dynamic drag to achieve fast and effective locomotion\nin air and water. Similarly, numerous small terrestrial animals move through\ncluttered terrain where 3-D, multi-component obstacles like grass, shrubs,\nvines, and leaf litter resist motion, but it is unknown whether their body\nshape plays a major role in traversal. Few ground vehicles or terrestrial\nrobots have used body shape to effectively traverse cluttered terrain. Here, we\nchallenged forest-floor-dwelling discoid cockroaches possessing a thin, rounded\nbody to traverse tall, narrowly spaced, vertical, grass-like compliant beams.\nAnimals displayed high traversal performance (79 +/- 12% probability and 3.4\n+/- 0.7 s time). Although we observed diverse traversal strategies, cockroaches\nprimarily (48 +/- 9 % probability) used a novel roll maneuver, allowing them to\nrapidly traverse obstacle gaps narrower than half body width (2.0 +/- 0.5 s\ntraversal time). Reduction of body roundness by addition of artificial shells\nnearly inhibited roll maneuvers and decreased traversal performance. Inspired\nby this discovery, we added a thin, rounded exoskeletal shell to a legged robot\nwith a nearly cuboidal body, common to many existing terrestrial robots.\nWithout adding sensory feedback or changing the open-loop control, the rounded\nshell enabled the robot to traverse beam obstacles with gaps narrower than\nshell width via body roll. Terradynamically streamlined shapes can reduce\nterrain resistance and enhance traversability by assisting effective body\nreorientation via distributed mechanical feedback. Our findings highlight the\nneed to consider body shape to improve robot mobility in real-world terrain\noften filled with clutter, and to develop better locomotor-ground contact\nmodels to understand interaction with complex terrain.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 15:37:25 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Li", "Chen", ""], ["Pullin", "Andrew O.", ""], ["Haldane", "Duncan W.", ""], ["Lam", "Han K.", ""], ["Fearing", "Ronald S.", ""], ["Full", "Robert J.", ""]]}, {"id": "1911.02095", "submitter": "Gowri Nayar", "authors": "Edward E. Seabolt, Gowri Nayar, Harsha Krishnareddy, Akshay Agarwal,\n  Kristen L. Beck, Ignacio Terrizzano, Eser Kandogan, Mary Roth, Vandana\n  Mukherjee, and James H. Kaufman", "title": "IBM Functional Genomics Platform, A Cloud-Based Platform for Studying\n  Microbial Life at Scale", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid growth in biological sequence data is revolutionizing our\nunderstanding of genotypic diversity and challenging conventional approaches to\ninformatics. With the increasing availability of genomic data, traditional\nbioinformatic tools require substantial computational time and the creation of\never-larger indices each time a researcher seeks to gain insight from the data.\nTo address these challenges, we pre-computed important relationships between\nbiological entities spanning the Central Dogma of Molecular Biology and\ncaptured this information in a relational database. The database can be queried\nacross hundreds of millions of entities and returns results in a fraction of\nthe time required by traditional methods. In this paper, we describe\n\\textit{IBM Functional Genomics Platform} (formerly known as OMXWare), a\ncomprehensive database relating genotype to phenotype for bacterial life.\nContinually updated, IBM Functional Genomics Platform today contains data\nderived from 200,000 curated, self-consistently assembled genomes. The database\nstores functional data for over 68 million genes, 52 million proteins, and 239\nmillion domains with associated biological activity annotations from Gene\nOntology, KEGG, MetaCyc, and Reactome. IBM Functional Genomics Platform maps\nall of the many-to-many connections between each biological entity including\nthe originating genome, gene, protein, and protein domain. Various microbial\nstudies, from infectious disease to environmental health, can benefit from the\nrich data and connections. We describe the data selection, the pipeline to\ncreate and update the IBM Functional Genomics Platform, and the developer tools\n(Python SDK and REST APIs) which allow researchers to efficiently study\nmicrobial life at scale.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 21:32:25 GMT"}, {"version": "v2", "created": "Sun, 15 Mar 2020 19:29:18 GMT"}, {"version": "v3", "created": "Mon, 30 Mar 2020 23:14:33 GMT"}], "update_date": "2020-04-01", "authors_parsed": [["Seabolt", "Edward E.", ""], ["Nayar", "Gowri", ""], ["Krishnareddy", "Harsha", ""], ["Agarwal", "Akshay", ""], ["Beck", "Kristen L.", ""], ["Terrizzano", "Ignacio", ""], ["Kandogan", "Eser", ""], ["Roth", "Mary", ""], ["Mukherjee", "Vandana", ""], ["Kaufman", "James H.", ""]]}, {"id": "1911.02243", "submitter": "Khaled Khleifat Dr", "authors": "M. Jaafreh, K.M. Khleifat, H. Qaralleh, M.O Al-limoun", "title": "Antibacterial and Antioxidant Activities of Centeurea damascena\n  Methanolic Extract", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The family Asteraceae include large number of Centaurea species which have\nbeen applied in folk medicine. One of the family Asteraceae members is the\nCentaurea damascena which authentically been tested for its antibacterial and\nantioxidant activity as well as its toxicity. The aims of the study were to\ndetermine the antimicrobial and antioxidant activities and toxicity of\nmethanolic plant extracts of Centaurea damascena. The methanolic extracts were\nscreened for their antibacterial activity against nine bacteria (Staphylococcus\naureus ATCC 43300, Bacillus subtilis ATCC 6633, Micrococcus luteus ATCC 10240,\nand Staphylococcus epidermidis ATCC 12228, Escherichia coli ATCC 11293,\nPseudomonas aerugino and Klebsiella pneumoniae, Enterobacter aerogenes ATCC\n13048 and Salmonella typhi ATCC19430). The antibacterial activity was assessed\nby using the disc diffusion methods and the minimum inhibition concentrations\n(MIC) using microdilution method. The extracts from Centaurea damascena\npossessed antibacterial activity against several of the tested microorganisms.\nThe MIC of methanol extract of C. damascena ranged from 60 to 1100 microgram\nper mL. Free radical scavenging capacity of the C. damascena methanol extract\nwas calculated by DPPH and FRAP test. DPPH radicals were scavenged with an IC50\nvalue of 17.08 microgram per mL. Antioxidant capacities obtained by the FRAP\nwas 51.9 and expressed in mg Trolox per gram dry weight. The total phenolic\ncompounds of the methanol extracts of aerial parts, as estimated by\nFolin_Ciocalteu reagent method, was about 460 mg GAE per gram. The phenolic\ncontents in the extracts highly correlate with their antioxidant activity,\nconfirming that the antioxidant activity of this plant extracts is considerably\nphenolic contents-dependent.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 08:01:38 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Jaafreh", "M.", ""], ["Khleifat", "K. M.", ""], ["Qaralleh", "H.", ""], ["Al-limoun", "M. O", ""]]}, {"id": "1911.02244", "submitter": "Khaled Khleifat Dr", "authors": "Haitham Qaralleh, Muhamad O. Al-limoun, Khaled M. Khleifat, Khaled Y\n  Alsharafa, Amjad A. Al Tarawnehc", "title": "Vitreoscilla sp. hemoglobin (VHb) Expression in Heterologous Hosts: Some\n  Aspects of Their Biotechnological Application", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is worth mentioning that the high output of different physiological\nresponses under the expression of vgb, may have a considerable effect on the\nenzyme productivity, dairy industry, heavy metal uptake, biodegradation of\ndifferent organic pollutants and other applications. The expression of\nbacterial haemoglobin is useful in lessening the load of perceived toxic\nconditions such as high oxygen levels. This in turn probably has the same\nimpact on some peripheral toxic materials. This, hemoglobin biotechnology can\nbe extended to enhance production of pollutants degrading enzymes or production\nof some valuable manufacturing materials on the case by case bases. It is\nlikely that the mechanism of bacterial hemoglobin (VHb) effects is\nintermediated via an oxygen trapping action. This may drive the enrichment of\nATP production, which is mostly required for higher productivity of needed\nsubstances for that activity.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 08:05:55 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Qaralleh", "Haitham", ""], ["Al-limoun", "Muhamad O.", ""], ["Khleifat", "Khaled M.", ""], ["Alsharafa", "Khaled Y", ""], ["Tarawnehc", "Amjad A. Al", ""]]}, {"id": "1911.02245", "submitter": "Khaled Khleifat Dr", "authors": "Ibtihal Nayel ALrawashdeh, Haitham Qaralleh, Muhamad O. Al-limoun,\n  Khaled M. Khleifat", "title": "Antibactrial Activity of Asteriscus graveolens Methanolic Extract:\n  Synergistic Effect with Fungal Mediated Nanoparticles against Some Enteric\n  Bacterial Human Pathogens", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Antibactrial activity of Asteriscus graveolens methanolic extract and its\nsynergy effect with fungal mediated silver nanoparticles (AgNPs) against some\nenteric bacterial human pathogen was conducted. Silver nanoparticles were\nsynthesized by the fungal strain namely Tritirachium oryzae W5H as reported\nearly. In this study, MICs of AgNPs against E. aerogenes, Salmonella sp., E.\ncoli and C. albicans in order were 2.13, 19.15, 0.08 and 6.38 micrograms per\nmL, respectively, while the MICs of A. graveolens ethanolic extract against the\nsame bacteria were 4, 366, 3300 and 40 micrograms per mL, respectively. The MIC\nvalues at concentration less than 19.15 and 40 micrograms per mL indicating the\npotent bacteriostatic effect of AgNPs and A. graveolens ethanolic\nextract.Increasing in IFA was reported when Nitrofurantion and Trimethoprim\nwere combined with Etoh extract with maximum increase in IFA by 6 and 12 folds\nfor, respectively. Also, 10 folds increasing in IFA was reported when\ntrimethoprim was combined with AgNPs: Etoh extract.But, there were no\nsynergistic effect between the antifungal agents (Caspofungin and Micafungin)\ncombined with AgNPs and or A. graveolens ethanolic extract against C.\nalbicans.The potent synergistic effect of A. graveolens ethanolic extract\nand/or NPs with the conventional antibiotics is novel in inhibiting antibiotics\nresistant bacteria. In this study, remarkable increasing in the antibacterial\nactivity, when the most resistant antibiotics combined with A. graveolense\nthanolic extract and/or NPs was reported.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 08:09:07 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["ALrawashdeh", "Ibtihal Nayel", ""], ["Qaralleh", "Haitham", ""], ["Al-limoun", "Muhamad O.", ""], ["Khleifat", "Khaled M.", ""]]}, {"id": "1911.02526", "submitter": "Chen Li", "authors": "Sean W. Gart, Changxin Yan, Ratan Othayoth, Zhiyi Ren, Chen Li", "title": "Dynamic traversal of large gaps by insects and legged robots reveals a\n  template", "comments": null, "journal-ref": "Bioinspiration & Biomimetics (2018), 13, 026006", "doi": "10.1088/1748-3190/aaa2cd", "report-no": null, "categories": "physics.bio-ph cs.SY eess.SY q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that animals can use neural and sensory feedback via vision,\ntactile sensing, and echolocation to negotiate obstacles. Similarly, most\nrobots use deliberate or reactive planning to avoid obstacles, which relies on\nprior knowledge or high-fidelity sensing of the environment. However, during\ndynamic locomotion in complex, novel, 3-D terrains such as forest floor and\nbuilding rubble, sensing and planning suffer bandwidth limitation and large\nnoise and are sometimes even impossible. Here, we study rapid locomotion over a\nlarge gap, a simple, ubiquitous obstacle, to begin to discover general\nprinciples of dynamic traversal of large 3-D obstacles. We challenged the\ndiscoid cockroach and an open-loop six-legged robot to traverse a large gap of\nvarying length. Both the animal and the robot could dynamically traverse a gap\nas large as 1 body length by bridging the gap with its head, but traversal\nprobability decreased with gap length. Based on these observations, we\ndeveloped a template that well captured body dynamics and quantitatively\npredicted traversal performance. Our template revealed that high approach\nspeed, initial body pitch, and initial body pitch angular velocity facilitated\ndynamic traversal, and successfully predicted a new strategy of using body\npitch control that increased the robot maximal traversal gap length by 50%. Our\nstudy established the first template of dynamic locomotion beyond planar\nsurfaces and is an important step in expanding terradynamics into complex 3-D\nterrains.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 16:18:23 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Gart", "Sean W.", ""], ["Yan", "Changxin", ""], ["Othayoth", "Ratan", ""], ["Ren", "Zhiyi", ""], ["Li", "Chen", ""]]}, {"id": "1911.02527", "submitter": "Chen Li", "authors": "Sean W. Gart, Chen Li", "title": "Body-terrain interaction affects large bump traversal of insects and\n  legged robots", "comments": null, "journal-ref": "Bioinspiration & Biomimetics (2018), 13, 026005", "doi": "10.1088/1748-3190/aaa2d0", "report-no": null, "categories": "physics.bio-ph cs.RO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Small animals and robots must often rapidly traverse large bump-like\nobstacles when moving through complex 3-D terrains, during which, in addition\nto leg-ground contact, their body inevitably comes into physical contact with\nthe obstacles. However, we know little about the performance limits of large\nbump traversal and how body-terrain interaction affects traversal. To address\nthese, we challenged the discoid cockroach and an open-loop six-legged robot to\ndynamically run into a large bump of varying height to discover the maximal\ntraversal performance, and studied how locomotor modes and traversal\nperformance are affected by body-terrain interaction. Remarkably, during rapid\nrunning, both the animal and the robot were capable of dynamically traversing a\nbump much higher than its hip height (up to 4 times the hip height for the\nanimal and 3 times for the robot, respectively) at traversal speeds typical of\nrunning, with decreasing traversal probability with increasing bump height. A\nstability analysis using a novel locomotion energy landscape model explained\nwhy traversal was more likely when the animal or robot approached the bump with\na low initial body yaw and a high initial body pitch, and why deflection was\nmore likely otherwise. Inspired by these principles, we demonstrated a novel\ncontrol strategy of active body pitching that increased the robot maximal\ntraversable bump height by 75%. Our study is a major step in establishing the\nframework of locomotion energy landscapes to understand locomotion in complex\n3-D terrains.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 16:21:38 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Gart", "Sean W.", ""], ["Li", "Chen", ""]]}, {"id": "1911.02551", "submitter": "Tal Galili", "authors": "Tal Galili, Alan OCallaghan, Jonathan Sidi, Carson Sievert", "title": "heatmaply: an R package for creating interactive cluster heatmaps for\n  online publishing", "comments": "3 pages", "journal-ref": "Bioinformatics 34.9 (2017): 1600-1602", "doi": "10.1093/bioinformatics/btx657", "report-no": null, "categories": "q-bio.QM stat.CO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Summary: heatmaply is an R package for easily creating interactive cluster\nheatmaps that can be shared online as a stand-alone HTML file. Interactivity\nincludes a tooltip display of values when hovering over cells, as well as the\nability to zoom in to specific sections of the figure from the data matrix, the\nside dendrograms, or annotated labels. Thanks to the synergistic relationship\nbetween heatmaply and other R packages, the user is empowered by a refined\ncontrol over the statistical and visual aspects of the heatmap layout.\n  Availability and implementation: The heatmaply package is available under the\nGPL-2 Open Source license. It comes with a detailed vignette, and is freely\navailable from: http://cran.r-project.org/package=heatmaply.\n  Supplementary information: Supplementary data are available at Bioinformatics\nonline.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 13:33:44 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Galili", "Tal", ""], ["OCallaghan", "Alan", ""], ["Sidi", "Jonathan", ""], ["Sievert", "Carson", ""]]}, {"id": "1911.03044", "submitter": "Min Xu", "authors": "Xiangrui Zeng, Min Xu", "title": "AITom: Open-source AI platform for cryo-electron tomography data\n  analysis", "comments": "2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG eess.IV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cryo-electron tomography (cryo-ET) is an emerging technology for the 3D\nvisualization of structural organizations and interactions of subcellular\ncomponents at near-native state and sub-molecular resolution. Tomograms\ncaptured by cryo-ET contain heterogeneous structures representing the complex\nand dynamic subcellular environment. Since the structures are not purified or\nfluorescently labeled, the spatial organization and interaction between both\nthe known and unknown structures can be studied in their native environment.\nThe rapid advances of cryo-electron tomography (cryo-ET) have generated\nabundant 3D cellular imaging data. However, the systematic localization,\nidentification, segmentation, and structural recovery of the subcellular\ncomponents require efficient and accurate large-scale image analysis methods.\nWe introduce AITom, an open-source artificial intelligence platform for cryo-ET\nresearchers. AITom provides many public as well as in-house algorithms for\nperforming cryo-ET data analysis through both the traditional template-based or\ntemplate-free approach and the deep learning approach. AITom also supports\nremote interactive analysis. Comprehensive tutorials for each analysis module\nare provided to guide the user through. We welcome researchers and developers\nto join this collaborative open-source software development project.\nAvailability: https://github.com/xulabs/aitom\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 04:33:18 GMT"}, {"version": "v2", "created": "Fri, 30 Oct 2020 17:44:31 GMT"}], "update_date": "2020-11-02", "authors_parsed": [["Zeng", "Xiangrui", ""], ["Xu", "Min", ""]]}, {"id": "1911.03221", "submitter": "Valentin Thorey", "authors": "Antoine Guillot, Fabien Sauvet, Emmanuel H During and Valentin Thorey", "title": "Dreem Open Datasets: Multi-Scored Sleep Datasets to compare Human and\n  Automated sleep staging", "comments": "10 pages, journal submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG eess.SP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sleep stage classification constitutes an important element of sleep disorder\ndiagnosis. It relies on the visual inspection of polysomnography records by\ntrained sleep technologists. Automated approaches have been designed to\nalleviate this resource-intensive task. However, such approaches are usually\ncompared to a single human scorer annotation despite an inter-rater agreement\nof about 85 % only. The present study introduces two publicly-available\ndatasets, DOD-H including 25 healthy volunteers and DOD-O including 55 patients\nsuffering from obstructive sleep apnea (OSA). Both datasets have been scored by\n5 sleep technologists from different sleep centers. We developed a framework to\ncompare automated approaches to a consensus of multiple human scorers. Using\nthis framework, we benchmarked and compared the main literature approaches. We\nalso developed and benchmarked a new deep learning method, SimpleSleepNet,\ninspired by current state-of-the-art. We demonstrated that many methods can\nreach human-level performance on both datasets. SimpleSleepNet achieved an F1\nof 89.9 % vs 86.8 % on average for human scorers on DOD-H, and an F1 of 88.3 %\nvs 84.8 % on DOD-O. Our study highlights that using state-of-the-art automated\nsleep staging outperforms human scorers performance for healthy volunteers and\npatients suffering from OSA. Consideration could be made to use automated\napproaches in the clinical setting.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 16:12:43 GMT"}, {"version": "v2", "created": "Tue, 12 Nov 2019 17:21:23 GMT"}, {"version": "v3", "created": "Mon, 2 Mar 2020 16:53:12 GMT"}, {"version": "v4", "created": "Mon, 27 Apr 2020 09:45:45 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Guillot", "Antoine", ""], ["Sauvet", "Fabien", ""], ["During", "Emmanuel H", ""], ["Thorey", "Valentin", ""]]}, {"id": "1911.03295", "submitter": "Mohammad Taha Bahadori", "authors": "Mohammad Taha Bahadori and Layne C. Price", "title": "Discovering Invariances in Healthcare Neural Networks", "comments": "The extended version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the invariance characteristics of pre-trained predictive models by\nempirically learning transformations on the input that leave the prediction\nfunction approximately unchanged. To learn invariant transformations, we\nminimize the Wasserstein distance between the predictive distribution\nconditioned on the data instances and the predictive distribution conditioned\non the transformed data instances. To avoid finding degenerate or perturbative\ntransformations, we add a similarity regularization to discourage similarity\nbetween the data and its transformed values. We theoretically analyze the\ncorrectness of the algorithm and the structure of the solutions. Applying the\nproposed technique to clinical time series data, we discover variables that\ncommonly-used LSTM models do not rely on for their prediction, especially when\nthe LSTM is trained to be adversarially robust. We also analyze the invariances\nof BioBERT on clinical notes and discover words that it is invariant to.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 14:48:05 GMT"}, {"version": "v2", "created": "Tue, 14 Jan 2020 03:40:38 GMT"}, {"version": "v3", "created": "Tue, 3 Mar 2020 18:00:06 GMT"}], "update_date": "2020-03-04", "authors_parsed": [["Bahadori", "Mohammad Taha", ""], ["Price", "Layne C.", ""]]}, {"id": "1911.03445", "submitter": "Santiago Schnell", "authors": "Justin Eilertsen, Santiago Schnell", "title": "The Quasi-Steady-State Approximations revisited: Timescales, small\n  parameters, singularities, and normal forms in enzyme kinetic", "comments": "50 pages, 10 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this work, we revisit the scaling analysis and commonly accepted\nconditions for the validity of the standard, reverse and total\nquasi-steady-state approximations through the lens of dimensional\nTikhonov-Fenichel parameters and their respective critical manifolds. By\ncombining Tikhonov-Fenichel parameters with scaling analysis and energy\nmethods, we derive improved upper bounds on the approximation error for the\nstandard, reverse and total quasi-steady-state approximations. Furthermore,\nprevious analyses suggest that the reverse quasi-steady-state approximation is\nonly valid when initial enzyme concentrations greatly exceed initial substrate\nconcentrations. However, our results indicate that this approximation can be\nvalid when initial enzyme and substrate concentrations are of equal magnitude.\nUsing energy methods, we find that the condition for the validity of the\nreverse quasi-steady-state approximation is far less restrictive than was\npreviously assumed, and we derive a new \"small\" parameter that determines the\nvalidity of this approximation. In doing so, we extend the established domain\nof validity for the reverse quasi-steady-state approximation. Consequently,\nthis opens up the possibility of utilizing the reverse quasi-steady-state\napproximation to model enzyme catalyzed reactions and estimate kinetic\nparameters in enzymatic assays at much lower enzyme to substrate ratios than\nwas previously thought. Moreover, we show for the first time that the critical\nmanifold of the reverse quasi-steady-state approximation contains a singular\npoint where normal hyperbolicity is lost. Associated with this singularity is a\ntranscritical bifurcation, and the corresponding normal form of this\nbifurcation is recovered through scaling analysis.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 18:54:18 GMT"}, {"version": "v2", "created": "Wed, 4 Mar 2020 20:15:19 GMT"}, {"version": "v3", "created": "Wed, 27 May 2020 19:04:59 GMT"}], "update_date": "2020-05-29", "authors_parsed": [["Eilertsen", "Justin", ""], ["Schnell", "Santiago", ""]]}, {"id": "1911.03723", "submitter": "Chen Chen", "authors": "Chen Chen, Chen Qin, Huaqi Qiu, Giacomo Tarroni, Jinming Duan, Wenjia\n  Bai, and Daniel Rueckert", "title": "Deep learning for cardiac image segmentation: A review", "comments": "Under review", "journal-ref": null, "doi": "10.3389/fcvm.2020.00025", "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep learning has become the most widely used approach for cardiac image\nsegmentation in recent years. In this paper, we provide a review of over 100\ncardiac image segmentation papers using deep learning, which covers common\nimaging modalities including magnetic resonance imaging (MRI), computed\ntomography (CT), and ultrasound (US) and major anatomical structures of\ninterest (ventricles, atria and vessels). In addition, a summary of publicly\navailable cardiac image datasets and code repositories are included to provide\na base for encouraging reproducible research. Finally, we discuss the\nchallenges and limitations with current deep learning-based approaches\n(scarcity of labels, model generalizability across different domains,\ninterpretability) and suggest potential directions for future research.\n", "versions": [{"version": "v1", "created": "Sat, 9 Nov 2019 15:58:48 GMT"}], "update_date": "2020-03-10", "authors_parsed": [["Chen", "Chen", ""], ["Qin", "Chen", ""], ["Qiu", "Huaqi", ""], ["Tarroni", "Giacomo", ""], ["Duan", "Jinming", ""], ["Bai", "Wenjia", ""], ["Rueckert", "Daniel", ""]]}, {"id": "1911.03839", "submitter": "Dongrui Wu", "authors": "Bo Zhang and Yuqi Cui and Meng Wang and Jingjing Li and Lei Jin and\n  Dongrui Wu", "title": "In Vitro Fertilization (IVF) Cumulative Pregnancy Rate Prediction from\n  Basic Patient Characteristics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CY cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tens of millions of women suffer from infertility worldwide each year. In\nvitro fertilization (IVF) is the best choice for many such patients. However,\nIVF is expensive, time-consuming, and both physically and emotionally\ndemanding. The first question that a patient usually asks before the IVF is how\nlikely she will conceive, given her basic medical examination information. This\npaper proposes three approaches to predict the cumulative pregnancy rate after\nmultiple oocyte pickup cycles. Experiments on 11,190 patients showed that first\nclustering the patients into different groups and then building a support\nvector machine model for each group can achieve the best overall performance.\nOur model could be a quick and economic approach for reliably estimating the\ncumulative pregnancy rate for a patient, given only her basic medical\nexamination information, well before starting the actual IVF procedure. The\npredictions can help the patient make optimal decisions on whether to use her\nown oocyte or donor oocyte, how many oocyte pickup cycles she may need, whether\nto use embryo frozen, etc. They will also reduce the patient's cost and time to\npregnancy, and improve her quality of life.\n", "versions": [{"version": "v1", "created": "Sun, 10 Nov 2019 03:00:07 GMT"}], "update_date": "2019-11-12", "authors_parsed": [["Zhang", "Bo", ""], ["Cui", "Yuqi", ""], ["Wang", "Meng", ""], ["Li", "Jingjing", ""], ["Jin", "Lei", ""], ["Wu", "Dongrui", ""]]}, {"id": "1911.04218", "submitter": "Matti Molkkari", "authors": "Matti Molkkari, Giorgio Angelotti, Thorsten Emig, Esa R\\\"as\\\"anen", "title": "Dynamical Heart Beat Correlations during Running", "comments": "19 pages, 10 figures", "journal-ref": "Sci Rep 10, 13627 (2020)", "doi": "10.1038/s41598-020-70358-7", "report-no": null, "categories": "physics.data-an physics.med-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fluctuations of the human heart beat constitute a complex system that has\nbeen studied mostly under resting conditions using conventional time series\nanalysis methods. During physical exercise, the variability of the fluctuations\nis reduced, and the time series of beat-to-beat RR intervals (RRIs) become\nhighly non-stationary. Here we develop a dynamical approach to analyze the time\nevolution of RRI correlations in running across various training and racing\nevents under real-world conditions. In particular, we introduce dynamical\ndetrended fluctuation analysis and dynamical partial autocorrelation functions,\nwhich are able to detect real-time changes in the scaling and correlations of\nthe RRIs as functions of the scale and the lag. We relate these changes to the\nexercise intensity quantified by the heart rate (HR). Beyond subject-specific\nHR thresholds the RRIs show multiscale anticorrelations with both universal and\nindividual scale-dependent structure that is potentially affected by the stride\nfrequency. These preliminary results are encouraging for future applications of\nthe dynamical statistical analysis in exercise physiology and cardiology, and\nthe presented methodology is also applicable across various disciplines.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 12:51:47 GMT"}, {"version": "v2", "created": "Wed, 26 Feb 2020 15:21:42 GMT"}, {"version": "v3", "created": "Fri, 3 Jul 2020 16:30:42 GMT"}], "update_date": "2020-08-13", "authors_parsed": [["Molkkari", "Matti", ""], ["Angelotti", "Giorgio", ""], ["Emig", "Thorsten", ""], ["Räsänen", "Esa", ""]]}, {"id": "1911.04374", "submitter": "Laura-Jayne Gardiner", "authors": "Laura-Jayne Gardiner, Anna Paola Carrieri, Jenny Wilshaw, Stephen\n  Checkley, Edward O Pyzer-Knapp and Ritesh Krishna", "title": "Combining human cell line transcriptome analysis and Bayesian inference\n  to build trustworthy machine learning models for prediction of animal\n  toxicity in drug development", "comments": "Machine Learning for Health (ML4H) at NeurIPS 2019 - Extended\n  Abstract", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biomedical data, particularly in the field of genomics, has characteristics\nwhich make it challenging for machine learning applications - it can be sparse,\nhigh dimensional and noisy. Biomedical applications also present challenges to\nmodel selection - whilst powerful, accurate predictions are necessary, they\nalone are not sufficient for a model to be deemed useful. Due to the nature of\nthe predictions, a model must also be trustworthy and transparent, empowering a\npractitioner with confidence that its use is appropriate and reliable. In this\npaper, we propose that this can be achieved through the use of judiciously\nbuilt feature sets coupled with Bayesian models, specifically Gaussian\nprocesses. We apply Gaussian processes to drug discovery, using inexpensive\ntranscriptomic profiles from human cell lines to predict animal kidney and\nliver toxicity after treatment with specific chemical compounds. This approach\nhas the potential to reduce invasive and expensive animal testing during\nclinical trials if in vitro human cell line analysis can accurately predict\nmodel animal phenotypes. We compare results across a range of feature sets and\nmodels, to highlight model importance for medical applications.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 16:32:02 GMT"}, {"version": "v2", "created": "Tue, 12 Nov 2019 14:06:44 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Gardiner", "Laura-Jayne", ""], ["Carrieri", "Anna Paola", ""], ["Wilshaw", "Jenny", ""], ["Checkley", "Stephen", ""], ["Pyzer-Knapp", "Edward O", ""], ["Krishna", "Ritesh", ""]]}, {"id": "1911.04447", "submitter": "Tanvir Ferdousi", "authors": "Tanvir Ferdousi, Sifat Afroj Moon, Adrian Self, and Caterina Scoglio", "title": "Generation of swine movement network and analysis of efficient\n  mitigation strategies for African swine fever virus", "comments": "19 pages, 8 figures, journal article (under review in PLOS ONE)", "journal-ref": null, "doi": "10.1371/journal.pone.0225785", "report-no": null, "categories": "q-bio.PE cs.SI q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Animal movement networks are essential in understanding and containing the\nspread of infectious diseases in farming industries. Due to its confidential\nnature, movement data for the US swine farming population is not readily\navailable. Hence, we propose a method to generate such networks from limited\ndata available in the public domain. As a potentially devastating candidate, we\nsimulate the spread of African swine fever virus (ASFV) in our generated\nnetwork and analyze how the network structure affects the disease spread. We\nfind that high in-degree farm operations (i.e., markets) play critical roles in\nthe disease spread. We also find that high in-degree based targeted isolation\nand hypothetical vaccinations are more effective for disease control compared\nto other centrality-based mitigation strategies. The generated networks can be\nmade more robust by validation with more data whenever more movement data will\nbe available.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 18:51:14 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Ferdousi", "Tanvir", ""], ["Moon", "Sifat Afroj", ""], ["Self", "Adrian", ""], ["Scoglio", "Caterina", ""]]}, {"id": "1911.04638", "submitter": "David Abramov", "authors": "David Abramov, Jasmine Otto, Mahika Dubey, Cassia Artanegara, Pierre\n  Boutillier, Walter Fontana, Angus G. Forbes", "title": "RuleVis: Constructing Patterns and Rules for Rule-Based Models", "comments": "4 pages, 6 figures, presented at IEEE VIS 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce RuleVis, a web-based application for defining and editing\n\"correct-by-construction\" executable rules that model biochemical\nfunctionality, which can be used to simulate the behavior of protein-protein\ninteraction networks and other complex systems. Rule-based models involve\nemergent effects based on the interactions between rules, which can vary\nconsiderably with regard to the scale of a model, requiring the user to inspect\nand edit individual rules. RuleVis bridges the graph rewriting and systems\nbiology research communities by providing an external visual representation of\nsalient patterns that experts can use to determine the appropriate level of\ndetail for a particular modeling context. We describe the visualization and\ninteraction features available in RuleVisand provide a detailed example\ndemonstrating how RuleVis can be used to reason about intracellular\ninteractions.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 02:24:58 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Abramov", "David", ""], ["Otto", "Jasmine", ""], ["Dubey", "Mahika", ""], ["Artanegara", "Cassia", ""], ["Boutillier", "Pierre", ""], ["Fontana", "Walter", ""], ["Forbes", "Angus G.", ""]]}, {"id": "1911.04782", "submitter": "Juan Raphael Diaz Simoes", "authors": "Juan Raphael Diaz Simoes (LPMC), Denis Grebenkov (LPMC), Paul\n  Bourgine, Nadine Peyri\\'eras", "title": "Brownian-like deviation of neighboring cells in the early embryogenesis\n  of the zebrafish", "comments": null, "journal-ref": "Physical Biology, Institute of Physics: Hybrid Open Access, 2019,\n  16 (2), pp.024001", "doi": "10.1088/1478-3975/aaf92d", "report-no": null, "categories": "physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate cell trajectories during zebrafish early embryogenesis based\non 3D+time photonic microscopy imaging data. To remove the collective flow\nmotion and focus on fluctuations, we analyze the deviations of pairs of\nneighboring cells. These deviations resemble Brownian motion and reveal\ndifferent behaviors between pairs containing daughter cells generated by cell\ndivision and other pairs of neighboring cells. This observation justifies a\ncommon practice of using white noise fluctuations in modeling cell movement.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 10:40:48 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Simoes", "Juan Raphael Diaz", "", "LPMC"], ["Grebenkov", "Denis", "", "LPMC"], ["Bourgine", "Paul", ""], ["Peyriéras", "Nadine", ""]]}, {"id": "1911.05211", "submitter": "Amanda Minnich", "authors": "Amanda J. Minnich, Kevin McLoughlin, Margaret Tse, Jason Deng, Andrew\n  Weber, Neha Murad, Benjamin D. Madej, Bharath Ramsundar, Tom Rush, Stacie\n  Calad-Thomson, Jim Brase, Jonathan E. Allen", "title": "AMPL: A Data-Driven Modeling Pipeline for Drug Discovery", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the key requirements for incorporating machine learning into the drug\ndiscovery process is complete reproducibility and traceability of the model\nbuilding and evaluation process. With this in mind, we have developed an\nend-to-end modular and extensible software pipeline for building and sharing\nmachine learning models that predict key pharma-relevant parameters. The ATOM\nModeling PipeLine, or AMPL, extends the functionality of the open source\nlibrary DeepChem and supports an array of machine learning and molecular\nfeaturization tools. We have benchmarked AMPL on a large collection of\npharmaceutical datasets covering a wide range of parameters. As a result of\nthese comprehensive experiments, we have found that physicochemical descriptors\nand deep learning-based graph representations significantly outperform\ntraditional fingerprints in the characterization of molecular features. We have\nalso found that dataset size is directly correlated to prediction performance,\nand that single-task deep learning models only outperform shallow learners if\nthere is sufficient data. Likewise, dataset size has a direct impact on model\npredictivity, independent of comprehensive hyperparameter model tuning. Our\nfindings point to the need for public dataset integration or\nmulti-task/transfer learning approaches. Lastly, we found that uncertainty\nquantification (UQ) analysis may help identify model error; however, efficacy\nof UQ to filter predictions varies considerably between datasets and\nfeaturization/model types. AMPL is open source and available for download at\nhttp://github.com/ATOMconsortium/AMPL.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 00:13:08 GMT"}, {"version": "v2", "created": "Thu, 14 Nov 2019 01:38:49 GMT"}], "update_date": "2019-11-15", "authors_parsed": [["Minnich", "Amanda J.", ""], ["McLoughlin", "Kevin", ""], ["Tse", "Margaret", ""], ["Deng", "Jason", ""], ["Weber", "Andrew", ""], ["Murad", "Neha", ""], ["Madej", "Benjamin D.", ""], ["Ramsundar", "Bharath", ""], ["Rush", "Tom", ""], ["Calad-Thomson", "Stacie", ""], ["Brase", "Jim", ""], ["Allen", "Jonathan E.", ""]]}, {"id": "1911.05567", "submitter": "Aakash Kaku", "authors": "Aakash Kaku, Chaitra V. Hegde, Jeffrey Huang, Sohae Chung, Xiuyuan\n  Wang, Matthew Young, Alireza Radmanesh, Yvonne W. Lui, and Narges Razavian", "title": "DARTS: DenseUnet-based Automatic Rapid Tool for brain Segmentation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CV eess.IV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantitative, volumetric analysis of Magnetic Resonance Imaging (MRI) is a\nfundamental way researchers study the brain in a host of neurological\nconditions including normal maturation and aging. Despite the availability of\nopen-source brain segmentation software, widespread clinical adoption of\nvolumetric analysis has been hindered due to processing times and reliance on\nmanual corrections. Here, we extend the use of deep learning models from\nproof-of-concept, as previously reported, to present a comprehensive\nsegmentation of cortical and deep gray matter brain structures matching the\nstandard regions of aseg+aparc included in the commonly used open-source tool,\nFreesurfer. The work presented here provides a real-life, rapid deep\nlearning-based brain segmentation tool to enable clinical translation as well\nas research application of quantitative brain segmentation. The advantages of\nthe presented tool include short (~1 minute) processing time and improved\nsegmentation quality. This is the first study to perform quick and accurate\nsegmentation of 102 brain regions based on the surface-based protocol (DMK\nprotocol), widely used by experts in the field. This is also the first work to\ninclude an expert reader study to assess the quality of the segmentation\nobtained using a deep-learning-based model. We show the superior performance of\nour deep-learning-based models over the traditional segmentation tool,\nFreesurfer. We refer to the proposed deep learning-based tool as DARTS\n(DenseUnet-based Automatic Rapid Tool for brain Segmentation). Our tool and\ntrained models are available at https://github.com/NYUMedML/DARTS\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 15:57:26 GMT"}, {"version": "v2", "created": "Thu, 14 Nov 2019 13:37:03 GMT"}], "update_date": "2019-11-15", "authors_parsed": [["Kaku", "Aakash", ""], ["Hegde", "Chaitra V.", ""], ["Huang", "Jeffrey", ""], ["Chung", "Sohae", ""], ["Wang", "Xiuyuan", ""], ["Young", "Matthew", ""], ["Radmanesh", "Alireza", ""], ["Lui", "Yvonne W.", ""], ["Razavian", "Narges", ""]]}, {"id": "1911.05584", "submitter": "Feng Huang", "authors": "Feng Huang, Xiang Yue, Zhankun Xiong, Zhouxin Yu and Wen Zhang", "title": "Tensor Decomposition with Relational Constraints for Predicting Multiple\n  Types of MicroRNA-disease Associations", "comments": null, "journal-ref": null, "doi": "10.1093/bib/bbaa140", "report-no": null, "categories": "cs.LG q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MicroRNAs (miRNAs) play crucial roles in multifarious biological processes\nassociated with human diseases. Identifying potential miRNA-disease\nassociations contributes to understanding the molecular mechanisms of\nmiRNA-related diseases. Most of the existing computational methods mainly focus\non predicting whether a miRNA-disease association exists or not. However, the\nroles of miRNAs in diseases are prominently diverged, for instance, Genetic\nvariants of microRNA (mir-15) may affect expression level of miRNAs leading to\nB cell chronic lymphocytic leukemia, while circulating miRNAs (including\nmir-1246, mir-1307-3p, etc.) have potentials to detecting breast cancer in the\nearly stage. In this paper, we aim to predict multi-type miRNA-disease\nassociations instead of taking them as binary. To this end, we innovatively\nrepresent miRNA-disease-type triplets as a tensor and introduce Tensor\nDecomposition methods to solve the prediction task. Experimental results on two\nwidely-adopted miRNA-disease datasets: HMDD v2.0 and HMDD v3.2 show that tensor\ndecomposition methods improve a recent baseline in a large scale (up to 38% in\ntop-1 F1). We further propose a novel method, Tensor Decomposition with\nRelational Constraints (TDRC), which incorporates biological features as\nrelational constraints to further the existing tensor decomposition methods.\nCompared with two existing tensor decomposition methods, TDRC can produce\nbetter performance while being more efficient.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 16:25:24 GMT"}, {"version": "v2", "created": "Mon, 9 Mar 2020 11:43:02 GMT"}], "update_date": "2021-03-30", "authors_parsed": [["Huang", "Feng", ""], ["Yue", "Xiang", ""], ["Xiong", "Zhankun", ""], ["Yu", "Zhouxin", ""], ["Zhang", "Wen", ""]]}, {"id": "1911.05824", "submitter": "Baichen Li", "authors": "Baichen Li, Scott R. Downen, Quan Dong, Nam Tran, Maxine LeSaux,\n  Andrew C. Meltzer, Zhenyu Li", "title": "A Discreet Wearable IoT Sensor for Continuous Transdermal Alcohol\n  Monitoring -- Challenges and Opportunities", "comments": "11 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC physics.med-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-invasive continuous alcohol monitoring has potential applications in both\npopulation research and in clinical management of acute alcohol intoxication or\nchronic alcoholism. Current wearable monitors based on transdermal alcohol\ncontent (TAC) sensing are relatively bulky and have limited quantification\naccuracy. Here we describe the development of a discreet wearable transdermal\nalcohol (TAC) sensor in the form of a wristband or armband. This novel sensor\ncan detect vapor-phase alcohol in perspiration from 0.09 ppm (equivalent to\n0.09 mg/dL sweat alcohol concentration at 25 {\\deg}C under Henry's Law\nequilibrium) to over 500 ppm at one-minute time resolution. The TAC sensor is\npowered by a 110 mAh lithium battery that lasts for over 7 days. In addition,\nthe sensor can function as a medical \"internet-of-things\" (IoT) device by\nconnecting to an Android smartphone gateway via Bluetooth Low Energy (BLE) and\nupload data to a cloud informatics system. Such wearable IoT sensors may enable\nlarge-scale alcohol-related research and personalized management. We also\npresent evidence suggesting a hypothesis that perspiration rate is the dominant\nfactor leading to TAC measurement variabilities, which may inform more\nreproducible and accurate TAC sensor designs in the future.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 21:47:42 GMT"}], "update_date": "2021-01-12", "authors_parsed": [["Li", "Baichen", ""], ["Downen", "Scott R.", ""], ["Dong", "Quan", ""], ["Tran", "Nam", ""], ["LeSaux", "Maxine", ""], ["Meltzer", "Andrew C.", ""], ["Li", "Zhenyu", ""]]}, {"id": "1911.06293", "submitter": "Jakub K\\\"ory", "authors": "John R. King, Jakub K\\\"ory and Mariya Ptashnyk", "title": "Multiscale analysis of nutrient uptake by plant roots with sparse\n  distribution of root hairs: Nonstandard scaling", "comments": "30 pages, 6 figures, accepted for publication in SIAM Journal on\n  Applied Mathematics", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we undertake a multiscale analysis of nutrient uptake by plant\nroot hairs, considering different scale relations between the radius of hairs\nand the distance between them. We combine the method of formal asymptotic\nexpansions and rigorous derivation of macroscopic equations. The former prompt\nus to study a distinguished limit (which yields a distinct effective equation),\nallow us to determine higher order correctors and provide motivation for the\nconstruction of correctors essential for rigorous derivation of macroscopic\nequations. In the final section, we validate the results of our asymptotic\nanalysis by direct comparison with full-geometry numerical simulations.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2019 18:30:51 GMT"}, {"version": "v2", "created": "Mon, 10 May 2021 11:19:36 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["King", "John R.", ""], ["Köry", "Jakub", ""], ["Ptashnyk", "Mariya", ""]]}, {"id": "1911.06298", "submitter": "Kezia Irene", "authors": "Kezia Irene, Aditya Yudha P., Harlan Haidi, Nurul Faza, Winston\n  Chandra", "title": "Fetal Head and Abdomen Measurement Using Convolutional Neural Network,\n  Hough Transform, and Difference of Gaussian Revolved along Elliptical Path\n  (Dogell) Algorithm", "comments": "5 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CV eess.IV", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The number of fetal-neonatal death in Indonesia is still high compared to\ndeveloped countries. This is caused by the absence of maternal monitoring\nduring pregnancy. This paper presents an automated measurement for fetal head\ncircumference (HC) and abdominal circumference (AC) from the ultrasonography\n(USG) image. This automated measurement is beneficial to detect early fetal\nabnormalities during the pregnancy period. We used the convolutional neural\nnetwork (CNN) method, to preprocess the USG data. After that, we approximate\nthe head and abdominal circumference using the Hough transform algorithm and\nthe difference of Gaussian Revolved along Elliptical Path (Dogell) Algorithm.\nWe used the data set from national hospitals in Indonesia and for the accuracy\nmeasurement, we compared our results to the annotated images measured by\nprofessional obstetricians. The result shows that by using CNN, we reduced\nerrors caused by a noisy image. We found that the Dogell algorithm performs\nbetter than the Hough transform algorithm in both time and accuracy. This is\nthe first HC and AC approximation that used the CNN method to preprocess the\ndata.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2019 18:34:38 GMT"}], "update_date": "2019-11-15", "authors_parsed": [["Irene", "Kezia", ""], ["P.", "Aditya Yudha", ""], ["Haidi", "Harlan", ""], ["Faza", "Nurul", ""], ["Chandra", "Winston", ""]]}, {"id": "1911.06446", "submitter": "Kexin Huang", "authors": "Kexin Huang, Cao Xiao, Trong Nghia Hoang, Lucas M. Glass, Jimeng Sun", "title": "CASTER: Predicting Drug Interactions with Chemical Substructure\n  Representation", "comments": "Accepted by AAAI 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adverse drug-drug interactions (DDIs) remain a leading cause of morbidity and\nmortality. Identifying potential DDIs during the drug design process is\ncritical for patients and society. Although several computational models have\nbeen proposed for DDI prediction, there are still limitations: (1) specialized\ndesign of drug representation for DDI predictions is lacking; (2) predictions\nare based on limited labelled data and do not generalize well to unseen drugs\nor DDIs; and (3) models are characterized by a large number of parameters, thus\nare hard to interpret. In this work, we develop a ChemicAl SubstrucTurE\nRepresentation (CASTER) framework that predicts DDIs given chemical structures\nof drugs.CASTER aims to mitigate these limitations via (1) a sequential pattern\nmining module rooted in the DDI mechanism to efficiently characterize\nfunctional sub-structures of drugs; (2) an auto-encoding module that leverages\nboth labelled and unlabelled chemical structure data to improve predictive\naccuracy and generalizability; and (3) a dictionary learning module that\nexplains the prediction via a small set of coefficients which measure the\nrelevance of each input sub-structures to the DDI outcome. We evaluated CASTER\non two real-world DDI datasets and showed that it performed better than\nstate-of-the-art baselines and provided interpretable predictions.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 01:50:44 GMT"}, {"version": "v2", "created": "Wed, 20 Nov 2019 03:55:01 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Huang", "Kexin", ""], ["Xiao", "Cao", ""], ["Hoang", "Trong Nghia", ""], ["Glass", "Lucas M.", ""], ["Sun", "Jimeng", ""]]}, {"id": "1911.06603", "submitter": "Pavel Karpov Dr", "authors": "Pavel Karpov and Guillaume Godin and Igor V. Tetko", "title": "Transformer-CNN: Fast and Reliable tool for QSAR", "comments": null, "journal-ref": null, "doi": "10.1186/s13321-020-00423-w", "report-no": null, "categories": "q-bio.QM cs.CL cs.LG", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We present SMILES-embeddings derived from the internal encoder state of a\nTransformer [1] model trained to canonize SMILES as a Seq2Seq problem. Using a\nCharNN [2] architecture upon the embeddings results in higher quality\ninterpretable QSAR/QSPR models on diverse benchmark datasets including\nregression and classification tasks. The proposed Transformer-CNN method uses\nSMILES augmentation for training and inference, and thus the prognosis is based\non an internal consensus. That both the augmentation and transfer learning are\nbased on embeddings allows the method to provide good results for small\ndatasets. We discuss the reasons for such effectiveness and draft future\ndirections for the development of the method. The source code and the\nembeddings needed to train a QSAR model are available on\nhttps://github.com/bigchem/transformer-cnn. The repository also has a\nstandalone program for QSAR prognosis which calculates individual atoms\ncontributions, thus interpreting the model's result. OCHEM [3] environment\n(https://ochem.eu) hosts the on-line implementation of the method proposed.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 12:49:55 GMT"}, {"version": "v2", "created": "Tue, 25 Feb 2020 13:35:29 GMT"}, {"version": "v3", "created": "Wed, 26 Feb 2020 14:43:18 GMT"}], "update_date": "2020-09-23", "authors_parsed": [["Karpov", "Pavel", ""], ["Godin", "Guillaume", ""], ["Tetko", "Igor V.", ""]]}, {"id": "1911.06687", "submitter": "Ahmad Chaddad", "authors": "Ahmad Chaddad, Saima Rathore, Mingli Zhang, Christian Desrosiers and\n  Tamim Niazi", "title": "Deep radiomic features from MRI scans predict survival outcome of\n  recurrent glioblastoma", "comments": "Accepted in MICCAI RNO workshop", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV eess.IV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes to use deep radiomic features (DRFs) from a convolutional\nneural network (CNN) to model fine-grained texture signatures in the radiomic\nanalysis of recurrent glioblastoma (rGBM). We use DRFs to predict survival of\nrGBM patients with preoperative T1-weighted post-contrast MR images (n=100).\nDRFs are extracted from regions of interest labelled by a radiation oncologist\nand used to compare between short-term and long-term survival patient groups.\nRandom forest (RF) classification is employed to predict survival outcome\n(i.e., short or long survival), as well as to identify highly group-informative\ndescriptors. Classification using DRFs results in an area under the ROC curve\n(AUC) of 89.15% (p<0.01) in predicting rGBM patient survival, compared to\n78.07% (p<0.01) when using standard radiomic features (SRF). These results\nindicate the potential of DRFs as a prognostic marker for patients with rGBM.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 15:18:38 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Chaddad", "Ahmad", ""], ["Rathore", "Saima", ""], ["Zhang", "Mingli", ""], ["Desrosiers", "Christian", ""], ["Niazi", "Tamim", ""]]}, {"id": "1911.07099", "submitter": "Barbara Engelhardt", "authors": "Isabella N Grabski, Roberta De Vito, Barbara E Engelhardt", "title": "Bayesian Ordinal Quantile Regression with a Partially Collapsed Gibbs\n  Sampler", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Unlike standard linear regression, quantile regression captures the\nrelationship between covariates and the conditional response distribution as a\nwhole, rather than only the relationship between covariates and the expected\nvalue of the conditional response. However, while there are well-established\nquantile regression methods for continuous variables and some forms of discrete\ndata, there is no widely accepted method for ordinal variables, despite their\nimportance in many medical contexts. In this work, we describe two existing\nordinal quantile regression methods and demonstrate their weaknesses. We then\npropose a new method, Bayesian ordinal quantile regression with a partially\ncollapsed Gibbs sampler (BORPS). We show superior results using BORPS versus\nexisting methods on an extensive set of simulations. We further illustrate the\nbenefits of our method by applying BORPS to the Fragile Families and Child\nWellbeing Study data to tease apart associations with early puberty among both\ngenders. Software is available at: GitHub.com/igrabski/borps.\n", "versions": [{"version": "v1", "created": "Sat, 16 Nov 2019 21:02:50 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Grabski", "Isabella N", ""], ["De Vito", "Roberta", ""], ["Engelhardt", "Barbara E", ""]]}, {"id": "1911.07110", "submitter": "Keshab Parhi", "authors": "Xingyi Liu and Keshab K. Parhi", "title": "Training DNA Perceptrons via Fractional Coding", "comments": "Proc. 2019 Asilomar Conference on Signals, Systems and Computers", "journal-ref": null, "doi": "10.1109/IEEECONF44664.2019.9048931", "report-no": null, "categories": "cs.ET q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a novel approach to synthesize molecular reactions to\ntrain a perceptron, i.e., a single-layered neural network, with sigmoidal\nactivation function. The approach is based on fractional coding where a\nvariable is represented by two molecules. The synergy between fractional coding\nin molecular computing and stochastic logic implementations in electronic\ncomputing is key to translating known stochastic logic circuits to molecular\ncomputing. In prior work, a DNA perceptron with bipolar inputs and unipolar\noutput was proposed for inference. The focus of this paper is on synthesis of\nmolecular reactions for training of the DNA perceptron. A new molecular scaler\nthat performs multiplication by a factor greater than 1 is proposed based on\nfractional coding. The training of the perceptron proposed in this paper is\nbased on a modified backpropagation equation as the exact equation cannot be\neasily mapped to molecular reactions using fractional coding.\n", "versions": [{"version": "v1", "created": "Sat, 16 Nov 2019 22:48:28 GMT"}, {"version": "v2", "created": "Wed, 8 Jan 2020 23:06:02 GMT"}], "update_date": "2020-04-01", "authors_parsed": [["Liu", "Xingyi", ""], ["Parhi", "Keshab K.", ""]]}, {"id": "1911.07127", "submitter": "Prashant Emani", "authors": "Prashant S. Emani, Jonathan Warrell, Alan Anticevic, Stefan Bekiranov,\n  Michael Gandal, Michael J. McConnell, Guillermo Sapiro, Al\\'an Aspuru-Guzik,\n  Justin Baker, Matteo Bastiani, Patrick McClure, John Murray, Stamatios N\n  Sotiropoulos, Jacob Taylor, Geetha Senthil, Thomas Lehner, Mark B. Gerstein,\n  Aram W. Harrow", "title": "Quantum Computing at the Frontiers of Biological Sciences", "comments": "22 pages, 3 figures, Perspective", "journal-ref": "Nature Methods (2021)", "doi": "10.1038/s41592-020-01004-3", "report-no": null, "categories": "quant-ph q-bio.GN q-bio.NC q-bio.QM", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  The search for meaningful structure in biological data has relied on\ncutting-edge advances in computational technology and data science methods.\nHowever, challenges arise as we push the limits of scale and complexity in\nbiological problems. Innovation in massively parallel, classical computing\nhardware and algorithms continues to address many of these challenges, but\nthere is a need to simultaneously consider new paradigms to circumvent current\nbarriers to processing speed. Accordingly, we articulate a view towards quantum\ncomputation and quantum information science, where algorithms have demonstrated\npotential polynomial and exponential computational speedups in certain\napplications, such as machine learning. The maturation of the field of quantum\ncomputing, in hardware and algorithm development, also coincides with the\ngrowth of several collaborative efforts to address questions across length and\ntime scales, and scientific disciplines. We use this coincidence to explore the\npotential for quantum computing to aid in one such endeavor: the merging of\ninsights from genetics, genomics, neuroimaging and behavioral phenotyping. By\nexamining joint opportunities for computational innovation across fields, we\nhighlight the need for a common language between biological data analysis and\nquantum computing. Ultimately, we consider current and future prospects for the\nemployment of quantum computing algorithms in the biological sciences.\n", "versions": [{"version": "v1", "created": "Sun, 17 Nov 2019 01:45:58 GMT"}], "update_date": "2021-01-05", "authors_parsed": [["Emani", "Prashant S.", ""], ["Warrell", "Jonathan", ""], ["Anticevic", "Alan", ""], ["Bekiranov", "Stefan", ""], ["Gandal", "Michael", ""], ["McConnell", "Michael J.", ""], ["Sapiro", "Guillermo", ""], ["Aspuru-Guzik", "Alán", ""], ["Baker", "Justin", ""], ["Bastiani", "Matteo", ""], ["McClure", "Patrick", ""], ["Murray", "John", ""], ["Sotiropoulos", "Stamatios N", ""], ["Taylor", "Jacob", ""], ["Senthil", "Geetha", ""], ["Lehner", "Thomas", ""], ["Gerstein", "Mark B.", ""], ["Harrow", "Aram W.", ""]]}, {"id": "1911.07560", "submitter": "Luca Quaroni", "authors": "Luca Quaroni", "title": "Characterization of Intact Eukaryotic Cells with Subcellular Spatial\n  Resolution by Photothermal-Induced Resonance Infrared Spectroscopy and\n  Imaging", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Photothermal-Induced Resonance (PTIR) spectroscopy and imaging with infrared\nlight has seen increasing application in molecular spectroscopy of biological\nsamples. The appeal of the technique lies in its capability to provide\ninformation about IR light absorption at a spatial resolution better than\nallowed by light diffraction, typically below 100 nm. In the present work we\ntest the capability of the technique to perform measurements with subcellular\nresolution on intact eukaryotic cells, without drying or fixing. We demonstrate\nthe possibility to obtain PTIR images and spectra from the nucleus and multiple\norganelles with high resolution. We obtain particularly strong signal from\nbands typically assigned to acyl lipids and proteins. We also show that while a\nstronger signal is obtained from some subcellular structures, other large\nsubcellular components provide a weaker or undetectable PTIR response. The\nmechanism that underlies such variability in response is presently unclear. We\npropose and discuss different possibilities, addressing thermomechanical,\ngeometrical and electrical properties of the sample and the presence of\ncellular water, from which the difference in response may arise.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 11:44:19 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Quaroni", "Luca", ""]]}, {"id": "1911.07637", "submitter": "Ralf Metzler", "authors": "D. S. Grebenkov, R. Metzler, and G. Oshanin", "title": "Full distribution of first exit times in the narrow escape problem", "comments": "30 pages, 9 figures, IOPLaTeX", "journal-ref": "New J. Phys. 21, 122001 (2019)", "doi": "10.1088/1367-2630/ab5de4", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the scenario of the narrow escape problem (NEP) a particle diffuses in a\nfinite container and eventually leaves it through a small \"escape window\" in\nthe otherwise impermeable boundary, once it arrives to this window and\nover-passes an entropic barrier at the entrance to it. This generic problem is\nmathematically identical to that of a diffusion-mediated reaction with a\npartially-reactive site on the container's boundary. Considerable knowledge is\navailable on the dependence of the mean first-reaction time (FRT) on the\npertinent parameters. We here go a distinct step further and derive the full\nFRT distribution for the NEP. We demonstrate that typical FRTs may be orders of\nmagnitude shorter than the mean one, thus resulting in a strong defocusing of\ncharacteristic temporal scales. We unveil the geometry-control of the typical\ntimes, emphasising the role of the initial distance to the target as a decisive\nparameter. A crucial finding is the further FRT defocusing due to the barrier,\nnecessitating repeated escape or reaction attempts interspersed with bulk\nexcursions. These results add new perspectives and offer a broad comprehension\nof various features of the by-now classical NEP that are relevant for numerous\nbiological and technological systems.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 13:49:03 GMT"}], "update_date": "2020-01-03", "authors_parsed": [["Grebenkov", "D. S.", ""], ["Metzler", "R.", ""], ["Oshanin", "G.", ""]]}, {"id": "1911.07788", "submitter": "Haitham Qaralleh", "authors": "Mohammad Jaafreh, Haitham Qaralleh, Muhamad O. Al-limoun", "title": "Biological Value of Centaurea damascena: Minireview", "comments": "8 pages. arXiv admin note: substantial text overlap with\n  arXiv:1911.02243", "journal-ref": "Journal of basic and applied Research in Biomedicine, 2019, 5(2):\n  99-106", "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The family Asteraceae include large number of Centaurea species which have\nbeen applied in folk medicine. One of the family Asteraceae members is the\nCentaurea damascena which authentically been tested for its antibacterial\nactivity. The aim of the study was to discuss antibacterial activities of\nessential oil composition and methanolic extract of the same plant aerial part\nleaves. Thirty-seven components were characterized with 86 of oxygenated\nterpenes. The composition in percentage was dominated by 11.45 Fokienol, 8.8\nthymol, 8.21 Alpha Terpineol, 7.24 Chrysanthemumic acid, 7.13 Terpinen4-ol and\n6.59 Borneol with a high degree of polymorphism in the occurrence of these\ncompounds as compared with the different species of centaurea.. Free radical\nscavenging capacity of the C. damascna methanol extract was calculated by DPPH\nand FRAP test. DPPH radicals were scavenged with an IC50 value of 17.08\nmicrogram per ml. Antioxidant capacities obtained by the FRAP was 51.9 and\nexpressed in mg Trolox gram per Liter dry weight. The total phenolic compounds\nof the methanol extracts of aerial parts, as estimated by Folin Ciocalteu\nreagent method, was about 460 milligram GAE per gram. The phenolic contents in\nthe extracts highly correlate with their antioxidant activity, confirming that\nthe antioxidant activity of this plant extracts is considerably phenolic\ncontents dependent.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2019 11:34:34 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Jaafreh", "Mohammad", ""], ["Qaralleh", "Haitham", ""], ["Al-limoun", "Muhamad O.", ""]]}, {"id": "1911.08000", "submitter": "Mushtaq Loan", "authors": "M. Loan, B. Freeman, A. Bhat, M. Tantary, M. Brown and K. Virk", "title": "Monte Carlo Simulations of DNA Damage and Cellular Response to Hadron\n  Irradiation", "comments": "17 pages and 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Numerical simulations are performed on a stochastic model based on Monte\nCarlo damage simulation process and Markov Chain Monte Carlo techniques to\ninvestigate the formation and evaluation of isolated and multiple DNA damage\nand cellular survival by light ionizing radiation in a colony of tumour cells.\nThe contribution of the local clustering of the strand breaks and base damage\nis taken into account while considering double-strand breaks (DSBs) as primary\nlesions in the DNA of the cell nucleus induced by ionizing radiation. The model\nincorporates the combined effects of biological processes such as the tumour\noxygenation, cellular multiplication and mutation through various probability\ndistributions in a full Monte Carlo simulation of fractionated hadrontherapy.\nOur results indicate that the linear and quadratic parameters of the model show\na negative correlation, for protons and helium ions, which might suggest an\nunderlying biological mechanism. Despite using a model with quite different\ndescriptions of linear and quadratic parameters, the observed results for\nlinear parameter show largely reasonable agreement while the quadratic\nparameter consistent deviations from the results obtained using the LEM model\nat low LET. In addition to the LET dependence, RBE values showed a strong\ndependence on alpha/beta ratio and a considerable scatter for various particle\ntypes indicate particle specific behaviour of initial its slope. The surviving\ncurves show a non-linear dose-response suggesting that interaction among DSBs\ninduced by ionizing radiation contribute significantly to the quadratic term of\nthe model.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 23:30:09 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Loan", "M.", ""], ["Freeman", "B.", ""], ["Bhat", "A.", ""], ["Tantary", "M.", ""], ["Brown", "M.", ""], ["Virk", "K.", ""]]}, {"id": "1911.08121", "submitter": "Nina Miolane", "authors": "Nina Miolane, Fr\\'ed\\'eric Poitevin, Yee-Ting Li, Susan Holmes", "title": "Estimation of Orientation and Camera Parameters from Cryo-Electron\n  Microscopy Images with Variational Autoencoders and Generative Adversarial\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CV eess.IV stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cryo-electron microscopy (cryo-EM) is capable of producing reconstructed 3D\nimages of biomolecules at near-atomic resolution. As such, it represents one of\nthe most promising imaging techniques in structural biology. However, raw\ncryo-EM images are only highly corrupted - noisy and band-pass filtered - 2D\nprojections of the target 3D biomolecules. Reconstructing the 3D molecular\nshape starts with the removal of image outliers, the estimation of the\norientation of the biomolecule that has produced the given 2D image, and the\nestimation of camera parameters to correct for intensity defects. Current\ntechniques performing these tasks are often computationally expensive, while\nthe dataset sizes keep growing. There is a need for next-generation algorithms\nthat preserve accuracy while improving speed and scalability. In this paper, we\ncombine variational autoencoders (VAEs) and generative adversarial networks\n(GANs) to learn a low-dimensional latent representation of cryo-EM images. We\nperform an exploratory analysis of the obtained latent space, that is shown to\nhave a structure of \"orbits\", in the sense of Lie group theory, consistent with\nthe acquisition procedure of cryo-EM images. This analysis leads us to design\nan estimation method for orientation and camera parameters of single-particle\ncryo-EM images, together with an outliers detection procedure. As such, it\nopens the door to geometric approaches for unsupervised estimations of\norientations and camera parameters, making possible fast cryo-EM biomolecule\nreconstruction.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 07:04:43 GMT"}, {"version": "v2", "created": "Sun, 23 May 2021 19:11:06 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Miolane", "Nina", ""], ["Poitevin", "Frédéric", ""], ["Li", "Yee-Ting", ""], ["Holmes", "Susan", ""]]}, {"id": "1911.08136", "submitter": "Erico Tjoa", "authors": "Erico Tjoa, Guo Heng, Lu Yuhao, Cuntai Guan", "title": "Enhancing the Extraction of Interpretable Information for Ischemic\n  Stroke Imaging from Deep Neural Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We implement a visual interpretability method Layer-wise Relevance\nPropagation (LRP) on top of 3D U-Net trained to perform lesion segmentation on\nthe small dataset of multi-modal images provided by ISLES 2017 competition. We\ndemonstrate that LRP modifications could provide more sensible visual\nexplanations to an otherwise highly noise-skewed saliency map. We also link\namplitude of modified signals to useful information content. High amplitude\nlocalized signals appear to constitute the noise that undermines the\ninterpretability capacity of LRP. Furthermore, mathematical framework for\npossible analysis of function approximation is developed by analogy.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 07:45:46 GMT"}, {"version": "v2", "created": "Mon, 13 Jan 2020 05:30:39 GMT"}], "update_date": "2020-01-14", "authors_parsed": [["Tjoa", "Erico", ""], ["Heng", "Guo", ""], ["Yuhao", "Lu", ""], ["Guan", "Cuntai", ""]]}, {"id": "1911.08241", "submitter": "Tai Sing Lee", "authors": "Ziniu Wu and Harold Rockwell and Yimeng Zhang and Shiming Tang and Tai\n  Sing Lee", "title": "Complex Sparse Code Priors Improve the Statistical Models of Neurons in\n  Primate Primary Visual Cortex", "comments": "13 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  System identification techniques---projection pursuit regression models (PPR)\nand convolutional neural networks (CNNs)---provide state-of-the-art performance\nin predicting visual cortical neurons' responses to arbitrary input stimuli.\nHowever, the constituent kernels recovered by these methods, particularly those\nof CNNs, are often noisy and lack coherent structure, making it difficult to\nunderstand the underlying component features of a neuron's receptive field. In\nthis paper, we show that using a dictionary of complex sparse codes, which are\nlearned from natural scenes based on efficient coding theory, as the front-end\nfor PPR and CNNs can improve their performance in neuronal response prediction.\nMore importantly, this approach makes the constituent kernels of these models\nsubstantially more coherent and interpretable. Extensive experimental results\nalso indicate that these interpretable kernels provide important information on\nthe component features of a neuron's receptive field. In addition, we find that\nmodels with a complex sparse code front-end are significantly better than\nmodels with a standard orientation-selective Gabor filter front-end for\nmodeling V1 neurons that have been found to exhibit complex pattern\nselectivity. This observation adds further credence to the sparse coding theory\nas well as empirical findings of complex feature selectivity in V1.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 13:00:22 GMT"}, {"version": "v2", "created": "Tue, 24 Nov 2020 03:40:14 GMT"}], "update_date": "2020-11-25", "authors_parsed": [["Wu", "Ziniu", ""], ["Rockwell", "Harold", ""], ["Zhang", "Yimeng", ""], ["Tang", "Shiming", ""], ["Lee", "Tai Sing", ""]]}, {"id": "1911.08408", "submitter": "Danielle Braun", "authors": "Yuxi Liu, Kanhua Yin, Basanta Lamichhane, John F. Sandbach, Gayle\n  Patel, Gia Compagnoni, Richard H. Kanak, Barry Rosen, David P. Ondrula, Linda\n  Smith, Eric Brown, Linsey Gold, Pat Whitworth, Colleen App, David Euhus, Alan\n  Semine, S. Dwight Lyons, Melford Allan C. Lazarte, Giovanni Parmigiani,\n  Danielle Braun, and Kevin S. Hughes", "title": "Ask2Me VarHarmonizer: A Python-Based Tool to Harmonize Variants from\n  Cancer Genetic Testing Reports and Map them to the ClinVar Database", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  PURPOSE: The popularity of germline genetic panel testing has led to a vast\naccumulation of variant-level data. Variant names are not always consistent\nacross laboratories and not easily mappable to public variant databases such as\nClinVar. A tool that can automate the process of variants harmonization and\nmapping is needed to help clinicians ensure their variant interpretations are\naccurate. METHODS: We present a Python-based tool, Ask2Me VarHarmonizer, that\nincorporates data cleaning, name harmonization, and a four-attempt mapping to\nClinVar procedure. We applied this tool to map variants from a pilot dataset\ncollected from 11 clinical practices. Mapping results were evaluated with and\nwithout the transcript information. RESULTS: Using Ask2Me VarHarmonizer, 4728\nout of 6027 variant entries (78%) were successfully mapped to ClinVar,\ncorresponding to 3699 mappable unique variants. With the addition of 1099\nunique unmappable variants, a total of 4798 unique variants were eventually\nidentified. 427 (9%) of these had multiple names, of which 343 (7%) had\nmultiple names within-practice. 99% mapping consistency was observed with and\nwithout transcript information. CONCLUSION: Ask2Me VarHarmonizer aggregates and\nstructures variant data, harmonizes names, and maps variants to ClinVar.\nPerforming harmonization removes the ambiguity and redundancy of variants from\ndifferent sources.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 17:27:16 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Liu", "Yuxi", ""], ["Yin", "Kanhua", ""], ["Lamichhane", "Basanta", ""], ["Sandbach", "John F.", ""], ["Patel", "Gayle", ""], ["Compagnoni", "Gia", ""], ["Kanak", "Richard H.", ""], ["Rosen", "Barry", ""], ["Ondrula", "David P.", ""], ["Smith", "Linda", ""], ["Brown", "Eric", ""], ["Gold", "Linsey", ""], ["Whitworth", "Pat", ""], ["App", "Colleen", ""], ["Euhus", "David", ""], ["Semine", "Alan", ""], ["Lyons", "S. Dwight", ""], ["Lazarte", "Melford Allan C.", ""], ["Parmigiani", "Giovanni", ""], ["Braun", "Danielle", ""], ["Hughes", "Kevin S.", ""]]}, {"id": "1911.08509", "submitter": "Dami\\'an G. Hern\\'andez", "authors": "Dami\\'an G. Hern\\'andez, Samuel J. Sober and Ilya Nemenman", "title": "Unsupervised Bayesian Ising Approximation for revealing the neural\n  dictionary in songbirds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of deciphering how low-level patterns (action potentials in the\nbrain, amino acids in a protein, etc.) drive high-level biological features\n(sensorimotor behavior, enzymatic function) represents the central challenge of\nquantitative biology. The lack of general methods for doing so from the size of\ndatasets that can be collected experimentally severely limits our understanding\nof the biological world. For example, in neuroscience, some sensory and motor\ncodes have been shown to consist of precisely timed multi-spike patterns.\nHowever, the combinatorial complexity of such pattern codes have precluded\ndevelopment of methods for their comprehensive analysis. Thus, just as it is\nhard to predict a protein's function based on its sequence, we still do not\nunderstand how to accurately predict an organism's behavior based on neural\nactivity. Here we derive a method for solving this class of problems. We\ndemonstrate its utility in an application to neural data, detecting precisely\ntimed spike patterns that code for specific motor behaviors in a songbird vocal\nsystem. Our method detects such codewords with an arbitrary number of spikes,\ndoes so from small data sets, and accounts for dependencies in occurrences of\ncodewords. Detecting such dictionaries of important spike patterns --- rather\nthan merely identifying the timescale on which such patterns exist, as in some\nprior approaches --- opens the door for understanding fine motor control and\nthe neural bases of sensorimotor learning in animals. For example, for the\nfirst time, we identify differences in encoding motor exploration versus\ntypical behavior. Crucially, our method can be used not only for analysis of\nneural systems, but also for understanding the structure of correlations in\nother biological and nonbiological datasets.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 19:11:49 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Hernández", "Damián G.", ""], ["Sober", "Samuel J.", ""], ["Nemenman", "Ilya", ""]]}, {"id": "1911.08929", "submitter": "Felix Jost", "authors": "Felix Jost, Jakob Zierk, Thuy T. T. Le, Thomas Raupach, Manfred Rauh,\n  Meinolf Suttorp, Martin Stanulla, Markus Metzler, Sebastian Sager", "title": "Model-based simulation of maintenance therapy of childhood acute\n  lymphoblastic leukemia", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Acute lymphoblastic leukemia is the most common malignancy in childhood.\nSuccessful treatment requires initial high-intensity chemotherapy, followed by\nlow-intensity oral maintenance therapy with oral 6-mercaptopurine (6MP) and\nmethotrexate (MTX) until 2-3 years after disease onset. However, intra- and\ninterindividual variability in the pharmacokinetics (PK) and pharmacodynamics\n(PD) of 6MP and MTX make it challenging to balance the desired antileukemic\neffects with undesired excessive myelosuppression during maintenance therapy. A\nmodel to simulate the dynamics of different cell types, especially neutrophils,\nwould be a valuable contribution to improving treatment protocols (6MP and MTX\ndosing regimens) and a further step to understanding the heterogeneity in\ntreatment efficacy and toxicity. We applied and modified a recently developed\nsemi-mechanistic PK/PD model to neutrophils and analyzed their behavior using a\nnonlinear mixed-effects modeling approach and clinical data obtained from 116\npatients. The PK model of 6MP influenced the accuracy of absolute neutrophil\ncount (ANC) predictions, whereas the PD effect of MTX did not. Predictions\nbased on ANC were more accurate than those based on white blood cell counts.\nUsing the new cross-validated mathematical model, simulations of different\ntreatment protocols showed a linear dose-effect relationship and reduced ANC\nvariability for constant dosages. Advanced modeling allows the identification\nof optimized control criteria and the weighting of specific influencing factors\nfor protocol design and individually adapted therapy to exploit the optimal\neffect of maintenance therapy on survival.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 14:25:38 GMT"}, {"version": "v2", "created": "Fri, 3 Jan 2020 14:26:02 GMT"}], "update_date": "2020-01-06", "authors_parsed": [["Jost", "Felix", ""], ["Zierk", "Jakob", ""], ["Le", "Thuy T. T.", ""], ["Raupach", "Thomas", ""], ["Rauh", "Manfred", ""], ["Suttorp", "Meinolf", ""], ["Stanulla", "Martin", ""], ["Metzler", "Markus", ""], ["Sager", "Sebastian", ""]]}, {"id": "1911.08979", "submitter": "Oladimeji Mudele", "authors": "Oladimeji Mudele, Fabio M. Bayer, Lucas Zanandrez, Alvaro E. Eiras,\n  Paolo Gamba", "title": "Modeling the Temporal Population Distribution of Ae. aegypti Mosquito\n  using Big Earth Observation Data", "comments": "Submitted to IEEE Access Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over 50% of the world population is at risk of mosquito-borne diseases.\nFemale Ae. aegypti mosquito species transmit Zika, Dengue, and Chikungunya. The\nspread of these diseases correlate positively with the vector population, and\nthis population depends on biotic and abiotic environmental factors including\ntemperature, vegetation condition, humidity and precipitation. To combat virus\noutbreaks, information about vector population is required. To this aim, Earth\nobservation (EO) data provide fast, efficient and economically viable means to\nestimate environmental features of interest. In this work, we present a\ntemporal distribution model for adult female Ae. aegypti mosquitoes based on\nthe joint use of the Normalized Difference Vegetation Index, the Normalized\nDifference Water Index, the Land Surface Temperature (both at day and night\ntime), along with the precipitation information, extracted from EO data. The\nmodel was applied separately to data obtained during three different vector\ncontrol and field data collection condition regimes, and used to explain the\ndifferences in environmental variable contributions across these regimes. To\nthis aim, a random forest (RF) regression technique and its nonlinear features\nimportance ranking based on mean decrease impurity (MDI) were implemented. To\nprove the robustness of the proposed model, we compared it to other machine\nlearning techniques and statistical models. Our results show that machine\nlearning techniques perform better than linear statistical models for the task\nat hand, and RF performs best. By ranking the importance of all features based\non MDI in RF and selecting the subset comprising the most informative ones, a\nmore parsimonious but equally effective and explainable model can be\nobtained...\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 15:46:10 GMT"}, {"version": "v2", "created": "Tue, 26 Nov 2019 22:13:42 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Mudele", "Oladimeji", ""], ["Bayer", "Fabio M.", ""], ["Zanandrez", "Lucas", ""], ["Eiras", "Alvaro E.", ""], ["Gamba", "Paolo", ""]]}, {"id": "1911.08980", "submitter": "Felix Jost", "authors": "Felix Jost, Enrico Schalk, Daniela Weber, Hartmut Doehner, Thomas\n  Fischer, Sebastian Sager", "title": "Model-based optimal AML consolidation treatment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neutropenia is an adverse event commonly arising during intensive\nchemotherapy of acute myeloid leukemia (AML). It is often associated with\ninfectious complications. Mathematical modeling, simulation, and optimization\nof the treatment process would be a valuable tool to support clinical decision\nmaking, potentially resulting in less severe side effects and deeper\nremissions. However, until now, there has been no validated mathematical model\navailable to simulate the effect of chemotherapy treatment on white blood cell\n(WBC) counts and leukemic cells simultaneously. We developed a population\npharmacokinetic/pharmacodynamic (PK/PD) model combining a myelosuppression\nmodel considering endogenous granulocyte-colony stimulating factor (G-CSF), a\nPK model for cytarabine (Ara-C), a subcutaneous absorption model for exogenous\nG-CSF, and a two-compartment model for leukemic blasts. This model was fitted\nto data of 44 AML patients during consolidation therapy with a novel Ara-C plus\nG-CSF schedule from a phase II controlled clinical trial. Additionally, we were\nable to optimize treatment schedules with respect to disease progression, WBC\nnadirs, and the amount of Ara-C and G-CSF. The developed PK/PD model provided\ngood prediction accuracies and an interpretation of the interaction between\nWBCs, G-CSF, and blasts. For 14 patients (those with available bone marrow\nblast counts), we achieved a median 4.2-fold higher WBC count at nadir, which\nis the most critical time during consolidation therapy. The simulation results\nshowed that relative bone marrow blast counts remained below the clinically\nimportant threshold of 5%, with a median of 60% reduction in Ara-C.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 15:46:42 GMT"}, {"version": "v2", "created": "Sat, 18 Apr 2020 12:02:33 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Jost", "Felix", ""], ["Schalk", "Enrico", ""], ["Weber", "Daniela", ""], ["Doehner", "Hartmut", ""], ["Fischer", "Thomas", ""], ["Sager", "Sebastian", ""]]}, {"id": "1911.09035", "submitter": "Fiona Macfarlane", "authors": "Fiona R Macfarlane, Mark AJ Chaplain, Raluca Eftimie", "title": "Quantitative predictive modelling approaches to understanding rheumatoid\n  arthritis: A brief review", "comments": null, "journal-ref": null, "doi": "10.3390/cells9010074", "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rheumatoid arthritis is a chronic autoimmune disease that is a major public\nhealth challenge. The disease is characterised by inflammation of synovial\njoints and cartilage erosion, which leads to chronic pain, poor life quality\nand, in some cases, premature mortality. Understanding the biological\nmechanisms behind the progression of the disease, as well as developing new\nmethods for quantitative predictions of disease progression in the\npresence/absence of various therapies is important for the success of\ntherapeutic approaches. The aim of this study is to review various quantitative\npredictive modelling approaches for understanding rheumatoid arthritis. To this\nend, we start by discussing briefly the biology of this disease and some\ncurrent treatment approaches, as well as emphasising some of the open problems\nin the field. Then we review various mathematical mechanistic models derived to\naddress some of these open problems. We discuss models that investigate the\nbiological mechanisms behind the progression of the disease, as well as\npharmacokinetic and pharmacodynamic models for various drug therapies.\nFurthermore, we highlight models aimed at optimising the costs of the\ntreatments while taking into consideration the evolution of the disease and\npotential complications.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 17:04:28 GMT"}, {"version": "v2", "created": "Thu, 12 Dec 2019 15:57:39 GMT"}, {"version": "v3", "created": "Thu, 19 Dec 2019 12:49:40 GMT"}, {"version": "v4", "created": "Mon, 6 Jan 2020 10:01:22 GMT"}], "update_date": "2020-01-07", "authors_parsed": [["Macfarlane", "Fiona R", ""], ["Chaplain", "Mark AJ", ""], ["Eftimie", "Raluca", ""]]}, {"id": "1911.09045", "submitter": "Saeed Khaki", "authors": "Saeed Khaki, Lizhi Wang and Sotirios V. Archontoulis", "title": "A CNN-RNN Framework for Crop Yield Prediction", "comments": "26 Pages, 14 Figures", "journal-ref": "Frontiers in Plant Science, 2019", "doi": "10.3389/fpls.2019.01750", "report-no": null, "categories": "cs.LG q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crop yield prediction is extremely challenging due to its dependence on\nmultiple factors such as crop genotype, environmental factors, management\npractices, and their interactions. This paper presents a deep learning\nframework using convolutional neural networks (CNN) and recurrent neural\nnetworks (RNN) for crop yield prediction based on environmental data and\nmanagement practices. The proposed CNN-RNN model, along with other popular\nmethods such as random forest (RF), deep fully-connected neural networks\n(DFNN), and LASSO, was used to forecast corn and soybean yield across the\nentire Corn Belt (including 13 states) in the United States for years 2016,\n2017, and 2018 using historical data. The new model achieved a\nroot-mean-square-error (RMSE) 9% and 8% of their respective average yields,\nsubstantially outperforming all other methods that were tested. The CNN-RNN\nhave three salient features that make it a potentially useful method for other\ncrop yield prediction studies. (1) The CNN-RNN model was designed to capture\nthe time dependencies of environmental factors and the genetic improvement of\nseeds over time without having their genotype information. (2) The model\ndemonstrated the capability to generalize the yield prediction to untested\nenvironments without significant drop in the prediction accuracy. (3) Coupled\nwith the backpropagation method, the model could reveal the extent to which\nweather conditions, accuracy of weather predictions, soil conditions, and\nmanagement practices were able to explain the variation in the crop yields.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 17:18:48 GMT"}, {"version": "v2", "created": "Fri, 24 Jan 2020 19:10:32 GMT"}], "update_date": "2020-01-28", "authors_parsed": [["Khaki", "Saeed", ""], ["Wang", "Lizhi", ""], ["Archontoulis", "Sotirios V.", ""]]}, {"id": "1911.09182", "submitter": "Andrey Sarantsev Mr", "authors": "Olga Rumyantseva, Andrey Sarantsev, Nikolay Strigul", "title": "Autoregressive Modeling of Forest Dynamics", "comments": "17 pages, 14 figures. Keywords: Forest biomass dynamics; random walk\n  model; AR(1) process; Bayesian analysis; patch dynamics. Published in MDPI\n  Forests, open access", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we employ autoregressive models developed in financial\nengineering for modeling of forest dynamics. Autoregressive models have some\ntheoretical advantage over currently employed forest modeling approaches such\nas Markov chains and individual-based models, as autoregressive models are both\nanalytically tractable and operate with continuous state space. We perform time\nseries statistical analysis of forest biomass and basal area recorded in Quebec\nprovincial forest inventories in 1970-2007. The geometric random walk model\nadequately describes the yearly average dynamics. For individual patches, we\nfit an AR(1) process capable to model negative feedback (mean-reversion).\nOverall, the best fit also turns out to be geometric random walk, however, the\nnormality tests for residuals fail. In contrast, yearly means are adequately\ndescribed by normal fluctuations, with annual growth, on average, 2.3%, but\nwith standard deviation of order 40%. We use Bayesian analysis to account for\nuneven number of observations per year. This work demonstrates that\nautoregressive models represent a valuable tool for modeling of forest\ndynamics. In particular, they quantify stochastic effects of environmental\ndisturbances and develop predictive empirical models on short and intermediate\ntemporal scales.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 21:32:40 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Rumyantseva", "Olga", ""], ["Sarantsev", "Andrey", ""], ["Strigul", "Nikolay", ""]]}, {"id": "1911.09756", "submitter": "Andrea Arnold", "authors": "Kayleigh Campbell, Laura Staugler, Andrea Arnold", "title": "Estimating Time-Varying Applied Current in the Hodgkin-Huxley Model", "comments": "15 pages, 9 figures", "journal-ref": "Applied Sciences 10 (2020) 550", "doi": "10.3390/app10020550", "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The classic Hodgkin-Huxley model is widely used for understanding the\nelectrophysiological dynamics of a single neuron. While applying a constant\ncurrent to the system results in a single voltage spike, it is possible to\nproduce more interesting dynamics by applying time-varying currents, which may\nnot be experimentally measurable. The aim of this work is to estimate\ntime-varying applied currents of different deterministic forms given noisy\nvoltage data. In particular, we utilize an augmented ensemble Kalman filter\nwith parameter tracking to estimate four different deterministic applied\ncurrents, analyzing how the model dynamics change in each case. We test the\nefficiency of the parameter tracking algorithm in this setting by exploring the\neffects of changing the standard deviation of the parameter drift and the\nfrequency of data available on the resulting time-varying applied current\nestimates and related uncertainty.\n", "versions": [{"version": "v1", "created": "Thu, 21 Nov 2019 21:28:28 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Campbell", "Kayleigh", ""], ["Staugler", "Laura", ""], ["Arnold", "Andrea", ""]]}, {"id": "1911.09776", "submitter": "Purushottam Dixit", "authors": "Purushottam D. Dixit", "title": "TMI: Thermodynamic inference of data manifolds", "comments": null, "journal-ref": "Phys. Rev. Research 2, 023201 (2020)", "doi": "10.1103/PhysRevResearch.2.023201", "report-no": null, "categories": "cond-mat.stat-mech cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Gibbs-Boltzmann distribution offers a physically interpretable way to\nmassively reduce the dimensionality of high dimensional probability\ndistributions where the extensive variables are `features' and the intensive\nvariables are `descriptors'. However, not all probability distributions can be\nmodeled using the Gibbs-Boltzmann form. Here, we present TMI: TMI, {\\bf\nT}hermodynamic {\\bf M}anifold {\\bf I}nference; a thermodynamic approach to\napproximate a collection of arbitrary distributions. TMI simultaneously learns\nfrom data intensive and extensive variables and achieves dimensionality\nreduction through a multiplicative, positive valued, and interpretable\ndecomposition of the data. Importantly, the reduced dimensional space of\nintensive parameters is not homogeneous. The Gibbs-Boltzmann distribution\ndefines an analytically tractable Riemannian metric on the space of intensive\nvariables allowing us to calculate geodesics and volume elements. We discuss\nthe applications of TMI with multiple real and artificial data sets. Possible\nextensions are discussed as well.\n", "versions": [{"version": "v1", "created": "Thu, 21 Nov 2019 22:52:56 GMT"}], "update_date": "2020-05-27", "authors_parsed": [["Dixit", "Purushottam D.", ""]]}, {"id": "1911.09948", "submitter": "Dominique Beroule", "authors": "Dominique B\\'eroule (LIMSI), Pascale Gisquet-Verrier (Neuro-PSI)", "title": "Decision Making guided by Emotion A computational architecture", "comments": null, "journal-ref": "WCCI 2012 IEEE world congress on computational intelligence, Jun\n  2012, Brisbane, France", "doi": null, "report-no": null, "categories": "q-bio.NC cs.LG cs.NE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A computational architecture is presented, in which \"swift and fuzzy\"\nemotional channels guide a \"slow and precise\" decision-making channel. Reported\nneurobiological studies first provide hints on the representation of both\nemotional and cognitive dimensions across brain structures, mediated by the\nneuromodulation system. The related model is based on Guided Propagation\nNetworks, the inner flows of which can be guided through modulation. A\nkey-channel of this model grows from a few emotional cues, and is aimed at\nanticipating the consequences of ongoing possible actions. Current experimental\nresults of a computer simulation show the integrated contribution of several\nemotional influences, as well as issues of accidental all-out emotions.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 09:49:34 GMT"}], "update_date": "2019-11-25", "authors_parsed": [["Béroule", "Dominique", "", "LIMSI"], ["Gisquet-Verrier", "Pascale", "", "Neuro-PSI"]]}, {"id": "1911.09959", "submitter": "Sarra Ghanjeti", "authors": "Sarra Ghanjeti", "title": "Alignment of Protein-Protein Interaction Networks", "comments": "57 pages, in French, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  PPI network alignment aims to find topological and functional similarities\nbetween networks of different species. Several alignment approaches have been\nproposed. Each of these approaches relies on a different alignment method and\nuses different biological information during the alignment process such as the\ntopological structure of the networks and the sequence similarities between the\nproteins, but less of them integrate the functional similarities between\nproteins. In this context, we present our algorithm PPINA (Protein-Protein\nInteraction Network Aligner), which is an extension of the NETAL algorithm. The\nlatter aligns two networks based on the sequence, functional and network\ntopology similarity of the proteins. PPINA has been tested on real PPI\nnetworks. The results show that PPINA has outperformed other alignment\nalgorithms where it provides biologically meaningful results.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 10:32:31 GMT"}], "update_date": "2019-11-25", "authors_parsed": [["Ghanjeti", "Sarra", ""]]}, {"id": "1911.10227", "submitter": "Vyom Raval", "authors": "Vyom Raval, Kevin P. Nguyen, Ashley Gerald, Richard B. Dewey Jr.,\n  Albert Montillo", "title": "Prediction of individual progression rate in Parkinson's disease using\n  clinical measures and biomechanical measures of gait and postural stability", "comments": "5 pages, 4 figures, IEEE ICASSP conference submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.LG q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Parkinson's disease (PD) is a common neurological disorder characterized by\ngait impairment. PD has no cure, and an impediment to developing a treatment is\nthe lack of any accepted method to predict disease progression rate. The\nprimary aim of this study was to develop a model using clinical measures and\nbiomechanical measures of gait and postural stability to predict an\nindividual's PD progression over two years. Data from 160 PD subjects were\nutilized. Machine learning models, including XGBoost and Feed Forward Neural\nNetworks, were developed using extensive model optimization and\ncross-validation. The highest performing model was a neural network that used a\ngroup of clinical measures, achieved a PPV of 71% in identifying fast\nprogressors, and explained a large portion (37%) of the variance in an\nindividual's progression rate on held-out test data. This demonstrates the\npotential to predict individual PD progression rate and enrich trials by\nanalyzing clinical and biomechanical measures with machine learning.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 19:35:55 GMT"}], "update_date": "2019-11-26", "authors_parsed": [["Raval", "Vyom", ""], ["Nguyen", "Kevin P.", ""], ["Gerald", "Ashley", ""], ["Dewey", "Richard B.", "Jr."], ["Montillo", "Albert", ""]]}, {"id": "1911.10229", "submitter": "Vyom Raval", "authors": "Vyom Raval, Kevin P. Nguyen, Albert Montillo", "title": "Improved motion correction for functional MRI using an omnibus\n  regression model", "comments": "4 pages, 2 figures, accepted for IEEE ISBI 2020 conference Updated\n  following ISBI reviewer suggestions", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV eess.SP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Head motion during functional Magnetic Resonance Imaging acquisition can\nsignificantly contaminate the neural signal and introduce spurious,\ndistance-dependent changes in signal correlations. This can heavily confound\nstudies of development, aging, and disease. Previous approaches to suppress\nhead motion artifacts have involved sequential regression of nuisance\ncovariates, but this has been shown to reintroduce artifacts. We propose a new\nmotion correction pipeline using an omnibus regression model that avoids this\nproblem by simultaneously regressing out multiple artifacts using the best\nperforming algorithms to estimate each artifact. We quantitatively evaluate its\nmotion artifact suppression performance against sequential regression pipelines\nusing a large heterogeneous dataset (n=151) which includes high-motion subjects\nand multiple disease phenotypes. The proposed concatenated regression pipeline\nsignificantly reduces the association between head motion and functional\nconnectivity while significantly outperforming the traditional sequential\nregression pipelines in eliminating distance-dependent head motion artifacts.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 19:42:36 GMT"}, {"version": "v2", "created": "Tue, 21 Jan 2020 22:35:35 GMT"}], "update_date": "2020-01-23", "authors_parsed": [["Raval", "Vyom", ""], ["Nguyen", "Kevin P.", ""], ["Montillo", "Albert", ""]]}, {"id": "1911.10241", "submitter": "Samuel Finlayson", "authors": "Samuel G. Finlayson, Matthew B.A. McDermott, Alex V. Pickering, Scott\n  L. Lipnick, Isaac S. Kohane", "title": "Cross-modal representation alignment of molecular structure and\n  perturbation-induced transcriptional profiles", "comments": "Accepted for oral presentation at the Pacific Symposium of\n  Biocomputing, 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modeling the relationship between chemical structure and molecular activity\nis a key goal in drug development. Many benchmark tasks have been proposed for\nmolecular property prediction, but these tasks are generally aimed at specific,\nisolated biomedical properties. In this work, we propose a new cross-modal\nsmall molecule retrieval task, designed to force a model to learn to associate\nthe structure of a small molecule with the transcriptional change it induces.\nWe develop this task formally as multi-view alignment problem, and present a\ncoordinated deep learning approach that jointly optimizes representations of\nboth chemical structure and perturbational gene expression profiles. We\nbenchmark our results against oracle models and principled baselines, and find\nthat cell line variability markedly influences performance in this domain. Our\nwork establishes the feasibility of this new task, elucidates the limitations\nof current data and systems, and may serve to catalyze future research in small\nmolecule representation learning.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 20:30:43 GMT"}, {"version": "v2", "created": "Fri, 2 Oct 2020 01:15:26 GMT"}], "update_date": "2020-10-05", "authors_parsed": [["Finlayson", "Samuel G.", ""], ["McDermott", "Matthew B. A.", ""], ["Pickering", "Alex V.", ""], ["Lipnick", "Scott L.", ""], ["Kohane", "Isaac S.", ""]]}, {"id": "1911.10313", "submitter": "Zexuan Sun", "authors": "Zexuan Sun, Shujun Huang, Peiran Jiang and Pingzhao Hu", "title": "DTF: Deep Tensor Factorization for Predicting Anticancer Drug Synergy", "comments": "Final draft in Bioinformatics, btaa287,\n  https://doi.org/10.1093/bioinformatics/btaa287", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Combination therapies have been widely used to treat cancers.\nHowever, it is cost- and time-consuming to experimentally screen synergistic\ndrug pairs due to the enormous number of possible drug combinations. Thus,\ncomputational methods have become an important way to predict and prioritize\nsynergistic drug pairs.\n  Results: We proposed a Deep Tensor Factorization (DTF) model, which\nintegrated a tensor factorization method and a deep neural network (DNN), to\npredict drug synergy. The former extracts latent features from drug synergy\ninformation while the latter constructs a binary classifier to predict the drug\nsynergy status. Compared to the tensor-based method, the DTF model performed\nbetter in predicting drug synergy. The area under the precision-recall curve\n(PR AUC) was 0.57 for DTF and 0.24 for the tensor method. We also compared the\nDTF model with DeepSynergy and logistic regression models and found that the\nDTF outperformed the logistic regression model and achieved almost the same\nperformance as DeepSynergy using several typical metrics for the classification\ntask. Applying the DTF model to predict missing entries in our drug-cell line\ntensor, we identified novel synergistic drug combinations for 10 cell lines\nfrom the 5 cancer types. A literature survey showed that some of these\npredicted drug synergies have been identified in vivo or in vitro. Thus, the\nDTF model could be valuable in silico tool for prioritizing novel synergistic\ndrug combinations.\n", "versions": [{"version": "v1", "created": "Sat, 23 Nov 2019 04:58:13 GMT"}, {"version": "v2", "created": "Tue, 26 Nov 2019 04:19:36 GMT"}, {"version": "v3", "created": "Wed, 27 Nov 2019 16:25:33 GMT"}, {"version": "v4", "created": "Mon, 2 Dec 2019 08:14:45 GMT"}, {"version": "v5", "created": "Sat, 18 Jan 2020 09:19:34 GMT"}, {"version": "v6", "created": "Fri, 28 Feb 2020 05:53:53 GMT"}, {"version": "v7", "created": "Wed, 16 Sep 2020 11:28:14 GMT"}], "update_date": "2020-09-17", "authors_parsed": [["Sun", "Zexuan", ""], ["Huang", "Shujun", ""], ["Jiang", "Peiran", ""], ["Hu", "Pingzhao", ""]]}, {"id": "1911.10559", "submitter": "Tosif Ahamed", "authors": "Tosif Ahamed, Antonio Carlos Costa, Greg J. Stephens", "title": "Capturing the Continuous Complexity of Behavior in C. elegans", "comments": "26 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC math.DS nlin.CD physics.bio-ph q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Animal behavior is often quantified through subjective, incomplete variables\nthat may mask essential dynamics. Here, we develop a behavioral state space in\nwhich the full instantaneous state is smoothly unfolded as a combination of\nshort-time posture dynamics. Our technique is tailored to multivariate\nobservations and extends previous reconstructions through the use of maximal\nprediction. Applied to high-resolution video recordings of the roundworm\n\\textit{C. elegans}, we discover a low-dimensional state space dominated by\nthree sets of cyclic trajectories corresponding to the worm's basic stereotyped\nmotifs: forward, backward, and turning locomotion. In contrast to this broad\nstereotypy, we find variability in the presence of locally-unstable dynamics,\nand this unpredictability shows signatures of deterministic chaos: a collection\nof unstable periodic orbits together with a positive maximal Lyapunov exponent.\nThe full Lyapunov spectrum is symmetric with positive, chaotic exponents\ndriving variability balanced by negative, dissipative exponents driving\nstereotypy. The symmetry is indicative of damped, driven Hamiltonian dynamics\nunderlying the worm's movement control.\n", "versions": [{"version": "v1", "created": "Sun, 24 Nov 2019 16:02:54 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Ahamed", "Tosif", ""], ["Costa", "Antonio Carlos", ""], ["Stephens", "Greg J.", ""]]}, {"id": "1911.10696", "submitter": "Daniel Seara", "authors": "Daniel S. Seara, Benjamin B. Machta, Michael P. Murrell", "title": "Irreversibility in dynamical phases and transitions", "comments": "21 pages main, 24 pages SM, 14 figures (5 main, 9 supplementary)", "journal-ref": "Nature Communications 12, 392 (2021)", "doi": "10.1038/s41467-020-20281-2", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Living and non-living active matter consumes energy at the microscopic scale\nto drive emergent, macroscopic behavior including traveling waves and coherent\noscillations. Recent work has characterized non-equilibrium systems by their\ntotal energy dissipation, but little has been said about how dissipation\nmanifests in distinct spatiotemporal patterns. We introduce a novel measure of\nirreversibility we term the entropy production factor (EPF) to quantify how\ntime reversal symmetry is broken in field theories across scales. We use the\nEPF to characterize a dynamical phase transition in simulations of the\nBrusselator, a prototypical biochemically motivated non-linear oscillator. The\nEPF quantifies the distribution of irreversibility across spatiotemporal\nfrequencies as the Brusselator transitions from local to global coherent\noscillations, bounding the energetic cost to establish spatially synchronized\nbiochemical oscillations.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 04:14:12 GMT"}, {"version": "v2", "created": "Wed, 15 Jan 2020 20:41:42 GMT"}, {"version": "v3", "created": "Wed, 19 Aug 2020 18:06:32 GMT"}], "update_date": "2021-01-22", "authors_parsed": [["Seara", "Daniel S.", ""], ["Machta", "Benjamin B.", ""], ["Murrell", "Michael P.", ""]]}, {"id": "1911.10978", "submitter": "Brendan Odigwe", "authors": "Brendan E. Odigwe, Jesuloluwa S. Eyitayo, Celestine I. Odigwe,\n  Homayoun Valafar", "title": "Modelling of Sickle Cell Anemia Patients Response to Hydroxyurea using\n  Artificial Neural Networks", "comments": "7 Pages, 9 figures, Int'l Conf. Health Informatics and Medical\n  Systems | HIMS'19 |, Las Vegas, NV, July 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hydroxyurea (HU) has been shown to be effective in alleviating the symptoms\nof Sickle Cell Anemia disease. While Hydroxyurea reduces the complications\nassociated with Sickle Cell Anemia in some patients, others do not benefit from\nthis drug and experience deleterious effects since it is also a\nchemotherapeutic agent. Therefore, to whom, should the administration of HU be\nconsidered as a viable option, is the main question asked by the responsible\nphysician. We address this question by developing modeling techniques that can\npredict a patient's response to HU and therefore spare the non-responsive\npatients from the unnecessary effects of HU on the values of 22 parameters that\ncan be obtained from blood samples in 122 patients. Using this data, we\ndeveloped Deep Artificial Neural Network models that can predict with 92.6%\naccuracy, the final HbF value of a subject after undergoing HU therapy. Our\ncurrent studies are focussing on forecasting a patient's HbF response, 30 days\nahead of time.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 15:22:29 GMT"}], "update_date": "2019-12-03", "authors_parsed": [["Odigwe", "Brendan E.", ""], ["Eyitayo", "Jesuloluwa S.", ""], ["Odigwe", "Celestine I.", ""], ["Valafar", "Homayoun", ""]]}, {"id": "1911.11091", "submitter": "Tijana Radivojevic", "authors": "Tijana Radivojevi\\'c, Zak Costello, Kenneth Workman, Hector Garcia\n  Martin", "title": "ART: A machine learning Automated Recommendation Tool for synthetic\n  biology", "comments": null, "journal-ref": null, "doi": "10.1038/s41467-020-18008-4", "report-no": null, "categories": "q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biology has changed radically in the last two decades, transitioning from a\ndescriptive science into a design science. Synthetic biology allows us to\nbioengineer cells to synthesize novel valuable molecules such as renewable\nbiofuels or anticancer drugs. However, traditional synthetic biology approaches\ninvolve ad-hoc engineering practices, which lead to long development times.\nHere, we present the Automated Recommendation Tool (ART), a tool that leverages\nmachine learning and probabilistic modeling techniques to guide synthetic\nbiology in a systematic fashion, without the need for a full mechanistic\nunderstanding of the biological system. Using sampling-based optimization, ART\nprovides a set of recommended strains to be built in the next engineering\ncycle, alongside probabilistic predictions of their production levels. We\ndemonstrate the capabilities of ART on simulated data sets, as well as\nexperimental data from real metabolic engineering projects producing renewable\nbiofuels, hoppy flavored beer without hops, and fatty acids. Finally, we\ndiscuss the limitations of this approach, and the practical consequences of the\nunderlying assumptions failing.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 17:46:36 GMT"}, {"version": "v2", "created": "Fri, 28 Feb 2020 20:33:03 GMT"}], "update_date": "2021-01-27", "authors_parsed": [["Radivojević", "Tijana", ""], ["Costello", "Zak", ""], ["Workman", "Kenneth", ""], ["Martin", "Hector Garcia", ""]]}, {"id": "1911.11190", "submitter": "Max Alekseyev", "authors": "Sergey Aganezov, Pavel Avdeyev, Nikita Alexeev, Yongwu Rong, Max A.\n  Alekseyev", "title": "Orienting Ordered Scaffolds: Complexity and Algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the recent progress in genome sequencing and assembly, many of the\ncurrently available assembled genomes come in a draft form. Such draft genomes\nconsist of a large number of genomic fragments (scaffolds), whose order and/or\norientation (i.e., strand) in the genome are unknown. There exist various\nscaffold assembly methods, which attempt to determine the order and orientation\nof scaffolds along the genome chromosomes. Some of these methods (e.g., based\non FISH physical mapping, chromatin conformation capture, etc.) can infer the\norder of scaffolds, but not necessarily their orientation. This leads to a\nspecial case of the scaffold orientation problem (i.e., deducing the\norientation of each scaffold) with a known order of the scaffolds.\n  We address the problem of orientating ordered scaffolds as an optimization\nproblem based on given weighted orientations of scaffolds and their pairs\n(e.g., coming from pair-end sequencing reads, long reads, or homologous\nrelations). We formalize this problem using notion of a scaffold graph (i.e., a\ngraph, where vertices correspond to the assembled contigs or scaffolds and\nedges represent connections between them). We prove that this problem is\nNP-hard, and present a polynomial-time algorithm for solving its special case,\nwhere orientation of each scaffold is imposed relatively to at most two other\nscaffolds. We further develop an FPT algorithm for the general case of the OOS\nproblem.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 19:45:23 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Aganezov", "Sergey", ""], ["Avdeyev", "Pavel", ""], ["Alexeev", "Nikita", ""], ["Rong", "Yongwu", ""], ["Alekseyev", "Max A.", ""]]}, {"id": "1911.11223", "submitter": "Muhammad Hassan Fares Dr", "authors": "Bilal Taher, Muhammad.H Fares and Saeed Jalili", "title": "A Binary Particle Swarm Optimization Approach for Gene Expression\n  Biclustering Problem", "comments": "arXiv admin note: submission has been withdrawn by arXiv\n  administrators due to inappropriate overlap with external sources", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Microarray techniques are widely used in Gene expression analysis. These\ntechniques are based on discovering submatrices of genes that share similar\nexpression patterns across a set of experimental conditions with coherence\nconstraint. Actually, these submatrices are called biclusters and the\nextraction process is called biclustering. In this paper we present a novel\nbinary particle swarm optimization model for the gene expression biclustering\nproblem. Hence, we apply the binary particle swarm optimization algorithm with\na proposed measure, called Discretized Column-based Measure (DCM) as a novel\ncost function for evaluating biclusters where biological relevance, MSR and the\nsize of the bicluster are considered as evaluation metrics for our results.\nResults are compared to the existing algorithms and they show the validity of\nour proposed approach.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 20:37:49 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Taher", "Bilal", ""], ["Fares", "Muhammad. H", ""], ["Jalili", "Saeed", ""]]}, {"id": "1911.11304", "submitter": "Caitlin Loeffler", "authors": "Caitlin Loeffler, Keylie M. Gibson, Lana Martin, Liz Chang, Jeremy\n  Rotman, Ian V. Toma, Christopher E. Mason, Eleazar Eskin, Joseph P. Zackular,\n  Keith A. Crandall, David Koslicki, Serghei Mangul", "title": "Metagenomics for clinical diagnostics: technologies and informatics", "comments": "75 pages, 7 figures, 2 tables, 4 supplementary table, review paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.GN", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  The human-associated microbiome is closely tied to human health and is of\nsubstantial clinical interest. Metagenomics-based tools are emerging for\nclinical diagnostics, tracking the spread of diseases, and surveillance of\npotential pathogens. In some cases, these tools are overcoming limitations of\ntraditional clinical approaches. Metagenomics has limitations barring the tools\nfrom clinical validation. Once these hurdles are overcome, clinical\nmetagenomics will inform doctors of the best, targeted treatment for their\npatients and provide early detection of disease. Here we present an overview of\nmetagenomics methods with a discussion of computational challenges and\nlimitations.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 01:36:30 GMT"}, {"version": "v2", "created": "Sat, 8 Aug 2020 02:44:42 GMT"}], "update_date": "2020-08-11", "authors_parsed": [["Loeffler", "Caitlin", ""], ["Gibson", "Keylie M.", ""], ["Martin", "Lana", ""], ["Chang", "Liz", ""], ["Rotman", "Jeremy", ""], ["Toma", "Ian V.", ""], ["Mason", "Christopher E.", ""], ["Eskin", "Eleazar", ""], ["Zackular", "Joseph P.", ""], ["Crandall", "Keith A.", ""], ["Koslicki", "David", ""], ["Mangul", "Serghei", ""]]}, {"id": "1911.11409", "submitter": "Erik Fagerholm", "authors": "Erik D. Fagerholm, Rosalyn J. Moran, Robert Leech", "title": "Seizure intervention via diffusion mechanisms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We begin by demonstrating that the neuronal state equation from Dynamic\nCausal Modelling takes on the form of the discretized Fokker-Planck equation\nupon the inclusion of local activity gradients within a network. Using the\nJacobian of this modified neuronal state equation, we show that an initially\nunstable system can be rendered stable via a decrease in diffusivity.\nTherefore, if a node within the system is known to be unstable due to a\ntendency toward epileptic seizures for example, then our results indicate that\nintervention techniques should take the counter-intuitive approach of mirroring\nactivity in the nodes immediately surrounding a pathological region -\neffectively fighting seizures with seizures. Finally, using a two-region system\nas an example, we show that one can also tune diffusivity in such a way as to\nallow for the suppression of oscillatory activity during epileptic seizures.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 08:53:21 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Fagerholm", "Erik D.", ""], ["Moran", "Rosalyn J.", ""], ["Leech", "Robert", ""]]}, {"id": "1911.11840", "submitter": "Mahsa Yazdani", "authors": "Mahsa Yazdani and Omid Tavakoli", "title": "The Effect of Salt Shock on Growth and Pigment Accumulation of\n  Dunaliella Salina", "comments": null, "journal-ref": "The 5th International Symposium on Biological Engineering and\n  Natural Sciences, August 14-16, 2017, Osaka, Japan", "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dunaliella Salina is a halotolerant microalga with great pharmaceutical and\nindustrial potential, which commonly exists in hypersaline environments.\nMoreover, it is the best commercial source of beta-carotene (which has high\nanti-oxidant properties) in comparison to other microalgae. In this study, we\ninvestigated growth and accumulations of chlorophyll a and b, beta-carotene,\nand carotenoid after salt shock in 1, 1.5, 2, 2.5, 3 M concentrations of NaCl.\nThe highest cell growth rate was observed in 1 M salt shock at 22-25 centigrade\nwith a light intensity of 2.084 (mW.cm)^(-2), a light period of 12-12, and at\nan initial pH of about 7.1. Although the cell growth was enhanced in 1 and\n1.5M, further increase in salt content harmed cell growth. The most\nconsiderable beta-carotene quantity was attained after 1M salt shock. According\nto the experimental observations, it was seen that the salt shock in some\nconcentrations is one of the practical approaches to improve the accumulation\nof pigments.\n  Keywords: beta-carotene, Dunaliella salina, salt shock, pigment accumulation.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 21:31:09 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Yazdani", "Mahsa", ""], ["Tavakoli", "Omid", ""]]}, {"id": "1911.11872", "submitter": "Manu Goyal", "authors": "Manu Goyal, Thomas Knackstedt, Shaofeng Yan, and Saeed Hassanpour", "title": "Artificial Intelligence-Based Image Classification for Diagnosis of Skin\n  Cancer: Challenges and Opportunities", "comments": "AI Skin Cancer", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, there has been great interest in developing Artificial Intelligence\n(AI) enabled computer-aided diagnostics solutions for the diagnosis of skin\ncancer. With the increasing incidence of skin cancers, low awareness among a\ngrowing population, and a lack of adequate clinical expertise and services,\nthere is an immediate need for AI systems to assist clinicians in this domain.\nA large number of skin lesion datasets are available publicly, and researchers\nhave developed AI-based image classification solutions, particularly deep\nlearning algorithms, to distinguish malignant skin lesions from benign lesions\nin different image modalities such as dermoscopic, clinical, and histopathology\nimages. Despite the various claims of AI systems achieving higher accuracy than\ndermatologists in the classification of different skin lesions, these AI\nsystems are still in the very early stages of clinical application in terms of\nbeing ready to aid clinicians in the diagnosis of skin cancers. In this review,\nwe discuss advancements in the digital image-based AI solutions for the\ndiagnosis of skin cancer, along with some challenges and future opportunities\nto improve these AI systems to support dermatologists and enhance their ability\nto diagnose skin cancer.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 22:47:34 GMT"}, {"version": "v2", "created": "Thu, 5 Dec 2019 17:17:23 GMT"}, {"version": "v3", "created": "Sat, 20 Jun 2020 18:17:48 GMT"}], "update_date": "2020-06-23", "authors_parsed": [["Goyal", "Manu", ""], ["Knackstedt", "Thomas", ""], ["Yan", "Shaofeng", ""], ["Hassanpour", "Saeed", ""]]}, {"id": "1911.12173", "submitter": "Faniry H. Razafindrazaka", "authors": "Faniry H. Razafindrazaka, Konstantin Poelke, Konrad Polthier, Leonid\n  Goubergrits", "title": "A Consistent Discrete 3D Hodge-type Decomposition: implementation and\n  practical evaluation", "comments": "23 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.DG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Hodge decomposition provides a very powerful mathematical method for the\nanalysis of 2D and 3D vector fields. It states roughly that any vector field\ncan be $L^2$-orthogonally decomposed into a curl-free, divergence-free, and a\nharmonic field. The harmonic field itself can be further decomposed into three\ncomponents, two of which are closely tied to the topology of the underlying\ndomain. For practical computations it is desirable to find a discretization\nwhich preserves as many aspects inherent to the smooth theory as possible while\nat the same time remains computationally tractable, in particular on\nlarge-sized models. The correctness and convergence of such a discretization\ndepends strongly on the choice of ansatz spaces defined on the surface or\nvolumetric mesh to approximate infinite dimensional subspaces. This paper\npresents a consistent discretization of Hodge-type decomposition for piecewise\nconstant vector fields on volumetric meshes. Our approach is based on a careful\ninterplay between edge-based \\textNedelec elements and face-based\nCrouzeix-Raviart elements resulting in a very simple formulation. The method is\nstable under noisy vector field and mesh resolution, and has a good performance\nfor large sized models. We give pseudocodes for a possible implementation of\nthe method together with some insights on how the Hodge decomposition could\nanswer some central question in computational fluid.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 14:22:56 GMT"}, {"version": "v2", "created": "Mon, 16 Dec 2019 13:48:41 GMT"}], "update_date": "2019-12-17", "authors_parsed": [["Razafindrazaka", "Faniry H.", ""], ["Poelke", "Konstantin", ""], ["Polthier", "Konrad", ""], ["Goubergrits", "Leonid", ""]]}, {"id": "1911.12253", "submitter": "Paul Samuel Ignacio", "authors": "Paul Samuel Ignacio, David Uminsky, Christopher Dunstan, Esteban\n  Escobar, Luke Trujillo", "title": "Classification of Single-lead Electrocardiograms: TDA Informed Machine\n  Learning", "comments": "\\c{opyright} 2019 IEEE. Personal use of this material is permitted.\n  Permission from IEEE must be obtained for all other uses, in any current or\n  future media, including reprinting/republishing this material for advertising\n  or promotional purposes, creating new collective works, for resale or\n  redistribution to servers or lists, or reuse of any copyrighted component of\n  this work in other works", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG eess.SP math.AT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Atrial Fibrillation is a heart condition characterized by erratic heart\nrhythms caused by chaotic propagation of electrical impulses in the atria,\nleading to numerous health complications. State-of-the-art models employ\ncomplex algorithms that extract expert-informed features to improve diagnosis.\nIn this note, we demonstrate how topological features can be used to help\naccurately classify single lead electrocardiograms. Via delay embeddings, we\nmap electrocardiograms onto high-dimensional point-clouds that convert periodic\nsignals to algebraically computable topological signatures. We derive features\nfrom persistent signatures, input them to a simple machine learning algorithm,\nand benchmark its performance against winning entries in the 2017 Physionet\nComputing in Cardiology Challenge.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 05:20:48 GMT"}, {"version": "v2", "created": "Thu, 28 Nov 2019 02:12:48 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Ignacio", "Paul Samuel", ""], ["Uminsky", "David", ""], ["Dunstan", "Christopher", ""], ["Escobar", "Esteban", ""], ["Trujillo", "Luke", ""]]}, {"id": "1911.12257", "submitter": "Claire Harris", "authors": "Claire L. Harris, Christina A. Cobbold, Neil Brummitt and Richard\n  Reeve", "title": "Dynamic virtual ecosystems as a tool for detecting large-scale responses\n  of biodiversity to environmental and land-use change", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the face of biodiversity loss, we rely upon measures of diversity to\ndescribe the health of ecosystems and to direct policymakers and conservation\nefforts. However, there are many complexities in natural systems that can\neasily confound biodiversity measures, giving misleading interpretations of the\nsystem status and, as a result, there is yet to be a consistent framework by\nwhich to measure this biodiversity loss. Ecosystems are governed by dynamic\nprocesses, such as reproduction, dispersal and competition for resources, that\nboth shape their biodiversity and how the system responds to change. Here, we\nincorporate these processes into simulations of habitat and environmental\nchange, in order to understand how well we can identify signals of biodiversity\nloss against the background inherent variability these processes introduce. We\ndeveloped a tool for Ecosystem Simulation through Integrated Species\nTrait-Environment Modelling (EcoSISTEM), which models on the species-level for\nseveral sizes of ecosystem, from small islands and patches through to entire\nregions, and several different types of habitat. We tested a suite of\ntraditionally-used and new biodiversity measures on simulated ecosystems\nagainst a range of different scenarios of population decline, invasion and\nhabitat loss. We found that the response of biodiversity measures was generally\nstronger in larger, more heterogeneous habitats than in smaller or homogeneous\nhabitats. We were also able to detect signals of increasing homogenisation in\nclimate change scenarios, which contradicted the signal of increased\nheterogeneity and distinctiveness through habitat loss.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 16:24:16 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Harris", "Claire L.", ""], ["Cobbold", "Christina A.", ""], ["Brummitt", "Neil", ""], ["Reeve", "Richard", ""]]}, {"id": "1911.12279", "submitter": "Thierry Mora", "authors": "Giulio Isacchini, Zachary Sethna, Yuval Elhanati, Armita Nourmohammad,\n  Aleksandra M. Walczak, Thierry Mora", "title": "On generative models of T-cell receptor sequences", "comments": null, "journal-ref": "Phys. Rev. E 101, 062414 (2020)", "doi": "10.1103/PhysRevE.101.062414", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  T-cell receptors (TCR) are key proteins of the adaptive immune system,\ngenerated randomly in each individual, whose diversity underlies our ability to\nrecognize infections and malignancies. Modeling the distribution of TCR\nsequences is of key importance for immunology and medical applications. Here,\nwe compare two inference methods trained on high-throughput sequencing data: a\nknowledge-guided approach, which accounts for the details of sequence\ngeneration, supplemented by a physics-inspired model of selection; and a\nknowledge-free Variational Auto-Encoder based on deep artificial neural\nnetworks. We show that the knowledge-guided model outperforms the deep network\napproach at predicting TCR probabilities, while being more interpretable, at a\nlower computational cost.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 16:49:52 GMT"}, {"version": "v2", "created": "Fri, 13 Mar 2020 16:49:43 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Isacchini", "Giulio", ""], ["Sethna", "Zachary", ""], ["Elhanati", "Yuval", ""], ["Nourmohammad", "Armita", ""], ["Walczak", "Aleksandra M.", ""], ["Mora", "Thierry", ""]]}, {"id": "1911.12291", "submitter": "Florian Jug", "authors": "Mangal Prakash, Manan Lalit, Pavel Tomancak, Alexander Krull, Florian\n  Jug", "title": "Fully Unsupervised Probabilistic Noise2Void", "comments": "Accepted at ISBI 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Image denoising is the first step in many biomedical image analysis pipelines\nand Deep Learning (DL) based methods are currently best performing. A new\ncategory of DL methods such as Noise2Void or Noise2Self can be used fully\nunsupervised, requiring nothing but the noisy data. However, this comes at the\nprice of reduced reconstruction quality. The recently proposed Probabilistic\nNoise2Void (PN2V) improves results, but requires an additional noise model for\nwhich calibration data needs to be acquired. Here, we present improvements to\nPN2V that (i) replace histogram based noise models by parametric noise models,\nand (ii) show how suitable noise models can be created even in the absence of\ncalibration data. This is a major step since it actually renders PN2V fully\nunsupervised. We demonstrate that all proposed improvements are not only\nacademic but indeed relevant.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 17:11:59 GMT"}, {"version": "v2", "created": "Thu, 19 Mar 2020 08:52:52 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Prakash", "Mangal", ""], ["Lalit", "Manan", ""], ["Tomancak", "Pavel", ""], ["Krull", "Alexander", ""], ["Jug", "Florian", ""]]}, {"id": "1911.12755", "submitter": "Yujiang Wang", "authors": "Jona Carmon, Jil Heege, Joe H Necus, Thomas W Owen, Gordon Pipa,\n  Marcus Kaiser, Peter N Taylor, Yujiang Wang", "title": "Reliability and comparability of human brain structural covariance\n  networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Structural covariance analysis is a widely used structural MRI analysis\nmethod which characterises the co-relations of morphology between brain regions\nover a group of subjects. To our knowledge, little has been investigated in\nterms of the comparability of results between different data sets or the\nreliability of results over the same subjects in different rescan sessions,\nimage resolutions, or FreeSurfer versions.\n  In terms of comparability, our results show substantial differences in the\nstructural covariance matrix between data sets of age- and sex-matched healthy\nhuman adults. These differences persist after site correction, they are\nexacerbated by low sample sizes, and they are most pronounced when using\naverage cortical thickness as a morphological measure. Down-stream graph\ntheoretic analyses further show statistically significant differences.\n  In terms of reliability, substantial differences were also found when\ncomparing repeated scan sessions of the same subjects, and image resolutions\nand FreeSurfer versions of the same image. We could further estimate the\nrelative measurement error and showed that it is largest when using thickness.\nWith simulated data, we argue that cortical thickness is least reliable because\nof larger relative measurement errors.\n  Practically, we make the following recommendations (1) pooling subjects\nacross sites into one group should be avoided, particularly if sites differ in\nimage resolutions, demographics, or preprocessing; (2) surface area and volume\nshould be preferred as morphological measures over cortical thickness; (3) a\nlarge number of subjects should be used to estimate structural covariance; (4)\nmeasurement error should be assessed where repeated measurements are available;\n(5) if combining sites is critical, univariate site-correction is insufficient,\nbut error covariance should be explicitly measured and modelled.\n", "versions": [{"version": "v1", "created": "Thu, 28 Nov 2019 15:43:03 GMT"}, {"version": "v2", "created": "Thu, 28 May 2020 20:38:20 GMT"}], "update_date": "2020-06-01", "authors_parsed": [["Carmon", "Jona", ""], ["Heege", "Jil", ""], ["Necus", "Joe H", ""], ["Owen", "Thomas W", ""], ["Pipa", "Gordon", ""], ["Kaiser", "Marcus", ""], ["Taylor", "Peter N", ""], ["Wang", "Yujiang", ""]]}, {"id": "1911.12909", "submitter": "Xiao-Jun Cai", "authors": "Xiaojun Cai (1), Ruidong Li (2), Changcheng Sheng (1,3), Yifeng Tao\n  (2), Quanbao Zhang (2), Xiaofei Zhang (2), Juan Li (2), Conghuan Shen (2),\n  Xiaoyan Qiu (1), Zhengxin Wang (2), Zheng Jiao (1)", "title": "Systematic external evaluation of published population pharmacokinetic\n  models for tacrolimus in adult liver transplant recipients", "comments": null, "journal-ref": "Eur.J.Pharm.Sci.145(2020)105237", "doi": "10.1016/j.ejps.2020.105237", "report-no": "EJPS-D-19-01454", "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background:Diverse tacrolimus population pharmacokinetic models in adult\nliver transplant recipients have been established to describe the PK\ncharacteristics of tacrolimus in the last two decades. However, their\nextrapolated predictive performance remains unclear.Therefore,in this study,we\naimed to evaluate their external predictability and identify their potential\ninfluencing factors. Methods:The external predictability of each selected popPK\nmodel was evaluated using an independent dataset of 84 patients with 572 trough\nconcentrations prospectively collected from Huashan Hospital. Prediction and\nsimulation based diagnostics and Bayesian forecasting were conducted to\nevaluate model predictability. Furthermore, the effect of model structure on\nthe predictive performance was investigated.Results:Sixteen published popPK\nmodels were assessed. In prediction-based diagnostics,the prediction error\nwithin 30% was below 50% in all the published models. The simulation based\nnormalised prediction distribution error test and visual predictive check\nindicated large discrepancies between the observations and simulations in most\nof the models. Bayesian forecasting showed improvement in model predictability\nwith two to three prior observations. Additionally, the predictive performance\nof the nonlinear Michaelis Menten model was superior to that of linear\ncompartment models,indicating the underlying nonlinear kinetics of tacrolimus\nin liver transplant recipients.Conclusions:The published models performed\ninadequately in prediction and simulation based diagnostics. Bayesian\nforecasting may improve the predictive performance of the models. Furthermore,\nnonlinear kinetics of tacrolimus may be mainly caused by the properties of the\ndrug itself, and incorporating nonlinear kinetics may be considered to improve\nmodel predictability.\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2019 00:43:13 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Cai", "Xiaojun", ""], ["Li", "Ruidong", ""], ["Sheng", "Changcheng", ""], ["Tao", "Yifeng", ""], ["Zhang", "Quanbao", ""], ["Zhang", "Xiaofei", ""], ["Li", "Juan", ""], ["Shen", "Conghuan", ""], ["Qiu", "Xiaoyan", ""], ["Wang", "Zhengxin", ""], ["Jiao", "Zheng", ""]]}, {"id": "1911.13077", "submitter": "Kazuya Nishimura", "authors": "Kazuya Nishimura, Dai Fei Elmer Ker, Ryoma Bise", "title": "Weakly Supervised Cell Instance Segmentation by Propagating from\n  Detection Response", "comments": "9 pages, 3 figures, Accepted in MICCAI 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cell shape analysis is important in biomedical research. Deep learning\nmethods may perform to segment individual cells if they use sufficient training\ndata that the boundary of each cell is annotated. However, it is very\ntime-consuming for preparing such detailed annotation for many cell culture\nconditions. In this paper, we propose a weakly supervised method that can\nsegment individual cell regions who touch each other with unclear boundaries in\ndense conditions without the training data for cell regions. We demonstrated\nthe efficacy of our method using several data-set including multiple cell types\ncaptured by several types of microscopy. Our method achieved the highest\naccuracy compared with several conventional methods. In addition, we\ndemonstrated that our method can perform without any annotation by using\nfluorescence images that cell nuclear were stained as training data. Code is\npublicly available in \"https://github.com/naivete5656/WSISPDR\".\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2019 12:29:15 GMT"}], "update_date": "2020-02-26", "authors_parsed": [["Nishimura", "Kazuya", ""], ["Ker", "Dai Fei Elmer", ""], ["Bise", "Ryoma", ""]]}, {"id": "1911.13215", "submitter": "Carlos Enrique Gutierrez", "authors": "Carlos Enrique Gutierrez, Henrik Skibbe, Ken Nakae, Hiromichi Tsukada,\n  Jean Lienard, Akiya Watakabe, Junichi Hata, Marco Reisert, Alexander\n  Woodward, Hideyuki Okano, Tetsuo Yamamori, Yoko Yamaguchi, Shin Ishii and\n  Kenji Doya", "title": "Optimization and Validation of Diffusion MRI-based Fiber Tracking with\n  Neural Tracer Data as a Reference", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.med-ph eess.IV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Diffusion-weighted magnetic resonance imaging (dMRI) allows non-invasive\ninvestigation of whole-brain connectivity, which can potentially help to reveal\nthe brain's global network architecture and abnormalities involved in\nneurological and mental disorders. However, the reliability of connection\ninferences from dMRI-based fiber tracking is still debated, due to low\nsensitivity, dominance of false positives, and inaccurate and incomplete\nreconstruction of long-range connections. Furthermore, parameters of tracking\nalgorithms are typically tuned in a heuristic way, which leaves room for\nmanipulation of an intended result. Here we propose a data-driven framework to\noptimize and validate parameters of dMRI-based fiber-tracking algorithms using\nneural tracer data as a reference. Japan's Brain/MINDS Project provides\ninvaluable datasets containing both dMRI and neural tracer data from the same\nprimates. We considered four criteria for goodness of fiber tracking:\ndistance-weighted coverage, true/false positive ratio, projection coincidence,\nand commissural passage, applied using a multi-objective optimization\nalgorithm. We implemented a variant of non-dominated sorting genetic algorithm\nII (NSGA-II) to optimize five major parameters of a global fiber-tracking\nalgorithm over multiple brain samples in parallel. Using optimized parameters\ncompared to the default parameters, dMRI-based fiber tracking performance was\nsignificantly improved, while minimizing false positives and impossible\ncross-hemisphere connections. Parameters optimized for 10 tracer injection\nsites showed good generalization capability for other brain samples. These\nresults demonstrate the importance of data-driven adjustment of fiber-tracking\nalgorithms and support the validity of dMRI-based tractography, if appropriate\nadjustments are employed.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 15:22:57 GMT"}, {"version": "v2", "created": "Fri, 24 Apr 2020 17:43:39 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Gutierrez", "Carlos Enrique", ""], ["Skibbe", "Henrik", ""], ["Nakae", "Ken", ""], ["Tsukada", "Hiromichi", ""], ["Lienard", "Jean", ""], ["Watakabe", "Akiya", ""], ["Hata", "Junichi", ""], ["Reisert", "Marco", ""], ["Woodward", "Alexander", ""], ["Okano", "Hideyuki", ""], ["Yamamori", "Tetsuo", ""], ["Yamaguchi", "Yoko", ""], ["Ishii", "Shin", ""], ["Doya", "Kenji", ""]]}]