[{"id": "2003.00009", "submitter": "Carlo Vittorio Cannistraci", "authors": "Yan Ge, Philipp Rosendahl, Claudio Dur\\'an, Nicole T\\\"opfner, Sara\n  Ciucci, Jochen Guck, and Carlo Vittorio Cannistraci", "title": "Cell Mechanics Based Computational Classification of Red Blood Cells Via\n  Machine Intelligence Applied to Morpho-Rheological Markers", "comments": "13 pages, 3 figures, 4 tables", "journal-ref": "IEEE/ACM Trans. Comput. Biol. Bioinform (2019)", "doi": "10.1109/TCBB.2019.2945762", "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Despite fluorescent cell-labelling being widely employed in biomedical\nstudies, some of its drawbacks are inevitable, with unsuitable fluorescent\nprobes or probes inducing a functional change being the main limitations.\nConsequently, the demand for and development of label-free methodologies to\nclassify cells is strong and its impact on precision medicine is relevant.\nTowards this end, high-throughput techniques for cell mechanical phenotyping\nhave been proposed to get a multidimensional biophysical characterization of\nsingle cells. With this motivation, our goal here is to investigate the extent\nto which an unsupervised machine learning methodology, which is applied\nexclusively on morpho-rheological markers obtained by real-time deformability\nand fluorescence cytometry (RT-FDC), can address the difficult task of\nproviding label-free discrimination of reticulocytes from mature red blood\ncells. We focused on this problem, since the characterization of reticulocytes\n(their percentage and cellular features) in the blood is vital in multiple\nhuman disease conditions, especially bone-marrow disorders such as anemia and\nleukemia. Our approach reports promising label-free results in the\nclassification of reticulocytes from mature red blood cells, and it represents\na step forward in the development of high-throughput morpho-rheological-based\nmethodologies for the computational categorization of single cells. Besides,\nour methodology can be an alternative but also a complementary method to\nintegrate with existing cell-labelling techniques.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2020 15:11:46 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Ge", "Yan", ""], ["Rosendahl", "Philipp", ""], ["Durán", "Claudio", ""], ["Töpfner", "Nicole", ""], ["Ciucci", "Sara", ""], ["Guck", "Jochen", ""], ["Cannistraci", "Carlo Vittorio", ""]]}, {"id": "2003.00108", "submitter": "Mufti Mahmud", "authors": "Mufti Mahmud, M Shamim Kaiser, Amir Hussain", "title": "Deep Learning in Mining Biological Data", "comments": "36 pages, 8 figures, and 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent technological advancements in data acquisition tools allowed life\nscientists to acquire multimodal data from different biological application\ndomains. Broadly categorized in three types (i.e., sequences, images, and\nsignals), these data are huge in amount and complex in nature. Mining such an\nenormous amount of data for pattern recognition is a big challenge and requires\nsophisticated data-intensive machine learning techniques. Artificial neural\nnetwork-based learning systems are well known for their pattern recognition\ncapabilities and lately their deep architectures - known as deep learning (DL)\n- have been successfully applied to solve many complex pattern recognition\nproblems. Highlighting the role of DL in recognizing patterns in biological\ndata, this article provides - applications of DL to biological sequences,\nimages, and signals data; overview of open access sources of these data;\ndescription of open source DL tools applicable on these data; and comparison of\nthese tools from qualitative and quantitative perspectives. At the end, it\noutlines some open research challenges in mining biological data and puts\nforward a number of possible future perspectives.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2020 23:14:27 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Mahmud", "Mufti", ""], ["Kaiser", "M Shamim", ""], ["Hussain", "Amir", ""]]}, {"id": "2003.00110", "submitter": "Serghei Mangul", "authors": "Mohammed Alser, Jeremy Rotman, Kodi Taraszka, Huwenbo Shi, Pelin Icer\n  Baykal, Harry Taegyun Yang, Victor Xue, Sergey Knyazev, Benjamin D. Singer,\n  Brunilda Balliu, David Koslicki, Pavel Skums, Alex Zelikovsky, Can Alkan,\n  Onur Mutlu, and Serghei Mangul", "title": "Technology dictates algorithms: Recent developments in read alignment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Massively parallel sequencing techniques have revolutionized biological and\nmedical sciences by providing unprecedented insight into the genomes of humans,\nanimals, and microbes. Modern sequencing platforms generate enormous amounts of\ngenomic data in the form of nucleotide sequences or reads. Aligning reads onto\nreference genomes enables the identification of individual-specific genetic\nvariants and is an essential step of the majority of genomic analysis\npipelines. Aligned reads are essential for answering important biological\nquestions, such as detecting mutations driving various human diseases and\ncomplex traits as well as identifying species present in metagenomic samples.\nThe read alignment problem is extremely challenging due to the large size of\nanalyzed datasets and numerous technological limitations of sequencing\nplatforms, and researchers have developed novel bioinformatics algorithms to\ntackle these difficulties. Importantly, computational algorithms have evolved\nand diversified in accordance with technological advances, leading to todays\ndiverse array of bioinformatics tools. Our review provides a survey of\nalgorithmic foundations and methodologies across 107 alignment methods\npublished between 1988 and 2020, for both short and long reads. We provide\nrigorous experimental evaluation of 11 read aligners to demonstrate the effect\nof these underlying algorithms on speed and efficiency of read aligners. We\nseparately discuss how longer read lengths produce unique advantages and\nlimitations to read alignment techniques. We also discuss how general alignment\nalgorithms have been tailored to the specific needs of various domains in\nbiology, including whole transcriptome, adaptive immune repertoire, and human\nmicrobiome studies.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2020 23:15:29 GMT"}, {"version": "v2", "created": "Tue, 14 Apr 2020 19:28:22 GMT"}, {"version": "v3", "created": "Thu, 9 Jul 2020 22:26:29 GMT"}], "update_date": "2020-07-13", "authors_parsed": [["Alser", "Mohammed", ""], ["Rotman", "Jeremy", ""], ["Taraszka", "Kodi", ""], ["Shi", "Huwenbo", ""], ["Baykal", "Pelin Icer", ""], ["Yang", "Harry Taegyun", ""], ["Xue", "Victor", ""], ["Knyazev", "Sergey", ""], ["Singer", "Benjamin D.", ""], ["Balliu", "Brunilda", ""], ["Koslicki", "David", ""], ["Skums", "Pavel", ""], ["Zelikovsky", "Alex", ""], ["Alkan", "Can", ""], ["Mutlu", "Onur", ""], ["Mangul", "Serghei", ""]]}, {"id": "2003.00125", "submitter": "Yuchen He", "authors": "Jingfang \"Kelly\" Zhang (1 and 3), Yuchen R. He (1, 2, and 3), Nahil\n  Sobh (1 and 3), and Gabriel Popescu (1, 2, 3 and 4) ((1) Quantitative Light\n  Imaging Laboratory, (2) Department of Electrical and Computer Engineering,\n  (3) Beckman Institute of Advanced Science and Technology and (4) Department\n  of Bioengineering, University of Illinois at Urbana-Champaign)", "title": "Label-free colorectal cancer screening using deep learning and spatial\n  light interference microscopy (SLIM)", "comments": "17 pages, 6 figures", "journal-ref": "APL Photonics 5, 040805 (2020)", "doi": "10.1063/5.0004723", "report-no": null, "categories": "physics.med-ph eess.IV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current pathology workflow involves staining of thin tissue slices, which\notherwise would be transparent, followed by manual investigation under the\nmicroscope by a trained pathologist. While the hematoxylin and eosin (H&E)\nstain is well-established and a cost-effective method for visualizing histology\nslides, its color variability across preparations and subjectivity across\nclinicians remain unaddressed challenges. To mitigate these challenges,\nrecently we have demonstrated that spatial light interference microscopy (SLIM)\ncan provide a path to intrinsic, objective markers, that are independent of\npreparation and human bias. Additionally, the sensitivity of SLIM to collagen\nfibers yields information relevant to patient outcome, which is not available\nin H&E. Here, we show that deep learning and SLIM can form a powerful\ncombination for screening applications: training on 1,660 SLIM images of colon\nglands and validating on 144 glands, we obtained a benign vs. cancer\nclassification accuracy of 99%. We envision that the SLIM whole slide scanner\npresented here paired with artificial intelligence algorithms may prove\nvaluable as a pre-screening method, economizing the clinician's time and\neffort.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2020 23:48:36 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Zhang", "Jingfang \"Kelly\"", "", "1 and 3"], ["He", "Yuchen R.", "", "1, 2, and 3"], ["Sobh", "Nahil", "", "1 and 3"], ["Popescu", "Gabriel", "", "1, 2, 3 and 4"]]}, {"id": "2003.00241", "submitter": "Pawel Krajewski", "authors": "Pawel Krajewski, Piotr Kachlicki, Anna Piasecka, Maria Surma, Anetta\n  Kuczynska, Krzysztof Mikolajczak, Piotr Ogrodowicz, Aneta Sawikowska, Hanna\n  Cwiek-Kupczynska, Maciej Stobiecki, Pawel Rodziewicz, Lukasz Marczak", "title": "In search of biomarkers and the ideotype of barley tolerant to water\n  scarcity", "comments": "12 pages, 8 figures, 2 supplementary tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In barley plants, water shortage causes many changes on the morphological,\nphysiological and biochemical levels resulting in the reduction of grain yield.\nIn the present study the results of various experiments on the response of the\nsame barley recombinant inbred lines to water shortage, including phenotypic,\nproteomic and metabolomic traits were integrated. Obtained results suggest that\nby a multi-omic approach it is possible to indicate proteomic and metabolomic\ntraits important for reaction of barley plants to reduced water availability.\nAnalysis of regression of drought effect (DE) for grain weight per plant on DE\nof proteomic and metabolomic traits allowed us to suggest ideotype of barley\nplants tolerant to water shortage. It was shown that grain weight under drought\nwas determined significantly by six proteins in leaves and five in roots, the\nfunction of which were connected with defence mechanisms, ion/electron\ntransport, carbon (in leaves) and nitrogen (in roots) metabolism, and in leaves\nadditionally by two proteins of unknown function. Out of numerous metabolites\ndetected in roots only Aspartic and Glutamic acids and one metabolite of\nunknown function, were found to have significant influence on grain weight per\nplant. The role of these traits as biomarkers, and especially as suggested\ntargets of ideotype breeding, has to be further studied. One of the direction\nto be followed is genetic co-localization of proteomic, metabolomic and\nphenotypic traits in the genetic and physical maps of barley genome that can\ndescribe putative functional associations between traits; this is the next step\nof our analysis that is in progress.\n", "versions": [{"version": "v1", "created": "Sat, 29 Feb 2020 11:36:50 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Krajewski", "Pawel", ""], ["Kachlicki", "Piotr", ""], ["Piasecka", "Anna", ""], ["Surma", "Maria", ""], ["Kuczynska", "Anetta", ""], ["Mikolajczak", "Krzysztof", ""], ["Ogrodowicz", "Piotr", ""], ["Sawikowska", "Aneta", ""], ["Cwiek-Kupczynska", "Hanna", ""], ["Stobiecki", "Maciej", ""], ["Rodziewicz", "Pawel", ""], ["Marczak", "Lukasz", ""]]}, {"id": "2003.00381", "submitter": "Edwin Dalmaijer", "authors": "E. S. Dalmaijer, C. L. Nord, and D. E. Astle", "title": "Statistical power for cluster analysis", "comments": "53 pages, 13 figures, 5 tables; for code and data see:\n  https://www.github.com/esdalmaijer/cluster_power", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Cluster algorithms are increasingly popular in biomedical research due to\ntheir compelling ability to identify discrete subgroups in data, and their\nincreasing accessibility in mainstream software. While guidelines exist for\nalgorithm selection and outcome evaluation, there are no firmly established\nways of computing a priori statistical power for cluster analysis. Here, we\nestimated power and accuracy for common analysis pipelines through simulation.\nWe varied subgroup size, number, separation (effect size), and covariance\nstructure. We then subjected generated datasets to dimensionality reduction\n(none, multidimensional scaling, or UMAP) and cluster algorithms (k-means,\nagglomerative hierarchical clustering with Ward or average linkage and\nEuclidean or cosine distance, HDBSCAN). Finally, we compared the statistical\npower of discrete (k-means), \"fuzzy\" (c-means), and finite mixture modelling\napproaches (which include latent profile and latent class analysis). We found\nthat outcomes were driven by large effect sizes or the accumulation of many\nsmaller effects across features, and were unaffected by differences in\ncovariance structure. Sufficient statistical power was achieved with relatively\nsmall samples (N=20 per subgroup), provided cluster separation is large\n({\\Delta}=4). Fuzzy clustering provided a more parsimonious and powerful\nalternative for identifying separable multivariate normal distributions,\nparticularly those with slightly lower centroid separation ({\\Delta}=3).\nOverall, we recommend that researchers 1) only apply cluster analysis when\nlarge subgroup separation is expected, 2) aim for sample sizes of N=20 to N=30\nper expected subgroup, 3) use multidimensional scaling to improve cluster\nseparation, and 4) use fuzzy clustering or finite mixture modelling approaches\nthat are more powerful and more parsimonious with partially overlapping\nmultivariate normal distributions.\n", "versions": [{"version": "v1", "created": "Sun, 1 Mar 2020 02:43:15 GMT"}, {"version": "v2", "created": "Wed, 21 Apr 2021 16:32:34 GMT"}, {"version": "v3", "created": "Tue, 25 May 2021 15:21:57 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Dalmaijer", "E. S.", ""], ["Nord", "C. L.", ""], ["Astle", "D. E.", ""]]}, {"id": "2003.00507", "submitter": "Paolo Castorina", "authors": "P. Castorina, A. Iorio and D. Lanteri", "title": "Data analysis on Coronavirus spreading by macroscopic growth laws", "comments": "8 figures", "journal-ref": "International Journal of Modern Physics CVol. 31, No. 07, 2050103\n  (2020)", "doi": "10.1142/S012918312050103X", "report-no": null, "categories": "physics.soc-ph physics.data-an q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To evaluate the effectiveness of the containment on the epidemic spreading of\nthe new Coronavirus disease 2019, we carry on an analysis of the time evolution\nof the infection in a selected number of different Countries, by considering\nwell-known macroscopic growth laws, the Gompertz law, and the logistic law. We\nalso propose here a generalization of Gompertz law. Our data analysis permits\nan evaluation of the maximum number of infected individuals. The daily data\nmust be compared with the obtained fits, to verify if the spreading is under\ncontrol. From our analysis it appears that the spreading reached saturation in\nChina, due to the strong containment policy of the national government. In\nSingapore a large growth rate, recently observed, suggests the start of a new\nstrong spreading. For South Korea and Italy, instead, the next data on new\ninfections will be crucial to understand if the saturation will be reached for\nlower or higher numbers of infected individuals.\n", "versions": [{"version": "v1", "created": "Sun, 1 Mar 2020 15:45:32 GMT"}, {"version": "v2", "created": "Fri, 13 Mar 2020 21:42:17 GMT"}, {"version": "v3", "created": "Wed, 1 Apr 2020 08:55:57 GMT"}], "update_date": "2020-12-01", "authors_parsed": [["Castorina", "P.", ""], ["Iorio", "A.", ""], ["Lanteri", "D.", ""]]}, {"id": "2003.00612", "submitter": "Andreas Buttensch\\\"on", "authors": "Katerina Kaouri, Vasiliki Bitsouni, Andreas Buttensch\\\"on, R\\\"udiger\n  Thul", "title": "Adhesion-driven patterns in a calcium-dependent model of cancer cell\n  movement", "comments": "27 pages; 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB math.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cancer cells exhibit increased motility and proliferation, which are\ninstrumental in the formation of tumours and metastases. These pathological\nchanges can be traced back to malfunctions of cellular signalling pathways, and\ncalcium signalling plays a prominent role in these. We formulate a new model\nfor cancer cell movement which for the first time explicitly accounts for the\ndependence of cell proliferation and cell-cell adhesion on calcium. At the\nheart of our work is a non-linear, integro-differential (non-local) equation\nfor cancer cell movement, accounting for cell diffusion, advection and\nproliferation. We also employ an established model of cellular calcium\nsignalling with a rich dynamical repertoire that includes experimentally\nobserved periodic wave trains and solitary pulses. The cancer cell density\nexhibits travelling fronts and complex spatial patterns arising from an\nadhesion-driven instability (ADI). We show how the different calcium signals\nand variations in the strengths of cell-cell attraction and repulsion shape the\nemergent cellular aggregation patterns, which are a key component of the\nmetastatic process. Performing a linear stability analysis, we identify\nparameter regions corresponding to ADI. These regions are confirmed by\nnumerical simulations, which also reveal different types of aggregation\npatterns and these patterns are significantly affected by \\ca. Our study\ndemonstrates that the maximal cell density decreases with calcium\nconcentration, while the frequencies of the calcium oscillations and the cell\ndensity oscillations are approximately equal in many cases. Furthermore, as the\ncalcium levels increase the speed of the travelling fronts increases, which is\nrelated to a higher cancer invasion potential. These novel insights provide a\nstep forward in the design of new cancer treatments that may rely on\ncontrolling the dynamics of cellular calcium.\n", "versions": [{"version": "v1", "created": "Sun, 1 Mar 2020 23:39:10 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Kaouri", "Katerina", ""], ["Bitsouni", "Vasiliki", ""], ["Buttenschön", "Andreas", ""], ["Thul", "Rüdiger", ""]]}, {"id": "2003.00657", "submitter": "Ryan Kaveh", "authors": "Ryan Kaveh, Justin Doong, Andy Zhou, Carolyn Schwendeman, Karthik\n  Gopalan, Fred Burghardt, Ana C. Arias, Michel Maharbiz, Rikky Muller", "title": "Wireless User-Generic Ear EEG", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past few years it has been demonstrated that electroencephalography\n(EEG) can be recorded from inside the ear (in-ear EEG). To open the door to\nlow-profile earpieces as wearable brain-computer interfaces (BCIs), this work\npresents a practical in-ear EEG device based on multiple dry electrodes, a\nuser-generic design, and a lightweight wireless interface for streaming data\nand device programming. The earpiece is designed for improved ear canal contact\nacross a wide population of users and is fabricated in a low-cost and scalable\nmanufacturing process based on standard techniques such as vacuum\nforming,plasma-treatment, and spray coating. A 2.5x2.5 cm^2 wireless recording\nmodule is designed to record and stream data wirelessly to a host computer.\nPerformance was evaluated on three human subjects over three months and\ncompared with clinical-grade wet scalp EEG recordings. Recordings of\nspontaneous and evoked physiological signals, eye-blinks, alpha rhythm, and the\nauditory steady-state response (ASSR), are presented. This is the first\nwireless in-ear EEG to our knowledge to incorporate a dry multielectrode,\nuser-generic design. The user-generic ear EEG recorded a mean alpha modulation\nof 2.17, outperforming the state-of-the-art in dry electrode in-ear EEG\nsystems.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2020 04:52:51 GMT"}, {"version": "v2", "created": "Wed, 29 Apr 2020 17:27:15 GMT"}], "update_date": "2020-04-30", "authors_parsed": [["Kaveh", "Ryan", ""], ["Doong", "Justin", ""], ["Zhou", "Andy", ""], ["Schwendeman", "Carolyn", ""], ["Gopalan", "Karthik", ""], ["Burghardt", "Fred", ""], ["Arias", "Ana C.", ""], ["Maharbiz", "Michel", ""], ["Muller", "Rikky", ""]]}, {"id": "2003.00875", "submitter": "Jian Ma", "authors": "Jian Ma", "title": "Predicting TUG score from gait characteristics with video analysis and\n  machine learning", "comments": "Experimental results and discussion are revised. The code for\n  estimating copula entropy is available at https://github.com/majianthu/copent", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.LG eess.IV q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fall is a leading cause of death which suffers the elderly and society. Timed\nUp and Go (TUG) test is a common tool for fall risk assessment. In this paper,\nwe propose a method for predicting TUG score from gait characteristics\nextracted from video with computer vision and machine learning technologies.\nFirst, 3D pose is estimated from video captured with 2D and 3D cameras during\nhuman motion and then a group of gait characteristics are computed from 3D pose\nseries. After that, copula entropy is used to select those characteristics\nwhich are mostly associated with TUG score. Finally, the selected\ncharacteristics are fed into the predictive models to predict TUG score.\nExperiments on real world data demonstrated the effectiveness of the proposed\nmethod. As a byproduct, the associations between TUG score and several gait\ncharacteristics are discovered, which laid the scientific foundation of the\nproposed method and make the predictive models such built interpretable to\nclinical users.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2020 05:27:37 GMT"}, {"version": "v2", "created": "Tue, 28 Apr 2020 11:34:58 GMT"}], "update_date": "2020-04-29", "authors_parsed": [["Ma", "Jian", ""]]}, {"id": "2003.01053", "submitter": "Michael Fanous", "authors": "Michael Fanous, Megan P. Caputo, Young Jae Lee, Laurie A. Rund,\n  Catherine Best-Popescu, Mikhail E. Kandel, Rodney W. Johnson, Tapas Das,\n  Matthew J. Kuchan, Gabriel Popescu", "title": "Quantifying myelin in brain tissue using color spatial light\n  interference microscopy (cSLIM)", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0241084", "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deficient myelination of the brain is associated with neurodevelopmental\ndelays, particularly in high-risk infants, such as those born small in relation\nto their gestational age (SGA). New methods are needed to further study this\ncondition. Here, we employ Color Spatial Light Interference Microscopy (cSLIM),\nwhich uses a brightfield objective and RGB camera to generate pathlength-maps\nwith nanoscale sensitivity in conjunction with a regular brightfield image.\nUsing tissue sections stained with Luxol Fast Blue, the myelin structures were\nsegmented from a brightfield image. Using a binary mask, those portions were\nquantitatively analyzed in the corresponding phase maps. We first used the\nCLARITY method to remove tissue lipids and validate the sensitivity of cSLIM to\nlipid content. We then applied cSLIM to brain histology slices. These specimens\nare from a previous MRI study, which demonstrated that appropriate for\ngestational age (AGA) piglets have increased internal capsule myelination (ICM)\ncompared to small for gestational age (SGA) piglets and that a hydrolyzed fat\ndiet improved ICM in both. The identity of samples was blinded until after\nstatistical analyses.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2020 17:38:39 GMT"}], "update_date": "2021-01-27", "authors_parsed": [["Fanous", "Michael", ""], ["Caputo", "Megan P.", ""], ["Lee", "Young Jae", ""], ["Rund", "Laurie A.", ""], ["Best-Popescu", "Catherine", ""], ["Kandel", "Mikhail E.", ""], ["Johnson", "Rodney W.", ""], ["Das", "Tapas", ""], ["Kuchan", "Matthew J.", ""], ["Popescu", "Gabriel", ""]]}, {"id": "2003.01111", "submitter": "Yu Zhang", "authors": "Yu Zhang, Gongbo Liang, Nathan Jacobs, Xiaoqin Wang", "title": "Unsupervised Domain Adaptation for Mammogram Image Classification: A\n  Promising Tool for Model Generalization", "comments": "Accepted by C-MIMI 2019 as a scientific abstract", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV eess.IV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generalization is one of the key challenges in the clinical validation and\napplication of deep learning models to medical images. Studies have shown that\nsuch models trained on publicly available datasets often do not work well on\nreal-world clinical data due to the differences in patient population and image\ndevice configurations. Also, manually annotating clinical images is expensive.\nIn this work, we propose an unsupervised domain adaptation (UDA) method using\nCycle-GAN to improve the generalization ability of the model without using any\nadditional manual annotations.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2020 02:42:43 GMT"}], "update_date": "2020-03-04", "authors_parsed": [["Zhang", "Yu", ""], ["Liang", "Gongbo", ""], ["Jacobs", "Nathan", ""], ["Wang", "Xiaoqin", ""]]}, {"id": "2003.01214", "submitter": "Ana Pastore Y Piontti", "authors": "Dina Mistry (1), Maria Litvinova (2 and 3), Ana Pastore y Piontti (2),\n  Matteo Chinazzi (2), Laura Fumanelli (4), Marcelo F. C. Gomes (5), Syed A.\n  Haque (2), Quan-Hui Liu (6), Kunpeng Mu (2), Xinyue Xiong (2), M. Elizabeth\n  Halloran (7 and 8), Ira M. Longini Jr. (9), Stefano Merler (4), Marco Ajelli\n  (4), Alessandro Vespignani (2 and 3) ((1) Institute for Disease Modeling,\n  Bellevue, WA, USA, (2) Northeastern University, Boston, MA, USA, (3)\n  Institute for Scientific Interchange Foundation, Turin, Italy, (4) Bruno\n  Kessler Foundation, Trento, Italy, (5) Funda\\c{c}\\~ao Oswaldo Cruz, Rio de\n  Janeiro, Brazil, (6) College of Computer Science, Sichuan University,\n  Chengdu, Sichuan, China, (7) Fred Hutchinson Cancer Research Center, Seattle,\n  WA, USA, (8) Department of Biostatistics, University of Washington, Seattle,\n  WA, USA, (9) Department of Biostatistics, College of Public Health and Health\n  Professions, University of Florida, Gainesville, FL, USA)", "title": "Inferring high-resolution human mixing patterns for disease modeling", "comments": "18 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.soc-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical and computational modeling approaches are increasingly used as\nquantitative tools in the analysis and forecasting of infectious disease\nepidemics. The growing need for realism in addressing complex public health\nquestions is however calling for accurate models of the human contact patterns\nthat govern the disease transmission processes. Here we present a data-driven\napproach to generate effective descriptions of population-level contact\npatterns by using highly detailed macro (census) and micro (survey) data on key\nsocio-demographic features. We produce age-stratified contact matrices for 277\nsub-national administrative regions of countries covering approximately 3.5\nbillion people and reflecting the high degree of cultural and societal\ndiversity of the focus countries. We use the derived contact matrices to model\nthe spread of airborne infectious diseases and show that sub-national\nheterogeneities in human mixing patterns have a marked impact on epidemic\nindicators such as the reproduction number and overall attack rate of epidemics\nof the same etiology. The contact patterns derived here are made publicly\navailable as a modeling tool to study the impact of socio-economic differences\nand demographic heterogeneities across populations on the epidemiology of\ninfectious diseases.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2020 22:33:39 GMT"}], "update_date": "2020-03-04", "authors_parsed": [["Mistry", "Dina", "", "2 and 3"], ["Litvinova", "Maria", "", "2 and 3"], ["Piontti", "Ana Pastore y", "", "7 and 8"], ["Chinazzi", "Matteo", "", "7 and 8"], ["Fumanelli", "Laura", "", "7 and 8"], ["Gomes", "Marcelo F. C.", "", "7 and 8"], ["Haque", "Syed A.", "", "7 and 8"], ["Liu", "Quan-Hui", "", "7 and 8"], ["Mu", "Kunpeng", "", "7 and 8"], ["Xiong", "Xinyue", "", "7 and 8"], ["Halloran", "M. Elizabeth", "", "7 and 8"], ["Longini", "Ira M.", "Jr.", "2 and 3"], ["Merler", "Stefano", "", "2 and 3"], ["Ajelli", "Marco", "", "2 and 3"], ["Vespignani", "Alessandro", "", "2 and 3"]]}, {"id": "2003.01278", "submitter": "Tanja Mittag", "authors": "Erik W. Martin, Jesse B. Hopkins, Tanja Mittag", "title": "Small angle x-ray scattering experiments of monodisperse samples close\n  to the solubility limit", "comments": "24 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The condensation of biomolecules into biomolecular condensates via\nliquid-liquid phase separation (LLPS) is a ubiquitous mechanism that drives\ncellular organization. To enable these functions, biomolecules have evolved to\ndrive LLPS and facilitate partitioning into biomolecular condensates.\nDetermining the molecular features of proteins that encode LLPS will provide\ncritical insights into a plethora of biological processes. Problematically,\nprobing biomolecular dense phases directly is often technologically difficult\nor impossible. By capitalizing on the symmetry between the conformational\nbehavior of biomolecules in dilute solution and dense phases, it is possible to\ninfer details critical to phase separation by precise measurements of the\ndilute phase thus circumventing complicated characterization of dense phases.\nThe symmetry between dilute and dense phases is found in the size and shape of\nthe conformational ensemble of a biomolecule - parameters that small-angle\nx-ray scattering (SAXS) is ideally suited to probe. Recent technological\nadvances have made it possible to accurately characterize samples of\nintrinsically disordered protein regions at low enough concentration to avoid\ninterference from intermolecular attraction, oligomerization or aggregation,\nall of which were previously roadblocks to characterizing self-assembling\nproteins. Herein, we describe the pitfalls inherent to measuring such samples,\nthe details required for circumventing these issues and analysis methods that\nplace the results of SAXS measurements into the theoretical framework of LLPS.\n", "versions": [{"version": "v1", "created": "Tue, 3 Mar 2020 01:17:31 GMT"}], "update_date": "2020-03-04", "authors_parsed": [["Martin", "Erik W.", ""], ["Hopkins", "Jesse B.", ""], ["Mittag", "Tanja", ""]]}, {"id": "2003.01357", "submitter": "Gary Pui-Tung Choi", "authors": "Gary P. T. Choi, Di Qiu, Lok Ming Lui", "title": "Shape analysis via inconsistent surface registration", "comments": null, "journal-ref": "Proceedings of the Royal Society A, 476(2242), 20200147 (2020)", "doi": "10.1098/rspa.2020.0147", "report-no": null, "categories": "cs.CG cs.CV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we develop a framework for shape analysis using inconsistent\nsurface mapping. Traditional landmark-based geometric morphometrics methods\nsuffer from the limited degrees of freedom, while most of the more advanced\nnon-rigid surface mapping methods rely on a strong assumption of the global\nconsistency of two surfaces. From a practical point of view, given two\nanatomical surfaces with prominent feature landmarks, it is more desirable to\nhave a method that automatically detects the most relevant parts of the two\nsurfaces and finds the optimal landmark-matching alignment between those parts,\nwithout assuming any global 1-1 correspondence between the two surfaces. Our\nmethod is capable of solving this problem using inconsistent surface\nregistration based on quasi-conformal theory. It further enables us to quantify\nthe dissimilarity of two shapes using quasi-conformal distortion and\ndifferences in mean and Gaussian curvatures, thereby providing a natural way\nfor shape classification. Experiments on Platyrrhine molars demonstrate the\neffectiveness of our method and shed light on the interplay between function\nand shape in nature.\n", "versions": [{"version": "v1", "created": "Tue, 3 Mar 2020 06:58:16 GMT"}], "update_date": "2020-10-30", "authors_parsed": [["Choi", "Gary P. T.", ""], ["Qiu", "Di", ""], ["Lui", "Lok Ming", ""]]}, {"id": "2003.02251", "submitter": "Kathryn Link", "authors": "Kathryn G. Link, Matthew G. Sorrells, Nicholas A. Danes, Keith B.\n  Neeves, Karin Leiderman, and Aaron L. Fogelson", "title": "A Mathematical Model of Platelet Aggregation in an Extravascular Injury\n  Under Flow", "comments": "35 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB math.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the first mathematical model of flow-mediated primary hemostasis\nin an extravascular injury, which can track the process from initial deposition\nto occlusion. The model consists of a system of ordinary differential equations\n(ODE) that describe platelet aggregation (adhesion and cohesion),\nsoluble-agonist-dependent platelet activation, and the flow of blood through\nthe injury. The formation of platelet aggregates increases resistance to flow\nthrough the injury, which is modeled using the Stokes-Brinkman equations. Data\nfrom analogous experimental (microfluidic flow) and partial differential\nequation models informed parameter values used in the ODE model description of\nplatelet adhesion, cohesion, and activation. This model predicts injury\nocclusion under a range of flow and platelet activation conditions. Simulations\ntesting the effects of shear and activation rates resulted in delayed occlusion\nand aggregate heterogeneity. These results validate our hypothesis that\nflow-mediated dilution of activating chemical ADP hinders aggregate\ndevelopment. This novel modeling framework can be extended to include more\nmechanisms of platelet activation as well as the addition of the biochemical\nreactions of coagulation, resulting in a computationally efficient high\nthroughput screening tool.\n", "versions": [{"version": "v1", "created": "Wed, 4 Mar 2020 18:47:01 GMT"}], "update_date": "2020-03-05", "authors_parsed": [["Link", "Kathryn G.", ""], ["Sorrells", "Matthew G.", ""], ["Danes", "Nicholas A.", ""], ["Neeves", "Keith B.", ""], ["Leiderman", "Karin", ""], ["Fogelson", "Aaron L.", ""]]}, {"id": "2003.02340", "submitter": "Emily Diller", "authors": "Emily Diller and Jason Parker", "title": "Variation in correlation between prognosis and histologic feature based\n  on biopsy selection", "comments": "9 Pages, 2 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Glioblastoma multiform carries a dismal prognosis with poor response to gold\nstandard treatment. Innovative data analysis methods have been developed to\ncharacterize tumor genomic expression with histologic features. In a clinical\nsetting, biopsy selection methods may be constrained by time and financial\nburden to the patient. Thus, we investigate the impact biopsy selection has on\ncorrelation between prognostic and histologic features in 35 patients with GBM.\nWe compared methods using limited volumes, moderate volumes, and enblock tumor\nvolumes. Additionally, we investigated the impact of random versus strategic\nmethods for limited and moderate volume biopsies. Finally, we compared\ncorrelation results by selecting one to five small biopsy. We observed a wide\nrange in correlation significance across selection methods. These findings may\naid clinical management of GBM and direct better biopsy selection necessary for\nthe development and deployment of targeted therapies.\n", "versions": [{"version": "v1", "created": "Wed, 4 Mar 2020 21:35:14 GMT"}], "update_date": "2020-03-06", "authors_parsed": [["Diller", "Emily", ""], ["Parker", "Jason", ""]]}, {"id": "2003.03068", "submitter": "Stefan Schmid", "authors": "Edwige Simonet, Balz Winteler, Jana Frangi, Magdalena Suter, Michael\n  L. Meier, Patric Eichelberger, Heiner Baur, Stefan Schmid", "title": "Walking and running with non-specific chronic low back pain: what about\n  the lumbar lordosis angle?", "comments": "This is the accepted manuscript version of an article published in\n  the Journal of Biomechanics (https://doi.org/10.1016/j.jbiomech.2020.109883)", "journal-ref": null, "doi": "10.1016/j.jbiomech.2020.109883", "report-no": null, "categories": "physics.med-ph physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-specific chronic low back pain (NSCLBP) is a major health problem,\naffecting about one fifth of the population worldwide. To avoid further pain or\ninjury, patients with NSCLBP seem to adopt a stiffer movement pattern during\neveryday living activities. However, it remains unknown how NSCLBP affects the\nlumbar lordosis angle (LLA) during repetitive activities such as walking or\nrunning. This pilot study therefore aimed at exploring possible NSCLBP-related\nalterations in LLAs during walking and running by focusing on discrete\nparameters as well as continuous data. Thirteen patients with NSCLBP and 20\nhealthy pain-free controls were enrolled and underwent a full-body movement\nanalysis involving various everyday living activities such as standing, walking\nand running. LLAs were derived from markers placed on the spinous processes of\nthe vertebrae L1-L5 and S1. Possible group differences in discrete (average and\nrange of motion (ROM)) and continuous LLAs were analyzed descriptively using\nmean differences with confidence intervals ranging from 95% to 75%. Patients\nwith NSCLBP indicated reduced average LLAs during standing, walking and running\nand a tendency for lower LLA-ROM during walking. Analyses of continuous data\nindicated the largest group differences occurring around 25% and 70% of the\nwalking and 25% and 75% of the running cycle. Furthermore, patients indicated a\nreversed movement pattern during running, with increasing instead of a\ndecreasing LLAs after foot strike. This study provides preliminary evidence\nthat NSCLBP might affect LLAs during walking and running. These results can be\nused as a basis for future large-scale investigations involving hypothesis\ntesting.\n", "versions": [{"version": "v1", "created": "Fri, 6 Mar 2020 08:13:30 GMT"}, {"version": "v2", "created": "Mon, 15 Jun 2020 09:33:35 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Simonet", "Edwige", ""], ["Winteler", "Balz", ""], ["Frangi", "Jana", ""], ["Suter", "Magdalena", ""], ["Meier", "Michael L.", ""], ["Eichelberger", "Patric", ""], ["Baur", "Heiner", ""], ["Schmid", "Stefan", ""]]}, {"id": "2003.03638", "submitter": "James Brunner", "authors": "James D. Brunner and Nicholas Chia", "title": "Minimizing the number of optimizations for efficient community dynamic\n  flux balance analysis", "comments": "9 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1007786", "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Dynamic flux balance analysis uses a quasi-steady state assumption to\ncalculate an organism's metabolic activity at each time-step of a dynamic\nsimulation, using the well-known technique of flux balance analysis. For\nmicrobial communities, this calculation is especially costly and involves\nsolving a linear constrained optimization problem for each member of the\ncommunity at each time step. However, this is unnecessary and inefficient, as\nprior solutions can be used to inform future time steps. Here, we show that a\nbasis for the space of internal fluxes can be chosen for each microbe in a\ncommunity and this basis can be used to simulate forward by solving a\nrelatively inexpensive system of linear equations at most time steps. We can\nuse this solution as long as the resulting metabolic activity remains within\nthe optimization problem's constraints (i.e. the solution to the linear system\nof equations remains a feasible to the linear program). As the solution becomes\ninfeasible, it first becomes a feasible but degenerate solution to the\noptimization problem, and we can solve a different but related optimization\nproblem to choose an appropriate basis to continue forward simulation. We\ndemonstrate the efficiency and robustness of our method by comparing with\ncurrently used methods on a four species community, and show that our method\nrequires at least $91\\%$ fewer optimizations to be solved. For reproducibility,\nwe prototyped the method using Python. Source code is available at\n\\verb|https://github.com/jdbrunner/surfin_fba|.\n", "versions": [{"version": "v1", "created": "Sat, 7 Mar 2020 19:07:31 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2020 23:08:33 GMT"}], "update_date": "2021-01-27", "authors_parsed": [["Brunner", "James D.", ""], ["Chia", "Nicholas", ""]]}, {"id": "2003.03811", "submitter": "Xinmeng Li", "authors": "Xinmeng Li, James A. Van Deventer, and Soha Hassoun", "title": "ASAP-SML: An Antibody Sequence Analysis Pipeline Using Statistical\n  Testing and Machine Learning", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1007779", "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Antibodies are capable of potently and specifically binding individual\nantigens and, in some cases, disrupting their functions. The key challenge in\ngenerating antibody-based inhibitors is the lack of fundamental information\nrelating sequences of antibodies to their unique properties as inhibitors. We\ndevelop a pipeline, Antibody Sequence Analysis Pipeline using Statistical\ntesting and Machine Learning (ASAP-SML), to identify features that distinguish\none set of antibody sequences from antibody sequences in a reference set. The\npipeline extracts feature fingerprints from sequences. The fingerprints\nrepresent germline, CDR canonical structure, isoelectric point and frequent\npositional motifs. Machine learning and statistical significance testing\ntechniques are applied to antibody sequences and extracted feature fingerprints\nto identify distinguishing feature values and combinations thereof. To\ndemonstrate how it works, we applied the pipeline on sets of antibody sequences\nknown to bind or inhibit the activities of matrix metalloproteinases (MMPs), a\nfamily of zinc-dependent enzymes that promote cancer progression and undesired\ninflammation under pathological conditions, against reference datasets that do\nnot bind or inhibit MMPs. ASAP-SML identifies features and combinations of\nfeature values found in the MMP-targeting sets that are distinct from those in\nthe reference sets.\n", "versions": [{"version": "v1", "created": "Sun, 8 Mar 2020 16:53:42 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Li", "Xinmeng", ""], ["Van Deventer", "James A.", ""], ["Hassoun", "Soha", ""]]}, {"id": "2003.03829", "submitter": "Giuseppe De Vito", "authors": "Giuseppe de Vito, Valentina Cappello, Ilaria Tonazzini, Marco\n  Cecchini, Vincenzo Piazza", "title": "RP-CARS reveals molecular spatial order anomalies in myelin of an animal\n  model of Krabbe disease", "comments": "19 pages, 7 figures. This is the pre-peer reviewed version of an\n  article that has been published in final form on Journal of Biophotonics", "journal-ref": "Journal of Biophotonics 10 (2017) 385-393", "doi": "10.1002/jbio.201500305", "report-no": null, "categories": "q-bio.NC q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Krabbe disease (KD) is a rare demyelinating sphingolipidosis, often fatal in\nthe first years of life. It is caused by the inactivation of the\ngalactocerebrosidase (GALC) enzyme that causes an increase in the cellular\nlevels of psychosine considered to be at the origin of the tissue-level\neffects. GALC is inactivated also in the Twitcher (TWI) mouse: a genetic model\nof KD that is providing important insights into the understating of the\npathogenetic process and the development of possible treatments. In this\narticle an innovative optical technique, RP-CARS, is proposed as a tool to\nstudy the degree of order of the CH2 bonds inside the myelin sheaths of\nTWI-mice sciatic-nerve fibres. RP-CARS, a recently developed variation of CARS\nmicroscopy, is able to combine the intrinsic chemical selectivity of CARS\nmicroscopy with molecular-bond-spatial-orientation sensibility. This is the\nfirst time RP-CARS is applied to the study of a genetic model of a pathology,\nleading to the demonstration of a post-onset progressive spatial\ndisorganization of the myelin CH2 bonds. The presented result could be of great\ninterest for a deeper understanding of the pathogenic mechanisms underlying the\nhuman KD and, moreover, it is an additional proof of the experimental validity\nof this microscopy technique.\n", "versions": [{"version": "v1", "created": "Sun, 8 Mar 2020 19:00:00 GMT"}], "update_date": "2020-03-10", "authors_parsed": [["de Vito", "Giuseppe", ""], ["Cappello", "Valentina", ""], ["Tonazzini", "Ilaria", ""], ["Cecchini", "Marco", ""], ["Piazza", "Vincenzo", ""]]}, {"id": "2003.04096", "submitter": "Francesca Romana Bertani", "authors": "F. R. Bertani, L. Businaro, L. Gambacorta, A.Mencattin, D. Brenda, D.\n  Di Giuseppe, A. De Ninno, M. Solfrizzo, E. Martinelli, A. Gerardino", "title": "Optical detection of Aflatoxins B in grained almonds using fluorescence\n  spectroscopy and machine learning algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM physics.data-an", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Aflatoxins are fungal metabolites extensively produced by many different\nfungal species that may contaminate a wide range of agricultural food products.\nThey have been studied extensively because of being associated with various\nchronic and acute diseases especially immunosuppression and cancer and their\npresence in food is strictly monitored and regulated worldwide. Aflatoxin\ndetection and measurement relies mainly on chemical methods usually based on\nchromatography approaches, and recently developed immunochemical based assays\nthat have advantages but also limitations, since these are expensive and\ndestructive techniques. Nondestructive, optical approaches are recently being\ndeveloped to assess presence of contamination in a cost and time effective way,\nmaintaining acceptable accuracy and reproducibility. In this paper are\npresented the results obtained with a simple portable device for nondestructive\ndetection of aflatoxins in almonds. The presented approach is based on the\nanalysis of fluorescence spectra of slurried almonds under 375 nm wavelength\nexcitation. Experiments were conducted with almonds contaminated in the range\nof 2.7-320.2 ng/g total aflatoxins B (AFB1 + AFB2) as determined by HPLC/FLD.\nAfter applying pre-processing steps, spectral analysis was carried out by a\nbinary classification model based on SVM algorithm. A majority vote procedure\nwas then performed on the classification results. In this way we could achieve,\nas best result, a classification accuracy of 94% (and false negative rate 5%)\nwith a threshold set at 6.4 ng/g. These results illustrate the feasibility of\nsuch an approach in the great challenge of aflatoxin detection for food and\nfeed safety.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 14:53:46 GMT"}], "update_date": "2020-03-10", "authors_parsed": [["Bertani", "F. R.", ""], ["Businaro", "L.", ""], ["Gambacorta", "L.", ""], ["Mencattin", "A.", ""], ["Brenda", "D.", ""], ["Di Giuseppe", "D.", ""], ["De Ninno", "A.", ""], ["Solfrizzo", "M.", ""], ["Martinelli", "E.", ""], ["Gerardino", "A.", ""]]}, {"id": "2003.04231", "submitter": "Payal Bal Dr", "authors": "Payal Bal, Simon Kapitza, Natasha Cadenhead, Tom Kompas, Pham Van Ha,\n  Brendan Wintle", "title": "Predicting the ecological outcomes of global consumption", "comments": "40 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mapping pathways to achieving the sustainable development goals requires\nunderstanding and predicting how social, economic and political factors impact\nbiodiversity. Trends in demography, economic growth, regional alliances and\nconsumption behaviours can have profound effects on the environment by driving\nresource use and production. While these distant socio-economic drivers impact\nspecies and ecosystems at global scales, for example by driving greenhouse gas\nemissions and climate change, the most prevalent human impacts on biodiversity\nmanifest through habitat loss and land use change decisions at finer scales. We\nprovide the first integrated ecological-economic analysis pathway capable of\nsupporting both national policy design challenges and global scale assessment\nof biodiversity risks posed by socio-economic drivers such as population\ngrowth, consumption and trade. To achieve this, we provide state-of-the-art\nintegration of economic, land use, and biodiversity modelling, and illustrate\nits application using two case studies. We evaluate the national-level\nimplications of change in trading conditions under a multi-lateral free trade\nagreement for the bird biodiversity of Vietnam. We review the implications for\nland-use and biodiversity under coupled socio-economic (Shared Socioeconomic\nPathways) and climate (Resource Concentration Pathways) scenarios for\nAustralia. Our study provides a roadmap for setting up high dimensional\nintegrated analyses foe evaluating global priorities for protecting nature and\nlivelihoods in vulnerable areas with the greatest conflicts for economic,\nsocial and environmental opportunities.\n", "versions": [{"version": "v1", "created": "Mon, 9 Mar 2020 16:12:16 GMT"}], "update_date": "2020-03-26", "authors_parsed": [["Bal", "Payal", ""], ["Kapitza", "Simon", ""], ["Cadenhead", "Natasha", ""], ["Kompas", "Tom", ""], ["Van Ha", "Pham", ""], ["Wintle", "Brendan", ""]]}, {"id": "2003.04344", "submitter": "Amira Eltony", "authors": "Amira M. Eltony, Peng Shao, and Seok-Hyun Yun", "title": "Measuring mechanical anisotropy of the cornea with Brillouin microscopy", "comments": "15 pages, 4 figures, 1 table, supplementary materials included (4\n  pages)", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph physics.optics q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Load-bearing tissues are typically fortified by networks of protein fibers,\noften with preferential orientations. This fiber structure imparts the tissues\nwith direction-dependent mechanical properties optimized to support specific\nexternal loads. To accurately model and predict tissues' mechanical response,\nit is essential to characterize the anisotropy on a microstructural scale.\nPreviously, it has been difficult to measure the mechanical properties of\nintact tissues noninvasively. Here, we use Brillouin optical microscopy to\nvisualize and quantify the anisotropic mechanical properties of corneal tissues\nat different length scales. We derive the stiffness tensor for a lamellar\nnetwork of collagen fibrils and use angle-resolved Brillouin measurements to\ndetermine the longitudinal stiffness coefficients (longitudinal moduli)\ndescribing the ex vivo porcine cornea as a transverse isotropic material.\nLastly, we observe significant mechanical anisotropy of the human cornea in\nvivo, highlighting the potential for clinical applications of off-axis\nBrillouin microscopy.\n", "versions": [{"version": "v1", "created": "Mon, 9 Mar 2020 18:17:09 GMT"}], "update_date": "2020-03-11", "authors_parsed": [["Eltony", "Amira M.", ""], ["Shao", "Peng", ""], ["Yun", "Seok-Hyun", ""]]}, {"id": "2003.04655", "submitter": "Yaozong Gao", "authors": "Fei Shan, Yaozong Gao, Jun Wang, Weiya Shi, Nannan Shi, Miaofei Han,\n  Zhong Xue, Dinggang Shen, Yuxin Shi", "title": "Lung Infection Quantification of COVID-19 in CT Images with Deep\n  Learning", "comments": "23 pages, 6 figures", "journal-ref": null, "doi": "10.1002/mp.14609", "report-no": null, "categories": "cs.CV eess.IV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  CT imaging is crucial for diagnosis, assessment and staging COVID-19\ninfection. Follow-up scans every 3-5 days are often recommended for disease\nprogression. It has been reported that bilateral and peripheral ground glass\nopacification (GGO) with or without consolidation are predominant CT findings\nin COVID-19 patients. However, due to lack of computerized quantification\ntools, only qualitative impression and rough description of infected areas are\ncurrently used in radiological reports. In this paper, a deep learning\n(DL)-based segmentation system is developed to automatically quantify infection\nregions of interest (ROIs) and their volumetric ratios w.r.t. the lung. The\nperformance of the system was evaluated by comparing the automatically\nsegmented infection regions with the manually-delineated ones on 300 chest CT\nscans of 300 COVID-19 patients. For fast manual delineation of training samples\nand possible manual intervention of automatic results, a human-in-the-loop\n(HITL) strategy has been adopted to assist radiologists for infection region\nsegmentation, which dramatically reduced the total segmentation time to 4\nminutes after 3 iterations of model updating. The average Dice simiarility\ncoefficient showed 91.6% agreement between automatic and manual infaction\nsegmentations, and the mean estimation error of percentage of infection (POI)\nwas 0.3% for the whole lung. Finally, possible applications, including but not\nlimited to analysis of follow-up CT scans and infection distributions in the\nlobes and segments correlated with clinical findings, were discussed.\n", "versions": [{"version": "v1", "created": "Tue, 10 Mar 2020 11:58:40 GMT"}, {"version": "v2", "created": "Wed, 11 Mar 2020 04:18:00 GMT"}, {"version": "v3", "created": "Mon, 30 Mar 2020 08:30:39 GMT"}], "update_date": "2020-12-01", "authors_parsed": [["Shan", "Fei", ""], ["Gao", "Yaozong", ""], ["Wang", "Jun", ""], ["Shi", "Weiya", ""], ["Shi", "Nannan", ""], ["Han", "Miaofei", ""], ["Xue", "Zhong", ""], ["Shen", "Dinggang", ""], ["Shi", "Yuxin", ""]]}, {"id": "2003.04745", "submitter": "Abir Belaala", "authors": "Abir Belaala (LINFI Laboratory, Biskra University), Labib Sadek\n  (Terrissa LINFI Laboratory, Biskra University), Noureddine Zerhouni (FEMTO-ST\n  Institute, CNRS - UFC / ENSMM / UTBM, Automatic Control and Micro-Mechatronic\n  Systems), Christine Devalland (Service of Anatomy and Pathology Cytology)", "title": "Spitzoid Lesions Diagnosis based on GA feature selection and Random\n  Forest", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Spitzoid lesions broadly categorized into Spitz Nevus (SN), Atypical Spitz\nTumors (AST), and Spitz Melanomas (SM). The accurate diagnosis of these lesions\nis one of the most challenges for dermapathologists; this is due to the high\nsimilarities between them. Data mining techniques are successfully applied to\nsituations like these where complexity exists. This study aims to develop an\nartificial intelligence model to support the diagnosis of Spitzoid lesions. A\nprivate spitzoid lesions dataset have been used to evaluate the system proposed\nin this study. The proposed system has three stages. In the first stage, SMOTE\nmethod applied to solve the imbalance data problem, in the second stage, in\norder to eliminate irrelevant features; genetic algorithm is used to select\nsignificant features. This later reduces the computational complexity and speed\nup the data mining process. In the third stage, Random forest classifier is\nemployed to make a decision for two different categories of lesions (Spitz\nnevus or Atypical Spitz Tumors). The performance of our proposed scheme is\nevaluated using accuracy, sensitivity, specificity, G-mean, F- measure, ROC and\nAUC. Results obtained with our SMOTE-GA-RF model with GA-based 16 features show\na great performance with accuracy 0.97, F-measure 0.98, AUC 0.98, and G-mean\n0.97.Results obtained in this study have potential to open new opportunities in\ndiagnosis of spitzoid lesions.\n", "versions": [{"version": "v1", "created": "Tue, 10 Mar 2020 14:03:28 GMT"}, {"version": "v2", "created": "Wed, 3 Jun 2020 13:23:16 GMT"}], "update_date": "2020-06-04", "authors_parsed": [["Belaala", "Abir", "", "LINFI Laboratory, Biskra University"], ["Sadek", "Labib", "", "Terrissa LINFI Laboratory, Biskra University"], ["Zerhouni", "Noureddine", "", "FEMTO-ST\n  Institute, CNRS - UFC / ENSMM / UTBM, Automatic Control and Micro-Mechatronic\n  Systems"], ["Devalland", "Christine", "", "Service of Anatomy and Pathology Cytology"]]}, {"id": "2003.04805", "submitter": "Razvan Marinescu", "authors": "Razvan V. Marinescu", "title": "Modelling the Neuroanatomical Progression of Alzheimer's Disease and\n  Posterior Cortical Atrophy", "comments": "PhD thesis; Defended in Jan 2019 at University College London", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC stat.AP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In order to find effective treatments for Alzheimer's disease (AD), we need\nto identify subjects at risk of AD as early as possible. To this end, recently\ndeveloped disease progression models can be used to perform early diagnosis, as\nwell as predict the subjects' disease stages and future evolution. However,\nthese models have not yet been applied to rare neurodegenerative diseases, are\nnot suitable to understand the complex dynamics of biomarkers, work only on\nlarge multimodal datasets, and their predictive performance has not been\nobjectively validated. In this work I developed novel models of disease\nprogression and applied them to estimate the progression of Alzheimer's disease\nand Posterior Cortical atrophy, a rare neurodegenerative syndrome causing\nvisual deficits. My first contribution is a study on the progression of\nPosterior Cortical Atrophy, using models already developed: the Event-based\nModel (EBM) and the Differential Equation Model (DEM). My second contribution\nis the development of DIVE, a novel spatio-temporal model of disease\nprogression that estimates fine-grained spatial patterns of pathology,\npotentially enabling us to understand complex disease mechanisms relating to\npathology propagation along brain networks. My third contribution is the\ndevelopment of Disease Knowledge Transfer (DKT), a novel disease progression\nmodel that estimates the multimodal progression of rare neurodegenerative\ndiseases from limited, unimodal datasets, by transferring information from\nlarger, multimodal datasets of typical neurodegenerative diseases. My fourth\ncontribution is the development of novel extensions for the EBM and the DEM,\nand the development of novel measures for performance evaluation of such\nmodels. My last contribution is the organization of the TADPOLE challenge, a\ncompetition which aims to identify algorithms and features that best predict\nthe evolution of AD.\n", "versions": [{"version": "v1", "created": "Sat, 29 Feb 2020 21:59:52 GMT"}], "update_date": "2020-03-11", "authors_parsed": [["Marinescu", "Razvan V.", ""]]}, {"id": "2003.04890", "submitter": "Giuseppe De Vito", "authors": "Giuseppe De Vito, Paola Parlanti, Roberta Cecchi, Stefano Luin,\n  Valentina Cappello, Ilaria Tonazzini, Vincenzo Piazza", "title": "Effects of fixatives on myelin molecular order probed with RP-CARS\n  microscopy", "comments": "11 pages, 4 figures. This is the peer reviewed version of an article\n  that has been published in final form by Applied Optics. Please note that the\n  copyright statement on the front page of the article allows posting of this\n  manuscript by authors on arXiv, as specified here:\n  https://www.osapublishing.org/submit/review/copyright_permissions.cfm", "journal-ref": "Applied Optics 59 (2020) 1756-1762", "doi": "10.1364/AO.384662", "report-no": null, "categories": "q-bio.TO q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When live imaging is not feasible, sample fixation allows preserving the\nultrastructure of biological samples for subsequent microscopy analysis. This\nprocess could be performed with various methods, each one affecting differently\nthe biological structure of the sample. While these alterations were\nwell-characterized using traditional microscopy, little information is\navailable about the effects of the fixatives on the spatial molecular\norientation of the biological tissue. We tackled this issue by employing\nRotating-Polarization Coherent Anti-Stokes Raman Scattering (RP-CARS)\nmicroscopy to study the effects of different fixatives on the myelin\nsub-micrometric molecular order and micrometric morphology. RP-CARS is a novel\ntechnique derived from CARS microscopy that allows probing spatial orientation\nof molecular bonds while maintaining the intrinsic chemical selectivity of CARS\nmicroscopy. By characterizing the effects of the fixation procedures, the\npresent work represents a useful guide for the choice of the best fixation\ntechnique(s), in particular for polarisation-resolved CARS microscopy. Finally,\nwe show that the combination of paraformaldehyde and glutaraldehyde can be\neffectively employed as a fixative for RP-CARS microscopy, as long as the\neffects on the molecular spatial distribution, here characterized, are taken\ninto account.\n", "versions": [{"version": "v1", "created": "Mon, 9 Mar 2020 19:16:17 GMT"}], "update_date": "2020-03-12", "authors_parsed": [["De Vito", "Giuseppe", ""], ["Parlanti", "Paola", ""], ["Cecchi", "Roberta", ""], ["Luin", "Stefano", ""], ["Cappello", "Valentina", ""], ["Tonazzini", "Ilaria", ""], ["Piazza", "Vincenzo", ""]]}, {"id": "2003.05092", "submitter": "Xiaohuan Xue", "authors": "Xiaohuan Xue", "title": "Estimation of within-study covariances in multivariate meta-analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME cs.NA math.NA q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multivariate meta-analysis can be adapted to a wide range of situations for\nmultiple outcomes and multiple treatment groups when combining studies\ntogether. The within-study correlation between effect sizes is often assumed\nknown in multivariate meta-analysis while it is not always known practically.\nIn this paper, we propose a generic method to approximate the within-study\ncovariance for effect sizes in multivariate meta-analysis and apply this method\nto the scenarios with multiple outcomes and one outcome with multiple treatment\ngroups respectively.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 03:13:23 GMT"}], "update_date": "2020-03-12", "authors_parsed": [["Xue", "Xiaohuan", ""]]}, {"id": "2003.05331", "submitter": "Maximilian Pichler", "authors": "Maximilian Pichler, Florian Hartig", "title": "A new method for faster and more accurate inference of species\n  associations from big community data", "comments": "65 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE stat.AP stat.CO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  1. Joint Species Distribution models (JSDMs) explain spatial variation in\ncommunity composition by contributions of the environment, biotic associations,\nand possibly spatially structured residual covariance. They show great promise\nas a general analytical framework for community ecology and macroecology, but\ncurrent JSDMs, even when approximated by latent variables, scale poorly on\nlarge datasets, limiting their usefulness for currently emerging big (e.g.,\nmetabarcoding and metagenomics) community datasets. 2. Here, we present a\nnovel, more scalable JSDM (sjSDM) that circumvents the need to use latent\nvariables by using a Monte-Carlo integration of the joint JSDM likelihood and\nallows flexible elastic net regularization on all model components. We\nimplemented sjSDM in PyTorch, a modern machine learning framework that can make\nuse of CPU and GPU calculations. Using simulated communities with known\nspecies-species associations and different number of species and sites, we\ncompare sjSDM with state-of-the-art JSDM implementations to determine\ncomputational runtimes and accuracy of the inferred species-species and\nspecies-environmental associations. 3. We find that sjSDM is orders of\nmagnitude faster than existing JSDM algorithms (even when run on the CPU) and\ncan be scaled to very large datasets. Despite the dramatically improved speed,\nsjSDM produces more accurate estimates of species association structures than\nalternative JSDM implementations. We demonstrate the applicability of sjSDM to\nbig community data using eDNA case study with thousands of fungi operational\ntaxonomic units (OTU). 4. Our sjSDM approach makes the analysis of JSDMs to\nlarge community datasets with hundreds or thousands of species possible,\nsubstantially extending the applicability of JSDMs in ecology. We provide our\nmethod in an R package to facilitate its applicability for practical data\nanalysis.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 14:37:02 GMT"}, {"version": "v2", "created": "Thu, 26 Mar 2020 08:11:01 GMT"}, {"version": "v3", "created": "Tue, 16 Jun 2020 13:26:47 GMT"}, {"version": "v4", "created": "Mon, 12 Oct 2020 11:46:42 GMT"}, {"version": "v5", "created": "Fri, 2 Jul 2021 09:24:25 GMT"}], "update_date": "2021-07-05", "authors_parsed": [["Pichler", "Maximilian", ""], ["Hartig", "Florian", ""]]}, {"id": "2003.05406", "submitter": "Homayoun Valafar", "authors": "Timothy Matthew Fawcett, Stephanie Irausquin, Mikhail Simin, Homayoun\n  Valafar", "title": "An Artificial Neural Network Based Approach for Identification of Native\n  Protein Structures using an Extended ForceField", "comments": null, "journal-ref": "2011 IEEE International Conference on Bioinformatics and\n  Biomedicine, 500-505", "doi": "10.1109/BIBM.2011.53", "report-no": null, "categories": "q-bio.BM q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current protein forcefields like the ones seen in CHARMM or Xplor-NIH have\nmany terms that include bonded and non-bonded terms. Yet the forcefields do not\ntake into account the use of hydrogen bonds which are important for secondary\nstructure creation and stabilization of proteins. SCOPE is an open-source\nprogram that generates proteins from rotamer space. It then creates a\nforcefield that uses only non-bonded and hydrogen bond energy terms to create a\nprofile for a given protein. The profiles can then be used in an artificial\nneural network to create a linear model that is funneled to the true protein\nconformation.\n", "versions": [{"version": "v1", "created": "Thu, 5 Mar 2020 13:47:29 GMT"}], "update_date": "2020-03-12", "authors_parsed": [["Fawcett", "Timothy Matthew", ""], ["Irausquin", "Stephanie", ""], ["Simin", "Mikhail", ""], ["Valafar", "Homayoun", ""]]}, {"id": "2003.05666", "submitter": "Liu Hong", "authors": "Wuyue Yang, Dongyan Zhang, Liangrong Peng, Changjing Zhuge, Liu Hong", "title": "Rational evaluation of various epidemic models based on the COVID-19\n  data of China", "comments": "18 pages, 5 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During the study of epidemics, one of the most significant and also\nchallenging problems is to forecast the future trends, on which all follow-up\nactions of individuals and governments heavily rely. However, to pick out a\nreliable predictable model/method is far from simple, a rational evaluation of\nvarious possible choices is eagerly needed, especially under the severe threat\nof COVID-19 pandemics now.\n  Based on the public COVID-19 data of seven provinces/cities in China reported\nduring the spring of 2020, we make a systematical investigation on the forecast\nability of eight widely used empirical functions, four statistical inference\nmethods and five dynamical models. We highlight the significance of a well\nbalance between model complexity and accuracy, over-fitting and under-fitting,\nas well as model robustness and sensitivity. We further introduce the Akaike\ninformation criterion, root mean square error and robustness index to evaluate\nvarious epidemic models/methods.\n  Through extensive simulations, we find that the inflection point plays a\ncrucial role in forecasting. We further notice the Logistic function steadily\nunderestimate the final epidemic size, while the Gomertz's function makes an\noverestimation in all cases. Since the methods of sequential Bayesian and time\ndependent reproduction number take the non-constant nature of the effective\nreproduction number into consideration, we suggest to employ them especially in\nthe late stage of an epidemic. The transition-like behavior of exponential\ngrowth method from underestimation to overestimation with respect to the\ninflection point might be useful for constructing a more reliable forecast.\nTowards the ODE models, the SEIR-QD and SEIR-PO models are shown to be suitable\nfor modeling the COVID-19 epidemics, whose success could be attributed to the\ninclusion of self-protection and quarantine.\n", "versions": [{"version": "v1", "created": "Thu, 12 Mar 2020 08:58:39 GMT"}], "update_date": "2020-03-13", "authors_parsed": [["Yang", "Wuyue", ""], ["Zhang", "Dongyan", ""], ["Peng", "Liangrong", ""], ["Zhuge", "Changjing", ""], ["Hong", "Liu", ""]]}, {"id": "2003.05776", "submitter": "Huitong Ding", "authors": "Ning An, Liuqi Jin, Huitong Ding, Jiaoyun Yang, Jing Yuan", "title": "A deep belief network-based method to identify proteomic risk markers\n  for Alzheimer disease", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While a large body of research has formally identified apolipoprotein E\n(APOE) as a major genetic risk marker for Alzheimer disease, accumulating\nevidence supports the notion that other risk markers may exist. The traditional\nAlzheimer-specific signature analysis methods, however, have not been able to\nmake full use of rich protein expression data, especially the interaction\nbetween attributes. This paper develops a novel feature selection method to\nidentify pathogenic factors of Alzheimer disease using the proteomic and\nclinical data. This approach has taken the weights of network nodes as the\nimportance order of signaling protein expression values. After generating and\nevaluating the candidate subset, the method helps to select an optimal subset\nof proteins that achieved an accuracy greater than 90%, which is superior to\ntraditional machine learning methods for clinical Alzheimer disease diagnosis.\nBesides identifying a proteomic risk marker and further reinforce the link\nbetween metabolic risk factors and Alzheimer disease, this paper also suggests\nthat apidonectin-linked pathways are a possible therapeutic drug target.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 10:37:30 GMT"}], "update_date": "2020-03-13", "authors_parsed": [["An", "Ning", ""], ["Jin", "Liuqi", ""], ["Ding", "Huitong", ""], ["Yang", "Jiaoyun", ""], ["Yuan", "Jing", ""]]}, {"id": "2003.05893", "submitter": "Lorenzo Fassina PhD", "authors": "Nora Bloise, Loredana Petecchia, Gabriele Ceccarelli, Lorenzo Fassina,\n  Cesare Usai, Federico Bertoglio, Martina Balli, Massimo Vassalli, Maria\n  Gabriella Cusella De Angelis, Paola Gavazzo, Marcello Imbriani, Livia Visai", "title": "The effect of pulsed electromagnetic field exposure on osteoinduction of\n  human mesenchymal stem cells cultured on nano-$TiO_{2}$ surfaces", "comments": null, "journal-ref": "PLoS ONE 2018;13(6):e0199046", "doi": "10.1371/journal.pone.0199046", "report-no": null, "categories": "q-bio.QM q-bio.TO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Human bone marrow-derived mesenchymal stem cells (hBM-MSCs) are considered a\ngreat promise in the repair and regeneration of bone. Considerable efforts have\nbeen oriented towards uncovering the best strategy to promote stem cells\nosteogenic differentiation. In previous studies, hBM-MSCs exposed to physical\nstimuli such as pulsed electromagnetic fields (PEMFs) or directly seeded on\nnanostructured titanium surfaces ($TiO_{2}$) were shown to improve their\ndifferentiation to osteoblasts in osteogenic condition. In the present study,\nthe effect of a daily PEMF-exposure on osteogenic differentiation of hBM-MSCs\nseeded onto nanostructured $TiO_{2}$ (with clusters under 100 nm of dimension)\nwas investigated. $TiO_{2}$-seeded cells were exposed to PEMF (magnetic field\nintensity: 2 mT; intensity of induced electric field: 5 mV; frequency: 75 Hz)\nand examined in terms of cell physiology modifications and osteogenic\ndifferentiation. Results showed that PEMF exposure affected $TiO_{2}$-seeded\ncells osteogenesis by interfering with selective calcium-related osteogenic\npathways, and greatly enhanced hBM-MSCs osteogenic features such as the\nexpression of early/late osteogenic genes and protein production (e.g., ALP,\nCOL-I, osteocalcin and osteopontin) and ALP activity. Finally, PEMF-treated\ncells resulted to secrete into conditioned media higher amounts of BMP-2, DCN\nand COL-I than untreated cell cultures. These findings confirm once more the\nosteoinductive potential of PEMF, suggesting that its combination with\n$TiO_{2}$ nanostructured surface might be a great option in bone tissue\nengineering applications.\n", "versions": [{"version": "v1", "created": "Tue, 10 Mar 2020 16:24:41 GMT"}], "update_date": "2020-03-13", "authors_parsed": [["Bloise", "Nora", ""], ["Petecchia", "Loredana", ""], ["Ceccarelli", "Gabriele", ""], ["Fassina", "Lorenzo", ""], ["Usai", "Cesare", ""], ["Bertoglio", "Federico", ""], ["Balli", "Martina", ""], ["Vassalli", "Massimo", ""], ["De Angelis", "Maria Gabriella Cusella", ""], ["Gavazzo", "Paola", ""], ["Imbriani", "Marcello", ""], ["Visai", "Livia", ""]]}, {"id": "2003.06092", "submitter": "Samuel Fischer", "authors": "Samuel M. Fischer, Martina Beck, Leif-Matthias Herborg, Mark A. Lewis", "title": "Managing aquatic invasions: optimal locations and operating times for\n  watercraft inspection stations", "comments": "Keywords: aquatic invasive species; linear integer programming;\n  optimal management; spatially explicit; zebra mussel", "journal-ref": "Journal of Environmental Management 283 (2021): 111923", "doi": "10.1016/j.jenvman.2020.111923", "report-no": null, "categories": "q-bio.QM math.OC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aquatic invasive species (AIS) cause significant ecological and economic\ndamages around the world. A major spread mechanism for AIS is traffic of\nboaters transporting their watercraft from invaded to uninvaded waterbodies. To\ninhibit the spread of AIS, several Canadian provinces and American states set\nup watercraft inspection stations at roadsides, where potentially infested\nboats are screened for AIS and, if necessary, decontaminated. However, since\nbudgets for AIS control are limited, watercraft inspection stations can only be\noperated at specific locations and daytimes. Though theoretical studies provide\nmanagers with general guidelines for AIS management, more specific results are\nneeded to determine when and where watercraft inspections would be most\neffective. This is the subject of this paper. We show how linear integer\nprogramming techniques can be used to optimize watercraft inspection policies\nunder budget constraints. We introduce our approach as a general framework and\napply it to the prevention of the spread of zebra and quagga mussels (Dreissena\nspp.) to the Canadian province British Columbia. We consider a variety of\nscenarios and show how variations in budget constraints, propagule sources, and\nmodel uncertainty affect the optimal policy. Based on these results, we\nidentify simple, generally applicable principles for optimal AIS management.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2020 03:16:26 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Fischer", "Samuel M.", ""], ["Beck", "Martina", ""], ["Herborg", "Leif-Matthias", ""], ["Lewis", "Mark A.", ""]]}, {"id": "2003.06188", "submitter": "Larissa Terumi Arashiro", "authors": "Larissa T. Arashiro, Ivet Ferrer, Diederik P.L. Rousseau, Stijn W.H.\n  Van Hulle, Marianna Garfi", "title": "The effect of primary treatment of wastewater in high rate algal pond\n  systems: biomass and bioenergy recovery", "comments": null, "journal-ref": "Bioresource Technology 280, 27-36 (2019)", "doi": "10.1016/j.biortech.2019.01.096", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The aim of this study was to assess the effect of primary treatment on the\nperformance of two pilot-scale high rate algal ponds (HRAPs) treating urban\nwastewater, considering their treatment efficiency, biomass productivity,\ncharacteristics and biogas production potential. Results indicated that the\nprimary treatment did not significantly affect the wastewater treatment\nefficiency (NH4+-N removal of 93 and 91% and COD removal of 62 and 65% in HRAP\nwith and without primary treatment, respectively). The HRAP without primary\ntreatment had higher biodiversity and productivity (18 vs. 16 g VSS/m2d).\nBiomass from both systems presented good settling capacity. Results of\nbiochemical methane potential test showed that co-digesting microalgae and\nprimary sludge led to higher methane yields (238 - 258 mL CH4/g VS) compared\nwith microalgae mono-digestion (189 - 225 mL CH4/g VS). Overall, HRAPs with and\nwithout primary treatment seem to be appropriate alternatives for combining\nwastewater treatment and bioenergy recovery.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2020 10:25:01 GMT"}], "update_date": "2020-03-16", "authors_parsed": [["Arashiro", "Larissa T.", ""], ["Ferrer", "Ivet", ""], ["Rousseau", "Diederik P. L.", ""], ["Van Hulle", "Stijn W. H.", ""], ["Garfi", "Marianna", ""]]}, {"id": "2003.06192", "submitter": "Larissa Terumi Arashiro", "authors": "Larissa T. Arashiro, Maria Boto-Ordonez, Stijn W.H. Van Hulle, Ivet\n  Ferrer, Marianna Garfi, Diederik P.L. Rousseau", "title": "Natural pigments from microalgae grown in industrial wastewater", "comments": null, "journal-ref": "Bioresource Technology 303, 122894 (2020)", "doi": "10.1016/j.biortech.2020.122894", "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The aim of this study was to investigate the cultivation of Nostoc sp.,\nArthrospira platensis and Porphyridium purpureum in industrial wastewater to\nproduce phycobiliproteins. Initially, light intensity and growth medium\ncomposition were optimized, indicating that light conditions influenced the\nphycobiliproteins production more than the medium composition. Conditions were\nthen selected, according to biomass growth, nutrients removal and\nphycobiliproteins production, to cultivate these microalgae in food-industry\nwastewater. The three species could efficiently remove up to 98%, 94% and 100%\nof COD, inorganic nitrogen and PO43--P, respectively. Phycocyanin,\nallophycocyanin and phycoerythrin were successfully extracted from the biomass\nreaching concentrations up to 103, 57 and 30 mg/g dry weight, respectively.\nResults highlight the potential use of microalgae for industrial wastewater\ntreatment and related high-value phycobiliproteins recovery.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2020 10:34:23 GMT"}], "update_date": "2020-03-16", "authors_parsed": [["Arashiro", "Larissa T.", ""], ["Boto-Ordonez", "Maria", ""], ["Van Hulle", "Stijn W. H.", ""], ["Ferrer", "Ivet", ""], ["Garfi", "Marianna", ""], ["Rousseau", "Diederik P. L.", ""]]}, {"id": "2003.06194", "submitter": "Larissa Terumi Arashiro", "authors": "Larissa Terumi Arashiro, Neus Montero, Ivet Ferrer, Francisco Gabriel\n  Acien, Cintia Gomez, Marianna Garfi", "title": "Life Cycle Assessment of high rate algal ponds for wastewater treatment\n  and resource recovery", "comments": null, "journal-ref": "Science of the total environment 622-623, 1118-1130 (2018)", "doi": "10.1016/j.scitotenv.2017.12.051", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The aim of this study was to assess the potential environmental impacts\nassociated with high rate algal ponds (HRAP) systems for wastewater treatment\nand resource recovery in small communities. To this aim, a Life Cycle\nAssessment (LCA) and an economic assessment were carried out evaluating two\nalternatives: i) a HRAPs system for wastewater treatment where microalgal\nbiomass is valorised for energy recovery (biogas production); ii) a HRAPs\nsystem for wastewater treatment where microalgal biomass is reused for\nnutrients recovery (biofertiliser production). Additionally, both alternatives\nwere compared to a typical small-sized activated sludge system. The results\nshowed that HRAPs system coupled with biogas production appeared to be more\nenvironmentally friendly than HRAPs system coupled with biofertiliser\nproduction in the climate change, ozone layer depletion, photochemical oxidant\nformation, and fossil depletion impact categories. Different climatic\nconditions have strongly influenced the results obtained in the eutrophication\nand metal depletion impact categories, with the HRAPs system located where warm\ntemperatures and high solar radiation are predominant showing lower impact. In\nterms of costs, HRAPs systems seemed to be more economically feasible when\ncombined with biofertiliser production instead of biogas.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2020 10:46:43 GMT"}], "update_date": "2020-03-16", "authors_parsed": [["Arashiro", "Larissa Terumi", ""], ["Montero", "Neus", ""], ["Ferrer", "Ivet", ""], ["Acien", "Francisco Gabriel", ""], ["Gomez", "Cintia", ""], ["Garfi", "Marianna", ""]]}, {"id": "2003.06516", "submitter": "Isotta Landi", "authors": "Isotta Landi, Benjamin S. Glicksberg, Hao-Chih Lee, Sarah Cherng,\n  Giulia Landi, Matteo Danieletto, Joel T. Dudley, Cesare Furlanello, and\n  Riccardo Miotto", "title": "Deep Representation Learning of Electronic Health Records to Unlock\n  Patient Stratification at Scale", "comments": "C.F. and R.M. share senior authorship", "journal-ref": "npj Digit. Med. 3, 96 (2020)", "doi": "10.1038/s41746-020-0301-z", "report-no": null, "categories": "q-bio.QM cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deriving disease subtypes from electronic health records (EHRs) can guide\nnext-generation personalized medicine. However, challenges in summarizing and\nrepresenting patient data prevent widespread practice of scalable EHR-based\nstratification analysis. Here we present an unsupervised framework based on\ndeep learning to process heterogeneous EHRs and derive patient representations\nthat can efficiently and effectively enable patient stratification at scale. We\nconsidered EHRs of 1,608,741 patients from a diverse hospital cohort comprising\nof a total of 57,464 clinical concepts. We introduce a representation learning\nmodel based on word embeddings, convolutional neural networks, and autoencoders\n(i.e., ConvAE) to transform patient trajectories into low-dimensional latent\nvectors. We evaluated these representations as broadly enabling patient\nstratification by applying hierarchical clustering to different multi-disease\nand disease-specific patient cohorts. ConvAE significantly outperformed several\nbaselines in a clustering task to identify patients with different complex\nconditions, with 2.61 entropy and 0.31 purity average scores. When applied to\nstratify patients within a certain condition, ConvAE led to various clinically\nrelevant subtypes for different disorders, including type 2 diabetes,\nParkinson's disease and Alzheimer's disease, largely related to comorbidities,\ndisease progression, and symptom severity. With these results, we demonstrate\nthat ConvAE can generate patient representations that lead to clinically\nmeaningful insights. This scalable framework can help better understand varying\netiologies in heterogeneous sub-populations and unlock patterns for EHR-based\nresearch in the realm of personalized medicine.\n", "versions": [{"version": "v1", "created": "Sat, 14 Mar 2020 00:04:20 GMT"}, {"version": "v2", "created": "Sat, 18 Jul 2020 10:28:54 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Landi", "Isotta", ""], ["Glicksberg", "Benjamin S.", ""], ["Lee", "Hao-Chih", ""], ["Cherng", "Sarah", ""], ["Landi", "Giulia", ""], ["Danieletto", "Matteo", ""], ["Dudley", "Joel T.", ""], ["Furlanello", "Cesare", ""], ["Miotto", "Riccardo", ""]]}, {"id": "2003.06882", "submitter": "Larissa Terumi Arashiro", "authors": "Maria Jesus Garcia-Galan, Larissa Arashiro, Lucia H.M.L.M. Santos,\n  Sara Insa, Sara Rodriguez-Mozaz, Damia Barcelo, Ivet Ferrer, Marianna Garfi", "title": "Fate of priority pharmaceuticals and their main metabolites and\n  transformation products in microalgae-based wastewater treatment systems", "comments": null, "journal-ref": null, "doi": "10.1016/j.jhazmat.2019.121771", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The present study evaluates the removal capacity of two high rate algae ponds\n(HRAPs) to eliminate 12 pharmaceuticals (PhACs) and 26 of their corresponding\nmain metabolites and transformation products. The efficiency of these ponds,\noperating with and without primary treatment, was compared in order to study\ntheir capacity under the best performance conditions (highest solar\nirradiance). Concentrations of all the target compounds were determined in both\nwater and biomass samples. Removal rates ranged from moderate (40-60%) to high\n(>60%) for most of them, with the exception of the psychiatric drugs\ncarbamazepine, the beta-blocking agent metoprolol and its metabolite,\nmetoprolol acid. O-desmethylvenlafaxine, despite its very low biodegradability\nin conventional wastewater treatment plants, was removed to certain extent\n(13-39%) Biomass concentrations suggested that bioadsorption/bioaccumulation to\nmicroalgae biomass was decisive regarding the elimination of some\nnon-biodegradable compounds such as venlafaxine and its main metabolites. HRAP\ntreatment with and without primary treatment did not yield significant\ndifferences in terms of PhACs removal efficiency. The implementation of HRAPs\nas secondary treatment is a viable alternative to CAS in terms of overall\nwastewater treatment (including organic micropollutants), with generally higher\nremoval performances and implying a green, low-cost and more sustainable\ntechnology.\n", "versions": [{"version": "v1", "created": "Sun, 15 Mar 2020 18:09:06 GMT"}], "update_date": "2020-03-17", "authors_parsed": [["Garcia-Galan", "Maria Jesus", ""], ["Arashiro", "Larissa", ""], ["Santos", "Lucia H. M. L. M.", ""], ["Insa", "Sara", ""], ["Rodriguez-Mozaz", "Sara", ""], ["Barcelo", "Damia", ""], ["Ferrer", "Ivet", ""], ["Garfi", "Marianna", ""]]}, {"id": "2003.07394", "submitter": "Marco D'Alessandro", "authors": "Marco D'Alessandro, Stefan T. Radev, Andreas Voss, Luigi Lombardi", "title": "A Bayesian brain model of adaptive behavior: An application to the\n  Wisconsin Card Sorting Task", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Adaptive behavior emerges through a dynamic interaction between cognitive\nagents and changing environmental demands. The investigation of information\nprocessing underlying adaptive behavior relies on controlled experimental\nsettings in which individuals are asked to accomplish demanding tasks whereby a\nhidden state or an abstract rule has to be learned dynamically. Although\nperformance in such tasks is regularly considered as a proxy for measuring\nhigh-level cognitive processes, the standard approach consists in summarizing\nresponse patterns by simple heuristic scoring measures. With this work, we\npropose and validate a new computational Bayesian model accounting for\nindividual performance in the established Wisconsin Card Sorting Test. We embed\nthe new model within the mathematical framework of Bayesian Brain Theory,\naccording to which beliefs about the hidden environmental states are\ndynamically updated following the logic of Bayesian inference. Our\ncomputational model maps distinct cognitive processes into separable,\nneurobiologically plausible, information-theoretic constructs underlying\nobserved response patterns. We assess model identification and expressiveness\nin accounting for meaningful human performance through extensive simulation\nstudies. We further apply the model to real behavioral data in order to\nhighlight the utility of the proposed model in recovering cognitive dynamics at\nan individual level. Practical and theoretical implications of our\ncomputational modeling approach for clinical and cognitive neuroscience\nresearch are finally discussed, as well as potential future improvements.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2020 18:25:51 GMT"}, {"version": "v2", "created": "Thu, 26 Nov 2020 21:29:39 GMT"}], "update_date": "2020-11-30", "authors_parsed": [["D'Alessandro", "Marco", ""], ["Radev", "Stefan T.", ""], ["Voss", "Andreas", ""], ["Lombardi", "Luigi", ""]]}, {"id": "2003.07445", "submitter": "John Karanicolas", "authors": "Shipra Malhotra and John Karanicolas", "title": "A Numerical Transform of Random Forest Regressors corrects\n  Systematically-Biased Predictions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.QM stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Over the past decade, random forest models have become widely used as a\nrobust method for high-dimensional data regression tasks. In part, the\npopularity of these models arises from the fact that they require little\nhyperparameter tuning and are not very susceptible to overfitting. Random\nforest regression models are comprised of an ensemble of decision trees that\nindependently predict the value of a (continuous) dependent variable;\npredictions from each of the trees are ultimately averaged to yield an overall\npredicted value from the forest. Using a suite of representative real-world\ndatasets, we find a systematic bias in predictions from random forest models.\nWe find that this bias is recapitulated in simple synthetic datasets,\nregardless of whether or not they include irreducible error (noise) in the\ndata, but that models employing boosting do not exhibit this bias. Here we\ndemonstrate the basis for this problem, and we use the training data to define\na numerical transformation that fully corrects it. Application of this\ntransformation yields improved predictions in every one of the real-world and\nsynthetic datasets evaluated in our study.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2020 21:18:06 GMT"}], "update_date": "2020-03-18", "authors_parsed": [["Malhotra", "Shipra", ""], ["Karanicolas", "John", ""]]}, {"id": "2003.07790", "submitter": "Jean Ollion", "authors": "Jean Ollion and Charles Ollion", "title": "DistNet: Deep Tracking by displacement regression: application to\n  bacteria growing in the Mother Machine", "comments": "10 pages, 3 figures, 3 tables. Accepted in MICCAI 2020 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mother machine is a popular microfluidic device that allows long-term\ntime-lapse imaging of thousands of cells in parallel by microscopy. It has\nbecome a valuable tool for single-cell level quantitative analysis and\ncharacterization of many cellular processes such as gene expression and\nregulation, mutagenesis or response to antibiotics. The automated and\nquantitative analysis of the massive amount of data generated by such\nexperiments is now the limiting step. In particular the segmentation and\ntracking of bacteria cells imaged in phase-contrast microscopy---with error\nrates compatible with high-throughput data---is a challenging problem.\n  In this work, we describe a novel formulation of the multi-object tracking\nproblem, in which tracking is performed by a regression of the bacteria's\ndisplacement, allowing simultaneous tracking of multiple bacteria, despite\ntheir growth and division over time. Our method performs jointly segmentation\nand tracking, leveraging sequential information to increase segmentation\naccuracy.\n  We introduce a Deep Neural Network architecture taking advantage of a\nself-attention mechanism which yields extremely low tracking error rate and\nsegmentation error rate. We demonstrate superior performance and speed compared\nto state-of-the-art methods. Our method is named DiSTNet which stands for\nDISTance+DISplacement Segmentation and Tracking Network.\n  While this method is particularly well suited for mother machine microscopy\ndata, its general joint tracking and segmentation formulation could be applied\nto many other problems with different geometries.\n", "versions": [{"version": "v1", "created": "Tue, 17 Mar 2020 16:13:44 GMT"}, {"version": "v2", "created": "Sat, 19 Sep 2020 10:12:44 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Ollion", "Jean", ""], ["Ollion", "Charles", ""]]}, {"id": "2003.07834", "submitter": "Alessandra Bonfanti", "authors": "Alessandra Bonfanti, Jonathan Louis Kaplan, Guillaume Charras,\n  Alexandre J Kabla", "title": "Fractional viscoelastic models for power-law materials", "comments": "28 pages, 12 figures. Soft Matter (2020)", "journal-ref": null, "doi": "10.1039/D0SM00354A", "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Soft materials often exhibit a distinctive power-law viscoelastic response\narising from broad distribution of time-scales present in their complex\ninternal structure. A promising tool to accurately describe the rheological\nbehaviour of soft materials is fractional calculus. However, its use in the\nscientific community remains limited due to the unusual notation and\nnon-trivial properties of fractional operators. This review aims to provide a\nclear and accessible description of fractional viscoelastic models for a broad\naudience, and to demonstrate the ability of these models to deliver a unified\napproach for the characterisation of power-law materials. The use of a\nconsistent framework for the analysis of rheological data would help classify\nthe empirical behaviours of soft and biological materials, and better\nunderstand their response.\n", "versions": [{"version": "v1", "created": "Tue, 17 Mar 2020 17:36:16 GMT"}, {"version": "v2", "created": "Thu, 26 Mar 2020 10:36:36 GMT"}, {"version": "v3", "created": "Wed, 15 Jul 2020 21:28:22 GMT"}], "update_date": "2020-07-17", "authors_parsed": [["Bonfanti", "Alessandra", ""], ["Kaplan", "Jonathan Louis", ""], ["Charras", "Guillaume", ""], ["Kabla", "Alexandre J", ""]]}, {"id": "2003.08278", "submitter": "Shi Gu", "authors": "Shikuang Deng, Shi Gu", "title": "Controllability Analysis of Functional Brain Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network control theory has recently emerged as a promising approach for\nunderstanding brain function and dynamics. By operationalizing notions of\ncontrol theory for brain networks, it offers a fundamental explanation for how\nbrain dynamics may be regulated by structural connectivity. While powerful, the\napproach does not currently consider other non-structural explanations of brain\ndynamics. Here we extend the analysis of network controllability by formalizing\nthe evolution of neural signals as a function of effective inter-regional\ncoupling and pairwise signal covariance. We find that functional\ncontrollability characterizes a region's impact on the capacity for the whole\nsystem to shift between states, and significantly predicts individual\ndifference in performance on cognitively demanding tasks including those task\nworking memory, language, and emotional intelligence. When comparing\nmeasurements from functional and structural controllability, we observed\nconsistent relations between average and modal controllability, supporting\nprior work. In the same comparison, we also observed distinct relations between\ncontrollability and synchronizability, reflecting the additional information\nobtained from functional signals. Our work suggests that network control theory\ncan serve as a systematic analysis tool to understand the energetics of brain\nstate transitions, associated cognitive processes, and subsequent behaviors.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2020 15:36:39 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Deng", "Shikuang", ""], ["Gu", "Shi", ""]]}, {"id": "2003.08354", "submitter": "Jerrin Thomas Panachakel", "authors": "Jerrin Thomas Panachakel and Jeena R.S", "title": "Two Tier Prediction of Stroke Using Artificial Neural Networks and\n  Support Vector Machines", "comments": "arXiv admin note: text overlap with arXiv:1706.08227", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CV eess.IV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cerebrovascular accident (CVA) or stroke is the rapid loss of brain function\ndue to disturbance in the blood supply to the brain. Statistically, stroke is\nthe second leading cause of death. This has motivated us to suggest a two-tier\nsystem for predicting stroke; the first tier makes use of Artificial Neural\nNetwork (ANN) to predict the chances of a person suffering from stroke. The ANN\nis trained the using the values of various risk factors of stroke of several\npatients who had stroke. Once a person is classified as having a high risk of\nstroke, s/he undergoes another the tier-2 classification test where his/her\nneuro MRI (Magnetic resonance imaging) is analysed to predict the chances of\nstroke. The tier-2 uses Non-negative Matrix Factorization and Haralick Textural\nfeatures for feature extraction and SVM classifier for classification. We have\nobtained an accuracy of 96.67% in tier-1 and an accuracy of 70% in tier-2.\n", "versions": [{"version": "v1", "created": "Tue, 17 Mar 2020 07:20:59 GMT"}, {"version": "v2", "created": "Thu, 19 Mar 2020 00:29:19 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Panachakel", "Jerrin Thomas", ""], ["S", "Jeena R.", ""]]}, {"id": "2003.08533", "submitter": "Ngoc Mai Tran", "authors": "Hanlin Zhu, Xue Li, Liuyang Sun, Fei He, Zhengtuo Zhao, Lan Luan, Ngoc\n  Mai Tran and Chong Xie", "title": "Clustering with Fast, Automated and Reproducible assessment applied to\n  longitudinal neural tracking", "comments": "11 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Across many areas, from neural tracking to database entity resolution, manual\nassessment of clusters by human experts presents a bottleneck in rapid\ndevelopment of scalable and specialized clustering methods. To solve this\nproblem we develop C-FAR, a novel method for Fast, Automated and Reproducible\nassessment of multiple hierarchical clustering algorithms simultaneously. Our\nalgorithm takes any number of hierarchical clustering trees as input, then\nstrategically queries pairs for human feedback, and outputs an optimal\nclustering among those nominated by these trees. While it is applicable to\nlarge dataset in any domain that utilizes pairwise comparisons for assessment,\nour flagship application is the cluster aggregation step in spike-sorting, the\ntask of assigning waveforms (spikes) in recordings to neurons. On simulated\ndata of 96 neurons under adverse conditions, including drifting and 25\\%\nblackout, our algorithm produces near-perfect tracking relative to the ground\ntruth. Our runtime scales linearly in the number of input trees, making it a\ncompetitive computational tool. These results indicate that C-FAR is highly\nsuitable as a model selection and assessment tool in clustering tasks.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 01:33:00 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Zhu", "Hanlin", ""], ["Li", "Xue", ""], ["Sun", "Liuyang", ""], ["He", "Fei", ""], ["Zhao", "Zhengtuo", ""], ["Luan", "Lan", ""], ["Tran", "Ngoc Mai", ""], ["Xie", "Chong", ""]]}, {"id": "2003.08592", "submitter": "Anastasios Angelopoulos", "authors": "Anastasios Nikolas Angelopoulos, Reese Pathak, Rohit Varma, and\n  Michael I. Jordan", "title": "On Identifying and Mitigating Bias in the Estimation of the COVID-19\n  Case Fatality Rate", "comments": "Harvard Data Science Review (2020) article available at\n  https://hdsr.mitpress.mit.edu/pub/y9vc2u36", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The relative case fatality rates (CFRs) between groups and countries are key\nmeasures of relative risk that guide policy decisions regarding scarce medical\nresource allocation during the ongoing COVID-19 pandemic. In the middle of an\nactive outbreak when surveillance data is the primary source of information,\nestimating these quantities involves compensating for competing biases in time\nseries of deaths, cases, and recoveries. These include time- and severity-\ndependent reporting of cases as well as time lags in observed patient outcomes.\nIn the context of COVID-19 CFR estimation, we survey such biases and their\npotential significance. Further, we analyze theoretically the effect of certain\nbiases, like preferential reporting of fatal cases, on naive estimators of CFR.\nWe provide a partially corrected estimator of these naive estimates that\naccounts for time lag and imperfect reporting of deaths and recoveries. We show\nthat collection of randomized data by testing the contacts of infectious\nindividuals regardless of the presence of symptoms would mitigate bias by\nlimiting the covariance between diagnosis and death. Our analysis is\nsupplemented by theoretical and numerical results and a simple and fast\nopen-source codebase at https://github.com/aangelopoulos/cfr-covid-19 .\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 06:30:32 GMT"}, {"version": "v2", "created": "Wed, 25 Mar 2020 05:15:14 GMT"}, {"version": "v3", "created": "Thu, 26 Mar 2020 00:52:42 GMT"}, {"version": "v4", "created": "Tue, 7 Apr 2020 05:15:01 GMT"}, {"version": "v5", "created": "Sat, 2 May 2020 18:32:55 GMT"}, {"version": "v6", "created": "Mon, 15 Jun 2020 07:54:47 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Angelopoulos", "Anastasios Nikolas", ""], ["Pathak", "Reese", ""], ["Varma", "Rohit", ""], ["Jordan", "Michael I.", ""]]}, {"id": "2003.08704", "submitter": "Barbara Bravi", "authors": "Barbara Bravi, Katy J. Rubin and Peter Sollich", "title": "Systematic model reduction captures the dynamics of extrinsic noise in\n  biochemical subnetworks", "comments": "24 pages, 10 figures", "journal-ref": null, "doi": "10.1063/5.0008304", "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the general problem of describing the dynamics of subnetworks of\nlarger biochemical reaction networks, e.g. protein interaction networks\ninvolving complex formation and dissociation reactions. We propose the use of\nmodel reduction strategies to understand the 'extrinsic' sources of\nstochasticity arising from the rest of the network. Our approaches are based on\nsubnetwork dynamical equations derived by projection methods and by path\nintegrals. The results provide a principled derivation of the different\ncomponents of the extrinsic noise that is observed experimentally in cellular\nbiochemical reactions, over and above the intrinsic noise from the\nstochasticity of biochemical events in the subnetwork. We explore several\nintermediate approximations to assess systematically the relative importance of\ndifferent extrinsic noise components, including initial transients, long-time\nplateaus, temporal correlations, multiplicative noise terms and nonlinear noise\npropagation. The best approximations achieve excellent accuracy in quantitative\ntests on a simple protein network and on the epidermal growth factor receptor\nsignalling network.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 11:54:50 GMT"}, {"version": "v2", "created": "Wed, 1 Jul 2020 22:08:49 GMT"}], "update_date": "2020-08-26", "authors_parsed": [["Bravi", "Barbara", ""], ["Rubin", "Katy J.", ""], ["Sollich", "Peter", ""]]}, {"id": "2003.08775", "submitter": "Claus Metzner", "authors": "Claus Metzner, Franziska H\\\"orsch, Christoph Mark, Tina Czerwinski,\n  Alexander Winterl, Caroline Voskens, Ben Fabry", "title": "Detecting long-range interactions between migrating cells", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chemotaxis enables cells to systematically approach distant targets that emit\na diffusible guiding substance. However, the visual observation of an encounter\nbetween a cell and a target does not necessarily indicate the presence of a\nchemotactic approach mechanism, as even a blindly migrating cell can come\nacross a target by chance. To distinguish between the chemotactic approach and\nblind migration, we present an objective method that is based on the analysis\nof time-lapse recorded cell migration trajectories. First, we validate our\nmethod with simulated data, demonstrating that it reliably detects the presence\nor absence of remote cell-cell interactions. In a second step, we apply the\nmethod to data from three-dimensional collagen gels, interspersed with highly\nmigratory natural killer (NK) cells that were derived from two different human\ndonors. We find for one of the donors an attractive interaction between the NK\ncells, pointing to a cooperative behavior of these immune cells. When adding\nnearly stationary K562 tumor cells to the system, we find a repulsive\ninteraction between K562 and NK cells for one of the donors. By contrast, we\nfind attractive interactions between NK cells and an IL-15-secreting variant of\nK562 tumor cells. We therefore speculate that NK cells find wild-type tumor\ncells only by chance, but are programmed to leave a target quickly after a\nclose encounter. We provide a freely available Python implementation of our\np-value method that can serve as a general tool for detecting long-range\ninteractions in collective systems of self-driven agents.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 13:26:09 GMT"}, {"version": "v2", "created": "Sun, 20 Jun 2021 15:34:52 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Metzner", "Claus", ""], ["Hörsch", "Franziska", ""], ["Mark", "Christoph", ""], ["Czerwinski", "Tina", ""], ["Winterl", "Alexander", ""], ["Voskens", "Caroline", ""], ["Fabry", "Ben", ""]]}, {"id": "2003.08809", "submitter": "Suvadip Mukherjee", "authors": "Sammit Jain, Suvadip Mukherjee, Lydia Danglot, Jean-Christophe\n  Olivo-Marin", "title": "Morphological Reconstruction of Detached Dendritic Spines via Geodesic\n  Path Prediction", "comments": "S. Jain and S. Mukherjee contributed equally to this work. This work\n  has been submitted to the IEEE for possible publication. Copyright may be\n  transferred without notice, after which this version may no longer be\n  accessible", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Morphological reconstruction of dendritic spines from fluorescent microscopy\nis a critical open problem in neuro-image analysis. Existing segmentation tools\nare ill-equipped to handle thin spines with long, poorly illuminated neck\nmembranes. We address this issue, and introduce an unsupervised path prediction\ntechnique based on a stochastic framework which seeks the optimal solution from\na path-space of possible spine neck reconstructions. Our method is specifically\ndesigned to reduce bias due to outliers, and is adept at reconstructing\nchallenging shapes from images plagued by noise and poor contrast. Experimental\nanalyses on two photon microscopy data demonstrate the efficacy of our method,\nwhere an improvement of 12.5% is observed over the state-of-the-art in terms of\nmean absolute reconstruction error.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 14:21:12 GMT"}, {"version": "v2", "created": "Mon, 21 Sep 2020 14:17:00 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Jain", "Sammit", ""], ["Mukherjee", "Suvadip", ""], ["Danglot", "Lydia", ""], ["Olivo-Marin", "Jean-Christophe", ""]]}, {"id": "2003.08896", "submitter": "Marco Hartl", "authors": "Marco Hartl (1,2), Diego F. Bedoya-R\\'ios (3), Marta\n  Fern\\'andez-Gatell (1), Diederik P.L. Rousseau (2), Gijs Du Laing (2),\n  Marianna Garf\\'i (1), Jaume Puigagut (1) ((1) GEMMA - Environmental\n  Engineering and Microbiology Research Group, Department of Civil and\n  Environmental Engineering, Universitat Polit\\`ecnica de\n  Catalunya-BarcelonaTech, Barcelona, Spain, (2) Department of Green Chemistry\n  and Technology, Faculty of Bioscience Engineering, Ghent University, Gent,\n  Belgium (3) Grupo Ciencia e Ingenier\\'ia del Agua y el Ambiente, Facultad de\n  Ingenier\\'ia, Pontificia Universidad Javeriana, Bogot\\'a, Colombia)", "title": "Contaminants removal and bacterial activity enhancement along the flow\n  path of constructed wetland microbial fuel cells", "comments": "39 pages, 8 Figures", "journal-ref": null, "doi": "10.1016/j.scitotenv.2018.10.234", "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Microbial fuel cells implemented in constructed wetlands (CW-MFCs), albeit a\nrelatively new technology still under study, have shown to improve treatment\nefficiency of urban wastewater. So far the vast majority of CW-MFC systems\ninvestigated were designed as lab-scale systems working under rather\nunrealistic hydraulic conditions using synthetic wastewater. The main objective\nof this work was to quantify CW-MFCs performance operated under different\nconditions in a more realistic setup using meso-scale systems with horizontal\nflow fed with real urban wastewater. Operational conditions tested were organic\nloading rate (4.9+-1.6, 6.7+-1.4 and 13.6+-3.2 g COD/m2.day) and hydraulic\nregime (continuous vs intermittent feeding) as well as different electrical\nconnections: CW control (conventional CW without electrodes), open-circuit\nCW-MFC (external circuit between anode and cathode not connected) and\nclosed-circuit CW-MFC (external circuit connected). Eight horizontal subsurface\nflow CWs were operated for about four months. Each wetland consisted of a PVC\nreservoir of 0.193 m2 filled with 4/8 mm granitic riverine gravel. All wetlands\nhad intermediate sampling points for gravel and interstitial liquid sampling.\nThe CW-MFCs were designed as three MFCs incorporated one after the other along\nthe flow path of the CWs. Results showed no significant differences between\ntested organic loading rates, hydraulic regimes or electrical connections,\nhowever, on average, systems operated in closed-circuit CW-MFC mode under\ncontinuous flow outperformed the other experimental conditions. Closed-circuit\nCW-MFC compared to conventional CW control systems showed around 5% and 22%\nhigher COD and ammonium removal, respectively. Correspondingly, overall\nbacteria activity, as measured by the fluorescein diacetate technique, was\nhigher (4% to 34%) in closed-circuit systems when compared to CW control\nsystems.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 16:53:45 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Hartl", "Marco", ""], ["Bedoya-Ríos", "Diego F.", ""], ["Fernández-Gatell", "Marta", ""], ["Rousseau", "Diederik P. L.", ""], ["Laing", "Gijs Du", ""], ["Garfí", "Marianna", ""], ["Puigagut", "Jaume", ""]]}, {"id": "2003.09002", "submitter": "Iqbal H. Sarker", "authors": "Sohrab Hossain, Dhiman Sarma, Rana Joyti Chakma, Wahidul Alam,\n  Mohammed Moshiul Hoque and Iqbal H. Sarker", "title": "A Rule Based Expert System to Assess Coronary Artery Disease under\n  Uncertainty", "comments": "International Conference on Computing Science, Communication and\n  Security (COMS2), Springer, 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The coronary artery disease (CAD) involves narrowing and damaging the major\nblood vessels has become the most life threating disease in the world\nespecially in south Asian reason. Although outstanding medical facilities are\navailable in Singapore and India for CAD patients, early detection of CAD\nstages are necessary to minimize the patients' sufferings and expenses. It is\nreally challenging for doctors to incorporate numerous factors for details\nanalysis and CAD detections are expensive as it needs expensive medical\nfacilities. Clinical Decision Support Systems (CDSS) may assist to analyze\nnumerous factors for patients. In this paper, a Rule Based Expert System (RBES)\nis proposed which can predict five different stages of CAD. RBES contains five\ndifferent Belief Rule Based (BRB) systems and the final output is produced by\ncombining all BRBs using the Evidential Reasoning (ER). Success, Error,\nFailure, False Omission rates are calculated to measures the performance of the\nRBES. The Success Rate and False Omission Rate show better performance\ncomparing to existing CDSS.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2020 15:53:20 GMT"}], "update_date": "2020-03-23", "authors_parsed": [["Hossain", "Sohrab", ""], ["Sarma", "Dhiman", ""], ["Chakma", "Rana Joyti", ""], ["Alam", "Wahidul", ""], ["Hoque", "Mohammed Moshiul", ""], ["Sarker", "Iqbal H.", ""]]}, {"id": "2003.09033", "submitter": "Julian Lo", "authors": "Julian Lo (1), Morgan Heisler (1), Vinicius Vanzan (2), Sonja Karst (2\n  and 3), Ivana Zadro Matovinovic (4), Sven Loncaric (4), Eduardo V. Navajas\n  (2), Mirza Faisal Beg (1), Marinko V. Sarunic (1) ((1) School of Engineering\n  Science, Simon Fraser University, Canada, (2) Department of Ophthalmology and\n  Visual Sciences, University of British Columbia, Canada, (3) Department of\n  Ophthalmology and Optometry, Medical University of Vienna, Austria, (4)\n  Faculty of Electrical Engineering and Computing, University of Zagreb,\n  Croatia)", "title": "Microvasculature Segmentation and Inter-capillary Area Quantification of\n  the Deep Vascular Complex using Transfer Learning", "comments": "27 pages, 8 figures", "journal-ref": null, "doi": "10.1167/tvst.9.2.38", "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Purpose: Optical Coherence Tomography Angiography (OCT-A) permits\nvisualization of the changes to the retinal circulation due to diabetic\nretinopathy (DR), a microvascular complication of diabetes. We demonstrate\naccurate segmentation of the vascular morphology for the superficial capillary\nplexus and deep vascular complex (SCP and DVC) using a convolutional neural\nnetwork (CNN) for quantitative analysis.\n  Methods: Retinal OCT-A with a 6x6mm field of view (FOV) were acquired using a\nZeiss PlexElite. Multiple-volume acquisition and averaging enhanced the vessel\nnetwork contrast used for training the CNN. We used transfer learning from a\nCNN trained on 76 images from smaller FOVs of the SCP acquired using different\nOCT systems. Quantitative analysis of perfusion was performed on the automated\nvessel segmentations in representative patients with DR.\n  Results: The automated segmentations of the OCT-A images maintained the\nhierarchical branching and lobular morphologies of the SCP and DVC,\nrespectively. The network segmented the SCP with an accuracy of 0.8599, and a\nDice index of 0.8618. For the DVC, the accuracy was 0.7986, and the Dice index\nwas 0.8139. The inter-rater comparisons for the SCP had an accuracy and Dice\nindex of 0.8300 and 0.6700, respectively, and 0.6874 and 0.7416 for the DVC.\n  Conclusions: Transfer learning reduces the amount of manually-annotated\nimages required, while producing high quality automatic segmentations of the\nSCP and DVC. Using high quality training data preserves the characteristic\nappearance of the capillary networks in each layer.\n  Translational Relevance: Accurate retinal microvasculature segmentation with\nthe CNN results in improved perfusion analysis in diabetic retinopathy.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 22:27:02 GMT"}], "update_date": "2021-01-13", "authors_parsed": [["Lo", "Julian", "", "2\n  and 3"], ["Heisler", "Morgan", "", "2\n  and 3"], ["Vanzan", "Vinicius", "", "2\n  and 3"], ["Karst", "Sonja", "", "2\n  and 3"], ["Matovinovic", "Ivana Zadro", ""], ["Loncaric", "Sven", ""], ["Navajas", "Eduardo V.", ""], ["Beg", "Mirza Faisal", ""], ["Sarunic", "Marinko V.", ""]]}, {"id": "2003.09065", "submitter": "Tom Chou", "authors": "Jonathan Wylie and Tom Chou", "title": "Uniformly accurate effective equations for disease transmission mediated\n  by pair formation dynamics", "comments": "13pp, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We derive and asymptotically analyze mass-action models for disease spread\nthat include transient pair formation and dissociation. Populations of unpaired\nsusceptibles and infecteds are distinguished from the population of three types\nof pairs of individuals; both susceptible, one susceptible and one infected,\nand both infected. Disease transmission can occur only within a pair consisting\nof one susceptible individual and one infected individual. By considering the\nfast pair formation and fast pair dissociation limits, we use a perturbation\nexpansion to formally derive a uniformly valid approximation for the dynamics\nof the total infected and susceptible populations. Under different parameter\nregimes, we derive uniformly valid effective equations for the total infected\npopulation and compare their results to those of the full mass-action model.\nOur results are derived from the fundamental mass-action system without\nimplicitly imposing transmission mechanisms such as that used in\nfrequency-dependent models. They provide a new formulation for effective\npairing models and are compared with previous models.\n", "versions": [{"version": "v1", "created": "Fri, 20 Mar 2020 01:38:36 GMT"}], "update_date": "2020-03-23", "authors_parsed": [["Wylie", "Jonathan", ""], ["Chou", "Tom", ""]]}, {"id": "2003.09260", "submitter": "Olivier Colliot", "authors": "Alexandre Morin (ARAMIS), Jorge Samper-Gonz\\'alez (ARAMIS), Anne\n  Bertrand (ARAMIS), Sebastian Stroer, Didier Dormont (ICM, ARAMIS), Aline\n  Mendes, Pierrick Coup\\'e, Jamila Ahdidan, Marcel L\\'evy (IM2A), Dalila Samri,\n  Harald Hampel, Bruno Dubois (APM), Marc Teichmann (FRONTlab), St\\'ephane\n  Epelbaum (ARAMIS), Olivier Colliot (ARAMIS)", "title": "Accuracy of MRI Classification Algorithms in a Tertiary Memory Center\n  Clinical Routine Cohort", "comments": null, "journal-ref": "Journal of Alzheimer's Disease, IOS Press, 2020, pp.1-10", "doi": "10.3233/JAD-190594", "report-no": null, "categories": "q-bio.QM cs.CV eess.IV eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BACKGROUND:Automated volumetry software (AVS) has recently become widely\navailable to neuroradiologists. MRI volumetry with AVS may support the\ndiagnosis of dementias by identifying regional atrophy. Moreover, automatic\nclassifiers using machine learning techniques have recently emerged as\npromising approaches to assist diagnosis. However, the performance of both AVS\nand automatic classifiers has been evaluated mostly in the artificial setting\nof research datasets.OBJECTIVE:Our aim was to evaluate the performance of two\nAVS and an automatic classifier in the clinical routine condition of a memory\nclinic.METHODS:We studied 239 patients with cognitive troubles from a single\nmemory center cohort. Using clinical routine T1-weighted MRI, we evaluated the\nclassification performance of: 1) univariate volumetry using two AVS (volBrain\nand Neuroreader$^{TM}$); 2) Support Vector Machine (SVM) automatic classifier,\nusing either the AVS volumes (SVM-AVS), or whole gray matter (SVM-WGM); 3)\nreading by two neuroradiologists. The performance measure was the balanced\ndiagnostic accuracy. The reference standard was consensus diagnosis by three\nneurologists using clinical, biological (cerebrospinal fluid) and imaging data\nand following international criteria.RESULTS:Univariate AVS volumetry provided\nonly moderate accuracies (46% to 71% with hippocampal volume). The accuracy\nimproved when using SVM-AVS classifier (52% to 85%), becoming close to that of\nSVM-WGM (52 to 90%). Visual classification by neuroradiologists ranged between\nSVM-AVS and SVM-WGM.CONCLUSION:In the routine practice of a memory clinic, the\nuse of volumetric measures provided by AVS yields only moderate accuracy.\nAutomatic classifiers can improve accuracy and could be a useful tool to assist\ndiagnosis.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 08:44:46 GMT"}], "update_date": "2020-03-23", "authors_parsed": [["Morin", "Alexandre", "", "ARAMIS"], ["Samper-González", "Jorge", "", "ARAMIS"], ["Bertrand", "Anne", "", "ARAMIS"], ["Stroer", "Sebastian", "", "ICM, ARAMIS"], ["Dormont", "Didier", "", "ICM, ARAMIS"], ["Mendes", "Aline", "", "IM2A"], ["Coupé", "Pierrick", "", "IM2A"], ["Ahdidan", "Jamila", "", "IM2A"], ["Lévy", "Marcel", "", "IM2A"], ["Samri", "Dalila", "", "APM"], ["Hampel", "Harald", "", "APM"], ["Dubois", "Bruno", "", "APM"], ["Teichmann", "Marc", "", "FRONTlab"], ["Epelbaum", "Stéphane", "", "ARAMIS"], ["Colliot", "Olivier", "", "ARAMIS"]]}, {"id": "2003.09312", "submitter": "Nitish Nag", "authors": "Nitish Nag", "title": "Health State Estimation", "comments": "Ph.D. Dissertation @ University of California, Irvine", "journal-ref": "Proquest 2020, 307 pages", "doi": null, "report-no": "27743502", "categories": "cs.AI cs.CY cs.HC q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Life's most valuable asset is health. Continuously understanding the state of\nour health and modeling how it evolves is essential if we wish to improve it.\nGiven the opportunity that people live with more data about their life today\nthan any other time in history, the challenge rests in interweaving this data\nwith the growing body of knowledge to compute and model the health state of an\nindividual continually. This dissertation presents an approach to build a\npersonal model and dynamically estimate the health state of an individual by\nfusing multi-modal data and domain knowledge. The system is stitched together\nfrom four essential abstraction elements: 1. the events in our life, 2. the\nlayers of our biological systems (from molecular to an organism), 3. the\nfunctional utilities that arise from biological underpinnings, and 4. how we\ninteract with these utilities in the reality of daily life. Connecting these\nfour elements via graph network blocks forms the backbone by which we\ninstantiate a digital twin of an individual. Edges and nodes in this graph\nstructure are then regularly updated with learning techniques as data is\ncontinuously digested. Experiments demonstrate the use of dense and\nheterogeneous real-world data from a variety of personal and environmental\nsensors to monitor individual cardiovascular health state. State estimation and\nindividual modeling is the fundamental basis to depart from disease-oriented\napproaches to a total health continuum paradigm. Precision in predicting health\nrequires understanding state trajectory. By encasing this estimation within a\nnavigational approach, a systematic guidance framework can plan actions to\ntransition a current state towards a desired one. This work concludes by\npresenting this framework of combining the health state and personal graph\nmodel to perpetually plan and assist us in living life towards our goals.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2020 21:06:32 GMT"}], "update_date": "2020-08-04", "authors_parsed": [["Nag", "Nitish", ""]]}, {"id": "2003.09496", "submitter": "Giuseppe de Vito", "authors": "Giuseppe de Vito, Pietro Ricci, Lapo Turrini, Vladislav Gavryusev,\n  Caroline M\\\"ullenbroich, Natascia Tiso, Francesco Vanzi, Ludovico Silvestri,\n  Francesco Saverio Pavone", "title": "Effects of excitation light polarization on fluorescence emission in\n  two-photon light-sheet microscopy", "comments": "16 pages, 4 figures. Version of the manuscript accepted for\n  publication on Biomedical Optics Express", "journal-ref": "Biomedical Optics Express Vol. 11, Issue 8, (2020) pp. 4651-4665", "doi": "10.1364/BOE.396388", "report-no": null, "categories": "physics.bio-ph physics.optics q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Light-sheet microscopy (LSM) is a powerful imaging technique that uses a\nplanar illumination oriented orthogonally to the detection axis. Two-photon\n(2P) LSM is a variant of LSM that exploits the 2P absorption effect for sample\nexcitation. The light polarization state plays a significant, and often\noverlooked, role in 2P absorption processes. The scope of this work is to test\nwhether using different polarization states for excitation light can affect the\ndetected signal levels in 2P LSM imaging of typical biological samples with a\nspatially unordered dye population. Supported by a theoretical model, we\ncompared the fluorescence signals obtained using different polarization states\nwith various fluorophores (fluorescein, EGFP and GCaMP6s) and different samples\n(liquid solution and fixed or living zebrafish larvae). In all conditions, in\nagreement with our theoretical expectations, linear polarization oriented\nparallel to the detection plane provided the largest signal levels, while\nperpendicularly-oriented polarization gave low fluorescence signal with the\nbiological samples, but a large signal for the fluorescein solution. Finally,\ncircular polarization generally provided lower signal levels. These results\nhighlight the importance of controlling the light polarization state in 2P LSM\nof biological samples. Furthermore, this characterization represents a useful\nguide to choose the best light polarization state when maximization of signal\nlevels is needed, e.g. in high-speed 2P LSM.\n", "versions": [{"version": "v1", "created": "Fri, 20 Mar 2020 20:55:57 GMT"}, {"version": "v2", "created": "Fri, 24 Jul 2020 21:04:12 GMT"}], "update_date": "2020-07-28", "authors_parsed": [["de Vito", "Giuseppe", ""], ["Ricci", "Pietro", ""], ["Turrini", "Lapo", ""], ["Gavryusev", "Vladislav", ""], ["Müllenbroich", "Caroline", ""], ["Tiso", "Natascia", ""], ["Vanzi", "Francesco", ""], ["Silvestri", "Ludovico", ""], ["Pavone", "Francesco Saverio", ""]]}, {"id": "2003.09544", "submitter": "Yushu Shi", "authors": "Yushu Shi, Liangliang Zhang, Kim-Anh Do, Christine Peterson and Robert\n  Jenq", "title": "aPCoA: Covariate Adjusted Principal Coordinates Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In fields such as ecology, microbiology, and genomics, non-Euclidean\ndistances are widely applied to describe pairwise dissimilarity between\nsamples. Given these pairwise distances, principal coordinates analysis (PCoA)\nis commonly used to construct a visualization of the data. However, confounding\ncovariates can make patterns related to the scientific question of interest\ndifficult to observe. We provide aPCoA as an easy-to-use tool, available as\nboth an R package and a Shiny app, to improve data visualization in this\ncontext, enabling enhanced presentation of the effects of interest.\n", "versions": [{"version": "v1", "created": "Sat, 21 Mar 2020 01:05:58 GMT"}], "update_date": "2020-03-24", "authors_parsed": [["Shi", "Yushu", ""], ["Zhang", "Liangliang", ""], ["Do", "Kim-Anh", ""], ["Peterson", "Christine", ""], ["Jenq", "Robert", ""]]}, {"id": "2003.10008", "submitter": "Dhananjay Bhaskar", "authors": "Dhananjay Bhaskar, William Y. Zhang and Ian Y. Wong", "title": "Topological Data Analysis of Collective and Individual Epithelial Cells\n  using Persistent Homology of Loops", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.soft nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interacting, self-propelled particles such as epithelial cells can\ndynamically self-organize into complex multicellular patterns, which are\nchallenging to classify without a priori information. Classically, different\nphases and phase transitions have been described based on local ordering, which\nmay not capture structural features at larger length scales. Instead,\ntopological data analysis (TDA) determines the stability of spatial\nconnectivity at varying length scales (i.e. persistent homology) and can\ncompare different particle configurations based on the \"cost\" of reorganizing\none configuration into another. Here, we demonstrate a topology-based machine\nlearning approach for unsupervised profiling of individual and collective\nphases based on large-scale loops. We show that these topological loops (i.e.\ndimension 1 homology) are robust to variations in particle number and density,\nparticularly in comparison to connected components (i.e. dimension 0 homology).\nWe use TDA to map out phase diagrams for simulated particles with varying\nadhesion and propulsion, at constant population size as well as when\nproliferation is permitted. Next, we use this approach to profile our recent\nexperiments on the clustering of epithelial cells in varying growth factor\nconditions, which are compared to our simulations. Finally, we characterize the\nrobustness of this approach at varying length scales, with sparse sampling, and\nover time. Overall, we envision TDA will be broadly applicable as a\nmodel-agnostic approach to analyze active systems with varying population size,\nfrom cytoskeletal motors to motile cells to flocking or swarming animals.\n", "versions": [{"version": "v1", "created": "Sun, 22 Mar 2020 22:05:03 GMT"}, {"version": "v2", "created": "Fri, 15 Jan 2021 22:55:50 GMT"}], "update_date": "2021-01-19", "authors_parsed": [["Bhaskar", "Dhananjay", ""], ["Zhang", "William Y.", ""], ["Wong", "Ian Y.", ""]]}, {"id": "2003.10086", "submitter": "Alexander Siegenfeld", "authors": "Alexander F. Siegenfeld and Yaneer Bar-Yam", "title": "Eliminating COVID-19: The Impact of Travel and Timing", "comments": null, "journal-ref": "Communications Physics 3, 204 (2020)", "doi": "10.1038/s42005-020-00470-7", "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the spread of COVID-19 by considering the transmission of the\ndisease among individuals both within and between regions. A set of regions can\nbe defined as any partition of a population such that travel/social contact\nwithin each region far exceeds that between them. COVID-19 can be eliminated if\nthe region-to-region reproductive number---i.e. the average number of other\nregions to which a single infected region will transmit the virus---is reduced\nto less than one. We find that this region-to-region reproductive number is\nproportional to the travel rate between regions and exponential in the length\nof the time-delay before region-level control measures are imposed. Thus,\nreductions in travel and the speed with which regions take action play decisive\nroles in whether COVID-19 is eliminated from a collection of regions. If, on\naverage, infected regions (including those that become re-infected in the\nfuture) impose social distancing measures shortly after active spreading begins\nwithin them, the number of infected regions, and thus the number of regions in\nwhich such measures are required, will exponentially decrease over time.\nElimination will in this case be a stable fixed point even after the social\ndistancing measures have been lifted from most of the regions.\n", "versions": [{"version": "v1", "created": "Mon, 23 Mar 2020 05:17:27 GMT"}, {"version": "v2", "created": "Thu, 23 Apr 2020 19:45:40 GMT"}], "update_date": "2020-11-11", "authors_parsed": [["Siegenfeld", "Alexander F.", ""], ["Bar-Yam", "Yaneer", ""]]}, {"id": "2003.10197", "submitter": "Ross Callaghan", "authors": "Ross Callaghan, Daniel C. Alexander, Marco Palombo and Hui Zhang", "title": "ConFiG: Contextual Fibre Growth to generate realistic axonal packing for\n  diffusion MRI simulation", "comments": null, "journal-ref": null, "doi": "10.1016/j.neuroimage.2020.117107", "report-no": null, "categories": "physics.med-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents Contextual Fibre Growth (ConFiG), an approach to generate\nwhite matter numerical phantoms by mimicking natural fibre genesis. ConFiG\ngrows fibres one-by-one, following simple rules motivated by real axonal\nguidance mechanisms. These simple rules enable ConFiG to generate phantoms with\ntuneable microstructural features by growing fibres while attempting to meet\nmorphological targets such as user-specified density and orientation\ndistribution. We compare ConFiG to the state-of-the-art approach based on\npacking fibres together by generating phantoms in a range of fibre\nconfigurations including crossing fibre bundles and orientation dispersion.\nResults demonstrate that ConFiG produces phantoms with up to 20% higher\ndensities than the state-of-the-art, particularly in complex configurations\nwith crossing fibres. We additionally show that the microstructural morphology\nof ConFiG phantoms is comparable to real tissue, producing diameter and\norientation distributions close to electron microscopy estimates from real\ntissue as well as capturing complex fibre cross sections. Signals simulated\nfrom ConFiG phantoms match real diffusion MRI data well, showing that ConFiG\nphantoms can be used to generate realistic diffusion MRI data. This\ndemonstrates the feasibility of ConFiG to generate realistic synthetic\ndiffusion MRI data for developing and validating microstructure modelling\napproaches.\n", "versions": [{"version": "v1", "created": "Mon, 23 Mar 2020 11:54:25 GMT"}], "update_date": "2020-08-19", "authors_parsed": [["Callaghan", "Ross", ""], ["Alexander", "Daniel C.", ""], ["Palombo", "Marco", ""], ["Zhang", "Hui", ""]]}, {"id": "2003.10218", "submitter": "Mikhail Prokopenko", "authors": "Sheryl L. Chang, Nathan Harding, Cameron Zachreson, Oliver M. Cliff,\n  Mikhail Prokopenko", "title": "Modelling transmission and control of the COVID-19 pandemic in Australia", "comments": "45 pages, 19 figures", "journal-ref": "Nature Communications, 11: 5710, 2020", "doi": "10.1038/s41467-020-19393-6", "report-no": null, "categories": "q-bio.PE cs.MA q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a continuing debate on relative benefits of various mitigation and\nsuppression strategies aimed to control the spread of COVID-19. Here we report\nthe results of agent-based modelling using a fine-grained computational\nsimulation of the ongoing COVID-19 pandemic in Australia. This model is\ncalibrated to match key characteristics of COVID-19 transmission. An important\ncalibration outcome is the age-dependent fraction of symptomatic cases, with\nthis fraction for children found to be one-fifth of such fraction for adults.\nWe apply the model to compare several intervention strategies, including\nrestrictions on international air travel, case isolation, home quarantine,\nsocial distancing with varying levels of compliance, and school closures.\nSchool closures are not found to bring decisive benefits, unless coupled with\nhigh level of social distancing compliance. We report several trade-offs, and\nan important transition across the levels of social distancing compliance, in\nthe range between 70% and 80% levels, with compliance at the 90% level found to\ncontrol the disease within 13--14 weeks, when coupled with effective case\nisolation and international travel restrictions.\n", "versions": [{"version": "v1", "created": "Mon, 23 Mar 2020 12:31:56 GMT"}, {"version": "v2", "created": "Thu, 2 Apr 2020 03:20:00 GMT"}, {"version": "v3", "created": "Sun, 3 May 2020 18:11:15 GMT"}, {"version": "v4", "created": "Wed, 11 Nov 2020 13:49:48 GMT"}], "update_date": "2020-11-12", "authors_parsed": [["Chang", "Sheryl L.", ""], ["Harding", "Nathan", ""], ["Zachreson", "Cameron", ""], ["Cliff", "Oliver M.", ""], ["Prokopenko", "Mikhail", ""]]}, {"id": "2003.10372", "submitter": "Manuel Ciba", "authors": "Manuel Ciba, Robert Bestel, Christoph Nick, Guilherme Ferraz de\n  Arruda, Thomas Peron, Comin C\\'esar Henrique, Luciano da Fontoura Costa,\n  Francisco Aparecido Rodrigues, Christiane Thielemann", "title": "Comparison of different spike train synchrony measures regarding their\n  robustness to erroneous data from bicuculline induced epileptiform activity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As synchronized activity is associated with basic brain functions and\npathological states, spike train synchrony has become an important measure to\nanalyze experimental neuronal data. Many different measures of spike train\nsynchrony have been proposed, but there is no gold standard allowing for\ncomparison of results between different experiments. This work aims to provide\nguidance on which synchrony measure is best suitable to quantify the effect of\nepileptiform inducing substances (e.g. bicuculline (BIC)) in in vitro neuronal\nspike train data. Spike train data from recordings are likely to suffer from\nerroneous spike detection, such as missed spikes (false negative) or noise\n(false positive). Therefore, different time-scale dependent (cross-correlation,\nmutual information, spike time tiling coefficient) and time-scale independent\n(Spike-contrast, phase synchronization, A-SPIKE-synchronization,\nA-ISI-distance, ARI-SPIKE-distance) synchrony measures were compared in terms\nof their robustness to erroneous spike trains. As a result of the in silico\nmanipulated data, Spike-contrast was the only measure being robust to false\nnegative as well as false-positive spikes. Analyzing the experimental data set\nrevealed that all measures were able to capture the effect of BIC in a\nstatistically significant way, with Spike-contrast showing the highest\nstatistical significance even at low spike detection thresholds. In summary, we\nsuggest the usage of Spike-contrast to complement established synchrony\nmeasures, as it is time scale independent and robust to erroneous spike trains.\n", "versions": [{"version": "v1", "created": "Mon, 23 Mar 2020 16:37:06 GMT"}], "update_date": "2020-03-24", "authors_parsed": [["Ciba", "Manuel", ""], ["Bestel", "Robert", ""], ["Nick", "Christoph", ""], ["de Arruda", "Guilherme Ferraz", ""], ["Peron", "Thomas", ""], ["Henrique", "Comin César", ""], ["Costa", "Luciano da Fontoura", ""], ["Rodrigues", "Francisco Aparecido", ""], ["Thielemann", "Christiane", ""]]}, {"id": "2003.10514", "submitter": "Yujiang Wang", "authors": "Yujiang Wang, Tobias Ludwig, Bethany Little, Joe H Necus, Gavin\n  Winston, Sjoerd B Vos, Jane de Tisi, John S Duncan, Peter N Taylor, Bruno\n  Mota", "title": "Independent components of human brain morphology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC physics.app-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantification of brain morphology has become an important cornerstone in\nunderstanding brain structure. Measures of cortical morphology such as\nthickness and surface area are frequently used to compare groups of subjects or\ncharacterise longitudinal changes. However, such measures are often treated as\nindependent from each other.\n  A recently described scaling law, derived from a statistical physics model of\ncortical folding, demonstrates that there is a tight covariance between three\ncommonly used cortical morphology measures: cortical thickness, total surface\narea, and exposed surface area.\n  We show that assuming the independence of cortical morphology measures can\nhide features and potentially lead to misinterpretations. Using the scaling\nlaw, we account for the covariance between cortical morphology measures and\nderive novel independent measures of cortical morphology. By applying these new\nmeasures, we show that new information can be gained; in our example we show\nthat distinct morphological alterations underlie healthy ageing compared to\ntemporal lobe epilepsy, even on the coarse level of a whole hemisphere.\n  We thus provide a conceptual framework for characterising cortical morphology\nin a statistically valid and interpretable manner, based on theoretical\nreasoning about the shape of the cortex.\n", "versions": [{"version": "v1", "created": "Mon, 23 Mar 2020 19:53:48 GMT"}], "update_date": "2020-03-25", "authors_parsed": [["Wang", "Yujiang", ""], ["Ludwig", "Tobias", ""], ["Little", "Bethany", ""], ["Necus", "Joe H", ""], ["Winston", "Gavin", ""], ["Vos", "Sjoerd B", ""], ["de Tisi", "Jane", ""], ["Duncan", "John S", ""], ["Taylor", "Peter N", ""], ["Mota", "Bruno", ""]]}, {"id": "2003.10778", "submitter": "Jevgenij Gamper", "authors": "Jevgenij Gamper, Navid Alemi Koohbanani, Ksenija Benes, Simon Graham,\n  Mostafa Jahanifar, Syed Ali Khurram, Ayesha Azam, Katherine Hewitt, Nasir\n  Rajpoot", "title": "PanNuke Dataset Extension, Insights and Baselines", "comments": "Work in progress", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emerging area of computational pathology (CPath) is ripe ground for the\napplication of deep learning (DL) methods to healthcare due to the sheer volume\nof raw pixel data in whole-slide images (WSIs) of cancerous tissue slides.\nHowever, it is imperative for the DL algorithms relying on nuclei-level details\nto be able to cope with data from `the clinical wild', which tends to be quite\nchallenging.\n  We study, and extend recently released PanNuke dataset consisting of ~200,000\nnuclei categorized into 5 clinically important classes for the challenging\ntasks of segmenting and classifying nuclei in WSIs. Previous pan-cancer\ndatasets consisted of only up to 9 different tissues and up to 21,000 unlabeled\nnuclei and just over 24,000 labeled nuclei with segmentation masks. PanNuke\nconsists of 19 different tissue types that have been semi-automatically\nannotated and quality controlled by clinical pathologists, leading to a dataset\nwith statistics similar to the clinical wild and with minimal selection bias.\nWe study the performance of segmentation and classification models when applied\nto the proposed dataset and demonstrate the application of models trained on\nPanNuke to whole-slide images. We provide comprehensive statistics about the\ndataset and outline recommendations and research directions to address the\nlimitations of existing DL tools when applied to real-world CPath applications.\n", "versions": [{"version": "v1", "created": "Tue, 24 Mar 2020 11:25:12 GMT"}, {"version": "v2", "created": "Wed, 25 Mar 2020 20:03:30 GMT"}, {"version": "v3", "created": "Fri, 27 Mar 2020 10:57:58 GMT"}, {"version": "v4", "created": "Fri, 3 Apr 2020 11:00:15 GMT"}, {"version": "v5", "created": "Tue, 7 Apr 2020 18:44:37 GMT"}, {"version": "v6", "created": "Mon, 20 Apr 2020 14:10:43 GMT"}, {"version": "v7", "created": "Wed, 22 Apr 2020 08:52:04 GMT"}], "update_date": "2020-04-23", "authors_parsed": [["Gamper", "Jevgenij", ""], ["Koohbanani", "Navid Alemi", ""], ["Benes", "Ksenija", ""], ["Graham", "Simon", ""], ["Jahanifar", "Mostafa", ""], ["Khurram", "Syed Ali", ""], ["Azam", "Ayesha", ""], ["Hewitt", "Katherine", ""], ["Rajpoot", "Nasir", ""]]}, {"id": "2003.11194", "submitter": "Steven Schiff", "authors": "Donald Ebeigbe, Tyrus Berry, Steven J. Schiff, and Timothy Sauer", "title": "A Poisson Kalman filter for disease surveillance", "comments": "19 Pages, 8 Figures", "journal-ref": "Phys. Rev. Research 2, 043028 (2020)", "doi": "10.1103/PhysRevResearch.2.043028", "report-no": null, "categories": "stat.ME q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  An optimal filter for Poisson observations is developed as a variant of the\ntraditional Kalman filter. Poisson distributions are characteristic of\ninfectious diseases, which model the number of patients recorded as presenting\neach day to a health care system. We develop both a linear and nonlinear\n(extended) filter. The methods are applied to a case study of neonatal sepsis\nand postinfectious hydrocephalus in Africa, using parameters estimated from\npublicly available data. Our approach is applicable to a broad range of disease\ndynamics, including both noncommunicable and the inherent nonlinearities of\ncommunicable infectious diseases and epidemics such as from COVID-19.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2020 02:55:10 GMT"}, {"version": "v2", "created": "Fri, 3 Apr 2020 21:36:56 GMT"}, {"version": "v3", "created": "Wed, 8 Apr 2020 02:42:35 GMT"}, {"version": "v4", "created": "Sun, 12 Jul 2020 20:38:23 GMT"}, {"version": "v5", "created": "Mon, 14 Sep 2020 03:16:58 GMT"}], "update_date": "2020-10-14", "authors_parsed": [["Ebeigbe", "Donald", ""], ["Berry", "Tyrus", ""], ["Schiff", "Steven J.", ""], ["Sauer", "Timothy", ""]]}, {"id": "2003.11451", "submitter": "Aristides Moustakas", "authors": "Konstantinos Konstantopoulos, Aristides Moustakas, and Ioannis N.\n  Vogiatzakis", "title": "A spatially explicit impact assessment of road characteristics,\n  road-induced fragmentation and noise on bird species in Cyprus", "comments": null, "journal-ref": null, "doi": "10.1080/14888386.2020.1736154", "report-no": null, "categories": "q-bio.QM q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid increase of transportation infrastructure during the recent decades\nhas caused a number of effects on bird species, including collision mortality,\nhabitat loss, fragmentation and noise. This paper investigates the effects of\ntraffic noise and road-induced fragmentation on breeding bird richness in\nCyprus. Cyprus, situated along one of the main migratory routes for birds, has\na rich and diverse avifauna threatened by an ever-expanding road network and a\nroad density among the highest in Europe. In this first island-wide study we\nused data from 102 breeding birds recorded in 10 km x 10 km grid cells. Within\nevery cell we calculated road traffic noise and eight road-related properties.\nMost of the grid cells are subject to intense fragmentation and traffic noise\nwith combined impact hotspots located even within protected areas (such as Cape\nGreco, and the Troodos Massif). Results from variance partitioning indicated\nthat road-related properties (total road extent and road length) accounted for\na combined 59% of variation in species richness, followed by\nfragmentation-related properties and noise properties. The study posits the\nneed for further in-depth research on the effects of road networks on birds,\nand road construction, particularly in protected areas within Mediterranean\nislands.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2020 15:42:40 GMT"}], "update_date": "2020-03-26", "authors_parsed": [["Konstantopoulos", "Konstantinos", ""], ["Moustakas", "Aristides", ""], ["Vogiatzakis", "Ioannis N.", ""]]}, {"id": "2003.11595", "submitter": "Pablo Rodr\\'iguez-S\\'anchez", "authors": "Pablo Rodr\\'iguez-S\\'anchez, Egbert H. van Nes, Marten Scheffer", "title": "Early warning signals for desynchronization in periodically forced\n  systems", "comments": "10 pages, 6 figures, 1 appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conditions such as insomnia, cardiac arrhythmia and jet-lag share a common\nfeature: they are all related to the ability of biological systems to\nsynchronize with the day-night cycle. When organisms lose resilience, this\nability of synchronizing can become weaker till they eventually become\ndesynchronized in a state of malfunctioning or sickness. It would be useful to\nmeasure this loss of resilience before the full desynchronization takes place.\nSeveral dynamical indicators of resilience (DIORs) have been proposed to\naccount for the loss of resilience of a dynamical system. The performance of\nthese indicators depends on the underlying mechanism of the critical\ntransition, usually a saddle-node bifurcation. Before such bifurcation the\nrecovery rate from perturbations of the system becomes slower, a mechanism\nknown as critical slowing down. Here we show that, for a wide class of\nbiological systems, desynchronization happens through another bifurcation,\nnamely the saddle-node of cycles, for which critical slowing down cannot be\ndirectly detected. Such a bifurcation represents a system transitioning from\nsynchronized (phase locked) to a desynchronized state, or vice versa. We show\nthat after an appropriate transformation we can also detect this bifurcation\nusing dynamical indicators of resilience. We test this method with data\ngenerated by models of sleep-wake cycles.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2020 19:31:34 GMT"}], "update_date": "2020-03-27", "authors_parsed": [["Rodríguez-Sánchez", "Pablo", ""], ["van Nes", "Egbert H.", ""], ["Scheffer", "Marten", ""]]}, {"id": "2003.11597", "submitter": "Joseph Paul Cohen", "authors": "Joseph Paul Cohen and Paul Morrison and Lan Dao", "title": "COVID-19 Image Data Collection", "comments": "Dataset available here:\n  https://github.com/ieee8023/covid-chestxray-dataset", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes the initial COVID-19 open image data collection. It was\ncreated by assembling medical images from websites and publications and\ncurrently contains 123 frontal view X-rays.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2020 19:37:25 GMT"}], "update_date": "2020-03-27", "authors_parsed": [["Cohen", "Joseph Paul", ""], ["Morrison", "Paul", ""], ["Dao", "Lan", ""]]}, {"id": "2003.11961", "submitter": "Jean-Baptiste F\\'eret", "authors": "Jean-Baptiste F\\'eret, Katja Berger, Florian de Boissieu and\n  Zbyn\\v{e}k Malenovsk\\'y", "title": "PROSPECT-PRO for estimating content of nitrogen-containing leaf proteins\n  and other carbon-based constituents", "comments": "47 pages, 8 figures Submitted to Remote Sensing of Environment,\n  March, 20th, 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Models of radiative transfer (RT) are important tools for remote sensing of\nvegetation, as they facilitate forward simulations of remotely sensed data as\nwell as inverse estimation of biophysical and biochemical properties from\nvegetation optical properties. The remote sensing estimation of foliar protein\ncontent is a key to monitoring the nitrogen cycle in terrestrial ecosystems in\nparticular to better understand photosynthetic capacity of plants and improve\nnitrogen management in agriculture. However, no physically based leaf RT model\ncurrently allows for proper decomposition of leaf dry matter into\nnitrogen-based proteins and carbon-based constituents (CBC), estimated from\noptical properties of fresh or dry foliage. We developed a new version of the\nPROSPECT model, named PROSPECT-PRO, which separates nitrogen-based constituents\n(proteins) from CBC (including cellulose, lignin, hemicellulose and starch).\nPROSPECT-PRO was calibrated and validated on subsets of the LOPEX dataset,\naccounting for both fresh and dry broadleaf and grass samples. We applied an\niterative model inversion optimization algorithm to identify optimal spectral\nsubdomains for retrieval of leaf protein and CBC contents, with 2125-2174 nm\noptimal for proteins and 2025-2349 nm optimal for CBCs. PROSPECT-PRO inversions\nrevealed a better performance in estimating proteins from optical properties of\nfresh than dry leaves. We further tested the ability of PROSPECT-PRO to\nestimate leaf mass per area (LMA) as the sum of proteins and CBC using\nindependent datasets acquired for numerous plant species. Results showed that\nPROSPECT-PRO is fully compatible and comparable with its predecessor PROSPECT-D\nin indirect estimation of LMA. We can conclude from findings of this study that\nPROSPECT-PRO has a high potential in establishing the carbon-to-nitrogen ratio\nbased on the retrieved CBC-to-proteins ratio.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2020 17:48:04 GMT"}], "update_date": "2020-03-27", "authors_parsed": [["Féret", "Jean-Baptiste", ""], ["Berger", "Katja", ""], ["de Boissieu", "Florian", ""], ["Malenovský", "Zbyněk", ""]]}, {"id": "2003.12036", "submitter": "Carlo Manzo", "authors": "Gorka Mu\\~noz-Gil, Giovanni Volpe, Miguel Angel Garcia-March, Ralf\n  Metzler, Maciej Lewenstein, Carlo Manzo", "title": "AnDi: The Anomalous Diffusion Challenge", "comments": "6 pages, 2 figure - AnDi Challenge webpage:\n  http://www.andi-challenge.org", "journal-ref": null, "doi": "10.1117/12.2567914", "report-no": null, "categories": "cond-mat.stat-mech physics.comp-ph physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The deviation from pure Brownian motion generally referred to as anomalous\ndiffusion has received large attention in the scientific literature to describe\nmany physical scenarios. Several methods, based on classical statistics and\nmachine learning approaches, have been developed to characterize anomalous\ndiffusion from experimental data, which are usually acquired as particle\ntrajectories. With the aim to assess and compare the available methods to\ncharacterize anomalous diffusion, we have organized the Anomalous Diffusion\n(AnDi) Challenge (\\url{http://www.andi-challenge.org/}). Specifically, the AnDi\nChallenge will address three different aspects of anomalous diffusion\ncharacterization, namely: (i) Inference of the anomalous diffusion exponent.\n(ii) Identification of the underlying diffusion model. (iii) Segmentation of\ntrajectories. Each problem includes sub-tasks for different number of\ndimensions (1D, 2D and 3D). In order to compare the various methods, we have\ndeveloped a dedicated open-source framework for the simulation of the anomalous\ndiffusion trajectories that are used for the training and test datasets. The\nchallenge was launched on March 1, 2020, and consists of three phases.\nCurrently, the participation to the first phase is open. Submissions will be\nautomatically evaluated and the performance of the top-scoring methods will be\nthoroughly analyzed and compared in an upcoming article.\n", "versions": [{"version": "v1", "created": "Thu, 26 Mar 2020 17:05:48 GMT"}], "update_date": "2020-08-31", "authors_parsed": [["Muñoz-Gil", "Gorka", ""], ["Volpe", "Giovanni", ""], ["Garcia-March", "Miguel Angel", ""], ["Metzler", "Ralf", ""], ["Lewenstein", "Maciej", ""], ["Manzo", "Carlo", ""]]}, {"id": "2003.12310", "submitter": "Michael Mayhew", "authors": "Michael B. Mayhew, Elizabeth Tran, Kirindi Choi, Uros Midic, Roland\n  Luethy, Nandita Damaraju and Ljubomir Buturovic", "title": "Optimization of Genomic Classifiers for Clinical Deployment: Evaluation\n  of Bayesian Optimization to Select Predictive Models of Acute Infection and\n  In-Hospital Mortality", "comments": "Preprint of an article published in Pacific Symposium on Biocomputing\n  \\c{opyright} [Year] World Scientific Publishing Co., Singapore,\n  http://psb.stanford.edu/ (12 pages, 3 figures); Supplementary Material\n  included (23 pages, 16 figures)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.QM stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Acute infection, if not rapidly and accurately detected, can lead to sepsis,\norgan failure and even death. Current detection of acute infection as well as\nassessment of a patient's severity of illness are imperfect. Characterization\nof a patient's immune response by quantifying expression levels of specific\ngenes from blood represents a potentially more timely and precise means of\naccomplishing both tasks. Machine learning methods provide a platform to\nleverage this 'host response' for development of deployment-ready\nclassification models. Prioritization of promising classifiers is dependent, in\npart, on hyperparameter optimization for which a number of approaches including\ngrid search, random sampling and Bayesian optimization have been shown to be\neffective. We compare HO approaches for the development of diagnostic\nclassifiers of acute infection and in-hospital mortality from gene expression\nof 29 diagnostic markers. We take a deployment-centered approach to our\ncomprehensive analysis, accounting for heterogeneity in our multi-study patient\ncohort with our choices of dataset partitioning and hyperparameter optimization\nobjective as well as assessing selected classifiers in external (as well as\ninternal) validation. We find that classifiers selected by Bayesian\noptimization for in-hospital mortality can outperform those selected by grid\nsearch or random sampling. However, in contrast to previous research: 1)\nBayesian optimization is not more efficient in selecting classifiers in all\ninstances compared to grid search or random sampling-based methods and 2) we\nnote marginal gains in classifier performance in only specific circumstances\nwhen using a common variant of Bayesian optimization (i.e. automatic relevance\ndetermination). Our analysis highlights the need for further practical,\ndeployment-centered benchmarking of HO approaches in the healthcare context.\n", "versions": [{"version": "v1", "created": "Fri, 27 Mar 2020 10:22:02 GMT"}, {"version": "v2", "created": "Tue, 4 Aug 2020 14:43:51 GMT"}, {"version": "v3", "created": "Tue, 13 Oct 2020 09:45:42 GMT"}], "update_date": "2020-10-14", "authors_parsed": [["Mayhew", "Michael B.", ""], ["Tran", "Elizabeth", ""], ["Choi", "Kirindi", ""], ["Midic", "Uros", ""], ["Luethy", "Roland", ""], ["Damaraju", "Nandita", ""], ["Buturovic", "Ljubomir", ""]]}, {"id": "2003.12454", "submitter": "Ezequiel Alvarez", "authors": "Ezequiel Alvarez (ICAS, Argentina), Federico Lamagna (CAB, Argentina)\n  and Manuel Szewc (ICAS, Argentina)", "title": "A Machine Learning alternative to placebo-controlled clinical trials\n  upon new diseases: A primer", "comments": "Work originally aimed for COVID-19 outbreak. All scripts are open\n  source in github.com/ManuelSzewc/ML4DT/", "journal-ref": null, "doi": null, "report-no": "ICAS 048", "categories": "q-bio.QM cs.LG q-bio.PE stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The appearance of a new dangerous and contagious disease requires the\ndevelopment of a drug therapy faster than what is foreseen by usual mechanisms.\nMany drug therapy developments consist in investigating through different\nclinical trials the effects of different specific drug combinations by\ndelivering it into a test group of ill patients, meanwhile a placebo treatment\nis delivered to the remaining ill patients, known as the control group. We\ncompare the above technique to a new technique in which all patients receive a\ndifferent and reasonable combination of drugs and use this outcome to feed a\nNeural Network. By averaging out fluctuations and recognizing different patient\nfeatures, the Neural Network learns the pattern that connects the patients\ninitial state to the outcome of the treatments and therefore can predict the\nbest drug therapy better than the above method. In contrast to many available\nworks, we do not study any detail of drugs composition nor interaction, but\ninstead pose and solve the problem from a phenomenological point of view, which\nallows us to compare both methods. Although the conclusion is reached through\nmathematical modeling and is stable upon any reasonable model, this is a\nproof-of-concept that should be studied within other expertises before\nconfronting a real scenario. All calculations, tools and scripts have been made\nopen source for the community to test, modify or expand it. Finally it should\nbe mentioned that, although the results presented here are in the context of a\nnew disease in medical sciences, these are useful for any field that requires a\nexperimental technique with a control group.\n", "versions": [{"version": "v1", "created": "Thu, 26 Mar 2020 17:53:10 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Alvarez", "Ezequiel", "", "ICAS, Argentina"], ["Lamagna", "Federico", "", "CAB, Argentina"], ["Szewc", "Manuel", "", "ICAS, Argentina"]]}, {"id": "2003.12919", "submitter": "Gennady Gorin", "authors": "Gennady Gorin, Lior Pachter", "title": "Special Function Methods for Bursty Models of Transcription", "comments": "Body: 15 pages, 2 figures, 2 tables. Supplement: 10 pages, 1 figure", "journal-ref": "Phys. Rev. E 102, 022409 (2020)", "doi": "10.1103/PhysRevE.102.022409", "report-no": null, "categories": "stat.ME q-bio.MN q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We explore a Markov model used in the analysis of gene expression, involving\nthe bursty production of pre-mRNA, its conversion to mature mRNA, and its\nconsequent degradation. We demonstrate that the integration used to compute the\nsolution of the stochastic system can be approximated by the evaluation of\nspecial functions. Furthermore, the form of the special function solution\ngeneralizes to a broader class of burst distributions. In light of the broader\ngoal of biophysical parameter inference from transcriptomics data, we apply the\nmethod to simulated data, demonstrating effective control of precision and\nruntime. Finally, we suggest a non-Bayesian approach to reducing the\ncomputational complexity of parameter inference to linear order in state space\nsize and number of candidate parameters.\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2020 01:24:56 GMT"}], "update_date": "2020-09-09", "authors_parsed": [["Gorin", "Gennady", ""], ["Pachter", "Lior", ""]]}, {"id": "2003.12936", "submitter": "Yevgeniy Kovchegov", "authors": "Evgenia Chunikhina, Paul Logan, Yevgeniy Kovchegov, Anatoly\n  Yambartsev, Debashis Mondal, Andrey Morgun", "title": "The covariance shift (C-SHIFT) algorithm for normalizing biological data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.QM stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Omics technologies are powerful tools for analyzing patterns in gene\nexpression data for thousands of genes. Due to a number of systematic\nvariations in experiments, the raw gene expression data is often obfuscated by\nundesirable technical noises. Various normalization techniques were designed in\nan attempt to remove these non-biological errors prior to any statistical\nanalysis. One of the reasons for normalizing data is the need for recovering\nthe covariance matrix used in gene network analysis. In this paper, we\nintroduce a novel normalization technique, called the covariance shift\n(C-SHIFT) method. This normalization algorithm uses optimization techniques\ntogether with the blessing of dimensionality philosophy and energy minimization\nhypothesis for covariance matrix recovery under additive noise (in biology,\nknown as the bias). Thus, it is perfectly suited for the analysis of\nlogarithmic gene expression data. Numerical experiments on synthetic data\ndemonstrate the method's advantage over the classical normalization techniques.\nNamely, the comparison is made with rank, quantile, cyclic LOESS (locally\nestimated scatterplot smoothing), and MAD (median absolute deviation)\nnormalization methods.\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2020 03:24:51 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Chunikhina", "Evgenia", ""], ["Logan", "Paul", ""], ["Kovchegov", "Yevgeniy", ""], ["Yambartsev", "Anatoly", ""], ["Mondal", "Debashis", ""], ["Morgun", "Andrey", ""]]}, {"id": "2003.13041", "submitter": "Amos Korman", "authors": "Brieuc Guinard and Amos Korman", "title": "Intermittent Inverse-Square L\\'evy Walks are Optimal for Finding Targets\n  of All Sizes", "comments": null, "journal-ref": "Science Advances 2021", "doi": "10.1126/sciadv.abe8211", "report-no": null, "categories": "cs.DS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  L\\'evy walks are random walk processes whose step-lengths follow a\nlong-tailed power-law distribution. Due to their abundance as movement patterns\nof biological organisms, significant theoretical efforts have been devoted to\nidentifying the foraging circumstances that would make such patterns\nadvantageous. However, despite extensive research, there is currently no\nmathematical proof indicating that L\\'evy walks are, in any manner, preferable\nstrategies in higher dimensions than one. Here we prove that in finite\ntwo-dimensional terrains, the inverse-square L\\'evy walk strategy is extremely\nefficient at finding sparse targets of arbitrary size and shape. Moreover, this\nholds even under the weak model of intermittent detection. Conversely, any\nother intermittent L\\'evy walk fails to efficiently find either large targets\nor small ones. Our results shed new light on the \\emph{L\\'evy foraging\nhypothesis}, and are thus expected to impact future experiments on animals\nperforming L\\'evy walks.\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2020 14:45:02 GMT"}, {"version": "v2", "created": "Thu, 9 Apr 2020 10:14:36 GMT"}, {"version": "v3", "created": "Wed, 21 Jul 2021 22:30:27 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Guinard", "Brieuc", ""], ["Korman", "Amos", ""]]}, {"id": "2003.13092", "submitter": "Hendrik Bernd Petersen", "authors": "Hendrik Bernd Petersen and Bubacarr Bah and Peter Jung", "title": "Efficient Tuning-Free $\\ell_1$-Regression of Nonnegative Compressible\n  Signals", "comments": "23 pages, 10 figures, 1 table, 1 algorithm, 1.3 pages of references,\n  2 pages of figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.OC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In compressed sensing the goal is to recover a signal from as few as possible\nnoisy, linear measurements. The general assumption is that the signal has only\na few non-zero entries. The recovery can be performed by multiple different\ndecoders, however most of them rely on some tuning. Given an estimate for the\nnoise level a common convex approach to recover the signal is basis pursuit\ndenoising. If the measurement matrix has the robust null space property with\nrespect to the $\\ell_2$-norm, basis pursuit denoising obeys stable and robust\nrecovery guarantees. In the case of unknown noise levels, nonnegative least\nsquares recovers non-negative signals if the measurement matrix fulfills an\nadditional property (sometimes called the $M^+$-criterion). However, if the\nmeasurement matrix is the biadjacency matrix of a random left regular bipartite\ngraph it obeys with a high probability the null space property with respect to\nthe $\\ell_1$-norm with optimal parameters. Therefore, we discuss non-negative\nleast absolute deviation (NNLAD). For these measurement matrices, we prove a\nuniform, stable and robust recovery guarantee without the need for tuning. Such\nguarantees are important, since binary expander matrices are sparse and thus\nallow for fast sketching and recovery. We will further present a method to\nsolve the NNLAD numerically and show that this is comparable to state of the\nart methods. Lastly, we explain how the NNLAD can be used for viral detection\nin the recent COVID-19 crisis.\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2020 18:03:45 GMT"}, {"version": "v2", "created": "Tue, 6 Oct 2020 10:14:54 GMT"}], "update_date": "2020-10-07", "authors_parsed": [["Petersen", "Hendrik Bernd", ""], ["Bah", "Bubacarr", ""], ["Jung", "Peter", ""]]}, {"id": "2003.13503", "submitter": "Prajoy Podder", "authors": "Aditya Khamparia, Subrato Bharati, Prajoy Podder, Deepak Gupta, Ashish\n  Khanna, Thai Kim Phung, Dang N. H. Thanh", "title": "Diagnosis of Breast Cancer Based on Modern Mammography using Hybrid\n  Transfer Learning", "comments": "24 pages, 11 figures", "journal-ref": "Multidimensional Systems and Signal Processing, 2021", "doi": "10.1007/s11045-020-00756-7", "report-no": null, "categories": "eess.IV cs.CV cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Breast cancer is a common cancer for women. Early detection of breast cancer\ncan considerably increase the survival rate of women. This paper mainly focuses\non transfer learning process to detect breast cancer. Modified VGG (MVGG),\nresidual network, mobile network is proposed and implemented in this paper.\nDDSM dataset is used in this paper. Experimental results show that our proposed\nhybrid transfers learning model (Fusion of MVGG16 and ImageNet) provides an\naccuracy of 88.3% where the number of epoch is 15. On the other hand, only\nmodified VGG 16 architecture (MVGG 16) provides an accuracy 80.8% and MobileNet\nprovides an accuracy of 77.2%. So, it is clearly stated that the proposed\nhybrid pre-trained network outperforms well compared to single architecture.\nThis architecture can be considered as an effective tool for the radiologists\nin order to reduce the false negative and false positive rate. Therefore, the\nefficiency of mammography analysis will be improved.\n", "versions": [{"version": "v1", "created": "Mon, 23 Mar 2020 05:16:34 GMT"}, {"version": "v2", "created": "Wed, 20 May 2020 05:39:57 GMT"}, {"version": "v3", "created": "Wed, 27 May 2020 05:53:17 GMT"}], "update_date": "2021-01-13", "authors_parsed": [["Khamparia", "Aditya", ""], ["Bharati", "Subrato", ""], ["Podder", "Prajoy", ""], ["Gupta", "Deepak", ""], ["Khanna", "Ashish", ""], ["Phung", "Thai Kim", ""], ["Thanh", "Dang N. H.", ""]]}, {"id": "2003.13537", "submitter": "Jose F. Ruiz-Munoz", "authors": "Jose F. Ruiz-Munoz, Jyothier K. Nimmagadda, Tyler G. Dowd, and James\n  E. Baciak, Alina Zare", "title": "Super Resolution for Root Imaging", "comments": "Under review. Submitted to Applications in Plant Sciences (APPS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High-resolution cameras have become very helpful for plant phenotyping by\nproviding a mechanism for tasks such as target versus background\ndiscrimination, and the measurement and analysis of fine-above-ground plant\nattributes. However, the acquisition of high-resolution (HR) imagery of plant\nroots is more challenging than above-ground data collection. Thus, an effective\nsuper-resolution (SR) algorithm is desired for overcoming resolution\nlimitations of sensors, reducing storage space requirements, and boosting the\nperformance of later analysis, such as automatic segmentation. We propose a SR\nframework for enhancing images of plant roots by using convolutional neural\nnetworks (CNNs). We compare three alternatives for training the SR model: i)\ntraining with non-plant-root images, ii) training with plant-root images, and\niii) pretraining the model with non-plant-root images and fine-tuning with\nplant-root images. We demonstrate on a collection of publicly available\ndatasets that the SR models outperform the basic bicubic interpolation even\nwhen trained with non-root datasets. Also, our segmentation experiments show\nthat high performance on this task can be achieved independently of the SNR.\nTherefore, we conclude that the quality of the image enhancement depends on the\napplication.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 15:11:15 GMT"}, {"version": "v2", "created": "Tue, 5 May 2020 12:23:36 GMT"}], "update_date": "2020-05-06", "authors_parsed": [["Ruiz-Munoz", "Jose F.", ""], ["Nimmagadda", "Jyothier K.", ""], ["Dowd", "Tyler G.", ""], ["Baciak", "James E.", ""], ["Zare", "Alina", ""]]}, {"id": "2003.13634", "submitter": "Thorsten Pr\\\"ustel", "authors": "Thorsten Pr\\\"ustel and Martin Meier-Schellersheim", "title": "Stochastic single-particle based simulations of cellular signaling\n  embedded into computational models of cellular morphology", "comments": "26 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Cells exhibit a wide variety of different shapes. This diversity poses a\nchallenge for computational approaches that attempt to shed light on the role\ncell geometry plays in regulating cell physiology and behavior. The simulation\nplatform Simmune is capable of embedding the computational representation of\nsignaling pathways into realistic models of cellular morphology. However,\nSimmune's current approach to account for the cell geometry is limited to\ndeterministic models of reaction-diffusion processes, thus providing a\ncoarse-grained description that ignores stochastic local fluctuations. Here we\npresent an extension of Simmune that removes these limitations by employing an\nalternative computational representation of cellular geometry that is smooth\nand grid-free. These features make it possible to incorporate a fully\nstochastic, spatially resolved description of the cellular biochemistry. The\nalternative computational representation is compatible with Simmune's current\napproach for specifying molecular interactions. This means that a modeler using\nthe approach needs to create a model of cellular biochemistry and morphology\nonly once to be able to use it for both, deterministic and stochastic\nsimulations.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 17:10:04 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Prüstel", "Thorsten", ""], ["Meier-Schellersheim", "Martin", ""]]}, {"id": "2003.13733", "submitter": "Chen Li", "authors": "Qiyuan Fu, Sean W. Gart, Thomas W. Mitchel, Jin Seob Kim, Gregory S.\n  Chirikjian, Chen Li", "title": "Lateral oscillation and body compliance help snakes and snake robots\n  stably traverse large, smooth obstacles", "comments": null, "journal-ref": "Integrative and Comparative Biology (2020), 60 (1), 171", "doi": "10.1093/icb/icaa013", "report-no": null, "categories": "physics.bio-ph cs.SY eess.SY q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Snakes can move through almost any terrain. Similarly, snake robots hold the\npromise as a versatile platform to traverse complex environments like\nearthquake rubble. Unlike snake locomotion on flat surfaces which is inherently\nstable, when snakes traverse complex terrain by deforming their body out of\nplane, it becomes challenging to maintain stability. Here, we review our recent\nprogress in understanding how snakes and snake robots traverse large, smooth\nobstacles that lack anchor points for gripping or bracing. First, we discovered\nthat the generalist variable kingsnake combines lateral oscillation and\ncantilevering. Regardless of step height and surface friction, the overall gait\nis preserved. Next, to quantify static stability of the snake, we developed a\nmethod to interpolate continuous body in three dimensions (both position and\norientation) between discrete tracked markers. By analyzing the base of support\nusing the interpolated continuous body 3-D kinematics, we discovered that the\nsnake maintained perfect stability during traversal, even on the most\nchallenging low friction, high step. Finally, we applied this gait to a snake\nrobot and systematically tested its performance traversing large steps with\nvariable heights to further understand stability principles. The robot rapidly\nand stably traversed steps nearly as high as a third of its body length. As\nstep height increased, the robot rolled more frequently to the extent of\nflipping over, reducing traversal probability. The absence of such failure in\nthe snake with a compliant body inspired us to add body compliance to the\nrobot. With better surface contact, the compliant body robot suffered less roll\ninstability and traversed high steps at higher probability, without sacrificing\ntraversal speed. Our robot traversed large step-like obstacles more rapidly\nthan most previous snake robots, approaching that of the animal.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 18:30:13 GMT"}], "update_date": "2020-09-04", "authors_parsed": [["Fu", "Qiyuan", ""], ["Gart", "Sean W.", ""], ["Mitchel", "Thomas W.", ""], ["Kim", "Jin Seob", ""], ["Chirikjian", "Gregory S.", ""], ["Li", "Chen", ""]]}, {"id": "2003.13754", "submitter": "Connor Coley", "authors": "Connor W. Coley, Natalie S. Eyke, Klavs F. Jensen", "title": "Autonomous discovery in the chemical sciences part I: Progress", "comments": "Revised version available at 10.1002/anie.201909987", "journal-ref": null, "doi": "10.1002/anie.201909987", "report-no": null, "categories": "q-bio.QM cs.AI cs.RO stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This two-part review examines how automation has contributed to different\naspects of discovery in the chemical sciences. In this first part, we describe\na classification for discoveries of physical matter (molecules, materials,\ndevices), processes, and models and how they are unified as search problems. We\nthen introduce a set of questions and considerations relevant to assessing the\nextent of autonomy. Finally, we describe many case studies of discoveries\naccelerated by or resulting from computer assistance and automation from the\ndomains of synthetic chemistry, drug discovery, inorganic chemistry, and\nmaterials science. These illustrate how rapid advancements in hardware\nautomation and machine learning continue to transform the nature of\nexperimentation and modelling.\n  Part two reflects on these case studies and identifies a set of open\nchallenges for the field.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 19:11:31 GMT"}], "update_date": "2020-04-01", "authors_parsed": [["Coley", "Connor W.", ""], ["Eyke", "Natalie S.", ""], ["Jensen", "Klavs F.", ""]]}, {"id": "2003.13755", "submitter": "Connor Coley", "authors": "Connor W. Coley, Natalie S. Eyke, Klavs F. Jensen", "title": "Autonomous discovery in the chemical sciences part II: Outlook", "comments": "Revised version available at 10.1002/anie.201909989", "journal-ref": null, "doi": "10.1002/anie.201909989", "report-no": null, "categories": "q-bio.QM cs.AI cs.RO stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This two-part review examines how automation has contributed to different\naspects of discovery in the chemical sciences. In this second part, we reflect\non a selection of exemplary studies. It is increasingly important to articulate\nwhat the role of automation and computation has been in the scientific process\nand how that has or has not accelerated discovery. One can argue that even the\nbest automated systems have yet to ``discover'' despite being incredibly useful\nas laboratory assistants. We must carefully consider how they have been and can\nbe applied to future problems of chemical discovery in order to effectively\ndesign and interact with future autonomous platforms.\n  The majority of this article defines a large set of open research directions,\nincluding improving our ability to work with complex data, build empirical\nmodels, automate both physical and computational experiments for validation,\nselect experiments, and evaluate whether we are making progress toward the\nultimate goal of autonomous discovery. Addressing these practical and\nmethodological challenges will greatly advance the extent to which autonomous\nsystems can make meaningful discoveries.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 19:11:35 GMT"}], "update_date": "2020-04-01", "authors_parsed": [["Coley", "Connor W.", ""], ["Eyke", "Natalie S.", ""], ["Jensen", "Klavs F.", ""]]}, {"id": "2003.13822", "submitter": "Avleen S. Bijral", "authors": "Stefan Wojcik, Avleen Bijral, Richard Johnston, Juan Miguel Lavista,\n  Gary King, Ryan Kennedy, Alessandro Vespignani and David Lazer", "title": "Survey Data and Human Computation for Improved Flu Tracking", "comments": null, "journal-ref": null, "doi": "10.1038/s41467-020-20206-z", "report-no": null, "categories": "stat.AP q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While digital trace data from sources like search engines hold enormous\npotential for tracking and understanding human behavior, these streams of data\nlack information about the actual experiences of those individuals generating\nthe data. Moreover, most current methods ignore or under-utilize human\nprocessing capabilities that allow humans to solve problems not yet solvable by\ncomputers (human computation). We demonstrate how behavioral research, linking\ndigital and real-world behavior, along with human computation, can be utilized\nto improve the performance of studies using digital data streams. This study\nlooks at the use of search data to track prevalence of Influenza-Like Illness\n(ILI). We build a behavioral model of flu search based on survey data linked to\nusers online browsing data. We then utilize human computation for classifying\nsearch strings. Leveraging these resources, we construct a tracking model of\nILI prevalence that outperforms strong historical benchmarks using only a\nlimited stream of search data and lends itself to tracking ILI in smaller\ngeographic units. While this paper only addresses searches related to ILI, the\nmethod we describe has potential for tracking a broad set of phenomena in near\nreal-time.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 21:11:29 GMT"}], "update_date": "2021-01-27", "authors_parsed": [["Wojcik", "Stefan", ""], ["Bijral", "Avleen", ""], ["Johnston", "Richard", ""], ["Lavista", "Juan Miguel", ""], ["King", "Gary", ""], ["Kennedy", "Ryan", ""], ["Vespignani", "Alessandro", ""], ["Lazer", "David", ""]]}, {"id": "2003.13825", "submitter": "Daniel Levenstein", "authors": "Daniel Levenstein, Veronica A. Alvarez, Asohan Amarasingham, Habiba\n  Azab, Richard C. Gerkin, Andrea Hasenstaub, Ramakrishnan Iyer, Renaud B.\n  Jolivet, Sarah Marzen, Joseph D. Monaco, Astrid A. Prinz, Salma Quraishi,\n  Fidel Santamaria, Sabyasachi Shivkumar, Matthew F. Singh, David B. Stockton,\n  Roger Traub, Horacio G. Rotstein, Farzan Nadim, A. David Redish", "title": "On the role of theory and modeling in neuroscience", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In recent years, the field of neuroscience has gone through rapid\nexperimental advances and extensive use of quantitative and computational\nmethods. This accelerating growth has created a need for methodological\nanalysis of the role of theory and the modeling approaches currently used in\nthis field. Toward that end, we start from the general view that the primary\nrole of science is to solve empirical problems, and that it does so by\ndeveloping theories that can account for phenomena within their domain of\napplication. We propose a commonly-used set of terms - descriptive,\nmechanistic, and normative - as methodological designations that refer to the\nkind of problem a theory is intended to solve. Further, we find that models of\neach kind play distinct roles in defining and bridging the multiple levels of\nabstraction necessary to account for any neuroscientific phenomenon. We then\ndiscuss how models play an important role to connect theory and experiment, and\nnote the importance of well-defined translation functions between them.\nFurthermore, we describe how models themselves can be used as a form of\nexperiment to test and develop theories. This report is the summary of a\ndiscussion initiated at the conference Present and Future Theoretical\nFrameworks in Neuroscience, which we hope will contribute to a much-needed\ndiscussion in the neuroscientific community.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 21:21:59 GMT"}, {"version": "v2", "created": "Wed, 1 Apr 2020 12:40:28 GMT"}], "update_date": "2020-04-02", "authors_parsed": [["Levenstein", "Daniel", ""], ["Alvarez", "Veronica A.", ""], ["Amarasingham", "Asohan", ""], ["Azab", "Habiba", ""], ["Gerkin", "Richard C.", ""], ["Hasenstaub", "Andrea", ""], ["Iyer", "Ramakrishnan", ""], ["Jolivet", "Renaud B.", ""], ["Marzen", "Sarah", ""], ["Monaco", "Joseph D.", ""], ["Prinz", "Astrid A.", ""], ["Quraishi", "Salma", ""], ["Santamaria", "Fidel", ""], ["Shivkumar", "Sabyasachi", ""], ["Singh", "Matthew F.", ""], ["Stockton", "David B.", ""], ["Traub", "Roger", ""], ["Rotstein", "Horacio G.", ""], ["Nadim", "Farzan", ""], ["Redish", "A. David", ""]]}, {"id": "2003.13902", "submitter": "Xuan Lin", "authors": "Xuan Lin", "title": "DeepGS: Deep Representation Learning of Graphs and Sequences for\n  Drug-Target Binding Affinity Prediction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Accurately predicting drug-target binding affinity (DTA) in silico is a key\ntask in drug discovery. Most of the conventional DTA prediction methods are\nsimulation-based, which rely heavily on domain knowledge or the assumption of\nhaving the 3D structure of the targets, which are often difficult to obtain.\nMeanwhile, traditional machine learning-based methods apply various features\nand descriptors, and simply depend on the similarities between drug-target\npairs. Recently, with the increasing amount of affinity data available and the\nsuccess of deep representation learning models on various domains, deep\nlearning techniques have been applied to DTA prediction. However, these methods\nconsider either label/one-hot encodings or the topological structure of\nmolecules, without considering the local chemical context of amino acids and\nSMILES sequences. Motivated by this, we propose a novel end-to-end learning\nframework, called DeepGS, which uses deep neural networks to extract the local\nchemical context from amino acids and SMILES sequences, as well as the\nmolecular structure from the drugs. To assist the operations on the symbolic\ndata, we propose to use advanced embedding techniques (i.e., Smi2Vec and\nProt2Vec) to encode the amino acids and SMILES sequences to a distributed\nrepresentation. Meanwhile, we suggest a new molecular structure modeling\napproach that works well under our framework. We have conducted extensive\nexperiments to compare our proposed method with state-of-the-art models\nincluding KronRLS, SimBoost, DeepDTA and DeepCPI. Extensive experimental\nresults demonstrate the superiorities and competitiveness of DeepGS.\n", "versions": [{"version": "v1", "created": "Tue, 31 Mar 2020 01:35:39 GMT"}, {"version": "v2", "created": "Fri, 3 Apr 2020 07:28:11 GMT"}], "update_date": "2020-04-06", "authors_parsed": [["Lin", "Xuan", ""]]}, {"id": "2003.14078", "submitter": "Marco Hartl", "authors": "C. Corbella, M. Hartl, M. Fernandez-gatell, J. Puigagut (Group of\n  environmental engineering and microbiology (GEMMA), Universitat Politecnica\n  de Catalunya - BarcelonaTech)", "title": "MFC-based biosensor for domestic wastewater COD assessment in\n  constructed wetlands", "comments": "46 pages, 14 Figures", "journal-ref": "660, 2019, 218-226", "doi": "10.1016/j.scitotenv.2018.12.347", "report-no": null, "categories": "q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In the context of natural-based wastewater treatment technologies (such as\nconstructed wetlands - CW) the use of a low-cost, continuous-like biosensor\ntool for the assessment of operational conditions is of key importance for\nplant management optimization. The objective of the present study was to assess\nthe potential use of constructed wetland microbial fuel cells (CW-MFC) as a\ndomestic wastewater COD assessment tool. For the purpose of this work four\nlab-scale CW-MFCs were set up and fed with pre-settled domestic wastewater at\ndifferent COD concentrations. Under laboratory conditions two different anodic\nmaterials were tested (graphite rods and gravel). Furthermore, a pilot-plant\nbased experiment was also conducted to confirm the findings previously recorded\nfor lab-scale experiments. Results showed that in spite of the low coulombic\nefficiencies recorded, either gravel or graphite-based anodes were suitable for\nthe purposes of domestic wastewater COD assessment. Significant linear\nrelationships could be established between inlet COD concentrations and CW-MFC\nEcell whenever contact time was above 10 hours. Results also showed that the\naccuracy of the CW-MFC was greatly compromised after several weeks of\noperation. Pilot experiments showed that CW-MFC presents a good bio-indication\nresponse between week 3 and 7 of operation (equivalent to an accumulated\norganic loading between 100 and 200 g COD/m2, respectively). Main conclusion of\nthis work is that of CW-MFC could be used as an \"alarm-tool\" for qualitative\ncontinuous influent water quality assessment rather than a precise COD\nassessment tool due to a loss of precision after several weeks of operation.\n", "versions": [{"version": "v1", "created": "Tue, 31 Mar 2020 10:30:42 GMT"}], "update_date": "2020-04-01", "authors_parsed": [["Corbella", "C.", "", "Group of\n  environmental engineering and microbiology"], ["Hartl", "M.", "", "Group of\n  environmental engineering and microbiology"], ["Fernandez-gatell", "M.", "", "Group of\n  environmental engineering and microbiology"], ["Puigagut", "J.", "", "Group of\n  environmental engineering and microbiology"]]}, {"id": "2003.14283", "submitter": "Martin Spousta", "authors": "Martin Spousta", "title": "Parametric analysis of COVID-19 expansion in European countries in the\n  period of February to June 2020", "comments": "Rejected by a high-profile bio-math journal due to missing comparison\n  with established SIR models and due to insufficient medical impact of the\n  study. Unpublished", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.soc-ph q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The data on number of registered cases of COVID-19 disease in twenty European\ncountries is analyzed by the least-squares fitting procedure with generic\nanalytic functions. Three regimes of the expansion of the disease are\nidentified and quantified -- early exponential expansion, damped exponential,\nand linear expansion. Differences among countries in the early expansion period\nare quantified. The velocity of the expansion in the exponential regime lies\nwithin one standard deviation from the average value for 11 countries. The\nnumber of infected individuals at the initial time is excessively high for\nItaly, 7 standard deviations from the average value.\n  Method for predicting the expansion based on extrapolation in the parametric\nspace is presented. One-week predictions based on extrapolations have average\nprecision of 18% and 29% during the later period of the damped exponential\nexpansion for the case of Italy and Czechia, respectively. The method based on\nextrapolations in the parametric space may provide an elementary method to\nquantify the impact of restrictive measures on the spreading of the disease.\n", "versions": [{"version": "v1", "created": "Tue, 31 Mar 2020 15:14:05 GMT"}, {"version": "v2", "created": "Mon, 26 Apr 2021 12:16:53 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Spousta", "Martin", ""]]}]