[{"id": "0806.0036", "submitter": "Mahdi Ramezani", "authors": "Ali Sanaei, Mahdi Ramezani, and Masoud Ardakani", "title": "On the Design of Universal LDPC Codes", "comments": "5 pages, 2 figures, To appear in Proc. IEEE International Symposium\n  on Information Theory (ISIT 2008), Toronto, Canada, July 2008", "journal-ref": null, "doi": "10.1109/ISIT.2008.4595097", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Low-density parity-check (LDPC) coding for a multitude of equal-capacity\nchannels is studied. First, based on numerous observations, a conjecture is\nstated that when the belief propagation decoder converges on a set of\nequal-capacity channels, it would also converge on any convex combination of\nthose channels. Then, it is proved that when the stability condition is\nsatisfied for a number of channels, it is also satisfied for any channel in\ntheir convex hull. For the purpose of code design, a method is proposed which\ncan decompose every symmetric channel with capacity C into a set of\nidentical-capacity basis channels. We expect codes that work on the basis\nchannels to be suitable for any channel with capacity C. Such codes are found\nand in comparison with existing LDPC codes that are designed for specific\nchannels, our codes obtain considerable coding gains when used across a\nmultitude of channels.\n", "versions": [{"version": "v1", "created": "Fri, 30 May 2008 22:03:00 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Sanaei", "Ali", ""], ["Ramezani", "Mahdi", ""], ["Ardakani", "Masoud", ""]]}, {"id": "0806.0080", "submitter": "Ravi  Tandon", "authors": "Ravi Tandon, Sennur Ulukus", "title": "Outer Bounds for Multiple Access Channels with Feedback using Dependence\n  Balance", "comments": "submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2009.2027532", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use the idea of dependence balance to obtain a new outer bound for the\ncapacity region of the discrete memoryless multiple access channel with\nnoiseless feedback (MAC-FB). We consider a binary additive noisy MAC-FB whose\nfeedback capacity is not known. The binary additive noisy MAC considered in\nthis paper can be viewed as the discrete counterpart of the Gaussian MAC-FB.\nOzarow established that the capacity region of the two-user Gaussian MAC-FB is\ngiven by the cut-set bound. Our result shows that for the discrete version of\nthe channel considered by Ozarow, this is not the case. Direct evaluation of\nour outer bound is intractable due to an involved auxiliary random variable\nwhose large cardinality prohibits an exhaustive search. We overcome this\ndifficulty by using functional analysis to explicitly evaluate our outer bound.\nOur outer bound is strictly less than the cut-set bound at all points on the\ncapacity region where feedback increases capacity. In addition, we explicitly\nevaluate the Cover-Leung achievable rate region for the binary additive noisy\nMAC-FB in consideration. Furthermore, using the tools developed for the\nevaluation of our outer bound, we also explicitly characterize the boundary of\nthe feedback capacity region of the binary erasure MAC, for which the\nCover-Leung achievable rate region is known to be tight. This last result\nconfirms that the feedback strategies developed by Kramer for the binary\nerasure MAC are capacity achieving.\n", "versions": [{"version": "v1", "created": "Sat, 31 May 2008 15:21:31 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Tandon", "Ravi", ""], ["Ulukus", "Sennur", ""]]}, {"id": "0806.0142", "submitter": "Nina Filimonova", "authors": "N. A. Filimonova", "title": "Regularization of Invers Problem for M-Ary Channel", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of computation of parameters of m-ary channel is considered. It\nis demonstrated that although the problem is ill-posed, it is possible turning\nof the parameters of the system and transform the problem to well-posed one.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jun 2008 11:42:20 GMT"}], "update_date": "2008-06-03", "authors_parsed": [["Filimonova", "N. A.", ""]]}, {"id": "0806.0283", "submitter": "Dmitry Lande", "authors": "D.V. Lande", "title": "Model of information diffusion", "comments": "5 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The system of cellular automata, which expresses the process of dissemination\nand publication of the news among separate information resources, has been\ndescribed. A bell-shaped dependence of news diffusion on internet-sources\n(web-sites) coheres well with a real behavior of thematic data flows, and at\nlocal time spans - with noted models, e.g., exponential and logistic ones.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2008 14:22:41 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Lande", "D. V.", ""]]}, {"id": "0806.0562", "submitter": "Dominique Bontemps", "authors": "Dominique Bontemps (LM-Orsay)", "title": "Universal Coding on Infinite Alphabets: Exponentially Decreasing\n  Envelopes", "comments": null, "journal-ref": "IEEE Transactions on Information Theory 57, 3 (2011) 1466 - 1478", "doi": "10.1109/TIT.2010.2103831", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the problem of universal lossless coding on a countable\ninfinite alphabet. It focuses on some classes of sources defined by an envelope\ncondition on the marginal distribution, namely exponentially decreasing\nenvelope classes with exponent $\\alpha$. The minimax redundancy of\nexponentially decreasing envelope classes is proved to be equivalent to\n$\\frac{1}{4 \\alpha \\log e} \\log^2 n$. Then a coding strategy is proposed, with\na Bayes redundancy equivalent to the maximin redundancy. At last, an adaptive\nalgorithm is provided, whose redundancy is equivalent to the minimax redundancy\n", "versions": [{"version": "v1", "created": "Tue, 3 Jun 2008 14:46:29 GMT"}, {"version": "v2", "created": "Mon, 31 May 2010 08:27:58 GMT"}], "update_date": "2011-07-07", "authors_parsed": [["Bontemps", "Dominique", "", "LM-Orsay"]]}, {"id": "0806.0579", "submitter": "Michael Fleyer", "authors": "Michael Fleyer, Amir Rosenthal, Alex Linden, and Moshe Horowitz", "title": "Multirate Synchronous Sampling of Sparse Multiband Signals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances in optical systems make them ideal for undersampling\nmultiband signals that have high bandwidths. In this paper we propose a new\nscheme for reconstructing multiband sparse signals using a small number of\nsampling channels. The scheme, which we call synchronous multirate sampling\n(SMRS), entails gathering samples synchronously at few different rates whose\nsum is significantly lower than the Nyquist sampling rate. The signals are\nreconstructed by solving a system of linear equations. We have demonstrated an\naccurate and robust reconstruction of signals using a small number of sampling\nchannels that operate at relatively high rates. Sampling at higher rates\nincreases the signal to noise ratio in samples. The SMRS scheme enables a\nsignificant reduction in the number of channels required when the sampling rate\nincreases. We have demonstrated, using only three sampling channels, an\naccurate sampling and reconstruction of 4 real signals (8 bands). The matrices\nthat are used to reconstruct the signals in the SMRS scheme also have low\ncondition numbers. This indicates that the SMRS scheme is robust to noise in\nsignals. The success of the SMRS scheme relies on the assumption that the\nsampled signals are sparse. As a result most of the sampled spectrum may be\nunaliased in at least one of the sampling channels. This is in contrast to\nmulticoset sampling schemes in which an alias in one channel is equivalent to\nan alias in all channels. We have demonstrated that the SMRS scheme obtains\nsimilar performance using 3 sampling channels and a total sampling rate 8 times\nthe Landau rate to an implementation of a multicoset sampling scheme that uses\n6 sampling channels with a total sampling rate of 13 times the Landau rate.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jun 2008 16:52:25 GMT"}], "update_date": "2008-06-04", "authors_parsed": [["Fleyer", "Michael", ""], ["Rosenthal", "Amir", ""], ["Linden", "Alex", ""], ["Horowitz", "Moshe", ""]]}, {"id": "0806.0604", "submitter": "Wei Wang", "authors": "Wei Wang, Martin J. Wainwright, Kannan Ramchandran", "title": "Information-theoretic limits on sparse signal recovery: Dense versus\n  sparse measurement matrices", "comments": "Appeared as UC Berkeley, Department of Statistics, Technical Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the information-theoretic limits of exactly recovering the support\nof a sparse signal using noisy projections defined by various classes of\nmeasurement matrices. Our analysis is high-dimensional in nature, in which the\nnumber of observations $n$, the ambient signal dimension $p$, and the signal\nsparsity $k$ are all allowed to tend to infinity in a general manner. This\npaper makes two novel contributions. First, we provide sharper necessary\nconditions for exact support recovery using general (non-Gaussian) dense\nmeasurement matrices. Combined with previously known sufficient conditions,\nthis result yields sharp characterizations of when the optimal decoder can\nrecover a signal for various scalings of the sparsity $k$ and sample size $n$,\nincluding the important special case of linear sparsity ($k = \\Theta(p)$) using\na linear scaling of observations ($n = \\Theta(p)$). Our second contribution is\nto prove necessary conditions on the number of observations $n$ required for\nasymptotically reliable recovery using a class of $\\gamma$-sparsified\nmeasurement matrices, where the measurement sparsity $\\gamma(n, p, k) \\in\n(0,1]$ corresponds to the fraction of non-zero entries per row. Our analysis\nallows general scaling of the quadruplet $(n, p, k, \\gamma)$, and reveals three\ndifferent regimes, corresponding to whether measurement sparsity has no effect,\na minor effect, or a dramatic effect on the information-theoretic limits of the\nsubset recovery problem.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jun 2008 18:29:00 GMT"}], "update_date": "2008-06-04", "authors_parsed": [["Wang", "Wei", ""], ["Wainwright", "Martin J.", ""], ["Ramchandran", "Kannan", ""]]}, {"id": "0806.0676", "submitter": "Rui Zhang", "authors": "Rui Zhang", "title": "On Peak versus Average Interference Power Constraints for Protecting\n  Primary Users in Cognitive Radio Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers spectrum sharing for wireless communication between a\ncognitive radio (CR) link and a primary radio (PR) link. It is assumed that the\nCR protects the PR transmission by applying the so-called\ninterference-temperature constraint, whereby the CR is allowed to transmit\nregardless of the PR's on/off status provided that the resultant interference\npower level at the PR receiver is kept below some predefined threshold. For the\nfading PR and CR channels, the interference-power constraint at the PR receiver\nis usually one of the following two types: One is to regulate the average\ninterference power (AIP) over all the fading states, while the other is to\nlimit the peak interference power (PIP) at each fading state. From the CR's\nperspective, given the same average and peak power threshold, the AIP\nconstraint is more favorable than the PIP counterpart because of its more\nflexibility for dynamically allocating transmit powers over the fading states.\nOn the contrary, from the perspective of protecting the PR, the more\nrestrictive PIP constraint appears at a first glance to be a better option than\nthe AIP. Some surprisingly, this paper shows that in terms of various forms of\ncapacity limits achievable for the PR fading channel, e.g., the ergodic and\noutage capacities, the AIP constraint is also superior over the PIP. This\nresult is based upon an interesting interference diversity phenomenon, i.e.,\nrandomized interference powers over the fading states in the AIP case are more\nadvantageous over deterministic ones in the PIP case for minimizing the\nresultant PR capacity losses. Therefore, the AIP constraint results in larger\nfading channel capacities than the PIP for both the CR and PR transmissions.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jun 2008 01:33:57 GMT"}, {"version": "v2", "created": "Fri, 12 Sep 2008 07:33:08 GMT"}], "update_date": "2008-09-12", "authors_parsed": [["Zhang", "Rui", ""]]}, {"id": "0806.0837", "submitter": "Leonid Reyzin", "authors": "Nenad Dedi\\'c, Gene Itkis, Leonid Reyzin, Scott Russell", "title": "Upper and Lower Bounds on Black-Box Steganography", "comments": "27 pages; to be published in Journal of Cryptology", "journal-ref": null, "doi": "10.1007/s00145-008-9020-3", "report-no": null, "categories": "cs.CR cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the limitations of steganography when the sender is not using any\nproperties of the underlying channel beyond its entropy and the ability to\nsample from it. On the negative side, we show that the number of samples the\nsender must obtain from the channel is exponential in the rate of the\nstegosystem. On the positive side, we present the first secret-key stegosystem\nthat essentially matches this lower bound regardless of the entropy of the\nunderlying channel. Furthermore, for high-entropy channels, we present the\nfirst secret-key stegosystem that matches this lower bound statelessly (i.e.,\nwithout requiring synchronized state between sender and receiver).\n", "versions": [{"version": "v1", "created": "Wed, 4 Jun 2008 19:07:48 GMT"}], "update_date": "2008-06-05", "authors_parsed": [["Dedić", "Nenad", ""], ["Itkis", "Gene", ""], ["Reyzin", "Leonid", ""], ["Russell", "Scott", ""]]}, {"id": "0806.0838", "submitter": "Javad Kazemitabar", "authors": "Javad Kazemitabar and Hamid Jafarkhani", "title": "Performance Analysis of Multiple Antenna Multi-User Detection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive the diversity order of some multiple antenna multi-user\ncancellation and detection schemes. The common property of these detection\nmethods is the usage of Alamouti and quasi-orthogonal space-time block codes.\nFor detecting $J$ users each having $N$ transmit antennas, these schemes\nrequire only $J$ antennas at the receiver. Our analysis shows that when having\n$M$ receive antennas, the array-processing schemes provide the diversity order\nof $N(M-J+1)$. In addition, our results prove that regardless of the number of\nusers or receive antennas, when using maximum-likelihood decoding we get the\nfull transmit and receive diversities, i.e. $NM$, similar to the\nno-interference scenario.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jun 2008 19:13:59 GMT"}], "update_date": "2008-06-05", "authors_parsed": [["Kazemitabar", "Javad", ""], ["Jafarkhani", "Hamid", ""]]}, {"id": "0806.0903", "submitter": "Ming-Yang Chen", "authors": "Shao-Lun Huang, Ming-Yang Chen, Kwang-Cheng Chen, John M. Cioffi", "title": "On the Capacity of Gaussian Relay Channels", "comments": "This article has been withdrawn", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn due to that the same conclusion has been\nproposed before.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2008 07:39:04 GMT"}, {"version": "v2", "created": "Tue, 10 Jun 2008 22:42:12 GMT"}], "update_date": "2008-06-11", "authors_parsed": [["Huang", "Shao-Lun", ""], ["Chen", "Ming-Yang", ""], ["Chen", "Kwang-Cheng", ""], ["Cioffi", "John M.", ""]]}, {"id": "0806.0905", "submitter": "Himal Suraweera Dr.", "authors": "Himal A. Suraweera, Jason Gao, Peter J. Smith, Mansoor Shafi and\n  Michael Faulkner", "title": "Channel Capacity Limits of Cognitive Radio in Asymmetric Fading\n  Environments", "comments": "6 pages, 8 figures, in Proceedings of IEEE International Conference\n  on Communications (ICC 2008), Beijing, China, May 19-23, 2008", "journal-ref": null, "doi": "10.1109/ICC.2008.760", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cognitive radio technology is an innovative radio design concept which aims\nto increase spectrum utilization by exploiting unused spectrum in dynamically\nchanging environments. By extending previous results, we investigate the\ncapacity gains achievable with this dynamic spectrum approach in asymmetric\nfading channels. More specifically, we allow the secondary-to-primary and\nsecondary-to-secondary user channels to undergo Rayleigh or Rician fading, with\narbitrary link power. In order to compute the capacity, we derive the\ndistributions of ratios of Rayleigh and Rician variables. Compared to the\nsymmetric fading scenario, our results indicate several interesting features of\nthe capacity behaviour under both average and peak received power constraints.\nFinally, the impact of multiple primary users on the capacity under asymmetric\nfading has also been studied.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2008 07:51:07 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Suraweera", "Himal A.", ""], ["Gao", "Jason", ""], ["Smith", "Peter J.", ""], ["Shafi", "Mansoor", ""], ["Faulkner", "Michael", ""]]}, {"id": "0806.0909", "submitter": "Martin Haenggi", "authors": "Martin Haenggi", "title": "Outage and Local Throughput and Capacity of Random Wireless Networks", "comments": "22 pages, 6 figures. Submitted to IEEE Trans. Wireless", "journal-ref": null, "doi": "10.1109/TWC.2009.090105", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Outage probabilities and single-hop throughput are two important performance\nmetrics that have been evaluated for certain specific types of wireless\nnetworks. However, there is a lack of comprehensive results for larger classes\nof networks, and there is no systematic approach that permits the convenient\ncomparison of the performance of networks with different geometries and levels\nof randomness.\n  The uncertainty cube is introduced to categorize the uncertainty present in a\nnetwork. The three axes of the cube represent the three main potential sources\nof uncertainty in interference-limited networks: the node distribution, the\nchannel gains (fading), and the channel access (set of transmitting nodes). For\nthe performance analysis, a new parameter, the so-called {\\em spatial\ncontention}, is defined. It measures the slope of the outage probability in an\nALOHA network as a function of the transmit probability $p$ at $p=0$. Outage is\ndefined as the event that the signal-to-interference ratio (SIR) is below a\ncertain threshold in a given time slot. It is shown that the spatial contention\nis sufficient to characterize outage and throughput in large classes of\nwireless networks, corresponding to different positions on the uncertainty\ncube. Existing results are placed in this framework, and new ones are derived.\n  Further, interpreting the outage probability as the SIR distribution, the\nergodic capacity of unit-distance links is determined and compared to the\nthroughput achievable for fixed (yet optimized) transmission rates.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2008 06:15:38 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Haenggi", "Martin", ""]]}, {"id": "0806.1062", "submitter": "Hamidreza Farmanbar", "authors": "Hamid Farmanbar and Amir K. Khandani", "title": "Capacity of Block-Memoryless Channels with Causal Channel Side\n  Information", "comments": "8 pages, submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity of a time-varying block-memoryless channel in which the\ntransmitter and the receiver have access to (possibly different) noisy causal\nchannel side information (CSI) is obtained. It is shown that the capacity\nformula obtained in this correspondence reduces to the capacity formula\nreported in \\cite{Gold07} for the special case where the transmitter CSI is a\ndeterministic function of the receiver CSI.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2008 21:38:56 GMT"}], "update_date": "2008-06-09", "authors_parsed": [["Farmanbar", "Hamid", ""], ["Khandani", "Amir K.", ""]]}, {"id": "0806.1199", "submitter": "Lukas Kroc", "authors": "Michael Chertkov, Lukas Kroc, Massimo Vergassola", "title": "Belief Propagation and Beyond for Particle Tracking", "comments": "8 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": "LA-UR-08-3645", "categories": "cs.IT cond-mat.stat-mech cs.AI cs.LG math.IT physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a novel approach to statistical learning from particles tracked\nwhile moving in a random environment. The problem consists in inferring\nproperties of the environment from recorded snapshots. We consider here the\ncase of a fluid seeded with identical passive particles that diffuse and are\nadvected by a flow. Our approach rests on efficient algorithms to estimate the\nweighted number of possible matchings among particles in two consecutive\nsnapshots, the partition function of the underlying graphical model. The\npartition function is then maximized over the model parameters, namely\ndiffusivity and velocity gradient. A Belief Propagation (BP) scheme is the\nbackbone of our algorithm, providing accurate results for the flow parameters\nwe want to learn. The BP estimate is additionally improved by incorporating\nLoop Series (LS) contributions. For the weighted matching problem, LS is\ncompactly expressed as a Cauchy integral, accurately estimated by a saddle\npoint approximation. Numerical experiments show that the quality of our\nimproved BP algorithm is comparable to the one of a fully polynomial randomized\napproximation scheme, based on the Markov Chain Monte Carlo (MCMC) method,\nwhile the BP-based scheme is substantially faster than the MCMC scheme.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jun 2008 16:18:13 GMT"}], "update_date": "2008-06-09", "authors_parsed": [["Chertkov", "Michael", ""], ["Kroc", "Lukas", ""], ["Vergassola", "Massimo", ""]]}, {"id": "0806.1215", "submitter": "Lav Varshney", "authors": "Lav R. Varshney", "title": "Performance of LDPC Codes Under Faulty Iterative Decoding", "comments": "Revised in May 2010 in response to reviewer comments", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Departing from traditional communication theory where decoding algorithms are\nassumed to perform without error, a system where noise perturbs both\ncomputational devices and communication channels is considered here. This paper\nstudies limits in processing noisy signals with noisy circuits by investigating\nthe effect of noise on standard iterative decoders for low-density parity-check\ncodes. Concentration of decoding performance around its average is shown to\nhold when noise is introduced into message-passing and local computation.\nDensity evolution equations for simple faulty iterative decoders are derived.\nIn one model, computing nonlinear estimation thresholds shows that performance\ndegrades smoothly as decoder noise increases, but arbitrarily small probability\nof error is not achievable. Probability of error may be driven to zero in\nanother system model; the decoding threshold again decreases smoothly with\ndecoder noise. As an application of the methods developed, an achievability\nresult for reliable memory systems constructed from unreliable components is\nprovided.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jun 2008 18:32:08 GMT"}, {"version": "v2", "created": "Sun, 23 Aug 2009 15:36:42 GMT"}, {"version": "v3", "created": "Fri, 28 May 2010 18:13:54 GMT"}], "update_date": "2010-05-31", "authors_parsed": [["Varshney", "Lav R.", ""]]}, {"id": "0806.1231", "submitter": "Francisco Assis", "authors": "F. M. Assis, P. Mateus, Y. Omar", "title": "Improving Classical Authentication with Quantum Communication", "comments": "New improved version, with several clarifications in the text and new\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a quantum-enhanced protocol to authenticate classical messages,\nwith improved security with respect to the classical scheme introduced by\nBrassard in 1983. In that protocol, the shared key is the seed of a\npseudo-random generator (PRG) and a hash function is used to create the\nauthentication tag of a public message. We show that a quantum encoding of\nsecret bits offers more security than the classical XOR function introduced by\nBrassard. Furthermore, we establish the relationship between the bias of a PRG\nand the amount of information about the key that the attacker can retrieve from\na block of authenticated messages. Finally, we prove that quantum resources can\nimprove both the secrecy of the key generated by the PRG and the secrecy of the\ntag obtained with a hidden hash function.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jun 2008 20:37:15 GMT"}, {"version": "v2", "created": "Thu, 11 Feb 2010 23:43:03 GMT"}], "update_date": "2010-02-12", "authors_parsed": [["Assis", "F. M.", ""], ["Mateus", "P.", ""], ["Omar", "Y.", ""]]}, {"id": "0806.1372", "submitter": "Lan Zhang", "authors": "Lan Zhang, Ying-Chang Liang, Yan Xin, H. Vincent Poor", "title": "Robust Cognitive Beamforming With Partial Channel State Information", "comments": "30 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a spectrum sharing based cognitive radio (CR)\ncommunication system, which consists of a secondary user (SU) having multiple\ntransmit antennas and a single receive antenna and a primary user (PU) having a\nsingle receive antenna. The channel state information (CSI) on the link of the\nSU is assumed to be perfectly known at the SU transmitter (SU-Tx). However, due\nto loose cooperation between the SU and the PU, only partial CSI of the link\nbetween the SU-Tx and the PU is available at the SU-Tx. With the partial CSI\nand a prescribed transmit power constraint, our design objective is to\ndetermine the transmit signal covariance matrix that maximizes the rate of the\nSU while keeping the interference power to the PU below a threshold for all the\npossible channel realization within an uncertainty set. This problem, termed\nthe robust cognitive beamforming problem, can be naturally formulated as a\nsemi-infinite programming (SIP) problem with infinitely many constraints. This\nproblem is first transformed into the second order cone programming (SOCP)\nproblem and then solved via a standard interior point algorithm. Then, an\nanalytical solution with much reduced complexity is developed from a geometric\nperspective. It is shown that both algorithms obtain the same optimal solution.\nSimulation examples are presented to validate the effectiveness of the proposed\nalgorithms.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2008 05:30:09 GMT"}, {"version": "v2", "created": "Sun, 4 Jan 2009 12:06:48 GMT"}], "update_date": "2009-01-04", "authors_parsed": [["Zhang", "Lan", ""], ["Liang", "Ying-Chang", ""], ["Xin", "Yan", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0806.1397", "submitter": "Xianmin Feng", "authors": "Xianmin Ming, Jiansheng Yang", "title": "The Improvement of the Bound on Hash Family", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the bound on three kinds of hash family using the\nSingleton bound. To $\\epsilon-U(N; n, m)$ hash family, in the caes of $n>m^2>1$\nand $1\\geq\\epsilon\\geq \\epsilon_1(n, m)$, we get that the new bound is better.\nTo $\\epsilon-\\bigtriangleup U(N; n, m)$ hash family, in the case of $n>m>1$ and\n$1\\geq\\epsilon\\geq\\epsilon_3(n,m)$, the new bound is better. To $\\epsilon-SU(N;\nn, m)$ hash family, in the case of $n>2^m>2$ and $1\\geq\\epsilon\\geq\n\\epsilon_4(n, m)$, we get that the new bound is better.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2008 08:26:01 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Ming", "Xianmin", ""], ["Yang", "Jiansheng", ""]]}, {"id": "0806.1439", "submitter": "Dmitry Lande", "authors": "D. V. Lande, A. A. Snarskii", "title": "Dynamic Network of Concepts from Web-Publications", "comments": "7 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The network, the nodes of which are concepts (people's names, companies'\nnames, etc.), extracted from web-publications, is considered. A working\nalgorithm of extracting such concepts is presented. Edges of the network under\nconsideration refer to the reference frequency which depends on the fact how\nmany times the concepts, which correspond to the nodes, are mentioned in the\nsame documents. Web-documents being published within a period of time together\nform an information flow, which defines the dynamics of the network studied.\nThe phenomenon of its structure stability, when the number of web-publications,\nconstituting its formation bases, increases, is discussed\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2008 12:16:55 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Lande", "D. V.", ""], ["Snarskii", "A. A.", ""]]}, {"id": "0806.1549", "submitter": "Krishnan Eswaran", "authors": "Krishnan Eswaran, Michael Gastpar, Kannan Ramchandran", "title": "Bits through ARQs", "comments": "submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fundamental problem in dynamic frequency reuse is that the cognitive radio\nis ignorant of the amount of interference it inflicts on the primary license\nholder. A model for such a situation is proposed and analyzed. The primary\nsends packets across an erasure channel and employs simple ACK/NAK feedback\n(ARQs) to retransmit erased packets. Furthermore, its erasure probabilities are\ninfluenced by the cognitive radio's activity. While the cognitive radio does\nnot know these interference characteristics, it can eavesdrop on the primary's\nARQs. The model leads to strategies in which the cognitive radio adaptively\nadjusts its input based on the primary's ARQs thereby guaranteeing the primary\nexceeds a target packet rate. A relatively simple strategy whereby the\ncognitive radio transmits only when the primary's empirical packet rate exceeds\na threshold is shown to have interesting universal properties in the sense that\nfor unknown time-varying interference characteristics, the primary is\nguaranteed to meet its target rate. Furthermore, a more intricate version of\nthis strategy is shown to be capacity-achieving for the cognitive radio when\nthe interference characteristics are time-invariant.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2008 23:31:11 GMT"}], "update_date": "2008-06-11", "authors_parsed": [["Eswaran", "Krishnan", ""], ["Gastpar", "Michael", ""], ["Ramchandran", "Kannan", ""]]}, {"id": "0806.1565", "submitter": "Gesualdo Scutari", "authors": "Gesualdo Scutari, Daniel P. Palomar, Sergio Barbarossa", "title": "Competitive Design of Multiuser MIMO Systems based on Game Theory: A\n  Unified View", "comments": "To appear on IEEE Journal on Selected Areas in Communications (JSAC),\n  September 2008", "journal-ref": null, "doi": "10.1109/JSAC.2008.080907", "report-no": null, "categories": "cs.IT cs.GT math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the noncooperative maximization of mutual information in\nthe Gaussian interference channel in a fully distributed fashion via game\ntheory. This problem has been studied in a number of papers during the past\ndecade for the case of frequency-selective channels. A variety of conditions\nguaranteeing the uniqueness of the Nash Equilibrium (NE) and convergence of\nmany different distributed algorithms have been derived. In this paper we\nprovide a unified view of the state-of-the-art results, showing that most of\nthe techniques proposed in the literature to study the game, even though\napparently different, can be unified using our recent interpretation of the\nwaterfilling operator as a projection onto a proper polyhedral set. Based on\nthis interpretation, we then provide a mathematical framework, useful to derive\na unified set of sufficient conditions guaranteeing the uniqueness of the NE\nand the global convergence of waterfilling based asynchronous distributed\nalgorithms.\n  The proposed mathematical framework is also instrumental to study the\nextension of the game to the more general MIMO case, for which only few results\nare available in the current literature. The resulting algorithm is, similarly\nto the frequency-selective case, an iterative asynchronous MIMO waterfilling\nalgorithm. The proof of convergence hinges again on the interpretation of the\nMIMO waterfilling as a matrix projection, which is the natural generalization\nof our results obtained for the waterfilling mapping in the frequency-selective\ncase.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 03:52:00 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Scutari", "Gesualdo", ""], ["Palomar", "Daniel P.", ""], ["Barbarossa", "Sergio", ""]]}, {"id": "0806.1577", "submitter": "Harshan Jagadeesh", "authors": "J. Harshan, B. Sundar Rajan", "title": "Co-ordinate Interleaved Distributed Space-Time Coding for\n  Two-Antenna-Relays Networks", "comments": "To appear in IEEE Transactions on Wireless Communications. 09 pages,\n  06 figures", "journal-ref": null, "doi": "10.1109/TWC.2009.071303", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed space time coding for wireless relay networks when the source,\nthe destination and the relays have multiple antennas have been studied by Jing\nand Hassibi. In this set-up, the transmit and the receive signals at different\nantennas of the same relay are processed and designed independently, even\nthough the antennas are colocated. In this paper, a wireless relay network with\nsingle antenna at the source and the destination and two antennas at each of\nthe R relays is considered. A new class of distributed space time block codes\ncalled Co-ordinate Interleaved Distributed Space-Time Codes (CIDSTC) are\nintroduced where, in the first phase, the source transmits a T-length complex\nvector to all the relays and in the second phase, at each relay, the in-phase\nand quadrature component vectors of the received complex vectors at the two\nantennas are interleaved and processed before forwarding them to the\ndestination. Compared to the scheme proposed by Jing-Hassibi, for $T \\geq 4R$,\nwhile providing the same asymptotic diversity order of 2R, CIDSTC scheme is\nshown to provide asymptotic coding gain with the cost of negligible increase in\nthe processing complexity at the relays. However, for moderate and large values\nof P, CIDSTC scheme is shown to provide more diversity than that of the scheme\nproposed by Jing-Hassibi. CIDSTCs are shown to be fully diverse provided the\ninformation symbols take value from an appropriate multi-dimensional signal\nset.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 05:45:23 GMT"}, {"version": "v2", "created": "Tue, 5 Aug 2008 11:29:09 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Harshan", "J.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "0806.1659", "submitter": "Pedram Pad", "authors": "K. Alishahi, F. Marvasti, V. Aref, P. Pad", "title": "Bounds on the Sum Capacity of Synchronous Binary CDMA Channels", "comments": "to be published in IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2009.2023756", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we obtain a family of lower bounds for the sum capacity of\nCode Division Multiple Access (CDMA) channels assuming binary inputs and binary\nsignature codes in the presence of additive noise with an arbitrary\ndistribution. The envelope of this family gives a relatively tight lower bound\nin terms of the number of users, spreading gain and the noise distribution. The\nderivation methods for the noiseless and the noisy channels are different but\nwhen the noise variance goes to zero, the noisy channel bound approaches the\nnoiseless case. The behavior of the lower bound shows that for small noise\npower, the number of users can be much more than the spreading gain without any\nsignificant loss of information (overloaded CDMA). A conjectured upper bound is\nalso derived under the usual assumption that the users send out equally likely\nbinary bits in the presence of additive noise with an arbitrary distribution.\nAs the noise level increases, and/or, the ratio of the number of users and the\nspreading gain increases, the conjectured upper bound approaches the lower\nbound. We have also derived asymptotic limits of our bounds that can be\ncompared to a formula that Tanaka obtained using techniques from statistical\nphysics; his bound is close to that of our conjectured upper bound for large\nscale systems.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 13:39:08 GMT"}, {"version": "v2", "created": "Sat, 3 Jan 2009 11:29:04 GMT"}, {"version": "v3", "created": "Thu, 7 May 2009 14:31:45 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Alishahi", "K.", ""], ["Marvasti", "F.", ""], ["Aref", "V.", ""], ["Pad", "P.", ""]]}, {"id": "0806.1819", "submitter": "Pavan Srinath", "authors": "K. Pavan Srinath, B. Sundar Rajan", "title": "A Low-Complexity, Full-Rate, Full-Diversity 2 X 2 STBC with Golden\n  Code's Coding Gain", "comments": "Submitted to IEEE Globecom - 2008. 6 pages, 3 figures, 1 table", "journal-ref": null, "doi": "10.1109/GLOCOM.2008.ECP.235", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a low-ML-decoding-complexity, full-rate, full-diversity\nspace-time block code (STBC) for a 2 transmit antenna, 2 receive antenna\nmultiple-input multiple-output (MIMO) system, with coding gain equal to that of\nthe best and well known Golden code for any QAM constellation. Recently, two\ncodes have been proposed (by Paredes, Gershman and Alkhansari and by Sezginer\nand Sari), which enjoy a lower decoding complexity relative to the Golden code,\nbut have lesser coding gain. The $2\\times 2$ STBC presented in this paper has\nlesser decoding complexity for non-square QAM constellations, compared with\nthat of the Golden code, while having the same decoding complexity for square\nQAM constellations. Compared with the Paredes-Gershman-Alkhansari and\nSezginer-Sari codes, the proposed code has the same decoding complexity for\nnon-rectangular QAM constellations. Simulation results, which compare the\ncodeword error rate (CER) performance, are presented.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2008 09:25:09 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Srinath", "K. Pavan", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "0806.1834", "submitter": "Pavan Srinath", "authors": "K. Pavan Srinath, B. Sundar Rajan", "title": "A Low-decoding-complexity, Large coding Gain, Full-rate, Full-diversity\n  STBC for 4 X 2 MIMO System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a low decoding complexity, full-diversity and full-rate\nspace-time block code (STBC) for 4 transmit and 2 receive ($4\\times 2$)\nmultiple-input multiple-output (MIMO) systems. For such systems, the best code\nknown is the DjABBA code and recently, Biglieri, Hong and Viterbo have proposed\nanother STBC (BHV code) which has lower decoding complexity than DjABBA but\ndoes not have full-diversity like the DjABBA code. The code proposed in this\npaper has the same decoding complexity as the BHV code for square QAM\nconstellations but has full-diversity as well. Compared to the best code in the\nDjABBA family of codes, our code has lower decoding complexity, a better coding\ngain and hence a better error performance as well. Simulation results\nconfirming these are presented.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2008 10:37:13 GMT"}], "update_date": "2008-06-12", "authors_parsed": [["Srinath", "K. Pavan", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "0806.1919", "submitter": "Eyal Lubetzky", "authors": "Eyal Lubetzky, Uri Stav", "title": "Non-linear index coding outperforming the linear optimum", "comments": "16 pages; Preliminary version appeared in FOCS 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The following source coding problem was introduced by Birk and Kol: a sender\nholds a word $x\\in\\{0,1\\}^n$, and wishes to broadcast a codeword to $n$\nreceivers, $R_1,...,R_n$. The receiver $R_i$ is interested in $x_i$, and has\nprior \\emph{side information} comprising some subset of the $n$ bits. This\ncorresponds to a directed graph $G$ on $n$ vertices, where $i j$ is an edge iff\n$R_i$ knows the bit $x_j$. An \\emph{index code} for $G$ is an encoding scheme\nwhich enables each $R_i$ to always reconstruct $x_i$, given his side\ninformation. The minimal word length of an index code was studied by\nBar-Yossef, Birk, Jayram and Kol (FOCS 2006). They introduced a graph\nparameter, $\\minrk_2(G)$, which completely characterizes the length of an\noptimal \\emph{linear} index code for $G$. The authors of BBJK showed that in\nvarious cases linear codes attain the optimal word length, and conjectured that\nlinear index coding is in fact \\emph{always} optimal.\n  In this work, we disprove the main conjecture of BBJK in the following strong\nsense: for any $\\epsilon > 0$ and sufficiently large $n$, there is an\n$n$-vertex graph $G$ so that every linear index code for $G$ requires codewords\nof length at least $n^{1-\\epsilon}$, and yet a non-linear index code for $G$\nhas a word length of $n^\\epsilon$. This is achieved by an explicit\nconstruction, which extends Alon's variant of the celebrated Ramsey\nconstruction of Frankl and Wilson.\n  In addition, we study optimal index codes in various, less restricted,\nnatural models, and prove several related properties of the graph parameter\n$\\minrk(G)$.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2008 17:58:56 GMT"}], "update_date": "2008-06-12", "authors_parsed": [["Lubetzky", "Eyal", ""], ["Stav", "Uri", ""]]}, {"id": "0806.1945", "submitter": "Ricardo Lopez-Ruiz", "authors": "Jaime Sanudo and Ricardo Lopez-Ruiz", "title": "Complexity in atoms: an approach with a new analytical density", "comments": "24 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.CD cs.IT math.IT physics.atom-ph quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, the calculation of complexity on atomic systems is considered.\nIn order to unveil the increasing of this statistical magnitude with the atomic\nnumber due to the relativistic effects, recently reported in [A. Borgoo, F. De\nProft, P. Geerlings, K.D. Sen, Chem. Phys. Lett., 444 (2007) 186], a new\nanalytical density to describe neutral atoms is proposed. This density is\ninspired in the Tietz potential model. The parameters of this density are\ndetermined from the normalization condition and from a variational calculation\nof the energy, which is a functional of the density. The density is\nnon-singular at the origin and its specific form is selected so as to fit the\nresults coming from non-relativistic Hartree-Fock calculations. The main\ningredients of the energy functional are the non-relativistic kinetic energy,\nthe nuclear-electron attraction energy and the classical term of the electron\nrepulsion. The relativistic correction to the kinetic energy and the Weizsacker\nterm are also taken into account. The Dirac and the correlation terms are shown\nto be less important than the other terms and they have been discarded in this\nstudy. When the statistical measure of complexity is calculated in position\nspace with the analytical density derived from this model, the increasing trend\nof this magnitude as the atomic number increases is also found.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2008 19:44:59 GMT"}], "update_date": "2008-06-12", "authors_parsed": [["Sanudo", "Jaime", ""], ["Lopez-Ruiz", "Ricardo", ""]]}, {"id": "0806.2084", "submitter": "Antonio G. Garc\\'ia", "authors": "A. G. Garcia, M. A. Hernandez-Medina, and G. Perez-Villalon", "title": "On the existence of compactly supported reconstruction functions in a\n  sampling problem", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.FA math.IT math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assume that samples of a filtered version of a function in a shift-invariant\nspace are avalaible. This work deals with the existence of a sampling formula\ninvolving these samples and having reconstruction functions with compact\nsupport. Thus, low computational complexity is involved and truncation errors\nare avoided. This is done in the light of the generalized sampling theory by\nusing the oversampling technique: more samples than strictly necessary are\nused. For a suitable choice of the sampling period, a necessary and sufficient\ncondition is given in terms of the Kronecker canonical form of a matrix pencil.\nComparing with other characterizations in the mathematical literature, the\ngiven here has an important advantage: it can be reliable computed by using the\nGUPTRI form of the matrix pencil. Finally, a practical method for computing the\ncompactly supported reconstruction functions is given for the important case\nwhere the oversampling rate is minimum.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jun 2008 14:23:20 GMT"}], "update_date": "2008-06-13", "authors_parsed": [["Garcia", "A. G.", ""], ["Hernandez-Medina", "M. A.", ""], ["Perez-Villalon", "G.", ""]]}, {"id": "0806.2198", "submitter": "Alberto Perotti", "authors": "Alberto Perotti, Alberto Tarable, Sergio Benedetto and Guido Montorsi", "title": "Capacity-achieving CPM schemes", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2010.2040861", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The pragmatic approach to coded continuous-phase modulation (CPM) is proposed\nas a capacity-achieving low-complexity alternative to the serially-concatenated\nCPM (SC-CPM) coding scheme. In this paper, we first perform a selection of the\nbest spectrally-efficient CPM modulations to be embedded into SC-CPM schemes.\nThen, we consider the pragmatic capacity (a.k.a. BICM capacity) of CPM\nmodulations and optimize it through a careful design of the mapping between\ninput bits and CPM waveforms. The so obtained schemes are cascaded with an\nouter serially-concatenated convolutional code to form a pragmatic\ncoded-modulation system. The resulting schemes exhibit performance very close\nto the CPM capacity without requiring iterations between the outer decoder and\nthe CPM demodulator. As a result, the receiver exhibits reduced complexity and\nincreased flexibility due to the separation of the demodulation and decoding\nfunctions.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jun 2008 07:40:35 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Perotti", "Alberto", ""], ["Tarable", "Alberto", ""], ["Benedetto", "Sergio", ""], ["Montorsi", "Guido", ""]]}, {"id": "0806.2513", "submitter": "Olli Pottonen", "authors": "Patric R. J. \\\"Osterg{\\aa}rd and Olli Pottonen", "title": "The Perfect Binary One-Error-Correcting Codes of Length 15: Part\n  I--Classification", "comments": "6 pages. v3: made the codes available in the source of this paper", "journal-ref": "IEEE Trans. Inform. Theory 55 (2009), 4657-4660", "doi": "10.1109/TIT.2009.2027525", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A complete classification of the perfect binary one-error-correcting codes of\nlength 15 as well as their extensions of length 16 is presented. There are 5983\nsuch inequivalent perfect codes and 2165 extended perfect codes. Efficient\ngeneration of these codes relies on the recent classification of Steiner\nquadruple systems of order 16. Utilizing a result of Blackmore, the optimal\nbinary one-error-correcting codes of length 14 and the (15, 1024, 4) codes are\nalso classified; there are 38408 and 5983 such codes, respectively.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 07:58:28 GMT"}, {"version": "v2", "created": "Mon, 22 Jun 2009 10:20:09 GMT"}, {"version": "v3", "created": "Wed, 30 Dec 2009 18:56:05 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Östergård", "Patric R. J.", ""], ["Pottonen", "Olli", ""]]}, {"id": "0806.2533", "submitter": "Ananthanarayanan Chockalingam", "authors": "Saif K. Mohammed, A. Chockalingam, and B. Sundar Rajan", "title": "Asymptotic Analysis of the Performance of LAS Algorithm for Large-MIMO\n  Detection", "comments": "This work in part was presented in IEEE PIMRC'2008, Cannes, France,\n  September 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In our recent work, we reported an exhaustive study on the simulated bit\nerror rate (BER) performance of a low-complexity likelihood ascent search (LAS)\nalgorithm for detection in large multiple-input multiple-output (MIMO) systems\nwith large number of antennas that achieve high spectral efficiencies. Though\nthe algorithm was shown to achieve increasingly closer to near\nmaximum-likelihood (ML) performance through simulations, no BER analysis was\nreported. Here, we extend our work on LAS and report an asymptotic BER analysis\nof the LAS algorithm in the large system limit, where $N_t,N_r \\to \\infty$ with\n$N_t=N_r$, where $N_t$ and $N_r$ are the number of transmit and receive\nantennas. We prove that the error performance of the LAS detector in V-BLAST\nwith 4-QAM in i.i.d. Rayleigh fading converges to that of the ML detector as\n$N_t,N_r \\to \\infty$.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 13:14:37 GMT"}, {"version": "v2", "created": "Sat, 31 Oct 2009 08:03:16 GMT"}], "update_date": "2009-10-31", "authors_parsed": [["Mohammed", "Saif K.", ""], ["Chockalingam", "A.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "0806.2643", "submitter": "Yong Peng", "authors": "Yong Peng and Dinesh Rajan", "title": "On the Capacity Equivalence with Side Information at Transmitter and\n  Receiver", "comments": "5 pages in IEEE 2 column format, submitted to IEEE Trans. Information\n  Theory in June, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a channel that is contaminated by two independent Gaussian\nnoises $S ~ N(0,Q)$ and $Z_0 ~ N(0,N_0)$ is considered. The capacity of this\nchannel is computed when independent noisy versions of $S$ are known to the\ntransmitter and/or receiver. It is shown that the channel capacity is greater\nthen the capacity when $S$ is completely unknown, but is less then the capacity\nwhen $S$ is perfectly known at the transmitter or receiver. For example, if\nthere is one noisy version of $S$ known at the transmitter only, the capacity\nis $0.5\\log(1+\\frac{P}{Q(N_1/(Q+N_1))+N_0})$, where $P$ is the input power\nconstraint and $N_1$ is the power of the noise corrupting $S$. Further, it is\nshown that the capacity with knowledge of any independent noisy versions of $S$\nat the transmitter is equal to the capacity with knowledge of the statistically\nequivalent noisy versions of $S$ at the receiver.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 19:12:43 GMT"}, {"version": "v2", "created": "Wed, 18 Jun 2008 18:20:46 GMT"}], "update_date": "2008-06-18", "authors_parsed": [["Peng", "Yong", ""], ["Rajan", "Dinesh", ""]]}, {"id": "0806.2674", "submitter": "Oren Somekh", "authors": "Nathan Levy, Oren Somekh, Shlomo Shamai (Shitz), and Ofer Zeitouni", "title": "On Certain Large Random Hermitian Jacobi Matrices with Applications to\n  Wireless Communications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the spectrum of certain large random Hermitian Jacobi\nmatrices. These matrices are known to describe certain communication setups. In\nparticular we are interested in an uplink cellular channel which models mobile\nusers experiencing a soft-handoff situation under joint multicell decoding.\nConsidering rather general fading statistics we provide a closed form\nexpression for the per-cell sum-rate of this channel in high-SNR, when an\nintra-cell TDMA protocol is employed. Since the matrices of interest are\ntridiagonal, their eigenvectors can be considered as sequences with second\norder linear recurrence. Therefore, the problem is reduced to the study of the\nexponential growth of products of two by two matrices. For the case where $K$\nusers are simultaneously active in each cell, we obtain a series of lower and\nupper bound on the high-SNR power offset of the per-cell sum-rate, which are\nconsiderably tighter than previously known bounds.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 21:03:36 GMT"}], "update_date": "2008-06-18", "authors_parsed": [["Levy", "Nathan", "", "Shitz"], ["Somekh", "Oren", "", "Shitz"], ["Shamai", "Shlomo", "", "Shitz"], ["Zeitouni", "Ofer", ""]]}, {"id": "0806.2682", "submitter": "Wei Dai", "authors": "Wei Dai and Olgica Milenkovic", "title": "Weighted Superimposed Codes and Constrained Integer Compressed Sensing", "comments": "Submitted to IEEE Trans. on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new family of codes, termed weighted superimposed codes\n(WSCs). This family generalizes the class of Euclidean superimposed codes\n(ESCs), used in multiuser identification systems. WSCs allow for discriminating\nall bounded, integer-valued linear combinations of real-valued codewords that\nsatisfy prescribed norm and non-negativity constraints. By design, WSCs are\ninherently noise tolerant. Therefore, these codes can be seen as special\ninstances of robust compressed sensing schemes. The main results of the paper\nare lower and upper bounds on the largest achievable code rates of several\nclasses of WSCs. These bounds suggest that with the codeword and weighting\nvector constraints at hand, one can improve the code rates achievable by\nstandard compressive sensing.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 22:11:47 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Dai", "Wei", ""], ["Milenkovic", "Olgica", ""]]}, {"id": "0806.2726", "submitter": "Matthias Hesse", "authors": "Matthias Hesse (I3S), Jerome Lebrun (I3S), Luc Deneire (I3S)", "title": "L2 Orthogonal Space Time Code for Continuous Phase Modulation", "comments": null, "journal-ref": "Dans 9th IEEE International Workshop on Signal Processing Advances\n  in Wireless Communications (2008)", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To combine the high power efficiency of Continuous Phase Modulation (CPM)\nwith either high spectral efficiency or enhanced performance in low Signal to\nNoise conditions, some authors have proposed to introduce CPM in a MIMO frame,\nby using Space Time Codes (STC). In this paper, we address the code design\nproblem of Space Time Block Codes combined with CPM and introduce a new design\ncriterion based on L2 orthogonality. This L2 orthogonality condition, with the\nhelp of simplifying assumption, leads, in the 2x2 case, to a new family of\ncodes. These codes generalize the Wang and Xia code, which was based on\npointwise orthogonality. Simulations indicate that the new codes achieve full\ndiversity and a slightly better coding gain. Moreover, one of the codes can be\ninterpreted as two antennas fed by two conventional CPMs using the same data\nbut with different alphabet sets. Inspection of these alphabet sets lead also\nto a simple explanation of the (small) spectrum broadening of Space Time Coded\nCPM.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2008 08:59:18 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Hesse", "Matthias", "", "I3S"], ["Lebrun", "Jerome", "", "I3S"], ["Deneire", "Luc", "", "I3S"]]}, {"id": "0806.2738", "submitter": "Dmitry Lande", "authors": "D.V. Lande", "title": "Identification of information tonality based on Bayesian approach and\n  neural networks", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model of the identification of information tonality, based on Bayesian\napproach and neural networks was described. In the context of this paper\ntonality means positive or negative tone of both the whole information and its\nparts which are related to particular concepts. The method, its application is\npresented in the paper, is based on statistic regularities connected with the\npresence of definite lexemes in the texts. A distinctive feature of the method\nis its simplicity and versatility. At present ideologically similar approaches\nare widely used to control spam.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2008 09:44:43 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Lande", "D. V.", ""]]}, {"id": "0806.2760", "submitter": "Matthias Hesse", "authors": "Matthias Hesse (I3S), Jerome Lebrun (I3S), Luc Deneire (I3S)", "title": "L2 OSTC-CPM: Theory and design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The combination of space-time coding (STC) and continuous phase modulation\n(CPM) is an attractive field of research because both STC and CPM bring many\nadvantages for wireless communications. Zhang and Fitz [1] were the first to\napply this idea by constructing a trellis based scheme. But for these codes the\ndecoding effort grows exponentially with the number of transmitting antennas.\nThis was circumvented by orthogonal codes introduced by Wang and Xia [2].\nUnfortunately, based on Alamouti code [3], this design is restricted to two\nantennas. However, by relaxing the orthogonality condition, we prove here that\nit is possible to design L2-orthogonal space-time codes which achieve full rate\nand full diversity with low decoding effort. In part one, we generalize the\ntwo-antenna code proposed by Wang and Xia [2] from pointwise to\nL2-orthogonality and in part two we present the first L2-orthogonal code for\nCPM with three antennas. In this report, we detail these results and focus on\nthe properties of these codes. Of special interest is the optimization of the\nbit error rate which depends on the initial phase of the system. Our simulation\nresults illustrate the systemic behavior of these conditions.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2008 11:43:17 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Hesse", "Matthias", "", "I3S"], ["Lebrun", "Jerome", "", "I3S"], ["Deneire", "Luc", "", "I3S"]]}, {"id": "0806.2943", "submitter": "Jun Tanaka", "authors": "Jun Tanaka", "title": "Modern Set", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GM cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, we intend to generalize the classical set theory as much as\npossible. we will do this by freeing sets from the regular properties of\nclassical sets; e.g., the law of excluded middle, the law of non-contradiction,\nthe distributive law, the commutative law,etc....\n", "versions": [{"version": "v1", "created": "Wed, 18 Jun 2008 09:45:18 GMT"}], "update_date": "2008-06-19", "authors_parsed": [["Tanaka", "Jun", ""]]}, {"id": "0806.2991", "submitter": "Nathan Levy", "authors": "Nathan Levy, Ofer Zeitouni and Shlomo Shamai (Shitz)", "title": "On Information Rates of the Fading Wyner Cellular Model via the Thouless\n  Formula for the Strip", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply the theory of random Schr\\\"odinger operators to the analysis of\nmulti-users communication channels similar to the Wyner model, that are\ncharacterized by short-range intra-cell broadcasting. With $H$ the channel\ntransfer matrix, $HH^\\dagger$ is a narrow-band matrix and in many aspects is\nsimilar to a random Schr\\\"odinger operator. We relate the per-cell sum-rate\ncapacity of the channel to the integrated density of states of a random\nSchr\\\"odinger operator; the latter is related to the top Lyapunov exponent of a\nrandom sequence of matrices via a version of the Thouless formula. Unlike\nrelated results in classical random matrix theory, limiting results do depend\non the underlying fading distributions. We also derive several bounds on the\nlimiting per-cell sum-rate capacity, some based on the theory of random\nSchr\\\"odinger operators, and some derived from information theoretical\nconsiderations. Finally, we get explicit results in the high-SNR regime for\nsome particular cases.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jun 2008 14:06:30 GMT"}], "update_date": "2008-06-19", "authors_parsed": [["Levy", "Nathan", "", "Shitz"], ["Zeitouni", "Ofer", "", "Shitz"], ["Shamai", "Shlomo", "", "Shitz"]]}, {"id": "0806.3023", "submitter": "Che Lin", "authors": "C. Lin, V. V. Veeravalli, and S. Meyn", "title": "A Random Search Framework for Convergence Analysis of Distributed\n  Beamforming with Feedback", "comments": "8 pages, 3 figures, presented partially at ITA '08 and PSU School of\n  Info. Theory '08", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The focus of this work is on the analysis of transmit beamforming schemes\nwith a low-rate feedback link in wireless sensor/relay networks, where nodes in\nthe network need to implement beamforming in a distributed manner.\nSpecifically, the problem of distributed phase alignment is considered, where\nneither the transmitters nor the receiver has perfect channel state\ninformation, but there is a low-rate feedback link from the receiver to the\ntransmitters. In this setting, a framework is proposed for systematically\nanalyzing the performance of distributed beamforming schemes. To illustrate the\nadvantage of this framework, a simple adaptive distributed beamforming scheme\nthat was recently proposed by Mudambai et al. is studied. Two important\nproperties for the received signal magnitude function are derived. Using these\nproperties and the systematic framework, it is shown that the adaptive\ndistributed beamforming scheme converges both in probability and in mean.\nFurthermore, it is established that the time required for the adaptive scheme\nto converge in mean scales linearly with respect to the number of sensor/relay\nnodes.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jun 2008 15:56:19 GMT"}, {"version": "v2", "created": "Wed, 2 Jul 2008 17:12:03 GMT"}, {"version": "v3", "created": "Tue, 13 Jul 2010 07:49:15 GMT"}], "update_date": "2010-07-14", "authors_parsed": [["Lin", "C.", ""], ["Veeravalli", "V. V.", ""], ["Meyn", "S.", ""]]}, {"id": "0806.3133", "submitter": "Ori Shental", "authors": "Ori Shental and Ido Kanter", "title": "Shannon Meets Carnot: Mutual Information Via Thermodynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this contribution, the Gaussian channel is represented as an equivalent\nthermal system allowing to express its input-output mutual information in terms\nof thermodynamic quantities. This thermodynamic description of the mutual\ninformation is based upon a generalization of the $2^{nd}$ thermodynamic law\nand provides an alternative proof to the Guo-Shamai-Verd\\'{u} theorem, giving\nan intriguing connection between this remarkable theorem and the most\nfundamental laws of nature - the laws of thermodynamics.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2008 06:31:51 GMT"}], "update_date": "2008-06-20", "authors_parsed": [["Shental", "Ori", ""], ["Kanter", "Ido", ""]]}, {"id": "0806.3227", "submitter": "Harshan Jagadeesh", "authors": "J. Harshan, B. Sundar Rajan", "title": "A Non-differential Distributed Space-Time Coding for Partially-Coherent\n  Cooperative Communication", "comments": "To appear in IEEE Transactions on Wireless Communications. 06 pages,\n  04 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a distributed space-time coding scheme, based on the relay channel model,\nthe relay nodes co-operate to linearly process the transmitted signal from the\nsource and forward them to the destination such that the signal at the\ndestination appears as a space time block code. Recently, a code design\ncriteria for achieving full diversity in a partially-coherent environment have\nbeen proposed along with codes based on differential encoding and decoding\ntechniques. For such a set up, in this paper, a non-differential encoding\ntechnique and construction of distributed space time block codes from unitary\nmatrix groups at the source and a set of diagonal unitary matrices for the\nrelays are proposed. It is shown that, the performance of our scheme is\nindependent of the choice of unitary matrices at the relays. When the group is\ncyclic, a necessary and sufficient condition on the generator of the cyclic\ngroup to achieve full diversity and to minimize the pairwise error probability\nis proved. Various choices on the generator of cyclic group to reduce the ML\ndecoding complexity at the destination is presented. It is also shown that, at\nthe source, if non-cyclic abelian unitary matrix groups are used, then\nfull-diversity can not be obtained. The presented scheme is also robust to\nfailure of any subset of relay nodes.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2008 16:18:32 GMT"}], "update_date": "2008-06-20", "authors_parsed": [["Harshan", "J.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "0806.3243", "submitter": "Fan Zhang", "authors": "Fan Zhang and Henry D. Pfister", "title": "Analysis of Verification-based Decoding on the q-ary Symmetric Channel\n  for Large q", "comments": "This is the final version for IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss and analyze a list-message-passing decoder with verification for\nlow-density parity-check (LDPC) codes on the q-ary symmetric channel (q-SC).\nRather than passing messages consisting of symbol probabilities, this decoder\npasses lists of possible symbols and marks some lists as verified. The density\nevolution (DE) equations for this decoder are derived and used to compute\ndecoding thresholds. If the maximum list size is unbounded, then we find that\nany capacity-achieving LDPC code for the binary erasure channel can be used to\nachieve capacity on the q-SC for large q. The decoding thresholds are also\ncomputed via DE for the case where each list is truncated to satisfy a maximum\nlist size constraint. Simulation results are also presented to confirm the DE\nresults. During the simulations, we observed differences between two\nverification-based decoding algorithms, introduced by Luby and Mitzenmacher,\nthat were implicitly assumed to be identical. In this paper, we provide an\nanalysis of the node-based algorithms from that paper and verify that it\nmatches simulation results. The probability of false verification (FV) is also\nconsidered and techniques are discussed to mitigate the FV. Optimization of the\ndegree distribution is also used to improve the threshold for a fixed maximum\nlist size. Finally, the proposed algorithm is compared with a variety of other\nalgorithms using both density evolution thresholds and simulation results.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2008 17:22:02 GMT"}, {"version": "v2", "created": "Thu, 30 Jul 2009 16:45:06 GMT"}, {"version": "v3", "created": "Sat, 24 Jul 2010 03:15:47 GMT"}, {"version": "v4", "created": "Fri, 19 Nov 2010 04:44:08 GMT"}, {"version": "v5", "created": "Sat, 29 Jan 2011 18:28:17 GMT"}, {"version": "v6", "created": "Fri, 24 Jun 2011 04:37:23 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Zhang", "Fan", ""], ["Pfister", "Henry D.", ""]]}, {"id": "0806.3246", "submitter": "Eyal Lubetzky", "authors": "Noga Alon, Avinatan Hasidim, Eyal Lubetzky, Uri Stav, Amit Weinstein", "title": "Broadcasting with side information", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A sender holds a word x consisting of n blocks x_i, each of t bits, and\nwishes to broadcast a codeword to m receivers, R_1,...,R_m. Each receiver R_i\nis interested in one block, and has prior side information consisting of some\nsubset of the other blocks. Let \\beta_t be the minimum number of bits that has\nto be transmitted when each block is of length t, and let \\beta be the limit\n\\beta = \\lim_{t \\to \\infty} \\beta_t/t. In words, \\beta is the average\ncommunication cost per bit in each block (for long blocks). Finding the coding\nrate \\beta, for such an informed broadcast setting, generalizes several coding\ntheoretic parameters related to Informed Source Coding on Demand, Index Coding\nand Network Coding.\n  In this work we show that usage of large data blocks may strictly improve\nupon the trivial encoding which treats each bit in the block independently. To\nthis end, we provide general bounds on \\beta_t, and prove that for any constant\nC there is an explicit broadcast setting in which \\beta = 2 but \\beta_1 > C.\nOne of these examples answers a question of Lubetzky and Stav.\n  In addition, we provide examples with the following counterintuitive\ndirect-sum phenomena. Consider a union of several mutually independent\nbroadcast settings. The optimal code for the combined setting may yield a\nsignificant saving in communication over concatenating optimal encodings for\nthe individual settings. This result also provides new non-linear coding\nschemes which improve upon the largest known gap between linear and non-linear\nNetwork Coding, thus improving the results of Dougherty, Freiling, and Zeger.\n  The proofs use ideas related to Witsenhausen's rate, OR graph products,\ncolorings of Cayley graphs and the chromatic numbers of Kneser graphs.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2008 17:42:34 GMT"}], "update_date": "2008-06-20", "authors_parsed": [["Alon", "Noga", ""], ["Hasidim", "Avinatan", ""], ["Lubetzky", "Eyal", ""], ["Stav", "Uri", ""], ["Weinstein", "Amit", ""]]}, {"id": "0806.3277", "submitter": "Stephan Foldes", "authors": "Stephan Foldes", "title": "On McMillan's theorem about uniquely decipherable codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Karush's proof of McMillan's theorem is recast as an argument involving\npolynomials with non-commuting indeterminates certain evaluations of which\nyield the Kraft sums of codes, proving a strengthened version of McMillan's\ntheorem.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2008 20:28:40 GMT"}, {"version": "v2", "created": "Sat, 21 Jun 2008 21:51:48 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Foldes", "Stephan", ""]]}, {"id": "0806.3284", "submitter": "Daniel M. Gordon", "authors": "Daniel M. Gordon, Victor Miller and Peter Ostapenko", "title": "Optimal hash functions for approximate closest pairs on the n-cube", "comments": "IEEE Transactions on Information Theory, to appear", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One way to find closest pairs in large datasets is to use hash functions. In\nrecent years locality-sensitive hash functions for various metrics have been\ngiven: projecting an n-cube onto k bits is simple hash function that performs\nwell. In this paper we investigate alternatives to projection. For various\nparameters hash functions given by complete decoding algorithms for codes work\nbetter, and asymptotically random codes perform better than projection.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 17:19:44 GMT"}, {"version": "v2", "created": "Thu, 15 Oct 2009 15:40:02 GMT"}], "update_date": "2009-10-15", "authors_parsed": [["Gordon", "Daniel M.", ""], ["Miller", "Victor", ""], ["Ostapenko", "Peter", ""]]}, {"id": "0806.3317", "submitter": "Chau Yuen", "authors": "Chau Yuen, Yong Liang Guan, Tjeng Thiang Tjhung", "title": "Differential Transmit Diversity Based on Quasi-Orthogonal Space-Time\n  Block Code", "comments": null, "journal-ref": "Globecom 2004", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By using joint modulation and customized constellation set, we show that\nQuasi-Orthogonal Space-Time Block Code (QO-STBC) can be used to form a new\ndifferential space-time modulation (DSTM) scheme to provide full transmit\ndiversity with non-coherent detection. Our new scheme can provide higher code\nrate than existing DSTM schemes based on Orthogonal STBC. It also has a lower\ndecoding complexity than the other DSTM schemes, such as those based on Group\nCodes, because it only requires a joint detection of two complex symbols. We\nderive the design criteria for the customized constellation set and use them to\nconstruct a constellation set that provides a wide range of spectral efficiency\nwith full diversity and maximum coding gain.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 06:15:38 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Yuen", "Chau", ""], ["Guan", "Yong Liang", ""], ["Tjhung", "Tjeng Thiang", ""]]}, {"id": "0806.3320", "submitter": "Chau Yuen", "authors": "Chau Yuen, Yong Liang Guan, T. T. Tjhung", "title": "Unitary Differential Space-Time Modulation with Joint Modulation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop two new designs of unitary differential space-time modulation\n(DSTM) with low decoding complexity. Their decoder can be separated into a few\nparallel decoders, each of which has a decoding search space of less than\nsqrt(N) if the DSTM codebook contains N codewords. Both designs are based on\nthe concept of joint modulation, which means that several information symbols\nare jointly modulated, unlike the conventional symbol-by-symbol modulation. The\nfirst design is based on Orthogonal Space-Time Block Code (O-STBC) with joint\nconstellation constructed from spherical codes. The second design is based on\nQuasi-Orthogonal Space-Time Block Code (QO-STBC) with specially designed\npair-wise constellation sets. Both the proposed unitary DSTM schemes have\nconsiderably lower decoding complexity than many prior DSTM schemes, including\nthose based on Group Codes and Sp(2) which generally have a decoding search\nspace of N for a codebook size of N codewords, and much better decoding\nperformance than the existing O-STBC DSTM scheme. Between two designs, the\nproposed DSTM based on O-STBC generally has better decoding performance, while\nthe proposed DSTM based on QO-STBC has lower decoding complexity when 8\ntransmit antennas.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 06:26:10 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Yuen", "Chau", ""], ["Guan", "Yong Liang", ""], ["Tjhung", "T. T.", ""]]}, {"id": "0806.3321", "submitter": "Chau Yuen", "authors": "Chau Yuen, Bertrand M. Hochwald", "title": "Achieving Near-Capacity at Low SNR on a Multiple-Antenna Multiple-User\n  Channel", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the sensitivity of the capacity of a multi-antenna multi-user\nsystem to the number of users being served. We show analytically that, for a\ngiven desired sum-rate, the extra power needed to serve a subset of the users\nat low SNR (signal-to-noise ratio) can be very small, and is generally much\nsmaller than the extra power needed to serve the same subset at high SNR. The\nadvantages of serving only subsets of the users are many: multi-user algorithms\nhave lower complexity, reduced channel-state information requirements, and,\noften, better performance. We provide guidelines on how many users to serve to\nget near-capacity performance with low complexity. For example, we show how in\nan eight-antenna eight-user system we can serve only four users and still be\napproximately 2 dB from capacity at very low SNR.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 06:29:17 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Yuen", "Chau", ""], ["Hochwald", "Bertrand M.", ""]]}, {"id": "0806.3322", "submitter": "Chau Yuen", "authors": "Chau Yuen, Yong Liang Guan, Tjeng Thiang Tjhung", "title": "Power-Balanced Orthogonal Space-Time Block Code", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose two new systematic ways to construct amicable\northogonal designs (AOD), with an aim to facilitate the construction of\npower-balanced orthogonal spacetime block codes (O-STBC) with favorable\npractical attributes. We also show that an AOD can be constructed from an\nAmicable Family (AF), and such a construction is crucial for achieving a\npower-balanced O-STBC. In addition, we develop design guidelines on how to\nselect the \"type\" parameter of an AOD so that the resultant O-STBC will have\nbetter power-distribution and code-coefficient attributes. Among the new\nO-STBCs obtained, one is shown to be optimal in terms of power distribution\nattributes. In addition, one of the proposed construction methods is shown to\ngeneralize some other construction methods proposed in the literature.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 06:34:12 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Yuen", "Chau", ""], ["Guan", "Yong Liang", ""], ["Tjhung", "Tjeng Thiang", ""]]}, {"id": "0806.3324", "submitter": "Chau Yuen", "authors": "Chau Yuen, Yong Liang Guan, Tjeng Thiang Tjhung", "title": "Optimizing Quasi-Orthogonal STBC Through Group-Constrained Linear\n  Transformation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we first derive the generic algebraic structure of a\nQuasi-Orthogonal STBC (QO-STBC). Next we propose Group-Constrained Linear\nTransformation (GCLT) as a means to optimize the diversity and coding gains of\na QO-STBC with square or rectangular QAM constellations. Compared with QO-STBC\nwith constellation rotation (CR), we show that QO-STBC with GCLT requires only\nhalf the number of symbols for joint detection, hence lower maximum-likelihood\ndecoding complexity. We also derive analytically the optimum GCLT parameters\nfor QO-STBC with square QAM constellation. The optimized QO-STBCs with GCLT are\nable to achieve full transmit diversity, and have negligible performance loss\ncompared with QO-STBCs with CR at the same code rate.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 06:36:56 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Yuen", "Chau", ""], ["Guan", "Yong Liang", ""], ["Tjhung", "Tjeng Thiang", ""]]}, {"id": "0806.3325", "submitter": "Chau Yuen", "authors": "Chau Yuen, Yong Liang Guan, Tjeng Thiang Tjhung", "title": "On the Search for High-Rate Quasi-Orthogonal Space-Time Block Code", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Quasi-Orthogonal Space-Time Block Code (QO-STBC) is attractive because it\nachieves higher code rate than Orthogonal STBC and lower decoding complexity\nthan nonorthogonal STBC. In this paper, we first derive the algebraic structure\nof QO-STBC, then we apply it in a novel graph-based search algorithm to find\nhigh-rate QO-STBCs with code rates greater than 1. From the four-antenna codes\nfound using this approach, it is found that the maximum code rate is limited to\n5/4 with symbolwise diversity level of four, and 4 with symbolwise diversity\nlevel of two. The maximum likelihood decoding of these high-rate QO-STBCs can\nbe performed on two separate sub-groups of symbols. The rate-5/4 codes are the\nfirst known QO-STBCs with code rate greater 1 that has full symbolwise\ndiversity level.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 06:38:56 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Yuen", "Chau", ""], ["Guan", "Yong Liang", ""], ["Tjhung", "Tjeng Thiang", ""]]}, {"id": "0806.3328", "submitter": "Chau Yuen", "authors": "Wee Seng Chua, Chau Yuen, Yong Liang Guan, Francois Chin", "title": "Limited Feedback for Multi-Antenna Multi-user Communications with\n  Generalized Multi-Unitary Decomposition", "comments": "PIMRC 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a decomposition method called Generalized\nMulti-Unitary Decomposition (GMUD) which is useful in multi-user MIMO\nprecoding. This decomposition transforms a complex matrix H into PRQ, where R\nis a special matrix whose first row contains only a non-zero user defined value\nat the left-most position, P and Q are a pair of unitary matrices. The major\nattraction of our proposed GMUD is we can obtain multiple solutions of P and Q\n>. With GMUD, we propose a precoding method for a MIMO multi-user system that\ndoes not require full channel state information (CSI) at the transmitter. The\nproposed precoding method uses the multiple unitary matrices property to\ncompensate the inaccurate feedback information as the transmitter can steer the\ntransmission beams of individual users such that the inter-user interference is\nkept minimum.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 07:08:08 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Chua", "Wee Seng", ""], ["Yuen", "Chau", ""], ["Guan", "Yong Liang", ""], ["Chin", "Francois", ""]]}, {"id": "0806.3329", "submitter": "Chau Yuen", "authors": "Chau Yuen, Sumei Sun, Mel Meau Shin Ho", "title": "Beamforming Matrix Quantization with Variable Feedback Rate", "comments": "PIMRC 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an improved beamforming matrix compression by Givens Rotation with\nthe use of variable feedback rate. The variable feedback rate means that the\nnumber of bits used to represent the quantized beamforming matrix is based on\nthe value of the matrix. Compared with the fixed feedback rate scheme, the\nproposed method has better performance without additional feedback bandwidth.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 07:10:03 GMT"}], "update_date": "2008-06-23", "authors_parsed": [["Yuen", "Chau", ""], ["Sun", "Sumei", ""], ["Ho", "Mel Meau Shin", ""]]}, {"id": "0806.3332", "submitter": "Yonina C. Eldar", "authors": "Yonina C. Eldar", "title": "Compressed Sensing of Analog Signals in Shift-Invariant Spaces", "comments": "to appear in IEEE Trans. on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2009.2020750", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A traditional assumption underlying most data converters is that the signal\nshould be sampled at a rate exceeding twice the highest frequency. This\nstatement is based on a worst-case scenario in which the signal occupies the\nentire available bandwidth. In practice, many signals are sparse so that only\npart of the bandwidth is used. In this paper, we develop methods for low-rate\nsampling of continuous-time sparse signals in shift-invariant (SI) spaces,\ngenerated by m kernels with period T. We model sparsity by treating the case in\nwhich only k out of the m generators are active, however, we do not know which\nk are chosen. We show how to sample such signals at a rate much lower than m/T,\nwhich is the minimal sampling rate without exploiting sparsity. Our approach\ncombines ideas from analog sampling in a subspace with a recently developed\nblock diagram that converts an infinite set of sparse equations to a finite\ncounterpart. Using these two components we formulate our problem within the\nframework of finite compressed sensing (CS) and then rely on algorithms\ndeveloped in that context. The distinguishing feature of our results is that in\ncontrast to standard CS, which treats finite-length vectors, we consider\nsampling of analog signals for which no underlying finite-dimensional model\nexists. The proposed framework allows to extend much of the recent literature\non CS to the analog domain.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 07:33:20 GMT"}, {"version": "v2", "created": "Mon, 16 Mar 2009 19:00:23 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Eldar", "Yonina C.", ""]]}, {"id": "0806.3474", "submitter": "Torsten Ensslin", "authors": "Torsten A. Ensslin, Mona Frommert, Francisco S. Kitaura", "title": "Information field theory for cosmological perturbation reconstruction\n  and non-linear signal analysis", "comments": "38 pages, 6 figures, LaTeX; version accepted by PRD", "journal-ref": null, "doi": "10.1103/PhysRevD.80.105005", "report-no": "J-MPA2270e", "categories": "astro-ph cs.IT hep-th math.IT physics.data-an stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop information field theory (IFT) as a means of Bayesian inference on\nspatially distributed signals, the information fields. A didactical approach is\nattempted. Starting from general considerations on the nature of measurements,\nsignals, noise, and their relation to a physical reality, we derive the\ninformation Hamiltonian, the source field, propagator, and interaction terms.\nFree IFT reproduces the well known Wiener-filter theory. Interacting IFT can be\ndiagrammatically expanded, for which we provide the Feynman rules in position-,\nFourier-, and spherical harmonics space, and the Boltzmann-Shannon information\nmeasure. The theory should be applicable in many fields. However, here, two\ncosmological signal recovery problems are discussed in their IFT-formulation.\n1) Reconstruction of the cosmic large-scale structure matter distribution from\ndiscrete galaxy counts in incomplete galaxy surveys within a simple model of\ngalaxy formation. We show that a Gaussian signal, which should resemble the\ninitial density perturbations of the Universe, observed with a strongly\nnon-linear, incomplete and Poissonian-noise affected response, as the processes\nof structure and galaxy formation and observations provide, can be\nreconstructed thanks to the virtue of a response-renormalization flow equation.\n2) We design a filter to detect local non-linearities in the cosmic microwave\nbackground, which are predicted from some Early-Universe inflationary\nscenarios, and expected due to measurement imperfections. This filter is the\noptimal Bayes' estimator up to linear order in the non-linearity parameter and\ncan be used even to construct sky maps of non-linearities in the data.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 21:24:25 GMT"}, {"version": "v2", "created": "Wed, 6 May 2009 18:30:53 GMT"}, {"version": "v3", "created": "Tue, 29 Sep 2009 07:57:21 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Ensslin", "Torsten A.", ""], ["Frommert", "Mona", ""], ["Kitaura", "Francisco S.", ""]]}, {"id": "0806.3628", "submitter": "Chau Yuen", "authors": "Su Kiang Kuek, Chau Yuen, Woon Hau Chin", "title": "Four-node Relay Network with Bi-directional Traffic Employing Wireless\n  Network Coding with Pre-cancellation", "comments": null, "journal-ref": "VTC Spring 2008", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network coding has the potential to improve the overall throughput of a\nnetwork by combining different streams of data and forwarding them. In wireless\nnetworks, the wireless channel provide an excellent medium for physical layer\nnetwork coding as signals from different transmitters are combined\nautomatically by the wireless channel. In such scenarios, it would be\ninteresting to investigate protocols and algorithms which can optimally relay\ninformation. In this paper, we look at a four-node two-way or bidirectional\nrelay network, and propose a relay protocol which can relay information\nefficiently in this network.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 07:49:29 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Kuek", "Su Kiang", ""], ["Yuen", "Chau", ""], ["Chin", "Woon Hau", ""]]}, {"id": "0806.3629", "submitter": "Chau Yuen", "authors": "Chau Yuen, Woon Hau Chin, Yong Liang Guan, Wenhua Chen, Taoyi Tee", "title": "Bi-Directional Multi-Antenna Relay Communications with Wireless Network\n  Coding", "comments": null, "journal-ref": "VTC Spring 2008", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a two-way or bidirectional communications system\nwith a relay equipped with multiple antennas. We show that when the downlink\nchannel state information is not known at the relay, the benefit of having\nadditional antennas at the relay can only be obtained by using decode and\nforward (DF) but not amplify and forward (AF). The gain becomes significant\nwhen we employ transmit diversity together with wireless network coding. We\nalso demonstrate how the performance of such system can be improved by\nperforming antenna selection at the relay. Our results show that if downlink\nchannel state information is known at the relay, network coding may not provide\nadditional gain than simple antenna selection scheme.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 07:52:35 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Yuen", "Chau", ""], ["Chin", "Woon Hau", ""], ["Guan", "Yong Liang", ""], ["Chen", "Wenhua", ""], ["Tee", "Taoyi", ""]]}, {"id": "0806.3630", "submitter": "Chau Yuen", "authors": "Chau Yuen, Sumei Sun, Jian-Kang Zhang", "title": "Comparative Study of SVD and QRS in Closed-Loop Beamforming Systems", "comments": "Milcom 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We compare two closed-loop beamforming algorithms, one based on singular\nvalue decomposition (SVD) and the other based on equal diagonal QR\ndecomposition (QRS). SVD has the advantage of parallelizing the MIMO channel,\nbut each of the sub-channels has different gain. QRS has the advantage of\nhaving equal diagonal value for the decomposed channel, but the subchannels are\nnot fully parallelized, hence requiring successive interference cancellation or\nother techniques to perform decoding. We consider a closed-loop system where\nthe feedback information is a unitary beamforming matrix. Due to the discrete\nand limited modulation set, SVD may have inferior performance to QRS when no\nmodulation set selection is performed. However, if the selection of modulation\nset is performed optimally, we show that SVD can outperform QRS.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 07:54:55 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Yuen", "Chau", ""], ["Sun", "Sumei", ""], ["Zhang", "Jian-Kang", ""]]}, {"id": "0806.3631", "submitter": "Chau Yuen", "authors": "Chau Yuen, Yan Wu, Sumei Sun", "title": "Comparative Study of Open-loop Transmit Diversity Schemes for Four\n  Transmit Antennas in Coded OFDM Systems", "comments": null, "journal-ref": "VTC Fall 2007", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We compare four open-loop transmit diversity schemes in a coded Orthogonal\nFrequency Division Multiplexing (OFDM) system with four transmit antennas,\nnamely cyclic delay diversity (CDD), Space-Time Block Code (STBC, Alamouti code\nis used) with CDD, Quasi-Orthogonal STBC (QO-STBC) and\nMinimum-Decoding-Complexity QOSTBC (MDC-QOSTBC). We show that in a coded system\nwith low code rate, a scheme with spatial transmit diversity of second order\ncan achieve similar performance to that with spatial transmit diversity of\nfourth order due to the additional diversity provided by the phase shift\ndiversity with channel coding. In addition, we also compare the decoding\ncomplexity and other features of the above four mentioned schemes, such as the\nrequirement for the training signals, hybrid automatic retransmission request\n(HARQ), etc. The discussions in this paper can be readily applied to future\nwireless communication systems, such as mobile systems beyond 3G, IEEE 802.11\nwireless LAN, or IEEE 802.16 WiMAX, that employ more than two transmit antennas\nand OFDM.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 07:56:57 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Yuen", "Chau", ""], ["Wu", "Yan", ""], ["Sun", "Sumei", ""]]}, {"id": "0806.3633", "submitter": "Chau Yuen", "authors": "Wee Seng Chua, Chau Yuen, Francois Chin", "title": "A Continuous Vector-Perturbation for Multi-Antenna Multi-User\n  Communication", "comments": null, "journal-ref": "VTC Spring 2007", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The sum-rate of the broadcast channel in a multi-antenna multi-user\ncommunication system can be achieved by using precoding and adding a regular\nperturbation to the data vector. The perturbation can be removed by the modulus\nfunction, thus transparent to the receiver, but the information of the\nprecoding matrix is needed to decode the symbols. This paper proposes a new\ntechnique to improve the multi-antenna multi-user system, by adding a\ncontinuous perturbation to the data vector without the need of information on\nthe precoding matrix to be known at the receiver. The perturbation vector will\nbe treated as interference at the receiver, thus it will be transparent to the\nreceiver. The derivation of the continuous vector perturbation is provided by\nmaximizing the signal-to-interference plus noise ratio or minimizing the\nminimum mean square error of the received signal.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 08:01:25 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Chua", "Wee Seng", ""], ["Yuen", "Chau", ""], ["Chin", "Francois", ""]]}, {"id": "0806.3650", "submitter": "Vitaly Skachek", "authors": "Vitaly Skachek", "title": "Recursive Code Construction for Random Networks", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2009.2039163", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A modification of Koetter-Kschischang codes for random networks is presented\n(these codes were also studied by Wang et al. in the context of authentication\nproblems). The new codes have higher information rate, while maintaining the\nsame error-correcting capabilities. An efficient error-correcting algorithm is\nproposed for these codes.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 10:58:53 GMT"}, {"version": "v2", "created": "Mon, 28 Jul 2008 18:24:31 GMT"}, {"version": "v3", "created": "Fri, 16 Oct 2009 08:01:50 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Skachek", "Vitaly", ""]]}, {"id": "0806.3653", "submitter": "Samir Medina Perlaza", "authors": "Samir Medina Perlaza, Merouane Debbah, Samson Lasaulce and Jean-Marie\n  Chaufray", "title": "Opportunistic Interference Alignment in MIMO Interference Channels", "comments": "To appear in proc. IEEE PIMRC 2008 - Workshop in Emerging Network\n  Perspectives in Multiuser and Cooperative MIMO (NWMIMO). 5 pages and 4\n  figures", "journal-ref": null, "doi": "10.1109/PIMRC.2008.4699872", "report-no": null, "categories": "cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present two interference alignment techniques such that an opportunistic\npoint-to-point multiple input multiple output (MIMO) link can reuse, without\ngenerating any additional interference, the same frequency band of a similar\npre-existing primary link. In this scenario, we exploit the fact that under\npower constraints, although each radio maximizes independently its rate by\nwater-filling on their channel transfer matrix singular values, frequently, not\nall of them are used. Therefore, by aligning the interference of the\nopportunistic radio it is possible to transmit at a significant rate while\ninsuring zero-interference on the pre-existing link. We propose a linear\npre-coder for a perfect interference alignment and a power allocation scheme\nwhich maximizes the individual data rate of the secondary link. Our numerical\nresults show that significant data rates are achieved even for a reduced number\nof antennas.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 11:20:18 GMT"}, {"version": "v2", "created": "Tue, 24 Jun 2008 12:31:55 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Perlaza", "Samir Medina", ""], ["Debbah", "Merouane", ""], ["Lasaulce", "Samson", ""], ["Chaufray", "Jean-Marie", ""]]}, {"id": "0806.3681", "submitter": "Alessandro Nordio", "authors": "Alessandro Nordio, Carla-Fabiana Chiasserini, Emanuele Viterbo", "title": "On the d-dimensional Quasi-Equally Spaced Sampling", "comments": "submitted to IEEE Transactions on Signal Processing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a class of random matrices that appear in several communication and\nsignal processing applications, and whose asymptotic eigenvalue distribution is\nclosely related to the reconstruction error of an irregularly sampled\nbandlimited signal. We focus on the case where the random variables\ncharacterizing these matrices are d-dimensional vectors, independent, and\nquasi-equally spaced, i.e., they have an arbitrary distribution and their\naverages are vertices of a d-dimensional grid. Although a closed form\nexpression of the eigenvalue distribution is still unknown, under these\nconditions we are able (i) to derive the distribution moments as the matrix\nsize grows to infinity, while its aspect ratio is kept constant, and (ii) to\nshow that the eigenvalue distribution tends to the Marcenko-Pastur law as\nd->infinity. These results can find application in several fields, as an\nexample we show how they can be used for the estimation of the mean square\nerror provided by linear reconstruction techniques.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 13:20:10 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Nordio", "Alessandro", ""], ["Chiasserini", "Carla-Fabiana", ""], ["Viterbo", "Emanuele", ""]]}, {"id": "0806.3799", "submitter": "Sina Jafarpour", "authors": "Robert Calderbank, Stephen Howard, Sina Jafarpour", "title": "A Sublinear Algorithm for Sparse Reconstruction with l2/l2 Recovery\n  Guarantees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compressed Sensing aims to capture attributes of a sparse signal using very\nfew measurements. Cand\\`{e}s and Tao showed that sparse reconstruction is\npossible if the sensing matrix acts as a near isometry on all\n$\\boldsymbol{k}$-sparse signals. This property holds with overwhelming\nprobability if the entries of the matrix are generated by an iid Gaussian or\nBernoulli process. There has been significant recent interest in an alternative\nsignal processing framework; exploiting deterministic sensing matrices that\nwith overwhelming probability act as a near isometry on $\\boldsymbol{k}$-sparse\nvectors with uniformly random support, a geometric condition that is called the\nStatistical Restricted Isometry Property or StRIP. This paper considers a\nfamily of deterministic sensing matrices satisfying the StRIP that are based on\n\\srm codes (binary chirps) and a $\\boldsymbol{k}$-sparse reconstruction\nalgorithm with sublinear complexity. In the presence of stochastic noise in the\ndata domain, this paper derives bounds on the $\\boldsymbol{\\ell_2}$ accuracy of\napproximation in terms of the $\\boldsymbol{\\ell_2}$ norm of the measurement\nnoise and the accuracy of the best $\\boldsymbol{k}$-sparse approximation, also\nmeasured in the $\\boldsymbol{\\ell_2}$ norm. This type of $\\boldsymbol{\\ell_2\n/\\ell_2}$ bound is tighter than the standard $\\boldsymbol{\\ell_2 /\\ell_1}$ or\n$\\boldsymbol{\\ell_1/ \\ell_1}$ bounds.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2008 02:16:08 GMT"}, {"version": "v2", "created": "Sat, 17 Oct 2009 22:54:03 GMT"}], "update_date": "2009-10-18", "authors_parsed": [["Calderbank", "Robert", ""], ["Howard", "Stephen", ""], ["Jafarpour", "Sina", ""]]}, {"id": "0806.3802", "submitter": "Sina Jafarpour", "authors": "Sina Jafarpour, Weiyu Xu, Babak Hassibi, Robert Calderbank", "title": "Efficient and Robust Compressed Sensing using High-Quality Expander\n  Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Expander graphs have been recently proposed to construct efficient compressed\nsensing algorithms. In particular, it has been shown that any $n$-dimensional\nvector that is $k$-sparse (with $k\\ll n$) can be fully recovered using\n$O(k\\log\\frac{n}{k})$ measurements and only $O(k\\log n)$ simple recovery\niterations. In this paper we improve upon this result by considering expander\ngraphs with expansion coefficient beyond 3/4 and show that, with the same\nnumber of measurements, only $O(k)$ recovery iterations are required, which is\na significant improvement when $n$ is large. In fact, full recovery can be\naccomplished by at most $2k$ very simple iterations. The number of iterations\ncan be made arbitrarily close to $k$, and the recovery algorithm can be\nimplemented very efficiently using a simple binary search tree. We also show\nthat by tolerating a small penalty on the number of measurements, and not on\nthe number of recovery iterations, one can use the efficient construction of a\nfamily of expander graphs to come up with explicit measurement matrices for\nthis method. We compare our result with other recently developed\nexpander-graph-based methods and argue that it compares favorably both in terms\nof the number of required measurements and in terms of the recovery time\ncomplexity. Finally we will show how our analysis extends to give a robust\nalgorithm that finds the position and sign of the $k$ significant elements of\nan almost $k$-sparse signal and then, using very simple optimization\ntechniques, finds in sublinear time a $k$-sparse signal which approximates the\noriginal signal with very high precision.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2008 03:07:00 GMT"}], "update_date": "2008-06-25", "authors_parsed": [["Jafarpour", "Sina", ""], ["Xu", "Weiyu", ""], ["Hassibi", "Babak", ""], ["Calderbank", "Robert", ""]]}, {"id": "0806.3978", "submitter": "Vincent Vu", "authors": "Vincent Q. Vu, Bin Yu, Robert E. Kass", "title": "Information In The Non-Stationary Case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.IT math.IT q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information estimates such as the ``direct method'' of Strong et al. (1998)\nsidestep the difficult problem of estimating the joint distribution of response\nand stimulus by instead estimating the difference between the marginal and\nconditional entropies of the response. While this is an effective estimation\nstrategy, it tempts the practitioner to ignore the role of the stimulus and the\nmeaning of mutual information. We show here that, as the number of trials\nincreases indefinitely, the direct (or ``plug-in'') estimate of marginal\nentropy converges (with probability 1) to the entropy of the time-averaged\nconditional distribution of the response, and the direct estimate of the\nconditional entropy converges to the time-averaged entropy of the conditional\ndistribution of the response. Under joint stationarity and ergodicity of the\nresponse and stimulus, the difference of these quantities converges to the\nmutual information. When the stimulus is deterministic or non-stationary the\ndirect estimate of information no longer estimates mutual information, which is\nno longer meaningful, but it remains a measure of variability of the response\ndistribution across time.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2008 20:13:08 GMT"}, {"version": "v2", "created": "Fri, 18 Jul 2008 23:29:00 GMT"}], "update_date": "2008-07-19", "authors_parsed": [["Vu", "Vincent Q.", ""], ["Yu", "Bin", ""], ["Kass", "Robert E.", ""]]}, {"id": "0806.4200", "submitter": "Ghadamali Bagherikaram", "authors": "Ghadamali Bagherikaram, Abolfazl S. Motahari, Amir K. Khandani", "title": "The Secrecy Rate Region of the Broadcast Channel", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a scenario where a source node wishes to broadcast\ntwo confidential messages for two respective receivers, while a wire-tapper\nalso receives the transmitted signal. This model is motivated by wireless\ncommunications, where individual secure messages are broadcast over open media\nand can be received by any illegitimate receiver. The secrecy level is measured\nby equivocation rate at the eavesdropper. We first study the general\n(non-degraded) broadcast channel with confidential messages. We present an\ninner bound on the secrecy capacity region for this model. The inner bound\ncoding scheme is based on a combination of random binning and the\nGelfand-Pinsker bining. This scheme matches the Marton's inner bound on the\nbroadcast channel without confidentiality constraint. We further study the\nsituation where the channels are degraded. For the degraded broadcast channel\nwith confidential messages, we present the secrecy capacity region. Our\nachievable coding scheme is based on Cover's superposition scheme and random\nbinning. We refer to this scheme as Secret Superposition Scheme. In this\nscheme, we show that randomization in the first layer increases the secrecy\nrate of the second layer. This capacity region matches the capacity region of\nthe degraded broadcast channel without security constraint. It also matches the\nsecrecy capacity for the conventional wire-tap channel. Our converse proof is\nbased on a combination of the converse proof of the conventional degraded\nbroadcast channel and Csiszar lemma. Finally, we assume that the channels are\nAdditive White Gaussian Noise (AWGN) and show that secret superposition scheme\nwith Gaussian codebook is optimal. The converse proof is based on the\ngeneralized entropy power inequality.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jun 2008 21:05:41 GMT"}, {"version": "v2", "created": "Mon, 14 Jul 2008 16:35:17 GMT"}, {"version": "v3", "created": "Thu, 17 Jul 2008 22:22:40 GMT"}, {"version": "v4", "created": "Wed, 30 Jul 2008 19:13:48 GMT"}], "update_date": "2008-07-30", "authors_parsed": [["Bagherikaram", "Ghadamali", ""], ["Motahari", "Abolfazl S.", ""], ["Khandani", "Amir K.", ""]]}, {"id": "0806.4264", "submitter": "Jay Kumar Sundararajan", "authors": "Jay Kumar Sundararajan, Devavrat Shah, Muriel M\\'edard", "title": "Online network coding for optimal throughput and delay -- the\n  three-receiver case", "comments": "This is the final version. The content has been changed to\n  incorporate reviewer comments and recent results", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a packet erasure broadcast channel with three receivers, we propose a new\ncoding algorithm that makes use of feedback to dynamically adapt the code. Our\nalgorithm is throughput optimal, and we conjecture that it also achieves an\nasymptotically optimal average decoding delay at the receivers. We consider\nheavy traffic asymptotics, where the load factor \\rho approaches 1 from below\nwith either the arrival rate (\\lambda) or the channel parameter (\\mu) being\nfixed at a number less than 1. We verify through simulations that our algorithm\nachieves an asymptotically optimal decoding delay of O(1/(1-\\rho)).\n", "versions": [{"version": "v1", "created": "Thu, 26 Jun 2008 09:15:54 GMT"}, {"version": "v2", "created": "Mon, 29 Sep 2008 16:14:10 GMT"}], "update_date": "2008-09-29", "authors_parsed": [["Sundararajan", "Jay Kumar", ""], ["Shah", "Devavrat", ""], ["Médard", "Muriel", ""]]}, {"id": "0806.4293", "submitter": "Boris Kudryashov D.", "authors": "Boris D. Kudryashov, Anton V. Porov, and Eunmi L. Oh", "title": "Scalar Quantization for Audio Data Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is concerned with scalar quantization of transform coefficients in\nan audio codec. The generalized Gaussian distribution (GGD) is used as an\napproximation of one-dimensional probability density function for transform\ncoefficients obtained by modulated lapped transform (MLT) or modified cosine\ntransform (MDCT) filterbank. The rationale of the model is provided in\ncomparison with theoretically achievable rate-distortion function. The\nrate-distortion function computed for the random sequence obtained from a real\nsequence of samples from a large database is compared with that computed for\nrandom sequence obtained by a GGD random generator. A simple algorithm of\nconstructing the Extended Zero Zone (EZZ) quantizer is proposed. Simulation\nresults show that the EZZ quantizer yields a negligible loss in terms of coding\nefficiency compared to optimal scalar quantizers. Furthermore, we describe an\nadaptive version of the EZZ quantizer which works efficiently with low bitrate\nrequirements for transmitting side information\n", "versions": [{"version": "v1", "created": "Thu, 26 Jun 2008 12:19:27 GMT"}], "update_date": "2008-06-27", "authors_parsed": [["Kudryashov", "Boris D.", ""], ["Porov", "Anton V.", ""], ["Oh", "Eunmi L.", ""]]}, {"id": "0806.4415", "submitter": "Chandra Nair", "authors": "Chandra Nair, Vincent Wang Zizhou", "title": "On the inner and outer bounds of 3-receiver broadcast channels with\n  2-degraded message sets", "comments": "5 pages,", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a broadcast channel with 3 receivers and 2 messages (M0, M1)\nwhere two of the three receivers need to decode messages (M0, M1) while the\nremaining one just needs to decode the message M0. We study the best known\ninner and outer bounds under this setting, in an attempt to find the\ndeficiencies with the current techniques of establishing the bounds. We produce\na simple example where we are able to explicitly evaluate the inner bound and\nshow that it differs from the general outer bound. For a class of channels\nwhere the general inner and outer bounds differ, we use a new argument to show\nthat the inner bound is tight.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 01:50:27 GMT"}, {"version": "v2", "created": "Tue, 6 Jan 2009 06:15:07 GMT"}], "update_date": "2009-01-06", "authors_parsed": [["Nair", "Chandra", ""], ["Zizhou", "Vincent Wang", ""]]}, {"id": "0806.4451", "submitter": "MinJi Kim", "authors": "MinJi Kim, Muriel Medard, Joao Barros", "title": "Counteracting Byzantine Adversaries with Network Coding: An Overhead\n  Analysis", "comments": "7 pages, 5 figures, MILCOM 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network coding increases throughput and is robust against failures and\nerasures. However, since it allows mixing of information within the network, a\nsingle corrupted packet generated by a Byzantine attacker can easily\ncontaminate the information to multiple destinations.\n  In this paper, we study the transmission overhead associated with three\ndifferent schemes for detecting Byzantine adversaries at a node using network\ncoding: end-to-end error correction, packet-based Byzantine detection scheme,\nand generation-based Byzantine detection scheme. In end-to-end error\ncorrection, it is known that we can correct up to the min-cut between the\nsource and destinations. However, if we use Byzantine detection schemes, we can\ndetect polluted data, drop them, and therefore, only transmit valid data. For\nthe dropped data, the destinations perform erasure correction, which is\ncomputationally lighter than error correction. We show that, with enough\nattackers present in the network, Byzantine detection schemes may improve the\nthroughput of the network since we choose to forward only reliable information.\nWhen the probability of attack is high, a packet-based detection scheme is the\nmost bandwidth efficient; however, when the probability of attack is low, the\noverhead involved with signing each packet becomes costly, and the\ngeneration-based scheme may be preferred. Finally, we characterize the tradeoff\nbetween generation size and overhead of detection in bits as the probability of\nattack increases in the network.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 08:41:59 GMT"}, {"version": "v2", "created": "Tue, 30 Sep 2008 04:04:44 GMT"}, {"version": "v3", "created": "Fri, 27 Mar 2009 04:42:24 GMT"}], "update_date": "2009-03-27", "authors_parsed": [["Kim", "MinJi", ""], ["Medard", "Muriel", ""], ["Barros", "Joao", ""]]}, {"id": "0806.4468", "submitter": "Rui Zhang", "authors": "Rui Zhang, Shuguang Cui, and Ying-Chang Liang", "title": "On Ergodic Sum Capacity of Fading Cognitive Multiple-Access and\n  Broadcast Channels", "comments": "To appear in IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2009.2030449", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the information-theoretic limits of a secondary or\ncognitive radio (CR) network under spectrum sharing with an existing primary\nradio network. In particular, the fading cognitive multiple-access channel\n(C-MAC) is first studied, where multiple secondary users transmit to the\nsecondary base station (BS) under both individual transmit-power constraints\nand a set of interference-power constraints each applied at one of the primary\nreceivers. This paper considers the long-term (LT) or the short-term (ST)\ntransmit-power constraint over the fading states at each secondary transmitter,\ncombined with the LT or ST interference-power constraint at each primary\nreceiver. In each case, the optimal power allocation scheme is derived for the\nsecondary users to achieve the ergodic sum capacity of the fading C-MAC, as\nwell as the conditions for the optimality of the dynamic\ntime-division-multiple-access (D-TDMA) scheme in the secondary network. The\nfading cognitive broadcast channel (C-BC) that models the downlink transmission\nin the secondary network is then studied under the LT/ST transmit-power\nconstraint at the secondary BS jointly with the LT/ST interference-power\nconstraint at each of the primary receivers. It is shown that D-TDMA is indeed\noptimal for achieving the ergodic sum capacity of the fading C-BC for all\ncombinations of transmit-power and interference-power constraints.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 09:32:01 GMT"}, {"version": "v2", "created": "Mon, 3 Aug 2009 05:59:45 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Zhang", "Rui", ""], ["Cui", "Shuguang", ""], ["Liang", "Ying-Chang", ""]]}, {"id": "0806.4510", "submitter": "Casper Thomsen", "authors": "Olav Geil, Ryutaroh Matsumoto, Casper Thomsen", "title": "On Field Size and Success Probability in Network Coding", "comments": "16 pages, 3 figures, 2 tables. Accepted for publication at\n  International Workshop on the Arithmetic of Finite Fields, WAIFI 2008", "journal-ref": "Proceedings of the 2nd International Workshop on the Arithmetic of\n  Finite Fields, WAIFI 2008, pp. 157-173", "doi": "10.1007/978-3-540-69499-1_14", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using tools from algebraic geometry and Groebner basis theory we solve two\nproblems in network coding. First we present a method to determine the smallest\nfield size for which linear network coding is feasible. Second we derive\nimproved estimates on the success probability of random linear network coding.\nThese estimates take into account which monomials occur in the support of the\ndeterminant of the product of Edmonds matrices. Therefore we finally\ninvestigate which monomials can occur in the determinant of the Edmonds matrix.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 13:05:32 GMT"}], "update_date": "2008-09-04", "authors_parsed": [["Geil", "Olav", ""], ["Matsumoto", "Ryutaroh", ""], ["Thomsen", "Casper", ""]]}, {"id": "0806.4572", "submitter": "Vladimir Vyugin", "authors": "V.V.V'yugin", "title": "Problems of robustness for universal coding schemes", "comments": "23 pages", "journal-ref": "Problems of Information Transmission, 39 (2003), pp. 32-46", "doi": null, "report-no": null, "categories": "cs.IT cs.OH math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Lempel-Ziv universal coding scheme is asymptotically optimal for the\nclass of all stationary ergodic sources. A problem of robustness of this\nproperty under small violations of ergodicity is studied. A notion of\ndeficiency of algorithmic randomness is used as a measure of disagreement\nbetween data sequence and probability measure. We prove that universal\ncompressing schemes from a large class are non-robust in the following sense:\nif the randomness deficiency grows arbitrarily slowly on initial fragments of\nan infinite sequence then the property of asymptotic optimality of any\nuniversal compressing algorithm can be violated. Lempel-Ziv compressing\nalgorithms are robust on infinite sequences generated by ergodic Markov chains\nwhen the randomness deficiency of its initial fragments of length $n$ grows as\n$o(n)$.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 17:13:00 GMT"}], "update_date": "2008-06-30", "authors_parsed": [["V'yugin", "V. V.", ""]]}, {"id": "0806.4667", "submitter": "Kaibin Huang", "authors": "Kaibin Huang, Yan Chen, Bin Chen, Xia Yang, and Vincent K. N. Lau", "title": "Overlaid Cellular and Mobile Ad Hoc Networks", "comments": "5 pages; submitted to IEEE ICCS 2008 (Guangzhou, P.R.China)", "journal-ref": null, "doi": "10.1109/ICCS.2008.4737445", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In cellular systems using frequency division duplex, growing Internet\nservices cause unbalance of uplink and downlink traffic, resulting in poor\nuplink spectrum utilization. Addressing this issue, this paper considers\noverlaying an ad hoc network onto a cellular uplink network for improving\nspectrum utilization and spatial reuse efficiency. Transmission capacities of\nthe overlaid networks are analyzed, which are defined as the maximum densities\nof the ad hoc nodes and mobile users under an outage constraint. Using tools\nfrom stochastic geometry, the capacity tradeoff curves for the overlaid\nnetworks are shown to be linear. Deploying overlaid networks based on frequency\nseparation is proved to achieve higher network capacities than that based on\nspatial separation. Furthermore, spatial diversity is shown to enhance network\ncapacities.\n", "versions": [{"version": "v1", "created": "Sat, 28 Jun 2008 07:26:40 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Huang", "Kaibin", ""], ["Chen", "Yan", ""], ["Chen", "Bin", ""], ["Yang", "Xia", ""], ["Lau", "Vincent K. N.", ""]]}, {"id": "0806.4722", "submitter": "Lav Varshney", "authors": "Lav R. Varshney, Julius Kusuma, and Vivek K Goyal", "title": "Malleable Coding: Compressed Palimpsests", "comments": "39 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A malleable coding scheme considers not only compression efficiency but also\nthe ease of alteration, thus encouraging some form of recycling of an old\ncompressed version in the formation of a new one. Malleability cost is the\ndifficulty of synchronizing compressed versions, and malleable codes are of\nparticular interest when representing information and modifying the\nrepresentation are both expensive. We examine the trade-off between compression\nefficiency and malleability cost under a malleability metric defined with\nrespect to a string edit distance. This problem introduces a metric topology to\nthe compressed domain. We characterize the achievable rates and malleability as\nthe solution of a subgraph isomorphism problem. This can be used to argue that\nallowing conditional entropy of the edited message given the original message\nto grow linearly with block length creates an exponential increase in code\nlength.\n", "versions": [{"version": "v1", "created": "Sat, 28 Jun 2008 20:18:59 GMT"}], "update_date": "2008-07-01", "authors_parsed": [["Varshney", "Lav R.", ""], ["Kusuma", "Julius", ""], ["Goyal", "Vivek K", ""]]}, {"id": "0806.4737", "submitter": "Sang Won Choi", "authors": "Sang Won Choi and Sae-Young Chung", "title": "On the Multiplexing Gain of K-user Partially Connected Interference\n  Channel", "comments": "Submitted to IEEE Transactions on Information Theory\n  (Correspondence), June 29, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multiplexing gain (MUXG) of $K$-user interference channel (IC) with\npartially connected interfering links is analyzed. The motivation for the\npartially connected IC comes from the fact that not all interferences are\nequally strong in practice. The MUXG is characterized as a function of the\nnumber ($K$) of users and the number ($N \\geq 1$) of interfering links. Our\nanalysis is mainly based on the interference alignment (IA) technique to\nmitigate interference. Our main results are as follows: One may expect that\nhigher MUXG can be attained when some of interfering links do not exist.\nHowever, when $N$ is odd and $K=N+2$, the MUXG is not increased beyond the\noptimal MUXG of fully connected IC, which is $\\frac{KM}{2}$. The number of\ninterfering links has no influence on the achievable MUXG using IA, but affects\nthe efficiency in terms of the number of required channel realizations: When\nN=1 or 2, the optimal MUXG of the fully connected IC is achievable with a\nfinite number of channel realizations. In case of $N \\geq 3$, however, the MUXG\nof $\\frac{KM}{2}$ can be achieved asymptotically as the number of channel\nrealizations tends to infinity.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2008 08:01:52 GMT"}], "update_date": "2008-07-01", "authors_parsed": [["Choi", "Sang Won", ""], ["Chung", "Sae-Young", ""]]}, {"id": "0806.4773", "submitter": "Naftali Sommer", "authors": "Ofir Shalvi, Naftali Sommer, Meir Feder", "title": "Signal Codes", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/ITW.2003.1216761", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by signal processing, we present a new class of channel codes,\ncalled signal codes, for continuous-alphabet channels. Signal codes are lattice\ncodes whose encoding is done by convolving an integer information sequence with\na fixed filter pattern. Decoding is based on the bidirectional sequential stack\ndecoder, which can be implemented efficiently using the heap data structure.\nError analysis and simulation results indicate that signal codes can achieve\nlow error rate at approximately 1dB from channel capacity.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2008 16:30:34 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Shalvi", "Ofir", ""], ["Sommer", "Naftali", ""], ["Feder", "Meir", ""]]}, {"id": "0806.4874", "submitter": "Lawrence Ong", "authors": "Lawrence Ong, Mehul Motani", "title": "Myopic Coding in Multiterminal Networks", "comments": null, "journal-ref": "IEEE Transactions on Information Theory, Vol. 54, No. 7, pp.\n  3295-3314, Jul. 2008", "doi": "10.1109/TIT.2008.924675", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the interplay between cooperation and achievable\nrates in multi-terminal networks. Cooperation refers to the process of nodes\nworking together to relay data toward the destination. There is an inherent\ntradeoff between achievable information transmission rates and the level of\ncooperation, which is determined by how many nodes are involved and how the\nnodes encode/decode the data. We illustrate this trade-off by studying\ninformation-theoretic decode-forward based coding strategies for data\ntransmission in multi-terminal networks. Decode-forward strategies are usually\ndiscussed in the context of omniscient coding, in which all nodes in the\nnetwork fully cooperate with each other, both in encoding and decoding. In this\npaper, we investigate myopic coding, in which each node cooperates with only a\nfew neighboring nodes. We show that achievable rates of myopic decode-forward\ncan be as large as that of omniscient decode-forward in the low SNR regime. We\nalso show that when each node has only a few cooperating neighbors, adding one\nnode into the cooperation increases the transmission rate significantly.\nFurthermore, we show that myopic decode-forward can achieve non-zero rates as\nthe network size grows without bound.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2008 12:21:58 GMT"}], "update_date": "2010-04-15", "authors_parsed": [["Ong", "Lawrence", ""], ["Motani", "Mehul", ""]]}, {"id": "0806.4899", "submitter": "Mordecai Golin", "authors": "Mordecai Golin and Yan Zhang", "title": "A Dynamic Programming Approach To Length-Limited Huffman Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ``state-of-the-art'' in Length Limited Huffman Coding algorithms is the\n$\\Theta(ND)$-time, $\\Theta(N)$-space one of Hirschberg and Larmore, where $D\\le\nN$ is the length restriction on the code. This is a very clever, very problem\nspecific, technique. In this note we show that there is a simple\nDynamic-Programming (DP) method that solves the problem with the same time and\nspace bounds. The fact that there was an $\\Theta(ND)$ time DP algorithm was\npreviously known; it is a straightforward DP with the Monge property (which\npermits an order of magnitude speedup). It was not interesting, though, because\nit also required $\\Theta(ND)$ space. The main result of this paper is the\ntechnique developed for reducing the space. It is quite simple and applicable\nto many other problems modeled by DPs with the Monge property. We illustrate\nthis with examples from web-proxy design and wireless mobile paging.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2008 14:13:18 GMT"}], "update_date": "2008-07-01", "authors_parsed": [["Golin", "Mordecai", ""], ["Zhang", "Yan", ""]]}, {"id": "0806.4958", "submitter": "Venkatesh Saligrama", "authors": "Venkatesh Saligrama", "title": "Deterministic Designs with Deterministic Guarantees: Toeplitz Compressed\n  Sensing Matrices, Sequence Designs and System Identification", "comments": "added references. streamlined introduction", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a new family of discrete sequences having \"random\nlike\" uniformly decaying auto-correlation properties. The new class of infinite\nlength sequences are higher order chirps constructed using irrational numbers.\nExploiting results from the theory of continued fractions and diophantine\napproximations, we show that the class of sequences so formed has the property\nthat the worst-case auto-correlation coefficients for every finite length\nsequence decays at a polynomial rate. These sequences display doppler immunity\nas well. We also show that Toeplitz matrices formed from such sequences satisfy\nrestricted-isometry-property (RIP), a concept that has played a central role\nrecently in Compressed Sensing applications. Compressed sensing has\nconventionally dealt with sensing matrices with arbitrary components.\nNevertheless, such arbitrary sensing matrices are not appropriate for linear\nsystem identification and one must employ Toeplitz structured sensing matrices.\nLinear system identification plays a central role in a wide variety of\napplications such as channel estimation for multipath wireless systems as well\nas control system applications. Toeplitz matrices are also desirable on account\nof their filtering structure, which allows for fast implementation together\nwith reduced storage requirements.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2008 19:54:37 GMT"}, {"version": "v2", "created": "Mon, 28 Jul 2008 18:07:48 GMT"}], "update_date": "2008-07-28", "authors_parsed": [["Saligrama", "Venkatesh", ""]]}, {"id": "0806.4979", "submitter": "Salim El Rouayheb", "authors": "Salim Y. El Rouayheb, C. N. Georghiades, E. Soljanin, A. Sprintson", "title": "Bounds on Codes Based on Graph Theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $A_q(n,d)$ be the maximum order (maximum number of codewords) of a\n$q$-ary code of length $n$ and Hamming distance at least $d$. And let\n$A(n,d,w)$ that of a binary code of constant weight $w$. Building on results\nfrom algebraic graph theory and Erd\\H{o}s-ko-Rado like theorems in extremal\ncombinatorics, we show how several known bounds on $A_q(n,d)$ and $A(n,d,w)$\ncan be easily obtained in a single framework. For instance, both the Hamming\nand Singleton bounds can derived as an application of a property relating the\nclique number and the independence number of vertex transitive graphs. Using\nthe same techniques, we also derive some new bounds and present some additional\napplications.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2008 19:44:24 GMT"}], "update_date": "2008-07-01", "authors_parsed": [["Rouayheb", "Salim Y. El", ""], ["Georghiades", "C. N.", ""], ["Soljanin", "E.", ""], ["Sprintson", "A.", ""]]}]