[{"id": "0803.0316", "submitter": "Sandor P. Fekete", "authors": "Erik D. Demaine, Martin L. Demaine, Sandor P. Fekete, Mashhood\n  Ishaque, Eynat Rafalin, Robert T. Schweller and Diane Souvaine", "title": "Staged Self-Assembly:Nanomanufacture of Arbitrary Shapes with O(1) Glues", "comments": "22 pages, 15 figures, 1table, PDFLatex; conference version in\n  Proceedings of the 13th International Meeting on DNA Computing (DNA13), 2007,\n  pp. 46-55, full version to appear in Natural Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce staged self-assembly of Wang tiles, where tiles can be added\ndynamically in sequence and where intermediate constructions can be stored for\nlater mixing. This model and its various constraints and performance measures\nare motivated by a practical nanofabrication scenario through protein-based\nbioengineering. Staging allows us to break through the traditional lower bounds\nin tile self-assembly by encoding the shape in the staging algorithm instead of\nthe tiles. All of our results are based on the practical assumption that only a\nconstant number of glues, and thus only a constant number of tiles, can be\nengineered, as each new glue type requires significant biochemical research and\nexperiments. Under this assumption, traditional tile self-assembly cannot even\nmanufacture an n*n square; in contrast, we show how staged assembly enables\nmanufacture of arbitrary orthogonal shapes in a variety of precise formulations\nof the model.\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2008 20:20:52 GMT"}], "update_date": "2008-03-04", "authors_parsed": [["Demaine", "Erik D.", ""], ["Demaine", "Martin L.", ""], ["Fekete", "Sandor P.", ""], ["Ishaque", "Mashhood", ""], ["Rafalin", "Eynat", ""], ["Schweller", "Robert T.", ""], ["Souvaine", "Diane", ""]]}, {"id": "0803.0858", "submitter": "Oleg Verbitsky", "authors": "Mihyun Kang, Oleg Pikhurko, Alexander Ravsky, Mathias Schacht, Oleg\n  Verbitsky", "title": "Untangling planar graphs from a specified vertex position - Hard cases", "comments": "18 pages, 4 figures. Lemma 3.3 is corrected, several amendments are\n  made throughout the paper", "journal-ref": "Discrete Applied Mathematics 159:8 (2011) 789-799", "doi": "10.1016/j.dam.2011.01.011", "report-no": null, "categories": "cs.DM cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a planar graph $G$, we consider drawings of $G$ in the plane where\nedges are represented by straight line segments (which possibly intersect).\nSuch a drawing is specified by an injective embedding $\\pi$ of the vertex set\nof $G$ into the plane. We prove that a wheel graph $W_n$ admits a drawing $\\pi$\nsuch that, if one wants to eliminate edge crossings by shifting vertices to new\npositions in the plane, then at most $(2+o(1))\\sqrt n$ of all $n$ vertices can\nstay fixed. Moreover, such a drawing $\\pi$ exists even if it is presupposed\nthat the vertices occupy any prescribed set of points in the plane. Similar\nquestions are discussed for other families of planar graphs.\n", "versions": [{"version": "v1", "created": "Thu, 6 Mar 2008 13:08:41 GMT"}, {"version": "v2", "created": "Mon, 31 Mar 2008 17:15:12 GMT"}, {"version": "v3", "created": "Tue, 30 Dec 2008 22:44:03 GMT"}, {"version": "v4", "created": "Wed, 3 Jun 2009 13:26:44 GMT"}, {"version": "v5", "created": "Tue, 23 Nov 2010 09:59:13 GMT"}], "update_date": "2011-05-20", "authors_parsed": [["Kang", "Mihyun", ""], ["Pikhurko", "Oleg", ""], ["Ravsky", "Alexander", ""], ["Schacht", "Mathias", ""], ["Verbitsky", "Oleg", ""]]}, {"id": "0803.1110", "submitter": "Olivier Ruatta", "authors": "Daouda Niang Diatta (XLIM), Bernard Mourrain (INRIA Sophia Antipolis),\n  Olivier Ruatta (XLIM)", "title": "On the Computation of the Topology of a Non-Reduced Implicit Space Curve", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AC cs.CG cs.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An algorithm is presented for the computation of the topology of a\nnon-reduced space curve defined as the intersection of two implicit algebraic\nsurfaces. It computes a Piecewise Linear Structure (PLS) isotopic to the\noriginal space curve. The algorithm is designed to provide the exact result for\nall inputs. It's a symbolic-numeric algorithm based on subresultant\ncomputation. Simple algebraic criteria are given to certify the output of the\nalgorithm. The algorithm uses only one projection of the non-reduced space\ncurve augmented with adjacency information around some \"particular points\" of\nthe space curve. The algorithm is implemented with the Mathemagix Computer\nAlgebra System (CAS) using the SYNAPS library as a backend.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2008 15:28:52 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Diatta", "Daouda Niang", "", "XLIM"], ["Mourrain", "Bernard", "", "INRIA Sophia Antipolis"], ["Ruatta", "Olivier", "", "XLIM"]]}, {"id": "0803.1296", "submitter": "Steve Oudot", "authors": "Steve Y. Oudot", "title": "On the Topology of the Restricted Delaunay Triangulation and Witness\n  Complex in Higher Dimensions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is a well-known fact that, under mild sampling conditions, the restricted\nDelaunay triangulation provides good topological approximations of 1- and\n2-manifolds. We show that this is not the case for higher-dimensional\nmanifolds, even under stronger sampling conditions. Specifically, it is not\ntrue that, for any compact closed submanifold M of R^n, and any sufficiently\ndense uniform sampling L of M, the Delaunay triangulation of L restricted to M\nis homeomorphic to M, or even homotopy equivalent to it. Besides, it is not\ntrue either that, for any sufficiently dense set W of witnesses, the witness\ncomplex of L relative to M contains or is contained in the restricted Delaunay\ntriangulation of L.\n", "versions": [{"version": "v1", "created": "Sun, 9 Mar 2008 13:47:43 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Oudot", "Steve Y.", ""]]}, {"id": "0803.2447", "submitter": "Luciano da Fontoura Costa", "authors": "Luciano da Fontoura Costa", "title": "Trajectory Networks and Their Topological Changes Induced by\n  Geographical Infiltration", "comments": "10 pages, 8 figures. A working manuscript: suggestions and\n  collaborations welcomed", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we investigate the topological changes undergone by\ntrajectory networks as a consequence of progressive geographical infiltration.\nTrajectory networks, a type of knitted network, are obtained by establishing\npaths between geographically distributed nodes while following an associated\nvector field. For instance, the nodes could correspond to neurons along the\ncortical surface and the vector field could correspond to the gradient of\nneurotrophic factors, or the nodes could represent towns while the vector\nfields would be given by economical and/or geographical gradients. Therefore\ntrajectory networks are natural models of a large number of geographical\nstructures. The geographical infiltrations correspond to the addition of new\nlocal connections between nearby existing nodes. As such, these infiltrations\ncould be related to several real-world processes such as contaminations,\ndiseases, attacks, parasites, etc. The way in which progressive geographical\ninfiltrations affect trajectory networks is investigated in terms of the\ndegree, clustering coefficient, size of the largest component and the lengths\nof the existing chains measured along the infiltrations. It is shown that the\nmaximum infiltration distance plays a critical role in the intensity of the\ninduced topological changes. For large enough values of this parameter, the\nchains intrinsic to the trajectory networks undergo a collapse which is shown\nnot to be related to the percolation of the network also implied by the\ninfiltrations.\n", "versions": [{"version": "v1", "created": "Mon, 17 Mar 2008 13:52:39 GMT"}, {"version": "v2", "created": "Mon, 21 Apr 2008 19:24:31 GMT"}], "update_date": "2008-04-21", "authors_parsed": [["Costa", "Luciano da Fontoura", ""]]}]