[{"id": "1610.00155", "submitter": "Herman Haverkort", "authors": "Herman Haverkort", "title": "How many three-dimensional Hilbert curves are there?", "comments": "No change since previous arXiv version. Please check out the version\n  in Journal of Computational Geometry: the text has been thoroughly\n  restructured, including some new information. This article extends, improves\n  and replaces most of my brief preliminary manuscript \"An inventory of\n  three-dimensional Hilbert space-filling curves\" (arXiv:1109.2323)", "journal-ref": "Journal of Computational Geometry 8(1):206-281 (2017)", "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hilbert's two-dimensional space-filling curve is appreciated for its good\nlocality-preserving properties and easy implementation for many applications.\nHowever, Hilbert did not describe how to generalize his construction to higher\ndimensions. In fact, the number of ways in which this may be done ranges from\nzero to infinite, depending on what properties of the Hilbert curve one\nconsiders to be essential.\n  In this work we take the point of view that a Hilbert curve should at least\nbe self-similar and traverse cubes octant by octant. We organize and explore\nthe space of possible three-dimensional Hilbert curves and the potentially\nuseful properties which they may have. We discuss a notation system that allows\nus to distinguish the curves from one another and enumerate them. This system\nhas been implemented in a software prototype, available from the author's\nwebsite. Several examples of possible three-dimensional Hilbert curves are\npresented, including a curve that visits the points on most sides of the unit\ncube in the order of the two-dimensional Hilbert curve; curves of which not\nonly the eight octants are similar to each other, but also the four quarters; a\ncurve with excellent locality-preserving properties and endpoints that are not\nvertices of the cube; a curve in which all but two octants are each other's\nimages with respect to reflections in axis-parallel planes; and curves that can\nbe sketched on a grid without using vertical line segments. In addition, we\ndiscuss several four-dimensional Hilbert curves.\n", "versions": [{"version": "v1", "created": "Sat, 1 Oct 2016 16:18:55 GMT"}, {"version": "v2", "created": "Thu, 9 Nov 2017 15:52:53 GMT"}], "update_date": "2017-11-10", "authors_parsed": [["Haverkort", "Herman", ""]]}, {"id": "1610.00300", "submitter": "Sayan Bandyapadhyay", "authors": "Sayan Bandyapadhyay, Aritra Banik", "title": "Polynomial Time Algorithms for Bichromatic Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we consider a collection of geometric problems involving\npoints colored by two colors (red and blue), referred to as bichromatic\nproblems. The motivation behind studying these problems is two fold; (i) these\nproblems appear naturally and frequently in the fields like Machine learning,\nData mining, and so on, and (ii) we are interested in extending the algorithms\nand techniques for single point set (monochromatic) problems to bichromatic\ncase. For all the problems considered in this paper, we design low polynomial\ntime exact algorithms. These algorithms are based on novel techniques which\nmight be of independent interest.\n", "versions": [{"version": "v1", "created": "Sun, 2 Oct 2016 16:12:07 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Bandyapadhyay", "Sayan", ""], ["Banik", "Aritra", ""]]}, {"id": "1610.00361", "submitter": "Csaba D. Toth", "authors": "Hugo A. Akitaya and Csaba D. T\\'oth", "title": "Reconstruction of weakly simple polygons from their edges", "comments": "15 pages, 8 figures. The first 12 pages will appear in the\n  Proceedings of the 27th International Symposium on Algorithms and Computation\n  (December 12-14 2016, Sydney, Australia)", "journal-ref": "Internat. J. Comput. Geom. Appl. 28 (2) (2018) 161-180", "doi": "10.1142/S021819591860004X", "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given $n$ line segments in the plane, do they form the edge set of a\n\\emph{weakly simple polygon}; that is, can the segment endpoints be perturbed\nby at most $\\varepsilon$, for any $\\varepsilon>0$, to obtain a simple polygon?\nWhile the analogous question for \\emph{simple polygons} can easily be answered\nin $O(n\\log n)$ time, we show that it is NP-complete for weakly simple\npolygons. We give $O(n)$-time algorithms in two special cases: when all\nsegments are collinear, or the segment endpoints are in general position. These\nresults extend to the variant in which the segments are \\emph{directed}, and\nthe counterclockwise traversal of a polygon should follow the orientation.\n  We study related problems for the case that the union of the $n$ input\nsegments is connected. (i) If each segment can be subdivided into several\nsegments, find the minimum number of subdivision points to form a weakly simple\npolygon. (ii) If new line segments can be added, find the minimum total length\nof new segments that creates a weakly simple polygon. We give worst-case upper\nand lower bounds for both problems.\n", "versions": [{"version": "v1", "created": "Sun, 2 Oct 2016 22:12:56 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Akitaya", "Hugo A.", ""], ["Tóth", "Csaba D.", ""]]}, {"id": "1610.00652", "submitter": "Leo Liberti", "authors": "Leo Liberti and Carlile Lavor", "title": "Open research areas in distance geometry", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.MG cs.CG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distance Geometry is based on the inverse problem that asks to find the\npositions of points, in a Euclidean space of given dimension, that are\ncompatible with a given set of distances. We briefly introduce the field, and\ndiscuss some open and promising research areas.\n", "versions": [{"version": "v1", "created": "Mon, 3 Oct 2016 18:04:34 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Liberti", "Leo", ""], ["Lavor", "Carlile", ""]]}, {"id": "1610.00752", "submitter": "Mason A. Porter", "authors": "Bernadette J. Stolz, Heather A. Harrington, and Mason A. Porter", "title": "The Topological \"Shape\" of Brexit", "comments": "9 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.AT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Persistent homology is a method from computational algebraic topology that\ncan be used to study the \"shape\" of data. We illustrate two filtrations --- the\nweight rank clique filtration and the Vietoris--Rips (VR) filtration --- that\nare commonly used in persistent homology, and we apply these filtrations to a\npair of data sets that are both related to the 2016 European Union \"Brexit\"\nreferendum in the United Kingdom. These examples consider a topical situation\nand give useful illustrations of the strengths and weaknesses of these methods.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 13:51:57 GMT"}], "update_date": "2016-10-30", "authors_parsed": [["Stolz", "Bernadette J.", ""], ["Harrington", "Heather A.", ""], ["Porter", "Mason A.", ""]]}, {"id": "1610.00952", "submitter": "Bodhayan Roy", "authors": "Ajit Arvind Diwan, Bodhayan Roy", "title": "On colouring point visibility graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show that it can be decided in polynomial time whether or\nnot the visibility graph of a given point set is 4-colourable, and such a\n4-colouring, if it exists, can also be constructed in polynomial time. We show\nthat the problem of deciding whether the visibility graph of a point set is\n5-colourable, is NP-complete. We give an example of a point visibility graph\nthat has chromatic number 6 while its clique number is only 4.\n", "versions": [{"version": "v1", "created": "Tue, 4 Oct 2016 12:39:26 GMT"}, {"version": "v2", "created": "Sat, 24 Jun 2017 23:07:08 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Diwan", "Ajit Arvind", ""], ["Roy", "Bodhayan", ""]]}, {"id": "1610.01341", "submitter": "Mladen Kova\\v{c}evi\\'c", "authors": "Mladen Kova\\v{c}evi\\'c, Vincent Y. F. Tan", "title": "Improved Bounds on Sidon Sets via Lattice Packings of Simplices", "comments": "9 pages, 2 figures", "journal-ref": "SIAM J. Discrete Math., vol. 31, no. 3, pp. 2269-2278, 2017", "doi": "10.1137/16M1099182", "report-no": null, "categories": "math.CO cs.CG cs.IT math.GR math.IT math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A $ B_h $ set (or Sidon set of order $ h $) in an Abelian group $ G $ is any\nsubset $ \\{b_0, b_1, \\ldots,b_{n}\\} $ of $ G $ with the property that all the\nsums $ b_{i_1} + \\cdots + b_{i_h} $ are different up to the order of the\nsummands. Let $ \\phi(h,n) $ denote the order of the smallest Abelian group\ncontaining a $ B_h $ set of cardinality $ n + 1 $. It is shown that \\[ \\lim_{h\n\\to \\infty} \\frac{ \\phi(h,n) }{ h^n } = \\frac{1}{n! \\delta_L(\\triangle^n)} , \\]\nwhere $ \\delta_L(\\triangle^n) $ is the lattice packing density of an $ n\n$-simplex in Euclidean space. This determines the asymptotics exactly in cases\nwhere this density is known ($ n \\leq 3 $) and gives improved bounds on $\n\\phi(h,n) $ in the remaining cases. The corresponding geometric\ncharacterization of bases of order $ h $ in finite Abelian groups in terms of\nlattice coverings by simplices is also given.\n", "versions": [{"version": "v1", "created": "Wed, 5 Oct 2016 10:10:40 GMT"}, {"version": "v2", "created": "Sat, 8 Oct 2016 15:37:35 GMT"}, {"version": "v3", "created": "Thu, 17 Nov 2016 07:23:14 GMT"}, {"version": "v4", "created": "Thu, 18 May 2017 07:39:40 GMT"}, {"version": "v5", "created": "Thu, 28 Sep 2017 15:39:49 GMT"}], "update_date": "2020-08-13", "authors_parsed": [["Kovačević", "Mladen", ""], ["Tan", "Vincent Y. F.", ""]]}, {"id": "1610.02841", "submitter": "Fabrizio Frati", "authors": "Fabrizio Frati, Maurizio Patrignani, Vincenzo Roselli", "title": "LR-Drawings of Ordered Rooted Binary Trees and Near-Linear Area Drawings\n  of Outerplanar Graphs", "comments": "A preliminary version appears at SODA 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a family of algorithms, introduced by Chan [SODA 1999]\nand called LR-algorithms, for drawing ordered rooted binary trees. In\nparticular, we are interested in constructing LR-drawings (that are drawings\nobtained via LR-algorithms) with small width. Chan showed three different\nLR-algorithms that achieve, for an ordered rooted binary tree with $n$ nodes,\nwidth $O(n^{0.695})$, width $O(n^{0.5})$, and width $O(n^{0.48})$.\n  We prove that, for every $n$-node ordered rooted binary tree, an LR-drawing\nwith minimum width can be constructed in $O(n^{1.48})$ time. Further, we show\nan infinite family of $n$-node ordered rooted binary trees requiring\n$\\Omega(n^{0.418})$ width in any LR-drawing; no lower bound better than\n$\\Omega(\\log n)$ was previously known. Finally, we present the results of an\nexperimental evaluation that allowed us to determine the minimum width of all\nthe ordered rooted binary trees with up to $451$ nodes.\n  Our interest in LR-drawings is mainly motivated by a result of Di Battista\nand Frati [Algorithmica 2009], who proved that $n$-vertex outerplanar graphs\nhave outerplanar straight-line drawings in $O(n^{1.48})$ area by means of a\ndrawing algorithm which resembles an LR-algorithm.\n  We deepen the connection between LR-drawings and outerplanar straight-line\ndrawings by proving that, if $n$-node ordered rooted binary trees have\nLR-drawings with $f(n)$ width, for any function $f(n)$, then $n$-vertex\nouterplanar graphs have outerplanar straight-line drawings in $O(f(n))$ area.\n  Finally, we exploit a structural decomposition for ordered rooted binary\ntrees introduced by Chan in order to prove that every $n$-vertex outerplanar\ngraph has an outerplanar straight-line drawing in $O(n\\cdot 2^{\\sqrt{2 \\log_2\nn}} \\sqrt{\\log n})$ area.\n", "versions": [{"version": "v1", "created": "Mon, 10 Oct 2016 10:41:08 GMT"}, {"version": "v2", "created": "Thu, 13 Oct 2016 06:44:27 GMT"}, {"version": "v3", "created": "Sat, 22 Oct 2016 07:36:47 GMT"}], "update_date": "2016-10-25", "authors_parsed": [["Frati", "Fabrizio", ""], ["Patrignani", "Maurizio", ""], ["Roselli", "Vincenzo", ""]]}, {"id": "1610.03129", "submitter": "Aditya Tatu Dr.", "authors": "Aditya Tatu", "title": "Tangled Splines", "comments": "12 pages, To be sent to a Journal/Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extracting shape information from object bound- aries is a well studied\nproblem in vision, and has found tremen- dous use in applications like object\nrecognition. Conversely, studying the space of shapes represented by curves\nsatisfying certain constraints is also intriguing. In this paper, we model and\nanalyze the space of shapes represented by a 3D curve (space curve) formed by\nconnecting n pieces of quarter of a unit circle. Such a space curve is what we\ncall a Tangle, the name coming from a toy built on the same principle. We\nprovide two models for the shape space of n-link open and closed tangles, and\nwe show that tangles are a subset of trigonometric splines of a certain order.\nWe give algorithms for curve approximation using open/closed tangles, computing\ngeodesics on these shape spaces, and to find the deformation that takes one\ngiven tangle to another given tangle, i.e., the Log map. The algorithms\nprovided yield tangles upto a small and acceptable tolerance, as shown by the\nresults given in the paper.\n", "versions": [{"version": "v1", "created": "Mon, 10 Oct 2016 23:31:18 GMT"}], "update_date": "2016-10-12", "authors_parsed": [["Tatu", "Aditya", ""]]}, {"id": "1610.03812", "submitter": "Khaled Elbassioni", "authors": "Khaled Elbassioni", "title": "Finding Small Hitting Sets in Infinite Range Spaces of Bounded\n  VC-dimension", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of finding a small hitting set in an {\\it infinite}\nrange space $\\cF=(Q,\\cR)$ of bounded VC-dimension. We show that, under\nreasonably general assumptions, the infinite dimensional convex relaxation can\nbe solved (approximately) efficiently by multiplicative weight updates. As a\nconsequence, we get an algorithm that finds, for any $\\delta>0$, a set of size\n$O(s_{\\cF}(z^*_\\cF))$ that hits $(1-\\delta)$-fraction of $\\cR$ (with respect to\na given measure) in time proportional to $\\log(\\frac{1}{\\delta})$, where\n$s_{\\cF}(\\frac{1}{\\epsilon})$ is the size of the smallest $\\epsilon$-net the\nrange space admits, and $z^*_{\\cF}$ is the value of the {\\it fractional}\noptimal solution. This {\\it exponentially} improves upon previous results which\nachieve the same approximation guarantees with running time proportional to\n$\\poly(\\frac{1}{\\delta})$. Our assumptions hold, for instance, in the case when\nthe range space represents the {\\it visibility} regions of a polygon in\n$\\RR^2$, giving thus a deterministic polynomial time $O(\\log\nz^*_{\\cF})$-approximation algorithm for guarding $(1-\\delta)$-fraction of the\narea of any given simple polygon, with running time proportional to\n$\\polylog(\\frac{1}{\\delta})$.\n", "versions": [{"version": "v1", "created": "Wed, 12 Oct 2016 18:21:42 GMT"}, {"version": "v2", "created": "Mon, 13 Feb 2017 07:42:55 GMT"}], "update_date": "2017-02-14", "authors_parsed": [["Elbassioni", "Khaled", ""]]}, {"id": "1610.04531", "submitter": "Hamid Laga", "authors": "Hamid Laga, Qian Xie, Ian H. Jermyn, and Anuj Srivastava", "title": "Numerical Inversion of SRNF Maps for Elastic Shape Analysis of\n  Genus-Zero Surfaces", "comments": null, "journal-ref": "IEEE Transactions on Pattern Analysis and Machine Intelligence,\n  2017", "doi": "10.1109/TPAMI.2016.2647596", "report-no": "Volume: 39 , Issue: 12", "categories": "cs.GR cs.CG cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent developments in elastic shape analysis (ESA) are motivated by the fact\nthat it provides comprehensive frameworks for simultaneous registration,\ndeformation, and comparison of shapes. These methods achieve computational\nefficiency using certain square-root representations that transform invariant\nelastic metrics into Euclidean metrics, allowing for applications of standard\nalgorithms and statistical tools. For analyzing shapes of embeddings of\n$\\mathbb{S}^2$ in $\\mathbb{R}^3$, Jermyn et al. introduced square-root normal\nfields (SRNFs) that transformed an elastic metric, with desirable invariant\nproperties, into the $\\mathbb{L}^2$ metric. These SRNFs are essentially surface\nnormals scaled by square-roots of infinitesimal area elements. A critical need\nin shape analysis is to invert solutions (deformations, averages, modes of\nvariations, etc) computed in the SRNF space, back to the original surface space\nfor visualizations and inferences. Due to the lack of theory for understanding\nSRNFs maps and their inverses, we take a numerical approach and derive an\nefficient multiresolution algorithm, based on solving an optimization problem\nin the surface space, that estimates surfaces corresponding to given SRNFs.\nThis solution is found effective, even for complex shapes, e.g. human bodies\nand animals, that undergo significant deformations including bending and\nstretching. Specifically, we use this inversion for computing elastic shape\ndeformations, transferring deformations, summarizing shapes, and for finding\nmodes of variability in a given collection, while simultaneously registering\nthe surfaces. We demonstrate the proposed algorithms using a statistical\nanalysis of human body shapes, classification of generic surfaces and analysis\nof brain structures.\n", "versions": [{"version": "v1", "created": "Fri, 14 Oct 2016 16:56:49 GMT"}], "update_date": "2019-06-18", "authors_parsed": [["Laga", "Hamid", ""], ["Xie", "Qian", ""], ["Jermyn", "Ian H.", ""], ["Srivastava", "Anuj", ""]]}, {"id": "1610.05214", "submitter": "Soledad Villar", "authors": "Soledad Villar and Afonso S. Bandeira and Andrew J. Blumberg and\n  Rachel Ward", "title": "A polynomial-time relaxation of the Gromov-Hausdorff distance", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GT cs.CG math.OC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Gromov-Hausdorff distance provides a metric on the set of isometry\nclasses of compact metric spaces. Unfortunately, computing this metric directly\nis believed to be computationally intractable. Motivated by applications in\nshape matching and point-cloud comparison, we study a semidefinite programming\nrelaxation of the Gromov-Hausdorff metric. This relaxation can be computed in\npolynomial time, and somewhat surprisingly is itself a pseudometric. We\ndescribe the induced topology on the set of compact metric spaces. Finally, we\ndemonstrate the numerical performance of various algorithms for computing the\nrelaxed distance and apply these algorithms to several relevant data sets. In\nparticular we propose a greedy algorithm for finding the best correspondence\nbetween finite metric spaces that can handle hundreds of points.\n", "versions": [{"version": "v1", "created": "Mon, 17 Oct 2016 17:18:45 GMT"}, {"version": "v2", "created": "Tue, 18 Oct 2016 20:40:13 GMT"}], "update_date": "2016-10-20", "authors_parsed": [["Villar", "Soledad", ""], ["Bandeira", "Afonso S.", ""], ["Blumberg", "Andrew J.", ""], ["Ward", "Rachel", ""]]}, {"id": "1610.06457", "submitter": "Ahmad Biniaz", "authors": "Ahmad Biniaz", "title": "Matchings in Geometric Graphs", "comments": "159 pages, PhD thesis. This thesis contains chapters based on\n  arXiv:1311.5197, arXiv:1410.0540, arXiv:1409.5466, arXiv:1503.04871, and\n  arXiv:1501.03686", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A geometric graph is a graph whose vertex set is a set of points in the plane\nand whose edge set contains straight-line segments. A matching in a graph is a\nsubset of edges of the graph with no shared vertices. A matching is called\nperfect if it matches all the vertices of the underling graph. A geometric\nmatching is a matching in a geometric graph. In this thesis, we study matching\nproblems in various geometric graphs. Among the family of geometric graphs we\nlook at complete graphs, complete bipartite graphs, complete multipartite\ngraphs, Delaunay graphs, Gabriel graphs, and $\\Theta$-graphs. The classical\nmatching problem is to find a matching of maximum size in a given graph. We\nstudy this problem as well as some of its variants on geometric graphs. The\nbottleneck matching problem is to find a maximum matching that minimizes the\nlength of the longest edge. The plane matching problem is to find a maximum\nmatching so that the edges in the matching are pairwise non-crossing. A\ngeometric matching is strong with respect to a given shape $S$ if we can assign\nto each edge in the matching a scaled version of $S$ such that the shapes\nrepresenting the edges are pairwise disjoint. The strong matching problem is to\nfind a maximum strong matching with respect to a given shape. The matching\npacking problem is to pack as many edge-disjoint perfect matchings as possible\ninto a geometric graph. We study these problems and establish lower and upper\nbounds on the size of different kinds of matchings in various geometric graphs.\nWe also present algorithms for computing such matchings. Some of the presented\nbounds are tight, while the others need to be sharpened.\n", "versions": [{"version": "v1", "created": "Thu, 20 Oct 2016 15:32:45 GMT"}], "update_date": "2016-10-21", "authors_parsed": [["Biniaz", "Ahmad", ""]]}, {"id": "1610.07144", "submitter": "Radoslav Fulek", "authors": "Radoslav Fulek", "title": "Bounded embeddings of graphs in the plane", "comments": "extended abstract appeared in the Proc. of IWOCA2016, partial overlap\n  with \"Toward the Hanani-Tutte Theorem for Clustered Graphs\",\n  arXiv:1410.3022v8, the proof of the characterization simplified", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A drawing in the plane ($\\mathbb{R}^2$) of a graph $G=(V,E)$ equipped with a\nfunction $\\gamma: V \\rightarrow \\mathbb{N}$ is \\emph{$x$-bounded} if (i) $x(u)\n<x(v)$ whenever $\\gamma(u)<\\gamma(v)$ and (ii) $\\gamma(u)\\leq\\gamma(w)\\leq\n\\gamma(v)$, where $uv\\in E$ and $\\gamma(u)\\leq \\gamma(v)$, whenever $x(w)\\in\nx(uv)$, where $x(.)$ denotes the projection to the $x$-axis. We prove a\ncharacterization of isotopy classes of graph embeddings in the plane containing\nan $x$-bounded embedding. Then we present an efficient algorithm, that relies\non our result, for testing the existence of an $x$-bounded embedding if the\ngiven graph is a tree or generalized $\\Theta$-graph. This partially answers a\nquestion raised recently by Angelini et al. and Chang et al., and proves that\nc-planarity testing of flat clustered graphs with three clusters is tractable\nif each connected component of the underlying abstract graph is a tree.\n", "versions": [{"version": "v1", "created": "Sun, 23 Oct 2016 10:50:57 GMT"}], "update_date": "2016-10-25", "authors_parsed": [["Fulek", "Radoslav", ""]]}, {"id": "1610.08543", "submitter": "Mahdi Imanparast", "authors": "Mahdi Imanparast, Seyed Naser Hashemi, Ali Mohades", "title": "An efficient approximation for point-set diameter in higher dimensions", "comments": null, "journal-ref": "Proceedings of the 30th Canadian Conference on Computational\n  Geometry (CCCG 2018), pages 72-77, 2018", "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the problem of computing the diameter of a set of $n$\npoints in $d$-dimensional Euclidean space for a fixed dimension $d$, and\npropose a new $(1+\\varepsilon)$-approximation algorithm with $O(n+\n1/\\varepsilon^{d-1})$ time and $O(n)$ space, where $0 < \\varepsilon\\leqslant\n1$. We also show that the proposed algorithm can be modified to a\n$(1+O(\\varepsilon))$-approximation algorithm with $O(n+\n1/\\varepsilon^{\\frac{2d}{3}-\\frac{1}{3}})$ running time. These results provide\nsome improvements in comparison with existing algorithms in terms of simplicity\nand data structure.\n", "versions": [{"version": "v1", "created": "Wed, 26 Oct 2016 20:40:09 GMT"}, {"version": "v2", "created": "Mon, 7 Nov 2016 20:28:35 GMT"}, {"version": "v3", "created": "Sat, 26 Nov 2016 09:42:48 GMT"}, {"version": "v4", "created": "Sat, 10 Dec 2016 17:10:01 GMT"}, {"version": "v5", "created": "Sun, 16 Apr 2017 09:23:58 GMT"}, {"version": "v6", "created": "Tue, 18 Apr 2017 19:00:31 GMT"}, {"version": "v7", "created": "Tue, 7 May 2019 07:14:26 GMT"}], "update_date": "2019-05-08", "authors_parsed": [["Imanparast", "Mahdi", ""], ["Hashemi", "Seyed Naser", ""], ["Mohades", "Ali", ""]]}, {"id": "1610.08923", "submitter": "Zeev Dvir", "authors": "Zeev Dvir and Ankit Garg and Rafael Oliveira and J\\'ozsef Solymosi", "title": "Rank bounds for design matrices with block entries and geometric\n  applications", "comments": "Published in Discrete Analysis", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Design matrices are sparse matrices in which the supports of different\ncolumns intersect in a few positions. Such matrices come up naturally when\nstudying problems involving point sets with many collinear triples. In this\nwork we consider design matrices with block (or matrix) entries. Our main\nresult is a lower bound on the rank of such matrices, extending the bounds\nproved in {BDWY12,DSW12} for the scalar case. As a result we obtain several\napplications in combinatorial geometry. The first application involves\nextending the notion of structural rigidity (or graph rigidity) to the setting\nwhere we wish to bound the number of `degrees of freedom' in perturbing a set\nof points under collinearity constraints (keeping some family of triples\ncollinear). Other applications are an asymptotically tight Sylvester-Gallai\ntype result for arrangements of subspaces (improving {DH16}) and a new\nincidence bound for high dimensional line/curve arrangements.\n  The main technical tool in the proof of the rank bound is an extension of the\ntechnique of matrix scaling to the setting of block matrices. We generalize the\ndefinition of doubly stochastic matrices to matrices with block entries and\nderive sufficient conditions for a doubly stochastic scaling to exist.\n", "versions": [{"version": "v1", "created": "Thu, 27 Oct 2016 18:48:01 GMT"}, {"version": "v2", "created": "Mon, 12 Mar 2018 14:00:24 GMT"}], "update_date": "2018-03-13", "authors_parsed": [["Dvir", "Zeev", ""], ["Garg", "Ankit", ""], ["Oliveira", "Rafael", ""], ["Solymosi", "József", ""]]}, {"id": "1610.09051", "submitter": "Tingran Gao", "authors": "Tingran Gao, Jacek Brodzki, Sayan Mukherjee", "title": "The Geometry of Synchronization Problems and Learning Group Actions", "comments": "43 pages, 6 figures. To appear in Discrete \\& Computational Geometry", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.CG stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a geometric framework that characterizes the synchronization\nproblem --- the problem of consistently registering or aligning a collection of\nobjects. The theory we formulate characterizes the cohomological nature of\nsynchronization based on the classical theory of fibre bundles. We first\nestablish the correspondence between synchronization problems in a topological\ngroup $G$ over a connected graph $\\Gamma$ and the moduli space of flat\nprincipal $G$-bundles over $\\Gamma$, and develop a discrete analogy of the\nrenowned theorem of classifying flat principal bundles with fix base and\nstructural group using the representation variety. In particular, we show that\nprescribing an edge potential on a graph is equivalent to specifying an\nequivalence class of flat principal bundles, of which the triviality of\nholonomy dictates the synchronizability of the edge potential. We then develop\na twisted cohomology theory for associated vector bundles of the flat principal\nbundle arising from an edge potential, which is a discrete version of the\ntwisted cohomology in differential geometry. This theory realizes the\nobstruction to synchronizability as a cohomology group of the twisted de Rham\ncochain complex. We then build a discrete twisted Hodge theory --- a fibre\nbundle analog of the discrete Hodge theory on graphs --- which geometrically\nrealizes the graph connection Laplacian as a Hodge Laplacian of degree zero.\nMotivated by our geometric framework, we study the problem of learning group\nactions --- partitioning a collection of objects based on the local\nsynchronizability of pairwise correspondence relations. A dual interpretation\nis to learn finitely generated subgroups of an ambient transformation group\nfrom noisy observed group elements. A synchronization-based algorithm is also\nprovided, and we demonstrate its efficacy using simulations and real data.\n", "versions": [{"version": "v1", "created": "Fri, 28 Oct 2016 01:20:52 GMT"}, {"version": "v2", "created": "Sun, 7 Apr 2019 03:46:08 GMT"}, {"version": "v3", "created": "Tue, 14 May 2019 03:51:35 GMT"}], "update_date": "2019-05-15", "authors_parsed": [["Gao", "Tingran", ""], ["Brodzki", "Jacek", ""], ["Mukherjee", "Sayan", ""]]}, {"id": "1610.09774", "submitter": "Seth Pettie", "authors": "Julian Wellman and Seth Pettie", "title": "Lower Bounds on Davenport-Schinzel Sequences via Rectangular\n  Zarankiewicz Matrices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An order-$s$ Davenport-Schinzel sequence over an $n$-letter alphabet is one\navoiding immediate repetitions and alternating subsequences with length $s+2$.\nThe main problem is to determine the maximum length of such a sequence, as a\nfunction of $n$ and $s$. When $s$ is fixed this problem has been settled but\nwhen $s$ is a function of $n$, very little is known about the extremal function\n$\\lambda(s,n)$ of such sequences.\n  In this paper we give a new recursive construction of Davenport-Schinzel\nsequences that is based on dense 0-1 matrices avoiding large all-1 submatrices\n(aka Zarankiewicz's Problem.) In particular, we give a simple construction of\n$n^{2/t} \\times n$ matrices containing $n^{1+1/t}$ 1s that avoid $t\\times 2$\nall-1 submatrices.\n  Our lower bounds on $\\lambda(s,n)$ exhibit three qualitatively different\nbehaviors depending on the size of $s$ relative to $n$. When $s \\le \\log\\log n$\nwe show that $\\lambda(s,n)/n \\ge 2^s$ grows exponentially with $s$. When $s =\nn^{o(1)}$ we show $\\lambda(s,n)/n \\ge (\\frac{s}{2\\log\\log_s n})^{\\log\\log_s n}$\ngrows faster than any polynomial in $s$. Finally, when\n$s=\\Omega(n^{1/t}(t-1)!)$, $\\lambda(s,n) = \\Omega(n^2 s/(t-1)!)$ matches the\ntrivial upper bound $O(n^2s)$ asymptotically, whenever $t$ is constant.\n", "versions": [{"version": "v1", "created": "Mon, 31 Oct 2016 03:28:10 GMT"}], "update_date": "2016-11-01", "authors_parsed": [["Wellman", "Julian", ""], ["Pettie", "Seth", ""]]}, {"id": "1610.09874", "submitter": "Matthew Knepley", "authors": "Nicolas Barral and Matthew G. Knepley and Michael Lange and Matthew D.\n  Piggott and Gerard J. Gorman", "title": "Anisotropic mesh adaptation in Firedrake with PETSc DMPlex", "comments": "5 page, 2 figures, Proceedings of the 25th International Meshing\n  Roundtable, ed. Steve Owen and Hang Si, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.CG cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite decades of research in this area, mesh adaptation capabilities are\nstill rarely found in numerical simulation software. We postulate that the\nprimary reason for this is lack of usability. Integrating mesh adaptation into\nexisting software is difficult as non-trivial operators, such as error metrics\nand interpolation operators, are required, and integrating available adaptive\nremeshers is not straightforward. Our approach presented here is to first\nintegrate Pragmatic, an anisotropic mesh adaptation library, into DMPlex, a\nPETSc object that manages unstructured meshes and their interactions with\nPETSc's solvers and I/O routines. As PETSc is already widely used, this will\nmake anisotropic mesh adaptation available to a much larger community. As a\ndemonstration of this we describe the integration of anisotropic mesh\nadaptation into Firedrake, an automated Finite Element based system for the\nportable solution of partial differential equations which already uses PETSc\nsolvers and I/O via DMPlex. We present a proof of concept of this integration\nwith a three-dimensional advection test case.\n", "versions": [{"version": "v1", "created": "Mon, 31 Oct 2016 11:34:29 GMT"}], "update_date": "2016-11-01", "authors_parsed": [["Barral", "Nicolas", ""], ["Knepley", "Matthew G.", ""], ["Lange", "Michael", ""], ["Piggott", "Matthew D.", ""], ["Gorman", "Gerard J.", ""]]}, {"id": "1610.10085", "submitter": "Ulrich Bauer", "authors": "Ulrich Bauer and Michael Lesnick", "title": "Persistence Diagrams as Diagrams: A Categorification of the Stability\n  Theorem", "comments": "22 pages, 7 figures. Extended version, to appear in Proceedings of\n  the 2018 Abel Symposium. Significant edits since last version to improve\n  exposition. Added illustrations of algebraic stability and induced matchings", "journal-ref": "Topological Data Analysis. Abel Symposia, vol 15. Springer, 2020", "doi": "10.1007/978-3-030-43408-3_3", "report-no": null, "categories": "math.AT cs.CG math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Persistent homology, a central tool of topological data analysis, provides\ninvariants of data called barcodes (also known as persistence diagrams). A\nbarcode is simply a multiset of real intervals. Recent work of Edelsbrunner,\nJablonski, and Mrozek suggests an equivalent description of barcodes as\nfunctors R -> Mch, where R is the poset category of real numbers and Mch is the\ncategory whose objects are sets and whose morphisms are matchings (i.e.,\npartial injective functions). Such functors form a category Mch^R whose\nmorphisms are the natural transformations. Thus, this interpretation of\nbarcodes gives us a hitherto unstudied categorical structure on barcodes. The\naim of this note is to show that this categorical structure leads to\nsurprisingly simple reformulations of both the well-known stability theorem for\npersistent homology and a recent generalization called the induced matching\ntheorem.\n", "versions": [{"version": "v1", "created": "Mon, 31 Oct 2016 19:41:44 GMT"}, {"version": "v2", "created": "Mon, 18 Mar 2019 17:51:14 GMT"}, {"version": "v3", "created": "Mon, 10 Jun 2019 13:15:00 GMT"}], "update_date": "2020-10-12", "authors_parsed": [["Bauer", "Ulrich", ""], ["Lesnick", "Michael", ""]]}]