[{"id": "1510.01122", "submitter": "Karl Rupp", "authors": "K. Rupp, S. Balay, J. Brown, M. Knepley, L. C. McInnes, B. Smith", "title": "On The Evolution Of User Support Topics in Computational Science and\n  Engineering Software", "comments": "2 pages, 1 figure, whitepaper for the workshop \"Computational Science\n  & Engineering Software Sustainability and Productivity Challenges\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate ten years of user support emails in the large-scale solver\nlibrary PETSc in order to identify changes in user requests. For this purpose\nwe assign each email thread to one or several categories describing the type of\nsupport request. We find that despite several changes in hardware architecture\nas well programming models, the relative share of emails for the individual\ncategories does not show a notable change over time. This is particularly\nremarkable as the total communication volume has increased four-fold in the\nconsidered time frame, indicating a considerable growth of the user base. Our\ndata also demonstrates that user support cannot be substituted with what is\noften referred to as 'better documentation' and that the involvement of core\ndevelopers in user support is essential.\n", "versions": [{"version": "v1", "created": "Mon, 5 Oct 2015 12:19:46 GMT"}], "update_date": "2015-10-06", "authors_parsed": [["Rupp", "K.", ""], ["Balay", "S.", ""], ["Brown", "J.", ""], ["Knepley", "M.", ""], ["McInnes", "L. C.", ""], ["Smith", "B.", ""]]}, {"id": "1510.01179", "submitter": "Rossi Kamal Mr", "authors": "Rossi Kamal", "title": "Evolvable Autonomic Management", "comments": "arXiv admin note: text overlap with arXiv:1508.03975", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Autonomic management is aimed at adapting to uncertainty. Hence, it is\ndevised as m-connected k-dominating set problem, resembled by dominator and\ndominate, such that dominators are resilient up to m-1 uncertainty among them\nand dominate are resilient up to k-1 uncertainty on their way to dominators.\nTherefore, an evolutionary algorithm GENESIS is proposed, which resolves\nuncertainty by evolving population of solutions, while considering uncertain\nconstraints as sub-problems, started by initial populations by a greedy\nalgorithm AVIDO. Theoretical analysis first justifies original problem as\nNP-hard problem. Eventually, the absence of polynomial time approximation\nscheme necessitates justification of original problem as multiobjective\noptimization problem. Furthermore, approximation to Pareto front is verified to\nbe decomposed into scalar optimization sub-problems, which lays out the\ntheoretical foundation for decomposition based evolutionary solution. Finally,\ncase-study, feasibility analysis and exemplary implication are presented for\nevolvable autonomic management in combined cancer treatment with in-vivo sensor\nnetworks.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2015 06:50:21 GMT"}], "update_date": "2015-10-06", "authors_parsed": [["Kamal", "Rossi", ""]]}, {"id": "1510.01370", "submitter": "Mark Zwolinski", "authors": "Mohd Azman Abdul Latif, Noohul Basheer Zain Ali, Fawnizu Azmadi\n  Hussin, Mark Zwolinski", "title": "Implications of Burn-In Stress on NBTI Degradation", "comments": null, "journal-ref": null, "doi": "10.13140/RG.2.1.5057.0965", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Burn-in is accepted as a way to evaluate ageing effects in an accelerated\nmanner. It has been suggested that burn-in stress may have a significant effect\non the Negative Bias Temperature Instability (NBTI) of subthreshold CMOS\ncircuits. This paper analyses the effect of burn-in on NBTI in the context of a\nDigital to Analogue Converter (DAC) circuit. Analogue circuits require matched\ndevice pairs; NBTI may cause mismatches and hence circuit failure. The NBTI\ndegradation observed in the simulation analysis indicates that under severe\nstress conditions, a significant voltage threshold mismatch in the DAC beyond\nthe design specification of 2 mV limit can result. Experimental results confirm\nthe sensitivity of the DAC circuit design to NBTI resulting from burn-in.\n", "versions": [{"version": "v1", "created": "Mon, 5 Oct 2015 21:24:18 GMT"}], "update_date": "2015-10-07", "authors_parsed": [["Latif", "Mohd Azman Abdul", ""], ["Ali", "Noohul Basheer Zain", ""], ["Hussin", "Fawnizu Azmadi", ""], ["Zwolinski", "Mark", ""]]}, {"id": "1510.03638", "submitter": "Hajer Braham", "authors": "Hajer Braham, Sana Ben Jemaa, Gersende Fort, Eric Moulines and Berna\n  Sayrac", "title": "Spatial Prediction Under Location Uncertainty In Cellular Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coverage optimization is an important process for the operator as it is a\ncrucial prerequisite towards offering a satisfactory quality of service to the\nend-users. The first step of this process is coverage prediction, which can be\nperformed by interpolating geo-located measurements reported to the network by\nmobile users' equipments. In previous works, we proposed a low complexity\ncoverage prediction algorithm based on the adaptation of the Geo-statistics\nFixed Rank Kriging (FRK) algorithm. We supposed that the geo-location\ninformation reported with the radio measurements was perfect, which is not the\ncase in reality. In this paper, we study the impact of location uncertainty on\nthe coverage prediction accuracy and we extend the previously proposed\nalgorithm to include geo-location error in the prediction model. We validate\nthe proposed algorithm using both simulated and real field measurements. The\nFRK extended to take into account the location uncertainty proves to enhance\nthe prediction accuracy while keeping a reasonable computational complexity.\n", "versions": [{"version": "v1", "created": "Tue, 13 Oct 2015 11:49:06 GMT"}, {"version": "v2", "created": "Mon, 14 Mar 2016 21:50:18 GMT"}], "update_date": "2016-03-16", "authors_parsed": [["Braham", "Hajer", ""], ["Jemaa", "Sana Ben", ""], ["Fort", "Gersende", ""], ["Moulines", "Eric", ""], ["Sayrac", "Berna", ""]]}, {"id": "1510.03924", "submitter": "Steffen Moritz", "authors": "Steffen Moritz, Alexis Sard\\'a, Thomas Bartz-Beielstein, Martin\n  Zaefferer, J\\\"org Stork", "title": "Comparison of different Methods for Univariate Time Series Imputation in\n  R", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Missing values in datasets are a well-known problem and there are quite a lot\nof R packages offering imputation functions. But while imputation in general is\nwell covered within R, it is hard to find functions for imputation of\nunivariate time series. The problem is, most standard imputation techniques can\nnot be applied directly. Most algorithms rely on inter-attribute correlations,\nwhile univariate time series imputation needs to employ time dependencies. This\npaper provides an overview of univariate time series imputation in general and\nan in-detail insight into the respective implementations within R packages.\nFurthermore, we experimentally compare the R functions on different time series\nusing four different ratios of missing data. Our results show that either an\ninterpolation with seasonal kalman filter from the zoo package or a linear\ninterpolation on seasonal loess decomposed data from the forecast package were\nthe most effective methods for dealing with missing data in most of the\nscenarios assessed in this paper.\n", "versions": [{"version": "v1", "created": "Tue, 13 Oct 2015 23:16:10 GMT"}], "update_date": "2015-10-15", "authors_parsed": [["Moritz", "Steffen", ""], ["Sardá", "Alexis", ""], ["Bartz-Beielstein", "Thomas", ""], ["Zaefferer", "Martin", ""], ["Stork", "Jörg", ""]]}, {"id": "1510.04165", "submitter": "Xueliang Li", "authors": "Xueliang Li and John P. Gallagher", "title": "Fine-Grained Energy Modeling for the Source Code of a Mobile Application", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy efficiency has a significant influence on user experience of\nbattery-driven devices such as smartphones and tablets. The goal of an energy\nmodel for source code is to lay a foundation for the application of\nenergy-saving techniques during software development. The challenge is to\nrelate hardware energy consumption to high-level application code, considering\nthe complex run-time context and software stack. Traditional techniques build\nthe energy model by mapping a hardware energy model onto software constructs;\nthis approach faces obstacles when the software stack consists of a number of\nabstract layers. Another approach that has been followed is to utilize hardware\nor operating system features to estimate software energy information at a\ncoarse level of granularity such as blocks, methods or even applications. In\nthis paper, we explain how to construct a fine-grained energy model for the\nsource code, which is based on \"energy operations\" identified directly from the\nsource code and able to provide more valuable information for code\noptimization. We apply the approach to a class of applications based on a\ngame-engine, and explain the wider applicability of the method.\n", "versions": [{"version": "v1", "created": "Wed, 14 Oct 2015 15:49:20 GMT"}, {"version": "v2", "created": "Wed, 18 May 2016 12:29:40 GMT"}], "update_date": "2016-05-19", "authors_parsed": [["Li", "Xueliang", ""], ["Gallagher", "John P.", ""]]}, {"id": "1510.06175", "submitter": "Filippo Palumbo", "authors": "Mario G. C. A. Cimino, Nedo Celandroni, Erina Ferro, Davide La Rosa,\n  Filippo Palumbo and Gigliola Vaglini", "title": "Wireless communication, identification and sensing technologies enabling\n  integrated logistics: a study in the harbor environment", "comments": null, "journal-ref": "http://esjournals.org//journaloftechnology/Download_Sep_2015_pdf_5.php", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last decade, integrated logistics has become an important challenge in\nthe development of wireless communication, identification and sensing\ntechnology, due to the growing complexity of logistics processes and the\nincreasing demand for adapting systems to new requirements. The advancement of\nwireless technology provides a wide range of options for the maritime container\nterminals. Electronic devices employed in container terminals reduce the manual\neffort, facilitating timely information flow and enhancing control and quality\nof service and decision made. In this paper, we examine the technology that can\nbe used to support integration in harbor's logistics. In the literature, most\nsystems have been developed to address specific needs of particular harbors,\nbut a systematic study is missing. The purpose is to provide an overview to the\nreader about which technology of integrated logistics can be implemented and\nwhat remains to be addressed in the future.\n", "versions": [{"version": "v1", "created": "Wed, 21 Oct 2015 09:36:09 GMT"}], "update_date": "2019-01-29", "authors_parsed": [["Cimino", "Mario G. C. A.", ""], ["Celandroni", "Nedo", ""], ["Ferro", "Erina", ""], ["La Rosa", "Davide", ""], ["Palumbo", "Filippo", ""], ["Vaglini", "Gigliola", ""]]}, {"id": "1510.09077", "submitter": "Ian Peake", "authors": "Ian D. Peake, Jan Olaf Blech, Ian Thomas, Nicholas May, Heinz W.\n  Schmidt, Lasith Fernando, Ravi Sreenivasamurthy", "title": "The Virtual Experiences Lab - a platform for global collaborative\n  engineering and beyond", "comments": "This is a pre-print of an extended talk abstract accepted for\n  eResearch Australasia, Brisbane, October 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are developing the Virtual Experiences (Vx)Lab, a research and research\ntraining infrastructure and capability platform for global collaboration. VxLab\ncomprises labs with visualisation capabilities, including underpinning\nnetworking to global points of presence, videoconferencing and high-performance\ncomputation, simulation and rendering, and sensors and actuators such as\nrobotic instruments locally and in connected remote labs. VxLab has been used\nfor industry projects in industrial automation, experimental research in cloud\ndeployment, workshops and remote capability demonstrations, teaching\nadvanced-level courses in games development, and student software engineering\nprojects. Our goal is for resources to become a \"catalyst\" for IT-driven\nresearch results both within the university and with external industry\npartners. Use cases include: multi-disciplinary collaboration, prototyping and\ntroubleshooting requiring multiple viewpoints and architectures, dashboards and\ndecision support for global remote planning and operations.\n", "versions": [{"version": "v1", "created": "Thu, 29 Oct 2015 04:34:16 GMT"}], "update_date": "2015-11-02", "authors_parsed": [["Peake", "Ian D.", ""], ["Blech", "Jan Olaf", ""], ["Thomas", "Ian", ""], ["May", "Nicholas", ""], ["Schmidt", "Heinz W.", ""], ["Fernando", "Lasith", ""], ["Sreenivasamurthy", "Ravi", ""]]}]