[{"id": "1011.0350", "submitter": "Laszlo Juracz", "authors": "Laszlo Juracz", "title": "Developing courses with HoloRena, a framework for scenario- and game\n  based e-learning environments", "comments": "18 pages", "journal-ref": "International Journal of Software Engineering & Applications\n  (IJSEA), October 2010, Volume 1, Number 4", "doi": null, "report-no": null, "categories": "cs.LG cs.HC cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  However utilizing rich, interactive solutions can make learning more\neffective and attractive, scenario- and game-based educational resources on the\nweb are not widely used. Creating these applications is a complex, expensive\nand challenging process. Development frameworks and authoring tools hardly\nsupport reusable components, teamwork and learning management\nsystem-independent courseware architecture. In this article we initiate the\nconcept of a low-level, thick-client solution addressing these problems. With\nsome example applications we try to demonstrate, how a framework, based on this\nconcept can be useful for developing scenario- and game-based e-learning\nenvironments.\n", "versions": [{"version": "v1", "created": "Mon, 1 Nov 2010 15:40:31 GMT"}], "update_date": "2010-11-02", "authors_parsed": [["Juracz", "Laszlo", ""]]}, {"id": "1011.1560", "submitter": "Abdelkader Gouaich", "authors": "Ines Di Loreto Ines and Abdelkader Goua\\\"ich", "title": "Mixed Reality Serious Games: The Therapist Perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of this paper is to present a Mixed Reality System (MRS) for\nrehabilitation of the upper limb after stroke. The system answers the following\nchallenges: (i) increase motivation of patients by making the training a\npersonalized experience; (ii) take into account patients' impairments by\noffering intuitive and easy to use interaction modalities; (iii) make it\npossible to therapists to track patient's activities and to evaluate/track\ntheir progress; (iv) open opportunities for telemedicine and tele\nrehabilitation; (v) and provide an economically acceptable system by reducing\nboth equipment and management costs. In order to test this system a pilot study\nhas been conducted in conjunction with a French hospital in order to understand\nthe potential and benefits of mixed reality. The pilot involved 3 therapists\nwho 'played the role' of patients. Three sessions, one using conventional\nrehabilitation, another using an ad hoc developed game on a PC, and another\nusing a mixed reality version of the same game were held. Results have shown\nthe MRS and the PC game to be accepted more than physical rehabilitation.\n", "versions": [{"version": "v1", "created": "Sat, 6 Nov 2010 12:58:05 GMT"}], "update_date": "2010-11-09", "authors_parsed": [["Ines", "Ines Di Loreto", ""], ["Gouaïch", "Abdelkader", ""]]}, {"id": "1011.2042", "submitter": "Sergey Andreyev", "authors": "Sergey Andreyev", "title": "Excerpt from the book World of Movable Objects", "comments": "11 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This book is about the transformation of screen objects into movable and\nresizable and about the design of applications entirely on the basis of such\nelements. The screen objects have a wide variety of shapes; they can be either\ngraphical objects or controls; there are solitary objects and very complex\nobjects parts of which are involved in individual, synchronous, and related\nmovements. Objects can be involved in forward movements and rotation; they can\nbe resized and reconfigured; all these movements and situations are considered.\nOn the basis of total movability, the new type of programs - user-driven\napplications - are designed. These applications continue to work according to\ntheir main purposes, but the whole control of WHAT, WHEN, and HOW must appear\non the screen is passed from designers to users.\n", "versions": [{"version": "v1", "created": "Tue, 9 Nov 2010 11:14:32 GMT"}], "update_date": "2010-11-10", "authors_parsed": [["Andreyev", "Sergey", ""]]}, {"id": "1011.2538", "submitter": "Scott Carter", "authors": "Scott Carter, Laurent Denoue, John Adcock", "title": "mVideoCast: Mobile, real time ROI detection and streaming", "comments": null, "journal-ref": null, "doi": null, "report-no": "FXPAL-TR-10-003", "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A variety of applications are emerging to support streaming video from mobile\ndevices. However, many tasks can benefit from streaming specific content rather\nthan the full video feed which may include irrelevant, private, or distracting\ncontent. We describe a system that allows users to capture and stream targeted\nvideo content captured with a mobile device. The application incorporates a\nvariety of automatic and interactive techniques to identify and segment desired\ncontent in the camera view, allowing the user to publish a more focused video.\n", "versions": [{"version": "v1", "created": "Thu, 11 Nov 2010 00:28:34 GMT"}], "update_date": "2010-11-12", "authors_parsed": [["Carter", "Scott", ""], ["Denoue", "Laurent", ""], ["Adcock", "John", ""]]}, {"id": "1011.3099", "submitter": "Feng Xia", "authors": "Rui Cheng, Zhuo Yang, Feng Xia", "title": "iZone: A Location-Based Mobile Social Networking System", "comments": "Third International Symposium on Parallel Architectures, Algorithms\n  and Programming (PAAP), IEEE, December 18-20, 2010, Dalian, China", "journal-ref": null, "doi": "10.1109/PAAP.2010.67", "report-no": null, "categories": "cs.HC cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid development of wireless technology, the extensive use of mobile\nphones and the availability of location information are facilitating\npersonalized location-based applications. Easy to carry, easy to use and easy\nto buy, smart phones with certain software are of great advantage.\nConsequently, mobile social networking (MSN) systems have emerged rapidly,\nbeing a revolution for our everyday life. Based on the analysis of general\nrequirements of MSN and location-based services (LBS), this paper presents the\ndesign of iZone, a mobile social networking system, as well as a prototype\nimplementation. This platform exploits mobile GIS (Geographic Information\nSystems), LBS and J2ME technologies, combining geographical data to display map\non mobile phones. It can provide a number of social networking services via\nsmartphones.\n", "versions": [{"version": "v1", "created": "Sat, 13 Nov 2010 04:20:11 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Cheng", "Rui", ""], ["Yang", "Zhuo", ""], ["Xia", "Feng", ""]]}, {"id": "1011.3241", "submitter": "Fionn Murtagh", "authors": "Fionn Murtagh, Adam Ganz and Joe Reddington", "title": "New Methods of Analysis of Narrative and Semantics in Support of\n  Interactivity", "comments": "17 pages, 6 figures", "journal-ref": "Entertainment Computing, 2, 115-121, 2011", "doi": "10.1016/j.entcom.2010.12.008", "report-no": null, "categories": "cs.AI cs.HC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our work has focused on support for film or television scriptwriting. Since\nthis involves potentially varied story-lines, we note the implicit or latent\nsupport for interactivity. Furthermore the film, television, games, publishing\nand other sectors are converging, so that cross-over and re-use of one form of\nproduct in another of these sectors is ever more common. Technically our work\nhas been largely based on mathematical algorithms for data clustering and\ndisplay. Operationally, we also discuss how our algorithms can support\ncollective, distributed problem-solving.\n", "versions": [{"version": "v1", "created": "Sun, 14 Nov 2010 17:57:40 GMT"}], "update_date": "2011-07-07", "authors_parsed": [["Murtagh", "Fionn", ""], ["Ganz", "Adam", ""], ["Reddington", "Joe", ""]]}, {"id": "1011.3257", "submitter": "Zeeshan Ahmed Mr.", "authors": "Zeeshan Ahmed and Vasil Popov", "title": "Integration of Flexible Web Based GUI in I-SOAS", "comments": "In the proceedings of 6th I*PROMS Virtual International Conference on\n  Innovative Production Machines and Systems (IPROMS 2010), Session Production\n  Organisation and Management, Cardiff University, Whittles Publishing,\n  Scotland UK, 15-26 November, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.AI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  It is necessary to improve the concepts of the present web based graphical\nuser interface for the development of more flexible and intelligent interface\nto provide ease and increase the level of comfort at user end like most of the\ndesktop based applications. This research is conducted targeting the goal of\nimplementing flexible GUI consisting of a visual component manager with\ndifferent components by functionality, design and purpose. In this research\npaper we present a Rich Internet Application (RIA) based graphical user\ninterface for web based product development, and going into the details we\npresent a comparison between existing RIA Technologies, adopted methodology in\nthe GUI development and developed prototype.\n", "versions": [{"version": "v1", "created": "Sun, 14 Nov 2010 21:57:24 GMT"}], "update_date": "2010-11-16", "authors_parsed": [["Ahmed", "Zeeshan", ""], ["Popov", "Vasil", ""]]}, {"id": "1011.4147", "submitter": "Sergey Andreyev", "authors": "Sergey Andreyev", "title": "World of Movable Objects. Part 1", "comments": "213 pages, 89 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This book is about the transformation of screen objects into movable and\nresizable and about the design of applications entirely on the basis of such\nelements. The screen objects have a wide variety of shapes; they can be either\ngraphical objects or controls; there are solitary objects and very complex\nobjects parts of which are involved in individual, synchronous, and related\nmovements. Objects can be involved in forward movements and rotation; they can\nbe resized and reconfigured; all these movements and situations are considered.\nOn the basis of total movability, the new type of programs - user-driven\napplications - are designed. These applications continue to work according to\ntheir main purposes, but the whole control of WHAT, WHEN, and HOW must appear\non the screen is passed from designers to users. Due to the size restriction\nused on CoRR, the book is divided here into two parts and one appendix is\ndeleted. At www.sourceforge.net in the project MoveableGraphics the whole book\nis available in a single file together with the accompanying application and\nsource codes.\n", "versions": [{"version": "v1", "created": "Thu, 18 Nov 2010 07:23:05 GMT"}], "update_date": "2010-11-19", "authors_parsed": [["Andreyev", "Sergey", ""]]}, {"id": "1011.5294", "submitter": "Bruce Berriman", "authors": "Daniel S. Katz, G. Bruce Berriman and Robert G. Mann", "title": "Collaborative Astronomical Image Mosaics", "comments": "16 pages, 3 figures. To be published in \"Reshaping Research and\n  Development using Web 2.0-based technologies.\" Mark Baker, ed. Nova Science\n  Publishers, Inc.(2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This chapter describes how astronomical imaging survey data have become a\nvital part of modern astronomy, how these data are archived and then served to\nthe astronomical community through on-line data access portals. The Virtual\nObservatory, now under development, aims to make all these data accessible\nthrough a uniform set of interfaces. This chapter also describes the scientific\nneed for one common image processing task, that of composing individual images\ninto large scale mosaics and introduces Montage as a tool for this task.\nMontage, as distributed, can be used in four ways: as a single thread/process\non a single CPU, in parallel using MPI to distribute similar tasks across a\nparallel computer, in parallel using grid tools (Pegasus/DAGMan) to distributed\ntasks across a grid, or in parallel using a script-driven approach (Swift). An\non-request web based Montage service is available for users who do not need to\nbuild a local version. We also introduce some work on a new scripted version of\nMontage, which offers ease of customization for users. Then, we discuss various\nideas where Web 2.0 technologies can help the Montage community.\n", "versions": [{"version": "v1", "created": "Wed, 24 Nov 2010 04:59:35 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Katz", "Daniel S.", ""], ["Berriman", "G. Bruce", ""], ["Mann", "Robert G.", ""]]}, {"id": "1011.5325", "submitter": "Sergey Andreyev", "authors": "Sergey Andreyev", "title": "World of Movable Objects. Part 2", "comments": "145 pages, 103 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This book is about the transformation of screen objects into movable and\nresizable and about the design of applications entirely on the basis of such\nelements. The screen objects have a wide variety of shapes; they can be either\ngraphical objects or controls; there are solitary objects and very complex\nobjects parts of which are involved in individual, synchronous, and related\nmovements. Objects can be involved in forward movements and rotation; they can\nbe resized and reconfigured; all these movements and situations are considered.\nOn the basis of total movability, the new type of programs -- user-driven\napplications -- are designed. These applications continue to work according to\ntheir main purposes, but the whole control of what, when, and how must appear\non the screen is passed from designers to users. Due to the size restriction\nused on CoRR, the book is divided here into two parts and one appendix is\ndeleted. At www.sourceforge.net in the project MoveableGraphics the whole book\nis available in a single file together with the accompanying application with\nall its source codes.\n", "versions": [{"version": "v1", "created": "Wed, 24 Nov 2010 09:38:32 GMT"}], "update_date": "2010-11-25", "authors_parsed": [["Andreyev", "Sergey", ""]]}, {"id": "1011.5435", "submitter": "Andr\\'e Coelho B.Sc", "authors": "Andr\\'e Coelho, Hugo Ribeiro, M\\'ario Silva, Rui Jos\\'e", "title": "A system for coarse-grained location-based synchronisation", "comments": "12 pages, 4 figures, INForum 2010 - II Simp\\'osio de Inform\\'atica,\n  Lu\\'is S. Barbosa, Miguel P. Correia (eds), 9-10 Setembro, 2010, pp. 367-378", "journal-ref": "INForum 2010 - II Simp\\'osio de Inform\\'atica (2010) 367-378", "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a system for supporting coarse-grained location-based\nsynchronisation. This type of synchronisation may occur when people need only\nsome awareness about the location of others within the specific context of an\non-going activity. We have identified a number of reference scenarios for this\ntype of synchronisation and we have implemented and deployed a prototype to\nevaluate the type of support provided. The results of the evaluation suggest a\ngood acceptance of the overall concept, indicating that this might be a\nvaluable approach for many of the indicated scenarios, possibly replacing or\ncomplementing existing synchronisation practices.\n", "versions": [{"version": "v1", "created": "Wed, 24 Nov 2010 17:25:07 GMT"}], "update_date": "2010-11-25", "authors_parsed": [["Coelho", "André", ""], ["Ribeiro", "Hugo", ""], ["Silva", "Mário", ""], ["José", "Rui", ""]]}, {"id": "1011.5459", "submitter": "Julian Sienkiewicz", "authors": "Anna Chmiel, Pawel Sobkowicz, Julian Sienkiewicz, Georgios Paltoglou,\n  Kevan Buckley, Mike Thelwall, and Janusz A. Holyst", "title": "Negative emotions boost users activity at BBC Forum", "comments": "29 pages, 6 figures", "journal-ref": "Physica A 390, 2936 (2011)", "doi": "10.1016/j.physa.2011.03.040", "report-no": null, "categories": "cs.HC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an empirical study of user activity in online BBC discussion\nforums, measured by the number of posts written by individual debaters and the\naverage sentiment of these posts. Nearly 2.5 million posts from over 18\nthousand users were investigated. Scale free distributions were observed for\nactivity in individual discussion threads as well as for overall activity. The\nnumber of unique users in a thread normalized by the thread length decays with\nthread length, suggesting that thread life is sustained by mutual discussions\nrather than by independent comments. Automatic sentiment analysis shows that\nmost posts contain negative emotions and the most active users in individual\nthreads express predominantly negative sentiments. It follows that the average\nemotion of longer threads is more negative and that threads can be sustained by\nnegative comments. An agent based computer simulation model has been used to\nreproduce several essential characteristics of the analyzed system. The model\nstresses the role of discussions between users, especially emotionally laden\nquarrels between supporters of opposite opinions, and represents many observed\nstatistics of the forum.\n", "versions": [{"version": "v1", "created": "Wed, 24 Nov 2010 19:04:44 GMT"}, {"version": "v2", "created": "Wed, 8 Dec 2010 17:32:20 GMT"}, {"version": "v3", "created": "Fri, 6 May 2011 13:20:27 GMT"}], "update_date": "2011-06-06", "authors_parsed": [["Chmiel", "Anna", ""], ["Sobkowicz", "Pawel", ""], ["Sienkiewicz", "Julian", ""], ["Paltoglou", "Georgios", ""], ["Buckley", "Kevan", ""], ["Thelwall", "Mike", ""], ["Holyst", "Janusz A.", ""]]}]