[{"id": "1510.00077", "submitter": "Michael Gabbay", "authors": "Dov Gabbay and Michael Gabbay", "title": "The Attack as Intuitionistic Negation", "comments": "34 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We translate the argumentation networks ${\\cal A}=(S, R)$ into a theory $D$\nof intuitionistic logic, retaining $S$ as the domain and using intuitionistic\nnegation to model the attack $R$ in ${\\cal A}$: the attack $xRy$ is translated\nto $x\\to\\neg y$. The intuitionistic models of $D$ characterise the complete\nextensions of ${\\cal A}$.\n  The reduction of argumentation networks to intuitionistic logic yields, in\naddition to a representation theorem, some additional benefits: it allows us to\ngive semantics to higher level attacks, where an attack \"$xRy$\" can itself\nattack another attack \"$uRv$\"; one can make higher level meta-statements $W$ on\n$(S, R)$ and such meta-statements can attack and be attacked in the domain.\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2015 23:38:55 GMT"}], "update_date": "2015-10-02", "authors_parsed": [["Gabbay", "Dov", ""], ["Gabbay", "Michael", ""]]}, {"id": "1510.00523", "submitter": "Takahisa Toda", "authors": "Takahisa Toda and Takehide Soh", "title": "Implementing Efficient All Solutions SAT Solvers", "comments": null, "journal-ref": "ACM Journal of Experimental Algorithmics, Vol. 21, No. 1, Article\n  1.12, 2016", "doi": "10.1145/2975585", "report-no": null, "categories": "cs.DS cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  All solutions SAT (AllSAT for short) is a variant of propositional\nsatisfiability problem. Despite its significance, AllSAT has been relatively\nunexplored compared to other variants. We thus survey and discuss major\ntechniques of AllSAT solvers. We faithfully implement them and conduct\ncomprehensive experiments using a large number of instances and various types\nof solvers including one of the few public softwares. The experiments reveal\nsolver's characteristics. Our implemented solvers are made publicly available\nso that other researchers can easily develop their solver by modifying our\ncodes and compare it with existing methods.\n", "versions": [{"version": "v1", "created": "Fri, 2 Oct 2015 08:32:59 GMT"}], "update_date": "2016-11-10", "authors_parsed": [["Toda", "Takahisa", ""], ["Soh", "Takehide", ""]]}, {"id": "1510.00797", "submitter": "Matteo Mio", "authors": "Matteo Mio and Alex Simpson", "title": "{\\L}ukasiewicz {\\mu}-calculus", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper explores properties of the {\\L}ukasiewicz {\\mu}-calculus, or\n{\\L}{\\mu} for short, an extension of {\\L}ukasiewicz logic with scalar\nmultiplication and least and greatest fixed-point operators (for monotone\nformulas). We observe that {\\L}{\\mu} terms, with $n$ variables, define monotone\npiecewise linear functions from $[0, 1]^n$ to $[0, 1]$. Two effective\nprocedures for calculating the output of {\\L}{\\mu} terms on rational inputs are\npresented. We then consider the {\\L}ukasiewicz modal {\\mu}-calculus, which is\nobtained by adding box and diamond modalities to {\\L}{\\mu}. Alternatively, it\ncan be viewed as a generalization of Kozen's modal {\\mu}-calculus adapted to\nprobabilistic nondeterministic transition systems (PNTS's). We show how\nproperties expressible in the well-known logic PCTL can be encoded as\n{\\L}ukasiewicz modal {\\mu}-calculus formulas. We also show that the algorithms\nfor computing values of {\\L}ukasiewicz {\\mu}-calculus terms provide automatic\n(albeit impractical) methods for verifying {\\L}ukasiewicz modal {\\mu}-calculus\nproperties of finite rational PNTS's.\n", "versions": [{"version": "v1", "created": "Sat, 3 Oct 2015 09:11:59 GMT"}], "update_date": "2015-10-06", "authors_parsed": [["Mio", "Matteo", ""], ["Simpson", "Alex", ""]]}, {"id": "1510.01044", "submitter": "Johannes Borgstr", "authors": "Johannes Borgstr\\\"om (Uppsala University), Ram\\=unas Gutkovas (Uppsala\n  University), Joachim Parrow (Uppsala University), Bj\\\"orn Victor (Uppsala\n  University), Johannes {\\AA}man Pohjola (Uppsala University)", "title": "A Sorted Semantic Framework for Applied Process Calculi", "comments": "49 pages", "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 1 (March 31,\n  2016) lmcs:1631", "doi": "10.2168/LMCS-12(1:8)2016", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Applied process calculi include advanced programming constructs such as type\nsystems, communication with pattern matching, encryption primitives, concurrent\nconstraints, nondeterminism, process creation, and dynamic connection\ntopologies. Several such formalisms, e.g. the applied pi calculus, are\nextensions of the the pi-calculus; a growing number is geared towards\nparticular applications or computational paradigms. Our goal is a unified\nframework to represent different process calculi and notions of computation. To\nthis end, we extend our previous work on psi-calculi with novel abstract\npatterns and pattern matching, and add sorts to the data term language, giving\nsufficient criteria for subject reduction to hold. Our framework can directly\nrepresent several existing process calculi; the resulting transition systems\nare isomorphic to the originals up to strong bisimulation. We also demonstrate\ndifferent notions of computation on data terms, including cryptographic\nprimitives and a lambda-calculus with erratic choice. Finally, we prove\nstandard congruence and structural properties of bisimulation; the proof has\nbeen machine-checked using Nominal Isabelle in the case of a single name sort.\n", "versions": [{"version": "v1", "created": "Mon, 5 Oct 2015 06:53:24 GMT"}, {"version": "v2", "created": "Wed, 30 Mar 2016 08:48:59 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Borgström", "Johannes", "", "Uppsala University"], ["Gutkovas", "Ramūnas", "", "Uppsala\n  University"], ["Parrow", "Joachim", "", "Uppsala University"], ["Victor", "Björn", "", "Uppsala\n  University"], ["Pohjola", "Johannes Åman", "", "Uppsala University"]]}, {"id": "1510.01391", "submitter": "Dominic Horsman", "authors": "Dominic C. Horsman", "title": "Abstraction/Representation Theory for Heterotic Physical Computing", "comments": "Dominic Horsman published previously as Clare Horsman", "journal-ref": "Phil. Trans. R. Soc. A 2015 373 20140224 (June 2015)", "doi": "10.1098/rsta.2014.0224", "report-no": null, "categories": "cs.LO cs.ET cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a rigorous framework for the interaction of physical computing\ndevices with abstract computation. Device and program are mediated by the\nnon-logical 'representation relation'; we give the conditions under which\nrepresentation and device theory give rise to commuting diagrams between\nlogical and physical domains, and the conditions for computation to occur. We\ngive the interface of this new framework with currently existing formal\nmethods, showing in particular its close relationship to refinement theory, and\nthe implications for questions of meaning and reference in theoretical computer\nscience. The case of hybrid computing is considered in detail, addressing in\nparticular the example of an internet-mediated 'social machine', and the\nabstraction/representation framework used to provide a formal distinction\nbetween heterotic and hybrid computing. This forms the basis for future use of\nthe framework in formal treatments of nonstandard physical computers.\n", "versions": [{"version": "v1", "created": "Mon, 5 Oct 2015 22:37:14 GMT"}], "update_date": "2015-10-29", "authors_parsed": [["Horsman", "Dominic C.", ""]]}, {"id": "1510.01913", "submitter": "Vasco Brattka", "authors": "Vasco Brattka, Matthew Hendtlass, Alexander P. Kreuzer", "title": "On the Uniform Computational Content of the Baire Category Theorem", "comments": "28 pages", "journal-ref": "Notre Dame J. Formal Logic 59, no. 4 (2018), 605-636", "doi": "10.1215/00294527-2018-0016", "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the uniform computational content of different versions of the Baire\nCategory Theorem in the Weihrauch lattice. The Baire Category Theorem can be\nseen as a pigeonhole principle that states that a complete (i.e., \"large\")\nmetric space cannot be decomposed into countably many nowhere dense (i.e.,\n\"small\") pieces. The Baire Category Theorem is an illuminating example of a\ntheorem that can be used to demonstrate that one classical theorem can have\nseveral different computational interpretations. For one, we distinguish two\ndifferent logical versions of the theorem, where one can be seen as the\ncontrapositive form of the other one. The first version aims to find an\nuncovered point in the space, given a sequence of nowhere dense closed sets.\nThe second version aims to find the index of a closed set that is somewhere\ndense, given a sequence of closed sets that cover the space. Even though the\ntwo statements behind these versions are equivalent to each other in classical\nlogic, they are not equivalent in intuitionistic logic and likewise they\nexhibit different computational behavior in the Weihrauch lattice. Besides this\nlogical distinction, we also consider different ways how the sequence of closed\nsets is \"given\". Essentially, we can distinguish between positive and negative\ninformation on closed sets. We discuss all the four resulting versions of the\nBaire Category Theorem. Somewhat surprisingly it turns out that the difference\nin providing the input information can also be expressed with the jump\noperation. Finally, we also relate the Baire Category Theorem to notions of\ngenericity and computably comeager sets.\n", "versions": [{"version": "v1", "created": "Wed, 7 Oct 2015 12:12:50 GMT"}, {"version": "v2", "created": "Wed, 24 Aug 2016 10:38:33 GMT"}], "update_date": "2018-11-14", "authors_parsed": [["Brattka", "Vasco", ""], ["Hendtlass", "Matthew", ""], ["Kreuzer", "Alexander P.", ""]]}, {"id": "1510.02419", "submitter": "Vivek Nigam", "authors": "Nick Benton, Martin Hofmann, Vivek Nigam", "title": "Effect-Dependent Transformations for Concurrent Programs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a denotational semantics for an abstract effect system for a\nhigher-order, shared-variable concurrent programming language. We prove the\nsoundness of a number of general effect-based program equivalences, including a\nparallelization equation that specifies sufficient conditions for replacing\nsequential composition with parallel composition. Effect annotations are\nrelative to abstract locations specified by contracts rather than physical\nfootprints allowing us in particular to show the soundness of some\ntransformations involving fine-grained concurrent data structures, such as\nMichael-Scott queues, that allow concurrent access to different parts of\nmutable data structures.\n  Our semantics is based on refining a trace-based semantics for first-order\nprograms due to Brookes. By moving from concrete to abstract locations, and\nadding type refinements that capture the possible side-effects of both\nexpressions and their concurrent environments, we are able to validate many\nequivalences that do not hold in an unrefined model. The meanings of types are\nexpressed using a game-based logical relation over sets of traces. Two programs\n$e_1$ and $e_2$ are logically related if one is able to solve a two-player\ngame: for any trace with result value $v_1$ in the semantics of $e_1$\n(challenge) that the player presents, the opponent can present an (response)\nequivalent trace in the semantics of $e_2$ with a logically related result\nvalue $v_2$.\n", "versions": [{"version": "v1", "created": "Thu, 8 Oct 2015 17:47:39 GMT"}], "update_date": "2015-10-12", "authors_parsed": [["Benton", "Nick", ""], ["Hofmann", "Martin", ""], ["Nigam", "Vivek", ""]]}, {"id": "1510.02642", "submitter": "Andrew Reynolds", "authors": "Andrew Reynolds, Tim King, Viktor Kuncak", "title": "An Instantiation-Based Approach for Solving Quantified Linear Arithmetic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a framework to derive instantiation-based decision\nprocedures for satisfiability of quantified formulas in first-order theories,\nincluding its correctness, implementation, and evaluation. Using this framework\nwe derive decision procedures for linear real arithmetic (LRA) and linear\ninteger arithmetic (LIA) formulas with one quantifier alternation. Our\nprocedure can be integrated into the solving architecture used by typical SMT\nsolvers. Experimental results on standardized benchmarks from model checking,\nstatic analysis, and synthesis show that our implementation of the procedure in\nthe SMT solver CVC4 outperforms existing tools for quantified linear\narithmetic.\n", "versions": [{"version": "v1", "created": "Fri, 9 Oct 2015 12:02:54 GMT"}, {"version": "v2", "created": "Sat, 17 Oct 2015 16:47:35 GMT"}, {"version": "v3", "created": "Wed, 3 Feb 2016 16:06:40 GMT"}, {"version": "v4", "created": "Thu, 11 Feb 2016 20:25:31 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Reynolds", "Andrew", ""], ["King", "Tim", ""], ["Kuncak", "Viktor", ""]]}, {"id": "1510.02787", "submitter": "Stanis{\\l}aw  Ambroszkiewicz", "authors": "Stanislaw Ambroszkiewicz", "title": "The grounding for Continuum", "comments": "This is the second part of the general framework for a constructive\n  type theory presented in the paper Functionals and hardware arXiv:1501.03043.\n  The version is final. The research on the grounding of Mathematics is\n  continued in the paper {\\em Asymptotic combinatorial constructions of\n  Geometries} available at arXiv:1904.05173", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is a ubiquitous opinion among mathematicians that a real number is just a\npoint in the line. If this rough definition is not enough, then a mathematician\nmay provide a formal definition of the real numbers in the set theoretic and\naxiomatic fashion, i.e. via Cauchy sequences or Dedekind cuts, or as the\ncollection of axioms characterizing exactly (up to isomorphism) the set of real\nnumbers as the complete and totally ordered Archimedean field. Actually, the\nabove notions of the real numbers are abstract and do not have a constructive\ngrounding. Definition of Cauchy sequences, and equivalence classes of these\nsequences explicitly use the actual infinity. The same is for Dedekind cuts,\nwhere the set of rational numbers is used as actual infinity. Although there is\nno direct constructive grounding for these abstract notions, there are so\ncalled intuitions on which they are based. A rigorous approach to express these\nvery intuition in a constructive way is proposed. It is based on the concept of\nthe adjacency relation that seems to be a missing primitive concept in type\ntheory. The approach corresponds to the intuitionistic view of Continuum\nproposed by Brouwer. The famous and controversial Brouwer Continuity Theorem is\ndiscussed on the basis of different principle than the Axiom of Continuity.\n", "versions": [{"version": "v1", "created": "Tue, 6 Oct 2015 20:13:47 GMT"}, {"version": "v10", "created": "Wed, 12 Sep 2018 11:38:17 GMT"}, {"version": "v11", "created": "Thu, 11 Jul 2019 13:00:42 GMT"}, {"version": "v2", "created": "Tue, 27 Oct 2015 09:36:55 GMT"}, {"version": "v3", "created": "Sat, 24 Jun 2017 21:30:18 GMT"}, {"version": "v4", "created": "Mon, 10 Jul 2017 08:11:47 GMT"}, {"version": "v5", "created": "Wed, 12 Jul 2017 10:52:05 GMT"}, {"version": "v6", "created": "Thu, 28 Dec 2017 13:05:44 GMT"}, {"version": "v7", "created": "Wed, 21 Mar 2018 21:43:52 GMT"}, {"version": "v8", "created": "Fri, 8 Jun 2018 11:58:02 GMT"}, {"version": "v9", "created": "Wed, 1 Aug 2018 10:30:31 GMT"}], "update_date": "2019-07-12", "authors_parsed": [["Ambroszkiewicz", "Stanislaw", ""]]}, {"id": "1510.02834", "submitter": "Mauricio Toro", "authors": "Mauricio Toro and Camilo Rueda and Carlos Ag\\'on and G\\'erard Assayag", "title": "NTCCRT: A concurrent constraint framework for real-time interaction\n  (extended version)", "comments": "12 pages, short version published in the International Computer Music\n  Conference (ICMC), 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Writing multimedia interaction systems is not easy. Their concurrent\nprocesses usually access shared resources in a non-deterministic order, often\nleading to unpredictable behavior. Using Pure Data (Pd) and Max/MSP is possible\nto program concurrency, however, it is difficult to synchronize processes based\non multiple criteria. Process calculi such as the Non-deterministic Timed\nConcurrent Constraint (ntcc) calculus, overcome that problem by representing\nmultiple criteria as constraints. We propose using our framework Ntccrt to\nmanage concurrency in Pd and Max. Ntccrt is a real-time capable inter- preter\nfor ntcc. Using Ntccrt externals (binary plugins) in Pd we ran models for\nmachine improvisation and signal processing.\n", "versions": [{"version": "v1", "created": "Fri, 9 Oct 2015 21:53:12 GMT"}], "update_date": "2015-10-13", "authors_parsed": [["Toro", "Mauricio", ""], ["Rueda", "Camilo", ""], ["Agón", "Carlos", ""], ["Assayag", "Gérard", ""]]}, {"id": "1510.02836", "submitter": "Mauricio Toro", "authors": "Mauricio Toro and Myriam Desainte-Catherine and Pascal Baltazar", "title": "A Model for Interactive Scores with Temporal Constraints and Conditional\n  Branching", "comments": "14 pages, extended version of conference paper on Journ\\'ees de\n  INformatique Musicale 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interactive Scores (IS) are a formalism for the design and performance of\ninteractive multimedia scenarios. IS provide temporal relations (TR), but they\ncannot represent conditional branching and TRs simultaneously. We propose an\nextension to Allombert et al.'s IS model by including a condition on the TRs.\nWe found out that in order to have a coherent model in all possible scenarios,\ndurations must be flexible; however, sometimes it is possible to have fixed\ndurations. To show the relevance of our model, we modeled an existing\nmultimedia installation called Mariona. In Mariona there is choice, random\ndurations and loops. Whether we can represent all the TRs available in\nAllombert et al.'s model into ours, or we have to choose between a timed\nconditional branching model and a pure temporal model before writing a\nscenario, still remains as an open question.\n", "versions": [{"version": "v1", "created": "Fri, 9 Oct 2015 22:08:08 GMT"}], "update_date": "2015-10-13", "authors_parsed": [["Toro", "Mauricio", ""], ["Desainte-Catherine", "Myriam", ""], ["Baltazar", "Pascal", ""]]}, {"id": "1510.02840", "submitter": "Mauricio Toro", "authors": "Mauricio Toro", "title": "Concurrent Constraint Machine Improvisation: Models and Implementation", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine improvisation creates music either by explicit coding of rules or by\napplying machine learning methods. We deal with the latter case. An\nimprovisation system capable of real-time must execute two process\nconcurrently: one to apply machine learning methods to musical sequences in\norder to capture prominent musical features, and one to produce musical\nsequences stylistically consistent with the learned material. As an example,\nthe Concurrent Constraint Factor Oracle Model for Music Improvisation (ccfomi),\nbased upon Non-deterministic Timed Concurrent Constraint (ntcc) calculus, uses\nthe Factor Oracle to store the learned sequences.\n", "versions": [{"version": "v1", "created": "Fri, 9 Oct 2015 22:22:01 GMT"}], "update_date": "2015-10-13", "authors_parsed": [["Toro", "Mauricio", ""]]}, {"id": "1510.03057", "submitter": "Mauricio Toro", "authors": "Mauricio Toro", "title": "Towards non-threaded Concurrent Constraint Programming for implementing\n  multimedia interaction systems", "comments": "55 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we explain the implementation of event-driven real-time\ninterpreters for the Concurrent Constraint Programming (CCP) and\nNon-deterministic Timed Concurrent Constraint (NTCC) for- malisms. The CCP\ninterpreter was tested with a program to find, concurrently, paths in a graph\nand it will be used in the future to find musical sequences in the music\nimprovisation software Omax, developed by the French Acoustics/Music Research\nInstitute (IRCAM). In the other hand, the NTCC interpreter was tested with a\nmusic improvisation system based on NTCC (CCFOMI), developed by the AVISPA\nresearch group and IRCAM. Additionally, we present GECOL 2, a wrapper for the\nGeneric Constraints Development Environment (GECODE) to Common LISP, de-\nveloped to port the interpreters to Common LISP in the future. We concluded\nthat using GECODE for the concurrency control avoids the need of having threads\nand synchronizing them, leading to a simple and efficient implementation of CCP\nand NTCC. We also noticed that the time units in NTCC interpreter do not\nrepresent discrete time units, because when we simulate the NTCC specifications\nin the interpreter, the time units have different durations. In the future, we\npropose forcing the duration of each time unit to a fix time, that way we would\nbe able to reason about NTCC time units as we do with discrete time units.\n", "versions": [{"version": "v1", "created": "Sun, 11 Oct 2015 14:15:47 GMT"}], "update_date": "2015-10-13", "authors_parsed": [["Toro", "Mauricio", ""]]}, {"id": "1510.03319", "submitter": "Gabriele Puppis", "authors": "Angelo Montanari (University of Udine, Italy), Gabriele Puppis (LaBRI\n  - CNRS), Pietro Sala (University of Verona, Italy)", "title": "A decidable weakening of Compass Logic based on cone-shaped cardinal\n  directions", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 11, Issue 4 (December\n  10, 2015) lmcs:1608", "doi": "10.2168/LMCS-11(4:7)2015", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a modal logic, called Cone Logic, whose formulas describe\nproperties of points in the plane and spatial relationships between them.\nPoints are labelled by proposition letters and spatial relations are induced by\nthe four cone-shaped cardinal directions. Cone Logic can be seen as a weakening\nof Venema's Compass Logic. We prove that, unlike Compass Logic and other\nprojection-based spatial logics, its satisfiability problem is decidable\n(precisely, PSPACE-complete). We also show that it is expressive enough to\ncapture meaningful interval temporal logics - in particular, the interval\ntemporal logic of Allen's relations \"Begins\", \"During\", and \"Later\", and their\ntransposes.\n", "versions": [{"version": "v1", "created": "Mon, 12 Oct 2015 14:53:18 GMT"}, {"version": "v2", "created": "Wed, 9 Dec 2015 08:01:34 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Montanari", "Angelo", "", "University of Udine, Italy"], ["Puppis", "Gabriele", "", "LaBRI\n  - CNRS"], ["Sala", "Pietro", "", "University of Verona, Italy"]]}, {"id": "1510.03531", "submitter": "Chen Chen", "authors": "Chen Chen (University of Pennsylvania), Limin Jia (Carnegie Mellon\n  University), Hao Xu (University of Pennsylvania), Cheng Luo (University of\n  Pennsylvania), Wenchao Zhou (Georgetown University), Boon Thau Loo\n  (University of Pennsylvania)", "title": "A Program Logic for Verifying Secure Routing Protocols", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 11, Issue 4 (December\n  29, 2015) lmcs:1620", "doi": "10.2168/LMCS-11(4:19)2015", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet, as it stands today, is highly vulnerable to attacks. However,\nlittle has been done to understand and verify the formal security guarantees of\nproposed secure inter-domain routing protocols, such as Secure BGP (S-BGP). In\nthis paper, we develop a sound program logic for SANDLog-a declarative\nspecification language for secure routing protocols for verifying properties of\nthese protocols. We prove invariant properties of SANDLog programs that run in\nan adversarial environment. As a step towards automated verification, we\nimplement a verification condition generator (VCGen) to automatically extract\nproof obligations. VCGen is integrated into a compiler for SANDLog that can\ngenerate executable protocol implementations; and thus, both verification and\nempirical evaluation of secure routing protocols can be carried out in this\nunified framework. To validate our framework, we encoded several proposed\nsecure routing mechanisms in SANDLog, verified variants of path authenticity\nproperties by manually discharging the generated verification conditions in\nCoq, and generated executable code based on SANDLog specification and ran the\ncode in simulation.\n", "versions": [{"version": "v1", "created": "Tue, 13 Oct 2015 05:07:19 GMT"}, {"version": "v2", "created": "Mon, 28 Dec 2015 03:12:56 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Chen", "Chen", "", "University of Pennsylvania"], ["Jia", "Limin", "", "Carnegie Mellon\n  University"], ["Xu", "Hao", "", "University of Pennsylvania"], ["Luo", "Cheng", "", "University of\n  Pennsylvania"], ["Zhou", "Wenchao", "", "Georgetown University"], ["Loo", "Boon Thau", "", "University of Pennsylvania"]]}, {"id": "1510.03794", "submitter": "{\\L}ukasz Czajka", "authors": "{\\L}ukasz Czajka", "title": "On the equivalence of different presentations of Turner's bracket\n  abstraction algorithm", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Turner's bracket abstraction algorithm is perhaps the most well-known\nimprovement on simple bracket abstraction algorithms. It is also one of the\nmost studied bracket abstraction algorithms. The definition of the algorithm in\nTurner's original paper is slightly ambiguous and it has been subject to\ndifferent interpretations. It has been erroneously claimed in some papers that\ncertain formulations of Turner's algorithm are equivalent. In this note we\nclarify the relationship between various presentations of Turner's algorithm\nand we show that some of them are in fact equivalent for translating\nlambda-terms in beta-normal form.\n", "versions": [{"version": "v1", "created": "Tue, 13 Oct 2015 17:44:17 GMT"}], "update_date": "2015-10-14", "authors_parsed": [["Czajka", "Łukasz", ""]]}, {"id": "1510.03918", "submitter": "Kristina Sojakova", "authors": "Kristina Sojakova", "title": "The equivalence of the torus and the product of two circles in homotopy\n  type theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Homotopy type theory is a new branch of mathematics which merges insights\nfrom abstract homotopy theory and higher category theory with those of logic\nand type theory. It allows us to represent a variety of mathematical objects as\nbasic type-theoretic constructions, higher inductive types. We present a proof\nthat in homotopy type theory, the torus is equivalent to the product of two\ncircles. This result indicates that the synthetic definition of torus as a\nhigher inductive type is indeed correct.\n", "versions": [{"version": "v1", "created": "Tue, 13 Oct 2015 22:38:45 GMT"}], "update_date": "2015-10-15", "authors_parsed": [["Sojakova", "Kristina", ""]]}, {"id": "1510.03994", "submitter": "Prateek Karandikar", "authors": "Prateek Karandikar and Philippe Schnoebelen", "title": "Decidability in the logic of subsequences and supersequences", "comments": null, "journal-ref": "35th IARCS Annual Conference on Foundations of Software Technology\n  and Theoretical Computer Science (FSTTCS 2015)", "doi": "10.4230/LIPIcs.FSTTCS.2015.84", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider first-order logics of sequences ordered by the subsequence\nordering, aka sequence embedding. We show that the \\Sigma_2 theory is\nundecidable, answering a question left open by Kuske. Regarding fragments with\na bounded number of variables, we show that the FO2 theory is decidable while\nthe FO3 theory is undecidable.\n", "versions": [{"version": "v1", "created": "Wed, 14 Oct 2015 08:21:47 GMT"}], "update_date": "2016-07-07", "authors_parsed": [["Karandikar", "Prateek", ""], ["Schnoebelen", "Philippe", ""]]}, {"id": "1510.04021", "submitter": "Inge Bethke", "authors": "Jan A. Bergstra and Inge Bethke", "title": "Subvarieties of the variety of meadows", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.RA cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Meadows - commutative rings equipped with a total inversion operation - can\nbe axiomatized by purely equational means. We study subvarieties of the variety\nof meadows obtained by extending the equational theory and expanding the\nsignature.\n", "versions": [{"version": "v1", "created": "Wed, 14 Oct 2015 09:46:20 GMT"}, {"version": "v2", "created": "Thu, 22 Oct 2015 11:11:56 GMT"}, {"version": "v3", "created": "Mon, 14 Dec 2015 09:11:42 GMT"}, {"version": "v4", "created": "Tue, 19 Apr 2016 10:58:58 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Bergstra", "Jan A.", ""], ["Bethke", "Inge", ""]]}, {"id": "1510.04393", "submitter": "Xaver Newberry", "authors": "X.Y. Newberry", "title": "The Diagonal Lemma Fails in Aristotelian Logic", "comments": null, "journal-ref": "The Reasoner Volume 10, Number 1 January 2016 pgs 102-103", "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In the 1950-ies P. F. Strawson proposed the Logic of Presuppositions. In this\nsystem sentences with empty subject are considered neither true nor false.\nStrawson considered only simple sentences with two predicate letters. But the\nconcept can be extended to arbitrary monadic, even polyadic sentences utilizing\ntruth-relevant logic developed by Richard Diaz. It can be shown that\nself-referential G\\\"odel's sentence in fact has an empty subject, and can thus\nbe classified by the Logic of Presuppositions as neither true nor false.\n", "versions": [{"version": "v1", "created": "Thu, 15 Oct 2015 04:04:15 GMT"}, {"version": "v2", "created": "Tue, 28 Jan 2020 00:23:12 GMT"}], "update_date": "2020-01-29", "authors_parsed": [["Newberry", "X. Y.", ""]]}, {"id": "1510.04469", "submitter": "Garry Pantelis", "authors": "Garry Pantelis", "title": "A Formal System: Rigorous Constructions of Computer Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This book explores an alternative to the current dominant paradigm where a\ndiscrete computer model is constructed as an attempt to approximate some\ncontinuum theory. We focus on a class of discrete computer models that are\nbased on simple deterministic rules and finite state arithmetic. Such models\nare highly compatible with the operational parameters of the real world\ncomputer on which they are executed and hence their validation can be\nassociated with the allowable computations on the machine. A simple formal\nsystem based on a language of functional programs is employed as a tool of\nanalysis.\n", "versions": [{"version": "v1", "created": "Thu, 15 Oct 2015 11:03:53 GMT"}, {"version": "v2", "created": "Mon, 19 Sep 2016 02:51:32 GMT"}, {"version": "v3", "created": "Thu, 13 Apr 2017 10:16:56 GMT"}], "update_date": "2017-04-14", "authors_parsed": [["Pantelis", "Garry", ""]]}, {"id": "1510.04521", "submitter": "Michael Pinsker", "authors": "Libor Barto, Jakub Opr\\v{s}al, Michael Pinsker", "title": "The wonderland of reflections", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.CC cs.LO math.RA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fundamental fact for the algebraic theory of constraint satisfaction\nproblems (CSPs) over a fixed template is that pp-interpretations between at\nmost countable \\omega-categorical relational structures have two algebraic\ncounterparts for their polymorphism clones: a semantic one via the standard\nalgebraic operators H, S, P, and a syntactic one via clone homomorphisms\n(capturing identities). We provide a similar characterization which\nincorporates all relational constructions relevant for CSPs, that is,\nhomomorphic equivalence and adding singletons to cores in addition to\npp-interpretations. For the semantic part we introduce a new construction,\ncalled reflection, and for the syntactic part we find an appropriate weakening\nof clone homomorphisms, called h1 clone homomorphisms (capturing identities of\nheight 1).\n  As a consequence, the complexity of the CSP of an at most countable\n$\\omega$-categorical structure depends only on the identities of height 1\nsatisfied in its polymorphism clone as well as the the natural uniformity\nthereon. This allows us in turn to formulate a new elegant dichotomy conjecture\nfor the CSPs of reducts of finitely bounded homogeneous structures.\n  Finally, we reveal a close connection between h1 clone homomorphisms and the\nnotion of compatibility with projections used in the study of the lattice of\ninterpretability types of varieties.\n", "versions": [{"version": "v1", "created": "Thu, 15 Oct 2015 13:13:13 GMT"}, {"version": "v2", "created": "Tue, 24 Jan 2017 17:24:19 GMT"}], "update_date": "2017-01-25", "authors_parsed": [["Barto", "Libor", ""], ["Opršal", "Jakub", ""], ["Pinsker", "Michael", ""]]}, {"id": "1510.04629", "submitter": "Vamsi Thummala", "authors": "Vamsi Thummala and Jeff Chase", "title": "SAFE: A Declarative Trust Management System with Linked Credentials", "comments": "17 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present SAFE, an integrated system for managing trust using a logic-based\ndeclarative language. Logical trust systems authorize each request by\nconstructing a proof from a context---a set of authenticated logic statements\nrepresenting credentials and policies issued by various principals in a\nnetworked system.\n  A key barrier to practical use of logical trust systems is the problem of\nmanaging proof contexts: identifying, validating, and assembling the\ncredentials and policies that are relevant to each trust decision. This paper\ndescribes a new approach to managing proof contexts using context linking and\ncaching. Credentials and policies are stored as certified logic sets named by\nsecure identifiers in a shared key-value store. SAFE offers language constructs\nto build and modify logic sets, link sets to form unions, pass them by\nreference, and add them to proof contexts. SAFE fetches and validates\ncredential sets on demand and caches them in the authorizer. We evaluate and\ndiscuss our experience using SAFE to build secure services based on case\nstudies drawn from practice: a secure name service resolver, a secure proxy\nshim for a key value store, and an authorization module for a networked\ninfrastructure-as-a-service system with a federated trust structure.\n", "versions": [{"version": "v1", "created": "Thu, 15 Oct 2015 17:03:53 GMT"}, {"version": "v2", "created": "Fri, 16 Oct 2015 08:17:55 GMT"}], "update_date": "2015-10-19", "authors_parsed": [["Thummala", "Vamsi", ""], ["Chase", "Jeff", ""]]}, {"id": "1510.04661", "submitter": "Ekaterina Komendantskaya Dr", "authors": "Peng Fu and Ekaterina Komendantskaya", "title": "A Type-Theoretic Approach to Resolution", "comments": "21 page (incl appendices) in LOPSTR'15 LNCS post-proceedings, 2015.\n  arXiv admin note: substantial text overlap with arXiv:1506.06166", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new type-theoretic approach to SLD-resolution and Horn-clause\nlogic programming. It views Horn formulas as types, and derivations for a given\nquery as a construction of the inhabitant (a proof-term) for the type given by\nthe query. We propose a method of program transformation that allows to\ntransform logic programs in such a way that proof evidence is computed\nalongside SLD-derivations. We discuss two applications of this approach: in\nrecently proposed productivity theory of structural resolution, and in type\nclass inference.\n", "versions": [{"version": "v1", "created": "Thu, 15 Oct 2015 18:52:01 GMT"}], "update_date": "2015-10-16", "authors_parsed": [["Fu", "Peng", ""], ["Komendantskaya", "Ekaterina", ""]]}, {"id": "1510.04817", "submitter": "Javier Alvez", "authors": "Javier \\'Alvez and Paqui Lucio and German Rigau", "title": "Improving the Competency of First-Order Ontologies", "comments": "8 pages, 2 tables", "journal-ref": "Proceedings of the 8th International Conference on Knowledge\n  Capture (K-CAP 2015). Palisades, NY. 2015", "doi": "10.1145/2815833.2815841", "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new framework to evaluate and improve first-order (FO)\nontologies using automated theorem provers (ATPs) on the basis of competency\nquestions (CQs). Our framework includes both the adaptation of a methodology\nfor evaluating ontologies to the framework of first-order logic and a new set\nof non-trivial CQs designed to evaluate FO versions of SUMO, which\nsignificantly extends the very small set of CQs proposed in the literature.\nMost of these new CQs have been automatically generated from a small set of\npatterns and the mapping of WordNet to SUMO. Applying our framework, we\ndemonstrate that Adimen-SUMO v2.2 outperforms TPTP-SUMO. In addition, using the\nfeedback provided by ATPs we have set an improved version of Adimen-SUMO\n(v2.4). This new version outperforms the previous ones in terms of competency.\nFor instance, \"Humans can reason\" is automatically inferred from Adimen-SUMO\nv2.4, while it is neither deducible from TPTP-SUMO nor Adimen-SUMO v2.2.\n", "versions": [{"version": "v1", "created": "Fri, 16 Oct 2015 09:01:35 GMT"}], "update_date": "2015-10-19", "authors_parsed": [["Álvez", "Javier", ""], ["Lucio", "Paqui", ""], ["Rigau", "German", ""]]}, {"id": "1510.04821", "submitter": "Evgenii Kotelnikov", "authors": "Evgenii Kotelnikov, Laura Kov\\'acs, Giles Reger and Andrei Voronkov", "title": "The Vampire and the FOOL", "comments": null, "journal-ref": null, "doi": "10.1145/2854065.2854071", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents new features recently implemented in the theorem prover\nVampire, namely support for first-order logic with a first class boolean sort\n(FOOL) and polymorphic arrays. In addition to having a first class boolean\nsort, FOOL also contains if-then-else and let-in expressions. We argue that\npresented extensions facilitate reasoning-based program analysis, both by\nincreasing the expressivity of first-order reasoners and by gains in\nefficiency.\n", "versions": [{"version": "v1", "created": "Fri, 16 Oct 2015 09:24:17 GMT"}, {"version": "v2", "created": "Sat, 5 Dec 2015 12:34:21 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Kotelnikov", "Evgenii", ""], ["Kovács", "Laura", ""], ["Reger", "Giles", ""], ["Voronkov", "Andrei", ""]]}, {"id": "1510.04826", "submitter": "Javier \\'Alvez", "authors": "Javier \\'Alvez and Paqui Lucio and German Rigau", "title": "Evaluating the Competency of a First-Order Ontology", "comments": "4 pages, 4 figures", "journal-ref": "Proceedings of the 8th International Conference on Knowledge\n  Capture (K-CAP 2015). Palisades, NY. 2015", "doi": "10.1145/2815833.2816946", "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report on the results of evaluating the competency of a first-order\nontology for its use with automated theorem provers (ATPs). The evaluation\nfollows the adaptation of the methodology based on competency questions (CQs)\n[Gr\\\"uninger&Fox,1995] to the framework of first-order logic, which is\npresented in [\\'Alvez&Lucio&Rigau,2015], and is applied to Adimen-SUMO\n[\\'Alvez&Lucio&Rigau,2015]. The set of CQs used for this evaluation has been\nautomatically generated from a small set of semantic patterns and the mapping\nof WordNet to SUMO. Analysing the results, we can conclude that it is feasible\nto use ATPs for working with Adimen-SUMO v2.4, enabling the resolution of goals\nby means of performing non-trivial inferences.\n", "versions": [{"version": "v1", "created": "Fri, 16 Oct 2015 09:49:33 GMT"}], "update_date": "2015-10-19", "authors_parsed": [["Álvez", "Javier", ""], ["Lucio", "Paqui", ""], ["Rigau", "German", ""]]}, {"id": "1510.04854", "submitter": "Ruggero Lanotte Dr", "authors": "Valentina Castiglioni, Ruggero Lanotte, Massimo Merro", "title": "A Semantic Theory of the Internet of Things", "comments": "The contribution of Valentina Castiglioni is limited to an early\n  writing of some of the proofs in the Appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a process calculus for modelling systems in the Internet of Things\nparadigm. Our systems interact both with the physical environment, via sensors\nand actuators, and with smart devices, via short-range and Internet channels.\nThe calculus is equipped with a standard notion of bisimilarity which is a\nfully abstract characterisation of a well-known contextual equivalence. We use\nour semantic proof-methods to prove run-time properties as well as system\nequalities of non-trivial IoT systems.\n", "versions": [{"version": "v1", "created": "Fri, 16 Oct 2015 12:04:01 GMT"}, {"version": "v2", "created": "Tue, 19 Jan 2016 16:17:31 GMT"}, {"version": "v3", "created": "Tue, 23 Feb 2016 11:24:03 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Castiglioni", "Valentina", ""], ["Lanotte", "Ruggero", ""], ["Merro", "Massimo", ""]]}, {"id": "1510.04873", "submitter": "Iulia Dragomir", "authors": "Iulia Dragomir and Viorel Preoteasa and Stavros Tripakis", "title": "Translating Hierarchical Block Diagrams into Composite Predicate\n  Transformers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simulink is the de facto industrial standard for designing embedded control\nsystems. When dealing with the formal verification of Simulink models, we face\nthe problem of translating the graphical language of Simulink, namely,\nhierarchical block diagrams (HBDs), into a formalism suitable for verification.\nIn this paper, we study the translation of HBDs into the compositional\nrefinement calculus framework for reactive systems. Specifically, we consider\nas target language an algebra of atomic predicate transformers to capture basic\nSimulink blocks (both stateless and stateful), composed in series, in parallel,\nand in feedback. For a given HBD, there are many possible ways to translate it\ninto a term in this algebra, with different tradeoffs. We explore these\ntradeoffs, and present three translation algorithms. We report on a prototype\nimplementation of these algorithms in a tool that translates Simulink models\ninto algebra terms implemented in the Isabelle theorem prover. We test our tool\non several case studies including a benchmark Simulink model by Toyota. We\ncompare the three translation algorithms, with respect to size and readability\nof generated terms, simplifiability of the corresponding formulas, and other\nmetrics.\n", "versions": [{"version": "v1", "created": "Fri, 16 Oct 2015 13:16:24 GMT"}, {"version": "v2", "created": "Tue, 20 Oct 2015 09:38:48 GMT"}], "update_date": "2015-10-21", "authors_parsed": [["Dragomir", "Iulia", ""], ["Preoteasa", "Viorel", ""], ["Tripakis", "Stavros", ""]]}, {"id": "1510.05076", "submitter": "Brendan Fong", "authors": "Brendan Fong, Paolo Rapisarda, Pawe{\\l} Soboci\\'nski", "title": "A categorical approach to open and interconnected dynamical systems", "comments": "10 pages + 3 page appendix", "journal-ref": "Proceedings of the 31st Annual ACM/IEEE Symposium on Logic in\n  Computer Science (LICS '16). ACM, New York, NY, USA, pp 495-504, 2016", "doi": "10.1145/2933575.2934556", "report-no": null, "categories": "cs.SY cs.LO math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a sound and complete graphical theory for discrete linear\ntime-invariant dynamical systems. The graphical syntax, as in previous work, is\nclosely related to the classical notion of signal flow diagrams, differently\nfrom previous work, these are understood as multi-input multi-output\ntransducers that process streams with an \\emph{infinite past} as well as an\ninfinite future. This extended semantics features non-controllable systems, and\nwe develop a novel, structural characterisation of controllability. Our\napproach is formalised through the theory of props, extending the work of\nBonchi, Zanasi and the third author.\n", "versions": [{"version": "v1", "created": "Sat, 17 Oct 2015 06:26:04 GMT"}, {"version": "v2", "created": "Tue, 2 Feb 2016 19:09:53 GMT"}], "update_date": "2017-03-30", "authors_parsed": [["Fong", "Brendan", ""], ["Rapisarda", "Paolo", ""], ["Sobociński", "Paweł", ""]]}, {"id": "1510.05162", "submitter": "Sander in 't Veld", "authors": "Sander in 't Veld", "title": "Satisfiability of Short Circuit Logic", "comments": "Supervisors: dr. Inge Bethke, prof. dr. Jan van Eijck", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The logical connectives typically found in programming languages are similar\nto their mathematical counterparts, yet different due to their short-circuit\nbehaviour -- when evaluating them, the second argument is only evaluated if the\nfirst argument is not sufficient to determine the result. Combined with the\npossibility of side-effects, this creates a different type of logic called\nShort Circuit Logic. A greater theoretical understanding of this logic can lead\nto more efficient programming and faster program execution.\n  In this thesis, formula satisfiability in the context of Short Circuit Logic\nis discussed. A formal definition of evaluation based on valuation algebras is\npresented, alongside an alternative definition based on valuation paths. The\naccompanying satisfiability and `path-satisfiability' are then proven to be\nequivalent, and an implementation of path-satisfiability is given. Although\nfive types of valuation algebras can be discerned, there are only three\ncorresponding types of valuation paths. From this, conclusions are drawn about\nsatisfiability and side-effects; the manner in which side-effects alter truth\nvalues is relevant when analysing satisfiability, but the side-effects\nthemselves are not.\n", "versions": [{"version": "v1", "created": "Sat, 17 Oct 2015 19:40:23 GMT"}], "update_date": "2015-10-20", "authors_parsed": [["Veld", "Sander in 't", ""]]}, {"id": "1510.05326", "submitter": "Steffen Lewitzka", "authors": "Steffen Lewitzka", "title": "Combining intermediate propositional logics with classical logic", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": "TR-PGCOMP-001/2015. Technical Report. Computer Science Graduate\n  Program. Federal University of Bahia", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In [17], we introduced a modal logic, called $L$, which combines\nintuitionistic propositional logic $IPC$ and classical propositional logic\n$CPC$ and is complete w.r.t. an algebraic semantics. However, $L$ seems to be\ntoo weak for Kripke-style semantics. In this paper, we add positive and\nnegative introspection and show that the resulting logic $L5$ has a Kripke\nsemantics. For intermediate logics $I$, we consider the parametrized versions\n$L5(I)$ of $L5$ where $IPC$ is replaced by $I$. $L5(I)$ can be seen as a\nclassical modal logic for the reasoning about truth in $I$. From our results,\nwe derive a simple method for determining algebraic and Kripke semantics for\nsome specific intermediate logics. We discuss some examples which are of\ninterest for Computer Science, namely the Logic of Here-and-There,\nG\\\"odel-Dummett Logic and Jankov Logic. Our method provides new proofs of\ncompleteness theorems due to Hosoi, Dummett/Horn and Jankov, respectively.\n", "versions": [{"version": "v1", "created": "Mon, 19 Oct 2015 00:23:01 GMT"}], "update_date": "2015-10-20", "authors_parsed": [["Lewitzka", "Steffen", ""]]}, {"id": "1510.05460", "submitter": "Thorsten Wissmann", "authors": "Dmitry Chistikov, Wojciech Czerwi\\'nski, Piotr Hofman, Micha{\\l}\n  Pilipczuk, Michael Wehar", "title": "Shortest paths in one-counter systems", "comments": "28 pages, 2 figures", "journal-ref": "Logical Methods in Computer Science, Volume 15, Issue 1 (March 5,\n  2019) lmcs:5251", "doi": "10.23638/LMCS-15(1:19)2019", "report-no": null, "categories": "cs.FL cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We show that any one-counter automaton with $n$ states, if its language is\nnon-empty, accepts some word of length at most $O(n^2)$. This closes the gap\nbetween the previously known upper bound of $O(n^3)$ and lower bound of\n$\\Omega(n^2)$. More generally, we prove a tight upper bound on the length of\nshortest paths between arbitrary configurations in one-counter transition\nsystems (weaker bounds have previously appeared in the literature).\n", "versions": [{"version": "v1", "created": "Mon, 19 Oct 2015 13:21:29 GMT"}, {"version": "v2", "created": "Mon, 30 Oct 2017 17:06:57 GMT"}, {"version": "v3", "created": "Tue, 4 Sep 2018 16:45:05 GMT"}, {"version": "v4", "created": "Thu, 6 Sep 2018 12:06:54 GMT"}, {"version": "v5", "created": "Mon, 4 Mar 2019 11:38:20 GMT"}], "update_date": "2019-04-29", "authors_parsed": [["Chistikov", "Dmitry", ""], ["Czerwiński", "Wojciech", ""], ["Hofman", "Piotr", ""], ["Pilipczuk", "Michał", ""], ["Wehar", "Michael", ""]]}, {"id": "1510.05724", "submitter": "Michael Blondin", "authors": "Michael Blondin, Alain Finkel, Christoph Haase, Serge Haddad", "title": "Approaching the Coverability Problem Continuously", "comments": "18 pages, 4 figures", "journal-ref": null, "doi": "10.1007/978-3-662-49674-9_28", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The coverability problem for Petri nets plays a central role in the\nverification of concurrent shared-memory programs. However, its high\nEXPSPACE-complete complexity poses a challenge when encountered in real-world\ninstances. In this paper, we develop a new approach to this problem which is\nprimarily based on applying forward coverability in continuous Petri nets as a\npruning criterion inside a backward coverability framework. A cornerstone of\nour approach is the efficient encoding of a recently developed polynomial-time\nalgorithm for reachability in continuous Petri nets into SMT. We demonstrate\nthe effectiveness of our approach on standard benchmarks from the literature,\nwhich shows that our approach decides significantly more instances than any\nexisting tool and is in addition often much faster, in particular on large\ninstances.\n", "versions": [{"version": "v1", "created": "Tue, 20 Oct 2015 00:02:48 GMT"}, {"version": "v2", "created": "Sat, 9 Jan 2016 20:31:45 GMT"}], "update_date": "2017-03-24", "authors_parsed": [["Blondin", "Michael", ""], ["Finkel", "Alain", ""], ["Haase", "Christoph", ""], ["Haddad", "Serge", ""]]}, {"id": "1510.06020", "submitter": "Viktor Lopatkin", "authors": "Andrey Grinblat and Viktor Lopatkin", "title": "Petri Nets and its Polynomials", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For every finite Petri net, we construct a commutative polynomial in two\nvariables and with coefficients from the semiring of natural numbers. We also\npresent an inverse construction and show that multiplication of polynomials\ncorrespondence to the product of the corresponding Petri nets in the category\nof Petri nets with Winskel's morphisms. We endow the set of all Petri nets with\nZariski topology.\n", "versions": [{"version": "v1", "created": "Sat, 17 Oct 2015 14:58:13 GMT"}, {"version": "v2", "created": "Fri, 19 Aug 2016 23:28:22 GMT"}, {"version": "v3", "created": "Thu, 1 Sep 2016 04:02:51 GMT"}, {"version": "v4", "created": "Sun, 25 Jun 2017 15:43:45 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Grinblat", "Andrey", ""], ["Lopatkin", "Viktor", ""]]}, {"id": "1510.06178", "submitter": "Willem Heijltjes", "authors": "Willem Heijltjes (University of Bath), Robin Houston", "title": "Proof equivalence in MLL is PSPACE-complete", "comments": "Journal version of: Willem Heijltjes and Robin Houston. No proof nets\n  for MLL with units: Proof equivalence in MLL is PSPACE-complete. In Proc.\n  Joint Meeting of the 23rd EACSL Annual Conference on Computer Science Logic\n  and the 29th Annual ACM/IEEE Symposium on Logic in Computer Science, 2014", "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 1 (March 2,\n  2016) lmcs:1625", "doi": "10.2168/LMCS-12(1:2)2016", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MLL proof equivalence is the problem of deciding whether two proofs in\nmultiplicative linear logic are related by a series of inference permutations.\nIt is also known as the word problem for star-autonomous categories. Previous\nwork has shown the problem to be equivalent to a rewiring problem on proof\nnets, which are not canonical for full MLL due to the presence of the two\nunits. Drawing from recent work on reconfiguration problems, in this paper it\nis shown that MLL proof equivalence is PSPACE-complete, using a reduction from\nNondeterministic Constraint Logic. An important consequence of the result is\nthat the existence of a satisfactory notion of proof nets for MLL with units is\nruled out (under current complexity assumptions). The PSPACE-hardness result\nextends to equivalence of normal forms in MELL without units, where the\nweakening rule for the exponentials induces a similar rewiring problem.\n", "versions": [{"version": "v1", "created": "Wed, 21 Oct 2015 09:40:26 GMT"}, {"version": "v2", "created": "Tue, 1 Mar 2016 09:43:24 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Heijltjes", "Willem", "", "University of Bath"], ["Houston", "Robin", ""]]}, {"id": "1510.06233", "submitter": "Kees Middelburg", "authors": "J. A. Bergstra, C. A. Middelburg", "title": "Transformation of fractions into simple fractions in divisive meadows", "comments": "23 pages; one theorem and two corollaries of it added at end of Sect.\n  5; some minor errors corrected", "journal-ref": "Journal of Applied Logic, 16:92--110, 2016", "doi": "10.1016/j.jal.2016.03.001", "report-no": null, "categories": "math.RA cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Meadows are alternatives for fields with a purely equational axiomatization.\nAt the basis of meadows lies the decision to make the multiplicative inverse\noperation total by imposing that the multiplicative inverse of zero is zero.\nDivisive meadows are meadows with the multiplicative inverse operation replaced\nby a division operation. Viewing a fraction as a term over the signature of\ndivisive meadows that is of the form p / q, we investigate which divisive\nmeadows admit transformation of fractions into simple fractions, i.e. fractions\nwithout proper subterms that are fractions.\n", "versions": [{"version": "v1", "created": "Wed, 21 Oct 2015 12:37:54 GMT"}, {"version": "v2", "created": "Fri, 27 Nov 2015 14:17:48 GMT"}, {"version": "v3", "created": "Thu, 25 Feb 2016 16:28:58 GMT"}], "update_date": "2016-06-08", "authors_parsed": [["Bergstra", "J. A.", ""], ["Middelburg", "C. A.", ""]]}, {"id": "1510.06298", "submitter": "Barnaby Martin", "authors": "Barnaby Martin and Dmitriy Zhuk", "title": "Switchability and collapsibility of Gap Algebras", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let A be an idempotent algebra on a 3-element domain D that omits a G-set for\na factor. Suppose A is not \\alpha\\beta-projective (for some alpha, beta subsets\nof D) and is not collapsible. It follows that A is switchable. We prove that,\nfor every finite subset Delta of Inv(A), Pol(Delta) is collapsible. We also\nexhibit an algebra that is collapsible from a non-singleton source but is not\ncollapsible from any singleton source.\n", "versions": [{"version": "v1", "created": "Wed, 21 Oct 2015 15:29:01 GMT"}], "update_date": "2015-10-22", "authors_parsed": [["Martin", "Barnaby", ""], ["Zhuk", "Dmitriy", ""]]}, {"id": "1510.06587", "submitter": "Wojciech Jamroga", "authors": "Wojciech Jamroga, Micha{\\l} Knapik, Damian Kurpiewski", "title": "Approximating Strategic Abilities under Imperfect Information: a Naive\n  Approach", "comments": "Updated version, August 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Alternating-time temporal logic (ATL) allows to specify requirements on\nabilities that different agents should (or should not) possess in a multi-agent\nsystem. However, model checking ATL specifications in realistic systems is\ncomputationally hard. In particular, if the agents have imperfect information\nabout the global state of the system, the complexity ranges from Delta2P to\nundecidable, depending on the syntactic and semantic details. The problem is\nalso hard in practice, as evidenced by several recent attempts to tackle it. On\nthe other hand, model checking of alternating epistemic mu-calculus can have a\ndistinctly lower computational complexity.\n  In this work, we look at the idea of approximating the former problem by the\nverification of its \"naive\" translations to the latter. In other words, we look\nat what happens when one uses the (incorrect) fixpoint algorithm to verify\nformulae of ATL with imperfect information.\n", "versions": [{"version": "v1", "created": "Thu, 22 Oct 2015 11:59:09 GMT"}, {"version": "v2", "created": "Tue, 30 Aug 2016 15:15:39 GMT"}], "update_date": "2016-08-31", "authors_parsed": [["Jamroga", "Wojciech", ""], ["Knapik", "Michał", ""], ["Kurpiewski", "Damian", ""]]}, {"id": "1510.06649", "submitter": "Mathys Rennela", "authors": "Mathys Rennela", "title": "Operator Algebras in Quantum Computation", "comments": "37 pages, made under the supervision of Prof. dr. B.P.F. Jacobs in\n  partial fulfillment of the Master Parisien de Recherche en Informatique\n  (MPRI) of Universit\\'e Paris 7 Diderot", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.CT math.OA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this master thesis, I discuss how the theory of operator algebras, also\ncalled operator theory, can be applied in quantum computer science.\n", "versions": [{"version": "v1", "created": "Thu, 22 Oct 2015 14:44:25 GMT"}], "update_date": "2015-10-23", "authors_parsed": [["Rennela", "Mathys", ""]]}, {"id": "1510.06658", "submitter": "S", "authors": "S{\\o}ren Debois (IT University of Copenhagen), Thomas Hildebrandt (IT\n  University of Copenhagen), Tijs Slaats (IT University of Copenhagen,\n  Exformatics A/S), Nobuko Yoshida (Imperial College, London, Department of\n  Computing)", "title": "Type-checking Liveness for Collaborative Processes with Bounded and\n  Unbounded Recursion", "comments": "Accepted for publication in Logical Methods in Computer Science", "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 1 (January\n  6, 2016) lmcs:1624", "doi": "10.2168/LMCS-12(1:1)2016", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the first session typing system guaranteeing request-response\nliveness properties for possibly non-terminating communicating processes. The\ntypes augment the branch and select types of the standard binary session types\nwith a set of required responses, indicating that whenever a particular label\nis selected, a set of other labels, its responses, must eventually also be\nselected. We prove that these extended types are strictly more expressive than\nstandard session types. We provide a type system for a process calculus similar\nto a subset of collaborative BPMN processes with internal (data-based) and\nexternal (event-based) branching, message passing, bounded and unbounded\nlooping. We prove that this type system is sound, i.e., it guarantees\nrequest-response liveness for dead-lock free processes. We exemplify the use of\nthe calculus and type system on a concrete example of an infinite state system.\n", "versions": [{"version": "v1", "created": "Thu, 22 Oct 2015 15:30:27 GMT"}, {"version": "v2", "created": "Thu, 29 Oct 2015 13:04:59 GMT"}, {"version": "v3", "created": "Tue, 5 Jan 2016 10:22:56 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Debois", "Søren", "", "IT University of Copenhagen"], ["Hildebrandt", "Thomas", "", "IT\n  University of Copenhagen"], ["Slaats", "Tijs", "", "IT University of Copenhagen,\n  Exformatics A/S"], ["Yoshida", "Nobuko", "", "Imperial College, London, Department of\n  Computing"]]}, {"id": "1510.06700", "submitter": "Konrad W. Schwerdtfeger", "authors": "Konrad W. Schwerdtfeger", "title": "Connectivity of Boolean Satisfiability", "comments": "PhD thesis, 82 pages, contains all results from the previous papers\n  arXiv:1312.4524, arXiv:1312.6679, and arXiv:1403.6165, plus additional\n  findings. arXiv admin note: text overlap with arXiv:cs/0609072 by other\n  authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For Boolean satisfiability problems, the structure of the solution space is\ncharacterized by the solution graph, where the vertices are the solutions, and\ntwo solutions are connected iff they differ in exactly one variable. For this\nimplicitly defined graph, we here study the st-connectivity and connectivity\nproblems.\n  Building on the work of Gopalan et al. (\"The Connectivity of Boolean\nSatisfiability: Computational and Structural Dichotomies\", 2006/2009), we first\ninvestigate satisfiability problems given by CSPs, more exactly CNF(S)-formulas\nwith constants (as considered in Schaefer's famous 1978 dichotomy theorem); we\nprove a computational dichotomy for the st-connectivity problem, asserting that\nit is either solvable in polynomial time or PSPACE-complete, and an aligned\nstructural dichotomy, asserting that the maximal diameter of connected\ncomponents is either linear in the number of variables, or can be exponential;\nfurther, we show a trichotomy for the connectivity problem, asserting that it\nis either in P, coNP-complete, or PSPACE-complete.\n  Next we investigate two important variants: CNF(S)-formulas without\nconstants, and partially quantified formulas; in both cases, we prove analogous\ndichotomies for st-connectivity and the diameter; for for the connectivity\nproblem, we show a trichotomy in the case of quantified formulas, while in the\ncase of formulas without constants, we identify fragments of a possible\ntrichotomy.\n  Finally, we consider the connectivity issues for B-formulas, which are\narbitrarily nested formulas built from some fixed set B of connectives, and for\nB-circuits, which are Boolean circuits where the gates are from some finite set\nB; we prove a common dichotomy for both connectivity problems and the diameter;\nfor partially quantified B-formulas, we show an analogous dichotomy.\n", "versions": [{"version": "v1", "created": "Thu, 22 Oct 2015 17:47:22 GMT"}], "update_date": "2015-10-23", "authors_parsed": [["Schwerdtfeger", "Konrad W.", ""]]}, {"id": "1510.06879", "submitter": "Julien Lange", "authors": "Julien Lange, Nobuko Yoshida", "title": "Characteristic Formulae for Session Types (extended version)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Subtyping is a crucial ingredient of session type theory and its\napplications, notably to programming language implementations. In this paper,\nwe study effective ways to check whether a session type is a subtype of another\nby applying a characteristic formulae approach to the problem. Our core\ncontribution is an algorithm to generate a modal mu-calculus formula that\ncharacterises all the supertypes (or subtypes) of a given type. Subtyping\nchecks can then be off-loaded to model checkers, thus incidentally yielding an\nefficient algorithm to check safety of session types, soundly and completely.\nWe have implemented our theory and compared its cost with other classical\nsubtyping algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 23 Oct 2015 10:15:23 GMT"}], "update_date": "2015-10-26", "authors_parsed": [["Lange", "Julien", ""], ["Yoshida", "Nobuko", ""]]}, {"id": "1510.07247", "submitter": "Samuel Bucheli", "authors": "Samuel Bucheli", "title": "Some Notes on Temporal Justification Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Justification logics are modal-like logics with the additional capability of\nrecording the reason, or justification, for modalities in syntactic structures,\ncalled justification terms. Justification logics can be seen as explicit\ncounterparts to modal logic. The behavior and interaction of agents in\ndistributed system is often modeled using logics of knowledge and time. In this\npaper, we sketch some preliminary ideas on how the modal knowledge part of such\nlogics of knowledge and time could be replaced with an appropriate\njustification logic.\n", "versions": [{"version": "v1", "created": "Sun, 25 Oct 2015 13:52:36 GMT"}], "update_date": "2015-10-27", "authors_parsed": [["Bucheli", "Samuel", ""]]}, {"id": "1510.07253", "submitter": "Francesco Tiezzi", "authors": "Francesco Tiezzi and Nobuko Yoshida", "title": "Reversing Single Sessions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Session-based communication has gained a widespread acceptance in practice as\na means for developing safe communicating systems via structured interactions.\nIn this paper, we investigate how these structured interactions are affected by\nreversibility, which provides a computational model allowing executed\ninteractions to be undone. In particular, we provide a systematic study of the\nintegration of different notions of reversibility in both binary and multiparty\nsingle sessions. The considered forms of reversibility are: one for completely\nreversing a given session with one backward step, and another for also\nrestoring any intermediate state of the session with either one backward step\nor multiple ones. We analyse the costs of reversing a session in all these\ndifferent settings. Our results show that extending binary single sessions to\nmultiparty ones does not affect the reversibility machinery and its costs.\n", "versions": [{"version": "v1", "created": "Sun, 25 Oct 2015 14:41:33 GMT"}, {"version": "v2", "created": "Fri, 8 Apr 2016 13:14:14 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Tiezzi", "Francesco", ""], ["Yoshida", "Nobuko", ""]]}, {"id": "1510.07276", "submitter": "J\\\"urgen Koslowski", "authors": "Cynthia Kop, Aart Middeldorp and Thomas Sternagel", "title": "Complexity of Conditional Term Rewriting", "comments": "This is an extended and improved version of \"Conditional Complexity\"\n  as published in the proceedings of RTA 2015. It has been submitted for\n  journal publication in LMCS", "journal-ref": "Logical Methods in Computer Science, Volume 13, Issue 1 (February\n  6, 2017) lmcs:3123", "doi": "10.23638/LMCS-13(1:6)2017", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a notion of complexity for oriented conditional term rewrite\nsystems satisfying certain restrictions. This notion is realistic in the sense\nthat it measures not only successful computations, but also partial\ncomputations that result in a failed rule application. A transformation to\nunconditional context-sensitive rewrite systems is presented which reflects\nthis complexity notion, as well as a technique to derive runtime and\nderivational complexity bounds for the result of this transformation.\n", "versions": [{"version": "v1", "created": "Sun, 25 Oct 2015 18:02:01 GMT"}, {"version": "v2", "created": "Wed, 23 Nov 2016 15:31:42 GMT"}, {"version": "v3", "created": "Wed, 28 Dec 2016 15:01:23 GMT"}, {"version": "v4", "created": "Sun, 1 Jan 2017 00:16:26 GMT"}, {"version": "v5", "created": "Fri, 3 Feb 2017 17:16:24 GMT"}, {"version": "v6", "created": "Wed, 22 Mar 2017 13:58:07 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Kop", "Cynthia", ""], ["Middeldorp", "Aart", ""], ["Sternagel", "Thomas", ""]]}, {"id": "1510.07293", "submitter": "Peter Thiemann", "authors": "Martin Sulzmann and Peter Thiemann", "title": "Forkable Regular Expressions", "comments": "12 pages plus technical appendix, to appear in LATA 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider forkable regular expressions, which enrich regular expressions\nwith a fork operator, to establish a formal basis for static and dynamic\nanalysis of the communication behavior of concurrent programs. We define a\nnovel compositional semantics for forkable expressions, establish their\nfundamental properties, and define derivatives for them as a basis for the\ngeneration of automata, for matching, and for language containment tests.\nForkable expressions may give rise to non-regular languages, in general, but we\nidentify sufficient conditions on expressions that guarantee finiteness of the\nautomata construction via derivatives.\n", "versions": [{"version": "v1", "created": "Sun, 25 Oct 2015 19:42:43 GMT"}, {"version": "v2", "created": "Tue, 8 Dec 2015 20:23:31 GMT"}], "update_date": "2015-12-09", "authors_parsed": [["Sulzmann", "Martin", ""], ["Thiemann", "Peter", ""]]}, {"id": "1510.07313", "submitter": "Dorsa Sadigh", "authors": "Dorsa Sadigh, Ashish Kapoor", "title": "Safe Control under Uncertainty", "comments": "10 pages, 6 figures, Submitted to HSCC 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.AI cs.LO cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Controller synthesis for hybrid systems that satisfy temporal specifications\nexpressing various system properties is a challenging problem that has drawn\nthe attention of many researchers. However, making the assumption that such\ntemporal properties are deterministic is far from the reality. For example,\nmany of the properties the controller has to satisfy are learned through\nmachine learning techniques based on sensor input data. In this paper, we\npropose a new logic, Probabilistic Signal Temporal Logic (PrSTL), as an\nexpressive language to define the stochastic properties, and enforce\nprobabilistic guarantees on them. We further show how to synthesize safe\ncontrollers using this logic for cyber-physical systems under the assumption\nthat the stochastic properties are based on a set of Gaussian random variables.\nOne of the key distinguishing features of PrSTL is that the encoded logic is\nadaptive and changes as the system encounters additional data and updates its\nbeliefs about the latent random variables that define the safety properties. We\ndemonstrate our approach by synthesizing safe controllers under the PrSTL\nspecifications for multiple case studies including control of quadrotors and\nautonomous vehicles in dynamic environments.\n", "versions": [{"version": "v1", "created": "Sun, 25 Oct 2015 22:02:48 GMT"}], "update_date": "2015-10-27", "authors_parsed": [["Sadigh", "Dorsa", ""], ["Kapoor", "Ashish", ""]]}, {"id": "1510.07898", "submitter": "Oana Andrei", "authors": "Oana Andrei, Muffy Calder, Matthew Chalmers, Alistair Morrison,\n  Mattias Rost", "title": "Probabilistic Formal Analysis of App Usage to Inform Redesign", "comments": "13 pages, 6 figures, 7 tables, under review", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper sets out a process of app analysis intended to support\nunderstanding of use but also redesign. From usage logs we infer activity\npatterns - Markov models - and employ probabilistic formal analysis to ask\nquestions about the use of the app. The core of this paper's contribution is a\nbridging of stochastic and formal modelling, but we also describe the work to\nmake that analytic core utile within a design team. We illustrate our work via\na case study of a mobile app presenting analytic findings and discussing how\nthey are feeding into redesign. We had posited that two activity patterns\nindicated two separable sets of users, each of which might benefit from a\ndifferently tailored app version, but our subsequent analysis detailed users'\ninterleaving of activity patterns over time - evidence speaking more in favour\nof redesign that supports each pattern in an integrated way. We uncover\npatterns consisting of brief glances at particular data and recommend them as\npossible candidates for new design work on widget extensions: small displays\navailable while users use other apps.\n", "versions": [{"version": "v1", "created": "Tue, 27 Oct 2015 13:30:44 GMT"}], "update_date": "2015-10-28", "authors_parsed": [["Andrei", "Oana", ""], ["Calder", "Muffy", ""], ["Chalmers", "Matthew", ""], ["Morrison", "Alistair", ""], ["Rost", "Mattias", ""]]}, {"id": "1510.08079", "submitter": "Alena Rodionova", "authors": "Alena Rodionova, Ezio Bartocci, Dejan Nickovic, Radu Grosu", "title": "Temporal Logic as Filtering", "comments": "10 pages", "journal-ref": "HSCC 2016, April 12 - 14, 2016, Vienna, Austria", "doi": "10.1145/2883817.2883839", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that metric temporal logic can be viewed as linear time-invariant\nfiltering, by interpreting addition, multiplication, and their neutral\nelements, over the (max,min,0,1) idempotent dioid. Moreover, by interpreting\nthese operators over the field of reals (+,*,0,1), one can associate various\nquantitative semantics to a metric-temporal-logic formula, depending on the\nfilter's kernel used: square, rounded-square, Gaussian, low-pass, band-pass, or\nhigh-pass. This remarkable connection between filtering and metric temporal\nlogic allows us to freely navigate between the two, and to regard\nsignal-feature detection as logical inference. To the best of our knowledge,\nthis connection has not been established before. We prove that our qualitative,\nfiltering semantics is identical to the classical MTL semantics. We also\nprovide a quantitative semantics for MTL, which measures the normalized,\nmaximum number of times a formula is satisfied within its associated kernel, by\na given signal. We show that this semantics is sound, in the sense that, if its\nmeasure is 0, then the formula is not satisfied, and it is satisfied otherwise.\nWe have implemented both of our semantics in Matlab, and illustrate their\nproperties on various formulas and signals, by plotting their computed\nmeasures.\n", "versions": [{"version": "v1", "created": "Tue, 27 Oct 2015 20:12:43 GMT"}, {"version": "v2", "created": "Tue, 9 Feb 2016 16:51:46 GMT"}], "update_date": "2016-02-10", "authors_parsed": [["Rodionova", "Alena", ""], ["Bartocci", "Ezio", ""], ["Nickovic", "Dejan", ""], ["Grosu", "Radu", ""]]}, {"id": "1510.08331", "submitter": "Leroux J", "authors": "Drewes Frank (Dept. of Computing Science, Ume{\\aa} University,\n  Ume{\\aa}, Sweden), Leroux J\\'er\\^ome (LaBRI, CNRS)", "title": "Structurally Cyclic Petri Nets", "comments": "9 pages. Key words: Petri net, vector addition system, structural\n  cyclicity, reachability", "journal-ref": "Logical Methods in Computer Science, Volume 11, Issue 4 (December\n  22, 2015) lmcs:1616", "doi": "10.2168/LMCS-11(4:15)2015", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Petri net is structurally cyclic if every configuration is reachable from\nitself in one or more steps. We show that structural cyclicity is decidable in\ndeterministic polynomial time. For this, we adapt the Kosaraju's approach for\nthe general reachability problem for Petri nets.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2015 14:54:34 GMT"}, {"version": "v2", "created": "Sun, 20 Dec 2015 17:58:58 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Frank", "Drewes", "", "Dept. of Computing Science, Umeå University,\n  Umeå, Sweden"], ["Jérôme", "Leroux", "", "LaBRI, CNRS"]]}, {"id": "1510.08393", "submitter": "Markus N Rabe", "authors": "Benjamin Caulfield, Markus N. Rabe, Sanjit A. Seshia, Stavros Tripakis", "title": "What's Decidable about Syntax-Guided Synthesis?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Syntax-guided synthesis (SyGuS) is a recently proposed framework for program\nsynthesis problems. The SyGuS problem is to find an expression or program\ngenerated by a given grammar that meets a correctness specification.\nCorrectness specifications are given as formulas in suitable logical theories,\ntypically amongst those studied in satisfiability modulo theories (SMT).\n  In this work, we analyze the decidability of the SyGuS problem for different\nclasses of grammars and correctness specifications. We prove that the SyGuS\nproblem is undecidable for the theory of equality with uninterpreted functions\n(EUF).We identify a fragment of EUF, which we call regular-EUF, for which the\nSyGuS problem is decidable. We prove that this restricted problem is\nEXPTIME-complete and that the sets of solution expressions are precisely the\nregular tree languages. For theories that admit a unique, finite domain, we\ngive a general algorithm to solve the SyGuS problem on tree grammars.\nFinite-domain theories include the bit-vector theory without concatenation. We\nprove SyGuS undecidable for a very simple bit-vector theory with concatenation,\nboth for context-free grammars and for tree grammars. Finally, we give some\nadditional results for linear arithmetic and bit-vector arithmetic along with a\ndiscussion of the implication of these results.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2015 17:52:31 GMT"}, {"version": "v2", "created": "Tue, 1 Nov 2016 00:58:42 GMT"}], "update_date": "2016-11-02", "authors_parsed": [["Caulfield", "Benjamin", ""], ["Rabe", "Markus N.", ""], ["Seshia", "Sanjit A.", ""], ["Tripakis", "Stavros", ""]]}, {"id": "1510.08474", "submitter": "Chanyeol Yoo", "authors": "Chanyeol Yoo and Calin Belta", "title": "Control with Probabilistic Signal Temporal Logic", "comments": "7 pages, submitted to the 2016 American Control Conference (ACC 2016)\n  on September, 30, 2015 (under review)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.LO cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autonomous agents often operate in uncertain environments where their\ndecisions are made based on beliefs over states of targets. We are interested\nin controller synthesis for complex tasks defined over belief spaces. Designing\nsuch controllers is challenging due to computational complexity and the lack of\nexpressivity of existing specification languages. In this paper, we propose a\nprobabilistic extension to signal temporal logic (STL) that expresses tasks\nover continuous belief spaces. We present an efficient synthesis algorithm to\nfind a control input that maximises the probability of satisfying a given task.\nWe validate our algorithm through simulations of an unmanned aerial vehicle\ndeployed for surveillance and search missions.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2015 20:25:00 GMT"}], "update_date": "2015-10-30", "authors_parsed": [["Yoo", "Chanyeol", ""], ["Belta", "Calin", ""]]}, {"id": "1510.08498", "submitter": "Dieter Spreen", "authors": "Ulrich Berger and Dieter Spreen", "title": "A Coinductive Approach to Computing with Compact Sets", "comments": "34 pages", "journal-ref": null, "doi": "10.4115/jla.2016.8.3", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exact representations of real numbers such as the signed digit representation\nor more generally linear fractional representations or the infinite Gray code\nrepresent real numbers as infinite streams of digits. In earlier work by the\nfirst author it was shown how to extract certified algorithms working with the\nsigned digit representations from constructive proofs. In this paper we lay the\nfoundation for doing a similar thing with nonempty compact sets. It turns out\nthat a representation by streams of finitely many digits is impossible and\ninstead trees are needed.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2015 21:38:42 GMT"}, {"version": "v2", "created": "Fri, 15 Apr 2016 02:37:42 GMT"}, {"version": "v3", "created": "Wed, 25 May 2016 13:20:52 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Berger", "Ulrich", ""], ["Spreen", "Dieter", ""]]}, {"id": "1510.08506", "submitter": "Anthony Widjaja Lin", "authors": "Anthony W. Lin, Truong Khanh Nguyen, Philipp R\\\"ummer, Jun Sun", "title": "Regular Symmetry Patterns (Technical Report)", "comments": "Technical report of VMCAI'16 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Symmetry reduction is a well-known approach for alleviating the state\nexplosion problem in model checking. Automatically identifying symmetries in\nconcurrent systems, however, is computationally expensive. We propose a\nsymbolic framework for capturing symmetry patterns in parameterised systems\n(i.e. an infinite family of finite-state systems): two regular word transducers\nto represent, respectively, parameterised systems and symmetry patterns. The\nframework subsumes various types of symmetry relations ranging from weaker\nnotions (e.g. simulation preorders) to the strongest notion (i.e.\nisomorphisms). Our framework enjoys two algorithmic properties: (1) symmetry\nverification: given a transducer, we can automatically check whether it is a\nsymmetry pattern of a given system, and (2) symmetry synthesis: we can\nautomatically generate a symmetry pattern for a given system in the form of a\ntransducer. Furthermore, our symbolic language allows additional constraints\nthat the symmetry patterns need to satisfy to be easily incorporated in the\nverification/synthesis. We show how these properties can help identify symmetry\npatterns in examples like dining philosopher protocols, self-stabilising\nprotocols, and prioritised resource-allocator protocol. In some cases (e.g.\nGries's coffee can problem), our technique automatically synthesises a\nsafety-preserving finite approximant, which can then be verified for safety\nsolely using a finite-state model checker.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2015 21:54:13 GMT"}], "update_date": "2015-10-30", "authors_parsed": [["Lin", "Anthony W.", ""], ["Nguyen", "Truong Khanh", ""], ["Rümmer", "Philipp", ""], ["Sun", "Jun", ""]]}, {"id": "1510.08517", "submitter": "Hongfei Fu", "authors": "Krishnendu Chatterjee, Hongfei Fu, Petr Novotny, Rouzbeh Hasheminezhad", "title": "Algorithmic Analysis of Qualitative and Quantitative Termination\n  Problems for Affine Probabilistic Programs", "comments": "24 pages, full version to the conference paper on POPL 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider termination of probabilistic programs with\nreal-valued variables. The questions concerned are:\n  1. qualitative ones that ask (i) whether the program terminates with\nprobability 1 (almost-sure termination) and (ii) whether the expected\ntermination time is finite (finite termination); 2. quantitative ones that ask\n(i) to approximate the expected termination time (expectation problem) and (ii)\nto compute a bound B such that the probability to terminate after B steps\ndecreases exponentially (concentration problem).\n  To solve these questions, we utilize the notion of ranking supermartingales\nwhich is a powerful approach for proving termination of probabilistic programs.\nIn detail, we focus on algorithmic synthesis of linear ranking-supermartingales\nover affine probabilistic programs (APP's) with both angelic and demonic\nnon-determinism. An important subclass of APP's is LRAPP which is defined as\nthe class of all APP's over which a linear ranking-supermartingale exists.\n  Our main contributions are as follows. Firstly, we show that the membership\nproblem of LRAPP (i) can be decided in polynomial time for APP's with at most\ndemonic non-determinism, and (ii) is NP-hard and in PSPACE for APP's with\nangelic non-determinism; moreover, the NP-hardness result holds already for\nAPP's without probability and demonic non-determinism. Secondly, we show that\nthe concentration problem over LRAPP can be solved in the same complexity as\nfor the membership problem of LRAPP. Finally, we show that the expectation\nproblem over LRAPP can be solved in 2EXPTIME and is PSPACE-hard even for APP's\nwithout probability and non-determinism (i.e., deterministic programs). Our\nexperimental results demonstrate the effectiveness of our approach to answer\nthe qualitative and quantitative questions over APP's with at most demonic\nnon-determinism.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2015 22:37:28 GMT"}], "update_date": "2015-10-30", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Fu", "Hongfei", ""], ["Novotny", "Petr", ""], ["Hasheminezhad", "Rouzbeh", ""]]}, {"id": "1510.08564", "submitter": "J\\\"urgen Koslowski", "authors": "Giorgi Japaridze (Villanova University, USA)", "title": "Build your own clarithmetic I: Setup and completeness", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 3 (April 27,\n  2017) lmcs:2020", "doi": "10.2168/LMCS-12(3:8)2016", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Clarithmetics are number theories based on computability logic (see\nhttp://www.csc.villanova.edu/~japaridz/CL/ ). Formulas of these theories\nrepresent interactive computational problems, and their \"truth\" is understood\nas existence of an algorithmic solution. Various complexity constraints on such\nsolutions induce various versions of clarithmetic. The present paper introduces\na parameterized/schematic version CLA11(P1,P2,P3,P4). By tuning the three\nparameters P1,P2,P3 in an essentially mechanical manner, one automatically\nobtains sound and complete theories with respect to a wide range of target\ntricomplexity classes, i.e. combinations of time (set by P3), space (set by P2)\nand so called amplitude (set by P1) complexities. Sound in the sense that every\ntheorem T of the system represents an interactive number-theoretic\ncomputational problem with a solution from the given tricomplexity class and,\nfurthermore, such a solution can be automatically extracted from a proof of T.\nAnd complete in the sense that every interactive number-theoretic problem with\na solution from the given tricomplexity class is represented by some theorem of\nthe system. Furthermore, through tuning the 4th parameter P4, at the cost of\nsacrificing recursive axiomatizability but not simplicity or elegance, the\nabove extensional completeness can be strengthened to intensional completeness,\naccording to which every formula representing a problem with a solution from\nthe given tricomplexity class is a theorem of the system. This article is\npublished in two parts. The present Part I introduces the system and proves its\ncompleteness, while Part II is devoted to proving soundness.\n", "versions": [{"version": "v1", "created": "Thu, 29 Oct 2015 05:29:17 GMT"}, {"version": "v2", "created": "Wed, 22 Jun 2016 12:14:43 GMT"}, {"version": "v3", "created": "Mon, 1 Aug 2016 11:01:50 GMT"}, {"version": "v4", "created": "Mon, 5 Sep 2016 19:44:01 GMT"}, {"version": "v5", "created": "Sun, 11 Sep 2016 21:04:01 GMT"}, {"version": "v6", "created": "Tue, 13 Sep 2016 13:00:58 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Japaridze", "Giorgi", "", "Villanova University, USA"]]}, {"id": "1510.08566", "submitter": "J\\\"urgen Koslowski", "authors": "Giorgi Japaridze (Department of Computing Sciences, Villanova\n  University)", "title": "Build your own clarithmetic II: Soundness", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 3 (April 27,\n  2017) lmcs:2042", "doi": "10.2168/LMCS-12(3:12)2016", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Clarithmetics are number theories based on computability logic (see\nhttp://www.csc.villanova.edu/~japaridz/CL/ ). Formulas of these theories\nrepresent interactive computational problems, and their \"truth\" is understood\nas existence of an algorithmic solution. Various complexity constraints on such\nsolutions induce various versions of clarithmetic. The present paper introduces\na parameterized/schematic version CLA11(P1,P2,P3,P4). By tuning the three\nparameters P1,P2,P3 in an essentially mechanical manner, one automatically\nobtains sound and complete theories with respect to a wide range of target\ntricomplexity classes, i.e. combinations of time (set by P3), space (set by P2)\nand so called amplitude (set by P1) complexities. Sound in the sense that every\ntheorem T of the system represents an interactive number-theoretic\ncomputational problem with a solution from the given tricomplexity class and,\nfurthermore, such a solution can be automatically extracted from a proof of T.\nAnd complete in the sense that every interactive number-theoretic problem with\na solution from the given tricomplexity class is represented by some theorem of\nthe system. Furthermore, through tuning the 4th parameter P4, at the cost of\nsacrificing recursive axiomatizability but not simplicity or elegance, the\nabove extensional completeness can be strengthened to intensional completeness,\naccording to which every formula representing a problem with a solution from\nthe given tricomplexity class is a theorem of the system. This article is\npublished in two parts. The previous Part I has introduced the system and\nproved its completeness, while the present Part II is devoted to proving\nsoundness.\n", "versions": [{"version": "v1", "created": "Thu, 29 Oct 2015 05:33:15 GMT"}, {"version": "v2", "created": "Wed, 22 Jun 2016 12:21:10 GMT"}, {"version": "v3", "created": "Mon, 1 Aug 2016 11:04:23 GMT"}, {"version": "v4", "created": "Wed, 21 Sep 2016 13:46:11 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Japaridze", "Giorgi", "", "Department of Computing Sciences, Villanova\n  University"]]}, {"id": "1510.08786", "submitter": "Martin L\\\"uck", "authors": "Martin L\\\"uck", "title": "Quirky Quantifiers: Optimal Models and Complexity of Computation Tree\n  Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The satisfiability problem of the branching time logic CTL is studied in\nterms of computational complexity. Tight upper and lower bounds are provided\nfor each temporal operator fragment. In parallel, the minimal model size is\nstudied with a suitable notion of minimality. Thirdly, flat CTL is\ninvestigated, i.e., formulas with very low temporal operator nesting depth. A\nsharp dichotomy is shown in terms of complexity and minimal models: Temporal\ndepth one has low expressive power, while temporal depth two is equivalent to\nfull CTL.\n", "versions": [{"version": "v1", "created": "Thu, 29 Oct 2015 17:25:14 GMT"}, {"version": "v2", "created": "Tue, 18 Oct 2016 09:01:03 GMT"}, {"version": "v3", "created": "Fri, 24 Feb 2017 13:29:13 GMT"}], "update_date": "2017-02-27", "authors_parsed": [["Lück", "Martin", ""]]}, {"id": "1510.08970", "submitter": "Daniel Neider", "authors": "Paulo Tabuada and Daniel Neider", "title": "Robust Linear Temporal Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although it is widely accepted that every system should be robust, in the\nsense that \"small\" violations of environment assumptions should lead to \"small\"\nviolations of system guarantees, it is less clear how to make this intuitive\nnotion of robustness mathematically precise. In this paper, we address this\nproblem by developing a robust version of Linear Temporal Logic (LTL), which we\ncall robust LTL and denote by rLTL. Formulas in rLTL are syntactically\nidentical to LTL formulas but are endowed with a many-valued semantics that\nencodes robustness. In particular, the semantics of the rLTL formula $\\varphi\n\\Rightarrow \\psi$ is such that a \"small\" violation of the environment\nassumption $\\varphi$ is guaranteed to only produce a \"small\" violation of the\nsystem guarantee $\\psi$. In addition to introducing rLTL, we study the\nverification and synthesis problems for this logic: similarly to LTL, we show\nthat both problems are decidable, that the verification problem can be solved\nin time exponential in the number of subformulas of the rLTL formula at hand,\nand that the synthesis problem can be solved in doubly exponential time.\n", "versions": [{"version": "v1", "created": "Fri, 30 Oct 2015 05:24:54 GMT"}], "update_date": "2015-11-02", "authors_parsed": [["Tabuada", "Paulo", ""], ["Neider", "Daniel", ""]]}, {"id": "1510.09040", "submitter": "Arne Meier", "authors": "Arnaud Durand and Miika Hannula and Juha Kontinen and Arne Meier and\n  Jonni Virtema", "title": "Approximation and Dependence via Multiteam Semantics", "comments": "Accepted paper for FoIKS conference, long version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a variant of team semantics called multiteam semantics based on\nmultisets and study the properties of various logics in this framework. In\nparticular, we define natural probabilistic versions of inclusion and\nindependence atoms and certain approximation operators motivated by approximate\ndependence atoms of V\\\"a\\\"an\\\"anen.\n", "versions": [{"version": "v1", "created": "Fri, 30 Oct 2015 10:27:08 GMT"}, {"version": "v2", "created": "Mon, 21 Dec 2015 10:47:11 GMT"}], "update_date": "2015-12-22", "authors_parsed": [["Durand", "Arnaud", ""], ["Hannula", "Miika", ""], ["Kontinen", "Juha", ""], ["Meier", "Arne", ""], ["Virtema", "Jonni", ""]]}, {"id": "1510.09095", "submitter": "Fredrik Dahlqvist", "authors": "Fredrik Dahlqvist", "title": "Completeness-via-canonicity for coalgebraic logics", "comments": "PhD thesis. 288 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This thesis aims to provide a suite of techniques to generate completeness\nresults for coalgebraic logics with axioms of arbitrary rank. We have chosen to\ninvestigate the possibility to generalize what is arguably one of the most\nsuccessful methods to prove completeness results in `classical' modal logic,\nnamely completeness-via-canonicity. This technique is particularly well-suited\nto a coalgebraic generalization because of its clean and abstract algebraic\nformalism.\n", "versions": [{"version": "v1", "created": "Fri, 30 Oct 2015 14:08:53 GMT"}], "update_date": "2015-11-02", "authors_parsed": [["Dahlqvist", "Fredrik", ""]]}, {"id": "1510.09102", "submitter": "Nathana\\\"el Fijalkow", "authors": "Nathana\\\"el Fijalkow, Stefan Kiefer, Mahsa Shirmohammadi", "title": "Trace Refinement in Labelled Markov Decision Processes", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 16, Issue 2 (June 3,\n  2020) lmcs:6528", "doi": "10.23638/LMCS-16(2:10)2020", "report-no": null, "categories": "cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Given two labelled Markov decision processes (MDPs), the trace-refinement\nproblem asks whether for all strategies of the first MDP there exists a\nstrategy of the second MDP such that the induced labelled Markov chains are\ntrace-equivalent. We show that this problem is decidable in polynomial time if\nthe second MDP is a Markov chain. The algorithm is based on new results on a\nparticular notion of bisimulation between distributions over the states.\nHowever, we show that the general trace-refinement problem is undecidable, even\nif the first MDP is a Markov chain. Decidability of those problems was stated\nas open in 2008. We further study the decidability and complexity of the\ntrace-refinement problem provided that the strategies are restricted to be\nmemoryless.\n", "versions": [{"version": "v1", "created": "Fri, 30 Oct 2015 14:27:20 GMT"}, {"version": "v2", "created": "Fri, 8 Jan 2016 07:05:56 GMT"}, {"version": "v3", "created": "Wed, 28 Nov 2018 21:55:24 GMT"}, {"version": "v4", "created": "Sun, 22 Sep 2019 15:02:53 GMT"}, {"version": "v5", "created": "Tue, 2 Jun 2020 07:54:42 GMT"}], "update_date": "2020-08-25", "authors_parsed": [["Fijalkow", "Nathanaël", ""], ["Kiefer", "Stefan", ""], ["Shirmohammadi", "Mahsa", ""]]}]