[{"id": "1205.0790", "submitter": "Eric Phipps", "authors": "Roger P. Pawlowski, Eric T. Phipps, and Andrew G. Salinger", "title": "Automating embedded analysis capabilities and managing software\n  complexity in multiphysics simulation part I: template-based generic\n  programming", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An approach for incorporating embedded simulation and analysis capabilities\nin complex simulation codes through template-based generic programming is\npresented. This approach relies on templating and operator overloading within\nthe C++ language to transform a given calculation into one that can compute a\nvariety of additional quantities that are necessary for many state-of-the-art\nsimulation and analysis algorithms. An approach for incorporating these ideas\ninto complex simulation codes through general graph-based assembly is also\npresented. These ideas have been implemented within a set of packages in the\nTrilinos framework and are demonstrated on a simple problem from chemical\nengineering.\n", "versions": [{"version": "v1", "created": "Thu, 3 May 2012 18:24:54 GMT"}, {"version": "v2", "created": "Tue, 15 May 2012 20:19:22 GMT"}], "update_date": "2012-05-17", "authors_parsed": [["Pawlowski", "Roger P.", ""], ["Phipps", "Eric T.", ""], ["Salinger", "Andrew G.", ""]]}, {"id": "1205.1125", "submitter": "Khalid Raza", "authors": "Khalid Raza", "title": "Application Of Data Mining In Bioinformatics", "comments": null, "journal-ref": "Indian Journal of Computer Science and Engineering 1(2):114-118\n  2010", "doi": null, "report-no": null, "categories": "cs.CE cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article highlights some of the basic concepts of bioinformatics and data\nmining. The major research areas of bioinformatics are highlighted. The\napplication of data mining in the domain of bioinformatics is explained. It\nalso highlights some of the current challenges and opportunities of data mining\nin bioinformatics.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2012 12:19:33 GMT"}], "update_date": "2012-05-08", "authors_parsed": [["Raza", "Khalid", ""]]}, {"id": "1205.1428", "submitter": "Zishun Liu", "authors": "S. Swaddiwudhipong, M. J. Islam, Z. S. Liu", "title": "High Velocity Penetration/Perforation Using Coupled Smooth Particle\n  Hydrodynamics-Finite Element Method", "comments": "18 pages; International Journal of Protective Structures 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Finite element method (FEM) suffers from a serious mesh distortion problem\nwhen used for high velocity impact analyses. The smooth particle hydrodynamics\n(SPH) method is appropriate for this class of problems involving severe damages\nbut at considerable computational cost. It is beneficial if the latter is\nadopted only in severely distorted regions and FEM further away. The coupled\nsmooth particle hydrodynamics - finite element method (SFM) has been adopted in\na commercial hydrocode LS-DYNA to study the perforation of Weldox 460E steel\nand AA5083-H116 aluminum plates with varying thicknesses and various projectile\nnose geometries including blunt, conical and ogival noses. Effects of the SPH\ndomain size and particle density are studied considering the friction effect\nbetween the projectile and the target materials. The simulated residual\nvelocities and the ballistic limit velocities from the SFM agree well with the\npublished experimental data. The study shows that SFM is able to emulate the\nsame failure mechanisms of the steel and aluminum plates as observed in various\nexperimental investigations for initial impact velocity of 170 m/s and higher.\n", "versions": [{"version": "v1", "created": "Mon, 7 May 2012 15:24:56 GMT"}], "update_date": "2012-05-08", "authors_parsed": [["Swaddiwudhipong", "S.", ""], ["Islam", "M. J.", ""], ["Liu", "Z. S.", ""]]}, {"id": "1205.1986", "submitter": "Khalid Raza", "authors": "Khalid Raza and Rafat Parveen", "title": "Evolutionary algorithms in genetic regulatory networks model", "comments": "10 pages, 3 figures and 1 table", "journal-ref": "Journal of Advanced Bioinformatics Applications and Research\n  3(1):271-280, 2012", "doi": null, "report-no": null, "categories": "cs.CE q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genetic Regulatory Networks (GRNs) plays a vital role in the understanding of\ncomplex biological processes. Modeling GRNs is significantly important in order\nto reveal fundamental cellular processes, examine gene functions and\nunderstanding their complex relationships. Understanding the interactions\nbetween genes gives rise to develop better method for drug discovery and\ndiagnosis of the disease since many diseases are characterized by abnormal\nbehaviour of the genes. In this paper we have reviewed various evolutionary\nalgorithms-based approach for modeling GRNs and discussed various opportunities\nand challenges.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2012 14:04:35 GMT"}], "update_date": "2012-05-10", "authors_parsed": [["Raza", "Khalid", ""], ["Parveen", "Rafat", ""]]}, {"id": "1205.2622", "submitter": "Sara Mostafavi", "authors": "Sara Mostafavi, Quaid Morris", "title": "Using the Gene Ontology Hierarchy when Predicting Gene Function", "comments": "Appears in Proceedings of the Twenty-Fifth Conference on Uncertainty\n  in Artificial Intelligence (UAI2009)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2009-PG-419-427", "categories": "cs.LG cs.CE stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of multilabel classification when the labels are related through\na hierarchical categorization scheme occurs in many application domains such as\ncomputational biology. For example, this problem arises naturally when trying\nto automatically assign gene function using a controlled vocabularies like Gene\nOntology. However, most existing approaches for predicting gene functions solve\nindependent classification problems to predict genes that are involved in a\ngiven function category, independently of the rest. Here, we propose two simple\nmethods for incorporating information about the hierarchical nature of the\ncategorization scheme. In the first method, we use information about a gene's\nprevious annotation to set an initial prior on its label. In a second approach,\nwe extend a graph-based semi-supervised learning algorithm for predicting gene\nfunction in a hierarchy. We show that we can efficiently solve this problem by\nsolving a linear system of equations. We compare these approaches with a\nprevious label reconciliation-based approach. Results show that using the\nhierarchy information directly, compared to using reconciliation methods,\nimproves gene function prediction.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2012 17:26:42 GMT"}], "update_date": "2012-05-14", "authors_parsed": [["Mostafavi", "Sara", ""], ["Morris", "Quaid", ""]]}, {"id": "1205.3504", "submitter": "Sam Ma", "authors": "Zhanshan Sam Ma", "title": "A Note on Extending Taylor's Power Law for Characterizing Human\n  Microbial Communities: Inspiration from Comparative Studies on the\n  Distribution Patterns of Insects and Galaxies, and as a Case Study for\n  Medical Ecology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many natural patterns, such as the distributions of blood particles in a\nblood sample, proteins on cell surfaces, biological populations in their\nhabitat, galaxies in the universe, the sequence of human genes, and the fitness\nin evolutionary computing, have been found to follow power law. Taylor's power\nlaw (Taylor 1961: Nature, 189:732-) is well recognized as one of the\nfundamental models in population ecology. A fundamental property of biological\npopulations, which Taylor's power law reveals, is the near universal\nheterogeneity of population abundance distribution in habitat. Obviously, the\nheterogeneity also exists at the community level, where not only the\ndistributions of population abundances but also the proportions of the species\ncomposition in the community are often heterogeneous. Nevertheless, existing\ncommunity diversity indexes such as Shannon index and Simpson index can only\nmeasure \"local\" or \"static\" diversity in the sense that they are computed for\neach habitat at a specific time point, and the indexes alone do not reflect the\ndiversity changes. In this note, I propose to extend the application scope of\nTaylor's power law to the studies of human microbial communities, specifically,\nthe community heterogeneity at both population and community levels. I further\nsuggested that population dispersion models such as Taylor (1980: Nature, 286,\n53-), which is known to generate population distribution patterns consistent\nwith the power law, should also be very useful for analyzing the distribution\npatterns of human microbes within the human body. Overall, I hope that the\napproach to human microbial community with the power law offers an example that\necological theories can play an important role in the emerging medical ecology,\nwhich aims at studying the ecology of human microbiome and its implications to\nhuman diseases and health, as well as in personalized medicine.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2012 20:26:44 GMT"}], "update_date": "2012-05-17", "authors_parsed": [["Ma", "Zhanshan Sam", ""]]}, {"id": "1205.3506", "submitter": "Eric Phipps", "authors": "Eric Phipps and Roger Pawlowski", "title": "Efficient Expression Templates for Operator Overloading-based Automatic\n  Differentiation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Expression templates are a well-known set of techniques for improving the\nefficiency of operator overloading-based forward mode automatic differentiation\nschemes in the C++ programming language by translating the differentiation from\nindividual operators to whole expressions. However standard expression template\napproaches result in a large amount of duplicate computation, particularly for\nlarge expression trees, degrading their performance. In this paper we describe\nseveral techniques for improving the efficiency of expression templates and\ntheir implementation in the automatic differentiation package Sacado. We\ndemonstrate their improved efficiency through test functions as well as their\napplication to differentiation of a large-scale fluid dynamics simulation code.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2012 20:42:23 GMT"}], "update_date": "2012-05-21", "authors_parsed": [["Phipps", "Eric", ""], ["Pawlowski", "Roger", ""]]}, {"id": "1205.3569", "submitter": "Jos Schijndel van", "authors": "A. W. M. van Schijndel", "title": "The Simulation and Mapping of Building Performance Indicators based on\n  European Weather Stations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.comp-ph cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the climate change debate, a lot of research and maps of external\nclimate parameters are available. However, maps of indoor climate performance\nparameters are still lacking. This paper presents a methodology for obtaining\nmaps of performances of similar buildings that are virtually spread over whole\nEurope. The produced maps are useful for analyzing regional climate influence\non building performance indicators such as energy use and indoor climate. This\nis shown using the Bestest building as a reference benchmark. An important\napplication of the mapping tool is the visualization of potential building\nmeasures over the EU. Also the performances of single building components can\nbe simulated and mapped. It is concluded that the presented method is efficient\nas it takes less than 15 minutes to simulate and produce the maps on a\n2.6GHz/4GB computer. Moreover, the approach is applicable for any type of\nbuilding.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2012 06:45:44 GMT"}], "update_date": "2012-05-17", "authors_parsed": [["van Schijndel", "A. W. M.", ""]]}, {"id": "1205.3952", "submitter": "Eric Phipps", "authors": "Roger P. Pawlowski, Eric T. Phipps, Andrew G. Salinger, Steven J.\n  Owen, Christopher M. Siefert, and Matthew L. Staten", "title": "Automating embedded analysis capabilities and managing software\n  complexity in multiphysics simulation part II: application to partial\n  differential equations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A template-based generic programming approach was presented in a previous\npaper that separates the development effort of programming a physical model\nfrom that of computing additional quantities, such as derivatives, needed for\nembedded analysis algorithms. In this paper, we describe the implementation\ndetails for using the template-based generic programming approach for\nsimulation and analysis of partial differential equations (PDEs). We detail\nseveral of the hurdles that we have encountered, and some of the software\ninfrastructure developed to overcome them. We end with a demonstration where we\npresent shape optimization and uncertainty quantification results for a 3D PDE\napplication.\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2012 15:18:00 GMT"}], "update_date": "2012-05-18", "authors_parsed": [["Pawlowski", "Roger P.", ""], ["Phipps", "Eric T.", ""], ["Salinger", "Andrew G.", ""], ["Owen", "Steven J.", ""], ["Siefert", "Christopher M.", ""], ["Staten", "Matthew L.", ""]]}, {"id": "1205.5024", "submitter": "A.K. Mishra Dr.", "authors": "A.K. Mishra and H. Chandrasekharan", "title": "Analytical Study of Hexapod miRNAs using Phylogenetic Methods", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MicroRNAs (miRNAs) are a class of non-coding RNAs that regulate gene\nexpression. Identification of total number of miRNAs even in completely\nsequenced organisms is still an open problem. However, researchers have been\nusing techniques that can predict limited number of miRNA in an organism. In\nthis paper, we have used homology based approach for comparative analysis of\nmiRNA of hexapoda group .We have used Apis mellifera, Bombyx mori, Anopholes\ngambiae and Drosophila melanogaster miRNA datasets from miRBase repository. We\nhave done pair wise as well as multiple alignments for the available miRNAs in\nthe repository to identify and analyse conserved regions among related species.\nUnfortunately, to the best of our knowledge, miRNA related literature does not\nprovide in depth analysis of hexapods. We have made an attempt to derive the\ncommonality among the miRNAs and to identify the conserved regions which are\nstill not available in miRNA repositories. The results are good approximation\nwith a small number of mismatches. However, they are encouraging and may\nfacilitate miRNA biogenesis for\n", "versions": [{"version": "v1", "created": "Tue, 22 May 2012 10:28:29 GMT"}], "update_date": "2012-05-24", "authors_parsed": [["Mishra", "A. K.", ""], ["Chandrasekharan", "H.", ""]]}, {"id": "1205.5025", "submitter": "Casper Steinmann", "authors": "Casper Steinmann, Mikael W. Ibsen, Anne S. Hansen and Jan H. Jensen", "title": "FragIt: A Tool to Prepare Input Files for Fragment Based Quantum\n  Chemical Calculations", "comments": "27 pages, 9 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0044480", "report-no": null, "categories": "cs.CE physics.chem-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Near linear scaling fragment based quantum chemical calculations are becoming\nincreasingly popular for treating large systems with high accuracy and is an\nactive field of research. However, it remains difficult to set up these\ncalculations without expert knowledge. To facilitate the use of such methods,\nsoftware tools need to be available to support these methods and help to set up\nreasonable input files which will lower the barrier of entry for usage by\nnon-experts. Previous tools relies on specific annotations in structure files\nfor automatic and successful fragmentation such as residues in PDB files. We\npresent a general fragmentation methodology and accompanying tools called\nFragIt to help setup these calculations. FragIt uses the SMARTS language to\nlocate chemically appropriate fragments in large structures and is applicable\nto fragmentation of any molecular system given suitable SMARTS patterns. We\npresent SMARTS patterns of fragmentation for proteins, DNA and polysaccharides,\nspecifically for D-galactopyranose for use in cyclodextrins. FragIt is used to\nprepare input files for the Fragment Molecular Orbital method in the GAMESS\nprogram package, but can be extended to other computational methods easily.\n", "versions": [{"version": "v1", "created": "Tue, 22 May 2012 14:39:44 GMT"}, {"version": "v2", "created": "Thu, 2 Aug 2012 12:38:53 GMT"}], "update_date": "2012-09-20", "authors_parsed": [["Steinmann", "Casper", ""], ["Ibsen", "Mikael W.", ""], ["Hansen", "Anne S.", ""], ["Jensen", "Jan H.", ""]]}, {"id": "1205.6010", "submitter": "Filippo Utro", "authors": "Davide Corona, Valeria Di Benedetto, Raffaele Giancarlo and Filippo\n  Utro", "title": "The Chromatin Organization of an Eukaryotic Genome : Sequence Specific+\n  Statistical=Combinatorial (Extended Abstract)", "comments": "Work presented at the 8th SIBBM Seminar (Annual Conference Meeting of\n  the Italian Biophysics and Molecular Biology Society)- May 24-26 2012,\n  Palermo, Italy", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nucleosome organization in eukaryotic genomes has a deep impact on gene\nfunction. Although progress has been recently made in the identification of\nvarious concurring factors influencing nucleosome positioning, it is still\nunclear whether nucleosome positions are sequence dictated or determined by a\nrandom process. It has been postulated for a long time that,in the proximity of\nTSS, a barrier determines the position of the +1 nucleosome and then geometric\nconstraints alter the random positioning process determining nucleosomal\nphasing. Such a pattern fades out as one moves away from the barrier to become\nagain a random positioning process. Although this statistical model is widely\naccepted,the molecular nature of the barrier is still unknown. Moreover,we are\nfar from the identification of a set of sequence rules able:to account for the\ngenome-wide nucleosome organization;to explain the nature of the barriers on\nwhich the statistical mechanism hinges;to allow for a smooth transition from\nsequence-dictated to statistical positioning and back. We show that sequence\ncomplexity,quantified via various methods, can be the rule able to at least\npartially account for all the above.In particular, we have conducted our\nanalyses on 4 high resolution nucleosomal maps of the model eukaryotes and\nfound that nucleosome depleted regions can be well distinguished from\nnucleosome enriched regions by sequence complexity measures.In particular, (a)\nthe depleted regions are less complex than the enriched ones, (b) around TSS\ncomplexity measures alone are in striking agreement with in vivo nucleosome\noccupancy,in particular precisely indicating the positions of the +1 and -1\nnucleosomes. Those findings indicate that the intrinsic richness of\nsubsequences within sequences plays a role in nucleosomal formation in genomes,\nand that sequence complexity constitutes the molecular nature of nucleosome\nbarrier.\n", "versions": [{"version": "v1", "created": "Sun, 27 May 2012 23:49:33 GMT"}], "update_date": "2012-05-29", "authors_parsed": [["Corona", "Davide", ""], ["Di Benedetto", "Valeria", ""], ["Giancarlo", "Raffaele", ""], ["Utro", "Filippo", ""]]}, {"id": "1205.6033", "submitter": "Olivier Delestre", "authors": "Olivier Delestre (JAD), Pierre-Yves Lagr\\'ee (IJLRA)", "title": "A \"well-balanced\" finite volume scheme for blood flow simulation", "comments": "36 pages", "journal-ref": "International Journal for Numerical Methods in Fluids 72, 2 (2013)\n  177-205", "doi": "10.1002/fld.3736", "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are interested in simulating blood flow in arteries with a one dimensional\nmodel. Thanks to recent developments in the analysis of hyperbolic system of\nconservation laws (in the Saint-Venant/ shallow water equations context) we\nwill perform a simple finite volume scheme. We focus on conservation properties\nof this scheme which were not previously considered. To emphasize the necessity\nof this scheme, we present how a too simple numerical scheme may induce\nspurious flows when the basic static shape of the radius changes. On contrary,\nthe proposed scheme is \"well-balanced\": it preserves equilibria of Q = 0. Then\nexamples of analytical or linearized solutions with and without viscous damping\nare presented to validate the calculations. The influence of abrupt change of\nbasic radius is emphasized in the case of an aneurism.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2012 06:19:14 GMT"}], "update_date": "2013-04-24", "authors_parsed": [["Delestre", "Olivier", "", "JAD"], ["Lagrée", "Pierre-Yves", "", "IJLRA"]]}, {"id": "1205.6412", "submitter": "Avishek Ghosh", "authors": "Arnab Ghosh, Avishek Ghosh, Arkabandhu Chowdhury, Amit Konar", "title": "An Evolutionary Approach to Drug-Design Using a Novel Neighbourhood\n  Based Genetic Algorithm", "comments": "10 pages,13 figures (Communicated to journal)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present work provides a new approach to evolve ligand structures which\nrepresent possible drug to be docked to the active site of the target protein.\nThe structure is represented as a tree where each non-empty node represents a\nfunctional group. It is assumed that the active site configuration of the\ntarget protein is known with position of the essential residues. In this paper\nthe interaction energy of the ligands with the protein target is minimized.\nMoreover, the size of the tree is difficult to obtain and it will be different\nfor different active sites. To overcome the difficulty, a variable tree size\nconfiguration is used for designing ligands. The optimization is done using a\nnovel Neighbourhood Based Genetic Algorithm (NBGA) which uses dynamic\nneighbourhood topology. To get variable tree size, a variable-length version of\nthe above algorithm is devised. To judge the merit of the algorithm, it is\ninitially applied on the well known Travelling Salesman Problem (TSP).\n", "versions": [{"version": "v1", "created": "Thu, 3 May 2012 05:08:23 GMT"}], "update_date": "2012-05-30", "authors_parsed": [["Ghosh", "Arnab", ""], ["Ghosh", "Avishek", ""], ["Chowdhury", "Arkabandhu", ""], ["Konar", "Amit", ""]]}]