[{"id": "1811.00173", "submitter": "Ari Stern", "authors": "Zhengdao Chen, Baranidharan Raman, Ari Stern", "title": "Structure-preserving numerical integrators for Hodgkin-Huxley-type\n  systems", "comments": "27 pages, 10 figures; v2: added discussion and analysis of\n  exponential midpoint method, additional numerical experiments, remarks on\n  reduced Hodgkin-Huxley models, and various minor revisions", "journal-ref": "SIAM J. Sci. Comput., 42 (2020), B273-B298", "doi": "10.1137/18M123390X", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the Hodgkin-Huxley model of neuronal dynamics, we study explicit\nnumerical integrators for \"conditionally linear\" systems of ordinary\ndifferential equations. We show that splitting and composition methods, when\napplied to the Van der Pol oscillator and to the Hodgkin-Huxley model, do a\nbetter job of preserving limit cycles of these systems for large time steps,\ncompared with the \"Euler-type\" methods (including Euler's method, exponential\nEuler, and semi-implicit Euler) commonly used in computational neuroscience,\nwith no increase in computational cost. These limit cycles are important to\npreserve, due to their role in neuronal spiking. Splitting methods even compare\nfavorably to the explicit exponential midpoint method, which is twice as\nexpensive per step. The second-order Strang splitting method is seen to perform\nespecially well across a range of non-stiff and stiff dynamics.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 01:01:37 GMT"}, {"version": "v2", "created": "Tue, 17 Mar 2020 19:01:48 GMT"}], "update_date": "2020-03-19", "authors_parsed": [["Chen", "Zhengdao", ""], ["Raman", "Baranidharan", ""], ["Stern", "Ari", ""]]}, {"id": "1811.00328", "submitter": "Yu-Hong Yeung", "authors": "Yu-Hong Yeung, Alex Pothen, Jessica Crouch", "title": "AMPS: A Real-time Mesh Cutting Algorithm for Surgical Simulations", "comments": "20 pages, 9 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.GR cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the AMPS algorithm, a finite element solution method that combines\nprincipal submatrix updates and Schur complement techniques, well-suited for\ninteractive simulations of deformation and cutting of finite element meshes.\nOur approach features real-time solutions to the updated stiffness matrix\nsystems to account for interactive changes in mesh connectivity and boundary\nconditions. Updates are accomplished by an augmented matrix formulation of the\nstiffness equations to maintain its consistency with changes to the underlying\nmodel without refactorization at each timestep. As changes accumulate over\nmultiple simulation timesteps, the augmented solution algorithm enables tens or\nhundreds of updates per second. Acceleration schemes that exploit sparsity,\nmemoization and parallelization lead to the updates being computed in\nreal-time. The complexity analysis and experimental results for this method\ndemonstrate that it scales linearly with the problem size. Results for cutting\nand deformation of 3D elastic models are reported for meshes with node counts\nup to 50,000, and involve models of astigmatism surgery and the brain.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 11:53:20 GMT"}], "update_date": "2018-11-02", "authors_parsed": [["Yeung", "Yu-Hong", ""], ["Pothen", "Alex", ""], ["Crouch", "Jessica", ""]]}, {"id": "1811.00431", "submitter": "Mihai Nechita", "authors": "Erik Burman, Mihai Nechita, Lauri Oksanen", "title": "A stabilized finite element method for inverse problems subject to the\n  convection-diffusion equation. I: diffusion-dominated regime", "comments": "21 pages, 6 figures; in v2 we added two remarks and an appendix on\n  psiDOs, and made some minor corrections", "journal-ref": null, "doi": "10.1007/s00211-019-01087-x", "report-no": null, "categories": "math.NA cs.NA math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The numerical approximation of an inverse problem subject to the\nconvection--diffusion equation when diffusion dominates is studied. We derive\nCarleman estimates that are on a form suitable for use in numerical analysis\nand with explicit dependence on the P\\'eclet number. A stabilized finite\nelement method is then proposed and analysed. An upper bound on the condition\nnumber is first derived. Combining the stability estimates on the continuous\nproblem with the numerical stability of the method, we then obtain error\nestimates in local $H^1$- or $L^2$-norms that are optimal with respect to the\napproximation order, the problem's stability and perturbations in data. The\nconvergence order is the same for both norms, but the $H^1$-estimate requires\nan additional divergence assumption for the convective field. The theory is\nillustrated in some computational examples.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 15:26:46 GMT"}, {"version": "v2", "created": "Sat, 5 Oct 2019 20:09:49 GMT"}], "update_date": "2020-06-25", "authors_parsed": [["Burman", "Erik", ""], ["Nechita", "Mihai", ""], ["Oksanen", "Lauri", ""]]}, {"id": "1811.00484", "submitter": "Ilias Giannakopoulos", "authors": "Ilias I. Giannakopoulos (1), Mikhail S. Litsarev (1), Athanasios G.\n  Polimeridis (2) ((1) Skoltech Center for Computational Data-Intensive Science\n  and Engineering, Skolkovo Institute of Science and Technology, Moscow,\n  Russia, (2) Q Bio, CA, USA)", "title": "Memory footprint reduction for the FFT-based volume integral equation\n  method via tensor decompositions", "comments": "11 pages, 10 figures, 5 tables, 2 algorithms, journal", "journal-ref": null, "doi": "10.1109/TAP.2019.2930126", "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a method of memory footprint reduction for FFT-based,\nelectromagnetic (EM) volume integral equation (VIE) formulations. The arising\nGreen's function tensors have low multilinear rank, which allows Tucker\ndecomposition to be employed for their compression, thereby greatly reducing\nthe required memory storage for numerical simulations. Consequently, the\ncompressed components are able to fit inside a graphical processing unit (GPU)\non which highly parallelized computations can vastly accelerate the iterative\nsolution of the arising linear system. In addition, the element-wise products\nthroughout the iterative solver's process require additional flops, thus, we\nprovide a variety of novel and efficient methods that maintain the linear\ncomplexity of the classic element-wise product with an additional\nmultiplicative small constant. We demonstrate the utility of our approach via\nits application to VIE simulations for the Magnetic Resonance Imaging (MRI) of\na human head. For these simulations we report an order of magnitude\nacceleration over standard techniques.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 16:28:48 GMT"}, {"version": "v2", "created": "Fri, 19 Apr 2019 17:05:22 GMT"}, {"version": "v3", "created": "Tue, 16 Jul 2019 15:07:02 GMT"}], "update_date": "2020-01-08", "authors_parsed": [["Giannakopoulos", "Ilias I.", ""], ["Litsarev", "Mikhail S.", ""], ["Polimeridis", "Athanasios G.", ""]]}, {"id": "1811.00641", "submitter": "Anish Acharya", "authors": "Anish Acharya, Rahul Goel, Angeliki Metallinou, Inderjit Dhillon", "title": "Online Embedding Compression for Text Classification using Low Rank\n  Matrix Factorization", "comments": "Accepted in Thirty-Third AAAI Conference on Artificial Intelligence\n  (AAAI 2019)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CL cs.NA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep learning models have become state of the art for natural language\nprocessing (NLP) tasks, however deploying these models in production system\nposes significant memory constraints. Existing compression methods are either\nlossy or introduce significant latency. We propose a compression method that\nleverages low rank matrix factorization during training,to compress the word\nembedding layer which represents the size bottleneck for most NLP models. Our\nmodels are trained, compressed and then further re-trained on the downstream\ntask to recover accuracy while maintaining the reduced size. Empirically, we\nshow that the proposed method can achieve 90% compression with minimal impact\nin accuracy for sentence classification tasks, and outperforms alternative\nmethods like fixed-point quantization or offline word embedding compression. We\nalso analyze the inference time and storage space for our method through FLOP\ncalculations, showing that we can compress DNN models by a configurable ratio\nand regain accuracy loss without introducing additional latency compared to\nfixed point quantization. Finally, we introduce a novel learning rate schedule,\nthe Cyclically Annealed Learning Rate (CALR), which we empirically demonstrate\nto outperform other popular adaptive learning rate algorithms on a sentence\nclassification benchmark.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 21:38:18 GMT"}], "update_date": "2018-11-05", "authors_parsed": [["Acharya", "Anish", ""], ["Goel", "Rahul", ""], ["Metallinou", "Angeliki", ""], ["Dhillon", "Inderjit", ""]]}, {"id": "1811.00737", "submitter": "Issei Oikawa", "authors": "Issei Oikawa", "title": "Unified analysis of HDG methods using scalar and vector hybrid variables", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, hybridizable discontinuous Galerkin (HDG) methods using scalar\nand vector hybrid variables for steady-state diffusion problems are considered.\nWe propose a unified framework to analyze the methods, where both the hybrid\nvariables are treated as double-valued functions. If either of them is single\nvalued, the well-posedness is ensured under some assumptions on approximation\nspaces. Moreover, we prove that all methods are superconvergent, based on the\nso-called $M$-decomposition theory. Numerical results are presented to validate\nour theoretical results.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2018 04:48:55 GMT"}, {"version": "v2", "created": "Tue, 24 Sep 2019 09:20:19 GMT"}, {"version": "v3", "created": "Mon, 27 Jul 2020 06:02:50 GMT"}], "update_date": "2020-07-28", "authors_parsed": [["Oikawa", "Issei", ""]]}, {"id": "1811.00850", "submitter": "Zvonimir Bujanovi\\'c", "authors": "Peter Benner, Zvonimir Bujanovi\\'c, Patrick K\\\"urschner, Jens Saak", "title": "A numerical comparison of solvers for large-scale, continuous-time\n  algebraic Riccati equations and LQR problems", "comments": null, "journal-ref": "SIAM J. Sci. Comput. 42(2020) A957-A996", "doi": "10.1137/18M1220960", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we discuss numerical methods for solving large-scale\ncontinuous-time algebraic Riccati equations. These methods have been the focus\nof intensive research in recent years, and significant progress has been made\nin both the theoretical understanding and efficient implementation of various\ncompeting algorithms. There are several goals of this manuscript: first, to\ngather in one place an overview of different approaches for solving large-scale\nRiccati equations, and to point to the recent advances in each of them. Second,\nto analyze and compare the main computational ingredients of these algorithms,\nto detect their strong points and their potential bottlenecks. And finally, to\ncompare the effective implementations of all methods on a set of relevant\nbenchmark examples, giving an indication of their relative performance.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2018 13:31:35 GMT"}, {"version": "v2", "created": "Fri, 10 Apr 2020 15:11:59 GMT"}], "update_date": "2020-04-13", "authors_parsed": [["Benner", "Peter", ""], ["Bujanović", "Zvonimir", ""], ["Kürschner", "Patrick", ""], ["Saak", "Jens", ""]]}, {"id": "1811.01110", "submitter": "Matt Wala", "authors": "Matt Wala, Andreas Kl\\\"ockner", "title": "Optimization of Fast Algorithms for Global Quadrature by Expansion Using\n  Target-Specific Expansions", "comments": null, "journal-ref": null, "doi": "10.1016/j.jcp.2019.108976", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an algorithm for the asymptotically fast evaluation of layer\npotentials close to and on the source geometry, combining Geometric Global\nAccelerated QBX (`GIGAQBX') and target-specific expansions. GIGAQBX is a fast\nhigh-order scheme for evaluation of layer potentials based on Quadrature by\nExpansion (`QBX') using local expansions formed via the Fast Multipole Method\n(FMM). Target-specific expansions serve to lower the cost of the formation and\nevaluation of QBX local expansions, reducing the associated computational\neffort from $O((p+1)^{2})$ to $O(p+1)$ in three dimensions, without any\naccuracy loss compared with conventional expansions, but with the loss of\nsource/target separation in the expansion coefficients. GIGAQBX is a `global'\nQBX scheme, meaning that the potential is mediated entirely through expansions\nfor points close to or on the boundary. In our scheme, this single global\nexpansion is decomposed into two parts that are evaluated separately: one part\nincorporating near-field contributions using target-specific expansions, and\none part using conventional spherical harmonic expansions of far-field\ncontributions, noting that convergence guarantees only exist for the sum of the\ntwo sub-expansions. By contrast, target-specific expansions were originally\nintroduced as an acceleration mechanism for `local' QBX schemes, in which the\nfar-field does not contribute to the QBX expansion. Compared with the\nunmodified GIGAQBX algorithm, we show through a reproducible, time-calibrated\ncost model that the combined scheme yields a considerable cost reduction for\nthe near-field evaluation part of the computation. We support the effectiveness\nof our scheme through numerical results demonstrating performance improvements\nfor Laplace and Helmholtz kernels.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2018 22:17:14 GMT"}, {"version": "v2", "created": "Mon, 5 Aug 2019 15:17:10 GMT"}, {"version": "v3", "created": "Fri, 15 Nov 2019 05:00:25 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Wala", "Matt", ""], ["Klöckner", "Andreas", ""]]}, {"id": "1811.01165", "submitter": "Jiequn Han", "authors": "Jiequn Han, Jihao Long", "title": "Convergence of the Deep BSDE Method for Coupled FBSDEs", "comments": null, "journal-ref": "Probability,Uncertaintyand Quantitative Risk, 5(1), 1-33 (2020)", "doi": "10.1186/s41546-020-00047-w", "report-no": null, "categories": "math.PR cs.LG cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recently proposed numerical algorithm, deep BSDE method, has shown\nremarkable performance in solving high-dimensional forward-backward stochastic\ndifferential equations (FBSDEs) and parabolic partial differential equations\n(PDEs). This article lays a theoretical foundation for the deep BSDE method in\nthe general case of coupled FBSDEs. In particular, a posteriori error\nestimation of the solution is provided and it is proved that the error\nconverges to zero given the universal approximation capability of neural\nnetworks. Numerical results are presented to demonstrate the accuracy of the\nanalyzed algorithm in solving high-dimensional coupled FBSDEs.\n", "versions": [{"version": "v1", "created": "Sat, 3 Nov 2018 06:08:23 GMT"}, {"version": "v2", "created": "Wed, 28 Nov 2018 04:55:30 GMT"}, {"version": "v3", "created": "Sat, 5 Oct 2019 04:34:43 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Han", "Jiequn", ""], ["Long", "Jihao", ""]]}, {"id": "1811.01285", "submitter": "Benjamin Seibold", "authors": "David Ketcheson, Benjamin Seibold, David Shirokoff, Dong Zhou", "title": "DIRK Schemes with High Weak Stage Order", "comments": "10 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Runge-Kutta time-stepping methods in general suffer from order reduction: the\nobserved order of convergence may be less than the formal order when applied to\ncertain stiff problems. Order reduction can be avoided by using methods with\nhigh stage order. However, diagonally-implicit Runge-Kutta (DIRK) schemes are\nlimited to low stage order. In this paper we explore a weak stage order\ncriterion, which for initial boundary value problems also serves to avoid order\nreduction, and which is compatible with a DIRK structure. We provide specific\nDIRK schemes of weak stage order up to 3, and demonstrate their performance in\nvarious examples.\n", "versions": [{"version": "v1", "created": "Sat, 3 Nov 2018 21:09:38 GMT"}, {"version": "v2", "created": "Wed, 9 Sep 2020 17:55:35 GMT"}], "update_date": "2020-09-10", "authors_parsed": [["Ketcheson", "David", ""], ["Seibold", "Benjamin", ""], ["Shirokoff", "David", ""], ["Zhou", "Dong", ""]]}, {"id": "1811.01595", "submitter": "Heiko Gimperlein", "authors": "Heiko Gimperlein, Ceyhun Oezdemir, David Stark, Ernst P. Stephan", "title": "hp-version time domain boundary elements for the wave equation on\n  quasi-uniform meshes", "comments": "41 pages, 11 figures", "journal-ref": "Computer Methods in Applied Mechanics and Engineering 356 (2019),\n  145-174", "doi": "10.1016/j.cma.2019.07.018", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Solutions to the wave equation in the exterior of a polyhedral domain or a\nscreen in $\\mathbb{R}^3$ exhibit singular behavior from the edges and corners.\nWe present quasi-optimal $hp$-explicit estimates for the approximation of the\nDirichlet and Neumann traces of these solutions for uniform time steps and\n(globally) quasi-uniform meshes on the boundary. The results are applied to an\n$hp$-version of the time domain boundary element method. Numerical examples\nconfirm the theoretical results for the Dirichlet problem both for screens and\npolyhedral domains.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2018 10:39:11 GMT"}, {"version": "v2", "created": "Fri, 30 Nov 2018 14:22:08 GMT"}, {"version": "v3", "created": "Mon, 8 Jul 2019 15:08:17 GMT"}], "update_date": "2020-03-06", "authors_parsed": [["Gimperlein", "Heiko", ""], ["Oezdemir", "Ceyhun", ""], ["Stark", "David", ""], ["Stephan", "Ernst P.", ""]]}, {"id": "1811.01719", "submitter": "Dmitry Kulyabov", "authors": "Migran N. Gevorkyan and Anastasia V. Demidova and Anna V. Korolkova\n  and Dmitry S. Kulyabov", "title": "Issues in the software implementation of stochastic numerical\n  Runge-Kutta", "comments": "in English, in Russian", "journal-ref": null, "doi": "10.1007/978-3-319-99447-5_46", "report-no": null, "categories": "cs.NA cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses stochastic numerical methods of Runge-Kutta type with\nweak and strong convergences for systems of stochastic differential equations\nin It\\^o form. At the beginning we give a brief overview of the stochastic\nnumerical methods and information from the theory of stochastic differential\nequations. Then we motivate the approach to the implementation of these methods\nusing source code generation. We discuss the implementation details and the\nused programming languages and libraries\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 08:20:49 GMT"}], "update_date": "2018-11-06", "authors_parsed": [["Gevorkyan", "Migran N.", ""], ["Demidova", "Anastasia V.", ""], ["Korolkova", "Anna V.", ""], ["Kulyabov", "Dmitry S.", ""]]}, {"id": "1811.01721", "submitter": "Jeff Johnson", "authors": "Jeff Johnson", "title": "Rethinking floating point for deep learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reducing hardware overhead of neural networks for faster or lower power\ninference and training is an active area of research. Uniform quantization\nusing integer multiply-add has been thoroughly investigated, which requires\nlearning many quantization parameters, fine-tuning training or other\nprerequisites. Little effort is made to improve floating point relative to this\nbaseline; it remains energy inefficient, and word size reduction yields drastic\nloss in needed dynamic range. We improve floating point to be more energy\nefficient than equivalent bit width integer hardware on a 28 nm ASIC process\nwhile retaining accuracy in 8 bits with a novel hybrid log multiply/linear add,\nKulisch accumulation and tapered encodings from Gustafson's posit format. With\nno network retraining, and drop-in replacement of all math and float32\nparameters via round-to-nearest-even only, this open-sourced 8-bit log float is\nwithin 0.9% top-1 and 0.2% top-5 accuracy of the original float32 ResNet-50 CNN\nmodel on ImageNet. Unlike int8 quantization, it is still a general purpose\nfloating point arithmetic, interpretable out-of-the-box. Our 8/38-bit log float\nmultiply-add is synthesized and power profiled at 28 nm at 0.96x the power and\n1.12x the area of 8/32-bit integer multiply-add. In 16 bits, our log float\nmultiply-add is 0.59x the power and 0.68x the area of IEEE 754 float16 fused\nmultiply-add, maintaining the same signficand precision and dynamic range,\nproving useful for training ASICs as well.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 22:13:57 GMT"}], "update_date": "2018-11-06", "authors_parsed": [["Johnson", "Jeff", ""]]}, {"id": "1811.01725", "submitter": "Sebastian Becker", "authors": "Sebastian Becker, Benjamin Gess, Arnulf Jentzen, and Peter E. Kloeden", "title": "Lower and upper bounds for strong approximation errors for numerical\n  approximations of stochastic heat equations", "comments": "20 pages. arXiv admin note: substantial text overlap with\n  arXiv:1711.02423", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal upper and lower error estimates for strong full-discrete numerical\napproximations of the stochastic heat equation driven by space-time white noise\nare obtained. In particular, we establish the optimality of strong convergence\nrates for full-discrete approximations of stochastic Allen-Cahn equations with\nspace-time white noise which have recently been obtained in [Becker, S., Gess,\nB., Jentzen, A., and Kloeden, P. E., Strong convergence rates for explicit\nspace-time discrete numerical approximations of stochastic Allen-Cahn\nequations. arXiv:1711.02423 (2017)].\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 18:38:49 GMT"}, {"version": "v2", "created": "Tue, 16 Jun 2020 16:12:16 GMT"}], "update_date": "2020-06-17", "authors_parsed": [["Becker", "Sebastian", ""], ["Gess", "Benjamin", ""], ["Jentzen", "Arnulf", ""], ["Kloeden", "Peter E.", ""]]}, {"id": "1811.01759", "submitter": "Xiaojie Wang", "authors": "Ziheng Chen, Siqing Gan, Xiaojie Wang", "title": "A full-discrete exponential Euler approximation of invariant measure for\n  parabolic stochastic partial differential equations", "comments": "27 pages, to appear in: Applied Numerical Mathematics", "journal-ref": null, "doi": "10.1016/j.apnum.2020.05.008", "report-no": null, "categories": "math.NA cs.NA math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discrete the ergodic semilinear stochastic partial differential equations\nin space dimension $d \\leq 3$ with additive noise, spatially by a spectral\nGalerkin method and temporally by an exponential Euler scheme. It is shown that\nboth the spatial semi-discretization and the spatio-temporal full\ndiscretization are ergodic. Further, convergence orders of the numerical\ninvariant measures, depending on the regularity of noise, are recovered based\non an easy time-independent weak error analysis without relying on Malliavin\ncalculus. To be precise, the convergence order is $1-\\epsilon$ in space and\n$\\frac{1}{2}-\\epsilon$ in time for the space-time white noise case and\n$2-\\epsilon$ in space and $1-\\epsilon$ in time for the trace class noise case\nin space dimension $d = 1$, with arbitrarily small $\\epsilon>0$. Numerical\nresults are finally reported to confirm these theoretical findings.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2018 14:50:55 GMT"}, {"version": "v2", "created": "Sat, 13 Jun 2020 15:28:32 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Chen", "Ziheng", ""], ["Gan", "Siqing", ""], ["Wang", "Xiaojie", ""]]}, {"id": "1811.01783", "submitter": "Nils Kintscher", "authors": "Karsten Kahl, Nils Kintscher", "title": "Automated Local Fourier Analysis (aLFA)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Local Fourier analysis is a commonly used tool to assess the quality and aid\nin the construction of geometric multigrid methods for translationally\ninvariant operators. In this paper we automate the process of local Fourier\nanalysis and present a framework that can be applied to arbitrary, including\nnon-orthogonal, repetitive structures. To this end we introduce the notion of\ncrystal structures and a suitable definition of corresponding wave functions,\nwhich allow for a natural representation of almost all translationally\ninvariant operators that are encountered in applications, e.g., discretizations\nof systems of PDEs, tight-binding Hamiltonians of crystalline structures,\ncolored domain decomposition approaches and last but not least two- or\nmultigrid hierarchies. Based on this definition we are able to automate the\nprocess of local Fourier analysis both with respect to spatial manipulations of\noperators as well as the Fourier analysis back-end. This automation most\nnotably simplifies the user input by removing the necessity for compatible\nrepresentations of the involved operators. Each individual operator and its\ncorresponding structure can be provided in any representation chosen by the\nuser.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2018 15:19:03 GMT"}, {"version": "v2", "created": "Wed, 23 Jan 2019 09:22:50 GMT"}, {"version": "v3", "created": "Thu, 25 Jul 2019 14:28:09 GMT"}], "update_date": "2019-07-26", "authors_parsed": [["Kahl", "Karsten", ""], ["Kintscher", "Nils", ""]]}, {"id": "1811.01928", "submitter": "Eldar Khattatov", "authors": "Ilona Ambartsumyan, Eldar Khattatov, Jan M. Nordbotten, Ivan Yotov", "title": "A multipoint stress mixed finite element method for elasticity on\n  quadrilateral grids", "comments": "arXiv admin note: text overlap with arXiv:1805.09920", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a multipoint stress mixed finite element method for linear\nelasticity with weak stress symmetry on quadrilateral grids, which can be\nreduced to a symmetric and positive definite cell centered system. The method\nis developed on simplicial grids in [4]. The method utilizes the lowest order\nBrezzi-Douglas-Marini finite element spaces for the stress and the trapezoidal\nquadrature rule in order to localize the interaction of degrees of freedom,\nwhich allows for local stress elimination around each vertex. We develop two\nvariants of the method. The first uses a piecewise constant rotation and\nresults in a cell-centered system for displacement and rotation. The second\nuses a continuous piecewise bilinear rotation and trapezoidal quadrature rule\nfor the asymmetry bilinear form. This allows for further elimination of the\nrotation, resulting in a cell-centered system for the displacement only.\nStability and error analysis is performed for both methods. First-order\nconvergence is established for all variables in their natural norms. A duality\nargument is employed to prove second order superconvergence of the displacement\nat the cell centers. Numerical results are presented in confirmation of the\ntheory.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2018 22:41:26 GMT"}, {"version": "v2", "created": "Thu, 1 Aug 2019 02:44:06 GMT"}], "update_date": "2019-08-06", "authors_parsed": [["Ambartsumyan", "Ilona", ""], ["Khattatov", "Eldar", ""], ["Nordbotten", "Jan M.", ""], ["Yotov", "Ivan", ""]]}, {"id": "1811.02174", "submitter": "Weizhu Bao", "authors": "Weizhu Bao, Yongyong Cai and Jia Yin", "title": "Super-resolution of time-splitting methods for the Dirac equation in the\n  nonrelativistic regime", "comments": "33 pages, 3 figures, 5 tables", "journal-ref": "Mathematics of Computation, 2020", "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish error bounds of the Lie-Trotter splitting ($S_1$) and Strang\nsplitting ($S_2$) for the Dirac equation in the nonrelativistic limit regime in\nthe absence of external magnetic potentials, with a small parameter\n$0<\\varepsilon\\leq 1$ inversely proportional to the speed of light. In this\nlimit regime, the solution propagates waves with $O(\\varepsilon^2)$ wavelength\nin time. Surprisingly, we find out that the splitting methods exhibit\nsuper-resolution, in the sense of breaking the resolution constraint under the\nShannon's sampling theorem, i.e. the methods can capture the solutions\naccurately even if the time step size $\\tau$ is much larger than the sampled\nwavelength at $O(\\varepsilon^2)$. $S_1$ shows $1/2$ order convergence uniformly\nwith respect to $\\varepsilon$, by establishing that there are two independent\nerror bounds $\\tau + \\varepsilon$ and $\\tau + \\tau/\\varepsilon$. Moreover, if\n$\\tau$ is non-resonant, i.e. $\\tau$ is away from certain region determined by\n$\\varepsilon$, $S_1$ would yield an improved uniform first order $O(\\tau)$\nerror bound. In addition, we show $S_2$ is uniformly convergent with 1/2 order\nrate for general time step size $\\tau$ and uniformly convergent with $3/2$\norder rate for non-resonant time step size. Finally, numerical examples are\nreported to validate our findings.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2018 05:50:38 GMT"}, {"version": "v2", "created": "Mon, 3 Feb 2020 14:45:57 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Bao", "Weizhu", ""], ["Cai", "Yongyong", ""], ["Yin", "Jia", ""]]}, {"id": "1811.02227", "submitter": "Alexander Veit", "authors": "Michel Chipot, Wolfgang Hackbusch, Stefan Sauter, Alexander Veit", "title": "Numerical approximation of Poisson problems in long domains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the Poisson equation on a \"long\" domain which is\nthe Cartesian product of a one-dimensional long interval with a\n(d-1)-dimensional domain. The right-hand side is assumed to have a rank-1\ntensor structure. We will present and compare methods to construct\napproximations of the solution which have tensor structure and the\ncomputational effort is governed by only solving elliptic problems on\nlower-dimensional domains. A zero-th order tensor approximation is derived by\nusing tools from asymptotic analysis (method 1). The resulting approximation is\nan elementary tensor and, hence has a fixed error which turns out to be very\nclose to the best possible approximation of zero-th order. This approximation\ncan be used as a starting guess for the derivation of higher-order tensor\napproximations by an alternating-least-squares (ALS) type method (method 2).\nNumerical experiments show that the ALS is converging towards the exact\nsolution. Method 3 is based on the derivation of a tensor approximation via\nexponential sums applied to discretised differential operators and their\ninverses. It can be proved that this method converges exponentially with\nrespect to the tensor rank. We present numerical experiments which compare the\nperformance and sensitivity of these three methods.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2018 08:50:55 GMT"}, {"version": "v2", "created": "Tue, 8 Oct 2019 14:20:56 GMT"}], "update_date": "2019-10-09", "authors_parsed": [["Chipot", "Michel", ""], ["Hackbusch", "Wolfgang", ""], ["Sauter", "Stefan", ""], ["Veit", "Alexander", ""]]}, {"id": "1811.02252", "submitter": "Bin Wang", "authors": "Bin Wang, Changying Liu, Yonglei Fang", "title": "One-stage explicit trigonometric integrators for effectively solving\n  quasilinear wave equations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, one-stage explicit trigonometric integrators for solving\nquasilinear wave equations are formulated and studied. For solving wave\nequations, we first introduce trigonometric integrators as the\nsemidiscretization in time and then consider a spectral Galerkin method for the\ndiscretization in space. We show that one-stage explicit trigonometric\nintegrators in time have second-order convergence and the result is also true\nfor the fullydiscrete scheme without requiring any CFL-type coupling of the\ndiscretization parameters. The results are proved by using energy techniques,\nwhich are widely applied in the numerical analysis of methods for partial\ndifferential equations.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2018 09:33:52 GMT"}, {"version": "v2", "created": "Wed, 14 Nov 2018 14:30:42 GMT"}, {"version": "v3", "created": "Sat, 17 Nov 2018 17:20:43 GMT"}, {"version": "v4", "created": "Sun, 25 Aug 2019 12:18:42 GMT"}], "update_date": "2019-08-27", "authors_parsed": [["Wang", "Bin", ""], ["Liu", "Changying", ""], ["Fang", "Yonglei", ""]]}, {"id": "1811.02499", "submitter": "William Throwe", "authors": "William Throwe and Saul A. Teukolsky", "title": "A high-order, conservative integrator with local time-stepping", "comments": "29 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a family of multistep integrators based on the Adams-Bashforth\nmethods. These schemes can be constructed for arbitrary convergence order with\narbitrary step size variation. The step size can differ between different\nsubdomains of the system. It can also change with time within a given\nsubdomain. The methods are linearly conservative, preserving a wide class of\nanalytically constant quantities to numerical roundoff, even when numerical\ntruncation error is significantly higher. These methods are intended for use in\nsolving conservative PDEs in discontinuous Galerkin formulations or in\nfinite-difference methods with compact stencils. A numerical test demonstrates\nthese properties and shows that significant speed improvements over the\nstandard Adams-Bashforth schemes can be obtained.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2018 17:13:04 GMT"}, {"version": "v2", "created": "Thu, 10 Oct 2019 21:01:39 GMT"}, {"version": "v3", "created": "Thu, 18 Jun 2020 17:58:37 GMT"}], "update_date": "2020-06-19", "authors_parsed": [["Throwe", "William", ""], ["Teukolsky", "Saul A.", ""]]}, {"id": "1811.02514", "submitter": "Xiaohao Cai", "authors": "Xiaohao Cai, Marcelo Pereyra, Jason D. McEwen", "title": "Quantifying Uncertainty in High Dimensional Inverse Problems by Convex\n  Optimisation", "comments": "5 pages, 5 figures", "journal-ref": "EUSIPCO 2019", "doi": null, "report-no": null, "categories": "eess.SP astro-ph.IM cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inverse problems play a key role in modern image/signal processing methods.\nHowever, since they are generally ill-conditioned or ill-posed due to lack of\nobservations, their solutions may have significant intrinsic uncertainty.\nAnalysing and quantifying this uncertainty is very challenging, particularly in\nhigh-dimensional problems and problems with non-smooth objective functionals\n(e.g. sparsity-promoting priors). In this article, a series of strategies to\nvisualise this uncertainty are presented, e.g. highest posterior density\ncredible regions, and local credible intervals (cf. error bars) for individual\npixels and superpixels. Our methods support non-smooth priors for inverse\nproblems and can be scaled to high-dimensional settings. Moreover, we present\nstrategies to automatically set regularisation parameters so that the proposed\nuncertainty quantification (UQ) strategies become much easier to use. Also,\ndifferent kinds of dictionaries (complete and over-complete) are used to\nrepresent the image/signal and their performance in the proposed UQ methodology\nis investigated.\n", "versions": [{"version": "v1", "created": "Sun, 4 Nov 2018 19:13:19 GMT"}, {"version": "v2", "created": "Thu, 5 Sep 2019 23:53:50 GMT"}], "update_date": "2019-09-09", "authors_parsed": [["Cai", "Xiaohao", ""], ["Pereyra", "Marcelo", ""], ["McEwen", "Jason D.", ""]]}, {"id": "1811.03188", "submitter": "Vahan Huroyan", "authors": "Vahan Huroyan, Gilad Lerman, and Hau-Tieng Wu", "title": "Solving Jigsaw Puzzles By the Graph Connection Laplacian", "comments": null, "journal-ref": "SIAM J. Imaging Sci. 13(4) (2020) 1717-1753", "doi": "10.1137/19M1290760", "report-no": null, "categories": "cs.CV cs.LG cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel mathematical framework to address the problem of\nautomatically solving large jigsaw puzzles. This problem assumes a large image,\nwhich is cut into equal square pieces that are arbitrarily rotated and\nshuffled, and asks to recover the original image given the transformed pieces.\nThe main contribution of this work is a method for recovering the rotations of\nthe pieces when both shuffles and rotations are unknown. A major challenge of\nthis procedure is estimating the graph connection Laplacian without the\nknowledge of shuffles. A careful combination of our proposed method for\nestimating rotations with any existing method for estimating shuffles results\nin a practical solution for the jigsaw puzzle problem. Our theory guarantees,\nin a clean setting, that our basic idea of recovering rotations is robust to\nsome corruption of the connection graph. Numerical experiments demonstrate the\ncompetitive accuracy of this solution, its robustness to corruption and, its\ncomputational advantage for large puzzles.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2018 23:45:03 GMT"}, {"version": "v2", "created": "Tue, 13 Nov 2018 21:29:46 GMT"}, {"version": "v3", "created": "Fri, 8 Nov 2019 04:50:51 GMT"}, {"version": "v4", "created": "Mon, 27 Apr 2020 01:50:50 GMT"}, {"version": "v5", "created": "Sun, 1 Nov 2020 12:04:30 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Huroyan", "Vahan", ""], ["Lerman", "Gilad", ""], ["Wu", "Hau-Tieng", ""]]}, {"id": "1811.03295", "submitter": "Xuehai Huang", "authors": "Long Chen, Xuehai Huang", "title": "Nonconforming Virtual Element Method for $2m$-th Order Partial\n  Differential Equations in $\\mathbb R^n$", "comments": "33pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A unified construction of the $H^m$-nonconforming virtual elements of any\norder $k$ is developed on any shape of polytope in $\\mathbb R^n$ with\nconstraints $m\\leq n$ and $k\\geq m$. As a vital tool in the construction, a\ngeneralized Green's identity for $H^m$ inner product is derived. The\n$H^m$-nonconforming virtual element methods are then used to approximate\nsolutions of the $m$-harmonic equation. After establishing a bound on the jump\nrelated to the weak continuity, the optimal error estimate of the canonical\ninterpolation, and the norm equivalence of the stabilization term, the optimal\nerror estimates are derived for the $H^m$-nonconforming virtual element\nmethods.\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2018 07:27:51 GMT"}, {"version": "v2", "created": "Fri, 22 Feb 2019 09:52:27 GMT"}, {"version": "v3", "created": "Tue, 9 Jul 2019 14:17:54 GMT"}, {"version": "v4", "created": "Wed, 16 Oct 2019 07:26:34 GMT"}], "update_date": "2019-10-17", "authors_parsed": [["Chen", "Long", ""], ["Huang", "Xuehai", ""]]}, {"id": "1811.03339", "submitter": "Zongze Yang", "authors": "Zongze Yang and Zhanbin Yuan and Yufeng Nie and Jungang Wang", "title": "Finite Element Methods for Fractional PDEs in Three Dimensions", "comments": "7 pages, 3 figures", "journal-ref": null, "doi": "10.1016/j.aml.2019.106041", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is a generalization of the previous work (Yang et.al, J. Comput.\nPhys. 330 (2017), 863-883) to the 3-D irregular convex domains. The analytical\ncalculation formula of fractional derivatives of finite element basis functions\nare given and a path searching method is developed to find the integration\npaths corresponding to the Gaussian points. Moreover, a template matrix is\nintroduced to speed up the procedures. Numerical experiments on a steady\nproblem are presented verifying the efficiency of proposed techniques.\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2018 10:14:57 GMT"}, {"version": "v2", "created": "Mon, 21 Jan 2019 07:07:38 GMT"}, {"version": "v3", "created": "Sat, 7 Sep 2019 09:34:29 GMT"}], "update_date": "2019-09-10", "authors_parsed": [["Yang", "Zongze", ""], ["Yuan", "Zhanbin", ""], ["Nie", "Yufeng", ""], ["Wang", "Jungang", ""]]}, {"id": "1811.03404", "submitter": "Torsten Ke{\\ss}ler", "authors": "Torsten Ke{\\ss}ler and Sergej Rjasanow and Steffen Wei{\\ss}er", "title": "Vlasov-Poisson system tackled by particle simulation utilising boundary\n  element methods", "comments": "final draft post-refereeing", "journal-ref": null, "doi": "10.1137/18M1225823", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a grid-free simulation algorithm for the fully\nthree-dimensional Vlasov--Poisson system for collisionless electron plasmas. We\nemploy a standard particle method for the numerical approximation of the\ndistribution function. Whereas the advection of the particles is grid-free by\nits very nature, the computation of the acceleration involves the solution of\nthe non-local Poisson equation. To circumvent a volume mesh, we utilise the\nFast Boundary Element Method, which reduces the three-dimensional Poisson\nequation to a system of linear equations on its two-dimensional boundary. This\ngives rise to fully populated matrices which are approximated by the $\\mathcal\nH^2$-technique, reducing the computational time from quadratic to linear\ncomplexity. The approximation scheme based on interpolation has shown to be\nrobust and flexible, allowing a straightforward generalisation to vector-valued\nfunctions. In particular, the Coulomb forces acting on the particles are\ncomputed in linear complexity. In first numerical tests, we validate our\napproach with the help of classical non-linear plasma phenomena. Furthermore,\nwe show that our method is able to simulate electron plasmas in complex\nthree-dimensional domains with mixed boundary conditions in linear complexity.\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2018 13:44:10 GMT"}, {"version": "v2", "created": "Fri, 7 Feb 2020 09:02:17 GMT"}], "update_date": "2020-03-06", "authors_parsed": [["Keßler", "Torsten", ""], ["Rjasanow", "Sergej", ""], ["Weißer", "Steffen", ""]]}, {"id": "1811.03559", "submitter": "Eric Polizzi", "authors": "Braegan S. Spring, Eric Polizzi, Ahmed H. Sameh", "title": "A Feature Complete SPIKE Banded Algorithm and Solver", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  New features and enhancements for the SPIKE banded solver are presented.\nAmong all the SPIKE algorithm versions, we focus our attention on the recursive\nSPIKE technique which provides the best trade-off between generality and\nparallel efficiency, but was known for its lack of flexibility. Its application\nwas essentially limited to power of two number of cores/processors. This\nlimitation is successfully addressed in this paper. In addition, we present a\nnew transpose solve option, a standard feature of most numerical solver\nlibraries which has never been addressed by the SPIKE algorithm so far. A\npivoting recursive SPIKE strategy is finally presented as an alternative to\nnon-pivoting scheme for systems with large condition numbers. All these new\nenhancements participate to create a feature complete SPIKE algorithm and a new\nblack-box SPIKE-OpenMP package that significantly outperforms the performance\nand scalability obtained with other state-of-the-art banded solvers.\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2018 17:28:23 GMT"}], "update_date": "2018-11-12", "authors_parsed": [["Spring", "Braegan S.", ""], ["Polizzi", "Eric", ""], ["Sameh", "Ahmed H.", ""]]}, {"id": "1811.03813", "submitter": "Kim Batselier", "authors": "Kim Batselier", "title": "The trouble with tensor ring decompositions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tensor train decomposition decomposes a tensor into a \"train\" of 3-way\ntensors that are interconnected through the summation of auxiliary indices. The\ndecomposition is stable, has a well-defined notion of rank and enables the user\nto perform various linear algebra operations on vectors and matrices of\nexponential size in a computationally efficient manner. The tensor ring\ndecomposition replaces the train by a ring through the introduction of one\nadditional auxiliary variable. This article discusses a major issue with the\ntensor ring decomposition: its inability to compute an exact minimal-rank\ndecomposition from a decomposition with sub-optimal ranks. Both the contraction\noperation and Hadamard product are motivated from applications and it is shown\nthrough simple examples how the tensor ring-rounding procedure fails to\nretrieve minimal-rank decompositions with these operations. These observations,\ntogether with the already known issue of not being able to find a best low-rank\ntensor ring approximation to a given tensor indicate that the applicability of\ntensor rings is severely limited.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2018 08:20:43 GMT"}], "update_date": "2018-11-12", "authors_parsed": [["Batselier", "Kim", ""]]}, {"id": "1811.03839", "submitter": "Jose Pablo Lucero Lorca", "authors": "Jose Pablo Lucero Lorca and Guido Kanschat", "title": "Multilevel Schwarz preconditioners for singularly perturbed symmetric\n  reaction-diffusion systems", "comments": "19 pages, 5 tables", "journal-ref": "Electron. Trans. Numer. Anal. Volume 54, pp. 89-107, 2021", "doi": "10.1553/etna_vol54s89", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present robust and highly parallel multilevel non-overlapping Schwarz\npreconditioners, to solve an interior penalty discontinuous Galerkin finite\nelement discretization of a system of steady state, singularly perturbed\nreaction-diffusion equations with a singular reaction operator, using a GMRES\nsolver. We provide proofs of convergence for the two-level setting and the\nmultigrid V-cycle as well as numerical results for a wide range of regimes.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2018 09:57:14 GMT"}, {"version": "v2", "created": "Sat, 5 Sep 2020 04:29:57 GMT"}], "update_date": "2021-01-18", "authors_parsed": [["Lorca", "Jose Pablo Lucero", ""], ["Kanschat", "Guido", ""]]}, {"id": "1811.03852", "submitter": "Chris Maynard", "authors": "Christopher M Maynard and David N Walters", "title": "Precision of the ENDGame: Mixed-precision arithmetic in the iterative\n  solver of the Unified Model", "comments": "13 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Met Office's weather and climate simulation code the Unified Model is\nused for both operational Numerical Weather Prediction and Climate modelling.\nThe computational performance of the model running on parallel supercomputers\nis a key consideration. A Krylov sub-space solver is employed to solve the\nequations of the dynamical core of the model, known as ENDGame. These describe\nthe evolution of the Earth's atmosphere. Typically, 64-bit precision is used\nthroughout weather and climate applications. This work presents a\nmixed-precision implementation of the solver, the beneficial effect on run-time\nand the impact on solver convergence. The complex interplay of errors arising\nfrom accumulated round-off in floating-point arithmetic and other numerical\neffects is discussed. A careful analysis is required, however, the\nmixed-precision solver is now employed in the operational forecast to satisfy\nrun-time constraints without compromising the accuracy of the solution.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2018 10:30:26 GMT"}], "update_date": "2018-11-12", "authors_parsed": [["Maynard", "Christopher M", ""], ["Walters", "David N", ""]]}, {"id": "1811.03932", "submitter": "Zhe Yu", "authors": "Zhe Yu, Boying Wu, Jiebao Sun, Wenjie Liu", "title": "A Generalized-Jacobi-Function Spectral Method for Space-Time Fractional\n  Reaction-Diffusion Equations with Viscosity Terms", "comments": "33 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we study a new spectral Petrov-Galerkin approximation of\nspace-time fractional reaction-diffusion equations with viscosity terms built\nby Riemann-Liouville fractional-order derivatives. The proposed method is\nreliant on generalized Jacobi functions (GJFs) for our problems. The\ncontributions are threefold: First, thanks to the theoretical framework of\nvariational problems, the well-posedness of the problem is proved. Second, new\nGJF-basis functions are established to fit weak solutions, which take full\nadvantages of the global properties of fractional derivatives. Moreover, the\nbasis functions conclude singular terms, in order to solve our problems with\ngiven smooth source term. Finally, we get a numerical analysis of error\nestimates to depend on GJF-basis functions. Numerical experiments confirm the\nexpected convergence. In addition, they are given to show the effect of the\nviscosity terms in anomalous diffusion.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2018 14:44:01 GMT"}, {"version": "v2", "created": "Sat, 23 Nov 2019 01:33:22 GMT"}], "update_date": "2019-11-26", "authors_parsed": [["Yu", "Zhe", ""], ["Wu", "Boying", ""], ["Sun", "Jiebao", ""], ["Liu", "Wenjie", ""]]}, {"id": "1811.04033", "submitter": "Bastian Seifert", "authors": "Bastian Seifert and Knut H\\\"uper", "title": "The discrete cosine transform on triangles", "comments": "4 pages, 2 figures, submitted conference paper,", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The discrete cosine transform is a valuable tool in analysis of data on\nundirected rectangular grids, like images. In this paper it is shown how one\ncan define an analogue of the discrete cosine transform on triangles. This is\ndone by combining algebraic signal processing theory with a specific kind of\nmultivariate Chebyshev polynomials. Using a multivariate Christoffel-Darboux\nformula it is shown how to derive an orthogonal version of the transform.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2018 17:36:33 GMT"}], "update_date": "2018-11-12", "authors_parsed": [["Seifert", "Bastian", ""], ["Hüper", "Knut", ""]]}, {"id": "1811.04261", "submitter": "Kouji Hashimoto", "authors": "Kouji Hashimoto, Takehiko Kinoshita, Mitsuhiro T. Nakao", "title": "Numerical verification of solutions for nonlinear parabolic problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a numerical verification method of solutions for\nnonlinear parabolic initial boundary value problems. Decomposing the problem\ninto a nonlinear part and an initial value part, we apply Nakao's projection\nmethod, which is based on the full-discrete finite element method with\nconstructive error estimates, to the nonlinear part and use the theoretical\nanalysis for the heat equation to the initial value part, respectively. We show\nsome verified examples for solutions of nonlinear problems from initial value\nto the neighborhood of the stationary solutions, which confirm us the actual\neffectiveness of our method.\n", "versions": [{"version": "v1", "created": "Sat, 10 Nov 2018 14:29:52 GMT"}, {"version": "v2", "created": "Wed, 15 Jan 2020 01:03:46 GMT"}], "update_date": "2020-01-16", "authors_parsed": [["Hashimoto", "Kouji", ""], ["Kinoshita", "Takehiko", ""], ["Nakao", "Mitsuhiro T.", ""]]}, {"id": "1811.04587", "submitter": "Haiyong Wang", "authors": "Haiyong Wang and Lun Zhang", "title": "Analysis of multivariate Gegenbauer approximation in the hypercube", "comments": "Adv. Comput. Math., to appear", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we are concerned with multivariate Gegenbauer approximation of\nfunctions defined in the $d$-dimensional hypercube. Two new and sharper bounds\nfor the coefficients of multivariate Gegenbauer expansion of analytic functions\nare presented based on two different extensions of the Bernstein ellipse. We\nthen establish an explicit error bound for the multivariate Gegenbauer\napproximation associated with an $\\ell^q$ ball index set in the uniform norm.\nWe also consider the multivariate approximation of functions with finite\nregularity and derive the associated error bound on the full grid in the\nuniform norm. As an application, we extend our arguments to obtain some new\ntight bounds for the coefficients of tensorized Legendre expansions in the\ncontext of polynomial approximation of parameterized PDEs.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2018 07:04:28 GMT"}, {"version": "v2", "created": "Tue, 15 Jan 2019 10:39:13 GMT"}, {"version": "v3", "created": "Thu, 2 Apr 2020 11:54:23 GMT"}], "update_date": "2020-04-03", "authors_parsed": [["Wang", "Haiyong", ""], ["Zhang", "Lun", ""]]}, {"id": "1811.04598", "submitter": "Jean-Luc Bouchot", "authors": "Jean-Luc Bouchot", "title": "Weighted block compressed sensing for parametrized function\n  approximation", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we extend results taken from compressed sensing to recover\nHilbert-space valued vectors. This is an important problem in parametric\nfunction approximation in particular when the number of parameters is high. By\nexpanding our target functions in a polynomial chaos and assuming some\ncompressibility of such an expansion, we can exploit structured sparsity\n(typically a group sparsity structure) to recover the sequence of coefficients\nwith high accuracy.\n  While traditional compressed sensing would typically expect a number of\nsnapshots scaling exponentially with the number of parameters, we can beat this\ndependence by adding weights. This anisotropic handling of the parameter space\npermits to compute approximations with a number of samples scaling only\nlinearly (up to log-factors) with the intrinsic complexity of the polynomial\nexpansion.\n  Our results are applied to problems in high-dimensional parametric elliptic\nPDEs. We show that under some weighted uniform ellipticity assumptions of a\nparametric operator, we are capable of numerically approximating the full\nsolution (in contrast to the usual quantity of interest) to within a specified\naccuracy.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2018 08:26:24 GMT"}, {"version": "v2", "created": "Tue, 13 Nov 2018 14:26:08 GMT"}, {"version": "v3", "created": "Mon, 8 Jun 2020 12:38:40 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Bouchot", "Jean-Luc", ""]]}, {"id": "1811.04630", "submitter": "Yuichi Tanji Tanji", "authors": "Yuichi Tanji", "title": "Reciprocal and Positive Real Balanced Truncations for Model Order\n  Reduction of Descriptor Systems", "comments": "20 pages, 6 figuers", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Model order reduction algorithms for large-scale descriptor systems are\nproposed using balanced truncation, in which symmetry or block skew symmetry\n(reciprocity) and the positive realness of the original transfer matrix are\npreserved. Two approaches based on standard and generalized algebraic Riccati\nequations are proposed. To accelerate the algorithms, a fast Riccati solver,\nRADI (alternating directions implicit [ADI]-type iteration for Riccati\nequations), is also introduced. As a result, the proposed methods are general\nand efficient as a model order reduction algorithm for descriptor systems\nassociated with electrical circuit networks.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2018 09:51:16 GMT"}], "update_date": "2018-11-13", "authors_parsed": [["Tanji", "Yuichi", ""]]}, {"id": "1811.04699", "submitter": "Lars Magnus Valnes", "authors": "Lars Magnus Valnes, Sebastian K. Mitusch, Geir Ringstad, Per Kristian\n  Eide, Simon W. Funke and Kent-Andre Mardal", "title": "Can diffusion alone explain brain-wide distribution of a CSF tracer\n  within 24 hours?", "comments": "20 pages, with 6 pages supplementary, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recently proposed glymphatic system suggests that bulk flow is important\nfor clearing waste from the brain, and as such may underlie the development of\ne.g. Alzheimer's disease. The glymphatic hypothesis is still controversial and\nseveral biomechanical modeling studies at the micro-level have at least\npartially dismissed the system and its assumptions. In contrast, at the\nmacro-level, there are many experimental findings in support of bulk flow.\nHere, we will investigate to what extent the CSF tracer distributions seen in\nnovel magnetic resonance imaging (MRI) investigations over hours and days are\nsuggestive of bulk flow or diffusion. In order to include the complex geometry\nof the brain, the heterogeneous CSF flow around the brain, and the transport\nover the time-scale of days, we employed the methods of partial differential\nconstrained optimization to identify the apparent diffusion coefficient (ADC)\nthat would correspond best to the MRI findings. We found that the computed ADC\nin grey and white matter was respectively 23\\% and 82\\% larger than the ADC\nestimated with DTI, which suggests that diffusion may not be the only mechanism\ngoverning transport.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2018 12:57:10 GMT"}, {"version": "v2", "created": "Sat, 2 Nov 2019 15:54:35 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Valnes", "Lars Magnus", ""], ["Mitusch", "Sebastian K.", ""], ["Ringstad", "Geir", ""], ["Eide", "Per Kristian", ""], ["Funke", "Simon W.", ""], ["Mardal", "Kent-Andre", ""]]}, {"id": "1811.04755", "submitter": "Micol Pennacchio", "authors": "Silvia Bertoluzza, Micol Pennacchio, Daniele Prada", "title": "High order VEM on curved domains", "comments": "17 pages", "journal-ref": "Rend. Lincei Mat. Appl., 30(3), 391-412 (2019)", "doi": "10.4171/RLM/853", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We deal with the virtual element method (VEM) for solving the Poisson\nequation on a domain $\\Omega$ with curved boundaries. Given a polygonal\napproximation $\\Omega_h$ of the domain $\\Omega$, the standard order $m$ VEM\n[6], for $m$ increasing, leads to a suboptimal convergence rate. We adapt the\napproach of [16] to VEM and we prove that an optimal convergence rate can be\nachieved by using a suitable correction depending on high order normal\nderivatives of the discrete solution at the boundary edges of $\\Omega_h$,\nwhich, to retain computability, is evaluated after applying the projector\n$\\Pi^\\nabla$ onto the space of polynomials. Numerical experiments confirm the\ntheory.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2018 14:53:17 GMT"}, {"version": "v2", "created": "Mon, 12 Apr 2021 09:06:45 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Bertoluzza", "Silvia", ""], ["Pennacchio", "Micol", ""], ["Prada", "Daniele", ""]]}, {"id": "1811.04830", "submitter": "Francois Hamon", "authors": "Francois P. Hamon and Bradley T. Mallison", "title": "Fully Implicit Multidimensional Hybrid Upwind Scheme for Coupled Flow\n  and Transport", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2019.112606", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Robust and accurate fully implicit finite-volume schemes applied to\nDarcy-scale multiphase flow and transport in porous media are highly desirable.\nRecently, a smooth approximation of the saturation-dependent flux coefficients\nbased on Implicit Hybrid Upwinding (IHU) has been proposed to improve the\nnonlinear convergence in fully implicit simulations with buoyancy. Here, we\ndesign a truly multidimensional extension of this approach that retains the\nsimplicity and robustness of IHU while reducing the sensitivity of the results\nto the orientation of the computational (Cartesian) grid. This is achieved with\nthe introduction of an adaptive, local coupling between the fluxes that takes\nthe flow pattern into account. We analyze the mathematical properties of the\nproposed methodology to show that the scheme is monotone in the presence of\ncompeting viscous and buoyancy forces and yields saturations remaining between\nphysical bounds. Finally, we demonstrate the efficiency and accuracy of the\nscheme on challenging two-dimensional two-phase examples with buoyancy, with an\nemphasis on the reduction of the grid orientation effect.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2018 16:18:30 GMT"}, {"version": "v2", "created": "Mon, 6 May 2019 22:46:40 GMT"}, {"version": "v3", "created": "Tue, 20 Aug 2019 17:23:52 GMT"}], "update_date": "2019-09-17", "authors_parsed": [["Hamon", "Francois P.", ""], ["Mallison", "Bradley T.", ""]]}, {"id": "1811.05310", "submitter": "Mohd Almie Alias", "authors": "Mohd Almie Alias, Pascal R Buenzli", "title": "A level-set method for the evolution of cells and tissue during\n  curvature-controlled growth", "comments": "15 pages, 10 figures, 3 supplementary figures", "journal-ref": "Int J Numer Meth Biomed Engng 2019; e3279", "doi": "10.1002/ncm.3279", "report-no": null, "categories": "math.NA cs.NA physics.bio-ph physics.comp-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most biological tissues grow by the synthesis of new material close to the\ntissue's interface, where spatial interactions can exert strong geometric\ninfluences on the local rate of growth. These geometric influences may be\nmechanistic, or cell behavioural in nature. The control of geometry on tissue\ngrowth has been evidenced in many in-vivo and in-vitro experiments, including\nbone remodelling, wound healing, and tissue engineering scaffolds. In this\npaper, we propose a generalisation of a mathematical model that captures the\nmechanistic influence of curvature on the joint evolution of cell density and\ntissue shape during tissue growth. This generalisation allows us to simulate\nabrupt topological changes such as tissue fragmentation and tissue fusion, as\nwell as three dimensional cases, through a level-set-based method. The\nlevel-set method developed introduces another Eulerian field than the level-set\nfunction. This additional field represents the surface density of tissue\nsynthesising cells, anticipated at future locations of the interface. Numerical\ntests performed with this level-set-based method show that numerical\nconservation of cells is a good indicator of simulation accuracy, particularly\nwhen cusps develop in the tissue's interface. We apply this new model to\nseveral situations of curvature-controlled tissue evolutions that include\nfragmentation and fusion.\n", "versions": [{"version": "v1", "created": "Sat, 3 Nov 2018 04:19:59 GMT"}, {"version": "v2", "created": "Tue, 18 Jun 2019 14:34:45 GMT"}, {"version": "v3", "created": "Mon, 16 Sep 2019 16:00:27 GMT"}], "update_date": "2020-05-28", "authors_parsed": [["Alias", "Mohd Almie", ""], ["Buenzli", "Pascal R", ""]]}, {"id": "1811.05311", "submitter": "Aleksandr Shemendyuk", "authors": "Vladimir A. Gordin and Aleksandr A. Shemendyuk", "title": "Discrete Transparent Boundary Conditions for the Equation of Rod\n  Transverse Vibrations", "comments": "28 pages, 8 figures. This file replaces previously published work due\n  to some improvements - extension of Section 2, updated figure 2, corrected\n  typos", "journal-ref": "Applied Mathematical Modelling, 2020", "doi": "10.1016/j.apm.2020.06.050", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Local perturbations of an infinitely long rod go away to infinity. On the\ncontrary, in the case of a finite length of the rod, the perturbations reach\nits boundary and are reflected from it. The boundary conditions constructed\nhere for the implicit difference scheme imitate the Cauchy problem and provide\nalmost no reflection. These boundary conditions are non-local in time, and\ntheir practical implementation requires additional calculations at every time\nstep. To minimise them, a special rational approximation similar to the Hermite\n- Pad\\'e approximation is used. Numerical experiments confirm the high\n\"transparency\" of these boundary conditions and determine the conditional\nstability regions for finite-difference scheme.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2018 13:58:16 GMT"}, {"version": "v2", "created": "Wed, 1 Jul 2020 13:21:39 GMT"}, {"version": "v3", "created": "Mon, 13 Jul 2020 18:59:59 GMT"}], "update_date": "2020-07-15", "authors_parsed": [["Gordin", "Vladimir A.", ""], ["Shemendyuk", "Aleksandr A.", ""]]}, {"id": "1811.05392", "submitter": "Zhihui Liu", "authors": "Zhihui Liu and Zhonghua Qiao", "title": "Strong Approximation of Monotone Stochastic Partial Different Equations\n  Driven by Multiplicative Noise", "comments": null, "journal-ref": "Stoch. Partial Differ. Equ. Anal. Comput. 2020", "doi": "10.1007/s40072-020-00179-2", "report-no": null, "categories": "math.NA cs.NA math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish a general theory of optimal strong error estimation for\nnumerical approximations of a second-order parabolic stochastic partial\ndifferential equation with monotone drift driven by a multiplicative\ninfinite-dimensional Wiener process. The equation is spatially discretized by\nGalerkin methods and temporally discretized by drift-implicit Euler and\nMilstein schemes. By the monotone and Lyapunov assumptions, we use both the\nvariational and semigroup approaches to derive a spatial Sobolev regularity\nunder the $L_\\omega^p L_t^\\infty \\dot H^{1+\\gamma}$-norm and a temporal\nH\\\"older regularity under the $L_\\omega^p L_x^2$-norm for the solution of the\nproposed equation with an $\\dot H^{1+\\gamma}$-valued initial datum for\n$\\gamma\\in [0,1]$. Then we make full use of the monotonicity of the equation\nand tools from stochastic calculus to derive the sharp strong convergence rates\n$O(h^{1+\\gamma}+\\tau^{1/2})$ and $O(h^{1+\\gamma}+\\tau^{(1+\\gamma)/2})$ for the\nGalerkin-based Euler and Milstein schemes, respectively.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2018 16:34:53 GMT"}, {"version": "v2", "created": "Thu, 30 Jul 2020 12:53:13 GMT"}], "update_date": "2020-07-31", "authors_parsed": [["Liu", "Zhihui", ""], ["Qiao", "Zhonghua", ""]]}, {"id": "1811.05398", "submitter": "Marcus Christian Lehmann", "authors": "Marcus Christian Lehmann, Mirsad Had\\v{z}iefendi\\'c, Albert Piwonski,\n  Rolf Schuhmann", "title": "Encoding Electromagnetic Transformation Laws for Dimensional Reduction", "comments": "27 pages, 8 figures (no photos), inline math color", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electromagnetic phenomena are mathematically described by solutions of\nboundary value problems. For exploiting symmetries of these boundary value\nproblems in a way that is offered by techniques of dimensional reduction, it\nneeds to be justified that the derivative in symmetry direction is constant or\neven vanishing. A generalized notion of symmetry can be defined with different\ndirections at every point in space, as long as it is possible to exhibit\nunidirectional symmetry in some coordinate representation. This can be\nachieved, e.g., when the symmetry direction is given by the direct construction\nout of a unidirectional symmetry via a coordinate transformation which poses a\ndemand on the boundary value problem. Coordinate independent formulations of\nboundary value problems do exist but turning that theory into practice demands\na pedantic process of backtranslation to the computational notions. This\nbecomes even more challenging when multiple chained transformations are\nnecessary for propagating a symmetry. We try to fill this gap and present the\nmore general, isolated problems of that translation.\n  Within this contribution, the partial derivative and the corresponding chain\nrule for multivariate calculus are investigated with respect to their\nencodability in computational terms. We target the layer above univariate\ncalculus, but below tensor calculus.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2018 15:06:12 GMT"}, {"version": "v2", "created": "Thu, 16 Apr 2020 21:35:00 GMT"}], "update_date": "2020-04-20", "authors_parsed": [["Lehmann", "Marcus Christian", ""], ["Hadžiefendić", "Mirsad", ""], ["Piwonski", "Albert", ""], ["Schuhmann", "Rolf", ""]]}, {"id": "1811.05429", "submitter": "Devika Shylaja", "authors": "Devika Shylaja", "title": "Improved $L^2$ and $H^1$ error estimates for the Hessian discretisation\n  method", "comments": "26 pages, 4 figures, 7 tables", "journal-ref": "Numerical Methods for Partial Differential Equations, Jan 2020", "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Hessian discretisation method (HDM) for fourth order linear elliptic\nequations provides a unified convergence analysis framework based on three\nproperties namely coercivity, consistency, and limit-conformity. Some examples\nthat fit in this approach include conforming and nonconforming finite element\nmethods, finite volume methods and methods based on gradient recovery\noperators. A generic error estimate has been established in $L^2$, $H^1$ and\n$H^2$-like norms in literature. In this paper, we establish improved $L^2$ and\n$H^1$ error estimates in the framework of HDM and illustrate it on various\nschemes. Since an improved $L^2$ estimate is not expected in general for finite\nvolume method (FVM), a modified FVM is designed by changing the quadrature of\nthe source term and a superconvergence result is proved for this modified FVM.\nIn addition to the Adini nonconforming finite element method (ncFEM), in this\npaper, we show that the Morley ncFEM is an example of HDM. Numerical results\nthat justify the theoretical results are also presented.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2018 17:42:22 GMT"}, {"version": "v2", "created": "Mon, 19 Nov 2018 16:47:14 GMT"}, {"version": "v3", "created": "Fri, 17 May 2019 16:38:05 GMT"}, {"version": "v4", "created": "Thu, 30 Jan 2020 05:09:10 GMT"}], "update_date": "2020-01-31", "authors_parsed": [["Shylaja", "Devika", ""]]}, {"id": "1811.05579", "submitter": "Li Wang", "authors": "Min Tang, Li Wang and Xiaojiang Zhang", "title": "Accurate front capturing asymptotic preserving scheme for nonlinear gray\n  radiative transfer equation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an asymptotic preserving scheme for the gray radiative transfer\nequation. Two asymptotic regimes are considered: one is a diffusive regime\ndescribed by a nonlinear diffusion equation for the material temperature; the\nother is a free streaming regime with zero opacity. To alleviate the\nrestriction on time step and capture the correct front propagation in the\ndiffusion limit, an implicit treatment is crucial. However, this often involves\na large-scale nonlinear iterative solver as the spatial and angular dimensions\nare coupled. Our idea is to introduce an auxiliary variable that leads to a\n``redundant\" system, which is then solved with a three-stage update:\nprediction, correction, and projection. The benefit of this approach is that\nthe implicit system is local to each spatial element, independent of angular\nvariable, and thus only requires a scalar Newton's solver. We also introduce a\nspatial discretization with a compact stencil based on even-odd decomposition.\nOur method preserves both the nonlinear diffusion limit with correct front\npropagation speed and the free streaming limit, with a hyperbolic CFL\ncondition.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2018 00:47:45 GMT"}, {"version": "v2", "created": "Fri, 13 Sep 2019 22:33:11 GMT"}], "update_date": "2019-09-17", "authors_parsed": [["Tang", "Min", ""], ["Wang", "Li", ""], ["Zhang", "Xiaojiang", ""]]}, {"id": "1811.05741", "submitter": "Christian Fries", "authors": "Christian P. Fries", "title": "Stochastic Algorithmic Differentiation of (Expectations of)\n  Discontinuous Functions (Indicator Functions)", "comments": "21 pages, 5 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.NA math.NA", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  In this paper, we present a method for the accurate estimation of the\nderivative (aka.~sensitivity) of expectations of functions involving an\nindicator function by combining a stochastic algorithmic differentiation and a\nregression.\n  The method is an improvement of the approach presented in [Risk Magazine\nApril 2018].\n  The finite difference approximation of a partial derivative of a Monte-Carlo\nintegral of a discontinuous function is known to exhibit a high Monte-Carlo\nerror. The issue is evident since the Monte-Carlo approximation of a\ndiscontinuous function is just a finite sum of discontinuous functions and as\nsuch, not even differentiable.\n  The algorithmic differentiation of a discontinuous function is problematic. A\nnatural approach is to replace the discontinuity by continuous functions. This\nis equivalent to replacing a path-wise automatic differentiation by a (local)\nfinite difference approximation.\n  We present an improvement (in terms of variance reduction) by decoupling the\nintegration of the Dirac delta and the remaining conditional expectation and\nestimating the two parts by separate regressions. For the algorithmic\ndifferentiation, we derive an operator that can be injected seamlessly - with\nminimal code changes - into the algorithm resulting in the exact result.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2018 11:59:11 GMT"}, {"version": "v2", "created": "Wed, 21 Nov 2018 18:14:53 GMT"}, {"version": "v3", "created": "Thu, 22 Nov 2018 18:56:10 GMT"}, {"version": "v4", "created": "Mon, 26 Nov 2018 16:51:27 GMT"}, {"version": "v5", "created": "Mon, 11 Nov 2019 21:49:56 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Fries", "Christian P.", ""]]}, {"id": "1811.05753", "submitter": "Martin B\\\"aker", "authors": "Martin B\\\"aker", "title": "How to get meaningful and correct results from your finite element model", "comments": "26 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This document gives guidelines to set up, run, and postprocess correct\nsimulations with the finite element method. It is not an introduction to the\nmethod itself, but rather a list of things to check and possible mistakes to\nwatch out for when doing a finite element simulation.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2018 12:52:26 GMT"}], "update_date": "2018-11-15", "authors_parsed": [["Bäker", "Martin", ""]]}, {"id": "1811.05854", "submitter": "Gianna Maria Del Corso", "authors": "Gianna M. Del Corso and Federico Poloni and Leonardo Robol and Raf\n  Vandebril", "title": "When is a matrix unitary or Hermitian plus low rank?", "comments": "(to appear)", "journal-ref": "Numerical Linear Algebra with Applications, 2019", "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hermitian and unitary matrices are two representatives of the class of normal\nmatrices whose full eigenvalue decomposition can be stably computed in\nquadratic computing com plexity. Recently, fast and reliable eigensolvers\ndealing with low rank perturbations of unitary and Hermitian matrices were\nproposed. These structured eigenvalue problems appear naturally when computing\nroots, via confederate linearizations, of polynomials expressed in, e.g., the\nmonomial or Chebyshev basis. Often, however, it is not known beforehand whether\nor not a matrix can be written as the sum of an Hermitian or unitary matrix\nplus a low rank perturbation. We propose necessary and sufficient conditions\ncharacterizing the class of Hermitian or unitary plus low rank matrices. The\nnumber of singular values deviating from 1 determines the rank of a\nperturbation to bring a matrix to unitary form. A similar condition holds for\nHermitian matrices; the eigenvalues of the skew-Hermitian part differing from 0\ndictate the rank of the perturbation. We prove that these relations are linked\nvia the Cayley transform. Based on these conditions we are able to identify the\nclosest Hermitian and unitary plus low rank matrix in Frobenius and spectral\nnorm and a practical Lanczos iteration to detect the low rank perturbation is\npresented. Numerical tests prove that this straightforward algorithm is robust\nwith respect to noise.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2018 15:38:25 GMT"}, {"version": "v2", "created": "Fri, 16 Nov 2018 19:07:10 GMT"}, {"version": "v3", "created": "Thu, 25 Jul 2019 07:34:46 GMT"}], "update_date": "2019-07-26", "authors_parsed": [["Del Corso", "Gianna M.", ""], ["Poloni", "Federico", ""], ["Robol", "Leonardo", ""], ["Vandebril", "Raf", ""]]}, {"id": "1811.05893", "submitter": "Lassi Paunonen", "authors": "Lassi Paunonen and Duy Phan", "title": "Reduced Order Controller Design for Robust Output Regulation", "comments": "Revised version with minor improvements and corrections. 28 pages, 9\n  figures. Accepted for publication in the IEEE Transactions on Automatic\n  Control", "journal-ref": "IEEE Transactions on Automatic Control 65(6):2480-2493, 2020", "doi": "10.1109/TAC.2019.2930185", "report-no": null, "categories": "math.OC cs.NA math.AP math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study robust output regulation for parabolic partial differential\nequations and other infinite-dimensional linear systems with analytic\nsemigroups. As our main results we show that robust output tracking and\ndisturbance rejection for our class of systems can be achieved using a\nfinite-dimensional controller and present algorithms for construction of two\ndifferent internal model based robust controllers. The controller parameters\nare chosen based on a Galerkin approximation of the original PDE system and\nemploy balanced truncation to reduce the orders of the controllers. In the\nsecond part of the paper we design controllers for robust output tracking and\ndisturbance rejection for a 1D reaction-diffusion equation with boundary\ndisturbances, a 2D diffusion-convection equation, and a 1D beam equation with\nKelvin-Voigt damping.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2018 16:33:09 GMT"}, {"version": "v2", "created": "Sat, 20 Jul 2019 09:08:50 GMT"}], "update_date": "2021-04-19", "authors_parsed": [["Paunonen", "Lassi", ""], ["Phan", "Duy", ""]]}, {"id": "1811.05919", "submitter": "Simon Vary", "authors": "Jared Tanner and Andrew Thompson and Simon Vary", "title": "Matrix rigidity and the ill-posedness of Robust PCA and matrix\n  completion", "comments": "19 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.IT cs.NA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Robust Principal Component Analysis (PCA) (Candes et al., 2011) and low-rank\nmatrix completion (Recht et al., 2010) are extensions of PCA to allow for\noutliers and missing entries respectively. It is well-known that solving these\nproblems requires a low coherence between the low-rank matrix and the canonical\nbasis, since in the extreme cases -- when the low-rank matrix we wish to\nrecover is also sparse -- there is an inherent ambiguity. However, the\nwell-posedness issue in both problems is an even more fundamental one: in some\ncases, both Robust PCA and matrix completion can fail to have any solutions at\ndue to the set of low-rank plus sparse matrices not being closed, which in turn\nis equivalent to the notion of the matrix rigidity function not being lower\nsemicontinuous (Kumar et al., 2014). By constructing infinite families of\nmatrices, we derive bounds on the rank and sparsity such that the set of\nlow-rank plus sparse matrices is not closed. We also demonstrate numerically\nthat a wide range of non-convex algorithms for both Robust PCA and matrix\ncompletion have diverging components when applied to our constructed matrices.\nAn analogy can be drawn to the case of sets of higher order tensors not being\nclosed under canonical polyadic (CP) tensor rank, rendering the best low-rank\ntensor approximation unsolvable (De Silva and Lim, 2008) and hence encourage\nthe use of multilinear tensor rank (De Lathauwer, 2000).\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2018 17:27:24 GMT"}, {"version": "v2", "created": "Thu, 11 Jul 2019 10:50:47 GMT"}], "update_date": "2019-07-12", "authors_parsed": [["Tanner", "Jared", ""], ["Thompson", "Andrew", ""], ["Vary", "Simon", ""]]}, {"id": "1811.06033", "submitter": "Ansgar J\\\"ungel", "authors": "Ansgar J\\\"ungel, Ulisse Stefanelli, and Lara Trussardi", "title": "Two structure-preserving time discretizations for gradient flows", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The equality between dissipation and energy drop is a structural property of\ngradient-flow dynamics. The classical implicit Euler scheme fails to reproduce\nthis equality at the discrete level. We discuss two modifications of the Euler\nscheme satisfying an exact energy equality at the discrete level. Existence of\ndiscrete solutions and their convergence as the fineness of the partition goes\nto zero are discussed. Eventually, we address extensions to generalized\ngradient flows, GENERIC flows, and curves of maximal slope in metric spaces.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2018 19:56:59 GMT"}, {"version": "v2", "created": "Tue, 27 Aug 2019 09:15:37 GMT"}], "update_date": "2019-08-28", "authors_parsed": [["Jüngel", "Ansgar", ""], ["Stefanelli", "Ulisse", ""], ["Trussardi", "Lara", ""]]}, {"id": "1811.06301", "submitter": "Robert N\\\"urnberg", "authors": "John W. Barrett, Harald Garcke, Robert N\\\"urnberg", "title": "Stable discretizations of elastic flow in Riemannian manifolds", "comments": "Minor revision. 31 pages, 6 figures. This article is closely related\n  to arXiv:1809.01973", "journal-ref": "SIAM J. Numer. Anal. 57 (2019) 1987--2018", "doi": "10.1137/18M1227111", "report-no": null, "categories": "math.NA cs.NA math.DG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The elastic flow, which is the $L^2$-gradient flow of the elastic energy, has\nseveral applications in geometry and elasticity theory. We present stable\ndiscretizations for the elastic flow in two-dimensional Riemannian manifolds\nthat are conformally flat, i.e.\\ conformally equivalent to the Euclidean space.\nExamples include the hyperbolic plane, the hyperbolic disk, the elliptic plane\nas well as any conformal parameterization of a two-dimensional manifold in\n${\\mathbb R}^d$, $d\\geq 3$. Numerical results show the robustness of the\nmethod, as well as quadratic convergence with respect to the space\ndiscretization.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2018 11:43:57 GMT"}, {"version": "v2", "created": "Sat, 24 Nov 2018 13:47:43 GMT"}, {"version": "v3", "created": "Fri, 14 Jun 2019 14:04:52 GMT"}], "update_date": "2019-11-01", "authors_parsed": [["Barrett", "John W.", ""], ["Garcke", "Harald", ""], ["Nürnberg", "Robert", ""]]}, {"id": "1811.06569", "submitter": "Elizabeth Newman", "authors": "Elizabeth Newman, Lior Horesh, Haim Avron, Misha Kilmer", "title": "Stable Tensor Neural Networks for Rapid Deep Learning", "comments": "20 pages, 6 figures, submitted to SIMODS", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NA math.NA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a tensor neural network ($t$-NN) framework that offers an exciting\nnew paradigm for designing neural networks with multidimensional (tensor) data.\nOur network architecture is based on the $t$-product (Kilmer and Martin, 2011),\nan algebraic formulation to multiply tensors via circulant convolution. In this\n$t$-product algebra, we interpret tensors as $t$-linear operators analogous to\nmatrices as linear operators, and hence our framework inherits mimetic matrix\nproperties. To exemplify the elegant, matrix-mimetic algebraic structure of our\n$t$-NNs, we expand on recent work (Haber and Ruthotto, 2017) which interprets\ndeep neural networks as discretizations of non-linear differential equations\nand introduces stable neural networks which promote superior generalization.\nMotivated by this dynamic framework, we introduce a stable $t$-NN which\nfacilitates more rapid learning because of its reduced, more powerful\nparameterization. Through our high-dimensional design, we create a more compact\nparameter space and extract multidimensional correlations otherwise latent in\ntraditional algorithms. We further generalize our $t$-NN framework to a family\nof tensor-tensor products (Kernfeld, Kilmer, and Aeron, 2015) which still\ninduce a matrix-mimetic algebraic structure. Through numerical experiments on\nthe MNIST and CIFAR-10 datasets, we demonstrate the more powerful\nparameterizations and improved generalizability of stable $t$-NNs.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2018 19:37:24 GMT"}], "update_date": "2018-11-19", "authors_parsed": [["Newman", "Elizabeth", ""], ["Horesh", "Lior", ""], ["Avron", "Haim", ""], ["Kilmer", "Misha", ""]]}, {"id": "1811.06620", "submitter": "Ben Vadala-Roth", "authors": "Ben Vadala-Roth, Shashank Acharya, Neelesh A Patankar, Simone Rossi,\n  Boyce E Griffith", "title": "Stabilization approaches for the hyperelastic immersed boundary method\n  for problems of large-deformation incompressible elasticity", "comments": "Extensive revisions", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The immersed boundary method is a mathematical framework for modeling\nfluid-structure interaction. This formulation describes the momentum,\nviscosity, and incompressibility of the fluid-structure system in Eulerian\nform, and it uses Lagrangian coordinates to describe the structural\ndeformations, stresses, and resultant forces. Integral transforms with Dirac\ndelta function kernels connect the Eulerian and Lagrangian frames. The fluid\nand the structure are both typically treated as incompressible materials. Upon\ndiscretization, however, the incompressibility of the structure is only\nmaintained approximately. To obtain an immersed method for incompressible\nhyperelastic structures that is robust under large structural deformations, we\nintroduce a volumetric energy in the solid region that stabilizes the\nformulation and improves the accuracy of the numerical scheme. This formulation\naugments the discrete Lagrange multiplier for the incompressibility constraint,\nthereby improving the original method's accuracy. This volumetric energy is\nincorporated by decomposing the strain energy into isochoric and dilatational\ncomponents, as in standard solid mechanics formulations of nearly\nincompressible elasticity. We study the performance of the stabilized method\nusing several quasi-static solid mechanics benchmarks, a dynamic\nfluid-structure interaction benchmark, and a detailed three-dimensional model\nof esophageal transport. The accuracy achieved by the stabilized immersed\nformulation is comparable to that of a stabilized finite element method for\nincompressible elasticity using similar numbers of structural degrees of\nfreedom.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2018 23:07:03 GMT"}, {"version": "v2", "created": "Sun, 10 Mar 2019 03:35:56 GMT"}, {"version": "v3", "created": "Mon, 25 Nov 2019 22:39:02 GMT"}, {"version": "v4", "created": "Tue, 25 Feb 2020 05:52:17 GMT"}], "update_date": "2020-02-26", "authors_parsed": [["Vadala-Roth", "Ben", ""], ["Acharya", "Shashank", ""], ["Patankar", "Neelesh A", ""], ["Rossi", "Simone", ""], ["Griffith", "Boyce E", ""]]}, {"id": "1811.06721", "submitter": "Tim Jahn", "authors": "Bastian Harrach, Tim Jahn, and Roland Potthast", "title": "Beyond the Bakushinskii veto: Regularising linear inverse problems\n  without knowing the noise distribution", "comments": "22 pages, 3 figures", "journal-ref": "Numer. Math. 145 (3), 581-603, 2020", "doi": "10.1007/s00211-020-01122-2", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article deals with the solution of linear ill-posed equations in Hilbert\nspaces. Often, one only has a corrupted measurement of the right hand side at\nhand and the Bakushinskii veto tells us, that we are not able to solve the\nequation if we do not know the noise level. But in applications it is ad hoc\nunrealistic to know the error of a measurement. In practice, the error of a\nmeasurement may often be estimated through averaging of multiple measurements.\nWe integrated that in our anlaysis and obtained convergence to the true\nsolution, with the only assumption that the measurements are unbiased,\nindependent and identically distributed according to an unknown distribution.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2018 09:32:26 GMT"}, {"version": "v2", "created": "Wed, 24 Jul 2019 06:06:40 GMT"}, {"version": "v3", "created": "Thu, 25 Jul 2019 06:05:20 GMT"}, {"version": "v4", "created": "Thu, 19 Dec 2019 09:59:07 GMT"}, {"version": "v5", "created": "Wed, 25 Mar 2020 07:56:37 GMT"}], "update_date": "2020-07-07", "authors_parsed": [["Harrach", "Bastian", ""], ["Jahn", "Tim", ""], ["Potthast", "Roland", ""]]}, {"id": "1811.06724", "submitter": "Gang Chen", "authors": "Gang Chen, Weifeng Qiu, Liwei Xu", "title": "Analysis of an interior penalty DG method for the quad-curl problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The quad-curl term is an essential part of the resistive magnetohydrodynamic\n(MHD) equation and the fourth order inverse electromagnetic scattering problem,\nwhich are both of great significance in science and engineering. It is\ndesirable to develop efficient and practical numerical methods for the\nquad-curl problem. In this paper, we first present some new regularity results\nfor the quad-curl problem on Lipschitz polyhedron domains and then propose a\nmixed finite element method for solving the quad-curl problem. With a {\\em\nnovel} discrete Sobolev imbedding inequality for the piecewise polynomials, we\nobtain stability results and derive error estimates based on a relatively low\nregularity assumption of the exact solution.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2018 09:37:36 GMT"}, {"version": "v2", "created": "Mon, 19 Nov 2018 02:22:51 GMT"}, {"version": "v3", "created": "Thu, 22 Nov 2018 06:03:09 GMT"}, {"version": "v4", "created": "Tue, 4 Dec 2018 02:45:55 GMT"}, {"version": "v5", "created": "Sun, 19 May 2019 00:31:37 GMT"}, {"version": "v6", "created": "Wed, 22 May 2019 01:53:32 GMT"}, {"version": "v7", "created": "Sat, 22 Feb 2020 07:01:08 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Chen", "Gang", ""], ["Qiu", "Weifeng", ""], ["Xu", "Liwei", ""]]}, {"id": "1811.06838", "submitter": "Arin Chaudhuri", "authors": "Arin Chaudhuri, Carol Sadek, Deovrat Kakde, Wenhao Hu, Hansi Jiang,\n  Seunghyun Kong, Yuewei Liao, Sergiy Peredriy and Haoyu Wang", "title": "The Trace Criterion for Kernel Bandwidth Selection for Support Vector\n  Data Description", "comments": "note: some text overlap with arXiv:1708.05106 because common\n  background material is covered in both papers", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Support vector data description (SVDD) is a popular anomaly detection\ntechnique. The SVDD classifier partitions the whole data space into an inlier\nregion, which consists of the region near the training data, and an outlier\nregion, which consists of points away from the training data. The computation\nof the SVDD classifier requires a kernel function, for which the Gaussian\nkernel is a common choice. The Gaussian kernel has a bandwidth parameter, and\nit is important to set the value of this parameter correctly for good results.\nA small bandwidth leads to overfitting such that the resulting SVDD classifier\noverestimates the number of anomalies, whereas a large bandwidth leads to\nunderfitting and an inability to detect many anomalies. In this paper, we\npresent a new unsupervised method for selecting the Gaussian kernel bandwidth.\nOur method exploits a low-rank representation of the kernel matrix to suggest a\nkernel bandwidth value. Our new technique is competitive with the current state\nof the art for low-dimensional data and performs extremely well for many\nclasses of high-dimensional data. Because the mathematical formulation of SVDD\nis identical with the mathematical formulation of one-class support vector\nmachines (OCSVM) when the Gaussian kernel is used, our method is equally\napplicable to Gaussian kernel bandwidth tuning for OCSVM.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2018 14:16:21 GMT"}, {"version": "v2", "created": "Sat, 1 Feb 2020 00:28:44 GMT"}, {"version": "v3", "created": "Wed, 5 Feb 2020 20:43:09 GMT"}], "update_date": "2020-02-07", "authors_parsed": [["Chaudhuri", "Arin", ""], ["Sadek", "Carol", ""], ["Kakde", "Deovrat", ""], ["Hu", "Wenhao", ""], ["Jiang", "Hansi", ""], ["Kong", "Seunghyun", ""], ["Liao", "Yuewei", ""], ["Peredriy", "Sergiy", ""], ["Wang", "Haoyu", ""]]}, {"id": "1811.07546", "submitter": "Takashi Goda", "authors": "Takashi Goda, Tomohiko Hironaka, Takeru Iwamoto", "title": "Multilevel Monte Carlo estimation of expected information gains", "comments": null, "journal-ref": "Stochastic Analysis and Applications, Volume 38, Issue 4, 581-600,\n  2020", "doi": "10.1080/07362994.2019.1705168", "report-no": null, "categories": "stat.CO cs.NA math.NA stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The expected information gain is an important quality criterion of Bayesian\nexperimental designs, which measures how much the information entropy about\nuncertain quantity of interest $\\theta$ is reduced on average by collecting\nrelevant data $Y$. However, estimating the expected information gain has been\nconsidered computationally challenging since it is defined as a nested\nexpectation with an outer expectation with respect to $Y$ and an inner\nexpectation with respect to $\\theta$. In fact, the standard, nested Monte Carlo\nmethod requires a total computational cost of $O(\\varepsilon^{-3})$ to achieve\na root-mean-square accuracy of $\\varepsilon$. In this paper we develop an\nefficient algorithm to estimate the expected information gain by applying a\nmultilevel Monte Carlo (MLMC) method. To be precise, we introduce an antithetic\nMLMC estimator for the expected information gain and provide a sufficient\ncondition on the data model under which the antithetic property of the MLMC\nestimator is well exploited such that optimal complexity of\n$O(\\varepsilon^{-2})$ is achieved. Furthermore, we discuss how to incorporate\nimportance sampling techniques within the MLMC estimator to avoid arithmetic\nunderflow. Numerical experiments show the considerable computational cost\nsavings compared to the nested Monte Carlo method for a simple test case and a\nmore realistic pharmacokinetic model.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2018 08:11:28 GMT"}, {"version": "v2", "created": "Thu, 24 Jan 2019 05:09:04 GMT"}, {"version": "v3", "created": "Thu, 23 May 2019 08:29:38 GMT"}, {"version": "v4", "created": "Mon, 7 Oct 2019 03:34:12 GMT"}, {"version": "v5", "created": "Fri, 6 Dec 2019 03:38:05 GMT"}], "update_date": "2020-06-11", "authors_parsed": [["Goda", "Takashi", ""], ["Hironaka", "Tomohiko", ""], ["Iwamoto", "Takeru", ""]]}, {"id": "1811.07624", "submitter": "Cristian Rusu", "authors": "Cristian Rusu", "title": "Approximate Eigenvalue Decompositions of Linear Transformations with a\n  Few Householder Reflectors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.DS cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ability to decompose a signal in an orthonormal basis (a set of\northogonal components, each normalized to have unit length) using a fast\nnumerical procedure rests at the heart of many signal processing methods and\napplications. The classic examples are the Fourier and wavelet transforms that\nenjoy numerically efficient implementations (FFT and FWT, respectively).\nUnfortunately, orthonormal transformations are in general unstructured, and\ntherefore they do not enjoy low computational complexity properties. In this\npaper, based on Householder reflectors, we introduce a class of orthonormal\nmatrices that are numerically efficient to manipulate: we control the\ncomplexity of matrix-vector multiplications with these matrices using a given\nparameter. We provide numerical algorithms that approximate any orthonormal or\nsymmetric transform with a new orthonormal or symmetric structure made up of\nproducts of a given number of Householder reflectors. We show analyses and\nnumerical evidence to highlight the accuracy of the proposed approximations and\nprovide an application to the case of learning fast Mahanalobis distance metric\ntransformations.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2018 11:34:16 GMT"}, {"version": "v2", "created": "Wed, 23 Oct 2019 12:19:05 GMT"}], "update_date": "2019-10-24", "authors_parsed": [["Rusu", "Cristian", ""]]}, {"id": "1811.07816", "submitter": "James Jackaman", "authors": "James Jackaman and Tristan Pryer", "title": "Quasinorms in semilinear elliptic problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note we examine the a priori and a posteriori analysis of\ndiscontinuous Galerkin finite element discretisations of semilinear elliptic\nPDEs with polynomial nonlinearity. We show that optimal a priori error bounds\nin the energy norm are only possible for low order elements using classical a\npriori error analysis techniques. We make use of appropriate quasinorms that\nresults in optimal energy norm error control.\n  We show that, contrary to the a priori case, a standard a posteriori analysis\nyields optimal upper bounds and does not require the introduction of\nquasinorms. We also summarise extensive numerical experiments verifying the\nanalysis presented and examining the appearance of layers in the solution.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2018 17:25:57 GMT"}, {"version": "v2", "created": "Mon, 25 Feb 2019 21:23:07 GMT"}, {"version": "v3", "created": "Sat, 27 Jul 2019 17:11:47 GMT"}], "update_date": "2019-07-30", "authors_parsed": [["Jackaman", "James", ""], ["Pryer", "Tristan", ""]]}, {"id": "1811.08195", "submitter": "Noe Caruso", "authors": "Noe Caruso, Alessandro Michelangeli, Paolo Novati", "title": "On general convergence behaviours of finite-dimensional approximants for\n  abstract linear inverse problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.FA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the framework of abstract linear inverse problems in infinitedimensional\nHilbert space we discuss generic convergence behaviours of approximate\nsolutions determined by means of general projection methods, namely outside the\nstandard assumptions of Petrov-Galerkin truncation schemes. This includes a\ndiscussion of the mechanisms why the error or the residual generically fail to\nvanish in norm, and the identification of practically plausible sufficient\nconditions for such indicators to be small in some weaker sense. The\npresentation is based on theoretical results together with a series of model\nexamples and numerical tests.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2018 11:54:22 GMT"}, {"version": "v2", "created": "Fri, 8 Jan 2021 10:03:46 GMT"}, {"version": "v3", "created": "Fri, 19 Feb 2021 11:09:22 GMT"}], "update_date": "2021-02-22", "authors_parsed": [["Caruso", "Noe", ""], ["Michelangeli", "Alessandro", ""], ["Novati", "Paolo", ""]]}, {"id": "1811.08202", "submitter": "Noe Caruso", "authors": "Noe Caruso, Alessandro Michelangeli, Paolo Novati", "title": "On Krylov solutions to infinite-dimensional inverse linear problems", "comments": "To appear in Calcolo (2019)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.FA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss, in the context of inverse linear problems in Hilbert space, the\nnotion of the associated infinite-dimensional Krylov subspace and we produce\nnecessary and sufficient conditions for the Krylov-solvability of a given\ninverse problem, together with a series of model examples and numerical\nexperiments.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2018 12:05:09 GMT"}, {"version": "v2", "created": "Tue, 27 Aug 2019 11:23:42 GMT"}], "update_date": "2019-08-28", "authors_parsed": [["Caruso", "Noe", ""], ["Michelangeli", "Alessandro", ""], ["Novati", "Paolo", ""]]}, {"id": "1811.08597", "submitter": "Maboud Kaloorazi", "authors": "Maboud F. Kaloorazi, and Rodrigo C. de Lamare", "title": "Randomized Rank-Revealing UZV Decomposition for Low-Rank Approximation\n  of Matrices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA eess.SP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Low-rank matrix approximation plays an increasingly important role in signal\nand image processing applications. This paper presents a new rank-revealing\ndecomposition method called randomized rank-revealing UZV decomposition\n(RRR-UZVD). RRR-UZVD is powered by randomization to approximate a low-rank\ninput matrix. Given a large and dense matrix ${\\bf A} \\in \\mathbb R^{m \\times\nn}$ whose numerical rank is $k$, where $k$ is much smaller than $m$ and $n$,\nRRR-UZVD constructs an approximation $\\hat{\\bf A}$ such as $\\hat{\\bf A}={\\bf\nUZV}^T$, where ${\\bf U}$ and ${\\bf V}$ have orthonormal columns, the\nleading-diagonal block of ${\\bf Z}$ reveals the rank of $\\bf A$, and its\noff-diagonal blocks have small $\\ell_2$-norms. RRR-UZVD is simple, accurate,\nand only requires a few passes through $\\bf A$ with an arithmetic cost of\n$O(mnk)$ floating-point operations. To demonstrate the effectiveness of the\nproposed method, we conduct experiments on synthetic data, as well as real data\nin applications of image reconstruction and robust principal component\nanalysis.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2018 04:50:02 GMT"}], "update_date": "2018-11-22", "authors_parsed": [["Kaloorazi", "Maboud F.", ""], ["de Lamare", "Rodrigo C.", ""]]}, {"id": "1811.08631", "submitter": "Marco Tezzele", "authors": "Fabrizio Garotta, Nicola Demo, Marco Tezzele, Massimo Carraturo,\n  Alessandro Reali and Gianluigi Rozza", "title": "Reduced Order Isogeometric Analysis Approach for PDEs in Parametrized\n  Domains", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-030-48721-8_7", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this contribution, we coupled the isogeometric analysis to a reduced order\nmodelling technique in order to provide a computationally efficient solution in\nparametric domains. In details, we adopt the free-form deformation method to\nobtain the parametric formulation of the domain and proper orthogonal\ndecomposition with interpolation for the computational reduction of the model.\nThis technique provides a real-time solution for any parameter by combining\nseveral solutions, in this case computed using isogeometric analysis on\ndifferent geometrical configurations of the domain, properly mapped into a\nreference configuration. We underline that this reduced order model requires\nonly the full-order solutions, making this approach non-intrusive. We present\nin this work the results of the application of this methodology to a heat\nconduction problem inside a deformable collector pipe.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2018 08:36:12 GMT"}, {"version": "v2", "created": "Fri, 19 Jun 2020 10:20:30 GMT"}], "update_date": "2020-11-23", "authors_parsed": [["Garotta", "Fabrizio", ""], ["Demo", "Nicola", ""], ["Tezzele", "Marco", ""], ["Carraturo", "Massimo", ""], ["Reali", "Alessandro", ""], ["Rozza", "Gianluigi", ""]]}, {"id": "1811.08751", "submitter": "Michael Roberts", "authors": "Michael Roberts and Jack Spencer", "title": "Chan-Vese Reformulation for Selective Image Segmentation", "comments": "To appear in the Journal of Mathematical Imaging and Vision 2019. (23\n  pages, 19 figures)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Selective segmentation involves incorporating user input to partition an\nimage into foreground and background, by discriminating between objects of a\nsimilar type. Typically, such methods involve introducing additional\nconstraints to generic segmentation approaches. However, we show that this is\noften inconsistent with respect to common assumptions about the image. The\nproposed method introduces a new fitting term that is more useful in practice\nthan the Chan-Vese framework. In particular, the idea is to define a term that\nallows for the background to consist of multiple regions of inhomogeneity. We\nprovide comparitive experimental results to alternative approaches to\ndemonstrate the advantages of the proposed method, broadening the possible\napplication of these methods.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2018 14:29:14 GMT"}, {"version": "v2", "created": "Fri, 5 Jul 2019 18:44:26 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Roberts", "Michael", ""], ["Spencer", "Jack", ""]]}, {"id": "1811.09194", "submitter": "Garth Wells", "authors": "Sander Rhebergen and Garth N. Wells", "title": "An embedded--hybridized discontinuous Galerkin finite element method for\n  the Stokes equations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present and analyze a new embedded--hybridized discontinuous Galerkin\nfinite element method for the Stokes problem. The method has the attractive\nproperties of full hybridized methods, namely an $H({\\rm div})$-conforming\nvelocity field, pointwise satisfaction of the continuity equation and \\emph{a\npriori} error estimates for the velocity that are independent of the pressure.\nThe embedded--hybridized formulation has advantages over a full hybridized\nformulation in that it has fewer global degrees-of-freedom for a given mesh and\nthe algebraic structure of the resulting linear system is better suited to fast\niterative solvers. The analysis results are supported by a range of numerical\nexamples that demonstrate rates of convergence, and which show computational\nefficiency gains over a full hybridized formulation.\n", "versions": [{"version": "v1", "created": "Thu, 22 Nov 2018 14:36:33 GMT"}, {"version": "v2", "created": "Wed, 18 Sep 2019 13:47:31 GMT"}], "update_date": "2019-09-19", "authors_parsed": [["Rhebergen", "Sander", ""], ["Wells", "Garth N.", ""]]}, {"id": "1811.09358", "submitter": "Li Shen", "authors": "Fangyu Zou, Li Shen, Zequn Jie, Weizhong Zhang and Wei Liu", "title": "A Sufficient Condition for Convergences of Adam and RMSProp", "comments": "Accepted by CVPR2019 as an Oral presentation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CV cs.NA math.OC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adam and RMSProp are two of the most influential adaptive stochastic\nalgorithms for training deep neural networks, which have been pointed out to be\ndivergent even in the convex setting via a few simple counterexamples. Many\nattempts, such as decreasing an adaptive learning rate, adopting a big batch\nsize, incorporating a temporal decorrelation technique, seeking an analogous\nsurrogate, etc., have been tried to promote Adam/RMSProp-type algorithms to\nconverge. In contrast with existing approaches, we introduce an alternative\neasy-to-check sufficient condition, which merely depends on the parameters of\nthe base learning rate and combinations of historical second-order moments, to\nguarantee the global convergence of generic Adam/RMSProp for solving\nlarge-scale non-convex stochastic optimization. Moreover, we show that the\nconvergences of several variants of Adam, such as AdamNC, AdaEMA, etc., can be\ndirectly implied via the proposed sufficient condition in the non-convex\nsetting. In addition, we illustrate that Adam is essentially a specifically\nweighted AdaGrad with exponential moving average momentum, which provides a\nnovel perspective for understanding Adam and RMSProp. This observation coupled\nwith this sufficient condition gives much deeper interpretations on their\ndivergences. At last, we validate the sufficient condition by applying Adam and\nRMSProp to tackle a certain counterexample and train deep neural networks.\nNumerical results are exactly in accord with our theoretical analysis.\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2018 04:26:47 GMT"}, {"version": "v2", "created": "Fri, 12 Apr 2019 08:59:14 GMT"}, {"version": "v3", "created": "Tue, 25 Jun 2019 03:39:53 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Zou", "Fangyu", ""], ["Shen", "Li", ""], ["Jie", "Zequn", ""], ["Zhang", "Weizhong", ""], ["Liu", "Wei", ""]]}, {"id": "1811.09446", "submitter": "Richard Brown", "authors": "Richard D. Brown, Johnathan M. Bardsley, and Tiangang Cui", "title": "Semivariogram methods for modeling Whittle-Mat\\'ern priors in Bayesian\n  inverse problems", "comments": null, "journal-ref": "Inverse Problems 36 055006 (2020)", "doi": "10.1088/1361-6420/ab762e", "report-no": null, "categories": "math.NA cs.NA stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new technique, based on semivariogram methodology, for obtaining\npoint estimates for use in prior modeling for solving Bayesian inverse\nproblems. This method requires a connection between Gaussian processes with\ncovariance operators defined by the Mat\\'ern covariance function and Gaussian\nprocesses with precision (inverse-covariance) operators defined by the Green's\nfunctions of a class of elliptic stochastic partial differential equations\n(SPDEs). We present a detailed mathematical description of this connection. We\nwill show that there is an equivalence between these two Gaussian processes\nwhen the domain is infinite -- for us, $\\mathbb{R}^2$ -- which breaks down when\nthe domain is finite due to the effect of boundary conditions on Green's\nfunctions of PDEs. We show how this connection can be re-established using\nextended domains. We then introduce the semivariogram method for estimating the\nMat\\'ern covariance parameters, which specify the Gaussian prior needed for\nstabilizing the inverse problem. Results are extended from the isotropic case\nto the anisotropic case where the correlation length in one direction is larger\nthan another. Finally, we consider the situation where the correlation length\nis spatially dependent rather than constant. We implement each method in\ntwo-dimensional image inpainting test cases to show that it works on practical\nexamples.\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2018 12:12:46 GMT"}, {"version": "v2", "created": "Wed, 20 Nov 2019 23:59:55 GMT"}, {"version": "v3", "created": "Sat, 9 May 2020 21:32:30 GMT"}], "update_date": "2020-05-12", "authors_parsed": [["Brown", "Richard D.", ""], ["Bardsley", "Johnathan M.", ""], ["Cui", "Tiangang", ""]]}, {"id": "1811.09527", "submitter": "Marcus Webb", "authors": "Marcus Webb, Vincent Copp\\'e, Daan Huybrechs", "title": "Pointwise and uniform convergence of Fourier extensions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fourier series approximations of continuous but nonperiodic functions on an\ninterval suffer the Gibbs phenomenon, which means there is a permanent\noscillatory overshoot in the neighbourhoods of the endpoints. Fourier\nextensions circumvent this issue by approximating the function using a Fourier\nseries which is periodic on a larger interval. Previous results on the\nconvergence of Fourier extensions have focused on the error in the L2 norm, but\nin this paper we analyze pointwise and uniform convergence of Fourier\nextensions (formulated as the best approximation in the L2 norm). We show that\nthe pointwise convergence of Fourier extensions is more similar to Legendre\nseries than classical Fourier series. In particular, unlike classical Fourier\nseries, Fourier extensions yield pointwise convergence at the endpoints of the\ninterval. Similar to Legendre series, pointwise convergence at the endpoints is\nslower by an algebraic order of a half compared to that in the interior. The\nproof is conducted by an analysis of the associated Lebesgue function, and\nJackson- and Bernstein-type theorems for Fourier extensions. Numerical\nexperiments are provided. We conclude the paper with open questions regarding\nthe regularized and oversampled least squares interpolation versions of Fourier\nextensions.\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2018 15:55:41 GMT"}, {"version": "v2", "created": "Wed, 11 Sep 2019 15:35:05 GMT"}], "update_date": "2019-09-12", "authors_parsed": [["Webb", "Marcus", ""], ["Coppé", "Vincent", ""], ["Huybrechs", "Daan", ""]]}, {"id": "1811.09592", "submitter": "Elias Jarlebring", "authors": "Elias Jarlebring and Max Bennedich and Giampaolo Mele and Emil Ringh\n  and Parikshit Upadhyaya", "title": "NEP-PACK: A Julia package for nonlinear eigenproblems - v0.2", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present NEP-PACK a novel open-source library for the solution of nonlinear\neigenvalue problems (NEPs). The package provides a framework to represent NEPs,\nas well as efficient implementations of many state-of-the-art algorithms. The\npackage makes full use of the efficiency of Julia, yet maintains usability, and\nintegrates well with other software packages. The package is designed to be\neasy to use for application researchers as well as algorithm developers.\nParticular attention is paid to algorithm neutrality, in order to make\nperformance comparisons between algorithms easier. This paper describes the\nmain functionality of NEP-PACK, as well as design decisions and theory needed\nfor the design.\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2018 18:41:29 GMT"}], "update_date": "2018-11-26", "authors_parsed": [["Jarlebring", "Elias", ""], ["Bennedich", "Max", ""], ["Mele", "Giampaolo", ""], ["Ringh", "Emil", ""], ["Upadhyaya", "Parikshit", ""]]}, {"id": "1811.09999", "submitter": "James Jackaman", "authors": "James Jackaman and Tristan Pryer", "title": "Conservative Galerkin methods for dispersive Hamiltonian problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An energy conservative discontinuous Galerkin scheme for a generalised third\norder KdV type equation is designed. Based on the conservation principle, we\npropose techniques that allow for the derivation of optimal a priori bounds for\nthe linear KdV equation and a posteriori bounds for the linear and modified KdV\nequation. Extensive numerical experiments showcasing the good long time\nbehaviour of the scheme are summarised which are in agreement with the analysis\nproposed.\n", "versions": [{"version": "v1", "created": "Sun, 25 Nov 2018 12:51:37 GMT"}, {"version": "v2", "created": "Tue, 31 Dec 2019 17:22:40 GMT"}, {"version": "v3", "created": "Sat, 12 Jun 2021 15:21:07 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Jackaman", "James", ""], ["Pryer", "Tristan", ""]]}, {"id": "1811.10274", "submitter": "Eva Darulova", "authors": "Eva Darulova, Anastasia Volkova", "title": "Sound Approximation of Programs with Elementary Functions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.MS cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Elementary function calls are a common feature in numerical programs. While\ntheir implementions in library functions are highly optimized, their\ncomputation is nonetheless very expensive compared to plain arithmetic. Full\naccuracy is, however, not always needed. Unlike arithmetic, where the\nperformance difference between for example single and double precision\nfloating-point arithmetic is relatively small, elementary function calls\nprovide a much richer tradeoff space between accuracy and efficiency.\nNavigating this space is challenging. First, generating approximations of\nelementary function calls which are guaranteed to satisfy accuracy error bounds\nis highly nontrivial. Second, the performance of such approximations generally\ndepends on several parameters which are unintuitive to choose manually,\nespecially for non-experts.\n  We present a fully automated approach and tool which approximates elementary\nfunction calls inside small programs while guaranteeing overall user provided\nerror bounds. Our tool leverages existing techniques for roundoff error\ncomputation and approximation of individual elementary function calls, and\nprovides automated selection of many parameters. Our experiments show that\nsignificant efficiency improvements are possible in exchange for reduced, but\nguaranteed, accuracy.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2018 10:30:04 GMT"}], "update_date": "2018-11-27", "authors_parsed": [["Darulova", "Eva", ""], ["Volkova", "Anastasia", ""]]}, {"id": "1811.10373", "submitter": "Ettore Vidotto", "authors": "Ettore Vidotto, Timo Koch, Tobias K\\\"oppl, Rainer Helmig and Barbara\n  Wohlmuth", "title": "Hybrid models for simulating blood flow in microvascular networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we are concerned with the simulation of blood flow in\nmicrovascular networks and the surrounding tissue. To reduce the computational\ncomplexity of this issue, the network structures are modeled by a\none-dimensional graph, whose location in space is determined by the centerlines\nof the three-dimensional vessels. The surrounding tissue is considered as a\nhomogeneous porous medium. Darcy's equation is used to simulate flow in the\nextra-vascular space, where the mass exchange with the blood vessels is\naccounted for by means of line source terms. However, this model reduction\napproach still causes high computational costs, in particular, when larger\nparts of an organ have to be simulated. This observation motivates the\nconsideration of a further model reduction step. Thereby, we homogenize the\nfine scale structures of the microvascular networks resulting in a new hybrid\napproach modeling the fine scale structures as a heterogeneous porous medium\nand the flow in the larger vessels by one-dimensional flow equations. Both\nmodeling approaches are compared with respect to mass fluxes and averaged\npressures. The simulations have been performed on a microvascular network that\nhas been extracted from the cortex of a rat brain.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2018 14:06:09 GMT"}, {"version": "v2", "created": "Thu, 27 Jun 2019 10:50:08 GMT"}], "update_date": "2019-06-28", "authors_parsed": [["Vidotto", "Ettore", ""], ["Koch", "Timo", ""], ["Köppl", "Tobias", ""], ["Helmig", "Rainer", ""], ["Wohlmuth", "Barbara", ""]]}, {"id": "1811.10486", "submitter": "Krzysztof Domino", "authors": "Krzysztof Domino", "title": "Selected Methods for non-Gaussian Data Analysis", "comments": "ISBN: 978-83-926054-3-0", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The basic goal of computer engineering is the analysis of data. Such data are\noften large data sets distributed according to various distribution models. In\nthis manuscript we focus on the analysis of non-Gaussian distributed data. In\nthe case of univariate data analysis we discuss stochastic processes with\nauto-correlated increments and univariate distributions derived from specific\nstochastic processes, i.e. Levy and Tsallis distributions. Deep investigation\nof multivariate non-Gaussian distributions requires the copula approach. A\ncopula is an component of multivariate distribution that models the mutual\ninterdependence between marginals. There are many copula families characterised\nby various measures of the dependence between marginals. Importantly, one of\nthose are `tail' dependencies that model the simultaneous appearance of extreme\nvalues in many marginals. Those extreme events may reflect a crisis given\nfinancial data, outliers in machine learning, or a traffic congestion. Next we\ndiscuss higher order multivariate cumulants that are non-zero if multivariate\ndistribution is non-Gaussian. However, the relation between cumulants and\ncopulas is not straight forward and rather complicated. We discuss the\napplication of those cumulants to extract information about non-Gaussian\nmultivariate distributions, such that information about non-Gaussian copulas.\nThe use of higher order multivariate cumulants in computer science is inspired\nby financial data analysis, especially by the safe investment portfolio\nevaluation. There are many other applications of higher order multivariate\ncumulants in data engineering, especially in: signal processing, non-linear\nsystem identification, blind sources separation, and direction finding\nalgorithms of multi-source signals.\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2018 15:39:59 GMT"}, {"version": "v2", "created": "Wed, 23 Jan 2019 11:33:22 GMT"}, {"version": "v3", "created": "Fri, 8 Feb 2019 10:41:03 GMT"}], "update_date": "2019-02-11", "authors_parsed": [["Domino", "Krzysztof", ""]]}, {"id": "1811.10513", "submitter": "Mahdi Saedshoar Heris Dr", "authors": "M. Saedshoar Heris and M. Javidi", "title": "Second order difference approximation for a class of Riesz space\n  fractional advection-dispersion equations with delay", "comments": "36 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose numerical scheme for the Riesz space fractional\nadvection-dispersion equations with delay (RFADED). Firstly, analytical\nsolution for RFADED in terms of the functions of Mittag-Leffler type is\nderived. Secondly, the fractional backward differential formulas (FBDF) method\nand shifted Gr\\\"{u}nwald method are introduced to the Riesz space fractional\nderivatives. Next, stability and convergency of these methods have been proved.\nThirdly, Crank-Nicolson scheme for solving this problem is proposed. We prove\nthat the scheme is conditionally stable and convergent with the order accuracy\nof ${\\rm O}({\\kappa ^2} + {h^2})$. Finally, some numerical results are given to\ndemonstrate that presented method is a computationally efficient and accurate\nmethod for solving RFADED.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2018 17:09:57 GMT"}, {"version": "v2", "created": "Wed, 21 Jul 2021 06:56:58 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Heris", "M. Saedshoar", ""], ["Javidi", "M.", ""]]}, {"id": "1811.10573", "submitter": "Linjian Ma", "authors": "Linjian Ma, Edgar Solomonik", "title": "Accelerating Alternating Least Squares for Tensor Decomposition by\n  Pairwise Perturbation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The alternating least squares algorithm for CP and Tucker decomposition is\ndominated in cost by the tensor contractions necessary to set up the quadratic\noptimization subproblems. We introduce a novel family of algorithms that uses\nperturbative corrections to the subproblems rather than recomputing the tensor\ncontractions. This approximation is accurate when the factor matrices are\nchanging little across iterations, which occurs when alternating least squares\napproaches convergence. We provide a theoretical analysis to bound the\napproximation error. Our numerical experiments demonstrate that the proposed\npairwise perturbation algorithms are easy to control and converge to minima\nthat are as good as alternating least squares. The experimental results show\nimprovements of up to 3.1X with respect to state-of-the-art alternating least\nsquares approaches for various model tensor problems and real datasets.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2018 18:22:44 GMT"}, {"version": "v2", "created": "Sun, 2 Dec 2018 18:17:08 GMT"}, {"version": "v3", "created": "Sat, 5 Jan 2019 01:35:04 GMT"}, {"version": "v4", "created": "Fri, 27 Dec 2019 13:31:21 GMT"}, {"version": "v5", "created": "Sat, 3 Oct 2020 21:59:44 GMT"}, {"version": "v6", "created": "Wed, 14 Apr 2021 17:07:11 GMT"}], "update_date": "2021-04-15", "authors_parsed": [["Ma", "Linjian", ""], ["Solomonik", "Edgar", ""]]}, {"id": "1811.11097", "submitter": "Alexander Rieder", "authors": "Michael Karkulik and Jens Markus Melenk and Alexander Rieder", "title": "Stable decompositions of $hp$-BEM spaces and an optimal Schwarz\n  preconditioner for the hypersingular integral operator in 3D", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider fractional Sobolev spaces $H^\\theta(\\Gamma)$, $\\theta \\in [0,1]$,\non a 2D surface $\\Gamma$. We show that functions in $H^\\theta(\\Gamma)$ can be\ndecomposed into contributions with local support in a stable way. Stability of\nthe decomposition is inherited by piecewise polynomial subspaces. Applications\ninclude the analysis of additive Schwarz preconditioners for discretizations of\nthe hypersingular integral operator by the $p$-version of the boundary element\nmethod with condition number bounds that are uniform in the polynomial degree\n$p$.\n", "versions": [{"version": "v1", "created": "Tue, 27 Nov 2018 16:50:57 GMT"}, {"version": "v2", "created": "Mon, 2 Sep 2019 14:35:12 GMT"}], "update_date": "2019-09-04", "authors_parsed": [["Karkulik", "Michael", ""], ["Melenk", "Jens Markus", ""], ["Rieder", "Alexander", ""]]}, {"id": "1811.11143", "submitter": "Yuwen Li", "authors": "Yuwen Li", "title": "Some convergence and optimality results of adaptive mixed methods in\n  finite element exterior calculus", "comments": "24 pages", "journal-ref": "SIAM J. Numer. Anal.57(4), 2019-2042 (2019)", "doi": "10.1137/18M1229080", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present several new a posteriori error estimators and two\nadaptive mixed finite element methods \\textsf{AMFEM1} and \\textsf{AMFEM2} for\nthe Hodge Laplacian problem in finite element exterior calculus. We prove that\n\\textsf{AMFEM1} and \\textsf{AMFEM2} are both convergent starting from any\ninitial coarse mesh. A suitably defined quasi error is crucial to the\nconvergence analysis. In addition, we prove the optimality of \\textsf{AMFEM2}.\nThe main technical contribution is a localized discrete upper bound. As opposed\nto existing literature, our results work on Lipschitz domains with nontrivial\ncohomology and provide the first norm convergence and optimality results.\n", "versions": [{"version": "v1", "created": "Tue, 27 Nov 2018 18:09:16 GMT"}, {"version": "v2", "created": "Thu, 22 Aug 2019 21:01:08 GMT"}], "update_date": "2019-08-26", "authors_parsed": [["Li", "Yuwen", ""]]}, {"id": "1811.11433", "submitter": "Pierre Ablin", "authors": "Pierre Ablin (PARIETAL), Jean-Fran\\c{c}ois Cardoso (CNRS, IAP),\n  Alexandre Gramfort (PARIETAL)", "title": "Beyond Pham's algorithm for joint diagonalization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The approximate joint diagonalization of a set of matrices consists in\nfinding a basis in which these matrices are as diagonal as possible. This\nproblem naturally appears in several statistical learning tasks such as blind\nsignal separation. We consider the diagonalization criterion studied in a\nseminal paper by Pham (2001), and propose a new quasi-Newton method for its\noptimization. Through numerical experiments on simulated and real datasets, we\nshow that the proposed method outper-forms Pham's algorithm. An open source\nPython package is released.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 08:03:18 GMT"}], "update_date": "2018-12-03", "authors_parsed": [["Ablin", "Pierre", "", "PARIETAL"], ["Cardoso", "Jean-François", "", "CNRS, IAP"], ["Gramfort", "Alexandre", "", "PARIETAL"]]}, {"id": "1811.11469", "submitter": "Joakim Beck", "authors": "Joakim Beck, Ben Mansour Dia, Luis F.R. Espath, Raul Tempone", "title": "Multilevel Double Loop Monte Carlo and Stochastic Collocation Methods\n  with Importance Sampling for Bayesian Optimal Experimental Design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An optimal experimental set-up maximizes the value of data for statistical\ninferences and predictions. The efficiency of strategies for finding optimal\nexperimental set-ups is particularly important for experiments that are\ntime-consuming or expensive to perform. For instance, in the situation when the\nexperiments are modeled by Partial Differential Equations (PDEs), multilevel\nmethods have been proven to dramatically reduce the computational complexity of\ntheir single-level counterparts when estimating expected values. For a setting\nwhere PDEs can model experiments, we propose two multilevel methods for\nestimating a popular design criterion known as the expected information gain in\nsimulation-based Bayesian optimal experimental design. The expected information\ngain criterion is of a nested expectation form, and only a handful of\nmultilevel methods have been proposed for problems of such form. We propose a\nMultilevel Double Loop Monte Carlo (MLDLMC), which is a multilevel strategy\nwith Double Loop Monte Carlo (DLMC), and a Multilevel Double Loop Stochastic\nCollocation (MLDLSC), which performs a high-dimensional integration by\ndeterministic quadrature on sparse grids. For both methods, the Laplace\napproximation is used for importance sampling that significantly reduces the\ncomputational work of estimating inner expectations. The optimal values of the\nmethod parameters are determined by minimizing the average computational work,\nsubject to satisfying the desired error tolerance. The computational\nefficiencies of the methods are demonstrated by estimating the expected\ninformation gain for Bayesian inference of the fiber orientation in composite\nlaminate materials from an electrical impedance tomography experiment. MLDLSC\nperforms better than MLDLMC when the regularity of the quantity of interest,\nwith respect to the additive noise and the unknown parameters, can be\nexploited.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 10:02:31 GMT"}, {"version": "v2", "created": "Mon, 21 Jan 2019 18:38:44 GMT"}, {"version": "v3", "created": "Mon, 3 Feb 2020 14:42:27 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Beck", "Joakim", ""], ["Dia", "Ben Mansour", ""], ["Espath", "Luis F. R.", ""], ["Tempone", "Raul", ""]]}, {"id": "1811.11502", "submitter": "Rafael Bailo PhD DIC", "authors": "Rafael Bailo, Jose A. Carrillo, Jingwei Hu", "title": "Fully Discrete Positivity-Preserving and Energy-Dissipating Schemes for\n  Aggregation-Diffusion Equations with a Gradient Flow Structure", "comments": null, "journal-ref": null, "doi": "10.4310/CMS.2020.v18.n5.a5", "report-no": null, "categories": "math.NA cs.NA math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose fully discrete, implicit-in-time finite-volume schemes for a\ngeneral family of non-linear and non-local Fokker-Planck equations with a\ngradient-flow structure, usually known as aggregation-diffusion equations, in\nany dimension. The schemes enjoy the positivity-preservation and\nenergy-dissipation properties, essential for their practical use. The\nfirst-order scheme verifies these properties unconditionally for general\nnon-linear diffusions and interaction potentials, while the second-order scheme\ndoes so provided a CFL condition holds. Sweeping dimensional splitting permits\nthe efficient construction of these schemes in higher dimensions while\npreserving their structural properties. Numerical experiments validate the\nschemes and show their ability to handle complicated phenomena typical in\naggregation-diffusion equations, such as free boundaries, metastability,\nmerging and phase transitions.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 11:22:53 GMT"}, {"version": "v2", "created": "Thu, 19 Sep 2019 10:54:52 GMT"}, {"version": "v3", "created": "Thu, 26 Mar 2020 13:01:11 GMT"}, {"version": "v4", "created": "Tue, 26 May 2020 16:23:56 GMT"}, {"version": "v5", "created": "Thu, 17 Sep 2020 19:39:51 GMT"}], "update_date": "2020-09-29", "authors_parsed": [["Bailo", "Rafael", ""], ["Carrillo", "Jose A.", ""], ["Hu", "Jingwei", ""]]}, {"id": "1811.11601", "submitter": "Hendrik Ranocha", "authors": "Hendrik Ranocha", "title": "On Strong Stability of Explicit Runge-Kutta Methods for Nonlinear\n  Semibounded Operators", "comments": null, "journal-ref": "IMA Journal of Numerical Analysis, 2020", "doi": "10.1093/imanum/drz070", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Explicit Runge-Kutta methods are classical and widespread techniques in the\nnumerical solution of ordinary differential equations (ODEs). Considering\npartial differential equations, spatial semidiscretisations can be used to\nobtain systems of ODEs that are solved subsequently, resulting in fully\ndiscrete schemes. However, certain stability investigations of high-order\nmethods for hyperbolic conservation laws are often conducted only for the\nsemidiscrete versions. Here, strong stability (also known as monotonicity) of\nexplicit Runge-Kutta methods for ODEs with nonlinear and semibounded (also\nknown as dissipative) operators is investigated. Contrary to the linear case,\nit is proven that many strong stability preserving (SSP) schemes of order two\nor greater are not strongly stable for general smooth and semibounded nonlinear\noperators. Additionally, it is shown that there are first order accurate\nexplicit SSP Runge-Kutta methods that are strongly stable (monotone) for\nsemibounded (dissipative) and Lipschitz continuous operators.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 14:50:59 GMT"}, {"version": "v2", "created": "Sun, 15 Dec 2019 10:50:52 GMT"}], "update_date": "2020-04-08", "authors_parsed": [["Ranocha", "Hendrik", ""]]}, {"id": "1811.11624", "submitter": "Felix Binkowski", "authors": "Felix Binkowski, Lin Zschiedrich, Sven Burger", "title": "A Riesz-projection-based method for nonlinear eigenvalue problems", "comments": null, "journal-ref": "J. Comput. Phys. 419, 109678 (2020)", "doi": "10.1016/j.jcp.2020.109678", "report-no": null, "categories": "physics.comp-ph cs.NA math.NA physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an algorithm for general nonlinear eigenvalue problems to compute\nphysically relevant eigenvalues within a chosen contour. Eigenvalue information\nis explored by contour integration incorporating different weight functions.\nThe gathered information is processed by solving a nonlinear system of\nequations of small dimension prioritizing eigenvalues with high physical\nimpact. No auxiliary functions have to be introduced since linearization is not\nused. The numerical implementation is straightforward as the evaluation of the\nintegrand can be regarded as a blackbox. We apply the method to a quantum\nmechanical problem and to two nanophotonic systems.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 15:24:56 GMT"}, {"version": "v2", "created": "Mon, 3 Dec 2018 15:30:27 GMT"}, {"version": "v3", "created": "Mon, 30 Mar 2020 12:23:35 GMT"}, {"version": "v4", "created": "Wed, 18 Nov 2020 13:24:53 GMT"}], "update_date": "2020-11-19", "authors_parsed": [["Binkowski", "Felix", ""], ["Zschiedrich", "Lin", ""], ["Burger", "Sven", ""]]}, {"id": "1811.11962", "submitter": "Jeffrey Hokanson", "authors": "Jeffrey M. Hokanson and Caleb C. Magruder", "title": "$\\mathcal{H}_2$-Optimal Model Reduction Using Projected Nonlinear Least\n  Squares", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many applications throughout science and engineering, model reduction\nplays an important role replacing expensive large-scale linear dynamical\nsystems by inexpensive reduced order models that capture key features of the\noriginal, full order model. One approach to model reduction finds reduced order\nmodels that are locally optimal approximations in the $\\mathcal{H}_2$ norm, an\napproach taken by the Iterative Rational Krylov Algorithm (IRKA) among others.\nHere we introduce a new approach for $\\mathcal{H}_2$-optimal model reduction\nusing the projected nonlinear least squares framework previously introduced in\n[J. M. Hokanson, SIAM J. Sci. Comput. 39 (2017), pp. A3107--A3128]. At each\niteration, we project the $\\mathcal{H}_2$ optimization problem onto a\nfinite-dimensional subspace yielding a weighted least squares rational\napproximation problem. Subsequent iterations append this subspace such that the\nleast squares rational approximant asymptotically satisfies the first order\nnecessary conditions of the original, $\\mathcal{H}_2$ optimization problem.\nThis enables us to build reduced order models with similar error in the\n$\\mathcal{H}_2$ norm but using far fewer evaluations of the expensive, full\norder model compared to competing methods. Moreover, our new algorithm only\nrequires access to the transfer function of the full order model, unlike IRKA\nwhich requires a state-space representation or TF-IRKA which requires both the\ntransfer function and its derivative. Applying the projected nonlinear least\nsquares framework to the $\\mathcal{H}_2$-optimal model reduction problem open\nnew avenues for related model reduction problems.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2018 04:48:42 GMT"}, {"version": "v2", "created": "Wed, 27 Feb 2019 21:14:02 GMT"}, {"version": "v3", "created": "Thu, 12 Mar 2020 13:20:38 GMT"}, {"version": "v4", "created": "Mon, 14 Sep 2020 20:43:48 GMT"}], "update_date": "2020-09-16", "authors_parsed": [["Hokanson", "Jeffrey M.", ""], ["Magruder", "Caleb C.", ""]]}, {"id": "1811.12212", "submitter": "Philipp Otte", "authors": "Philipp Otte and Martin Frank", "title": "A Structured Approach to the Construction of Stable Linear\n  Lattice-Boltzmann Collision Operators", "comments": null, "journal-ref": "Computers & Mathematics with Applications, 2019", "doi": "10.1016/j.camwa.2019.09.009", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a structured approach to the construction of linear BGK-type\ncollision operators ensuring that the resulting Lattice-Boltzmann methods are\nstable with respect to a weighted $L^2$-norm. The results hold for particular\nboundary conditions including periodic, bounce-back, and bounce-back with\nflipping of sign. This construction uses the equivalent moment-space definition\nof BGK-type collision operators and the notion of stability structures as\nguiding principle for the choice of the equilibrium moments for those moments\ninfluencing the error term only but not the order of consistency. The presented\nstructured approach is then applied to the 3D isothermal linearized Euler\nequations with non-vanishing background velocity. Finally, convergence results\nin the strong discrete $L^\\infty$-norm highlight the suitability of the\nstructured approach introduced in this manuscript.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2018 14:49:32 GMT"}, {"version": "v2", "created": "Tue, 1 Oct 2019 07:31:23 GMT"}], "update_date": "2020-02-07", "authors_parsed": [["Otte", "Philipp", ""], ["Frank", "Martin", ""]]}, {"id": "1811.12269", "submitter": "Christian Lessig", "authors": "Christian Lessig", "title": "$\\Psi$ec: A Local Spectral Exterior Calculus", "comments": "Revised version, updated figures", "journal-ref": "Applied and Computational Harmonic Analysis, 2020", "doi": "10.1016/j.acha.2020.10.003", "report-no": null, "categories": "cs.NA math.FA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce $\\Psi \\mathrm{ec}$, a discretization of Cartan's exterior\ncalculus of differential forms using wavelets. Our construction consists of\ndifferential $r$-form wavelets with flexible directional localization that\nprovide tight frames for the spaces $\\Omega^r(\\mathbb{R}^n)$ of forms in\n$\\mathbb{R}^2$ and $\\mathbb{R}^3$. By construction, the wavelets satisfy the de\nRahm co-chain complex, the Hodge decomposition, and that the $k$-dimensional\nintegral of an $r$-form is an $(r-k)$-form. They also verify Stokes' theorem\nfor differential forms, with the most efficient finite dimensional\napproximation attained using directionally localized, curvelet- or\nridgelet-like forms. The construction of $\\Psi \\mathrm{ec}$ builds on the\ngeometric simplicity of the exterior calculus in the Fourier domain. We\nestablish this structure by extending existing results on the Fourier transform\nof differential forms to a frequency description of the exterior calculus,\nincluding, for example, a Plancherel theorem for forms and a description of the\nsymbols of all important operators.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2018 15:55:58 GMT"}, {"version": "v2", "created": "Sat, 14 Dec 2019 17:02:13 GMT"}, {"version": "v3", "created": "Mon, 5 Oct 2020 20:31:37 GMT"}], "update_date": "2020-10-27", "authors_parsed": [["Lessig", "Christian", ""]]}, {"id": "1811.12498", "submitter": "Svetlana Tlupova", "authors": "Lei Wang, Svetlana Tlupova and Robert Krasny", "title": "A Treecode Algorithm for 3D Stokeslets and Stresslets", "comments": null, "journal-ref": "Adv. Appl. Math. Mech., 11 (4) (2019), pp. 737-756", "doi": "10.4208/aamm.OA-2018-0187", "report-no": null, "categories": "math.NA cs.NA physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Stokeslet and stresslet kernels are commonly used in boundary element\nsimulations and singularity methods for slow viscous flow. Evaluating the\nvelocity induced by a collection of Stokeslets and stresslets by direct\nsummation requires $O(N^2)$ operations, where $N$ is the system size. The\npresent work develops a treecode algorithm for 3D Stokeslets and stresslets\nthat reduces the cost to $O(N\\log N)$. The particles are divided into a\nhierarchy of clusters, and well-separated particle-cluster interactions are\ncomputed by a far-field Cartesian Taylor approximation. The terms in the\napproximation are contracted to promote efficient computation. Serial and\nparallel results display the treecode performance for several test cases. In\nparticular the method has relatively simple structure and low memory usage, and\nthis enhances parallel efficiency for large systems.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2018 21:37:34 GMT"}, {"version": "v2", "created": "Wed, 28 Aug 2019 20:50:47 GMT"}], "update_date": "2019-08-30", "authors_parsed": [["Wang", "Lei", ""], ["Tlupova", "Svetlana", ""], ["Krasny", "Robert", ""]]}, {"id": "1811.12562", "submitter": "Ryan Mohr", "authors": "Zlatko Drma\\v{c} and Igor Mezi\\'c and Ryan Mohr", "title": "On least squares problems with certain Vandermonde--Khatri--Rao\n  structure with applications to DMD", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new computational method for solving structured least\nsquares problems that arise in the process of identification of coherent\nstructures in fluid flows. It is deployed in combination with dynamic mode\ndecomposition (DMD) which provides a non-orthogonal set of modes ---\ncorresponding to particular temporal frequencies --- a subset of which is used\nto represent time snapshots of the underlying dynamics. The coefficients of the\nrepresentation are determined from a solution of a structured linear least\nsquares problem with the matrix that involves the Khatri--Rao product of a\ntriangular and a Vandermonde matrix. Such a structure allows a very efficient\nnormal equation based least squares solution, which is used in state of the art\nCFD tools such as the sparsity promoting DMD (DMDSP). A new numerical analysis\nof the normal equations approach provides insights about its applicability and\nits limitations. Relevant condition numbers that determine numerical robustness\nare identified and discussed. Further, the paper offers a corrected semi-normal\nsolution and QR factorization based algorithms. It is shown how to use the\nVandermonde--Khatri--Rao structure to efficiently compute the QR factorization\nof the least squares coefficient matrix, thus providing a new computational\ntool for the ill-conditioned cases where the normal equations may fail to\ncompute a sufficiently accurate solution. Altogether, the presented material\nprovides a firm numerical linear algebra framework for a class of structured\nleast squares problems arising in a variety of applications.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2018 01:05:39 GMT"}], "update_date": "2018-12-03", "authors_parsed": [["Drmač", "Zlatko", ""], ["Mezić", "Igor", ""], ["Mohr", "Ryan", ""]]}, {"id": "1811.12691", "submitter": "Enrico Facca", "authors": "Enrico Facca and Franco Cardin and Mario Putti", "title": "Branching structures emerging from a continuous optimal transport model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently a Dynamic-Monge-Kantorovich formulation of the PDE-based\n$L^1$-optimal transport problem was presented. The model considers a diffusion\nequation enforcing the balance of the transported masses with a time-varying\nconductivity that volves proportionally to the transported flux. In this paper\nwe present an extension of this model that considers a time derivative of the\nconductivity that grows as a power law of the transport flux with exponent\n$\\beta>0$. A sub-linear growth ($0<\\beta<1$) penalizes the flux intensity and\npromotes distributed transport, with equilibrium solutions that are reminiscent\nof Congested Transport Problems. On the contrary, a super-linear growth\n($\\beta>1$) favors flux intensity and promotes concentrated transport, leading\nto the emergence of steady-state \"singular\" and \"fractal-like\" configurations\nthat resemble those of Branched Transport Problems. We derive a numerical\ndiscretization of the proposed model that is accurate, efficient, and robust\nfor a wide range of scenarios. For $\\beta>1$ the numerical model is able to\nreproduce highly irregular and fractal-like formations without any a-priory\nstructural assumption.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2018 09:58:49 GMT"}, {"version": "v2", "created": "Fri, 8 May 2020 17:16:35 GMT"}], "update_date": "2020-05-11", "authors_parsed": [["Facca", "Enrico", ""], ["Cardin", "Franco", ""], ["Putti", "Mario", ""]]}, {"id": "1811.12804", "submitter": "Chen Cheng", "authors": "Yuxin Chen, Chen Cheng, Jianqing Fan", "title": "Asymmetry Helps: Eigenvalue and Eigenvector Analyses of Asymmetrically\n  Perturbed Low-Rank Matrices", "comments": "accepted to Annals of Statistics, 2020. 37 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT cs.NA eess.SP math.IT math.NA stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is concerned with the interplay between statistical asymmetry and\nspectral methods. Suppose we are interested in estimating a rank-1 and\nsymmetric matrix $\\mathbf{M}^{\\star}\\in \\mathbb{R}^{n\\times n}$, yet only a\nrandomly perturbed version $\\mathbf{M}$ is observed. The noise matrix\n$\\mathbf{M}-\\mathbf{M}^{\\star}$ is composed of zero-mean independent (but not\nnecessarily homoscedastic) entries and is, therefore, not symmetric in general.\nThis might arise, for example, when we have two independent samples for each\nentry of $\\mathbf{M}^{\\star}$ and arrange them into an {\\em asymmetric} data\nmatrix $\\mathbf{M}$. The aim is to estimate the leading eigenvalue and\neigenvector of $\\mathbf{M}^{\\star}$. We demonstrate that the leading eigenvalue\nof the data matrix $\\mathbf{M}$ can be $O(\\sqrt{n})$ times more accurate --- up\nto some log factor --- than its (unadjusted) leading singular value in\neigenvalue estimation. Further, the perturbation of any linear form of the\nleading eigenvector of $\\mathbf{M}$ --- say, entrywise eigenvector perturbation\n--- is provably well-controlled. This eigen-decomposition approach is fully\nadaptive to heteroscedasticity of noise without the need of careful bias\ncorrection or any prior knowledge about the noise variance. We also provide\npartial theory for the more general rank-$r$ case. The takeaway message is\nthis: arranging the data samples in an asymmetric manner and performing\neigen-decomposition could sometimes be beneficial.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2018 14:18:26 GMT"}, {"version": "v2", "created": "Wed, 26 Dec 2018 14:50:03 GMT"}, {"version": "v3", "created": "Tue, 1 Jan 2019 07:52:48 GMT"}, {"version": "v4", "created": "Tue, 30 Jul 2019 01:25:22 GMT"}, {"version": "v5", "created": "Sun, 23 Feb 2020 08:41:24 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Chen", "Yuxin", ""], ["Cheng", "Chen", ""], ["Fan", "Jianqing", ""]]}, {"id": "1811.12910", "submitter": "Wesley Davis", "authors": "Wesley Davis, Richard Noren, and Ke Shi", "title": "Improved Finite Difference Results for the Caputo Time-Fractional\n  Diffusion Equation", "comments": "22 pages, 3 tables, 1 appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We begin with a treatment of the Caputo time-fractional diffusion equation,\nby using the Laplace transform, to obtain a Volterra intego-differential\nequation where we may examine the weakly singular nature of this convolution\nkernel.\\iffalse The order of fractional derivative, $\\alpha$, is tied to finite\ndifference methods and is of great interest.\\fi We examine this new equation\nand utilize a numerical scheme that is derived in parallel to the L1-method for\nthe time variable and a usual fourth order approximation in the spatial\nvariable. The main method derived in this paper has a rate of convergence of\n$O(k^{2}+h^4)$ for $u(x,t) \\in C^6(\\Omega)\\times C^2[0,T]$, which improves\nprevious estimates by a factor of $k^{\\alpha}$. We also present a novel\nalternative method for a first order approximation in time, which allows us to\nrelax our regularity assumption to $u(x,t) \\in C^6(\\Omega)\\times C^1[0,T]$,\nwhile exhibiting order of convergence slightly less than $O(k^{1+\\alpha})$ in\ntime. This allows for a much wider class of functions to be analyzed which was\npreviously not possible under the L1-method. We present numerical examples\ndemonstrating these results and discuss future improvements and implications by\nusing these techniques.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2018 17:51:23 GMT"}, {"version": "v2", "created": "Thu, 23 Jan 2020 22:03:53 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Davis", "Wesley", ""], ["Noren", "Richard", ""], ["Shi", "Ke", ""]]}]