[{"id": "1205.0030", "submitter": "Bernardo Huberman", "authors": "Christina Aperjis and Bernardo A. Huberman", "title": "A Market for Unbiased Private Data: Paying Individuals According to\n  their Privacy Attitudes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Since there is, in principle, no reason why third parties should not pay\nindividuals for the use of their data, we introduce a realistic market that\nwould allow these payments to be made while taking into account the privacy\nattitude of the participants. And since it is usually important to use unbiased\nsamples to obtain credible statistical results, we examine the properties that\nsuch a market should have and suggest a mechanism that compensates those\nindividuals that participate according to their risk attitudes. Equally\nimportant, we show that this mechanism also benefits buyers, as they pay less\nfor the data than they would if they compensated all individuals with the same\nmaximum fee that the most concerned ones expect.\n", "versions": [{"version": "v1", "created": "Mon, 30 Apr 2012 20:43:18 GMT"}], "update_date": "2012-05-02", "authors_parsed": [["Aperjis", "Christina", ""], ["Huberman", "Bernardo A.", ""]]}, {"id": "1205.1141", "submitter": "Vikas Dongre", "authors": "Vikas J Dongre, Ramkrishna V Yenkar, Vijay H Mankar", "title": "Interactive Learning through Hands-on Practice using Electronic Mini -\n  Lab (EML): a Case Study", "comments": "6 pages,1 Table, 7 Figures Journal paper", "journal-ref": "Journal of Engineering, Science & Management Education (JESME)\n  Bhopal, India, Vol-5 Issue-I (Jan-Mar 2012) (357-362) www.nitttrbhopal.ac.in", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  -- In this paper, a new approach to impart practical skill based technical\neducation is presented in comprehensive manner. An Electronic Mini-Lab (EML) is\ndevised containing basic design and test instruments with electronic\ncomponents, ICs, connecting wires and battery. Using the EML, students perform\nvarious formal and informal digital and analog circuit practicals as well as\ndesign prototype of projects. This gives them a hands-on experience, sense of\nbelonging and sense of cooperation. The EML is useful for performing many\npracticals of various subjects. The EML also reduces the workload of college\nlaboratories. Students have their own individual EML at their disposal anytime,\nwhich can be used to design hobby projects as a fun too. This will make them\nskilled engineers. This provides tremendous benefits in teaching learning\nprocess. It also boosted the interest, confidence of students and teachers.\nIncorporating active/ cooperative learning into traditional instruction can be\na useful pedagogical tool to help students to perform practicals and project\nwork any time anywhere. This concept is remarkably simple and cost effective\nbut the dividends can be profound.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2012 14:36:25 GMT"}], "update_date": "2012-05-08", "authors_parsed": [["Dongre", "Vikas J", ""], ["Yenkar", "Ramkrishna V", ""], ["Mankar", "Vijay H", ""]]}, {"id": "1205.2345", "submitter": "Salah A. Aly", "authors": "Hossam Zawbaa and Salah A. Aly", "title": "Hajj and Umrah Event Recognition Datasets", "comments": "4 pages, 18 figures with 33 images", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note, new Hajj and Umrah Event Recognition datasets (HUER) are\npresented. The demonstrated datasets are based on videos and images taken\nduring 2011-2012 Hajj and Umrah seasons. HUER is the first collection of\ndatasets covering the six types of Hajj and Umrah ritual events (rotating in\nTawaf around Kabaa, performing Sa'y between Safa and Marwa, standing on the\nmount of Arafat, staying overnight in Muzdalifah, staying two or three days in\nMina, and throwing Jamarat). The HUER datasets also contain video and image\ndatabases for nine types of human actions during Hajj and Umrah (walking,\ndrinking from Zamzam water, sleeping, smiling, eating, praying, sitting,\nshaving hairs and ablutions, reading the holy Quran and making duaa). The\nspatial resolutions are 1280 x 720 pixels for images and 640 x 480 pixels for\nvideos and have lengths of 20 seconds in average with 30 frame per second\nrates.\n", "versions": [{"version": "v1", "created": "Thu, 10 May 2012 19:10:18 GMT"}], "update_date": "2012-05-11", "authors_parsed": [["Zawbaa", "Hossam", ""], ["Aly", "Salah A.", ""]]}, {"id": "1205.2670", "submitter": "Utku Kose UK", "authors": "Utku Kose, Omer Deperlioglu", "title": "Intelligent learning environments within blended learning for ensuring\n  effective C programming course", "comments": "20 pages, 7 figures, 5 tables", "journal-ref": null, "doi": "10.5121/ijaia.2012.3109", "report-no": null, "categories": "cs.CY cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a blended learning implementation and experience\nsupported with intelligent learning environments included in a learning\nmanagement system (LMS) called @KU-UZEM. The blended learning model is realized\nas a combination of face to face education and e-learning. The intelligent\nlearning environments consist of two applications named CTutor, ITest. In\naddition to standard e-learning tools, students can use CTutor to resolve C\nprogramming exercises. CTutor is a problem-solving environment, which diagnoses\nstudents' knowledge level but also gives feedbacks and tips to help them to\nunderstand the course subject, overcome their misconceptions and reinforce\nlearnt concepts. ITest provides an assessment environment in which students can\ntake quizzes that were prepared according to their learning levels. The\nrealized model was used for two terms in the \"C Programming\" course given at\nAfyon Kocatepe University. A survey was conducted at the end of the course to\nfind out to what extent the students were accepting the blended learning model\nsupported with @KU-UZEM and to discover students' attitude towards intelligent\nlearning environments. Additionally, an experiment formed with an experimental\ngroup who took an active part in the realized model and a control group who\nonly took the face to face education was performed during the first term of the\ncourse. According to the results, students were satisfied with intelligent\nlearning environments and the realized learning model. Furthermore, the use of\nintelligent learning environments improved the students' knowledge about C\nprogramming.\n", "versions": [{"version": "v1", "created": "Wed, 8 Feb 2012 11:27:58 GMT"}], "update_date": "2012-05-14", "authors_parsed": [["Kose", "Utku", ""], ["Deperlioglu", "Omer", ""]]}, {"id": "1205.2711", "submitter": "Nikhilesh  Barik Mr.", "authors": "Nikhilesh Barik, Sunil Karforma", "title": "Risks and remedies in e-learning system", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most effective applications of Information and Communication\nTechnology (ICT) is the emergence of E-Learning. Considering the importance and\nneed of E-Learning, recent years have seen a drastic change of learning\nmethodologies in Higher Education. Undoubtedly, the three main entities of\nE-Learning system can be considered as Student, Teacher & Controlling Authority\nand there will be different level, but a good E-Learning system needs total\nintegrity among all entities in every level. Apart from integrity enforcement,\nsecurity enforcement in the whole system is the other crucial way to organize\nthe it. As internet is the backbone of the entire system which is inherently\ninsecure, during transaction of message in E-Learning system, hackers attack by\nutilising different loopholes of technology. So different security measures are\nrequired to be imposed on the system. In this paper, emphasis is given on\ndifferent risks called e-risks and their remedies called e-remedies to build\ntrust in the minds of all participants of E-Learning system.\n", "versions": [{"version": "v1", "created": "Thu, 9 Feb 2012 06:44:29 GMT"}], "update_date": "2012-05-15", "authors_parsed": [["Barik", "Nikhilesh", ""], ["Karforma", "Sunil", ""]]}, {"id": "1205.2736", "submitter": "Kristina Lerman", "authors": "Nathan Oken Hodas, Kristina Lerman", "title": "How Visibility and Divided Attention Constrain Social Contagion", "comments": "In ASE/IEEE International Conference on Social Computing\n  (SocialCom-2012)", "journal-ref": null, "doi": "10.1109/SocialCom-PASSAT.2012.129", "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How far and how fast does information spread in social media? Researchers\nhave recently examined a number of factors that affect information diffusion in\nonline social networks, including: the novelty of information, users' activity\nlevels, who they pay attention to, and how they respond to friends'\nrecommendations. Using URLs as markers of information, we carry out a detailed\nstudy of retweeting, the primary mechanism by which information spreads on the\nTwitter follower graph. Our empirical study examines how users respond to an\nincoming stimulus, i.e., a tweet (message) from a friend, and reveals that\n%retweeting behavior is constrained by a few simple principles. the \"principle\nof least effort\" combined with limited attention plays a dominant role in\nretweeting behavior. Specifically, we observe that users retweet information\nwhen it is most visible, such as when it near the top of their Twitter stream.\nMoreover, our measurements quantify how a user's limited attention is divided\namong incoming tweets, providing novel evidence that highly connected\nindividuals are less likely to propagate an arbitrary tweet. Our study\nindicates that the finite ability to process incoming information constrains\nsocial contagion, and we conclude that rapid decay of visibility is the primary\nbarrier to information propagation online.\n", "versions": [{"version": "v1", "created": "Fri, 11 May 2012 23:07:44 GMT"}, {"version": "v2", "created": "Mon, 10 Sep 2012 21:24:16 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Hodas", "Nathan Oken", ""], ["Lerman", "Kristina", ""]]}, {"id": "1205.3025", "submitter": "Marc-Oliver Gewaltig", "authors": "Marc-Oliver Gewaltig and Robert Cannon", "title": "Current practice in software development for computational neuroscience\n  and how to improve it", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.CY cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Almost all research work in computational neuroscience involves software. As\nresearchers try to understand ever more complex systems, there is a continual\nneed for software with new capabilities. Because of the wide range of questions\nbeing investigated, new software is often developed rapidly by individuals or\nsmall groups. In these cases, it can be hard to demonstrate that the software\ngives the right results. Software developers are often open about the code they\nproduce and willing to share it, but there is little appreciation among\npotential users of the great diversity of software development practices and\nend results, and how this affects the suitability of software tools for use in\nresearch projects. To help clarify these issues, we have reviewed a range of\nsoftware tools and asked how the culture and practice of software development\naffects their validity and trustworthiness. We identified four key questions\nthat can be used to categorize software projects and correlate them with the\ntype of product that results. The first question addresses what is being\nproduced. The other three concern why, how, and by whom the work is done. The\nanswers to these questions show strong correlations with the nature of the\nsoftware being produced, and its suitability for particular purposes. Based on\nour findings, we suggest ways in which current software development practice in\ncomputational neuroscience can be improved and propose checklists to help\ndevelopers, reviewers and scientists to assess the quality whether particular\npieces of software are ready for use in research.\n", "versions": [{"version": "v1", "created": "Mon, 14 May 2012 13:48:51 GMT"}, {"version": "v2", "created": "Wed, 20 Nov 2013 08:02:32 GMT"}], "update_date": "2013-11-21", "authors_parsed": [["Gewaltig", "Marc-Oliver", ""], ["Cannon", "Robert", ""]]}, {"id": "1205.3986", "submitter": "Yusuf Perwej", "authors": "Omar S. Al-Mushayt, Yusuf Perwej, Kashiful Haq", "title": "Electronic-government in Saudi Arabia: A positive revolution in the\n  peninsula", "comments": "12 Pages, 1 Figures, ISSN Print: (0974-7273),ISSN Online:(0975-3761)", "journal-ref": "International Transactions in Applied Sciences (ITAS), January\n  2009, Volume 1 , Number 1, Pages 87-98", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The informatization practice of countries all over the world has shown that\nthe level of a government's informatization is one main factor that can affect\nits international competitive power. At present, e-government construction is\nregarded as one of the most important tasks for the national economy and\nsociety upliftment and informatization in Saudi Arabia. Unlike the traditional\ngovernments, an e-government takes on a new look with its framework and\noperation mode more suitable for the contemporary era. In fact, it is a basic\nnational strategy to promote Saudi Arabia's informatization by means of\ne-government construction. This talk firstly introduces the basic concepts and\nrelevant viewpoints of egovernment, then reviews the development process of\ne-government in Saudi Arabia, and describes the current states, development\nstrategies of e-government in Saudi Arabia. And also review e-government\nmaturity models and synthesize them e-government maturity models are\ninvestigated, in which the authors have proposed the Delloite's six-stage\nmodel, Layne and Lee four-stage model and Accenture five-stage model. So, the\nmain e-government maturity stages are: online presence, interaction,\ntransaction, transformation and digital democracy. After that, according to\nmany references, the main technologies which are used in each stage are\nsummarized.\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2012 17:23:50 GMT"}], "update_date": "2012-05-18", "authors_parsed": [["Al-Mushayt", "Omar S.", ""], ["Perwej", "Yusuf", ""], ["Haq", "Kashiful", ""]]}, {"id": "1205.4463", "submitter": "Salah A. Aly", "authors": "Salah A. Aly", "title": "Pilgrims Face Recognition Dataset -- HUFRD", "comments": "5 pages, 13 images, 1 table of a new HUFRD work", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we define a new pilgrims face recognition dataset, called HUFRD\ndataset. The new developed dataset presents various pilgrims' images taken from\noutside the Holy Masjid El-Harram in Makkah during the 2011-2012 Hajj and Umrah\nseasons. Such dataset will be used to test our developed facial recognition and\ndetection algorithms, as well as assess in the missing and found recognition\nsystem \\cite{crowdsensing}.\n", "versions": [{"version": "v1", "created": "Sun, 20 May 2012 22:07:27 GMT"}, {"version": "v2", "created": "Sun, 30 Dec 2012 00:58:09 GMT"}], "update_date": "2013-01-01", "authors_parsed": [["Aly", "Salah A.", ""]]}, {"id": "1205.5821", "submitter": "Ian Wilkinson", "authors": "Ian Wilkinson (The University of Sydney) and Louise Young (University\n  of Western Sydney)", "title": "Toward A Normative Theory of Normative Marketing Theory", "comments": "27 pages, 1 Figure", "journal-ref": "Marketing Theory 5 (4) 2005, 363-396", "doi": null, "report-no": null, "categories": "q-fin.GN cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how different approaches to developing marketing strategies depending\non the type of environment a firm faces, where environments are distinguished\nin terms of their systems properties not their context. Particular emphasis is\ngiven to turbulent environments in which outcomes are not a priori predictable\nand are not traceable to individual firm actions and we show that, in these\nconditions, the relevant unit of competitive response and understanding is no\nlonger the individual firm but the network of relations comprising\ninterdependent, interacting firms. Networks of relations are complex adaptive\nsystems that are more 'intelligent' than the individual firms that comprise\nthem and are capable of comprehending and responding to more complex and\nturbulent environments. Yet they are co-produced by the patterns of actions and\ninteractions of the firms involved. The creation and accessing of such\ndistributed intelligence cannot be centrally directed, as this necessarily\nlimits it. Instead managers and firms are involved in a kind of participatory\nplanning and adaptation process through which the network self-organises and\nadapts. Drawing on research in systems theory, complexity, biology and\ncognitive science, extensions to the resource-based theory of the firm are\nproposed that include how resources are linked across relations and network in\na dynamic and evolutionary way. The concept of an extended firm and soft\nassembled strategies are introduced to describe the nature of the strategy\ndevelopment process. This results in a more theoretically grounded basis for\nunderstanding the nature and role of relationship and network strategies in\nmarketing and management. We finish by considering the research implications of\nour analysis and the role of agent based models as a means of sensitising and\ninforming management action.\n", "versions": [{"version": "v1", "created": "Tue, 6 Mar 2012 20:46:09 GMT"}], "update_date": "2012-05-29", "authors_parsed": [["Wilkinson", "Ian", "", "The University of Sydney"], ["Young", "Louise", "", "University\n  of Western Sydney"]]}, {"id": "1205.5960", "submitter": "Ouail Ouchetto", "authors": "Hassania Ouchetto, Ouail Ouchetto and Ounsa Roudies", "title": "Ontology-oriented e-gov services retrieval", "comments": null, "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 9,\n  Issue 2, No 3, March 2012 ISSN (Online): 1694-0814", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The semantic e-government is a new application field accompanying the\ndevelopment of semantic web where the ontologies have become a fertile field of\ninvestigation. This is due firstly to both the complexity and the size of\ne-government systems and secondly to the importance of the issues. However,\npermitting easy and personalized access to e-government services has become, at\nthis juncture, an arduous and not spontaneous process. Indeed, the provided\ne-gov services to the user represent a critical contact point between\nadministrations and users. The encountered problems in the e-gov services\nretrieving process are: the absence of an integrated one-stop government, the\ndifficulty of localizing the services' sources, the lack of mastery of search\nterms and the deficiency of multilingualism of the online services. In order to\nsolve these problems, to facilitate access to e-gov services and to satisfy the\nneeds of potential users, we propose an original approach to this issue. This\napproach incorporates a semantic layer as a crucial element in the retrieving\nprocess. It consists in implementing a personalized search system that\nintegrates ontology of the e-gov domain in this process.\n", "versions": [{"version": "v1", "created": "Sun, 27 May 2012 12:41:42 GMT"}], "update_date": "2012-05-29", "authors_parsed": [["Ouchetto", "Hassania", ""], ["Ouchetto", "Ouail", ""], ["Roudies", "Ounsa", ""]]}]