[{"id": "0704.1353", "submitter": "Paul Prekop", "authors": "Paul Prekop", "title": "Supporting Knowledge and Expertise Finding within Australia's Defence\n  Science and Technology Organisation", "comments": "40th Hawaii International Conference on System Sciences (HICSS40)\n  2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.DB cs.DL cs.HC", "license": null, "abstract": "  This paper reports on work aimed at supporting knowledge and expertise\nfinding within a large Research and Development (R&D) organisation. The paper\nfirst discusses the nature of knowledge important to R&D organisations and\npresents a prototype information system developed to support knowledge and\nexpertise finding. The paper then discusses a trial of the system within an R&D\norganisation, the implications and limitations of the trial, and discusses\nfuture research questions.\n", "versions": [{"version": "v1", "created": "Wed, 11 Apr 2007 06:49:06 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Prekop", "Paul", ""]]}, {"id": "0704.1675", "submitter": "Kristina Lerman", "authors": "Anon Plangprasopchok and Kristina Lerman", "title": "Exploiting Social Annotation for Automatic Resource Discovery", "comments": "6 pages, submitted to AAAI07 workshop on Information Integration on\n  the Web", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY cs.DL", "license": null, "abstract": "  Information integration applications, such as mediators or mashups, that\nrequire access to information resources currently rely on users manually\ndiscovering and integrating them in the application. Manual resource discovery\nis a slow process, requiring the user to sift through results obtained via\nkeyword-based search. Although search methods have advanced to include evidence\nfrom document contents, its metadata and the contents and link structure of the\nreferring pages, they still do not adequately cover information sources --\noften called ``the hidden Web''-- that dynamically generate documents in\nresponse to a query. The recently popular social bookmarking sites, which allow\nusers to annotate and share metadata about various information sources, provide\nrich evidence for resource discovery. In this paper, we describe a\nprobabilistic model of the user annotation process in a social bookmarking\nsystem del.icio.us. We then use the model to automatically find resources\nrelevant to a particular information domain. Our experimental results on data\nobtained from \\emph{del.icio.us} show this approach as a promising method for\nhelping automate the resource discovery task.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2007 23:24:19 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Plangprasopchok", "Anon", ""], ["Lerman", "Kristina", ""]]}, {"id": "0704.1676", "submitter": "Kristina Lerman", "authors": "Kristina Lerman, Anon Plangprasopchok and Chio Wong", "title": "Personalizing Image Search Results on Flickr", "comments": "12 pages, submitted to AAAI07 workshop on Intelligent Information\n  Personalization", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.AI cs.CY cs.DL cs.HC", "license": null, "abstract": "  The social media site Flickr allows users to upload their photos, annotate\nthem with tags, submit them to groups, and also to form social networks by\nadding other users as contacts. Flickr offers multiple ways of browsing or\nsearching it. One option is tag search, which returns all images tagged with a\nspecific keyword. If the keyword is ambiguous, e.g., ``beetle'' could mean an\ninsect or a car, tag search results will include many images that are not\nrelevant to the sense the user had in mind when executing the query. We claim\nthat users express their photography interests through the metadata they add in\nthe form of contacts and image annotations. We show how to exploit this\nmetadata to personalize search results for the user, thereby improving search\nperformance. First, we show that we can significantly improve search precision\nby filtering tag search results by user's contacts or a larger social network\nthat includes those contact's contacts. Secondly, we describe a probabilistic\nmodel that takes advantage of tag information to discover latent topics\ncontained in the search results. The users' interests can similarly be\ndescribed by the tags they used for annotating their images. The latent topics\nfound by the model are then used to personalize search results by finding\nimages on topics that are of interest to the user.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2007 23:31:04 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Lerman", "Kristina", ""], ["Plangprasopchok", "Anon", ""], ["Wong", "Chio", ""]]}, {"id": "0704.2902", "submitter": "Stefan Pohl", "authors": "Stefan Pohl, Filip Radlinski and Thorsten Joachims", "title": "Recommending Related Papers Based on Digital Library Access Records", "comments": "2 pages, 3 postscript figures, to appear in proceedings of JCDL'07,\n  additional and more detailed results can be found in arXiv:0704.2963v1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR", "license": null, "abstract": "  An important goal for digital libraries is to enable researchers to more\neasily explore related work. While citation data is often used as an indicator\nof relatedness, in this paper we demonstrate that digital access records (e.g.\nhttp-server logs) can be used as indicators as well. In particular, we show\nthat measures based on co-access provide better coverage than co-citation, that\nthey are available much sooner, and that they are more accurate for recent\npapers.\n", "versions": [{"version": "v1", "created": "Mon, 23 Apr 2007 16:51:40 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Pohl", "Stefan", ""], ["Radlinski", "Filip", ""], ["Joachims", "Thorsten", ""]]}, {"id": "0704.2963", "submitter": "Stefan Pohl", "authors": "Stefan Pohl", "title": "Using Access Data for Paper Recommendations on ArXiv.org", "comments": "73 pages, 31 figures, Master's Thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR", "license": null, "abstract": "  This thesis investigates in the use of access log data as a source of\ninformation for identifying related scientific papers. This is done for\narXiv.org, the authority for publication of e-prints in several fields of\nphysics.\n  Compared to citation information, access logs have the advantage of being\nimmediately available, without manual or automatic extraction of the citation\ngraph. Because of that, a main focus is on the question, how far user behavior\ncan serve as a replacement for explicit meta-data, which potentially might be\nexpensive or completely unavailable. Therefore, we compare access, content, and\ncitation-based measures of relatedness on different recommendation tasks. As a\nfinal result, an online recommendation system has been built that can help\nscientists to find further relevant literature, without having to search for\nthem actively.\n", "versions": [{"version": "v1", "created": "Mon, 23 Apr 2007 15:52:47 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Pohl", "Stefan", ""]]}, {"id": "0704.3647", "submitter": "Catherine Marshall", "authors": "Catherine C. Marshall, Frank McCown, and Michael L. Nelson", "title": "Evaluating Personal Archiving Strategies for Internet-based Information", "comments": "6 pages, 2 tables, to be published in the Proceedings of IS&T\n  Archiving 2007, May 21-24 2007, Arlington, Virginia, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY cs.HC", "license": null, "abstract": "  Internet-based personal digital belongings present different vulnerabilities\nthan locally stored materials. We use responses to a survey of people who have\nrecovered lost websites, in combination with supplementary interviews, to paint\na fuller picture of current curatorial strategies and practices. We examine the\ntypes of personal, topical, and commercial websites that respondents have lost\nand the reasons they have lost this potentially valuable material. We further\nexplore what they have tried to recover and how the loss influences their\nsubsequent practices. We found that curation of personal digital materials in\nonline stores bears some striking similarities to the curation of similar\nmaterials stored locally in that study participants continue to archive\npersonal assets by relying on a combination of benign neglect, sporadic\nbackups, and unsystematic file replication. However, we have also identified\nissues specific to Internet-based material: how risk is spread by distributing\nthe files among multiple servers and services; the circular reasoning\nparticipants use when they discuss the safety of their digital assets; and the\ntypes of online material that are particularly vulnerable to loss. The study\nreveals ways in which expectations of permanence and notification are violated\nand situations in which benign neglect has far greater consequences for the\nlong-term fate of important digital assets.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2007 01:38:55 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Marshall", "Catherine C.", ""], ["McCown", "Frank", ""], ["Nelson", "Michael L.", ""]]}, {"id": "0704.3653", "submitter": "Catherine Marshall", "authors": "Catherine C. Marshall, Sara Bly, and Francoise Brun-Cottan", "title": "The Long Term Fate of Our Digital Belongings: Toward a Service Model for\n  Personal Archives", "comments": "6 pages, published in the Proceedings of IS&T Archiving 2006,\n  (Ottawa, Canada, May 23-26, 2006), Society for Imaging Science and\n  Technology, Springfield, VA, 2006, pp. 25-30", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY cs.HC", "license": null, "abstract": "  We conducted a preliminary field study to understand the current state of\npersonal digital archiving in practice. Our aim is to design a service for the\nlong-term storage, preservation, and access of digital belongings by examining\nhow personal archiving needs intersect with existing and emerging archiving\ntechnologies, best practices, and policies. Our findings not only confirmed\nthat experienced home computer users are creating, receiving, and finding an\nincreasing number of digital belongings, but also that they have already lost\nirreplaceable digital artifacts such as photos, creative efforts, and records.\nAlthough participants reported strategies such as backup and file replication\nfor digital safekeeping, they were seldom able to implement them consistently.\nFour central archiving themes emerged from the data: (1) people find it\ndifficult to evaluate the worth of accumulated materials; (2) personal storage\nis highly distributed both on- and offline; (3) people are experiencing\nmagnified curatorial problems associated with managing files in the aggregate,\ncreating appropriate metadata, and migrating materials to maintainable formats;\nand (4) facilities for long-term access are not supported by the current\ndesktop metaphor. Four environmental factors further complicate archiving in\nconsumer settings: the pervasive influence of malware; consumer reliance on ad\nhoc IT providers; an accretion of minor system and registry inconsistencies;\nand strong consumer beliefs about the incorruptibility of digital forms, the\nreliability of digital technologies, and the social vulnerability of networked\nstorage.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2007 02:35:57 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Marshall", "Catherine C.", ""], ["Bly", "Sara", ""], ["Brun-Cottan", "Francoise", ""]]}]