[{"id": "1409.0736", "submitter": "Fatima Zahra Tazi", "authors": "Fatima Zahra Tazi, Claude Thibeault, Yvon Savaria, Simon Pichette,\n  Yves Audet", "title": "On Delay Faults Affecting I/O Blocks of an SRAM-Based FPGA Due to\n  Ionizing Radiations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.space-ph cs.AR physics.pop-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Experimental means to characterize delay faults induced by bit flips and SEUs\nin I/O blocks of SRAM-based FPGAs are proposed. A delay fault up to 6.2ns\nsensitized by an events chain is reported.\n", "versions": [{"version": "v1", "created": "Tue, 2 Sep 2014 14:53:09 GMT"}], "update_date": "2014-09-03", "authors_parsed": [["Tazi", "Fatima Zahra", ""], ["Thibeault", "Claude", ""], ["Savaria", "Yvon", ""], ["Pichette", "Simon", ""], ["Audet", "Yves", ""]]}, {"id": "1409.4043", "submitter": "M. C Hanumantharaju Raju", "authors": "M. C. Hanumantharaju, M. Ravishankar, and D. R. Rameshbabu", "title": "Design of Novel Algorithm and Architecture for Gaussian Based Color\n  Image Enhancement System for Real Time Applications", "comments": "15 pages, 15 figures", "journal-ref": null, "doi": "10.1007/978-3-642-36321-4_56", "report-no": null, "categories": "cs.AR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the development of a new algorithm for Gaussian based\ncolor image enhancement system. The algorithm has been designed into\narchitecture suitable for FPGA/ASIC implementation. The color image enhancement\nis achieved by first convolving an original image with a Gaussian kernel since\nGaussian distribution is a point spread function which smoothen the image.\nFurther, logarithm-domain processing and gain/offset corrections are employed\nin order to enhance and translate pixels into the display range of 0 to 255.\nThe proposed algorithm not only provides better dynamic range compression and\ncolor rendition effect but also achieves color constancy in an image. The\ndesign exploits high degrees of pipelining and parallel processing to achieve\nreal time performance. The design has been realized by RTL compliant Verilog\ncoding and fits into a single FPGA with a gate count utilization of 321,804.\nThe proposed method is implemented using Xilinx Virtex-II Pro XC2VP40-7FF1148\nFPGA device and is capable of processing high resolution color motion pictures\nof sizes of up to 1600x1200 pixels at the real time video rate of 116 frames\nper second. This shows that the proposed design would work for not only still\nimages but also for high resolution video sequences.\n", "versions": [{"version": "v1", "created": "Sun, 14 Sep 2014 10:24:04 GMT"}], "update_date": "2014-09-16", "authors_parsed": [["Hanumantharaju", "M. C.", ""], ["Ravishankar", "M.", ""], ["Rameshbabu", "D. R.", ""]]}, {"id": "1409.4744", "submitter": "Jun Lin", "authors": "Jun Lin and Zhiyuan Yan", "title": "An Efficient List Decoder Architecture for Polar Codes", "comments": "12 pages, accepted by IEEE TVLSI Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Long polar codes can achieve the symmetric capacity of arbitrary binary-input\ndiscrete memoryless channels under a low complexity successive cancelation (SC)\ndecoding algorithm. However, for polar codes with short and moderate code\nlength, the decoding performance of the SC algorithm is inferior. The cyclic\nredundancy check (CRC) aided successive cancelation list (SCL) decoding\nalgorithm has better error performance than the SC algorithm for short or\nmoderate polar codes. In this paper, we propose an efficient list decoder\narchitecture for the CRC aided SCL algorithm, based on both algorithmic\nreformulations and architectural techniques. In particular, an area efficient\nmessage memory architecture is proposed to reduce the area of the proposed\ndecoder architecture. An efficient path pruning unit suitable for large list\nsize is also proposed. For a polar code of length 1024 and rate $\\frac{1}{2}$,\nwhen list size $L=2$ and 4, the proposed list decoder architecture is\nimplemented under a TSMC 90nm CMOS technology. Compared with the list decoders\nin the literature, our decoder achieves 1.33 to 1.96 times hardware efficiency.\n", "versions": [{"version": "v1", "created": "Tue, 16 Sep 2014 19:39:49 GMT"}, {"version": "v2", "created": "Sun, 16 Nov 2014 15:59:04 GMT"}], "update_date": "2014-11-18", "authors_parsed": [["Lin", "Jun", ""], ["Yan", "Zhiyuan", ""]]}, {"id": "1409.5567", "submitter": "Yanchao Lu", "authors": "Yanchao Lu, Donghong Wu, Bingsheng He, Xueyan Tang, Jianliang Xu and\n  Minyi Guo", "title": "Rank-Aware Dynamic Migrations and Adaptive Demotions for DRAM Power\n  Management", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": "SJTU-CSE-13-2", "categories": "cs.PF cs.AR cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern DRAM architectures allow a number of low-power states on individual\nmemory ranks for advanced power management. Many previous studies have taken\nadvantage of demotions on low-power states for energy saving. However, most of\nthe demotion schemes are statically performed on a limited number of\npre-selected low-power states, and are suboptimal for different workloads and\nmemory architectures. Even worse, the idle periods are often too short for\neffective power state transitions, especially for memory intensive\napplications. Wrong decisions on power state transition incur significant\nenergy and delay penalties. In this paper, we propose a novel memory system\ndesign named RAMZzz with rank-aware energy saving optimizations including\ndynamic page migrations and adaptive demotions. Specifically, we group the\npages with similar access locality into the same rank with dynamic page\nmigrations. Ranks have their hotness: hot ranks are kept busy for high\nutilization and cold ranks can have more lengthy idle periods for power state\ntransitions. We further develop adaptive state demotions by considering all\nlow-power states for each rank and a prediction model to estimate the\npower-down timeout among states. We experimentally compare our algorithm with\nother energy saving policies with cycle-accurate simulation. Experiments with\nbenchmark workloads show that RAMZzz achieves significant improvement on\nenergy-delay2 and energy consumption over other energy saving techniques.\n", "versions": [{"version": "v1", "created": "Fri, 19 Sep 2014 09:30:49 GMT"}], "update_date": "2014-09-22", "authors_parsed": [["Lu", "Yanchao", ""], ["Wu", "Donghong", ""], ["He", "Bingsheng", ""], ["Tang", "Xueyan", ""], ["Xu", "Jianliang", ""], ["Guo", "Minyi", ""]]}, {"id": "1409.8018", "submitter": "C. John Deepu", "authors": "C.J. Deepu, X. Zhang, W.-S. Liew, D. L.T. Wong, Y. Lian", "title": "An ECG-on-Chip with 535-nW/Channel Integrated Lossless Data Compressor\n  for Wireless Sensors", "comments": null, "journal-ref": "IEEE Journal of Solid-State Circuits, Nov 2014", "doi": "10.1109/JSSC.2014.2349994", "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a low-power ECG recording system-on-chip (SoC) with\non-chip low-complexity lossless ECG compression for data reduction in\nwireless/ambulatory ECG sensor devices. The chip uses a linear slope predictor\nfor data compression, and incorporates a novel low-complexity dynamic\ncoding-packaging scheme to frame the prediction error into fixed-length 16-bit\nformat. The proposed technique achieves an average compression ratio of 2.25x\non MIT/BIH ECG database. Implemented in a standard 0.35 um process, the\ncompressor uses 0.565K gates/channel occupying 0.4 mm2 for four channels, and\nconsumes 535 nW/channel at 2.4 V for ECG sampled at 512 Hz. Small size and\nultra-low power consumption makes the proposed technique suitable for wearable\nECG sensor applications.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2014 08:06:04 GMT"}], "update_date": "2014-09-30", "authors_parsed": [["Deepu", "C. J.", ""], ["Zhang", "X.", ""], ["Liew", "W. -S.", ""], ["Wong", "D. L. T.", ""], ["Lian", "Y.", ""]]}, {"id": "1409.8020", "submitter": "Deepu John", "authors": "C.J. Deepu, X.Y. Xu, X.D. Zou, L.B. Yao, and Y. Lian", "title": "An ECG-on-Chip for Wearable Cardiac Monitoring Devices", "comments": null, "journal-ref": "5th IEEE International Symposium on Electronic Design Test and\n  Applications 2010", "doi": "10.1109/DELTA.2010.43", "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a highly integrated, low power chip solution for ECG\nsignal processing in wearable devices. The chip contains an instrumentation\namplifier with programmable gain, a band-pass filter, a 12-bit SAR ADC, a novel\nQRS detector, 8K on-chip SRAM, and relevant control circuitry and CPU\ninterfaces. The analog front end circuits accurately senses and digitizes the\nraw ECG signal, which is then filtered to extract the QRS. The sampling\nfrequency used is 256 Hz. ECG samples are buffered locally on an asynchronous\nFIFO and is read out using a faster clock, as and when it is required by the\nhost CPU via an SPI interface. The chip was designed and implemented in 0.35um\nstandard CMOS process. The analog core operates at 1V while the digital\ncircuits and SRAM operate at 3.3V. The chip total core area is 5.74 mm^2 and\nconsumes 9.6uW. Small size and low power consumption make this design suitable\nfor usage in wearable heart monitoring devices.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2014 08:14:15 GMT"}], "update_date": "2014-09-30", "authors_parsed": [["Deepu", "C. J.", ""], ["Xu", "X. Y.", ""], ["Zou", "X. D.", ""], ["Yao", "L. B.", ""], ["Lian", "Y.", ""]]}]