[{"id": "1902.01321", "submitter": "Xiaohu Wu", "authors": "Xiaohu Wu, Francesco De Pellegrini, Guanyu Gao and Giuliano Casale", "title": "A Framework for Allocating Server Time to Spot and On-demand Services in\n  Cloud Computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing delivers value to users by facilitating their access to\ncomputing capacity in periods when their need arises. An approach is to provide\nboth on-demand and spot services on shared servers. The former allows users to\naccess servers on demand at a fixed price and users occupy different periods of\nservers. The latter allows users to bid for the remaining unoccupied periods\nvia dynamic pricing; however, without appropriate design, such periods may be\narbitrarily small since on-demand users arrive randomly. This is also the\ncurrent service model adopted by Amazon Elastic Cloud Compute. In this paper,\nwe provide the first integral framework for sharing the time of servers between\non-demand and spot services while optimally pricing spot instances. It\nguarantees that on-demand users can get served quickly while spot users can\nstably utilize servers for a properly long period once accepted, which is a key\nfeature to make both on-demand and spot services accessible. Simulation results\nshow that, by complementing the on-demand market with a spot market, a cloud\nprovider can improve revenue by up to 464.7%. The framework is designed under\nassumptions which are met in real environments. It is a new tool that cloud\noperators can use to quantify the advantage of a hybrid spot and on-demand\nservice, eventually making the case for operating such service model in their\nown infrastructures.\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2019 17:18:22 GMT"}, {"version": "v2", "created": "Sun, 1 Sep 2019 15:38:27 GMT"}], "update_date": "2019-09-04", "authors_parsed": [["Wu", "Xiaohu", ""], ["De Pellegrini", "Francesco", ""], ["Gao", "Guanyu", ""], ["Casale", "Giuliano", ""]]}, {"id": "1902.01461", "submitter": "Goran \\v{Z}u\\v{z}i\\'c", "authors": "Domagoj Bradac and Sahil Singla and Goran Zuzic", "title": "(Near) Optimal Adaptivity Gaps for Stochastic Multi-Value Probing", "comments": "Added the hyperlinks (they got removed for some reason in the last\n  submission)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a kidney-exchange application where we want to find a max-matching\nin a random graph. To find whether an edge $e$ exists, we need to perform an\nexpensive test, in which case the edge $e$ appears independently with a\n\\emph{known} probability $p_e$. Given a budget on the total cost of the tests,\nour goal is to find a testing strategy that maximizes the expected maximum\nmatching size.\n  The above application is an example of the stochastic probing problem. In\ngeneral the optimal stochastic probing strategy is difficult to find because it\nis \\emph{adaptive}---decides on the next edge to probe based on the outcomes of\nthe probed edges. An alternate approach is to show the \\emph{adaptivity gap} is\nsmall, i.e., the best \\emph{non-adaptive} strategy always has a value close to\nthe best adaptive strategy. This allows us to focus on designing non-adaptive\nstrategies that are much simpler. Previous works, however, have focused on\nBernoulli random variables that can only capture whether an edge appears or\nnot. In this work we introduce a multi-value stochastic probing problem, which\ncan also model situations where the weight of an edge has a probability\ndistribution over multiple values.\n  Our main technical contribution is to obtain (near) optimal bounds for the\n(worst-case) adaptivity gaps for multi-value stochastic probing over\nprefix-closed constraints. For a monotone submodular function, we show the\nadaptivity gap is at most $2$ and provide a matching lower bound. For a\nweighted rank function of a $k$-extendible system (a generalization of\nintersection of $k$ matroids), we show the adaptivity gap is between $O(k\\log\nk)$ and $k$. None of these results were known even in the Bernoulli case where\nboth our upper and lower bounds also apply, thereby resolving an open question\nof Gupta et al.\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2019 21:24:43 GMT"}, {"version": "v2", "created": "Wed, 6 Feb 2019 02:49:31 GMT"}], "update_date": "2019-02-07", "authors_parsed": [["Bradac", "Domagoj", ""], ["Singla", "Sahil", ""], ["Zuzic", "Goran", ""]]}, {"id": "1902.01754", "submitter": "Po-An Chen", "authors": "Po-An Chen, Chi-Jen Lu, Yu-Sin Lu", "title": "An Alternating Algorithm for Finding Linear Arrow-Debreu Market\n  Equilibria", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the convergence result of mirror-descent algorithms to market\nequilibria in linear Fisher markets, it is natural for one to consider\ndesigning dynamics (specifically, iterative algorithms) for agents to arrive at\nlinear Arrow-Debreu market equilibria. Jain reduced equilibrium computation in\nlinear Arrow-Debreu markets to the equilibrium computation in bijective\nmarkets, where everyone is a seller of only one good and a buyer for a bundle\nof goods. In this paper, we design an algorithm for computing linear bijective\nmarket equilibrium, based on solving the rational convex program formulated by\nDevanur et al. The algorithm repeatedly alternates between a step of\ngradient-descent-like updates and a distributed step of optimization exploiting\nthe property of such convex program. Convergence can be ensured by a new\nanalysis different from the analysis for linear Fisher market equilibria.\n", "versions": [{"version": "v1", "created": "Tue, 5 Feb 2019 15:53:07 GMT"}, {"version": "v2", "created": "Thu, 27 Jun 2019 18:14:42 GMT"}, {"version": "v3", "created": "Thu, 18 Jul 2019 17:20:38 GMT"}, {"version": "v4", "created": "Thu, 12 Mar 2020 16:39:27 GMT"}], "update_date": "2020-03-13", "authors_parsed": [["Chen", "Po-An", ""], ["Lu", "Chi-Jen", ""], ["Lu", "Yu-Sin", ""]]}, {"id": "1902.02429", "submitter": "Haoran Yu", "authors": "Haoran Yu, Ermin Wei, and Randall A. Berry", "title": "Analyzing Location-Based Advertising for Vehicle Service Providers Using\n  Effective Resistances", "comments": null, "journal-ref": null, "doi": "10.1145/3311077", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicle service providers can display commercial ads in their vehicles based\non passengers' origins and destinations to create a new revenue stream. In this\nwork, we study a vehicle service provider who can generate different ad\nrevenues when displaying ads on different arcs (i.e., origin-destination\npairs). The provider needs to ensure the vehicle flow balance at each location,\nwhich makes it challenging to analyze the provider's vehicle assignment and\npricing decisions for different arcs. For example, the provider's price for its\nservice on an arc depends on the ad revenues on other arcs as well as on the\narc in question. To tackle the problem, we show that the traffic network\ncorresponds to an electrical network. When the effective resistance between two\nlocations is small, there are many paths between the two locations and the\nprovider can easily route vehicles between them. We characterize the dependence\nof an arc's optimal price on any other arc's ad revenue using the effective\nresistances between these two arcs' origins and destinations. Furthermore, we\nstudy the provider's optimal selection of advertisers when it can only display\nads for a limited number of advertisers. If each advertiser has one target arc\nfor advertising, the provider should display ads for the advertiser whose\ntarget arc has a small effective resistance. We investigate the performance of\nour advertiser selection strategy based on a real-world dataset.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2019 23:28:49 GMT"}], "update_date": "2019-02-08", "authors_parsed": [["Yu", "Haoran", ""], ["Wei", "Ermin", ""], ["Berry", "Randall A.", ""]]}, {"id": "1902.02935", "submitter": "Rodrigo Velez", "authors": "Rodrigo A. Velez", "title": "Expressive mechanisms for equitable rent division on a budget", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the incentive properties of envy-free mechanisms for the allocation\nof rooms and payments of rent among financially constrained roommates. Each\nagent reports her values for rooms, her housing earmark (soft budget), and an\nindex that reflects the difficulty the agent experiences from having to pay\nover this amount. Then an envy-free allocation for these reports is\nrecommended. The complete information non-cooperative outcomes of each of these\nmechanisms are exactly the envy-free allocations with respect to true\npreferences if and only if the admissible budget violation indices have a\nbound.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2019 04:35:33 GMT"}, {"version": "v2", "created": "Tue, 11 Feb 2020 04:25:08 GMT"}, {"version": "v3", "created": "Fri, 17 Apr 2020 16:51:47 GMT"}], "update_date": "2020-04-20", "authors_parsed": [["Velez", "Rodrigo A.", ""]]}, {"id": "1902.03266", "submitter": "Arjun Seshadri", "authors": "Arjun Seshadri, Alexander Peysakhovich, Johan Ugander", "title": "Discovering Context Effects from Raw Choice Data", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many applications in preference learning assume that decisions come from the\nmaximization of a stable utility function. Yet a large experimental literature\nshows that individual choices and judgements can be affected by \"irrelevant\"\naspects of the context in which they are made. An important class of such\ncontexts is the composition of the choice set. In this work, our goal is to\ndiscover such choice set effects from raw choice data. We introduce an\nextension of the Multinomial Logit (MNL) model, called the context dependent\nrandom utility model (CDM), which allows for a particular class of choice set\neffects. We show that the CDM can be thought of as a second-order approximation\nto a general choice system, can be inferred optimally using maximum likelihood\nand, importantly, is easily interpretable. We apply the CDM to both real and\nsimulated choice data to perform principled exploratory analyses for the\npresence of choice set effects.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2019 19:37:00 GMT"}, {"version": "v2", "created": "Fri, 31 Jan 2020 20:30:43 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Seshadri", "Arjun", ""], ["Peysakhovich", "Alexander", ""], ["Ugander", "Johan", ""]]}, {"id": "1902.03506", "submitter": "Anibal Sanjab", "authors": "Anibal Sanjab, Walid Saad, and Tamer Ba\\c{s}ar", "title": "A Game of Drones: Cyber-Physical Security of Time-Critical UAV\n  Applications with Cumulative Prospect Theory Perceptions and Valuations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel mathematical framework is introduced for modeling and\nanalyzing the cyber-physical security of time-critical UAV applications. A\ngeneral UAV security network interdiction game is formulated to model\ninteractions between a UAV operator and an interdictor, each of which can be\nbenign or malicious. In this game, the interdictor chooses the optimal\nlocation(s) from which to target the drone system by interdicting the potential\npaths of the UAVs. Meanwhile, the UAV operator responds by finding an optimal\npath selection policy that enables its UAVs to evade attacks and minimize their\nmission completion time. New notions from cumulative prospect theory (PT) are\nincorporated into the game to capture the operator's and interdictor's\nsubjective valuations of mission completion times and perceptions of the risk\nlevels facing the UAVs. The equilibrium of the game, with and without PT, is\nthen analytically characterized and studied. Novel algorithms are then proposed\nto reach the game's equilibria under both PT and classical game theory.\nSimulation results show the properties of the equilibrium for both the rational\nand PT cases. The results show that the operator's and interdictor's bounded\nrationality is more likely to be disadvantageous to the UAV operator.\n", "versions": [{"version": "v1", "created": "Sat, 9 Feb 2019 22:30:58 GMT"}, {"version": "v2", "created": "Fri, 7 Feb 2020 23:00:34 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Sanjab", "Anibal", ""], ["Saad", "Walid", ""], ["Başar", "Tamer", ""]]}, {"id": "1902.03588", "submitter": "Stavros Gerakaris", "authors": "Stavros Gerakaris and Subramanian Ramamoorthy", "title": "Learning Best Response Strategies for Agents in Ad Exchanges", "comments": null, "journal-ref": "EUMAS 2018, LNAI 11450, pp. 1-17, 2019", "doi": "10.1007/978-3-030-14174-5_6", "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ad exchanges are widely used in platforms for online display advertising.\nAutonomous agents operating in these exchanges must learn policies for\ninteracting profitably with a diverse, continually changing, but unknown\nmarket. We consider this problem from the perspective of a publisher,\nstrategically interacting with an advertiser through a posted price mechanism.\nThe learning problem for this agent is made difficult by the fact that\ninformation is censored, i.e., the publisher knows if an impression is sold but\nno other quantitative information. We address this problem using the\nHarsanyi-Bellman Ad Hoc Coordination (HBA) algorithm, which conceptualises this\ninteraction in terms of a Stochastic Bayesian Game and arrives at optimal\nactions by best responding with respect to probabilistic beliefs maintained\nover a candidate set of opponent behaviour profiles. We adapt and apply HBA to\nthe censored information setting of ad exchanges. Also, addressing the case of\nstochastic opponents, we devise a strategy based on a Kaplan-Meier estimator\nfor opponent modelling. We evaluate the proposed method using simulations\nwherein we show that HBA-KM achieves substantially better competitive ratio and\nlower variance of return than baselines, including a Q-learning agent and a\nUCB-based online learning agent, and comparable to the offline optimal\nalgorithm.\n", "versions": [{"version": "v1", "created": "Sun, 10 Feb 2019 12:44:13 GMT"}], "update_date": "2019-02-12", "authors_parsed": [["Gerakaris", "Stavros", ""], ["Ramamoorthy", "Subramanian", ""]]}, {"id": "1902.03676", "submitter": "Mehrdad Valizadeh", "authors": "Mehrdad Valizadeh, Amin Gohari", "title": "Playing Games with Bounded Entropy: Convergence Rate and Approximate\n  Equilibria", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider zero-sum repeated games in which the players are restricted to\nstrategies that require only a limited amount of randomness. Let $v_n$ be the\nmax-min value of the $n$ stage game; previous works have characterized\n$\\lim_{n\\rightarrow\\infty}v_n$, i.e., the long-run max-min value. Our first\ncontribution is to study the convergence rate of $v_n$ to its limit. To this\nend, we provide a new tool for simulation of a source (target source) from\nanother source (coin source). Considering the total variation distance as the\nmeasure of precision, this tool offers an upper bound for the precision of\nsimulation, which is vanishing exponentially in the difference of R\\'enyi\nentropies of the coin and target sources. In the second part of paper, we\ncharacterize the set of all approximate Nash equilibria achieved in long run.\nIt turns out that this set is in close relation with the long-run max-min\nvalue.\n", "versions": [{"version": "v1", "created": "Sun, 10 Feb 2019 21:55:33 GMT"}], "update_date": "2019-02-12", "authors_parsed": [["Valizadeh", "Mehrdad", ""], ["Gohari", "Amin", ""]]}, {"id": "1902.03779", "submitter": "Nicola Gatti", "authors": "Matteo Castiglioni and Diodato Ferraioli and Giulia Landriani and\n  Nicola Gatti", "title": "Election Manipulation on Social Networks with Messages on Multiple\n  Candidates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of election control through social influence when the\nmanipulator is allowed to use the locations that she acquired on the network\nfor sending \\emph{both} positive and negative messages on \\emph{multiple}\ncandidates, widely extending the previous results available in the literature\nthat study the influence of a single message on a single candidate. In\nparticular, we provide a tight characterization of the settings in which the\nmaximum increase in the margin of victory can be efficiently approximated and\nof those in which any approximation turns out to be impossible. We also show\nthat, in simple networks, a large class of algorithms, mainly including all\napproaches recently adopted for social-influence problems, fail to compute a\nbounded approximation even on very simple networks, as undirected graphs with\nevery node having a degree at most two or directed trees. Finally, we\ninvestigate various extensions and generalizations of the model.\n", "versions": [{"version": "v1", "created": "Mon, 11 Feb 2019 08:56:20 GMT"}, {"version": "v2", "created": "Wed, 13 Feb 2019 12:59:12 GMT"}], "update_date": "2019-02-14", "authors_parsed": [["Castiglioni", "Matteo", ""], ["Ferraioli", "Diodato", ""], ["Landriani", "Giulia", ""], ["Gatti", "Nicola", ""]]}, {"id": "1902.03889", "submitter": "Jia Xu", "authors": "Lingyun Jiang, Xiaofu Niu, Jia Xu, Dejun Yang, Lijie Xu", "title": "Incentivizing the Workers for Truth Discovery in Crowdsourcing with\n  Copiers", "comments": "12 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crowdsourcing has become an efficient paradigm for performing large scale\ntasks. Truth discovery and incentive mechanism are fundamentally important for\nthe crowdsourcing system. Many truth discovery methods and incentive mechanisms\nfor crowdsourcing have been proposed. However, most of them cannot be applied\nto deal with the crowdsourcing with copiers. To address the issue, we formulate\nthe problem of maximizing the social welfare such that all tasks can be\ncompleted with the least confidence for truth discovery. We design an incentive\nmechanism consisting truth discovery stage and reverse auction stage. In truth\ndiscovery stage, we estimate the truth for each task based on both the\ndependence and accuracy of workers. In reverse auction stage, we design a\ngreedy algorithm to select the winners and determine the payment. Through both\nrigorous theoretical analysis and extensive simulations, we demonstrate that\nthe proposed mechanisms achieve computational efficiency, individual\nrationality, truthfulness, and guaranteed approximation. Moreover, our truth\ndiscovery method shows prominent advantage in terms of precision when there are\ncopiers in the crowdsourcing systems.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2019 08:30:51 GMT"}], "update_date": "2019-02-12", "authors_parsed": [["Jiang", "Lingyun", ""], ["Niu", "Xiaofu", ""], ["Xu", "Jia", ""], ["Yang", "Dejun", ""], ["Xu", "Lijie", ""]]}, {"id": "1902.03899", "submitter": "Alexander Spiegelman", "authors": "Guy Goren and Alexander Spiegelman", "title": "Mind the Mining", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we revisit the mining strategies in proof of work based\ncryptocurrencies and propose two strategies, we call smart and smarter mining,\nthat in many cases strictly dominate honest mining. In contrast to other known\nattacks, like selfish mining, which induce zero-sum games among the miners, the\nstrategies proposed in this paper increase miners' profit by reducing their\nvariable costs (i.e., electricity). Moreover, the proposed strategies are\nviable for much smaller miners than previously known attacks, and surprisingly,\nan attack performed by one miner is profitable for all other miners as well.\n  While saving electricity power is very encouraging for the environment, it is\nless so for the coin's security. The smart/smarter strategies expose the coin\nto under 50\\% attacks and this vulnerability might only grow when new miners\njoin the coin as a response to the increase in profit margins induced by these\nstrategies.\n", "versions": [{"version": "v1", "created": "Mon, 11 Feb 2019 14:38:04 GMT"}, {"version": "v2", "created": "Tue, 12 Feb 2019 10:22:31 GMT"}], "update_date": "2019-02-13", "authors_parsed": [["Goren", "Guy", ""], ["Spiegelman", "Alexander", ""]]}, {"id": "1902.04235", "submitter": "Yanling Zhang", "authors": "Yanling Zhang, Jian Liu, Aming Li", "title": "Effects of empathy on the evolution of fairness in group-structured\n  populations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ultimatum game has been a prominent paradigm in studying the evolution of\nfairness. It predicts that responders should accept any nonzero offer and\nproposers should offer the smallest possible amount according to orthodox game\ntheory. However, the prediction strongly contradicts with experimental findings\nwhere responders usually reject low offers below $20\\%$ and proposers usually\nmake higher offers than expected. To explain the evolution of such fair\nbehaviors, we here introduce empathy in group-structured populations by\nallowing a proportion $\\alpha$ of the population to play empathetic strategies.\nInterestingly, we find that for high mutation probabilities, the mean offer\ndecreases with $\\alpha$ and the mean demand increases, implying empathy\ninhibits the evolution of fairness. For low mutation probabilities, the mean\noffer and demand approach to the fair ones with increasing $\\alpha$, implying\nempathy promotes the evolution of fairness. Furthermore, under both weak and\nstrong intensities of natural selection, we analytically calculate the mean\noffer and demand for different levels of $\\alpha$. Counterintuitively, we\ndemonstrate that although a higher mutation probability leads to a higher level\nof fairness under weak selection, an intermediate mutation probability\ncorresponds to the lowest level of fairness under strong selection. Our study\nprovides systematic insights into the evolutionary origin of fairness in\ngroup-structured populations with empathetic strategies.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2019 04:36:30 GMT"}], "update_date": "2019-02-13", "authors_parsed": [["Zhang", "Yanling", ""], ["Liu", "Jian", ""], ["Li", "Aming", ""]]}, {"id": "1902.04319", "submitter": "Ioannis Caragiannis", "authors": "Ioannis Caragiannis, Nick Gravin, Xin Huang", "title": "Envy-freeness up to any item with high Nash welfare: The virtue of\n  donating items", "comments": "19 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several fairness concepts have been proposed recently in attempts to\napproximate envy-freeness in settings with indivisible goods. Among them, the\nconcept of envy-freeness up to any item (EFX) is arguably the closest to\nenvy-freeness. Unfortunately, EFX allocations are not known to exist except in\na few special cases. We make significant progress in this direction. We show\nthat for every instance with additive valuations, there is an EFX allocation of\na subset of items with a Nash welfare that is at least half of the maximum\npossible Nash welfare for the original set of items. That is, after donating\nsome items to a charity, one can distribute the remaining items in a fair way\nwith high efficiency. This bound is proved to be best possible. Our proof is\nconstructive and highlights the importance of maximum Nash welfare allocation.\nStarting with such an allocation, our algorithm decides which items to donate\nand redistributes the initial bundles to the agents, eventually obtaining an\nallocation with the claimed efficiency guarantee. The application of our\nalgorithm to large markets, where the valuations of an agent for every item is\nrelatively small, yields EFX with almost optimal Nash welfare. To the best of\nour knowledge, this is the first use of large market assumptions in the fair\ndivision literature. We also show that our algorithm can be modified to\ncompute, in polynomial-time, EFX allocations that approximate optimal Nash\nwelfare within a factor of at most $2\\rho$, using a $\\rho$-approximate\nallocation on input instead of the maximum Nash welfare one.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2019 10:35:10 GMT"}], "update_date": "2019-02-13", "authors_parsed": [["Caragiannis", "Ioannis", ""], ["Gravin", "Nick", ""], ["Huang", "Xin", ""]]}, {"id": "1902.04618", "submitter": "Mahmoud Elfar", "authors": "Mahmoud Elfar, Yu Wang, Miroslav Pajic", "title": "Security-Aware Synthesis Using Delayed-Action Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO cs.SE cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic multiplayer games (SMGs) have gained attention in the field of\nstrategy synthesis for multi-agent reactive systems. However, standard SMGs are\nlimited to modeling systems where all agents have full knowledge of the state\nof the game. In this paper, we introduce delayed-action games (DAGs) formalism\nthat simulates hidden-information games (HIGs) as SMGs, where hidden\ninformation is captured by delaying a player's actions. The elimination of\nprivate variables enables the usage of SMG off-the-shelf model checkers to\nimplement HIGs. Furthermore, we demonstrate how a DAG can be decomposed into\nsubgames that can be independently explored, utilizing parallel computation to\nreduce the model checking time, while alleviating the state space explosion\nproblem that SMGs are notorious for. In addition, we propose a DAG-based\nframework for strategy synthesis and analysis. Finally, we demonstrate\napplicability of the DAG-based synthesis framework on a case study of a\nhuman-on-the-loop unmanned-aerial vehicle system under stealthy attacks, where\nthe proposed framework is used to formally model, analyze and synthesize\nsecurity-aware strategies for the system.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2019 20:19:58 GMT"}, {"version": "v2", "created": "Thu, 30 May 2019 03:03:48 GMT"}], "update_date": "2019-05-31", "authors_parsed": [["Elfar", "Mahmoud", ""], ["Wang", "Yu", ""], ["Pajic", "Miroslav", ""]]}, {"id": "1902.04635", "submitter": "Yaonan Jin", "authors": "Nick Gravin, Yaonan Jin, Pinyan Lu, Chenhao Zhang", "title": "Optimal Budget-Feasible Mechanisms for Additive Valuations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we show a tight approximation guarantee for budget-feasible\nmechanisms with an additive buyer. We propose a new simple randomized mechanism\nwith approximation ratio of $2$, improving the previous best known result of\n$3$. Our bound is tight with respect to either the optimal offline benchmark,\nor its fractional relaxation. We also present a simple deterministic mechanism\nwith the tight approximation guarantee of $3$ against the fractional optimum,\nimproving the best known result of $(2+ \\sqrt{2})$ for the weaker integral\nbenchmark.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2019 21:08:08 GMT"}, {"version": "v2", "created": "Tue, 21 Jul 2020 00:39:22 GMT"}], "update_date": "2020-07-22", "authors_parsed": [["Gravin", "Nick", ""], ["Jin", "Yaonan", ""], ["Lu", "Pinyan", ""], ["Zhang", "Chenhao", ""]]}, {"id": "1902.04667", "submitter": "Shen Su", "authors": "Zhihong Tian, Xiangsong Gao, Shen Su, Jing Qiu, Xiaojiang Du, and\n  Mohsen Guizani", "title": "Evaluating Reputation Management Schemes of Internet of Vehicles based\n  on Evolutionary Game Theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conducting reputation management is very important for Internet of vehicles.\nHowever, most of the existing researches evaluate the effectiveness of their\nschemes with settled attacking behaviors in their simulation which cannot\nrepresent the scenarios in reality. In this paper, we propose to consider\ndynamical and diversity attacking strategies in the simulation of reputation\nmanagement scheme evaluation. To that end, we apply evolutionary game theory to\nmodel the evolution process of malicious users' attacking strategies, and\ndiscuss the methodology of the evaluation simulations. We further apply our\nevaluation method to a reputation management scheme with multiple utility\nfunctions, and discuss the evaluation results. The results indicate that our\nevaluation method is able to depict the evolving process of the dynamic\nattacking strategies in a vehicular network, and the final state of the\nsimulation could be used to quantify the protection effectiveness of the\nreputation management scheme.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2019 23:01:50 GMT"}], "update_date": "2019-02-14", "authors_parsed": [["Tian", "Zhihong", ""], ["Gao", "Xiangsong", ""], ["Su", "Shen", ""], ["Qiu", "Jing", ""], ["Du", "Xiaojiang", ""], ["Guizani", "Mohsen", ""]]}, {"id": "1902.04735", "submitter": "Sampson Wong", "authors": "Joachim Gudmundsson and Sampson Wong", "title": "Computing the Yolk in Spatial Voting Games without Computing Median\n  Lines", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The yolk is an important concept in spatial voting games as it generalises\nthe equilibrium and provides bounds on the uncovered set. We present\nnear-linear time algorithms for computing the yolk in the spatial voting model\nin the plane. To the best of our knowledge our algorithm is the first algorithm\nthat does not require precomputing the median lines and hence able to break the\nexisting $O(n^{4/3})$ bound which equals the known upper bound on the number of\nmedian lines. We avoid this requirement by using Megiddo's parametric search,\nwhich is a powerful framework that could lead to faster algorithms for many\nother spatial voting problems.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2019 04:16:10 GMT"}], "update_date": "2019-02-14", "authors_parsed": [["Gudmundsson", "Joachim", ""], ["Wong", "Sampson", ""]]}, {"id": "1902.04982", "submitter": "Gabriele Farina", "authors": "Gabriele Farina, Christian Kroer, Noam Brown, Tuomas Sandholm", "title": "Stable-Predictive Optimistic Counterfactual Regret Minimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG math.OC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The CFR framework has been a powerful tool for solving large-scale\nextensive-form games in practice. However, the theoretical rate at which past\nCFR-based algorithms converge to the Nash equilibrium is on the order of\n$O(T^{-1/2})$, where $T$ is the number of iterations. In contrast, first-order\nmethods can be used to achieve a $O(T^{-1})$ dependence on iterations, yet\nthese methods have been less successful in practice. In this work we present\nthe first CFR variant that breaks the square-root dependence on iterations. By\ncombining and extending recent advances on predictive and stable regret\nminimizers for the matrix-game setting we show that it is possible to leverage\n\"optimistic\" regret minimizers to achieve a $O(T^{-3/4})$ convergence rate\nwithin CFR. This is achieved by introducing a new notion of\nstable-predictivity, and by setting the stability of each counterfactual regret\nminimizer relative to its location in the decision tree. Experiments show that\nthis method is faster than the original CFR algorithm, although not as fast as\nnewer variants, in spite of their worst-case $O(T^{-1/2})$ dependence on\niterations.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2019 16:18:21 GMT"}], "update_date": "2019-02-14", "authors_parsed": [["Farina", "Gabriele", ""], ["Kroer", "Christian", ""], ["Brown", "Noam", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "1902.05590", "submitter": "Guy Aridor", "authors": "Guy Aridor and Kevin Liu and Aleksandrs Slivkins and Zhiwei Steven Wu", "title": "The Perils of Exploration under Competition: A Computational Modeling\n  Approach", "comments": "This is a preprint of an article accepted for EC 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We empirically study the interplay between exploration and competition.\nSystems that learn from interactions with users often engage in exploration:\nmaking potentially suboptimal decisions in order to acquire new information for\nfuture decisions. However, when multiple systems are competing for the same\nmarket of users, exploration may hurt a system's reputation in the near term,\nwith adverse competitive effects. In particular, a system may enter a \"death\nspiral\", when the short-term reputation cost decreases the number of users for\nthe system to learn from, which degrades its performance relative to\ncompetition and further decreases its market share.\n  We ask whether better exploration algorithms are incentivized under\ncompetition. We run extensive numerical experiments in a stylized duopoly model\nin which two firms deploy multi-armed bandit algorithms and compete for myopic\nusers. We find that duopoly and monopoly tend to favor a primitive \"greedy\nalgorithm\" that does not explore and leads to low consumer welfare, whereas a\ntemporary monopoly (a duopoly with an early entrant) may incentivize better\nbandit algorithms and lead to higher consumer welfare. Our findings shed light\non the first-mover advantage in the digital economy by exploring the role that\ndata can play as a barrier to entry in online markets.\n", "versions": [{"version": "v1", "created": "Thu, 14 Feb 2019 20:16:33 GMT"}, {"version": "v2", "created": "Wed, 1 May 2019 18:25:19 GMT"}], "update_date": "2019-05-03", "authors_parsed": [["Aridor", "Guy", ""], ["Liu", "Kevin", ""], ["Slivkins", "Aleksandrs", ""], ["Wu", "Zhiwei Steven", ""]]}, {"id": "1902.05622", "submitter": "Kedar Dhamdhere", "authors": "Kedar Dhamdhere and Ashish Agarwal and Mukund Sundararajan", "title": "The Shapley Taylor Interaction Index", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The attribution problem, that is the problem of attributing a model's\nprediction to its base features, is well-studied. We extend the notion of\nattribution to also apply to feature interactions.\n  The Shapley value is a commonly used method to attribute a model's prediction\nto its base features. We propose a generalization of the Shapley value called\nShapley-Taylor index that attributes the model's prediction to interactions of\nsubsets of features up to some size k. The method is analogous to how the\ntruncated Taylor Series decomposes the function value at a certain point using\nits derivatives at a different point. In fact, we show that the Shapley Taylor\nindex is equal to the Taylor Series of the multilinear extension of the\nset-theoretic behavior of the model.\n  We axiomatize this method using the standard Shapley axioms -- linearity,\ndummy, symmetry and efficiency -- and an additional axiom that we call the\ninteraction distribution axiom. This new axiom explicitly characterizes how\ninteractions are distributed for a class of functions that model pure\ninteraction.\n  We contrast the Shapley-Taylor index against the previously proposed Shapley\nInteraction index (cf. [9]) from the cooperative game theory literature. We\nalso apply the Shapley Taylor index to three models and identify interesting\nqualitative insights.\n", "versions": [{"version": "v1", "created": "Thu, 14 Feb 2019 22:09:49 GMT"}, {"version": "v2", "created": "Fri, 7 Feb 2020 19:09:02 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Dhamdhere", "Kedar", ""], ["Agarwal", "Ashish", ""], ["Sundararajan", "Mukund", ""]]}, {"id": "1902.05678", "submitter": "Shuichi Miyazaki", "authors": "Koki Hamada, Shuichi Miyazaki, Hiroki Yanagisawa", "title": "Strategy-Proof Approximation Algorithms for the Stable Marriage Problem\n  with Ties and Incomplete Lists", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the stable marriage problem (SM), a mechanism that always outputs a stable\nmatching is called a stable mechanism. One of the well-known stable mechanisms\nis the man-oriented Gale-Shapley algorithm (MGS). MGS has a good property that\nit is strategy-proof to the men's side, i.e., no man can obtain a better\noutcome by falsifying a preference list. We call such a mechanism a\nman-strategy-proof mechanism. Unfortunately, MGS is not a woman-strategy-proof\nmechanism. Roth has shown that there is no stable mechanism that is\nsimultaneously man-strategy-proof and woman-strategy-proof, which is known as\nRoth's impossibility theorem.\n  In this paper, we extend these results to the stable marriage problem with\nties and incomplete lists (SMTI). Since SMTI is an extension of SM, Roth's\nimpossibility theorem takes over to SMTI. Therefore, we focus on the\none-sided-strategy-proofness. In SMTI, one instance can have stable matchings\nof different sizes, and it is natural to consider the problem of finding a\nlargest stable matching, known as MAX SMTI. Thus we incorporate the notion of\napproximation ratio used in the theory of approximation algorithms. We say that\na stable-mechanism is $c$-approximate-stable mechanism if it always returns a\nstable matching of size at least $1/c$ of a largest one. We also consider a\nrestricted variant of MAX SMTI, which we call MAX SMTI-1TM, where only men's\nlists can contain ties.\n  Our results are summarized as follows: (i) MAX SMTI admits both a\nman-strategy-proof 2-approximate-stable mechanism and a woman-strategy-proof\n2-approximate-stable mechanism. (ii) MAX SMTI-1TM admits a woman-strategy-proof\n2-approximate-stable mechanism. (iii) MAX SMTI-1TM admits a man-strategy-proof\n1.5-approximate-stable mechanism. All these results are tight in terms of\napproximation ratios. Also, all these strategy-proofness results apply for\nstrategy-proofness against coalitions.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2019 04:06:50 GMT"}], "update_date": "2019-02-18", "authors_parsed": [["Hamada", "Koki", ""], ["Miyazaki", "Shuichi", ""], ["Yanagisawa", "Hiroki", ""]]}, {"id": "1902.05909", "submitter": "Egor Ianovski", "authors": "Egor Ianovski", "title": "Electing a committee with dominance constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of electing a committee of $k$ candidates, subject to\nsome constraints as to what this committee is supposed to look like. In our\nframework, the candidates are given labels as an abstraction of a politician's\nreligion, a film's genre, a song's language, or other attribute, and the\nelection outcome is constrained by interval constraints -- of the form \"Between\n3 and 5 candidates with label X\" -- and dominance constraints -- \"At least as\nmany candidates with label X as with label Y\". The problem is, what shall we do\nif the committee selected by a given voting rule fails these constraints? In\nthis paper we argue how the logic underlying weakly-separable and best-$k$\nrules can be extended into an ordering of committees, and study the question of\nhow to select the best valid committee with respect to this order. The problem\nis NP-hard, but we show the existence of a polynomial time solution in the case\nof tree-like constraints, and a fixed-parameter tractable algorithm for the\ngeneral case.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2019 17:49:25 GMT"}, {"version": "v2", "created": "Thu, 21 Feb 2019 13:38:14 GMT"}, {"version": "v3", "created": "Wed, 27 Mar 2019 10:14:26 GMT"}, {"version": "v4", "created": "Tue, 30 Apr 2019 12:02:46 GMT"}, {"version": "v5", "created": "Thu, 30 May 2019 15:08:23 GMT"}, {"version": "v6", "created": "Sat, 16 May 2020 12:43:27 GMT"}], "update_date": "2020-05-19", "authors_parsed": [["Ianovski", "Egor", ""]]}, {"id": "1902.06171", "submitter": "Neil Lutz", "authors": "Jack H. Lutz, Neil Lutz, Robyn R. Lutz, Matthew R. Riley", "title": "Robustness and Games Against Nature in Molecular Programming", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.ET cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Matter, especially DNA, is now programmed to carry out useful processes at\nthe nanoscale. As these programs and processes become more complex and their\nenvisioned safety-critical applications approach deployment, it is essential to\ndevelop methods for engineering trustworthiness into molecular programs. Some\nof this can be achieved by adapting existing software engineering methods, but\nmolecular programming also presents new challenges that will require new\nmethods. This paper presents a method for dealing with one such challenge,\nnamely, the difficulty of ascertaining how robust a molecular program is to\nperturbations of the relative \"clock speeds\" of its various reactions. The\nmethod proposed here is game-theoretic. The robustness of a molecular program\nis quantified in terms of its ability to win (achieve its original objective)\nin games against other molecular programs that manipulate its relative clock\nspeeds. This game-theoretic approach is general enough to quantify the security\nof a molecular program against malicious manipulations of its relative clock\nspeeds. However, this preliminary report focuses on games against nature, games\nin which the molecular program's opponent perturbs clock speeds randomly\n(indifferently) according to the probabilities inherent in chemical kinetics.\n", "versions": [{"version": "v1", "created": "Sat, 16 Feb 2019 22:41:51 GMT"}], "update_date": "2019-02-19", "authors_parsed": [["Lutz", "Jack H.", ""], ["Lutz", "Neil", ""], ["Lutz", "Robyn R.", ""], ["Riley", "Matthew R.", ""]]}, {"id": "1902.06243", "submitter": "Nick Gravin", "authors": "Nick Gravin and Hongao Wang", "title": "Prophet inequality for bipartite matching: merits of being simple and\n  non adaptive", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.DS math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider Bayesian online selection problem of a matching in bipartite\ngraphs, i.e., online weighted matching problem with edge arrivals where online\nalgorithm knows distributions of weights, that corresponds to the intersection\nof two matroids in [Kleinberg and Wienberg STOC 12] model. We consider a simple\nclass of non adaptive vertex-additive policies that assign static prices to all\nvertices in the graph and accept each edge only if its weight exceeds the sum\nof the prices of the edge's endpoints. We show existence of a vertex-additive\npolicy with the expected payoff of at least one third of the prophet's payoff\nand present gradient decent type algorithm that quickly converges to the\ndesired vector of vertex prices. This improves the adaptive online policy of\n[Kleinberg and Wienberg STOC 12] for the intersection of two matroids in two\nways: our policy is non adaptive and has better approximation guarantee of $3$\ninstead of previous guarantee of $5.82$ against the prophet. We give a\ncomplementary lower bound of $2.25$ for any online algorithm in the bipartite\nmatching setting.\n", "versions": [{"version": "v1", "created": "Sun, 17 Feb 2019 10:51:49 GMT"}], "update_date": "2019-02-19", "authors_parsed": [["Gravin", "Nick", ""], ["Wang", "Hongao", ""]]}, {"id": "1902.06335", "submitter": "Christian Kroer", "authors": "Christian Kroer and Tuomas Sandholm", "title": "Limited Lookahead in Imperfect-Information Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Limited lookahead has been studied for decades in perfect-information games.\nWe initiate a new direction via two simultaneous deviation points:\ngeneralization to imperfect-information games and a game-theoretic approach. We\nstudy how one should act when facing an opponent whose lookahead is limited. We\nstudy this for opponents that differ based on their lookahead depth, based on\nwhether they, too, have imperfect information, and based on how they break\nties. We characterize the hardness of finding a Nash equilibrium or an optimal\ncommitment strategy for either player, showing that in some of these variations\nthe problem can be solved in polynomial time while in others it is PPAD-hard,\nNP-hard, or inapproximable. We proceed to design algorithms for computing\noptimal commitment strategies---for when the opponent breaks ties favorably,\naccording to a fixed rule, or adversarially. We then experimentally investigate\nthe impact of limited lookahead. The limited-lookahead player often obtains the\nvalue of the game if she knows the expected values of nodes in the game tree\nfor some equilibrium---but we prove this is not sufficient in general. Finally,\nwe study the impact of noise in those estimates and different lookahead depths.\n", "versions": [{"version": "v1", "created": "Sun, 17 Feb 2019 21:50:05 GMT"}, {"version": "v2", "created": "Thu, 19 Mar 2020 13:42:28 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Kroer", "Christian", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "1902.06698", "submitter": "Rohit Vaish", "authors": "Ioannis Caragiannis, Aris Filos-Ratsikas, Panagiotis Kanellopoulos,\n  Rohit Vaish", "title": "Stable Fractional Matchings", "comments": "Accepted to Artificial Intelligence (AIJ)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a generalization of the classical stable matching problem that\nallows for cardinal preferences (as opposed to ordinal) and fractional\nmatchings (as opposed to integral). After observing that, in this cardinal\nsetting, stable fractional matchings can have much higher social welfare than\nstable integral ones, our goal is to understand the computational complexity of\nfinding an optimal (i.e., welfare-maximizing) or nearly-optimal stable\nfractional matching. We present simple approximation algorithms for this\nproblem with weak welfare guarantees and, rather unexpectedly, we furthermore\nshow that achieving better approximations is hard. This computational hardness\npersists even for approximate stability. To the best of our knowledge, these\nare the first computational complexity results for stable fractional matchings.\nEn route to these results, we provide a number of structural observations.\n", "versions": [{"version": "v1", "created": "Mon, 18 Feb 2019 18:06:57 GMT"}, {"version": "v2", "created": "Thu, 24 Dec 2020 13:40:24 GMT"}], "update_date": "2020-12-25", "authors_parsed": [["Caragiannis", "Ioannis", ""], ["Filos-Ratsikas", "Aris", ""], ["Kanellopoulos", "Panagiotis", ""], ["Vaish", "Rohit", ""]]}, {"id": "1902.06908", "submitter": "Aleck Johnsen", "authors": "Jason Hartline, Aleck Johnsen, Denis Nekipelov, Zihe Wang", "title": "Inference from Auction Prices", "comments": null, "journal-ref": "Proceedings of the 2020 ACM-SIAM Symposium on Discrete Algorithms", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Econometric inference allows an analyst to back out the values of agents in a\nmechanism from the rules of the mechanism and bids of the agents. This paper\ngives an algorithm to solve the problem of inferring the values of agents in a\ndominant-strategy mechanism from the social choice function implemented by the\nmechanism and the per-unit prices paid by the agents (the agent bids are not\nobserved). For single-dimensional agents, this inference problem is a\nmulti-dimensional inversion of the payment identity and is feasible only if the\npayment identity is uniquely invertible. The inversion is unique for\nsingle-unit proportional weights social choice functions (common, for example,\nin bandwidth allocation); and its inverse can be found efficiently. This\ninversion is not unique for social choice functions that exhibit\ncomplementarities. Of independent interest, we extend a result of Rosen (1965),\nthat the Nash equilbria of \"concave games\" are unique and pure, to an\nalternative notion of concavity based on Gale and Nikaido (1965).\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2019 05:43:47 GMT"}, {"version": "v2", "created": "Mon, 30 Mar 2020 15:55:52 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Hartline", "Jason", ""], ["Johnsen", "Aleck", ""], ["Nekipelov", "Denis", ""], ["Wang", "Zihe", ""]]}, {"id": "1902.07011", "submitter": "Aline Parreau", "authors": "Eric Duch\\^ene and Victor Marsault and Aline Parreau and Michel Rigo", "title": "Taking-and-merging games as rewrite games", "comments": null, "journal-ref": "Discrete Mathematics & Theoretical Computer Science, vol. 22 no. 4\n  (September 23, 2020) dmtcs:6795", "doi": "10.23638/DMTCS-22-4-5", "report-no": null, "categories": "cs.FL cs.DM cs.GT math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work is a contribution to the study of rewrite games. Positions are\nfinite words, and the possible moves are defined by a finite number of local\nrewriting rules. We introduce and investigate taking-and-merging games, that\nis, where each rule is of the form a^k->epsilon.\n  We give sufficient conditions for a game to be such that the losing positions\n(resp. the positions with a given Grundy value) form a regular language or a\ncontext-free language. We formulate several related open questions in parallel\nwith the famous conjecture of Guy about the periodicity of the Grundy function\nof octal games.\n  Finally we show that more general rewrite games quickly lead to undecidable\nproblems. Namely, it is undecidable whether there exists a winning position in\na given regular language, even if we restrict to games where each move strictly\nreduces the length of the current position. We formulate several related open\nquestions in parallel with the famous conjecture of Guy about the periodicity\nof the Grundy function of octal games.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2019 12:07:08 GMT"}, {"version": "v2", "created": "Mon, 25 May 2020 07:43:02 GMT"}, {"version": "v3", "created": "Fri, 18 Sep 2020 14:43:55 GMT"}, {"version": "v4", "created": "Mon, 21 Sep 2020 14:31:20 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Duchêne", "Eric", ""], ["Marsault", "Victor", ""], ["Parreau", "Aline", ""], ["Rigo", "Michel", ""]]}, {"id": "1902.07083", "submitter": "Charlotte Roman", "authors": "Charlotte Roman and Paolo Turrini", "title": "How does information affect asymmetric congestion games?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study traffic networks with multiple origin-destination pairs, relaxing\nthe simplifying assumption of agents having complete knowledge of the network\nstructure. We identify a ubiquitous class of networks, i.e., rings, for which\nwe can safely increase the agents' knowledge without affecting their own\noverall performance -- known as immunity to Informational Braess' Paradox --\nclosing a gap in the literature. We also extend our performance measure to\ninclude the welfare of all agents, showing that under this measure IBP is a\nwidespread phenomenon and no network is immune to it.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2019 15:01:21 GMT"}], "update_date": "2019-02-20", "authors_parsed": [["Roman", "Charlotte", ""], ["Turrini", "Paolo", ""]]}, {"id": "1902.07119", "submitter": "Jieming Mao", "authors": "Nicole Immorlica, Jieming Mao, Aleksandrs Slivkins, Zhiwei Steven Wu", "title": "Bayesian Exploration with Heterogeneous Agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is common in recommendation systems that users both consume and produce\ninformation as they make strategic choices under uncertainty. While a social\nplanner would balance \"exploration\" and \"exploitation\" using a multi-armed\nbandit algorithm, users' incentives may tilt this balance in favor of\nexploitation. We consider Bayesian Exploration: a simple model in which the\nrecommendation system (the \"principal\") controls the information flow to the\nusers (the \"agents\") and strives to incentivize exploration via information\nasymmetry. A single round of this model is a version of a well-known \"Bayesian\nPersuasion game\" from [Kamenica and Gentzkow]. We allow heterogeneous users,\nrelaxing a major assumption from prior work that users have the same\npreferences from one time step to another. The goal is now to learn the best\npersonalized recommendations. One particular challenge is that it may be\nimpossible to incentivize some of the user types to take some of the actions,\nno matter what the principal does or how much time she has. We consider several\nversions of the model, depending on whether and when the user types are\nreported to the principal, and design a near-optimal \"recommendation policy\"\nfor each version. We also investigate how the model choice and the diversity of\nuser types impact the set of actions that can possibly be \"explored\" by each\ntype.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2019 16:22:43 GMT"}], "update_date": "2019-02-20", "authors_parsed": [["Immorlica", "Nicole", ""], ["Mao", "Jieming", ""], ["Slivkins", "Aleksandrs", ""], ["Wu", "Zhiwei Steven", ""]]}, {"id": "1902.07173", "submitter": "Angelo Fanelli", "authors": "Ioannis Caragiannis and Angelo Fanelli", "title": "On approximate pure Nash equilibria in weighted congestion games with\n  polynomial latencies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study natural improvement dynamics in weighted congestion games with\npolynomial latencies of maximum degree $d\\geq 1$. We focus on two problems\nregarding the existence and efficiency of approximate pure Nash equilibria,\nwith a reasonable small approximation factor, in these games. By exploiting a\nsimple technique, we firstly show that such a game always admits a\n$d$-approximate potential function. This implies that every sequence of\n$d$-approximate improvement moves by the players leads to a $d$-approximate\npure Nash equilibrium. As a corollary, we also obtain that, under mild\nassumptions on the structure of the players' strategies, the game always admits\na constant approximate potential function. Secondly, using a simple potential\nfunction argument, we are able to show that a $(d+\\delta)$-approximate pure\nNash equilibrium of cost at most $(d+1)/(d+\\delta)$ times the cost of an\noptimal state always exists, for $\\delta\\in [0,1]$.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2019 18:04:51 GMT"}, {"version": "v2", "created": "Sat, 4 May 2019 03:18:29 GMT"}, {"version": "v3", "created": "Wed, 8 May 2019 03:46:54 GMT"}, {"version": "v4", "created": "Mon, 23 Sep 2019 12:53:48 GMT"}, {"version": "v5", "created": "Fri, 6 Nov 2020 07:30:41 GMT"}], "update_date": "2020-11-09", "authors_parsed": [["Caragiannis", "Ioannis", ""], ["Fanelli", "Angelo", ""]]}, {"id": "1902.07266", "submitter": "Wei Lu", "authors": "Wei Lu, Luca Quadrifoglio", "title": "Fair cost allocation for ridesharing services - modeling, mathematical\n  programming and an algorithm to find the nucleolus", "comments": null, "journal-ref": "Transportation Research Part B: Methodological Volume 121, March\n  2019, Pages 41-55, ISSN: 0191-2615", "doi": "10.1016/j.trb.2019.01.001", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses one of the most challenging issues in designing an\nefficient and sustainable ridesharing service: ridesharing market design. We\nformulate it as a fair cost allocation problem through the lens of the\ncooperative game theory. A special property of the cooperative ridesharing game\nis that its characteristic function values are calculated by solving an\noptimization problem. Several concepts of fairness are investigated and special\nattention is paid to a solution concept named nucleolus, which aims to minimize\nthe maximum dissatisfaction in the system. Due to its computational\nintractability, we break the problem into a master-subproblem structure and two\nsubproblems are developed to generate constraints for the master problem. We\npropose a coalition generation procedure to find the nucleolus and approximate\nnucleolus of the game. Experimental results showed that when the game has a\nnon-empty core, in the approximate nucleolus scheme the coalitions are computed\nonly when it is necessary and the approximate procedure produces the actual\nnucleolus. And when the game has an empty core, the approximate nucleolus is\nclose to the actual one. Regardless of the emptiness of the game, our algorithm\nneeds to generate only a small fraction (1.6%) of the total coalition\nconstraints to compute the approximate nucleolus. The proposed model and\nresults nicely fit systems operated by autonomous vehicles.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2019 20:14:42 GMT"}], "update_date": "2019-02-21", "authors_parsed": [["Lu", "Wei", ""], ["Quadrifoglio", "Luca", ""]]}, {"id": "1902.07657", "submitter": "Alexandros Hollender", "authors": "Paul W. Goldberg, Alexandros Hollender", "title": "The Hairy Ball Problem is PPAD-Complete", "comments": "Minor changes in presentation based on reviewers' comments", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Hairy Ball Theorem states that every continuous tangent vector field on\nan even-dimensional sphere must have a zero. We prove that the associated\ncomputational problem of computing an approximate zero is PPAD-complete. We\nalso give a FIXP-hardness result for the general exact computation problem.\n  In order to show that this problem lies in PPAD, we provide new results on\nmultiple-source variants of END-OF-LINE, the canonical PPAD-complete problem.\nIn particular, finding an approximate zero of a Hairy Ball vector field on an\neven-dimensional sphere reduces to a 2-source END-OF-LINE problem. If the\ndomain is changed to be the torus of genus $g \\geq 2$ instead (where the Hairy\nBall Theorem also holds), then the problem reduces to a $2(g-1)$-source\nEND-OF-LINE problem.\n  These multiple-source END-OF-LINE results are of independent interest and\nprovide new tools for showing membership in PPAD. In particular, we use them to\nprovide the first full proof of PPAD-completeness for the IMBALANCE problem\ndefined by Beame et al. in 1998.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2019 17:11:20 GMT"}, {"version": "v2", "created": "Fri, 3 May 2019 14:11:30 GMT"}], "update_date": "2019-05-06", "authors_parsed": [["Goldberg", "Paul W.", ""], ["Hollender", "Alexandros", ""]]}, {"id": "1902.07895", "submitter": "Yackolley Amoussou-Guenou", "authors": "Yackolley Amoussou-Guenou (LIP6, LIST, NPA), Bruno Biais (HEC Paris,\n  TSM), Maria Potop-Butucaru (NPA, LINCS, LIP6), Sara Tucci-Piergiovanni (LIST,\n  DILS)", "title": "Rationals vs Byzantines in Consensus-based Blockchains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we analyze from the game theory point of view Byzantine Fault\nTolerant blockchains when processes exhibit rational or Byzantine behavior. Our\nwork is the first to model the Byzantine-consensus based blockchains as a\ncommittee coordination game. Our first contribution is to offer a\ngame-theoretical methodology to analyse equilibrium interactions between\nByzantine and rational committee members in Byzantine Fault Tolerant\nblockchains. Byzantine processes seek to inflict maximum damage to the system,\nwhile rational processes best-respond to maximise their expected net gains. Our\nsecond contribution is to derive conditions under which consensus properties\nare satisfied or not in equilibrium. When the majority threshold is lower than\nthe proportion of Byzantine processes, invalid blocks are accepted in\nequilibrium. When the majority threshold is large, equilibrium can involve\ncoordination failures , in which no block is ever accepted. However, when the\ncost of accepting invalid blocks is large, there exists an equilibrium in which\nblocks are accepted iff they are valid.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2019 07:44:50 GMT"}], "update_date": "2019-02-22", "authors_parsed": [["Amoussou-Guenou", "Yackolley", "", "LIP6, LIST, NPA"], ["Biais", "Bruno", "", "HEC Paris,\n  TSM"], ["Potop-Butucaru", "Maria", "", "NPA, LINCS, LIP6"], ["Tucci-Piergiovanni", "Sara", "", "LIST,\n  DILS"]]}, {"id": "1902.07937", "submitter": "Alexandros A. Voudouris", "authors": "Edith Elkind, Jiarui Gan, Ayumi Igarashi, Warut Suksompong, Alexandros\n  A. Voudouris", "title": "Schelling Games on Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider strategic games that are inspired by Schelling's model of\nresidential segregation. In our model, the agents are partitioned into k types\nand need to select locations on an undirected graph. Agents can be either\nstubborn, in which case they will always choose their preferred location, or\nstrategic, in which case they aim to maximize the fraction of agents of their\nown type in their neighborhood. We investigate the existence of equilibria in\nthese games, study the complexity of finding an equilibrium outcome or an\noutcome with high social welfare, and also provide upper and lower bounds on\nthe price of anarchy and stability. Some of our results extend to the setting\nwhere the preferences of the agents over their neighbors are defined by a\nsocial network rather than a partition into types.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2019 09:52:33 GMT"}], "update_date": "2019-02-22", "authors_parsed": [["Elkind", "Edith", ""], ["Gan", "Jiarui", ""], ["Igarashi", "Ayumi", ""], ["Suksompong", "Warut", ""], ["Voudouris", "Alexandros A.", ""]]}, {"id": "1902.07986", "submitter": "Amir Kafshdar Goharshady", "authors": "Krishnendu Chatterjee and Amir Kafshdar Goharshady and Arash\n  Pourdamghani", "title": "Probabilistic Smart Contracts: Secure Randomness on the Blockchain", "comments": "Accepted to the 2019 IEEE International Conference on Blockchain and\n  Cryptocurrency (ICBC 2019)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In today's programmable blockchains, smart contracts are limited to being\ndeterministic and non-probabilistic. This lack of randomness is a consequential\nlimitation, given that a wide variety of real-world financial contracts, such\nas casino games and lotteries, depend entirely on randomness. As a result,\nseveral ad-hoc random number generation approaches have been developed to be\nused in smart contracts. These include ideas such as using an oracle or relying\non the block hash. However, these approaches are manipulatable, i.e. their\noutput can be tampered with by parties who might not be neutral, such as the\nowner of the oracle or the miners. We propose a novel game-theoretic approach\nfor generating provably unmanipulatable pseudorandom numbers on the blockchain.\nOur approach allows smart contracts to access a trustworthy source of\nrandomness that does not rely on potentially compromised miners or oracles,\nhence enabling the creation of a new generation of smart contracts that are not\nlimited to being non-probabilistic and can be drawn from the much more general\nclass of probabilistic programs.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2019 11:56:22 GMT"}], "update_date": "2019-02-22", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Goharshady", "Amir Kafshdar", ""], ["Pourdamghani", "Arash", ""]]}, {"id": "1902.08003", "submitter": "Aleksei Kondratev", "authors": "Aleksei Y. Kondratev and Alexander S. Nesterov", "title": "Minimal Envy and Popular Matchings", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study ex-post fairness in the object allocation problem where objects are\nvaluable and commonly owned. A matching is fair from individual perspective if\nit has only inevitable envy towards agents who received most preferred objects\n-- minimal envy matching. A matching is fair from social perspective if it is\nsupported by majority against any other matching -- popular matching.\nSurprisingly, the two perspectives give the same outcome: when a popular\nmatching exists it is equivalent to a minimal envy matching.\n  We show the equivalence between global and local popularity: a matching is\npopular if and only if there does not exist a group of size up to 3 agents that\ndecides to exchange their objects by majority, keeping the remaining matching\nfixed. We algorithmically show that an arbitrary matching is path-connected to\na popular matching where along the path groups of up to 3 agents exchange their\nobjects by majority. A market where random groups exchange objects by majority\nconverges to a popular matching given such matching exists.\n  When popular matching might not exist we define most popular matching as a\nmatching that is popular among the largest subset of agents. We show that each\nminimal envy matching is a most popular matching and propose a polynomial-time\nalgorithm to find them.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2019 12:29:26 GMT"}], "update_date": "2019-02-22", "authors_parsed": [["Kondratev", "Aleksei Y.", ""], ["Nesterov", "Alexander S.", ""]]}, {"id": "1902.08070", "submitter": "Reshef Meir", "authors": "Reshef Meir", "title": "Strategyproof Facility Location for Three Agents on a Circle", "comments": "this is a full version of a paper accepted to SAGT'19. A preliminary\n  version appeared as an extended abstract in AAMAS'19", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the facility location problem in a metric space, focusing on the\ncase of three agents. We show that selecting the reported location of each\nagent with probability proportional to the distance between the other two\nagents results in a mechanism that is strategyproof in expectation, and\ndominates the random dictator mechanism in terms of utilitarian social welfare.\nWe further improve the upper bound for three agents on a circle to 7/6 (whereas\nrandom dictator obtains 4/3); and provide the first lower bounds for randomized\nstrategyproof facility location in any metric space, using linear programming.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2019 14:31:58 GMT"}, {"version": "v2", "created": "Sun, 7 Jul 2019 18:08:10 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Meir", "Reshef", ""]]}, {"id": "1902.08712", "submitter": "Xu Liu", "authors": "Xu Liu, Xiaoqiang Di, Jinqing Li, Huan Wang, Jianping Zhao, Huamin\n  Yang, Ligang Cong", "title": "Allocating Limited Resources to Protect a Massive Number of Targets\n  using a Game Theoretic Model", "comments": "14 pages, 12 figures, 41 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Resource allocation is the process of optimizing the rare resources. In the\narea of security, how to allocate limited resources to protect a massive number\nof targets is especially challenging. This paper addresses this resource\nallocation issue by constructing a game theoretic model. A defender and an\nattacker are players and the interaction is formulated as a trade-off between\nprotecting targets and consuming resources. The action cost which is a\nnecessary role of consuming resource, is considered in the proposed model.\nAdditionally, a bounded rational behavior model (Quantal Response, QR), which\nsimulates a human attacker of the adversarial nature, is introduced to improve\nthe proposed model. To validate the proposed model, we compare the different\nutility functions and resource allocation strategies. The comparison results\nsuggest that the proposed resource allocation strategy performs better than\nothers in the perspective of utility and resource effectiveness.\n", "versions": [{"version": "v1", "created": "Sat, 23 Feb 2019 01:12:36 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Liu", "Xu", ""], ["Di", "Xiaoqiang", ""], ["Li", "Jinqing", ""], ["Wang", "Huan", ""], ["Zhao", "Jianping", ""], ["Yang", "Huamin", ""], ["Cong", "Ligang", ""]]}, {"id": "1902.08930", "submitter": "Palash Dey", "authors": "Palash Dey, Swaprava Nath, Garima Shakya", "title": "Testing Preferential Domains Using Sampling", "comments": "Accepted as a full paper in AAMAS 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A preferential domain is a collection of sets of preferences which are linear\norders over a set of alternatives. These domains have been studied extensively\nin social choice theory due to both its practical importance and theoretical\nelegance. Examples of some extensively studied preferential domains include\nsingle peaked, single crossing, Euclidean, etc. In this paper, we study the\nsample complexity of testing whether a given preference profile is close to\nsome specific domain. We consider two notions of closeness: (a) closeness via\npreferences, and (b) closeness via alternatives. We further explore the effect\nof assuming that the {\\em outlier} preferences/alternatives to be random\n(instead of arbitrary) on the sample complexity of the testing problem. In most\ncases, we show that the above testing problem can be solved with high\nprobability for all commonly used domains by observing only a small number of\nsamples (independent of the number of preferences, $n$, and often the number of\nalternatives, $m$). In the remaining few cases, we prove either impossibility\nresults or $\\Omega(n)$ lower bound on the sample complexity. We complement our\ntheoretical findings with extensive simulations to figure out the actual\nconstant factors of our asymptotic sample complexity bounds.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2019 11:42:13 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Dey", "Palash", ""], ["Nath", "Swaprava", ""], ["Shakya", "Garima", ""]]}, {"id": "1902.09066", "submitter": "Shiheng Wang", "authors": "Shiheng Wang, Fangzhen Lin", "title": "Pure Strategy Best Responses to Mixed Strategies in Repeated Games", "comments": "6 pages, 1 reference page. 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Repeated games are difficult to analyze, especially when agents play mixed\nstrategies. We study one-memory strategies in iterated prisoner's dilemma, then\ngeneralize the result to k-memory strategies in repeated games. Our result\nshows that there always exists a pure strategy best response, which can be\ncomputed with SMT or MDP solvers. However, there may not exist such pure\nstrategy best response in multi-agent tournaments. All source code is released\nfor verification.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 02:41:35 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Wang", "Shiheng", ""], ["Lin", "Fangzhen", ""]]}, {"id": "1902.09089", "submitter": "Song Zuo", "authors": "Yulong Zeng, Song Zuo", "title": "The Matthew Effect in Computation Contests: High Difficulty May Lead to\n  51% Dominance", "comments": "WWW 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the computation contests where players compete for searching a\nsolution to a given problem with a winner-take-all reward. The search processes\nare independent across the players and the search speeds of players are\nproportional to their computational powers. One concrete application of this\nabstract model is the mining process of proof-of-work type blockchain systems,\nsuch as Bitcoin. Although one's winning probability is believed to be\nproportional to his computational power in previous studies on Bitcoin, we show\nthat it is not the case in the strict sense.\n  Because of the gaps between the winning probabilities and the proportions of\ncomputational powers, the Matthew effect will emerge in the system, where the\nrich get richer and the poor get poorer. In addition, we show that allowing the\nplayers to pool with each other or reducing the number of solutions to the\nproblem may aggravate the Matthew effect and vice versa.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 04:54:03 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Zeng", "Yulong", ""], ["Zuo", "Song", ""]]}, {"id": "1902.09213", "submitter": "Georgios Tsaousoglou", "authors": "Georgios Tsaousoglou, Konstantinos Steriotis, Emmanouel Varvarigos", "title": "A stochastic approximation method for price-based assignment of\n  autonomous EVs to Charging Stations", "comments": "extended abstract", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a method for the stochastic estimation of Charging\nStations prices based on dual decomposition. Prices are determined so as to\nminimize the social cost of the EVs while satisfying their constraints in\nexpectation\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 11:55:41 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Tsaousoglou", "Georgios", ""], ["Steriotis", "Konstantinos", ""], ["Varvarigos", "Emmanouel", ""]]}, {"id": "1902.09234", "submitter": "Sandor Kisfaludi-Bak", "authors": "Mark de Berg, S\\'andor Kisfaludi-Bak, Mehran Mehr", "title": "On One-Round Discrete Voronoi Games", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $V$ be a multiset of $n$ points in $\\mathbb{R}^d$, which we call voters,\nand let $k\\geq 1$ and $\\ell\\geq 1$ be two given constants. We consider the\nfollowing game, where two players $\\mathcal{P}$ and $\\mathcal{Q}$ compete over\nthe voters in $V$: First, player $\\mathcal{P}$ selects $k$ points in\n$\\mathbb{R}^d$, and then player $\\mathcal{Q}$ selects $\\ell$ points in\n$\\mathbb{R}^d$. Player $\\mathcal{P}$ wins a voter $v\\in V$ iff\n$\\mathrm{dist}(v,P) \\leq \\mathrm{dist}(v,Q)$, where $\\mathrm{dist}(v,P) :=\n\\min_{p\\in P} \\mathrm{dist}(v,p)$ and $\\mathrm{dist}(v,Q)$ is defined\nsimilarly. Player $\\mathcal{P}$ wins the game if he wins at least half the\nvoters. The algorithmic problem we study is the following: given $V$, $k$, and\n$\\ell$, how efficiently can we decide if player $\\mathcal{P}$ has a winning\nstrategy, that is, if $\\mathcal{P}$ can select his $k$ points such that he wins\nthe game no matter where $\\mathcal{Q}$ places her points.\n  Banik et al. devised a singly-exponential algorithm for the game in\n$\\mathbb{R}^1$, for the case $k=\\ell$. We improve their result by presenting\nthe first polynomial-time algorithm for the game in $\\mathbb{R}^1$. Our\nalgorithm can handle arbitrary values of $k$ and $\\ell$. We also show that if\n$d\\geq 2$, deciding if player $\\mathcal{P}$ has a winning strategy is\n$\\Sigma_2^P$-hard when $k$ and $\\ell$ are part of the input. Finally, we prove\nthat for any dimension $d$, the problem is contained in the complexity class\n$\\exists\\forall \\mathbb{R}$, and we give an algorithm that works in polynomial\ntime for fixed $k$ and $\\ell$.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 12:42:21 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["de Berg", "Mark", ""], ["Kisfaludi-Bak", "Sándor", ""], ["Mehr", "Mehran", ""]]}, {"id": "1902.09251", "submitter": "Georgios Tsaousoglou", "authors": "Georgios Tsaousoglou, Konstantinos Steriotis, Nikolaos Efthymiopoulos,\n  Prodrommos Makris, Emmanouel Varvarigos", "title": "Incentive Compatibility, Scalability and Privacy in real time Demand\n  Response", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The high penetration of Renewable Energy Sources in modern smart grids\nnecessitated the development of Demand Response (DR) mechanisms as well as\ncorresponding innovative services for the emerging flexibility markets. From a\ngame theoretic perspective, the basic key performance indicators (KPIs) for\nsuch DR mechanisms are efficiency in terms of social welfare, practical\napplicability, and incentive guarantees, in the sense of making it a dominant\nstrategy for each user to act truthfully according to his/her preferences,\nleaving no room for cheating. In this paper, we propose a DR architecture,\nincluding a mechanism based on Ausubel clinching auction and a communication\nprotocol, that provably guarantee both efficiency and truthful user\nparticipation. Practicality/easiness of participation is enhanced via simple\nqueries, while user privacy issues are addressed via a distributed\nimplementation. Simulation results confirm the desired properties, while also\nshowing that the truthfulness property becomes even more important in markets\nwhere participants are not particularly flexible\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 13:23:37 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Tsaousoglou", "Georgios", ""], ["Steriotis", "Konstantinos", ""], ["Efthymiopoulos", "Nikolaos", ""], ["Makris", "Prodrommos", ""], ["Varvarigos", "Emmanouel", ""]]}, {"id": "1902.09257", "submitter": "Georgios Tsaousoglou", "authors": "Georgios Tsaousoglou, Konstantinos Steriotis, Nikolaos Efthymiopoulos,\n  Konstantinos Smpoukis, Emmanouel Varvarigos", "title": "Near-optimal demand side management in retail electricity markets with\n  coupling constraints via indirect mechanism design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently there have been several historical changes in electricity networks\nthat necessitate the development of Demand Side Management (DSM). The main\nobjective of DSM is to achieve an aggregated consumption pattern that is\nefficient in terms of energy cost reduction, welfare maximization and\nsatisfaction of network constraints. This is generally envisaged by encouraging\nelectricity use at low-peak times. In this paper, we consider a system with\nstrategic, price anticipating consumers with private preferences that choose\ntheir electricity consumption patterns so as to maximize their own benefit. In\nthis context, we take on the problem of coordinating the consumers' consumption\nbehavior without sacrificing their welfare (Quality of Experience). In order to\ntackle this problem, we draw on concepts of indirect mechanism design and\npropose a DSM architecture that is able to fulfill specific system-wide\nconstraints (e.g. energy cost reduction) and simultaneously achieve welfare\nthat is very close to optimal. The proposed billing rule preserves both the\nbudget-balance and the individual rationality properties. According to our\nevaluation, the proposed DSM architecture achieves a close to optimal\nallocation (1%-3% gap), compared to an \"optimal\" system that would use central\noptimization of user loads without user consensus or protection of their\nprivacy\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 13:32:44 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Tsaousoglou", "Georgios", ""], ["Steriotis", "Konstantinos", ""], ["Efthymiopoulos", "Nikolaos", ""], ["Smpoukis", "Konstantinos", ""], ["Varvarigos", "Emmanouel", ""]]}, {"id": "1902.09277", "submitter": "Mohsen Khorasany", "authors": "Mohsen Khorasany, Yateendra Mishra, Gerard Ledwich", "title": "Design of auction-based approach for market clearing in peer-to-peer\n  market platform", "comments": "6 pages", "journal-ref": null, "doi": "10.1049/joe.2018.9313", "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper designs a market platform for Peer-to-Peer (P2P) energy trading in\nTransactive Energy (TE) systems, where prosumers and consumers actively\nparticipate in the market as seller or buyer to trade energy. An auction-based\napproach is used for market clearing in the proposed platform and a review of\ndifferent types of auction is performed. The appropriate auction approach for\nmarket clearing in the proposed platform is designed. The proposed auction\nmechanism is implemented in three steps namely determination, allocation and\npayment. This paper identifies important P2P market clearing performance\nindices, which are used to compare and contrast the designed auction with\ndifferent types of auction mechanisms. Comparative studies demonstrate the\nefficacy of the proposed auction mechanism for market clearing in the P2P\nplatform.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2019 22:25:28 GMT"}], "update_date": "2019-07-30", "authors_parsed": [["Khorasany", "Mohsen", ""], ["Mishra", "Yateendra", ""], ["Ledwich", "Gerard", ""]]}, {"id": "1902.09329", "submitter": "Ramin Faraji Fijani", "authors": "Saeed Ahmadian, Ramin Farajifijani", "title": "A New Method To Find The Nash Equilibrium Point in Financial\n  Transmission Rights Bidding Problem", "comments": "2 figs, 6 tables, Energy Economics Journals (Elsevier)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial transmission right (FTR) is an important tool and an especially\nfeature for stopping congestion charges in restructured electricity markets.\nParticipants in the transmission market as players are assumed to be a\ngeneration company (Gencos) which also take part in an energy market and able\nto buy their require FTRs. In this regard, there are two types of FTR:\nobligation or option. There are three main questions which immediately arise\nfor each player who is placed in the market. First, which type of FTR is the\nbest choice second, how much power is needed to generate by each player and\nthird, how bid prices should be offered. Deciding on these trade-offs is\ndifficult and requires definition of special matrices to measure risk in each\npossible condition in the transmission market. These matrices include:\npossibility of flow direction alteration, probable forward and reverse power\nflow on each line, maximum and minimum offering FTRs and the worst condition of\nload variation which influence on each players decision. Based on these\nmatrices, players try to maximize their expected payoffs by taking into account\nthe associated risks. Supposing these matrices are known to respective players,\nthe FTR bidding problem is modeled as a bi-level optimization based on the Nash\nequilibrium game theory with the upper sub-problem representing player profit\nmaximization and the lower sub-problem representing the optimal solution to the\nmarket clearing. An eight-bus system with six players is simulated to verify\nthe proposed method and the obtained results are illustrated the complex\ninteraction between FTR obligation and FTR option bidding strategies.\nFurthermore, the results are demonstrated to be consistent between the impacts\nof FTR type, forecast bid offer of the other players and players preferred risk\nlevels on FTR bidding strategies.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2019 05:39:06 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Ahmadian", "Saeed", ""], ["Farajifijani", "Ramin", ""]]}, {"id": "1902.09413", "submitter": "Ellen Vitercik", "authors": "Maria-Florina Balcan, Tuomas Sandholm, and Ellen Vitercik", "title": "Estimating Approximate Incentive Compatibility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In practice, most mechanisms for selling, buying, matching, voting, and so on\nare not incentive compatible. We present techniques for estimating how far a\nmechanism is from incentive compatible. Given samples from the agents' type\ndistribution, we show how to estimate the extent to which an agent can improve\nhis utility by misreporting his type. We do so by first measuring the maximum\nutility an agent can gain by misreporting his type on average over the samples,\nassuming his true and reported types are from a finite subset---which our\ntechnique constructs---of the type space. The challenge is that by measuring\nutility gains over a finite subset of the type space, we might miss type pairs\n$\\theta$ and $\\hat{\\theta}$ where an agent with type $\\theta$ can greatly\nimprove his utility by reporting type $\\hat{\\theta}$. Indeed, our primary\ntechnical contribution is proving that the maximum utility gain over this\nfinite subset nearly matches the maximum utility gain overall, despite the\nvolatility of the utility functions we study. We apply our tools to the\nsingle-item and combinatorial first-price auctions, generalized second-price\nauction, discriminatory auction, uniform-price auction, and second-price\nauction with spiteful bidders.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 16:24:01 GMT"}, {"version": "v2", "created": "Wed, 5 Jun 2019 00:48:30 GMT"}, {"version": "v3", "created": "Mon, 4 Nov 2019 21:16:03 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Balcan", "Maria-Florina", ""], ["Sandholm", "Tuomas", ""], ["Vitercik", "Ellen", ""]]}, {"id": "1902.09590", "submitter": "Ryan Shah", "authors": "Ryan Shah, Shishir Nagaraja", "title": "A game-theoretic analysis of DoS attacks on driverless vehicles", "comments": "16 pages, 14 figures, submitted to WEIS '19", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Driverless vehicles are expected to form the foundation of future connected\ntransport infrastructure. A key weakness of connected vehicles is their\nvulnerability to physical-proximity attacks such as sensor saturation attacks.\nIt is natural to study whether such attacks can be used to disrupt swarms of\nautonomous vehicles used as part of a large fleet providing taxi and courier\ndelivery services. In this paper, we start to examine the strategic options\navailable to attackers and defenders (autonomous-fleet operators) in such\nconflicts. We find that attackers have the upper hand in most cases and are\nable to carry out crippling denial-of-service attacks on fleets, by leveraging\nthe inherent deficiencies of road networks identified by techniques from graph\nanalysis. Experimental results on ten cities using real-world courier traces\nshows that most cities will require upgraded infrastructure to defend\ndriverless vehicles against denial-of-service attacks. We found several hidden\ncosts that impact equipment designers and operators of driverless vehicles -\nnot least, that road-networks need to be redesigned for robustness against\nattacks thus raising some fundamental questions about the benefits.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 19:58:06 GMT"}], "update_date": "2019-02-27", "authors_parsed": [["Shah", "Ryan", ""], ["Nagaraja", "Shishir", ""]]}, {"id": "1902.09687", "submitter": "Bin Song", "authors": "Dan Wang, Wei Zhang, Bin Song, Xiaojiang Du and Mohsen Guizani", "title": "Market-Based Model in CR-WSN: A Q-Probabilistic Multi-agent Learning\n  Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ever-increasingly urban populations and their material demands have\nbrought unprecedented burdens to cities. Smart cities leverage emerging\ntechnologies like the Internet of Things (IoT), Cognitive Radio Wireless Sensor\nNetwork (CR-WSN) to provide better QoE and QoS for all citizens. However,\nresource scarcity is an important challenge in CR-WSN. Generally, this problem\nis handled by auction theory or game theory. To make CR-WSN nodes intelligent\nand more autonomous in resource allocation, we propose a multi-agent\nreinforcement learning (MARL) algorithm to learn the optimal resource\nallocation strategy in the oligopoly market model. Firstly, we model a\nmulti-agent scenario, in which the primary users (PUs) is the sellers and the\nsecondary users (SUs) is the buyers. Then, we propose the Q-probabilistic\nmultiagent learning (QPML) and apply it to allocate resources in the market. In\nthe multi-agent interactive learning process, the PUs and SUs learn strategies\nto maximize their benefits and improve spectrum utilization. Experimental\nresults show the efficiency of our QPML approach, which can also converge\nquickly.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2019 01:15:47 GMT"}], "update_date": "2019-02-27", "authors_parsed": [["Wang", "Dan", ""], ["Zhang", "Wei", ""], ["Song", "Bin", ""], ["Du", "Xiaojiang", ""], ["Guizani", "Mohsen", ""]]}, {"id": "1902.10008", "submitter": "Matheus Venturyne Xavier Ferreira", "authors": "Tithi Chattopadhyay and Nick Feamster and Matheus V. X. Ferreira and\n  Danny Yuxing Huang and S. Matthew Weinberg", "title": "Selling a Single Item with Negative Externalities", "comments": null, "journal-ref": "The World Wide Web Conference, 2019, 196-206", "doi": "10.1145/3308558.3313692", "report-no": null, "categories": "cs.GT cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of regulating products with negative externalities to\na third party that is neither the buyer nor the seller, but where both the\nbuyer and seller can take steps to mitigate the externality. The motivating\nexample to have in mind is the sale of Internet-of-Things (IoT) devices, many\nof which have historically been compromised for DDoS attacks that disrupted\nInternet-wide services such as Twitter. Neither the buyer (i.e., consumers) nor\nseller (i.e., IoT manufacturers) was known to suffer from the attack, but both\nhave the power to expend effort to secure their devices. We consider a\nregulator who regulates payments (via fines if the device is compromised, or\nmarket prices directly), or the product directly via mandatory security\nrequirements.\n  Both regulations come at a cost---implementing security requirements\nincreases production costs, and the existence of fines decreases consumers'\nvalues---thereby reducing the seller's profits. The focus of this paper is to\nunderstand the \\emph{efficiency} of various regulatory policies. That is,\npolicy A is more efficient than policy B if A more successfully minimizes\nnegatives externalities, while both A and B reduce seller's profits equally.\n  We develop a simple model to capture the impact of regulatory policies on a\nbuyer's behavior. {In this model, we show that for \\textit{homogeneous}\nmarkets---where the buyer's ability to follow security practices is always high\nor always low---the optimal (externality-minimizing for a given profit\nconstraint) regulatory policy need regulate \\emph{only} payments \\emph{or}\nproduction.} In arbitrary markets, by contrast, we show that while the optimal\npolicy may require regulating both aspects, there is always an approximately\noptimal policy which regulates just one.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2019 15:43:12 GMT"}], "update_date": "2020-06-08", "authors_parsed": [["Chattopadhyay", "Tithi", ""], ["Feamster", "Nick", ""], ["Ferreira", "Matheus V. X.", ""], ["Huang", "Danny Yuxing", ""], ["Weinberg", "S. Matthew", ""]]}, {"id": "1902.10163", "submitter": "Brant Jones", "authors": "Brant Jones", "title": "Weighted games of best choice", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The game of best choice (also known as the secretary problem) is a model for\nsequential decision making with a long history and many variations. The\nclassical setup assumes that the sequence of candidate rankings are uniformly\ndistributed. Given a statistic on the symmetric group, one can instead weight\neach permutation according to an exponential function in the statistic. We play\nthe game of best choice on the Ewens and Mallows distributions that are\nobtained in this way from the number of left-to-right maxima and number of\ninversions in the permutation, respectively. For each of these, we give the\noptimal strategy and probability of winning. Moreover, we introduce a general\nclass of permutation statistics that always produces games of best choice whose\noptimal strategies are positional, which simplifies their analysis\nconsiderably.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2019 19:06:14 GMT"}, {"version": "v2", "created": "Tue, 5 Nov 2019 17:56:31 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Jones", "Brant", ""]]}, {"id": "1902.10198", "submitter": "Arnob Ghosh", "authors": "Arnob Ghosh, Randall Berry", "title": "Competition with Three-Tier Spectrum Access and Spectrum Monitoring", "comments": "Submitted to MobiHoc'2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Citizens Broadband Radio Service (CBRS) recently adopted in the U.S.\nenables two tiers of commercial users to share spectrum with a third tier of\nincumbent users. This sharing can be further assisted by Environmental Sensing\nCapability operators (ESCs), that monitor the spectrum occupancy to determine\nwhen use of the spectrum will not harm incumbents. Two key aspects of this\nframework that impact how firms may compete are the differences in information\nprovided by different ESCs and the different tiers in which a firm may access\nthe spectrum. We develop a game theoretic model that captures both of these\nfeatures and analyze it to gain insight into their impact. Specifically, we\nconsider a priority access (PA) tier firm has access to the both licensed band\nand unlicensed band, and a general authorized access (GAA) tier firm has access\nonly to the unlicensed band. The PA tier and GAA tier firms compete for users.\nOur analysis reveals that the amount of unlicensed and licensed bandwidth in\nthe CBRS must be chosen judiciously in order to maximize the social welfare. We\nalso show that a limited amount of unlicensed access of PA tier firm is\nbeneficial to the user's surplus as well as to the social welfare.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2019 20:16:40 GMT"}], "update_date": "2019-02-28", "authors_parsed": [["Ghosh", "Arnob", ""], ["Berry", "Randall", ""]]}, {"id": "1902.10315", "submitter": "Yifeng Teng", "authors": "Shuchi Chawla, Yifeng Teng, Christos Tzamos", "title": "Buy-many mechanisms are not much better than item pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-item mechanisms can be very complex offering many different bundles to\nthe buyer that could even be randomized. Such complexity is thought to be\nnecessary as the revenue gaps between randomized and deterministic mechanisms,\nor deterministic and simple mechanisms are huge even for additive valuations.\n  We challenge this conventional belief by showing that these large gaps can\nonly happen in restricted situations. These are situations where the mechanism\novercharges a buyer for a bundle while selling individual items at much lower\nprices. Arguably this is impractical in many settings because the buyer can\nbreak his order into smaller pieces paying a much lower price overall. Our main\nresult is that if the buyer is allowed to purchase as many (randomized) bundles\nas he pleases, the revenue of any multi-item mechanism is at most O(logn) times\nthe revenue achievable by item pricing, where n is the number of items. This\nholds in the most general setting possible, with an arbitrarily correlated\ndistribution of buyer types and arbitrary valuations.\n  We also show that this result is tight in a very strong sense. Any family of\nmechanisms of subexponential description complexity cannot achieve better than\nlogarithmic approximation even against the best deterministic mechanism and\neven for additive valuations. In contrast, item pricing that has linear\ndescription complexity matches this bound against randomized mechanisms.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2019 03:00:58 GMT"}, {"version": "v2", "created": "Mon, 24 Jun 2019 17:09:44 GMT"}, {"version": "v3", "created": "Mon, 1 Jul 2019 19:24:52 GMT"}], "update_date": "2019-07-03", "authors_parsed": [["Chawla", "Shuchi", ""], ["Teng", "Yifeng", ""], ["Tzamos", "Christos", ""]]}, {"id": "1902.10427", "submitter": "Thomas Nedelec", "authors": "Thomas Nedelec, Noureddine El Karoui and Vianney Perchet", "title": "Learning to bid in revenue-maximizing auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of the optimization of bidding strategies in\nprior-dependent revenue-maximizing auctions, when the seller fixes the reserve\nprices based on the bid distributions. Our study is done in the setting where\none bidder is strategic. Using a variational approach, we study the complexity\nof the original objective and we introduce a relaxation of the objective\nfunctional in order to use gradient descent methods. Our approach is simple,\ngeneral and can be applied to various value distributions and\nrevenue-maximizing mechanisms. The new strategies we derive yield massive\nuplifts compared to the traditional truthfully bidding strategy.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2019 10:06:18 GMT"}, {"version": "v2", "created": "Mon, 25 Mar 2019 20:45:13 GMT"}, {"version": "v3", "created": "Tue, 14 May 2019 05:27:24 GMT"}], "update_date": "2019-05-15", "authors_parsed": [["Nedelec", "Thomas", ""], ["Karoui", "Noureddine El", ""], ["Perchet", "Vianney", ""]]}, {"id": "1902.10445", "submitter": "Kerstin Beer", "authors": "Kerstin Beer and Dmytro Bondarenko and Terry Farrelly and Tobias J.\n  Osborne and Robert Salzmann and Ramona Wolf", "title": "Efficient Learning for Deep Quantum Neural Networks", "comments": null, "journal-ref": "Nat. Commun. 11, 808 (2020)", "doi": "10.1038/s41467-020-14454-2", "report-no": null, "categories": "quant-ph cs.GT cs.LG physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural networks enjoy widespread success in both research and industry and,\nwith the imminent advent of quantum technology, it is now a crucial challenge\nto design quantum neural networks for fully quantum learning tasks. Here we\npropose the use of quantum neurons as a building block for quantum feed-forward\nneural networks capable of universal quantum computation. We describe the\nefficient training of these networks using the fidelity as a cost function and\nprovide both classical and efficient quantum implementations. Our method allows\nfor fast optimisation with reduced memory requirements: the number of qudits\nrequired scales with only the width, allowing the optimisation of deep\nnetworks. We benchmark our proposal for the quantum task of learning an unknown\nunitary and find remarkable generalisation behaviour and a striking robustness\nto noisy training data.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2019 10:39:25 GMT"}], "update_date": "2020-04-30", "authors_parsed": [["Beer", "Kerstin", ""], ["Bondarenko", "Dmytro", ""], ["Farrelly", "Terry", ""], ["Osborne", "Tobias J.", ""], ["Salzmann", "Robert", ""], ["Wolf", "Ramona", ""]]}, {"id": "1902.10535", "submitter": "Manuel Sorge", "authors": "Jiehua Chen and Piotr Skowron and Manuel Sorge", "title": "Matchings under Preferences: Strength of Stability and Trade-offs", "comments": "47 pages. Accepted for presentation at the 20th ACM Conference on\n  Economics and Computation (EC '19)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose two solution concepts for matchings under preferences: robustness\nand near stability. The former strengthens while the latter relaxes the classic\ndefinition of stability by Gale and Shapley (1962). Informally speaking,\nrobustness requires that a matching must be stable in the classic sense, even\nif the agents slightly change their preferences. Near stability, on the other\nhand, imposes that a matching must become stable (again, in the classic sense)\nprovided the agents are willing to adjust their preferences a bit. Both of our\nconcepts are quantitative; together they provide means for a fine-grained\nanalysis of stability for matchings. Moreover, our concepts allow to explore\nthe trade-offs between stability and other criteria of societal optimality,\nsuch as the egalitarian cost and the number of unmatched agents. We investigate\nthe computational complexity of finding matchings that implement certain\npredefined trade-offs. We provide a polynomial-time algorithm that given\nagents' preferences returns a socially optimal robust matching, and we prove\nthat finding a socially optimal and nearly stable matching is computationally\nhard.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2019 11:19:24 GMT"}, {"version": "v2", "created": "Wed, 5 Jun 2019 16:42:57 GMT"}], "update_date": "2019-06-06", "authors_parsed": [["Chen", "Jiehua", ""], ["Skowron", "Piotr", ""], ["Sorge", "Manuel", ""]]}, {"id": "1902.10865", "submitter": "Ziyao Liu", "authors": "Ziyao Liu, Nguyen Cong Luong, Wenbo Wang, Dusit Niyato, Ping Wang,\n  Ying-Chang Liang, and Dong In Kim", "title": "A Survey on Applications of Game Theory in Blockchain", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past decades, the blockchain technology has attracted tremendous\nattention from both academia and industry. The popularity of blockchain\nnetworks was originated from a crypto-currency to serve as a decentralized and\ntamperproof transaction data ledger. Nowadays, blockchain as the key framework\nin the decentralized public data-ledger, has been applied to a wide range of\nscenarios far beyond crypto-currencies, such as Internet of Things (IoT),\nhealthcare, and insurance. This survey aims to fill the gap between the large\nnumber of studies on blockchain network, where game theory emerges as an\nanalytical tool, and the lack of a comprehensive survey on the game theoretical\napproaches applied in blockchain related issues. In this paper, we review game\nmodels proposed to address common issues in the blockchain network. The issues\ninclude security issues, e.g., selfish mining, majority attack and Denial of\nService (DoS) attack, issues regard mining management, e.g., computational\npower allocation, reward allocation, and pool selection, as well as issues\nregarding blockchain economic and energy trading. Additionally, we discuss\nadvantages and disadvantages of these selected game models and solutions.\nFinally, we highlight important challenges and future research directions of\napplying game theoretical approaches to incentive mechanism design, and the\ncombination of blockchain with other technologies.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2019 02:25:51 GMT"}, {"version": "v2", "created": "Fri, 15 Mar 2019 06:06:03 GMT"}], "update_date": "2019-03-18", "authors_parsed": [["Liu", "Ziyao", ""], ["Luong", "Nguyen Cong", ""], ["Wang", "Wenbo", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""], ["Liang", "Ying-Chang", ""], ["Kim", "Dong In", ""]]}, {"id": "1902.11064", "submitter": "Yujin Kwon", "authors": "Yujin Kwon, Hyoungshick Kim, Jinwoo Shin, Yongdae Kim", "title": "Bitcoin vs. Bitcoin Cash: Coexistence or Downfall of Bitcoin Cash?", "comments": "This paper is the full version of a paper accepted to IEEE S&P 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Aug. 2017, Bitcoin was split into the original Bitcoin (BTC) and Bitcoin\nCash (BCH). Since then, miners have had a choice between BTC and BCH mining\nbecause they have compatible proof-of-work algorithms. Therefore, they can\nfreely choose which coin to mine for higher profit, where the profitability\ndepends on both the coin price and mining difficulty. Some miners can\nimmediately switch the coin to mine only when mining difficulty changes because\nthe difficulty changes are more predictable than that for the coin price, and\nwe call this behavior fickle mining.\n  In this paper, we study the effects of fickle mining by modeling a game\nbetween two coins. To do this, we consider both fickle miners and some factions\n(e.g., BITMAIN for BCH mining) that stick to mining one coin to maintain that\nchain. In this model, we show that fickle mining leads to a Nash equilibrium in\nwhich only a faction sticking to its coin mining remains as a loyal miner to\nthe less valued coin (e.g., BCH), where loyal miners refer to those who conduct\nmining even after coin mining difficulty increases. This situation would cause\nsevere centralization, weakening the security of the coin system.\n  To determine which equilibrium the competing coin systems (e.g., BTC vs. BCH)\nare moving toward, we traced the historical changes of mining power for BTC and\nBCH. In addition, we analyze the recent \"hash war\" between Bitcoin ABC and SV,\nwhich confirms our theoretical analysis. Finally, we note that our results can\nbe applied to any competing cryptocurrency systems in which the same hardware\n(e.g., ASICs or GPUs) can be used for mining. Therefore, our study brings new\nand important angles in competitive coin markets: a coin can intentionally\nweaken the security and decentralization level of the other rival coin when\nmining hardware is shared between them, allowing for automatic mining.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2019 13:10:18 GMT"}, {"version": "v2", "created": "Sat, 2 Mar 2019 14:25:12 GMT"}], "update_date": "2019-03-05", "authors_parsed": [["Kwon", "Yujin", ""], ["Kim", "Hyoungshick", ""], ["Shin", "Jinwoo", ""], ["Kim", "Yongdae", ""]]}, {"id": "1902.11212", "submitter": "Manxing Du", "authors": "Manxing Du, Alexander I. Cowen-Rivers, Ying Wen, Phu Sakulwongtana,\n  Jun Wang, Mats Brorsson, Radu State", "title": "Infer Your Enemies and Know Yourself, Learning in Real-Time Bidding with\n  Partially Observable Opponents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real-time bidding, as one of the most popular mechanisms for selling online\nad slots, facilitates advertisers to reach their potential customers. The goal\nof bidding optimization is to maximize the advertisers' return on investment\n(ROI) under a certain budget setting. A straightforward solution is to model\nthe bidding function in an explicit form. However, the static functional\nsolutions lack generality in practice and are insensitive to the stochastic\nbehaviour of other bidders in the environment. In this paper, we propose a\ngeneral multi-agent framework with actor-critic solutions facing against\nplaying imperfect information games. We firstly introduce a novel Deep\nAttentive Survival Analysis (DASA) model to infer the censored data in the\nsecond price auctions which outperforms start-of-the-art survival analysis.\nFurthermore, our approach introduces the DASA model as the opponent model into\nthe policy learning process for each agent and develop a mean field equilibrium\nanalysis of the second price auctions. The experiments have shown that with the\ninference of the market, the market converges to the equilibrium much faster\nwhile playing against both fixed strategy agents and dynamic learning agents.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2019 16:52:14 GMT"}], "update_date": "2019-03-01", "authors_parsed": [["Du", "Manxing", ""], ["Cowen-Rivers", "Alexander I.", ""], ["Wen", "Ying", ""], ["Sakulwongtana", "Phu", ""], ["Wang", "Jun", ""], ["Brorsson", "Mats", ""], ["State", "Radu", ""]]}]