[{"id": "1006.0247", "submitter": "Wojciech Mazurczyk", "authors": "Wojciech Fraczek, Wojciech Mazurczyk, Krzysztof Szczypiorski", "title": "Stream Control Transmission Protocol Steganography", "comments": "6 pages, 6 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stream Control Transmission Protocol (SCTP) is a new transport layer protocol\nthat is due to replace TCP (Transmission Control Protocol) and UDP (User\nDatagram Protocol) protocols in future IP networks. Currently, it is\nimplemented in such operating systems like BSD, Linux, HP-UX or Sun Solaris. It\nis also supported in Cisco network devices operating system (Cisco IOS) and may\nbe used in Windows. This paper describes potential steganographic methods that\nmay be applied to SCTP and may pose a threat to network security. Proposed\nmethods utilize new, characteristic SCTP features like multi-homing and\nmultistreaming. Identified new threats and suggested countermeasures may be\nused as a supplement to RFC 5062, which describes security attacks in SCTP\nprotocol and can induce further standard modifications.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jun 2010 20:26:27 GMT"}], "update_date": "2010-06-03", "authors_parsed": [["Fraczek", "Wojciech", ""], ["Mazurczyk", "Wojciech", ""], ["Szczypiorski", "Krzysztof", ""]]}, {"id": "1006.0386", "submitter": "Haitham Rashwan", "authors": "Haitham Rashwan, Ernst M. Gabidulin, Bahram Honary", "title": "A Smart Approach for GPT Cryptosystem Based on Rank Codes", "comments": "5 pages. to appear in Proceedings of IEEE ISIT2010", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513549", "report-no": "#1223: ISIT 2010", "categories": "cs.IT cs.CR math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The concept of Public- key cryptosystem was innovated by McEliece's\ncryptosystem. The public key cryptosystem based on rank codes was presented in\n1991 by Gabidulin -Paramonov-Trejtakov(GPT). The use of rank codes in\ncryptographic applications is advantageous since it is practically impossible\nto utilize combinatoric decoding. This has enabled using public keys of a\nsmaller size. Respective structural attacks against this system were proposed\nby Gibson and recently by Overbeck. Overbeck's attacks break many versions of\nthe GPT cryptosystem and are turned out to be either polynomial or exponential\ndepending on parameters of the cryptosystem. In this paper, we introduce a new\napproach, called the Smart approach, which is based on a proper choice of the\ndistortion matrix X. The Smart approach allows for withstanding all known\nattacks even if the column scrambler matrix P over the base field Fq.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2010 14:18:25 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Rashwan", "Haitham", ""], ["Gabidulin", "Ernst M.", ""], ["Honary", "Bahram", ""]]}, {"id": "1006.0405", "submitter": "EPTCS", "authors": "Thomas Steinke, Raazesh Sainudiin", "title": "A Rigorous Extension of the Sch\\\"onhage-Strassen Integer Multiplication\n  Algorithm Using Complex Interval Arithmetic", "comments": null, "journal-ref": "EPTCS 24, 2010, pp. 151-159", "doi": "10.4204/EPTCS.24.19", "report-no": null, "categories": "cs.NA cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiplication of n-digit integers by long multiplication requires O(n^2)\noperations and can be time-consuming. In 1970 A. Schoenhage and V. Strassen\npublished an algorithm capable of performing the task with only O(n log(n))\narithmetic operations over the complex field C; naturally, finite-precision\napproximations to C are used and rounding errors need to be accounted for.\nOverall, using variable-precision fixed-point numbers, this results in an\nO(n(log(n))^(2+Epsilon))-time algorithm. However, to make this algorithm more\nefficient and practical we need to make use of hardware-based floating-point\nnumbers. How do we deal with rounding errors? and how do we determine the\nlimits of the fixed-precision hardware? Our solution is to use interval\narithmetic to guarantee the correctness of results and determine the hardware's\nlimits. We examine the feasibility of this approach and are able to report that\n75,000-digit base-256 integers can be handled using double-precision\ncontainment sets. This clearly demonstrates that our approach has practical\npotential; however, at this stage, our implementation does not yet compete with\ncommercial ones, but we are able to demonstrate the feasibility of this\ntechnique.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2010 14:31:02 GMT"}], "update_date": "2010-06-03", "authors_parsed": [["Steinke", "Thomas", ""], ["Sainudiin", "Raazesh", ""]]}, {"id": "1006.0495", "submitter": "Wojciech Mazurczyk", "authors": "Krzysztof Szczypiorski, Wojciech Mazurczyk", "title": "Hiding Data in OFDM Symbols of IEEE 802.11 Networks", "comments": "6 pages, 8 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a new steganographic method called WiPad (Wireless\nPadding). It is based on the insertion of hidden data into the padding of\nframes at the physical layer of WLANs (Wireless Local Area Networks). A\nperformance analysis based on a Markov model, previously introduced and\nvalidated by the authors in [10], is provided for the method in relation to the\nIEEE 802.11 a/g standards. Its results prove that maximum steganographic\nbandwidth for WiPad is as high as 1.1 Mbit/s for data frames and 0.44 Mbit/s\nfor acknowledgment (ACK) frames. To the authors' best knowledge this is the\nmost capacious of all the known steganographic network channels.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2010 20:41:29 GMT"}], "update_date": "2010-06-04", "authors_parsed": [["Szczypiorski", "Krzysztof", ""], ["Mazurczyk", "Wojciech", ""]]}, {"id": "1006.0806", "submitter": "Carla Fabiana Chiasserini", "authors": "Marco Fiore, Claudio Casetti, Carla Fabiana Chiasserini, Panagiotis\n  Papadimitratos", "title": "Secure Neighbor Position Discovery in VANETs", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many significant functionalities of vehicular ad hoc networks (VANETs)\nrequire that nodes have knowledge of the positions of other vehicles, and\nnotably of those within communication range. However, adversarial nodes could\nprovide false position information or disrupt the acquisition of such\ninformation. Thus, in VANETs, the discovery of neighbor positions should be\nperformed in a secure manner. In spite of a multitude of security protocols in\nthe literature, there is no secure discovery protocol for neighbors positions.\nWe address this problem in our paper: we design a distributed protocol that\nrelies solely on information exchange among one-hop neighbors, we analyze its\nsecurity properties in presence of one or multiple (independent or colluding)\nadversaries, and we evaluate its performance in a VANET environment using\nrealistic mobility traces. We show that our protocol can be highly effective in\ndetecting falsified position information, while maintaining a low rate of false\npositive detections.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jun 2010 08:38:11 GMT"}], "update_date": "2010-06-07", "authors_parsed": [["Fiore", "Marco", ""], ["Casetti", "Claudio", ""], ["Chiasserini", "Carla Fabiana", ""], ["Papadimitratos", "Panagiotis", ""]]}, {"id": "1006.1057", "submitter": "Haitham Rashwan M", "authors": "Ernst M. Gabidulin, Haitham Rashwan, Bahram Honary", "title": "On improving security of GPT cryptosystems", "comments": "5 pages. submitted ISIT 2009.Processed on IEEE ISIT2010", "journal-ref": null, "doi": "10.1109/ISIT.2009.5206029", "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The public key cryptosystem based on rank error correcting codes (the GPT\ncryptosystem) was proposed in 1991. Use of rank codes in cryptographic\napplications is advantageous since it is practically impossible to utilize\ncombinatoric decoding. This enabled using public keys of a smaller size.\nSeveral attacks against this system were published, including Gibson's attacks\nand more recently Overbeck's attacks. A few modifications were proposed\nwithstanding Gibson's attack but at least one of them was broken by the\nstronger attacks by Overbeck. A tool to prevent Overbeck's attack is presented\nin [12]. In this paper, we apply this approach to other variants of the GPT\ncryptosystem.\n", "versions": [{"version": "v1", "created": "Sat, 5 Jun 2010 17:12:57 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Gabidulin", "Ernst M.", ""], ["Rashwan", "Haitham", ""], ["Honary", "Bahram", ""]]}, {"id": "1006.1192", "submitter": "Secretary Aircc Journal", "authors": "Ruchira Naskar and Indranil Sengupta", "title": "Secret Sharing and Proactive Renewal of Shares in Hierarchical Groups", "comments": "20 Pages", "journal-ref": "International Journal of Computer Science and Information\n  Technology 2.3 (2010) 160-179", "doi": "10.5121/ijcsit.2010.2312", "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Secret sharing in user hierarchy represents a challenging area for research.\nAlthough a lot of work has already been done in this direc- tion, this paper\npresents a novel approach to share a secret among a hierarchy of users while\novercoming the limitations of the already exist- ing mechanisms. Our work is\nbased on traditional (k +1; n)-threshold secret sharing, which is secure as\nlong as an adversary can compromise not more than k secret shares. But in real\nlife it is often feasible for an adversary to obtain more than k shares over a\nlong period of time. So, in our work we also present a way to overcome this\nvulnerability, while implementing our hierarchical secret sharing scheme. The\nuse of Elliptic Curve Cryptography makes the computations easier and faster in\nour work.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2010 07:31:09 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Naskar", "Ruchira", ""], ["Sengupta", "Indranil", ""]]}, {"id": "1006.1198", "submitter": "Secretary Aircc Journal", "authors": "Md.Headayetullah and G.K. Pradhan (SOAU - Bhubaneswar, India)", "title": "Interoperability, Trust Based Information Sharing Protocol and Security:\n  Digital Government Key Issues", "comments": "20 pages", "journal-ref": "International Journal of Computer Science and Information\n  Technology 2.3 (2010) 72-91", "doi": "10.5121/ijcsit.2010.2306", "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Improved interoperability between public and private organizations is of key\nsignificance to make digital government newest triumphant. Digital Government\ninteroperability, information sharing protocol and security are measured the\nkey issue for achieving a refined stage of digital government. Flawless\ninteroperability is essential to share the information between diverse and\nmerely dispersed organisations in several network environments by using\ncomputer based tools. Digital government must ensure security for its\ninformation systems, including computers and networks for providing better\nservice to the citizens. Governments around the world are increasingly\nrevolving to information sharing and integration for solving problems in\nprograms and policy areas. Evils of global worry such as syndrome discovery and\nmanage, terror campaign, immigration and border control, prohibited drug\ntrafficking, and more demand information sharing, harmonization and cooperation\namid government agencies within a country and across national borders. A number\nof daunting challenges survive to the progress of an efficient information\nsharing protocol. A secure and trusted information-sharing protocol is required\nto enable users to interact and share information easily and perfectly across\nmany diverse networks and databases globally.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2010 08:08:43 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Headayetullah", "Md.", "", "SOAU - Bhubaneswar, India"], ["Pradhan", "G. K.", "", "SOAU - Bhubaneswar, India"]]}, {"id": "1006.1449", "submitter": "EPTCS", "authors": "Petteri Kaskenpalo (AUT University)", "title": "On Secure Workflow Decentralisation on the Internet", "comments": null, "journal-ref": "EPTCS 27, 2010, pp. 2-16", "doi": "10.4204/EPTCS.27.2", "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decentralised workflow management systems are a new research area, where most\nwork to-date has focused on the system's overall architecture. As little\nattention has been given to the security aspects in such systems, we follow a\nsecurity driven approach, and consider, from the perspective of available\nsecurity building blocks, how security can be implemented and what new\nopportunities are presented when empowering the decentralised environment with\nmodern distributed security protocols. Our research is motivated by a more\ngeneral question of how to combine the positive enablers that email exchange\nenjoys, with the general benefits of workflow systems, and more specifically\nwith the benefits that can be introduced in a decentralised environment. This\naims to equip email users with a set of tools to manage the semantics of a\nmessage exchange, contents, participants and their roles in the exchange in an\nenvironment that provides inherent assurances of security and privacy. This\nwork is based on a survey of contemporary distributed security protocols, and\nconsiders how these protocols could be used in implementing a distributed\nworkflow management system with decentralised control . We review a set of\nthese protocols, focusing on the required message sequences in reviewing the\nprotocols, and discuss how these security protocols provide the foundations for\nimplementing core control-flow, data, and resource patterns in a distributed\nworkflow environment.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2010 04:16:38 GMT"}], "update_date": "2010-06-09", "authors_parsed": [["Kaskenpalo", "Petteri", "", "AUT University"]]}, {"id": "1006.1518", "submitter": "Uwe Aickelin", "authors": "Julie Greensmith, Jan Feyereisl, Uwe Aickelin", "title": "The DCA:SOMe Comparison A comparative study between two\n  biologically-inspired algorithms", "comments": "38 pages, 29 figures, 10 tables, Evolutionary Intelligence", "journal-ref": "Evolutionary Intelligence, 1 (2), p 85-112, 2008", "doi": null, "report-no": null, "categories": "cs.AI cs.CR cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Dendritic Cell Algorithm (DCA) is an immune-inspired algorithm, developed\nfor the purpose of anomaly detection. The algorithm performs multi-sensor data\nfusion and correlation which results in a 'context aware' detection system.\nPrevious applications of the DCA have included the detection of potentially\nmalicious port scanning activity, where it has produced high rates of true\npositives and low rates of false positives. In this work we aim to compare the\nperformance of the DCA and of a Self-Organizing Map (SOM) when applied to the\ndetection of SYN port scans, through experimental analysis. A SOM is an ideal\ncandidate for comparison as it shares similarities with the DCA in terms of the\ndata fusion method employed. It is shown that the results of the two systems\nare comparable, and both produce false positives for the same processes. This\nshows that the DCA can produce anomaly detection results to the same standard\nas an established technique.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2010 10:41:56 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Greensmith", "Julie", ""], ["Feyereisl", "Jan", ""], ["Aickelin", "Uwe", ""]]}, {"id": "1006.1563", "submitter": "Uwe Aickelin", "authors": "Jan Feyereisl, Uwe Aickelin", "title": "ToLeRating UR-STD", "comments": "7 pages, 4 figures, 1 table, 2nd International Conference on Emerging\n  Security Information, Systems and Technologies,", "journal-ref": "Proceedings of the 2nd International Conference on Emerging\n  Security Information, Systems and Technologies, Cap Esterel, France, p\n  287-293, 2008", "doi": null, "report-no": null, "categories": "cs.AI cs.CR cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new emerging paradigm of Uncertain Risk of Suspicion, Threat and Danger,\nobserved across the field of information security, is described. Based on this\nparadigm a novel approach to anomaly detection is presented. Our approach is\nbased on a simple yet powerful analogy from the innate part of the human immune\nsystem, the Toll-Like Receptors. We argue that such receptors incorporated as\npart of an anomaly detector enhance the detector's ability to distinguish\nnormal and anomalous behaviour. In addition we propose that Toll-Like Receptors\nenable the classification of detected anomalies based on the types of attacks\nthat perpetrate the anomalous behaviour. Classification of such type is either\nmissing in existing literature or is not fit for the purpose of reducing the\nburden of an administrator of an intrusion detection system. For our model to\nwork, we propose the creation of a taxonomy of the digital Acytota, based on\nwhich our receptors are created.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2010 14:12:08 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Feyereisl", "Jan", ""], ["Aickelin", "Uwe", ""]]}, {"id": "1006.1689", "submitter": "EPTCS", "authors": "Tom Van Cutsem (Vrije Universiteit Brussel), Mark Miller (Google)", "title": "Proceedings First International Workshop on Decentralized Coordination\n  of Distributed Processes", "comments": null, "journal-ref": "EPTCS 27, 2010", "doi": "10.4204/EPTCS.27", "report-no": null, "categories": "cs.DC cs.CR cs.NI cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the papers presented at the 1st International Workshop\non \"Decentralized Coordination of Distributed Processes\", DCDP 2010, held in\nAmsterdam, The Netherlands on June 10th, 2010 in conjunction with the 5th\nInternational Federated Conferences on Distributed Computing Techniques,\nDisCoTec 2010. The central theme of the workshop is the decentralized\ncoordination of distributed processes. Decentralized: there is no single\nauthority in the network that everything is vulnerable to. Coordinated:\nprocesses need to cooperate to achieve meaningful results, potentially in the\nface of mutual suspicion. Distributed: processes are separated by a potentially\nunreliable network.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 02:39:07 GMT"}], "update_date": "2010-06-10", "authors_parsed": [["Van Cutsem", "Tom", "", "Vrije Universiteit Brussel"], ["Miller", "Mark", "", "Google"]]}, {"id": "1006.1735", "submitter": "Mehdi Hassanzadeh", "authors": "Mehdi M. Hassanzadeh and Tor Helleseth", "title": "Algebraic Attack on the Alternating Step(r,s)Generator", "comments": "5 pages, 2 figures, 2 tables, 2010 IEEE International Symposium on\n  Information Theory (ISIT2010),June 13-18, 2010, Austin, Texas", "journal-ref": null, "doi": null, "report-no": "#1542: 'Algebraic Attack on the Alternating Step(r,s) Generator'", "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Alternating Step(r,s) Generator, ASG(r,s), is a clock-controlled sequence\ngenerator which is recently proposed by A. Kanso. It consists of three\nregisters of length l, m and n bits. The first register controls the clocking\nof the two others. The two other registers are clocked r times (or not clocked)\n(resp. s times or not clocked) depending on the clock-control bit in the first\nregister. The special case r=s=1 is the original and well known Alternating\nStep Generator. Kanso claims there is no efficient attack against the ASG(r,s)\nsince r and s are kept secret. In this paper, we present an Alternating Step\nGenerator, ASG, model for the ASG(r,s) and also we present a new and efficient\nalgebraic attack on ASG(r,s) using 3(m+n) bits of the output sequence to find\nthe secret key with O((m^2+n^2)*2^{l+1}+ (2^{m-1})*m^3 + (2^{n-1})*n^3)\ncomputational complexity. We show that this system is no more secure than the\noriginal ASG, in contrast to the claim of the ASG(r,s)'s constructor.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 08:16:29 GMT"}], "update_date": "2010-06-10", "authors_parsed": [["Hassanzadeh", "Mehdi M.", ""], ["Helleseth", "Tor", ""]]}, {"id": "1006.1755", "submitter": "Amparo F\\'uster-Sabater", "authors": "Amparo F\\'uster-Sabater and Dolores de la Gu'\\ia-Mart\\'inez", "title": "Simple Cellular Automata-Based Linear Models for the Shrinking Generator", "comments": "10 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Structural properties of two well-known families of keystream generators,\nShrinking Generators and Cellular Automata, have been analyzed. Emphasis is on\nthe equivalence of the binary sequences obtained from both kinds of generators.\nIn fact, Shrinking Generators (SG) can be identified with a subset of linear\nCellular Automata (mainly rule 90, rule 150 or a hybrid combination of both\nrules). The linearity of these cellular models can be advantageously used in\nthe cryptanalysis of those keystream generators.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 09:57:14 GMT"}], "update_date": "2010-06-10", "authors_parsed": [["Fúster-Sabater", "Amparo", ""], ["de la Gu'\\ia-Martínez", "Dolores", ""]]}, {"id": "1006.1858", "submitter": "Daniel Lancho", "authors": "D. Lancho, J. Martinez, D. Elkouss, M. Soto and V. Martin", "title": "QKD in Standard Optical Telecommunications Networks", "comments": null, "journal-ref": "Lecture Notes of the Institute for Computer Sciences, Social\n  Informatics and Telecommunications Engineering. Volume 36, pp 142-149. (2010)", "doi": "10.1007/978-3-642-11731-2_18", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To perform Quantum Key Distribution, the mastering of the extremely weak\nsignals carried by the quantum channel is required. Transporting these signals\nwithout disturbance is customarily done by isolating the quantum channel from\nany noise sources using a dedicated physical channel. However, to really profit\nfrom this technology, a full integration with conventional network technologies\nwould be highly desirable. Trying to use single photon signals with others that\ncarry an average power many orders of magnitude bigger while sharing as much\ninfrastructure with a conventional network as possible brings obvious problems.\nThe purpose of the present paper is to report our efforts in researching the\nlimits of the integration of QKD in modern optical networks scenarios. We have\nbuilt a full metropolitan area network testbed comprising a backbone and an\naccess network. The emphasis is put in using as much as possible the same\nindustrial grade technology that is actually used in already installed\nnetworks, in order to understand the throughput, limits and cost of deploying\nQKD in a real network.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 17:31:59 GMT"}, {"version": "v2", "created": "Fri, 18 Jun 2010 12:33:40 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Lancho", "D.", ""], ["Martinez", "J.", ""], ["Elkouss", "D.", ""], ["Soto", "M.", ""], ["Martin", "V.", ""]]}, {"id": "1006.1916", "submitter": "Carlos Sarraute", "authors": "Ariel Futoransky (1), Luciano Notarfrancesco (1), Gerardo Richarte\n  (1), Carlos Sarraute (1) ((1) CoreLabs, Core Security Technologies)", "title": "Building Computer Network Attacks", "comments": "CoreLabs Technical Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this work we start walking the path to a new perspective for viewing\ncyberwarfare scenarios, by introducing conceptual tools (a formal model) to\nevaluate the costs of an attack, to describe the theater of operations,\ntargets, missions, actions, plans and assets involved in cyberwarfare attacks.\nWe also describe two applications of this model: autonomous planning leading to\nautomated penetration tests, and attack simulations, allowing a system\nadministrator to evaluate the vulnerabilities of his network.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 22:21:00 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Futoransky", "Ariel", "", "CoreLabs, Core Security Technologies"], ["Notarfrancesco", "Luciano", "", "CoreLabs, Core Security Technologies"], ["Richarte", "Gerardo", "", "CoreLabs, Core Security Technologies"], ["Sarraute", "Carlos", "", "CoreLabs, Core Security Technologies"]]}, {"id": "1006.1918", "submitter": "Carlos Sarraute", "authors": "Carlos Sarraute (Core Security Technologies and Instituto Tecnologico\n  Buenos Aires), Javier Burroni (Core Security Technologies)", "title": "Using Neural Networks to improve classical Operating System\n  Fingerprinting techniques", "comments": null, "journal-ref": "Electronic Journal of SADIO, Vol. 8, no. 1, pp. 35-47 (2008)", "doi": null, "report-no": null, "categories": "cs.CR cs.NE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We present remote Operating System detection as an inference problem: given a\nset of observations (the target host responses to a set of tests), we want to\ninfer the OS type which most probably generated these observations. Classical\ntechniques used to perform this analysis present several limitations. To\nimprove the analysis, we have developed tools using neural networks and\nStatistics tools. We present two working modules: one which uses DCE-RPC\nendpoints to distinguish Windows versions, and another which uses Nmap\nsignatures to distinguish different version of Windows, Linux, Solaris,\nOpenBSD, FreeBSD and NetBSD systems. We explain the details of the topology and\ninner workings of the neural networks used, and the fine tuning of their\nparameters. Finally we show positive experimental results.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 22:22:47 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Sarraute", "Carlos", "", "Core Security Technologies and Instituto Tecnologico\n  Buenos Aires"], ["Burroni", "Javier", "", "Core Security Technologies"]]}, {"id": "1006.1919", "submitter": "Carlos Sarraute", "authors": "Ariel Futoransky (1), Fernando Miranda (1), Jose Orlicki (1 and 2),\n  Carlos Sarraute (1 and 2) ((1) Core Security Technologies, (2) Instituto\n  Tecnologico Buenos Aires)", "title": "Simulating Cyber-Attacks for Fun and Profit", "comments": "10 pages, 5 figures", "journal-ref": "International Conference on Simulation Tools and Techniques\n  (SIMUTools) (2009)", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We introduce a new simulation platform called Insight, created to design and\nsimulate cyber-attacks against large arbitrary target scenarios. Insight has\nsurprisingly low hardware and configuration requirements, while making the\nsimulation a realistic experience from the attacker's standpoint. The scenarios\ninclude a crowd of simulated actors: network devices, hardware devices,\nsoftware applications, protocols, users, etc. A novel characteristic of this\ntool is to simulate vulnerabilities (including 0-days) and exploits, allowing\nan attacker to compromise machines and use them as pivoting stones to continue\nthe attack. A user can test and modify complex scenarios, with several\ninterconnected networks, where the attacker has no initial connectivity with\nthe objective of the attack. We give a concise description of this new\ntechnology, and its possible uses in the security research field, such as\npentesting training, study of the impact of 0-days vulnerabilities, evaluation\nof security countermeasures, and risk assessment tool.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 22:24:31 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Futoransky", "Ariel", "", "1 and 2"], ["Miranda", "Fernando", "", "1 and 2"], ["Orlicki", "Jose", "", "1 and 2"], ["Sarraute", "Carlos", "", "1 and 2"]]}, {"id": "1006.1921", "submitter": "Michael Goodrich", "authors": "Matthew T. Dickerson, David Eppstein, Michael T. Goodrich", "title": "Cloning Voronoi Diagrams via Retroactive Data Structures", "comments": "More complete version of paper appearing in 2010 European Symposium\n  on Algorithms (ESA)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of replicating a Voronoi diagram $V(S)$ of a planar\npoint set $S$ by making proximity queries, which are of three possible (in\ndecreasing order of information content): 1. the exact location of the nearest\nsite(s) in $S$; 2. the distance to and label(s) of the nearest site(s) in $S$;\n3. a unique label for every nearest site in $S$. We provide algorithms showing\nhow queries of Type 1 and Type 2 allow an exact cloning of $V(S)$ with $O(n)$\nqueries and $O(n \\log^2 n)$ processing time. We also prove that queries of Type\n3 can never exactly clone $V(S)$, but we show that with $O(n\n\\log\\frac{1}{\\epsilon})$ queries we can construct an $\\epsilon$-approximate\ncloning of $V(S)$. In addition to showing the limits of nearest-neighbor\ndatabase security, our methods also provide one of the first natural\nalgorithmic applications of retroactive data structures.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 22:38:03 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Dickerson", "Matthew T.", ""], ["Eppstein", "David", ""], ["Goodrich", "Michael T.", ""]]}, {"id": "1006.1948", "submitter": "Abedelaziz  Mohaisen", "authors": "Dowon Hong and Abedelaziz Mohaisen", "title": "Augmented Rotation-Based Transformation for Privacy-Preserving Data\n  Clustering", "comments": "11 pages, 11 figures, and 6 tables", "journal-ref": "ETRI Journal, vol.32, no.3, June 2010, pp.351-361", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple rotation-based transformation (MRBT) was introduced recently for\nmitigating the apriori-knowledge independent component analysis (AK-ICA) attack\non rotation-based transformation (RBT), which is used for privacy-preserving\ndata clustering. MRBT is shown to mitigate the AK-ICA attack but at the expense\nof data utility by not enabling conventional clustering. In this paper, we\nextend the MRBT scheme and introduce an augmented rotation-based transformation\n(ARBT) scheme that utilizes linearity of transformation and that both mitigates\nthe AK-ICA attack and enables conventional clustering on data subsets\ntransformed using the MRBT. In order to demonstrate the computational\nfeasibility aspect of ARBT along with RBT and MRBT, we develop a toolkit and\nuse it to empirically compare the different schemes of privacy-preserving data\nclustering based on data transformation in terms of their overhead and privacy.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2010 05:04:27 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Hong", "Dowon", ""], ["Mohaisen", "Abedelaziz", ""]]}, {"id": "1006.2215", "submitter": "Renato Renner", "authors": "Joern Mueller-Quade and Renato Renner", "title": "Composability in quantum cryptography", "comments": "18 pages, 2 figures", "journal-ref": "New Journal of Physics, 11, 085006, 2009 (Focus on Quantum\n  Cryptography: Theory and Practice)", "doi": "10.1088/1367-2630/11/8/085006", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we review several aspects of composability in the context of\nquantum cryptography. The first part is devoted to key distribution. We discuss\nthe security criteria that a quantum key distribution protocol must fulfill to\nallow its safe use within a larger security application (e.g., for secure\nmessage transmission). To illustrate the practical use of composability, we\nshow how to generate a continuous key stream by sequentially composing rounds\nof a quantum key distribution protocol. In a second part, we take a more\ngeneral point of view, which is necessary for the study of cryptographic\nsituations involving, for example, mutually distrustful parties. We explain the\nuniversal composability framework and state the composition theorem which\nguarantees that secure protocols can securely be composed to larger\napplications\n", "versions": [{"version": "v1", "created": "Fri, 11 Jun 2010 07:32:06 GMT"}], "update_date": "2010-06-14", "authors_parsed": [["Mueller-Quade", "Joern", ""], ["Renner", "Renato", ""]]}, {"id": "1006.2356", "submitter": "Carlos Sarraute", "authors": "Diego Bendersky (1 and 2), Ariel Futoransky (1), Luciano\n  Notarfrancesco (1), Carlos Sarraute (1 and 3), Ariel Waissbein (1 and 3) ((1)\n  Corelabs, Core Security Technologies, (2) Departamento de Computacion, FCEyN,\n  Universidad de Buenos Aires, (3) Departamento de Matematica, FCEyN,\n  Universidad de Buenos Aires)", "title": "Advanced Software Protection Now", "comments": "20 pages. CoreLabs Technical Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Software digital rights management is a pressing need for the software\ndevelopment industry which remains, as no practical solutions have been\nacclamaimed succesful by the industry. We introduce a novel software-protection\nmethod, fully implemented with today's technologies, that provides traitor\ntracing and license enforcement and requires no additional hardware nor\ninter-connectivity.\n  Our work benefits from the use of secure triggers, a cryptographic primitive\nthat is secure assuming the existence of an ind-cpa secure block cipher. Using\nour framework, developers may insert license checks and fingerprints, and\nobfuscate the code using secure triggers. As a result, this rises the cost that\nsoftware analysis tools have detect and modify protection mechanisms. Thus\nrising the complexity of cracking this system.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jun 2010 17:57:20 GMT"}], "update_date": "2010-06-14", "authors_parsed": [["Bendersky", "Diego", "", "1 and 2"], ["Futoransky", "Ariel", "", "1 and 3"], ["Notarfrancesco", "Luciano", "", "1 and 3"], ["Sarraute", "Carlos", "", "1 and 3"], ["Waissbein", "Ariel", "", "1 and 3"]]}, {"id": "1006.2407", "submitter": "Carlos Sarraute", "authors": "Carlos Sarraute (1 and 2), Fernando Miranda (1), Jose I. Orlicki (1\n  and 2) ((1) CoreLabs, Core Security Technologies, (2) ITBA (Instituto\n  Tecnologico de Buenos Aires))", "title": "Simulation of Computer Network Attacks", "comments": "17 pages, 3 figures. Argentine Symposium on Computing Technology\n  (AST) 2007 - 36 JAIIO", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this work we present a prototype for simulating computer network attacks.\nOur objective is to simulate large networks (thousands of hosts, with\napplications and vulnerabilities) while remaining realistic from the attacker's\npoint of view. The foundation for the simulator is a model of computer\nintrusions, based on the analysis of real world attacks. In particular we show\nhow to interpret vulnerabilities and exploits as communication channels. This\nconceptual model gives a tool to describe the theater of operations, targets,\nactions and assets involved in multistep network attacks. We conclude with\napplications of the attack simulator.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jun 2010 21:28:45 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Sarraute", "Carlos", "", "1 and 2"], ["Miranda", "Fernando", "", "1\n  and 2"], ["Orlicki", "Jose I.", "", "1\n  and 2"]]}, {"id": "1006.2411", "submitter": "Carlos Sarraute", "authors": "Ivan Arce, Emiliano Kargieman, Gerardo Richarte, Carlos Sarraute,\n  Ariel Waissbein (CoreLabs, Core Security Technologies)", "title": "An attack on MySQL's login protocol", "comments": "15 pages, 3 figures. CoreLabs Technical Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The MySQL challenge-and-response authentication protocol is proved insecure.\nWe show how can an eavesdropper impersonate a valid user after witnessing only\na few executions of this protocol. The algorithm of the underlying attack is\npresented. Finally we comment about implementations and statistical results.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jun 2010 21:56:07 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Arce", "Ivan", "", "CoreLabs, Core Security Technologies"], ["Kargieman", "Emiliano", "", "CoreLabs, Core Security Technologies"], ["Richarte", "Gerardo", "", "CoreLabs, Core Security Technologies"], ["Sarraute", "Carlos", "", "CoreLabs, Core Security Technologies"], ["Waissbein", "Ariel", "", "CoreLabs, Core Security Technologies"]]}, {"id": "1006.2433", "submitter": "Anwitaman Datta", "authors": "Anwitaman Datta", "title": "Anonymous Gossiping", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a novel gossiping primitive to support privacy\npreserving data analytics (PPDA). In contrast to existing computational PPDA\nprimitives such as secure multiparty computation and data randomization based\napproaches, the proposed primitive `anonymous gossiping' is a communication\nprimitive for privacy preserving personalized information aggregation\ncomplementing such traditional computational analytics. We realize this novel\nprimitive by composing existing gossiping mechanisms for peer sampling &\ninformation aggregation and onion routing technique for establishing anonymous\ncommunication. This is more an `ideas' paper, rather than providing concrete\nand quantified results.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jun 2010 05:57:27 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Datta", "Anwitaman", ""]]}, {"id": "1006.2732", "submitter": "Matthijs Melissen", "authors": "Barbara Kordy, Sjouke Mauw, Matthijs Melissen, Patrick Schweitzer", "title": "Attack--Defense Trees and Two-Player Binary Zero-Sum Extensive Form\n  Games Are Equivalent - Technical Report with Proofs", "comments": "Added link to springerlink; Proceedings of GameSec 2010", "journal-ref": null, "doi": "10.1007/978-3-642-17197-0", "report-no": null, "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Attack--defense trees are used to describe security weaknesses of a system\nand possible countermeasures. In this paper, the connection between\nattack--defense trees and game theory is made explicit. We show that\nattack--defense trees and binary zero-sum two-player extensive form games have\nequivalent expressive power when considering satisfiability, in the sense that\nthey can be converted into each other while preserving their outcome and their\ninternal structure.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jun 2010 14:55:12 GMT"}, {"version": "v2", "created": "Wed, 15 Sep 2010 16:13:35 GMT"}, {"version": "v3", "created": "Mon, 4 Oct 2010 12:16:15 GMT"}, {"version": "v4", "created": "Wed, 4 May 2011 14:36:08 GMT"}], "update_date": "2011-05-05", "authors_parsed": [["Kordy", "Barbara", ""], ["Mauw", "Sjouke", ""], ["Melissen", "Matthijs", ""], ["Schweitzer", "Patrick", ""]]}, {"id": "1006.2822", "submitter": "Jenny Blight", "authors": "Debasis Das and Abhishek Ray", "title": "A Parallel Encryption Algorithm for Block Ciphers Based on Reversible\n  Programmable Cellular Automata", "comments": "Submitted to Journal of Computer Science and Engineering, see\n  http://sites.google.com/site/jcseuk/volume-1-issue-1-may-2010", "journal-ref": "Journal of Computer Science and Engineering, Volume 1, Issue 1,\n  p82-90, May 2010", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Cellular Automata (CA) is a computing model of complex System using simple\nrule. In CA the problem space into number of cell and each cell can be one or\nseveral final state. Cells are affected by neighbours' to the simple rule.\nCellular Automata are highly parallel and discrete dynamical systems, whose\nbehaviour is completely specified in terms of a local relation. This paper\ndeals with the Cellular Automata (CA) in cryptography for a class of Block\nCiphers through a new block encryption algorithm based on Reversible\nProgrammable Cellular Automata Theory. The proposed algorithm belongs to the\nclass of symmetric key systems.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jun 2010 19:58:32 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Das", "Debasis", ""], ["Ray", "Abhishek", ""]]}, {"id": "1006.2844", "submitter": "Carlos Sarraute", "authors": "Javier Burroni, Carlos Sarraute (CoreLabs, Core Security Technologies)", "title": "Outrepasser les limites des techniques classiques de Prise d'Empreintes\n  grace aux Reseaux de Neurones", "comments": "16 pages, 3 figures. Symposium sur la S\\'ecurit\\'e des Technologies\n  de l'Information et des Communications (SSTIC), Rennes, France, May 31-June\n  2, 2006", "journal-ref": "Actes du symposium SSTIC (2006)", "doi": null, "report-no": null, "categories": "cs.CR cs.AI cs.NE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We present an application of Artificial Intelligence techniques to the field\nof Information Security. The problem of remote Operating System (OS) Detection,\nalso called OS Fingerprinting, is a crucial step of the penetration testing\nprocess, since the attacker (hacker or security professional) needs to know the\nOS of the target host in order to choose the exploits that he will use. OS\nDetection is accomplished by passively sniffing network packets and actively\nsending test packets to the target host, to study specific variations in the\nhost responses revealing information about its operating system.\n  The first fingerprinting implementations were based on the analysis of\ndifferences between TCP/IP stack implementations. The next generation focused\nthe analysis on application layer data such as the DCE RPC endpoint\ninformation. Even though more information was analyzed, some variation of the\n\"best fit\" algorithm was still used to interpret this new information. Our new\napproach involves an analysis of the composition of the information collected\nduring the OS identification process to identify key elements and their\nrelations. To implement this approach, we have developed tools using Neural\nNetworks and techniques from the field of Statistics. These tools have been\nsuccessfully integrated in a commercial software (Core Impact).\n", "versions": [{"version": "v1", "created": "Mon, 14 Jun 2010 20:52:44 GMT"}], "update_date": "2010-06-16", "authors_parsed": [["Burroni", "Javier", "", "CoreLabs, Core Security Technologies"], ["Sarraute", "Carlos", "", "CoreLabs, Core Security Technologies"]]}, {"id": "1006.3417", "submitter": "Kien Nguyen", "authors": "Kien C. Nguyen, Tansu Alpcan, Tamer Ba\\c{s}ar", "title": "Fictitious Play with Time-Invariant Frequency Update for Network\n  Security", "comments": "Proceedings of the 2010 IEEE Multi-Conference on Systems and Control\n  (MSC10), September 2010, Yokohama, Japan", "journal-ref": null, "doi": "10.1109/CCA.2010.5611248", "report-no": null, "categories": "cs.GT cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two-player security games which can be viewed as sequences of\nnonzero-sum matrix games played by an Attacker and a Defender. The evolution of\nthe game is based on a stochastic fictitious play process, where players do not\nhave access to each other's payoff matrix. Each has to observe the other's\nactions up to present and plays the action generated based on the best response\nto these observations. In a regular fictitious play process, each player makes\na maximum likelihood estimate of her opponent's mixed strategy, which results\nin a time-varying update based on the previous estimate and current action. In\nthis paper, we explore an alternative scheme for frequency update, whose mean\ndynamic is instead time-invariant. We examine convergence properties of the\nmean dynamic of the fictitious play process with such an update scheme, and\nestablish local stability of the equilibrium point when both players are\nrestricted to two actions. We also propose an adaptive algorithm based on this\ntime-invariant frequency update.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 10:13:22 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Nguyen", "Kien C.", ""], ["Alpcan", "Tansu", ""], ["Başar", "Tamer", ""]]}, {"id": "1006.3654", "submitter": "Uwe Aickelin", "authors": "Jamie Twycross, Uwe Aickelin, Amanda Whitbrook", "title": "Detecting Anomalous Process Behaviour using Second Generation Artificial\n  Immune Systems", "comments": "26 pages, 4 tables, 2 figures, International Journal of\n  Unconventional Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CR cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Artificial Immune Systems have been successfully applied to a number of\nproblem domains including fault tolerance and data mining, but have been shown\nto scale poorly when applied to computer intrusion detec- tion despite the fact\nthat the biological immune system is a very effective anomaly detector. This\nmay be because AIS algorithms have previously been based on the adaptive immune\nsystem and biologically-naive mod- els. This paper focuses on describing and\ntesting a more complex and biologically-authentic AIS model, inspired by the\ninteractions between the innate and adaptive immune systems. Its performance on\na realistic process anomaly detection problem is shown to be better than\nstandard AIS methods (negative-selection), policy-based anomaly detection\nmethods (systrace), and an alternative innate AIS approach (the DCA). In\naddition, it is shown that runtime information can be used in combination with\nsystem call information to enhance detection capability.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 09:55:04 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Twycross", "Jamie", ""], ["Aickelin", "Uwe", ""], ["Whitbrook", "Amanda", ""]]}, {"id": "1006.3848", "submitter": "Secretary Aircc Journal", "authors": "Mosin Hasan, Nilesh Prajapati and Safvan Vohara (BVM Engineering\n  College, India)", "title": "Case Study On Social Engineering Techniques for Persuasion", "comments": "7 Pages", "journal-ref": "International journal on applications of graph theory in wireless\n  ad hoc networks and sensor networks 2.2 (2010) 17-23", "doi": "10.5121/jgraphoc.2010.2202", "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  There are plenty of security software in market; each claiming the best,\nstill we daily face problem of viruses and other malicious activities. If we\nknow the basic working principal of such malware then we can very easily\nprevent most of them even without security software. Hackers and crackers are\nexperts in psychology to manipulate people into giving them access or the\ninformation necessary to get access. This paper discusses the inner working of\nsuch attacks. Case study of Spyware is provided. In this case study, we got\n100% success using social engineering techniques for deception on Linux\noperating system, which is considered as the most secure operating system. Few\nbasic principal of defend, for the individual as well as for the organization,\nare discussed here, which will prevent most of such attack if followed.\n", "versions": [{"version": "v1", "created": "Sat, 19 Jun 2010 07:57:58 GMT"}], "update_date": "2011-01-20", "authors_parsed": [["Hasan", "Mosin", "", "BVM Engineering\n  College, India"], ["Prajapati", "Nilesh", "", "BVM Engineering\n  College, India"], ["Vohara", "Safvan", "", "BVM Engineering\n  College, India"]]}, {"id": "1006.4304", "submitter": "Mauricio Alba-Castro", "authors": "Mauricio Alba-Castro (1) (2), Mar\\'ia Alpuente (1), and Santiago\n  Escobar (1) ((1) ELP-DSIC, U. Polit\\'ecnica de Valencia, Spain.\n  alpuente,sescobar@dsic.upv.es. (2) U. Aut\\'onoma de Manizales, Colombia.\n  malba@autonoma.edu.co)", "title": "Abstract Certification of Global Non-Interference in Rewriting Logic", "comments": "26 pages. ACM class (full): D.2.4 [Software Engineering]:\n  Software/Program Verification---Formal Methods; F.3.2 [Logics and Meaning of\n  Programs]: Semantics of Programming Languages---Program Analysis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-interference is a semantic program property that assigns confidentiality\nlevels to data objects and prevents illicit information flows from occurring\nfrom high to low security levels. In this paper, we present a novel security\nmodel for global non-interference which approximates non-interference as a\nsafety property. We also propose a certification technique for global\nnon-interference of complete Java classes based on rewriting logic, a very\ngeneral logical and semantic framework that is efficiently implemented in the\nhigh-level programming language Maude. Starting from an existing Java semantics\nspecification written in Maude, we develop an extended, information-flow Java\nsemantics that allows us to correctly observe global non-interference policies.\nIn order to achieve a finite state transition system, we develop an abstract\nJava semantics that we use for secure and effective non-interference Java\nanalysis. The analysis produces certificates that are independently checkable\nand are small enough to be used in practice.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2010 14:43:10 GMT"}], "update_date": "2010-06-23", "authors_parsed": [["Alba-Castro", "Mauricio", ""], ["Alpuente", "María", ""], ["Escobar", "Santiago", ""]]}, {"id": "1006.4546", "submitter": "William Jackson", "authors": "Muhammad Imran Shafi, Muhammad Akram, Sikandar Hayat, and Imran Sohail", "title": "Effectiveness of Intrusion Prevention Systems (IPS) in Fast Networks", "comments": "IEEE Publication Format,\n  https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Vol. 2, No. 6, June 2010, NY, USA, ISSN\n  2151-9617", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer systems are facing biggest threat in the form of malicious data\nwhich causing denial of service, information theft, financial and credibility\nloss etc. No defense technique has been proved successful in handling these\nthreats. Intrusion Detection and Prevention Systems (IDPSs) being best of\navailable solutions. These techniques are getting more and more attention.\nAlthough Intrusion Prevention Systems (IPSs) show a good level of success in\ndetecting and preventing intrusion attempts to networks, they show a visible\ndeficiency in their performance when they are employed on fast networks. In\nthis paper we have presented a design including quantitative and qualitative\nmethods to identify improvement areas in IPSs. Focus group is used for\nqualitative analysis and experiment is used for quantitative analysis. This\npaper also describes how to reduce the responding time for IPS when an\nintrusion occurs on network, and how can IPS be made to perform its tasks\nsuccessfully without effecting network speed negatively.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 15:05:00 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Shafi", "Muhammad Imran", ""], ["Akram", "Muhammad", ""], ["Hayat", "Sikandar", ""], ["Sohail", "Imran", ""]]}, {"id": "1006.4550", "submitter": "William Jackson", "authors": "Kotrappa Sirbi and Prakash Jayanth Kulkarni", "title": "Stronger Enforcement of Security Using AOP and Spring AOP", "comments": "IEEE Publication Format,\n  https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Vol. 2, No. 6, June 2010, NY, USA, ISSN\n  2151-9617", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An application security has two primary goals: first, it is intended to\nprevent unauthorised personnel from accessing information at higher\nclassification than their authorisation. Second, it is intended to prevent\npersonnel from declassifying information. Using an object oriented approach to\nimplementing application security results not only with the problem of code\nscattering and code tangling, but also results in weaker enforcement of\nsecurity. This weaker enforcement of security could be due to the inherent\ndesign of the system or due to a programming error. Aspect Oriented Programming\n(AOP) complements Object-Oriented Programming (OOP) by providing another way of\nthinking about program structure. The key unit of modularity in OOP is the\nclass, whereas in AOP the unit of modularity is the aspect. The goal of the\npaper is to present that Aspect Oriented Programming AspectJ integrated with\nSpring AOP provides very powerful mechanisms for stronger enforcement of\nsecurity.Aspect-oriented programming (AOP) allows weaving a security aspect\ninto an application providing additional security functionality or introducing\ncompletely new security mechanisms.Implementation of security with AOP is a\nflexible method to develop separated, extensible and reusable pieces of code\ncalled aspects.In this comparative study paper, we argue that Spring AOP\nprovides stronger enforcement of security than AspectJ.We have shown both\nSpring AOP and AspectJ strive to provide a comprehensive AOP solutions and\ncomplements each other.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 15:08:11 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Sirbi", "Kotrappa", ""], ["Kulkarni", "Prakash Jayanth", ""]]}, {"id": "1006.4555", "submitter": "William Jackson", "authors": "Michael Stieghahn and Thomas Engel", "title": "Law-Aware Access Control and its Information Model", "comments": "IEEE Publication Format,\n  https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Vol. 2, No. 6, June 2010, NY, USA, ISSN\n  2151-9617", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cross-border access to a variety of data such as market information,\nstrategic information, or customer-related information defines the daily\nbusiness of many global companies, including financial institutions. These\ncompanies are obliged by law to keep a data processing legal for all offered\nservices. They need to fulfill different security objectives specified by the\nlegislation. Therefore, they control access to prevent unauthorized users from\nusing data. Those security objectives, for example confidentiality or secrecy,\nare often defined in the eXtensible Access Control Markup Language that\npromotes interoperability between different systems. In this paper, we show the\nnecessity of incorporating the requirements of legislation into access control.\nBased on the work flow in a banking scenario we describe a variety of available\ncontextual information and their interrelations. Different from other access\ncontrol systems our main focus is on law-compliant cross-border data access. By\nincluding legislation directly into access decisions, this lawfulness can be\nensured. We also describe our information model to demonstrate how these\npolicies can be implemented into an existing network and how the components and\ncontextual information interrelate. Finally, we outline an event flow for a\nrequest made from a remote user exemplifying how such a system decides about\naccess.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 15:11:28 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Stieghahn", "Michael", ""], ["Engel", "Thomas", ""]]}, {"id": "1006.4569", "submitter": "William Jackson", "authors": "S. Siti Rahayu, Y. Robiah, S. Shahrin, M. Mohd Zaki, M. A. Faizal and\n  Z. A. Zaheera", "title": "Advanced Trace Pattern For Computer Intrusion Discovery", "comments": "IEEE Publication Format,\n  https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Vol. 2, No. 6, June 2010, NY, USA, ISSN\n  2151-9617", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The number of crime committed based on the malware intrusion is never ending\nas the number of malware variants is growing tremendously and the usage of\ninternet is expanding globally. Malicious codes easily obtained and use as one\nof weapon to gain their objective illegally. Hence, in this research, diverse\nlogs from different OSI layer are explored to identify the traces left on the\nattacker and victim logs in order to establish worm trace pattern to defending\nagainst the attack and help revealing true attacker or victim. For the purpose\nof this paper, it focused on malware intrusion and traditional worm namely\nsasser worm variants. The concept of trace pattern is created by fusing the\nattacker's and victim's perspective. Therefore, the objective of this paper is\nto propose a general worm trace pattern for attacker's, victim's and multi-step\n(attacker/victim)'s by combining both perspectives. These three proposed worm\ntrace patterns can be extended into research areas in alert correlation and\ncomputer forensic investigation.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 15:23:25 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Rahayu", "S. Siti", ""], ["Robiah", "Y.", ""], ["Shahrin", "S.", ""], ["Zaki", "M. Mohd", ""], ["Faizal", "M. A.", ""], ["Zaheera", "Z. A.", ""]]}, {"id": "1006.4653", "submitter": "Givon Zirkind", "authors": "Givon Zirkind", "title": "Using Repeating Decimals As An Alternative To Prime Numbers In\n  Encryption", "comments": "This paper has been withdrawn by the author. Paper was replaced by a\n  later version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is meant to provide an additional point of view, applying known\nknowledge, to supply keys that have a series of non-repeating digits, in a\nmanner that is not usually thought of. Traditionally, prime numbers are used in\nencryption as keys that have non-repeating sequences. Usually, non-repetition,\nespecially of digits in a key, is very sought after in encryption. Uniqueness\nin a digit sequence defeats decryption. In searching for methods of\nnon-decryptable encryption as well as ways to provide unique sequences, other\nthan using prime numbers [5], the idea of using repeating decimals came to me.\nApplied correctly, a repeating decimal series of sufficient length will stand\nin as well for a prime number. This is so, because only numbers prime to each\nother will produce repeating decimals and; within the repeating sequence there\nis uniqueness of digit sequence.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 22:09:15 GMT"}, {"version": "v2", "created": "Thu, 1 Jul 2010 16:01:01 GMT"}], "update_date": "2010-07-02", "authors_parsed": [["Zirkind", "Givon", ""]]}, {"id": "1006.4703", "submitter": "Ryutaroh Matsumoto", "authors": "Ryutaroh Matsumoto", "title": "A construction of universal secure network coding", "comments": "This paper has been withdrawn by the author. The proof technique in\n  this paper does not ensure the existence of a coding scheme that is secure\n  against all the eavesdropping matrices of rank less than or equal to \\mu,\n  which means that the proof does not prove the universal security as\n  originally claimed. A much extended and corrected version of this paper was\n  registered as arXiv:1102.3002. The author appreciates the helpful comment by\n  Dr. Jun Muramatsu", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct a universal secure network coding. Our construction just\nmodifies the transmission scheme at the source node and works with every linear\ncoding at an intermediate node. We relax the security criterion such that the\nmutual information between the message and the eavesdropped signal is\nsufficiently small instead of strictly zero. Our construction allows the set of\neavesdropped links to change at each time slot.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 07:35:53 GMT"}, {"version": "v2", "created": "Wed, 30 Jun 2010 03:32:43 GMT"}, {"version": "v3", "created": "Tue, 12 Oct 2010 01:43:54 GMT"}, {"version": "v4", "created": "Wed, 16 Feb 2011 01:11:54 GMT"}], "update_date": "2011-02-17", "authors_parsed": [["Matsumoto", "Ryutaroh", ""]]}, {"id": "1006.4850", "submitter": "Natalia Mosina", "authors": "Natalia Mosina, Alexander Ushakov", "title": "Mean-Set Attack: Cryptanalysis of Sibert et al. Authentication Protocol", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR cs.CR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the Sibert et al. group-based (Feige-Fiat-Shamir type)\nauthentication protocol and show that the protocol is not computationally\nzero-knowledge. In addition, we provide experimental evidence that our approach\nis practical and can succeed even for groups with no efficiently computable\nlength function such as braid groups. The novelty of this work is that we are\nnot attacking the protocol by trying to solve an underlying complex algebraic\nproblem, namely, the conjugacy search problem, but use a probabilistic\napproach, instead.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 18:04:32 GMT"}], "update_date": "2010-06-25", "authors_parsed": [["Mosina", "Natalia", ""], ["Ushakov", "Alexander", ""]]}, {"id": "1006.5008", "submitter": "Uwe Aickelin", "authors": "Julie Greensmith, Uwe Aickelin, Steve Cayzer", "title": "Detecting Danger: The Dendritic Cell Algorithm", "comments": "27 pages, 8 figures, Robust Intelligent Systems", "journal-ref": "Robust Intelligent Systems, 12, p 89-112, 2008", "doi": null, "report-no": null, "categories": "cs.AI cs.CR cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Dendritic Cell Algorithm (DCA) is inspired by the function of the\ndendritic cells of the human immune system. In nature, dendritic cells are the\nintrusion detection agents of the human body, policing the tissue and organs\nfor potential invaders in the form of pathogens. In this research, and abstract\nmodel of DC behaviour is developed and subsequently used to form an algorithm,\nthe DCA. The abstraction process was facilitated through close collaboration\nwith laboratory- based immunologists, who performed bespoke experiments, the\nresults of which are used as an integral part of this algorithm. The DCA is a\npopulation based algorithm, with each agent in the system represented as an\n'artificial DC'. Each DC has the ability to combine multiple data streams and\ncan add context to data suspected as anomalous. In this chapter the abstraction\nprocess and details of the resultant algorithm are given. The algorithm is\napplied to numerous intrusion detection problems in computer security including\nthe detection of port scans and botnets, where it has produced impressive\nresults with relatively low rates of false positives.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2010 15:30:45 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Greensmith", "Julie", ""], ["Aickelin", "Uwe", ""], ["Cayzer", "Steve", ""]]}, {"id": "1006.5381", "submitter": "Catalin Anghel Mr", "authors": "Catalin Anghel", "title": "Cresterea securitatii sistemelor informatice si de comunicatii prin\n  criptografia cuantica", "comments": "24 pag", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Catch 22 of cryptography - \"Before two parties can communicate in secret,\nthey must first communicate in secret\". The weakness of classical cryptographic\ncommunication systems is that secret communication can only take place after a\nkey is communicated in secret over a totally secure communication channel. Here\ncomes quantum key distribution which takes advantage of certain phenomena that\noccur at the subatomic level, so that any attempt by an enemy to obtain the\nbits in a key not only fails, but gets detected as well.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2010 15:45:25 GMT"}], "update_date": "2010-06-29", "authors_parsed": [["Anghel", "Catalin", ""]]}, {"id": "1006.5502", "submitter": "Nilanjan Banerjee", "authors": "Jonathan White and Nilanjan Banerjee", "title": "Mirage: Mitigating Illicit Inventorying in a RFID Enabled Retail\n  Environment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given its low dollar and maintenance cost, RFID is poised to become the\nenabling technology for inventory control and supply chain management. However,\nas an outcome of its low cost, RFID based inventory control is susceptible to\npernicious security and privacy threats. A deleterious attack on such a system\nis corporate espionage, where attackers through illicit inventorying infer\nsales and restocking trends for products. In this paper, we first present\nplausible aftermaths of corporate espionage using real data from online\nsources. Second, to mitigate corporate espionage in a retail store environment,\nwe present a simple lowcost system called Mirage. Mirage uses additional\nprogrammable low cost passive RFID tags called honeytokens to inject noise in\nretail store inven-torying. Using a simple history based algorithm that\ncontrols activation and de-activation of honeytokens, Mirage randomizes sales\nand restocking trends. We evaluate Mirage in a real warehouse environment using\na commercial off-the-shelf Motorola MC9090 handheld RFID reader and over 450\nGen2 low cost RFID tags. We show that Mirage successfully flattens and\nrandomizes sales and restocking trends while adding minimal cost to inventory\ncontrol.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2010 04:00:52 GMT"}], "update_date": "2010-06-30", "authors_parsed": [["White", "Jonathan", ""], ["Banerjee", "Nilanjan", ""]]}, {"id": "1006.5745", "submitter": "Poonam Garg", "authors": "Poonam Garg", "title": "Evolutionary Computation Algorithms for Cryptanalysis: A Study", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The cryptanalysis of various cipher problems can be formulated as NP-Hard\ncombinatorial problem. Solving such problems requires time and/or memory\nrequirement which increases with the size of the problem. Techniques for\nsolving combinatorial problems fall into two broad groups - exact algorithms\nand Evolutionary Computation algorithms. An exact algorithms guarantees that\nthe optimal solution to the problem will be found. The exact algorithms like\nbranch and bound, simplex method, brute force etc methodology is very\ninefficient for solving combinatorial problem because of their prohibitive\ncomplexity (time and memory requirement). The Evolutionary Computation\nalgorithms are employed in an attempt to find an adequate solution to the\nproblem. A Evolutionary Computation algorithm - Genetic algorithm, simulated\nannealing and tabu search were developed to provide a robust and efficient\nmethodology for cryptanalysis. The aim of these techniques to find sufficient\n\"good\" solution efficiently with the characteristics of the problem, instead of\nthe global optimum solution, and thus it also provides attractive alternative\nfor the large scale applications. This paper focuses on the methodology of\nEvolutionary Computation algorithms .\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2010 00:07:44 GMT"}], "update_date": "2010-07-01", "authors_parsed": [["Garg", "Poonam", ""]]}, {"id": "1006.5879", "submitter": "Ashish Khisti", "authors": "Ashish Khisti, Gregory Wornell", "title": "Secure Transmission with Multiple Antennas II: The MIMOME Wiretap\n  Channel", "comments": "To Appear, IEEE Trans. Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2010.2068852", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity of the Gaussian wiretap channel model is analyzed when there are\nmultiple antennas at the sender, intended receiver and eavesdropper. The\nassociated channel matrices are fixed and known to all the terminals. A\ncomputable characterization of the secrecy capacity is established as the\nsaddle point solution to a minimax problem. The converse is based on a\nSato-type argument used in other broadcast settings, and the coding theorem is\nbased on Gaussian wiretap codebooks.\n  At high signal-to-noise ratio (SNR), the secrecy capacity is shown to be\nattained by simultaneously diagonalizing the channel matrices via the\ngeneralized singular value decomposition, and independently coding across the\nresulting parallel channels. The associated capacity is expressed in terms of\nthe corresponding generalized singular values. It is shown that a semi-blind\n\"masked\" multi-input multi-output (MIMO) transmission strategy that sends\ninformation along directions in which there is gain to the intended receiver,\nand synthetic noise along directions in which there is not, can be arbitrarily\nfar from capacity in this regime.\n  Necessary and sufficient conditions for the secrecy capacity to be zero are\nprovided, which simplify in the limit of many antennas when the entries of the\nchannel matrices are independent and identically distributed. The resulting\nscaling laws establish that to prevent secure communication, the eavesdropper\nneeds 3 times as many antennas as the sender and intended receiver have\njointly, and that the optimimum division of antennas between sender and\nintended receiver is in the ratio of 2:1.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2010 15:10:04 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Khisti", "Ashish", ""], ["Wornell", "Gregory", ""]]}, {"id": "1006.5894", "submitter": "Anna Rimoldi", "authors": "Anna Rimoldi, Massimiliano Sala, Ilia Toli", "title": "A possible intrinsic weakness of AES and other cryptosystems", "comments": "46 pages- updated bibliography and fixed minor problems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been suggested that the algebraic structure of AES (and other similar\nblock ciphers) could lead to a weakness exploitable in new attacks. In this\npaper, we use the algebraic structure of AES-like ciphers to construct a cipher\nembedding where the ciphers may lose their non-linearity. We show some examples\nand we discuss the limitations of our approach.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2010 15:54:42 GMT"}, {"version": "v2", "created": "Tue, 21 Sep 2010 10:05:26 GMT"}, {"version": "v3", "created": "Thu, 11 Nov 2010 13:38:58 GMT"}], "update_date": "2010-11-12", "authors_parsed": [["Rimoldi", "Anna", ""], ["Sala", "Massimiliano", ""], ["Toli", "Ilia", ""]]}, {"id": "1006.5922", "submitter": "Givon Zirkind", "authors": "Givon Zirkind", "title": "Using Repeating Decimals As An Alternative To Prime Numbers In\n  Encryption", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is meant to provide an additional point of view, applying known\nknowledge, to supply keys that have a series of non-repeating digits, in a\nmanner that is not usually thought of. Traditionally, prime numbers are used in\nencryption as keys that have non-repeating sequences. Non-repetition of digits\nin a key is very sought after in encryption. Uniqueness in a digit sequence\ndefeats decryption by method. In searching for methods of non-decryptable\nencryption as well as ways to provide unique sequences, other than using prime\nnumbers, the idea of using repeating decimals came to me. Applied correctly, a\nrepeating decimal series of sufficient length will stand in as well for a prime\nnumber. This is so, because only numbers prime to each other will produce\nrepeating decimals and; within the repeating sequence there is uniqueness of\ndigit sequence.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2010 17:05:02 GMT"}, {"version": "v2", "created": "Thu, 1 Jul 2010 16:10:54 GMT"}, {"version": "v3", "created": "Mon, 5 Jul 2010 19:18:54 GMT"}], "update_date": "2010-07-06", "authors_parsed": [["Zirkind", "Givon", ""]]}]