[{"id": "0805.0389", "submitter": "Chaitanya Swamy", "authors": "Chaitanya Swamy", "title": "Algorithms for Probabilistically-Constrained Models of Risk-Averse\n  Stochastic Optimization with Black-Box Distributions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider various stochastic models that incorporate the notion of\nrisk-averseness into the standard 2-stage recourse model, and develop novel\ntechniques for solving the algorithmic problems arising in these models. A key\nnotable feature of our work that distinguishes it from work in some other\nrelated models, such as the (standard) budget model and the (demand-) robust\nmodel, is that we obtain results in the black-box setting, that is, where one\nis given only sampling access to the underlying distribution. Our first model,\nwhich we call the risk-averse budget model, incorporates the notion of\nrisk-averseness via a probabilistic constraint that restricts the probability\n(according to the underlying distribution) with which the second-stage cost may\nexceed a given budget B to at most a given input threshold \\rho. We also a\nconsider a closely-related model that we call the risk-averse robust model,\nwhere we seek to minimize the first-stage cost and the (1-\\rho)-quantile of the\nsecond-stage cost.\n  We obtain approximation algorithms for a variety of combinatorial\noptimization problems including the set cover, vertex cover, multicut on trees,\nmin cut, and facility location problems, in the risk-averse budget and robust\nmodels with black-box distributions. We obtain near-optimal solutions that\npreserve the budget approximately and incur a small blow-up of the probability\nthreshold (both of which are unavoidable). To the best of our knowledge, these\nare the first approximation results for problems involving probabilistic\nconstraints and black-box distributions. A major component of our results is a\nfully polynomial approximation scheme for solving the LP-relaxation of the\nrisk-averse problem.\n", "versions": [{"version": "v1", "created": "Sun, 4 May 2008 03:57:52 GMT"}], "update_date": "2008-05-06", "authors_parsed": [["Swamy", "Chaitanya", ""]]}, {"id": "0805.0514", "submitter": "Jens Zumbr\\\"agel", "authors": "Jens Zumbragel, Gerard Maze, Joachim Rosenthal", "title": "Efficient recovering of operation tables of black box groups and rings", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.GR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  People have been studying the following problem: Given a finite set S with a\nhidden (black box) binary operation * on S which might come from a group law,\nand suppose you have access to an oracle that you can ask for the operation x*y\nof single pairs (x,y) you choose. What is the minimal number of queries to the\noracle until the whole binary operation is recovered, i.e. you know x*y for all\nx,y in S?\n  This problem can trivially be solved by using |S|^2 queries to the oracle, so\nthe question arises under which circumstances you can succeed with a\nsignificantly smaller number of queries.\n  In this presentation we give a lower bound on the number of queries needed\nfor general binary operations. On the other hand, we present algorithms solving\nthis problem by using |S| queries, provided that * is an abelian group\noperation. We also investigate black box rings and give lower and upper bounds\nfor the number of queries needed to solve product recovering in this case.\n", "versions": [{"version": "v1", "created": "Mon, 5 May 2008 12:17:04 GMT"}], "update_date": "2008-05-06", "authors_parsed": [["Zumbragel", "Jens", ""], ["Maze", "Gerard", ""], ["Rosenthal", "Joachim", ""]]}, {"id": "0805.0585", "submitter": "Jean Gallier", "authors": "Jean Gallier", "title": "Discrete Mathematics for Computer Science, Some Notes", "comments": "255 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These are notes on discrete mathematics for computer scientists. The\npresentation is somewhat unconventional. Indeed I begin with a discussion of\nthe basic rules of mathematical reasoning and of the notion of proof formalized\nin a natural deduction system ``a la Prawitz''. The rest of the material is\nmore or less traditional but I emphasize partial functions more than usual\n(after all, programs may not terminate for all input) and I provide a fairly\ncomplete account of the basic concepts of graph theory.\n", "versions": [{"version": "v1", "created": "Mon, 5 May 2008 18:52:00 GMT"}], "update_date": "2008-05-06", "authors_parsed": [["Gallier", "Jean", ""]]}, {"id": "0805.0612", "submitter": "Andrei Gagarin", "authors": "Andrei Gagarin, Anush Poghosyan, and Vadim E. Zverovich", "title": "Upper bounds for alpha-domination parameters", "comments": "7 pages; Presented at the 4th East Coast Combinatorial Conference,\n  Antigonish (Nova Scotia, Canada), May 1-2, 2008", "journal-ref": "Graphs Combin. 25 (2009), no. 4, pp. 513-520", "doi": "10.1007/s00373-009-0864-6", "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we provide a new upper bound for the alpha-domination number.\nThis result generalises the well-known Caro-Roditty bound for the domination\nnumber of a graph. The same probabilistic construction is used to generalise\nanother well-known upper bound for the classical domination in graphs. We also\nprove similar upper bounds for the alpha-rate domination number, which combines\nthe concepts of alpha-domination and k-tuple domination.\n", "versions": [{"version": "v1", "created": "Mon, 5 May 2008 22:20:55 GMT"}], "update_date": "2010-12-24", "authors_parsed": [["Gagarin", "Andrei", ""], ["Poghosyan", "Anush", ""], ["Zverovich", "Vadim E.", ""]]}, {"id": "0805.0730", "submitter": "Amy Glen", "authors": "Amy Glen, Florence Lev\\'e, Gw\\'ena\\\"el Richomme", "title": "Quasiperiodic and Lyndon episturmian words", "comments": "33 pages; minor changes", "journal-ref": "Theoretical Computer Science 409 (2008) 578-600", "doi": "10.1016/j.tcs.2008.09.056", "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently the second two authors characterized quasiperiodic Sturmian words,\nproving that a Sturmian word is non-quasiperiodic if and only if it is an\ninfinite Lyndon word. Here we extend this study to episturmian words (a natural\ngeneralization of Sturmian words) by describing all the quasiperiods of an\nepisturmian word, which yields a characterization of quasiperiodic episturmian\nwords in terms of their \"directive words\". Even further, we establish a\ncomplete characterization of all episturmian words that are Lyndon words. Our\nmain results show that, unlike the Sturmian case, there is a much wider class\nof episturmian words that are non-quasiperiodic, besides those that are\ninfinite Lyndon words. Our key tools are morphisms and directive words, in\nparticular \"normalized\" directive words, which we introduced in an earlier\npaper. Also of importance is the use of \"return words\" to characterize\nquasiperiodic episturmian words, since such a method could be useful in other\ncontexts.\n", "versions": [{"version": "v1", "created": "Tue, 6 May 2008 14:22:03 GMT"}, {"version": "v2", "created": "Wed, 17 Sep 2008 12:44:33 GMT"}], "update_date": "2010-03-16", "authors_parsed": [["Glen", "Amy", ""], ["Levé", "Florence", ""], ["Richomme", "Gwénaël", ""]]}, {"id": "0805.0954", "submitter": "Shmuel Onn", "authors": "Jon Lee, Shmuel Onn, Robert Weismantel", "title": "Nonlinear Optimization over a Weighted Independence System", "comments": null, "journal-ref": "SIAM Journal on Discrete Mathematics, 23:1667--1681, 2009", "doi": null, "report-no": null, "categories": "math.CO cs.CC cs.DM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of optimizing a nonlinear objective function over a\nweighted independence system presented by a linear-optimization oracle. We\nprovide a polynomial-time algorithm that determines an r-best solution for\nnonlinear functions of the total weight of an independent set, where r is a\nconstant that depends on certain Frobenius numbers of the individual weights\nand is independent of the size of the ground set. In contrast, we show that\nfinding an optimal (0-best) solution requires exponential time even in a very\nspecial case of the problem.\n", "versions": [{"version": "v1", "created": "Wed, 7 May 2008 11:05:01 GMT"}], "update_date": "2009-11-21", "authors_parsed": [["Lee", "Jon", ""], ["Onn", "Shmuel", ""], ["Weismantel", "Robert", ""]]}, {"id": "0805.1373", "submitter": "Brendan Lucier", "authors": "Brendan Lucier", "title": "Binary Morphisms to Ultimately Periodic Words", "comments": "2 pages, working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper classifies binary morphisms that map to ultimately periodic words.\nIn particular, if a morphism h maps an infinite non-ultimately periodic word to\nan ultimately periodic word then it must be true that h(0) commutes with h(1).\n", "versions": [{"version": "v1", "created": "Fri, 9 May 2008 15:42:13 GMT"}], "update_date": "2008-05-12", "authors_parsed": [["Lucier", "Brendan", ""]]}, {"id": "0805.1567", "submitter": "Shai Carmi", "authors": "Shai Carmi, Zhenhua Wu, Shlomo Havlin, H. Eugene Stanley", "title": "Transport in networks with multiple sources and sinks", "comments": null, "journal-ref": "Europhys. Lett. 84, 28005 (2008)", "doi": "10.1209/0295-5075/84/28005", "report-no": null, "categories": "cs.DM cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the electrical current and flow (number of parallel paths)\nbetween two sets of n sources and n sinks in complex networks. We derive\nanalytical formulas for the average current and flow as a function of n. We\nshow that for small n, increasing n improves the total transport in the\nnetwork, while for large n bottlenecks begin to form. For the case of flow,\nthis leads to an optimal n* above which the transport is less efficient. For\ncurrent, the typical decrease in the length of the connecting paths for large n\ncompensates for the effect of the bottlenecks. We also derive an expression for\nthe average flow as a function of n under the common limitation that transport\ntakes place between specific pairs of sources and sinks.\n", "versions": [{"version": "v1", "created": "Mon, 12 May 2008 00:07:50 GMT"}, {"version": "v2", "created": "Mon, 17 Nov 2008 15:40:06 GMT"}], "update_date": "2008-11-17", "authors_parsed": [["Carmi", "Shai", ""], ["Wu", "Zhenhua", ""], ["Havlin", "Shlomo", ""], ["Stanley", "H. Eugene", ""]]}, {"id": "0805.1593", "submitter": "Bernd G\\\"unther", "authors": "Bernd G\\\"unther", "title": "On the Probability Distribution of Superimposed Random Codes", "comments": null, "journal-ref": "IEEE Trans. Inf. Theory, 54(7):3206--3210, 2008", "doi": "10.1109/TIT.2008.924658", "report-no": null, "categories": "cs.DB cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A systematic study of the probability distribution of superimposed random\ncodes is presented through the use of generating functions. Special attention\nis paid to the cases of either uniformly distributed but not necessarily\nindependent or non uniform but independent bit structures. Recommendations for\noptimal coding strategies are derived.\n", "versions": [{"version": "v1", "created": "Mon, 12 May 2008 08:52:16 GMT"}, {"version": "v2", "created": "Thu, 19 Jun 2008 05:30:49 GMT"}], "update_date": "2008-06-19", "authors_parsed": [["Günther", "Bernd", ""]]}, {"id": "0805.2081", "submitter": "Genta Ito", "authors": "Genta Ito", "title": "Least change in the Determinant or Permanent of a matrix under\n  perturbation of a single element: continuous and discrete cases", "comments": "15 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We formulate the problem of finding the probability that the determinant of a\nmatrix undergoes the least change upon perturbation of one of its elements,\nprovided that most or all of the elements of the matrix are chosen at random\nand that the randomly chosen elements have a fixed probability of being\nnon-zero. Also, we show that the procedure for finding the probability that the\ndeterminant undergoes the least change depends on whether the random variables\nfor the matrix elements are continuous or discrete.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 15:01:46 GMT"}], "update_date": "2008-05-15", "authors_parsed": [["Ito", "Genta", ""]]}, {"id": "0805.2083", "submitter": "Genta Ito", "authors": "Genta Ito", "title": "Approximate formulation of the probability that the Determinant or\n  Permanent of a matrix undergoes the least change under perturbation of a\n  single element", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an earlier paper, we discussed the probability that the determinant of a\nmatrix undergoes the least change upon perturbation of one of its elements,\nprovided that most or all of the elements of the matrix are chosen at random\nand that the randomly chosen elements have a fixed probability of being\nnon-zero. In this paper, we derive approximate formulas for that probability by\nassuming that the terms in the permanent of a matrix are independent of one\nanother, and we apply that assumption to several classes of matrices. In the\ncourse of deriving those formulas, we identified several integer sequences that\nare not listed on Sloane's Web site.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 15:05:44 GMT"}], "update_date": "2008-05-15", "authors_parsed": [["Ito", "Genta", ""]]}, {"id": "0805.2199", "submitter": "Navin Kashyap", "authors": "Navin Kashyap", "title": "Constraint Complexity of Realizations of Linear Codes on Arbitrary\n  Graphs", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2009.2030492", "report-no": null, "categories": "cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A graphical realization of a linear code C consists of an assignment of the\ncoordinates of C to the vertices of a graph, along with a specification of\nlinear state spaces and linear ``local constraint'' codes to be associated with\nthe edges and vertices, respectively, of the graph. The $\\k$-complexity of a\ngraphical realization is defined to be the largest dimension of any of its\nlocal constraint codes. $\\k$-complexity is a reasonable measure of the\ncomputational complexity of a sum-product decoding algorithm specified by a\ngraphical realization. The main focus of this paper is on the following\nproblem: given a linear code C and a graph G, how small can the $\\k$-complexity\nof a realization of C on G be? As useful tools for attacking this problem, we\nintroduce the Vertex-Cut Bound, and the notion of ``vc-treewidth'' for a graph,\nwhich is closely related to the well-known graph-theoretic notion of treewidth.\nUsing these tools, we derive tight lower bounds on the $\\k$-complexity of any\nrealization of C on G. Our bounds enable us to conclude that good\nerror-correcting codes can have low-complexity realizations only on graphs with\nlarge vc-treewidth. Along the way, we also prove the interesting result that\nthe ratio of the $\\k$-complexity of the best conventional trellis realization\nof a length-n code C to the $\\k$-complexity of the best cycle-free realization\nof C grows at most logarithmically with codelength n. Such a logarithmic growth\nrate is, in fact, achievable.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 02:26:48 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Kashyap", "Navin", ""]]}, {"id": "0805.3901", "submitter": "Gregory Gutin", "authors": "Gregory Gutin and Eun Jung Kim", "title": "Properly Coloured Cycles and Paths: Results and Open Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a number of results and seven conjectures on\nproperly edge-coloured (PC) paths and cycles in edge-coloured multigraphs. We\noverview some known results and prove new ones. In particular, we consider a\nfamily of transformations of an edge-coloured multigraph $G$ into an ordinary\ngraph that allow us to check the existence PC cycles and PC $(s,t)$-paths in\n$G$ and, if they exist, to find shortest ones among them. We raise a problem of\nfinding the optimal transformation and consider a possible solution to the\nproblem.\n", "versions": [{"version": "v1", "created": "Mon, 26 May 2008 09:17:21 GMT"}, {"version": "v2", "created": "Fri, 30 May 2008 14:33:10 GMT"}, {"version": "v3", "created": "Sat, 31 May 2008 07:48:28 GMT"}], "update_date": "2008-05-31", "authors_parsed": [["Gutin", "Gregory", ""], ["Kim", "Eun Jung", ""]]}, {"id": "0805.4049", "submitter": "Zhi Xu", "authors": "Zhi Xu, J. Shallit", "title": "An NP-hardness Result on the Monoid Frobenius Problem", "comments": "2 pages, working paper; an error in Problem 5 is corrected", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The following problem is NP-hard: given a regular expression $E$, decide if\n$E^*$ is not co-finite.\n", "versions": [{"version": "v1", "created": "Tue, 27 May 2008 16:18:19 GMT"}, {"version": "v2", "created": "Tue, 27 May 2008 22:51:22 GMT"}, {"version": "v3", "created": "Mon, 30 Jun 2008 15:00:26 GMT"}], "update_date": "2008-06-30", "authors_parsed": [["Xu", "Zhi", ""], ["Shallit", "J.", ""]]}, {"id": "0805.4300", "submitter": "Shai  Gutner", "authors": "Noga Alon and Shai Gutner", "title": "Balanced Families of Perfect Hash Functions and Their Applications", "comments": null, "journal-ref": "Proc. of 34th ICALP (2007), 435-446", "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The construction of perfect hash functions is a well-studied topic. In this\npaper, this concept is generalized with the following definition. We say that a\nfamily of functions from $[n]$ to $[k]$ is a $\\delta$-balanced $(n,k)$-family\nof perfect hash functions if for every $S \\subseteq [n]$, $|S|=k$, the number\nof functions that are 1-1 on $S$ is between $T/\\delta$ and $\\delta T$ for some\nconstant $T>0$. The standard definition of a family of perfect hash functions\nrequires that there will be at least one function that is 1-1 on $S$, for each\n$S$ of size $k$. In the new notion of balanced families, we require the number\nof 1-1 functions to be almost the same (taking $\\delta$ to be close to 1) for\nevery such $S$. Our main result is that for any constant $\\delta > 1$, a\n$\\delta$-balanced $(n,k)$-family of perfect hash functions of size $2^{O(k \\log\n\\log k)} \\log n$ can be constructed in time $2^{O(k \\log \\log k)} n \\log n$.\nUsing the technique of color-coding we can apply our explicit constructions to\ndevise approximation algorithms for various counting problems in graphs. In\nparticular, we exhibit a deterministic polynomial time algorithm for\napproximating both the number of simple paths of length $k$ and the number of\nsimple cycles of size $k$ for any $k \\leq O(\\frac{\\log n}{\\log \\log \\log n})$\nin a graph with $n$ vertices. The approximation is up to any fixed desirable\nrelative error.\n", "versions": [{"version": "v1", "created": "Wed, 28 May 2008 09:49:18 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Alon", "Noga", ""], ["Gutner", "Shai", ""]]}, {"id": "0805.4718", "submitter": "Radoslaw Hofman", "authors": "Radoslaw Hofman", "title": "Report on article The Travelling Salesman Problem: A Linear Programming\n  Formulation", "comments": "Counter example for extended version of Diaby model for his\n  publication in arXiv:0803.4354v1 [cs.DM]", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article describes counter example prepared in order to prove that linear\nformulation of TSP problem proposed in [arXiv:0803.4354] is incorrect (it\napplies also to QAP problem formulation in [arXiv:0802.4307]). Article refers\nnot only to model itself, but also to ability of extension of proposed model to\nbe correct.\n", "versions": [{"version": "v1", "created": "Fri, 30 May 2008 10:22:45 GMT"}, {"version": "v2", "created": "Mon, 2 Jun 2008 07:04:11 GMT"}], "update_date": "2008-06-02", "authors_parsed": [["Hofman", "Radoslaw", ""]]}, {"id": "0805.4745", "submitter": "Juan de Lara", "authors": "Juan de Lara and Esther Guerra", "title": "Pattern-based Model-to-Model Transformation: Long Version", "comments": "extended version of the paper from the ICGT'2008 conference\n  (Leicester)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.DM cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new, high-level approach for the specification of model-to-model\ntransformations based on declarative patterns. These are (atomic or composite)\nconstraints on triple graphs declaring the allowed or forbidden relationships\nbetween source and target models. In this way, a transformation is defined by\nspecifying a set of triple graph constraints that should be satisfied by the\nresult of the transformation.\n  The description of the transformation is then compiled into lower-level\noperational mechanisms to perform forward or backward transformations, as well\nas to establish mappings between two existent models. In this paper we study\none of such mechanisms based on the generation of operational triple graph\ngrammar rules. Moreover, we exploit deduction techniques at the specification\nlevel to generate more specialized constraints (preserving the specification\nsemantics) reflecting pattern dependencies, from which additional rules can be\nderived.\n  This is an extended version of the paper submitted to ICGT'08, with\nadditional definitions and proofs.\n", "versions": [{"version": "v1", "created": "Fri, 30 May 2008 12:48:16 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["de Lara", "Juan", ""], ["Guerra", "Esther", ""]]}]