[{"id": "0708.0353", "submitter": "Dariusz Grech", "authors": "D. Grech, G. Pamu{\\l}a (University of Wroclaw, ITP)", "title": "The Local Fractal Properties of the Financial Time Series on the Polish\n  Stock Exchange Market", "comments": "LaTeX, 14 pages, 12 figures included", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.CE physics.data-an", "license": null, "abstract": "  We investigate the local fractal properties of the financial time series\nbased on the evolution of the Warsaw Stock Exchange Index (WIG) connected with\nthe largest developing financial market in Europe. Calculating the local Hurst\nexponent for the WIG time series we find an interesting dependence between the\nbehavior of the local fractal properties of the WIG time series and the crashes\nappearance on the financial market.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2007 14:22:30 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Grech", "D.", "", "University of Wroclaw, ITP"], ["Pamuła", "G.", "", "University of Wroclaw, ITP"]]}, {"id": "0708.0505", "submitter": "Luca Di Gaspero PhD", "authors": "Luca Di Gaspero, Andrea Roli", "title": "A preliminary analysis on metaheuristics methods applied to the\n  Haplotype Inference Problem", "comments": "22 pages, 4 figures Technical Report: DEIS - Alma Mater Studiorum,\n  University of Bologna no. DEIS-LIA-006-07", "journal-ref": null, "doi": null, "report-no": "DEIS-LIA-006-07", "categories": "cs.AI cs.CE cs.DM q-bio.QM", "license": null, "abstract": "  Haplotype Inference is a challenging problem in bioinformatics that consists\nin inferring the basic genetic constitution of diploid organisms on the basis\nof their genotype. This information allows researchers to perform association\nstudies for the genetic variants involved in diseases and the individual\nresponses to therapeutic agents.\n  A notable approach to the problem is to encode it as a combinatorial problem\n(under certain hypotheses, such as the pure parsimony criterion) and to solve\nit using off-the-shelf combinatorial optimization techniques. The main methods\napplied to Haplotype Inference are either simple greedy heuristic or exact\nmethods (Integer Linear Programming, Semidefinite Programming, SAT encoding)\nthat, at present, are adequate only for moderate size instances.\n  We believe that metaheuristic and hybrid approaches could provide a better\nscalability. Moreover, metaheuristics can be very easily combined with problem\nspecific heuristics and they can also be integrated with tree-based search\ntechniques, thus providing a promising framework for hybrid systems in which a\ngood trade-off between effectiveness and efficiency can be reached.\n  In this paper we illustrate a feasibility study of the approach and discuss\nsome relevant design issues, such as modeling and design of approximate solvers\nthat combine constructive heuristics, local search-based improvement strategies\nand learning mechanisms. Besides the relevance of the Haplotype Inference\nproblem itself, this preliminary analysis is also an interesting case study\nbecause the formulation of the problem poses some challenges in modeling and\nhybrid metaheuristic solver design that can be generalized to other problems.\n", "versions": [{"version": "v1", "created": "Fri, 3 Aug 2007 12:49:21 GMT"}], "update_date": "2007-08-06", "authors_parsed": [["Di Gaspero", "Luca", ""], ["Roli", "Andrea", ""]]}, {"id": "0708.1116", "submitter": "Florian Simatos", "authors": "Florian Simatos", "title": "A variant of the Recoil Growth algorithm to generate multi-polymer\n  systems", "comments": "Title changed", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Recoil Growth algorithm, proposed in 1999 by Consta et al., is one of the\nmost efficient algorithm available in the literature to sample from a\nmulti-polymer system. Such problems are closely related to the generation of\nself-avoiding paths. In this paper, we study a variant of the original Recoil\nGrowth algorithm, where we constrain the generation of a new polymer to take\nplace on a specific class of graphs. This makes it possible to make a fine\ntrade-off between computational cost and success rate. We moreover give a\nsimple proof for a lower bound on the irreducibility of this new algorithm,\nwhich applies to the original algorithm as well.\n", "versions": [{"version": "v1", "created": "Wed, 8 Aug 2007 15:07:53 GMT"}, {"version": "v2", "created": "Fri, 12 Sep 2008 10:02:19 GMT"}, {"version": "v3", "created": "Thu, 2 Jul 2009 12:31:15 GMT"}], "update_date": "2009-07-02", "authors_parsed": [["Simatos", "Florian", ""]]}, {"id": "0708.1818", "submitter": "Francoise Heres-Renzetti", "authors": "L.-V. Bochkareva, M.-V. Kireitseu, G. R. Tomlinson, H. Altenbach, V.\n  Kompis, D. Hui", "title": "Computational Simulation and 3D Virtual Reality Engineering Tools for\n  Dynamical Modeling and Imaging of Composite Nanomaterials", "comments": "Submitted on behalf of TIMA Editions\n  (http://irevues.inist.fr/tima-editions)", "journal-ref": "Dans European Nano Systems Worshop - ENS 2005, Paris : France\n  (2005)", "doi": null, "report-no": null, "categories": "cs.CE cond-mat.other", "license": null, "abstract": "  An adventure at engineering design and modeling is possible with a Virtual\nReality Environment (VRE) that uses multiple computer-generated media to let a\nuser experience situations that are temporally and spatially prohibiting. In\nthis paper, an approach to developing some advanced architecture and modeling\ntools is presented to allow multiple frameworks work together while being\nshielded from the application program. This architecture is being developed in\na framework of workbench interactive tools for next generation\nnanoparticle-reinforced damping/dynamic systems. Through the use of system, an\nengineer/programmer can respectively concentrate on tailoring an engineering\ndesign concept of novel system and the application software design while using\nexisting databases/software outputs.\n", "versions": [{"version": "v1", "created": "Tue, 14 Aug 2007 08:17:45 GMT"}], "update_date": "2007-08-15", "authors_parsed": [["Bochkareva", "L. -V.", ""], ["Kireitseu", "M. -V.", ""], ["Tomlinson", "G. R.", ""], ["Altenbach", "H.", ""], ["Kompis", "V.", ""], ["Hui", "D.", ""]]}, {"id": "0708.3048", "submitter": "Alexandre d'Aspremont", "authors": "Alexandre d'Aspremont", "title": "Identifying Small Mean Reverting Portfolios", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": null, "abstract": "  Given multivariate time series, we study the problem of forming portfolios\nwith maximum mean reversion while constraining the number of assets in these\nportfolios. We show that it can be formulated as a sparse canonical correlation\nanalysis and study various algorithms to solve the corresponding sparse\ngeneralized eigenvalue problems. After discussing penalized parameter\nestimation procedures, we study the sparsity versus predictability tradeoff and\nthe impact of predictability in various markets.\n", "versions": [{"version": "v1", "created": "Wed, 22 Aug 2007 16:25:17 GMT"}, {"version": "v2", "created": "Tue, 26 Feb 2008 16:29:01 GMT"}], "update_date": "2008-02-26", "authors_parsed": [["d'Aspremont", "Alexandre", ""]]}, {"id": "0708.3463", "submitter": "Sabatino Costanzo", "authors": "Sabatino Costanzo, Loren Trigo, Luis Jimenez, Juan Gonzalez", "title": "A Neural Networks Model of the Venezuelan Economy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NE", "license": null, "abstract": "  Besides an indicator of the GDP, the Central Bank of Venezuela generates the\nso called Monthly Economic Activity General Indicator. The a priori knowledge\nof this indicator, which represents and sometimes even anticipates the\neconomy's fluctuations, could be helpful in developing public policies and in\ninvestment decision making. The purpose of this study is forecasting the IGAEM\nthrough non parametric methods, an approach that has proven effective in a wide\nvariety of problems in economics and finance.\n", "versions": [{"version": "v1", "created": "Sun, 26 Aug 2007 05:10:29 GMT"}], "update_date": "2007-08-28", "authors_parsed": [["Costanzo", "Sabatino", ""], ["Trigo", "Loren", ""], ["Jimenez", "Luis", ""], ["Gonzalez", "Juan", ""]]}, {"id": "0708.3464", "submitter": "Sabatino Costanzo", "authors": "Sabatino Costanzo, Loren Trigo, Ramses Dominguez, William Moreno", "title": "A Non Parametric Study of the Volatility of the Economy as a Country\n  Risk Predictor", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NE", "license": null, "abstract": "  This paper intends to explain Venezuela's country spread behavior through the\nNeural Networks analysis of a monthly economic activity general index of\neconomic indicators constructed by the Central Bank of Venezuela, a measure of\nthe shocks affecting country risk of emerging markets and the U.S. short term\ninterest rate. The use of non parametric methods allowed the finding of non\nlinear relationship between these inputs and the country risk. The networks\nperformance was evaluated using the method of excess predictability.\n", "versions": [{"version": "v1", "created": "Sun, 26 Aug 2007 05:30:18 GMT"}], "update_date": "2007-08-28", "authors_parsed": [["Costanzo", "Sabatino", ""], ["Trigo", "Loren", ""], ["Dominguez", "Ramses", ""], ["Moreno", "William", ""]]}, {"id": "0708.3465", "submitter": "Sabatino Costanzo", "authors": "Loren Trigo, Sabatino Costanzo, Felix Gonzalez, Jose Llamozas", "title": "An Early Warning System for Bankruptcy Prediction: lessons from the\n  Venezuelan Bank Crisis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": null, "abstract": "  During 1993-94 Venezuela experienced a severe banking crisis which ended up\nwith 18 commercial banks intervened by the government. Here we develop an early\nwarning system for detecting credit related bankruptcy through discriminant\nfunctions developed on financial and macroeconomic data predating the crisis. A\nrobustness test performed on these functions shows high precision in error\nestimation. The model calibrated on pre-crisis data could detect abnormal\nfinancial tension in the late Banco Capital many months before it was\nintervened and liquidated.\n", "versions": [{"version": "v1", "created": "Sun, 26 Aug 2007 05:33:41 GMT"}], "update_date": "2007-08-28", "authors_parsed": [["Trigo", "Loren", ""], ["Costanzo", "Sabatino", ""], ["Gonzalez", "Felix", ""], ["Llamozas", "Jose", ""]]}, {"id": "0708.3499", "submitter": "Francesc Rossell\\'o", "authors": "Gabriel Cardona, Francesc Rossello, Gabriel Valiente", "title": "Comparison of Tree-Child Phylogenetic Networks", "comments": "37 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DM", "license": null, "abstract": "  Phylogenetic networks are a generalization of phylogenetic trees that allow\nfor the representation of non-treelike evolutionary events, like recombination,\nhybridization, or lateral gene transfer. In this paper, we present and study a\nnew class of phylogenetic networks, called tree-child phylogenetic networks,\nwhere every non-extant species has some descendant through mutation. We provide\nan injective representation of these networks as multisets of vectors of\nnatural numbers, their path multiplicity vectors, and we use this\nrepresentation to define a distance on this class and to give an alignment\nmethod for pairs of these networks. To the best of our knowledge, they are\nrespectively the first true distance and the first alignment method defined on\na meaningful class of phylogenetic networks strictly extending the class of\nphylogenetic trees. Simple, polynomial algorithms for reconstructing a\ntree-child phylogenetic network from its path multiplicity vectors, for\ncomputing the distance between two tree-child phylogenetic networks, and for\naligning a pair of tree-child phylogenetic networks, are provided, and they\nhave been implemented as a Perl package and a Java applet, and they are\navailable at http://bioinfo.uib.es/~recerca/phylonetworks/mudistance\n", "versions": [{"version": "v1", "created": "Mon, 27 Aug 2007 09:37:55 GMT"}], "update_date": "2007-08-28", "authors_parsed": [["Cardona", "Gabriel", ""], ["Rossello", "Francesc", ""], ["Valiente", "Gabriel", ""]]}, {"id": "0708.3829", "submitter": "Sabatino Costanzo", "authors": "Sabatino Costanzo, Loren Trigo, Wafaa Dehne, Hender Prato", "title": "A Non Parametric Model for the Forecasting of the Venezuelan Oil Prices", "comments": "17 pages, in Spanish", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NE", "license": null, "abstract": "  A neural net model for forecasting the prices of Venezuelan crude oil is\nproposed. The inputs of the neural net are selected by reference to a dynamic\nsystem model of oil prices by Mashayekhi (1995, 2001) and its performance is\nevaluated using two criteria: the Excess Profitability test by Anatoliev and\nGerko (2005) and the characteristics of the equity curve generated by a trading\nstrategy based on the neural net predictions.\n  -----\n  Se introduce aqui un modelo no parametrico para pronosticar los precios del\npetroleo Venezolano cuyos insumos son seleccionados en base a un sistema\ndinamico que explica los precios en terminos de dichos insumos. Se describe el\nproceso de recoleccion y pre-procesamiento de datos y la corrida de la red y se\nevaluan sus pronosticos a traves de un test estadistico de predictibilidad y de\nlas caracteristicas del Equity Curve inducido por la estrategia de compraventa\nbursatil generada por dichos pronosticos.\n", "versions": [{"version": "v1", "created": "Tue, 28 Aug 2007 18:29:55 GMT"}], "update_date": "2007-08-29", "authors_parsed": [["Costanzo", "Sabatino", ""], ["Trigo", "Loren", ""], ["Dehne", "Wafaa", ""], ["Prato", "Hender", ""]]}]