[{"id": "1706.00219", "submitter": "Liad Blumrosen", "authors": "Moshe Babaioff and Liad Blumrosen and Noam Nisan", "title": "Selling Complementary Goods: Dynamics, Efficiency and Revenue", "comments": "Full version of an ICALP 2017 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a price competition between two sellers of perfect-complement\ngoods. Each seller posts a price for the good it sells, but the demand is\ndetermined according to the sum of prices. This is a classic model by Cournot\n(1838), who showed that in this setting a monopoly that sells both goods is\nbetter for the society than two competing sellers. We show that non-trivial\npure Nash equilibria always exist in this game. We also quantify Cournot's\nobservation with respect to both the optimal welfare and the monopoly revenue.\nWe then prove a series of mostly negative results regarding the convergence of\nbest response dynamics to equilibria in such games.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jun 2017 09:15:35 GMT"}], "update_date": "2017-06-02", "authors_parsed": [["Babaioff", "Moshe", ""], ["Blumrosen", "Liad", ""], ["Nisan", "Noam", ""]]}, {"id": "1706.00652", "submitter": "Veronique Bruyere", "authors": "V\\'eronique Bruy\\`ere", "title": "Computer aided synthesis: a game theoretic approach", "comments": "Invitation contribution for conference \"Developments in Language\n  Theory\" (DLT 2017)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this invited contribution, we propose a comprehensive introduction to game\ntheory applied in computer aided synthesis. In this context, we give some\nclassical results on two-player zero-sum games and then on multi-player non\nzero-sum games. The simple case of one-player games is strongly related to\nautomata theory on infinite words. All along the article, we focus on general\napproaches to solve the studied problems, and we provide several illustrative\nexamples as well as intuitions on the proofs.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jun 2017 12:18:41 GMT"}], "update_date": "2017-06-05", "authors_parsed": [["Bruyère", "Véronique", ""]]}, {"id": "1706.00849", "submitter": "Mark Whitmeyer", "authors": "Artem Hulko and Mark Whitmeyer", "title": "A Game of Nontransitive Dice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.GT q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a two player simultaneous-move game where the two players each\nselect any permissible $n$-sided die for a fixed integer $n$. A player wins if\nthe outcome of his roll is greater than that of his opponent. Remarkably, for\n$n>3$, there is a unique Nash Equilibrium in pure strategies. The unique Nash\nEquilibrium is for each player to throw the Standard $n$-sided die, where each\nside has a different number. Our proof of uniqueness is constructive. We\nintroduce an algorithm with which, for any nonstandard die, we may generate\nanother die that beats it.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jun 2017 20:45:27 GMT"}, {"version": "v2", "created": "Mon, 22 Oct 2018 14:42:48 GMT"}], "update_date": "2018-10-23", "authors_parsed": [["Hulko", "Artem", ""], ["Whitmeyer", "Mark", ""]]}, {"id": "1706.01062", "submitter": "Sigal Oren", "authors": "Jon Kleinberg, Sigal Oren and Manish Raghavan", "title": "Planning with Multiple Biases", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work has considered theoretical models for the behavior of agents with\nspecific behavioral biases: rather than making decisions that optimize a given\npayoff function, the agent behaves inefficiently because its decisions suffer\nfrom an underlying bias. These approaches have generally considered an agent\nwho experiences a single behavioral bias, studying the effect of this bias on\nthe outcome.\n  In general, however, decision-making can and will be affected by multiple\nbiases operating at the same time. How do multiple biases interact to produce\nthe overall outcome? Here we consider decisions in the presence of a pair of\nbiases exhibiting an intuitively natural interaction: present bias -- the\ntendency to value costs incurred in the present too highly -- and sunk-cost\nbias -- the tendency to incorporate costs experienced in the past into one's\nplans for the future.\n  We propose a theoretical model for planning with this pair of biases, and we\nshow how certain natural behavioral phenomena can arise in our model only when\nagents exhibit both biases. As part of our model we differentiate between\nagents that are aware of their biases (sophisticated) and agents that are\nunaware of them (naive). Interestingly, we show that the interaction between\nthe two biases is quite complex: in some cases, they mitigate each other's\neffects while in other cases they might amplify each other. We obtain a number\nof further results as well, including the fact that the planning problem in our\nmodel for an agent experiencing and aware of both biases is computationally\nhard in general, though tractable under more relaxed assumptions.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jun 2017 12:05:54 GMT"}], "update_date": "2017-06-06", "authors_parsed": [["Kleinberg", "Jon", ""], ["Oren", "Sigal", ""], ["Raghavan", "Manish", ""]]}, {"id": "1706.01131", "submitter": "Ali Makhdoumi", "authors": "Ali Makhdoumi, Azarakhsh Malekian, Asuman Ozdaglar", "title": "Strategic Dynamic Pricing with Network Effects", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimal pricing strategy of a monopolist selling homogeneous\ngoods to customers over multiple periods. The customers choose their time of\npurchase to maximize their payoff that depends on their valuation of the\nproduct, the purchase price, and the utility they derive from past purchases of\nothers, termed the network effect. We first show that the optimal price\nsequence is non-decreasing. Therefore, by postponing purchase to future rounds,\ncustomers trade-off a higher utility from the network effects with a higher\nprice. We then show that a customer's equilibrium strategy can be characterized\nby a threshold rule in which at each round a customer purchases the product if\nand only if her valuation exceeds a certain threshold. This implies that\ncustomers face an inference problem regarding the valuations of others, i.e.,\nobserving that a customer has not yet purchased the product, signals that her\nvaluation is below a threshold. We consider a block model of network\ninteractions, where there are blocks of buyers subject to the same network\neffect. A natural benchmark, this model allows us to provide an explicit\ncharacterization of the optimal price sequence asymptotically as the number of\nagents goes to infinity, which notably is linearly increasing in time with a\nslope that depends on the network effect through a scalar given by the sum of\nentries of the inverse of the network weight matrix. Our characterization shows\nthat increasing the \"imbalance\" in the network defined as the difference\nbetween the in and out degree of the nodes increases the revenue of the\nmonopolist. We further study the effects of price discrimination and show that\nin earlier periods monopolist offers lower prices to blocks with higher\nBonacich centrality to encourage them to purchase, which in turn further\nincentivizes other customers to buy in subsequent periods.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jun 2017 19:09:13 GMT"}, {"version": "v2", "created": "Tue, 26 Jun 2018 23:18:40 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Makhdoumi", "Ali", ""], ["Malekian", "Azarakhsh", ""], ["Ozdaglar", "Asuman", ""]]}, {"id": "1706.01614", "submitter": "Paul Grigas", "authors": "Paul Grigas, Alfonso Lobos, Zheng Wen, Kuang-chih Lee", "title": "Profit Maximization for Online Advertising Demand-Side Platforms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an optimization model and corresponding algorithm for the\nmanagement of a demand-side platform (DSP), whereby the DSP aims to maximize\nits own profit while acquiring valuable impressions for its advertiser clients.\nWe formulate the problem of profit maximization for a DSP interacting with ad\nexchanges in a real-time bidding environment in a\ncost-per-click/cost-per-action pricing model. Our proposed formulation leads to\na nonconvex optimization problem due to the joint optimization over both\nimpression allocation and bid price decisions. We use Lagrangian relaxation to\ndevelop a tractable convex dual problem, which, due to the properties of\nsecond-price auctions, may be solved efficiently with subgradient methods. We\npropose a two-phase solution procedure, whereby in the first phase we solve the\nconvex dual problem using a subgradient algorithm, and in the second phase we\nuse the previously computed dual solution to set bid prices and then solve a\nlinear optimization problem to obtain the allocation probability variables. On\nseveral synthetic examples, we demonstrate that our proposed solution approach\nleads to superior performance over a baseline method that is used in practice.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 06:17:15 GMT"}], "update_date": "2017-06-07", "authors_parsed": [["Grigas", "Paul", ""], ["Lobos", "Alfonso", ""], ["Wen", "Zheng", ""], ["Lee", "Kuang-chih", ""]]}, {"id": "1706.02682", "submitter": "Theja Tulabandhula", "authors": "Arpita Biswas, Ragavendran Gopalakrishnan, Theja Tulabandhula, Asmita\n  Metrewar, Koyel Mukherjee, Raja Subramaniam Thangaraj", "title": "Impact of Detour-Aware Policies on Maximizing Profit in Ridesharing", "comments": "18 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper provides efficient solutions to maximize profit for commercial\nridesharing services, under a pricing model with detour-based discounts for\npassengers. We propose greedy heuristics for real-time ride matching that offer\ndifferent trade-offs between optimality and speed. Simulations on New York City\n(NYC) taxi trip data show that our heuristics are up to 90% optimal and 10^5\ntimes faster than the (necessarily) exponential-time optimal algorithm.\n  Commercial ridesharing service providers generate significant savings by\nmatching multiple ride requests using heuristic methods. The resulting savings\nare typically shared between the service provider (in the form of increased\nprofit) and the ridesharing passengers (in the form of discounts). It is not\nclear a priori how this split should be effected, since higher discounts would\nencourage more ridesharing, thereby increasing total savings, but the fraction\nof savings taken as profit is reduced. We simulate a scenario where the\ndecisions of the passengers to opt for ridesharing depend on the discount\noffered by the service provider. We provide an adaptive learning algorithm\nIDFLA that learns the optimal profit-maximizing discount factor for the\nprovider. An evaluation over NYC data shows that IDFLA, on average, learns the\noptimal discount factor in under 16 iterations.\n  Finally, we investigate the impact of imposing a detour-aware routing policy\nbased on sequential individual rationality, a recently proposed concept. Such\nrestricted policies offer a better ride experience, increasing the provider's\nmarket share, but at the cost of decreased average per-ride profit due to the\nreduced number of matched rides. We construct a model that captures these\nopposing effects, wherein simulations based on NYC data show that a 7% increase\nin market share would suffice to offset the decreased average per-ride profit.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 16:57:44 GMT"}], "update_date": "2017-06-09", "authors_parsed": [["Biswas", "Arpita", ""], ["Gopalakrishnan", "Ragavendran", ""], ["Tulabandhula", "Theja", ""], ["Metrewar", "Asmita", ""], ["Mukherjee", "Koyel", ""], ["Thangaraj", "Raja Subramaniam", ""]]}, {"id": "1706.03459", "submitter": "Zhe Feng", "authors": "Paul D\\\"utting and Zhe Feng and Harikrishna Narasimhan and David C.\n  Parkes and Sai Srivatsa Ravindranath", "title": "Optimal Auctions through Deep Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing an incentive compatible auction that maximizes expected revenue is\nan intricate task. The single-item case was resolved in a seminal piece of work\nby Myerson in 1981. Even after 30-40 years of intense research the problem\nremains unsolved for settings with two or more items. In this work, we initiate\nthe exploration of the use of tools from deep learning for the automated design\nof optimal auctions. We model an auction as a multi-layer neural network, frame\noptimal auction design as a constrained learning problem, and show how it can\nbe solved using standard machine learning pipelines. We prove generalization\nbounds and present extensive experiments, recovering essentially all known\nanalytical solutions for multi-item settings, and obtaining novel mechanisms\nfor settings in which the optimal mechanism is unknown.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jun 2017 04:03:15 GMT"}, {"version": "v2", "created": "Mon, 19 Mar 2018 17:56:32 GMT"}, {"version": "v3", "created": "Mon, 1 Apr 2019 00:33:16 GMT"}, {"version": "v4", "created": "Sat, 29 Feb 2020 23:54:43 GMT"}, {"version": "v5", "created": "Fri, 21 Aug 2020 15:04:03 GMT"}], "update_date": "2020-08-24", "authors_parsed": [["Dütting", "Paul", ""], ["Feng", "Zhe", ""], ["Narasimhan", "Harikrishna", ""], ["Parkes", "David C.", ""], ["Ravindranath", "Sai Srivatsa", ""]]}, {"id": "1706.04324", "submitter": "Neil Newman", "authors": "Neil Newman and Kevin Leyton-Brown and Paul Milgrom and Ilya Segal", "title": "Assessing Economic Outcomes in Simulated Reverse Clock Auctions for\n  Radio Spectrum", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the economic outcomes that result under simulated bidder\nbehavior in a model of the FCC's reverse auction for radio spectrum. In our\nsimulations, limiting our notion of efficiency to the reverse auction in\nisolation, the reverse clock auction achieves very efficient solutions, the\nFCC's scoring rule greatly reduces the total payments to TV broadcasters at the\ncost of some efficiency, and using a poor feasibility checker can have grave\nconsequences both in terms of the auction's cost and efficiency.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jun 2017 05:33:16 GMT"}], "update_date": "2017-06-15", "authors_parsed": [["Newman", "Neil", ""], ["Leyton-Brown", "Kevin", ""], ["Milgrom", "Paul", ""], ["Segal", "Ilya", ""]]}, {"id": "1706.04634", "submitter": "Francesca Parise", "authors": "Francesca Parise, Basilio Gentile and John Lygeros", "title": "A distributed algorithm for average aggregative games with coupling\n  constraints", "comments": "structure rearranged to clarify exposition", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.GT cs.MA cs.SI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the framework of average aggregative games, where the cost\nfunction of each agent depends on his own strategy and on the average\npopulation strategy. We focus on the case in which the agents are coupled not\nonly via their cost functions, but also via constraints coupling their\nstrategies. We propose a distributed algorithm that achieves an almost Nash\nequilibrium by requiring only local communications of the agents, as specified\nby a sparse communication network. The proof of convergence of the algorithm\nrelies on the auxiliary class of network aggregative games and exploits a novel\nresult of parametric convergence of variational inequalities, which is\napplicable beyond the context of games. We apply our theoretical findings to a\nmulti-market Cournot game with transportation costs and maximum market\ncapacity.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jun 2017 18:52:35 GMT"}, {"version": "v2", "created": "Tue, 17 Oct 2017 02:03:50 GMT"}], "update_date": "2017-10-18", "authors_parsed": [["Parise", "Francesca", ""], ["Gentile", "Basilio", ""], ["Lygeros", "John", ""]]}, {"id": "1706.04637", "submitter": "Mingfei Zhao", "authors": "Johannes Brustle, Yang Cai, Fa Wu, Mingfei Zhao", "title": "Approximating Gains from Trade in Two-sided Markets via Simple\n  Mechanisms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We design simple mechanisms to approximate the Gains from Trade (GFT) in\ntwo-sided markets with multiple unit-supply sellers and multiple unit-demand\nbuyers. A classical impossibility result by Myerson and Satterthwaite showed\nthat even with only one seller and one buyer, no Individually Rational (IR),\nBayesian Incentive Compatible (BIC) and Budget-Balanced (BB) mechanism can\nachieve full GFT (trade whenever buyer's value is higher than the seller's\ncost). On the other hand, they proposed the \"second-best\" mechanism that\nmaximizes the GFT subject to IR, BIC and BB constraints, which is unfortunately\nrather complex for even the single-seller single-buyer case. Our mechanism is\nsimple, IR, BIC and BB, and achieves $\\frac{1}{2}$ of the optimal GFT among all\nIR, BIC and BB mechanisms. Our result holds for arbitrary distributions of the\nbuyers' and sellers' values and can accommodate any downward-closed feasibility\nconstraints over the allocations. The analysis of our mechanism is facilitated\nby extending the Cai-Weinberg-Devanur duality framework to two-sided markets.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jun 2017 18:58:46 GMT"}, {"version": "v2", "created": "Sun, 18 Jun 2017 22:42:31 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Brustle", "Johannes", ""], ["Cai", "Yang", ""], ["Wu", "Fa", ""], ["Zhao", "Mingfei", ""]]}, {"id": "1706.04732", "submitter": "Andres Munoz Medina", "authors": "Andr\\'es Mu\\~noz Medina and Sergei Vassilvitskii", "title": "Revenue Optimization with Approximate Bid Predictions", "comments": "Accepted to NIPS 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of advertising auctions, finding good reserve prices is a\nnotoriously challenging learning problem. This is due to the heterogeneity of\nad opportunity types and the non-convexity of the objective function. In this\nwork, we show how to reduce reserve price optimization to the standard setting\nof prediction under squared loss, a well understood problem in the learning\ncommunity. We further bound the gap between the expected bid and revenue in\nterms of the average loss of the predictor. This is the first result that\nformally relates the revenue gained to the quality of a standard machine\nlearned model.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 04:05:56 GMT"}, {"version": "v2", "created": "Mon, 6 Nov 2017 13:39:38 GMT"}], "update_date": "2017-11-07", "authors_parsed": [["Medina", "Andrés Muñoz", ""], ["Vassilvitskii", "Sergei", ""]]}, {"id": "1706.05081", "submitter": "Ilai Bistritz", "authors": "Ilai Bistritz and Amir Leshem", "title": "Approximate Best-Response Dynamics in Random Interference Games", "comments": null, "journal-ref": "IEEE Transactions on Automatic Control ( Volume: 63 , Issue: 6 ,\n  June 2018 )", "doi": "10.1109/TAC.2017.2749139", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we develop a novel approach to the convergence of Best-Response\nDynamics for the family of interference games. Interference games represent the\nfundamental resource allocation conflict between users of the radio spectrum.\nIn contrast to congestion games, interference games are generally not potential\ngames. Therefore, proving the convergence of the best-response dynamics to a\nNash equilibrium in these games requires new techniques. We suggest a model for\nrandom interference games, based on the long term fading governed by the\nplayers' geometry. Our goal is to prove convergence of the approximate\nbest-response dynamics with high probability with respect to the randomized\ngame. We embrace the asynchronous model in which the acting player is chosen at\neach stage at random. In our approximate best-response dynamics, the action of\na deviating player is chosen at random among all the approximately best ones.\nWe show that with high probability, with respect to the players' geometry and\nasymptotically with the number of players, each action increases the expected\nsocial-welfare (sum of achievable rates). Hence, the induced sum-rate process\nis a submartingale. Based on the Martingale Convergence Theorem, we prove\nconvergence of the strategy profile to an approximate Nash equilibrium with\ngood performance for asymptotically almost all interference games. We use the\nMarkovity of the induced sum-rate process to provide probabilistic bounds on\nthe convergence time. Finally, we demonstrate our results in simulated\nexamples.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 20:46:25 GMT"}, {"version": "v2", "created": "Mon, 19 Nov 2018 04:42:41 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Bistritz", "Ilai", ""], ["Leshem", "Amir", ""]]}, {"id": "1706.05297", "submitter": "Shakhar Smorodinsky", "authors": "Rann Smorodinsky and Shakhar Smorodinsky", "title": "Hypergraphical Clustering Games of Mis-Coordination", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DC cs.DM cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce and motivate the study of hypergraphical clustering games of\nmis-coordination. For two specific variants we prove the existence of a pure\nNash equilibrium and provide bounds on the price of anarchy as a function of\nthe cardinality of the action set and the size of the hyperedges.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jun 2017 06:30:23 GMT"}, {"version": "v2", "created": "Wed, 2 Aug 2017 09:53:51 GMT"}, {"version": "v3", "created": "Sat, 2 Dec 2017 07:32:31 GMT"}], "update_date": "2017-12-05", "authors_parsed": [["Smorodinsky", "Rann", ""], ["Smorodinsky", "Shakhar", ""]]}, {"id": "1706.05711", "submitter": "Soheil Behnezhad", "authors": "Soheil Behnezhad, Mahsa Derakhshan, MohammadTaghi Hajiaghayi,\n  Aleksandrs Slivkins", "title": "A Polynomial Time Algorithm for Spatio-Temporal Security Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An ever-important issue is protecting infrastructure and other valuable\ntargets from a range of threats from vandalism to theft to piracy to terrorism.\nThe \"defender\" can rarely afford the needed resources for a 100% protection.\nThus, the key question is, how to provide the best protection using the limited\navailable resources. We study a practically important class of security games\nthat is played out in space and time, with targets and \"patrols\" moving on a\nreal line. A central open question here is whether the Nash equilibrium (i.e.,\nthe minimax strategy of the defender) can be computed in polynomial time. We\nresolve this question in the affirmative. Our algorithm runs in time polynomial\nin the input size, and only polylogarithmic in the number of possible patrol\nlocations (M). Further, we provide a continuous extension in which patrol\nlocations can take arbitrary real values. Prior work obtained polynomial-time\nalgorithms only under a substantial assumption, e.g., a constant number of\nrounds. Further, all these algorithms have running times polynomial in M, which\ncan be very large.\n", "versions": [{"version": "v1", "created": "Sun, 18 Jun 2017 19:54:05 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Behnezhad", "Soheil", ""], ["Derakhshan", "Mahsa", ""], ["Hajiaghayi", "MohammadTaghi", ""], ["Slivkins", "Aleksandrs", ""]]}, {"id": "1706.05735", "submitter": "Matthew Andrews", "authors": "Matthew Andrews and Milan Bradonjic and Iraj Saniee", "title": "Quantifying the Benefits of Infrastructure Sharing", "comments": "Shorter version accepted to NetEcon 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the benefits of network sharing between telecommunications\noperators. Sharing is seen as one way to speed the roll out of expensive\ntechnologies such as 5G since it allows the service providers to divide the\ncost of providing ubiquitous coverage. Our theoretical analysis focuses on\nscenarios with two service providers and compares the system dynamics when they\nare competing with the dynamics when they are cooperating. We show that sharing\ncan be beneficial to a service provider even when it has the power to drive the\nother service provider out of the market, a byproduct of a non-convex cost\nfunction. A key element of this study is an analysis of the competitive\nequilibria for both cooperative and non-cooperative 2-person games in the\npresence of (non-convex) cost functions that involve a fixed cost component.\n", "versions": [{"version": "v1", "created": "Sun, 18 Jun 2017 22:07:43 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Andrews", "Matthew", ""], ["Bradonjic", "Milan", ""], ["Saniee", "Iraj", ""]]}, {"id": "1706.06139", "submitter": "Alexander Svozil", "authors": "Krishnendu Chatterjee, Monika Henzinger and Alexander Svozil", "title": "Faster Algorithms for Mean-Payoff Parity Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graph games provide the foundation for modeling and synthesis of reactive\nprocesses. Such games are played over graphs where the vertices are controlled\nby two adversarial players. We consider graph games where the objective of the\nfirst player is the conjunction of a qualitative objective (specified as a\nparity condition) and a quantitative objective (specified as a mean-payoff\ncondition). There are two variants of the problem, namely, the threshold\nproblem where the quantitative goal is to ensure that the mean-payoff value is\nabove a threshold, and the value problem where the quantitative goal is to\nensure the optimal mean-payoff value; in both cases ensuring the qualitative\nparity objective. The previous best-known algorithms for game graphs with $n$\nvertices, $m$ edges, parity objectives with $d$ priorities, and maximal\nabsolute reward value $W$ for mean-payoff objectives, are as follows:\n$O(n^{d+1} \\cdot m \\cdot W)$ for the threshold problem, and $O(n^{d+2} \\cdot m\n\\cdot W)$ for the value problem. Our main contributions are faster algorithms,\nand the running times of our algorithms are as follows: $O(n^{d-1} \\cdot m\n\\cdot W)$ for the threshold problem, and $O(n^{d} \\cdot m \\cdot W \\cdot \\log\n(n\\cdot W))$ for the value problem. For mean-payoff parity objectives with two\npriorities, our algorithms match the best-known bounds of the algorithms for\nmean-payoff games (without conjunction with parity objectives). Our results are\nrelevant in synthesis of reactive systems with both functional requirement\n(given as a qualitative objective) and performance requirement (given as a\nquantitative objective).\n", "versions": [{"version": "v1", "created": "Mon, 19 Jun 2017 18:59:10 GMT"}], "update_date": "2017-06-21", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Henzinger", "Monika", ""], ["Svozil", "Alexander", ""]]}, {"id": "1706.06974", "submitter": "Jon Kleinberg", "authors": "Jon Kleinberg, Annie Liang, Sendhil Mullainathan", "title": "The Theory is Predictive, but is it Complete? An Application to Human\n  Perception of Randomness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT cs.SI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When we test a theory using data, it is common to focus on correctness: do\nthe predictions of the theory match what we see in the data? But we also care\nabout completeness: how much of the predictable variation in the data is\ncaptured by the theory? This question is difficult to answer, because in\ngeneral we do not know how much \"predictable variation\" there is in the\nproblem. In this paper, we consider approaches motivated by machine learning\nalgorithms as a means of constructing a benchmark for the best attainable level\nof prediction.\n  We illustrate our methods on the task of predicting human-generated random\nsequences. Relative to an atheoretical machine learning algorithm benchmark, we\nfind that existing behavioral models explain roughly 15 percent of the\npredictable variation in this problem. This fraction is robust across several\nvariations on the problem. We also consider a version of this approach for\nanalyzing field data from domains in which human perception and generation of\nrandomness has been used as a conceptual framework; these include sequential\ndecision-making and repeated zero-sum games. In these domains, our framework\nfor testing the completeness of theories provides a way of assessing their\neffectiveness over different contexts; we find that despite some differences,\nthe existing theories are fairly stable across our field domains in their\nperformance relative to the benchmark. Overall, our results indicate that (i)\nthere is a significant amount of structure in this problem that existing models\nhave yet to capture and (ii) there are rich domains in which machine learning\nmay provide a viable approach to testing completeness.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jun 2017 15:56:06 GMT"}], "update_date": "2017-06-22", "authors_parsed": [["Kleinberg", "Jon", ""], ["Liang", "Annie", ""], ["Mullainathan", "Sendhil", ""]]}, {"id": "1706.07151", "submitter": "Nicolas Stier-Moses", "authors": "Vincent Conitzer, Christian Kroer, Eric Sodomka, and Nicolas E.\n  Stier-Moses", "title": "Multiplicative Pacing Equilibria in Auction Markets", "comments": null, "journal-ref": "Operations Research, Forthcoming, 2021", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Budgets play a significant role in real-world sequential auction markets such\nas those implemented by internet companies. To maximize the value provided to\nauction participants, spending is smoothed across auctions so budgets are used\nfor the best opportunities. Motivated by a mechanism used in practice by\nseveral companies, this paper considers a smoothing procedure that relies on\n{\\em pacing multipliers}: on behalf of each buyer, the auction market applies a\nfactor between 0 and 1 that uniformly scales the bids across all auctions.\nReinterpreting this process as a game between buyers, we introduce the notion\nof {\\em pacing equilibrium}, and prove that they are always guaranteed to\nexist. We demonstrate through examples that a market can have multiple pacing\nequilibria with large variations in several natural objectives. We show that\npacing equilibria refine another popular solution concept, competitive\nequilibria, and show further connections between the two solution concepts.\nAlthough we show that computing either a social-welfare-maximizing or a\nrevenue-maximizing pacing equilibrium is NP-hard, we present a mixed-integer\nprogram (MIP) that can be used to find equilibria optimizing several relevant\nobjectives. We use the MIP to provide evidence that: (1) equilibrium\nmultiplicity occurs very rarely across several families of random instances,\n(2) static MIP solutions can be used to improve the outcomes achieved by a\ndynamic pacing algorithm with instances based on a real-world auction market,\nand (3) for the instances we study, buyers do not have an incentive to\nmisreport bids or budgets provided there are enough participants in the\nauction.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 02:30:42 GMT"}, {"version": "v2", "created": "Wed, 5 Dec 2018 19:02:14 GMT"}, {"version": "v3", "created": "Fri, 8 Feb 2019 16:45:03 GMT"}, {"version": "v4", "created": "Fri, 2 Oct 2020 23:11:14 GMT"}, {"version": "v5", "created": "Sun, 9 May 2021 03:15:31 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Conitzer", "Vincent", ""], ["Kroer", "Christian", ""], ["Sodomka", "Eric", ""], ["Stier-Moses", "Nicolas E.", ""]]}, {"id": "1706.07181", "submitter": "Mattia Mazzoli", "authors": "Mattia Mazzoli and Angel Sanchez", "title": "Equilibria, information and frustration in heterogeneous network games\n  with conflicting preferences", "comments": "23 pages, 14 figures", "journal-ref": null, "doi": "10.1088/1742-5468/aa9347", "report-no": null, "categories": "cs.GT cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interactions between people are the basis on which the structure of our\nsociety arises as a complex system and, at the same time, are the starting\npoint of any physical description of it. In the last few years, much\ntheoretical research has addressed this issue by combining the physics of\ncomplex networks with a description of interactions in terms of evolutionary\ngame theory. We here take this research a step further by introducing a most\nsalient societal factor such as the individuals' preferences, a characteristic\nthat is key to understand much of the social phenomenology these days. We\nconsider a heterogeneous, agent-based model in which agents interact\nstrategically with their neighbors but their preferences and payoffs for the\npossible actions differ. We study how such a heterogeneous network behaves\nunder evolutionary dynamics and different strategic interactions, namely\ncoordination games and best shot games. With this model we study the emergence\nof the equilibria predicted analytically in random graphs under best response\ndynamics, and we extend this test to unexplored contexts like proportional\nimitation and scale free networks. We show that some theoretically predicted\nequilibria do not arise in simulations with incomplete Information, and we\ndemonstrate the importance of the graph topology and the payoff function\nparameters for some games. Finally, we discuss our results with available\nexperimental evidence on coordination games, showing that our model agrees\nbetter with the experiment that standard economic theories, and draw hints as\nto how to maximize social efficiency in situations of conflicting preferences.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 07:05:37 GMT"}], "update_date": "2017-12-06", "authors_parsed": [["Mazzoli", "Mattia", ""], ["Sanchez", "Angel", ""]]}, {"id": "1706.07211", "submitter": "Maxime Morge", "authors": "Maxime Morge and Antoine Nongaillard", "title": "Distributed Algorithm for Matching between Individuals and Activities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce an agent-based model for coalition formation\nwhich is suitable for our usecase. We propose here two clearing-houses\nmechanisms that return sound matchings. The first aims at maximizing the global\nsatisfaction of the individuals. The second ensures that all individuals are\nassigned as much as possible to a preferred activity. Our experiments show that\nthe outcome of our algorithms are better than those obtained with the classical\nsearch/optimization techniques. Moreover, their distribution speeds up their\nruntime.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 08:47:26 GMT"}, {"version": "v2", "created": "Tue, 30 Jan 2018 10:40:15 GMT"}, {"version": "v3", "created": "Thu, 15 Mar 2018 15:17:47 GMT"}, {"version": "v4", "created": "Wed, 21 Mar 2018 16:52:02 GMT"}], "update_date": "2018-03-22", "authors_parsed": [["Morge", "Maxime", ""], ["Nongaillard", "Antoine", ""]]}, {"id": "1706.07412", "submitter": "Raine Ronnholm", "authors": "Valentin Goranko, Antti Kuusisto, Raine R\\\"onnholm", "title": "Rational coordination with no communication or conventions", "comments": "Preprint of a paper published in Journal of Logic and Computation,\n  30(6): 1183-1211, 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study pure coordination games where in every outcome, all players have\nidentical payoffs, 'win' or 'lose'. We identify and discuss a range of 'purely\nrational principles' guiding the reasoning of rational players in such games\nand analyze which classes of coordination games can be solved by such players\nwith no preplay communication or conventions. We observe that it is highly\nnontrivial to delineate a boundary between purely rational principles and other\ndecision methods, such as conventions, for solving such coordination games.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 17:36:08 GMT"}, {"version": "v2", "created": "Thu, 7 Sep 2017 13:07:31 GMT"}, {"version": "v3", "created": "Wed, 17 Mar 2021 16:07:07 GMT"}], "update_date": "2021-03-18", "authors_parsed": [["Goranko", "Valentin", ""], ["Kuusisto", "Antti", ""], ["Rönnholm", "Raine", ""]]}, {"id": "1706.07917", "submitter": "Sajal Mukhopadhyay", "authors": "Jaya Mukhopadhyay, Vikash Kumar Singh, Sajal Mukhopadhyay, Anita Pal", "title": "Online Participatory Sensing in Double Auction Environment with Location\n  Information", "comments": "7 Pages, 3 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As mobile devices have been ubiquitous, participatory sensing emerges as a\npowerful tool to solve many contemporary real life problems. Here, we\ncontemplate the participatory sensing in online double auction environment by\nconsidering the location information of the participating agents. In this\npaper, we propose a truthful mechanism in this setting and the mechanism also\nsatisfies the other economic properties such as budget balance and individual\nrationality.\n", "versions": [{"version": "v1", "created": "Sat, 24 Jun 2017 06:55:58 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Mukhopadhyay", "Jaya", ""], ["Singh", "Vikash Kumar", ""], ["Mukhopadhyay", "Sajal", ""], ["Pal", "Anita", ""]]}, {"id": "1706.08148", "submitter": "Shahar Dobzinski", "authors": "Shahar Dobzinski and Nitzan Uziely", "title": "Revenue Loss in Shrinking Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the revenue loss due to market shrinkage. Specifically, consider a\nsimple market with one item for sale and $n$ bidders whose values are drawn\nfrom some joint distribution. Suppose that the market shrinks as a single\nbidder retires from the market. Suppose furthermore that the value of this\nretiring bidder is fixed and always strictly smaller than the values of the\nother players. We show that even this slight decrease in competition might\ncause a significant fall of a multiplicative factor of\n$\\frac{1}{e+1}\\approx0.268$ in the revenue that can be obtained by a dominant\nstrategy ex-post individually rational mechanism.\n  In particular, our results imply a solution to an open question that was\nposed by Dobzinski, Fu, and Kleinberg [STOC'11].\n", "versions": [{"version": "v1", "created": "Sun, 25 Jun 2017 18:08:56 GMT"}, {"version": "v2", "created": "Tue, 29 May 2018 10:54:42 GMT"}], "update_date": "2018-05-30", "authors_parsed": [["Dobzinski", "Shahar", ""], ["Uziely", "Nitzan", ""]]}, {"id": "1706.08219", "submitter": "Warut Suksompong", "authors": "Pasin Manurangsi, Warut Suksompong", "title": "Asymptotic Existence of Fair Divisions for Groups", "comments": "To appear in the 10th International Symposium on Algorithmic Game\n  Theory (SAGT), 2017", "journal-ref": "Mathematical Social Sciences, 89:100-108 (2017)", "doi": "10.1016/j.mathsocsci.2017.05.006", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of dividing resources fairly occurs in many practical situations\nand is therefore an important topic of study in economics. In this paper, we\ninvestigate envy-free divisions in the setting where there are multiple players\nin each interested party. While all players in a party share the same set of\nresources, each player has her own preferences. Under additive valuations drawn\nrandomly from probability distributions, we show that when all groups contain\nan equal number of players, a welfare-maximizing allocation is likely to be\nenvy-free if the number of items exceeds the total number of players by a\nlogarithmic factor. On the other hand, an envy-free allocation is unlikely to\nexist if the number of items is less than the total number of players. In\naddition, we show that a simple truthful mechanism, namely the random\nassignment mechanism, yields an allocation that satisfies the weaker notion of\napproximate envy-freeness with high probability.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jun 2017 03:52:23 GMT"}, {"version": "v2", "created": "Wed, 12 Jul 2017 00:55:48 GMT"}, {"version": "v3", "created": "Sat, 15 Jul 2017 23:33:43 GMT"}], "update_date": "2020-01-17", "authors_parsed": [["Manurangsi", "Pasin", ""], ["Suksompong", "Warut", ""]]}, {"id": "1706.08479", "submitter": "Kostyantyn Mazur", "authors": "Kostyantyn Mazur", "title": "A Partial Solution to Continuous Blotto", "comments": "This paper cites and relies on another paper, arXiv1706.02060 \"Convex\n  Hull of (t, t^2, ..., t^N)\", that is posted on arXiv at the same time as this\n  paper Version 2: added a reference", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC cs.GT math.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes the structure of mixed-strategy equilibria for Colonel\nBlotto games, where the outcome on each battlefield is a polynomial function of\nthe difference between the two players' allocations. This paper severely\nreduces the set of strategies that needs to be searched to find a Nash\nequilibrium. It finds that there exists a Nash equilibrium where both players'\nmixed strategies are discrete distributions, and it places an upper bound on\nthe number of points in the supports of these discrete distributions.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jun 2017 22:08:05 GMT"}, {"version": "v2", "created": "Thu, 14 Sep 2017 04:55:18 GMT"}], "update_date": "2017-09-15", "authors_parsed": [["Mazur", "Kostyantyn", ""]]}, {"id": "1706.08550", "submitter": "Amir Ali Ahmadi", "authors": "Amir Ali Ahmadi and Jeffrey Zhang", "title": "Semidefinite Programming and Nash Equilibria in Bimatrix Games", "comments": "38 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the power of semidefinite programming (SDP) for finding additive\n$epsilon$-approximate Nash equilibria in bimatrix games. We introduce an SDP\nrelaxation for a quadratic programming formulation of the Nash equilibrium (NE)\nproblem and provide a number of valid inequalities to improve the quality of\nthe relaxation. If a rank-1 solution to this SDP is found, then an exact NE can\nbe recovered. We show that for a strictly competitive game, our SDP is\nguaranteed to return a rank-1 solution. We propose two algorithms based on\niterative linearization of smooth nonconvex objective functions whose global\nminima by design coincide with rank-1 solutions. Empirically, we demonstrate\nthat these algorithms often recover solutions of rank at most two and $epsilon$\nclose to zero. Furthermore, we prove that if a rank-2 solution to our SDP is\nfound, then a 5/11-NE can be recovered for any game, or a 1/3-NE for a\nsymmetric game. We then show how our SDP approach can address two (NP-hard)\nproblems of economic interest: finding the maximum welfare achievable under any\nNE, and testing whether there exists a NE where a particular set of strategies\nis not played. Finally, we show the connection between our SDP and the first\nlevel of the Lasserre/sum of squares hierarchy.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jun 2017 18:18:58 GMT"}, {"version": "v2", "created": "Tue, 27 Feb 2018 21:48:13 GMT"}, {"version": "v3", "created": "Thu, 15 Aug 2019 04:12:32 GMT"}], "update_date": "2019-08-16", "authors_parsed": [["Ahmadi", "Amir Ali", ""], ["Zhang", "Jeffrey", ""]]}, {"id": "1706.08693", "submitter": "Francesca Parise", "authors": "Francesca Parise, Asuman Ozdaglar", "title": "Sensitivity analysis for network aggregative games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the sensitivity of the Nash equilibrium of constrained network\naggregative games to changes in exogenous parameters affecting the cost\nfunction of the players. This setting is motivated by two applications. The\nfirst is the analysis of interventions by a social planner with a networked\nobjective function while the second is network routing games with atomic\nplayers and information constraints. By exploiting a primal reformulation of a\nsensitivity analysis result for variational inequalities, we provide a\ncharacterization of the sensitivity of the Nash equilibrium that depends on\nprimal variables only. To derive this result we assume strong monotonicity of\nthe mapping associated with the game. As the second main result, we derive\nsufficient conditions that guarantee this strong monotonicity property in\nnetwork aggregative games. These two characterizations allows us to\nsystematically study changes in the Nash equilibrium due to perturbations or\nparameter variations in the two applications mentioned above.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jun 2017 07:09:21 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Parise", "Francesca", ""], ["Ozdaglar", "Asuman", ""]]}, {"id": "1706.09007", "submitter": "Gianpiero Monaco", "authors": "Michele Flammini, Gianpiero Monaco, Qiang Zhang", "title": "Strategyproof Mechanisms for Additively Separable Hedonic Games and\n  Fractional Hedonic Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Additively separable hedonic games and fractional hedonic games have received\nconsiderable attention. They are coalition forming games of selfish agents\nbased on their mutual preferences. Most of the work in the literature\ncharacterizes the existence and structure of stable outcomes (i.e., partitions\nin coalitions), assuming that preferences are given. However, there is little\ndiscussion on this assumption. In fact, agents receive different utilities if\nthey belong to different partitions, and thus it is natural for them to declare\ntheir preferences strategically in order to maximize their benefit. In this\npaper we consider strategyproof mechanisms for additively separable hedonic\ngames and fractional hedonic games, that is, partitioning methods without\npayments such that utility maximizing agents have no incentive to lie about\ntheir true preferences. We focus on social welfare maximization and provide\nseveral lower and upper bounds on the performance achievable by strategyproof\nmechanisms for general and specific additive functions. In most of the cases we\nprovide tight or asymptotically tight results. All our mechanisms are simple\nand can be computed in polynomial time. Moreover, all the lower bounds are\nunconditional, that is, they do not rely on any computational or complexity\nassumptions.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jun 2017 18:47:49 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Flammini", "Michele", ""], ["Monaco", "Gianpiero", ""], ["Zhang", "Qiang", ""]]}, {"id": "1706.09060", "submitter": "Jonathan Schneider", "authors": "Mark Braverman, Jieming Mao, Jon Schneider, S. Matthew Weinberg", "title": "Multi-armed Bandit Problems with Strategic Arms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a strategic version of the multi-armed bandit problem, where each\narm is an individual strategic agent and we, the principal, pull one arm each\nround. When pulled, the arm receives some private reward $v_a$ and can choose\nan amount $x_a$ to pass on to the principal (keeping $v_a-x_a$ for itself). All\nnon-pulled arms get reward $0$. Each strategic arm tries to maximize its own\nutility over the course of $T$ rounds. Our goal is to design an algorithm for\nthe principal incentivizing these arms to pass on as much of their private\nrewards as possible.\n  When private rewards are stochastically drawn each round ($v_a^t \\leftarrow\nD_a$), we show that:\n  - Algorithms that perform well in the classic adversarial multi-armed bandit\nsetting necessarily perform poorly: For all algorithms that guarantee low\nregret in an adversarial setting, there exist distributions $D_1,\\ldots,D_k$\nand an approximate Nash equilibrium for the arms where the principal receives\nreward $o(T)$.\n  - Still, there exists an algorithm for the principal that induces a game\namong the arms where each arm has a dominant strategy. When each arm plays its\ndominant strategy, the principal sees expected reward $\\mu'T - o(T)$, where\n$\\mu'$ is the second-largest of the means $\\mathbb{E}[D_{a}]$. This algorithm\nmaintains its guarantee if the arms are non-strategic ($x_a = v_a$), and also\nif there is a mix of strategic and non-strategic arms.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jun 2017 21:58:00 GMT"}], "update_date": "2017-07-03", "authors_parsed": [["Braverman", "Mark", ""], ["Mao", "Jieming", ""], ["Schneider", "Jon", ""], ["Weinberg", "S. Matthew", ""]]}, {"id": "1706.09132", "submitter": "Carme \\`Alvarez", "authors": "Carme \\`Alvarez and Arnau Messegu\\'e", "title": "Network Creation Games: Structure vs Anarchy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study Nash equilibria and the price of anarchy in the classical model of\nNetwork Creation Games introduced by Fabrikant et al. In this model every agent\n(node) buys links at a prefixed price $\\alpha>0$ in order to get connected to\nthe network formed by all the $n$ agents. In this setting, the reformulated\ntree conjecture states that for $\\alpha > n$, every Nash equilibrium network is\na tree. Since it was shown that the price of anarchy for trees is constant, if\nthe tree conjecture were true, then the price of anarchy would be constant for\n$\\alpha >n$. Moreover, Demaine et al. conjectured that the price of anarchy for\nthis model is constant.\n  Up to now the last conjecture has been proven in (i) the \\emph{lower range},\nfor $\\alpha = O(n^{1-\\epsilon})$ with $\\epsilon \\geq \\frac{1}{\\log n}$ and (ii)\nin the \\emph{upper range}, for $\\alpha > 65n$. In contrast, the best upper\nbound known for the price of anarchy for the remaining range is\n$2^{O(\\sqrt{\\log n})}$.\n  In this paper we give new insights into the structure of the Nash equilibria\nfor different ranges of $\\alpha$ and we enlarge the range for which the price\nof anarchy is constant. Regarding the upper range, we prove that every Nash\nequilibrium is a tree for $\\alpha > 17n$ and that the price of anarchy is\nconstant even for $\\alpha > 9n$. In the lower range, we show that any Nash\nequilibrium for $\\alpha < n/C$ with $C > 4$, induces an\n$\\epsilon-$distance-almost-uniform graph.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jun 2017 06:12:54 GMT"}, {"version": "v2", "created": "Mon, 24 Jul 2017 14:00:04 GMT"}], "update_date": "2017-07-25", "authors_parsed": [["Àlvarez", "Carme", ""], ["Messegué", "Arnau", ""]]}, {"id": "1706.09534", "submitter": "Mark C. Wilson", "authors": "Geoffrey Pritchard, Mark C. Wilson", "title": "Multi-district preference modelling", "comments": "10 pages, 15 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT physics.soc-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Generating realistic artificial preference distributions is an important part\nof any simulation analysis of electoral systems. While this has been discussed\nin some detail in the context of a single electoral district, many electoral\nsystems of interest are based on multiple districts. Neither treating\npreferences between districts as independent nor ignoring the district\nstructure yields satisfactory results. We present a model based on an extension\nof the classic Eggenberger-P\\'olya urn, in which each district is represented\nby an urn and there is correlation between urns. We show in detail that this\nprocedure has a small number of tunable parameters, is computationally\nefficient, and produces \"realistic-looking\" distributions. We intend to use it\nin further studies of electoral systems.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 01:18:53 GMT"}], "update_date": "2017-06-30", "authors_parsed": [["Pritchard", "Geoffrey", ""], ["Wilson", "Mark C.", ""]]}, {"id": "1706.09763", "submitter": "Robin Nicole Mr", "authors": "Robin Nicole and Peter Sollich", "title": "Dynamical selection of Nash equilibria using Experience Weighted\n  Attraction Learning: emergence of heterogeneous mixed equilibria", "comments": "35 pages, 16 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0196577", "report-no": null, "categories": "cs.GT cond-mat.stat-mech cs.LG q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the distribution of strategies in a large game that models how\nagents choose among different double auction markets. We classify the possible\nmean field Nash equilibria, which include potentially segregated states where\nan agent population can split into subpopulations adopting different\nstrategies. As the game is aggregative, the actual equilibrium strategy\ndistributions remain undetermined, however. We therefore compare with the\nresults of Experience-Weighted Attraction (EWA) learning, which at long times\nleads to Nash equilibria in the appropriate limits of large intensity of\nchoice, low noise (long agent memory) and perfect imputation of missing scores\n(fictitious play). The learning dynamics breaks the indeterminacy of the Nash\nequilibria. Non-trivially, depending on how the relevant limits are taken, more\nthan one type of equilibrium can be selected. These include the standard\nhomogeneous mixed and heterogeneous pure states, but also \\emph{heterogeneous\nmixed} states where different agents play different strategies that are not all\npure. The analysis of the EWA learning involves Fokker-Planck modeling combined\nwith large deviation methods. The theoretical results are confirmed by\nmulti-agent simulations.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 14:02:04 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Nicole", "Robin", ""], ["Sollich", "Peter", ""]]}, {"id": "1706.09861", "submitter": "Mehrdad Nojoumian", "authors": "Mehrdad Nojoumian", "title": "Rational Trust Modeling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT cs.MA cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Trust models are widely used in various computer science disciplines. The\nmain purpose of a trust model is to continuously measure trustworthiness of a\nset of entities based on their behaviors. In this article, the novel notion of\n\"rational trust modeling\" is introduced by bridging trust management and game\ntheory. Note that trust models/reputation systems have been used in game theory\n(e.g., repeated games) for a long time, however, game theory has not been\nutilized in the process of trust model construction; this is where the novelty\nof our approach comes from. In our proposed setting, the designer of a trust\nmodel assumes that the players who intend to utilize the model are\nrational/selfish, i.e., they decide to become trustworthy or untrustworthy\nbased on the utility that they can gain. In other words, the players are\nincentivized (or penalized) by the model itself to act properly. The problem of\ntrust management can be then approached by game theoretical analyses and\nsolution concepts such as Nash equilibrium. Although rationality might be\nbuilt-in in some existing trust models, we intend to formalize the notion of\nrational trust modeling from the designer's perspective. This approach will\nresult in two fascinating outcomes. First of all, the designer of a trust model\ncan incentivise trustworthiness in the first place by incorporating proper\nparameters into the trust function, which can be later utilized among selfish\nplayers in strategic trust-based interactions (e.g., e-commerce scenarios).\nFurthermore, using a rational trust model, we can prevent many well-known\nattacks on trust models. These two prominent properties also help us to predict\nbehavior of the players in subsequent steps by game theoretical analyses.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 17:18:47 GMT"}, {"version": "v2", "created": "Mon, 25 Sep 2017 16:53:41 GMT"}], "update_date": "2017-09-26", "authors_parsed": [["Nojoumian", "Mehrdad", ""]]}, {"id": "1706.09869", "submitter": "Warut Suksompong", "authors": "Warut Suksompong", "title": "Approximate Maximin Shares for Groups of Agents", "comments": "To appear in the 10th International Symposium on Algorithmic Game\n  Theory (SAGT), 2017", "journal-ref": "Mathematical Social Sciences, 92:40-47 (2018)", "doi": "10.1016/j.mathsocsci.2017.09.004", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the problem of fairly allocating indivisible goods among\ninterested agents using the concept of maximin share. Procaccia and Wang showed\nthat while an allocation that gives every agent at least her maximin share does\nnot necessarily exist, one that gives every agent at least $2/3$ of her share\nalways does. In this paper, we consider the more general setting where we\nallocate the goods to groups of agents. The agents in each group share the same\nset of goods even though they may have conflicting preferences. For two groups,\nwe characterize the cardinality of the groups for which a constant factor\napproximation of the maximin share is possible regardless of the number of\ngoods. We also show settings where an approximation is possible or impossible\nwhen there are several groups.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 17:34:24 GMT"}, {"version": "v2", "created": "Wed, 26 Jul 2017 14:33:50 GMT"}, {"version": "v3", "created": "Thu, 14 Sep 2017 21:59:20 GMT"}], "update_date": "2018-04-19", "authors_parsed": [["Suksompong", "Warut", ""]]}, {"id": "1706.10009", "submitter": "Tomer Ezra", "authors": "Alon Eden, Tomer Ezra, and Michal Feldman", "title": "Pricing Social Goods", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social goods are goods that grant value not only to their owners but also to\nthe owners' surroundings, be it their families, friends or office mates. The\nbenefit a non-owner derives from the good is affected by many factors,\nincluding the type of the good, its availability, and the social status of the\nnon-owner. Depending on the magnitude of the benefit and on the price of the\ngood, a potential buyer might stay away from purchasing the good, hoping to\nfree ride on others' purchases. A revenue-maximizing seller who sells social\ngoods must take these considerations into account when setting prices for the\ngood. The literature on optimal pricing has advanced considerably over the last\ndecade, but little is known about optimal pricing schemes for selling social\ngoods. In this paper, we conduct a systematic study of revenue-maximizing\npricing schemes for social goods: we introduce a Bayesian model for this\nscenario, and devise nearly-optimal pricing schemes for various types of\nexternalities, both for simultaneous sales and for sequential sales.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jun 2017 03:31:00 GMT"}, {"version": "v2", "created": "Mon, 3 Jul 2017 11:12:48 GMT"}], "update_date": "2017-07-04", "authors_parsed": [["Eden", "Alon", ""], ["Ezra", "Tomer", ""], ["Feldman", "Michal", ""]]}, {"id": "1706.10200", "submitter": "Pascal Lenzner", "authors": "Ankit Chauhan, Pascal Lenzner, Anna Melnichenko, Louise Molitor", "title": "Selfish Network Creation with Non-Uniform Edge Cost", "comments": "To appear at SAGT'17", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network creation games investigate complex networks from a game-theoretic\npoint of view. Based on the original model by Fabrikant et al. [PODC'03] many\nvariants have been introduced. However, almost all versions have the drawback\nthat edges are treated uniformly, i.e. every edge has the same cost and that\nthis common parameter heavily influences the outcomes and the analysis of these\ngames.\n  We propose and analyze simple and natural parameter-free network creation\ngames with non-uniform edge cost. Our models are inspired by social networks\nwhere the cost of forming a link is proportional to the popularity of the\ntargeted node. Besides results on the complexity of computing a best response\nand on various properties of the sequential versions, we show that the most\ngeneral version of our model has constant Price of Anarchy. To the best of our\nknowledge, this is the first proof of a constant Price of Anarchy for any\nnetwork creation game.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jun 2017 13:56:56 GMT"}], "update_date": "2017-07-03", "authors_parsed": [["Chauhan", "Ankit", ""], ["Lenzner", "Pascal", ""], ["Melnichenko", "Anna", ""], ["Molitor", "Louise", ""]]}]