[{"id": "1710.00249", "submitter": "Kerem Yunus Camsari", "authors": "Ramtin Zand, Kerem Yunus Camsari, Steven D. Pyle, Ibrahim Ahmed, Chris\n  H. Kim, Ronald F. DeMara", "title": "Low-Energy Deep Belief Networks using Intrinsic Sigmoidal\n  Spintronic-based Probabilistic Neurons", "comments": "ACM Great Lakes Symposium on VLSI (GLSVLSI), 2018", "journal-ref": null, "doi": "10.1145/3194554.3194558", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A low-energy hardware implementation of deep belief network (DBN)\narchitecture is developed using near-zero energy barrier probabilistic spin\nlogic devices (p-bits), which are modeled to realize an intrinsic sigmoidal\nactivation function. A CMOS/spin based weighted array structure is designed to\nimplement a restricted Boltzmann machine (RBM). Device-level simulations based\non precise physics relations are used to validate the sigmoidal relation\nbetween the output probability of a p-bit and its input currents.\nCharacteristics of the resistive networks and p-bits are modeled in SPICE to\nperform a circuit-level simulation investigating the performance, area, and\npower consumption tradeoffs of the weighted array. In the application-level\nsimulation, a DBN is implemented in MATLAB for digit recognition using the\nextracted device and circuit behavioral models. The MNIST data set is used to\nassess the accuracy of the DBN using 5,000 training images for five distinct\nnetwork topologies. The results indicate that a baseline error rate of 36.8%\nfor a 784x10 DBN trained by 100 samples can be reduced to only 3.7% using a\n784x800x800x10 DBN trained by 5,000 input samples. Finally, Power dissipation\nand accuracy tradeoffs for probabilistic computing mechanisms using resistive\ndevices are identified.\n", "versions": [{"version": "v1", "created": "Sat, 30 Sep 2017 19:23:09 GMT"}, {"version": "v2", "created": "Mon, 11 Jun 2018 22:08:43 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Zand", "Ramtin", ""], ["Camsari", "Kerem Yunus", ""], ["Pyle", "Steven D.", ""], ["Ahmed", "Ibrahim", ""], ["Kim", "Chris H.", ""], ["DeMara", "Ronald F.", ""]]}, {"id": "1710.01056", "submitter": "Tianshi Wang", "authors": "Tianshi Wang", "title": "Achieving Phase-based Logic Bit Storage in Mechanical Metronomes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, oscillator-based Boolean computation has been proposed for its\npotentials in noise immunity and energy efficiency. In such a system, logic\nbits are encoded in the relative phases of oscillating signals and stored in\ninjection-locked oscillators. To show that the scheme is very general and not\nspecific to electronic oscillators, in this paper, we report our work on\nstoring a phase-based logic bit in the relative phase between two mechanical\nmetronomes. While the synchronization of metronomes is a classic example\nshowing the effects of injection locking, our work takes it one step further by\ndemonstrating the bistable phase in sub-harmonically injection-locked\nmetronomes --- a key mechanism for oscillator-based Boolean computation.\nAlthough we do not expect to make computers with metronomes, our study\ndemonstrates the generality of this new computation paradigm and may inspire\nits practical implementations in various fields, eg, MEMS, silicon photonics,\nspintronics, synthetic biology, etc.\n", "versions": [{"version": "v1", "created": "Tue, 3 Oct 2017 10:06:28 GMT"}], "update_date": "2017-10-04", "authors_parsed": [["Wang", "Tianshi", ""]]}, {"id": "1710.02678", "submitter": "Johann Knechtel", "authors": "Johann Knechtel and Ozgur Sinanoglu", "title": "On Mitigation of Side-Channel Attacks in 3D ICs: Decorrelating Thermal\n  Patterns from Power and Activity", "comments": "Published in Proc. Design Automation Conference, 2017", "journal-ref": null, "doi": "10.1145/3061639.3062293", "report-no": null, "categories": "cs.CR cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various side-channel attacks (SCAs) on ICs have been successfully\ndemonstrated and also mitigated to some degree. In the context of 3D ICs,\nhowever, prior art has mainly focused on efficient implementations of classical\nSCA countermeasures. That is, SCAs tailored for up-and-coming 3D ICs have been\noverlooked so far. In this paper, we conduct such a novel study and focus on\none of the most accessible and critical side channels: thermal leakage of\nactivity and power patterns. We address the thermal leakage in 3D ICs early on\nduring floorplanning, along with tailored extensions for power and thermal\nmanagement. Our key idea is to carefully exploit the specifics of material and\nstructural properties in 3D ICs, thereby decorrelating the thermal behaviour\nfrom underlying power and activity patterns. Most importantly, we discuss\npowerful SCAs and demonstrate how our open-source tool helps to mitigate them.\n", "versions": [{"version": "v1", "created": "Sat, 7 Oct 2017 12:28:15 GMT"}], "update_date": "2019-06-07", "authors_parsed": [["Knechtel", "Johann", ""], ["Sinanoglu", "Ozgur", ""]]}, {"id": "1710.07345", "submitter": "Dmitri Maslov", "authors": "Yunseong Nam, Neil J. Ross, Yuan Su, Andrew M. Childs, and Dmitri\n  Maslov", "title": "Automated optimization of large quantum circuits with continuous\n  parameters", "comments": "21 pages", "journal-ref": "npj:Quantum Information 4, 23 (2018)", "doi": "10.1038/s41534-018-0072-4", "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop and implement automated methods for optimizing quantum circuits of\nthe size and type expected in quantum computations that outperform classical\ncomputers. We show how to handle continuous gate parameters and report a\ncollection of fast algorithms capable of optimizing large-scale quantum\ncircuits. For the suite of benchmarks considered, we obtain substantial\nreductions in gate counts. In particular, we provide better optimization in\nsignificantly less time than previous approaches, while making minimal\nstructural changes so as to preserve the basic layout of the underlying quantum\nalgorithms. Our results help bridge the gap between the computations that can\nbe run on existing hardware and those that are expected to outperform classical\ncomputers.\n", "versions": [{"version": "v1", "created": "Thu, 19 Oct 2017 20:36:50 GMT"}, {"version": "v2", "created": "Fri, 1 Jun 2018 16:33:42 GMT"}], "update_date": "2018-06-04", "authors_parsed": [["Nam", "Yunseong", ""], ["Ross", "Neil J.", ""], ["Su", "Yuan", ""], ["Childs", "Andrew M.", ""], ["Maslov", "Dmitri", ""]]}, {"id": "1710.07375", "submitter": "Tetsufumi Tanamoto", "authors": "Tetsufumi Tanamoto, Chika Tanaka, Satoshi Takaya, and Masato Koyama", "title": "SPICE Simulation of tunnel FET aiming at 32 kHz crystal-oscillator\n  operation", "comments": "7 pages, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.app-ph cond-mat.mes-hall cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We numerically investigate the possibility of using Tunnel field-effect\ntransistor (TFET) in a 32 kHz crystal oscillator circuit to reduce power\nconsumption. A simulation using SPICE (Simulation Program with Integrated\nCircuit Emphasis) is carried out based on a conventional CMOS transistor model.\nIt is shown that the power consumption of TFET is one-tenth that of\nconventional low-power CMOS.\n", "versions": [{"version": "v1", "created": "Fri, 20 Oct 2017 00:00:25 GMT"}], "update_date": "2017-10-23", "authors_parsed": [["Tanamoto", "Tetsufumi", ""], ["Tanaka", "Chika", ""], ["Takaya", "Satoshi", ""], ["Koyama", "Masato", ""]]}, {"id": "1710.07866", "submitter": "Alexandra Porter", "authors": "Alexandra Porter and Andr\\'ea W. Richa", "title": "Collaborative Computation in Self-Organizing Particle Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many forms of programmable matter have been proposed for various tasks. We\nuse an abstract model of self-organizing particle systems for programmable\nmatter which could be used for a variety of applications, including smart paint\nand coating materials for engineering or programmable cells for medical uses.\nPrevious research using this model has focused on shape formation and other\nspatial configuration problems (e.g., coating and compression). In this work we\nstudy foundational computational tasks that exceed the capabilities of the\nindividual constant size memory of a particle, such as implementing a counter\nand matrix-vector multiplication. These tasks represent new ways to use these\nself-organizing systems, which, in conjunction with previous shape and\nconfiguration work, make the systems useful for a wider variety of tasks. They\ncan also leverage the distributed and dynamic nature of the self-organizing\nsystem to be more efficient and adaptable than on traditional linear computing\nhardware. Finally, we demonstrate applications of similar types of computations\nwith self-organizing systems to image processing, with implementations of image\ncolor transformation and edge detection algorithms.\n", "versions": [{"version": "v1", "created": "Sun, 22 Oct 2017 00:11:06 GMT"}], "update_date": "2017-10-24", "authors_parsed": [["Porter", "Alexandra", ""], ["Richa", "Andréa W.", ""]]}, {"id": "1710.08034", "submitter": "Borna Obradovic", "authors": "Borna Obradovic, Titash Rakshit, Ryan Hatcher, Jorge Kittl, Rwik\n  Sengupta, Joon Goo Hong, and Mark S. Rodder", "title": "A Multi-Bit Neuromorphic Weight Cell using Ferroelectric FETs, suitable\n  for SoC Integration", "comments": "9 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cond-mat.mes-hall", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A multi-bit digital weight cell for high-performance, inference-only\nnon-GPU-like neuromorphic accelerators is presented. The cell is designed with\nsimplicity of peripheral circuitry in mind. Non-volatile storage of weights\nwhich eliminates the need for DRAM access is based on FeFETs and is purely\ndigital. The Multiply-and-Accumulate operation is performed using passive\nresistors, gated by FeFETs. The resulting weight cell offers a high degree of\nlinearity and a large ON/OFF ratio. The key performance tradeoffs are\ninvestigated, and the device requirements are elucidated.\n", "versions": [{"version": "v1", "created": "Sun, 22 Oct 2017 22:44:36 GMT"}], "update_date": "2017-10-24", "authors_parsed": [["Obradovic", "Borna", ""], ["Rakshit", "Titash", ""], ["Hatcher", "Ryan", ""], ["Kittl", "Jorge", ""], ["Sengupta", "Rwik", ""], ["Hong", "Joon Goo", ""], ["Rodder", "Mark S.", ""]]}, {"id": "1710.08286", "submitter": "David Ibanez-Soria", "authors": "D Ibanez-Soria, J Garcia-Ojalvo, A Soria-Frisch, G Ruffini", "title": "Detection of Generalized Synchronization using Echo State Networks", "comments": null, "journal-ref": null, "doi": "10.1063/1.5010285", "report-no": null, "categories": "nlin.CD cs.ET eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generalized synchronization between coupled dynamical systems is a phenomenon\nof relevance in applications that range from secure communications to\nphysiological modelling. Here we test the capabilities of reservoir computing\nand, in particular, echo state networks for the detection of generalized\nsynchronization. A nonlinear dynamical system consisting of two coupled\nR\\\"ossler chaotic attractors is used to generate temporal series consisting of\ntime-locked generalized synchronized sequences interleaved by unsynchronized\nones. Correctly tuned, echo state networks are able to efficiently discriminate\nbetween unsynchronized and synchronized sequences. Compared to other\nstate-of-the-art techniques of synchronization detection, the online\ncapabilities of the proposed ESN based methodology make it a promising choice\nfor real-time applications aiming to monitor dynamical synchronization changes\nin continuous signals.\n", "versions": [{"version": "v1", "created": "Mon, 23 Oct 2017 14:04:27 GMT"}, {"version": "v2", "created": "Tue, 24 Oct 2017 14:54:48 GMT"}], "update_date": "2018-04-18", "authors_parsed": [["Ibanez-Soria", "D", ""], ["Garcia-Ojalvo", "J", ""], ["Soria-Frisch", "A", ""], ["Ruffini", "G", ""]]}, {"id": "1710.08882", "submitter": "Sijia Liu", "authors": "Sijia Liu, Yanzhi Wang, Makan Fardad and Pramod K. Varshney", "title": "A Memristor-Based Optimization Framework for AI Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Memristors have recently received significant attention as ubiquitous\ndevice-level components for building a novel generation of computing systems.\nThese devices have many promising features, such as non-volatility, low power\nconsumption, high density, and excellent scalability. The ability to control\nand modify biasing voltages at the two terminals of memristors make them\npromising candidates to perform matrix-vector multiplications and solve systems\nof linear equations. In this article, we discuss how networks of memristors\narranged in crossbar arrays can be used for efficiently solving optimization\nand machine learning problems. We introduce a new memristor-based optimization\nframework that combines the computational merit of memristor crossbars with the\nadvantages of an operator splitting method, alternating direction method of\nmultipliers (ADMM). Here, ADMM helps in splitting a complex optimization\nproblem into subproblems that involve the solution of systems of linear\nequations. The capability of this framework is shown by applying it to linear\nprogramming, quadratic programming, and sparse optimization. In addition to\nADMM, implementation of a customized power iteration (PI) method for\neigenvalue/eigenvector computation using memristor crossbars is discussed. The\nmemristor-based PI method can further be applied to principal component\nanalysis (PCA). The use of memristor crossbars yields a significant speed-up in\ncomputation, and thus, we believe, has the potential to advance optimization\nand machine learning research in artificial intelligence (AI).\n", "versions": [{"version": "v1", "created": "Wed, 18 Oct 2017 15:09:22 GMT"}], "update_date": "2017-10-25", "authors_parsed": [["Liu", "Sijia", ""], ["Wang", "Yanzhi", ""], ["Fardad", "Makan", ""], ["Varshney", "Pramod K.", ""]]}, {"id": "1710.08940", "submitter": "SeyedMohammad Seyedzadeh", "authors": "Seyed Mohammad Seyedzadeh, Alex K. Jones and Rami Melhem", "title": "A Variable Length Coding Framework for Cost Function Reduction in\n  Non-Volatile Memory Systems", "comments": "NVMW2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Variable length coding for Non-Volatile Memory (NVM) technologies is a\npromising method to improve memory capacity and system performance through\ncompressing memory blocks. However, compression techniques used to improve\ncapacity or bandwidth utilization do not take into consideration the asymmetric\ncosts of writing 1's and 0's in NVMs. Taking into account this asymmetry, we\npropose a variable length encoding framework that reduces the cost of writing\ndata into NVM. Our experimental results on 12 workloads of the SPEC CPU2006\nbenchmark suite show that, when the cost asymmetry is 1:2, the proposed\nframework is capable of reducing the NVM programming cost by up to 24% more\nthan leading compression approaches and by 12.5% more than the flip-and-write\napproach which selects between the data and its complement based on the\nprogramming cost.\n", "versions": [{"version": "v1", "created": "Tue, 24 Oct 2017 18:17:35 GMT"}], "update_date": "2017-10-26", "authors_parsed": [["Seyedzadeh", "Seyed Mohammad", ""], ["Jones", "Alex K.", ""], ["Melhem", "Rami", ""]]}, {"id": "1710.09012", "submitter": "Baibhab Chatterjee", "authors": "Baibhab Chatterjee, Priyadarshini Panda, Shovan Maity, Kaushik Roy and\n  Shreyas Sen", "title": "An Energy-Efficient Mixed-Signal Neuron for Inherently Error-Resilient\n  Neuromorphic Systems", "comments": "Accepted in IEEE International Conference on Rebooting Computing\n  (ICRC), 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.AI cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents the design and analysis of a mixed-signal neuron (MS-N)\nfor convolutional neural networks (CNN) and compares its performance with a\ndigital neuron (Dig-N) in terms of operating frequency, power and noise. The\ncircuit-level implementation of the MS-N in 65 nm CMOS technology exhibits 2-3\norders of magnitude better energy-efficiency over Dig-N for neuromorphic\ncomputing applications - especially at low frequencies due to the high leakage\ncurrents from many transistors in Dig-N. The inherent error-resiliency of CNN\nis exploited to handle the thermal and flicker noise of MS-N. A system-level\nanalysis using a cohesive circuit-algorithmic framework on MNIST and CIFAR-10\ndatasets demonstrate an increase of 3% in worst-case classification error for\nMNIST when the integrated noise power in the bandwidth is ~ 1 {\\mu}V2.\n", "versions": [{"version": "v1", "created": "Tue, 24 Oct 2017 22:43:16 GMT"}], "update_date": "2018-05-07", "authors_parsed": [["Chatterjee", "Baibhab", ""], ["Panda", "Priyadarshini", ""], ["Maity", "Shovan", ""], ["Roy", "Kaushik", ""], ["Sen", "Shreyas", ""]]}, {"id": "1710.09494", "submitter": "James Lathrop", "authors": "Samuel J. Ellis, Titus H. Klinge, James I. Lathrop, Jack H. Lutz,\n  Robyn R. Lutz, Andrew S. Miner, and Hugh D. Potter", "title": "Runtime Fault Detection in Programmed Molecular Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Watchdog timers are devices that are commonly used to monitor the health of\nsafety-critical hardware and software systems. Their primary function is to\nraise an alarm if the monitored systems fail to emit periodic \"heartbeats\" that\nsignal their well-being. In this paper we design and verify a molecular\nwatchdog timer for monitoring the health of programmed molecular nanosystems.\nThis raises new challenges because our molecular watchdog timer and the system\nthat it monitors both operate in the probabilistic environment of chemical\nkinetics, where many failures are certain to occur and it is especially hard to\ndetect the absence of a signal.\n  Our molecular watchdog timer is the result of an incremental design process\nthat uses goal-oriented requirements engineering, simulation, stochastic\nanalysis, and software verification tools. We demonstrate the molecular\nwatchdog's functionality by having it monitor a molecular oscillator. Both the\nmolecular watchdog timer and the oscillator are implemented as chemical\nreaction networks, which are the current programming language of choice for\nmany molecular programming applications.\n", "versions": [{"version": "v1", "created": "Wed, 25 Oct 2017 23:41:30 GMT"}, {"version": "v2", "created": "Mon, 23 Jul 2018 17:23:40 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Ellis", "Samuel J.", ""], ["Klinge", "Titus H.", ""], ["Lathrop", "James I.", ""], ["Lutz", "Jack H.", ""], ["Lutz", "Robyn R.", ""], ["Miner", "Andrew S.", ""], ["Potter", "Hugh D.", ""]]}, {"id": "1710.09764", "submitter": "Yusuf Said Eroglu", "authors": "Yusuf Said Eroglu, Yavuz Yapici, Ismail Guvenc", "title": "Impact of Random Receiver Orientation on Visible Light Communications\n  Channel", "comments": "Submitted to IEEE JLT. Has been partially published in Proc. Asilomar\n  Conf. Signals, Systems, and Computers, Nov. 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Visible Light Communications (VLC) has been studied thoroughly in recent\nyears as an alternative or complementary technology to radio frequency\ncommunications. The reliability of VLC channels highly depends on the\navailability and alignment of line of sight links. In this work, we study the\neffect of random receiver orientation for mobile users over VLC downlink\nchannels, which affects the existence of line of sight links and the receiver\nfield of view. Based on the statistics of vertical receiver orientation and\nuser mobility, we develop a unified analytical framework to characterize the\nstatistical distribution of VLC downlink channels, which is then utilized to\nobtain the outage probability and the bit error rate. Our analysis is\ngeneralized for arbitrary distributions of receiver orientation/location for a\nsingle transmitter, and extended to multiple transmitter case for certain\nscenarios. Extensive Monte Carlo simulations show a perfect match between the\nanalytical and the simulation data in terms of both the statistical channel\ndistribution and the resulting bit error rate. Our results also characterize\nthe channel attenuation due to random receiver orientation/location for various\nscenarios of interest.\n", "versions": [{"version": "v1", "created": "Thu, 26 Oct 2017 15:41:15 GMT"}], "update_date": "2017-10-27", "authors_parsed": [["Eroglu", "Yusuf Said", ""], ["Yapici", "Yavuz", ""], ["Guvenc", "Ismail", ""]]}]