[{"id": "0803.0055", "submitter": "Benoit Masson", "authors": "Alberto Dennunzio (DISCo), Pierre Guillon (IGM), Beno\\^it Masson (LIF)", "title": "A compact topology for sand automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we exhibit a strong relation between the sand automata\nconfiguration space and the cellular automata configuration space. This\nrelation induces a compact topology for sand automata, and a new context in\nwhich sand automata are homeomorphic to cellular automata acting on a specific\nsubshift. We show that the existing topological results for sand automata,\nincluding the Hedlund-like representation theorem, still hold. In this context,\nwe give a characterization of the cellular automata which are sand automata,\nand study some dynamical behaviors such as equicontinuity. Furthermore, we deal\nwith the nilpotency. We show that the classical definition is not meaningful\nfor sand automata. Then, we introduce a suitable new notion of nilpotency for\nsand automata. Finally, we prove that this simple dynamical behavior is\nundecidable.\n", "versions": [{"version": "v1", "created": "Sat, 1 Mar 2008 08:36:39 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Dennunzio", "Alberto", "", "DISCo"], ["Guillon", "Pierre", "", "IGM"], ["Masson", "Benoît", "", "LIF"]]}, {"id": "0803.0404", "submitter": "Maria  Serna", "authors": "Josep Freixas, Xavier Molinero, Martin Olsen, Maria Serna", "title": "The Complexity of Testing Properties of Simple Games", "comments": "18 pages, LaTex file", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simple games cover voting systems in which a single alternative, such as a\nbill or an amendment, is pitted against the status quo. A simple game or a\nyes-no voting system is a set of rules that specifies exactly which collections\nof ``yea'' votes yield passage of the issue at hand. A collection of ``yea''\nvoters forms a winning coalition.\n  We are interested on performing a complexity analysis of problems on such\ngames depending on the game representation. We consider four natural explicit\nrepresentations, winning, loosing, minimal winning, and maximal loosing. We\nfirst analyze the computational complexity of obtaining a particular\nrepresentation of a simple game from a different one. We show that some cases\nthis transformation can be done in polynomial time while the others require\nexponential time. The second question is classifying the complexity for testing\nwhether a game is simple or weighted. We show that for the four types of\nrepresentation both problem can be solved in polynomial time. Finally, we\nprovide results on the complexity of testing whether a simple game or a\nweighted game is of a special type. In this way, we analyze strongness,\nproperness, decisiveness and homogeneity, which are desirable properties to be\nfulfilled for a simple game.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2008 10:20:04 GMT"}], "update_date": "2008-03-05", "authors_parsed": [["Freixas", "Josep", ""], ["Molinero", "Xavier", ""], ["Olsen", "Martin", ""], ["Serna", "Maria", ""]]}, {"id": "0803.0661", "submitter": "Jakob Nordstr\\\"om", "authors": "Jakob Nordstr\\\"om, Johan H{\\aa}stad", "title": "Towards an Optimal Separation of Space and Length in Resolution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most state-of-the-art satisfiability algorithms today are variants of the\nDPLL procedure augmented with clause learning. The main bottleneck for such\nalgorithms, other than the obvious one of time, is the amount of memory used.\nIn the field of proof complexity, the resources of time and memory correspond\nto the length and space of resolution proofs. There has been a long line of\nresearch trying to understand these proof complexity measures, but while strong\nresults have been proven on length our understanding of space is still quite\npoor. For instance, it remains open whether the fact that a formula is provable\nin short length implies that it is also provable in small space or whether on\nthe contrary these measures are unrelated in the sense that short proofs can be\narbitrarily complex with respect to space.\n  In this paper, we present some evidence that the true answer should be that\nthe latter case holds. We do this by proving a tight bound of Theta(sqrt(n)) on\nthe space needed for so-called pebbling contradictions over pyramid graphs of\nsize n. This yields the first polynomial lower bound on space that is not a\nconsequence of a corresponding lower bound on width, another well-studied\nmeasure in resolution, as well as an improvement of the weak separation in\n(Nordstrom 2006) of space and width from logarithmic to polynomial.\n  Also, continuing the line of research initiated by (Ben-Sasson 2002) into\ntrade-offs between different proof complexity measures, we present a simplified\nproof of the recent length-space trade-off result in (Hertel and Pitassi 2007),\nand show how our ideas can be used to prove a couple of other exponential\ntrade-offs in resolution.\n", "versions": [{"version": "v1", "created": "Wed, 5 Mar 2008 12:52:13 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Nordström", "Jakob", ""], ["Håstad", "Johan", ""]]}, {"id": "0803.0731", "submitter": "Ning Chen", "authors": "Ning Chen and Zhiyuan Yan", "title": "Complexity Analysis of Reed-Solomon Decoding over GF(2^m) Without Using\n  Syndromes", "comments": "11 pages, submitted to EURASIP Journal on Wireless Communications and\n  Networking", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC cs.DS math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the majority of the applications of Reed-Solomon (RS) codes, hard\ndecision decoding is based on syndromes. Recently, there has been renewed\ninterest in decoding RS codes without using syndromes. In this paper, we\ninvestigate the complexity of syndromeless decoding for RS codes, and compare\nit to that of syndrome-based decoding. Aiming to provide guidelines to\npractical applications, our complexity analysis differs in several aspects from\nexisting asymptotic complexity analysis, which is typically based on\nmultiplicative fast Fourier transform (FFT) techniques and is usually in big O\nnotation. First, we focus on RS codes over characteristic-2 fields, over which\nsome multiplicative FFT techniques are not applicable. Secondly, due to\nmoderate block lengths of RS codes in practice, our analysis is complete since\nall terms in the complexities are accounted for. Finally, in addition to fast\nimplementation using additive FFT techniques, we also consider direct\nimplementation, which is still relevant for RS codes with moderate lengths.\nComparing the complexities of both syndromeless and syndrome-based decoding\nalgorithms based on direct and fast implementations, we show that syndromeless\ndecoding algorithms have higher complexities than syndrome-based ones for high\nrate RS codes regardless of the implementation. Both errors-only and\nerrors-and-erasures decoding are considered in this paper. We also derive\ntighter bounds on the complexities of fast polynomial multiplications based on\nCantor's approach and the fast extended Euclidean algorithm.\n", "versions": [{"version": "v1", "created": "Wed, 5 Mar 2008 18:54:35 GMT"}, {"version": "v2", "created": "Wed, 7 May 2008 21:05:41 GMT"}], "update_date": "2008-05-08", "authors_parsed": [["Chen", "Ning", ""], ["Yan", "Zhiyuan", ""]]}, {"id": "0803.0845", "submitter": "Evain Laurent", "authors": "Laurent Evain", "title": "Knapsack cryptosystems built on NP-hard instance", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CC cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct three public key knapsack cryptosystems. Standard knapsack\ncryptosystems hide easy instances of the knapsack problem and have been broken.\nThe systems considered in the article face this problem: They hide a random\n(possibly hard) instance of the knapsack problem. We provide both complexity\nresults (size of the key, time needed to encypher/decypher...) and experimental\nresults. Security results are given for the second cryptosystem (the fastest\none and the one with the shortest key). Probabilistic polynomial reductions\nshow that finding the private key is as difficult as factorizing a product of\ntwo primes. We also consider heuristic attacks. First, the density of the\ncryptosystem can be chosen arbitrarily close to one, discarding low density\nattacks. Finally, we consider explicit heuristic attacks based on the LLL\nalgorithm and we prove that with respect to these attacks, the public key is as\nsecure as a random key.\n", "versions": [{"version": "v1", "created": "Thu, 6 Mar 2008 12:20:35 GMT"}], "update_date": "2008-03-17", "authors_parsed": [["Evain", "Laurent", ""]]}, {"id": "0803.0924", "submitter": "Shiva Kasiviswanathan", "authors": "Shiva Prasad Kasiviswanathan, Homin K. Lee, Kobbi Nissim, Sofya\n  Raskhodnikova, and Adam Smith", "title": "What Can We Learn Privately?", "comments": "35 pages, 2 figures", "journal-ref": "SIAM Journal of Computing 40(3) (2011) 793-826", "doi": null, "report-no": null, "categories": "cs.LG cs.CC cs.CR cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Learning problems form an important category of computational tasks that\ngeneralizes many of the computations researchers apply to large real-life data\nsets. We ask: what concept classes can be learned privately, namely, by an\nalgorithm whose output does not depend too heavily on any one input or specific\ntraining example? More precisely, we investigate learning algorithms that\nsatisfy differential privacy, a notion that provides strong confidentiality\nguarantees in contexts where aggregate information is released about a database\ncontaining sensitive information about individuals. We demonstrate that,\nignoring computational constraints, it is possible to privately agnostically\nlearn any concept class using a sample size approximately logarithmic in the\ncardinality of the concept class. Therefore, almost anything learnable is\nlearnable privately: specifically, if a concept class is learnable by a\n(non-private) algorithm with polynomial sample complexity and output size, then\nit can be learned privately using a polynomial number of samples. We also\npresent a computationally efficient private PAC learner for the class of parity\nfunctions. Local (or randomized response) algorithms are a practical class of\nprivate algorithms that have received extensive investigation. We provide a\nprecise characterization of local private learning algorithms. We show that a\nconcept class is learnable by a local algorithm if and only if it is learnable\nin the statistical query (SQ) model. Finally, we present a separation between\nthe power of interactive and noninteractive local learning algorithms.\n", "versions": [{"version": "v1", "created": "Thu, 6 Mar 2008 17:50:07 GMT"}, {"version": "v2", "created": "Mon, 14 Apr 2008 16:18:44 GMT"}, {"version": "v3", "created": "Fri, 19 Feb 2010 01:47:02 GMT"}], "update_date": "2012-10-10", "authors_parsed": [["Kasiviswanathan", "Shiva Prasad", ""], ["Lee", "Homin K.", ""], ["Nissim", "Kobbi", ""], ["Raskhodnikova", "Sofya", ""], ["Smith", "Adam", ""]]}, {"id": "0803.1030", "submitter": "David Soloveichik", "authors": "David Soloveichik", "title": "Robust Stochastic Chemical Reaction Networks and Bounded Tau-Leaping", "comments": "Tightened up section 5", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The behavior of some stochastic chemical reaction networks is largely\nunaffected by slight inaccuracies in reaction rates. We formalize the\nrobustness of state probabilities to reaction rate deviations, and describe a\nformal connection between robustness and efficiency of simulation. Without\nrobustness guarantees, stochastic simulation seems to require computational\ntime proportional to the total number of reaction events. Even if the\nconcentration (molecular count per volume) stays bounded, the number of\nreaction events can be linear in the duration of simulated time and total\nmolecular count. We show that the behavior of robust systems can be predicted\nsuch that the computational work scales linearly with the duration of simulated\ntime and concentration, and only polylogarithmically in the total molecular\ncount. Thus our asymptotic analysis captures the dramatic speedup when\nmolecular counts are large, and shows that for bounded concentrations the\ncomputation time is essentially invariant with molecular count. Finally, by\nnoticing that even robust stochastic chemical reaction networks are capable of\nembedding complex computational problems, we argue that the linear dependence\non simulated time and concentration is likely optimal.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2008 17:36:54 GMT"}, {"version": "v2", "created": "Sun, 16 Nov 2008 02:10:39 GMT"}, {"version": "v3", "created": "Wed, 28 Jan 2009 09:58:41 GMT"}], "update_date": "2009-01-28", "authors_parsed": [["Soloveichik", "David", ""]]}, {"id": "0803.1672", "submitter": "Scott Summers", "authors": "Matthew J. Patitz, and Scott M. Summers", "title": "Self-Assembly of Discrete Self-Similar Fractals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we search for {\\it absolute} limitations of the Tile Assembly\nModel (TAM), along with techniques to work around such limitations.\nSpecifically, we investigate the self-assembly of fractal shapes in the TAM. We\nprove that no self-similar fractal fully weakly self-assembles at temperature\n1, and that certain kinds of self-similar fractals do not strictly\nself-assemble at any temperature. Additionally, we extend the fiber\nconstruction from Lathrop et. al. (2007) to show that any self-similar fractal\nbelonging to a particular class of \"nice\" self-similar fractals has a fibered\nversion that strictly self-assembles in the TAM.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2008 16:43:24 GMT"}, {"version": "v2", "created": "Sat, 26 Apr 2008 17:15:02 GMT"}], "update_date": "2008-04-26", "authors_parsed": [["Patitz", "Matthew J.", ""], ["Summers", "Scott M.", ""]]}, {"id": "0803.1841", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "On the Topological Complexity of Infinitary Rational Relations", "comments": null, "journal-ref": "RAIRO-Theoretical Informatics and Applications 37 (2) (2003)\n  105-113", "doi": null, "report-no": null, "categories": "cs.LO cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove in this paper that there exists some infinitary rational relations\nwhich are analytic but non Borel sets, giving an answer to a question of\nSimonnet [Automates et Th\\'eorie Descriptive, Ph. D. Thesis, Universit\\'e Paris\n7, March 1992].\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2008 20:14:47 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "0803.2174", "submitter": "Mirela Damian", "authors": "Mirela Damian, Saurav Pandit and Sriram Pemmaraju", "title": "Local Approximation Schemes for Topology Control", "comments": "11 pages, 6 figures", "journal-ref": "Proceedings of the 25th ACM Symposium on Principles of Distributed\n  Computing, pages 208-218, July 2006", "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a distributed algorithm on wireless ad-hoc networks that\nruns in polylogarithmic number of rounds in the size of the network and\nconstructs a linear size, lightweight, (1+\\epsilon)-spanner for any given\n\\epsilon > 0. A wireless network is modeled by a d-dimensional \\alpha-quasi\nunit ball graph (\\alpha-UBG), which is a higher dimensional generalization of\nthe standard unit disk graph (UDG) model. The d-dimensional \\alpha-UBG model\ngoes beyond the unrealistic ``flat world'' assumption of UDGs and also takes\ninto account transmission errors, fading signal strength, and physical\nobstructions. The main result in the paper is this: for any fixed \\epsilon > 0,\n0 < \\alpha \\le 1, and d \\ge 2, there is a distributed algorithm running in\nO(\\log n \\log^* n) communication rounds on an n-node, d-dimensional \\alpha-UBG\nG that computes a (1+\\epsilon)-spanner G' of G with maximum degree \\Delta(G') =\nO(1) and total weight w(G') = O(w(MST(G)). This result is motivated by the\ntopology control problem in wireless ad-hoc networks and improves on existing\ntopology control algorithms along several dimensions. The technical\ncontributions of the paper include a new, sequential, greedy algorithm with\nrelaxed edge ordering and lazy updating, and clustering techniques for\nfiltering out unnecessary edges.\n", "versions": [{"version": "v1", "created": "Fri, 14 Mar 2008 14:37:12 GMT"}], "update_date": "2008-03-17", "authors_parsed": [["Damian", "Mirela", ""], ["Pandit", "Saurav", ""], ["Pemmaraju", "Sriram", ""]]}, {"id": "0803.2675", "submitter": "Gerard Briscoe Mr", "authors": "Gerard Briscoe and Philippe De Wilde", "title": "Digital Ecosystems: Self-Organisation of Evolving Agent Populations", "comments": "5 pages, 5 figures, ACM Management of Emergent Digital EcoSystems\n  (MEDES) 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A primary motivation for our research in Digital Ecosystems is the desire to\nexploit the self-organising properties of biological ecosystems. Ecosystems are\nthought to be robust, scalable architectures that can automatically solve\ncomplex, dynamic problems. Self-organisation is perhaps one of the most\ndesirable features in the systems that we engineer, and it is important for us\nto be able to measure self-organising behaviour. We investigate the\nself-organising aspects of Digital Ecosystems, created through the application\nof evolutionary computing to Multi-Agent Systems (MASs), aiming to determine a\nmacroscopic variable to characterise the self-organisation of the evolving\nagent populations within. We study a measure for the self-organisation called\nPhysical Complexity; based on statistical physics, automata theory, and\ninformation theory, providing a measure of information relative to the\nrandomness in an organism's genome, by calculating the entropy in a population.\nWe investigate an extension to include populations of variable length, and then\nbuilt upon this to construct an efficiency measure to investigate clustering\nwithin evolving agent populations. Overall an insight has been achieved into\nwhere and how self-organisation occurs in our Digital Ecosystem, and how it can\nbe quantified.\n", "versions": [{"version": "v1", "created": "Tue, 18 Mar 2008 16:59:12 GMT"}, {"version": "v2", "created": "Tue, 28 Oct 2008 09:53:30 GMT"}, {"version": "v3", "created": "Fri, 20 Feb 2009 04:14:47 GMT"}, {"version": "v4", "created": "Mon, 5 Oct 2009 00:32:17 GMT"}], "update_date": "2009-10-05", "authors_parsed": [["Briscoe", "Gerard", ""], ["De Wilde", "Philippe", ""]]}, {"id": "0803.2955", "submitter": "Lenka Zdeborova", "authors": "Lenka Zdeborov\\'a, Marc M\\'ezard", "title": "Locked constraint satisfaction problems", "comments": "4 pages, 2 figures", "journal-ref": "Phys. Rev. Lett. 101, 078702 (2008)", "doi": "10.1103/PhysRevLett.101.078702", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.dis-nn cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce and study the random \"locked\" constraint satisfaction problems.\nWhen increasing the density of constraints, they display a broad \"clustered\"\nphase in which the space of solutions is divided into many isolated points.\nWhile the phase diagram can be found easily, these problems, in their clustered\nphase, are extremely hard from the algorithmic point of view: the best known\nalgorithms all fail to find solutions. We thus propose new benchmarks of really\nhard optimization problems and provide insight into the origin of their typical\nhardness.\n", "versions": [{"version": "v1", "created": "Thu, 20 Mar 2008 10:11:00 GMT"}, {"version": "v2", "created": "Fri, 5 Sep 2008 16:54:42 GMT"}], "update_date": "2008-09-05", "authors_parsed": [["Zdeborová", "Lenka", ""], ["Mézard", "Marc", ""]]}, {"id": "0803.3531", "submitter": "Daniel Raible", "authors": "Daniel Raible and Henning Fernau", "title": "A New Upper Bound for Max-2-Sat: A Graph-Theoretic Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In {\\sc MaxSat}, we ask for an assignment which satisfies the maximum number\nof clauses for a boolean formula in CNF. We present an algorithm yielding a run\ntime upper bound of $O^*(2^{\\frac{1}{6.2158}})$ for {\\sc Max-2-Sat} (each\nclause contains at most 2 literals), where $K$ is the number of clauses. The\nrun time has been achieved by using heuristic priorities on the choice of the\nvariable on which we branch. The implementation of these heuristic priorities\nis rather simple, though they have a significant effect on the run time. The\nanalysis is done using a tailored non-standard measure.\n", "versions": [{"version": "v1", "created": "Tue, 25 Mar 2008 11:32:22 GMT"}, {"version": "v2", "created": "Mon, 7 Apr 2008 08:36:18 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Raible", "Daniel", ""], ["Fernau", "Henning", ""]]}, {"id": "0803.4197", "submitter": "Vladimir Privman", "authors": "V. Privman, G. Strack, D. Solenov, M. Pita, E. Katz", "title": "Optimization of Enzymatic Biochemical Logic for Noise Reduction and\n  Scalability: How Many Biocomputing Gates Can Be Interconnected in a Circuit?", "comments": null, "journal-ref": "J. Phys. Chem. B 112, 11777-11784 (2008)", "doi": "10.1021/jp802673q", "report-no": null, "categories": "q-bio.MN cond-mat.other cond-mat.soft cs.CC q-bio.BM q-bio.OT q-bio.QM quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report an experimental evaluation of the \"input-output surface\" for a\nbiochemical AND gate. The obtained data are modeled within the rate-equation\napproach, with the aim to map out the gate function and cast it in the language\nof logic variables appropriate for analysis of Boolean logic for scalability.\nIn order to minimize \"analog\" noise, we consider a theoretical approach for\ndetermining an optimal set for the process parameters to minimize \"analog\"\nnoise amplification for gate concatenation. We establish that under optimized\nconditions, presently studied biochemical gates can be concatenated for up to\norder 10 processing steps. Beyond that, new paradigms for avoiding noise\nbuild-up will have to be developed. We offer a general discussion of the ideas\nand possible future challenges for both experimental and theoretical research\nfor advancing scalable biochemical computing.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2008 19:52:30 GMT"}, {"version": "v2", "created": "Sat, 13 Sep 2008 16:34:17 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Privman", "V.", ""], ["Strack", "G.", ""], ["Solenov", "D.", ""], ["Pita", "M.", ""], ["Katz", "E.", ""]]}, {"id": "0803.4206", "submitter": "Troy Lee", "authors": "Troy Lee, Rajat Mittal", "title": "Product theorems via semidefinite programming", "comments": "Typos corrected, some points clarified", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tendency of semidefinite programs to compose perfectly under product has\nbeen exploited many times in complexity theory: for example, by Lovasz to\ndetermine the Shannon capacity of the pentagon; to show a direct sum theorem\nfor non-deterministic communication complexity and direct product theorems for\ndiscrepancy; and in interactive proof systems to show parallel repetition\ntheorems for restricted classes of games.\n  Despite all these examples of product theorems--some going back nearly thirty\nyears--it was only recently that Mittal and Szegedy began to develop a general\ntheory to explain when and why semidefinite programs behave perfectly under\nproduct. This theory captured many examples in the literature, but there were\nalso some notable exceptions which it could not explain--namely, an early\nparallel repetition result of Feige and Lovasz, and a direct product theorem\nfor the discrepancy method of communication complexity by Lee, Shraibman, and\nSpalek.\n  We extend the theory of Mittal and Szegedy to explain these cases as well.\nIndeed, to the best of our knowledge, our theory captures all examples of\nsemidefinite product theorems in the literature.\n", "versions": [{"version": "v1", "created": "Fri, 28 Mar 2008 20:27:47 GMT"}, {"version": "v2", "created": "Thu, 1 May 2008 20:12:53 GMT"}], "update_date": "2008-05-01", "authors_parsed": [["Lee", "Troy", ""], ["Mittal", "Rajat", ""]]}, {"id": "0803.4253", "submitter": "Jean-Marie Chauvet", "authors": "Jean-Marie Chauvet", "title": "Combinatorial Explorations in Su-Doku", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Su-Doku, a popular combinatorial puzzle, provides an excellent testbench for\nheuristic explorations. Several interesting questions arise from its\ndeceptively simple set of rules. How many distinct Su-Doku grids are there? How\nto find a solution to a Su-Doku puzzle? Is there a unique solution to a given\nSu-Doku puzzle? What is a good estimation of a puzzle's difficulty? What is the\nminimum puzzle size (the number of \"givens\")?\n  This paper explores how these questions are related to the well-known\nalldifferent constraint which emerges in a wide variety of Constraint\nSatisfaction Problems (CSP) and compares various algorithmic approaches based\non different formulations of Su-Doku.\n", "versions": [{"version": "v1", "created": "Sat, 29 Mar 2008 10:07:42 GMT"}], "update_date": "2008-04-01", "authors_parsed": [["Chauvet", "Jean-Marie", ""]]}, {"id": "0803.4260", "submitter": "Xin Han", "authors": "Xin Han, Kazuo Iwama, Guochuan Zhang", "title": "On Two Dimensional Orthogonal Knapsack Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the following knapsack problem: Given a list of\nsquares with profits, we are requested to pack a sublist of them into a\nrectangular bin (not a unit square bin) to make profits in the bin as large as\npossible. We first observe there is a Polynomial Time Approximation Scheme\n(PTAS) for the problem of packing weighted squares into rectangular bins with\nlarge resources, then apply the PTAS to the problem of packing squares with\nprofits into a rectangular bin and get a $\\frac65+\\epsilon$ approximation\nalgorithm.\n", "versions": [{"version": "v1", "created": "Sat, 29 Mar 2008 11:15:11 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Han", "Xin", ""], ["Iwama", "Kazuo", ""], ["Zhang", "Guochuan", ""]]}, {"id": "0803.4261", "submitter": "Mari\\'an Dvorsk\\'y", "authors": "Mari\\'an Dvorsk\\'y", "title": "Common Permutation Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show that the following problem is NP-complete: Given an\nalphabet $\\Sigma$ and two strings over $\\Sigma$, the question is whether there\nexists a permutation of $\\Sigma$ which is a subsequence of both of the given\nstrings.\n", "versions": [{"version": "v1", "created": "Sat, 29 Mar 2008 11:32:29 GMT"}], "update_date": "2008-04-01", "authors_parsed": [["Dvorský", "Marián", ""]]}, {"id": "0803.4373", "submitter": "Yeong-Cherng Liang", "authors": "Andrew C. Doherty (University of Queensland), Yeong-Cherng Liang\n  (University of Queensland), Ben Toner (CWI), Stephanie Wehner (Caltech)", "title": "The quantum moment problem and bounds on entangled multi-prover games", "comments": "33 pages, To appear at CCC'08", "journal-ref": "Proceedings of IEEE Conference on Computational Complexity 2008,\n  pages 199--210", "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the quantum moment problem: Given a conditional probability\ndistribution together with some polynomial constraints, does there exist a\nquantum state rho and a collection of measurement operators such that (i) the\nprobability of obtaining a particular outcome when a particular measurement is\nperformed on rho is specified by the conditional probability distribution, and\n(ii) the measurement operators satisfy the constraints. For example, the\nconstraints might specify that some measurement operators must commute.\n  We show that if an instance of the quantum moment problem is unsatisfiable,\nthen there exists a certificate of a particular form proving this. Our proof is\nbased on a recent result in algebraic geometry, the noncommutative\nPositivstellensatz of Helton and McCullough [Trans. Amer. Math. Soc.,\n356(9):3721, 2004].\n  A special case of the quantum moment problem is to compute the value of\none-round multi-prover games with entangled provers. Under the conjecture that\nthe provers need only share states in finite-dimensional Hilbert spaces, we\nprove that a hierarchy of semidefinite programs similar to the one given by\nNavascues, Pironio and Acin [Phys. Rev. Lett., 98:010401, 2007] converges to\nthe entangled value of the game. It follows that the class of languages\nrecognized by a multi-prover interactive proof system where the provers share\nentanglement is recursive.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2008 18:39:29 GMT"}], "update_date": "2009-01-20", "authors_parsed": [["Doherty", "Andrew C.", "", "University of Queensland"], ["Liang", "Yeong-Cherng", "", "University of Queensland"], ["Toner", "Ben", "", "CWI"], ["Wehner", "Stephanie", "", "Caltech"]]}, {"id": "0803.4516", "submitter": "Robert Spalek", "authors": "Robert Spalek (Google)", "title": "A Dual Polynomial for OR", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We reprove that the approximate degree of the OR function on n bits is\nOmega(sqrt(n)). We consider a linear program which is feasible if and only if\nthere is an approximate polynomial for a given function, and apply the duality\ntheory. The duality theory says that the primal program has no solution if and\nonly if its dual has a solution. Therefore one can prove the nonexistence of an\napproximate polynomial by exhibiting a dual solution, coined the dual\npolynomial. We construct such a polynomial.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2008 18:20:53 GMT"}], "update_date": "2008-04-01", "authors_parsed": [["Spalek", "Robert", "", "Google"]]}]