[{"id": "1103.0086", "submitter": "Xin Liu", "authors": "Xin Liu and Gilles Tredan and Anwitaman Datta", "title": "A generic trust framework for large-scale open systems using machine\n  learning", "comments": "30 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many large scale distributed systems and on the web, agents need to\ninteract with other unknown agents to carry out some tasks or transactions. The\nability to reason about and assess the potential risks in carrying out such\ntransactions is essential for providing a safe and reliable environment. A\ntraditional approach to reason about the trustworthiness of a transaction is to\ndetermine the trustworthiness of the specific agent involved, derived from the\nhistory of its behavior. As a departure from such traditional trust models, we\npropose a generic, machine learning approach based trust framework where an\nagent uses its own previous transactions (with other agents) to build a\nknowledge base, and utilize this to assess the trustworthiness of a transaction\nbased on associated features, which are capable of distinguishing successful\ntransactions from unsuccessful ones. These features are harnessed using\nappropriate machine learning algorithms to extract relationships between the\npotential transaction and previous transactions. The trace driven experiments\nusing real auction dataset show that this approach provides good accuracy and\nis highly efficient compared to other trust mechanisms, especially when\nhistorical information of the specific agent is rare, incomplete or inaccurate.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 06:03:15 GMT"}], "update_date": "2011-03-02", "authors_parsed": [["Liu", "Xin", ""], ["Tredan", "Gilles", ""], ["Datta", "Anwitaman", ""]]}, {"id": "1103.0220", "submitter": "Tigran Avanesov", "authors": "Tigran Avanesov, Yannick Chevalier, Micha\\\"el Rusinowitch and Mathieu\n  Turuani", "title": "Satisfiability of General Intruder Constraints with and without a Set\n  Constructor", "comments": "Submitted to the Special issue of Information and Computation on\n  Security and Rewriting Techniques (SecReT), 2011. 59 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many decision problems on security protocols can be reduced to solving\nso-called intruder constraints in Dolev Yao model. Most constraint solving\nprocedures for protocol security rely on two properties of constraint systems\ncalled monotonicity and variable origination. In this work we relax these\nrestrictions by giving a decision procedure for solving general intruder\nconstraints (that do not have these properties) that stays in NP. Our result\nextends a first work by L. Mazar\\'e in several directions: we allow non-atomic\nkeys, and an associative, commutative and idempotent symbol (for modeling\nsets). We also discuss several new applications of the results.\n", "versions": [{"version": "v1", "created": "Tue, 1 Mar 2011 17:00:28 GMT"}], "update_date": "2011-03-02", "authors_parsed": [["Avanesov", "Tigran", ""], ["Chevalier", "Yannick", ""], ["Rusinowitch", "Michaël", ""], ["Turuani", "Mathieu", ""]]}, {"id": "1103.0405", "submitter": "Tolga Mataracioglu", "authors": "Tolga Mataracioglu, Sevgi Ozkan", "title": "Analysis of the User Acceptance for Implementing ISO/IEC 27001:2005 in\n  Turkish Public Organizations", "comments": "12 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study aims to develop a model for the user acceptance for implementing\nthe information security standard (i.e. ISO 27001) in Turkish public\norganizations. The results of the surveys performed in Turkey reveal that the\nlegislation on information security public which organizations have to obey is\nsignificantly related with the user acceptance during ISO 27001 implementation\nprocess. The fundamental components of our user acceptance model are perceived\nusefulness, attitude towards use, social norms, and performance expectancy.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 12:10:26 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Mataracioglu", "Tolga", ""], ["Ozkan", "Sevgi", ""]]}, {"id": "1103.0464", "submitter": "Zuhal Tanrikulu", "authors": "Berker Tasoluk, Zuhal Tanrikulu", "title": "A Weakest Chain Approach to Assessing the Overall Effectiveness of the\n  802.11 Wireless Network Security", "comments": "8 pages, 3 tables", "journal-ref": "International Journal of Wireless & Mobile Networks (IJWMN) Vol.\n  3, No. 1, February 2011 ISSN:0975-3834 (Online); 0975-4679 (Print)", "doi": "10.5121/ijwmn.2011.3101", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study aims to assess wireless network security holistically and attempts\nto determine the weakest link among the parts that comprise the 'secure' aspect\nof the wireless networks: security protocols, wireless technologies and user\nhabits. The assessment of security protocols is done by determining the time\ntaken to break a specific protocol's encryption key, or to pass an access\ncontrol by using brute force attack techniques. Passphrase strengths as well as\nencryption key strengths ranging from 40 to 256 bits are evaluated. Different\nscenarios are planned and created for passphrase generation, using different\ncharacter sets and different number of characters. Then each scenario is\nevaluated based on the time taken to break that passphrase. At the end of the\nstudy, it is determined that the choice of the passphrase is the weakest part\nof the entire 802.11 wireless security system.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2011 15:57:41 GMT"}], "update_date": "2011-03-03", "authors_parsed": [["Tasoluk", "Berker", ""], ["Tanrikulu", "Zuhal", ""]]}, {"id": "1103.0829", "submitter": "Rajesh Kumar  Tiwari Dr.", "authors": "G. Sahoo and Rajesh Kumar Tiwari", "title": "Hiding Secret Information in Movie Clip: A Steganographic Approach", "comments": "Steganography, Frame, Stego-Frame, Stego-key, and Carrier", "journal-ref": "International Journal of Computing and Applications, Vol. 4, No.\n  1, June 2009, pp. 87-94", "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Establishing hidden communication is an important subject of discussion that\nhas gained increasing importance nowadays with the development of the internet.\nOne of the key methods for establishing hidden communication is steganography.\nModern day steganography mainly deals with hiding information within files like\nimage, text, html, binary files etc. These file contains small irrelevant\ninformation that can be substituted for small secret data. To store a high\ncapacity secret data these carrier files are not very supportive. To overcome\nthe problem of storing the high capacity secret data with the utmost security\nfence, we have proposed a novel methodology for concealing a voluminous data\nwith high levels of security wall by using movie clip as a carrier file.\n", "versions": [{"version": "v1", "created": "Fri, 4 Mar 2011 05:38:59 GMT"}], "update_date": "2011-03-07", "authors_parsed": [["Sahoo", "G.", ""], ["Tiwari", "Rajesh Kumar", ""]]}, {"id": "1103.1360", "submitter": "Sumanta Chaudhuri Dr.", "authors": "Sumanta Chaudhuri, Sylvain Guilley, Philippe Hoogvorst, Jean-Luc\n  Danger, Taha Beyrouthy, Alin Razafindraibe, Laurent Fesquet, Marc Renaudin", "title": "A Secure Asynchronous FPGA Architecture, Experimental Results and Some\n  Debug Feedback", "comments": "18 Pages, 23 figures. In detail description of a 3X3 Aysnchronous\n  FPGA Tape-Out", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents an asynchronous FPGA architecture for implementing\ncryptographic algorithms secured against physical cryptanalysis. We discuss the\nsuitability of asynchronous reconfigurable architectures for such applications\nbefore proceeding to model the side channel and defining our objectives. The\nlogic block architecture is presented in detail. We discuss several solutions\nfor the interconnect architecture, and how these solutions can be ported to\nother flavours of interconnect (i.e. single driver). Next We discuss in detail\na high speed asynchronous configuration chain architecture used to configure\nour asynchronous FPGA with simulation results, and we present a 3 X 3 prototype\nFPGA fabricated in 65 nm CMOS. Lastly we present experiments to test the high\nspeed asynchronous configuration chain and evaluate how far our objectives have\nbeen achieved with proposed solutions, and we conclude with emphasis on\ncomplementary FPGA CAD algorithms, and the effect of CMOS variation on\nSide-Channel Vulnerability.\n", "versions": [{"version": "v1", "created": "Mon, 7 Mar 2011 20:04:05 GMT"}, {"version": "v2", "created": "Tue, 8 Mar 2011 12:13:20 GMT"}], "update_date": "2011-03-09", "authors_parsed": [["Chaudhuri", "Sumanta", ""], ["Guilley", "Sylvain", ""], ["Hoogvorst", "Philippe", ""], ["Danger", "Jean-Luc", ""], ["Beyrouthy", "Taha", ""], ["Razafindraibe", "Alin", ""], ["Fesquet", "Laurent", ""], ["Renaudin", "Marc", ""]]}, {"id": "1103.1432", "submitter": "Abdelaziz Marjane", "authors": "Abdelaziz Marjane, Abdellah Mokrane, Boufeldja Allailou", "title": "Vectorial Feedback with Carry Registers and Memory requirements", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In \\cite{marjane2010}, we have introduced vectorial conception of FCSR's in\nFibonacci mode. This conception allows us to easily analyze FCSR's over binary\nfinite fields $\\mathbb{F}_{2^{n}}$ for $n\\geq 2$. In \\cite{allailou2010}, we\ndescribe and study the corresponding Galois mode and use it to design a new\nstream cipher. In this paper, we introduce the Ring mode for vectorial FCSR,\nexplain the analysis of such Feedback registers and illustrate with a simple\nexample.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 04:24:31 GMT"}, {"version": "v2", "created": "Tue, 13 Sep 2011 19:52:40 GMT"}], "update_date": "2011-09-14", "authors_parsed": [["Marjane", "Abdelaziz", ""], ["Mokrane", "Abdellah", ""], ["Allailou", "Boufeldja", ""]]}, {"id": "1103.1552", "submitter": "Ranjan Pal", "authors": "Ranjan Pal, Leana Golubchik", "title": "Pricing and Investments in Internet Security: A Cyber-Insurance\n  Perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet users such as individuals and organizations are subject to different\ntypes of epidemic risks such as worms, viruses, spams, and botnets. To reduce\nthe probability of risk, an Internet user generally invests in traditional\nsecurity mechanisms like anti-virus and anti-spam software, sometimes also\nknown as self-defense mechanisms. However, such software does not completely\neliminate risk. Recent works have considered the problem of residual risk\nelimination by proposing the idea of cyber-insurance. In this regard, an\nimportant research problem is the analysis of optimal user self-defense\ninvestments and cyber-insurance contracts under the Internet environment. In\nthis paper, we investigate two problems and their relationship: 1) analyzing\noptimal self-defense investments in the Internet, under optimal cyber-insurance\ncoverage, where optimality is an insurer objective and 2) designing optimal\ncyber-insurance contracts for Internet users, where a contract is a (premium,\ncoverage) pair.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 15:05:35 GMT"}], "update_date": "2011-03-09", "authors_parsed": [["Pal", "Ranjan", ""], ["Golubchik", "Leana", ""]]}, {"id": "1103.1730", "submitter": "Angsuman Das", "authors": "Angsuman Das and Avishek Adhikari", "title": "An efficient multi-use multi-secret sharing scheme based on hash\n  function", "comments": null, "journal-ref": "Applied Mathematics Letters, 23 (2010)", "doi": "10.1016/j.aml.2010.04.024", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a renewable, multi-use, multi-secret sharing scheme for\ngeneral access structure based on one-way collision resistant hash function is\npresented in which each participant has to carry only one share. By applying\ncollision-resistant one-way hash function, the proposed scheme is secure\nagainst conspiracy attacks even if the pseudo-secret shares are compromised.\nMoreover, high complexity operations like modular multiplication,\nexponentiation and inversion are avoided to increase its efficiency. Finally,\nin the proposed scheme, both the combiner and the participants can verify the\ncorrectness of the information exchanged among themselves.\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2011 08:17:07 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Das", "Angsuman", ""], ["Adhikari", "Avishek", ""]]}, {"id": "1103.1823", "submitter": "Laurent Poinsot", "authors": "Laurent Poinsot (LIPN), Alexander Pott (IAG)", "title": "Non-Boolean almost perfect nonlinear functions on non-Abelian groups", "comments": "17 pages", "journal-ref": "International Journal of Foundations of Computer Science 22, 6\n  (2011) 1351-1367", "doi": "10.1142/S0129054111008751", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to present the extended definitions and\ncharacterizations of the classical notions of APN and maximum nonlinear Boolean\nfunctions to deal with the case of mappings from a finite group K to another\none N with the possibility that one or both groups are non-Abelian.\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2011 16:18:15 GMT"}], "update_date": "2011-09-26", "authors_parsed": [["Poinsot", "Laurent", "", "LIPN"], ["Pott", "Alexander", "", "IAG"]]}, {"id": "1103.1824", "submitter": "Sumanta Chaudhuri Dr.", "authors": "Sumanta Chaudhuri and Sylvain Guilley", "title": "Side-Channel Oscilloscope", "comments": "2 pages, 1 figure. a brief outline paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Side-Channel Analysis used for codebreaking could be used constructively as a\nprobing tool for internal gates in integrated circuits. This paper outlines\nbasic methods and mathematics for that purpose\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 12:25:20 GMT"}], "update_date": "2011-03-28", "authors_parsed": [["Chaudhuri", "Sumanta", ""], ["Guilley", "Sylvain", ""]]}, {"id": "1103.2071", "submitter": "Lei Jiang", "authors": "Jiang Lei, Zhu Han, M. A. V\\'azquez-Castro and Are Hj{\\o}rungnes", "title": "Secure Satellite Communication Systems Design with Individual Secrecy\n  Rate Constraints", "comments": "34 pages, 10 figures, 1 table, submitted to \"Transactions on\n  Information Forensics and Security\"", "journal-ref": null, "doi": "10.1109/TIFS.2011.2148716", "report-no": null, "categories": "cs.IT cs.CR cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study multibeam satellite secure communication through\nphysical (PHY) layer security techniques, i.e., joint power control and\nbeamforming. By first assuming that the Channel State Information (CSI) is\navailable and the beamforming weights are fixed, a novel secure satellite\nsystem design is investigated to minimize the transmit power with individual\nsecrecy rate constraints. An iterative algorithm is proposed to obtain an\noptimized power allocation strategy. Moreover, sub-optimal beamforming weights\nare obtained by completely eliminating the co-channel interference and nulling\nthe eavesdroppers' signal simultaneously. In order to obtain jointly optimized\npower allocation and beamforming strategy in some practical cases, e.g., with\ncertain estimation errors of the CSI, we further evaluate the impact of the\neavesdropper's CSI on the secure multibeam satellite system design. The\nconvergence of the iterative algorithm is proven under justifiable assumptions.\nThe performance is evaluated by taking into account the impact of the number of\nantenna elements, number of beams, individual secrecy rate requirement, and\nCSI. The proposed novel secure multibeam satellite system design can achieve\noptimized power allocation to ensure the minimum individual secrecy rate\nrequirement. The results show that the joint beamforming scheme is more\nfavorable than fixed beamforming scheme, especially in the cases of a larger\nnumber of satellite antenna elements and higher secrecy rate requirement.\nFinally, we compare the results under the current satellite air-interface in\nDVB-S2 and the results under Gaussian inputs.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 16:25:07 GMT"}, {"version": "v2", "created": "Fri, 11 Mar 2011 08:46:12 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Lei", "Jiang", ""], ["Han", "Zhu", ""], ["Vázquez-Castro", "M. A.", ""], ["Hjørungnes", "Are", ""]]}, {"id": "1103.2215", "submitter": "Xin Liu", "authors": "Xin Liu and Anwitaman Datta and Krzysztof Rzadca", "title": "Trust beyond reputation: A computational trust model based on\n  stereotypes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Models of computational trust support users in taking decisions. They are\ncommonly used to guide users' judgements in online auction sites; or to\ndetermine quality of contributions in Web 2.0 sites. However, most existing\nsystems require historical information about the past behavior of the specific\nagent being judged. In contrast, in real life, to anticipate and to predict a\nstranger's actions in absence of the knowledge of such behavioral history, we\noften use our \"instinct\"- essentially stereotypes developed from our past\ninteractions with other \"similar\" persons. In this paper, we propose\nStereoTrust, a computational trust model inspired by stereotypes as used in\nreal-life. A stereotype contains certain features of agents and an expected\noutcome of the transaction. When facing a stranger, an agent derives its trust\nby aggregating stereotypes matching the stranger's profile. Since stereotypes\nare formed locally, recommendations stem from the trustor's own personal\nexperiences and perspective. Historical behavioral information, when available,\ncan be used to refine the analysis. According to our experiments using\nEpinions.com dataset, StereoTrust compares favorably with existing trust models\nthat use different kinds of information and more complete historical\ninformation.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2011 08:15:07 GMT"}, {"version": "v2", "created": "Thu, 5 May 2011 03:50:46 GMT"}, {"version": "v3", "created": "Sun, 15 Jul 2012 14:07:02 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Liu", "Xin", ""], ["Datta", "Anwitaman", ""], ["Rzadca", "Krzysztof", ""]]}, {"id": "1103.2544", "submitter": "Tarik Kaced", "authors": "Tarik Kaced", "title": "Almost-perfect secret sharing", "comments": "Acknowledgments added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Splitting a secret s between several participants, we generate (for each\nvalue of s) shares for all participants. The goal: authorized groups of\nparticipants should be able to reconstruct the secret but forbidden ones get no\ninformation about it. In this paper we introduce several notions of non-\nperfect secret sharing, where some small information leak is permitted. We\nstudy its relation to the Kolmogorov complexity version of secret sharing\n(establishing some connection in both directions) and the effects of changing\nthe secret size (showing that we can decrease the size of the secret and the\ninformation leak at the same time).\n", "versions": [{"version": "v1", "created": "Sun, 13 Mar 2011 19:07:37 GMT"}, {"version": "v2", "created": "Sat, 2 Jul 2011 17:13:49 GMT"}, {"version": "v3", "created": "Thu, 17 Nov 2011 13:00:33 GMT"}], "update_date": "2011-11-18", "authors_parsed": [["Kaced", "Tarik", ""]]}, {"id": "1103.2626", "submitter": "Kobbi Nissim", "authors": "Amos Beimel, Kobbi Nissim, Eran Omri", "title": "Distributed Private Data Analysis: On Simultaneously Solving How and\n  What", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the combination of two directions in the field of privacy\nconcerning computations over distributed private inputs - secure function\nevaluation (SFE) and differential privacy. While in both the goal is to\nprivately evaluate some function of the individual inputs, the privacy\nrequirements are significantly different. The general feasibility results for\nSFE suggest a natural paradigm for implementing differentially private analyses\ndistributively: First choose what to compute, i.e., a differentially private\nanalysis; Then decide how to compute it, i.e., construct an SFE protocol for\nthis analysis.\n  We initiate an examination whether there are advantages to a paradigm where\nboth decisions are made simultaneously. In particular, we investigate under\nwhich accuracy requirements it is beneficial to adapt this paradigm for\ncomputing a collection of functions including binary sum, gap threshold, and\napproximate median queries. Our results imply that when computing the binary\nsum of $n$ distributed inputs then:\n  * When we require that the error is $o(\\sqrt{n})$ and the number of rounds is\nconstant, there is no benefit in the new paradigm.\n  * When we allow an error of $O(\\sqrt{n})$, the new paradigm yields more\nefficient protocols when we consider protocols that compute symmetric\nfunctions.\n  Our results also yield new separations between the local and global models of\ncomputations for private data analysis.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2011 11:04:45 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Beimel", "Amos", ""], ["Nissim", "Kobbi", ""], ["Omri", "Eran", ""]]}, {"id": "1103.3113", "submitter": "Xiaojun Tang", "authors": "Xiaojun Tang, Ruoheng Liu, Predrag Spasojevic, H. Vincent Poor", "title": "A Broadcast Approach To Secret Key Generation Over Slow Fading Channels", "comments": "submitted to IEEE Trans. Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A secret-key generation scheme based on a layered broadcasting strategy is\nintroduced for slow-fading channels. In the model considered, Alice wants to\nshare a key with Bob while keeping the key secret from Eve, who is a passive\neavesdropper. Both Alice-Bob and Alice-Eve channels are assumed to undergo slow\nfading, and perfect channel state information (CSI) is assumed to be known only\nat the receivers during the transmission. In each fading slot, Alice broadcasts\na continuum of coded layers and, hence, allows Bob to decode at the rate\ncorresponding to the fading state (unknown to Alice). The index of a reliably\ndecoded layer is sent back from Bob to Alice via a public and error-free\nchannel and used to generate a common secret key. In this paper, the achievable\nsecrecy key rate is first derived for a given power distribution over coded\nlayers. The optimal power distribution is then characterized. It is shown that\nlayered broadcast coding can increase the secrecy key rate significantly\ncompared to single-level coding.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 07:03:51 GMT"}], "update_date": "2011-03-17", "authors_parsed": [["Tang", "Xiaojun", ""], ["Liu", "Ruoheng", ""], ["Spasojevic", "Predrag", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1103.3159", "submitter": "Ashok Das Dr.", "authors": "Ashok Kumar Das", "title": "Cryptanalysis And Further Improvement Of A Biometric-Based Remote User\n  Authentication Scheme Using Smart Cards", "comments": "16 pages", "journal-ref": "International Journal of Network Security & Its Applications\n  (IJNSA), Vol. 3, No. 2, 2011", "doi": "10.5121/ijnsa.2011.3202", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, Li et al. proposed a secure biometric-based remote user\nauthentication scheme using smart cards to withstand the security flaws of\nLi-Hwang's efficient biometric-based remote user authentication scheme using\nsmart cards. Li et al.'s scheme is based on biometrics verification, smart card\nand one-way hash function, and it also uses the random nonce rather than a\nsynchronized clock, and thus it is efficient in computational cost and more\nsecure than Li-Hwang's scheme. Unfortunately, in this paper we show that Li et\nal.'s scheme still has some security weaknesses in their design. In order to\nwithstand those weaknesses in their scheme, we further propose an improvement\nof their scheme so that the improved scheme always provides proper\nauthentication and as a result, it establishes a session key between the user\nand the server at the end of successful user authentication.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 12:37:43 GMT"}], "update_date": "2011-03-17", "authors_parsed": [["Das", "Ashok Kumar", ""]]}, {"id": "1103.3296", "submitter": "Paulo Barreto", "authors": "Paulo S. L. M. Barreto and Rafael Misoczki and Richard Lindner", "title": "Decoding square-free Goppa codes over $\\F_p$", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new, efficient non-deterministic decoding algorithm for\nsquare-free Goppa codes over $\\F_p$ for any prime $p$. If the code in question\nhas degree $t$ and the average distance to the closest codeword is at least\n$(4/p)t + 1$, the proposed decoder can uniquely correct up to $(2/p)t$ errors\nwith high probability. The correction capability is higher if the distribution\nof error magnitudes is not uniform, approaching or reaching $t$ errors when any\nparticular error value occurs much more often than others or exclusively. This\nmakes the method interesting for (semantically secure) cryptosystems based on\nthe decoding problem for permuted and punctured Goppa codes.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 21:02:53 GMT"}, {"version": "v2", "created": "Tue, 18 Dec 2012 12:06:10 GMT"}], "update_date": "2012-12-19", "authors_parsed": [["Barreto", "Paulo S. L. M.", ""], ["Misoczki", "Rafael", ""], ["Lindner", "Richard", ""]]}, {"id": "1103.3308", "submitter": "Mana Mohammed", "authors": "Mohammed Mana, Mohammed Feham, and Boucif Amar Bensaber", "title": "A Light Weight Protocol to Provide Location Privacy in Wireless Body\n  Area networks", "comments": "11 pages", "journal-ref": "International Journal of Network Security & Its Applications\n  (IJNSA), Vol.3, No.2, March 2011", "doi": "10.5121/ijnsa.2011.3201", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Location privacy is one of the major security problems in a Wireless Body\nArea Networks (WBANs). An eavesdropper can keep track of the place and time\ndevices are communicating. To make things even worse, the attacker does not\nhave to be physically close to the communicating devices, he can use a device\nwith a stronger antenna. The unique hardware address of a mobile device can\noften be linked to the identity of the user operating the device. This\nrepresents a violation of the user's privacy. The user should decide when\nhis/her location is revealed and when not. In this paper, we first categorize\nthe type of eavesdroppers for WBANs, and then we propose a new scheme to\nprovide the location privacy in Wireless Body Area Networks (WBANs).\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 22:10:18 GMT"}], "update_date": "2011-03-18", "authors_parsed": [["Mana", "Mohammed", ""], ["Feham", "Mohammed", ""], ["Bensaber", "Boucif Amar", ""]]}, {"id": "1103.3332", "submitter": "Raju Singh Mr", "authors": "Raju Singh, A.K. Vatsa", "title": "Confidentiality & Authentication Mechanism for Biometric Information\n  Transmitted over Low Bandwidth & Unreliable channel", "comments": "9 Pages,2 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The security of bio-metric information - finger print, retina mapping, DNA\nmapping and some other chemical and biological modified genes related\ninformation - transfer through low bandwidth and unreliable or covert channel\nis challenging task. Therefore, Security of biometric information is essential\nrequirement in this fast developing communication world. Thus, in this paper,\nwe propose efficient and effective mechanism for confidentiality and\nauthentication for biometric information transmitted by using arithmetic\nencoding representation over low bandwidth and unreliable channel. It enhances\nthe speed of encryption, decryption and authentication process. It uses\narithmetic encoding scheme and public key cryptography e.g. modified version of\nRSA algorithm called RSA-2 algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 17 Mar 2011 04:03:44 GMT"}], "update_date": "2011-03-18", "authors_parsed": [["Singh", "Raju", ""], ["Vatsa", "A. K.", ""]]}, {"id": "1103.3333", "submitter": "Jaydip Sen", "authors": "Jaydip Sen", "title": "A Robust Mechanism for Defending Distributed Denial OF Service Attacks\n  on Web Servers", "comments": "18 pages, 3 figures, 5 tables", "journal-ref": "International Journal of Network Security & Its Applications\n  (IJNSA), Vol.3, No.2, pp. 162 - 179, March 2011", "doi": "10.5121/ijnsa.2011.3213", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed Denial of Service (DDoS) attacks have emerged as a popular means\nof causing mass targeted service disruptions, often for extended periods of\ntime. The relative ease and low costs of launching such attacks, supplemented\nby the current inadequate sate of any viable defense mechanism, have made them\none of the top threats to the Internet community today. Since the increasing\npopularity of web-based applications has led to several critical services being\nprovided over the Internet, it is imperative to monitor the network traffic so\nas to prevent malicious attackers from depleting the resources of the network\nand denying services to legitimate users. This paper first presents a brief\ndiscussion on some of the important types of DDoS attacks that currently exist\nand some existing mechanisms to combat these attacks. It then points out the\nmajor drawbacks of the currently existing defense mechanisms and proposes a new\nmechanism for protecting a web-server against a DDoS attack. In the proposed\nmechanism, incoming traffic to the server is continuously monitored and any\nabnormal rise in the inbound traffic is immediately detected. The detection\nalgorithm is based on a statistical analysis of the inbound traffic on the\nserver and a robust hypothesis testing framework. Simulations carried out on\nthe proposed mechanism have produced results that demonstrate effectiveness of\nthe proposed defense mechanism against DDoS attacks.\n", "versions": [{"version": "v1", "created": "Thu, 17 Mar 2011 04:28:10 GMT"}], "update_date": "2011-03-18", "authors_parsed": [["Sen", "Jaydip", ""]]}, {"id": "1103.3378", "submitter": "Manjula V", "authors": "V.Manjula, Dr.C.Chellappan", "title": "Replication Attack Mitigations for Static and Mobile WSN", "comments": "12 pages", "journal-ref": "International Journal of Network Security & Its Applications (\n  IJNSA ),March 2011, Volume 3. Number 2", "doi": "10.5121/ijnsa.2011.3210", "report-no": null, "categories": "cs.CR cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security is important for many sensor network applications. Wireless Sensor\nNetworks (WSN) are often deployed in hostile environments as static or mobile,\nwhere an adversary can physically capture some of the nodes. once a node is\ncaptured, adversary collects all the credentials like keys and identity etc.\nthe attacker can re-program it and replicate the node in order to eavesdrop the\ntransmitted messages or compromise the functionality of the network. Identity\ntheft leads to two types attack: clone and sybil. In particularly a harmful\nattack against sensor networks where one or more node(s) illegitimately claims\nan identity as replicas is known as the node replication attack. The\nreplication attack can be exceedingly injurious to many important functions of\nthe sensor network such as routing, resource allocation, misbehavior detection,\netc. This paper analyzes the threat posed by the replication attack and several\nnovel techniques to detect and defend against the replication attack, and\nanalyzes their effectiveness in both static and mobile WSN.\n", "versions": [{"version": "v1", "created": "Thu, 17 Mar 2011 10:57:01 GMT"}], "update_date": "2011-03-21", "authors_parsed": [["Manjula", "V.", ""], ["Chellappan", "Dr. C.", ""]]}, {"id": "1103.3381", "submitter": "Robert Granger", "authors": "Omran Ahmadi, Robert Granger", "title": "On isogeny classes of Edwards curves over finite fields", "comments": "27 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We count the number of isogeny classes of Edwards curves over finite fields,\nanswering a question recently posed by Rezaeian and Shparlinski. We also show\nthat each isogeny class contains a {\\em complete} Edwards curve, and that an\nEdwards curve is isogenous to an {\\em original} Edwards curve over $\\F_q$ if\nand only if its group order is divisible by 8 if $q \\equiv -1 \\pmod{4}$, and 16\nif $q \\equiv 1 \\pmod{4}$. Furthermore, we give formulae for the proportion of\n$d \\in \\F_q \\setminus \\{0,1\\}$ for which the Edwards curve $E_d$ is complete or\noriginal, relative to the total number of $d$ in each isogeny class.\n", "versions": [{"version": "v1", "created": "Thu, 17 Mar 2011 11:15:55 GMT"}], "update_date": "2011-03-18", "authors_parsed": [["Ahmadi", "Omran", ""], ["Granger", "Robert", ""]]}, {"id": "1103.3746", "submitter": "Paul Cuff", "authors": "Paul Cuff", "title": "Using a Secret Key to Foil an Eavesdropper", "comments": "Allerton 2010, 6 pages, 1 figure, uses IEEEtran.cls", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work addresses private communication with distributed systems in mind.\nWe consider how to best use secret key resources and communication to transmit\nsignals across a system so that an eavesdropper is least capable to act on the\nsignals. One of the key assumptions is that the private signals are publicly\navailable with a delay---in this case a delay of one. We find that even if the\nsource signal (information source) is memoryless, the design and performance of\nthe optimal system has a strong dependence on which signals are assumed to be\navailable to the eavesdropper with delay.\n  Specifically, we consider a distributed system with two components where\ninformation is known to only one component and communication resources are\nlimited. Instead of measuring secrecy by \"equivocation,\" we define a value\nfunction for the system, based on the actions of the system and the adversary,\nand characterize the optimal performance of the system, as measured by the\naverage value obtained against the worst adversary. The resulting optimal\nrate-payoff region is expressed with information theoretic inequalities, and\nthe optimal communication methods are not standard source coding techniques but\ninstead are methods that stem from synthesizing a memoryless channel.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2011 03:52:13 GMT"}, {"version": "v2", "created": "Fri, 1 Apr 2011 03:56:20 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Cuff", "Paul", ""]]}, {"id": "1103.3792", "submitter": "Sathishkumar G.A", "authors": "G.A.Sathishkumar, Dr.K.Bhoopathy bagan and Dr.N.Sriraam", "title": "Image Encryption Based on Diffusion and Multiple Chaotic Maps", "comments": "14 pages,9 figures and 5 tables;\n  http://airccse.org/journal/jnsa11_current.html, 2011", "journal-ref": null, "doi": "10.5121/ijnsa.2011.3214", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the recent world, security is a prime important issue, and encryption is\none of the best alternative way to ensure security. More over, there are many\nimage encryption schemes have been proposed, each one of them has its own\nstrength and weakness. This paper presents a new algorithm for the image\nencryption/decryption scheme. This paper is devoted to provide a secured image\nencryption technique using multiple chaotic based circular mapping. In this\npaper, first, a pair of sub keys is given by using chaotic logistic maps.\nSecond, the image is encrypted using logistic map sub key and in its\ntransformation leads to diffusion process. Third, sub keys are generated by\nfour different chaotic maps. Based on the initial conditions, each map may\nproduce various random numbers from various orbits of the maps. Among those\nrandom numbers, a particular number and from a particular orbit are selected as\na key for the encryption algorithm. Based on the key, a binary sequence is\ngenerated to control the encryption algorithm. The input image of 2-D is\ntransformed into a 1- D array by using two different scanning pattern (raster\nand Zigzag) and then divided into various sub blocks. Then the position\npermutation and value permutation is applied to each binary matrix based on\nmultiple chaos maps. Finally the receiver uses the same sub keys to decrypt the\nencrypted images. The salient features of the proposed image encryption method\nare loss-less, good peak signal-to-noise ratio (PSNR), Symmetric key\nencryption, less cross correlation, very large number of secret keys, and\nkey-dependent pixel value replacement.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2011 16:29:04 GMT"}], "update_date": "2011-03-22", "authors_parsed": [["Sathishkumar", "G. A.", ""], ["bagan", "Dr. K. Bhoopathy", ""], ["Sriraam", "Dr. N.", ""]]}, {"id": "1103.4093", "submitter": "Delaram Kahrobaei", "authors": "Benjamin Fine, Maggie Habeeb, Delaram Kahrobaei, Gerhard Rosenberger", "title": "Aspects of Nonabelian Group Based Cryptography: A Survey and Open\n  Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most common public key cryptosystems and public key exchange protocols\npresently in use, such as the RSA algorithm, Diffie-Hellman, and elliptic curve\nmethods are number theory based and hence depend on the structure of abelian\ngroups. The strength of computing machinery has made these techniques\ntheoretically susceptible to attack and hence recently there has been an active\nline of research to develop cryptosystems and key exchange protocols using\nnoncommutative cryptographic platforms. This line of investigation has been\ngiven the broad title of noncommutative algebraic cryptography. This was\ninitiated by two public key protocols that used the braid groups, one by Ko,\nLee et.al.and one by Anshel, Anshel and Goldfeld. The study of these protocols\nand the group theory surrounding them has had a large effect on research in\ninfinite group theory. In this paper we survey these noncommutative group based\nmethods and discuss several ideas in abstract infinite group theory that have\narisen from them. We then present a set of open problems.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2011 17:43:43 GMT"}, {"version": "v2", "created": "Tue, 22 Mar 2011 05:45:05 GMT"}], "update_date": "2011-03-23", "authors_parsed": [["Fine", "Benjamin", ""], ["Habeeb", "Maggie", ""], ["Kahrobaei", "Delaram", ""], ["Rosenberger", "Gerhard", ""]]}, {"id": "1103.4401", "submitter": "Osman Yagan", "authors": "Osman Yagan and Armand M. Makowski", "title": "On the gradual deployment of random pairwise key distribution schemes\n  (Extended Version)", "comments": "The extended version of a paper that will appear at WiOpt 2011.\n  Additional parts may later be reported elsewhere", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of wireless sensor networks, the pairwise key distribution\nscheme of Chan et al. has several advantages over other key distribution\nschemes including the original scheme of Eschenauer and Gligor. However, this\noffline pairwise key distribution mechanism requires that the network size be\nset in advance, and involves all sensor nodes simultaneously. Here, we address\nthis issue by describing an implementation of the pairwise scheme that supports\nthe gradual deployment of sensor nodes in several consecutive phases. We\ndiscuss the key ring size needed to maintain the secure connectivity throughout\nall the deployment phases. In particular we show that the number of keys at\neach sensor node can be taken to be $O(\\log n)$ in order to achieve secure\nconnectivity (with high probability).\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2011 22:13:17 GMT"}], "update_date": "2011-03-24", "authors_parsed": [["Yagan", "Osman", ""], ["Makowski", "Armand M.", ""]]}, {"id": "1103.4433", "submitter": "Muhammad Rezal Kamel Ariffin M.R.K.Ariffin", "authors": "M. R. K. Ariffin, M. A. Asbullah, and N. A. Abu", "title": "Security Features of an Asymmetric Cryptosystem based on the Diophantine\n  Equation Hard Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Diophantine Equation Hard Problem (DEHP) is a potential cryptographic\nproblem on the Diophantine equation $U=\\sum \\limits_{i=1}^n {V_i x_{i}}$. A\nproper implementation of DEHP would render an attacker to search for private\nparameters amongst the exponentially many solutions. However, an improper\nimplementation would provide an attacker exponentially many choices to solve\nthe DEHP. The AA\\,$_{\\beta}$-cryptosystem is an asymmetric cryptographic scheme\nthat utilizes this concept together with the factorization problem of two large\nprimes and is implemented only by using the multiplication operation for both\nencryption and decryption. With this simple mathematical structure, it would\nhave low computational requirements and would enable communication devices with\nlow computing power to deploy secure communication procedures efficiently.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2011 04:01:02 GMT"}, {"version": "v10", "created": "Mon, 6 Jun 2011 09:38:45 GMT"}, {"version": "v11", "created": "Mon, 13 Jun 2011 04:24:05 GMT"}, {"version": "v12", "created": "Tue, 14 Jun 2011 08:58:51 GMT"}, {"version": "v13", "created": "Wed, 29 Jun 2011 02:35:51 GMT"}, {"version": "v14", "created": "Fri, 23 Sep 2011 03:57:02 GMT"}, {"version": "v15", "created": "Sat, 8 Oct 2011 13:03:43 GMT"}, {"version": "v16", "created": "Tue, 11 Oct 2011 15:56:38 GMT"}, {"version": "v17", "created": "Thu, 20 Oct 2011 16:12:25 GMT"}, {"version": "v18", "created": "Fri, 21 Oct 2011 00:56:37 GMT"}, {"version": "v19", "created": "Mon, 31 Oct 2011 05:11:31 GMT"}, {"version": "v2", "created": "Fri, 25 Mar 2011 03:04:07 GMT"}, {"version": "v20", "created": "Fri, 11 Nov 2011 09:05:53 GMT"}, {"version": "v21", "created": "Wed, 30 Nov 2011 08:52:15 GMT"}, {"version": "v22", "created": "Wed, 21 Dec 2011 15:15:05 GMT"}, {"version": "v23", "created": "Thu, 22 Dec 2011 07:22:18 GMT"}, {"version": "v3", "created": "Tue, 29 Mar 2011 07:52:26 GMT"}, {"version": "v4", "created": "Wed, 30 Mar 2011 08:47:05 GMT"}, {"version": "v5", "created": "Mon, 25 Apr 2011 16:56:01 GMT"}, {"version": "v6", "created": "Thu, 28 Apr 2011 08:07:15 GMT"}, {"version": "v7", "created": "Sat, 30 Apr 2011 03:02:01 GMT"}, {"version": "v8", "created": "Thu, 12 May 2011 02:32:29 GMT"}, {"version": "v9", "created": "Fri, 3 Jun 2011 07:50:30 GMT"}], "update_date": "2011-12-23", "authors_parsed": [["Ariffin", "M. R. K.", ""], ["Asbullah", "M. A.", ""], ["Abu", "N. A.", ""]]}, {"id": "1103.4496", "submitter": "Ashok Kumar Das", "authors": "Ashok Kumar Das", "title": "An Improved Efficient Key Distribution Mechanism for Large-Scale\n  Heterogeneous Mobile Sensor Networks", "comments": "12 pages", "journal-ref": "International Journal of Information Processing, Vol. 2, No. 3,\n  pp. 21 - 32, 2008", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to resource constraints of the sensor nodes, traditional public key\ncryptographic techniques are not feasible in most sensor network architectures.\nSeveral symmetric key distribution mechanisms are proposed for establishing\npairwise keys between sensor nodes in sensor networks, but most of them are not\nscalable and also are not much suited for mobile sensor networks because they\nincur much communication as well as computational overheads. Moreover, these\nschemes are either vulnerable to a small number of compromised sensor nodes or\ninvolve expensive protocols for establishing keys. In this paper, we introduce\na new scheme for establishing keys between sensor nodes with the help of\nadditional high-end sensor nodes, called the auxiliary nodes. Our scheme\nprovides unconditional security against sensor node captures and high network\nconnectivity. In addition, our scheme requires minimal storage requirement for\nstoring keys mainly due to only a single key before deployment in each node in\nthe sensor network, supports efficiently addition of new nodes after initial\ndeployment and also works for any deployment topology.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2011 11:33:57 GMT"}], "update_date": "2011-03-24", "authors_parsed": [["Das", "Ashok Kumar", ""]]}, {"id": "1103.4676", "submitter": "Ashok Kumar Das", "authors": "Ashok Kumar Das and Debasis Giri", "title": "An Identity Based Key Management Scheme in Wireless Sensor Networks", "comments": "7 pages, Published in Proceedings of 4th Asian International Mobile\n  Computing Conference (AMOC 2006), Kolkata, India, pp. 70-76, January 4-7,\n  2006", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pairwise key establishment is one of the fundamental security services in\nsensor networks which enables sensor nodes in a sensor network to communicate\nsecurely with each other using cryptographic techniques. It is not feasible to\napply traditional public key management techniques in resource-constrained\nsensor nodes, and also because the sensor nodes are vulnerable to physical\ncapture. In this paper, we introduce a new scheme called the identity based key\npre-distribution using a pseudo random function (IBPRF), which has better\ntrade-off between communication overhead, network connectivity and resilience\nagainst node capture compared to the other key pre-distribution schemes. Our\nscheme can be easily adapted in mobile sensor networks. This scheme supports\nthe addition of new sensor nodes after the initial deployment and also works\nfor any deployment topology. In addition, we propose an improved version of our\nscheme to support large sensor networks.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 04:22:19 GMT"}], "update_date": "2011-03-25", "authors_parsed": [["Das", "Ashok Kumar", ""], ["Giri", "Debasis", ""]]}, {"id": "1103.4678", "submitter": "Ashok Kumar Das", "authors": "Ashok Kumar Das", "title": "An Unconditionally Secure Key Management Scheme for Large-Scale\n  Heterogeneous Wireless Sensor Networks", "comments": "10 pages, Published in Proceedings of First International Conference\n  on COMmunication Systems and NETworkS (COMSNETS 2009), IEEE Computer Society\n  Press, pp. 1 - 10, Bangalore, India, January 5-10, 2009", "journal-ref": null, "doi": "10.1109/COMSNETS.2009.4808919", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Key establishment in sensor networks becomes a challenging problem because of\nthe resource limitations of the sensors and also due to vulnerability to\nphysical capture of the sensor nodes. In this paper, we propose an\nunconditionally secure probabilistic group-based key pre-distribution scheme\nfor a heterogeneous wireless sensor network. The proposed scheme always\nguarantees that no matter how many sensor nodes are compromised, the\nnon-compromised nodes can still communicate with 100% secrecy, i.e., the\nproposed scheme is always unconditionally secure against node capture attacks.\nMoreover, it provides significantly better trade-off between communication\noverhead, computational overhead, network connectivity and security against\nnode capture as compared to the existing key pre-distribution schemes. It also\nsupports dynamic node addition after the initial deployment of the nodes in the\nnetwork.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2011 04:40:12 GMT"}], "update_date": "2011-03-25", "authors_parsed": [["Das", "Ashok Kumar", ""]]}, {"id": "1103.5102", "submitter": "Michael Goodrich", "authors": "Michael T. Goodrich", "title": "Data-Oblivious External-Memory Algorithms for the Compaction, Selection,\n  and Sorting of Outsourced Data", "comments": "Full version of a paper appearing in 2011 ACM Symp. on Parallelism in\n  Algorithms and Architectures (SPAA)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present data-oblivious algorithms in the external-memory model for\ncompaction, selection, and sorting. Motivation for such problems comes from\nclients who use outsourced data storage services and wish to mask their data\naccess patterns. We show that compaction and selection can be done\ndata-obliviously using $O(N/B)$ I/Os, and sorting can be done, with a high\nprobability of success, using $O((N/B)\\log_{M/B} (N/B))$ I/Os. Our methods use\na number of new algorithmic techniques, including data-oblivious uses of\ninvertible Bloom lookup tables, a butterfly-like compression network,\nrandomized data thinning, and \"shuffle-and-deal\" data perturbation. In\naddition, since data-oblivious sorting is the bottleneck in the \"inner loop\" in\nexisting oblivious RAM simulations, our sorting result improves the amortized\ntime overhead to do oblivious RAM simulation by a logarithmic factor in the\nexternal-memory model.\n", "versions": [{"version": "v1", "created": "Sat, 26 Mar 2011 03:18:03 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Goodrich", "Michael T.", ""]]}, {"id": "1103.5115", "submitter": "Pars Mutaf", "authors": "Pars Mutaf", "title": "Defeating Internet attacks and Spam using \"disposable\" Mobile IPv6 home\n  addresses", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model of operation for next generation wireless Internet, in\nwhich a mobile host has hundreds of \"disposable\" Mobile IPv6 home addresses.\nEach correspondent is distributed a different disposable home address. If\nattacked on a given home address, the mobile user can block packets to that\naddress and become unreachable to the attacker. Blocking one address does not\naffect other addresses. Other correspondents can still reach the mobile host. A\nnew home address can also be requested via e-mail, instant messaging, or\ndirectly from the target host using a protocol that we develop. This model is\nespecially useful against battery exhausting Denial-of-Service (DoS) attacks\nand CPU exhausting distributed DoS attacks, since it seems to be the only\nviable solution, currently. We show however that this model can also be used to\ndefeat other attacks and also to stop spam.\n", "versions": [{"version": "v1", "created": "Sat, 26 Mar 2011 08:25:02 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Mutaf", "Pars", ""]]}, {"id": "1103.5188", "submitter": "Catuscia Palamidessi", "authors": "M\\'ario S. Alvim, Miguel E. Andr\\'es, Konstantinos Chatzikokolakis,\n  Pierpaolo Degano, Catuscia Palamidessi", "title": "Differential Privacy: on the trade-off between Utility and Information\n  Leakage", "comments": "30 pages; HAL repository", "journal-ref": "Proceedings of the 8th International Workshop on Formal Aspects of\n  Security & Trust (FAST'11), Springer, LNCS 7140, pp. 39-54, 2011", "doi": "10.1007/978-3-642-29420-4_3", "report-no": "inria-00580122", "categories": "cs.CR cs.DB cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Differential privacy is a notion of privacy that has become very popular in\nthe database community. Roughly, the idea is that a randomized query mechanism\nprovides sufficient privacy protection if the ratio between the probabilities\nthat two adjacent datasets give the same answer is bound by e^epsilon. In the\nfield of information flow there is a similar concern for controlling\ninformation leakage, i.e. limiting the possibility of inferring the secret\ninformation from the observables. In recent years, researchers have proposed to\nquantify the leakage in terms of R\\'enyi min mutual information, a notion\nstrictly related to the Bayes risk. In this paper, we show how to model the\nquery system in terms of an information-theoretic channel, and we compare the\nnotion of differential privacy with that of mutual information. We show that\ndifferential privacy implies a bound on the mutual information (but not\nvice-versa). Furthermore, we show that our bound is tight. Then, we consider\nthe utility of the randomization mechanism, which represents how close the\nrandomized answers are, in average, to the real ones. We show that the notion\nof differential privacy implies a bound on utility, also tight, and we propose\na method that under certain conditions builds an optimal randomization\nmechanism, i.e. a mechanism which provides the best utility while guaranteeing\ndifferential privacy.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2011 06:41:12 GMT"}, {"version": "v2", "created": "Mon, 9 May 2011 00:04:26 GMT"}, {"version": "v3", "created": "Thu, 25 Aug 2011 04:12:17 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Alvim", "Mário S.", ""], ["Andrés", "Miguel E.", ""], ["Chatzikokolakis", "Konstantinos", ""], ["Degano", "Pierpaolo", ""], ["Palamidessi", "Catuscia", ""]]}, {"id": "1103.5197", "submitter": "Parisa Babaheidarian", "authors": "Parisa Babaheidarian and Somayeh Salimi and Mohammad Reza Aref", "title": "A New Secret key Agreement Scheme in a Four-Terminal Network", "comments": "6 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new scenario for generating a secret key and two private keys among three\nTerminals in the presence of an external eavesdropper is considered. Terminals\n1, 2 and 3 intend to share a common secret key concealed from the external\neavesdropper (Terminal 4) and simultaneously, each of Terminals 1 and 2 intends\nto share a private key with Terminal 3 while keeping it concealed from each\nother and from Terminal 4. All four Terminals observe i.i.d. outputs of\ncorrelated sources and there is a public channel from Terminal 3 to Terminals 1\nand 2. An inner bound of the \"secret key-private keys capacity region\" is\nderived and the single letter capacity regions are obtained for some special\ncases.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2011 11:08:07 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Babaheidarian", "Parisa", ""], ["Salimi", "Somayeh", ""], ["Aref", "Mohammad Reza", ""]]}, {"id": "1103.5199", "submitter": "Anatoly Plotnikov D.", "authors": "A.S. Petrov, A.D. Plotnikov", "title": "Encipher of information on the basis of geometrical presentations", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we examine a ciphertext on the basis of using geometrical\nobjects. Each symbol normative alphabet is determined as a point on the plane.\nWe consider possible ways for presentation of these points.\n", "versions": [{"version": "v1", "created": "Sun, 27 Mar 2011 11:11:10 GMT"}], "update_date": "2016-03-07", "authors_parsed": [["Petrov", "A. S.", ""], ["Plotnikov", "A. D.", ""]]}, {"id": "1103.5433", "submitter": "Serguei Mokhov", "authors": "Michael J. Assels, Dana Echtner, Michael Spanner, Serguei A. Mokhov,\n  Fran\\c{c}ois Carri\\`ere, Manny Taveroff", "title": "Multifaceted Faculty Network Design and Management: Practice and\n  Experience Report", "comments": "19 pages, 11 figures, TOC and index; a short version presented at\n  C3S2E'11; v6: more proofreading, index, TOC, references", "journal-ref": "Proceedings of The Fourth International C* Conference on Computer\n  Science and Software Engineering (C3S2E '11). 2011, ACM, New York, NY, USA,\n  151-155", "doi": "10.1145/1992896.1992916", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report on our experience on multidimensional aspects of our faculty's\nnetwork design and management, including some unique aspects such as\ncampus-wide VLANs and ghosting, security and monitoring, switching and routing,\nand others. We outline a historical perspective on certain research, design,\nand development decisions and discuss the network topology, its scalability,\nand management in detail; the services our network provides, and its evolution.\nWe overview the security aspects of the management as well as data management\nand automation and the use of the data by other members of the IT group in the\nfaculty.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 17:59:53 GMT"}, {"version": "v2", "created": "Sat, 16 Apr 2011 18:34:24 GMT"}, {"version": "v3", "created": "Thu, 21 Apr 2011 14:54:05 GMT"}, {"version": "v4", "created": "Fri, 22 Apr 2011 01:43:27 GMT"}, {"version": "v5", "created": "Mon, 25 Apr 2011 01:08:35 GMT"}, {"version": "v6", "created": "Mon, 25 Jul 2011 19:56:31 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Assels", "Michael J.", ""], ["Echtner", "Dana", ""], ["Spanner", "Michael", ""], ["Mokhov", "Serguei A.", ""], ["Carrière", "François", ""], ["Taveroff", "Manny", ""]]}, {"id": "1103.5520", "submitter": "Yue Wu", "authors": "Yue Wu, Joseph P. Noonan, and Sos Agaian", "title": "Shannon Entropy based Randomness Measurement and Test for Image\n  Encryption", "comments": "23 Pages, 7 figures and 5 tables. Submitted to the Journal of\n  Information Sciences", "journal-ref": null, "doi": "10.1016/j.ins.2012.07.049", "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The quality of image encryption is commonly measured by the Shannon entropy\nover the ciphertext image. However, this measurement does not consider to the\nrandomness of local image blocks and is inappropriate for scrambling based\nimage encryption methods. In this paper, a new information entropy-based\nrandomness measurement for image encryption is introduced which, for the first\ntime, answers the question of whether a given ciphertext image is sufficiently\nrandom-like. It measures the randomness over the ciphertext in a fairer way by\ncalculating the averaged entropy of a series of small image blocks within the\nentire test image. In order to fulfill both quantitative and qualitative\nmeasurement, the expectation and the variance of this averaged block entropy\nfor a true-random image are strictly derived and corresponding numerical\nreference tables are also provided. Moreover, a hypothesis test at\nsignificance-level is given to help accept or reject the hypothesis that the\ntest image is ideally encrypted/random-like. Simulation results show that the\nproposed test is able to give both effectively quantitative and qualitative\nresults for image encryption. The same idea can also be applied to measure\nother digital data, like audio and video.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 00:55:53 GMT"}], "update_date": "2016-11-27", "authors_parsed": [["Wu", "Yue", ""], ["Noonan", "Joseph P.", ""], ["Agaian", "Sos", ""]]}, {"id": "1103.5589", "submitter": "Hossein Jadidoleslamy", "authors": "Shahriar Mohammadi and Hossein Jadidoleslamy", "title": "A Comparison of Link Layer Attacks on Wireless Sensor Networks", "comments": "22 pages, 10 figures, 6 tables, International journal on applications\n  of graph theory in wireless ad hoc networks and sensor networks(GRAPH-HOC)\n  Vol.3, No.1, March 2011", "journal-ref": "International journal on applications of graph theory in wireless\n  ad hoc networks and sensor networks (GRAPH-HOC) Vol.3, No.1, March 2011", "doi": "10.5121/jgraphhoc.2011.3103", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs) have many potential applications [1, 5] and\nunique challenges. They usually consist of hundreds or thousands small sensor\nnodes such as MICA2, which operate autonomously; conditions such as cost,\ninvisible deployment and many application domains, lead to small size and\nlimited resources sensors [2]. WSNs are susceptible to many types of link layer\nattacks [1] and most of traditional networks security techniques are unusable\non WSNs [2]; due to wireless and shared nature of communication channel,\nuntrusted transmissions, deployment in open environments, unattended nature and\nlimited resources [1]. So, security is a vital requirement for these networks;\nbut we have to design a proper security mechanism that attends to WSN's\nconstraints and requirements. In this paper, we focus on security of WSNs,\ndivide it (the WSNs security) into four categories and will consider them,\ninclude: an overview of WSNs, security in WSNs, the threat model on WSNs, a\nwide variety of WSNs' link layer attacks and a comparison of them. This work\nenables us to identify the purpose and capabilities of the attackers; also, the\ngoal and effects of the link layer attacks on WSNs are introduced. Also, this\npaper discusses known approaches of security detection and defensive mechanisms\nagainst the link layer attacks; this would enable it security managers to\nmanage the link layer attacks of WSNs more effectively.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 10:22:32 GMT"}], "update_date": "2011-03-30", "authors_parsed": [["Mohammadi", "Shahriar", ""], ["Jadidoleslamy", "Hossein", ""]]}, {"id": "1103.5712", "submitter": "Rohith Reddy Singi Reddy", "authors": "Rohith Singi Reddy", "title": "Key Management in Wireless Sensor Networks Using a Modified Blom Scheme", "comments": "9 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Key establishment between any pair of nodes is an essential requirement for\nproviding secure services in wireless sensor networks. Blom's scheme is a\nprominent key management scheme but its shortcomings include large computation\noverhead and memory cost. We propose a new scheme in this paper that modifies\nBlom's scheme in a manner that reduces memory and computation costs. This paper\nalso provides the value for secure parameter t such that the network is\nresilient.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 17:08:04 GMT"}], "update_date": "2011-03-30", "authors_parsed": [["Reddy", "Rohith Singi", ""]]}, {"id": "1103.5783", "submitter": "Maaly Awad Hassan", "authors": "Maaly Awad S Hassan and Ibrahim Soliman I Abuhaiba", "title": "Image Encryption Using Differential Evolution Approach in Frequency\n  Domain", "comments": "19 pages, 15 figures, 3 tables", "journal-ref": "Signal & Image Processing: An International Journal (SIPIJ) Vol.2,\n  No.1, pp. 51-69, March 2011", "doi": "10.5121/sipij.2011.2105", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a new effective method for image encryption which employs\nmagnitude and phase manipulation using Differential Evolution (DE) approach.\nThe novelty of this work lies in deploying the concept of keyed discrete\nFourier transform (DFT) followed by DE operations for encryption purpose. To\nthis end, a secret key is shared between both encryption and decryption sides.\nFirstly two dimensional (2-D) keyed discrete Fourier transform is carried out\non the original image to be encrypted. Secondly crossover is performed between\ntwo components of the encrypted image, which are selected based on Linear\nFeedback Shift Register (LFSR) index generator. Similarly, keyed mutation is\nperformed on the real parts of a certain components selected based on LFSR\nindex generator. The LFSR index generator initializes it seed with the shared\nsecret key to ensure the security of the resulting indices. The process\nshuffles the positions of image pixels. A new image encryption scheme based on\nthe DE approach is developed which is composed with a simple diffusion\nmechanism. The deciphering process is an invertible process using the same key.\nThe resulting encrypted image is found to be fully distorted, resulting in\nincreasing the robustness of the proposed work. The simulation results validate\nthe proposed image encryption scheme.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 22:23:18 GMT"}], "update_date": "2011-03-31", "authors_parsed": [["Hassan", "Maaly Awad S", ""], ["Abuhaiba", "Ibrahim Soliman I", ""]]}, {"id": "1103.6219", "submitter": "Tetyana Laptyeva V.", "authors": "T.V. Laptyeva, S. Flach, and K. Kladko", "title": "The weak password problem: chaos, criticality, and encrypted p-CAPTCHAs", "comments": "5 pages, 6 figers", "journal-ref": null, "doi": "10.1209/0295-5075/95/50007", "report-no": null, "categories": "cs.CR cond-mat.other nlin.CD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vulnerabilities related to weak passwords are a pressing global economic and\nsecurity issue. We report a novel, simple, and effective approach to address\nthe weak password problem. Building upon chaotic dynamics, criticality at phase\ntransitions, CAPTCHA recognition, and computational round-off errors we design\nan algorithm that strengthens security of passwords. The core idea of our\nmethod is to split a long and secure password into two components. The first\ncomponent is memorized by the user. The second component is transformed into a\nCAPTCHA image and then protected using evolution of a two-dimensional dynamical\nsystem close to a phase transition, in such a way that standard brute-force\nattacks become ineffective. We expect our approach to have wide applications\nfor authentication and encryption technologies.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 15:50:07 GMT"}, {"version": "v2", "created": "Fri, 1 Jul 2011 14:30:06 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Laptyeva", "T. V.", ""], ["Flach", "S.", ""], ["Kladko", "K.", ""]]}]