[{"id": "1403.0001", "submitter": "Venugopal K r", "authors": "T Shiva Prakash, K B Raja, K R Venugopal, S S Iyengar, L M Patnaik", "title": "Link-Reliability Based Two-Hop Routing for Wireless Sensor Networks", "comments": "15 pages. arXiv admin note: substantial text overlap with\n  arXiv:1402.7198", "journal-ref": "International Journal of Information Processing, 7(1), 15-29, 2013", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Sensor Networks (WSNs) emerge as underlying infrastructures for new\nclasses of large scale net- worked embedded systems. However, WSNs system\ndesigners must fulfill the Quality-of-Service (QoS) requirements imposed by the\napplications (and users). Very harsh and dynamic physical environments and\nextremely limited energy/computing/memory/communication node resources are\nmajor obstacles for satisfying QoS metrics such as reliability, timeliness and\nsystem lifetime. The limited communication range of WSN nodes, link asymmetry\nand the characteristics of the physical environment lead to a major source of\nQoS degradation in WSNs. This paper proposes a Link Reliability based Two-Hop\nRouting protocol for wireless Sensor Networks (WSNs). The protocol achieves to\nreduce packet deadline miss ratio while consid- ering link reliability, two-hop\nvelocity and power efficiency and utilizes memory and computational effective\nmethods for estimating the link metrics. Numerical results provide insights\nthat the protocol has a lower packet deadline miss ratio and longer sensor\nnetwork lifetime. The results show that the proposed protocol is a feasible\nsolution to the QoS routing problem in wireless sensor networks that support\nreal-time applications.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2014 11:02:45 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Prakash", "T Shiva", ""], ["Raja", "K B", ""], ["Venugopal", "K R", ""], ["Iyengar", "S S", ""], ["Patnaik", "L M", ""]]}, {"id": "1403.0157", "submitter": "Tara Babaie", "authors": "Tahereh Babaie, Sanjay Chawla, Sebastien Ardon", "title": "Network Traffic Decomposition for Anomaly Detection", "comments": "Submitted to The Journal of Data Mining and Knowledge Discovery\n  (DAMI)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we focus on the detection of network anomalies like Denial of\nService (DoS) attacks and port scans in a unified manner. While there has been\nan extensive amount of research in network anomaly detection, current state of\nthe art methods are only able to detect one class of anomalies at the cost of\nothers. The key tool we will use is based on the spectral decomposition of a\ntrajectory/hankel matrix which is able to detect deviations from both between\nand within correlation present in the observed network traffic data. Detailed\nexperiments on synthetic and real network traces shows a significant\nimprovement in detection capability over competing approaches. In the process\nwe also address the issue of robustness of anomaly detection systems in a\nprincipled fashion.\n", "versions": [{"version": "v1", "created": "Sun, 2 Mar 2014 04:18:00 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Babaie", "Tahereh", ""], ["Chawla", "Sanjay", ""], ["Ardon", "Sebastien", ""]]}, {"id": "1403.0173", "submitter": "Chan Dai Truyen Thai", "authors": "Chan Dai Truyen Thai and Marion Berbineau", "title": "Coordinated Direct and Relay Schemes for Two-Hop Communication in VANETS", "comments": "15 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to accommodate increasing need and offer communication with high\nperformance, both vehicle-to-infrastructure (V2I) and vehicle-to-vehicle (V2V)\ncommunications are exploited. The advantages of static nodes and vehicular\nnodes are combined to achieve an optimal routing scheme. In this paper, we\nconsider the communications between a static node and the vehicular nodes\nmoving in an adjacent area of it. The adjacent area is defined as the zone\nwhere a vehicular can communicate with the static node within maximum two hops.\nWe only consider single-hop and two-hop transmissions because these\ntransmissions can be considered as building blocks to construct transmissions\nwith a higher number of hops. Different cases in which an uplink or a downlink\nfor the two-hop user combined with an uplink or a downlink for the single-hop\nuser correspond to different CDR schemes. Using side information to\nintentionally cancel the interference, Network Coding (NC), CDR, overhearing\nand multi-way schemes aggregate communications flows in order to increase the\nperformance of the network. We apply the mentioned schemes to a V2I network and\npropose novel schemes to optimally arrange and combine the transmissions.\n", "versions": [{"version": "v1", "created": "Sun, 2 Mar 2014 08:15:33 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Thai", "Chan Dai Truyen", ""], ["Berbineau", "Marion", ""]]}, {"id": "1403.0338", "submitter": "Sanjaya Kumar Panda", "authors": "Jitendra Kumar Rout, Sourav Kumar Bhoi, Sanjaya Kumar Panda", "title": "SFTP : A Secure and Fault-Tolerant Paradigm against Blackhole Attack in\n  MANET", "comments": "6 pages, 9 figures", "journal-ref": "International Journal of Computer Applications 2013", "doi": "10.5120/10623-5343", "report-no": "pxc3885343", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security issues in MANET are a challenging task nowadays. MANETs are\nvulnerable to passive attacks and active attacks because of a limited number of\nresources and lack of centralized authority. Blackhole attack is an attack in\nnetwork layer which degrade the network performance by dropping the packets. In\nthis paper, we have proposed a Secure Fault-Tolerant Paradigm (SFTP) which\nchecks the Blackhole attack in the network. The three phases used in SFTP\nalgorithm are designing of coverage area to find the area of coverage, Network\nConnection algorithm to design a fault-tolerant model and Route Discovery\nalgorithm to discover the route and data delivery from source to destination.\nSFTP gives better network performance by making the network fault free.\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2014 08:36:22 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Rout", "Jitendra Kumar", ""], ["Bhoi", "Sourav Kumar", ""], ["Panda", "Sanjaya Kumar", ""]]}, {"id": "1403.0439", "submitter": "Michael Hanspach", "authors": "Michael Hanspach", "title": "Verbesserung von OS- und Service-Fingerprinting mittels Fuzzing", "comments": "75 pages, Diplom thesis / Diplomarbeit. September 2008, German\n  language content", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fingerprinting of services and operating systems is an essential part of\npenetration tests. In order to successfully penetrate the computing system's\nsecurity measurements, preexisting fingerprinting methods are described and the\nparadigm of fingerprinting with mutation-based fuzzing is established. A case\nstudy about operating system and FTP server fingerprinting is presented whereby\nthe feasibility of the approach is demonstrated. The research results show that\nthe developed tools can be used for even more precise fingerprinting than the\npreexisting tools.\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2014 14:06:51 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Hanspach", "Michael", ""]]}, {"id": "1403.0445", "submitter": "Matthieu Boutier", "authors": "Matthieu Boutier (PPS), Juliusz Chroboczek (PPS)", "title": "Source-specific routing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Source-specific routing (not to be confused with source routing) is a routing\ntechnique where routing decisions depend on both the source and the destination\naddress of a packet. Source-specific routing solves some difficult problems\nrelated to multihoming, notably in edge networks, and is therefore a useful\naddition to the multihoming toolbox. In this paper, we describe the semantics\nof source-specific packet forwarding, and describe the design and\nimplementation of a source-specific extension to the Babel routing protocol as\nwell as its implementation - to our knowledge, the first complete\nimplementation of a source-specific dynamic routing protocol, including a\ndisambiguation algorithm that makes our implementation work over widely\navailable networking APIs. We further discuss interoperability between ordinary\nnext-hop and source-specific dynamic routing protocols. Our implementation has\nseen a moderate amount of deployment, notably as a testbed for the IETF Homenet\nworking group.\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2014 14:38:07 GMT"}, {"version": "v2", "created": "Sat, 6 Dec 2014 08:17:08 GMT"}, {"version": "v3", "created": "Tue, 16 Dec 2014 14:48:55 GMT"}, {"version": "v4", "created": "Mon, 30 Mar 2015 08:46:28 GMT"}], "update_date": "2015-03-31", "authors_parsed": [["Boutier", "Matthieu", "", "PPS"], ["Chroboczek", "Juliusz", "", "PPS"]]}, {"id": "1403.0503", "submitter": "Siamak Yousefi mr", "authors": "Siamak Yousefi, Xiao-Wen Chang, Benoit Champagne", "title": "Distributed Cooperative Localization in Wireless Sensor Networks without\n  NLOS Identification", "comments": "Accepted in WPNC 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a 2-stage robust distributed algorithm is proposed for\ncooperative sensor network localization using time of arrival (TOA) data\nwithout identification of non-line of sight (NLOS) links. In the first stage,\nto overcome the effect of outliers, a convex relaxation of the Huber loss\nfunction is applied so that by using iterative optimization techniques, good\nestimates of the true sensor locations can be obtained. In the second stage,\nthe original (non-relaxed) Huber cost function is further optimized to obtain\nrefined location estimates based on those obtained in the first stage. In both\nstages, a simple gradient descent technique is used to carry out the\noptimization. Through simulations and real data analysis, it is shown that the\nproposed convex relaxation generally achieves a lower root mean squared error\n(RMSE) compared to other convex relaxation techniques in the literature. Also\nby doing the second stage, the position estimates are improved and we can\nachieve an RMSE close to that of the other distributed algorithms which know\n\\textit{a priori} which links are in NLOS.\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2014 17:51:52 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Yousefi", "Siamak", ""], ["Chang", "Xiao-Wen", ""], ["Champagne", "Benoit", ""]]}, {"id": "1403.0530", "submitter": "Saida Elyengui", "authors": "Saida Elyengui, Riadh Bouhouchi, Tahar Ezzedine", "title": "The Enhancement of Communication Technologies and Networks for Smart\n  Grid Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current electrical grid is perhaps the greatest engineering achievement\nof the 20th century. However, it is increasingly outdated and overburdened,\nleading to costly blackouts and burnouts. For this and various other\nreasons,transformation efforts are underway to make the current electrical grid\nsmarter. A reliable, universal and secure communication infrastructure is\nmandatory for the implementation and deployment of the future smart grid. A\nspecial interest is given to the design of efficient and robust network\narchitecture capable of managing operation and control of the next generation\npower grid. For this purpose new wired and wireless technologies are emerging\nin addition to the formerly applied to help upgrade the current power grid. In\nthis paper we will give an overview of smart grid reference model, and a\ncomprehensive survey of the available networks for the smart grid and a\ncritical review of the progress of wired and wireless communication\ntechnologies for smart grid communication infrastructure. And we propose end to\nend communication architecture for Home Area Networks (HANs), Neighborhood Area\nNetworks (NANs) and Wide Area Networks (WANs) for smart grid applications. We\nbelieve that this work will provide appreciated insights for the novices who\nwould like to follow related research in the SG domain.\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2014 19:21:16 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Elyengui", "Saida", ""], ["Bouhouchi", "Riadh", ""], ["Ezzedine", "Tahar", ""]]}, {"id": "1403.0766", "submitter": "Michael Hanspach", "authors": "Michael Hanspach, Ralf Schumann, Stefan Schemmer, Sebastian Vandersee", "title": "Service-Fingerprinting mittels Fuzzing", "comments": "10 pages, May 2009, German language content. This paper is based on\n  the Diplom thesis / Diplomarbeit: \"Verbesserung von OS- und\n  Service-Fingerprinting mittels Fuzzing\", Michael Hanspach, September 2008.\n  DACH Security 2009: Bestandsaufnahme - Konzepte - Anwendungen - Perspektiven,\n  May 2009, ISBN 300027488X", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Service fingerprinting (i.e. the identification of network services and other\napplications on computing systems) is an essential part of penetration tests.\nThe main contribution of this paper is a study on the improvement of\nfingerprinting tools. By applying mutation-based fuzzing as a fingerprint\ngeneration method, subtle differences in response messages can be identified.\nThese differences in response messages provide means for the differentiation\nand identification of network services. To prove the feasibility of the\napproach, an implementation of a fingerprinting tool for ftp servers is\npresented and compared to preexisting fingerprinting tools. As a result of this\nstudy it is shown that mutation-based fuzzing is an appropriate method for\nservice fingerprinting that even offers advantages over preexisting methods.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2014 12:40:31 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Hanspach", "Michael", ""], ["Schumann", "Ralf", ""], ["Schemmer", "Stefan", ""], ["Vandersee", "Sebastian", ""]]}, {"id": "1403.0930", "submitter": "Ahmed Alaa", "authors": "Ahmed M. Alaa, Mahmoud H. Ismail, and Hazim Tawfik", "title": "Spectrum Sensing Via Reconfigurable Antennas: Fundamental Limits and\n  Potential Gains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel paradigm for spectrum sensing in cognitive radio networks\nthat provides diversity and capacity benefits using a single antenna at the\nSecondary User (SU) receiver. The proposed scheme is based on a reconfigurable\nantenna: an antenna that is capable of altering its radiation characteristics\nby changing its geometric configuration. Each configuration is designated as an\nantenna mode or state and corresponds to a distinct channel realization. Based\non an abstract model for the reconfigurable antenna, we tackle two different\nsettings for the cognitive radio problem and present fundamental limits on the\nachievable diversity and throughput gains. First, we explore the (to cooperate\nor not to cooperate) tradeoff between the diversity and coding gains in\nconventional cooperative and noncooperative spectrum sensing schemes, showing\nthat cooperation is not always beneficial. Based on this analysis, we propose\ntwo sensing schemes based on reconfigurable antennas that we term as state\nswitching and state selection. It is shown that each of these schemes\noutperform both cooperative and non-cooperative spectrum sensing under a global\nenergy constraint. Next, we study the (sensing-throughput) trade-off, and\ndemonstrate that using reconfigurable antennas, the optimal sensing time is\nreduced allowing for a longer transmission time, and thus better throughput.\nMoreover, state selection can be applied to boost the capacity of SU\ntransmission.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2014 20:12:11 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Alaa", "Ahmed M.", ""], ["Ismail", "Mahmoud H.", ""], ["Tawfik", "Hazim", ""]]}, {"id": "1403.0949", "submitter": "Ilya Baldin", "authors": "Yufeng Xin, Ilya Baldin, Jeff Chase, Kemafor Ogan", "title": "Leveraging Semantic Web Technologies for Managing Resources in a\n  Multi-Domain Infrastructure-as-a-Service Environment", "comments": null, "journal-ref": null, "doi": null, "report-no": "RENCI TR-14-01", "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper reports on experience with using semantically-enabled network\nresource models to construct an operational multi-domain networked\ninfrastructure-as-a-service (NIaaS) testbed called ExoGENI, recently funded\nthrough NSF's GENI project. A defining property of NIaaS is the deep\nintegration of network provisioning functions alongside the more common storage\nand computation provisioning functions. Resource provider topologies and user\nrequests can be described using network resource models with common base\nclasses for fundamental cyber-resources (links, nodes, interfaces) specialized\nvia virtualization and adaptations between networking layers to specific\ntechnologies.\n  This problem space gives rise to a number of application areas where semantic\nweb technologies become highly useful - common information models and resource\nclass hierarchies simplify resource descriptions from multiple providers,\npathfinding and topology embedding algorithms rely on query abstractions as\nbuilding blocks.\n  The paper describes how the semantic resource description models enable\nExoGENI to autonomously instantiate on-demand virtual topologies of virtual\nmachines provisioned from cloud providers and are linked by on-demand virtual\nconnections acquired from multiple autonomous network providers to serve a\nvariety of applications ranging from distributed system experiments to\nhigh-performance computing.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2014 21:08:44 GMT"}], "update_date": "2014-03-06", "authors_parsed": [["Xin", "Yufeng", ""], ["Baldin", "Ilya", ""], ["Chase", "Jeff", ""], ["Ogan", "Kemafor", ""]]}, {"id": "1403.0965", "submitter": "Hossein Shokri Ghadikolaei", "authors": "Hossein Shokri-Ghadikolaei and Carlo Fischione and Gabor Fodor and\n  Georgios Athanasiou", "title": "Design Challenges of Millimeter Wave Communications: A MAC Layer\n  Perspective", "comments": "This paper has been withdrawn by the authors due to a crucial error\n  in the proposed protocol and also Fig. 4", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the spectrum is becoming more scarce due to exponential demand of\nformidable data quantities, the new millimiterwave (mmW) band is considered as\nan enabling player of 5G communications to provide multi-gigabits wireless\nacccess. MmW communications exhibit high attenuation and blockage,\ndirectionality due to massive beamforming, deafness, low-interference, and may\nneed micro waves networks for coordination and fallback support. The current\nmmW standardizations are challenged by the overwhelming complexity given by\nsuch heterogeneous communication systems and mmW band characteristics. This\ndemands new substantial protocol developments at all layers. In this paper, the\nmedium access control issues for mmW communications are reviewed. It is\ndiscussed that while existing standards address some of these issues for\npersonal and local area networks, little has been done for cellular networks.\nIt is argued that the medium access control layer should be equipped with\nadaptation mechanisms that are aware of the special mmW characteristics.\nRecommendations for mmW medium access control design in 5G are provided. It is\nconcluded that the design of efficient access control techniques for mmW is in\nits infancy and much work still has to be done.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2014 22:06:25 GMT"}, {"version": "v2", "created": "Wed, 12 Mar 2014 21:12:51 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Shokri-Ghadikolaei", "Hossein", ""], ["Fischione", "Carlo", ""], ["Fodor", "Gabor", ""], ["Athanasiou", "Georgios", ""]]}, {"id": "1403.0982", "submitter": "Shahrzad Shirazipourazad", "authors": "Shahrzad Shirazipourazad, Pavel Ghosh and Arunabha Sen", "title": "On Connectivity of Airborne Networks", "comments": "The section on Computation of Critical Transmission Range In Faculty\n  Scenario has been published in proceedings of Milcom 2011: S.\n  Shirazipourazad, P. Ghosh and A. Sen, On Connectivity of Airborne Networks in\n  Presence of Region-based Faults, IEEE Milcom, Military Communications\n  Conference, Baltimore, MD, 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobility pattern of nodes in a mobile network has significant impact on the\nconnectivity properties of the network. One such mobile network that has drawn\nattention of researchers in the past few years is the Airborne Networks (AN)\ndue to its importance in civil and military purpose and due to the several\ncomplex issues in these domains. Since the nodes in an airborne network (AN)\nare heterogeneous and mobile, the design of a reliable and robust AN is highly\ncomplex and challenging. In this paper a persistent backbone based architecture\nfor an AN has been considered where a set of airborne networking platforms\n(ANPs - aircrafts, UAVs and satellites) form the backbone of the AN. End to end\nconnectivity of the backbone nodes is crucial in providing the communication\namong the hosts. Since ANPs are prone to failure because of attacks like EMP\nattack or jamming, another important issue is to improve the robustness of the\nbackbone network against these attacks. Such attacks will impact specific\ngeographic regions at specific times and if an ANP is within the fault region\nduring the time of attack, it will fail. This paper focuses on connectivity and\nfault-tolerance issues in ANs and studies algorithms to compute the minimum\ntransmission range of ANPs in fault free and faulty scenarios to ensure network\nconnectivity all the times. It also considers the scenario where the network\nmay have to operate in a disconnected mode for some part of time and data\ntransmissions may be tolerant to some amount of delay. Hence, ANPs may not need\nto have end-to-end paths all the time but they should be able to transmit data\nto each other within bounded time.\n", "versions": [{"version": "v1", "created": "Wed, 5 Mar 2014 01:28:19 GMT"}], "update_date": "2014-03-06", "authors_parsed": [["Shirazipourazad", "Shahrzad", ""], ["Ghosh", "Pavel", ""], ["Sen", "Arunabha", ""]]}, {"id": "1403.1170", "submitter": "Zhenghuan Wang", "authors": "Zhenghuan Wang, Heng Liu, Shengxin Xu, Xiangyuan Bu, Jianping An", "title": "Multichannel RSS-based Device-Free Localization with Wireless Sensor\n  Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RSS-based device-free localization (DFL) is a very promising technique which\nallows localizing the target without attaching any electronic tags in wireless\nenvironments. In cluttered indoor environments, the performance of DFL degrades\ndue to multipath interference. In this paper, we propose a multichannel\nobstructed link detection method based on the RSS variation on difference\nchannels. Multichannel detection is proved to be very effective in multipath\nenvironments compared to the single channel detection. We also propose a new\nlocalization method termed as robust weighted least square (RWLS) method. RWLS\nfirst use spatial property to eliminate the interference links and then employ\nWLS method to localize the target. Since the spatial detection relies on the\nunknown position of the target. A coarse position estimation of target is also\npresented. RWLS is robust to interference links and has low computation\ncomplexity. Results from real experiments verify the effectiveness of the\nproposed method.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2014 13:15:03 GMT"}], "update_date": "2014-03-06", "authors_parsed": [["Wang", "Zhenghuan", ""], ["Liu", "Heng", ""], ["Xu", "Shengxin", ""], ["Bu", "Xiangyuan", ""], ["An", "Jianping", ""]]}, {"id": "1403.1274", "submitter": "Nicolas Broutin", "authors": "Nicolas Broutin, Luc Devroye and Gabor Lugosi", "title": "Almost optimal sparsification of random geometric graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.DM cs.NI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A random geometric irrigation graph $\\Gamma_n(r_n,\\xi)$ has $n$ vertices\nidentified by $n$ independent uniformly distributed points $X_1,\\ldots,X_n$ in\nthe unit square $[0,1]^2$. Each point $X_i$ selects $\\xi_i$ neighbors at\nrandom, without replacement, among those points $X_j$ ($j\\neq i$) for which\n$\\|X_i-X_j\\| < r_n$, and the selected vertices are connected to $X_i$ by an\nedge. The number $\\xi_i$ of the neighbors is an integer-valued random variable,\nchosen independently with identical distribution for each $X_i$ such that\n$\\xi_i$ satisfies $1\\le \\xi_i \\le \\kappa$ for a constant $\\kappa>1$. We prove\nthat when $r_n = \\gamma_n \\sqrt{\\log n/n}$ for $\\gamma_n \\to \\infty$ with\n$\\gamma_n =o(n^{1/6}/\\log^{5/6}n)$, then the random geometric irrigation graph\nexperiences explosive percolation in the sense that when $\\mathbf E \\xi_i=1$,\nthen the largest connected component has size $o(n)$ but if $\\mathbf E \\xi_i\n>1$, then the size of the largest connected component is with high probability\n$n-o(n)$. This offers a natural non-centralized sparsification of a random\ngeometric graph that is mostly connected.\n", "versions": [{"version": "v1", "created": "Wed, 5 Mar 2014 21:15:27 GMT"}, {"version": "v2", "created": "Fri, 7 Mar 2014 05:27:33 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Broutin", "Nicolas", ""], ["Devroye", "Luc", ""], ["Lugosi", "Gabor", ""]]}, {"id": "1403.1323", "submitter": "Yue Zhang", "authors": "Yue Zhang and Wangdong Qi and Guangxia Li and Su Zhang", "title": "Performance of ML Range Estimator in Radio Interferometric Positioning\n  Systems", "comments": "10 pages, 1 figure", "journal-ref": null, "doi": "10.1109/LSP.2014.2352270", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The radio interferometric positioning system (RIPS) is a novel positioning\nsolution used in wireless sensor networks. This letter explores the ranging\naccuracy of RIPS in two configurations. In the linear step-frequency (LSF)\nconfiguration, we derive the mean square error (MSE) of the maximum likelihood\n(ML) estimator. In the random step-frequency (RSF) configuration, we introduce\naverage MSE to characterize the performance of the ML estimator. The simulation\nresults fit well with theoretical analysis. It is revealed that RSF is superior\nto LSF in that the former is more robust in a jamming environment with similar\nranging accuracy.\n", "versions": [{"version": "v1", "created": "Thu, 6 Mar 2014 01:57:14 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Zhang", "Yue", ""], ["Qi", "Wangdong", ""], ["Li", "Guangxia", ""], ["Zhang", "Su", ""]]}, {"id": "1403.1381", "submitter": "Daniel Zaragoza", "authors": "Daniel Zaragoza", "title": "The TCP-modified Engset Model Revisited", "comments": "arXiv admin note: substantial text overlap with arXiv:1401.8173", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the TCP-modified Engset model proposed by Heyman et al. in [1].\nThe model deals with the superposition of a limited number of TCP connections\nalternating between file transmission and silence in a web-like fashion. We\nconsider homogeneous sources only. (a) We take into account the effects of slow\nstart and limited receiver window as well as small average file sizes. (b) We\npropose an alternative way for calculating the average connection rate in the\nsuperposition. (c) From the model we propose a way for calculating the queuing\nbehavior; i.e., the overflow probability. (d) From this last point, we propose\na new link buffer sizing rule. Comparison with extensive simulations shows that\nthe average rate and duration, as well as, link utilization are accurately\npredicted for exponentially distributed file sizes. For longer tail\ndistributions, the model remains accurate provided the receiver window is\nadjusted appropriately. The accuracy increases with increasing load. As\nconcerns the queuing behavior, the same observation applies. Finally, the\nrevisited model cannot be used to predict losses larger than about 1%. The\nmodel overestimates loss rates above that threshold.\n", "versions": [{"version": "v1", "created": "Thu, 6 Mar 2014 09:27:47 GMT"}], "update_date": "2014-03-07", "authors_parsed": [["Zaragoza", "Daniel", ""]]}, {"id": "1403.1383", "submitter": "Khalil Drira", "authors": "Luigi Alfredo Grieco (DEE), Mahdi Ben Alaya (LAAS), Thierry Monteil\n  (LAAS), Khalil Drira (LAAS)", "title": "Architecting Information Centric ETSI-M2M systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The European Telecommunications Standards Institute (ETSI) released a set of\nspecifications to define a restful architecture for enabling seamless service\nprovisioning across heterogeneous Machine-to-Machine (M2M) systems. The current\nversion of this architecture is strongly centralized, thus requiring new\nenhancements to its scalability, fault tolerance, and flexibility. To bridge\nthis gap, herein it is presented an Overlay Service Capability Layer, based on\nInformation Centric Networking design. Key features, example use cases and\npreliminary performance assessments are also discussed to highlight the\npotential of our approach.\n", "versions": [{"version": "v1", "created": "Thu, 6 Mar 2014 09:44:17 GMT"}], "update_date": "2014-03-07", "authors_parsed": [["Grieco", "Luigi Alfredo", "", "DEE"], ["Alaya", "Mahdi Ben", "", "LAAS"], ["Monteil", "Thierry", "", "LAAS"], ["Drira", "Khalil", "", "LAAS"]]}, {"id": "1403.1639", "submitter": "Soheil Eshghi", "authors": "Soheil Eshghi, MHR. Khouzani, Saswati Sarkar, Santosh S. Venkatesh", "title": "Optimal Patching in Clustered Malware Epidemics", "comments": "18 pages, 6 figures", "journal-ref": null, "doi": "10.1109/TNET.2014.2364034", "report-no": null, "categories": "cs.CR cs.NI cs.SI cs.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Studies on the propagation of malware in mobile networks have revealed that\nthe spread of malware can be highly inhomogeneous. Platform diversity, contact\nlist utilization by the malware, clustering in the network structure, etc. can\nalso lead to differing spreading rates. In this paper, a general formal\nframework is proposed for leveraging such heterogeneity to derive optimal\npatching policies that attain the minimum aggregate cost due to the spread of\nmalware and the surcharge of patching. Using Pontryagin's Maximum Principle for\na stratified epidemic model, it is analytically proven that in the mean-field\ndeterministic regime, optimal patch disseminations are simple single-threshold\npolicies. Through numerical simulations, the behavior of optimal patching\npolicies is investigated in sample topologies and their advantages are\ndemonstrated.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 02:53:15 GMT"}], "update_date": "2018-09-06", "authors_parsed": [["Eshghi", "Soheil", ""], ["Khouzani", "MHR.", ""], ["Sarkar", "Saswati", ""], ["Venkatesh", "Santosh S.", ""]]}, {"id": "1403.1642", "submitter": "Soheil Eshghi", "authors": "Soheil Eshghi, MHR. Khouzani, Saswati Sarkar, Ness B. Shroff, Santosh\n  S. Venkatesh", "title": "Optimal Energy-Aware Epidemic Routing in DTNs", "comments": "17 pages, 9 figures", "journal-ref": null, "doi": "10.1109/TAC.2015.2396641", "report-no": null, "categories": "cs.SY cs.DC cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we investigate the use of epidemic routing in energy\nconstrained Delay Tolerant Networks (DTNs). In epidemic routing, messages are\nrelayed by intermediate nodes at contact opportunities, i.e., when pairs of\nnodes come within the transmission range of each other. Each node needs to\ndecide whether to forward its message upon contact with a new node based on its\nown residual energy level and the age of that message. We mathematically\ncharacterize the fundamental trade-off between energy conservation and a\nmeasure of Quality of Service as a dynamic energy-dependent optimal control\nproblem. We prove that in the mean-field regime, the optimal dynamic forwarding\ndecisions follow simple threshold-based structures in which the forwarding\nthreshold for each node depends on its current remaining energy. We then\ncharacterize the nature of this dependence. Our simulations reveal that the\noptimal dynamic policy significantly outperforms heuristics.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 03:15:17 GMT"}, {"version": "v2", "created": "Tue, 2 Jun 2015 10:31:33 GMT"}], "update_date": "2018-09-06", "authors_parsed": [["Eshghi", "Soheil", ""], ["Khouzani", "MHR.", ""], ["Sarkar", "Saswati", ""], ["Shroff", "Ness B.", ""], ["Venkatesh", "Santosh S.", ""]]}, {"id": "1403.1655", "submitter": "Pavithra  G", "authors": "G. Pavithra and P. Devaki", "title": "Link and Location Based Routing Mechanism for Energy Efficiency in\n  Wireless Sensor Networks", "comments": "6 pages, 3 figures", "journal-ref": "IJETT Journal, Volume-8 Number-4, Year of Publication : 2014", "doi": "10.14445/22315381/IJETT-V8P239", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Wireless Sensor Networks, sensed data are reported to the sink by the\navailable nodes in the communication range. The sensed data should be reported\nto the sink with the frequency expected by the sink. In order to have a\ncommunication between source and sink, Link based routing is used. Link based\nrouting aims to achieve an energy efficient and reliable routing path. This\nmechanism considers the status (current energy level in terms of Joules) of\neach node, link condition (number of transmissions that the Cluster Head\n(CH)and the Gateway (GW) candidates conducts) and the transmit power (power\nrequired for transmission in terms of Joules). A metric called Predicted\nTransmission Count (PTX) for each node is calculated using its status, link\ncondition and transmit power. The node which has highest PTX will have the\nhighest priority and it will be the potential candidate to act as CH or GW.\nThus the selection of proper CH or GW reduces the energy consumption, and the\nnetwork lifetime is increased.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 05:07:44 GMT"}], "update_date": "2014-03-10", "authors_parsed": [["Pavithra", "G.", ""], ["Devaki", "P.", ""]]}, {"id": "1403.1729", "submitter": "Ahmad Taher Azar Dr.", "authors": "Amira Sayed A.Aziz, Ahmad Taher Azar, Aboul Ella Hassanien, Sanaa\n  Al-Ola Hanafy", "title": "Continuous Features Discretization for Anomaly Intrusion Detectors\n  Generation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network security is a growing issue, with the evolution of computer systems\nand expansion of attacks. Biological systems have been inspiring scientists and\ndesigns for new adaptive solutions, such as genetic algorithms. In this paper,\nwe present an approach that uses the genetic algorithm to generate anomaly net-\nwork intrusion detectors. In this paper, an algorithm propose use a\ndiscretization method for the continuous features selected for the intrusion\ndetection, to create some homogeneity between values, which have different data\ntypes. Then,the intrusion detection system is tested against the NSL-KDD data\nset using different distance methods. A comparison is held amongst the results,\nand it is shown by the end that this proposed approach has good results, and\nrecommendations is given for future experiments.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 11:59:33 GMT"}], "update_date": "2014-03-10", "authors_parsed": [["Aziz", "Amira Sayed A.", ""], ["Azar", "Ahmad Taher", ""], ["Hassanien", "Aboul Ella", ""], ["Hanafy", "Sanaa Al-Ola", ""]]}, {"id": "1403.1846", "submitter": "Shamim Ripon", "authors": "Shamim Ripon, Sumaya Mahbub and K. M. Intiaz-ud-Din", "title": "Verification of A Security Adaptive Protocol Suite Using SPIN", "comments": "3 pages, 1 Figure", "journal-ref": "International Journal of Engineering and Technology, vol. 5, no.\n  2, pp. 254-256, 2013", "doi": "10.7763/IJET.2013.V5.553", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The advancement of mobile and wireless communication technologies in recent\nyears introduced various adaptive protocols to adapt the need for secured\ncommunications. Security is a crucial success factor for any communication\nprotocols, especially in mobile environment due to its ad hoc behavior. Formal\nverification plays an important role in development and application of safety\ncritical systems. Formalized exhausted verification techniques to analyze the\nsecurity and the safety properties of communications protocols increase and\nconfirm the protocol confidence. SPIN is a powerful model checker that verifies\nthe correctness of distributed communication models in a rigorous and automated\nfashion. This short paper proposes a SPIN based formal verification approach of\na security adaptive protocol suite. The protocol suite includes a neighbor\ndiscovery mechanism and routing protocol. Both parts of the protocol suite are\nmodeled into SPIN and exhaustively checked various temporal properties which\nensure the applicability of the protocol suite in real-life applications.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 19:12:56 GMT"}], "update_date": "2014-03-10", "authors_parsed": [["Ripon", "Shamim", ""], ["Mahbub", "Sumaya", ""], ["Intiaz-ud-Din", "K. M.", ""]]}, {"id": "1403.1890", "submitter": "Sherin Abdel Hamid M.Sc.", "authors": "Sherin Abdel Hamid, Hossam S. Hassanein, Glen Takahara", "title": "Vehicle as a Resource (VaaR)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intelligent vehicles are considered key enablers for intelligent\ntransportation systems. They are equipped with resources/components to enable\nservices for vehicle occupants, other vehicles on the road, and third party\nrecipients. In-vehicle sensors, communication modules, and on-board units with\ncomputing and storage capabilities allow the intelligent vehicle to work as a\nmobile service provider of sensing, data storage, computing, cloud, data\nrelaying, infotainment, and localization services. In this paper, we introduce\nthe concept of Vehicle as a Resource (VaaR) and shed light on the services a\nvehicle can potentially provide on the road or parked. We anticipate that an\nintelligent vehicle can be a significant service provider in a variety of\nsituations, including emergency scenarios.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 22:37:18 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Hamid", "Sherin Abdel", ""], ["Hassanein", "Hossam S.", ""], ["Takahara", "Glen", ""]]}, {"id": "1403.2024", "submitter": "Pin-Yu Chen", "authors": "Pin-Yu Chen and Alfred O. Hero III", "title": "Node Removal Vulnerability of the Largest Component of a Network", "comments": "Published in IEEE GlobalSIP 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The connectivity structure of a network can be very sensitive to removal of\ncertain nodes in the network. In this paper, we study the sensitivity of the\nlargest component size to node removals. We prove that minimizing the largest\ncomponent size is equivalent to solving a matrix one-norm minimization problem\nwhose column vectors are orthogonal and sparse and they form a basis of the\nnull space of the associated graph Laplacian matrix. A greedy node removal\nalgorithm is then proposed based on the matrix one-norm minimization. In\ncomparison with other node centralities such as node degree and betweenness,\nexperimental results on US power grid dataset validate the effectiveness of the\nproposed approach in terms of reduction of the largest component size with\nrelatively few node removals.\n", "versions": [{"version": "v1", "created": "Sun, 9 Mar 2014 02:52:51 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Chen", "Pin-Yu", ""], ["Hero", "Alfred O.", "III"]]}, {"id": "1403.2077", "submitter": "Shabnam Sodagari", "authors": "Shabnam Sodagari", "title": "Application of Asynchronous Weak Commitment Search in Autonomous Quality\n  of Service Provision in Cognitive Radio Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a distributed solution to autonomous quality of service\nprovision in cognitive radio networks. Specifically, cognitive STDMA and CDMA\ncommunication networks are studied. Based on asynchronous weak commitment\nsearch the task of QoS provision is distributed among different network nodes.\nSimulation results verify this scheme converges very fast to optimal solution,\nwhich makes it suitable for practical real time systems. This application of\nartificial intelligence in wireless and mobile communications can be used in\nhome automation and networking, and vehicular technology. The generalizations\nand extensions of this approach can be used in Long Term Evolution Self\nOrganizing Networks (LTE-SONs). In addition, it can pave the way for\ndecentralized and autonomous QoS provision in capillary networks that reach end\nnodes at Internet of Things, where central management is either unavailable or\nnot efficient.\n", "versions": [{"version": "v1", "created": "Sun, 9 Mar 2014 16:56:23 GMT"}, {"version": "v2", "created": "Fri, 14 Mar 2014 16:53:51 GMT"}], "update_date": "2014-03-18", "authors_parsed": [["Sodagari", "Shabnam", ""]]}, {"id": "1403.2098", "submitter": "Zizhong Cao", "authors": "Zizhong Cao and Shivendra S. Panwar", "title": "Technical Report: Efficient Buffering and Scheduling for a Single-Chip\n  Crosspoint-Queued Switch", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The single-chip crosspoint-queued (CQ) switch is a compact switching\narchitecture that has all its buffers placed at the crosspoints of input and\noutput lines. Scheduling is also performed inside the switching core, and does\nnot rely on latency-limited communications with input or output line-cards.\nCompared with other legacy switching architectures, the CQ switch has the\nadvantages of high throughput, minimal delay, low scheduling complexity, and no\nspeedup requirement. However, the crosspoint buffers are small and segregated,\nthus how to efficiently use the buffers and avoid packet drops remains a major\nproblem that needs to be addressed. In this paper, we consider load balancing,\ndeflection routing, and buffer pooling for efficient buffer sharing in the CQ\nswitch. We also design scheduling algorithms to maintain the correct packet\norder even while employing multi-path switching and resolve contentions caused\nby multiplexing. All these techniques require modest hardware modifications and\nmemory speedup in the switching core, but can greatly boost the buffer\nutilizations by up to 10 times and reduce the packet drop rates by one to three\norders of magnitude. Extensive simulations and analyses have been done to\ndemonstrate the advantages of the proposed buffering and scheduling techniques\nin various aspects. By pushing the on-chip memory to the limit of current ASIC\ntechnology, we show that a cell drop rate of 10e-8, which is low enough for\npractical uses, can be achieved under real Internet traffic traces\ncorresponding to a load of 0.9.\n", "versions": [{"version": "v1", "created": "Sun, 9 Mar 2014 20:15:50 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Cao", "Zizhong", ""], ["Panwar", "Shivendra S.", ""]]}, {"id": "1403.2123", "submitter": "Emiliano De Cristofaro", "authors": "Julien Freudiger and Emiliano De Cristofaro and Alex Brito", "title": "Privacy-Friendly Collaboration for Cyber Threat Mitigation", "comments": "This paper has been withdrawn as it has been superseded by\n  arXiv:1502.05337", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sharing of security data across organizational boundaries has often been\nadvocated as a promising way to enhance cyber threat mitigation. However,\ncollaborative security faces a number of important challenges, including\nprivacy, trust, and liability concerns with the potential disclosure of\nsensitive data. In this paper, we focus on data sharing for predictive\nblacklisting, i.e., forecasting attack sources based on past attack\ninformation. We propose a novel privacy-enhanced data sharing approach in which\norganizations estimate collaboration benefits without disclosing their\ndatasets, organize into coalitions of allied organizations, and securely share\ndata within these coalitions. We study how different partner selection\nstrategies affect prediction accuracy by experimenting on a real-world dataset\nof 2 billion IP addresses and observe up to a 105% prediction improvement.\n", "versions": [{"version": "v1", "created": "Mon, 10 Mar 2014 01:28:11 GMT"}, {"version": "v2", "created": "Sat, 17 May 2014 22:38:15 GMT"}, {"version": "v3", "created": "Sun, 23 Nov 2014 13:13:15 GMT"}, {"version": "v4", "created": "Wed, 1 Mar 2017 15:30:47 GMT"}], "update_date": "2017-03-02", "authors_parsed": [["Freudiger", "Julien", ""], ["De Cristofaro", "Emiliano", ""], ["Brito", "Alex", ""]]}, {"id": "1403.2331", "submitter": "Guang Tan", "authors": "Bo Xie, Guang Tan, Yunhuai Liu, Mingming Lu, Kongyang Chen, and Tian\n  He", "title": "LIPS: A Light Intensity Based Positioning System For Indoor Environments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents LIPS, a Light Intensity based Positioning System for\nindoor environments. The system uses off-the-shelf LED lamps as signal sources,\nand uses light sensors as signal receivers. The design is inspired by the\nobservation that a light sensor has deterministic sensitivity to both distance\nand incident angle of light signal, an under-utilized feature of photodiodes\nnow widely found on mobile devices. We develop a stable and accurate light\nintensity model to capture the phenomenon, based on which a new positioning\nprinciple, Multi-Face Light Positioning (MFLP), is established that uses three\ncollocated sensors to uniquely determine the receiver's position, assuming\nmerely a single source of light. We have implemented a prototype on both\ndedicated embedded systems and smartphones. Experimental results show average\npositioning accuracy within 0.4 meters across different environments, with high\nstability against interferences from obstacles, ambient lights, temperature\nvariation, etc.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 07:55:41 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Xie", "Bo", ""], ["Tan", "Guang", ""], ["Liu", "Yunhuai", ""], ["Lu", "Mingming", ""], ["Chen", "Kongyang", ""], ["He", "Tian", ""]]}, {"id": "1403.2527", "submitter": "Runwei Zhang", "authors": "Runwei Zhang, Francois Ingelrest, Guillermo Barrenetxea, Patrick\n  Thiran, Martin Vetterli", "title": "The Beauty of the Commons: Optimal Load Sharing by Base Station Hopping\n  in Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In wireless sensor networks (WSNs), the base station (BS) is a critical\nsensor node whose failure causes severe data losses. Deploying multiple fixed\nBSs improves the robustness, yet requires all BSs to be installed with large\nbatteries and large energy-harvesting devices due to the high energy\nconsumption of BSs. In this paper, we propose a scheme to coordinate the\nmultiple deployed BSs such that the energy supplies required by individual BSs\ncan be substantially reduced. In this scheme, only one BS is selected to be\nactive at a time and the other BSs act as regular sensor nodes. We first\npresent the basic architecture of our system, including how we keep the network\nrunning with only one active BS and how we manage the handover of the role of\nthe active BS. Then, we propose an algorithm for adaptively selecting the\nactive BS under the spatial and temporal variations of energy resources. This\nalgorithm is simple to implement but is also asymptotically optimal under mild\nconditions. Finally, by running simulations and real experiments on an outdoor\ntestbed, we verify that the proposed scheme is energy-efficient, has low\ncommunication overhead and reacts rapidly to network changes.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2014 10:25:21 GMT"}, {"version": "v2", "created": "Fri, 14 Mar 2014 14:12:59 GMT"}, {"version": "v3", "created": "Mon, 15 Sep 2014 21:05:09 GMT"}], "update_date": "2014-09-17", "authors_parsed": [["Zhang", "Runwei", ""], ["Ingelrest", "Francois", ""], ["Barrenetxea", "Guillermo", ""], ["Thiran", "Patrick", ""], ["Vetterli", "Martin", ""]]}, {"id": "1403.2548", "submitter": "Neenu George", "authors": "Neenu George, T.K.Parani", "title": "Detection of Node Clones in Wireless Sensor Network Using Detection\n  Protocols", "comments": "6 pages,5 figures,\"Published with International Journal of\n  Engineering Trends and Technology (IJETT)\"Volume8 Number 6-Feb2014", "journal-ref": "nternational Journal of Engineering Trends and Technology (IJETT)\n  Volume8 Number 6-Feb2014", "doi": "10.14445/22315381/IJETT-V8P253", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks consist of hundreds to thousands of sensor nodes and\nare widely used in civilian and security applications. One of the serious\nphysical attacks faced by the wireless sensor network is node clone attack.\nThus two node clone detection protocols are introduced via distributed hash\ntable and randomly directed exploration to detect node clones. The former is\nbased on a hash table value which is already distributed and provides key based\nfacilities like checking and caching to detect node clones. The later one is\nusing probabilistic directed forwarding technique and border determination. The\nsimulation results for storage consumption, communication cost and detection\nprobability is done using NS2 and obtained randomly directed exploration is the\nbest one having low communication cost and storage consumption and has good\ndetection probability.\n  Keywords: wireless sensor networks (wsn), distributed hash table, randomly\ndirected exploration.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2014 12:06:26 GMT"}], "update_date": "2014-03-12", "authors_parsed": [["George", "Neenu", ""], ["Parani", "T. K.", ""]]}, {"id": "1403.2716", "submitter": "Ahmad Taher Azar Dr.", "authors": "Amira Sayed A. Aziz, Ahmad Taher Azar, Aboul Ella Hassanien, Sanaa\n  El-Ola Hanafy", "title": "Negative Selection Approach Application in Network Intrusion Detection\n  Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nature has always been an inspiration to researchers with its diversity and\nrobustness of its systems, and Artificial Immune Systems are one of them. Many\nalgorithms were inspired by ongoing discoveries of biological immune systems\ntechniques and approaches. One of the basic and most common approach is the\nNegative Selection Approach, which is simple and easy to implement. It was\napplied in many fields, but mostly in anomaly detection for the similarity of\nits basic idea. In this paper, a review is given on the application of negative\nselection approach in network security, specifically the intrusion detection\nsystem. As the work in this field is limited, we need to understand what the\nchallenges of this approach are. Recommendations are given by the end of the\npaper for future work.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2014 00:54:22 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Aziz", "Amira Sayed A.", ""], ["Azar", "Ahmad Taher", ""], ["Hassanien", "Aboul Ella", ""], ["Hanafy", "Sanaa El-Ola", ""]]}, {"id": "1403.2800", "submitter": "Peng Qin", "authors": "Peng Qin and Bin Dai and Benxiong Huang and Guan Xu", "title": "Bandwidth-Aware Scheduling with SDN in Hadoop: A New Trend for Big Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI cs.PF", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Software Defined Networking (SDN) is a revolutionary network architecture\nthat separates out network control functions from the underlying equipment and\nis an increasingly trend to help enterprises build more manageable data centers\nwhere big data processing emerges as an important part of applications. To\nconcurrently process large-scale data, MapReduce with an open source\nimplementation named Hadoop is proposed. In practical Hadoop systems one kind\nof issue that vitally impacts the overall performance is know as the\nNP-complete minimum make span problem. One main solution is to assign tasks on\ndata local nodes to avoid link occupation since network bandwidth is a scarce\nresource. Many methodologies for enhancing data locality are proposed such as\nthe HDS and state-of-the-art scheduler BAR. However, all of them either ignore\nallocating tasks in a global view or disregard available bandwidth as the basis\nfor scheduling. In this paper we propose a heuristic bandwidth-aware task\nscheduler BASS to combine Hadoop with SDN. It is not only able to guarantee\ndata locality in a global view but also can efficiently assign tasks in an\noptimized way. Both examples and experiments demonstrate that BASS has the best\nperformance in terms of job completion time. To our knowledge, BASS is the\nfirst to exploit talent of SDN for big data processing and we believe it points\nout a new trend for large-scale data processing.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2014 03:31:52 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Qin", "Peng", ""], ["Dai", "Bin", ""], ["Huang", "Benxiong", ""], ["Xu", "Guan", ""]]}, {"id": "1403.2814", "submitter": "Gideon Naah", "authors": "Gideon Naah and Edwin Boadu Okoampa", "title": "Clustering Effects on Wireless Mobile Ad-Hoc Networks Performances", "comments": "journal, 19 pages, 14 figures and 1 table,\n  http://airccse.org/journal/ijcsit2014_curr.html", "journal-ref": null, "doi": "10.5121/ijcsit.2014.6105", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new era is dawning for wireless mobile ad hoc networks where communication\nwill be done using a group of mobile devices called cluster, hence clustered\nnetwork. In a clustered network, protocols used by these mobile devices are\ndifferent from those used in a wired network; which helps to save computation\ntime and resources efficiently. This paper focuses on Cluster-Based Routing\nProtocol and Dynamic Source Routing. The results presented in this paper\nillustrates the implementation of Ad-hoc On-Demand Distance Vector routing\nprotocol for enhancing mobile nodes performance and lifetime in a clustered\nnetwork and to demonstrate how this routing protocol results in time efficient\nand resource saving in wireless mobile ad hoc networks.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2014 05:10:20 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Naah", "Gideon", ""], ["Okoampa", "Edwin Boadu", ""]]}, {"id": "1403.2914", "submitter": "Mayanka Katyal Miss", "authors": "Mayanka Katyal and Atul Mishra", "title": "Application of Selective Algorithm for Effective Resource Provisioning\n  in Cloud Computing Environment", "comments": "10 Pages, International Journal on Cloud Computing: Services and\n  Architecture (IJCCSA) ,Vol. 4, No. 1, February 2014", "journal-ref": "International Journal on Cloud Computing: Services and\n  Architecture (IJCCSA) ,Vol. 4, No. 1, February 2014", "doi": "10.5121/ijccsa.2014.4101", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern day continued demand for resource hungry services and applications in\nIT sector has led to development of Cloud computing. Cloud computing\nenvironment involves high cost infrastructure on one hand and need high scale\ncomputational resources on the other hand. These resources need to be\nprovisioned (allocation and scheduling) to the end users in most efficient\nmanner so that the tremendous capabilities of cloud are utilized effectively\nand efficiently. In this paper we discuss a selective algorithm for allocation\nof cloud resources to end-users on-demand basis. This algorithm is based on\nmin-min and max-min algorithms. These are two conventional task scheduling\nalgorithm. The selective algorithm uses certain heuristics to select between\nthe two algorithms so that overall makespan of tasks on the machines is\nminimized. The tasks are scheduled on machines in either space shared or time\nshared manner. We evaluate our provisioning heuristics using a cloud simulator,\ncalled CloudSim. We also compared our approach to the statistics obtained when\nprovisioning of resources was done in First-Cum-First- Serve(FCFS) manner. The\nexperimental results show that overall makespan of tasks on given set of VMs\nminimizes significantly in different scenarios.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2014 12:50:04 GMT"}], "update_date": "2014-03-18", "authors_parsed": [["Katyal", "Mayanka", ""], ["Mishra", "Atul", ""]]}, {"id": "1403.2919", "submitter": "Philipp Kindt", "authors": "Philipp Kindt and Daniel Yunge and Robert Diemer and Samarjit\n  Chakraborty", "title": "Precise Energy Modeling for the Bluetooth Low Energy Protocol", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bluetooth Low Energy (BLE) is a wireless protocol well suited for\nultra-low-power sensors running on small batteries. BLE is described as a new\nprotocol in the official Bluetooth 4.0 specification. To design\nenergy-efficient devices, the protocol provides a number of parameters that\nneed to be optimized within an energy, latency and throughput design space. To\nminimize power consumption, the protocol parameters have to be optimized for a\ngiven application. Therefore, an energy-model that can predict the energy\nconsumption of a BLE-based wireless device for different parameter value\nsettings, is needed. As BLE differs from the original Bluetooth significantly,\nmodels for Bluetooth cannot be easily applied to the BLE protocol. Since the\nlast one year, there have been a couple of proposals on energy models for BLE.\nHowever, none of them can model all the operating modes of the protocol. This\npaper presents a precise energy model of the BLE protocol, that allows the\ncomputation of a device's power consumption in all possible operating modes. To\nthe best of our knowledge, our proposed model is not only one of the most\naccurate ones known so far (because it accounts for all protocol parameters),\nbut it is also the only one that models all the operating modes of BLE.\nFurthermore, we present a sensitivity analysis of the different parameters on\nthe energy consumption and evaluate the accuracy of the model using both\ndiscrete event simulation and actual measurements. Based on this model,\nguidelines for system designers are presented, that help choosing the right\nparameters for optimizing the energy consumption for a given application.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2014 13:11:05 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Kindt", "Philipp", ""], ["Yunge", "Daniel", ""], ["Diemer", "Robert", ""], ["Chakraborty", "Samarjit", ""]]}, {"id": "1403.2990", "submitter": "Akanksha Tyagi", "authors": "Aditya Goyal, Akanksha Tyagi, Manisha Bhende, Swapnil Kawade", "title": "A Framework for Pricing Schemes for Networks under Complete Information", "comments": "5 pages, 6 figures, Published with International Journal of\n  Engineering Trends and Technology (IJETT). arXiv admin note: text overlap\n  with arXiv:1011.1065 by other authors", "journal-ref": "International Journal of Engineering Trends and Technology(IJETT),\n  V9(2),69-73 March 2014", "doi": "10.14445/22315381/IJETT-V9P214", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The revenue maximization problem of service provider is considered and\ndifferent pricing schemes to solve the above problem are implemented. The\nservice provider can choose an apt pricing scheme subjected to limited\nresources, if he knows the utility function and identity of the user. The\ncomplete price differentiation can achieve a large revenue gain but has high\nimplementation complexity. The partial price differentiation scheme to overcome\nthe high implementational complexity of complete price differentiation scheme\nis also studied. A polynomial- time algorithm is designed for partial price\ndifferentiation scheme that can compute the optimal partial differentiation\nprices. The willingness of the users to pay is also considered while designing\nprice differentiation schemes.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2014 15:53:41 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Goyal", "Aditya", ""], ["Tyagi", "Akanksha", ""], ["Bhende", "Manisha", ""], ["Kawade", "Swapnil", ""]]}, {"id": "1403.3017", "submitter": "Stefano Ferretti Stefano Ferretti", "authors": "Stefano Ferretti", "title": "Searching in Unstructured Overlays Using Local Knowledge and Gossip", "comments": "A revised version of the paper appears in Proc. of the 5th\n  International Workshop on Complex Networks (CompleNet 2014) - Studies in\n  Computational Intelligence Series, Springer-Verlag, Bologna (Italy), March\n  2014", "journal-ref": null, "doi": "10.1007/978-3-319-05401-8_7", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes a class of dissemination algorithms for the discovery of\ndistributed contents in Peer-to-Peer unstructured overlay networks. The\nalgorithms are a mix of protocols employing local knowledge of peers'\nneighborhood and gossip. By tuning the gossip probability and the depth k of\nthe k-neighborhood of which nodes have information, we obtain different\ndissemination protocols employed in literature over unstructured P2P overlays.\nThe provided analysis and simulation results confirm that, when properly\nconfigured, these schemes represent a viable approach to build effective P2P\nresource discovery in large-scale, dynamic distributed systems.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2014 16:41:54 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Ferretti", "Stefano", ""]]}, {"id": "1403.3162", "submitter": "Atta ur Rehman Khan", "authors": "Shahzad Ali, Sajjad A. Madani, Atta ur Rehman Khan, Imran Ali Khan", "title": "Routing protocols for mobile sensor networks: a comparative study", "comments": null, "journal-ref": "International Journal of Computer Systems Science & Engineering,\n  vol 29, no 1, March 2014", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a comparison of cluster-based position and non\nposition-based routing protocols for mobile wireless sensor networks to outline\ndesign considerations of protocols for mobile environments. The selected\nprotocols are compared on the basis of multiple parameters, which include\npacket delivery ratio, packet loss, network lifetime, and control overhead\nusing variable number of nodes and speeds. The extensive simulation and\nanalysis of results show that position-based routing protocols incur less\npacket loss as compared to the non position based protocols. However,\nposition-based protocols require localization mechanism or a GPS for the\nlocation information, which consumes energy and affects the network lifetime.\nAlternatively, non position-based protocols are more energy efficient and\nprovide extended network lifetime.\n", "versions": [{"version": "v1", "created": "Thu, 13 Mar 2014 04:49:27 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Ali", "Shahzad", ""], ["Madani", "Sajjad A.", ""], ["Khan", "Atta ur Rehman", ""], ["Khan", "Imran Ali", ""]]}, {"id": "1403.3312", "submitter": "Manish Dave", "authors": "Manish B Dave", "title": "Optimal number of users in Co-operative spectrum sensing in WRAN using\n  Cyclo-Stationary Detector", "comments": "5 pages, 6 figures, Published with International Journal of\n  Engineering Trends and Technology (IJETT)", "journal-ref": "International Journal of Engineering Trends and Technology (IJETT)\n  4(7):2806-2810, July 2013", "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cognitive radio allows unlicensed users to access licensed frequency bands\nthrough dynamic spectrum access so as to reduce spectrum scarcity. This\nrequires intelligent spectrum sensing techniques. This paper investigates the\nuse of cyclo-stationary detector and performance evaluation for Digital Video\nBroadcast-Terrestrial (DVB-T) signals. Generally, DVB-T is specified in IEEE\n802.22 standard in VHF and UHF TV broadcasting spectrum. Simulations results\nshow that implementing co-operative spectrum sensing help in better utilization\nof resources. The paper further proposes to find number of optimal users in a\nscenario to optimize the detection probability and makes use of the particle\nswarm optimization (PSO) technique to find an optimum value of threshold.\n", "versions": [{"version": "v1", "created": "Thu, 13 Mar 2014 16:09:08 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Dave", "Manish B", ""]]}, {"id": "1403.3325", "submitter": "Alessandro Zocca MSc", "authors": "Alessandro Zocca, Sem C. Borst, Johan S.H. van Leeuwaarden", "title": "Slow transitions, slow mixing and starvation in dense random-access\n  networks", "comments": "29 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider dense wireless random-access networks, modeled as systems of\nparticles with hard-core interaction. The particles represent the network users\nthat try to become active after an exponential back-off time, and stay active\nfor an exponential transmission time. Due to wireless interference, active\nusers prevent other nearby users from simultaneous activity, which we describe\nas hard-core interaction on a conflict graph. We show that dense networks with\naggressive back-off schemes lead to extremely slow transitions between dominant\nstates, and inevitably cause long mixing times and starvation effects.\n", "versions": [{"version": "v1", "created": "Thu, 13 Mar 2014 16:59:28 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Zocca", "Alessandro", ""], ["Borst", "Sem C.", ""], ["van Leeuwaarden", "Johan S. H.", ""]]}, {"id": "1403.3328", "submitter": "Madhulika Mool", "authors": "Madhulika Mool, Prajyoti Sabale, Sneha Parpelli, Shalaka Chowriwar,\n  Nilesh Sambhe", "title": "Mitigating Denial Of Services Using Secure Overlay Service Model", "comments": "5 Pages, 2 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Denial of service (DoS) and Distributed Denial of Service (DDoS) attacks\ncontinue to threaten the reliability of networking systems. Previous approaches\nfor protecting networks from DoS attacks are reactive in that they wait for an\nattack to be launched before taking appropriate measures to protect the\nnetwork. This leaves the door open for other attacks that use more\nsophisticated methods to mask their traffic. A secure overlay services (SOS)\narchitecture has been proposed to provide reliable communication between\nclients and a target under DoS attacks. The SOS architecture employs a set of\noverlay nodes arranged in three hierarchical layers that controls access to the\ntarget. We propose an architecture called secure overlay services (SOS) that\nproactively prevents denial of service (DoS) attacks, which works toward\nsupporting emergency services, or similar types of communication. The\narchitecture uses a combination of secure overlay tunneling, routing via\nconsistent hashing, and filtering. We reduce the probability of successful\nattacks by: 1) performing intensive filtering near protected network edges,\npushing the attack point into the core of the network, where high-speed routers\ncan handle the volume of attack traffic and 2) introducing randomness and\nanonymity into the forwarding architecture, making it difficult for an attacker\nto target nodes along the path to a specific SOSprotected destination. Using\nsimple analytical models, we evaluate the likelihood that an attacker can\nsuccessfully launch a DoS attack against an SOS protected network. Our analysis\ndemonstrates that such an architecture reduces the likelihood of a successful\nattack to minuscule levels.\n", "versions": [{"version": "v1", "created": "Thu, 13 Mar 2014 17:03:59 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Mool", "Madhulika", ""], ["Sabale", "Prajyoti", ""], ["Parpelli", "Sneha", ""], ["Chowriwar", "Shalaka", ""], ["Sambhe", "Nilesh", ""]]}, {"id": "1403.3349", "submitter": "Md. Munjure Mowla", "authors": "Md. Munjure Mowla, Md. Yeakub Ali and Rifat Ahmmed Aoni", "title": "Performance Comparison of Two Clipping Based Filtering Methods for PAPR\n  Reduction in OFDM Signal", "comments": "11 pages, 8 Figures, 5 Tables, Published: International Journal of\n  Mobile Network Communications & Telematics (IJMNCT), Vol. 4, No. 1, pp.23-34,\n  February 2014 (ISSN: 1839-5678)", "journal-ref": null, "doi": "10.5121/ijmnct.2014.4103", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growth of wireless communication technologies has been producing the\nintense demand for high-speed, efficient, reliable voice & data communication.\nAs a result, third generation partnership project (3GPP) has implemented next\ngeneration wireless communication technology long term evolution (LTE) which is\ndesigned to increase the capacity and speed of existing mobile telephone & data\nnetworks. LTE has adopted a multicarrier transmission technique known as\northogonal frequency division multiplexing (OFDM). OFDM meets the LTE\nrequirement for spectrum flexibility and enables cost-efficient solutions for\nvery wide carriers. One major generic problem of OFDM technique is high peak to\naverage power ratio (PAPR) which is defined as the ratio of the peak power to\nthe average power of the OFDM signal. A trade-off is necessary for reducing\nPAPR with increasing bit error rate (BER), computational complexity or data\nrate loss etc. In this paper, two clipping based filtering methods have been\nimplemented & also analyzed their modulation effects on reducing PAPR.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2014 17:02:01 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Mowla", "Md. Munjure", ""], ["Ali", "Md. Yeakub", ""], ["Aoni", "Rifat Ahmmed", ""]]}, {"id": "1403.3488", "submitter": "Juliusz Chroboczek", "authors": "Baptiste Jonglez, Matthieu Boutier (PPS), Juliusz Chroboczek (PPS)", "title": "A delay-based routing metric", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In overlay networks, both local and long-distance links appear as a single\nhop to a routing protocol. Traditional routing metrics (based on hop count or\npacket loss) fail to take the differences between such links into account. In\nthis paper, we study a metric based on packet delay that has been designed to\nimprove routing in overlay networks. We show a lightweight technique for\nmeasuring delay asynchronously, and show how to use the data it provides for\nconstructing a routing metric. Using delay naively leads to persistent routing\noscillations, so our routing protocol implements a number of features to bound\nthe frequency of oscillations. We show that our protocol causes no oscillations\nin real-world tests, and has oscillations with a period on the order of minutes\nin artificially constructed worst-case setups.\n", "versions": [{"version": "v1", "created": "Fri, 14 Mar 2014 05:40:38 GMT"}], "update_date": "2014-03-17", "authors_parsed": [["Jonglez", "Baptiste", "", "PPS"], ["Boutier", "Matthieu", "", "PPS"], ["Chroboczek", "Juliusz", "", "PPS"]]}, {"id": "1403.3553", "submitter": "Flavio Esposito", "authors": "Flavio Esposito and Ibrahim Matta", "title": "A Decomposition-based Architecture for Distributed Virtual Network\n  Embedding", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network protocols have historically been developed on an ad-hoc basis, and\ncloud computing is no exception. A fundamental management protocol, not yet\nstandardized, that cloud providers need to run to support wide-area virtual\nnetwork services is the virtual network (VN) embedding protocol. In this paper,\nwe use decomposition theory to provide a unifying architecture for the VN\nembedding problem. We show how our architecture subsumes existing solutions,\nand how it can be used by cloud providers to design a distributed VN embedding\nprotocol that adapts to different scenarios, by merely instantiating different\ndecomposition policies. We analyze key representative tradeoffs via simulation,\nand with our VN embedding testbed that uses a Linux system architecture to\nreserve virtual node and link capacities. In contrast with existing VN\nembedding solutions, we found that partitioning a VN request not only increases\nthe signaling overhead, but may decrease cloud providers' revenue.\n", "versions": [{"version": "v1", "created": "Fri, 14 Mar 2014 12:25:47 GMT"}], "update_date": "2014-03-17", "authors_parsed": [["Esposito", "Flavio", ""], ["Matta", "Ibrahim", ""]]}, {"id": "1403.3779", "submitter": "Souiki Sihem", "authors": "Sihem Souiki, Maghnia Feham, Mohamed Feham and Nabila Labraoui", "title": "Geographic routing protocols for underwater wireless sensor networks:a\n  survey", "comments": "19 pages, IJWMN journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Underwater wireless sensor networks (UWSN), similar to the terrestrial sensor\nnetworks, have different challenges such as limited bandwidth, low battery\npower, defective underwater channels, and high variable propagation delay. A\ncrucial problem in UWSN is finding an efficient route between a source and a\ndestination. Consequently, great efforts have been made for designing efficient\nprotocols while considering the unique characteristics of underwater\ncommunication. Several routing protocols are proposed for this issue and can be\nclassified into geographic and non-geographic routing protocols. In this paper\nwe focus on the geographic routing protocols. We introduce a review and\ncomparison of different algorithms proposed recently in the literature. We also\npresented a novel taxonomy of these routing in which the protocols are\nclassified into three categories (greedy, restricted directional flooding and\nhierarchical) according to their forwarding strategies.\n", "versions": [{"version": "v1", "created": "Sat, 15 Mar 2014 10:06:43 GMT"}], "update_date": "2014-03-18", "authors_parsed": [["Souiki", "Sihem", ""], ["Feham", "Maghnia", ""], ["Feham", "Mohamed", ""], ["Labraoui", "Nabila", ""]]}, {"id": "1403.3818", "submitter": "Maissa Boujelben", "authors": "Maissa Boujelben, Sonia Benrejeb, Sami Tabbane", "title": "Interference Coordination Schemes for Wireless Mobile Advanced Systems:\n  A Survey", "comments": "11 pages, 14 figures. e-ISSN: 2278-2834,p- ISSN: 2278-8735.Volume 9,\n  Issue 1, Ver. I (Feb. 2014), PP 00-00", "journal-ref": null, "doi": "10.9790/2834-09168090", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile communication networks have witnessed a perpetual evolution since\ntheir launching as voice only networks. In the few past years, the focus was\naddressed to high data rate networks that offer high quality of service. The\nlately released LTE-Advanced network was the first to completely fulfill 4G\nrequirements. However, performance gains remain limited due to severe\ninterference levels. This paper is a survey upon the evolution of interference\nmitigation solutions from Release 8 to Release 11. This problem was addressed\nsince earlier releases by coordinating transmission/reception among different\ncells. Many enhancements were then carried out by each subsequent\nspecification. The originality of this work resides on the comparison between\nthe different schemes and the perspective of developing a new interference\ncoordination method available for 4G and beyond systems with small cells\ndeployment. Several similarities are noted and differences on performance\nimpact are highlighted.\n", "versions": [{"version": "v1", "created": "Sat, 15 Mar 2014 15:37:24 GMT"}], "update_date": "2014-03-18", "authors_parsed": [["Boujelben", "Maissa", ""], ["Benrejeb", "Sonia", ""], ["Tabbane", "Sami", ""]]}, {"id": "1403.3891", "submitter": "Dong Min Kim", "authors": "Dong Min Kim and Seong-Lyun Kim", "title": "Exploiting Regional Differences: A Spatially Adaptive Random Access", "comments": "10 pages, 10 figures", "journal-ref": null, "doi": "10.1109/TWC.2015.2419633", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we discuss the potential for improvement of the simple random\naccess scheme by utilizing local information such as the received\nsignal-to-interference-plus-noise-ratio (SINR). We propose a spatially adaptive\nrandom access (SARA) scheme in which the transmitters in the network utilize\ndifferent transmit probabilities depending on the local situation. In our\nproposed scheme, the transmit probability is adaptively updated by the ratio of\nthe received SINR and the target SINR. We investigate the performance of the\nspatially adaptive random access scheme. For the comparison, we derive an\noptimal transmit probability of ALOHA random access scheme in which all\ntransmitters use the same transmit probability. We illustrate the performance\nof the spatially adaptive random access scheme through simulations. We show\nthat the performance of the proposed scheme surpasses that of the optimal ALOHA\nrandom access scheme and is comparable with the CSMA/CA scheme.\n", "versions": [{"version": "v1", "created": "Sun, 16 Mar 2014 08:38:13 GMT"}, {"version": "v2", "created": "Fri, 5 Sep 2014 13:50:33 GMT"}, {"version": "v3", "created": "Tue, 13 Jan 2015 09:59:11 GMT"}, {"version": "v4", "created": "Tue, 7 Apr 2015 19:15:11 GMT"}, {"version": "v5", "created": "Fri, 1 May 2015 22:15:17 GMT"}], "update_date": "2015-05-05", "authors_parsed": [["Kim", "Dong Min", ""], ["Kim", "Seong-Lyun", ""]]}, {"id": "1403.3993", "submitter": "Vaishali Khairnar mrs", "authors": "Mrs. Vaishali D. Khairnar and Dr. S.N. Pradhan", "title": "V2V communication survey wireless technology", "comments": "04 Pages, 02 figures", "journal-ref": "Int.J.Computer Technology & Applications,Vol 3 (1), 370-373\n  Jan-Feb 2012 ISSN:2229-6093", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the specific application of wireless\ncommunication,automotive Wireless Communication also called as Vehicle to\nVehicle Communication.It explains the technology used for automotive Wireless\nCommunication along with the various automotive applications relying on\nwireless communication. Automotive Wireless Communication gives drivers a sixth\nsense to know whats going on around them to help avoid accidents and improve\ntraffic flow.The paper also describes VANETS (vehicular adhoc networks) and\nreal world test network implementation.Finally,the paper is summarized.\n", "versions": [{"version": "v1", "created": "Mon, 17 Mar 2014 04:12:44 GMT"}], "update_date": "2014-03-18", "authors_parsed": [["Khairnar", "Mrs. Vaishali D.", ""], ["Pradhan", "Dr. S. N.", ""]]}, {"id": "1403.4144", "submitter": "Qing He", "authors": "Qing He, Vangelis Angelakis, Anthony Ephremides, and Di Yuan", "title": "Polynomial Complexity Minimum-Time Scheduling in a Class of Wireless\n  Networks", "comments": "Submitted to IEEE Transactions on Control of Network Systems on Dec.\n  2013", "journal-ref": null, "doi": "10.1109/TCNS.2015.2512678", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a wireless network with a set of transmitter-receiver pairs, or\nlinks, that share a common channel, and address the problem of emptying finite\ntraffic volume from the transmitters in minimum time. This, so called,\nminimum-time scheduling problem has been proved to be NP-hard in general. In\nthis paper, we study a class of minimum-time scheduling problems in which the\nlink rates have a particular structure consistent with the assumed environment\nand topology. We show that global optimality can be reached in polynomial time\nand derive optimality conditions. Then we consider a more general case in which\nwe apply the same approach and thus obtain approximation as well as lower and\nupper bounds to the optimal solution. Simulation results confirm and validate\nour approach.\n", "versions": [{"version": "v1", "created": "Mon, 17 Mar 2014 16:00:16 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["He", "Qing", ""], ["Angelakis", "Vangelis", ""], ["Ephremides", "Anthony", ""], ["Yuan", "Di", ""]]}, {"id": "1403.4342", "submitter": "Taesoo Kwon", "authors": "Taesoo Kwon and Ji-Woong Choi", "title": "Spatial Performance Analysis and Design Principles for Wireless Peer\n  Discovery", "comments": "12 pages (double columns), 10 figures, 1 table, to appear in the IEEE\n  Transactions on Wireless Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In wireless peer-to-peer networks that serve various proximity-based\napplications, peer discovery is the key to identifying other peers with which a\npeer can communicate and an understanding of its performance is fundamental to\nthe design of an efficient discovery operation. This paper analyzes the\nperformance of wireless peer discovery through comprehensively considering the\nwireless channel, spatial distribution of peers, and discovery operation\nparameters. The average numbers of successfully discovered peers are expressed\nin closed forms for two widely used channel models, i.e., the interference\nlimited Nakagami-m fading model and the Rayleigh fading model with nonzero\nnoise, when peers are spatially distributed according to a homogeneous Poisson\npoint process. These insightful expressions lead to the design principles for\nthe key operation parameters including the transmission probability, required\namount of wireless resources, level of modulation and coding scheme (MCS), and\ntransmit power. Furthermore, the impact of shadowing on the spatial performance\nand suggested design principles is evaluated using mathematical analysis and\nsimulations.\n", "versions": [{"version": "v1", "created": "Tue, 18 Mar 2014 05:13:29 GMT"}, {"version": "v2", "created": "Mon, 12 May 2014 03:16:16 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["Kwon", "Taesoo", ""], ["Choi", "Ji-Woong", ""]]}, {"id": "1403.4469", "submitter": "Rahul Upadhyay", "authors": "Rahul R Upadhyay", "title": "Synchronous Relaying Of Sensor Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we have put forth a novel methodology to relay data obtained by\ninbuilt sensors of smart phones in real time to remote database followed by\nfetching of this data . Smart phones are becoming very common and they are\nlaced with a number of sensors that can not only be used in native applications\nbut can also be sent to external nodes to be used by third parties for\napplication and service development.\n", "versions": [{"version": "v1", "created": "Sat, 15 Mar 2014 15:55:26 GMT"}], "update_date": "2014-03-19", "authors_parsed": [["Upadhyay", "Rahul R", ""]]}, {"id": "1403.4482", "submitter": "Pili Hu", "authors": "Pili Hu, Qijiang Fan, Wing Cheong Lau", "title": "SNSAPI: A Cross-Platform Middleware for Rapid Deployment of\n  Decentralized Social Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present the design, implementation and our year-long\nmaintenance experience of SNSAPI, a Python-based middleware which unifies the\ninterfaces and data structures of heterogeneous Social Networking Services\n(SNS). Unlike most prior works, our middleware is user-oriented and requires\nzero infrastructure support. It enables a user to readily conduct online social\nactivities in a programmable, cross-platform fashion while gradually reducing\nthe dependence on centralized Online Social Networks (OSN). More importantly,\nas the SNSAPI middleware can be used to support decentralized social networking\nservices via conventional communication channels such as RSS or Email, it\nenables the deployment of Decentralized Social Networks (DSN) in an\nincremental, ad hoc manner. To demonstrate the viability of such type of DSNs,\nwe have deployed an experimental 6000-node SNSAPI-based DSN on PlanetLab and\nevaluate its performance by replaying traces of online social activities\ncollected from a mainstream OSN. Our results show that, with only mild resource\nconsumption, the SNSAPI-based DSN can achieve acceptable forwarding latency\ncomparable to that of a centralized OSN. We also develop an analytical model to\ncharacterize the trade-offs between resource consumption and message forwarding\ndelay in our DSN. Via 20 parameterized experiments on PlanetLab, we have found\nthat the empirical measurement results match reasonably with the performance\npredicted by our analytical model.\n", "versions": [{"version": "v1", "created": "Tue, 18 Mar 2014 14:43:15 GMT"}], "update_date": "2014-03-19", "authors_parsed": [["Hu", "Pili", ""], ["Fan", "Qijiang", ""], ["Lau", "Wing Cheong", ""]]}, {"id": "1403.4523", "submitter": "Orestis Georgiou", "authors": "Justin P. Coon, Orestis Georgiou, Carl P. Dettmann", "title": "Connectivity in Dense Networks Confined within Right Prisms", "comments": "8 pages, 6 figures. arXiv admin note: text overlap with\n  arXiv:1201.4013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the probability that a dense wireless network confined within a\ngiven convex geometry is fully connected. We exploit a recently reported theory\nto develop a systematic methodology for analytically characterizing the\nconnectivity probability when the network resides within a convex right prism,\na polyhedron that accurately models many geometries that can be found in\npractice. To maximize practicality and applicability, we adopt a general\npoint-to-point link model based on outage probability, and present example\nanalytical and numerical results for a network employing $2 \\times 2$\nmultiple-input multiple-output (MIMO) maximum ratio combining (MRC) link level\ntransmission confined within particular bounding geometries. Furthermore, we\nprovide suggestions for extending the approach detailed herein to more general\nconvex geometries.\n", "versions": [{"version": "v1", "created": "Tue, 18 Mar 2014 16:33:36 GMT"}], "update_date": "2014-03-19", "authors_parsed": [["Coon", "Justin P.", ""], ["Georgiou", "Orestis", ""], ["Dettmann", "Carl P.", ""]]}, {"id": "1403.4637", "submitter": "Xiaohui Liu", "authors": "Xiaohui Liu, Hongwei Zhang", "title": "A Maximal Concurrency and Low Latency Distributed Scheduling Protocol\n  for Wireless Sensor Networks", "comments": "final version; 6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Existing work that schedules concurrent transmissions collision-free suffers\nfrom low channel utilization. We propose the Optimal Node Activation Multiple\nAccess (ONAMA) protocol to achieve maximal channel spatial reuse through a\ndistributed maximal independent set (DMIS) algorithm. To overcome DMIS's\nexcessive delay in finding a maximal independent set, we devise a novel\ntechnique called pipelined precomputation that decouples DMIS from data\ntransmission. We implement ONAMA on resource-constrained TelosB motes using\nTinyOS. Extensive measurements on two testbeds independently attest to ONAMA's\nsuperb performance compared to existing work: improving concurrency,\nthroughput, and delay by a factor of 3.7, 3.0, and 5.3, respectively, while\nstill maintaining reliability.\n", "versions": [{"version": "v1", "created": "Tue, 18 Mar 2014 22:41:49 GMT"}, {"version": "v2", "created": "Tue, 1 Apr 2014 19:05:43 GMT"}], "update_date": "2014-04-02", "authors_parsed": [["Liu", "Xiaohui", ""], ["Zhang", "Hongwei", ""]]}, {"id": "1403.4677", "submitter": "David Bild", "authors": "David R. Bild, Yue Liu, Robert P. Dick, Z. Morley Mao, and Dan S.\n  Wallach", "title": "Performance Analysis of Location Profile Routing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose using the predictability of human motion to eliminate the overhead\nof distributed location services in human-carried MANETs, dubbing the technique\nlocation profile routing. This method outperforms the Geographic Hashing\nLocation Service when nodes change locations 2x more frequently than they\ninitiate connections (e.g., start new TCP streams), as in applications like\ntext- and instant-messaging. Prior characterizations of human mobility are used\nto show that location profile routing achieves a 93% delivery ratio with a\n1.75x first-packet latency increase relative to an oracle location service.\n", "versions": [{"version": "v1", "created": "Wed, 19 Mar 2014 03:03:44 GMT"}], "update_date": "2014-03-20", "authors_parsed": [["Bild", "David R.", ""], ["Liu", "Yue", ""], ["Dick", "Robert P.", ""], ["Mao", "Z. Morley", ""], ["Wallach", "Dan S.", ""]]}, {"id": "1403.5007", "submitter": "Guanfeng Liang", "authors": "Guanfeng Liang and Ulas C. Kozat", "title": "On Throughput-Delay Optimal Access to Storage Clouds via Load Adaptive\n  Coding and Chunking", "comments": "arXiv admin note: substantial text overlap with arXiv:1307.8083", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent literature including our past work provide analysis and solutions for\nusing (i) erasure coding, (ii) parallelism, or (iii) variable slicing/chunking\n(i.e., dividing an object of a specific size into a variable number of smaller\nchunks) in speeding the I/O performance of storage clouds. However, a\ncomprehensive approach that considers all three dimensions together to achieve\nthe best throughput-delay trade-off curve had been lacking. This paper presents\nthe first set of solutions that can pick the best combination of coding rate\nand object chunking/slicing options as the load dynamically changes. Our\nspecific contributions are as follows: (1) We establish via measurement that\ncombining variable coding rate and chunking is mostly feasible over a popular\npublic cloud. (2) We relate the delay optimal values for chunking level and\ncode rate to the queue backlogs via an approximate queueing analysis. (3) Based\non this analysis, we propose TOFEC that adapts the chunking level and coding\nrate against the queue backlogs. Our trace-driven simulation results show that\nTOFEC's adaptation mechanism converges to an appropriate code that provides the\noptimal throughput-delay trade-off without reducing system capacity. Compared\nto a non-adaptive strategy optimized for throughput, TOFEC delivers $2.5\\times$\nlower latency under light workloads; compared to a non-adaptive strategy\noptimized for latency, TOFEC can scale to support over $3\\times$ as many\nrequests. (4) We propose a simpler greedy solution that performs on a par with\nTOFEC in average delay performance, but exhibits significantly more performance\nvariations.\n", "versions": [{"version": "v1", "created": "Thu, 20 Mar 2014 00:23:05 GMT"}], "update_date": "2014-03-21", "authors_parsed": [["Liang", "Guanfeng", ""], ["Kozat", "Ulas C.", ""]]}, {"id": "1403.5049", "submitter": "Neha Mishra", "authors": "Neha Mishra", "title": "Hybrid Virtual network Embedding Algorithm with K-core Decomposition\n  using Path Splitting", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network virtualization is an efficient approach of solving the ossification\nproblem of the Internet. It has become a promising way of supporting lots of\nheterogeneous network onto substrate physical network. A major challenge in\nnetwork virtualization is how to map multiple virtual networks onto specific\nnodes and links in the shared substrate network, known as virtual network\nembedding problem. Due to its NPhardness, many heuristic approaches have been\nproposed. In this thesis, we propose hybrid VN embedding algorithms that map\nmultiple VN requests with node and link constraints with K-core decomposition\nusing path splitting. Based on network pruning, a virtual network is decomposed\nto core network and edge network. The mapping process is divided into two\nphases: core network mapping and edge network mapping. Path splitting enables\nbetter resource utilization by allowing the substrate to accept more VN\nrequests. It splits the available bandwidth of the path into small bandwidth to\nsatisfy the resource constraints. The proposed algorithm improves the\nperformance of the algorithm by splitting the path into small bandwidth. Due to\npath splitting proposed algorithm will accept many virtual network requests\nthat will increase the revenue and acceptance ratio of the algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 20 Mar 2014 06:44:31 GMT"}, {"version": "v2", "created": "Thu, 13 Nov 2014 09:58:57 GMT"}], "update_date": "2014-11-14", "authors_parsed": [["Mishra", "Neha", ""]]}, {"id": "1403.5479", "submitter": "Felipe Olmos", "authors": "Felipe Olmos, Bruno Kauffmann, Alain Simonian, Yannick Carlinet", "title": "Catalog Dynamics: Impact of Content Publishing and Perishing on the\n  Performance of a LRU Cache", "comments": "13 Pages, 9 figures. Full version of the article submitted to the ITC\n  2014 conference. Small corrections in the appendix from the previous version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet heavily relies on Content Distribution Networks and transparent\ncaches to cope with the ever-increasing traffic demand of users. Content,\nhowever, is essentially versatile: once published at a given time, its\npopularity vanishes over time. All requests for a given document are then\nconcentrated between the publishing time and an effective perishing time.\n  In this paper, we propose a new model for the arrival of content requests,\nwhich takes into account the dynamical nature of the content catalog. Based on\ntwo large traffic traces collected on the Orange network, we use the\nsemi-experimental method and determine invariants of the content request\nprocess. This allows us to define a simple mathematical model for content\nrequests; by extending the so-called \"Che approximation\", we then compute the\nperformance of a LRU cache fed with such a request process, expressed by its\nhit ratio. We numerically validate the good accuracy of our model by comparison\nto trace-based simulation.\n", "versions": [{"version": "v1", "created": "Fri, 21 Mar 2014 14:44:55 GMT"}, {"version": "v2", "created": "Mon, 24 Mar 2014 14:55:51 GMT"}, {"version": "v3", "created": "Thu, 11 Sep 2014 09:46:17 GMT"}], "update_date": "2014-09-12", "authors_parsed": [["Olmos", "Felipe", ""], ["Kauffmann", "Bruno", ""], ["Simonian", "Alain", ""], ["Carlinet", "Yannick", ""]]}, {"id": "1403.5543", "submitter": "Anais Vergne", "authors": "Ana\\\"is Vergne (LTCI), Ian Flint (LTCI), Laurent Decreusefond (LTCI),\n  Philippe Martins (LTCI)", "title": "Disaster Recovery in Wireless Networks: A Homology-Based Algorithm", "comments": "arXiv admin note: substantial text overlap with arXiv:1312.1664", "journal-ref": null, "doi": "10.1109/ICT.2014.6845113", "report-no": null, "categories": "math.PR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present an algorithm for the recovery of wireless networks\nafter a disaster. Considering a damaged wireless network, presenting coverage\nholes or/and many disconnected components, we propose a disaster recovery\nalgorithm which repairs the network. It provides the list of locations where to\nput new nodes in order to patch the coverage holes and mend the disconnected\ncomponents. In order to do this we first consider the simplicial complex\nrepresentation of the network, then the algorithm adds supplementary vertices\nin excessive number, and afterwards runs a reduction algorithm in order to\nreach an optimal result. One of the novelty of this work resides in the\nproposed method for the addition of vertices. We use a determinantal point\nprocess: the Ginibre point process which has inherent repulsion between\nvertices, and has never been simulated before for wireless networks\nrepresentation. We compare both the determinantal point process addition method\nwith other vertices addition methods, and the whole disaster recovery algorithm\nto the greedy algorithm for the set cover problem.\n", "versions": [{"version": "v1", "created": "Fri, 21 Mar 2014 18:58:16 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Vergne", "Anaïs", "", "LTCI"], ["Flint", "Ian", "", "LTCI"], ["Decreusefond", "Laurent", "", "LTCI"], ["Martins", "Philippe", "", "LTCI"]]}, {"id": "1403.5712", "submitter": "Kyeong Soo (Joseph) Kim", "authors": "Kyeong Soo Kim", "title": "Deficit Round-Robin-Based ISP Traffic Control Scheme Enabling Excess\n  Bandwidth Allocation in Shared Access Networks", "comments": "5 pages, 6 figures, submitted to ICC 2015, Jul. 26, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In shared access shaping subscriber traffic based on token bucket by ISPs\nwastes network resources when there are few active subscribers, because it\ncannot allocate excess bandwidth in the long term. To address it, traffic\ncontrol schemes based on core-stateless fair queueing (CSFQ) and token bucket\nmeters (TBMs) have been proposed, which can allocate excess bandwidth among\nactive subscribers proportional to their token generation rates. Using FIFO\nqueue for all packets, however, degrades the short-term performance of\nconformant traffic due to the presence of non-conformant packets already in the\nqueue. Also, the rate estimation based on exponential averaging makes it\ndifficult to react to rapid changes in traffic conditions. In this paper we\npropose a new traffic control scheme based on deficit round-robin (DRR) and\nTBMs to guarantee the quality of service of conformant packets in all time\nscales while allocating excess bandwidth among active subscribers proportional\nto their token generation rates, whose advantages over the CSFQ-based schemes\nare demonstrated through simulation results.\n", "versions": [{"version": "v1", "created": "Sun, 23 Mar 2014 00:47:05 GMT"}, {"version": "v2", "created": "Tue, 25 Mar 2014 07:42:08 GMT"}, {"version": "v3", "created": "Fri, 3 Oct 2014 08:52:13 GMT"}], "update_date": "2014-10-06", "authors_parsed": [["Kim", "Kyeong Soo", ""]]}, {"id": "1403.5723", "submitter": "Lingyang Song", "authors": "Lingyang Song, Dusit Niyato, Zhu Han, and Ekram Hossain", "title": "Game-theoretic Resource Allocation Methods for Device-to-Device (D2D)\n  Communication", "comments": "Accepted. IEEE Wireless Comms Mag. 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Device-to-device (D2D) communication underlaying cellular networks allows\nmobile devices such as smartphones and tablets to use the licensed spectrum\nallocated to cellular services for direct peer-to-peer transmission. D2D\ncommunication can use either one-hop transmission (i.e., in D2D direct\ncommunication) or multi-hop cluster-based transmission (i.e., in D2D local area\nnetworks). The D2D devices can compete or cooperate with each other to reuse\nthe radio resources in D2D networks. Therefore, resource allocation and access\nfor D2D communication can be treated as games. The theories behind these games\nprovide a variety of mathematical tools to effectively model and analyze the\nindividual or group behaviors of D2D users. In addition, game models can\nprovide distributed solutions to the resource allocation problems for D2D\ncommunication. The aim of this article is to demonstrate the applications of\ngame-theoretic models to study the radio resource allocation issues in D2D\ncommunication. The article also outlines several key open research directions.\n", "versions": [{"version": "v1", "created": "Sun, 23 Mar 2014 05:36:48 GMT"}], "update_date": "2014-03-25", "authors_parsed": [["Song", "Lingyang", ""], ["Niyato", "Dusit", ""], ["Han", "Zhu", ""], ["Hossain", "Ekram", ""]]}, {"id": "1403.5824", "submitter": "Terence H. Chan", "authors": "Guanghua Zhu and Linda M. Davis and Terence Chan", "title": "Energy-Throughput Trade-offs in a Wireless Sensor Network with Mobile\n  Relay", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we analyze the trade-offs between energy and throughput for\nlinks in a wireless sensor network. Our application of interest is one in which\na number of low-powered sensors need to wirelessly communicate their\nmeasurements to a communications sink, or destination node, for communication\nto a central processor. We focus on one particular sensor source, and consider\nthe case where the distance to the destination is beyond the peak power of the\nsource. A relay node is required. Transmission energy of the sensor and the\nrelay can be adjusted to minimize the total energy for a given throughput of\nthe connection from sensor source to destination. We introduce a bounded random\nwalk model for movement of the relay between the sensor and destination nodes,\nand characterize the total transmission energy and throughput performance using\nMarkov steady state analysis. Based on the trade-offs between total energy and\nthroughput we propose a new time-sharing protocol to exploit the movement of\nthe relay to reduce the total energy. We demonstrate the effectiveness of\ntime-sharing for minimizing the total energy consumption while achieving the\nthroughput requirement. We then show that the time-sharing scheme is more\nenergy efficient than the popular sleep mode scheme.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 01:05:49 GMT"}], "update_date": "2014-03-27", "authors_parsed": [["Zhu", "Guanghua", ""], ["Davis", "Linda M.", ""], ["Chan", "Terence", ""]]}, {"id": "1403.5828", "submitter": "Peng Qin", "authors": "Peng Qin and Bin Dai and Benxiong Huang and Guan Xu and Kui Wu", "title": "A Survey on Network Tomography with Network Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The overhead of internal network monitoring motivates techniques of network\ntomography. Network coding (NC) presents a new opportunity for network\ntomography as NC introduces topology-dependent correlation that can be further\nexploited in topology estimation. Compared with traditional methods, network\ntomography with NC has many advantages such as the improvement of tomography\naccuracy and the reduction of complexity in choosing monitoring paths. In this\npaper we first introduce the problem of tomography with NC and then propose the\ntaxonomy criteria to classify various methods. We also present existing\nsolutions and future trend. We expect that our comprehensive review on network\ntomography with NC can serve as a good reference for researchers and\npractitioners working in the area.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 01:34:35 GMT"}], "update_date": "2014-03-25", "authors_parsed": [["Qin", "Peng", ""], ["Dai", "Bin", ""], ["Huang", "Benxiong", ""], ["Xu", "Guan", ""], ["Wu", "Kui", ""]]}, {"id": "1403.5858", "submitter": "Ali A. Khavasi", "authors": "Ali A. Khavasi, Mojtaba Aajami, Hae-Ryeon Park and Jung-Bong Suk", "title": "Utility Max-Min Fair Link Adaptation in IEEE 802.11ac Downlink\n  Multi-User", "comments": "Has been accepted in IEEE Communications Letters", "journal-ref": null, "doi": "10.1109/LCOMM.2014.040214.140482", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this letter, we propose a novel model and corresponding algorithms to\naddress the optimal utility max-min fair link adaptation in Downlink Multi-User\n(DL-MU) feature of the emerging IEEE 802.11ac WLAN standard. Herein, we first\npropose a simple yet accurate model to formulate the max-min fair link\nadaptation problem. Furthermore, this model guarantees the minimum utility gain\nof each receiver according to its requirements. In the second step, we show\nthat the optimal solution of the proposed model can be obtained in polynomial\ntime, and then the solution algorithms are proposed and analyzed. The\nsimulation results demonstrate the significant achievement of the proposed\nutility-aware link adaptation approach in terms of max-min fairness and utility\ngain compared to utility-oblivious schemes.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 05:44:36 GMT"}], "update_date": "2014-04-24", "authors_parsed": [["Khavasi", "Ali A.", ""], ["Aajami", "Mojtaba", ""], ["Park", "Hae-Ryeon", ""], ["Suk", "Jung-Bong", ""]]}, {"id": "1403.6013", "submitter": "Vaishali Khairnar mrs", "authors": "Vaishali D. Khairnar, Dr.S.N.Pradhan", "title": "Simulation Based: Study and Analysis of Routing Protocol in Vehicular\n  Ad-hoc Network Environment", "comments": "09 pages,18 figures", "journal-ref": "Int.J.Computer Technology & Applications,Vol 3(2),617-625 ISSN\n  2229-6093,March - April 2012", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Vehicular Ad hoc Network consists of vehicles which communicate with each\nother and exchange data via wireless communication links available between the\nvehicles which are in communication ranges of vehicles to improve the road\nsafety in city.The communication between vehicles is used to provide road\nsafety, comfort and entertainment.The performance of communication depends on\nhow better routing takes place in the network.Routing data between the source\nand destination vehicle depends on the routing protocols being used in\nvehicular adhoc network.In this simulation based study we investigated about\ndifferent ad hoc routing protocols for vehicular adhoc network.The main goal of\nour study was to identify which ad hoc routing protocol has better performance\nin highly mobile environment of vehicular adhoc network.We have measured the\nperformance of routing protocols using 802.11p in vehicular adhoc network in\nwhich we considered the scenario of city i.e. Route between Nerul and Vashi\nwhere we have taken 1200 different types of vehicles and checked their\nperformance.Routing protocols are selected after the literature review.The\nselected protocols are then evaluated through simulation under 802.11p in terms\nof performance metrics i.e PDR & E2E delay.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 15:48:44 GMT"}], "update_date": "2014-03-25", "authors_parsed": [["Khairnar", "Vaishali D.", ""], ["Pradhan", "Dr. S. N.", ""]]}, {"id": "1403.6150", "submitter": "Emil Bj\\\"ornson", "authors": "Emil Bj\\\"ornson, Luca Sanguinetti, Jakob Hoydis, M\\'erouane Debbah", "title": "Optimal Design of Energy-Efficient Multi-User MIMO Systems: Is Massive\n  MIMO the Answer?", "comments": "To appear in IEEE Transactions on Wireless Communications, 16 pages,\n  14 figures, 2 tables. The results can be reproduced using the following\n  Matlab code: https://github.com/emilbjornson/is-massive-MIMO-the-answer", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assume that a multi-user multiple-input multiple-output (MIMO) system is\ndesigned from scratch to uniformly cover a given area with maximal energy\nefficiency (EE). What are the optimal number of antennas, active users, and\ntransmit power? The aim of this paper is to answer this fundamental question.\nWe consider jointly the uplink and downlink with different processing schemes\nat the base station and propose a new realistic power consumption model that\nreveals how the above parameters affect the EE. Closed-form expressions for the\nEE-optimal value of each parameter, when the other two are fixed, are provided\nfor zero-forcing (ZF) processing in single-cell scenarios. These expressions\nprove how the parameters interact. For example, in sharp contrast to common\nbelief, the transmit power is found to increase (not to decrease) with the\nnumber of antennas. This implies that energy-efficient systems can operate in\nhigh signal-to-noise ratio regimes in which interference-suppressing signal\nprocessing is mandatory. Numerical and analytical results show that the maximal\nEE is achieved by a massive MIMO setup wherein hundreds of antennas are\ndeployed to serve a relatively large number of users using ZF processing. The\nnumerical results show the same behavior under imperfect channel state\ninformation and in symmetric multi-cell scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 20:45:00 GMT"}, {"version": "v2", "created": "Thu, 5 Mar 2015 10:40:44 GMT"}], "update_date": "2016-02-22", "authors_parsed": [["Björnson", "Emil", ""], ["Sanguinetti", "Luca", ""], ["Hoydis", "Jakob", ""], ["Debbah", "Mérouane", ""]]}, {"id": "1403.6272", "submitter": "Kyeong Soo (Joseph) Kim", "authors": "Kyeong Soo Kim", "title": "On the Excess Bandwidth Allocation in ISP Traffic Control for Shared\n  Access Networks", "comments": null, "journal-ref": "(Early Access) IEEE Communications Letters, vol. PP, no. 99, pp.\n  1-4, Mar., 2014", "doi": "10.1109/LCOMM.2014.020414.132542", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current practice of shaping subscriber traffic based on token bucket by\nInternet service provider (ISP) allows short-term fluctuations in its shaped\nrate and thereby enables a subscriber to transmit traffic at a higher rate than\na negotiated long-term average. The traffic shaping, however, results in\nsignificant waste of network resources, especially when there are only a few\nactive subscribers, because it cannot allocate excess bandwidth to active\nsubscribers in the long term. In this letter we investigate the long-term\naspect of resource sharing in ISP traffic control for shared access networks.\nWe discuss major requirements for the excess bandwidth allocation in shared\naccess networks and propose ISP traffic control schemes based on core-stateless\nfair queueing (CSFQ) and token bucket meters. Simulation results demonstrate\nthat the proposed schemes allocate excess bandwidth among active subscribers in\na fair and efficient way, while not compromising the service contracts\nspecified by token bucket for conformant subscribers.\n", "versions": [{"version": "v1", "created": "Tue, 25 Mar 2014 10:00:55 GMT"}], "update_date": "2014-03-26", "authors_parsed": [["Kim", "Kyeong Soo", ""]]}, {"id": "1403.6644", "submitter": "Christopher Casey", "authors": "C. Jasson Casey, Andrew Sutton, Alex Sprintson", "title": "tinyNBI: Distilling an API from essential OpenFlow abstractions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  If simplicity is a key strategy for success as a network protocol OpenFlow is\nnot winning. At its core OpenFlow presents a simple idea, which is a network\nswitch data plane abstraction along with a control protocol for manipulating\nthat abstraction. The result of this idea has been far from simple: a new\nversion released each year, five active versions, com- plex feature\ndependencies, unstable version negotiation, lack of state machine definition,\netc. This complexity represents roadblocks for network, software, and hardware\nengineers.\n  We have distilled the core abstractions present in 5 existing versions of\nOpenFlow and refactored them into a simple API called tinyNBI. Our work does\nnot provide high-level network abstractions (address pools, VPN maps, etc.),\ninstead it focuses on providing a clean low level interface that supports the\ndevelopment of these higher layer abstractions. The goal of tinyNBI is to allow\nconfiguration of all existing OpenFlow abstractions without having to deal with\nthe unique personalities of each version of OpenFlow or their level of support\nin target switches.\n", "versions": [{"version": "v1", "created": "Wed, 26 Mar 2014 12:15:11 GMT"}], "update_date": "2014-03-27", "authors_parsed": [["Casey", "C. Jasson", ""], ["Sutton", "Andrew", ""], ["Sprintson", "Alex", ""]]}, {"id": "1403.6697", "submitter": "Ravindra S", "authors": "S Ravindra and S N Jagadeesha", "title": "Time Of Arrival Based Localization in Wireless Sensor Networks : A\n  Linear Approach", "comments": "18 pages, 5 Figures, Signal & Image Processing : An International\n  Journal (SIPIJ)", "journal-ref": "Signal & Image Processing : An International Journal (SIPIJ)\n  Vol.4, No.4, August 2013", "doi": "10.5121/sipij.2013.4402", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we aim to determine the location information of a node\ndeployed in Wireless Sensor Networks (WSN). We estimate the position of an\nunknown source node using localization based on linear approach on a single\nsimulation platform. The Cramer Rao Lower Bound (CRLB) for position estimate is\nderived first and the four linear approaches namely Linear Least Squares (LLS),\nSubspace Approach (SA), Weighted Linear Least Squares (WLLS) and Two-step WLS\nhave been derived and presented. Based on the simulation study the results have\nbeen compared. The simulation results show that the Two- step WLS approach is\nhaving higher localization accuracy.\n  Keywords: Source Localization, Time of Arrival,Linear Least Squares, Subspace\nApproach, Weighted Linear Least Squares, Two-step WLS and CRLB.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 18:24:17 GMT"}], "update_date": "2014-03-27", "authors_parsed": [["Ravindra", "S", ""], ["Jagadeesha", "S N", ""]]}, {"id": "1403.6741", "submitter": "Avi Zanko", "authors": "Avi Zanko, Amir Leshem, Ephraim Zehavi", "title": "Network coding for multicasting over Rayleigh fading multi access\n  channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines the problem of rate allocation for multicasting over slow\nRayleigh fading channels using network coding. In the proposed model, the\nnetwork is treated as a collection of Rayleigh fading multiple access channels.\nIn this model, rate allocation scheme that is based solely on the statistics of\nthe channels is presented. The rate allocation scheme is aimed at minimizing\nthe outage probability. An upper bound is presented for the probability of\noutage in the fading multiple access channel. A suboptimal solution based on\nthis bound is given. A distributed primal-dual gradient algorithm is derived to\nsolve the rate allocation problem.\n", "versions": [{"version": "v1", "created": "Wed, 26 Mar 2014 16:39:44 GMT"}], "update_date": "2014-03-27", "authors_parsed": [["Zanko", "Avi", ""], ["Leshem", "Amir", ""], ["Zehavi", "Ephraim", ""]]}, {"id": "1403.6807", "submitter": "Venkata Sriram Siddhardh (Sid) Nadendla", "authors": "V. Sriram Siddhardh Nadendla, Swastik Brahma and Pramod K. Varshney", "title": "Optimal Spectrum Auction Design with Two-Dimensional Truthful\n  Revelations under Uncertain Spectrum Availability", "comments": "14 double-column pages, 7 figures, 2 tables, Under review in IEEE/ACM\n  Transactions in Networking", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT cs.IT cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel sealed-bid auction framework to address the\nproblem of dynamic spectrum allocation in cognitive radio (CR) networks. We\ndesign an optimal auction mechanism that maximizes the moderator's expected\nutility, when the spectrum is not available with certainty. We assume that the\nmoderator employs collaborative spectrum sensing in order to make a reliable\ninference about spectrum availability. Due to the presence of a collision cost\nwhenever the moderator makes an erroneous inference, and a sensing cost at each\nCR, we investigate feasibility conditions that guarantee a non-negative utility\nat the moderator. We present tight theoretical-bounds on instantaneous network\nthroughput and also show that our algorithm provides maximum throughput if the\nCRs have i.i.d. valuations. Since the moderator fuses CRs' sensing decisions to\nobtain a global inference regarding spectrum availability, we propose a novel\nstrategy-proof fusion rule that encourages the CRs to simultaneously reveal\ntruthful sensing decisions, along with truthful valuations to the moderator.\nNumerical examples are also presented to provide insights into the performance\nof the proposed auction under different scenarios.\n", "versions": [{"version": "v1", "created": "Wed, 26 Mar 2014 19:33:48 GMT"}, {"version": "v2", "created": "Thu, 18 Jun 2015 15:12:57 GMT"}, {"version": "v3", "created": "Fri, 13 Nov 2015 16:44:41 GMT"}], "update_date": "2015-11-16", "authors_parsed": [["Nadendla", "V. Sriram Siddhardh", ""], ["Brahma", "Swastik", ""], ["Varshney", "Pramod K.", ""]]}, {"id": "1403.6923", "submitter": "Weisi Guo", "authors": "Yuan Hu and Weisi Guo and Siyi Wang", "title": "Emergency Route Selection for D2D Cellular Communications During an\n  Urban Terrorist Attack", "comments": "IEEE International Conference on Communications (ICC)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Device-to-Device (D2D) communications is a technology that allows mobile\nusers to relay information to each other, without access to the cellular\nnetwork. In this paper, we consider how to dynamically select multi-hop routes\nfor D2D communications in spectrum co-existence with a fully loaded cellular\nnetwork. The modelling scenario is that of a real urban environment, when the\ncellular network is congested during an unexpected event, such as a terrorist\nattack. We use D2D to relay data across the urban terrain, in the presence of\nconventional cellular (CC) communications.\n  We consider different wireless routing algorithms, namely:\nshortest-path-routing (SPR), interference-aware-routing (IAR), and\nbroadcast-routing (BR). In general, there is a fundamental trade-off between\nD2D and CC outage performances, due to their mutual interference relationship.\nFor different CC outage constraints and D2D end-to-end distances, the paper\nrecommends different D2D routing strategies. The paper also considers the\neffects of varying user density and urban building material properties on\noverall D2D relaying feasibility. Over a distance of a kilometre, it was found\nthat the success probability of D2D communications can reach 91% for a moderate\nparticipating user density (400 per square km) and a low wall penetration loss\n(<10dB).\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 06:24:34 GMT"}], "update_date": "2014-03-28", "authors_parsed": [["Hu", "Yuan", ""], ["Guo", "Weisi", ""], ["Wang", "Siyi", ""]]}, {"id": "1403.6977", "submitter": "Lei  Deng", "authors": "Lei Deng, Wenjie Zhang, Yun Rui, Yeo Chai Kiat", "title": "Utility Maximization for Uplink MU-MIMO: Combining Spectral-Energy\n  Efficiency and Fairness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Driven by green communications, energy efficiency (EE) has become a new\nimportant criterion for designing wireless communication systems. However, high\nEE often leads to low spectral efficiency (SE), which spurs the research on\nEE-SE tradeoff. In this paper, we focus on how to maximize the utility in\nphysical layer for an uplink multi-user multiple-input multipleoutput (MU-MIMO)\nsystem, where we will not only consider EE-SE tradeoff in a unified way, but\nalso ensure user fairness. We first formulate the utility maximization problem,\nbut it turns out to be non-convex. By exploiting the structure of this problem,\nwe find a convexization procedure to convert the original nonconvex problem\ninto an equivalent convex problem, which has the same global optimum with the\noriginal problem. Following the convexization procedure, we present a\ncentralized algorithm to solve the utility maximization problem, but it\nrequires the global information of all users. Thus we propose a primal-dual\ndistributed algorithm which does not need global information and just consumes\na small amount of overhead. Furthermore, we have proved that the distributed\nalgorithm can converge to the global optimum. Finally, the numerical results\nshow that our approach can both capture user diversity for EE-SE tradeoff and\nensure user fairness, and they also validate the effectiveness of our\nprimal-dual distributed algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 11:05:22 GMT"}, {"version": "v2", "created": "Fri, 4 Apr 2014 03:06:13 GMT"}, {"version": "v3", "created": "Sun, 6 Jul 2014 05:24:59 GMT"}, {"version": "v4", "created": "Sat, 27 Sep 2014 08:51:53 GMT"}, {"version": "v5", "created": "Sat, 7 May 2016 02:02:34 GMT"}], "update_date": "2016-05-10", "authors_parsed": [["Deng", "Lei", ""], ["Zhang", "Wenjie", ""], ["Rui", "Yun", ""], ["Kiat", "Yeo Chai", ""]]}, {"id": "1403.7007", "submitter": "Urs Niesen", "authors": "Nikhil Karamchandani, Urs Niesen, Mohammad Ali Maddah-Ali, Suhas\n  Diggavi", "title": "Hierarchical Coded Caching", "comments": "31 pages", "journal-ref": "IEEE Transactions on Information Theory, vol. 62, pp. 3212 - 3229,\n  June 2014", "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Caching of popular content during off-peak hours is a strategy to reduce\nnetwork loads during peak hours. Recent work has shown significant benefits of\ndesigning such caching strategies not only to deliver part of the content\nlocally, but also to provide coded multicasting opportunities even among users\nwith different demands. Exploiting both of these gains was shown to be\napproximately optimal for caching systems with a single layer of caches.\n  Motivated by practical scenarios, we consider in this work a hierarchical\ncontent delivery network with two layers of caches. We propose a new caching\nscheme that combines two basic approaches. The first approach provides coded\nmulticasting opportunities within each layer; the second approach provides\ncoded multicasting opportunities across multiple layers. By striking the right\nbalance between these two approaches, we show that the proposed scheme achieves\nthe optimal communication rates to within a constant multiplicative and\nadditive gap. We further show that there is no tension between the rates in\neach of the two layers up to the aforementioned gap. Thus, both layers can\nsimultaneously operate at approximately the minimum rate.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 12:59:29 GMT"}, {"version": "v2", "created": "Fri, 6 Jun 2014 13:17:51 GMT"}], "update_date": "2016-06-14", "authors_parsed": [["Karamchandani", "Nikhil", ""], ["Niesen", "Urs", ""], ["Maddah-Ali", "Mohammad Ali", ""], ["Diggavi", "Suhas", ""]]}, {"id": "1403.7014", "submitter": "Takeshi Takahashi", "authors": "Keita Emura and Akira Kanaoka and Satoshi Ohta and Takeshi Takahashi", "title": "Building Secure and Anonymous Communication Channel: Formal Model and\n  its Prototype Implementation", "comments": "This is a preprint version of our paper presented in SAC'14, March\n  24-28, 2014, Gyeongju, Korea. ACMSAC 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various techniques need to be combined to realize anonymously authenticated\ncommunication. Cryptographic tools enable anonymous user authentication while\nanonymous communication protocols hide users' IP addresses from service\nproviders. One simple approach for realizing anonymously authenticated\ncommunication is their simple combination, but this gives rise to another\nissue; how to build a secure channel. The current public key infrastructure\ncannot be used since the user's public key identifies the user. To cope with\nthis issue, we propose a protocol that uses identity-based encryption for\npacket encryption without sacrificing anonymity, and group signature for\nanonymous user authentication. Communications in the protocol take place\nthrough proxy entities that conceal users' IP addresses from service providers.\nThe underlying group signature is customized to meet our objective and improve\nits efficiency. We also introduce a proof-of-concept implementation to\ndemonstrate the protocol's feasibility. We compare its performance to SSL\ncommunication and demonstrate its practicality, and conclude that the protocol\nrealizes secure, anonymous, and authenticated communication between users and\nservice providers with practical performance.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 13:14:20 GMT"}, {"version": "v2", "created": "Thu, 3 Apr 2014 00:50:59 GMT"}, {"version": "v3", "created": "Thu, 8 May 2014 00:49:54 GMT"}], "update_date": "2014-05-09", "authors_parsed": [["Emura", "Keita", ""], ["Kanaoka", "Akira", ""], ["Ohta", "Satoshi", ""], ["Takahashi", "Takeshi", ""]]}, {"id": "1403.7115", "submitter": "Saul St. John", "authors": "Saul St. John and Aditya Akella", "title": "Active Switching: Packet Steering Flow Annotations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our previous experience building systems for middlebox chain composition and\nscaling in software-defined networks has revealed that existing mechanisms of\nflow annotation commonly do not survive middlebox-traversals, or suffer from\nextreme identifier domain limitations resulting in excessive flow table size.\nIn this paper, we analyze the structural artifacts resulting in these\nchallenges, and offer a framework for describing the behavior of middleboxes\nbased on actions taken on traversing packets. We then present a novel mechanism\nfor flow annotation that features an identifier domain significantly larger\nthan existing techniques, that is transparent to hosts traversed, and that\nconserves flow-table resources by requiring only a small number of match rules\nand actions in most switches. We evaluate said technique, showing that it\nrequires less per-switch state than conventional techniques. We then describe\nextensions allowing implementation of this architecture within a broader class\nof systems. Finally, we close with architectural suggestions for enabling\nstraightforward integration of middleboxes within software-defined networks.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 16:23:41 GMT"}], "update_date": "2014-03-28", "authors_parsed": [["John", "Saul St.", ""], ["Akella", "Aditya", ""]]}, {"id": "1403.7192", "submitter": "Arash Azarfar", "authors": "Arash Azarfar, Jean-Fran\\c{c}ois Frigon, Brunilde Sans\\`o", "title": "Delay Analysis of Multichannel Opportunistic Spectrum Access MAC\n  Protocols", "comments": "1 table, 2 algorithms and 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide in this paper a comprehensive delay and queueing analysis for two\nbaseline medium access control (MAC) protocols for multi-user cognitive radio\n(CR) networks and investigate the impact of different network parameters, such\nas packet size, Aloha-type medium access probability and number of channels on\nthe system performance. In addition to an accurate Markov chain, which follows\nthe queue status of all users, several lower complexity queueing theory\napproximations are provided. Accuracy and performance of the proposed\nanalytical approximations are verified with extensive simulations. It is\nobserved that for CR networks using an Aloha-type access to the control\nchannel, a buffering MAC protocol, where in case of interruption the CR user\nwaits for the primary user to vacate the channel before resuming the\ntransmission, outperforms a switching MAC protocol, where the CR user vacates\nthe channel in case of appearance of primary users and then compete again to\ngain access to a new channel. The reason is that the delay bottleneck for both\nprotocols is the time required to successfully access the control channel,\nwhich occurs more frequently for the switching MAC protocol. We also propose a\nuser clustering approach, where users are divided into clusters with a separate\ncontrol channel per cluster, and observe that it can significantly improve the\nperformance by reducing the number of competing users per control channel.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 19:57:56 GMT"}], "update_date": "2014-03-28", "authors_parsed": [["Azarfar", "Arash", ""], ["Frigon", "Jean-François", ""], ["Sansò", "Brunilde", ""]]}, {"id": "1403.7371", "submitter": "Kirill Kravtsov", "authors": "Vladimir Krylov and Kirill Kravtsov", "title": "DDoS Attack and Interception Resistance IP Fast Hopping Based Protocol", "comments": "6 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Denial-of-Service attacks continue to be a serious problem for the Internet\ncommunity despite the fact that a large number of defense approaches has been\nproposed by the research community. In this paper we introduce IP Fast Hopping,\neasily deployable and effective network-layer architecture against DDoS\nattacks. Our approach also provides an easy way for clients to hide content and\ndestination server of theirs communication sessions. We describe a method of\ndynamic server IP address change and all modules necessary to implement the\napproach.\n", "versions": [{"version": "v1", "created": "Fri, 28 Mar 2014 13:32:46 GMT"}], "update_date": "2014-03-31", "authors_parsed": [["Krylov", "Vladimir", ""], ["Kravtsov", "Kirill", ""]]}, {"id": "1403.7374", "submitter": "Weisi Guo", "authors": "Song Qiu", "title": "Molecular Communication Systems Design for Future City", "comments": "PhD report. arXiv admin note: text overlap with arXiv:1310.0070 by\n  other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An area of interest in the modern age is the human migration from rural areas\nto cities. Cities are characterized by a dense concentration of buildings and\nkey infrastructures. However, what has been lacking is a pervasive sensor\ntechnology that can monitor the performance of these structures. Partly, this\nis due to the fact that the information collected from sensors cannot be easily\ntransported from the embedded location to an external data hub. Examples of\nhealth monitoring in structures include monitoring corrosion, fracture stress,\nand material delamination. The scenario examples include: pipelines, tunnel\nnetworks, and some industrial and medical areas such as hospitals (minimise\nelectromagnetic interference), and turbines.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2014 06:36:36 GMT"}], "update_date": "2014-03-31", "authors_parsed": [["Qiu", "Song", ""]]}, {"id": "1403.7598", "submitter": "Haitao Xu", "authors": "Haitao Xu, Xianwei Zhou", "title": "A Non-cooperative Differential Game Model for Frequency Reuse based\n  Channel Allocation in Satellite Networks", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, channel resource allocation problem for LEO mobile satellite\nsystems is investigated and a new dynamic channel resource allocation scheme is\nproposed based on differential game. Optimal channel resource allocated to each\nsatellite beams are formulated as Nash equilibrium. It is proved that optimal\nchannel resource allocation can be achieved and the differential game based\nscheme is applicable and acceptable. Numerical results shows that system\nperformance can be improved based on the proposed scheme.\n", "versions": [{"version": "v1", "created": "Sat, 29 Mar 2014 07:00:39 GMT"}, {"version": "v2", "created": "Sat, 1 Nov 2014 02:18:56 GMT"}], "update_date": "2014-11-04", "authors_parsed": [["Xu", "Haitao", ""], ["Zhou", "Xianwei", ""]]}, {"id": "1403.7691", "submitter": "Huazi Zhang", "authors": "Huazi Zhang, Yufan Huang, Zhaoyang Zhang, Huaiyu Dai", "title": "Mobile Conductance in Sparse Networks and Mobility-Connectivity Tradeoff", "comments": "Accepted to ISIT 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, our recently proposed mobile-conductance based analytical\nframework is extended to the sparse settings, thus offering a unified tool for\nanalyzing information spreading in mobile networks. A penalty factor is\nidentified for information spreading in sparse networks as compared to the\nconnected scenario, which is then intuitively interpreted and verified by\nsimulations. With the analytical results obtained, the mobility-connectivity\ntradeoff is quantitatively analyzed to determine how much mobility may be\nexploited to make up for network connectivity deficiency.\n", "versions": [{"version": "v1", "created": "Sun, 30 Mar 2014 02:19:48 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Zhang", "Huazi", ""], ["Huang", "Yufan", ""], ["Zhang", "Zhaoyang", ""], ["Dai", "Huaiyu", ""]]}, {"id": "1403.7735", "submitter": "Ahmed El Shafie", "authors": "Ahmed El Shafie and Tamer Khattab and Hussien Saad and Amr Mohamed", "title": "Optimal Cooperative Cognitive Relaying and Spectrum Access for an Energy\n  Harvesting Cognitive Radio: Reinforcement Learning Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a cognitive setting under the context of\ncooperative communications, where the cognitive radio (CR) user is assumed to\nbe a self-organized relay for the network. The CR user and the PU are assumed\nto be energy harvesters. The CR user cooperatively relays some of the\nundelivered packets of the primary user (PU). Specifically, the CR user stores\na fraction of the undelivered primary packets in a relaying queue (buffer). It\nmanages the flow of the undelivered primary packets to its relaying queue using\nthe appropriate actions over time slots. Moreover, it has the decision of\nchoosing the used queue for channel accessing at idle time slots (slots where\nthe PU's queue is empty). It is assumed that one data packet transmission\ndissipates one energy packet. The optimal policy changes according to the\nprimary and CR users arrival rates to the data and energy queues as well as the\nchannels connectivity. The CR user saves energy for the PU by taking the\nresponsibility of relaying the undelivered primary packets. It optimally\norganizes its own energy packets to maximize its payoff as time progresses.\n", "versions": [{"version": "v1", "created": "Sun, 30 Mar 2014 10:59:58 GMT"}, {"version": "v2", "created": "Tue, 8 Jul 2014 21:40:13 GMT"}], "update_date": "2014-07-10", "authors_parsed": [["Shafie", "Ahmed El", ""], ["Khattab", "Tamer", ""], ["Saad", "Hussien", ""], ["Mohamed", "Amr", ""]]}, {"id": "1403.7773", "submitter": "Wenzhuo Ouyang", "authors": "Wenzhuo Ouyang, Atilla Eryilmaz, Ness B. Shroff", "title": "Scheduling in Time-correlated Wireless Networks with Imperfect CSI and\n  Stringent Constraint", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a wireless network, the efficiency of scheduling algorithms over\ntime-varying channels depends heavily on the accuracy of the Channel State\nInformation (CSI), which is usually quite ``costly'' in terms of consuming\nnetwork resources. Scheduling in such systems is also subject to stringent\nconstraints such as power and bandwidth, which limit the maximum number of\nsimultaneous transmissions. In the meanwhile, communication channels in\nwireless systems typically fluctuate in a time-correlated manner. We hence\ndesign schedulers to exploit the temporal-correlation inherent in channels with\nmemory and ARQ-styled feedback from the users for better channel state\nknowledge, under the assumption of Markovian channels and the stringent\nconstraint on the maximum number of simultaneously active users. We model this\nproblem under the framework of a Partially Observable Markov Decision\nProcesses.\n  In recent work, a low-complexity optimal solution was developed for this\nproblem under a long-term time-average resource constraint. However, in real\nsystems with instantaneous resource constraints, how to optimally exploit the\ntemporal correlation and satisfy realistic stringent constraint on the\ninstantaneous service remains elusive. In this work, we incorporate a stringent\nconstraint on the simultaneously scheduled users and propose a low-complexity\nscheduling algorithm that dynamically implements user scheduling and dummy\npacket broadcasting. We show that the throughput region of the optimal policy\nunder the long-term average resource constraint can be asymptotically achieved\nin the stringent constrained scenario by the proposed algorithm, in the many\nusers limiting regime.\n", "versions": [{"version": "v1", "created": "Sun, 30 Mar 2014 15:36:00 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Ouyang", "Wenzhuo", ""], ["Eryilmaz", "Atilla", ""], ["Shroff", "Ness B.", ""]]}, {"id": "1403.7774", "submitter": "Kritika Sengar", "authors": "Kritika Sengar, Nishu Rani, Ankita Singhal, Dolly Sharma, Seema Verma,\n  Tanya Singh", "title": "Study and Capacity Evaluation of SISO, MISO and MIMO RF Wireless\n  Communication Systems", "comments": "5 pages, 9 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The wireless communication systems has gone from different generations from\nSISO systems to MIMO systems. Bandwidth is one important constraint in wireless\ncommunication. In wireless communication, high data transmission rates are\nessential for the services like tripple play i.e. data, voice and video. At\nuser end the capacity determines the quality of the communication systems. This\npaper aims to compare the different RF wireless communication systems like\nSISO, MISO, SIMO and MIMO systems on the capacity basis and explaining the\nconcept as today, the wireless communication has evolved from 2G, 3G to 4G and\nthe companies are fighting to create networks with more and more capacity so\nthat data rates can be increased and customers can be benefitted more. The\nultimate goal of wireless communication systems is to create a global personal\nand multimedia communication without any capacity issues.\n", "versions": [{"version": "v1", "created": "Sun, 30 Mar 2014 15:37:42 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Sengar", "Kritika", ""], ["Rani", "Nishu", ""], ["Singhal", "Ankita", ""], ["Sharma", "Dolly", ""], ["Verma", "Seema", ""], ["Singh", "Tanya", ""]]}, {"id": "1403.7802", "submitter": "Arvind Merwaday", "authors": "Arvind Merwaday, Sayandev Mukherjee, and Ismail Guvenc", "title": "Capacity Analysis of LTE-Advanced HetNets with Reduced Power Subframes\n  and Range Expansion", "comments": "Submitted to EURASIP Journal on Wireless Communications and\n  Networking (JWCN)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The time domain inter-cell interference coordination techniques specified in\nLTE Rel. 10 standard improves the throughput of picocell-edge users by\nprotecting them from macrocell interference. On the other hand, it also\ndegrades the aggregate capacity in macrocell because the macro base station\n(MBS) does not transmit data during certain subframes known as almost blank\nsubframes. The MBS data transmission using reduced power subframes was\nstandardized in LTE Rel. 11, which can improve the capacity in macrocell while\nnot causing high interference to the nearby picocells. In order to get maximum\nbenefit from the reduced power subframes, setting the key system parameters,\nsuch as the amount of power reduction, carries critical importance. Using\nstochastic geometry, this paper lays down a theoretical foundation for the\nperformance evaluation of heterogeneous networks with reduced power subframes\nand range expansion bias. The analytic expressions for average capacity and 5th\npercentile throughput are derived as a function of transmit powers, node\ndensities, and interference coordination parameters in a heterogeneous network\nscenario, and are validated through Monte Carlo simulations. Joint optimization\nof range expansion bias, power reduction factor, scheduling thresholds, and\nduty cycle of reduced power subframes are performed to study the trade-offs\nbetween aggregate capacity of a cell and fairness among the users. To validate\nour analysis, we also compare the stochastic geometry based theoretical results\nwith the real MBS deployment (in the city of London) and the hexagonal-grid\nmodel. Our analysis shows that with optimum parameter settings, the LTE Rel. 11\nwith reduced power subframes can provide substantially better performance than\nthe LTE Rel. 10 with almost blank subframes, in terms of both aggregate\ncapacity and fairness.\n", "versions": [{"version": "v1", "created": "Sun, 30 Mar 2014 19:26:45 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Merwaday", "Arvind", ""], ["Mukherjee", "Sayandev", ""], ["Guvenc", "Ismail", ""]]}, {"id": "1403.7811", "submitter": "Qing Wang", "authors": "Qing Wang, Balaji Rengarajan, Joerg Widmer", "title": "Increasing Opportunistic Gain in Small Cells Through Energy-Aware User\n  Cooperation", "comments": "13 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To meet the increasing demand for wireless capacity, future networks are\nlikely to consist of dense layouts of small cells. The number of users in each\ncell is thus reduced which results in diminished gains from opportunistic\nscheduling, particularly under dynamic traffic loads. We propose an\nuser-initiated base station (BS)-transparent traffic spreading approach that\nleverages user-user communication to increase BS scheduling flexibility. The\nproposed scheme can increase opportunistic gain and improve user performance.\nFor a specified tradeoff between performance and power expenditure, we\ncharacterize the optimal policy by modeling the system as a Markov decision\nprocess and also present a heuristic algorithm that yields significant\nperformance gains. Our simulations show that, in the performance-centric case,\naverage file transfer delays are lowered by up to 20% even in homogeneous\nscenarios, and up to 50% with heterogeneous users. Further, we show that the\nbulk of the performance improvement can be achieved with a small increase in\npower expenditure, e.g., in an energy-sensitive case, up to 78% of the\nperformance improvement can be typically achieved at only 20% of the power\nexpenditure of the performance-centric case.\n", "versions": [{"version": "v1", "created": "Sun, 30 Mar 2014 20:51:04 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Wang", "Qing", ""], ["Rengarajan", "Balaji", ""], ["Widmer", "Joerg", ""]]}, {"id": "1403.7840", "submitter": "EPTCS", "authors": "Andrew Noyes (Cornell University), Todd Warszawski (Cornell\n  University), Pavol \\v{C}ern\\'y (University of Colorado Boulder), Nate Foster\n  (Cornell University)", "title": "Toward Synthesis of Network Updates", "comments": "In Proceedings SYNT 2013, arXiv:1403.7264", "journal-ref": "EPTCS 142, 2014, pp. 8-23", "doi": "10.4204/EPTCS.142.8", "report-no": null, "categories": "cs.PL cs.LO cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Updates to network configurations are notoriously difficult to implement\ncorrectly. Even if the old and new configurations are correct, the update\nprocess can introduce transient errors such as forwarding loops, dropped\npackets, and access control violations. The key factor that makes updates\ndifficult to implement is that networks are distributed systems with hundreds\nor even thousands of nodes, but updates must be rolled out one node at a time.\nIn networks today, the task of determining a correct sequence of updates is\nusually done manually -- a tedious and error-prone process for network\noperators. This paper presents a new tool for synthesizing network updates\nautomatically. The tool generates efficient updates that are guaranteed to\nrespect invariants specified by the operator. It works by navigating through\nthe (restricted) space of possible solutions, learning from counterexamples to\nimprove scalability and optimize performance. We have implemented our tool in\nOCaml, and conducted experiments showing that it scales to networks with a\nthousand switches and tens of switches updating.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2014 00:30:25 GMT"}], "update_date": "2014-08-10", "authors_parsed": [["Noyes", "Andrew", "", "Cornell University"], ["Warszawski", "Todd", "", "Cornell\n  University"], ["Černý", "Pavol", "", "University of Colorado Boulder"], ["Foster", "Nate", "", "Cornell University"]]}, {"id": "1403.7869", "submitter": "Badr Benmammar", "authors": "Badr Benmammar (LTT)", "title": "Application des techniques d'ench\\`eres dans les r\\'eseaux de radio\n  cognitive", "comments": "in French", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid proliferation of standards and radio services in recent years\ncaused the problem of spectrum scarcity. The main objective of Cognitive Radio\n(CR) is to facilitate access to radio spectrum. Our contribution in this paper\nis the use of auctions to solve the problem of spectrum congestion in the\ncontext of CR, for that, we will combine the theory of auctions with\nmulti-agent systems. Our approach has shown that it is preferable to use the\nSealed-bid Auction with dynamic programming because this method has many\nadvantages over other methods.\n  ---\n  La prolif\\'eration rapide de standards et services de radiocommunication ces\nderni\\`eres ann\\'ees provoquent le probl\\`eme de la p\\'enurie du spectre. Dans\nce contexte, l'objectif principal de la Radio Cognitive (RC) est de faciliter\nl'acc\\`es au spectre radio. Notre contribution dans le cadre de ce papier est\nl'utilisation des ench\\`eres pour r\\'esoudre le probl\\`eme de l'encombrement du\nspectre dans le cadre de la RC. Pour cela, nous avons combin\\'e la th\\'eorie\ndes ench\\`eres avec les syst\\`emes multi agents. Notre approche a prouv\\'e\nqu'il est pr\\'ef\\'erable d'utiliser les ench\\`eres \\`a Enveloppe Scell\\'ee avec\nprogrammation dynamique car cette m\\'ethode a beaucoup d'avantages par rapport\naux autres m\\'ethodes.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2014 04:38:23 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Benmammar", "Badr", "", "LTT"]]}, {"id": "1403.8008", "submitter": "Ye Yu", "authors": "Ye Yu, Qian Chen, Xin Li", "title": "Distributed Collaborative Monitoring in Software Defined Networks", "comments": null, "journal-ref": null, "doi": "10.1145/2620728.2620739", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a Distributed and Collaborative Monitoring system, DCM, with the\nfollowing properties. First, DCM allow switches to collaboratively achieve flow\nmonitoring tasks and balance measurement load. Second, DCM is able to perform\nper-flow monitoring, by which different groups of flows are monitored using\ndifferent actions. Third, DCM is a memory-efficient solution for switch data\nplane and guarantees system scalability. DCM uses a novel two-stage Bloom\nfilters to represent monitoring rules using small memory space. It utilizes the\ncentralized SDN control to install, update, and reconstruct the two-stage Bloom\nfilters in the switch data plane. We study how DCM performs two representative\nmonitoring tasks, namely flow size counting and packet sampling, and evaluate\nits performance. Experiments using real data center and ISP traffic data on\nreal network topologies show that DCM achieves highest measurement accuracy\namong existing solutions given the same memory budget of switches.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2014 14:21:03 GMT"}], "update_date": "2016-08-22", "authors_parsed": [["Yu", "Ye", ""], ["Chen", "Qian", ""], ["Li", "Xin", ""]]}, {"id": "1403.8028", "submitter": "Mohamed El-Zawawy Dr.", "authors": "Mohamed A. El-Zawawy, Adel I. AlSalem", "title": "ImNet: An Imperative Network Programming Language", "comments": "8 pages, 8 figures, Mohamed A. El-Zawawy and Adel I. AlSalem. ImNet:\n  An Imperative Network Programming Language. Proceedings of The 14th\n  International Conference on Applied Computer Science, ACS 2014, Constantin\n  Buzatu (Ed): Modern Computer Applications in Science and Education, pp.\n  149--156", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most recent architectures of networks is Software-Defined Networks\n(SDNs) using a con- troller appliance to control the set of switches on the\nnetwork. The controlling process includes installing or uninstalling\npacket-processing rules on flow tables of switches. This paper presents a\nhigh-level imperative network programming language, called ImNet, to facilitate\nwriting efficient, yet simple, programs executed by controller to manage\nswitches. ImNet is simply-structured, expressive, compositional, and\nimperative. This paper also introduces an operational semantics to ImNet.\nDetailed examples of programs (with their operational semantics) constructed in\nImNet are illustrated in the paper as well.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2014 19:20:18 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["El-Zawawy", "Mohamed A.", ""], ["AlSalem", "Adel I.", ""]]}, {"id": "1403.8055", "submitter": "Hatem Abou-zeid", "authors": "Hatem Abou-zeid and Hossam S. Hassanein and Stefan Valentin", "title": "Energy-Efficient Adaptive Video Transmission: Exploiting Rate\n  Predictions in Wireless Networks", "comments": "14 pages, 14 figures, accepted for publication in IEEE Transactions\n  on Vehicular Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The unprecedented growth of mobile video traffic is adding significant\npressure to the energy drain at both the network and the end user. Energy\nefficient video transmission techniques are thus imperative to cope with the\nchallenge of satisfying user demand at sustainable costs. In this paper, we\ninvestigate how predicted user rates can be exploited for energy efficient\nvideo streaming with the popular HTTP-based Adaptive Streaming (AS) protocols\n(e.g. DASH). To this end, we develop an energy-efficient Predictive Green\nStreaming (PGS) optimization framework that leverages predictions of wireless\ndata rates to achieve the following objectives 1) minimize the required\ntransmission airtime without causing streaming interruptions, 2) minimize total\ndownlink Base Station (BS) power consumption for cases where BSs can be\nswitched off in deep sleep, and 3) enable a trade-off between AS quality and\nenergy consumption. Our framework is first formulated as a Mixed Integer Linear\nProgram (MILP) where decisions on multi-user rate allocation, video segment\nquality, and BS transmit power are jointly optimized. Then, to provide an\nonline solution, we present a polynomial-time heuristic algorithm that\ndecouples the PGS problem into multiple stages. We provide a performance\nanalysis of the proposed methods by simulations, and numerical results\ndemonstrate that the PGS framework yields significant energy savings.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2014 15:41:30 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Abou-zeid", "Hatem", ""], ["Hassanein", "Hossam S.", ""], ["Valentin", "Stefan", ""]]}, {"id": "1403.8065", "submitter": "Wenzhi Cui", "authors": "Wenzhi Cui, Chen Qian", "title": "Dual-structure Data Center Multicast Using Software Defined Networking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data center applications use multicast as an effective method to reduce\nbandwidth cost. However, traditional multicast protocols designed for IP\nnetworks are usually bottlenecked by the limited state capacity on switches. In\nthis paper, we propose a scalable multicast solution on fat tree networks based\non the observation that data center multicast traffic has strong heterogeneity.\nWe propose to remove the multicast management logic from switches and use the\nSDN controller to manage multicast groups. The proposed Dual-structure\nMulticast (DuSM) determines elephant and mice groups according to their traffic\namounts and treats them separately. For each elephant group, the controller\ninstalls multicast state to maintain multiple shared trees and the group\ntraffic will be balanced evenly among the trees to avoid congestion. For mice\ngroups, the controller applies state-free mutlicast that trades bandwidth\ncapacity for state capacity, such as multicast-to-unicast translation. Our\nexperiments using real multicast traffic data show that the number of groups\nDuSM supports can be 300% of that of IP multicast. DuSM also achieves traffic\nbalance among links.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2014 15:59:10 GMT"}], "update_date": "2014-04-01", "authors_parsed": [["Cui", "Wenzhi", ""], ["Qian", "Chen", ""]]}, {"id": "1403.8123", "submitter": "Jihua Lu Dr", "authors": "Jihua Lu, Jianping An, Xiangming Li, Jie Yang and Lei Yang", "title": "A Percolation based M2M Networking Architecture for Data Transmission\n  and Routing", "comments": "15 pages, 7 figures. We propose a percolation based routing and data\n  transmission method for the M2M network, which consists of routing phase and\n  transmission phases. In the routing phase, probes packets are transmitted and\n  flowed in the network, multiple paths are built to form a route. After that,\n  the data file will be fountain encoded and the transmitted", "journal-ref": "KSII TRANSACTIONS ON INTERNET AND INFORMATION SYSTEMS VOL. 6, NO.\n  2, Feb 2012", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a percolation based M2M networking architecture and its data\ntransmission method. The proposed network architecture can be server-free and\nrouter-free, which allows us to operate routing efficiently with percolations\nbased on six degrees of separation theory in small world network modeling. The\ndata transmission can be divided into two phases: routing and data transmission\nphases. In the routing phase, probe packets will be transmitted and forwarded\nin the network thus multiple paths are selected and performed based on the\nconstriction of the maximum hop number. In the second phase, the information\nwill be encoded, say, with the fountain codes, and transmitted using the paths\ngenerated in the first phase. In such a way, an efficient routing and data\ntransmission mechanism can be built, which allow us to construct a low-cost,\nflexible and ubiquitous network. Such a networking architecture and data\ntransmission can be used in many M2M communications, such as the stub network\nof internet of things, and deep space networking, and so on.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2014 18:47:17 GMT"}, {"version": "v2", "created": "Thu, 8 May 2014 11:48:38 GMT"}], "update_date": "2014-05-09", "authors_parsed": [["Lu", "Jihua", ""], ["An", "Jianping", ""], ["Li", "Xiangming", ""], ["Yang", "Jie", ""], ["Yang", "Lei", ""]]}]