[{"id": "0806.2581", "submitter": "Doina Tatar", "authors": "Doina Tatar, Gabriela Serban, Andreea Mihis, Mihaiela Lupea, Dana\n  Lupsa and Militon Frentiu", "title": "A chain dictionary method for Word Sense Disambiguation and applications", "comments": "8 pages, 5 figures", "journal-ref": "Studia Universitatis Babes-Bolyai, Special Issue, KEPT 2007,\n  Knowledge Engineering: Principles and Technologies, Cluj-Napoca, June 6-8,\n  2007, pp 33-40,", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A large class of unsupervised algorithms for Word Sense Disambiguation (WSD)\nis that of dictionary-based methods. Various algorithms have as the root Lesk's\nalgorithm, which exploits the sense definitions in the dictionary directly. Our\napproach uses the lexical base WordNet for a new algorithm originated in\nLesk's, namely \"chain algorithm for disambiguation of all words\", CHAD. We show\nhow translation from a language into another one and also text entailment\nverification could be accomplished by this disambiguation.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 13:48:55 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Tatar", "Doina", ""], ["Serban", "Gabriela", ""], ["Mihis", "Andreea", ""], ["Lupea", "Mihaiela", ""], ["Lupsa", "Dana", ""], ["Frentiu", "Militon", ""]]}, {"id": "0806.3710", "submitter": "Stevan Harnad", "authors": "A. Blondin Masse, G. Chicoisne, Y. Gargouri, S. Harnad, O. Picard, O.\n  Marcotte", "title": "How Is Meaning Grounded in Dictionary Definitions?", "comments": "8 pages, 3 figures, TextGraphs-3 Workshop at the 22nd International\n  Conference on Computational Linguistics, Coling 2008, Manchester, 18-22\n  August, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Meaning cannot be based on dictionary definitions all the way down: at some\npoint the circularity of definitions must be broken in some way, by grounding\nthe meanings of certain words in sensorimotor categories learned from\nexperience or shaped by evolution. This is the \"symbol grounding problem.\" We\nintroduce the concept of a reachable set -- a larger vocabulary whose meanings\ncan be learned from a smaller vocabulary through definition alone, as long as\nthe meanings of the smaller vocabulary are themselves already grounded. We\nprovide simple algorithms to compute reachable sets for any given dictionary.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 15:53:05 GMT"}, {"version": "v2", "created": "Tue, 15 Jul 2008 01:59:09 GMT"}], "update_date": "2008-07-15", "authors_parsed": [["Masse", "A. Blondin", ""], ["Chicoisne", "G.", ""], ["Gargouri", "Y.", ""], ["Harnad", "S.", ""], ["Picard", "O.", ""], ["Marcotte", "O.", ""]]}, {"id": "0806.3787", "submitter": "Ted Pedersen", "authors": "Ted Pedersen (University of Minnesota, Duluth)", "title": "Computational Approaches to Measuring the Similarity of Short Contexts :\n  A Review of Applications and Methods", "comments": "23 pages", "journal-ref": "University of Minnesota Supercomputing Institute Research Report\n  UMSI 2010/118, October 2010", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Measuring the similarity of short written contexts is a fundamental problem\nin Natural Language Processing. This article provides a unifying framework by\nwhich short context problems can be categorized both by their intended\napplication and proposed solution. The goal is to show that various problems\nand methodologies that appear quite different on the surface are in fact very\nclosely related. The axes by which these categorizations are made include the\nformat of the contexts (headed versus headless), the way in which the contexts\nare to be measured (first-order versus second-order similarity), and the\ninformation used to represent the features in the contexts (micro versus macro\nviews). The unifying thread that binds together many short context applications\nand methods is the fact that similarity decisions must be made between contexts\nthat share few (if any) words in common.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 23:27:20 GMT"}, {"version": "v2", "created": "Mon, 18 Oct 2010 19:08:13 GMT"}], "update_date": "2010-10-19", "authors_parsed": [["Pedersen", "Ted", "", "University of Minnesota, Duluth"]]}]