[{"id": "1211.0729", "submitter": "Zhijie Wang", "authors": "Jack Wang", "title": "A Simple Algorithm for Computing BOCP", "comments": "33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CG cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we devise a concise algorithm for computing BOCP. Our method\nis simple, easy-to-implement but without loss of efficiency. Given two\ncircular-arc polygons with $m$ and $n$ edges respectively, our method runs in\n$O(m+n+(l+k)\\log l)$ time, using $O(m+n+k)$ space, where $k$ is the number of\nintersections, and $l$ is the number of {edge}s. Our algorithm has the power to\napproximate to linear complexity when $k$ and $l$ are small. The superiority of\nthe proposed algorithm is also validated through empirical study.\n", "versions": [{"version": "v1", "created": "Sun, 4 Nov 2012 22:38:11 GMT"}, {"version": "v2", "created": "Tue, 27 Nov 2012 15:41:44 GMT"}, {"version": "v3", "created": "Tue, 19 Feb 2013 14:13:05 GMT"}, {"version": "v4", "created": "Thu, 21 Feb 2013 16:31:32 GMT"}, {"version": "v5", "created": "Mon, 18 Mar 2013 19:04:22 GMT"}, {"version": "v6", "created": "Thu, 4 Jul 2013 06:03:22 GMT"}, {"version": "v7", "created": "Sat, 13 Sep 2014 05:39:04 GMT"}, {"version": "v8", "created": "Tue, 3 Jul 2018 13:27:03 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Wang", "Jack", ""]]}, {"id": "1211.1768", "submitter": "Olivier Rukundo", "authors": "Olivier Rukundo and Hanqiang Cao", "title": "Nearest Neighbor Value Interpolation", "comments": "6 pages, 11 figures, 2 tables", "journal-ref": "International Journal of Advanced Computer Science and\n  Applications(IJACSA),Vol. 3, No. 4, 2012", "doi": "10.14569/IJACSA.2012.030405", "report-no": null, "categories": "cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the nearest neighbor value (NNV) algorithm for high\nresolution (H.R.) image interpolation. The difference between the proposed\nalgorithm and conventional nearest neighbor algorithm is that the concept\napplied, to estimate the missing pixel value, is guided by the nearest value\nrather than the distance. In other words, the proposed concept selects one\npixel, among four directly surrounding the empty location, whose value is\nalmost equal to the value generated by the conventional bilinear interpolation\nalgorithm. The proposed method demonstrated higher performances in terms of\nH.R. when compared to the conventional interpolation algorithms mentioned.\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2012 06:50:44 GMT"}, {"version": "v2", "created": "Mon, 4 Mar 2019 11:25:07 GMT"}], "update_date": "2019-03-05", "authors_parsed": [["Rukundo", "Olivier", ""], ["Cao", "Hanqiang", ""]]}, {"id": "1211.2569", "submitter": "Ka Chun Lam", "authors": "Lok Ming Lui, Ka Chun Lam, Shing-Tung Yau, Xianfeng Gu", "title": "Teichm\\\"uller extremal mapping and its applications to landmark matching\n  registration", "comments": "26 pages, 21 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.GR cs.MM math.DG", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Registration, which aims to find an optimal 1-1 correspondence between\nshapes, is an important process in different research areas. Conformal mappings\nhave been widely used to obtain a diffeomorphism between shapes that minimizes\nangular distortion. Conformal registrations are beneficial since it preserves\nthe local geometry well. However, when landmark constraints are enforced,\nconformal mappings generally do not exist. This motivates us to look for a\nunique landmark matching quasi-conformal registration, which minimizes the\nconformality distortion. Under suitable condition on the landmark constraints,\na unique diffeomporphism, called the Teichm\\\"uller extremal mapping between two\nsurfaces can be obtained, which minimizes the maximal conformality distortion.\nIn this paper, we propose an efficient iterative algorithm, called the\nQuasi-conformal (QC) iterations, to compute the Teichm\\\"uller mapping. The\nbasic idea is to represent the set of diffeomorphisms using Beltrami\ncoefficients (BCs), and look for an optimal BC associated to the desired\nTeichm\\\"uller mapping. The associated diffeomorphism can be efficiently\nreconstructed from the optimal BC using the Linear Beltrami Solver(LBS). Using\nBCs to represent diffeomorphisms guarantees the diffeomorphic property of the\nregistration. Using our proposed method, the Teichm\\\"uller mapping can be\naccurately and efficiently computed within 10 seconds. The obtained\nregistration is guaranteed to be bijective. The proposed algorithm can also be\nextended to compute Teichm\\\"uller mapping with soft landmark constraints. We\napplied the proposed algorithm to real applications, such as brain landmark\nmatching registration, constrained texture mapping and human face registration.\nExperimental results shows that our method is both effective and efficient in\ncomputing a non-overlap landmark matching registration with least amount of\nconformality distortion.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2012 11:16:31 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Lui", "Lok Ming", ""], ["Lam", "Ka Chun", ""], ["Yau", "Shing-Tung", ""], ["Gu", "Xianfeng", ""]]}, {"id": "1211.3297", "submitter": "Dong-Ming Yan", "authors": "Dong-Ming Yan and Peter Wonka", "title": "Gap Processing for Adaptive Maximal Poisson-Disk Sampling", "comments": "16 pages. ACM Transactions on Graphics, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the generation of maximal Poisson-disk sets with\nvarying radii. First, we present a geometric analysis of gaps in such disk\nsets. This analysis is the basis for maximal and adaptive sampling in Euclidean\nspace and on manifolds. Second, we propose efficient algorithms and data\nstructures to detect gaps and update gaps when disks are inserted, deleted,\nmoved, or have their radius changed. We build on the concepts of the regular\ntriangulation and the power diagram. Third, we will show how our analysis can\nmake a contribution to the state-of-the-art in surface remeshing.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2012 13:21:03 GMT"}, {"version": "v2", "created": "Thu, 1 Aug 2013 14:12:08 GMT"}], "update_date": "2013-08-02", "authors_parsed": [["Yan", "Dong-Ming", ""], ["Wonka", "Peter", ""]]}, {"id": "1211.3659", "submitter": "Silas Alben", "authors": "Silas Alben", "title": "Color scales that are effective in both color and grayscale", "comments": "9 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of finding a color scale which performs well when\nconverted to a grayscale. We assume that each color is converted to a shade of\ngray with the same intensity as the color. We also assume that the color scales\nhave a linear variation of intensity and hue, and find scales which maximize\nthe average chroma (or \"colorfulness\") of the colors. We find two classes of\nsolutions, which traverse the color wheel in opposite directions. The two\nclasses of scales start with hues near cyan and red. The average chroma of the\nscales are 65-77% those of the pure colors.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2012 17:08:58 GMT"}], "update_date": "2012-11-16", "authors_parsed": [["Alben", "Silas", ""]]}, {"id": "1211.4500", "submitter": "Joost Broekens", "authors": "Joost Broekens, Chao Qu, Willem-Paul Brinkman", "title": "Dynamic Facial Expression of Emotion Made Easy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.GR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Facial emotion expression for virtual characters is used in a wide variety of\nareas. Often, the primary reason to use emotion expression is not to study\nemotion expression generation per se, but to use emotion expression in an\napplication or research project. What is then needed is an easy to use and\nflexible, but also validated mechanism to do so. In this report we present such\na mechanism. It enables developers to build virtual characters with dynamic\naffective facial expressions. The mechanism is based on Facial Action Coding.\nIt is easy to implement, and code is available for download. To show the\nvalidity of the expressions generated with the mechanism we tested the\nrecognition accuracy for 6 basic emotions (joy, anger, sadness, surprise,\ndisgust, fear) and 4 blend emotions (enthusiastic, furious, frustrated, and\nevil). Additionally we investigated the effect of VC distance (z-coordinate),\nthe effect of the VC's face morphology (male vs. female), the effect of a\nlateral versus a frontal presentation of the expression, and the effect of\nintensity of the expression. Participants (n=19, Western and Asian subjects)\nrated the intensity of each expression for each condition (within subject\nsetup) in a non forced choice manner. All of the basic emotions were uniquely\nperceived as such. Further, the blends and confusion details of basic emotions\nare compatible with findings in psychology.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2012 17:10:50 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Broekens", "Joost", ""], ["Qu", "Chao", ""], ["Brinkman", "Willem-Paul", ""]]}, {"id": "1211.4896", "submitter": "Amr Hassan", "authors": "A. H. Hassan, C. J. Fluke, D. G. Barnes, and V. A. Kilborn", "title": "Tera-scale Astronomical Data Analysis and Visualization", "comments": "16 pages, 14 Figures, accepted for publication in Monthly Notices of\n  the Royal Astronomical Society", "journal-ref": null, "doi": "10.1093/mnras/sts513", "report-no": null, "categories": "astro-ph.IM cs.DC cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a high-performance, graphics processing unit (GPU)-based framework\nfor the efficient analysis and visualization of (nearly) terabyte (TB)-sized\n3-dimensional images. Using a cluster of 96 GPUs, we demonstrate for a 0.5 TB\nimage: (1) volume rendering using an arbitrary transfer function at 7--10\nframes per second; (2) computation of basic global image statistics such as the\nmean intensity and standard deviation in 1.7 s; (3) evaluation of the image\nhistogram in 4 s; and (4) evaluation of the global image median intensity in\njust 45 s. Our measured results correspond to a raw computational throughput\napproaching one teravoxel per second, and are 10--100 times faster than the\nbest possible performance with traditional single-node, multi-core CPU\nimplementations. A scalability analysis shows the framework will scale well to\nimages sized 1 TB and beyond. Other parallel data analysis algorithms can be\nadded to the framework with relative ease, and accordingly, we present our\nframework as a possible solution to the image analysis and visualization\nrequirements of next-generation telescopes, including the forthcoming Square\nKilometre Array pathfinder radiotelescopes.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2012 23:00:51 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Hassan", "A. H.", ""], ["Fluke", "C. J.", ""], ["Barnes", "D. G.", ""], ["Kilborn", "V. A.", ""]]}, {"id": "1211.5556", "submitter": "Ofir Pele", "authors": "Ofir Pele and Michael Werman", "title": "Improving Perceptual Color Difference using Basic Color Terms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We suggest a new color distance based on two observations. First, perceptual\ncolor differences were designed to be used to compare very similar colors. They\ndo not capture human perception for medium and large color differences well.\nThresholding was proposed to solve the problem for large color differences,\ni.e. two totally different colors are always the same distance apart. We show\nthat thresholding alone cannot improve medium color differences. We suggest to\nalleviate this problem using basic color terms. Second, when a color distance\nis used for edge detection, many small distances around the just noticeable\ndifference may account for false edges. We suggest to reduce the effect of\nsmall distances.\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2012 17:13:07 GMT"}], "update_date": "2012-11-26", "authors_parsed": [["Pele", "Ofir", ""], ["Werman", "Michael", ""]]}, {"id": "1211.5669", "submitter": "Xin Li", "authors": "Xin Li and M. A. Scott", "title": "Analysis-suitable T-splines: characterization, refineability, and\n  approximation", "comments": null, "journal-ref": "Mathematical Models and Methods in Applied Sciences,Vol. 24, No.\n  06, pp. 1141-1164 (2014)", "doi": null, "report-no": null, "categories": "cs.GR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We establish several fundamental properties of analysis-suitable T-splines\nwhich are important for design and analysis. First, we characterize T-spline\nspaces and prove that the space of smooth bicubic polynomials, defined over the\nextended T-mesh of an analysis-suitable T-spline, is contained in the\ncorresponding analysis-suitable T-spline space. This is accomplished through\nthe theory of perturbed analysis-suitable T-spline spaces and a simple\ntopological dimension formula. Second, we establish the theory of\nanalysis-suitable local refinement and describe the conditions under which two\nanalysis-suitable T-spline spaces are nested. Last, we demonstrate that these\nresults can be used to establish basic approximation results which are critical\nfor analysis.\n", "versions": [{"version": "v1", "created": "Sat, 24 Nov 2012 12:56:58 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Li", "Xin", ""], ["Scott", "M. A.", ""]]}, {"id": "1211.5842", "submitter": "Maysam Mirahmadi", "authors": "Maysam Mirahmadi, Abdallah Shami", "title": "A Novel Algorithm for Real-time Procedural Generation of Building Floor\n  Plans", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Real-time generation of natural-looking floor plans is vital in games with\ndynamic environments. This paper presents an algorithm to generate suburban\nhouse floor plans in real-time. The algorithm is based on the work presented in\n[1]. However, the corridor placement is redesigned to produce floor plans\nsimilar to real houses. Moreover, an optimization stage is added to find a\ncorridor placement with the minimum used space, an approach that is designed to\nmimic the real-life practices to minimize the wasted spaces in the design. The\nresults show very similar floor plans to the ones designed by an architect.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2012 02:13:52 GMT"}], "update_date": "2012-11-27", "authors_parsed": [["Mirahmadi", "Maysam", ""], ["Shami", "Abdallah", ""]]}]