[{"id": "1311.0352", "submitter": "John-John Cabibihan", "authors": "John-John Cabibihan, Hifza Javed, Marcelo Ang Jr., and Sharifah Mariam\n  Aljunied", "title": "Why robots? A survey on the roles and benefits of social robots in the\n  therapy of children with autism", "comments": null, "journal-ref": "International Journal of Social Robotics, 2013, 5(4), 593-618", "doi": "10.1007/s12369-013-0202-2", "report-no": null, "categories": "cs.RO cs.CY cs.HC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper reviews the use of socially interactive robots to assist in the\ntherapy of children with autism. The extent to which the robots were successful\nin helping the children in their social, emotional, and communication deficits\nwas investigated. Child-robot interactions were scrutinized with respect to the\ndifferent target behaviors that are to be elicited from a child during therapy.\nThese behaviors were thoroughly examined with respect to a childs development\nneeds. Most importantly, experimental data from the surveyed works were\nextracted and analyzed in terms of the target behaviors and how each robot was\nused during a therapy session to achieve these behaviors. The study concludes\nby categorizing the different therapeutic roles that these robots were observed\nto play, and highlights the important design features that enable them to\nachieve high levels of effectiveness in autism therapy.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2013 07:15:08 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Cabibihan", "John-John", ""], ["Javed", "Hifza", ""], ["Ang", "Marcelo", "Jr."], ["Aljunied", "Sharifah Mariam", ""]]}, {"id": "1311.0390", "submitter": "Michael Adrir Scott", "authors": "Michael James Scott and Gheorghita Ghinea", "title": "Educating Programmers: A Reflection on Barriers to Deliberate Practice", "comments": "Paper Presented at 2nd Annual HEA STEM Conference (Birmingham, UK,\n  Apr. 17--18, '13), 6 Pages, 1 Table", "journal-ref": "(2013) Proceedings of the 2nd Annual HEA STEM Conference, 028P", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Programming is a craft which often demands that learners engage in a\nsignificantly high level of individual practice and experimentation in order to\nacquire basic competencies. However, practice behaviours can be undermined\nduring the early stages of instruction. This is often the result of seemingly\ntrivial misconceptions that, when left unchecked, create cognitive-affective\nbarriers. These interact with learners' self-beliefs, potentially inducing\naffective states that inhibit practice. This paper questions how to design a\nlearning environment that can address this issue. It is proposed that\nanalytical and adaptable approaches, which could include soft scaffolding,\nongoing detailed informative feedback and a focus on self-enhancement alongside\nskill development, can help overcome such barriers.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2013 16:36:13 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Scott", "Michael James", ""], ["Ghinea", "Gheorghita", ""]]}, {"id": "1311.0527", "submitter": "Harris Kyriakou", "authors": "Harris Kyriakou, Jeffrey V. Nickerson", "title": "Idea Inheritance, Originality, and Collective Innovation", "comments": "Workshop on Information in Networks, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In order to create new products, inventors search and combine previous ideas.\nFew studies have examined the characteristics of search that lead to new\nproducts; most have focused on patent citations, which are often retrospective\nand may not reflect the usefulness of inventions.\n  Through the analysis of collaborations in an online virtual community, the\nimpact of originality on popularity and practicality is tested. These tests in\nturn are based on a method for measuring the distance between 3D shapes. In\nsum, this paper presents a new method for gauging innovation, and suggests ways\nof further understanding the role technology plays in encouraging creativity.\nFrom an organization perspective, this work provides insights into the creative\nprocess, and in particular the open innovation process, in which thousands of\nindividuals together evolve designs, without belonging to the same corporate\nstructure, without claiming IP rights, without exchanging money.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2013 20:58:29 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Kyriakou", "Harris", ""], ["Nickerson", "Jeffrey V.", ""]]}, {"id": "1311.0663", "submitter": "Ai-Ju Huang", "authors": "Ai-Ju Huang, Hao-Chuan Wang, Chien Wen Yuan", "title": "De-Virtualizing Social Events: Understanding the Gap between Online and\n  Offline Participation for Event Invitations", "comments": "Proc. 17th ACM Conference on Computer Supported Cooperative Work and\n  Social Computing (CSCW), 2014", "journal-ref": null, "doi": "10.1145/2531602.2531606", "report-no": null, "categories": "cs.HC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One growing use of computer-based communication media is for gathering people\nto initiate or sustain social events. Although the use of computer-mediated\ncommunication and social network sites such as Facebook for event promotion is\nbecoming popular, online participation in an event does not always translate to\noffline attendance. In this paper, we report on an interview study of 31\nparticipants that examines how people handle online event invitations and what\ninfluences their online and offline participation. The results show that\npeople's event participation is shaped by their social perceptions of the\nevent's nature (e.g., public or private), their relationships to others (e.g.,\nthe strength of their connections to other invitees), and the medium used to\ncommunicate event information (e.g., targeted invitation via email or spam\ncommunication via Facebook event page). By exploring how people decide whether\nto participate online or offline, the results illuminate the sophisticated\nnature of the mechanisms that affect participation and have design implications\nthat can bridge virtual and real attendance.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2013 12:07:27 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Huang", "Ai-Ju", ""], ["Wang", "Hao-Chuan", ""], ["Yuan", "Chien Wen", ""]]}, {"id": "1311.0804", "submitter": "Enrique Wulff", "authors": "Enrique Wulff (ICMAN)", "title": "Innovation \\'educative en sciences de l'information", "comments": "35 pages, in French", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concerning its development in the virtual classroom, the web 2.0 educational\ninnovation means the use and the production of textbooks and the\npersonalisation of the classnotes. The controversy, that is a precondition of\nawareness, organized around the assignment of knowledge to a central authority\nvs its grant to individuals who need it to share their plans with others, would\nmeet the present dynamism of e-learning. To introduce these training strategies\nwith scientific information in marine sciences, an online course was\ntransformed into an opportunity for evaluating and living open access.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2013 18:25:21 GMT"}, {"version": "v2", "created": "Mon, 22 Mar 2021 11:20:43 GMT"}], "update_date": "2021-03-23", "authors_parsed": [["Wulff", "Enrique", "", "ICMAN"]]}, {"id": "1311.0806", "submitter": "Jocelyne Troccaz", "authors": "Gaelle Fiard (TIMC-IMAG), Sonia-Yuki Selmi (TIMC-IMAG), Emmanuel\n  Promayon (TIMC-IMAG), Lucile Vadcard (LSE - UPMF), Jean-Luc Descotes\n  (TIMC-IMAG), Jocelyne Troccaz (TIMC-IMAG)", "title": "Initial validation of a virtual-reality learning environment for\n  prostate biopsies: realism matters!", "comments": null, "journal-ref": "Journal of Endourology and Part B, Videourology (2013) epub ahead\n  of print", "doi": "10.1089/end.2013.0454", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  : Introduction-objectives: A virtual-reality learning environment dedicated\nto prostate biopsies was designed to overcome the limitations of current\nclassical teaching methods. The aim of this study was to validate reliability,\nface, content and construct of the simulator. Materials and methods: The\nsimulator is composed of a) a laptop computer, b) a haptic device with a stylus\nthat mimics the ultrasound probe, c) a clinical case database including three\ndimensional (3D) ultrasound volumes and patient data and d) a learning\nenvironment with a set of progressive exercises including a randomized 12-core\nbiopsy procedure. Both visual (3D biopsy mapping) and numerical (score)\nfeedback are given to the user. The simulator evaluation was conducted in an\nacademic urology department on 7 experts and 14 novices who each performed a\nvirtual biopsy procedure and completed a face and content validity\nquestionnaire. Results: The overall realism of the biopsy procedure was rated\nat a median of 9/10 by non-experts (7.1-9.8). Experts rated the usefulness of\nthe simulator for the initial training of urologists at 8.2/10 (7.9-8.3), but\nreported the range of motion and force feedback as significantly less realistic\nthan novices (p=0.01 and 0.03 respectively). Pearson's r correlation\ncoefficient between correctly placed biopsies on the right and left side of the\nprostate for each user was 0.79 (p<0.001). The 7 experts had a median score of\n64% (59-73), and the 14 novices a median score of 52% (43-67), without reaching\nstatistical significance (p=0,19). Conclusion: The newly designed virtual\nreality learning environment proved its versatility and its reliability, face\nand content were validated. Demonstrating the construct validity will require\nimprovements to the realism and scoring system used.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2013 18:29:54 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Fiard", "Gaelle", "", "TIMC-IMAG"], ["Selmi", "Sonia-Yuki", "", "TIMC-IMAG"], ["Promayon", "Emmanuel", "", "TIMC-IMAG"], ["Vadcard", "Lucile", "", "LSE - UPMF"], ["Descotes", "Jean-Luc", "", "TIMC-IMAG"], ["Troccaz", "Jocelyne", "", "TIMC-IMAG"]]}, {"id": "1311.1162", "submitter": "Bernardo Huberman", "authors": "Claudia Wagner, Philipp Singer, Markus Strohmaier and Bernardo A.\n  Huberman", "title": "Semantic Stability in Social Tagging Streams", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.IR cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One potential disadvantage of social tagging systems is that due to the lack\nof a centralized vocabulary, a crowd of users may never manage to reach a\nconsensus on the description of resources (e.g., books, users or songs) on the\nWeb. Yet, previous research has provided interesting evidence that the tag\ndistributions of resources may become semantically stable over time as more and\nmore users tag them. At the same time, previous work has raised an array of new\nquestions such as: (i) How can we assess the semantic stability of social\ntagging systems in a robust and methodical way? (ii) Does semantic\nstabilization of tags vary across different social tagging systems and\nultimately, (iii) what are the factors that can explain semantic stabilization\nin such systems? In this work we tackle these questions by (i) presenting a\nnovel and robust method which overcomes a number of limitations in existing\nmethods, (ii) empirically investigating semantic stabilization processes in a\nwide range of social tagging systems with distinct domains and properties and\n(iii) detecting potential causes for semantic stabilization, specifically\nimitation behavior, shared background knowledge and intrinsic properties of\nnatural language. Our results show that tagging streams which are generated by\na combination of imitation dynamics and shared background knowledge exhibit\nfaster and higher semantic stability than tagging streams which are generated\nvia imitation dynamics or natural language streams alone.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2013 19:00:02 GMT"}], "update_date": "2013-11-06", "authors_parsed": [["Wagner", "Claudia", ""], ["Singer", "Philipp", ""], ["Strohmaier", "Markus", ""], ["Huberman", "Bernardo A.", ""]]}, {"id": "1311.1213", "submitter": "Lav Varshney", "authors": "Lav R. Varshney, Florian Pinel, Kush R. Varshney, Debarun\n  Bhattacharjya, Angela Schoergendorfer, and Yi-Min Chee", "title": "A Big Data Approach to Computational Creativity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI cs.HC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computational creativity is an emerging branch of artificial intelligence\nthat places computers in the center of the creative process. Broadly,\ncreativity involves a generative step to produce many ideas and a selective\nstep to determine the ones that are the best. Many previous attempts at\ncomputational creativity, however, have not been able to achieve a valid\nselective step. This work shows how bringing data sources from the creative\ndomain and from hedonic psychophysics together with big data analytics\ntechniques can overcome this shortcoming to yield a system that can produce\nnovel and high-quality creative artifacts. Our data-driven approach is\ndemonstrated through a computational creativity system for culinary recipes and\nmenus we developed and deployed, which can operate either autonomously or\nsemi-autonomously with human interaction. We also comment on the volume,\nvelocity, variety, and veracity of data in computational creativity.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2013 21:00:14 GMT"}], "update_date": "2013-11-07", "authors_parsed": [["Varshney", "Lav R.", ""], ["Pinel", "Florian", ""], ["Varshney", "Kush R.", ""], ["Bhattacharjya", "Debarun", ""], ["Schoergendorfer", "Angela", ""], ["Chee", "Yi-Min", ""]]}, {"id": "1311.1725", "submitter": "Norman Gray", "authors": "Norman Gray and Nicolas Labrosse and Sarah Honeychurch and Steve\n  Draper and Niall Barr", "title": "Tagging and Linking Lecture Audio Recordings: Goals and Practice", "comments": "10 pages, 1 figure; draft", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.ed-ph cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Making and distributing audio recordings of lectures is cheap and technically\nstraightforward, and these recordings represent an underexploited teaching\nresource. We explore the reasons why such recordings are not more used; we\nbelieve the barriers inhibiting such use should be easily overcome. Students\ncan listen to a lecture they missed, or re-listen to a lecture at revision\ntime, but their interaction is limited by the affordances of the replaying\ntechnology. Listening to lecture audio is generally solitary, linear, and\ndisjoint from other available media.\n  In this paper, we describe a tool we are developing at the University of\nGlasgow, which enriches students' interactions with lecture audio. We describe\nour experiments with this tool in session 2012--13. Fewer students used the\ntool than we expected would naturally do so, and we discuss some possible\nexplanations for this.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2013 16:04:18 GMT"}], "update_date": "2013-11-08", "authors_parsed": [["Gray", "Norman", ""], ["Labrosse", "Nicolas", ""], ["Honeychurch", "Sarah", ""], ["Draper", "Steve", ""], ["Barr", "Niall", ""]]}, {"id": "1311.1757", "submitter": "Boleslaw Szymanski", "authors": "Boleslaw K. Szymanski, Xin Lin, Andrea Asztalos, Sameet Sreenivasan", "title": "Failure dynamics of the global risk network", "comments": null, "journal-ref": "Scientific Reports 5:10998, June 18, 2015", "doi": "10.1038/srep10998", "report-no": null, "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risks threatening modern societies form an intricately interconnected network\nthat often underlies crisis situations. Yet, little is known about how risk\nmaterializations in distinct domains influence each other. Here we present an\napproach in which expert assessments of risks likelihoods and influence\nunderlie a quantitative model of the global risk network dynamics. The modeled\nrisks range from environmental to economic and technological and include\ndifficult to quantify risks, such as geo-political or social. Using the maximum\nlikelihood estimation, we find the optimal model parameters and demonstrate\nthat the model including network effects significantly outperforms the others,\nuncovering full value of the expert collected data. We analyze the model\ndynamics and study its resilience and stability. Our findings include such risk\nproperties as contagion potential, persistence, roles in cascades of failures\nand the identity of risks most detrimental to system stability. The model\nprovides quantitative means for measuring the adverse effects of risk\ninterdependence and the materialization of risks in the network.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2013 17:26:09 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2013 02:57:29 GMT"}, {"version": "v3", "created": "Mon, 9 Dec 2013 04:10:35 GMT"}, {"version": "v4", "created": "Mon, 19 Jan 2015 16:38:48 GMT"}, {"version": "v5", "created": "Wed, 13 May 2015 07:39:51 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Szymanski", "Boleslaw K.", ""], ["Lin", "Xin", ""], ["Asztalos", "Andrea", ""], ["Sreenivasan", "Sameet", ""]]}, {"id": "1311.2551", "submitter": "Manuel Mazzara", "authors": "Manuel Mazzara, Luca Biselli, Pier Paolo Greco, Nicola Dragoni,\n  Antonio Marraffa, Nafees Qamar, Simona de Nicola (University of Bologna,\n  Italy)", "title": "Social Networks and Collective Intelligence: A Return to the Agora", "comments": "Preprint without images for copyright reasons", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, acquisition of trustable information is increasingly important in\nboth professional and private contexts. However, establishing what information\nis trustable and what is not, is a very challenging task. For example, how can\ninformation quality be reliably assessed? How can sources? credibility be\nfairly assessed? How can gatekeeping processes be found trustworthy when\nfiltering out news and deciding ranking and priorities of traditional media? An\nInternet-based solution to a human-based ancient issue is being studied, and it\nis called Polidoxa, from Greek \"poly\", meaning \"many\" or \"several\" and \"doxa\",\nmeaning \"common belief\" or \"popular opinion\". This old problem will be solved\nby means of ancient philosophies and processes with truly modern tools and\ntechnologies. This is why this work required a collaborative and\ninterdisciplinary joint effort from researchers with very different backgrounds\nand institutes with significantly different agendas. Polidoxa aims at offering:\n1) a trust-based search engine algorithm, which exploits stigmergic behaviours\nof users? network, 2) a trust-based social network, where the notion of trust\nderives from network activity and 3) a holonic system for bottom-up\nself-protection and social privacy. By presenting the Polidoxa solution, this\nwork also describes the current state of traditional media as well as newer\nones, providing an accurate analysis of major search engines such as Google and\nsocial network (e.g., Facebook). The advantages that Polidoxa offers, compared\nto these, are also clearly detailed and motivated. Finally, a Twitter\napplication (Polidoxa@twitter) which enables experimentation of basic Polidoxa\nprinciples is presented.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2013 19:56:52 GMT"}], "update_date": "2013-11-12", "authors_parsed": [["Mazzara", "Manuel", "", "University of Bologna,\n  Italy"], ["Biselli", "Luca", "", "University of Bologna,\n  Italy"], ["Greco", "Pier Paolo", "", "University of Bologna,\n  Italy"], ["Dragoni", "Nicola", "", "University of Bologna,\n  Italy"], ["Marraffa", "Antonio", "", "University of Bologna,\n  Italy"], ["Qamar", "Nafees", "", "University of Bologna,\n  Italy"], ["de Nicola", "Simona", "", "University of Bologna,\n  Italy"]]}, {"id": "1311.2911", "submitter": "Kevin Kung", "authors": "Kevin S. Kung, Kael Greco, Stanislav Sobolevsky, and Carlo Ratti", "title": "Exploring universal patterns in human home-work commuting from mobile\n  phone data", "comments": null, "journal-ref": "Kung KS, Greco K, Sobolevsky S, Ratti C (2014) Exploring Universal\n  Patterns in Human Home-Work Commuting from Mobile Phone Data. PLoS ONE 9(6):\n  e96180", "doi": "10.1371/journal.pone.0096180", "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Home-work commuting has always attracted significant research attention\nbecause of its impact on human mobility. One of the key assumptions in this\ndomain of study is the universal uniformity of commute times. However, a true\ncomparison of commute patterns has often been hindered by the intrinsic\ndifferences in data collection methods, which make observation from different\ncountries potentially biased and unreliable. In the present work, we approach\nthis problem through the use of mobile phone call detail records (CDRs), which\noffers a consistent method for investigating mobility patterns in wholly\ndifferent parts of the world. We apply our analysis to a broad range of\ndatasets, at both the country and city scale. Additionally, we compare these\nresults with those obtained from vehicle GPS traces in Milan. While different\nregions have some unique commute time characteristics, we show that the\nhome-work time distributions and average values within a single region are\nindeed largely independent of commute distance or country (Portugal, Ivory\nCoast, and Boston)--despite substantial spatial and infrastructural\ndifferences. Furthermore, a comparative analysis demonstrates that such\ndistance-independence holds true only if we consider multimodal commute\nbehaviors--as consistent with previous studies. In car-only (Milan GPS traces)\nand car-heavy (Saudi Arabia) commute datasets, we see that commute time is\nindeed influenced by commute distance.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2013 20:29:14 GMT"}, {"version": "v2", "created": "Wed, 24 Sep 2014 20:46:56 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Kung", "Kevin S.", ""], ["Greco", "Kael", ""], ["Sobolevsky", "Stanislav", ""], ["Ratti", "Carlo", ""]]}, {"id": "1311.3037", "submitter": "Junzhou Zhao", "authors": "Pinghui Wang, Bruno Ribeiro, Junzhou Zhao, John C.S. Lui, Don Towsley,\n  Xiaohong Guan", "title": "Practical Characterization of Large Networks Using Neighborhood\n  Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Characterizing large online social networks (OSNs) through node querying is a\nchallenging task. OSNs often impose severe constraints on the query rate, hence\nlimiting the sample size to a small fraction of the total network. Various\nad-hoc subgraph sampling methods have been proposed, but many of them give\nbiased estimates and no theoretical basis on the accuracy. In this work, we\nfocus on developing sampling methods for OSNs where querying a node also\nreveals partial structural information about its neighbors. Our methods are\noptimized for NoSQL graph databases (if the database can be accessed directly),\nor utilize Web API available on most major OSNs for graph sampling. We show\nthat our sampling method has provable convergence guarantees on being an\nunbiased estimator, and it is more accurate than current state-of-the-art\nmethods. We characterize metrics such as node label density estimation and edge\nlabel density estimation, two of the most fundamental network characteristics\nfrom which other network characteristics can be derived. We evaluate our\nmethods on-the-fly over several live networks using their native APIs. Our\nsimulation studies over a variety of offline datasets show that by including\nneighborhood information, our method drastically (4-fold) reduces the number of\nsamples required to achieve the same estimation accuracy of state-of-the-art\nmethods.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2013 07:36:55 GMT"}], "update_date": "2013-11-14", "authors_parsed": [["Wang", "Pinghui", ""], ["Ribeiro", "Bruno", ""], ["Zhao", "Junzhou", ""], ["Lui", "John C. S.", ""], ["Towsley", "Don", ""], ["Guan", "Xiaohong", ""]]}, {"id": "1311.3231", "submitter": "Youssef Gahi", "authors": "Youssef Gahi, Meryem Lamrani, Mouhcine Guennoun, Khalil El-Khatib", "title": "Infrastructure Logicielle d un Environnement Hospitalier Intelligent", "comments": "50 pages. Master thesis 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The impact of new technologies in the field of healthcare has been proven to\nbe satisfactory in improving the quality of care and services for patients. The\nhospital environment is undoubtedly one of the environments where human or\nhardware errors can cause harmful damage. It is therefore very useful for the\nsector to be at the forefront of technology and use the strongest and most\nefficient means since it is supposed to be an environment of reliability, trust\nand is legally responsible for ensuring the confidentiality of all patient\ninformation. In this project we have proposed and developed a smart hospital\nenviornement that allows both, detecting patien fall and send alerts to the\nsuitable parties, and securing patien stored data through RFID technology.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2013 20:34:48 GMT"}], "update_date": "2013-11-14", "authors_parsed": [["Gahi", "Youssef", ""], ["Lamrani", "Meryem", ""], ["Guennoun", "Mouhcine", ""], ["El-Khatib", "Khalil", ""]]}, {"id": "1311.3371", "submitter": "Gayatri Venugopal Miss", "authors": "Gayatri Venugopal", "title": "Android Note Manager Application for People with Visual Impairment", "comments": "6 pages, 4 figures", "journal-ref": null, "doi": "10.5121/ijmnct.2013.3502", "report-no": null, "categories": "cs.HC cs.CY", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  With the outburst of smart-phones today, the market is exploding with various\nmobile applications. This paper proposes an application using which visually\nimpaired people can type a note in Grade 1 Braille and save it in the external\nmemory of their smart-phone. The application also shows intelligence by\nactivating reminders and/or calling certain contacts based on the content in\nthe notes.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2013 03:12:54 GMT"}], "update_date": "2013-11-18", "authors_parsed": [["Venugopal", "Gayatri", ""]]}, {"id": "1311.4180", "submitter": "Volker Tresp", "authors": "Volker Tresp, Sonja Zillner, Maria J. Costa, Yi Huang, Alexander\n  Cavallaro, Peter A. Fasching, Andre Reis, Martin Sedlmayr, Thomas Ganslandt,\n  Klemens Budde, Carl Hinrichs, Danilo Schmidt, Philipp Daumke, Daniel Sonntag,\n  Thomas Wittenberg, Patricia G. Oppelt, Denis Krompass", "title": "Towards a New Science of a Clinical Data Intelligence", "comments": "NIPS 2013 Workshop: Machine Learning for Clinical Data Analysis and\n  Healthcare, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we define Clinical Data Intelligence as the analysis of data\ngenerated in the clinical routine with the goal of improving patient care. We\ndefine a science of a Clinical Data Intelligence as a data analysis that\npermits the derivation of scientific, i.e., generalizable and reliable results.\nWe argue that a science of a Clinical Data Intelligence is sensible in the\ncontext of a Big Data analysis, i.e., with data from many patients and with\ncomplete patient information. We discuss that Clinical Data Intelligence\nrequires the joint efforts of knowledge engineering, information extraction\n(from textual and other unstructured data), and statistics and statistical\nmachine learning. We describe some of our main results as conjectures and\nrelate them to a recently funded research project involving two major German\nuniversity hospitals.\n", "versions": [{"version": "v1", "created": "Sun, 17 Nov 2013 16:24:22 GMT"}, {"version": "v2", "created": "Wed, 18 Dec 2013 17:51:10 GMT"}, {"version": "v3", "created": "Mon, 30 Dec 2013 09:58:22 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Tresp", "Volker", ""], ["Zillner", "Sonja", ""], ["Costa", "Maria J.", ""], ["Huang", "Yi", ""], ["Cavallaro", "Alexander", ""], ["Fasching", "Peter A.", ""], ["Reis", "Andre", ""], ["Sedlmayr", "Martin", ""], ["Ganslandt", "Thomas", ""], ["Budde", "Klemens", ""], ["Hinrichs", "Carl", ""], ["Schmidt", "Danilo", ""], ["Daumke", "Philipp", ""], ["Sonntag", "Daniel", ""], ["Wittenberg", "Thomas", ""], ["Oppelt", "Patricia G.", ""], ["Krompass", "Denis", ""]]}, {"id": "1311.4389", "submitter": "Sanat Kumar Bista", "authors": "C\\'ecile Paris, Nathalie Colineau, Surya Nepal, Sanat Bista and Gina\n  Beschorner", "title": "Ethical considerations in an online community: the balancing act", "comments": null, "journal-ref": "Paris, C., Colineau, N., Nepal, S., Bista, S. K., & Beschorner, G.\n  (2013). Ethical considerations in an online community: the balancing act.\n  Ethics and Information Technology, 1-16", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the emergence and rapid growth of Social Media, a number of government\ndepartments in several countries have embraced Social Media as a privilege\nchannel to interact with their constituency. We are exploring, in collaboration\nwith the Australian Department of Human Services, the possibility to exploit\nthe potential of social networks to support specific groups of citizens. To\nthis end, we have developed Next Step, an online community to help people\ncurrently receiving welfare payments find a job and become financially\nself-sufficient. In this paper, we explore some ethical issues that arise when\ngovernments engage directly with citizens, in particular with communities in\ndifficult situations, and when researchers are involved. We describe some of\nthe challenges we faced and how we addressed them. Our work highlights the\ncomplexity of the problem, when an online community involves a government\ndepartment and a welfare recipient group with a dependency relationship with\nthat department. It becomes a balancing act, with the need to ensure privacy of\nthe community members whilst still fulfilling the government's legal\nresponsibilities. While difficult, these issues must be addressed if\ngovernments are to engage with their citizens using Social Media.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2013 04:29:21 GMT"}], "update_date": "2013-11-19", "authors_parsed": [["Paris", "Cécile", ""], ["Colineau", "Nathalie", ""], ["Nepal", "Surya", ""], ["Bista", "Sanat", ""], ["Beschorner", "Gina", ""]]}, {"id": "1311.5084", "submitter": "Amelia Carolina Sparavigna", "authors": "Amelia Carolina Sparavigna", "title": "Pearltrees as a tool for referencing and teaching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pearltrees is a social service, using which people can organise Web contents,\nphotos and notes. These contents are the \"pearls\" on some trees. Besides the\nsocial opportunities, the trees can be used as a tool to organise references\nand for content curation. However, they can be helpful for teaching purposes\ntoo.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2013 19:49:40 GMT"}], "update_date": "2013-11-21", "authors_parsed": [["Sparavigna", "Amelia Carolina", ""]]}, {"id": "1311.5123", "submitter": "Carlos Sarraute", "authors": "Nicolas Ponieman (1), Alejo Salles (2), Carlos Sarraute (1) ((1)\n  Grandata Labs, (2) Physics Dept., Universidad de Buenos Aires)", "title": "Human Mobility and Predictability enriched by Social Phenomena\n  Information (extended abstract)", "comments": "Third Conference on the Analysis of Mobile Phone Datasets (NetMob\n  2013). May 1-3, 2013, MIT", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The information collected by mobile phone operators can be considered as the\nmost detailed information on human mobility across a large part of the\npopulation. The study of the dynamics of human mobility using the collected\ngeolocations of users, and applying it to predict future users' locations, has\nbeen an active field of research in recent years. In this work, we study the\nextent to which social phenomena are reflected in mobile phone data, focusing\nin particular in the cases of urban commute and major sports events. We\nillustrate how these events are reflected in the data, and show how information\nabout the events can be used to improve predictability in a simple model for a\nmobile phone user's location.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2013 16:27:30 GMT"}], "update_date": "2013-11-21", "authors_parsed": [["Ponieman", "Nicolas", ""], ["Salles", "Alejo", ""], ["Sarraute", "Carlos", ""]]}, {"id": "1311.5133", "submitter": "Rupam Sharma", "authors": "Rupam Kumar Sharma and Dhrubajyoti gogoi", "title": "Android Based Emergency Alert Button", "comments": "3 pages, ISSN: 2278-3075, Volume-2, Issue-4, March 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Android is a java based operating system which runs on the Linux kernel. It\nis lightweight and full featured. Android applications are developed using Java\nand can be ported to new platform easily thereby fostering huge number of\nuseful mobile applications. This paper describes about a SOS application being\ndeveloped and its successful implementation with tested results. The\napplication has target users those sections of the people who surprisingly\nfalls into a situation where instant communication of their whereabouts becomes\nindispensable to be informed to certain authorized persons at remote end\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2013 16:52:07 GMT"}], "update_date": "2013-11-21", "authors_parsed": [["Sharma", "Rupam Kumar", ""], ["gogoi", "Dhrubajyoti", ""]]}, {"id": "1311.5502", "submitter": "Carlos Sarraute", "authors": "Carlos Sarraute, Gervasio Calderon (Grandata Labs)", "title": "Evolution of Communities with Focus on Stability (extended abstract)", "comments": "Third Conference on the Analysis of Mobile Phone Datasets (NetMob\n  2013). May 1-3, 2013, MIT", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The detection of communities is an important tool used to analyze the social\ngraph of mobile phone users. Within each community, customers are susceptible\nof attracting new ones, retaining old ones and/or accepting new products or\nservices through the leverage of mutual influences. The communities of users\nare smaller units, easier to grasp, and allow for example the computation of\nrole analysis -- based on the centrality of an actor within his community.\n  The problem of finding communities in static graphs has been widely studied.\nHowever, from the point of view of a telecom analyst, to be really useful, the\ndetected communities must evolve as the social graph of communications changes\nover time -- for example, in order to perform marketing actions on communities\nand track the results of those actions over time. Additionally the behaviors of\ncommunities of users over time can be used to predict future activity that\ninterests the telecom operators, such as subscriber churn or handset adoption.\nSimilary group evolution can provide insights for designing strategies, such as\nthe early warning of group churn.\n  Stability is a crucial issue: the analysis performed on a given community\nwill be lost, if the analyst cannot keep track of this community in the\nfollowing time steps. This is the particular use case that we tackle in this\npaper: tracking the evolution of communities in dynamic scenarios with focus on\nstability.\n  We propose two modifications to a widely used static community detection\nalgorithm. We then describe experiments to study the stability and quality of\nthe resulting partitions on real-world social networks, represented by monthly\ncall graphs for millions of subscribers.\n", "versions": [{"version": "v1", "created": "Thu, 21 Nov 2013 18:27:37 GMT"}], "update_date": "2013-11-22", "authors_parsed": [["Sarraute", "Carlos", "", "Grandata Labs"], ["Calderon", "Gervasio", "", "Grandata Labs"]]}, {"id": "1311.5917", "submitter": "Carlos Sarraute", "authors": "Nicolas Ponieman, Alejo Salles, Carlos Sarraute", "title": "Human Mobility and Predictability enriched by Social Phenomena\n  Information", "comments": null, "journal-ref": "Proc. 2013 IEEE/ACM International Conference on Advances in Social\n  Networks Analysis and Mining ASONAM, Niagara Falls, Canada, August 25-28,\n  2013, pp. 1331-1336", "doi": "10.1145/2492517.2500236", "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The massive amounts of geolocation data collected from mobile phone records\nhas sparked an ongoing effort to understand and predict the mobility patterns\nof human beings. In this work, we study the extent to which social phenomena\nare reflected in mobile phone data, focusing in particular in the cases of\nurban commute and major sports events. We illustrate how these events are\nreflected in the data, and show how information about the events can be used to\nimprove predictability in a simple model for a mobile phone user's location.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2013 22:10:53 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Ponieman", "Nicolas", ""], ["Salles", "Alejo", ""], ["Sarraute", "Carlos", ""]]}, {"id": "1311.6165", "submitter": "Ying Long", "authors": "Ying Long and Xingjian Liu", "title": "Automated identification and characterization of parcels (AICP) with\n  OpenStreetMap and Points of Interest", "comments": "26 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Against the paucity of urban parcels in China, this paper proposes a method\nto automatically identify and characterize parcels (AICP) with OpenStreetMap\n(OSM) and Points of Interest (POI) data. Parcels are the basic spatial units\nfor fine-scale urban modeling, urban studies, as well as spatial planning.\nConventional ways of identification and characterization of parcels rely on\nremote sensing and field surveys, which are labor intensive and\nresource-consuming. Poorly developed digital infrastructure, limited resources,\nand institutional barriers have all hampered the gathering and application of\nparcel data in developing countries. Against this backdrop, we employ OSM road\nnetworks to identify parcel geometries and POI data to infer parcel\ncharacteristics. A vector-based CA model is adopted to select urban parcels.\nThe method is applied to the entire state of China and identifies 82,645 urban\nparcels in 297 cities. Notwithstanding all the caveats of open and/or\ncrowd-sourced data, our approach could produce reasonably good approximation of\nparcels identified from conventional methods, thus having the potential to\nbecome a useful supplement.\n", "versions": [{"version": "v1", "created": "Sun, 24 Nov 2013 20:24:41 GMT"}, {"version": "v2", "created": "Wed, 12 Feb 2014 15:01:12 GMT"}, {"version": "v3", "created": "Mon, 30 Mar 2015 12:04:33 GMT"}], "update_date": "2015-03-31", "authors_parsed": [["Long", "Ying", ""], ["Liu", "Xingjian", ""]]}, {"id": "1311.6526", "submitter": "Anirban Mahanti", "authors": "Youmna Borghol, Sebastien Ardon, Niklas Carlsson, Derek Eager, and\n  Anirban Mahanti", "title": "The Untold Story of the Clones: Content-agnostic Factors that Impact\n  YouTube Video Popularity", "comments": "Dataset available at: http://www.ida.liu.se/~nikca/papers/kdd12.html", "journal-ref": "Proceedings of the 18th ACM SIGKDD International Conference on\n  Knowledge Discovery and Data Mining (KDD 2012)", "doi": "10.1145/2339530.2339717", "report-no": null, "categories": "cs.SI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Video dissemination through sites such as YouTube can have widespread impacts\non opinions, thoughts, and cultures. Not all videos will reach the same\npopularity and have the same impact. Popularity differences arise not only\nbecause of differences in video content, but also because of other\n\"content-agnostic\" factors. The latter factors are of considerable interest but\nit has been difficult to accurately study them. For example, videos uploaded by\nusers with large social networks may tend to be more popular because they tend\nto have more interesting content, not because social network size has a\nsubstantial direct impact on popularity. In this paper, we develop and apply a\nmethodology that is able to accurately assess, both qualitatively and\nquantitatively, the impacts of various content-agnostic factors on video\npopularity. When controlling for video content, we observe a strong linear\n\"rich-get-richer\" behavior, with the total number of previous views as the most\nimportant factor except for very young videos. The second most important factor\nis found to be video age. We analyze a number of phenomena that may contribute\nto rich-get-richer, including the first-mover advantage, and search bias\ntowards popular videos. For young videos we find that factors other than the\ntotal number of previous views, such as uploader characteristics and number of\nkeywords, become relatively more important. Our findings also confirm that\ninaccurate conclusions can be reached when not controlling for content.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2013 00:41:52 GMT"}], "update_date": "2013-11-27", "authors_parsed": [["Borghol", "Youmna", ""], ["Ardon", "Sebastien", ""], ["Carlsson", "Niklas", ""], ["Eager", "Derek", ""], ["Mahanti", "Anirban", ""]]}, {"id": "1311.6670", "submitter": "Nehla Ghouaiel", "authors": "Nehla Ghouaiel (IRIT), Jean-Marc Cieutat, Jean-Pierre Jessel (IRIT)", "title": "Mobile Augmented Reality Applications to Discover New Environments", "comments": "Science and Information Conference 2013, France (2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although man has become sedentary over time, his wish to travel the world\nremains as strong as ever. The aim of this paper is to show how techniques\nbased on imagery and Augmented Reality (AR) can prove to be of great help when\ndiscovering a new urban environment and observing the evolution of the natural\nenvironment. The study's support is naturally the Smartphone which in just a\nfew years has become our most familiar device, which we take with us\npractically everywhere we go in our daily lives.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2013 14:00:24 GMT"}], "update_date": "2013-11-27", "authors_parsed": [["Ghouaiel", "Nehla", "", "IRIT"], ["Cieutat", "Jean-Marc", "", "IRIT"], ["Jessel", "Jean-Pierre", "", "IRIT"]]}, {"id": "1311.6802", "submitter": "Smriti Bhagat", "authors": "Smriti Bhagat, Udi Weinsberg, Stratis Ioannidis, Nina Taft", "title": "Recommending with an Agenda: Active Learning of Private Attributes using\n  Matrix Factorization", "comments": "This is the extended version of a paper that appeared in ACM RecSys\n  2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recommender systems leverage user demographic information, such as age,\ngender, etc., to personalize recommendations and better place their targeted\nads. Oftentimes, users do not volunteer this information due to privacy\nconcerns, or due to a lack of initiative in filling out their online profiles.\nWe illustrate a new threat in which a recommender learns private attributes of\nusers who do not voluntarily disclose them. We design both passive and active\nattacks that solicit ratings for strategically selected items, and could thus\nbe used by a recommender system to pursue this hidden agenda. Our methods are\nbased on a novel usage of Bayesian matrix factorization in an active learning\nsetting. Evaluations on multiple datasets illustrate that such attacks are\nindeed feasible and use significantly fewer rated items than static inference\nmethods. Importantly, they succeed without sacrificing the quality of\nrecommendations to users.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2013 20:48:59 GMT"}, {"version": "v2", "created": "Wed, 30 Jul 2014 23:08:54 GMT"}], "update_date": "2014-08-01", "authors_parsed": [["Bhagat", "Smriti", ""], ["Weinsberg", "Udi", ""], ["Ioannidis", "Stratis", ""], ["Taft", "Nina", ""]]}]