[{"id": "1301.0152", "submitter": "Arkadii Slinko", "authors": "Dodge Cahan, John McCabe-Dansted and Arkadii Slinko", "title": "Nonconvergent Electoral Equilibria under Scoring Rules: Beyond Plurality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use Hotelling's spatial model of competition to investigate the\nposition-taking behaviour of political candidates under a class of electoral\nsystems known as scoring rules. In a scoring rule election, voters rank all the\ncandidates running for office, following which the candidates are assigned\npoints according to a vector of nonincreasing scores. Convergent Nash\nequilibria in which all candidates adopt the same policy were characterised by\nCox (1987). Here, we investigate nonconvergent equilibria, where candidates\nadopt divergent policies. We identify a number of classes of scoring rules\nexhibiting a range of different equilibrium properties. For some of these,\nnonconvergent equilibria do not exist. For others, nonconvergent equilibria in\nwhich candidates cluster at positions spread across the issue space are\nobserved. In particular, we prove that the class of convex rules does not have\nNash equilibria (convergent or nonconvergent) with the exception of some\nderivatives of Borda rule. Finally, we examine the special cases of four-,\nfive- and six- candidate elections. In the former two cases, we provide a\ncomplete characterisation of nonconvergent equilibria.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2013 01:06:26 GMT"}], "update_date": "2013-01-03", "authors_parsed": [["Cahan", "Dodge", ""], ["McCabe-Dansted", "John", ""], ["Slinko", "Arkadii", ""]]}, {"id": "1301.0401", "submitter": "Hu Fu", "authors": "Hu Fu and Jason Hartline and Darrell Hoy", "title": "Prior-independent Auctions for Risk-averse Agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study simple and approximately optimal auctions for agents with a\nparticular form of risk-averse preferences. We show that, for symmetric agents,\nthe optimal revenue (given a prior distribution over the agent preferences) can\nbe approximated by the first-price auction (which is prior independent), and,\nfor asymmetric agents, the optimal revenue can be approximated by an auction\nwith simple form. These results are based on two technical methods. The first\nis for upper-bounding the revenue from a risk-averse agent. The second gives a\npayment identity for mechanisms with pay-your-bid semantics.\n", "versions": [{"version": "v1", "created": "Thu, 3 Jan 2013 09:23:38 GMT"}], "update_date": "2013-01-04", "authors_parsed": [["Fu", "Hu", ""], ["Hartline", "Jason", ""], ["Hoy", "Darrell", ""]]}, {"id": "1301.0577", "submitter": "Michael Kearns", "authors": "Michael Kearns, Yishay Mansour", "title": "Efficient Nash Computation in Large Population Games with Bounded\n  Influence", "comments": "Appears in Proceedings of the Eighteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI2002)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2002-PG-259-266", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a general representation of large-population games in which each\nplayer s influence ON the others IS centralized AND limited, but may otherwise\nbe arbitrary.This representation significantly generalizes the class known AS\ncongestion games IN a natural way.Our main results are provably correct AND\nefficient algorithms FOR computing AND learning approximate Nash equilibria IN\nthis general framework.\n", "versions": [{"version": "v1", "created": "Wed, 12 Dec 2012 15:56:50 GMT"}], "update_date": "2013-01-07", "authors_parsed": [["Kearns", "Michael", ""], ["Mansour", "Yishay", ""]]}, {"id": "1301.0595", "submitter": "Ryan Porter", "authors": "Ryan Porter, Amir Ronen, Yoav Shoham, Moshe Tennenholtz", "title": "Mechanism Design with Execution Uncertainty", "comments": "Appears in Proceedings of the Eighteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI2002)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2002-PG-414-421", "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the notion of fault tolerant mechanism design, which extends the\nstandard game theoretic framework of mechanism design to allow for uncertainty\nabout execution. Specifically, we define the problem of task allocation in\nwhich the private information of the agents is not only their costs to attempt\nthe tasks, but also their probabilities of failure. For several different\ninstances of this setting we present technical results, including positive ones\nin the form of mechanisms that are incentive compatible, individually rational\nand efficient, and negative ones in the form of impossibility theorems.\n", "versions": [{"version": "v1", "created": "Wed, 12 Dec 2012 15:58:02 GMT"}], "update_date": "2013-01-07", "authors_parsed": [["Porter", "Ryan", ""], ["Ronen", "Amir", ""], ["Shoham", "Yoav", ""], ["Tennenholtz", "Moshe", ""]]}, {"id": "1301.0902", "submitter": "Meghana Nasre Ms.", "authors": "Meghana Nasre", "title": "Popular Matchings -- structure and cheating strategies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the cheating strategies for the popular matchings problem. The\npopular matchings problem can be defined as follows: Let G = (A U P, E) be a\nbipartite graph where A denotes a set of agents, P denotes a set of posts and\nthe edges in E are ranked. Each agent ranks a subset of posts in an order of\npreference, possibly involving ties. A matching M is popular if there exists no\nmatching M' such that the number of agents that prefer M' to M exceeds the\nnumber of agents that prefer M to M'. Consider a centralized market where\nagents submit their preferences and a central authority matches agents to posts\naccording to the notion of popularity. Since a popular matching need not be\nunique, we assume that the central authority chooses an arbitrary popular\nmatching. Let a1 be the sole manipulative agent who is aware of the true\npreference lists of all other agents. The goal of a1 is to falsify her\npreference list to get better always, that is, to improve the set of posts that\nshe gets matched to as opposed to what she got when she was truthful. We show\nthat the optimal cheating strategy for a single agent to get better always can\nbe computed in O(\\sqrt{n}m) time when preference lists are allowed to contain\nties and in O(m+n) time when preference lists are all strict. Here n = |A| +\n|P| and m = |E|.\n  To compute the cheating strategies, we develop a switching graph\ncharacterization of the popular matchings problem involving ties. The switching\ngraph characterization was studied for the case of strict lists by McDermid and\nIrving (J. Comb. Optim. 2011) and it was open for the case of ties. The\nswitching graph characterization for the case of ties is of independent\ninterest and answers a part of the open questions posed by McDermid and Irving.\n", "versions": [{"version": "v1", "created": "Sat, 5 Jan 2013 13:24:58 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Nasre", "Meghana", ""]]}, {"id": "1301.1153", "submitter": "Oren Ben-Zwi", "authors": "Oren Ben-Zwi, Ron Lavi and Ilan Newman", "title": "Ascending auctions and Walrasian equilibrium", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a family of submodular valuation classes that generalizes gross\nsubstitute. We show that Walrasian equilibrium always exist for one class in\nthis family, and there is a natural ascending auction which finds it. We prove\nsome new structural properties on gross-substitute auctions which, in turn,\nshow that the known ascending auctions for this class (Gul-Stacchetti and\nAusbel) are, in fact, identical. We generalize these two auctions, and provide\na simple proof that they terminate in a Walrasian equilibrium.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2013 11:15:56 GMT"}, {"version": "v2", "created": "Tue, 8 Jan 2013 11:58:51 GMT"}, {"version": "v3", "created": "Wed, 10 Jul 2013 14:25:20 GMT"}], "update_date": "2013-07-11", "authors_parsed": [["Ben-Zwi", "Oren", ""], ["Lavi", "Ron", ""], ["Newman", "Ilan", ""]]}, {"id": "1301.1268", "submitter": "Vincent Gauthier", "authors": "Abhik Banerjee, Vincent Gauthier, Houda Labiod, Hossam Afifi", "title": "Cooperation Optimized Design for Information Dissemination in Vehicular\n  Networks using Evolutionary Game Theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an evolutionary game theoretic approach to study node cooperation\nbehavior in wireless ad hoc networks. Evolutionary game theory (EGT) has been\nused to study the conditions governing the growth of cooperation behavior in\nbiological and social networks. We propose a model of node cooperation behavior\nin dynamic wireless networks such as vehicular networks. Our work is motivated\nby the fact that, similar to existing EGT studies, node behavior in dynamic\nwireless networks is characterized by decision making that only depends on the\nimmediate neighborhood. We adapt our model to study cooperation behavior in the\ncontext of information dissemination in wireless networks. We obtain conditions\nthat determine whether a network evolves to a state of complete cooperation\nfrom all nodes. Finally, we use our model to study the evolution of cooperation\nbehavior and its impact on content downloading in vehicular networks, taking\ninto consideration realistic network conditions.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2013 17:11:33 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Banerjee", "Abhik", ""], ["Gauthier", "Vincent", ""], ["Labiod", "Houda", ""], ["Afifi", "Hossam", ""]]}, {"id": "1301.1420", "submitter": "Arkadii Slinko", "authors": "Arkadii Slinko and Shaun White", "title": "Is it ever safe to vote strategically?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are many situations in which mis-coordinated strategic voting can leave\nstrategic voters worse off than they would have been had they not tried to\nstrategize. We analyse the simplest of such scenarios, in which the set of\nstrategic voters all have the same sincere preferences and all cast the same\nstrategic vote, while all other voters vote sincerely. Most mis-coordinations\nin this framework can be classified as instances of either strategic\novershooting (too many voted strategically) or strategic undershooting (too\nfew). If mis-coordination can result in strategic voters ending up worse off\nthan they would have been had they all just voted sincerely, we call the\nrelevant strategic vote unsafe. We show that under every onto and\nnon-dictatorial social choice rule there exist circumstances where a voter has\nan incentive to cast a safe strategic vote. We extend the Gibbard-Satterthwaite\nTheorem by proving that every onto and non-dictatorial social choice rule can\nbe individually manipulated by a voter casting a safe strategic vote.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2013 06:05:29 GMT"}], "update_date": "2013-01-09", "authors_parsed": [["Slinko", "Arkadii", ""], ["White", "Shaun", ""]]}, {"id": "1301.1710", "submitter": "Vilhelm Verendel", "authors": "Kristian Lindgren, Vilhelm Verendel", "title": "Evolutionary Exploration of the Finitely Repeated Prisoners'\n  Dilemma--The Effect of Out-of-Equilibrium Play", "comments": null, "journal-ref": "Games 2013, 4(1):1-20", "doi": "10.3390/g4010001", "report-no": null, "categories": "q-bio.PE cs.GT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The finitely repeated Prisoners' Dilemma is a good illustration of the\ndiscrepancy between the strategic behaviour suggested by a game-theoretic\nanalysis and the behaviour often observed among human players, where\ncooperation is maintained through most of the game. A game-theoretic reasoning\nbased on backward induction eliminates strategies step by step until defection\nfrom the first round is the only remaining choice, reflecting the Nash\nequilibrium of the game. We investigate the Nash equilibrium solution for two\ndifferent sets of strategies in an evolutionary context, using\nreplicator-mutation dynamics. The first set consists of conditional\ncooperators, up to a certain round, while the second set in addition to these\ncontains two strategy types that react differently on the first round action:\nThe \"Convincer\" strategies insist with two rounds of initial cooperation,\ntrying to establish more cooperative play in the game, while the \"Follower\"\nstrategies, although being first round defectors, have the capability to\nrespond to an invite in the first round. For both of these strategy sets,\niterated elimination of strategies shows that the only Nash equilibria are\ngiven by defection from the first round. We show that the evolutionary dynamics\nof the first set is always characterised by a stable fixed point, corresponding\nto the Nash equilibrium, if the mutation rate is sufficiently small (but still\npositive). The second strategy set is numerically investigated, and we find\nthat there are regions of parameter space where fixed points become unstable\nand the dynamics exhibits cycles of different strategy compositions. The\nresults indicate that, even in the limit of very small mutation rate, the\nreplicator-mutation dynamics does not necessarily bring the system with\nConvincers and Followers to the fixed point corresponding to the Nash\nequilibrium of the game.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2013 22:20:43 GMT"}], "update_date": "2013-01-10", "authors_parsed": [["Lindgren", "Kristian", ""], ["Verendel", "Vilhelm", ""]]}, {"id": "1301.2276", "submitter": "Hiromitsu Hattori", "authors": "Hiromitsu Hattori, Makoto Yokoo, Yuko Sakurai, Toramatsu Shintani", "title": "A Dynamic Programming Model for Determining Bidding Strategies in\n  Sequential Auctions: Quasi-linear Utility and Budget Constraints", "comments": "Appears in Proceedings of the Seventeenth Conference on Uncertainty\n  in Artificial Intelligence (UAI2001)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2001-PG-211-218", "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we develop a new method for finding an optimal biddingstrategy\nin sequential auctions, using a dynamic programming technique. Theexisting\nmethod assumes that the utility of a user is represented in anadditive form.\nThus, the remaining endowment of money must be explicitlyrepresented in each\nstate, and the calculation of the optimal biddingstrategy becomes\ntime-consuming when the initial endowment of money mbecomes large.In this\npaper, we develop a new problem formalization that avoids\nexplicitlyrepresenting the remaining endowment, by assuming the utility of a\nuser canbe represented in a quasi-linear form, and representing the payment as\nastate-transition cost. Experimental evaluations show that we can obtainmore\nthan an m-fold speed-up in the computation time. Furthermore, we havedeveloped\na method for obtaining a semi-optimal bidding strategy underbudget constraints,\nand have experimentally confirmed the efficacy of thismethod.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jan 2013 16:24:02 GMT"}], "update_date": "2013-01-14", "authors_parsed": [["Hattori", "Hiromitsu", ""], ["Yokoo", "Makoto", ""], ["Sakurai", "Yuko", ""], ["Shintani", "Toramatsu", ""]]}, {"id": "1301.2281", "submitter": "Michael Kearns", "authors": "Michael Kearns, Michael L. Littman, Satinder Singh", "title": "Graphical Models for Game Theory", "comments": "Appears in Proceedings of the Seventeenth Conference on Uncertainty\n  in Artificial Intelligence (UAI2001)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2001-PG-253-260", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we introduce graphical modelsfor multi-player game theory, and\ngive powerful algorithms for computing their Nash equilibria in certain cases.\nAn n-player game is given by an undirected graph on n nodes and a set of n\nlocal matrices. The interpretation is that the payoff to player i is determined\nentirely by the actions of player i and his neighbors in the graph, and thus\nthe payoff matrix to player i is indexed only by these players. We thus view\nthe global n-player game as being composed of interacting local games, each\ninvolving many fewer players. Each player's action may have global impact, but\nit occurs through the propagation of local influences.Our main technical result\nis an efficient algorithm for computing Nash equilibria when the underlying\ngraph is a tree (or can be turned into a tree with few node mergings). The\nalgorithm runs in time polynomial in the size of the representation (the graph\nand theassociated local game matrices), and comes in two related but distinct\nflavors. The first version involves an approximation step, and computes a\nrepresentation of all approximate Nash equilibria (of which there may be an\nexponential number in general). The second version allows the exact computation\nof Nash equilibria at the expense of weakened complexity bounds. The algorithm\nrequires only local message-passing between nodes (and thus can be implemented\nby the players themselves in a distributed manner). Despite an analogy to\ninference in Bayes nets that we develop, the analysis of our algorithm is more\ninvolved than that for the polytree algorithm in, owing partially to the fact\nthat we must either compute, or select from, an exponential number of potential\nsolutions. We discuss a number of extensions, such as the computation of\nequilibria with desirable global properties (e.g. maximizing global return),\nand directions for further research.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jan 2013 16:24:24 GMT"}, {"version": "v2", "created": "Sun, 8 Mar 2015 01:31:51 GMT"}], "update_date": "2015-03-10", "authors_parsed": [["Kearns", "Michael", ""], ["Littman", "Michael L.", ""], ["Singh", "Satinder", ""]]}, {"id": "1301.2533", "submitter": "Paulo Shakarian", "authors": "Paulo Shakarian, Patrick Roos, Geoffrey Moores", "title": "A Novel Analytical Method for Evolutionary Graph Theory Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI q-bio.PE", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Evolutionary graph theory studies the evolutionary dynamics of populations\nstructured on graphs. A central problem is determining the probability that a\nsmall number of mutants overtake a population. Currently, Monte Carlo\nsimulations are used for estimating such fixation probabilities on general\ndirected graphs, since no good analytical methods exist. In this paper, we\nintroduce a novel deterministic framework for computing fixation probabilities\nfor strongly connected, directed, weighted evolutionary graphs under neutral\ndrift. We show how this framework can also be used to calculate the expected\nnumber of mutants at a given time step (even if we relax the assumption that\nthe graph is strongly connected), how it can extend to other related models\n(e.g. voter model), how our framework can provide non-trivial bounds for\nfixation probability in the case of an advantageous mutant, and how it can be\nused to find a non-trivial lower bound on the mean time to fixation. We provide\nvarious experimental results determining fixation probabilities and expected\nnumber of mutants on different graphs. Among these, we show that our method\nconsistently outperforms Monte Carlo simulations in speed by several orders of\nmagnitude. Finally we show how our approach can provide insight into synaptic\ncompetition in neurology.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jan 2013 16:23:19 GMT"}], "update_date": "2013-01-14", "authors_parsed": [["Shakarian", "Paulo", ""], ["Roos", "Patrick", ""], ["Moores", "Geoffrey", ""]]}, {"id": "1301.2661", "submitter": "Nathanael Fijalkow", "authors": "Krishnendu Chatterjee (IST Austria), Nathana\\\"el Fijalkow (LIAFA)", "title": "Infinite-state games with finitary conditions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two-player zero-sum games over infinite-state graphs with\nboundedness conditions. Our first contribution is about the strategy\ncomplexity, i.e the memory required for winning strategies: we prove that over\ngeneral infinite-state graphs, memoryless strategies are sufficient for\nfinitary B\\\"uchi games, and finite-memory suffices for finitary parity games.\nWe then study pushdown boundedness games, with two contributions. First we\nprove a collapse result for pushdown omega B games, implying the decidability\nof solving these games. Second we consider pushdown games with finitary parity\nalong with stack boundedness conditions, and show that solving these games is\nEXPTIME-complete.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2013 07:54:15 GMT"}, {"version": "v2", "created": "Mon, 22 Apr 2013 07:43:22 GMT"}], "update_date": "2013-04-23", "authors_parsed": [["Chatterjee", "Krishnendu", "", "IST Austria"], ["Fijalkow", "Nathanaël", "", "LIAFA"]]}, {"id": "1301.2662", "submitter": "Vianney Perchet", "authors": "Vianney Perchet (LPMA)", "title": "Nash equilibria with partial monitoring; Computation and Lemke-Howson\n  algorithm", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In two player bi-matrix games with partial monitoring, actions played are not\nobserved, only some messages are received. Those games satisfy a crucial\nproperty of usual bi-matrix games: there are only a finite number of required\n(mixed) best replies. This is very helpful while investigating sets of Nash\nequilibria: for instance, in some cases, it allows to relate it to the set of\nequilibria of some auxiliary game with full monitoring. In the general case,\nthe Lemke-Howson algorithm is extended and, under some genericity assumption,\nits output are Nash equilibria of the original game. As a by product, we obtain\nan oddness property on their number.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2013 07:55:05 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Perchet", "Vianney", "", "LPMA"]]}, {"id": "1301.2663", "submitter": "Vianney Perchet", "authors": "Vianney Perchet (LPMA)", "title": "Approachability, Regret and Calibration; implications and equivalences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blackwell approachability, regret minimization and calibration are three\ncriteria evaluating a strategy (or an algorithm) in different sequential\ndecision problems, or repeated games between a player and Nature. Although they\nhave at first sight nothing in common, links between have been discovered: both\nconsistent and calibrated strategies can be constructed by following, in some\nauxiliary game, an approachability strategy. We gathered famous or recent\nresults and provide new ones in order to develop and generalize Blackwell's\nelegant theory. The final goal is to show how it can be used as a basic\npowerful tool to exhibit a new class of intuitive algorithms, based on simple\ngeometric properties. In order to be complete, we also prove that\napproachability can be seen as a byproduct of the very existence of consistent\nor calibrated strategies.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2013 07:56:02 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Perchet", "Vianney", "", "LPMA"]]}, {"id": "1301.3609", "submitter": "Vianney Perchet", "authors": "Vianney Perchet (LPMA), Marc Quincampoix (LM)", "title": "On an unified framework for approachability in games with or without\n  signals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We unify standard frameworks for approachability both in full or partial\nmonitoring by defining a new abstract game, called the \"purely informative\ngame\", where the outcome at each stage is the maximal information players can\nobtain, represented as some probability measure. Objectives of players can be\nrewritten as the convergence (to some given set) of sequences of averages of\nthese probability measures. We obtain new results extending the approachability\ntheory developed by Blackwell moreover this new abstract framework enables us\nto characterize approachable sets with, as usual, a remarkably simple and clear\nreformulation for convex sets. Translated into the original games, those\nresults become the first necessary and sufficient condition under which an\narbitrary set is approachable and they cover and extend previous known results\nfor convex sets. We also investigate a specific class of games where, thanks to\nsome unusual definition of averages and convexity, we again obtain a complete\ncharacterization of approachable sets along with rates of convergence.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2013 07:37:24 GMT"}], "update_date": "2013-01-17", "authors_parsed": [["Perchet", "Vianney", "", "LPMA"], ["Quincampoix", "Marc", "", "LM"]]}, {"id": "1301.3867", "submitter": "Michael Kearns", "authors": "Michael Kearns, Yishay Mansour, Satinder Singh", "title": "Fast Planning in Stochastic Games", "comments": "Appears in Proceedings of the Sixteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI2000)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2000-PG-309-316", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic games generalize Markov decision processes (MDPs) to a multiagent\nsetting by allowing the state transitions to depend jointly on all player\nactions, and having rewards determined by multiplayer matrix games at each\nstate. We consider the problem of computing Nash equilibria in stochastic\ngames, the analogue of planning in MDPs. We begin by providing a generalization\nof finite-horizon value iteration that computes a Nash strategy for each player\nin generalsum stochastic games. The algorithm takes an arbitrary Nash selection\nfunction as input, which allows the translation of local choices between\nmultiple Nash equilibria into the selection of a single global Nash\nequilibrium.\n  Our main technical result is an algorithm for computing near-Nash equilibria\nin large or infinite state spaces. This algorithm builds on our finite-horizon\nvalue iteration algorithm, and adapts the sparse sampling methods of Kearns,\nMansour and Ng (1999) to stochastic games. We conclude by descrbing a\ncounterexample showing that infinite-horizon discounted value iteration, which\nwas shown by shaplely to converge in the zero-sum case (a result we give extend\nslightly here), does not converge in the general-sum case.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2013 15:50:58 GMT"}], "update_date": "2013-01-18", "authors_parsed": [["Kearns", "Michael", ""], ["Mansour", "Yishay", ""], ["Singh", "Satinder", ""]]}, {"id": "1301.3870", "submitter": "Pierfrancesco La Mura", "authors": "Pierfrancesco La Mura", "title": "Game Networks", "comments": "Appears in Proceedings of the Sixteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI2000)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2000-PG-335-342", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce Game networks (G nets), a novel representation for multi-agent\ndecision problems. Compared to other game-theoretic representations, such as\nstrategic or extensive forms, G nets are more structured and more compact; more\nfundamentally, G nets constitute a computationally advantageous framework for\nstrategic inference, as both probability and utility independencies are\ncaptured in the structure of the network and can be exploited in order to\nsimplify the inference process. An important aspect of multi-agent reasoning is\nthe identification of some or all of the strategic equilibria in a game; we\npresent original convergence methods for strategic equilibrium which can take\nadvantage of strategic separabilities in the G net structure in order to\nsimplify the computations. Specifically, we describe a method which identifies\na unique equilibrium as a function of the game payoffs, and one which\nidentifies all equilibria.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2013 15:51:10 GMT"}], "update_date": "2013-01-18", "authors_parsed": [["La Mura", "Pierfrancesco", ""]]}, {"id": "1301.3886", "submitter": "David M Pennock", "authors": "David M. Pennock, Michael P. Wellman", "title": "Compact Securities Markets for Pareto Optimal Reallocation of Risk", "comments": "Appears in Proceedings of the Sixteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI2000)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2000-PG-481-488", "categories": "cs.GT q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emph{securities market} is the fundamental theoretical framework in\neconomics and finance for resource allocation under uncertainty. Securities\nserve both to reallocate risk and to disseminate probabilistic information.\nemph{Complete} securities markets - which contain one security for every\npossible state of nature - support Pareto optimal allocations of risk. Complete\nmarkets suffer from the same exponential dependence on the number of underlying\nevents as do joint probability distributions. We examine whether markets can be\nstructured and \"compacted\" in the same manner as Bayesian network\nrepresentations of joint distributions. We show that, if all agents'\nrisk-neutral independencies agree with the independencies encoded in the market\nstructure, then the market is emph{operationally complete}: risk is still\nPareto optimally allocated, yet the number of securities can be exponentially\nsmaller. For collections of agents of a certain type, agreement on Markov\nindependencies is sufficient to admit compact and operationally complete\nmarkets.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2013 15:52:13 GMT"}], "update_date": "2013-01-18", "authors_parsed": [["Pennock", "David M.", ""], ["Wellman", "Michael P.", ""]]}, {"id": "1301.3892", "submitter": "Satinder Singh", "authors": "Satinder Singh, Michael Kearns, Yishay Mansour", "title": "Nash Convergence of Gradient Dynamics in Iterated General-Sum Games", "comments": "Appears in Proceedings of the Sixteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI2000)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2000-PG-541-548", "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-agent games are becoming an increasing prevalent formalism for the\nstudy of electronic commerce and auctions. The speed at which transactions can\ntake place and the growing complexity of electronic marketplaces makes the\nstudy of computationally simple agents an appealing direction. In this work, we\nanalyze the behavior of agents that incrementally adapt their strategy through\ngradient ascent on expected payoff, in the simple setting of two-player,\ntwo-action, iterated general-sum games, and present a surprising result. We\nshow that either the agents will converge to Nash equilibrium, or if the\nstrategies themselves do not converge, then their average payoffs will\nnevertheless converge to the payoffs of a Nash equilibrium.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2013 15:52:37 GMT"}], "update_date": "2013-01-18", "authors_parsed": [["Singh", "Satinder", ""], ["Kearns", "Michael", ""], ["Mansour", "Yishay", ""]]}, {"id": "1301.4540", "submitter": "Guillaume Vigeral", "authors": "Guillaume Vigeral (CEREMADE)", "title": "A Zero-Sum Stochastic Game with Compact Action Sets and no Asymptotic\n  Value", "comments": null, "journal-ref": "Dynamic Games and Applications 3, 2 (2013) 172-186", "doi": "10.1007/s13235-013-0073-z", "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give an example of a zero-sum stochastic game with four states, compact\naction sets for each player, and continuous payoff and transition functions,\nsuch that the discounted value does not converge as the discount factor tends\nto 0, and the value of the n-stage game does not converge as n goes to\ninfinity.\n", "versions": [{"version": "v1", "created": "Sat, 19 Jan 2013 08:13:59 GMT"}], "update_date": "2013-11-15", "authors_parsed": [["Vigeral", "Guillaume", "", "CEREMADE"]]}, {"id": "1301.4845", "submitter": "Julian Hedges", "authors": "Julian Hedges", "title": "A generalisation of Nash's theorem with higher-order functionals", "comments": null, "journal-ref": null, "doi": "10.1098/rspa.2013.0041", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent theory of sequential games and selection functions by Mar- tin\nEscardo and Paulo Oliva is extended to games in which players move\nsimultaneously. The Nash existence theorem for mixed-strategy equilibria of\nfinite games is generalised to games defined by selection functions. A normal\nform construction is given which generalises the game-theoretic normal form,\nand its soundness is proven. Minimax strategies also gener- alise to the new\nclass of games and are computed by the Berardi-Bezem- Coquand functional,\nstudied in proof theory as an interpretation of the axiom of countable choice.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jan 2013 12:40:33 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Hedges", "Julian", ""]]}, {"id": "1301.4958", "submitter": "David Harris", "authors": "David Harris, Manish Purohit", "title": "Improved algorithms and analysis for the laminar matroid secretary\n  problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a matroid secretary problem, one is presented with a sequence of objects\nof various weights in a random order, and must choose irrevocably to accept or\nreject each item. There is a further constraint that the set of items selected\nmust form an independent set of an associated matroid. Constant-competitive\nalgorithms (algorithms whose expected solution weight is within a constant\nfactor of the optimal) are known for many types of matroid secretary problems.\nWe examine the laminar matroid and show an algorithm achieving provably 0.053\ncompetitive ratio.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jan 2013 18:51:55 GMT"}], "update_date": "2013-01-22", "authors_parsed": [["Harris", "David", ""], ["Purohit", "Manish", ""]]}, {"id": "1301.5290", "submitter": "Fahimeh Ramezani", "authors": "Khaled Elbassioni, Kazuhisa Makino, Kurt Mehlhorn, Fahimeh Ramezani", "title": "On Randomized Fictitious Play for Approximating Saddle Points Over\n  Convex Sets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given two bounded convex sets $X\\subseteq\\RR^m$ and $Y\\subseteq\\RR^n,$\nspecified by membership oracles, and a continuous convex-concave function\n$F:X\\times Y\\to\\RR$, we consider the problem of computing an $\\eps$-approximate\nsaddle point, that is, a pair $(x^*,y^*)\\in X\\times Y$ such that $\\sup_{y\\in Y}\nF(x^*,y)\\le \\inf_{x\\in\n  X}F(x,y^*)+\\eps.$ Grigoriadis and Khachiyan (1995) gave a simple randomized\nvariant of fictitious play for computing an $\\eps$-approximate saddle point for\nmatrix games, that is, when $F$ is bilinear and the sets $X$ and $Y$ are\nsimplices. In this paper, we extend their method to the general case. In\nparticular, we show that, for functions of constant \"width\", an\n$\\eps$-approximate saddle point can be computed using\n$O^*(\\frac{(n+m)}{\\eps^2}\\ln R)$ random samples from log-concave distributions\nover the convex sets $X$ and $Y$. It is assumed that $X$ and $Y$ have inscribed\nballs of radius $1/R$ and circumscribing balls of radius $R$. As a consequence,\nwe obtain a simple randomized polynomial-time algorithm that computes such an\napproximation faster than known methods for problems with bounded width and\nwhen $\\eps \\in (0,1)$ is a fixed, but arbitrarily small constant. Our main tool\nfor achieving this result is the combination of the randomized fictitious play\nwith the recently developed results on sampling from convex sets.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2013 19:27:17 GMT"}, {"version": "v2", "created": "Wed, 27 Mar 2013 16:44:16 GMT"}, {"version": "v3", "created": "Tue, 29 Apr 2014 23:55:01 GMT"}], "update_date": "2014-05-01", "authors_parsed": [["Elbassioni", "Khaled", ""], ["Makino", "Kazuhisa", ""], ["Mehlhorn", "Kurt", ""], ["Ramezani", "Fahimeh", ""]]}, {"id": "1301.5683", "submitter": "Burkhard Schipper", "authors": "Peter Duersch, Joerg Oechssler, Burkhard C. Schipper", "title": "When is tit-for-tat unbeatable?", "comments": "arXiv admin note: text overlap with arXiv:1003.4274", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We characterize the class of symmetric two-player games in which tit-for-tat\ncannot be beaten even by very sophisticated opponents in a repeated game. It\nturns out to be the class of exact potential games. More generally, there is a\nclass of simple imitation rules that includes tit-for-tat but also\nimitate-the-best and imitate-if-better. Every decision rule in this class is\nessentially unbeatable in exact potential games. Our results apply to many\ninteresting games including all symmetric 2x2 games, and standard examples of\nCournot duopoly, price competition, public goods games, common pool resource\ngames, and minimum effort coordination games.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jan 2013 01:33:55 GMT"}], "update_date": "2013-01-25", "authors_parsed": [["Duersch", "Peter", ""], ["Oechssler", "Joerg", ""], ["Schipper", "Burkhard C.", ""]]}, {"id": "1301.5738", "submitter": "Richard Southwell", "authors": "Richard Southwell, Chris Cannings", "title": "Best Response Games on Regular Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the growth of the internet it is becoming increasingly important to\nunderstand how the behaviour of players is affected by the topology of the\nnetwork interconnecting them. Many models which involve networks of interacting\nplayers have been proposed and best response games are amongst the simplest. In\nbest response games each vertex simultaneously updates to employ the best\nresponse to their current surroundings. We concentrate upon trying to\nunderstand the dynamics of best response games on regular graphs with many\nstrategies. When more than two strategies are present highly complex dynamics\ncan ensue. We focus upon trying to understand exactly how best response games\non regular graphs sample from the space of possible cellular automata. To\nunderstand this issue we investigate convex divisions in high dimensional space\nand we prove that almost every division of $k-1$ dimensional space into $k$\nconvex regions includes a single point where all regions meet. We then find\nconnections between the convex geometry of best response games and the theory\nof alternating circuits on graphs. Exploiting these unexpected connections\nallows us to gain an interesting answer to our question of when cellular\nautomata are best response games.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jan 2013 09:49:15 GMT"}], "update_date": "2013-01-25", "authors_parsed": [["Southwell", "Richard", ""], ["Cannings", "Chris", ""]]}, {"id": "1301.5844", "submitter": "Paul Goldberg", "authors": "Leslie Ann Goldberg, Paul W. Goldberg, Piotr Krysta and Carmine Ventre", "title": "Ranking Games that have Competitiveness-based Strategies", "comments": "21 pages; preliminary version in ACM-EC 2010; accepted for\n  publication in Theoretical Computer Science", "journal-ref": "TCS 476 24-37 (2013)", "doi": "10.1016/j.tcs.2013.01.013", "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An extensive literature in economics and social science addresses contests,\nin which players compete to outperform each other on some measurable criterion,\noften referred to as a player's score, or output. Players incur costs that are\nan increasing function of score, but receive prizes for obtaining higher score\nthan their competitors. In this paper we study finite games that are\ndiscretized contests, and the problems of computing exact and approximate Nash\nequilibria. Our motivation is the worst-case hardness of Nash equilibrium\ncomputation, and the resulting interest in important classes of games that\nadmit polynomial-time algorithms. For games that have a tie-breaking rule for\nplayers' scores, we present a polynomial-time algorithm for computing an exact\nequilibrium in the 2-player case, and for multiple players, a characterization\nof Nash equilibria that shows an interesting parallel between these games and\nunrestricted 2-player games in normal form. When ties are allowed, via a\nreduction from these games to a subclass of anonymous games, we give\napproximation schemes for two special cases: constant-sized set of strategies,\nand constant number of players.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jan 2013 17:08:45 GMT"}], "update_date": "2013-08-01", "authors_parsed": [["Goldberg", "Leslie Ann", ""], ["Goldberg", "Paul W.", ""], ["Krysta", "Piotr", ""], ["Ventre", "Carmine", ""]]}, {"id": "1301.5943", "submitter": "Lu\\'is Filipe Te\\'ofilo", "authors": "Lu\\'is Filipe Te\\'ofilo, Luis Paulo Reis", "title": "Identifying Player\\'s Strategies in No Limit Texas Hold\\'em Poker\n  through the Analysis of Individual Moves", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The development of competitive artificial Poker playing agents has proven to\nbe a challenge, because agents must deal with unreliable information and\ndeception which make it essential to model the opponents in order to achieve\ngood results. This paper presents a methodology to develop opponent modeling\ntechniques for Poker agents. The approach is based on applying clustering\nalgorithms to a Poker game database in order to identify player types based on\ntheir actions. First, common game moves were identified by clustering all\nplayers\\' moves. Then, player types were defined by calculating the frequency\nwith which the players perform each type of movement. With the given dataset, 7\ndifferent types of players were identified with each one having at least one\ntactic that characterizes him. The identification of player types may improve\nthe overall performance of Poker agents, because it helps the agents to predict\nthe opponent\\'s moves, by associating each opponent to a distinct cluster.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jan 2013 01:49:15 GMT"}], "update_date": "2013-01-28", "authors_parsed": [["Teófilo", "Luís Filipe", ""], ["Reis", "Luis Paulo", ""]]}, {"id": "1301.6118", "submitter": "Lane A. Hemaspaandra", "authors": "Zack Fitzsimmons, Edith Hemaspaandra, Lane A. Hemaspaandra", "title": "X THEN X: Manipulation of Same-System Runoff Elections", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Do runoff elections, using the same voting rule as the initial election but\njust on the winning candidates, increase or decrease the complexity of\nmanipulation? Does allowing revoting in the runoff increase or decrease the\ncomplexity relative to just having a runoff without revoting? For both weighted\nand unweighted voting, we show that even for election systems with simple\nwinner problems the complexity of manipulation, manipulation with runoffs, and\nmanipulation with revoting runoffs are independent, in the abstract. On the\nother hand, for some important, well-known election systems we determine what\nholds for each of these cases. For no such systems do we find runoffs lowering\ncomplexity, and for some we find that runoffs raise complexity. Ours is the\nfirst paper to show that for natural, unweighted election systems, runoffs can\nincrease the manipulation complexity.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jan 2013 18:40:06 GMT"}, {"version": "v2", "created": "Fri, 20 Jun 2014 19:49:12 GMT"}], "update_date": "2014-06-23", "authors_parsed": [["Fitzsimmons", "Zack", ""], ["Hemaspaandra", "Edith", ""], ["Hemaspaandra", "Lane A.", ""]]}, {"id": "1301.6400", "submitter": "Piotr Skowron", "authors": "Piotr Skowron, Piotr Faliszewski, Arkadii Slinko", "title": "Achieving Fully Proportional Representation is Easy in Practice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide experimental evaluation of a number of known and new algorithms\nfor approximate computation of Monroe's and Chamberlin-Courant's rules. Our\nexperiments, conducted both on real-life preference-aggregation data and on\nsynthetic data, show that even very simple and fast algorithms can in many\ncases find near-perfect solutions. Our results confirm and complement very\nrecent theoretical analysis of Skowron et al., who have shown good lower bounds\non the quality of (some of) the algorithms that we study.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jan 2013 20:54:07 GMT"}], "update_date": "2013-01-29", "authors_parsed": [["Skowron", "Piotr", ""], ["Faliszewski", "Piotr", ""], ["Slinko", "Arkadii", ""]]}, {"id": "1301.6682", "submitter": "Craig Boutilier", "authors": "Craig Boutilier, Moises Goldszmidt, Bikash Sabata", "title": "Continuous Value Function Approximation for Sequential Bidding Policies", "comments": "Appears in Proceedings of the Fifteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI1999)", "journal-ref": null, "doi": null, "report-no": "UAI-P-1999-PG-81-90", "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Market-based mechanisms such as auctions are being studied as an appropriate\nmeans for resource allocation in distributed and mulitagent decision problems.\nWhen agents value resources in combination rather than in isolation, they must\noften deliberate about appropriate bidding strategies for a sequence of\nauctions offering resources of interest. We briefly describe a discrete dynamic\nprogramming model for constructing appropriate bidding policies for resources\nexhibiting both complementarities and substitutability. We then introduce a\ncontinuous approximation of this model, assuming that money (or the numeraire\ngood) is infinitely divisible. Though this has the potential to reduce the\ncomputational cost of computing policies, value functions in the transformed\nproblem do not have a convenient closed form representation. We develop {em\ngrid-based} approximation for such value functions, representing value\nfunctions using piecewise linear approximations. We show that these methods can\noffer significant computational savings with relatively small cost in solution\nquality.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2013 15:57:07 GMT"}], "update_date": "2013-01-30", "authors_parsed": [["Boutilier", "Craig", ""], ["Goldszmidt", "Moises", ""], ["Sabata", "Bikash", ""]]}, {"id": "1301.6711", "submitter": "Kevin B. Korb", "authors": "Kevin B. Korb, Ann Nicholson, Nathalie Jitnah", "title": "Bayesian Poker", "comments": "Appears in Proceedings of the Fifteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI1999)", "journal-ref": null, "doi": null, "report-no": "UAI-P-1999-PG-343-350", "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Poker is ideal for testing automated reasoning under uncertainty. It\nintroduces uncertainty both by physical randomization and by incomplete\ninformation about opponents hands.Another source OF uncertainty IS the limited\ninformation available TO construct psychological models OF opponents, their\ntendencies TO bluff, play conservatively, reveal weakness, etc. AND the\nrelation BETWEEN their hand strengths AND betting behaviour. ALL OF these\nuncertainties must be assessed accurately AND combined effectively FOR ANY\nreasonable LEVEL OF skill IN the game TO be achieved, since good decision\nmaking IS highly sensitive TO those tasks.We describe our Bayesian Poker\nProgram(BPP), which uses a Bayesian network TO model the programs poker hand,\nthe opponents hand AND the opponents playing behaviour conditioned upon the\nhand, and betting curves which govern play given a probability of winning. The\nhistory of play with opponents is used to improve BPPs understanding OF their\nbehaviour.We compare BPP experimentally WITH : a simple RULE - based system; a\nprogram which depends exclusively ON hand probabilities(i.e., without opponent\nmodeling); AND WITH human players.BPP has shown itself TO be an effective\nplayer against ALL these opponents, barring the better humans.We also sketch\nout SOME likely ways OF improving play.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2013 15:59:06 GMT"}], "update_date": "2013-01-30", "authors_parsed": [["Korb", "Kevin B.", ""], ["Nicholson", "Ann", ""], ["Jitnah", "Nathalie", ""]]}, {"id": "1301.6714", "submitter": "Pierfrancesco La Mura", "authors": "Pierfrancesco La Mura, Yoav Shoham", "title": "Expected Utility Networks", "comments": "Appears in Proceedings of the Fifteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI1999)", "journal-ref": null, "doi": null, "report-no": "UAI-P-1999-PG-366-373", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new class of graphical representations, expected utility\nnetworks (EUNs), and discuss some of its properties and potential applications\nto artificial intelligence and economic theory. In EUNs not only probabilities,\nbut also utilities enjoy a modular representation. EUNs are undirected graphs\nwith two types of arc, representing probability and utility dependencies\nrespectively. The representation of utilities is based on a novel notion of\nconditional utility independence, which we introduce and discuss in the context\nof other existing proposals. Just as probabilistic inference involves the\ncomputation of conditional probabilities, strategic inference involves the\ncomputation of conditional expected utilities for alternative plans of action.\nWe define a new notion of conditional expected utility (EU) independence, and\nshow that in EUNs node separation with respect to the probability and utility\nsubgraphs implies conditional EU independence.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2013 15:59:18 GMT"}], "update_date": "2013-01-30", "authors_parsed": [["La Mura", "Pierfrancesco", ""], ["Shoham", "Yoav", ""]]}, {"id": "1301.6787", "submitter": "Fran\\c{c}ois M\\'eriaux", "authors": "Mariem Mhiri, Karim Cheikhrouhou, Abdelaziz Samet, Fran\\c{c}ois\n  M\\'eriaux, Samson Lasaulce", "title": "Energy-Efficient Spectrum Sharing in Relay-Assisted Cognitive Radio\n  Systems", "comments": "IEEE Proc. of the International Conference on Network Games, Control\n  and Optimization (NetGCooP), Nov. 2012, Avignon, France", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work characterizes an important solution concept of a relevant spectrum\ngame. Two energy-efficient sources communicating with their respective\ndestination compete for an extra channel brought by a relay charging the used\nbandwidth through a pricing mechanism. This game is shown to possess a unique\nNash bargaining solution, exploiting a time-sharing argument. This\nPareto-efficient solution can be implemented by using a distributed\noptimization algorithm for which each transmitter uses a simple gradient-type\nalgorithm and alternately updates its spectrum sharing policy. Typical\nnumerical results show to what extent spectral efficiency can be improved in a\nsystem involving selfish energy-efficient sources.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2013 21:50:08 GMT"}], "update_date": "2013-01-30", "authors_parsed": [["Mhiri", "Mariem", ""], ["Cheikhrouhou", "Karim", ""], ["Samet", "Abdelaziz", ""], ["Mériaux", "François", ""], ["Lasaulce", "Samson", ""]]}, {"id": "1301.6793", "submitter": "Fran\\c{c}ois M\\'eriaux", "authors": "Fran\\c{c}ois M\\'eriaux, Vineeth Varma, Samson Lasaulce", "title": "Mean Field Energy Games in Wireless Networks", "comments": "IEEE Proc. of Asilomar Conf. on Signals, Systems, and Computers, Nov.\n  2012, Pacific Grove, CA, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work tackles the problem of energy-efficient distributed power control\nin wireless networks with a large number of transmitters. The problem is\nmodeled by a dynamic game. Each transmitter-receiver communication is\ncharacterized by a state given by the available energy and/or the individual\nchannel state and whose evolution is governed by certain dynamics. Since\nequilibrium analysis in such a (stochastic) game is generally difficult and\neven impossible, the problem is approximated by exploiting the large system\nassumption. Under an appropriate exchangeability assumption, the corresponding\nmean field game is well defined and studied in detail for special cases. The\nmain contribution of this work is to show how mean field games can be applied\nto the problem under investigation and provide illustrative numerical results.\nOur results indicate that this approach can lead to significant gains in terms\nof energy-efficiency at the resulting equilibrium.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2013 22:10:53 GMT"}], "update_date": "2013-01-30", "authors_parsed": [["Mériaux", "François", ""], ["Varma", "Vineeth", ""], ["Lasaulce", "Samson", ""]]}, {"id": "1301.7388", "submitter": "Jean-Yves Jaffray", "authors": "Jean-Yves Jaffray", "title": "Implementing Resolute Choice Under Uncertainty", "comments": "Appears in Proceedings of the Fourteenth Conference on Uncertainty in\n  Artificial Intelligence (UAI1998)", "journal-ref": null, "doi": null, "report-no": "UAI-P-1998-PG-282-288", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The adaptation to situations of sequential choice under uncertainty of\ndecision criteria which deviate from (subjective) expected utility raises the\nproblem of ensuring the selection of a nondominated strategy. In particular,\nwhen following the suggestion of Machina and McClennen of giving up\nseparability (also known as consequentialism), which requires the choice of a\nsubstrategy in a subtree to depend only on data relevant to that subtree, one\nmust renounce to the use of dynamic programming, since Bellman's principle is\nno longer valid. An interpretation of McClennen's resolute choice, based on\ncooperation between the successive Selves of the decision maker, is proposed.\nImplementations of resolute choice which prevent Money Pumps negative prices of\ninformation or, more generally, choices of dominated strategies, while\nremaining computationally tractable, are proposed.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2013 15:04:50 GMT"}], "update_date": "2013-02-01", "authors_parsed": [["Jaffray", "Jean-Yves", ""]]}, {"id": "1301.7592", "submitter": "Krzysztof R. Apt", "authors": "Krzysztof R. Apt, Evangelos Markakis and Sunil Simon", "title": "Paradoxes in Social Networks with Multiple Products", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, we introduced in arXiv:1105.2434 a model for product adoption in\nsocial networks with multiple products, where the agents, influenced by their\nneighbours, can adopt one out of several alternatives. We identify and analyze\nhere four types of paradoxes that can arise in these networks. To this end, we\nuse social network games that we recently introduced in arxiv:1202.2209. These\nparadoxes shed light on possible inefficiencies arising when one modifies the\nsets of products available to the agents forming a social network. One of the\nparadoxes corresponds to the well-known Braess paradox in congestion games and\nshows that by adding more choices to a node, the network may end up in a\nsituation that is worse for everybody. We exhibit a dual version of this, where\nremoving available choices from someone can eventually make everybody better\noff. The other paradoxes that we identify show that by adding or removing a\nproduct from the choice set of some node may lead to permanent instability.\nFinally, we also identify conditions under which some of these paradoxes cannot\narise.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2013 12:31:05 GMT"}, {"version": "v2", "created": "Tue, 28 May 2013 12:11:46 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Apt", "Krzysztof R.", ""], ["Markakis", "Evangelos", ""], ["Simon", "Sunil", ""]]}, {"id": "1301.7700", "submitter": "Julien Reichert", "authors": "Arjun Arul, Julien Reichert", "title": "The Complexity of Robot Games on the Integer Line", "comments": "In Proceedings QAPL 2013, arXiv:1306.2413", "journal-ref": "EPTCS 117, 2013, pp. 132-148", "doi": "10.4204/EPTCS.117.9", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In robot games on Z, two players add integers to a counter. Each player has a\nfinite set from which he picks the integer to add, and the objective of the\nfirst player is to let the counter reach 0. We present an exponential-time\nalgorithm for deciding the winner of a robot game given the initial counter\nvalue, and prove a matching lower bound.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2013 17:46:22 GMT"}, {"version": "v2", "created": "Wed, 13 Feb 2013 10:30:07 GMT"}, {"version": "v3", "created": "Wed, 31 Jul 2013 08:07:51 GMT"}, {"version": "v4", "created": "Fri, 2 Aug 2013 06:40:29 GMT"}], "update_date": "2013-08-05", "authors_parsed": [["Arul", "Arjun", ""], ["Reichert", "Julien", ""]]}]