[{"id": "0704.1353", "submitter": "Paul Prekop", "authors": "Paul Prekop", "title": "Supporting Knowledge and Expertise Finding within Australia's Defence\n  Science and Technology Organisation", "comments": "40th Hawaii International Conference on System Sciences (HICSS40)\n  2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.DB cs.DL cs.HC", "license": null, "abstract": "  This paper reports on work aimed at supporting knowledge and expertise\nfinding within a large Research and Development (R&D) organisation. The paper\nfirst discusses the nature of knowledge important to R&D organisations and\npresents a prototype information system developed to support knowledge and\nexpertise finding. The paper then discusses a trial of the system within an R&D\norganisation, the implications and limitations of the trial, and discusses\nfuture research questions.\n", "versions": [{"version": "v1", "created": "Wed, 11 Apr 2007 06:49:06 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Prekop", "Paul", ""]]}, {"id": "0704.3157", "submitter": "Giorgio Terracina", "authors": "Giorgio Terracina, Nicola Leone, Vincenzino Lio, Claudio Panetta", "title": "Experimenting with recursive queries in database and logic programming\n  systems", "comments": "To appear in Theory and Practice of Logic Programming (TPLP)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.DB", "license": null, "abstract": "  This paper considers the problem of reasoning on massive amounts of (possibly\ndistributed) data. Presently, existing proposals show some limitations: {\\em\n(i)} the quantity of data that can be handled contemporarily is limited, due to\nthe fact that reasoning is generally carried out in main-memory; {\\em (ii)} the\ninteraction with external (and independent) DBMSs is not trivial and, in\nseveral cases, not allowed at all; {\\em (iii)} the efficiency of present\nimplementations is still not sufficient for their utilization in complex\nreasoning tasks involving massive amounts of data. This paper provides a\ncontribution in this setting; it presents a new system, called DLV$^{DB}$,\nwhich aims to solve these problems. Moreover, the paper reports the results of\na thorough experimental analysis we have carried out for comparing our system\nwith several state-of-the-art systems (both logic and databases) on some\nclassical deductive problems; the other tested systems are: LDL++, XSB, Smodels\nand three top-level commercial DBMSs. DLV$^{DB}$ significantly outperforms even\nthe commercial Database Systems on recursive queries. To appear in Theory and\nPractice of Logic Programming (TPLP)\n", "versions": [{"version": "v1", "created": "Tue, 24 Apr 2007 10:58:40 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Terracina", "Giorgio", ""], ["Leone", "Nicola", ""], ["Lio", "Vincenzino", ""], ["Panetta", "Claudio", ""]]}, {"id": "0704.3500", "submitter": "Jerome Darmont", "authors": "Zhen He, J\\'er\\^ome Darmont (ERIC)", "title": "Une plate-forme dynamique pour l'\\'evaluation des performances des bases\n  de donn\\'ees \\`a objets", "comments": "20 pages", "journal-ref": "19\\`emes Journ\\'ees de Bases de Donn\\'ees Avanc\\'ees (BDA 03),\n  Lyon (20/10/2003) 423-442", "doi": null, "report-no": null, "categories": "cs.DB", "license": null, "abstract": "  In object-oriented or object-relational databases such as multimedia\ndatabases or most XML databases, access patterns are not static, i.e.,\napplications do not always access the same objects in the same order\nrepeatedly. However, this has been the way these databases and associated\noptimisation techniques such as clustering have been evaluated up to now. This\npaper opens up research regarding this issue by proposing a dynamic object\nevaluation framework (DOEF). DOEF accomplishes access pattern change by\ndefining configurable styles of change. It is a preliminary prototype that has\nbeen designed to be open and fully extensible. Though originally designed for\nthe object-oriented model, it can also be used within the object-relational\nmodel with few adaptations. Furthermore, new access pattern change models can\nbe added too. To illustrate the capabilities of DOEF, we conducted two\ndifferent sets of experiments. In the first set of experiments, we used DOEF to\ncompare the performances of four state of the art dynamic clustering\nalgorithms. The results show that DOEF is effective at determining the\nadaptability of each dynamic clustering algorithm to changes in access pattern.\nThey also led us to conclude that dynamic clustering algorithms can cope with\nmoderate levels of access pattern change, but that performance rapidly degrades\nto be worse than no clustering when vigorous styles of access pattern change\nare applied. In the second set of experiments, we used DOEF to compare the\nperformance of two different object stores: Platypus and SHORE. The use of DOEF\nexposed the poor swapping performance of Platypus.\n", "versions": [{"version": "v1", "created": "Thu, 26 Apr 2007 09:10:41 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["He", "Zhen", "", "ERIC"], ["Darmont", "Jérôme", "", "ERIC"]]}, {"id": "0704.3501", "submitter": "Jerome Darmont", "authors": "J\\'er\\^ome Darmont (ERIC), Fadila Bentayeb (ERIC), Omar Boussa\\\"id\n  (ERIC)", "title": "Conception d'un banc d'essais d\\'ecisionnel", "comments": "20 pages", "journal-ref": "20\\`emes Journ\\'ees Bases de Donn\\'ees Avanc\\'ees (BDA 04),\n  Montpellier (19/10/2004) 493-511", "doi": null, "report-no": null, "categories": "cs.DB", "license": null, "abstract": "  We present in this paper a new benchmark for evaluating the performances of\ndata warehouses. Benchmarking is useful either to system users for comparing\nthe performances of different systems, or to system engineers for testing the\neffect of various design choices. While the TPC (Transaction Processing\nPerformance Council) standard benchmarks address the first point, they are not\ntuneable enough to address the second one. Our Data Warehouse Engineering\nBenchmark (DWEB) allows to generate various ad-hoc synthetic data warehouses\nand workloads. DWEB is fully parameterized. However, two levels of\nparameterization keep it easy to tune. Since DWEB mainly meets engineering\nbenchmarking needs, it is complimentary to the TPC standard benchmarks, and not\na competitor. Finally, DWEB is implemented as a Java free software that can be\ninterfaced with most existing relational database management systems.\n", "versions": [{"version": "v1", "created": "Thu, 26 Apr 2007 09:13:04 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Darmont", "Jérôme", "", "ERIC"], ["Bentayeb", "Fadila", "", "ERIC"], ["Boussaïd", "Omar", "", "ERIC"]]}, {"id": "0704.3520", "submitter": "Jerome Darmont", "authors": "Kamel Aouiche (ERIC), J\\'er\\^ome Darmont (ERIC)", "title": "Vers l'auto-administration des entrep\\^ots de donn\\'ees", "comments": "Version courte de 4 pages", "journal-ref": "XXXV\\`emes Journ\\'ees de Statistique, Session sp\\'eciale\n  Entreposage et Fouille de Donn\\'ees, Lyon (02/06/2003) 105-108", "doi": null, "report-no": null, "categories": "cs.DB", "license": null, "abstract": "  With the wide development of databases in general and data warehouses in\nparticular, it is important to reduce the tasks that a database administrator\nmust perform manually. The idea of using data mining techniques to extract\nuseful knowledge for administration from the data themselves has existed for\nsome years. However, little research has been achieved. The aim of this study\nis to search for a way of extracting useful knowledge from stored data to\nautomatically apply performance optimization techniques, and more particularly\nindexing techniques. We have designed a tool that extracts frequent itemsets\nfrom a given workload to compute an index configuration that helps optimizing\ndata access time. The experiments we performed showed that the index\nconfigurations generated by our tool allowed performance gains of 15% to 25% on\na test database and a test data warehouse.\n", "versions": [{"version": "v1", "created": "Thu, 26 Apr 2007 11:47:35 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Aouiche", "Kamel", "", "ERIC"], ["Darmont", "Jérôme", "", "ERIC"]]}]