[{"id": "0807.2466", "submitter": "Marko A. Rodriguez", "authors": "Marko A. Rodriguez and Vadas Gintautas and Alberto Pepe", "title": "A Grateful Dead Analysis: The Relationship Between Concert and Listening\n  Behavior", "comments": null, "journal-ref": "First Monday, volume 14, number 1, ISSN:1396-0466, University of\n  Illinois at Chicago Library, January 2009.", "doi": null, "report-no": "LA-UR-08-04421", "categories": "cs.CY cs.GL", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  The Grateful Dead were an American band that was born out of the San\nFrancisco, California psychedelic movement of the 1960s. The band played music\ntogether from 1965 to 1995 and is well known for concert performances\ncontaining extended improvisations and long and unique set lists. This article\npresents a comparative analysis between 1,590 of the Grateful Dead's concert\nset lists from 1972 to 1995 and 2,616,990 last.fm Grateful Dead listening\nevents from August 2005 to October 2007. While there is a strong correlation\nbetween how songs were played in concert and how they are listened to by\nlast.fm members, the outlying songs in this trend identify interesting aspects\nof the band and their fans 10 years after the band's dissolution.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jul 2008 21:31:36 GMT"}], "update_date": "2009-01-07", "authors_parsed": [["Rodriguez", "Marko A.", ""], ["Gintautas", "Vadas", ""], ["Pepe", "Alberto", ""]]}, {"id": "0807.4132", "submitter": "Carlo Alberto Furia", "authors": "Carlo A. Furia, Dino Mandrioli, Angelo Morzenti, Matteo Rossi", "title": "Modeling Time in Computing: A Taxonomy and a Comparative Survey", "comments": "More typos fixed", "journal-ref": "ACM Computing Surveys, 42(2):1--59, February 2010", "doi": "10.1145/1667062.1667063", "report-no": null, "categories": "cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing relevance of areas such as real-time and embedded systems,\npervasive computing, hybrid systems control, and biological and social systems\nmodeling is bringing a growing attention to the temporal aspects of computing,\nnot only in the computer science domain, but also in more traditional fields of\nengineering.\n  This article surveys various approaches to the formal modeling and analysis\nof the temporal features of computer-based systems, with a level of detail that\nis suitable also for non-specialists. In doing so, it provides a unifying\nframework, rather than just a comprehensive list of formalisms.\n  The paper first lays out some key dimensions along which the various\nformalisms can be evaluated and compared. Then, a significant sample of\nformalisms for time modeling in computing are presented and discussed according\nto these dimensions. The adopted perspective is, to some extent, historical,\ngoing from \"traditional\" models and formalisms to more modern ones.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jul 2008 16:09:16 GMT"}, {"version": "v2", "created": "Thu, 18 Sep 2008 16:23:05 GMT"}, {"version": "v3", "created": "Mon, 11 Oct 2010 11:01:40 GMT"}], "update_date": "2013-08-15", "authors_parsed": [["Furia", "Carlo A.", ""], ["Mandrioli", "Dino", ""], ["Morzenti", "Angelo", ""], ["Rossi", "Matteo", ""]]}]