[{"id": "0711.2087", "submitter": "Edna Ruckhaus", "authors": "Edna Ruckhaus, Eduardo Ruiz, Maria-Esther Vidal", "title": "Query Evaluation and Optimization in the Semantic Web", "comments": "18 pages, 8 figures, 7 tables. Presented at the ALPSWS2006 First\n  International Workshop on Applications of Logic Programming in the Semantic\n  Web and Semantic Web Services where it got a \"Best Paper Award\". To appear in\n  Theory and Practice of Logic Programming (TPLP)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.LO", "license": null, "abstract": "  We address the problem of answering Web ontology queries efficiently. An\nontology is formalized as a Deductive Ontology Base (DOB), a deductive database\nthat comprises the ontology's inference axioms and facts. A cost-based query\noptimization technique for DOB is presented. A hybrid cost model is proposed to\nestimate the cost and cardinality of basic and inferred facts. Cardinality and\ncost of inferred facts are estimated using an adaptive sampling technique,\nwhile techniques of traditional relational cost models are used for estimating\nthe cost of basic facts and conjunctive ontology queries. Finally, we implement\na dynamic-programming optimization algorithm to identify query evaluation plans\nthat minimize the number of intermediate inferred facts. We modeled a subset of\nthe Web ontology language OWL Lite as a DOB, and performed an experimental\nstudy to analyze the predictive capacity of our cost model and the benefits of\nthe query optimization technique. Our study has been conducted over synthetic\nand real-world OWL ontologies, and shows that the techniques are accurate and\nimprove query performance. To appear in Theory and Practice of Logic\nProgramming (TPLP).\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2007 22:31:09 GMT"}], "update_date": "2007-11-15", "authors_parsed": [["Ruckhaus", "Edna", ""], ["Ruiz", "Eduardo", ""], ["Vidal", "Maria-Esther", ""]]}, {"id": "0711.2615", "submitter": "Franco Bagnoli", "authors": "Franco Bagnoli, Francesca Di Patti", "title": "A Biologically Inspired Classifier", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.IR", "license": null, "abstract": "  We present a method for measuring the distance among records based on the\ncorrelations of data stored in the corresponding database entries. The original\nmethod (F. Bagnoli, A. Berrones and F. Franci. Physica A 332 (2004) 509-518)\nwas formulated in the context of opinion formation. The opinions expressed over\na set of topic originate a ``knowledge network'' among individuals, where two\nindividuals are nearer the more similar their expressed opinions are. Assuming\nthat individuals' opinions are stored in a database, the authors show that it\nis possible to anticipate an opinion using the correlations in the database.\nThis corresponds to approximating the overlap between the tastes of two\nindividuals with the correlations of their expressed opinions.\n  In this paper we extend this model to nonlinear matching functions, inspired\nby biological problems such as microarray (probe-sample pairing). We\ninvestigate numerically the error between the correlation and the overlap\nmatrix for eight sequences of reference with random probes. Results show that\nthis method is particularly robust for detecting similarities in the presence\nof translocations.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2007 13:38:15 GMT"}], "update_date": "2007-11-19", "authors_parsed": [["Bagnoli", "Franco", ""], ["Di Patti", "Francesca", ""]]}, {"id": "0711.3375", "submitter": "Loredana Afanasiev", "authors": "Loredana Afanasiev, Torsten Grust, Maarten Marx, Jan Rittinger, Jens\n  Teubner", "title": "An Inflationary Fixed Point Operator in XQuery", "comments": "11 pages, 10 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB", "license": null, "abstract": "  We introduce a controlled form of recursion in XQuery, inflationary fixed\npoints, familiar in the context of relational databases. This imposes\nrestrictions on the expressible types of recursion, but we show that\ninflationary fixed points nevertheless are sufficiently versatile to capture a\nwide range of interesting use cases, including the semantics of Regular XPath\nand its core transitive closure construct.\n  While the optimization of general user-defined recursive functions in XQuery\nappears elusive, we will describe how inflationary fixed points can be\nefficiently evaluated, provided that the recursive XQuery expressions exhibit a\ndistributivity property. We show how distributivity can be assessed both,\nsyntactically and algebraically, and provide experimental evidence that XQuery\nprocessors can substantially benefit during inflationary fixed point\nevaluation.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2007 13:22:15 GMT"}], "update_date": "2007-11-22", "authors_parsed": [["Afanasiev", "Loredana", ""], ["Grust", "Torsten", ""], ["Marx", "Maarten", ""], ["Rittinger", "Jan", ""], ["Teubner", "Jens", ""]]}]