[{"id": "1811.00192", "submitter": "Umang Mathur", "authors": "Umang Mathur, P. Madhusudan, Mahesh Viswanathan", "title": "Decidable Verification of Uninterpreted Programs", "comments": null, "journal-ref": null, "doi": "10.1145/3290359", "report-no": null, "categories": "cs.PL cs.FL cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the problem of completely automatically verifying uninterpreted\nprograms---programs that work over arbitrary data models that provide an\ninterpretation for the constants, functions and relations the program uses. The\nverification problem asks whether a given program satisfies a postcondition\nwritten using quantifier-free formulas with equality on the final state, with\nno loop invariants, contracts, etc. being provided. We show that this problem\nis undecidable in general. The main contribution of this paper is a subclass of\nprograms, called coherent programs that admits decidable verification, and can\nbe decided in PSPACE. We then extend this class of programs to classes of\nprograms that are $k$-coherent, where $k \\in \\mathbb{N}$, obtained by\n(automatically) adding $k$ ghost variables and assignments that make them\ncoherent. We also extend the decidability result to programs with recursive\nfunction calls and prove several undecidability results that show why our\nrestrictions to obtain decidability seem necessary.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 02:37:27 GMT"}, {"version": "v2", "created": "Sat, 3 Nov 2018 16:26:35 GMT"}, {"version": "v3", "created": "Wed, 7 Nov 2018 20:19:00 GMT"}, {"version": "v4", "created": "Wed, 26 Aug 2020 17:31:13 GMT"}], "update_date": "2020-08-27", "authors_parsed": [["Mathur", "Umang", ""], ["Madhusudan", "P.", ""], ["Viswanathan", "Mahesh", ""]]}, {"id": "1811.00483", "submitter": "Denis Kuperberg", "authors": "Denis Kuperberg and Anirban Majumdar", "title": "Computing the Width of Non-deterministic Automata", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 15, Issue 4 (November\n  29, 2019) lmcs:5928", "doi": "10.23638/LMCS-15(4:10)2019", "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We introduce a measure called width, quantifying the amount of nondeterminism\nin automata. Width generalises the notion of good-for-games (GFG) automata,\nthat correspond to NFAs of width 1, and where an accepting run can be built\non-the-fly on any accepted input. We describe an incremental determinisation\nconstruction on NFAs, which can be more efficient than the full powerset\ndeterminisation, depending on the width of the input NFA. This construction can\nbe generalised to infinite words, and is particularly well-suited to coB\\\"uchi\nautomata. For coB\\\"uchi automata, this procedure can be used to compute either\na deterministic automaton or a GFG one, and it is algorithmically more\nefficient in the last case. We show this fact by proving that checking whether\na coB\\\"uchi automaton is determinisable by pruning is NP-complete. On finite or\ninfinite words, we show that computing the width of an automaton is\nEXPTIME-complete. This implies EXPTIME-completeness for multipebble simulation\ngames on NFAs.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2018 16:27:45 GMT"}, {"version": "v2", "created": "Thu, 11 Jul 2019 15:47:05 GMT"}, {"version": "v3", "created": "Mon, 14 Oct 2019 12:46:44 GMT"}, {"version": "v4", "created": "Tue, 26 Nov 2019 10:35:29 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Kuperberg", "Denis", ""], ["Majumdar", "Anirban", ""]]}, {"id": "1811.00694", "submitter": "Chunhui Guo", "authors": "Chunhui Guo, Zhicheng Fu, Zhenyu Zhang, Shangping Ren, Lui Sha", "title": "Design Verifiably Correct Model Patterns to Facilitate Modeling Medical\n  Best Practice Guidelines with Statecharts (Technical Report)", "comments": "full version, 14 pages", "journal-ref": "IEEE Internet of Things Journal, 2018", "doi": "10.1109/JIOT.2018.2879475", "report-no": null, "categories": "cs.SE cs.FL cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Improving patient care safety is an ultimate objective for medical\ncyber-physical systems. A recent study shows that the patients' death rate can\nbe significantly reduced by computerizing medical best practice guidelines. To\nfacilitate the development of computerized medical best practice guidelines,\nstatecharts are often used as a modeling tool because of their high\nresemblances to disease and treatment models and their capabilities to provide\nrapid prototyping and simulation for clinical validations. However, some\nimplementations of statecharts, such as Yakindu statecharts, are priority-based\nand have synchronous execution semantics which makes it difficult to model\ncertain functionalities that are essential in modeling medical guidelines, such\nas two-way communications and configurable execution orders. Rather than\nintroducing new statechart elements or changing the statechart implementation's\nunderline semantics, we use existing basic statechart elements to design model\npatterns for the commonly occurring issues. In particular, we show the design\nof model patterns for two-way communications and configurable execution orders\nand formally prove the correctness of these model patterns. We further use a\nsimplified airway laser surgery scenario as a case study to demonstrate how the\ndeveloped model patterns address the two-way communication and configurable\nexecution order issues and their impact on validation and verification of\nmedical safety properties.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2018 01:11:32 GMT"}], "update_date": "2018-11-05", "authors_parsed": [["Guo", "Chunhui", ""], ["Fu", "Zhicheng", ""], ["Zhang", "Zhenyu", ""], ["Ren", "Shangping", ""], ["Sha", "Lui", ""]]}, {"id": "1811.01256", "submitter": "Eric Rowland", "authors": "Eric Rowland, Reem Yassawi", "title": "Automaticity and invariant measures of linear cellular automata", "comments": "33 pages, 8 figures; fixed some typos", "journal-ref": "Can. J. Math.-J. Can. Math. 72 (2020) 1691-1726", "doi": "10.4153/S0008414X19000488", "report-no": null, "categories": "cs.FL cs.DM math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that spacetime diagrams of linear cellular automata $\\Phi : {\\mathbb\nF}_p^{\\mathbb Z} \\to {\\mathbb F}_p^{\\mathbb Z}$ with $(-p)$-automatic initial\nconditions are automatic. This extends existing results on initial conditions\nwhich are eventually constant. Each automatic spacetime diagram defines a\n$(\\sigma, \\Phi)$-invariant subset of ${\\mathbb F}_p^{\\mathbb Z}$, where\n$\\sigma$ is the left shift map, and if the initial condition is not eventually\nperiodic then this invariant set is nontrivial. For the Ledrappier cellular\nautomaton we construct a family of nontrivial $(\\sigma, \\Phi)$-invariant\nmeasures on ${\\mathbb F}_3^{\\mathbb Z}$. Finally, given a linear cellular\nautomaton $\\Phi$, we construct a nontrivial $(\\sigma, \\Phi)$-invariant measure\non ${\\mathbb F}_p^{\\mathbb Z}$ for all but finitely many $p$.\n", "versions": [{"version": "v1", "created": "Sat, 3 Nov 2018 17:33:02 GMT"}, {"version": "v2", "created": "Thu, 14 Feb 2019 18:21:19 GMT"}, {"version": "v3", "created": "Wed, 19 Feb 2020 16:40:11 GMT"}], "update_date": "2020-11-18", "authors_parsed": [["Rowland", "Eric", ""], ["Yassawi", "Reem", ""]]}, {"id": "1811.02254", "submitter": "Oleksiy Kurganskyy", "authors": "Oleksiy Kurganskyy, Igor Potapov", "title": "De Bruijn graphs and powers of $3/2$", "comments": "23 pages, 6 figures (in russian)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider the set ${\\mathbb Z}^{\\pm\\omega}_{6}$ of two-way\ninfinite words $\\xi$ over the alphabet $\\{0,1,2,3,4,5\\}$ with the integer left\npart $\\lfloor\\xi\\rfloor$ and the fractional right part $\\{\\xi\\}$ separated by a\nradix point. For such words, the operation of multiplication by integers and\ndivision by $6$ are defined as the column multiplication and division in base 6\nnumerical system. The paper develops a finite automata approach for analysis of\nsequences $\\left (\\left \\lfloor \\xi \\left (\\frac{3}{2} \\right)^n \\right \\rfloor\n\\right)_{n \\in {\\mathbb Z}}$ for the words $\\xi \\in {\\mathbb Z}^{\\pm\n\\omega}_{6}$ that have some common properties with $Z$-numbers in Mahler's\n$3/2$-problem. Such sequence of $Z$-words written under each other with the\nsame digit positions in the same column is an infinite $2$-dimensional word\nover the alphabet ${\\mathbb Z}_6$. The automata representation of the columns\nin the integer part of $2$-dimensional $Z$-words has the nice structural\nproperties of the de Bruijn graphs. This way provides some sufficient\nconditions for the emptiness of the set of $Z$-numbers. Our approach has been\ninitially inspirated by the proposition 2.5 in [1] where authors applies\ncellular automata for analysis of\n$\\left(\\left\\{\\xi\\left(\\frac{3}{2}\\right)^n\\right\\} \\right)_{n\\in{\\mathbb Z}}$,\n$\\xi\\in{\\mathbb R}$.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2018 09:37:48 GMT"}, {"version": "v2", "created": "Sun, 11 Nov 2018 11:26:04 GMT"}], "update_date": "2018-11-13", "authors_parsed": [["Kurganskyy", "Oleksiy", ""], ["Potapov", "Igor", ""]]}, {"id": "1811.02398", "submitter": "Radu Iosif", "authors": "Radu Iosif and Xiao Xu", "title": "First Order Alternation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce first order alternating automata, a generalization of boolean\nalternating automata, in which transition rules are described by multisorted\nfirst order formulae, with states and internal variables given by uninterpreted\npredicate terms. The model is closed under union, intersection and complement,\nand its emptiness problem is undecidable, even for the simplest data theory of\nequality. To cope with this limitation, we develop an abstraction refinement\nsemi-algorithm based on lazy annotation of the symbolic execution paths with\ninterpolants, obtained by applying (i) quantifier elimination with witness term\ngeneration and (ii) Lyndon interpolation in the quantifier-free data theory\nwith uninterpreted predicate symbols. This provides a method for checking\ninclusion of timed and finite-memory register automata, and emptiness of\nquantified predicate automata, previously used in the verification of\nparameterized concurrent programs, composed of replicated threads, with a\nshared-memory communication model.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2018 15:10:03 GMT"}, {"version": "v2", "created": "Mon, 19 Nov 2018 12:54:31 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Iosif", "Radu", ""], ["Xu", "Xiao", ""]]}, {"id": "1811.02932", "submitter": "Liyong Lin", "authors": "Yuting Zhu, Liyong Lin, Rong Su", "title": "Supervisor Obfuscation Against Actuator Enablement Attack", "comments": "This paper has been accepted by European Control Conference, 2018.\n  The first two authors contribute equally to this work", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose and address the problem of supervisor obfuscation\nagainst actuator enablement attack, in a common setting where the actuator\nattacker can eavesdrop the control commands issued by the supervisor. We\npropose a method to obfuscate an (insecure) supervisor to make it resilient\nagainst actuator enablement attack in such a way that the behavior of the\noriginal closed-loop system is preserved. An additional feature of the\nobfuscated supervisor, if it exists, is that it has exactly the minimum number\nof states among the set of all the resilient and behavior-preserving\nsupervisors. Our approach involves a simple combination of two basic ideas: 1)\na formulation of the problem of computing behavior-preserving supervisors as\nthe problem of computing separating finite state automata under controllability\nand observability constraints, which can be efficiently tackled by using modern\nSAT solvers, and 2) the use of a recently proposed technique for the\nverification of attackability in our setting, with a normality assumption\nimposed on both the actuator attackers and supervisors.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2018 15:27:04 GMT"}, {"version": "v2", "created": "Fri, 22 Feb 2019 06:59:19 GMT"}], "update_date": "2019-02-25", "authors_parsed": [["Zhu", "Yuting", ""], ["Lin", "Liyong", ""], ["Su", "Rong", ""]]}, {"id": "1811.02982", "submitter": "Adrien Pommellet", "authors": "Adrien Pommellet and Marcio Diaz and Tayssir Touili", "title": "Reachability Analysis of Pushdown Systems with an Upper Stack", "comments": "Full, corrected version of a paper first presented at LATA'17", "journal-ref": null, "doi": "10.1007/978-3-319-53733-7_33", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pushdown systems (PDSs) are a natural model for sequential programs, but they\ncan fail to accurately represent the way an assembly stack actually operates.\nIndeed, one may want to access the part of the memory that is below the current\nstack or base pointer, hence the need for a model that keeps track of this part\nof the memory.\n  To this end, we introduce pushdown systems with an upper stack (UPDSs), an\nextension of PDSs where symbols popped from the stack are not destroyed but\ninstead remain just above its top, and may be overwritten by later push rules.\nWe prove that the sets of successors post* and predecessors pre* of a regular\nset of configurations of such a system are not always regular, but that post*\nis context-sensitive, so that we can decide whether a single configuration is\nforward reachable or not.\n  In order to under-approximate pre* in a regular fashion, we consider a\nbounded-phase analysis of UPDSs, where a phase is a part of a run during which\neither push or pop rules are forbidden. We then present a method to\nover-approximate post* that relies on regular abstractions of runs of UPDSs.\nFinally, we show how these approximations can be used to detect stack overflows\nand stack pointer manipulations with malicious intent.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2018 16:50:08 GMT"}], "update_date": "2018-11-08", "authors_parsed": [["Pommellet", "Adrien", ""], ["Diaz", "Marcio", ""], ["Touili", "Tayssir", ""]]}, {"id": "1811.03167", "submitter": "Matthew Hague", "authors": "Taolue Chen and Matthew Hague and Anthony W. Lin and Philipp R\\\"ummer\n  and Zhilin Wu", "title": "Decision Procedures for Path Feasibility of String-Manipulating Programs\n  with Complex Operations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The design and implementation of decision procedures for checking path\nfeasibility in string-manipulating programs is an important problem, whose\napplications include symbolic execution and automated detection of cross-site\nscripting (XSS) vulnerabilities. A (symbolic) path is a finite sequence of\nassignments and assertions (i.e. without loops), and checking its feasibility\namounts to determining the existence of inputs that yield a successful\nexecution.\n  We give two general semantic conditions which together ensure the\ndecidability of path feasibility: (1) each assertion admits regular monadic\ndecomposition, and (2) each assignment uses a (possibly nondeterministic)\nfunction whose inverse relation preserves regularity. We show these conditions\nare expressive since they are satisfied by a multitude of string operations.\nThey also strictly subsume existing decidable string theories, and most\nexisting benchmarks (e.g. most of Kaluza's, and all of SLOG's, Stranger's, and\nSLOTH's). We give a simple decision procedure and an extensible architecture of\na string solver in that a user may easily incorporate his/her own string\nfunctions. We show the general fragment has a tight, but high complexity. To\naddress this, we propose to allow only partial string functions (i.e., prohibit\nnondeterminism) in condition (2). When nondeterministic functions are needed,\nwe also provide a syntactic fragment that provides a support of\nnondeterministic functions but can be reduced to an existing solver SLOTH.\n  We provide an efficient implementation of our decision procedure for\ndeterministic partial string functions in a new string solver OSTRICH. It\nprovides built-in support for concatenation, reverse, functional transducers,\nand replaceall and provides a framework for extensibility to support further\nstring functions. We demonstrate the efficacy of our new solver against other\ncompetitive solvers.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2018 22:13:04 GMT"}], "update_date": "2018-11-09", "authors_parsed": [["Chen", "Taolue", ""], ["Hague", "Matthew", ""], ["Lin", "Anthony W.", ""], ["Rümmer", "Philipp", ""], ["Wu", "Zhilin", ""]]}, {"id": "1811.03273", "submitter": "EPTCS", "authors": "Peter M. Hines (University of York)", "title": "Information Flow in Pregroup Models of Natural Language", "comments": "In Proceedings CAPNS 2018, arXiv:1811.02701", "journal-ref": "EPTCS 283, 2018, pp. 13-27", "doi": "10.4204/EPTCS.283.2", "report-no": null, "categories": "cs.CL cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is about pregroup models of natural languages, and how they relate\nto the explicitly categorical use of pregroups in Compositional Distributional\nSemantics and Natural Language Processing. These categorical interpretations\nmake certain assumptions about the nature of natural languages that, when\nstated formally, may be seen to impose strong restrictions on pregroup grammars\nfor natural languages.\n  We formalize this as a hypothesis about the form that pregroup models of\nnatural languages must take, and demonstrate by an artificial language example\nthat these restrictions are not imposed by the pregroup axioms themselves. We\ncompare and contrast the artificial language examples with natural languages\n(using Welsh, a language where the 'noun' type cannot be taken as primitive, as\nan illustrative example).\n  The hypothesis is simply that there must exist a causal connection, or\ninformation flow, between the words of a sentence in a language whose purpose\nis to communicate information. This is not necessarily the case with formal\nlanguages that are simply generated by a series of 'meaning-free' rules. This\nimposes restrictions on the types of pregroup grammars that we expect to find\nin natural languages; we formalize this in algebraic, categorical, and\ngraphical terms.\n  We take some preliminary steps in providing conditions that ensure pregroup\nmodels satisfy these conjectured properties, and discuss the more general forms\nthis hypothesis may take.\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2018 05:10:34 GMT"}], "update_date": "2018-11-09", "authors_parsed": [["Hines", "Peter M.", "", "University of York"]]}, {"id": "1811.03595", "submitter": "Szabolcs Iv\\'an", "authors": "Kitti Gelle, Szabolcs Ivan", "title": "The ordinal generated by an ordinal grammar is computable", "comments": "Accepted to Theoretical Computer Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A prefix grammar is a context-free grammar whose nonterminals generate\nprefix-free languages. A prefix grammar $G$ is an ordinal grammar if the\nlanguage $L(G)$ is well-ordered with respect to the lexicographic ordering. It\nis known that from a finite system of parametric fixed point equations one can\nconstruct an ordinal grammar $G$ such that the lexicographic order of $G$ is\nisomorphic with the least solution of the system, if this solution is\nwell-ordered. In this paper we show that given an ordinal grammar, one can\ncompute (the Cantor normal form of) the order type of the lexicographic order\nof its language, yielding that least solutions of fixed point equation systems\ndefining algebraic ordinals are effectively computable (and thus, their\nisomorphism problem is also decidable).\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2018 18:30:44 GMT"}, {"version": "v2", "created": "Wed, 24 Apr 2019 09:05:02 GMT"}], "update_date": "2019-04-25", "authors_parsed": [["Gelle", "Kitti", ""], ["Ivan", "Szabolcs", ""]]}, {"id": "1811.04333", "submitter": "Ye Zhao", "authors": "Ye Zhao and Yinan Li and Luis Sentis and Ufuk Topcu and Jun Liu", "title": "Reactive Task and Motion Planning for Robust Whole-Body Dynamic\n  Locomotion in Constrained Environments", "comments": "47 pages, 23 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.FL cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Contact-based decision and planning methods are becoming increasingly\nimportant to endow higher levels of autonomy for legged robots. Formal\nsynthesis methods derived from symbolic systems have great potential for\nreasoning about high-level locomotion decisions and achieving complex\nmaneuvering behaviors with correctness guarantees. This study takes a first\nstep toward formally devising an architecture composed of task planning and\ncontrol of whole-body dynamic locomotion behaviors in constrained and\ndynamically changing environments. At the high level, we formulate a two-player\ntemporal logic game between the multi-limb locomotion planner and its dynamic\nenvironment to synthesize a winning strategy that delivers symbolic locomotion\nactions. These locomotion actions satisfy the desired high-level task\nspecifications expressed in a fragment of temporal logic. Those actions are\nsent to a robust finite transition system that synthesizes a locomotion\ncontroller that fulfills state reachability constraints. This controller is\nfurther executed via a low-level motion planner that generates feasible\nlocomotion trajectories. We construct a set of dynamic locomotion models for\nlegged robots to serve as a template library for handling diverse environmental\nevents. We devise a replanning strategy that takes into consideration sudden\nenvironmental changes or large state disturbances to increase the robustness of\nthe resulting locomotion behaviors. We formally prove the correctness of the\nlayered locomotion framework guaranteeing a robust implementation by the motion\nplanning layer. Simulations of reactive locomotion behaviors in diverse\nenvironments indicate that our framework has the potential to serve as a\ntheoretical foundation for intelligent locomotion behaviors.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2018 02:19:27 GMT"}], "update_date": "2018-11-13", "authors_parsed": [["Zhao", "Ye", ""], ["Li", "Yinan", ""], ["Sentis", "Luis", ""], ["Topcu", "Ufuk", ""], ["Liu", "Jun", ""]]}, {"id": "1811.05548", "submitter": "Luciano Putruele", "authors": "Pablo F. Castro, Pedro R. D'Argenio, Ramiro Demasi, and Luciano\n  Putruele", "title": "Measuring Masking Fault-Tolerance", "comments": "25 pages including an appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a notion of fault-tolerance distance between\nlabeled transition systems. Intuitively, this notion of distance measures the\ndegree of fault-tolerance exhibited by a candidate system. In practice, there\nare different kinds of fault-tolerance, here we restrict ourselves to the\nanalysis of masking fault-tolerance because it is often a highly desirable goal\nfor critical systems. Roughly speaking, a system is masking fault-tolerant when\nit is able to completely mask the faults, not allowing these faults to have any\nobservable consequences for the users. We capture masking fault-tolerance via a\nsimulation relation, which is accompanied by a corresponding game\ncharacterization. We enrich the resulting games with quantitative objectives to\ndefine the notion of masking fault-tolerance distance. Furthermore, we\ninvestigate the basic properties of this notion of masking distance, and we\nprove that it is a directed pseudo metric. We have implemented our approach in\na prototype tool that automatically compute the masking distance between a\nnominal system and a fault-tolerant version of it. We have used this tool to\nmeasure the masking tolerance of multiple instances of several case studies\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2018 22:15:46 GMT"}, {"version": "v2", "created": "Tue, 20 Nov 2018 21:14:11 GMT"}], "update_date": "2018-11-22", "authors_parsed": [["Castro", "Pablo F.", ""], ["D'Argenio", "Pedro R.", ""], ["Demasi", "Ramiro", ""], ["Putruele", "Luciano", ""]]}, {"id": "1811.06273", "submitter": "Massimiliano Rossi", "authors": "Ferdinando Cicalese, Zsuzsanna Lipt\\'ak, Massimiliano Rossi", "title": "On Infinite Prefix Normal Words", "comments": "22 pages, 5 figures, 1 Table, accepted in Theoret. Comp. Sc.. This is\n  the journal version of the paper with the same title at accepted at SOFSEM\n  2019 (45th International Conference on Current Trends in Theory and Practice\n  of Computer Science, Nov\\'y Smokovec, Slovakia, January 27-30, 2019)", "journal-ref": null, "doi": "10.1016/j.tcs.2021.01.015", "report-no": null, "categories": "math.CO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prefix normal words are binary words that have no factor with more $1$s than\nthe prefix of the same length. Finite prefix normal words were introduced in\n[Fici and Lipt\\'ak, DLT 2011]. In this paper, we study infinite prefix normal\nwords and explore their relationship to some known classes of infinite binary\nwords. In particular, we establish a connection between prefix normal words and\nSturmian words, between prefix normal words and abelian complexity, and between\nprefix normality and lexicographic order.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2018 10:12:09 GMT"}, {"version": "v2", "created": "Fri, 28 May 2021 16:02:54 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Cicalese", "Ferdinando", ""], ["Lipták", "Zsuzsanna", ""], ["Rossi", "Massimiliano", ""]]}, {"id": "1811.06336", "submitter": "Tomoyuki Yamakami", "authors": "Tomoyuki Yamakami", "title": "State Complexity Characterizations of Parameterized Degree-Bounded Graph\n  Connectivity, Sub-Linear Space Computation, and the Linear Space Hypothesis", "comments": "(26 pages, 10pt, A4 size) This paper extends and corrects a\n  preliminary report that has appeared in the Proceedings of the 20th\n  International Conference on Descriptional Complexity of Formal Systems (DCFS\n  2018), Halifax, Canada, July 25-27, 2018. Lecture Notes in Computer Science,\n  Springer, vol. 10952, pp. 237-249, 2018", "journal-ref": "(journal version) Theoretical Computer Science vol. 798, pp.2-22,\n  2019", "doi": null, "report-no": null, "categories": "cs.CC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The linear space hypothesis is a practical working hypothesis, which\noriginally states the insolvability of a restricted 2CNF Boolean formula\nsatisfiability problem parameterized by the number of Boolean variables. From\nthis hypothesis, it naturally follows that the degree-3 directed graph\nconnectivity problem (3DSTCON) parameterized by the number of vertices in a\ngiven graph cannot belong to PsubLIN, composed of all parameterized decision\nproblems computable by polynomial-time, sub-linear-space deterministic Turing\nmachines. This hypothesis immediately implies L$\\neq$NL and it was used as a\nsolid foundation to obtain new lower bounds on the computational complexity of\nvarious NL search and NL optimization problems. The state complexity of\ntransformation refers to the cost of converting one type of finite automata to\nanother type, where the cost is measured in terms of the increase of the number\nof inner states of the converted automata from that of the original automata.\nWe relate the linear space hypothesis to the state complexity of transforming\nrestricted 2-way nondeterministic finite automata to computationally equivalent\n2-way alternating finite automata having narrow computation graphs. For this\npurpose, we present state complexity characterizations of 3DSTCON and PsubLIN.\nWe further characterize a nonuniform version of the linear space hypothesis in\nterms of the state complexity of transformation.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2018 13:28:59 GMT"}, {"version": "v2", "created": "Thu, 22 Aug 2019 11:01:20 GMT"}], "update_date": "2020-01-20", "authors_parsed": [["Yamakami", "Tomoyuki", ""]]}, {"id": "1811.06968", "submitter": "Matteo Sammartino", "authors": "Loris D'Antoni, Tiago Ferreira, Matteo Sammartino, Alexandra Silva", "title": "Symbolic Register Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Symbolic Finite Automata and Register Automata are two orthogonal extensions\nof finite automata motivated by real-world problems where data may have\nunbounded domains. These automata address a demand for a model over large or\ninfinite alphabets, respectively. Both automata models have interesting\napplications and have been successful in their own right. In this paper, we\nintroduce Symbolic Register Automata, a new model that combines features from\nboth symbolic and register automata, with a view on applications that were\npreviously out of reach. We study their properties and provide algorithms for\nemptiness, inclusion and equivalence checking, together with experimental\nresults.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2018 18:50:10 GMT"}, {"version": "v2", "created": "Thu, 23 May 2019 08:52:56 GMT"}], "update_date": "2019-05-24", "authors_parsed": [["D'Antoni", "Loris", ""], ["Ferreira", "Tiago", ""], ["Sammartino", "Matteo", ""], ["Silva", "Alexandra", ""]]}, {"id": "1811.07146", "submitter": "Guillermo P\\'erez", "authors": "Micha\\\"el Cadilhac, Guillermo A. P\\'erez, and Marie van den Bogaard", "title": "The Impatient May Use Limited Optimism to Minimize Regret", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Discounted-sum games provide a formal model for the study of reinforcement\nlearning, where the agent is enticed to get rewards early since later rewards\nare discounted. When the agent interacts with the environment, she may regret\nher actions, realizing that a previous choice was suboptimal given the behavior\nof the environment. The main contribution of this paper is a PSPACE algorithm\nfor computing the minimum possible regret of a given game. To this end, several\nresults of independent interest are shown. (1) We identify a class of\nregret-minimizing and admissible strategies that first assume that the\nenvironment is collaborating, then assume it is adversarial---the precise\ntiming of the switch is key here. (2) Disregarding the computational cost of\nnumerical analysis, we provide an NP algorithm that checks that the regret\nentailed by a given time-switching strategy exceeds a given value. (3) We show\nthat determining whether a strategy minimizes regret is decidable in PSPACE.\n", "versions": [{"version": "v1", "created": "Sat, 17 Nov 2018 11:23:58 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Cadilhac", "Michaël", ""], ["Pérez", "Guillermo A.", ""], ["Bogaard", "Marie van den", ""]]}, {"id": "1811.08061", "submitter": "Chunhui Guo", "authors": "Chunhui Guo, Zhicheng Fu, Zhenyu Zhang, Shangping Ren, Lui Sha", "title": "Model and Integrate Medical Resource Available Times and Relationships\n  in Verifiably Correct Executable Medical Best Practice Guideline Models\n  (Extended Version)", "comments": "full version, 12 pages", "journal-ref": "ACM/IEEE 9th International Conference on Cyber-Physical Systems\n  (ICCPS), 2018", "doi": "10.1109/ICCPS.2018.00032", "report-no": null, "categories": "cs.SE cs.FL cs.LO cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Improving patient care safety is an ultimate objective for medical\ncyber-physical systems. A recent study shows that the patients' death rate is\nsignificantly reduced by computerizing medical best practice guidelines. Recent\ndata also show that some morbidity and mortality in emergency care are directly\ncaused by delayed or interrupted treatment due to lack of medical resources.\nHowever, medical guidelines usually do not provide guidance on medical resource\ndemands and how to manage potential unexpected delays in resource availability.\nIf medical resources are temporarily unavailable, safety properties in existing\nexecutable medical guideline models may fail which may cause increased risk to\npatients under care. The paper presents a separately model and jointly verify\n(SMJV) architecture to separately model medical resource available times and\nrelationships and jointly verify safety properties of existing medical best\npractice guideline models with resource models being integrated in. The SMJV\narchitecture allows medical staff to effectively manage medical resource\ndemands and unexpected resource availability delays during emergency care. The\nseparated modeling approach also allows different domain professionals to make\nindependent model modifications, facilitates the management of frequent\nresource availability changes, and enables resource statechart reuse in\nmultiple medical guideline models. A simplified stroke scenario is used as a\ncase study to investigate the effectiveness and validity of the SMJV\narchitecture. The case study indicates that the SMJV architecture is able to\nidentify unsafe properties caused by unexpected resource delays.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2018 04:01:54 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Guo", "Chunhui", ""], ["Fu", "Zhicheng", ""], ["Zhang", "Zhenyu", ""], ["Ren", "Shangping", ""], ["Sha", "Lui", ""]]}, {"id": "1811.08064", "submitter": "Chunhui Guo", "authors": "Chunhui Guo, Zhicheng Fu, Zhenyu Zhang, Shangping Ren, Lui Sha", "title": "Model and Integrate Medical Resource Availability into Verifiably\n  Correct Executable Medical Guidelines - Technical Report", "comments": "full version, 8 pages. arXiv admin note: substantial text overlap\n  with arXiv:1811.08061", "journal-ref": "IEEE/ACM 36th International Conference on Computer-Aided Design\n  (ICCAD), 2017", "doi": "10.1109/ICCAD.2017.8203885", "report-no": null, "categories": "cs.SE cs.FL cs.LO cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Improving effectiveness and safety of patient care is an ultimate objective\nfor medical cyber-physical systems. A recent study shows that the patients'\ndeath rate can be reduced by computerizing medical guidelines. Most existing\nmedical guideline models are validated and/or verified based on the assumption\nthat all necessary medical resources needed for a patient care are always\navailable. However, the reality is that some medical resources, such as special\nmedical equipment or medical specialists, can be temporarily unavailable for an\nindividual patient. In such cases, safety properties validated and/or verified\nin existing medical guideline models without considering medical resource\navailability may not hold any more. The paper argues that considering medical\nresource availability is essential in building verifiably correct executable\nmedical guidelines. We present an approach to explicitly and separately model\nmedical resource availability and automatically integrate resource availability\nmodels into an existing statechart-based computerized medical guideline model.\nThis approach requires minimal change in existing medical guideline models to\ntake into consideration of medical resource availability in validating and\nverifying medical guideline models. A simplified stroke scenario is used as a\ncase study to investigate the effectiveness and validity of our approach.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2018 04:02:41 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Guo", "Chunhui", ""], ["Fu", "Zhicheng", ""], ["Zhang", "Zhenyu", ""], ["Ren", "Shangping", ""], ["Sha", "Lui", ""]]}, {"id": "1811.08128", "submitter": "Maria Spichkova", "authors": "Maria Spichkova", "title": "Formal FocusST Specification of CAN", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a formal specification of the Controller Area Network\n(CAN) protocol using FocusST framework. We formally describe core components of\nthe protocol, which provides a basis for further formal analysis using the\nIsabelle/HOL theorem prover.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2018 08:59:38 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Spichkova", "Maria", ""]]}, {"id": "1811.08197", "submitter": "Fabian Reiter", "authors": "Benedikt Bollig, Patricia Bouyer, and Fabian Reiter", "title": "Identifiers in Registers - Describing Network Algorithms with Logic", "comments": "17 pages (+ 17 pages of appendices), 1 figure (+ 1 figure in the\n  appendix)", "journal-ref": null, "doi": "10.1007/978-3-030-17127-8_7", "report-no": null, "categories": "cs.FL cs.DC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a formal model of distributed computing based on register automata\nthat captures a broad class of synchronous network algorithms. The local memory\nof each process is represented by a finite-state controller and a fixed number\nof registers, each of which can store the unique identifier of some process in\nthe network. To underline the naturalness of our model, we show that it has the\nsame expressive power as a certain extension of first-order logic on graphs\nwhose nodes are equipped with a total order. Said extension lets us define new\nfunctions on the set of nodes by means of a so-called partial fixpoint\noperator. In spirit, our result bears close resemblance to a classical theorem\nof descriptive complexity theory that characterizes the complexity class PSPACE\nin terms of partial fixpoint logic (a proper superclass of the logic we\nconsider here).\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2018 11:56:53 GMT"}], "update_date": "2019-04-15", "authors_parsed": [["Bollig", "Benedikt", ""], ["Bouyer", "Patricia", ""], ["Reiter", "Fabian", ""]]}, {"id": "1811.09420", "submitter": "Jan Philipp W\\\"achter", "authors": "Daniele D'Angeli, Emanuele Rodaro and Jan Philipp W\\\"achter", "title": "On the Structure Theory of Partial Automaton Semigroups", "comments": null, "journal-ref": "Semigroup Forum (2020)", "doi": "10.1007/s00233-020-10114-5", "report-no": null, "categories": "cs.FL math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study automaton structures, i.e. groups, monoids and semigroups generated\nby an automaton, which, in this context, means a deterministic finite-state\nletter-to-letter transducer. Instead of considering only complete automata, we\nspecifically investigate semigroups generated by partial automata. First, we\nshow that the class of semigroups generated by partial automata coincides with\nthe class of semigroups generated by complete automata if and only if the\nlatter class is closed under removing a previously adjoined zero, which is an\nopen problem in (complete) automaton semigroup theory stated by Cain. Then, we\nshow that no semidirect product (and, thus, also no direct product) of an\narbitrary semigroup with a (non-trivial) subsemigroup of the free monogenic\nsemigroup is an automaton semigroup. Finally, we concentrate on inverse\nsemigroups generated by invertible but partial automata, which we call\nautomaton-inverse semigroups, and show that any inverse automaton semigroup can\nbe generated by such an automaton (showing that automaton-inverse semigroups\nand inverse automaton semigroups coincide).\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2018 10:32:21 GMT"}, {"version": "v2", "created": "Wed, 3 Jun 2020 08:49:33 GMT"}, {"version": "v3", "created": "Thu, 16 Jul 2020 08:17:22 GMT"}], "update_date": "2020-07-17", "authors_parsed": [["D'Angeli", "Daniele", ""], ["Rodaro", "Emanuele", ""], ["Wächter", "Jan Philipp", ""]]}, {"id": "1811.10083", "submitter": "Lakhan Shiva Kamireddy", "authors": "Lakhan Shiva Kamireddy", "title": "Real-Time Systems Modeling and Analysis", "comments": "12 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is a survey of extensions to finite automata theory to model\nreal-time systems as well as systems exhibiting mixed discrete-continuous\nbehavior. Real-time systems maintain a continuous and timely interaction with\nthe environment, often adhering to some timing constraints. Therefore, the\nfinite automata theory is extended to measure real-time values and accept or\nreject runs on a class of automata known as timed-automata, upon satisfying\nsome timed properties. The automata modeling the mixed discrete-continuous\nbehavior of hybrid systems has its continuous-time dynamics described using\nordinary differential equations for the state space and discrete-time dynamics\ndescribing the control decisions. Based on these dynamical system models, we\nlikewise extend the finite automata theory to describe the behavior of hybrid\nsystems using Hybrid Automata. We further study some applications of this class\nof systems, sometimes referred to as Cyber-physical systems and perform a\ncase-study on Peterson's Mutual Exclusion protocol using Uppaal.\n", "versions": [{"version": "v1", "created": "Sun, 25 Nov 2018 20:13:09 GMT"}], "update_date": "2018-11-27", "authors_parsed": [["Kamireddy", "Lakhan Shiva", ""]]}, {"id": "1811.10157", "submitter": "Alex Bishop", "authors": "Alex Bishop and Murray Elder", "title": "Bounded Automata Groups are co-ET0L", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-030-13435-8_6", "report-no": null, "categories": "math.GR cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Holt and R\\\"over proved that finitely generated bounded automata groups have\nindexed co-word problem. Here we sharpen this result to show they are in fact\nco-ET0L.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2018 03:08:44 GMT"}], "update_date": "2020-12-15", "authors_parsed": [["Bishop", "Alex", ""], ["Elder", "Murray", ""]]}, {"id": "1811.10400", "submitter": "Eric Rothstein-Morris", "authors": "Eric Rothstein-Morris and Sun Jun", "title": "Quantifying Attacker Capability Via Model Checking Multiple Properties\n  (Extended Version)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work aims to solve a practical problem, i.e., how to quantify the risk\nbrought upon a system by different attackers. The answer is useful for\noptimising resource allocation for system defence. Given a set of safety\nrequirements, we quantify the attacker capability in terms of the set of safety\nrequirements an attacker can compromise. Given a system (in the presence of an\nattacker), model checking it against each safety requirement one by one is\nexpensive and wasteful since the same state space is explored many times. We\nthus propose model checking multiple properties efficiently by means of\ncoalgebraic model checking using enhanced coinduction techniques. We apply the\nproposed technique to a real-world water treatment system and the results show\nthat our approach can effectively reduce the effort required for model\nchecking.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2018 15:19:09 GMT"}], "update_date": "2018-11-27", "authors_parsed": [["Rothstein-Morris", "Eric", ""], ["Jun", "Sun", ""]]}, {"id": "1811.10401", "submitter": "Tobias Kapp\\'e", "authors": "Tobias Kapp\\'e and Paul Brunet and Jurriaan Rot and Alexandra Silva\n  and Jana Wagemaker and Fabio Zanasi", "title": "Kleene Algebra with Observations", "comments": null, "journal-ref": null, "doi": "10.4230/LIPIcs.CONCUR.2019.41", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Kleene algebra with tests (KAT) is an algebraic framework for reasoning about\nthe control flow of sequential programs. Generalising KAT to reason about\nconcurrent programs is not straightforward, because axioms native to KAT in\nconjunction with expected axioms for concurrency lead to an anomalous equation.\nIn this paper, we propose Kleene algebra with observations (KAO), a variant of\nKAT, as an alternative foundation for extending KAT to a concurrent setting. We\ncharacterise the free model of KAO, and establish a decision procedure w.r.t.\nits equational theory.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2018 16:56:43 GMT"}, {"version": "v2", "created": "Thu, 25 Apr 2019 08:05:27 GMT"}, {"version": "v3", "created": "Tue, 16 Jul 2019 09:50:06 GMT"}, {"version": "v4", "created": "Wed, 21 Aug 2019 09:45:00 GMT"}], "update_date": "2019-08-22", "authors_parsed": [["Kappé", "Tobias", ""], ["Brunet", "Paul", ""], ["Rot", "Jurriaan", ""], ["Silva", "Alexandra", ""], ["Wagemaker", "Jana", ""], ["Zanasi", "Fabio", ""]]}, {"id": "1811.10576", "submitter": "Dhruv Khandelwal", "authors": "Dhruv Khandelwal, Maarten Schoukens and Roland T\\'oth", "title": "Grammar-based Representation and Identification of Dynamical Systems", "comments": "Submitted to European Control Conference (ECC) 2019", "journal-ref": null, "doi": "10.23919/ECC.2019.8795719", "report-no": null, "categories": "cs.SY cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a novel approach to identify dynamical systems. The\nmethod estimates the model structure and the parameters of the model\nsimultaneously, automating the critical decisions involved in identification\nsuch as model structure and complexity selection. In order to solve the\ncombined model structure and model parameter estimation problem, a new\nrepresentation of dynamical systems is proposed. The proposed representation is\nbased on Tree Adjoining Grammar, a formalism that was developed from linguistic\nconsiderations. Using the proposed representation, the identification problem\ncan be interpreted as a multi-objective optimization problem and we propose a\nEvolutionary Algorithm-based approach to solve the problem. A benchmark example\nis used to demonstrate the proposed approach. The results were found to be\ncomparable to that obtained by state-of-the-art non-linear system\nidentification methods, without making use of knowledge of the system\ndescription.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2018 18:30:55 GMT"}], "update_date": "2020-01-16", "authors_parsed": [["Khandelwal", "Dhruv", ""], ["Schoukens", "Maarten", ""], ["Tóth", "Roland", ""]]}, {"id": "1811.10815", "submitter": "EPTCS", "authors": "Jan Bessai (Technical University of Dortmund), Anna Vasileva\n  (Technical University of Dortmund)", "title": "User Support for the Combinator Logic Synthesizer Framework", "comments": "In Proceedings F-IDE 2018, arXiv:1811.09014", "journal-ref": "EPTCS 284, 2018, pp. 16-25", "doi": "10.4204/EPTCS.284.2", "report-no": null, "categories": "cs.LO cs.FL cs.HC cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Usability is crucial for the adoption of software development technologies.\nThis is especially true in development stages, where build processes fail,\nbecause software is not yet complete or was incompletely modified. We present\nearly work that aims to improve usability of the Combinatory Logic Synthesizer\n(CL)S framework, especially in these stages. (CL)S is a publicly available\ntype-based development tool for the automatic composition of software\ncomponents from a user-specified repository. It provides an implementation of a\ntype inhabitation algorithm for Combinatory Logic with intersection types,\nwhich is fully integrated into the Scala programming language. Here, we\nspecifically focus on building a web-based IDE to make potentially incomplete\nor erroneous input specifications for and decisions of the algorithm\nunderstandable for non-experts. A main aspect of this is providing graphical\nrepresentations illustrating the step-wise search process of the algorithm. We\nalso provide a detailed discussion of possible future work to further improve\nthe understandability of these representations.\n", "versions": [{"version": "v1", "created": "Tue, 27 Nov 2018 05:00:29 GMT"}], "update_date": "2018-11-28", "authors_parsed": [["Bessai", "Jan", "", "Technical University of Dortmund"], ["Vasileva", "Anna", "", "Technical University of Dortmund"]]}, {"id": "1811.10901", "submitter": "Taolue Chen", "authors": "Yedi Zhang and Fu Song and Taolue Chen", "title": "Making Agents' Abilities Explicit", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Alternating-time temporal logics (ATL/ATL*) represent a family of modal\nlogics for reasoning about agents' strategic abilities in multiagent systems\n(MAS). The interpretations of ATL/ATL* over the semantic model Concurrent Game\nStructures (CGS) usually vary depending on the agents' abilities, for instance,\nperfect vs. imperfect information, perfect vs. imperfect recall, resulting in a\nvariety of variants which have been studied extensively in literature. However,\nthey are defined at the semantic level, which may limit modeling flexibilities\nand may give counter-intuitive interpretations. To mitigate these issues, in\nthis work, we propose to extend CGS with agents' abilities and study the new\nsemantics of ATL/ATL* under this model. We give PSACE/2EXPTIME model-checking\nalgorithms for ATL/ATL* and implement them as a prototype tool. Experiment\nresults show the practical feasibility of the approach.\n", "versions": [{"version": "v1", "created": "Tue, 27 Nov 2018 10:22:09 GMT"}], "update_date": "2018-11-28", "authors_parsed": [["Zhang", "Yedi", ""], ["Song", "Fu", ""], ["Chen", "Taolue", ""]]}, {"id": "1811.11660", "submitter": "Michiel de Bondt", "authors": "Michiel de Bondt", "title": "A short proof of a theorem of J.-E. Pin", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a short proof of a theorem of J.-E. Pin (theorem 1.1 below), which\ncan be found in his thesis.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 16:36:15 GMT"}], "update_date": "2018-11-29", "authors_parsed": [["de Bondt", "Michiel", ""]]}, {"id": "1811.11691", "submitter": "Susan Hermiller", "authors": "Nathan Corwin, Gili Golan, Susan Hermiller, Ashley Johnson and Zoran\n  Sunic", "title": "Autostackability of Thompson's group $F$", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The word problem for Thompson's group $F$ has a solution, but it remains\nunknown whether $F$ is automatic or has a finite or regular convergent\n(terminating and confluent) rewriting system. We show that the group $F$ admits\na natural extension of these two properties, namely autostackability, and we\ngive an explicit bounded regular convergent prefix-rewriting system for $F$.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 17:18:47 GMT"}], "update_date": "2018-11-29", "authors_parsed": [["Corwin", "Nathan", ""], ["Golan", "Gili", ""], ["Hermiller", "Susan", ""], ["Johnson", "Ashley", ""], ["Sunic", "Zoran", ""]]}, {"id": "1811.11739", "submitter": "Daniel Cruz", "authors": "Daniel A. Cruz, Margherita Maria Ferrari, Natasa Jonoska, Lukas\n  Nabergall, and Masahico Saito", "title": "Insertions Yielding Equivalent Double Occurrence Words", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.FL", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  A double occurrence word (DOW) is a word in which every symbol appears\nexactly twice; two DOWs are equivalent if one is a symbol-to-symbol image of\nthe other. We consider the so called repeat pattern ($\\alpha\\alpha$) and the\nreturn pattern ($\\alpha\\alpha^R$), with gaps allowed between the $\\alpha$'s.\nThese patterns generalize square and palindromic factors of DOWs, respectively.\nWe introduce a notion of inserting repeat/return words into DOWs and study how\ntwo distinct insertions into the same word can produce equivalent DOWs. Given a\nDOW $w$, we characterize the structure of $w$ which allows two distinct\ninsertions to yield equivalent DOWs. This characterization depends on the\nlocations of the insertions and on the length of the inserted repeat/return\nwords and implies that when one inserted word is a repeat word and the other is\na return word, then both words must be trivial (i.e., have only one symbol).\nThe characterization also introduces a method to generate families of words\nrecursively.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2018 18:46:51 GMT"}, {"version": "v2", "created": "Sat, 22 Dec 2018 15:09:18 GMT"}, {"version": "v3", "created": "Thu, 26 Sep 2019 17:51:04 GMT"}], "update_date": "2019-09-27", "authors_parsed": [["Cruz", "Daniel A.", ""], ["Ferrari", "Margherita Maria", ""], ["Jonoska", "Natasa", ""], ["Nabergall", "Lukas", ""], ["Saito", "Masahico", ""]]}, {"id": "1811.12294", "submitter": "Thorsten Wi{\\ss}mann", "authors": "Thorsten Wi{\\ss}mann, J\\'er\\'emy Dubut, Shin-ya Katsumata, Ichiro\n  Hasuo", "title": "Path category for free - Open morphisms from coalgebras with\n  non-deterministic branching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are different categorical approaches to variations of transition\nsystems and their bisimulations. One is coalgebra for a functor G, where a\nbisimulation is defined as a span of G-coalgebra homomorphism. Another one is\nin terms of path categories and open morphisms, where a bisimulation is defined\nas a span of open morphisms. This similarity is no coincidence: given a functor\nG, fulfilling certain conditions, we derive a path-category for pointed\nG-coalgebras and lax homomorphisms, such that the open morphisms turn out to be\nprecisely the G-coalgebra homomorphisms. The above construction provides\npath-categories and trace semantics for free for different flavours of\ntransition systems: (1) non-deterministic tree automata (2) regular\nnondeterministic nominal automata (RNNA), an expressive automata notion living\nin nominal sets (3) multisorted transition systems. This last instance relates\nto Lasota's construction, which is in the converse direction.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2018 16:35:45 GMT"}, {"version": "v2", "created": "Fri, 15 Feb 2019 17:14:42 GMT"}], "update_date": "2019-02-18", "authors_parsed": [["Wißmann", "Thorsten", ""], ["Dubut", "Jérémy", ""], ["Katsumata", "Shin-ya", ""], ["Hasuo", "Ichiro", ""]]}, {"id": "1811.12339", "submitter": "C\\'elia Borlido", "authors": "C\\'elia Borlido and Mai Gehrke", "title": "A note on powers of Boolean spaces with internal semigroups", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GN cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Boolean spaces with internal semigroups generalize profinite semigroups and\nare pertinent for the recognition of not-necessarily regular languages. Via\nrecognition, the study of existential quantification in logic on words amounts\nto the study of certain spans of Boolean spaces with internal semigroups. In\nturn, these can be understood as the superposition of a span of Boolean spaces\nand a span of semigroups. In this note, we first study these separately. More\nprecisely, we identify the conditions under which each of these spans gives\nrise to a morphism into the respective power or Vietoris construction of the\ncorresponding structure. Combining these characterizations, we obtain such a\ncharacterization for spans of Boolean spaces with internal semigroups which we\nuse to describe the topo-algebraic counterpart of monadic second-order\nexistential quantification. This is closely related to a part of the earlier\nwork on existential quantification in first-order logic on words by Gehrke,\nPetri\\c san and Reggio. The observation that certain morphisms lift\ncontravariantly to the appropriate power structures makes our analysis very\nsimple.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2018 17:38:55 GMT"}, {"version": "v2", "created": "Thu, 17 Jan 2019 15:21:32 GMT"}], "update_date": "2019-01-18", "authors_parsed": [["Borlido", "Célia", ""], ["Gehrke", "Mai", ""]]}]