[{"id": "1506.00086", "submitter": "Giovanni Viglietta", "authors": "Giovanni Viglietta", "title": "Simulating a die roll by flipping two coins", "comments": "2 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how to simulate a roll of a fair $n$-sided die by one flip of a\nbiased coin with probability $1/n$ of coming up heads, followed by\n$3\\lfloor\\log_2 n \\rfloor+1$ flips of a fair coin.\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2015 07:29:37 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Viglietta", "Giovanni", ""]]}, {"id": "1506.00133", "submitter": "Irene Guessarian", "authors": "Patrick Cegielski, Serge Grigorieff, Irene Guessarian", "title": "Characterizing congruence preserving functions $Z/nZ\\to Z/mZ$ via\n  rational polynomials", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a basis of rational polynomial-like functions\n$P_0,\\ldots,P_{n-1}$ for the free module of functions $Z/nZ\\to Z/mZ$. We then\ncharacterize the subfamily of congruence preserving functions as the set of\nlinear combinations of the functions $lcm(k)\\,P_k$ where $lcm(k)$ is the least\ncommon multiple of $2,\\ldots,k$ (viewed in $Z/mZ$). As a consequence, when\n$n\\geq m$, the number of such functions is independent of $n$.\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2015 15:52:32 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Cegielski", "Patrick", ""], ["Grigorieff", "Serge", ""], ["Guessarian", "Irene", ""]]}, {"id": "1506.00165", "submitter": "Shay Moran", "authors": "Shay Moran and Manfred K. Warmuth", "title": "Labeled compression schemes for extremal classes", "comments": "21 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is a long-standing open problem whether there always exists a compression\nscheme whose size is of the order of the Vapnik-Chervonienkis (VC) dimension\n$d$. Recently compression schemes of size exponential in $d$ have been found\nfor any concept class of VC dimension $d$. Previously, compression schemes of\nsize $d$ have been given for maximum classes, which are special concept classes\nwhose size equals an upper bound due to Sauer-Shelah. We consider a\ngeneralization of maximum classes called extremal classes. Their definition is\nbased on a powerful generalization of the Sauer-Shelah bound called the\nSandwich Theorem, which has been studied in several areas of combinatorics and\ncomputer science. The key result of the paper is a construction of a sample\ncompression scheme for extremal classes of size equal to their VC dimension. We\nalso give a number of open problems concerning the combinatorial structure of\nextremal classes and the existence of unlabeled compression schemes for them.\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2015 21:01:11 GMT"}, {"version": "v2", "created": "Tue, 2 Jun 2015 06:59:52 GMT"}, {"version": "v3", "created": "Fri, 22 Jul 2016 12:53:56 GMT"}], "update_date": "2016-07-25", "authors_parsed": [["Moran", "Shay", ""], ["Warmuth", "Manfred K.", ""]]}, {"id": "1506.00190", "submitter": "Ruo-Wei Hung", "authors": "Ruo-Wei Hung", "title": "Hamiltonian Cycles in Linear-Convex Supergrid Graphs", "comments": "17 pages, 24 figurs", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A supergrid graph is a finite induced subgraph of the infinite graph\nassociated with the two-dimensional supergrid. The supergrid graphs contain\ngrid graphs and triangular grid graphs as subgraphs. The Hamiltonian cycle\nproblem for grid and triangular grid graphs was known to be NP-complete. In the\npast, we have shown that the Hamiltonian cycle problem for supergrid graphs is\nalso NP-complete. The Hamiltonian cycle problem on supergrid graphs can be\napplied to control the stitching trace of computerized sewing machines. In this\npaper, we will study the Hamiltonian cycle property of linear-convex supergrid\ngraphs which form a subclass of supergrid graphs. A connected graph is called\n$k$-connected if there are $k$ vertex-disjoint paths between every pair of\nvertices, and is called locally connected if the neighbors of each vertex in it\nform a connected subgraph. In this paper, we first show that any 2-connected,\nlinear-convex supergrid graph is locally connected. We then prove that any\n2-connected, linear-convex supergrid graph contains a Hamiltonian cycle.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 03:42:31 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Hung", "Ruo-Wei", ""]]}, {"id": "1506.00202", "submitter": "Dmitriy Malyshev Sergeevich", "authors": "D.S. Malyshev", "title": "A complexity dichotomy for the dominating set problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We completely determine the complexity status of the dominating set problem\nfor hereditary graph classes defined by forbidden induced subgraphs with at\nmost five vertices.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 08:28:51 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Malyshev", "D. S.", ""]]}, {"id": "1506.00249", "submitter": "Vadim E. Levit", "authors": "Adi Jarden, Vadim E. Levit and Eugen Mandrescu", "title": "Monotonic Properties of Collections of Maximum Independent Sets of a\n  Graph", "comments": "15 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let G be a simple graph with vertex set V(G). A subset S of V(G) is\nindependent if no two vertices from S are adjacent. The graph G is known to be\na Konig-Egervary if alpha(G) + mu(G)= |V(G)|, where alpha(G) denotes the size\nof a maximum independent set and mu(G) is the cardinality of a maximum\nmatching. Let Omega(G) denote the family of all maximum independent sets, and f\nbe the function from the set of subcollections Gamma of Omega(G) such that\nf(Gamma) = (the cardinality of the union of elements of Gamma) + (the\ncardinality of the intersection of elements of Gamma). Our main finding claims\nthat f is \"<<\"-increasing, where the preorder {Gamma1} << {Gamma2} means that\nthe union of all elements of {Gamma1} is a subset of the union of all elements\nof {Gamma2}, while the intersection of all elements of {Gamma2} is a subset of\nthe intersection of all elements of {Gamma1}. Let us say that a family {Gamma}\nis a Konig-Egervary collection if f(Gamma) = 2*alpha(G). We conclude with the\nobservation that for every graph G each subcollection of a Konig-Egervary\ncollection is Konig-Egervary as well.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 16:09:17 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Jarden", "Adi", ""], ["Levit", "Vadim E.", ""], ["Mandrescu", "Eugen", ""]]}, {"id": "1506.00255", "submitter": "Vadim E. Levit", "authors": "Adi Jarden, Vadim E. Levit and Eugen Mandrescu", "title": "Critical and Maximum Independent Sets of a Graph", "comments": "12 pages, 9 figures. arXiv admin note: substantial text overlap with\n  arXiv:1407.7368", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let G be a simple graph with vertex set V(G). A subset S of V(G) is\nindependent if no two vertices from S are adjacent. By Ind(G) we mean the\nfamily of all independent sets of G while core(G) and corona(G) denote the\nintersection and the union of all maximum independent sets, respectively. The\nnumber d(X)= |X|-|N(X)| is the difference of the set of vertices X, and an\nindependent set A is critical if d(A)=max{d(I):I belongs to Ind(G)} (Zhang,\n1990). Let ker(G) and diadem(G) be the intersection and union, respectively, of\nall critical independent sets of G (Levit and Mandrescu, 2012). In this paper,\nwe present various connections between critical unions and intersections of\nmaximum independent sets of a graph. These relations give birth to new\ncharacterizations of Koenig-Egervary graphs, some of them involving ker(G),\ncore(G), corona(G), and diadem(G).\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2015 17:02:01 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Jarden", "Adi", ""], ["Levit", "Vadim E.", ""], ["Mandrescu", "Eugen", ""]]}, {"id": "1506.00438", "submitter": "Aravind Rajeswaran", "authors": "Aravind Rajeswaran and Shankar Narasimhan", "title": "Network Topology Identification using PCA and its Graph Theoretic\n  Interpretations", "comments": "Structure of paper is changed to improve presentation. Methods and\n  results are unchanged. A more detailed literature survey has been added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.DM cs.SY stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solve the problem of identifying (reconstructing) network topology from\nsteady state network measurements. Concretely, given only a data matrix\n$\\mathbf{X}$ where the $X_{ij}$ entry corresponds to flow in edge $i$ in\nconfiguration (steady-state) $j$, we wish to find a network structure for which\nflow conservation is obeyed at all the nodes. This models many network problems\ninvolving conserved quantities like water, power, and metabolic networks. We\nshow that identification is equivalent to learning a model $\\mathbf{A_n}$ which\ncaptures the approximate linear relationships between the different variables\ncomprising $\\mathbf{X}$ (i.e. of the form $\\mathbf{A_n X \\approx 0}$) such that\n$\\mathbf{A_n}$ is full rank (highest possible) and consistent with a network\nnode-edge incidence structure. The problem is solved through a sequence of\nsteps like estimating approximate linear relationships using Principal\nComponent Analysis, obtaining f-cut-sets from these approximate relationships,\nand graph realization from f-cut-sets (or equivalently f-circuits). Each step\nand the overall process is polynomial time. The method is illustrated by\nidentifying topology of a water distribution network. We also study the extent\nof identifiability from steady-state data.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2015 10:57:00 GMT"}, {"version": "v2", "created": "Thu, 21 Jan 2016 18:31:42 GMT"}], "update_date": "2016-01-22", "authors_parsed": [["Rajeswaran", "Aravind", ""], ["Narasimhan", "Shankar", ""]]}, {"id": "1506.00462", "submitter": "Ulrich Pferschy", "authors": "Andreas Darmann and Ulrich Pferschy and Joachim Schauer", "title": "On the shortest path game: extended version", "comments": "Extended version contains the full description of the dynamic\n  programming arrays in Section 4", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we address a game theoretic variant of the shortest path\nproblem, in which two decision makers (players) move together along the edges\nof a graph from a given starting vertex to a given destination. The two players\ntake turns in deciding in each vertex which edge to traverse next. The decider\nin each vertex also has to pay the cost of the chosen edge. We want to\ndetermine the path where each player minimizes its costs taking into account\nthat also the other player acts in a selfish and rational way. Such a solution\nis a subgame perfect equilibrium and can be determined by backward induction in\nthe game tree of the associated finite game in extensive form.\n  We show that the decision problem associated with such a path is\nPSPACE-complete even for bipartite graphs both for the directed and the\nundirected version. The latter result is a surprising deviation from the\ncomplexity status of the closely related game Geography.\n  On the other hand, we can give polynomial time algorithms for directed\nacyclic graphs and for cactus graphs even in the undirected case. The latter is\nbased on a decomposition of the graph into components and their resolution by a\nnumber of fairly involved dynamic programming arrays. Finally, we give some\narguments about closing the gap of the complexity status for graphs of bounded\ntreewidth.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2015 12:08:12 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Darmann", "Andreas", ""], ["Pferschy", "Ulrich", ""], ["Schauer", "Joachim", ""]]}, {"id": "1506.00508", "submitter": "Mikko Kivel\\\"a", "authors": "Mikko Kivel\\\"a, Mason A. Porter", "title": "Isomorphisms in Multilayer Networks", "comments": "Working paper; 18 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.DM cs.SI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend the concept of graph isomorphisms to multilayer networks with any\nnumber of \"aspects\" (i.e., types of layering). In developing this\ngeneralization, we identify multiple types of isomorphisms. For example, in\nmultilayer networks with a single aspect, permuting vertex labels, layer\nlabels, and both vertex labels and layer labels each yield different\nisomorphism relations between multilayer networks. Multilayer network\nisomorphisms lead naturally to defining isomorphisms in any of the numerous\ntypes of networks that can be represented as a multilayer network, and we\nthereby obtain isomorphisms for multiplex networks, temporal networks, networks\nwith both of these features, and more. We reduce each of the multilayer network\nisomorphism problems to a graph isomorphism problem, where the size of the\ngraph isomorphism problem grows linearly with the size of the multilayer\nnetwork isomorphism problem. One can thus use software that has been developed\nto solve graph isomorphism problems as a practical means for solving multilayer\nnetwork isomorphism problems. Our theory lays a foundation for extending many\nnetwork analysis methods --- including motifs, graphlets, structural roles, and\nnetwork alignment --- to any multilayer network.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2015 14:28:03 GMT"}, {"version": "v2", "created": "Tue, 1 Sep 2015 16:19:54 GMT"}, {"version": "v3", "created": "Thu, 16 Feb 2017 10:13:54 GMT"}], "update_date": "2017-02-17", "authors_parsed": [["Kivelä", "Mikko", ""], ["Porter", "Mason A.", ""]]}, {"id": "1506.00718", "submitter": "Ryuhei Mori", "authors": "Ryuhei Mori and Osamu Watanabe", "title": "Peeling Algorithm on Random Hypergraphs with Superlinear Number of\n  Hyperedges", "comments": "13 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When we try to solve a system of linear equations, we can consider a simple\niterative algorithm in which an equation including only one variable is chosen\nat each step, and the variable is fixed to the value satisfying the equation.\nThe dynamics of this algorithm is captured by the peeling algorithm. Analyses\nof the peeling algorithm on random hypergraphs are required for many problems,\ne.g., the decoding threshold of low-density parity check codes, the inverting\nthreshold of Goldreich's pseudorandom generator, the load threshold of cuckoo\nhashing, etc. In this work, we deal with random hypergraphs including\nsuperlinear number of hyperedges, and derive the tight threshold for the\nsucceeding of the peeling algorithm. For the analysis, Wormald's method of\ndifferential equations, which is commonly used for analyses of the peeling\nalgorithm on random hypergraph with linear number of hyperedges, cannot be used\ndue to the superlinear number of hyperedges. A new method called the evolution\nof the moment generating function is proposed in this work.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 01:14:42 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Mori", "Ryuhei", ""], ["Watanabe", "Osamu", ""]]}, {"id": "1506.00753", "submitter": "Navin Kashyap", "authors": "Chun Lam Chan, Winston Fernandes, Navin Kashyap, and Manjunath\n  Krishnapur", "title": "Phase Transitions for the Uniform Distribution in the PML Problem and\n  its Bethe Approximation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The pattern maximum likelihood (PML) estimate, introduced by Orlitsky et al.,\nis an estimate of the multiset of probabilities in an unknown probability\ndistribution $\\mathbf{p}$, the estimate being obtained from $n$ i.i.d. samples\ndrawn from $\\mathbf{p}$. The PML estimate involves solving a difficult\noptimization problem over the set of all probability mass functions (pmfs) of\nfinite support. In this paper, we describe an interesting phase transition\nphenomenon in the PML estimate: at a certain sharp threshold, the uniform\ndistribution goes from being a local maximum to being a local minimum for the\noptimization problem in the estimate. We go on to consider the question of\nwhether a similar phase transition phenomenon also exists in the Bethe\napproximation of the PML estimate, the latter being an approximation method\nwith origins in statistical physics. We show that the answer to this question\nis a qualified \"Yes\". Our analysis involves the computation of the mean and\nvariance of the $(i,j)$th entry, $a_{i,j}$, in a random $k \\times k$\nnon-negative integer matrix $A$ with row and column sums all equal to $M$,\ndrawn according to a distribution that assigns to $A$ a probability\nproportional to $\\prod_{i,j} \\frac{(M-a_{i,j})!}{a_{i,j}!}$.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 05:21:59 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Chan", "Chun Lam", ""], ["Fernandes", "Winston", ""], ["Kashyap", "Navin", ""], ["Krishnapur", "Manjunath", ""]]}, {"id": "1506.00868", "submitter": "Mathilde Bouvel", "authors": "Fr\\'ed\\'erique Bassino, Mathilde Bouvel, Adeline Pierrot, Carine\n  Pivoteau, Dominique Rossin", "title": "An algorithm computing combinatorial specifications of permutation\n  classes", "comments": "Version 2, incorporating suggestions of anonymous referees", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a methodology that automatically derives a\ncombinatorial specification for a permutation class C, given its basis B of\nexcluded patterns and the set of simple permutations in C, when these sets are\nboth finite. This is achieved considering both pattern avoidance and pattern\ncontainment constraints in permutations. The obtained specification yields a\nsystem of equations satisfied by the generating function of C, this system\nbeing always positive and algebraic. It also yields a uniform random sampler of\npermutations in C. The method presented is fully algorithmic.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 13:04:58 GMT"}, {"version": "v2", "created": "Mon, 31 Oct 2016 13:32:13 GMT"}], "update_date": "2016-11-01", "authors_parsed": [["Bassino", "Frédérique", ""], ["Bouvel", "Mathilde", ""], ["Pierrot", "Adeline", ""], ["Pivoteau", "Carine", ""], ["Rossin", "Dominique", ""]]}, {"id": "1506.01055", "submitter": "Eric Blais", "authors": "Eric Blais and Li-Yang Tan and Andrew Wan", "title": "An inequality for the Fourier spectrum of parity decision trees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a new bound on the sum of the linear Fourier coefficients of a\nBoolean function in terms of its parity decision tree complexity. This result\ngeneralizes an inequality of O'Donnell and Servedio for regular decision trees.\nWe use this bound to obtain the first non-trivial lower bound on the parity\ndecision tree complexity of the recursive majority function.\n", "versions": [{"version": "v1", "created": "Wed, 20 May 2015 13:03:55 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Blais", "Eric", ""], ["Tan", "Li-Yang", ""], ["Wan", "Andrew", ""]]}, {"id": "1506.01082", "submitter": "Carlo Comin MSc", "authors": "Carlo Comin, Romeo Rizzi", "title": "An Improved Upper Bound on Maximal Clique Listing via Rectangular Fast\n  Matrix Multiplication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The first output-sensitive algorithm for the Maximal Clique Listing problem\nwas given by Tsukiyama et.al. in 1977. As any algorithm falling within the\nReverse Search paradigm, it performs a DFS visit of a directed tree (the\nRS-tree) having the objects to be listed (i.e. maximal cliques) as its nodes.\nIn a recursive implementation, the RS-tree corresponds to the recursion tree of\nthe algorithm. The time delay is given by the cost of generating the next child\nof a node, and Tsukiyama showed it is $O(mn)$. In 2004, Makino and Uno\nsharpened the time delay to $O(n^{\\omega})$ by generating all the children of a\nnode in one single shot performed by computing a \\emph{square} fast matrix\nmultiplication. In this paper, we further improve the asymptotics for the\nexploration of the same RS-tree by grouping the offsprings' computation even\nfurther. Our idea is to rely on rectangular fast matrix multiplication in order\nto compute all children of $n^2$ nodes in one shot. According to the current\nupper bounds on fast matrix multiplication, with this the time delay improves\nfrom $O(n^{2.3728639})$ to $O(n^{2.093362})$.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2015 22:48:34 GMT"}, {"version": "v2", "created": "Sun, 7 Jun 2015 19:48:10 GMT"}, {"version": "v3", "created": "Thu, 11 Jun 2015 23:05:59 GMT"}, {"version": "v4", "created": "Sun, 21 Jun 2015 12:35:25 GMT"}, {"version": "v5", "created": "Mon, 24 Aug 2015 08:19:05 GMT"}], "update_date": "2015-08-25", "authors_parsed": [["Comin", "Carlo", ""], ["Rizzi", "Romeo", ""]]}, {"id": "1506.01419", "submitter": "Sebastian M. Cioab\\u{a}", "authors": "Sebastian M. Cioab\\u{a} and Peng Xu", "title": "Mixing Rates of Random Walks with Little Backtracking", "comments": "31 pages; to appear in the CRM Proceedings Series, published by the\n  American Mathematical Society as part of the Contemporary Mathematics Series", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many regular graphs admit a natural partition of their edge set into cliques\nof the same order such that each vertex is contained in the same number of\ncliques. In this paper, we study the mixing rate of certain random walks on\nsuch graphs and we generalize previous results of Alon, Benjamini, Lubetzky and\nSodin regarding the mixing rates of non-backtracking random walks on regular\ngraphs.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jun 2015 22:20:22 GMT"}], "update_date": "2015-06-05", "authors_parsed": [["Cioabă", "Sebastian M.", ""], ["Xu", "Peng", ""]]}, {"id": "1506.01544", "submitter": "Jayanta Kumar Das", "authors": "Jayanta Kumar Das, Pabitra Pal Choudhury, Sudhakar Sahoo", "title": "Carry Value Transformation (CVT) - Exclusive OR (XOR) Tree and Its\n  Significant Properties", "comments": "Pages: 5, Figure: 9", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  CVT and XOR are two binary operations together used to calculate the sum of\ntwo non-negative integers on using a recursive mechanism. In this present study\nthe convergence behaviors of this recursive mechanism has been captured through\na tree like structure named as CVT-XOR Tree. We have analyzed how to identify\nthe parent nodes, leaf nodes and internal nodes in the CVT-XOR Tree. We also\nprovide the parent information, depth information and the number of children of\na node in different CVT-XOR Trees on defining three different matrices. Lastly,\none observation is made towards very old Mathematical problem of Goldbach\nConjecture.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2015 11:01:17 GMT"}], "update_date": "2015-06-05", "authors_parsed": [["Das", "Jayanta Kumar", ""], ["Choudhury", "Pabitra Pal", ""], ["Sahoo", "Sudhakar", ""]]}, {"id": "1506.02047", "submitter": "Abhishek Bhowmick", "authors": "Abhishek Bhowmick, Shachar Lovett", "title": "Bias vs structure of polynomials in large fields, and applications in\n  effective algebraic geometry and coding theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $f$ be a polynomial of degree $d$ in $n$ variables over a finite field\n$\\mathbb{F}$. The polynomial is said to be unbiased if the distribution of\n$f(x)$ for a uniform input $x \\in \\mathbb{F}^n$ is close to the uniform\ndistribution over $\\mathbb{F}$, and is called biased otherwise. The polynomial\nis said to have low rank if it can be expressed as a composition of a few lower\ndegree polynomials. Green and Tao [Contrib. Discrete Math 2009] and Kaufman and\nLovett [FOCS 2008] showed that bias implies low rank for fixed degree\npolynomials over fixed prime fields. This lies at the heart of many tools in\nhigher order Fourier analysis. In this work, we extend this result to all prime\nfields (of size possibly growing with $n$). We also provide a generalization to\nnonprime fields in the large characteristic case. However, we state all our\napplications in the prime field setting for the sake of simplicity of\npresentation.\n  As an immediate application, we obtain improved bounds for a suite of\nproblems in effective algebraic geometry, including Hilbert nullstellensatz,\nradical membership and counting rational points in low degree varieties.\n  Using the above generalization to large fields as a starting point, we are\nalso able to settle the list decoding radius of fixed degree Reed-Muller codes\nover growing fields. The case of fixed size fields was solved by Bhowmick and\nLovett [STOC 2015], which resolved a conjecture of Gopalan-Klivans-Zuckerman\n[STOC 2008]. Here, we show that the list decoding radius is equal the minimum\ndistance of the code for all fixed degrees, even when the field size is\npossibly growing with $n$.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2015 20:03:28 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Bhowmick", "Abhishek", ""], ["Lovett", "Shachar", ""]]}, {"id": "1506.02367", "submitter": "Pierre Lescanne", "authors": "Maciej Bendkowski (TCS), Katarzyna Grygiel (TCS), Pierre Lescanne\n  (TCS, LIP), Marek Zaionc (TCS)", "title": "A natural counting of lambda terms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.DM cs.PL math.CO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the sequences of numbers corresponding to lambda terms of given\nsizes, where the size is this of lambda terms with de Bruijn indices in a very\nnatural model where all the operators have size 1. For plain lambda terms, the\nsequence corresponds to two families of binary trees for which we exhibit\nbijections. We study also the distribution of normal forms, head normal forms\nand strongly normalizing terms. In particular we show that strongly normalizing\nterms are of density 0 among plain terms.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2015 06:57:41 GMT"}, {"version": "v2", "created": "Thu, 2 Jul 2015 08:19:29 GMT"}, {"version": "v3", "created": "Tue, 17 May 2016 08:30:30 GMT"}], "update_date": "2016-05-18", "authors_parsed": [["Bendkowski", "Maciej", "", "TCS"], ["Grygiel", "Katarzyna", "", "TCS"], ["Lescanne", "Pierre", "", "TCS, LIP"], ["Zaionc", "Marek", "", "TCS"]]}, {"id": "1506.02442", "submitter": "Irena Rusu Ph.D.", "authors": "Irena Rusu", "title": "NP-hardness of sortedness constraints", "comments": "15 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.AI cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Constraint Programming, global constraints allow to model and solve many\ncombinatorial problems. Among these constraints, several sortedness constraints\nhave been defined, for which propagation algorithms are available, but for\nwhich the tractability is not settled. We show that the sort(U,V) constraint\n(Older et. al, 1995) is intractable for integer variables whose domains are not\nlimited to intervals. As a consequence, the similar result holds for the\nsort(U,V, P) constraint (Zhou, 1996). Moreover, the intractability holds even\nunder the stability condition present in the recently introduced\nkeysorting(U,V,Keys,P) constraint (Carlsson et al., 2014), and requiring that\nthe order of the variables with the same value in the list U be preserved in\nthe list V. Therefore, keysorting(U,V,Keys,P) is intractable as well.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2015 11:24:06 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Rusu", "Irena", ""]]}, {"id": "1506.02678", "submitter": "Alexander Evako V", "authors": "Alexander V. Evako", "title": "Topology-preserving digitization of n-dimensional objects by\n  constructing cubical models", "comments": "9 pages, 8 figures. arXiv admin note: text overlap with\n  arXiv:1503.03491", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new cubical space model for the representation of\ncontinuous objects and surfaces in the n-dimensional Euclidean space by\ndiscrete sets of points. The cubical space model concerns the process of\nconverting a continuous object in its digital counterpart, which is a graph,\nenabling us to apply notions and operations used in digital imaging to cubical\nspaces. We formulate a definition of a simple n-cube and prove that deleting or\nattaching a simple n-cube does not change the homotopy type of a cubical space.\nRelying on these results, we design a procedure, which preserves basic\ntopological properties of an n-dimensional object, for constructing compressed\ncubical and digital models.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2015 20:10:55 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Evako", "Alexander V.", ""]]}, {"id": "1506.02797", "submitter": "Gabriele Fici", "authors": "Gabriele Fici, Alessio Langiu, Thierry Lecroq, Arnaud Lefebvre,\n  Filippo Mignosi, Jarkko Peltom\\\"aki, \\'Elise Prieur-Gaston", "title": "Abelian Powers and Repetitions in Sturmian Words", "comments": "To appear in Theoretical Computer Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.FL math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Richomme, Saari and Zamboni (J. Lond. Math. Soc. 83: 79-95, 2011) proved that\nat every position of a Sturmian word starts an abelian power of exponent $k$\nfor every $k > 0$. We improve on this result by studying the maximum exponents\nof abelian powers and abelian repetitions (an abelian repetition is an analogue\nof a fractional power) in Sturmian words. We give a formula for computing the\nmaximum exponent of an abelian power of abelian period $m$ starting at a given\nposition in any Sturmian word of rotation angle $\\alpha$. vAs an analogue of\nthe critical exponent, we introduce the abelian critical exponent $A(s_\\alpha)$\nof a Sturmian word $s_\\alpha$ of angle $\\alpha$ as the quantity $A(s_\\alpha) =\nlimsup\\ k_{m}/m=limsup\\ k'_{m}/m$, where $k_{m}$ (resp. $k'_{m}$) denotes the\nmaximum exponent of an abelian power (resp.~of an abelian repetition) of\nabelian period $m$ (the superior limits coincide for Sturmian words). We show\nthat $A(s_\\alpha)$ equals the Lagrange constant of the number $\\alpha$. This\nyields a formula for computing $A(s_\\alpha)$ in terms of the partial quotients\nof the continued fraction expansion of $\\alpha$. Using this formula, we prove\nthat $A(s_\\alpha) \\geq \\sqrt{5}$ and that the equality holds for the Fibonacci\nword. We further prove that $A(s_\\alpha)$ is finite if and only if $\\alpha$ has\nbounded partial quotients, that is, if and only if $s_{\\alpha}$ is\n$\\beta$-power-free for some real number $\\beta$. Concerning the infinite\nFibonacci word, we prove that: i) The longest prefix that is an abelian\nrepetition of period $F_j$, $j>1$, has length $F_j( F_{j+1}+F_{j-1} +1)-2$ if\n$j$ is even or $F_j( F_{j+1}+F_{j-1} )-2$ if $j$ is odd, where $F_{j}$ is the\n$j$th Fibonacci number; ii) The minimum abelian period of any factor is a\nFibonacci number. Further, we derive a formula for the minimum abelian periods\nof the finite Fibonacci words\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2015 06:44:57 GMT"}, {"version": "v2", "created": "Tue, 1 Sep 2015 15:30:31 GMT"}, {"version": "v3", "created": "Tue, 12 Jan 2016 08:07:46 GMT"}, {"version": "v4", "created": "Mon, 18 Apr 2016 13:31:50 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Fici", "Gabriele", ""], ["Langiu", "Alessio", ""], ["Lecroq", "Thierry", ""], ["Lefebvre", "Arnaud", ""], ["Mignosi", "Filippo", ""], ["Peltomäki", "Jarkko", ""], ["Prieur-Gaston", "Élise", ""]]}, {"id": "1506.02820", "submitter": "Alexander Zeh", "authors": "Alexander Zeh, Markus Ulmschneider", "title": "Decoding of Repeated-Root Cyclic Codes up to New Bounds on Their Minimum\n  Distance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.DM math.CO math.IT math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The well-known approach of Bose, Ray-Chaudhuri and Hocquenghem and its\ngeneralization by Hartmann and Tzeng are lower bounds on the minimum distance\nof simple-root cyclic codes. We generalize these two bounds to the case of\nrepeated-root cyclic codes and present a syndrome-based burst error decoding\nalgorithm with guaranteed decoding radius based on an associated folded cyclic\ncode. Furthermore, we present a third technique for bounding the minimum\nHamming distance based on the embedding of a given repeated-root cyclic code\ninto a repeated-root cyclic product code. A second quadratic-time probabilistic\nburst error decoding procedure based on the third bound is outlined. Index\nTerms Bound on the minimum distance, burst error, efficient decoding, folded\ncode, repeated-root cyclic code, repeated-root cyclic product code\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2015 08:27:08 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Zeh", "Alexander", ""], ["Ulmschneider", "Markus", ""]]}, {"id": "1506.03562", "submitter": "Gabriele Fici", "authors": "Gabriele Fici and Filippo Mignosi", "title": "Words with the Maximum Number of Abelian Squares", "comments": "To appear in the proceedings of WORDS 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An abelian square is the concatenation of two words that are anagrams of one\nanother. A word of length $n$ can contain $\\Theta(n^2)$ distinct factors that\nare abelian squares. We study infinite words such that the number of abelian\nsquare factors of length $n$ grows quadratically with $n$.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 06:42:19 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Fici", "Gabriele", ""], ["Mignosi", "Filippo", ""]]}, {"id": "1506.03613", "submitter": "Athanasios Kehagias", "authors": "Georgios Konstantinidis and Athanasios Kehagias", "title": "Simultaneously Moving Cops and Robbers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the concurrent cops and robber (CCCR) game. CCCR\nfollows the same rules as the classical, turn-based game, except for the fact\nthat the players move simultaneously. The cops' goal is to capture the robber\nand the concurrent cop number of a graph is defined the minimum number of cops\nwhich guarantees capture. For the variant in which it it required to capture\nthe robber in the shortest possible time, we let time to capture be the payoff\nfunction of CCCR; the (game theoretic) value of CCCR is the optimal capture\ntime and (cop and robber) time optimal strategies are the ones which achieve\nthe value. In this paper we prove the following.\n  (1) For every graph G, the concurrent cop number is equal to the \"classical\"\ncop number.\n  (2) For every graph G, CCCR has a value, the cops have an optimal strategy\nand, for every epsilon>0, the robber has an epsilon-optimal strategy.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 10:26:10 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Konstantinidis", "Georgios", ""], ["Kehagias", "Athanasios", ""]]}, {"id": "1506.03647", "submitter": "Jan Goedgebeur", "authors": "Jan Goedgebeur, Oliver Schaudt", "title": "Exhaustive generation of $k$-critical $\\mathcal H$-free graphs", "comments": "17 pages, improved girth results. arXiv admin note: text overlap with\n  arXiv:1504.06979", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe an algorithm for generating all $k$-critical $\\mathcal H$-free\ngraphs, based on a method of Ho\\`{a}ng et al. Using this algorithm, we prove\nthat there are only finitely many $4$-critical $(P_7,C_k)$-free graphs, for\nboth $k=4$ and $k=5$. We also show that there are only finitely many\n$4$-critical graphs $(P_8,C_4)$-free graphs. For each case of these cases we\nalso give the complete lists of critical graphs and vertex-critical graphs.\nThese results generalize previous work by Hell and Huang, and yield certifying\nalgorithms for the $3$-colorability problem in the respective classes.\n  Moreover, we prove that for every $t$, the class of 4-critical planar\n$P_t$-free graphs is finite. We also determine all 27 4-critical planar\n$(P_7,C_6)$-free graphs.\n  We also prove that every $P_{10}$-free graph of girth at least five is\n3-colorable, and determine the smallest 4-chromatic $P_{12}$-free graph of\ngirth five. Moreover, we show that every $P_{13}$-free graph of girth at least\nsix and every $P_{16}$-free graph of girth at least seven is 3-colorable. This\nstrengthens results of Golovach et al.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 12:29:14 GMT"}, {"version": "v2", "created": "Thu, 25 Jun 2015 09:54:30 GMT"}, {"version": "v3", "created": "Thu, 13 Aug 2015 09:00:17 GMT"}], "update_date": "2015-08-14", "authors_parsed": [["Goedgebeur", "Jan", ""], ["Schaudt", "Oliver", ""]]}, {"id": "1506.03724", "submitter": "Punarbasu Purkayastha", "authors": "Yeow Meng Chee, Han Mao Kiah, Punarbasu Purkayastha, Patrick Sol\\'e", "title": "Product Construction of Affine Codes", "comments": "13 pages, to appear in SIAM Journal on Discrete Mathematics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Binary matrix codes with restricted row and column weights are a desirable\nmethod of coded modulation for power line communication. In this work, we\nconstruct such matrix codes that are obtained as products of affine codes -\ncosets of binary linear codes. Additionally, the constructions have the\nproperty that they are systematic. Subsequently, we generalize our construction\nto irregular product of affine codes, where the component codes are affine\ncodes of different rates.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 16:04:20 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Chee", "Yeow Meng", ""], ["Kiah", "Han Mao", ""], ["Purkayastha", "Punarbasu", ""], ["Solé", "Patrick", ""]]}, {"id": "1506.03728", "submitter": "Tillmann Miltzow", "authors": "Udo Hoffmann and Linda Kleist and Tillmann Miltzow", "title": "Upper and Lower Bounds on Long Dual-Paths in Line Arrangements", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a line arrangement $\\cal A$ with $n$ lines, we show that there exists a\npath of length $n^2/3 - O(n)$ in the dual graph of $\\cal A$ formed by its\nfaces. This bound is tight up to lower order terms. For the bicolored version,\nwe describe an example of a line arrangement with $3k$ blue and $2k$ red lines\nwith no alternating path longer than $14k$. Further, we show that any line\narrangement with $n$ lines has a coloring such that it has an alternating path\nof length $\\Omega (n^2/ \\log n)$. Our results also hold for pseudoline\narrangements.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 16:09:05 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Hoffmann", "Udo", ""], ["Kleist", "Linda", ""], ["Miltzow", "Tillmann", ""]]}, {"id": "1506.03760", "submitter": "Rajesh Chitnis", "authors": "Rajesh Chitnis, Hossein Esfandiari, MohammadTaghi Hajiaghayi, Rohit\n  Khandekar, Guy Kortsarz, Saeed Seddighin", "title": "A Tight Algorithm for Strongly Connected Steiner Subgraph On Two\n  Terminals With Demands", "comments": "To appear in Algorithmica. An extended abstract appeared in IPEC '14", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given an edge-weighted directed graph $G=(V,E)$ on $n$ vertices and a set\n$T=\\{t_1, t_2, \\ldots, t_p\\}$ of $p$ terminals, the objective of the \\scss\n($p$-SCSS) problem is to find an edge set $H\\subseteq E$ of minimum weight such\nthat $G[H]$ contains an $t_{i}\\rightarrow t_j$ path for each $1\\leq i\\neq j\\leq\np$. In this paper, we investigate the computational complexity of a variant of\n$2$-SCSS where we have demands for the number of paths between each terminal\npair. Formally, the \\sharinggeneral problem is defined as follows: given an\nedge-weighted directed graph $G=(V,E)$ with weight function $\\omega:\nE\\rightarrow \\mathbb{R}^{\\geq 0}$, two terminal vertices $s, t$, and integers\n$k_1, k_2$ ; the objective is to find a set of $k_1$ paths $F_1, F_2, \\ldots,\nF_{k_1}$ from $s\\leadsto t$ and $k_2$ paths $B_1, B_2, \\ldots, B_{k_2}$ from\n$t\\leadsto s$ such that $\\sum_{e\\in E} \\omega(e)\\cdot \\phi(e)$ is minimized,\nwhere $\\phi(e)= \\max \\Big\\{|\\{i\\in [k_1] : e\\in F_i\\}|\\ ,\\ |\\{j\\in [k_2] : e\\in\nB_j\\}|\\Big\\}$. For each $k\\geq 1$, we show the following: The \\sharing problem\ncan be solved in $n^{O(k)}$ time. A matching lower bound for our algorithm: the\n\\sharing problem does not have an $f(k)\\cdot n^{o(k)}$ algorithm for any\ncomputable function $f$, unless the Exponential Time Hypothesis (ETH) fails.\n  Our algorithm for \\sharing relies on a structural result regarding an optimal\nsolution followed by using the idea of a \"token game\" similar to that of\nFeldman and Ruhl. We show with an example that the structural result does not\nhold for the \\sharinggeneral problem if $\\min\\{k_1, k_2\\}\\geq 2$. Therefore\n\\sharing is the most general problem one can attempt to solve with our\ntechniques.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 18:06:42 GMT"}, {"version": "v2", "created": "Wed, 6 Apr 2016 16:10:08 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Chitnis", "Rajesh", ""], ["Esfandiari", "Hossein", ""], ["Hajiaghayi", "MohammadTaghi", ""], ["Khandekar", "Rohit", ""], ["Kortsarz", "Guy", ""], ["Seddighin", "Saeed", ""]]}, {"id": "1506.03874", "submitter": "J.T. Geneson", "authors": "Jesse T. Geneson, Peter M. Tian", "title": "Extremal Functions of Forbidden Multidimensional Matrices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pattern avoidance is a central topic in graph theory and combinatorics.\nPattern avoidance in matrices has applications in computer science and\nengineering, such as robot motion planning and VLSI circuit design. A\n$d$-dimensional zero-one matrix $A$ avoids another $d$-dimensional zero-one\nmatrix $P$ if no submatrix of $A$ can be transformed to $P$ by changing some\nones to zeros. A fundamental problem is to study the maximum number of nonzero\nentries in a $d$-dimensional $n \\times \\cdots \\times n$ matrix that avoids $P$.\nThis maximum number, denoted by $f(n,P,d)$, is called the extremal function.\n  We advance the extremal theory of matrices in two directions. The methods\nthat we use come from combinatorics, probability, and analysis. Firstly, we\nobtain non-trivial lower and upper bounds on $f(n,P,d)$ when $n$ is large for\nevery $d$-dimensional block permutation matrix $P$. We establish the tight\nbound $\\Theta(n^{d-1})$ on $f(n,P,d)$ for every $d$-dimensional tuple\npermutation matrix $P$. This tight bound has the lowest possible order that an\nextremal function of a nontrivial matrix can ever achieve. Secondly, we show\nthat $f(n,P,d)$ is super-homogeneous for a class of matrices $P$. We use this\nsuper-homogeneity to show that the limit inferior of the sequence $\\{ {f(n,P,d)\n\\over n^{d-1}}\\}$ has a lower bound $2^{\\Omega(k^{1/ d})}$ for a family of $k\n\\times \\cdots \\times k$ permutation matrices $P$. We also improve the upper\nbound on the limit superior from $2^{O(k \\log k)}$ to $2^{O(k)}$ for all $k\n\\times \\cdots \\times k$ permutation matrices and show that the new upper bound\nalso holds for tuple permutation matrices.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2015 23:50:07 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Geneson", "Jesse T.", ""], ["Tian", "Peter M.", ""]]}, {"id": "1506.03935", "submitter": "Abolfazl Ramezanpour", "authors": "A. Ramezanpour and S. Moghimi-Araghi", "title": "Statistical physics of loopy interactions: Independent-loop\n  approximation and beyond", "comments": "21 pages, 6 figures, 2 appendices, typos corrected", "journal-ref": "Phys. Rev. E 92, 032112 (2015)", "doi": "10.1103/PhysRevE.92.032112", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an interacting system of spin variables on a loopy interaction\ngraph, identified by a tree graph and a set of loopy interactions. We start\nfrom a high-temperature expansion for loopy interactions represented by a sum\nof nonnegative contributions from all the possible frustration-free loop\nconfigurations. We then compute the loop corrections using different\napproximations for the nonlocal loop interactions induced by the spin\ncorrelations in the tree graph. For distant loopy interactions, we can exploit\nthe exponential decay of correlations in the tree interaction graph to compute\nloop corrections within an independent-loop approximation. Higher orders of the\napproximation are obtained by considering the correlations between the nearby\nloopy interactions involving larger number of spin variables. In particular,\nthe sum over the loop configurations can be computed \"exactly\" by the belief\npropagation algorithm in the low orders of the approximation as long as the\nloopy interactions have a tree structure. These results might be useful in\ndeveloping more accurate and convergent message-passing algorithms exploiting\nthe structure of loopy interactions.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 08:34:58 GMT"}, {"version": "v2", "created": "Wed, 16 Sep 2015 06:43:52 GMT"}], "update_date": "2015-09-23", "authors_parsed": [["Ramezanpour", "A.", ""], ["Moghimi-Araghi", "S.", ""]]}, {"id": "1506.04047", "submitter": "Seyed Rasoul Etesami", "authors": "Seyed Rasoul Etesami, Tamer Basar", "title": "Approximation Algorithm for the Binary-Preference Capacitated Selfish\n  Replication Game and a Tight Bound on its Price of Anarchy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.MA math.CO math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the capacitated selfish replication (CSR) game with binary\npreferences, over general undirected networks. We first show that such games\nhave an associated ordinary potential function, and hence always admit a\npure-strategy Nash equilibrium (NE). Further, when the minimum degree of the\nnetwork and the number of resources are of the same order, there exists an\nexact polynomial time algorithm which can find a NE. Following this, we study\nthe price of anarchy of such games, and show that it is bounded above by 3; we\nfurther provide some instances for which the price of anarchy is at least 2. We\ndevelop a quasi-polynomial algorithm O(n^2D^{ln n}), where n is the number of\nplayers and D is the diameter of the network, which can find, in a distributed\nmanner, an allocation profile that is within a constant factor of the optimal\nallocation, and hence of any pure-strategy NE of the game. Proof of this result\nuses a novel potential function.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2015 15:43:38 GMT"}, {"version": "v2", "created": "Fri, 11 Mar 2016 05:55:02 GMT"}], "update_date": "2016-03-14", "authors_parsed": [["Etesami", "Seyed Rasoul", ""], ["Basar", "Tamer", ""]]}, {"id": "1506.04380", "submitter": "David Wood", "authors": "Vida Dujmovi\\'c and David Eppstein and David R. Wood", "title": "Structure of Graphs with Locally Restricted Crossings", "comments": null, "journal-ref": "SIAM J. Discrete Math. 31.2:805-824, 2017", "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider relations between the size, treewidth, and local crossing number\n(maximum number of crossings per edge) of graphs embedded on topological\nsurfaces. We show that an $n$-vertex graph embedded on a surface of genus $g$\nwith at most $k$ crossings per edge has treewidth $O(\\sqrt{(g+1)(k+1)n})$ and\nlayered treewidth $O((g+1)k)$, and that these bounds are tight up to a constant\nfactor. As a special case, the $k$-planar graphs with $n$ vertices have\ntreewidth $O(\\sqrt{(k+1)n})$ and layered treewidth $O(k+1)$, which are tight\nbounds that improve a previously known $O((k+1)^{3/4}n^{1/2})$ treewidth bound.\nAnalogous results are proved for map graphs defined with respect to any\nsurface. Finally, we show that for $g<m$, every $m$-edge graph can be embedded\non a surface of genus~$g$ with $O((m/(g+1))\\log^2 g)$ crossings per edge, which\nis tight to a polylogarithmic factor.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jun 2015 11:17:47 GMT"}, {"version": "v2", "created": "Sat, 20 Feb 2016 01:34:01 GMT"}], "update_date": "2017-07-18", "authors_parsed": [["Dujmović", "Vida", ""], ["Eppstein", "David", ""], ["Wood", "David R.", ""]]}, {"id": "1506.04423", "submitter": "Bartosz Walczak", "authors": "Kolja Knauer, Bartosz Walczak", "title": "Graph drawings with one bend and few slopes", "comments": "minor revision. arXiv admin note: text overlap with arXiv:1205.2548", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider drawings of graphs in the plane in which edges are represented by\npolygonal paths with at most one bend and the number of different slopes used\nby all segments of these paths is small. We prove that\n$\\lceil\\frac{\\Delta}{2}\\rceil$ edge slopes suffice for outerplanar drawings of\nouterplanar graphs with maximum degree $\\Delta\\geq 3$. This matches the obvious\nlower bound. We also show that $\\lceil\\frac{\\Delta}{2}\\rceil+1$ edge slopes\nsuffice for drawings of general graphs, improving on the previous bound of\n$\\Delta+1$. Furthermore, we improve previous upper bounds on the number of\nslopes needed for planar drawings of planar and bipartite planar graphs.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jun 2015 17:04:54 GMT"}, {"version": "v2", "created": "Sun, 27 Sep 2015 21:25:27 GMT"}], "update_date": "2015-09-29", "authors_parsed": [["Knauer", "Kolja", ""], ["Walczak", "Bartosz", ""]]}, {"id": "1506.04428", "submitter": "Gil Cohen", "authors": "Gil Cohen", "title": "Two-Source Dispersers for Polylogarithmic Entropy and Improved Ramsey\n  Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In his 1947 paper that inaugurated the probabilistic method, Erd\\H{o}s proved\nthe existence of $2\\log{n}$-Ramsey graphs on $n$ vertices. Matching Erd\\H{o}s'\nresult with a constructive proof is a central problem in combinatorics, that\nhas gained a significant attention in the literature. The state of the art\nresult was obtained in the celebrated paper by Barak, Rao, Shaltiel and\nWigderson [Ann. Math'12], who constructed a\n$2^{2^{(\\log\\log{n})^{1-\\alpha}}}$-Ramsey graph, for some small universal\nconstant $\\alpha > 0$.\n  In this work, we significantly improve the result of Barak~\\etal and\nconstruct $2^{(\\log\\log{n})^c}$-Ramsey graphs, for some universal constant $c$.\nIn the language of theoretical computer science, our work resolves the problem\nof explicitly constructing two-source dispersers for polylogarithmic entropy.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jun 2015 18:56:28 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Cohen", "Gil", ""]]}, {"id": "1506.04485", "submitter": "Anna Mikhailovich", "authors": "V.V. Kochergin (Lomonosov Moscow State University, Faculty of\n  Mechanics and Mathematics, Bogoliubov Institute for Theoretical Problems of\n  Microphysics), A.V. Mikhailovich (National Research University Higher School\n  of Economics)", "title": "Some Extensions of the Inversion Complexity of Boolean Functions", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The minimum number of NOT gates in a Boolean circuit computing a Boolean\nfunction is called the inversion complexity of the function. In 1957, A. A.\nMarkov determined the inversion complexity of every Boolean function and proved\nthat $\\lceil\\log_{2}(d(f)+1)\\rceil$ NOT gates are necessary and sufficient to\ncompute any Boolean function $f$ (where $d(f)$ is maximum number of value\nchanges from 1 to 0 over all increasing chains of tuples of variables values).\nIn this paper we consider Boolean circuits over an arbitrary basis that\nconsists of all monotone functions (with zero weight) and finite nonempty set\nof non-monotone functions (with unit weight). It is shown that the minimal\nsufficient for a realization of the Boolean function $f$ number of non-monotone\ngates is equal to $\\lceil\\log_{2}(d(f)+1)\\rceil - O(1)$. Similar extends of\nanother classical result of A. A. Markov for the inversion complexity of system\nof Boolean functions has been obtained.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 06:04:24 GMT"}, {"version": "v2", "created": "Thu, 18 Jun 2015 00:08:32 GMT"}, {"version": "v3", "created": "Mon, 31 Aug 2015 12:36:21 GMT"}], "update_date": "2015-09-01", "authors_parsed": [["Kochergin", "V. V.", "", "Lomonosov Moscow State University, Faculty of\n  Mechanics and Mathematics, Bogoliubov Institute for Theoretical Problems of\n  Microphysics"], ["Mikhailovich", "A. V.", "", "National Research University Higher School\n  of Economics"]]}, {"id": "1506.04558", "submitter": "Uli Wagner", "authors": "Dominic Dotterrer, Tali Kaufman, Uli Wagner", "title": "On Expansion and Topological Overlap", "comments": "Minor revision, updated references", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a detailed and easily accessible proof of Gromov's Topological\nOverlap Theorem. Let $X$ be a finite simplicial complex or, more generally, a\nfinite polyhedral cell complex of dimension $d$. Informally, the theorem states\nthat if $X$ has sufficiently strong higher-dimensional expansion properties\n(which generalize edge expansion of graphs and are defined in terms of cellular\ncochains of $X$) then $X$ has the following topological overlap property: for\nevery continuous map $X\\rightarrow \\mathbf{R}^d$ there exists a point $p\\in\n\\mathbf{R}^d$ that is contained in the images of a positive fraction $\\mu>0$ of\nthe $d$-cells of $X$. More generally, the conclusion holds if $\\mathbf{R}^d$ is\nreplaced by any $d$-dimensional piecewise-linear (PL) manifold $M$, with a\nconstant $\\mu$ that depends only on $d$ and on the expansion properties of $X$,\nbut not on $M$.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 11:39:57 GMT"}, {"version": "v2", "created": "Sat, 17 Sep 2016 19:38:52 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Dotterrer", "Dominic", ""], ["Kaufman", "Tali", ""], ["Wagner", "Uli", ""]]}, {"id": "1506.04631", "submitter": "Ivan Yu. Tyukin", "authors": "Alexander N. Gorban, Ivan Yu. Tyukin, Danil V. Prokhorov, Konstantin\n  I. Sofeikov", "title": "Approximation with Random Bases: Pro et Contra", "comments": "arXiv admin note: text overlap with arXiv:0905.0677", "journal-ref": "Information Sciences 364-365, 10 October 2016, Pages 129-145", "doi": "10.1016/j.ins.2015.09.021", "report-no": null, "categories": "cs.NA cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we discuss the problem of selecting suitable approximators from\nfamilies of parameterized elementary functions that are known to be dense in a\nHilbert space of functions. We consider and analyze published procedures, both\nrandomized and deterministic, for selecting elements from these families that\nhave been shown to ensure the rate of convergence in $L_2$ norm of order\n$O(1/N)$, where $N$ is the number of elements. We show that both randomized and\ndeterministic procedures are successful if additional information about the\nfamilies of functions to be approximated is provided. In the absence of such\nadditional information one may observe exponential growth of the number of\nterms needed to approximate the function and/or extreme sensitivity of the\noutcome of the approximation to parameters. Implications of our analysis for\napplications of neural networks in modeling and control are illustrated with\nexamples.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 15:22:06 GMT"}, {"version": "v2", "created": "Wed, 17 Jun 2015 07:59:25 GMT"}, {"version": "v3", "created": "Tue, 15 Sep 2015 11:57:54 GMT"}, {"version": "v4", "created": "Thu, 17 Sep 2015 15:18:28 GMT"}, {"version": "v5", "created": "Sat, 24 Oct 2015 16:07:26 GMT"}], "update_date": "2016-09-01", "authors_parsed": [["Gorban", "Alexander N.", ""], ["Tyukin", "Ivan Yu.", ""], ["Prokhorov", "Danil V.", ""], ["Sofeikov", "Konstantin I.", ""]]}, {"id": "1506.04642", "submitter": "Krasimir Yordzhev", "authors": "Krasimir Yordzhev", "title": "Semi-canonical binary matrices", "comments": "Sixth International Scientific Conference - FMNS2015, South-West\n  University, Blagoevgrad, Bulgaria, 113 - 124", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we define the concepts of semi-canonical and canonical binary\nmatrix. Strictly mathematical, we prove the correctness of these definitions.\nWe describe and we implement an algorithm for finding all semi-canonical binary\nmatrices taking into account the number of 1 in each of them. This problem\nrelates to the combinatorial problem of finding all pairs of disjoint\nS-permutation matrices. In the described algorithm, the bit-wise operations are\nsubstantially used.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 15:54:56 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Yordzhev", "Krasimir", ""]]}, {"id": "1506.05018", "submitter": "Aleksey Buzmakov", "authors": "Aleksey Buzmakov and Sergei O. Kuznetsov and Amedeo Napoli", "title": "Revisiting Pattern Structure Projections", "comments": "16 pages, 4 figures, ICFCA-2015 conference", "journal-ref": "Formal Concept Analysis. Springer International Publishing, 2015.\n  200-215", "doi": "10.1007/978-3-319-19545-2_13", "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Formal concept analysis (FCA) is a well-founded method for data analysis and\nhas many applications in data mining. Pattern structures is an extension of FCA\nfor dealing with complex data such as sequences or graphs. However the\ncomputational complexity of computing with pattern structures is high and\nprojections of pattern structures were introduced for simplifying computation.\nIn this paper we introduce o-projections of pattern structures, a\ngeneralization of projections which defines a wider class of projections\npreserving the properties of the original approach. Moreover, we show that\no-projections form a semilattice and we discuss the correspondence between\no-projections and the representation contexts of o-projected pattern\nstructures.\n  KEYWORDS: formal concept analysis, pattern structures, representation\ncontexts, projections\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2015 16:13:43 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Buzmakov", "Aleksey", ""], ["Kuznetsov", "Sergei O.", ""], ["Napoli", "Amedeo", ""]]}, {"id": "1506.05064", "submitter": "Pavel Klav\\'ik", "authors": "Pavel Klav\\'ik, Peter Zeman", "title": "Automorphism Groups of Comparability Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Comparability graphs are graphs which have transitive orientations. The\ndimension of a poset is the least number of linear orders whose intersection\ngives this poset. The dimension ${\\rm dim}(X)$ of a comparability graph $X$ is\nthe dimension of any transitive orientation of X, and by $k$-DIM we denote the\nclass of comparability graphs $X$ with ${\\rm dim}(X) \\le k$. It is known that\nthe complements of comparability graphs are exactly function graphs and\npermutation graphs equal 2-DIM.\n  In this paper, we characterize the automorphism groups of permutation graphs\nsimilarly to Jordan's characterization for trees (1869). For permutation\ngraphs, there is an extra operation, so there are some extra groups not\nrealized by trees. For $k \\ge 4$, we show that every finite group can be\nrealized as the automorphism group of some graph in $k$-DIM, and testing graph\nisomorphism for $k$-DIM is GI-complete.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2015 18:40:42 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Klavík", "Pavel", ""], ["Zeman", "Peter", ""]]}, {"id": "1506.05279", "submitter": "Tomasz Gogacz", "authors": "Wojciech Czerwinski, Tomasz Gogacz, Eryk Kopczynski", "title": "Non-dominating sequences of vectors using only resets and increments", "comments": null, "journal-ref": null, "doi": "10.3233/FI-2015-1247", "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a variant of Dickson lemma, where each entry of a vector can be\nreseted or incremented by 1 in respect to the previous one. We give an example\nof non dominating sequence of length $2^{2^{\\theta (n)}}$. It perfectly match\nthe previously known upperbound.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2015 11:21:35 GMT"}, {"version": "v2", "created": "Mon, 3 Aug 2015 12:07:24 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Czerwinski", "Wojciech", ""], ["Gogacz", "Tomasz", ""], ["Kopczynski", "Eryk", ""]]}, {"id": "1506.05620", "submitter": "Ren\\'e van Bevern", "authors": "Ren\\'e van Bevern and Christian Komusiewicz and Manuel Sorge", "title": "A parameterized approximation algorithm for the mixed and windy\n  Capacitated Arc Routing Problem: theory and experiments", "comments": "A preliminary version of this article appeared in the Proceedings of\n  the 15th Workshop on Algorithmic Approaches for Transportation Modeling,\n  Optimization, and Systems (ATMOS'15). This version describes several\n  algorithmic enhancements, contains an experimental evaluation of our\n  algorithm, and provides a new benchmark data set", "journal-ref": "Networks 70(3):262-278, 2017", "doi": "10.1002/net.21742", "report-no": null, "categories": "cs.DS cs.DM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that any polynomial-time $\\alpha(n)$-approximation algorithm for the\n$n$-vertex metric asymmetric Traveling Salesperson Problem yields a\npolynomial-time $O(\\alpha(C))$-approximation algorithm for the mixed and windy\nCapacitated Arc Routing Problem, where $C$ is the number of weakly connected\ncomponents in the subgraph induced by the positive-demand arcs---a small number\nin many applications. In conjunction with known results, we obtain\nconstant-factor approximations for $C\\in O(\\log n)$ and $O(\\log C/\\log\\log\nC)$-approximations in general. Experiments show that our algorithm, together\nwith several heuristic enhancements, outperforms many previous polynomial-time\nheuristics. Finally, since the solution quality achievable in polynomial time\nappears to mainly depend on $C$ and since $C=1$ in almost all benchmark\ninstances, we propose the Ob benchmark set, simulating cities that are divided\ninto several components by a river.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2015 10:47:28 GMT"}, {"version": "v2", "created": "Sun, 16 Oct 2016 03:50:46 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["van Bevern", "René", ""], ["Komusiewicz", "Christian", ""], ["Sorge", "Manuel", ""]]}, {"id": "1506.05673", "submitter": "Thomas Bl\\\"asius", "authors": "Thomas Bl\\\"asius and Ignaz Rutter", "title": "A New Perspective on Clustered Planarity as a Combinatorial Embedding\n  Problem", "comments": "17 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The clustered planarity problem (c-planarity) asks whether a hierarchically\nclustered graph admits a planar drawing such that the clusters can be nicely\nrepresented by regions. We introduce the cd-tree data structure and give a new\ncharacterization of c-planarity. It leads to efficient algorithms for\nc-planarity testing in the following cases. (i) Every cluster and every\nco-cluster (complement of a cluster) has at most two connected components. (ii)\nEvery cluster has at most five outgoing edges.\n  Moreover, the cd-tree reveals interesting connections between c-planarity and\nplanarity with constraints on the order of edges around vertices. On one hand,\nthis gives rise to a bunch of new open problems related to c-planarity, on the\nother hand it provides a new perspective on previous results.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2015 13:35:28 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Bläsius", "Thomas", ""], ["Rutter", "Ignaz", ""]]}, {"id": "1506.05715", "submitter": "Thomas Bl\\\"asius", "authors": "Thomas Bl\\\"asius and Annette Karrer and Ignaz Rutter", "title": "Simultaneous Embedding: Edge Orderings, Relative Positions, Cutvertices", "comments": "64 pages, 20 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simultaneous embedding (with fixed edges) of two graphs $G^1$ and $G^2$\nwith common graph $G=G^1 \\cap G^2$ is a pair of planar drawings of $G^1$ and\n$G^2$ that coincide on $G$. It is an open question whether there is a\npolynomial-time algorithm that decides whether two graphs admit a simultaneous\nembedding (problem SEFE).\n  In this paper, we present two results. First, a set of three linear-time\npreprocessing algorithms that remove certain substructures from a given SEFE\ninstance, producing a set of equivalent SEFE instances without such\nsubstructures. The structures we can remove are (1) cutvertices of the union\ngraph $G^\\cup = G^1 \\cup G^2$, (2) most separating pairs of $G^\\cup$, and (3)\nconnected components of $G$ that are biconnected but not a cycle.\n  Second, we give an $O(n^3)$-time algorithm solving SEFE for instances with\nthe following restriction. Let $u$ be a pole of a P-node $\\mu$ in the SPQR-tree\nof a block of $G^1$ or $G^2$. Then at most three virtual edges of $\\mu$ may\ncontain common edges incident to $u$. All algorithms extend to the sunflower\ncase, i.e., to the case of more than three graphs pairwise intersecting in the\nsame common graph.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2015 15:20:22 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Bläsius", "Thomas", ""], ["Karrer", "Annette", ""], ["Rutter", "Ignaz", ""]]}, {"id": "1506.05719", "submitter": "Ang\\`ele Hamel", "authors": "Dallas J. Fraser, Ang\\`ele M. Hamel, Ch\\'inh T. Ho\\`ang", "title": "A Coloring Algorithm for $4K_1$-free line graphs", "comments": "15 pages; updated a definition", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $L$ be a set of graphs. $Free$($L$) is the set of graphs that do not\ncontain any graph in $L$ as an induced subgraph. It is known that if $L$ is a\nset of four-vertex graphs, then the complexity of the coloring problem for\n$Free$($L$) is known with three exceptions: $L $= {claw, $4K_1$}, $L$ = {claw,\n$4K_1$, co-diamond}, and $L$ = {$C_4$, $4K_1$}. In this paper, we study the\ncoloring problem for $Free$(claw, $4K_1$). We solve the coloring problem for a\nsubclass of $Free$(claw, $4K_1$) which contains the class of $4K_1$-free line\ngraphs. Our result implies the chromatic index of a graph with no matching of\nsize four can be computed in polynomial time.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2015 15:30:48 GMT"}, {"version": "v2", "created": "Wed, 24 Jun 2015 20:12:00 GMT"}], "update_date": "2015-06-26", "authors_parsed": [["Fraser", "Dallas J.", ""], ["Hamel", "Angèle M.", ""], ["Hoàng", "Chính T.", ""]]}, {"id": "1506.05721", "submitter": "Kevin Schewior", "authors": "Lin Chen, Nicole Megow, Kevin Schewior", "title": "An O(m^2 log m)-Competitive Algorithm for Online Machine Minimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the online machine minimization problem in which jobs with hard\ndeadlines arrive online over time at their release dates. The task is to\ndetermine a feasible schedule on a minimum number of machines. Our main result\nis a general O(m^2 log m)-competitive algorithm for the preemptive online\nproblem, where m is the optimal number of machines used in an offline solution.\nThis is the first improvement on an O(log (p_max/p_min))-competitive algorithm\nby Phillips et al. (STOC 1997), which was to date the best known algorithm even\nwhen m=2. Our algorithm is O(1)-competitive for any m that is bounded by a\nconstant. To develop the algorithm, we investigate two complementary special\ncases of the problem, namely, laminar instances and agreeable instances, for\nwhich we provide an O(log m)-competitive and an O(1)-competitive algorithm,\nrespectively. Our O(1)-competitive algorithm for agreeable instances actually\nproduces a non-preemptive schedule, which is of its own interest as there\nexists a strong lower bound of n, the number of jobs, for the general\nnon-preemptive online machine minimization problem by Saha (FSTTCS 2013), which\neven holds for laminar instances.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2015 15:39:00 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Chen", "Lin", ""], ["Megow", "Nicole", ""], ["Schewior", "Kevin", ""]]}, {"id": "1506.05981", "submitter": "Jo\\~ao Ferreira", "authors": "Roland Backhouse and Jo\\~ao F. Ferreira", "title": "On Euclid's Algorithm and Elementary Number Theory", "comments": null, "journal-ref": "Sci. Comput. Program. 76 (3) (2011) 160-180", "doi": "10.1016/j.scico.2010.05.006", "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Algorithms can be used to prove and to discover new theorems. This paper\nshows how algorithmic skills in general, and the notion of invariance in\nparticular, can be used to derive many results from Euclid's algorithm. We\nillustrate how to use the algorithm as a verification interface (i.e., how to\nverify theorems) and as a construction interface (i.e., how to investigate and\nderive new theorems).\n  The theorems that we verify are well-known and most of them are included in\nstandard number theory books. The new results concern distributivity properties\nof the greatest common divisor and a new algorithm for efficiently enumerating\nthe positive rationals in two different ways. One way is known and is due to\nMoshe Newman. The second is new and corresponds to a deforestation of the\nStern-Brocot tree of rationals. We show that both enumerations stem from the\nsame simple algorithm. In this way, we construct a Stern-Brocot enumeration\nalgorithm with the same time and space complexity as Newman's algorithm. A\nshort review of the original papers by Stern and Brocot is also included.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 12:54:41 GMT"}], "update_date": "2015-06-22", "authors_parsed": [["Backhouse", "Roland", ""], ["Ferreira", "João F.", ""]]}, {"id": "1506.06157", "submitter": "Gregory Puleo", "authors": "Gregory J. Puleo", "title": "Complexity of a Disjoint Matching Problem on Bipartite Graphs", "comments": "6 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the following question: given an $(X,Y)$-bigraph $G$ and a set $S\n\\subset X$, does $G$ contain two disjoint matchings $M_1$ and $M_2$ such that\n$M_1$ saturates $X$ and $M_2$ saturates $S$? When $|S|\\geq |X|-1$, this\nquestion is solvable by finding an appropriate factor of the graph. In\ncontrast, we show that when $S$ is allowed to be an arbitrary subset of $X$,\nthe problem is NP-hard.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2015 21:04:31 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Puleo", "Gregory J.", ""]]}, {"id": "1506.06325", "submitter": "Amit Levi", "authors": "Saleet Klein, Amit Levi, Muli Safra, Clara Shikhelman, Yinon Spinka", "title": "On the Converse of Talagrand's Influence Inequality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 1994, Talagrand showed a generalization of the celebrated KKL theorem. In\nthis work, we prove that the converse of this generalization also holds.\nNamely, for any sequence of numbers $0<a_1,a_2,\\ldots,a_n\\le 1$ such that\n$\\sum_{j=1}^n a_j/(1-\\log a_j)\\ge C$ for some constant $C>0$, it is possible to\nfind a roughly balanced Boolean function $f$ such that $\\textrm{Inf}_j[f] <\na_j$ for every $1 \\le j \\le n$.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jun 2015 07:15:03 GMT"}, {"version": "v2", "created": "Tue, 23 Jun 2015 15:46:58 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Klein", "Saleet", ""], ["Levi", "Amit", ""], ["Safra", "Muli", ""], ["Shikhelman", "Clara", ""], ["Spinka", "Yinon", ""]]}, {"id": "1506.06369", "submitter": "Robert Luko\\v{t}ka", "authors": "Barbora Candr\\'akov\\'a, Robert Luko\\v{t}ka", "title": "Cubic TSP - a 1.3-approximation", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that every simple bridgeless cubic graph with n >= 8 vertices has a\ntravelling salesman tour of length at most 1.3n - 2, which can be constructed\nin polynomial time.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jun 2015 14:15:57 GMT"}, {"version": "v2", "created": "Wed, 12 Oct 2016 16:37:28 GMT"}], "update_date": "2016-10-13", "authors_parsed": [["Candráková", "Barbora", ""], ["Lukoťka", "Robert", ""]]}, {"id": "1506.06394", "submitter": "J\\\"urgen Koslowski", "authors": "Elie M. Adam, Munther A. Dahleh and Asuman Ozdaglar", "title": "Towards an Algebra for Cascade Effects", "comments": "31 pages", "journal-ref": "Logical Methods in Computer Science, Volume 13, Issue 3 (July 6,\n  2017) lmcs:3770", "doi": "10.23638/LMCS-13(3:1)2017", "report-no": null, "categories": "cs.DM cs.LO cs.SI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new class of (dynamical) systems that inherently capture\ncascading effects (viewed as consequential effects) and are naturally amenable\nto combinations. We develop an axiomatic general theory around those systems,\nand guide the endeavor towards an understanding of cascading failure. The\ntheory evolves as an interplay of lattices and fixed points, and its results\nmay be instantiated to commonly studied models of cascade effects.\n  We characterize the systems through their fixed points, and equip them with\ntwo operators. We uncover properties of the operators, and express global\nsystems through combinations of local systems. We enhance the theory with a\nnotion of failure, and understand the class of shocks inducing a system to\nfailure. We develop a notion of mu-rank to capture the energy of a system, and\nunderstand the minimal amount of effort required to fail a system, termed\nresilience. We deduce a dual notion of fragility and show that the combination\nof systems sets a limit on the amount of fragility inherited.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jun 2015 17:36:15 GMT"}, {"version": "v2", "created": "Thu, 26 Jan 2017 16:48:34 GMT"}, {"version": "v3", "created": "Tue, 4 Jul 2017 17:23:02 GMT"}, {"version": "v4", "created": "Wed, 5 Jul 2017 09:31:26 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Adam", "Elie M.", ""], ["Dahleh", "Munther A.", ""], ["Ozdaglar", "Asuman", ""]]}, {"id": "1506.06440", "submitter": "Oliver Knill", "authors": "Oliver Knill", "title": "The Jordan-Brouwer theorem for graphs", "comments": "26 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CG math.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove a discrete Jordan-Brouwer-Schoenflies separation theorem telling\nthat a (d-1)-sphere H embedded in a d-sphere G defines two different connected\ngraphs A,B in G such a way that the intersection of A and B is H and the union\nis G and such that the complementary graphs A,B are both d-balls. The graph\ntheoretic definitions are due to Evako: the unit sphere of a vertex x of a\ngraph G=(V,E) is the graph generated by {y | (x,y) in E} Inductively, a finite\nsimple graph is called contractible if there is a vertex x such that both its\nunit sphere S(x) as well as the graph generated by V-{x} are contractible.\nInductively, still following Evako, a d-sphere is a finite simple graph for\nwhich every unit sphere is a (d-1)-sphere and such that removing a single\nvertex renders the graph contractible. A d-ball B is a contractible graph for\nwhich each unit sphere S(x) is either a (d-1)-sphere in which case x is called\nan interior point, or S(x) is a (d-1)-ball in which case x is called a boundary\npoint and such that the set of boundary point vertices generates a\n(d-1)-sphere. These inductive definitions are based on the assumption that the\nempty graph is the unique (-1)-sphere and that the one-point graph K_1 is the\nunique 0-ball and that K_1 is contractible. The theorem needs the following\nnotion of embedding: a sphere H is embedded in a graph G if it is a sub-graph\nof G and if any intersection with any finite set of mutually adjacent unit\nspheres is a sphere. A knot of co-dimension k in G is a (d-k)-sphere H embedded\nin a d-sphere G.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 01:52:45 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Knill", "Oliver", ""]]}, {"id": "1506.06488", "submitter": "Peter Zeman", "authors": "Pavel Klav\\'ik, Roman Nedela, Peter Zeman", "title": "Jordan-like characterization of automorphism groups of planar graphs", "comments": "Some citations were added", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate automorphism groups of planar graphs. The main result is a\ncomplete recursive description of all abstract groups that can be realized as\nautomorphism groups of planar graphs. The characterization is formulated in\nterms of inhomogeneous wreath products. In the proof, we combine techniques\nfrom combinatorics, group theory, and geometry. This significantly improves the\nBabai's description (1975).\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 07:25:37 GMT"}, {"version": "v2", "created": "Fri, 6 Nov 2015 14:43:48 GMT"}, {"version": "v3", "created": "Sat, 29 Apr 2017 13:45:50 GMT"}, {"version": "v4", "created": "Tue, 4 Aug 2020 13:58:33 GMT"}, {"version": "v5", "created": "Fri, 5 Feb 2021 10:19:07 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Klavík", "Pavel", ""], ["Nedela", "Roman", ""], ["Zeman", "Peter", ""]]}, {"id": "1506.06492", "submitter": "Michael Rao", "authors": "Emmanuel Jeandel (CARTE), Michael Rao (MC2)", "title": "An aperiodic set of 11 Wang tiles", "comments": null, "journal-ref": "Advances in Combinatorics, 2021:1", "doi": "10.19086/aic.18614", "report-no": null, "categories": "cs.DM cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We present a new aperiodic tileset containing 11 Wang tiles on 4 colors, and\nwe show that this tileset is minimal, in the sense that no Wang set with either\nfewer than 11 tiles or fewer than 4 colors is aperiodic. This gives a\ndefinitive answer to the problem raised by Wang in 1961.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 07:44:18 GMT"}, {"version": "v2", "created": "Wed, 13 Mar 2019 11:54:12 GMT"}, {"version": "v3", "created": "Fri, 18 Sep 2020 13:56:36 GMT"}, {"version": "v4", "created": "Mon, 11 Jan 2021 13:56:31 GMT"}], "update_date": "2021-01-12", "authors_parsed": [["Jeandel", "Emmanuel", "", "CARTE"], ["Rao", "Michael", "", "MC2"]]}, {"id": "1506.06564", "submitter": "Matthew Johnson", "authors": "Konrad K. Dabrowski, Francois Dross, Matthew Johnson, Daniel Paulusma", "title": "Filling the Complexity Gaps for Colouring Planar and Bounded Degree\n  Graphs", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A colouring of a graph $G=(V,E)$ is a function $c: V\\rightarrow\\{1,2,\\ldots\n\\}$ such that $c(u)\\neq c(v)$ for every $uv\\in E$. A $k$-regular list\nassignment of $G$ is a function $L$ with domain $V$ such that for every $u\\in\nV$, $L(u)$ is a subset of $\\{1, 2, \\dots\\}$ of size $k$. A colouring $c$ of $G$\nrespects a $k$-regular list assignment $L$ of $G$ if $c(u)\\in L(u)$ for every\n$u\\in V$. A graph $G$ is $k$-choosable if for every $k$-regular list assignment\n$L$ of $G$, there exists a colouring of $G$ that respects $L$. We may also ask\nif for a given $k$-regular list assignment $L$ of a given graph $G$, there\nexists a colouring of $G$ that respects $L$. This yields the $k$-Regular List\nColouring problem. For $k\\in \\{3,4\\}$ we determine a family of classes ${\\cal\nG}$ of planar graphs, such that either $k$-Regular List Colouring is\nNP-complete for instances $(G,L)$ with $G\\in {\\cal G}$, or every $G\\in {\\cal\nG}$ is $k$-choosable. By using known examples of non-$3$-choosable and\nnon-$4$-choosable graphs, this enables us to classify the complexity of\n$k$-Regular List Colouring restricted to planar graphs, planar bipartite\ngraphs, planar triangle-free graphs and to planar graphs with no $4$-cycles and\nno $5$-cycles. We also classify the complexity of $k$-Regular List Colouring\nand a number of related colouring problems for graphs with bounded maximum\ndegree.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 12:09:25 GMT"}, {"version": "v2", "created": "Wed, 24 Jun 2015 19:57:31 GMT"}, {"version": "v3", "created": "Sun, 23 Aug 2015 04:24:48 GMT"}, {"version": "v4", "created": "Thu, 14 Sep 2017 17:09:10 GMT"}, {"version": "v5", "created": "Thu, 7 Feb 2019 09:06:06 GMT"}], "update_date": "2019-02-08", "authors_parsed": [["Dabrowski", "Konrad K.", ""], ["Dross", "Francois", ""], ["Johnson", "Matthew", ""], ["Paulusma", "Daniel", ""]]}, {"id": "1506.06745", "submitter": "Lev Nachmanson", "authors": "Lev Nachmanson, Roman Prutkin, Bongshin Lee, Nathalie Henry Riche,\n  Alexander E. Holroyd, Xiaoji Chen", "title": "GraphMaps: Browsing Large Graphs as Interactive Maps", "comments": "submitted to GD 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR cs.DM cs.MS cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Algorithms for laying out large graphs have seen significant progress in the\npast decade. However, browsing large graphs remains a challenge. Rendering\nthousands of graphical elements at once often results in a cluttered image, and\nnavigating these elements naively can cause disorientation. To address this\nchallenge we propose a method called GraphMaps, mimicking the browsing\nexperience of online geographic maps.\n  GraphMaps creates a sequence of layers, where each layer refines the previous\none. During graph browsing, GraphMaps chooses the layer corresponding to the\nzoom level, and renders only those entities of the layer that intersect the\ncurrent viewport. The result is that, regardless of the graph size, the number\nof entities rendered at each view does not exceed a predefined threshold, yet\nall graph elements can be explored by the standard zoom and pan operations.\n  GraphMaps preprocesses a graph in such a way that during browsing, the\ngeometry of the entities is stable, and the viewer is responsive. Our case\nstudies indicate that GraphMaps is useful in gaining an overview of a large\ngraph, and also in exploring a graph on a finer level of detail.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 17:17:34 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Nachmanson", "Lev", ""], ["Prutkin", "Roman", ""], ["Lee", "Bongshin", ""], ["Riche", "Nathalie Henry", ""], ["Holroyd", "Alexander E.", ""], ["Chen", "Xiaoji", ""]]}, {"id": "1506.06813", "submitter": "Farhad Shahrokhi", "authors": "Farhad Shahrokhi", "title": "Bounds for the Clique Cover Width of Factors of the Apex Graph of the\n  Planar Grid", "comments": null, "journal-ref": "Congressus Numerantium 224 (2015), 213-220", "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The {\\it clique cover width} of $G$, denoted by $ccw(G)$, is the minimum\nvalue of the bandwidth of all graphs that are obtained by contracting the\ncliques in a clique cover of $G$ into a single vertex. For $i=1,2,...,d,$ let\n$G_i$ be a graph with $V(G_i)=V$, and let $G$ be a graph with $V(G)=V$ and\n$E(G)=\\cap_{i=1}^d(G_i)$, then we write $G=\\cap_{i=1}^dG_i$ and call each\n$G_i,i=1,2,...,d$ a factor of $G$. We are interested in the case where $G_1$ is\nchordal, and $ccw(G_i),i=2,3...,d$ for each factor $G_i$ is \"small\". Here we\nshow a negative result. Specifically, let ${\\hat G}(k,n)$ be the graph obtained\nby joining a set of $k$ apex vertices of degree $n^2$ to all vertices of an\n$n\\times n$ grid, and then adding some possible edges among these $k$ vertices.\nWe prove that if ${\\hat G}(k,n)=\\cap_{i=1}^dG_i$, with $G_1$ being chordal,\nthen, $max_{2\\le i\\le d}\\{ccw(G_i)\\}\\ge {n^{1\\over d-1}\\over 2.{(2c)}^{1\\over\n{d-1}}}$, where $c$ is a constant. Furthermore, for $d=2$, we construct a\nchordal graph $G_1$ and a graph $G_2$ with $ccw(G_2)\\le {n\\over 2}+k$ so that\n${\\hat G}(k,n)=G_1\\cap G_2$. Finally, let ${\\hat G}$ be the clique sum graph of\n${\\hat G}(k_i, n_i), i=1,2,...t$, where the underlying grid is $n_i\\times n_i$\nand the sum is taken at apex vertices. Then, we show ${\\hat G}=G_1\\cap G_2$,\nwhere, $G_1$ is chordal and $ccw(G_2)\\le \\sum_{i=1}^t(n_i+k_i)$. The\nimplications and applications of the results are discussed, including\naddressing a recent question of David Wood.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2015 22:57:48 GMT"}, {"version": "v2", "created": "Wed, 24 Jun 2015 02:56:19 GMT"}, {"version": "v3", "created": "Sun, 28 Jun 2015 21:17:51 GMT"}, {"version": "v4", "created": "Wed, 17 Feb 2016 02:11:39 GMT"}], "update_date": "2016-02-18", "authors_parsed": [["Shahrokhi", "Farhad", ""]]}, {"id": "1506.07246", "submitter": "Martin Derka", "authors": "Therese Biedl, Martin Derka", "title": "$1$-String $B_1$-VPG Representations of Planar Partial $3$-Trees and\n  Some Subclasses", "comments": "To appear at the 27th Canadian Conference on Computational Geometry,\n  Kingston, Ontario, August 10--12, 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Planar partial $3$-trees are subgraphs of those planar graphs obtained by\nrepeatedly inserting a vertex of degree $3$ into a face. In this paper, we show\nthat planar partial $3$-trees have $1$-string $B_1$-VPG representations, i.e.,\nrepresentations where every vertex is represented by an orthogonal curve with\nat most one bend, every two curves intersect at most once, and intersections of\ncurves correspond to edges in the graph. We also that some subclasses of planar\npartial 3-trees have L-representations, i.e., a $B_1$-VPG representation where\nevery curve has the shape of an L.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2015 05:12:41 GMT"}], "update_date": "2015-06-25", "authors_parsed": [["Biedl", "Therese", ""], ["Derka", "Martin", ""]]}, {"id": "1506.07248", "submitter": "Eric Sopena", "authors": "La\\\"iche Daouya (L'IFORCE), Isma Bouchemakh (L'IFORCE), Eric Sopena\n  (LaBRI)", "title": "Packing coloring of some undirected and oriented coronae graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The packing chromatic number $\\pcn(G)$ of a graph $G$ is the smallest integer\n$k$ such that its set of vertices $V(G)$ can be partitioned into $k$ disjoint\nsubsets $V\\_1$, \\ldots, $V\\_k$, in such a way that every two distinct vertices\nin $V\\_i$ are at distance greater than $i$ in $G$ for every $i$, $1\\le i\\le k$.\nFor a given integer $p \\ge 1$, the generalized corona $G\\odot pK\\_1$ of a graph\n$G$ is the graph obtained from $G$ by adding $p$ degree-one neighbors to every\nvertex of $G$. In this paper, we determine the packing chromatic number of\ngeneralized coronae of paths and cycles. Moreover, by considering digraphs and\nthe (weak) directed distance between vertices, we get a natural extension of\nthe notion of packing coloring to digraphs. We then determine the packing\nchromatic number of orientations of generalized coronae of paths and cycles.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2015 06:03:18 GMT"}], "update_date": "2015-06-25", "authors_parsed": [["Daouya", "Laïche", "", "L'IFORCE"], ["Bouchemakh", "Isma", "", "L'IFORCE"], ["Sopena", "Eric", "", "LaBRI"]]}, {"id": "1506.07329", "submitter": "Rishabh Iyer", "authors": "Rishabh Iyer and Jeff Bilmes", "title": "Polyhedral aspects of Submodularity, Convexity and Concavity", "comments": "38 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Seminal work by Edmonds and Lovasz shows the strong connection between\nsubmodularity and convexity. Submodular functions have tight modular lower\nbounds, and subdifferentials in a manner akin to convex functions. They also\nadmit poly-time algorithms for minimization and satisfy the Fenchel duality\ntheorem and the Discrete Seperation Theorem, both of which are fundamental\ncharacteristics of convex functions. Submodular functions also show signs\nsimilar to concavity. Submodular maximization, though NP hard, admits constant\nfactor approximation guarantees. Concave functions composed with modular\nfunctions are submodular, and they also satisfy diminishing returns property.\nThis manuscript provides a more complete picture on the relationship between\nsubmodularity with convexity and concavity, by extending many of the results\nconnecting submodularity with convexity to the concave aspects of\nsubmodularity. We first show the existence of superdifferentials, and\nefficiently computable tight modular upper bounds of a submodular function.\nWhile we show that it is hard to characterize this polyhedron, we obtain inner\nand outer bounds on the superdifferential along with certain specific and\nuseful supergradients. We then investigate forms of concave extensions of\nsubmodular functions and show interesting relationships to submodular\nmaximization. We next show connections between optimality conditions over the\nsuperdifferentials and submodular maximization, and show how forms of\napproximate optimality conditions translate into approximation factors for\nmaximization. We end this paper by studying versions of the discrete seperation\ntheorem and the Fenchel duality theorem when seen from the concave point of\nview. In every case, we relate our results to the existing results from the\nconvex point of view, thereby improving the analysis of the relationship\nbetween submodularity, convexity, and concavity.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2015 11:45:28 GMT"}, {"version": "v2", "created": "Tue, 8 Sep 2015 18:43:23 GMT"}], "update_date": "2015-09-09", "authors_parsed": [["Iyer", "Rishabh", ""], ["Bilmes", "Jeff", ""]]}, {"id": "1506.07338", "submitter": "Julien Bensmail", "authors": "Julien Bensmail (LIP), Nick Brettell (LIP)", "title": "Orienting edges to fight fire in graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a new oriented variant of the Firefighter Problem. In the\ntraditional Firefighter Problem, a fire breaks out at a given vertex of a\ngraph, and at each time interval spreads to neighbouring vertices that have not\nbeen protected, while a constant number of vertices are protected at each time\ninterval. In the version of the problem considered here, the firefighters are\nable to orient the edges of the graph before the fire breaks out, but the fire\ncould start at any vertex. We consider this problem when played on a graph in\none of several graph classes, and give upper and lower bounds on the number of\nvertices that can be saved. In particular, when one firefighter is available at\neach time interval, and the given graph is a complete graph, or a complete\nbipartite graph, we present firefighting strategies that are provably optimal.\nWe also provide lower bounds on the number of vertices that can be saved as a\nfunction of the chromatic number, of the maximum degree, and of the treewidth\nof a graph. For a subcubic graph, we show that the firefighters can save all\nbut two vertices, and this is best possible.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2015 12:19:45 GMT"}], "update_date": "2015-06-25", "authors_parsed": [["Bensmail", "Julien", "", "LIP"], ["Brettell", "Nick", "", "LIP"]]}, {"id": "1506.07675", "submitter": "Alexandru I. Tomescu", "authors": "Ademir Hujdurovi\\'c, Ur\\v{s}a Ka\\v{c}ar, Martin Milani\\v{c}, Bernard\n  Ries, Alexandru I. Tomescu", "title": "Complexity and algorithms for finding a perfect phylogeny from mixed\n  tumor samples", "comments": "This is the extended version of Hujdurovi\\'c et al, Finding a perfect\n  phylogeny from mixed tumor samples, WABI 2015, DOI:\n  10.1007/978-3-662-48221-6_6", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CC cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, Hajirasouliha and Raphael (WABI 2014) proposed a model for\ndeconvoluting mixed tumor samples measured from a collection of high-throughput\nsequencing reads. This is related to understanding tumor evolution and critical\ncancer mutations. In short, their formulation asks to split each row of a\nbinary matrix so that the resulting matrix corresponds to a perfect phylogeny\nand has the minimum number of rows among all matrices with this property. In\nthis paper we disprove several claims about this problem, including an\nNP-hardness proof of it. However, we show that the problem is indeed NP-hard,\nby providing a different proof. We also prove NP-completeness of a variant of\nthis problem proposed in the same paper. On the positive side, we propose an\nefficient (though not necessarily optimal) heuristic algorithm based on\ncoloring co-comparability graphs, and a polynomial time algorithm for solving\nthe problem optimally on matrix instances in which no column is contained in\nboth columns of a pair of conflicting columns. Implementations of these\nalgorithms are freely available at\nhttps://github.com/alexandrutomescu/MixedPerfectPhylogeny\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2015 09:33:04 GMT"}, {"version": "v2", "created": "Thu, 2 Jul 2015 19:59:08 GMT"}, {"version": "v3", "created": "Sun, 3 Jul 2016 19:56:45 GMT"}, {"version": "v4", "created": "Thu, 7 Jul 2016 22:42:11 GMT"}], "update_date": "2016-07-11", "authors_parsed": [["Hujdurović", "Ademir", ""], ["Kačar", "Urša", ""], ["Milanič", "Martin", ""], ["Ries", "Bernard", ""], ["Tomescu", "Alexandru I.", ""]]}, {"id": "1506.07731", "submitter": "Zoran Maksimovic", "authors": "Zoran Maksimovic", "title": "A multidimensional maximum bisection problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work introduces a multidimensional generalization of the maximum\nbisection problem. A mixed integer linear programming formulation is proposed\nwith the proof of its correctness. The numerical tests, made on the randomly\ngenerated graphs, indicates that the multidimensional generalization is more\ndifficult to solve than the original problem.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2015 12:55:22 GMT"}], "update_date": "2015-06-26", "authors_parsed": [["Maksimovic", "Zoran", ""]]}, {"id": "1506.07810", "submitter": "Michael Elberfeld", "authors": "Michael Elberfeld and Pascal Schweitzer", "title": "Canonizing Graphs of Bounded Tree Width in Logspace", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM cs.DS math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graph canonization is the problem of computing a unique representative, a\ncanon, from the isomorphism class of a given graph. This implies that two\ngraphs are isomorphic exactly if their canons are equal. We show that graphs of\nbounded tree width can be canonized by logarithmic-space (logspace) algorithms.\nThis implies that the isomorphism problem for graphs of bounded tree width can\nbe decided in logspace. In the light of isomorphism for trees being hard for\nthe complexity class logspace, this makes the ubiquitous class of graphs of\nbounded tree width one of the few classes of graphs for which the complexity of\nthe isomorphism problem has been exactly determined.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2015 16:45:48 GMT"}], "update_date": "2015-06-26", "authors_parsed": [["Elberfeld", "Michael", ""], ["Schweitzer", "Pascal", ""]]}, {"id": "1506.07853", "submitter": "Felix Kn\\\"oppel", "authors": "Felix Kn\\\"oppel and Ulrich Pinkall", "title": "Complex Line Bundles over Simplicial Complexes and their Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Discrete vector bundles are important in Physics and recently found\nremarkable applications in Computer Graphics. This article approaches discrete\nbundles from the viewpoint of Discrete Differential Geometry, including a\ncomplete classification of discrete vector bundles over finite simplicial\ncomplexes. In particular, we obtain a discrete analogue of a theorem of Andr\\'e\nWeil on the classification of hermitian line bundles. Moreover, we associate to\neach discrete hermitian line bundle with curvature a unique piecewise-smooth\nhermitian line bundle of piecewise constant curvature. This is then used to\ndefine a discrete Dirichlet energy which generalizes the well-known cotangent\nLaplace operator to discrete hermitian line bundles over Euclidean simplicial\nmanifolds of arbitrary dimension.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2015 19:15:48 GMT"}, {"version": "v2", "created": "Tue, 7 Jul 2015 17:34:17 GMT"}, {"version": "v3", "created": "Wed, 18 Jan 2017 06:48:31 GMT"}], "update_date": "2017-01-19", "authors_parsed": [["Knöppel", "Felix", ""], ["Pinkall", "Ulrich", ""]]}, {"id": "1506.07898", "submitter": "Torsten M\\\"utze", "authors": "Torsten M\\\"utze, Jerri Nummenpalo", "title": "Efficient computation of middle levels Gray codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For any integer $n\\geq 1$ a middle levels Gray code is a cyclic listing of\nall bitstrings of length $2n+1$ that have either $n$ or $n+1$ entries equal to\n1 such that any two consecutive bitstrings in the list differ in exactly one\nbit. The question whether such a Gray code exists for every $n\\geq 1$ has been\nthe subject of intensive research during the last 30 years, and has been\nanswered affirmatively only recently [T. M\\\"utze. Proof of the middle levels\nconjecture. Proc. London Math. Soc., 112(4):677--713, 2016]. In this work we\nprovide the first efficient algorithm to compute a middle levels Gray code. For\na given bitstring, our algorithm computes the next $\\ell$ bitstrings in the\nGray code in time $\\mathcal{O}(n\\ell(1+\\frac{n}{\\ell}))$, which is\n$\\mathcal{O}(n)$ on average per bitstring provided that $\\ell=\\Omega(n)$.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2015 20:50:17 GMT"}, {"version": "v2", "created": "Mon, 6 Jul 2015 12:24:37 GMT"}, {"version": "v3", "created": "Sat, 30 Jan 2016 18:17:19 GMT"}, {"version": "v4", "created": "Tue, 20 Jun 2017 06:52:24 GMT"}], "update_date": "2017-06-21", "authors_parsed": [["Mütze", "Torsten", ""], ["Nummenpalo", "Jerri", ""]]}, {"id": "1506.08375", "submitter": "Guilhem Gamard", "authors": "Guilhem Gamard and Gwena\\\"el Richomme", "title": "Comparison of Coverability and Multi-Scale Coverability in One and Two\n  Dimensions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A word is quasiperiodic (or coverable) if it can be covered with occurrences\nof another finite word, called its quasiperiod. A word is multi-scale\nquasiperiodic (or multi-scale coverable) if it has infinitely many different\nquasiperiods. These notions were previously studied in the domains of text\nalgorithms and combinatorics of right infinite words.\n  We extend them to infinite pictures (two-dimensional words). Then we compare\nthe regularity properties (uniform recurrence, uniform frequencies, topological\nentropy) of quasiperiodicity with multi-scale quasiperiodicity, and we also\ncompare each of them with its one-dimensional counterpart.\n  We also study which properties of quasiperiods enforce properties on the\nquasiperiodic words.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jun 2015 08:37:53 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Gamard", "Guilhem", ""], ["Richomme", "Gwenaël", ""]]}, {"id": "1506.08388", "submitter": "Luk\\'a\\v{s} Folwarczn\\'y", "authors": "Luk\\'a\\v{s} Folwarczn\\'y and Du\\v{s}an Knop", "title": "IV-matching is strongly NP-hard", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  IV-matching is a generalization of perfect bipartite matching. The complexity\nof finding IV-matching in a graph was posted as an open problem at the ICALP\n2014 conference.\n  In this note, we resolve the question and prove that, contrary to the\nexpectations of the authors, the given problem is strongly NP-hard (already in\nthe simplest non-trivial case of four layers). Hence it is unlikely that there\nwould be an efficient (polynomial or pseudo-polynomial) algorithm solving the\nproblem.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jun 2015 12:25:15 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Folwarczný", "Lukáš", ""], ["Knop", "Dušan", ""]]}, {"id": "1506.08400", "submitter": "Christopher Rook", "authors": "Christopher J. Rook", "title": "Optimal Equity Glidepaths in Retirement", "comments": "Fully documented source code from a C++ implementation is included in\n  the attached proofs appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.DM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamic retirement glidepaths evolve over time based on some measure such as\nthe retiree's funded status or current market valuations. Conversely, static\nglidepaths are fixed at a starting point and selected under the assumption that\nthey will not change. In practice, new static glidepaths may be derived\nperiodically making them more flexible. The optimal static retirement glidepath\nwould be the one that performs better than all others with respect to some\nmetric. When systematic withdrawals are made from a retirement portfolio,\nglidepaths are often assessed via the probability of ruin (or success). Our\ngoal here is to derive the optimal static glidepath with respect to this\nmetric. It is a result new to the literature and the shape will be of special\ninterest to retirees, financial advisors, retirement researchers, and\ntarget-date fund providers.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jun 2015 13:55:57 GMT"}], "update_date": "2015-09-17", "authors_parsed": [["Rook", "Christopher J.", ""]]}, {"id": "1506.08447", "submitter": "J.T. Geneson", "authors": "Jesse Geneson", "title": "Improved lower bounds on extremal functions of multidimensional\n  permutation matrices", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A $d$-dimensional zero-one matrix $A$ avoids another $d$-dimensional zero-one\nmatrix $P$ if no submatrix of $A$ can be transformed to $P$ by changing some\nones to zeroes. Let $f(n,P,d)$ denote the maximum number of ones in a\n$d$-dimensional $n \\times \\cdots \\times n$ zero-one matrix that avoids $P$.\n  Fox proved for $n$ sufficiently large that $f(n, P, 2) = 2^{k^{\\Theta(1)}}n$\nfor almost all $k \\times k$ permutation matrices $P$. We extend this result by\nproving for $d \\geq 2$ and $n$ sufficiently large that $f(n, P, d) =\n2^{k^{\\Theta(1)}}n^{d-1}$ for almost all $d$-dimensional permutation matrices\n$P$ of dimensions $k \\times \\cdots \\times k$.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jun 2015 20:13:59 GMT"}], "update_date": "2015-06-30", "authors_parsed": [["Geneson", "Jesse", ""]]}, {"id": "1506.08477", "submitter": "O-joung Kwon", "authors": "Eun Jung Kim and O-joung Kwon", "title": "A polynomial kernel for Block Graph Deletion", "comments": "22 pages, 2 figures, An extended abstract appeared in IPEC2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Block Graph Deletion problem, we are given a graph $G$ on $n$ vertices\nand a positive integer $k$, and the objective is to check whether it is\npossible to delete at most $k$ vertices from $G$ to make it a block graph,\ni.e., a graph in which each block is a clique. In this paper, we obtain a\nkernel with $\\mathcal{O}(k^{6})$ vertices for the Block Graph Deletion problem.\nThis is a first step to investigate polynomial kernels for deletion problems\ninto non-trivial classes of graphs of bounded rank-width, but unbounded\ntree-width. Our result also implies that Chordal Vertex Deletion admits a\npolynomial-size kernel on diamond-free graphs. For the kernelization and its\nanalysis, we introduce the notion of `complete degree' of a vertex. We believe\nthat the underlying idea can be potentially applied to other problems. We also\nprove that the Block Graph Deletion problem can be solved in time $10^{k}\\cdot\nn^{\\mathcal{O}(1)}$.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 00:01:09 GMT"}, {"version": "v2", "created": "Fri, 4 Dec 2015 21:37:24 GMT"}, {"version": "v3", "created": "Thu, 14 Jan 2016 21:06:50 GMT"}], "update_date": "2016-01-18", "authors_parsed": [["Kim", "Eun Jung", ""], ["Kwon", "O-joung", ""]]}, {"id": "1506.08592", "submitter": "Joan Boyar", "authors": "Joan Boyar and Christian Kudahl", "title": "Adding Isolated Vertices Makes some Online Algorithms Optimal", "comments": "A footnote in the .tex file didn't show up in the last version. This\n  was fixed", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An unexpected difference between online and offline algorithms is observed.\nThe natural greedy algorithms are shown to be worst case online optimal for\nOnline Independent Set and Online Vertex Cover on graphs with 'enough' isolated\nvertices, Freckle Graphs. For Online Dominating Set, the greedy algorithm is\nshown to be worst case online optimal on graphs with at least one isolated\nvertex. These algorithms are not online optimal in general. The online\noptimality results for these greedy algorithms imply optimality according to\nvarious worst case performance measures, such as the competitive ratio. It is\nalso shown that, despite this worst case optimality, there are Freckle graphs\nwhere the greedy independent set algorithm is objectively less good than\nanother algorithm. It is shown that it is NP-hard to determine any of the\nfollowing for a given graph: the online independence number, the online vertex\ncover number, and the online domination number.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 11:49:29 GMT"}, {"version": "v2", "created": "Fri, 8 Jul 2016 13:03:11 GMT"}, {"version": "v3", "created": "Thu, 2 Mar 2017 07:24:20 GMT"}, {"version": "v4", "created": "Fri, 3 Mar 2017 07:20:51 GMT"}], "update_date": "2017-03-06", "authors_parsed": [["Boyar", "Joan", ""], ["Kudahl", "Christian", ""]]}, {"id": "1506.08658", "submitter": "Jean-Fran\\c{c}ois Viaud", "authors": "Jean-Fran\\c{c}ois Viaud and Karell Bertet and Christophe Demko and\n  Rokia Missaoui", "title": "Lattice decompositions through methods using congruence relations", "comments": "This paper has been withdrawn since it is only a draft paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known by analysts that a concept lattice has an exponential size\nin the data. Thus, as soon as he works with real data, the size of the concept\nlattice is a fundamental problem. In this chapter, we propose to investigate\nfactor lattices as a tool to get meaningful parts of the whole lattice. These\nfactor lattices have been widely studied from the early theory of lattices to\nmore recent work in the FCA field. This chapter is divided into three parts. In\nthe first part, we present pieces of lattice theory and formal concept\nanalysis, namely compatible sub-contexts, arrow-closed sub-contexts and\ncongruence relations, all three notions used for the sub-direct decomposition\nand the doubling convex construction used for the second decomposition, also\nbased on congruence relations. In the second part, the subdirect decomposition\ninto subdirectly irreducible factor is given, polynomial algorithms to compute\nsuch a decomposition are given and an example is detailled to illustrate the\ntheory. Then in the third section, a new decomposition named \"revese doubling\nconstruction\" is given. An example is given to explain this decomposition.\nTheoretical results are given and proofs for the new ones also.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 14:49:19 GMT"}, {"version": "v2", "created": "Thu, 19 Nov 2015 10:53:26 GMT"}], "update_date": "2015-11-20", "authors_parsed": [["Viaud", "Jean-François", ""], ["Bertet", "Karell", ""], ["Demko", "Christophe", ""], ["Missaoui", "Rokia", ""]]}, {"id": "1506.08752", "submitter": "Sivakumar Rathinam", "authors": "Satyanarayana Manyam, Sivakumar Rathinam", "title": "On Tightly Bounding the Dubins Traveling Salesman's Optimum", "comments": "Presented at the International Symposium on Mathematical Programming,\n  2015.\n  https://informs.emeetingsonline.com/emeetings/formbuilder/clustersessiondtl.asp?csnno=22283&mmnno=264&ppnno=86444", "journal-ref": "ASME Journal of Dynamic Systems, Measurement, and Control, 2018", "doi": "10.1115/1.4039099", "report-no": null, "categories": "math.OC cs.DM cs.DS cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Dubins Traveling Salesman Problem (DTSP) has generated significant\ninterest over the last decade due to its occurrence in several civil and\nmilitary surveillance applications. Currently, there is no algorithm that can\nfind an optimal solution to the problem. In addition, relaxing the motion\nconstraints and solving the resulting Euclidean TSP (ETSP) provides the only\nlower bound available for the problem. However, in many problem instances, the\nlower bound computed by solving the ETSP is far below the cost of the feasible\nsolutions obtained by some well-known algorithms for the DTSP. This article\naddresses this fundamental issue and presents the first systematic procedure\nfor developing tight lower bounds for the DTSP.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2015 19:12:37 GMT"}, {"version": "v2", "created": "Mon, 17 Aug 2015 18:06:47 GMT"}, {"version": "v3", "created": "Wed, 10 Feb 2016 10:52:45 GMT"}], "update_date": "2018-03-07", "authors_parsed": [["Manyam", "Satyanarayana", ""], ["Rathinam", "Sivakumar", ""]]}]