[{"id": "1910.00053", "submitter": "Jie Gao", "authors": "Jie Gao, Terrence Wong, Chun Wang, Jia Yuan Yu", "title": "A Price-Based Iterative Double Auction for Charger Sharing Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The unprecedented growth of demand for charging electric vehicles (EVs) calls\nfor novel expansion solutions to today's charging networks. Riding on the wave\nof the proliferation of sharing economy, Airbnb-like charger sharing markets\nopens the opportunity to expand the existing charging networks without\nrequiring costly and time-consuming infrastructure investments, yet the\nsuccessful design of such markets relies on innovations at the interface\nbetween game theory, mechanism design, and large scale optimization. In this\npaper, we propose a price-based iterative double auction for charger sharing\nmarkets where charger owners rent out their under-utilized chargers to the\ncharge-needing EV drivers. Charger owners and EV drivers form a two-sided\nmarket which is cleared by a price-based double auction. Chargers' locations,\navailability, and time unit costs as well as the EV drivers' time, distance\nconstraints, and preferences are considered in the allocation and scheduling\nprocess. The goal is to compute social welfare maximizing allocations which\nbenefits both charger owners and EV drivers and, in turn, ensure the continuous\ngrowth of the market. We prove that the proposed double auction is budget\nbalanced, individually rational, and that it is a weakly dominant strategy for\nEV drivers and charger owners to truthfully report their charging time\nconstraints. In addition, results from our computation study show that the\ndouble auction achieves on average 94% efficiency compared with the optimal\nsolutions and scales well to larger problem instances.\n", "versions": [{"version": "v1", "created": "Mon, 30 Sep 2019 18:40:04 GMT"}], "update_date": "2019-10-02", "authors_parsed": [["Gao", "Jie", ""], ["Wong", "Terrence", ""], ["Wang", "Chun", ""], ["Yu", "Jia Yuan", ""]]}, {"id": "1910.00094", "submitter": "Marion Hallet", "authors": "Thomas Brihaye, Gilles Geeraerts, Marion Hallet, Benjamin Monmege and\n  Bruno Quoitin", "title": "Dynamics on Games: Simulation-Based Techniques and Applications to\n  Routing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider multi-player games played on graphs, in which the players aim at\nfulfilling their own (not necessarily antagonistic) objectives. In the spirit\nof evolutionary game theory, we suppose that the players have the right to\nrepeatedly update their respective strategies (for instance, to improve the\noutcome w.r.t. the current strategy profile). This generates a dynamics in the\ngame which may eventually stabilise to an equilibrium. The objective of the\npresent paper is twofold. First, we aim at drawing a general framework to\nreason about the termination of such dynamics. In particular, we identify\npreorders on games (inspired from the classical notion of simulation between\ntransitions systems, and from the notion of graph minor) which preserve\ntermination of dynamics. Second, we show the applicability of the previously\ndeveloped framework to interdomain routing problems.\n", "versions": [{"version": "v1", "created": "Mon, 30 Sep 2019 20:40:03 GMT"}, {"version": "v2", "created": "Thu, 3 Oct 2019 12:28:06 GMT"}], "update_date": "2019-10-04", "authors_parsed": [["Brihaye", "Thomas", ""], ["Geeraerts", "Gilles", ""], ["Hallet", "Marion", ""], ["Monmege", "Benjamin", ""], ["Quoitin", "Bruno", ""]]}, {"id": "1910.00135", "submitter": "Nicos Protopapas", "authors": "Ioannis Caragiannis, George Christodoulou, Nicos Protopapas", "title": "Impartial Selection with Additive Approximation Guarantees", "comments": "SAGT 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Impartial selection has recently received much attention within the\nmulti-agent systems community. The task is, given a directed graph representing\nnominations to the members of a community by other members, to select the\nmember with the highest number of nominations. This seemingly trivial goal\nbecomes challenging when there is an additional impartiality constraint,\nrequiring that no single member can influence her chance of being selected.\nRecent progress has identified impartial selection rules with optimal\napproximation ratios. Moreover, it was noted that worst-case instances are\ngraphs with few vertices. Motivated by this fact, we propose the study of {\\em\nadditive approximation}, the difference between the highest number of\nnominations and the number of nominations of the selected member, as an\nalternative measure of the quality of impartial selection.\n  Our positive results include two randomized impartial selection mechanisms\nwhich have additive approximation guarantees of $\\Theta(\\sqrt{n})$ and\n$\\Theta(n^{2/3}\\ln^{1/3}n)$ for the two most studied models in the literature,\nwhere $n$ denotes the community size. We complement our positive results by\nproviding negative results for various cases. First, we provide a\ncharacterization for the interesting class of strong sample mechanisms, which\nallows us to obtain lower bounds of $n-2$, and of $\\Omega(\\sqrt{n})$ for their\ndeterministic and randomized variants respectively. Finally, we present a\ngeneral lower bound of $2$ for all deterministic impartial mechanisms.\n", "versions": [{"version": "v1", "created": "Mon, 30 Sep 2019 22:20:36 GMT"}, {"version": "v2", "created": "Sat, 25 Jul 2020 22:54:43 GMT"}], "update_date": "2020-07-28", "authors_parsed": [["Caragiannis", "Ioannis", ""], ["Christodoulou", "George", ""], ["Protopapas", "Nicos", ""]]}, {"id": "1910.00193", "submitter": "Sam Ganzfried", "authors": "Sam Ganzfried, Conner Laughlin, Charles Morefield", "title": "Parallel Algorithm for Approximating Nash Equilibrium in Multiplayer\n  Stochastic Games with Application to Naval Strategic Planning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.CR cs.MA econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many real-world domains contain multiple agents behaving strategically with\nprobabilistic transitions and uncertain (potentially infinite) duration. Such\nsettings can be modeled as stochastic games. While algorithms have been\ndeveloped for solving (i.e., computing a game-theoretic solution concept such\nas Nash equilibrium) two-player zero-sum stochastic games, research on\nalgorithms for non-zero-sum and multiplayer stochastic games is limited. We\npresent a new algorithm for these settings, which constitutes the first\nparallel algorithm for multiplayer stochastic games. We present experimental\nresults on a 4-player stochastic game motivated by a naval strategic planning\nscenario, showing that our algorithm is able to quickly compute strategies\nconstituting Nash equilibrium up to a very small degree of approximation error.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2019 04:08:14 GMT"}, {"version": "v2", "created": "Sat, 25 Jan 2020 02:07:18 GMT"}, {"version": "v3", "created": "Fri, 21 Feb 2020 03:35:08 GMT"}, {"version": "v4", "created": "Fri, 13 Mar 2020 18:54:19 GMT"}], "update_date": "2020-06-25", "authors_parsed": [["Ganzfried", "Sam", ""], ["Laughlin", "Conner", ""], ["Morefield", "Charles", ""]]}, {"id": "1910.00220", "submitter": "Dario Paccagnan", "authors": "Basilio Gentile, Dario Paccagnan, Bolutife Ogunsula, John Lygeros", "title": "The Nash Equilibrium with Inertia in Population Games", "comments": "12 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.GT cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the traditional game-theoretic set up, where agents select actions and\nexperience corresponding utilities, an equilibrium is a configuration where no\nagent can improve their utility by unilaterally switching to a different\naction. In this work, we introduce the novel notion of inertial Nash\nequilibrium to account for the fact that, in many practical situations, action\nchanges do not come for free. Specifically, we consider a population game and\nintroduce the coefficients $c_{ij}$ describing the cost an agent incurs by\nswitching from action $i$ to action $j$. We define an inertial Nash equilibrium\nas a distribution over the action space where no agent benefits in moving to a\ndifferent action, while taking into account the cost of this change. First, we\nshow that the set of inertial Nash equilibria contains all the Nash equilibria,\nbut is in general not convex. Second, we argue that classical algorithms for\ncomputing Nash equilibria cannot be used in the presence of switching costs. We\nthen propose a natural better-response dynamics and prove its convergence to an\ninertial Nash equilibrium. We apply our results to predict the drivers'\ndistribution of an on-demand ride-hailing platform.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2019 06:53:31 GMT"}], "update_date": "2019-10-02", "authors_parsed": [["Gentile", "Basilio", ""], ["Paccagnan", "Dario", ""], ["Ogunsula", "Bolutife", ""], ["Lygeros", "John", ""]]}, {"id": "1910.00225", "submitter": "Sam Ganzfried", "authors": "Sam Ganzfried", "title": "Mistakes in Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a new concept of \"mistake\" strategies and actions for\nstrategic-form and extensive-form games, analyze the relationship to prior main\ngame-theoretic solution concepts, study algorithms for computation, and explore\npracticality. This concept has potential applications to cybersecurity, for\nexample detecting whether a human player is illegally using real-time\nassistance in games like poker.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2019 07:01:26 GMT"}, {"version": "v2", "created": "Wed, 2 Oct 2019 19:28:04 GMT"}, {"version": "v3", "created": "Sat, 12 Oct 2019 14:31:04 GMT"}], "update_date": "2020-10-29", "authors_parsed": [["Ganzfried", "Sam", ""]]}, {"id": "1910.00681", "submitter": "David Fridovich-Keil", "authors": "David Fridovich-Keil, Vicenc Rubies-Royo, and Claire J. Tomlin", "title": "An Iterative Quadratic Method for General-Sum Differential Games with\n  Feedback Linearizable Dynamics", "comments": "7 pages, 5 figures, accepted to IEEE International Conference on\n  Robotics and Automation (2020)", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.GT cs.MA cs.RO cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Iterative linear-quadratic (ILQ) methods are widely used in the nonlinear\noptimal control community. Recent work has applied similar methodology in the\nsetting of multiplayer general-sum differential games. Here, ILQ methods are\ncapable of finding local equilibria in interactive motion planning problems in\nreal-time. As in most iterative procedures, however, this approach can be\nsensitive to initial conditions and hyperparameter choices, which can result in\npoor computational performance or even unsafe trajectories. In this paper, we\nfocus our attention on a broad class of dynamical systems which are feedback\nlinearizable, and exploit this structure to improve both algorithmic\nreliability and runtime. We showcase our new algorithm in three distinct\ntraffic scenarios, and observe that in practice our method converges\nsignificantly more often and more quickly than was possible without exploiting\nthe feedback linearizable structure.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2019 21:34:06 GMT"}, {"version": "v2", "created": "Thu, 19 Mar 2020 13:08:27 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Fridovich-Keil", "David", ""], ["Rubies-Royo", "Vicenc", ""], ["Tomlin", "Claire J.", ""]]}, {"id": "1910.01073", "submitter": "Haotian Jiang", "authors": "Haotian Jiang, Janardhan Kulkarni, Sahil Singla", "title": "Online Geometric Discrepancy for Stochastic Arrivals with Applications\n  to Envy Minimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CG cs.DM cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a unit interval $[0,1]$ in which $n$ points arrive one-by-one\nindependently and uniformly at random. On arrival of a point, the problem is to\nimmediately and irrevocably color it in $\\{+1,-1\\}$ while ensuring that every\ninterval $[a,b] \\subseteq [0,1]$ is nearly-balanced. We define\n\\emph{discrepancy} as the largest imbalance of any interval during the entire\nprocess. If all the arriving points were known upfront then we can color them\nalternately to achieve a discrepancy of $1$. What is the minimum possible\nexpected discrepancy when we color the points online?\n  We show that the discrepancy of the above problem is sub-polynomial in $n$\nand that no algorithm can achieve a constant discrepancy. This is a substantial\nimprovement over the trivial random coloring that only gets an\n$\\widetilde{O}(\\sqrt n)$ discrepancy. We then obtain similar results for a\nnatural generalization of this problem to $2$-dimensions where the points\narrive uniformly at random in a unit square. This generalization allows us to\nimprove recent results of Benade et al.\\cite{BenadeKPP-EC18} for the online\nenvy minimization problem when the arrivals are stochastic.\n", "versions": [{"version": "v1", "created": "Wed, 2 Oct 2019 16:43:57 GMT"}], "update_date": "2019-10-03", "authors_parsed": [["Jiang", "Haotian", ""], ["Kulkarni", "Janardhan", ""], ["Singla", "Sahil", ""]]}, {"id": "1910.01334", "submitter": "Georgios Piliouras", "authors": "Victor Boone and Georgios Piliouras", "title": "From Darwin to Poincar\\'e and von Neumann: Recurrence and Cycles in\n  Evolutionary and Algorithmic Game Theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.DS q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Replicator dynamics, the continuous-time analogue of Multiplicative Weights\nUpdates, is the main dynamic in evolutionary game theory. In simple\nevolutionary zero-sum games, such as Rock-Paper-Scissors, replicator dynamic is\nperiodic \\cite{zeeman1980population}, however, its behavior in higher\ndimensions is not well understood. We provide a complete characterization of\nits behavior in zero-sum evolutionary games. We prove that, if and only if, the\nsystem has an interior Nash equilibrium, the dynamics exhibit Poincar\\'{e}\nrecurrence, i.e., almost all orbits come arbitrary close to their initial\nconditions infinitely often. If no interior equilibria exist, then all interior\ninitial conditions converge to the boundary. Specifically, the strategies that\nare not in the support of any equilibrium vanish in the limit of all orbits.\nAll recurrence results furthermore extend to a class of games that generalize\nboth graphical polymatrix games as well as evolutionary games, establishing a\nunifying link between evolutionary and algorithmic game theory. We show that\ntwo degrees of freedom, as in Rock-Paper-Scissors, is sufficient to prove\nperiodicity.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2019 07:45:23 GMT"}], "update_date": "2019-10-04", "authors_parsed": [["Boone", "Victor", ""], ["Piliouras", "Georgios", ""]]}, {"id": "1910.01615", "submitter": "Marco Dall'Aglio", "authors": "Marco Dall'Aglio", "title": "Fair Division of Goods with Market Values", "comments": "29 pages, 1 figure, 17 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Inheritances, divorces or liquidations of companies require that a common\nasset is divided among the entitled parties. Legal methods usually consider the\nmarket value of goods, while fair division procedures take into account the\nparties' preferences expressed as cardinal utilities. We combine the two\npractices to define two procedures that optimally allocate goods with market\nvalues to people with preferences.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2019 17:35:11 GMT"}], "update_date": "2019-10-04", "authors_parsed": [["Dall'Aglio", "Marco", ""]]}, {"id": "1910.01706", "submitter": "Ryan D'Orazio", "authors": "Ryan D'Orazio, Dustin Morrill, James R. Wright", "title": "Bounds for Approximate Regret-Matching Algorithms", "comments": "4 pages + acknowledgements, references, and appendices (9 pages\n  total)", "journal-ref": "Smooth Games Optimization and Machine Learning Workshop: Bridging\n  Game Theory and Deep Learning (SGO&ML), at the Thirty-third Conference on\n  Neural Information Processing Systems (NeurIPS 2019), Dec 14th, 2019,\n  Vancouver, Canada", "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A dominant approach to solving large imperfect-information games is\nCounterfactural Regret Minimization (CFR). In CFR, many regret minimization\nproblems are combined to solve the game. For very large games, abstraction is\ntypically needed to render CFR tractable. Abstractions are often manually\ntuned, possibly removing important strategic differences in the full game and\nharming performance. Function approximation provides a natural solution to\nfinding good abstractions to approximate the full game. A common approach to\nincorporating function approximation is to learn the inputs needed for a regret\nminimizing algorithm, allowing for generalization across many regret\nminimization problems. This paper gives regret bounds when a regret minimizing\nalgorithm uses estimates instead of true values. This form of analysis is the\nfirst to generalize to a larger class of $(\\Phi, f)$-regret matching\nalgorithms, and includes different forms of regret such as swap, internal, and\nexternal regret. We demonstrate how these results give a slightly tighter bound\nfor Regression Regret-Matching (RRM), and present a novel bound for combining\nregression with Hedge.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2019 19:58:28 GMT"}, {"version": "v2", "created": "Thu, 28 Nov 2019 01:25:35 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["D'Orazio", "Ryan", ""], ["Morrill", "Dustin", ""], ["Wright", "James R.", ""]]}, {"id": "1910.01860", "submitter": "Kesav Kaza", "authors": "Rahul Meshram and Kesav Kaza", "title": "Online repeated posted price auctions with a demand side platform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an online ad network problem in which an ad exchange auctions ad\nslots and intermediaries called demand side platforms (DSPs) buy these ad slots\nfor their clients (advertisers). An intermediary represents multiple\nadvertisers. Different types of ad slots are auctioned by the ad exchange,\ne.g., video ad, banner ad etc. We study repeated posted price auctions for\nhomogeneous and heterogeneous items when there is an intermediary. In a posted\nprice auction, the auctioneer sets a fixed reserve price. The buyer can accept\nthe price and win the ad slot or reject the price.\n  We analyze the system from the auctioneer's perspective and show that the\noptimal reserve price is dynamic for heterogeneous items. We also investigate\nsystem from intermediary's perspective and devise algorithms for scheduling\nadvertisers. Often the advertisers have budget constraints and impression\nconstraints. We formulate a revenue optimization problem at the intermediary\nand also consider the problem of scheduling advertisers with budget and\nimpression constraints. Finally, we present a numerical study for the single\nseller and advertiser model which considers various valuation distributions\nsuch as uniform, exponential and lognormal.\n", "versions": [{"version": "v1", "created": "Fri, 4 Oct 2019 10:33:55 GMT"}], "update_date": "2019-10-07", "authors_parsed": [["Meshram", "Rahul", ""], ["Kaza", "Kesav", ""]]}, {"id": "1910.02059", "submitter": "Georgios Birmpas", "authors": "Georgios Birmpas, Elias Koutsoupias, Philip Lazos, Francisco J.\n  Marmolejo-Coss\\'io", "title": "Fairness and Efficiency in DAG-based Cryptocurrencies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bitcoin is a decentralised digital currency that serves as an alternative to\nexisting transaction systems based on an external central authority for\nsecurity. Although Bitcoin has many desirable properties, one of its\nfundamental shortcomings is its inability to process transactions at high\nrates. To address this challenge, many subsequent protocols either modify the\nrules of block acceptance (longest chain rule) and reward, or alter the\ngraphical structure of the public ledger from a tree to a directed acyclic\ngraph (DAG). Motivated by these approaches, we introduce a new general\nframework that captures ledger growth for a large class of DAG-based\nimplementations. With this in hand, and by assuming honest miner behaviour, we\n(experimentally) explore how different DAG-based protocols perform in terms of\nfairness, i.e., if the block reward of a miner is proportional to their hash\npower, as well as efficiency, i.e. what proportion of user transactions a\nledger deems valid after a certain length of time. Our results demonstrate\nfundamental structural limits on how well DAG-based ledger protocols cope with\na high transaction load. More specifically, we show that even in a scenario\nwhere every miner on the system is honest in terms of when they publish blocks,\nwhat they point to, and what transactions each block contains, fairness and\nefficiency of the ledger can break down at specific hash rates if miners have\ndiffering levels of connectivity to the P2P network sustaining the protocol.\n", "versions": [{"version": "v1", "created": "Fri, 4 Oct 2019 17:35:46 GMT"}], "update_date": "2019-10-07", "authors_parsed": [["Birmpas", "Georgios", ""], ["Koutsoupias", "Elias", ""], ["Lazos", "Philip", ""], ["Marmolejo-Cossío", "Francisco J.", ""]]}, {"id": "1910.02194", "submitter": "Geoffrey Ramseyer", "authors": "Geoffrey Ramseyer, Ashish Goel, David Mazieres", "title": "Liquidity in Credit Networks with Constrained Agents", "comments": "To be published in TheWebConf 2020", "journal-ref": null, "doi": "10.1145/3366423.3380276", "report-no": null, "categories": "cs.GT cs.CR q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to scale transaction rates for deployment across the global web,\nmany cryptocurrencies have deployed so-called \"Layer-2\" networks of private\npayment channels. An idealized payment network behaves like a Credit Network, a\nmodel for transactions across a network of bilateral trust relationships.\nCredit Networks capture many aspects of traditional currencies as well as new\nvirtual currencies and payment mechanisms. In the traditional credit network\nmodel, if an agent defaults, every other node that trusted it is vulnerable to\nloss. In a cryptocurrency context, trust is manufactured by capital deposits,\nand thus there arises a natural tradeoff between network liquidity (i.e. the\nfraction of transactions that succeed) and the cost of capital deposits.\n  In this paper, we introduce constraints that bound the total amount of loss\nthat the rest of the network can suffer if an agent (or a set of agents) were\nto default - equivalently, how the network changes if agents can support\nlimited solvency guarantees.\n  We show that these constraints preserve the analytical structure of a credit\nnetwork. Furthermore, we show that aggregate borrowing constraints greatly\nsimplify the network structure and in the payment network context achieve the\noptimal tradeoff between liquidity and amount of escrowed capital.\n", "versions": [{"version": "v1", "created": "Sat, 5 Oct 2019 02:19:42 GMT"}, {"version": "v2", "created": "Mon, 27 Jan 2020 02:47:36 GMT"}, {"version": "v3", "created": "Tue, 17 Mar 2020 22:02:50 GMT"}], "update_date": "2020-03-19", "authors_parsed": [["Ramseyer", "Geoffrey", ""], ["Goel", "Ashish", ""], ["Mazieres", "David", ""]]}, {"id": "1910.02343", "submitter": "Bryce Ferguson", "authors": "Bryce L. Ferguson, Philip N. Brown, Jason R. Marden", "title": "Carrots or Sticks? The Effectiveness of Subsidies and Tolls in\n  Congestion Games", "comments": "American Conference on Control 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Are rewards or penalties more effective in influencing user behavior? This\nwork compares the effectiveness of subsidies and tolls in incentivizing users\nin congestion games. The predominantly studied method of influencing user\nbehavior in network routing problems is to institute taxes which alter users'\nobserved costs in a manner that causes their self-interested choices to more\nclosely align with a system-level objective. Another feasible method to\naccomplish the same goal is to subsidize the users' actions that are preferable\nfrom a system-level perspective. We show that, when users behave similarly and\npredictably, subsidies offer comparable performance guarantees to tolls while\nrequiring smaller monetary transactions with users; however, in the presence of\nunknown player heterogeneity, subsidies fail to offer the same performance as\ntolls. We further investigate these relationships in affine congestion games,\nderiving explicit performance bounds under optimal tolls and subsidies with and\nwithout user heterogeneity; we show that the differences in performance can be\nsignificant.\n", "versions": [{"version": "v1", "created": "Sun, 6 Oct 2019 00:06:43 GMT"}], "update_date": "2019-10-08", "authors_parsed": [["Ferguson", "Bryce L.", ""], ["Brown", "Philip N.", ""], ["Marden", "Jason R.", ""]]}, {"id": "1910.02569", "submitter": "Zhiyi Huang", "authors": "Zhiyi Huang, Runzhou Tao", "title": "Understanding Zadimoghaddam's Edge-weighted Online Matching Algorithm:\n  Unweighted Case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article identifies a key algorithmic ingredient in the edge-weighted\nonline matching algorithm by Zadimoghaddam (2017) and presents a simplified\nalgorithm and its analysis to demonstrate how it works in the unweighted case.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2019 01:03:59 GMT"}], "update_date": "2019-10-08", "authors_parsed": [["Huang", "Zhiyi", ""], ["Tao", "Runzhou", ""]]}, {"id": "1910.02693", "submitter": "Krzysztof R. Apt", "authors": "Krzysztof R. Apt, Sunil Simon, Dominik Wojtczak", "title": "Coordination Games on Weighted Directed Graphs", "comments": "43 pages. To appear in Mathematics of Operations Research", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study strategic games on weighted directed graphs, in which the payoff of\na player is defined as the sum of the weights on the edges from players who\nchose the same strategy, augmented by a fixed non-negative integer bonus for\npicking a given strategy. These games capture the idea of coordination in the\nabsence of globally common strategies.\n  We identify natural classes of graphs for which finite improvement or\ncoalition-improvement paths of polynomial length always exist, and, as a\nconsequence, a (pure) Nash equlibrium or a strong equilibrium can be found in\npolynomial time.\n  The considered classes of graphs are typical in network topologies: simple\ncycles correspond to the token ring local area networks, while open chains of\nsimple cycles correspond to multiple independent rings topology from the\nrecommendation G.8032v2 on the Ethernet ring protection switching. For simple\ncycles these results are optimal in the sense that without the imposed\nconditions on the weights and bonuses a Nash equilibrium may not even exist.\n  Finally, we prove that the problem of determining the existence of a Nash\nequilibrium or of a strong equilibrium in these games is NP-complete already\nfor unweighted graphs and with no bonuses assumed. This implies that the same\nproblems for polymatrix games are strongly NP-hard.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2019 09:43:22 GMT"}, {"version": "v2", "created": "Fri, 12 Mar 2021 12:02:57 GMT"}], "update_date": "2021-03-15", "authors_parsed": [["Apt", "Krzysztof R.", ""], ["Simon", "Sunil", ""], ["Wojtczak", "Dominik", ""]]}, {"id": "1910.02744", "submitter": "Dongwei Zhao", "authors": "Dongwei Zhao, Hao Wang, Jianwei Huang, Xiaojun Lin", "title": "Storage or No Storage: Duopoly Competition Between Renewable Energy\n  Suppliers in a Local Energy Market", "comments": "This is the online appendix for the paper published in IEEE Journal\n  on Selected Areas in Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.GT cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the duopoly competition between renewable energy suppliers\nwith or without energy storage in a local energy market. The storage investment\nbrings the benefits of stabilizing renewable energy suppliers' outputs, but it\nalso leads to substantial investment costs as well as some surprising changes\nin the market outcome. To study the equilibrium decisions of storage investment\nin the renewable energy suppliers' competition, we model the interactions\nbetween suppliers and consumers using a three-stage game-theoretic model. In\nStage I, at the beginning of the investment horizon, suppliers decide whether\nto invest in storage. Once such decisions have been made, in the day-ahead\nmarket of each day, suppliers decide on their bidding prices and quantities in\nStage II, based on which consumers decide the electricity quantity purchased\nfrom each supplier in Stage III. In the real-time market, a supplier is\npenalized if his actual generation falls short of his commitment. We\ncharacterize a price-quantity competition equilibrium of Stage II, and we\nfurther characterize a storage-investment equilibrium in Stage I incorporating\nelectricity-selling revenue and storage cost. Counter-intuitively, we show that\nthe uncertainty of renewable energy without storage investment can lead to\nhigher supplier profits compared with the stable generations with storage\ninvestment due to the reduced market competition under random energy\ngeneration. Simulations further illustrate results due to the market\ncompetition. For example, a higher penalty for not meeting the commitment, a\nhigher storage cost, or a lower consumer demand can sometimes increase a\nsupplier's profit. We also show that although storage investment can increase a\nsupplier 's profit, the first-mover supplier who invests in storage may benefit\nless than the free-rider competitor who chooses not to invest.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2019 12:03:40 GMT"}, {"version": "v2", "created": "Wed, 9 Oct 2019 03:22:47 GMT"}, {"version": "v3", "created": "Sun, 13 Oct 2019 13:59:31 GMT"}], "update_date": "2019-10-15", "authors_parsed": [["Zhao", "Dongwei", ""], ["Wang", "Hao", ""], ["Huang", "Jianwei", ""], ["Lin", "Xiaojun", ""]]}, {"id": "1910.02750", "submitter": "Abhishek Gupta", "authors": "Abhishek k Gupta and Adrish Banerjee", "title": "Modeling and Analysis of Heterogeneous Traffic Networks with Anarchists\n  and Socialist Traffic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a heterogeneous traffic network with multiple\nusers classes which differ considerably in their path selection objective. In\nparticular, we consider two classes of users: ones who seek to minimize social\ncost (socialists) and the ones with typical greedy objective (anarchists) which\nleads to a heterogeneous game termed as HetGame. The paper proposes an\nanalytical framework to derive optimal/equilibrium flow in such a heterogeneous\ngame along with a method for the same. The paper considers multiple examples of\ndifferent networks to derive the optimal traffic assignment. We introduce two\nmetrics: price of $\\alpha$ anarchy and price of good behavior to evaluate the\nimpact of anarchists and implications of central directives. Finally, the\nproposed algorithm is implemented for a real traffic network to derive\ninsights.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2019 12:24:24 GMT"}], "update_date": "2019-10-08", "authors_parsed": [["Gupta", "Abhishek k", ""], ["Banerjee", "Adrish", ""]]}, {"id": "1910.03094", "submitter": "Michael V Sullins", "authors": "Ian A. Kash, Michael Sullins, Katja Hofmann", "title": "Combining No-regret and Q-learning", "comments": "Presented as conference paper at AAMAS 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.GT cs.MA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Counterfactual Regret Minimization (CFR) has found success in settings like\npoker which have both terminal states and perfect recall. We seek to understand\nhow to relax these requirements. As a first step, we introduce a simple\nalgorithm, local no-regret learning (LONR), which uses a Q-learning-like update\nrule to allow learning without terminal states or perfect recall. We prove its\nconvergence for the basic case of MDPs (and limited extensions of them) and\npresent empirical results showing that it achieves last iterate convergence in\na number of settings, most notably NoSDE games, a class of Markov games\nspecifically designed to be challenging to learn where no prior algorithm is\nknown to achieve convergence to a stationary equilibrium even on average.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2019 21:13:55 GMT"}, {"version": "v2", "created": "Tue, 17 Mar 2020 16:58:54 GMT"}], "update_date": "2020-03-18", "authors_parsed": [["Kash", "Ian A.", ""], ["Sullins", "Michael", ""], ["Hofmann", "Katja", ""]]}, {"id": "1910.03155", "submitter": "Jiaheng Wei", "authors": "Jiaheng Wei, Zuyue Fu, Yang Liu, Xingyu Li, Zhuoran Yang, Zhaoran Wang", "title": "Sample Elicitation", "comments": "To appear at AISTATS 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is important to collect credible training samples $(x,y)$ for building\ndata-intensive learning systems (e.g., a deep learning system). Asking people\nto report complex distribution $p(x)$, though theoretically viable, is\nchallenging in practice. This is primarily due to the cognitive loads required\nfor human agents to form the report of this highly complicated information.\nWhile classical elicitation mechanisms apply to eliciting a complex and\ngenerative (and continuous) distribution $p(x)$, we are interested in eliciting\nsamples $x_i \\sim p(x)$ from agents directly. We coin the above problem \"sample\nelicitation\". This paper introduces a deep learning aided method to incentivize\ncredible sample contributions from self-interested and rational agents. We show\nthat with an accurate estimation of a certain $f$-divergence function we can\nachieve approximate incentive compatibility in eliciting truthful samples. We\nthen present an efficient estimator with theoretical guarantees via studying\nthe variational forms of the $f$-divergence function. We also show a connection\nbetween this sample elicitation problem and $f$-GAN, and how this connection\ncan help reconstruct an estimator of the distribution based on collected\nsamples. Experiments on synthetic data, MNIST, and CIFAR-10 datasets\ndemonstrate that our mechanism elicits truthful samples. Our implementation is\navailable at https://github.com/weijiaheng/Credible-sample-elicitation.git.\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2019 01:23:11 GMT"}, {"version": "v2", "created": "Mon, 17 Feb 2020 20:38:52 GMT"}, {"version": "v3", "created": "Thu, 25 Feb 2021 09:05:19 GMT"}], "update_date": "2021-02-26", "authors_parsed": [["Wei", "Jiaheng", ""], ["Fu", "Zuyue", ""], ["Liu", "Yang", ""], ["Li", "Xingyu", ""], ["Yang", "Zhuoran", ""], ["Wang", "Zhaoran", ""]]}, {"id": "1910.03287", "submitter": "Zhiyi Huang", "authors": "Zhiyi Huang", "title": "Understanding Zadimoghaddam's Edge-weighted Online Matching Algorithm:\n  Weighted Case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a simplification of Zadimoghaddam's algorithm for the\nedge-weighted online bipartite matching problem, under the online primal dual\nframework. In doing so, we obtain an improved competitive ratio of $0.514$. We\nfirst combine the online correlated selection (OCS), an ingredient distilled\nfrom Zadimoghaddam (2017) by Huang and Tao (2019), and an interpretation of the\nedge-weighted online bipartite matching problem by Devanur et al. (2016) which\nwe will refer to as the complementary cumulative distribution function (CCDF)\nviewpoint, to derive an online primal dual algorithm that is\n$0.505$-competitive. Then, we design an improved OCS which gives the $0.514$\nratio.\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2019 09:04:22 GMT"}], "update_date": "2019-10-09", "authors_parsed": [["Huang", "Zhiyi", ""]]}, {"id": "1910.03656", "submitter": "Jules Hedges", "authors": "Joe Bolt and Jules Hedges and Philipp Zahn", "title": "Bayesian open games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper generalises the treatment of compositional game theory as\nintroduced by the second and third authors with Ghani and Winschel, where games\nare modelled as morphisms of a symmetric monoidal category. From an economic\nmodelling perspective, the existing notion of an open game is not expressive\nenough for many applications. This includes stochastic environments, stochastic\nchoices by players, as well as incomplete information regarding the game being\nplayed. The current paper addresses these three issue all at once. To achieve\nthis we make significant use of category theory, especially the 'coend optics'\nof Riley.\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2019 19:25:43 GMT"}], "update_date": "2019-10-10", "authors_parsed": [["Bolt", "Joe", ""], ["Hedges", "Jules", ""], ["Zahn", "Philipp", ""]]}, {"id": "1910.04123", "submitter": "Lydia T. Liu", "authors": "Lydia T. Liu, Ashia Wilson, Nika Haghtalab, Adam Tauman Kalai,\n  Christian Borgs, Jennifer Chayes", "title": "The Disparate Equilibria of Algorithmic Decision Making when Individuals\n  Invest Rationally", "comments": "30 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The long-term impact of algorithmic decision making is shaped by the dynamics\nbetween the deployed decision rule and individuals' response. Focusing on\nsettings where each individual desires a positive classification---including\nmany important applications such as hiring and school admissions, we study a\ndynamic learning setting where individuals invest in a positive outcome based\non their group's expected gain and the decision rule is updated to maximize\ninstitutional benefit. By characterizing the equilibria of these dynamics, we\nshow that natural challenges to desirable long-term outcomes arise due to\nheterogeneity across groups and the lack of realizability. We consider two\ninterventions, decoupling the decision rule by group and subsidizing the cost\nof investment. We show that decoupling achieves optimal outcomes in the\nrealizable case but has discrepant effects that may depend on the initial\nconditions otherwise. In contrast, subsidizing the cost of investment is shown\nto create better equilibria for the disadvantaged group even in the absence of\nrealizability.\n", "versions": [{"version": "v1", "created": "Fri, 4 Oct 2019 20:18:49 GMT"}], "update_date": "2019-10-10", "authors_parsed": [["Liu", "Lydia T.", ""], ["Wilson", "Ashia", ""], ["Haghtalab", "Nika", ""], ["Kalai", "Adam Tauman", ""], ["Borgs", "Christian", ""], ["Chayes", "Jennifer", ""]]}, {"id": "1910.04125", "submitter": "Jianxiong Guo", "authors": "Jianxiong Guo, Weili Wu", "title": "A k-hop Collaborate Game Model: Adaptive Strategy to Maximize Total\n  Revenue", "comments": "in IEEE Transactions on Computational Social Systems", "journal-ref": null, "doi": "10.1109/TCSS.2020.3001509", "report-no": null, "categories": "cs.SI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Online Social Networks (OSNs), interpersonal communication and information\nsharing are happening all the time, and it is real-time. When a user initiates\nan activity in OSNs, immediately, he/she will have a certain influence in\nhis/her friendship circle naturally, some users in the initiator's friendship\ncircle will be attracted to participate in this activity. Based on such a fact,\nwe design a k-hop Collaborate Game Model, which means that an activity\ninitiated by a user can only influence those users whose distance are within\nk-hop from this initiator in OSNs. Besides, we introduce the problem of Revenue\nMaximization under k-hop Collaborate Game (RMKCG), which identifies a limited\nnumber of initiators in order to obtain revenue as much as possible.\nCollaborate Game Model describes in detail how to quantify revenue and the\nlogic behind it. We do not know how many followers would be generated from an\nactivity in advance, thus, we need to adopt an adaptive strategy, where the\ndecision who is the next potential initiator depends on the results of past\ndecisions. Adaptive RMKCG problem can be considered as a new stochastic\noptimization problem, and we prove it is NP-hard, adaptive monotone, but not\nadaptive submodular. But in some special cases, it is adaptive submodular and\nan adaptive greedy strategy can obtain a $(1-1/e)$-approximation by adaptive\nsubmodularity theory. Due to the complexity of our model, it is hard to compute\nthe marginal gain for each candidate user, then, we propose a convenient and\nefficient computational method. The effectiveness and correctness of our\nalgorithms are validated by heavy simulation on real-world social networks\neventually.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2019 17:12:18 GMT"}, {"version": "v2", "created": "Wed, 19 Feb 2020 00:35:57 GMT"}], "update_date": "2020-06-25", "authors_parsed": [["Guo", "Jianxiong", ""], ["Wu", "Weili", ""]]}, {"id": "1910.04134", "submitter": "Canh Pham Pham", "authors": "Canh V. Pham, Hieu V. Duong, and My T. Thai", "title": "Cost-aware Targeted Viral Marketing: Approximation with Less Samples", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cost-aware Targeted Viral Marketing (CTVM), a generalization of Influence\nMaximization (IM), has received a lot of attentions recently due to its\ncommercial values. Previous approximation algorithms for this problem required\na large number of samples to ensure approximate guarantee. In this paper, we\npropose an efficient approximation algorithm which uses fewer samples but\nprovides the same theoretical guarantees based on generating and using\nimportant samples in its operation. Experiments on real social networks show\nthat our proposed method outperforms the state-of-the-art algorithm which\nprovides the same approximation ratio in terms of the number of required\nsamples and running time.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2019 03:26:23 GMT"}, {"version": "v2", "created": "Sat, 8 Feb 2020 16:51:07 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Pham", "Canh V.", ""], ["Duong", "Hieu V.", ""], ["Thai", "My T.", ""]]}, {"id": "1910.04260", "submitter": "Eran Shmaya", "authors": "Yingni Guo and Eran Shmaya", "title": "Robust Monopoly Regulation", "comments": "27 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the regulation of a monopolistic firm using a robust-design\napproach. We solve for the policy that minimizes the regulator's worst-case\nregret, where the regret is the difference between his complete-information\npayoff minus his realized payoff. When the regulator's payoff is consumers'\nsurplus, it is optimal to impose a price cap. The optimal cap balances the\nbenefit from more surplus for consumers and the loss from underproduction. When\nhis payoff is consumers' surplus plus the firm's profit, he offers a piece-rate\nsubsidy in order to mitigate underproduction, but caps the total subsidy so as\nnot to incentivize severe overproduction.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2019 21:25:50 GMT"}], "update_date": "2019-10-11", "authors_parsed": [["Guo", "Yingni", ""], ["Shmaya", "Eran", ""]]}, {"id": "1910.04342", "submitter": "Clayton Thomas", "authors": "Linda Cai and Clayton Thomas and S. Matthew Weinberg", "title": "Implementation in Advised Strategies: Welfare Guarantees from\n  Posted-Price Mechanisms when Demand Queries are NP-hard", "comments": null, "journal-ref": "11th Innovations in Theoretical Computer Science (ITCS), 2020", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  State-of-the-art posted-price mechanisms for submodular bidders with $m$\nitems achieve approximation guarantees of $O((\\log \\log m)^3)$ [Assadi and\nSingla, 2019]. Their truthfulness, however, requires bidders to compute an\nNP-hard demand-query. Some computational complexity of this form is\nunavoidable, as it is NP-hard for truthful mechanisms to guarantee even an\n$m^{1/2-\\varepsilon}$-approximation for any $\\varepsilon > 0$ [Dobzinski and\nVondr\\'ak, 2016]. Together, these establish a stark distinction between\ncomputationally-efficient and communication-efficient truthful mechanisms.\n  We show that this distinction disappears with a mild relaxation of\ntruthfulness, which we term implementation in advised strategies, and that has\nbeen previously studied in relation to \"Implementation in Undominated\nStrategies\" [Babaioff et al, 2009]. Specifically, advice maps a tentative\nstrategy either to that same strategy itself, or one that dominates it. We say\nthat a player follows advice as long as they never play actions which are\ndominated by advice. A poly-time mechanism guarantees an $\\alpha$-approximation\nin implementation in advised strategies if there exists poly-time advice for\neach player such that an $\\alpha$-approximation is achieved whenever all\nplayers follow advice. Using an appropriate bicriterion notion of approximate\ndemand queries (which can be computed in poly-time), we establish that (a\nslight modification of) the [Assadi and Singla, 2019] mechanism achieves the\nsame $O((\\log \\log m)^3)$-approximation in implementation in advised\nstrategies.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2019 02:57:56 GMT"}, {"version": "v2", "created": "Tue, 4 Aug 2020 17:05:30 GMT"}], "update_date": "2020-08-05", "authors_parsed": [["Cai", "Linda", ""], ["Thomas", "Clayton", ""], ["Weinberg", "S. Matthew", ""]]}, {"id": "1910.04401", "submitter": "Clayton Thomas", "authors": "Linda Cai and Clayton Thomas", "title": "Representing All Stable Matchings by Walking a Maximal Chain", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The seminal book of Gusfield and Irving [GI89] provides a compact and\nalgorithmically useful way to represent the collection of stable matches\ncorresponding to a given set of preferences. In this paper, we reinterpret the\nmain results of [GI89], giving a new proof of the characterization which is\nable to bypass a lot of the \"theory building\" of the original works. We also\nprovide a streamlined and efficient way to compute this representation. Our\nproofs and algorithms emphasize the connection to well-known properties of the\ndeferred acceptance algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2019 07:30:07 GMT"}], "update_date": "2019-10-11", "authors_parsed": [["Cai", "Linda", ""], ["Thomas", "Clayton", ""]]}, {"id": "1910.04406", "submitter": "Clayton Thomas", "authors": "Linda Cai and Clayton Thomas", "title": "The Short-Side Advantage in Random Matching Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A breakthrough of Ashlagi, Kanoria, and Leshno [AKL17] found that imbalance\nin the number of agents on either side of a random matching market has a\nprofound effect on the market's expected characteristics. Specifically, across\nall stable matchings, the \"long side\" (i.e. the side with a greater number of\nagents) receives significantly worse matches in expectation than the short\nside. Intuitively, this occurs because an agent on the long side is essentially\nunneeded to create a stable matching -- a matching could form almost as easily\nwithout them. Thus, an agent on the long side has very little market power, and\nmust settle for a match which is not much better than a random assignment.\n  We provide a new and simpler proof for a result of [AKL17] which formalizes\nthis intuition.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2019 07:40:16 GMT"}, {"version": "v2", "created": "Fri, 11 Oct 2019 23:31:35 GMT"}, {"version": "v3", "created": "Thu, 11 Mar 2021 17:44:11 GMT"}], "update_date": "2021-03-12", "authors_parsed": [["Cai", "Linda", ""], ["Thomas", "Clayton", ""]]}, {"id": "1910.04446", "submitter": "Jaros{\\l}aw Miszczak", "authors": "Ye Ye, Xiao Rong Hang, Jin Ming Koh, Jaros{\\l}aw Adam Miszczak, Kang\n  Hao Cheong, Neng-gang Xie", "title": "Passive network evolution promotes group welfare in complex networks", "comments": "15 pages, 9 figures", "journal-ref": "Chaos, Solitons & Fractals, Vol. 130, pp. 109464 (2020)", "doi": "10.1016/j.chaos.2019.109464", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Parrondo's paradox is a counterintuitive phenomenon in which individually\nlosing strategies, canonically termed game A and game B, are combined to\nproduce winning outcomes. In this paper, a co-evolution of game dynamics and\nnetwork structure is adopted to study adaptability and survivability in\nmulti-agent dynamics. The model includes action A, representing a rewiring\nprocess on the network, and a two-branch game B, representing redistributive\ninteractions between agents. Simulation results indicate that stochastically\nmixing action A and game B can produce enhanced, and even winning outcomes,\ndespite gameB being individually losing. In other words, a Parrondo-type\nparadox can be achieved, but unlike canonical variants, the source of agitation\nis provided by passive network evolution instead of an active second game. The\nunderlying paradoxical mechanism is analyzed, revealing that the rewiring\nprocess drives a topology shift from initial regular lattices towards\nscale-free characteristics, and enables exploitative behavior that grants\nenhanced access to the favourable branch of game B.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2019 09:29:17 GMT"}], "update_date": "2019-10-11", "authors_parsed": [["Ye", "Ye", ""], ["Hang", "Xiao Rong", ""], ["Koh", "Jin Ming", ""], ["Miszczak", "Jarosław Adam", ""], ["Cheong", "Kang Hao", ""], ["Xie", "Neng-gang", ""]]}, {"id": "1910.04489", "submitter": "Pavel Naumov", "authors": "Pavel Naumov, Kevin Ros", "title": "Strategic Coalitions in Stochastic Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The article introduces a notion of a stochastic game with failure states and\nproposes two logical systems with modality \"coalition has a strategy to\ntransition to a non-failure state with a given probability while achieving a\ngiven goal.\" The logical properties of this modality depend on whether the\nmodal language allows the empty coalition. The main technical results are a\ncompleteness theorem for a logical system with the empty coalition, a strong\ncompleteness theorem for the logical system without the empty coalition, and an\nincompleteness theorem which shows that there is no strongly complete logical\nsystem in the language with the empty coalition.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2019 11:33:15 GMT"}], "update_date": "2019-10-11", "authors_parsed": [["Naumov", "Pavel", ""], ["Ros", "Kevin", ""]]}, {"id": "1910.04574", "submitter": "Roi Naveiro", "authors": "Tahir Ekin, Roi Naveiro, Alberto Torres-Barr\\'an, David R\\'ios-Insua", "title": "Augmented Probability Simulation Methods for Non-cooperative Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.CO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a robust decision support framework with computational algorithms\nfor decision makers in non-cooperative sequential setups. Existing simulation\nbased approaches can be inefficient when there is a large number of feasible\ndecisions and uncertain outcomes. Hence, we provide a novel alternative to\nsolve non-cooperative sequential games based on augmented probability\nsimulation. We propose approaches to approximate subgame perfect equilibria\nunder complete information, assess the robustness of such solutions and,\nfinally, approximate adversarial risk analysis solutions when lacking complete\ninformation. This framework could be especially beneficial in application\ndomains such as cybersecurity and counter-terrorism.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2019 13:54:57 GMT"}, {"version": "v2", "created": "Tue, 21 Jul 2020 16:53:28 GMT"}], "update_date": "2020-07-22", "authors_parsed": [["Ekin", "Tahir", ""], ["Naveiro", "Roi", ""], ["Torres-Barrán", "Alberto", ""], ["Ríos-Insua", "David", ""]]}, {"id": "1910.04648", "submitter": "Bugra Caskurlu", "authors": "Bugra Caskurlu, Ozgun Ekici, Fatih Erdem Kizilkaya", "title": "On Existence of Equilibrium Under Social Coalition Structures", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a strategic form game a strategy profile is an equilibrium if no viable\ncoalition of agents (or players) benefits (in the Pareto sense) from jointly\nchanging their strategies. Weaker or stronger equilibrium notions can be\ndefined by considering various restrictions on coalition formation. In a Nash\nequilibrium, for instance, the assumption is that viable coalitions are\nsingletons, and in a super strong equilibrium, every coalition is viable.\nRestrictions on coalition formation can be justified by communication\nlimitations, coordination problems or institutional constraints. In this paper,\ninspired by social structures in various real-life scenarios, we introduce\ncertain restrictions on coalition formation, and on their basis we introduce a\nnumber of equilibrium notions. As an application we study our equilibrium\nnotions in resource selection games (RSGs), and we present a complete set of\nexistence and non-existence results for general RSGs and their important\nspecial cases.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2019 15:30:02 GMT"}], "update_date": "2019-10-11", "authors_parsed": [["Caskurlu", "Bugra", ""], ["Ekici", "Ozgun", ""], ["Kizilkaya", "Fatih Erdem", ""]]}, {"id": "1910.06228", "submitter": "Tommaso Bianchi", "authors": "Andrea Celli, Alberto Marchesi, Tommaso Bianchi, Nicola Gatti", "title": "Learning to Correlate in Multi-Player General-Sum Sequential Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of multi-player, general-sum games, there is an increasing\ninterest in solution concepts modeling some form of communication among\nplayers, since they can lead to socially better outcomes with respect to Nash\nequilibria, and may be reached through learning dynamics in a decentralized\nfashion. In this paper, we focus on coarse correlated equilibria (CCEs) in\nsequential games. First, we complete the picture on the complexity of finding\nsocial-welfare-maximizing CCEs by showing that the problem is not in Poly-APX\nunless P = NP. Furthermore, simple arguments show that CFR - working with\nbehavioral strategies - may not converge to a CCE. However, we devise a simple\nvariant (CFR-S) which provably converges to the set of CCEs, but may be\nempirically inefficient. Thus, we design a variant of the CFR algorithm (called\nCFR-Jr) which approaches the set of CCEs with a regret bound sub-linear in the\nsize of the game, and is shown to be dramatically faster than CFR-S and the\nstate-of-the-art algorithms to compute CCEs.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2019 15:55:33 GMT"}], "update_date": "2019-10-15", "authors_parsed": [["Celli", "Andrea", ""], ["Marchesi", "Alberto", ""], ["Bianchi", "Tommaso", ""], ["Gatti", "Nicola", ""]]}, {"id": "1910.06384", "submitter": "Georgios Birmpas", "authors": "Georgios Birmpas, Evangelos Markakis, Guido Sch\\\"afer", "title": "Cost Sharing over Combinatorial Domains: Complement-Free Cost Functions\n  and Beyond", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study mechanism design for combinatorial cost sharing. Imagine that\nmultiple items or services are available to be shared among a set of interested\nagents. The outcome of a mechanism in this setting consists of an assignment,\ndetermining for each item the set of players who are granted service, together\nwith respective payments. Although there are several works studying specialized\nversions of such problems, there has been almost no progress for general\ncombinatorial cost sharing domains until recently \\cite{DobzinskiO17}. The main\ngoal of our work is to further understand this interplay in terms of budget\nbalance and social cost approximation. Towards this, we provide a refinement of\ncross-monotonicity (trace-monotonicity) that is applicable to iterative\nmechanisms. The trace here refers to the order in which players become\nfinalized. On top of this, we also provide two parameterizations of cost\nfunctions which capture the behavior of their average cost-shares. Based on our\ntrace-monotonicity property, we design a scheme of ascending cost sharing\nmechanisms which is applicable to the combinatorial cost sharing setting with\nsymmetric submodular valuations. Using our first cost function\nparameterization, we identify conditions under which our mechanism is weakly\ngroup-strategyproof, $O(1)$-budget-balanced and $O(H_n)$-approximate with\nrespect to the social cost. Finally, we consider general valuation functions\nand exploit our second parameterization to derive a more fine-grained analysis\nof the Sequential Mechanism introduced by Moulin. This mechanism is budget\nbalanced by construction, but in general only guarantees a poor social cost\napproximation of $n$. We identify conditions under which the mechanism achieves\nimproved social cost approximation guarantees.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2019 19:05:10 GMT"}], "update_date": "2019-10-16", "authors_parsed": [["Birmpas", "Georgios", ""], ["Markakis", "Evangelos", ""], ["Schäfer", "Guido", ""]]}, {"id": "1910.06452", "submitter": "Gabriele Dragotto", "authors": "Margarida Carvalho, Gabriele Dragotto, Felipe Feijoo, Andrea Lodi,\n  Sriram Sankaranarayanan", "title": "When Nash Meets Stackelberg", "comments": "40 Pages and a computational appendix. Code is available on gitHub", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by international energy trade between countries with\nprofit-maximizing domestic producers, we analyze Nash games played among\nleaders of Stackelberg games (\\NASP). We prove it is both $\\Sigma^p_2$-hard to\ndecide if the game has a pure-strategy (\\PNE) or a mixed-strategy Nash\nequilibrium (\\MNE). We then provide a finite algorithm that computes exact\n\\MNEs for \\NASPs when there is at least one, or returns a certificate if no\n\\MNE exists. To enhance computational speed, we introduce an inner\napproximation hierarchy that increasingly grows the description of each\nStackelberg leader feasible region. Furthermore, we extend the algorithmic\nframework to specifically retrieve a \\PNE if one exists. Finally, we provide\ncomputational tests on a range of \\NASPs instances inspired by international\nenergy trades.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2019 22:32:13 GMT"}, {"version": "v2", "created": "Sun, 22 Dec 2019 10:23:53 GMT"}, {"version": "v3", "created": "Tue, 21 Apr 2020 16:12:53 GMT"}, {"version": "v4", "created": "Thu, 18 Jun 2020 14:34:43 GMT"}], "update_date": "2020-06-19", "authors_parsed": [["Carvalho", "Margarida", ""], ["Dragotto", "Gabriele", ""], ["Feijoo", "Felipe", ""], ["Lodi", "Andrea", ""], ["Sankaranarayanan", "Sriram", ""]]}, {"id": "1910.06544", "submitter": "Armen Allahverdyan", "authors": "S.G. Babajanyan, K.H. Cheong, and A.E. Allahverdyan", "title": "Bargaining with entropy and energy", "comments": "4+6 pages, 5 figures, 1 table", "journal-ref": "Phys. Rev. Research 2, 043055 (2020)", "doi": "10.1103/PhysRevResearch.2.043055", "report-no": null, "categories": "cond-mat.stat-mech cs.GT physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statistical mechanics is based on interplay between energy minimization and\nentropy maximization. Here we formalize this interplay via axioms of\ncooperative game theory (Nash bargaining) and apply it out of equilibrium.\nThese axioms capture basic notions related to joint maximization of entropy and\nminus energy, formally represented by utilities of two different players. We\npredict thermalization of a non-equilibrium statistical system employing the\naxiom of affine covariance|related to the freedom of changing initial points\nand dimensions for entropy and energy|together with the contraction invariance\nof the entropy-energy diagram. Whenever the initial non-equilibrium state is\nactive, this mechanism allows thermalization to negative temperatures.\nDemanding a symmetry between players fixes the final state to a specific\npositive-temperature (equilibrium) state. The approach solves an important open\nproblem in the maximum entropy inference principle, {\\it viz.} generalizes it\nto the case when the constraint is not known precisely.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2019 05:55:09 GMT"}], "update_date": "2020-10-14", "authors_parsed": [["Babajanyan", "S. G.", ""], ["Cheong", "K. H.", ""], ["Allahverdyan", "A. E.", ""]]}, {"id": "1910.06559", "submitter": "Dong Quan Vu", "authors": "Dong Quan Vu, Patrick Loiseau and Alonso Silva", "title": "Approximate Equilibria in Generalized Colonel Blotto and Generalized\n  Lottery Blotto Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Colonel Blotto game, two players with a fixed budget simultaneously\nallocate their resources across n battlefields to maximize the aggregate value\ngained from the battlefields where they have the higher allocation. Despite its\nlong-standing history and important applications, the Colonel Blotto game still\nlacks a complete Nash equilibrium characterization in its most general form\nwhere players are asymmetric and battlefields' values are heterogeneous across\nbattlefields and different between the two players---this is called the\nGeneralized Colonel Blotto game. In this work, we propose a simply-constructed\nclass of strategies---the independently uniform strategies---and we prove that\nthey are approximate equilibria of the Generalized Colonel Blotto game;\nmoreover, we characterize the approximation error according to the game's\nparameters. We also consider an extension called the Generalized Lottery Blotto\ngame, with stochastic winner-determination rules allowing more flexibility in\nmodeling practical contests. We prove that the proposed strategies are also\napproximate equilibria of the Generalized Lottery Blotto game.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2019 06:55:05 GMT"}, {"version": "v2", "created": "Tue, 3 Nov 2020 13:53:22 GMT"}], "update_date": "2020-11-04", "authors_parsed": [["Vu", "Dong Quan", ""], ["Loiseau", "Patrick", ""], ["Silva", "Alonso", ""]]}, {"id": "1910.06729", "submitter": "Mauricio Gonzalez-Soto", "authors": "Mauricio Gonzalez-Soto, Luis E. Sucar, Hugo J. Escalante", "title": "Causal Games and Causal Nash Equilibrium", "comments": "arXiv admin note: substantial text overlap with arXiv:1907.11752", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classical results of Decision Theory, and its extension to a multi-agent\nsetting: Game Theory, operate only at the associative level of information;\nthis is, classical decision makers only take into account probabilities of\nevents; we go one step further and consider causal information: in this work,\nwe define Causal Decision Problems and extend them to a multi-agent decision\nproblem, which we call a causal game. For such games, we study belief updating\nin a class of strategic games in which any player's action causes some\nconsequence via a causal model, which is unknown by all players; for this\nreason, the most suitable model is Harsanyi's Bayesian Game. We propose a\nprobability updating for the Bayesian Game in such a way that the knowledge of\nany player in terms of probabilistic beliefs about the causal model, as well as\nwhat is caused by her actions as well as the actions of every other player are\ntaken into account. Based on such probability updating we define a Nash\nequilibria for Causal Games.\n", "versions": [{"version": "v1", "created": "Fri, 11 Oct 2019 19:24:12 GMT"}], "update_date": "2019-10-16", "authors_parsed": [["Gonzalez-Soto", "Mauricio", ""], ["Sucar", "Luis E.", ""], ["Escalante", "Hugo J.", ""]]}, {"id": "1910.07015", "submitter": "Annie Liang", "authors": "Annie Liang, Xiaosheng Mu, Vasilis Syrgkanis", "title": "Dynamically Aggregating Diverse Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An agent has access to multiple information sources, each of which provides\ninformation about a different attribute of an unknown state. Information is\nacquired continuously -- where the agent chooses both which sources to sample\nfrom, and also how to allocate attention across them -- until an endogenously\nchosen time, at which point a decision is taken. We provide an exact\ncharacterization of the optimal information acquisition strategy under weak\nconditions on the agent's prior belief about the different attributes. We then\napply this characterization to derive new results regarding: (1) endogenous\ninformation acquisition for binary choice, (2) strategic information provision\nby biased news sources, and (3) the dynamic consequences of attention\nmanipulation.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2019 19:34:28 GMT"}, {"version": "v2", "created": "Mon, 13 Jul 2020 00:35:43 GMT"}, {"version": "v3", "created": "Fri, 23 Apr 2021 23:21:08 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Liang", "Annie", ""], ["Mu", "Xiaosheng", ""], ["Syrgkanis", "Vasilis", ""]]}, {"id": "1910.07018", "submitter": "Annie Liang", "authors": "Annie Liang", "title": "Games of Incomplete Information Played By Statisticians", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Players are statistical learners who learn about payoffs from data. They may\ninterpret the same data differently, but have common knowledge of a class of\nlearning procedures. I propose a metric for the analyst's \"confidence\" in a\nstrategic prediction, based on the probability that the prediction is\nconsistent with the realized data. The main results characterize the analyst's\nconfidence in a given prediction as the quantity of data grows large, and\nprovide bounds for small datasets. The approach generates new predictions, e.g.\nthat speculative trade is more likely given high-dimensional data, and that\ncoordination is less likely given noisy data.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2019 19:39:01 GMT"}, {"version": "v2", "created": "Thu, 9 Jul 2020 20:44:55 GMT"}], "update_date": "2020-07-13", "authors_parsed": [["Liang", "Annie", ""]]}, {"id": "1910.07022", "submitter": "Annie Liang", "authors": "Drew Fudenberg, Jon Kleinberg, Annie Liang, Sendhil Mullainathan", "title": "Measuring the Completeness of Theories", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use machine learning to provide a tractable measure of the amount of\npredictable variation in the data that a theory captures, which we call its\n\"completeness.\" We apply this measure to three problems: assigning certain\nequivalents to lotteries, initial play in games, and human generation of random\nsequences. We discover considerable variation in the completeness of existing\nmodels, which sheds light on whether to focus on developing better models with\nthe same features or instead to look for new features that will improve\npredictions. We also illustrate how and why completeness varies with the\nexperiments considered, which highlights the role played in choosing which\nexperiments to run.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2019 19:46:54 GMT"}], "update_date": "2019-10-17", "authors_parsed": [["Fudenberg", "Drew", ""], ["Kleinberg", "Jon", ""], ["Liang", "Annie", ""], ["Mullainathan", "Sendhil", ""]]}, {"id": "1910.07287", "submitter": "Fabrizio Savarino", "authors": "Fabrizio Savarino, Christoph Schn\\\"orr", "title": "Continuous-Domain Assignment Flows", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.GT math.OC nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assignment flows denote a class of dynamical models for contextual data\nlabeling (classification) on graphs. We derive a novel parametrization of\nassignment flows that reveals how the underlying information geometry induces\ntwo processes for assignment regularization and for gradually enforcing\nunambiguous decisions, respectively, that seamlessly interact when solving for\nthe flow. Our result enables to characterize the dominant part of the\nassignment flow as a Riemannian gradient flow with respect to the underlying\ninformation geometry. We consider a continuous-domain formulation of the\ncorresponding potential and develop a novel algorithm in terms of solving a\nsequence of linear elliptic PDEs subject to a simple convex constraint. Our\nresult provides a basis for addressing learning problems by controlling such\nPDEs in future work.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2019 11:17:20 GMT"}], "update_date": "2019-10-17", "authors_parsed": [["Savarino", "Fabrizio", ""], ["Schnörr", "Christoph", ""]]}, {"id": "1910.07298", "submitter": "Pavel Naumov", "authors": "Pavel Naumov and Yuan Yuan", "title": "Intelligence in Strategic Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO cs.MA math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The article considers strategies of coalitions that are based on intelligence\ninformation about moves of some of the other agents. The main technical result\nis a sound and complete logical system that describes the interplay between\ncoalition power modality with intelligence and distributed knowledge modality\nin games with imperfect information.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2019 11:42:50 GMT"}], "update_date": "2019-10-17", "authors_parsed": [["Naumov", "Pavel", ""], ["Yuan", "Yuan", ""]]}, {"id": "1910.07498", "submitter": "Zuyue Fu", "authors": "Zuyue Fu, Zhuoran Yang, Yongxin Chen, Zhaoran Wang", "title": "Actor-Critic Provably Finds Nash Equilibria of Linear-Quadratic\n  Mean-Field Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LG cs.MA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study discrete-time mean-field Markov games with infinite numbers of\nagents where each agent aims to minimize its ergodic cost. We consider the\nsetting where the agents have identical linear state transitions and quadratic\ncost functions, while the aggregated effect of the agents is captured by the\npopulation mean of their states, namely, the mean-field state. For such a game,\nbased on the Nash certainty equivalence principle, we provide sufficient\nconditions for the existence and uniqueness of its Nash equilibrium. Moreover,\nto find the Nash equilibrium, we propose a mean-field actor-critic algorithm\nwith linear function approximation, which does not require knowing the model of\ndynamics. Specifically, at each iteration of our algorithm, we use the\nsingle-agent actor-critic algorithm to approximately obtain the optimal policy\nof the each agent given the current mean-field state, and then update the\nmean-field state. In particular, we prove that our algorithm converges to the\nNash equilibrium at a linear rate. To the best of our knowledge, this is the\nfirst success of applying model-free reinforcement learning with function\napproximation to discrete-time mean-field Markov games with provable\nnon-asymptotic global convergence guarantees.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2019 17:59:20 GMT"}], "update_date": "2019-10-17", "authors_parsed": [["Fu", "Zuyue", ""], ["Yang", "Zhuoran", ""], ["Chen", "Yongxin", ""], ["Wang", "Zhaoran", ""]]}, {"id": "1910.07780", "submitter": "Sagar Verma", "authors": "Sagar Verma and Richa Verma and P.B. Sujit", "title": "MAPEL: Multi-Agent Pursuer-Evader Learning using Situation Report", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we consider a territory guarding game involving pursuers,\nevaders and a target in an environment that contains obstacles. The goal of the\nevaders is to capture the target, while that of the pursuers is to capture the\nevaders before they reach the target. All the agents have limited sensing range\nand can only detect each other when they are in their observation space. We\nfocus on the challenge of effective cooperation between agents of a team.\nFinding exact solutions for such multi-agent systems is difficult because of\nthe inherent complexity. We present Multi-Agent Pursuer-Evader Learning\n(MAPEL), a class of algorithms that use spatio-temporal graph representation to\nlearn structured cooperation. The key concept is that the learning takes place\nin a decentralized manner and agents use situation report updates to learn\nabout the whole environment from each others' partial observations. We use\nRecurrent Neural Networks (RNNs) to parameterize the spatio-temporal graph. An\nagent in MAPEL only updates all the other agents if an opponent or the target\nis inside its observation space by using situation report. We present two\nmethods for cooperation via situation report update: a) Peer-to-Peer Situation\nReport (P2PSR) and b) Ring Situation Report (RSR). We present a detailed\nanalysis of how these two cooperation methods perform when the number of agents\nin the game are increased. We provide empirical results to show how agents\ncooperate under these two methods.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2019 09:16:11 GMT"}], "update_date": "2019-10-18", "authors_parsed": [["Verma", "Sagar", ""], ["Verma", "Richa", ""], ["Sujit", "P. B.", ""]]}, {"id": "1910.07858", "submitter": "Alain Govaert", "authors": "Alain Govaert and Ming Cao", "title": "Zero-Determinant strategies in repeated multiplayer social dilemmas with\n  discounted payoffs", "comments": "14 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In two-player repeated games, Zero-Determinant (ZD) strategies enable a\nplayer to unilaterally enforce a linear payoff relation between her own and her\nopponent's payoff irrespective of the opponent's strategy. This manipulative\nnature of the ZD strategies attracted significant attention from researchers\ndue to its close connection to controlling distributively the outcome of\nevolutionary games in large populations. In this paper, necessary and\nsufficient conditions are derived for a payoff relation to be enforceable in\nmultiplayer social dilemmas with a finite expected number of rounds that is\ndetermined by a fixed and common discount factor. Thresholds exist for such a\ndiscount factor above which desired payoff relations can be enforced. Our\nresults show that depending on the group size and the ZD-strategist's initial\nprobability to cooperate there exist extortionate, generous and equalizer\nZD-strategies. The threshold discount factors rely on the desired payoff\nrelation and the variation in the single-round payoffs. To show the utility of\nour results, we apply them to multiplayer social dilemmas, and show how\ndiscounting affects ZD Nash equilibria.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2019 12:36:33 GMT"}, {"version": "v2", "created": "Wed, 29 Apr 2020 09:33:30 GMT"}], "update_date": "2020-04-30", "authors_parsed": [["Govaert", "Alain", ""], ["Cao", "Ming", ""]]}, {"id": "1910.08647", "submitter": "Pavel Naumov", "authors": "Pavel Naumov and Jia Tao", "title": "Blameworthiness in Security Games", "comments": "34th AAAI Conference on Artificial Intelligence (AAAI-20), February\n  7-12, 2020, New York, New York, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security games are an example of a successful real-world application of game\ntheory. The paper defines blameworthiness of the defender and the attacker in\nsecurity games using the principle of alternative possibilities and provides a\nsound and complete logical system for reasoning about blameworthiness in such\ngames. Two of the axioms of this system capture the asymmetry of information in\nsecurity games.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2019 22:22:35 GMT"}, {"version": "v2", "created": "Mon, 11 Nov 2019 20:50:51 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Naumov", "Pavel", ""], ["Tao", "Jia", ""]]}, {"id": "1910.08719", "submitter": "Hareesh Kumar", "authors": "Hareesh Kumar, Priyanka Mary Mammen, Krithi Ramamritham", "title": "Explainable AI: Deep Reinforcement Learning Agents for Residential\n  Demand Side Cost Savings in Smart Grids", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.GT stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Motivated by recent advancements in Deep Reinforcement Learning (RL), we have\ndeveloped an RL agent to manage the operation of storage devices in a household\nand is designed to maximize demand-side cost savings. The proposed technique is\ndata-driven, and the RL agent learns from scratch how to efficiently use the\nenergy storage device given variable tariff structures. In most of the studies,\nthe RL agent is considered as a black box, and how the agent has learned is\noften ignored. We explain the learning progression of the RL agent, and the\nstrategies it follows based on the capacity of the storage device.\n", "versions": [{"version": "v1", "created": "Sat, 19 Oct 2019 07:57:54 GMT"}, {"version": "v2", "created": "Wed, 30 Oct 2019 17:39:15 GMT"}], "update_date": "2019-10-31", "authors_parsed": [["Kumar", "Hareesh", ""], ["Mammen", "Priyanka Mary", ""], ["Ramamritham", "Krithi", ""]]}, {"id": "1910.08744", "submitter": "Sergey Ketkov", "authors": "Sergey S. Ketkov, Oleg A. Prokopyev, Evgenii P. Burashnikov", "title": "An approach to the distributionally robust shortest path problem", "comments": "37 pages", "journal-ref": null, "doi": "10.1016/j.cor.2021.105212", "report-no": null, "categories": "math.OC cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In this study we consider the shortest path problem, where the arc costs are\nsubject to distributional uncertainty. Basically, the decision-maker attempts\nto minimize her worst-case expected loss over an ambiguity set (or a family) of\ncandidate distributions that are consistent with the decision-maker's initial\ninformation. The ambiguity set is formed by all distributions that satisfy\nprescribed linear first-order moment constraints with respect to subsets of\narcs and individual probability constraints with respect to particular arcs.\nUnder some additional assumptions the resulting distributionally robust\nshortest path problem (DRSPP) admits equivalent robust and mixed-integer\nprogramming (MIP) reformulations. The robust reformulation is shown to be\n$NP$-hard, whereas the problem without the first-order moment constraints is\nproved to be polynomially solvable. We perform numerical experiments to\nillustrate the advantages of the considered approach; we also demonstrate that\nthe MIP reformulation of DRSPP can be solved effectively using off-the-shelf\nsolvers.\n", "versions": [{"version": "v1", "created": "Sat, 19 Oct 2019 11:02:08 GMT"}, {"version": "v2", "created": "Thu, 9 Apr 2020 15:54:28 GMT"}, {"version": "v3", "created": "Mon, 5 Oct 2020 09:40:21 GMT"}, {"version": "v4", "created": "Thu, 18 Feb 2021 19:44:03 GMT"}, {"version": "v5", "created": "Fri, 12 Mar 2021 21:12:46 GMT"}], "update_date": "2021-03-16", "authors_parsed": [["Ketkov", "Sergey S.", ""], ["Prokopyev", "Oleg A.", ""], ["Burashnikov", "Evgenii P.", ""]]}, {"id": "1910.08820", "submitter": "Rainer B\\\"ohme", "authors": "Bryan Ford and Rainer B\\\"ohme", "title": "Rationality is Self-Defeating in Permissionless Systems", "comments": "First posted on September 23, 2019 at\n  https://bford.info/2019/09/23/rational/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We outline a metacircular argument explaining why it is rational to be\nirrational when attacking open-world decentralized systems, and why systems\nwhose security depend on rationality assumptions are insecure.\n", "versions": [{"version": "v1", "created": "Sat, 19 Oct 2019 19:01:40 GMT"}], "update_date": "2019-10-22", "authors_parsed": [["Ford", "Bryan", ""], ["Böhme", "Rainer", ""]]}, {"id": "1910.08929", "submitter": "Armen Allahverdyan", "authors": "S.G. Babajanyan, A.V. Melkikh, and A.E. Allahverdyan", "title": "Leadership scenarios in prisoner's dilemma game", "comments": "15 pages, 4 figures", "journal-ref": "Physica A (2019)", "doi": "10.1016/j.physa.2019.123020", "report-no": null, "categories": "physics.soc-ph cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The prisoner's dilemma game is the most known contribution of game theory\ninto social sciences. Here we describe new implications of this game for\ntransactional and transformative leadership. While the autocratic\n(Stackelberg's) leadership is inefficient for this game, we discuss a\nPareto-optimal scenario, where the leader L commits to react probabilistically\nto pure strategies of the follower F, which is free to make the first move.\nOffering F to resolve the dilemma, L is able to get a larger average pay-off.\nThe exploitation can be stabilized via repeated interaction of L and F, and\nturns to be more stable than the egalitarian regime, where the pay-offs of L\nand F are equal. The total (summary) pay-off of the exploiting regime is never\nlarger than in the egalitarian case. We discuss applications of this solution\nto a soft method of fighting corruption and to modeling the Machiavellian\nleadership. Whenever the defection benefit is large, the optimal strategies of\nF are mixed, while the summary pay-off is maximal. One mechanism for sustaining\nthis solution is that L recognizes intentions of F.\n", "versions": [{"version": "v1", "created": "Sun, 20 Oct 2019 08:45:16 GMT"}], "update_date": "2019-10-22", "authors_parsed": [["Babajanyan", "S. G.", ""], ["Melkikh", "A. V.", ""], ["Allahverdyan", "A. E.", ""]]}, {"id": "1910.08953", "submitter": "Sven Rady", "authors": "Johannes H\\\"orner, Nicolas Klein, Sven Rady", "title": "Overcoming Free-Riding in Bandit Games", "comments": "66 pages, 4 figures; slightly revised introduction; accepted for\n  publication in Review of Economic Studies", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a class of experimentation games with L\\'{e}vy bandits\nencompassing those of Bolton and Harris (1999) and Keller, Rady and Cripps\n(2005). Its main result is that efficient (perfect Bayesian) equilibria exist\nwhenever players' payoffs have a diffusion component. Hence, the trade-offs\nemphasized in the literature do not rely on the intrinsic nature of bandit\nmodels but on the commonly adopted solution concept (MPE). This is not an\nartifact of continuous time: we prove that efficient equilibria arise as limits\nof equilibria in the discrete-time game. Furthermore, it suffices to relax the\nsolution concept to strongly symmetric equilibrium.\n", "versions": [{"version": "v1", "created": "Sun, 20 Oct 2019 11:47:21 GMT"}, {"version": "v2", "created": "Thu, 10 Dec 2020 11:19:24 GMT"}, {"version": "v3", "created": "Mon, 1 Mar 2021 20:47:09 GMT"}], "update_date": "2021-03-03", "authors_parsed": [["Hörner", "Johannes", ""], ["Klein", "Nicolas", ""], ["Rady", "Sven", ""]]}, {"id": "1910.09089", "submitter": "Akshayaa Magesh", "authors": "Akshayaa Magesh and Venugopal V. Veeravalli", "title": "Decentralized Heterogeneous Multi-Player Multi-Armed Bandits with\n  Non-Zero Rewards on Collisions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider a fully decentralized multi-player stochastic multi-armed bandit\nsetting where the players cannot communicate with each other and can observe\nonly their own actions and rewards. The environment may appear differently to\ndifferent players, $\\textit{i.e.}$, the reward distributions for a given arm\nare heterogeneous across players. In the case of a collision (when more than\none player plays the same arm), we allow for the colliding players to receive\nnon-zero rewards. The time-horizon $T$ for which the arms are played is\n\\emph{not} known to the players. Within this setup, where the number of players\nis allowed to be greater than the number of arms, we present a policy that\nachieves near order-optimal expected regret of order $O(\\log^{1 + \\delta} T)$\nfor some $0 < \\delta < 1$ over a time-horizon of duration $T$.\n  This paper is currently under review at IEEE Transactions on Information\nTheory.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 00:27:55 GMT"}, {"version": "v2", "created": "Wed, 28 Oct 2020 10:37:18 GMT"}, {"version": "v3", "created": "Tue, 19 Jan 2021 16:18:21 GMT"}], "update_date": "2021-01-20", "authors_parsed": [["Magesh", "Akshayaa", ""], ["Veeravalli", "Venugopal V.", ""]]}, {"id": "1910.09268", "submitter": "Wen Zhang", "authors": "Wen Zhang, Dengji Zhao, Yao Zhang", "title": "Incentivize Diffusion with Fair Rewards", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a sale promotion mechanism design problem on a social\nnetwork, where a node (a seller) sells one item to the other nodes on the\nnetwork to maximize her revenue. However, the seller does not know other nodes\nexcept for her neighbours and her neighbours have no incentive to promote the\nsale. Hence, the goal is to design an auction mechanism such that the seller's\nneighbours are incentivized to invite their neighbours to join the auction,\nwhile the seller's revenue is guaranteed to increase. This is not achievable\nwith traditional mechanisms. One solution has been proposed recently by\ncarefully designing a reward scheme for the nodes who have invited others.\nHowever, the solution only gives rewards to some cut-points of the network, but\ncut-points rarely exist in a well-connected network, which actually\ndisincentivizes nodes' participation. Therefore, we propose another novel\nmechanism to reward more related participants with fairer rewards, and the\nseller's revenue is not reduced.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 11:41:47 GMT"}, {"version": "v2", "created": "Thu, 27 Feb 2020 13:51:31 GMT"}], "update_date": "2020-02-28", "authors_parsed": [["Zhang", "Wen", ""], ["Zhao", "Dengji", ""], ["Zhang", "Yao", ""]]}, {"id": "1910.09276", "submitter": "Ezra Tampubolon", "authors": "Ezra Tampubolon and Holger Boche", "title": "Semi-Decentralized Coordinated Online Learning for Continuous Games with\n  Coupled Constraints via Augmented Lagrangian", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG cs.SY eess.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a class of concave continuous games in which the corresponding\nadmissible strategy profile of each player underlies affine coupling\nconstraints. We propose a novel algorithm that leads the relevant population\ndynamic toward Nash equilibrium. This algorithm is based on a mirror ascent\nalgorithm, which suits with the framework of no-regret online learning, and on\nthe augmented Lagrangian method. The decentralization aspect of the algorithm\ncorresponds to the aspects that the iterate of each player requires the local\ninformation about how she contributes to the coupling constraints and the price\nvector broadcasted by a central coordinator. So each player needs not know\nabout the population action. Moreover, no specific control by the central\nprimary coordinator is required. We give a condition on the step sizes and the\ndegree of the augmentation of the Lagrangian, such that the proposed algorithm\nconverges to a generalized Nash equilibrium.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 11:55:39 GMT"}], "update_date": "2019-10-22", "authors_parsed": [["Tampubolon", "Ezra", ""], ["Boche", "Holger", ""]]}, {"id": "1910.09314", "submitter": "Ezra Tampubolon", "authors": "Ezra Tampubolon and Holger Boche", "title": "Pricing Mechanism for Resource Sustainability in Competitive Online\n  Learning Multi-Agent Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT cs.MA cs.SY econ.TH eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the problem of resource congestion control for\ncompeting online learning agents. On the basis of non-cooperative game as the\nmodel for the interaction between the agents, and the noisy online mirror\nascent as the model for rational behavior of the agents, we propose a novel\npricing mechanism which gives the agents incentives for sustainable use of the\nresources. Our mechanism is distributed and resource-centric, in the sense that\nit is done by the resources themselves and not by a centralized instance, and\nthat it is based rather on the congestion state of the resources than the\npreferences of the agents. In case that the noise is persistent, and for\nseveral choices of the intrinsic parameter of the agents, such as their\nlearning rate, and of the mechanism parameters, such as the learning rate of -,\nthe progressivity of the price-setters, and the extrinsic price sensitivity of\nthe agents, we show that the accumulative violation of the resource constraints\nof the resulted iterates is sub-linear w.r.t. the time horizon. Moreover, we\nprovide numerical simulations to support our theoretical findings.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 12:49:00 GMT"}], "update_date": "2019-10-22", "authors_parsed": [["Tampubolon", "Ezra", ""], ["Boche", "Holger", ""]]}, {"id": "1910.09335", "submitter": "Wen Zhang", "authors": "Wen Zhang, Dengji Zhao, Hanyu Chen", "title": "Redistribution Mechanism on Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Redistribution mechanisms have been proposed for more efficient resource\nallocation but not for profit. We consider redistribution mechanism design in a\nsetting where participants are connected and the resource owner is only\nconnected to some of them. In this setting, to make the resource allocation\nmore efficient, the resource owner has to inform the others who are not her\nneighbours, but her neighbours do not want more participants to compete with\nthem. Hence, the goal is to design a redistribution mechanism such that\nparticipants are incentivized to invite more participants and the resource\nowner does not earn or lose much money from the allocation. We first show that\nexisting redistribution mechanisms cannot be directly applied in the network\nsetting and prove the impossibility to achieve efficiency without a deficit.\nThen we propose a novel network-based redistribution mechanism such that all\nparticipants on the network are invited, the allocation is more efficient and\nthe resource owner has no deficit.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 13:06:23 GMT"}, {"version": "v2", "created": "Thu, 27 Feb 2020 13:38:19 GMT"}], "update_date": "2020-02-28", "authors_parsed": [["Zhang", "Wen", ""], ["Zhao", "Dengji", ""], ["Chen", "Hanyu", ""]]}, {"id": "1910.09713", "submitter": "Simon Le Cleac'h", "authors": "Simon Le Cleac'h, Mac Schwager, Zachary Manchester", "title": "ALGAMES: A Fast Solver for Constrained Dynamic Games", "comments": "10 pages, 8 figures, submitted to Robotics: Science and Systems\n  Conference (RSS) 2020", "journal-ref": "Proceedings of Robotics: Science and Systems, 2020", "doi": "10.15607/RSS.2020.XVI.091", "report-no": null, "categories": "cs.RO cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamic games are an effective paradigm for dealing with the control of\nmultiple interacting actors. This paper introduces ALGAMES (Augmented\nLagrangian GAME-theoretic Solver), a solver that handles trajectory\noptimization problems with multiple actors and general nonlinear state and\ninput constraints. Its novelty resides in satisfying the first order optimality\nconditions with a quasi-Newton root-finding algorithm and rigorously enforcing\nconstraints using an augmented Lagrangian formulation. We evaluate our solver\nin the context of autonomous driving on scenarios with a strong level of\ninteractions between the vehicles. We assess the robustness of the solver using\nMonte Carlo simulations. It is able to reliably solve complex problems like\nramp merging with three vehicles three times faster than a state-of-the-art\nDDP-based approach. A model predictive control (MPC) implementation of the\nalgorithm demonstrates real-time performance on complex autonomous driving\nscenarios with an update frequency higher than 60 Hz.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2019 00:44:37 GMT"}, {"version": "v2", "created": "Tue, 18 Feb 2020 22:55:48 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Cleac'h", "Simon Le", ""], ["Schwager", "Mac", ""], ["Manchester", "Zachary", ""]]}, {"id": "1910.09895", "submitter": "Quang Vinh Dang", "authors": "Claudia-Lavinia Ignat (COAST), Quang-Vinh Dang (COAST), Valerie Shalin", "title": "The Influence of Trust Score on Cooperative Behavior", "comments": null, "journal-ref": "ACM Transactions on Internet Technology, Association for Computing\n  Machinery, 2019, 19 (4), pp.1-22", "doi": "10.1145/3329250", "report-no": null, "categories": "cs.GT cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The assessment of trust between users is essential for collaboration. General\nreputation and ID mechanisms may support users' trust assessment. However,\nthese mechanisms lack sensitivity to pairwise interactions and specific\nexperience such as betrayal over time. Moreover, they place an interpretation\nburden that does not scale to dynamic, large-scale systems. While several\npairwise trust mechanisms have been proposed, no empirical research examines\ntrust score influence on participant behavior. We study the influence of\nshowing a partner trust score and/or ID on participants' behavior in a\nsmall-group collaborative laboratory experiment based on the trust game. We\nshow that trust score availability has the same effect as an ID to improve\ncooperation as measured by sending behavior and receiver response. Excellent\nmodels based on the trust score predict sender behavior and document\nparticipant sensitivity to the provision of partner information. Models based\non the trust score for recipient behavior have some predictive ability\nregarding trustworthiness, but suggest the need for more complex functions\nrelating experience to participant response. We conclude that the parameters of\na trust score, including pairwise interactions and betrayal, influence the\ndifferent roles of participants in the trust game differently, but complement\ntraditional ID and have the advantage of scalability.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2019 11:17:50 GMT"}], "update_date": "2019-10-23", "authors_parsed": [["Ignat", "Claudia-Lavinia", "", "COAST"], ["Dang", "Quang-Vinh", "", "COAST"], ["Shalin", "Valerie", ""]]}, {"id": "1910.10272", "submitter": "Carlo Cenedese", "authors": "Carlo Cenedese, Filippo Fabiani, Michele Cucuzzella, Jacquelien M. A.\n  Scherpen, Ming Cao and Sergio Grammatico", "title": "Charging plug-in electric vehicles as a mixed-integer aggregative game", "comments": "Accepted to the 58th IEEE Conference on Decision and Control 2019\n  Nice", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the charge scheduling coordination of a fleet of plug-in electric\nvehicles, developing a hybrid decision-making framework for efficient and\nprofitable usage of the distribution grid. Each charging dynamics, affected by\nthe aggregate behavior of the whole fleet, is modelled as an inter-dependent,\nmixed-logical-dynamical system. The coordination problem is formalized as a\ngeneralized mixed-integer aggregative potential game, and solved via\nsemi-decentralized implementation of a sequential best-response algorithm that\nleads to an approximated equilibrium of the game.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2019 23:15:38 GMT"}], "update_date": "2019-10-24", "authors_parsed": [["Cenedese", "Carlo", ""], ["Fabiani", "Filippo", ""], ["Cucuzzella", "Michele", ""], ["Scherpen", "Jacquelien M. A.", ""], ["Cao", "Ming", ""], ["Grammatico", "Sergio", ""]]}, {"id": "1910.10523", "submitter": "Fuhui Zhou", "authors": "Fuhui Zhou, Rose Qingyang Hu, Zan Li and Yuhao Wang", "title": "Mobile Edge Computing in Unmanned Aerial Vehicle Networks", "comments": "This paper has been accepted by IEEE Wireless Communications magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unmanned aerial vehicle (UAV)-enabled communication networks are promising in\nthe fifth and beyond wireless communication systems. In this paper, we shed\nlight on three UAV-enabled mobile edge computing (MEC) architectures. Those\narchitectures have been receiving ever increasing research attention for\nimproving computation performance and decreasing execution latency by\nintegrating UAV into MEC networks. We present a comprehensive survey for the\nstate-of-the-art research in this domain. Important implementation issues are\nclarified. Moreover, in order to provide an enlightening guidance for future\nresearch directions, key challenges and open issues are discussed.\n", "versions": [{"version": "v1", "created": "Sat, 12 Oct 2019 05:32:30 GMT"}], "update_date": "2019-10-24", "authors_parsed": [["Zhou", "Fuhui", ""], ["Hu", "Rose Qingyang", ""], ["Li", "Zan", ""], ["Wang", "Yuhao", ""]]}, {"id": "1910.10906", "submitter": "Gabriele Farina", "authors": "Gabriele Farina and Christian Kroer and Tuomas Sandholm", "title": "Optimistic Regret Minimization for Extensive-Form Games via Dilated\n  Distance-Generating Functions", "comments": "Extended NeurIPS 2019 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the performance of optimistic regret-minimization algorithms for\nboth minimizing regret in, and computing Nash equilibria of, zero-sum\nextensive-form games. In order to apply these algorithms to extensive-form\ngames, a distance-generating function is needed. We study the use of the\ndilated entropy and dilated Euclidean distance functions. For the dilated\nEuclidean distance function we prove the first explicit bounds on the\nstrong-convexity parameter for general treeplexes. Furthermore, we show that\nthe use of dilated distance-generating functions enable us to decompose the\nmirror descent algorithm, and its optimistic variant, into local mirror descent\nalgorithms at each information set. This decomposition mirrors the structure of\nthe counterfactual regret minimization framework, and enables important\ntechniques in practice, such as distributed updates and pruning of cold parts\nof the game tree. Our algorithms provably converge at a rate of $T^{-1}$, which\nis superior to prior counterfactual regret minimization algorithms. We\nexperimentally compare to the popular algorithm CFR+, which has a theoretical\nconvergence rate of $T^{-0.5}$ in theory, but is known to often converge at a\nrate of $T^{-1}$, or better, in practice. We give an example matrix game where\nCFR+ experimentally converges at a relatively slow rate of $T^{-0.74}$, whereas\nour optimistic methods converge faster than $T^{-1}$. We go on to show that our\nfast rate also holds in the Kuhn poker game, which is an extensive-form game.\nFor games with deeper game trees however, we find that CFR+ is still faster.\nFinally we show that when the goal is minimizing regret, rather than computing\na Nash equilibrium, our optimistic methods can outperform CFR+, even in deep\ngame trees.\n", "versions": [{"version": "v1", "created": "Thu, 24 Oct 2019 04:08:22 GMT"}, {"version": "v2", "created": "Mon, 28 Oct 2019 06:24:17 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Farina", "Gabriele", ""], ["Kroer", "Christian", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "1910.11613", "submitter": "Mattia Bianchi", "authors": "Mattia Bianchi, Giuseppe Belgioioso and Sergio Grammatico", "title": "A fully-distributed proximal-point algorithm for Nash equilibrium\n  seeking with linear convergence rate", "comments": "To appear in the 59th Conference on Decision and Control (CDC 2020)", "journal-ref": null, "doi": "10.1109/CDC42340.2020.9304145", "report-no": null, "categories": "math.OC cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the Nash equilibrium problem in a partial-decision information\nscenario, where each agent can only observe the actions of some neighbors,\nwhile its cost possibly depends on the strategies of other agents. Our main\ncontribution is the design of a fully-distributed, single-layer, fixed-step\nalgorithm, based on a proximal best-response augmented with consensus terms. To\nderive our algorithm, we follow an operator-theoretic approach. First, we\nrecast the Nash equilibrium problem as that of finding a zero of a monotone\noperator. Then, we demonstrate that the resulting inclusion can be solved in a\nfully-distributed way via a proximal-point method, thanks to the use of a novel\npreconditioning matrix. Under strong monotonicity and Lipschitz continuity of\nthe game mapping, We prove linear convergence of our algorithm to a Nash\nequilibrium. Furthermore, we show that our method outperforms the fastest known\ngradient-based schemes, both in terms of guaranteed convergence rate, via\ntheoretical analysis, and in practice, via numerical simulations.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2019 10:45:26 GMT"}, {"version": "v2", "created": "Sat, 23 May 2020 14:06:30 GMT"}, {"version": "v3", "created": "Thu, 10 Sep 2020 16:34:11 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Bianchi", "Mattia", ""], ["Belgioioso", "Giuseppe", ""], ["Grammatico", "Sergio", ""]]}, {"id": "1910.11693", "submitter": "Robert Gilles", "authors": "Robert P. Gilles", "title": "Building social networks under consent: A survey", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This survey explores the literature on game-theoretic models of network\nformation under the hypothesis of mutual consent in link formation. The\nintroduction of consent in link formation imposes a coordination problem in the\nnetwork formation process. This survey explores the conclusions from this\ntheory and the various methodologies to avoid the main pitfalls. The main\ninsight originates from Myerson's work on mutual consent in link formation and\nhis main conclusion that the empty network (the network without any links)\nalways emerges as a strong Nash equilibrium in any game-theoretic model of\nnetwork formation under mutual consent and positive link formation costs.\nJackson and Wolinsky introduced a cooperative framework to avoid this main\npitfall. They devised the notion of a pairwise stable network to arrive at\nequilibrium networks that are mainly non-trivial. Unfortunately, this notion of\npairwise stability requires coordinated action by pairs of decision makers in\nlink formation. I survey the possible solutions in a purely non-cooperative\nframework of network formation under mutual consent by exploring potential\nrefinements of the standard Nash equilibrium concept to explain the emergence\nof non-trivial networks. This includes the notions of unilateral and monadic\nstability. The first one is founded on advanced rational reasoning of\nindividuals about how others would respond to one's efforts to modify the\nnetwork. The latter incorporates trusting, boundedly rational behaviour into\nthe network formation process. The survey is concluded with an initial\nexploration of external correlation devices as an alternative framework to\naddress mutual consent in network formation.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2019 13:04:55 GMT"}, {"version": "v2", "created": "Sat, 11 Apr 2020 10:38:04 GMT"}], "update_date": "2020-04-14", "authors_parsed": [["Gilles", "Robert P.", ""]]}, {"id": "1910.11737", "submitter": "Dengji Zhao", "authors": "Dengji Zhao, Yiqing Huang, Liat Cohen, Tal Grinshpoun", "title": "Coalitional Games with Stochastic Characteristic Functions and Private\n  Types", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The research on coalitional games has focused on how to share the reward\namong a coalition such that players are incentivised to collaborate together.\nIt assumes that the (deterministic or stochastic) characteristic function is\nknown in advance. This paper studies a new setting (a task allocation problem)\nwhere the characteristic function is not known and it is controlled by some\nprivate information from the players. Hence, the challenge here is twofold: (i)\nincentivize players to reveal their private information truthfully, (ii)\nincentivize them to collaborate together. We show that existing reward\ndistribution mechanisms or auctions cannot solve the challenge. Hence, we\npropose the very first mechanism for the problem from the perspective of both\nmechanism design and coalitional games.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2019 14:06:09 GMT"}], "update_date": "2019-10-28", "authors_parsed": [["Zhao", "Dengji", ""], ["Huang", "Yiqing", ""], ["Cohen", "Liat", ""], ["Grinshpoun", "Tal", ""]]}, {"id": "1910.11776", "submitter": "Barbara Franci Dott.", "authors": "Barbara Franci and Sergio Grammatico", "title": "A damped forward-backward algorithm for stochastic generalized Nash\n  equilibrium seeking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a stochastic generalized Nash equilibrium problem (GNEP) with\nexpected-value cost functions. Inspired by Yi and Pavel (Automatica, 2019), we\npropose a distributed GNE seeking algorithm by exploiting the forward-backward\noperator splitting and a suitable preconditioning matrix. Specifically, we\napply this method to the stochastic GNEP, where, at each iteration, the\nexpected value of the pseudo-gradient is approximated via a number of random\nsamples. Our main contribution is to show almost sure convergence of our\nproposed algorithm if the sample size grows large enough.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2019 14:55:38 GMT"}, {"version": "v2", "created": "Fri, 14 Feb 2020 15:20:58 GMT"}], "update_date": "2020-02-17", "authors_parsed": [["Franci", "Barbara", ""], ["Grammatico", "Sergio", ""]]}, {"id": "1910.11927", "submitter": "Ajay Shrestha", "authors": "Ajay Kumar Shrestha, Julita Vassileva", "title": "User Data Sharing Frameworks: A Blockchain-Based Incentive Solution", "comments": "7 pages, 4 figure, 1 table, IEEE IEMCON 2019 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY cs.DB cs.GT cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently, there is no universal method to track who shared what, with whom,\nwhen and for what purposes in a verifiable way to create an individual\nincentive for data owners. A platform that allows data owners to control,\ndelete, and get rewards from sharing their data would be an important enabler\nof user data-sharing. We propose a usable blockchain- and smart contracts-based\nframework that allows users to store research data locally and share without\nlosing control and ownership of it. We have created smart contracts for\nbuilding automatic verification of the conditions for data access that also\nnaturally supports building up a verifiable record of the provenance,\nincentives for users to share their data and accountability of access. The\npaper presents a review of the existing work of research data sharing, the\nproposed blockchain-based framework and an evaluation of the framework by\nmeasuring the transaction cost for smart contracts deployment. The results show\nthat nodes responded quickly in all tested cases with a befitting transaction\ncost.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2019 20:39:43 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Shrestha", "Ajay Kumar", ""], ["Vassileva", "Julita", ""]]}, {"id": "1910.12022", "submitter": "Chulwook Park", "authors": "Chulwook Park", "title": "Network Characteristics Control Social Dilemmas in a Public Good Game: A\n  Mechanical Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Purpose: We propose a model to present a possible mechanism for obtaining\nsizeable behavioural structures by simulating an agent based on the\nevolutionary public good game with available social learning. Methods: The\nmodel considered a population with a fixed number of players. For each round,\nthe chosen players may contribute part of their value to a common pool. Then\neach player may imitate the strategy of another player, based on relative\npayoffs (whoever has the lower payoff adopts the strategy of the other player)\nand change strategy using different exploratory variables. Results: Relative\npayoffs are subject to incentive, including participation costs, but are also\nsubject to mutation, the rate of which is sensitized by network characteristics\n(social ties). Values: The process covered by this study is of interest and is\nrelevant across a broad range of disciplines that use game theory, including\nthe framework of cultural evolutionary dynamics.\n", "versions": [{"version": "v1", "created": "Sat, 26 Oct 2019 08:45:44 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Park", "Chulwook", ""]]}, {"id": "1910.12075", "submitter": "Zehao Dou", "authors": "Zehao Dou, Xiang Yan, Dongge Wang and Xiaotie Deng", "title": "Finding Mixed Strategy Nash Equilibrium for Continuous Games through\n  Deep Learning", "comments": "11pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nash equilibrium has long been a desired solution concept in multi-player\ngames, especially for those on continuous strategy spaces, which have attracted\na rapidly growing amount of interests due to advances in research applications\nsuch as the generative adversarial networks. Despite the fact that several deep\nlearning based approaches are designed to obtain pure strategy Nash\nequilibrium, it is rather luxurious to assume the existence of such an\nequilibrium. In this paper, we present a new method to approximate mixed\nstrategy Nash equilibria in multi-player continuous games, which always exist\nand include the pure ones as a special case. We remedy the pure strategy\nweakness by adopting the pushforward measure technique to represent a mixed\nstrategy in continuous spaces. That allows us to generalize the Gradient-based\nNikaido-Isoda (GNI) function to measure the distance between the players' joint\nstrategy profile and a Nash equilibrium. Applying the gradient descent\nalgorithm, our approach is shown to converge to a stationary Nash equilibrium\nunder the convexity assumption on payoff functions, the same popular setting as\nin previous studies. In numerical experiments, our method consistently and\nsignificantly outperforms recent works on approximating Nash equilibrium for\nquadratic games, general blotto games, and GAMUT games.\n", "versions": [{"version": "v1", "created": "Sat, 26 Oct 2019 14:37:49 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Dou", "Zehao", ""], ["Yan", "Xiang", ""], ["Wang", "Dongge", ""], ["Deng", "Xiaotie", ""]]}, {"id": "1910.12131", "submitter": "Ilan Nehama", "authors": "Ilan Nehama", "title": "Almost Quasi-linear Utilities in Disguise: Positive-representation An\n  Extension of Roberts' Theorem", "comments": "An extended abstract of this work is forthcoming in: The 15th\n  Conference on Web and Internet Economics (WINE 2019)", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work deals with the implementation of social choice rules using dominant\nstrategies for unrestricted preferences. The seminal Gibbard-Satterthwaite\ntheorem shows that only few unappealing social choice rules can be implemented\nunless we assume some restrictions on the preferences or allow monetary\ntransfers. When monetary transfers are allowed and quasi-linear utilities\nw.r.t. money are assumed, Vickrey-Clarke-Groves (VCG) mechanisms were shown to\nimplement any affine-maximizer, and by the work of Roberts, only\naffine-maximizers can be implemented whenever the type sets of the agents are\nrich enough.\n  In this work, we generalize these results and define a new class of\npreferences: Preferences which are positive-represented by a quasi-linear\nutility. That is, agents whose preference on a subspace of the outcomes can be\nmodeled using a quasi-linear utility. We show that the characterization of VCG\nmechanisms as the incentive-compatible mechanisms extends naturally to this\ndomain. Our result follows from a simple reduction to the characterization of\nVCG mechanisms. Hence, we see our result more as a fuller more correct version\nof the VCG characterization.\n  This work also highlights a common misconception in the community attributing\nthe VCG result to the usage of transferable utility. Our result shows that the\nincentive-compatibility of the VCG mechanisms does not rely on money being a\ncommon denominator, but rather on the ability of the designer to fine the\nagents on a continuous (maybe agent-specific) scale.\n  We think these two insights, considering the utility as a representation and\nnot as the preference itself (which is common in the economic community) and\nconsidering utilities which represent the preference only for the relevant\ndomain, would turn out to fruitful in other domains as well.\n", "versions": [{"version": "v1", "created": "Sat, 26 Oct 2019 20:26:01 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Nehama", "Ilan", ""]]}, {"id": "1910.12282", "submitter": "Bhaskar Ramasubramanian", "authors": "Bhaskar Ramasubramanian, Luyao Niu, Andrew Clark, Linda Bushnell,\n  Radha Poovendran", "title": "Linear Temporal Logic Satisfaction in Adversarial Environments using\n  Secure Control Barrier Certificates", "comments": "Proc. of GameSec2019 (to appear). This version corrects a typo in the\n  simulation, and clarifies some ambiguous material from the Proceedings\n  version", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.GT cs.LO cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the satisfaction of a class of temporal properties for\ncyber-physical systems (CPSs) over a finite-time horizon in the presence of an\nadversary, in an environment described by discrete-time dynamics. The temporal\nlogic specification is given in safe-LTL_F, a fragment of linear temporal logic\nover traces of finite length. The interaction of the CPS with the adversary is\nmodeled as a two-player zero-sum discrete-time dynamic stochastic game with the\nCPS as defender. We formulate a dynamic programming based approach to determine\na stationary defender policy that maximized the probability of satisfaction of\na safe-LTL_F formula over a finite time-horizon under any stationary adversary\npolicy. We introduce secure control barrier certificates (S-CBCs), a\ngeneralization of barrier certificates and control barrier certificates that\naccounts for the presence of an adversary, and use S-CBCs to provide a lower\nbound on the above satisfaction probability. When the dynamics of the evolution\nof the system state has a specific underlying structure, we present a way to\ndetermine an S-CBC as a polynomial in the state variables using sum-of-squares\noptimization. An illustrative example demonstrates our approach.\n", "versions": [{"version": "v1", "created": "Sun, 27 Oct 2019 15:15:54 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Ramasubramanian", "Bhaskar", ""], ["Niu", "Luyao", ""], ["Clark", "Andrew", ""], ["Bushnell", "Linda", ""], ["Poovendran", "Radha", ""]]}, {"id": "1910.12450", "submitter": "Gabriele Farina", "authors": "Gabriele Farina and Chun Kai Ling and Fei Fang and Tuomas Sandholm", "title": "Efficient Regret Minimization Algorithm for Extensive-Form Correlated\n  Equilibrium", "comments": "Full version of NeurIPS 2019 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Self-play methods based on regret minimization have become the state of the\nart for computing Nash equilibria in large two-players zero-sum extensive-form\ngames. These methods fundamentally rely on the hierarchical structure of the\nplayers' sequential strategy spaces to construct a regret minimizer that\nrecursively minimizes regret at each decision point in the game tree. In this\npaper, we introduce the first efficient regret minimization algorithm for\ncomputing extensive-form correlated equilibria in large two-player general-sum\ngames with no chance moves. Designing such an algorithm is significantly more\nchallenging than designing one for the Nash equilibrium counterpart, as the\nconstraints that define the space of correlation plans lack the hierarchical\nstructure and might even form cycles. We show that some of the constraints are\nredundant and can be excluded from consideration, and present an efficient\nalgorithm that generates the space of extensive-form correlation plans\nincrementally from the remaining constraints. This structural decomposition is\nachieved via a special convexity-preserving operation that we coin scaled\nextension. We show that a regret minimizer can be designed for a scaled\nextension of any two convex sets, and that from the decomposition we then\nobtain a global regret minimizer. Our algorithm produces feasible iterates.\nExperiments show that it significantly outperforms prior approaches and for\nlarger problems it is the only viable option.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2019 05:28:23 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Farina", "Gabriele", ""], ["Ling", "Chun Kai", ""], ["Fang", "Fei", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "1910.13010", "submitter": "Emmanouil Vasileios Vlatakis Gkaragkounis", "authors": "Lampros Flokas, Emmanouil-Vasileios Vlatakis-Gkaragkounis, Georgios\n  Piliouras", "title": "Poincar\\'e Recurrence, Cycles and Spurious Equilibria in\n  Gradient-Descent-Ascent for Non-Convex Non-Concave Zero-Sum Games", "comments": "To appear in NeurIPS 2019 (Spotlight talk)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a wide class of non-convex non-concave min-max games that\ngeneralizes over standard bilinear zero-sum games. In this class, players\ncontrol the inputs of a smooth function whose output is being applied to a\nbilinear zero-sum game. This class of games is motivated by the indirect nature\nof the competition in Generative Adversarial Networks, where players control\nthe parameters of a neural network while the actual competition happens between\nthe distributions that the generator and discriminator capture. We establish\ntheoretically, that depending on the specific instance of the problem\ngradient-descent-ascent dynamics can exhibit a variety of behaviors\nantithetical to convergence to the game theoretically meaningful min-max\nsolution. Specifically, different forms of recurrent behavior (including\nperiodicity and Poincar\\'e recurrence) are possible as well as convergence to\nspurious (non-min-max) equilibria for a positive measure of initial conditions.\nAt the technical level, our analysis combines tools from optimization theory,\ngame theory and dynamical systems.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2019 23:59:25 GMT"}], "update_date": "2019-10-30", "authors_parsed": [["Flokas", "Lampros", ""], ["Vlatakis-Gkaragkounis", "Emmanouil-Vasileios", ""], ["Piliouras", "Georgios", ""]]}, {"id": "1910.13095", "submitter": "Mengjing Chen", "authors": "Hua Liu and Mengjing Chen and Xiaolong Wang and Zihe Wang", "title": "A Game-theoretical Approach to Analyze Film Release Time", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Film release dates play an important part in box office revenues because of\nthe facts of obvious seasonality demand in the film industry and severe\ncompetition among films shown at the same time. In this paper, we study how\nfilm studios choose release time for movies they produce to maximize their box\noffices. We first formalize this problem as an attraction competition game\nwhere players (film studios) consider both potential profits and competitors'\nchoices when deciding the release time. Then we prove that there always exists\na pure Nash equilibrium and give the sufficient condition of the uniqueness of\nthe Nash equilibrium. Our model can be generalized to an extensive game and we\ncompute the subgame-perfect equilibrium for homogeneous players. For the case\nthat one film studio could have multiple movies to release, we prove that\nfinding a player's best response is NP-hard and it does not guarantee the\nexistence of a pure Nash equilibrium. Experiments are provided to support the\nsoundness of our model. In the final state, most of film studios, accounting\nfor 84 percent of the market, would not change their release time. The\nbehaviors of film studios imply they are following some strategies to reach a\nNash equilibrium.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2019 05:53:20 GMT"}, {"version": "v2", "created": "Tue, 1 Sep 2020 02:27:19 GMT"}, {"version": "v3", "created": "Mon, 4 Jan 2021 05:46:42 GMT"}], "update_date": "2021-01-05", "authors_parsed": [["Liu", "Hua", ""], ["Chen", "Mengjing", ""], ["Wang", "Xiaolong", ""], ["Wang", "Zihe", ""]]}, {"id": "1910.13615", "submitter": "Xiang Huang", "authors": "Xiang Huang, Jack H. Lutz, Elvira Mayordomo, and Donald M. Stull", "title": "Asymptotic Divergences and Strong Dichotomy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC cs.FL cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Schnorr-Stimm dichotomy theorem concerns finite-state gamblers that bet\non infinite sequences of symbols taken from a finite alphabet $\\Sigma$.\n  In this paper we use the Kullback-Leibler divergence to formulate the\n$\\textit{lower asymptotic divergence}$ $\\text{div}(S||\\alpha)$ of a probability\nmeasure $\\alpha$ on $\\Sigma$ from a sequence $S$ over $\\Sigma$ and the\n$\\textit{upper asymptotic divergence}$ $\\text{Div}(S||\\alpha)$ of $\\alpha$ from\n$S$ in such a way that a sequence $S$ is $\\alpha$-normal (meaning that every\nstring $w$ has asymptotic frequency $\\alpha(w)$ in $S$) if and only if\n$\\text{Div}(S||\\alpha)=0$. We also use the Kullback-Leibler divergence to\nquantify the $\\textit{total risk }$ $\\text{Risk}_G(w)$ that a finite-state\ngambler $G$ takes when betting along a prefix $w$ of $S$.\n  Our main theorem is a $\\textit{strong dichotomy theorem}$ that uses the above\nnotions to $\\textit{quantify}$ the exponential rates of winning and losing on\nthe two sides of the Schnorr-Stimm dichotomy theorem (with the latter routinely\nextended from normality to $\\alpha$-normality). Modulo asymptotic caveats in\nthe paper, our strong dichotomy theorem says that the following two things hold\nfor prefixes $w$ of $S$.\n  (1) The infinitely-often exponential rate of winning is\n$2^{\\text{Div}(S||\\alpha)|w|}$.\n  (2) The exponential rate of loss is $2^{-\\text{Risk}_G(w)}$.\n  We also use (1) to show that $1-\\text{Div}(S||\\alpha)/c$, where $c= \\log(1/\n\\min_{a\\in\\Sigma}\\alpha(a))$, is an upper bound on the finite-state\n$\\alpha$-dimension of $S$ and prove the dual fact that\n$1-\\text{div}(S||\\alpha)/c$ is an upper bound on the finite-state strong\n$\\alpha$-dimension of $S$.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2019 01:30:23 GMT"}], "update_date": "2019-10-31", "authors_parsed": [["Huang", "Xiang", ""], ["Lutz", "Jack H.", ""], ["Mayordomo", "Elvira", ""], ["Stull", "Donald M.", ""]]}, {"id": "1910.13765", "submitter": "Antonio Di Stasio", "authors": "Antonio Di Stasio, Aniello Murano, Giuseppe Perelli, Moshe Y. Vardi", "title": "Solving Parity Games Using An Automata-Based Algorithm", "comments": null, "journal-ref": "LNCS 9705, 2016, pp. 64-76", "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Parity games are abstract infinite-round games that take an important role in\nformal verification. In the basic setting, these games are two-player,\nturn-based, and played under perfect information on directed graphs, whose\nnodes are labeled with priorities. The winner of a play is determined according\nto the parities (even or odd) of the minimal priority occurring infinitely\noften in that play. The problem of finding a winning strategy in parity games\nis known to be in UPTime $\\cap$ CoUPTime and deciding whether a polynomial time\nsolution exists is a long-standing open question. In the last two decades, a\nvariety of algorithms have been proposed. Many of them have been also\nimplemented in a platform named PGSolver. This has enabled an empirical\nevaluation of these algorithms and a better understanding of their relative\nmerits. In this paper, we further contribute to this subject by implementing,\nfor the first time, an algorithm based on alternating automata. More precisely,\nwe consider an algorithm introduced by Kupferman and Vardi that solves a parity\ngame by solving the emptiness problem of a corresponding alternating parity\nautomaton. Our empirical evaluation demonstrates that this algorithm\noutperforms other algorithms when the game has a a small number of priorities\nrelative to the size of the game. In many concrete applications, we do indeed\nend up with parity games where the number of priorities is relatively small.\nThis makes the new algorithm quite useful in practice.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2019 10:48:04 GMT"}], "update_date": "2019-10-31", "authors_parsed": [["Di Stasio", "Antonio", ""], ["Murano", "Aniello", ""], ["Perelli", "Giuseppe", ""], ["Vardi", "Moshe Y.", ""]]}, {"id": "1910.13880", "submitter": "Yevgeniy Vorobeychik", "authors": "Yi Li and Yevgeniy Vorobeychik", "title": "Path Planning Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.GT cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Path planning is a fundamental and extensively explored problem in robotic\ncontrol. We present a novel economic perspective on path planning.\nSpecifically, we investigate strategic interactions among path planning agents\nusing a game theoretic path planning framework. Our focus is on economic\ntension between two important objectives: efficiency in the agents' achieving\ntheir goals, and safety in navigating towards these. We begin by developing a\nnovel mathematical formulation for path planning that trades off these\nobjectives, when behavior of other agents is fixed. We then use this\nformulation for approximating Nash equilibria in path planning games, as well\nas to develop a multi-agent cooperative path planning formulation. Through\nseveral case studies, we show that in a path planning game, safety is often\nsignificantly compromised compared to a cooperative solution.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2019 14:26:30 GMT"}], "update_date": "2019-10-31", "authors_parsed": [["Li", "Yi", ""], ["Vorobeychik", "Yevgeniy", ""]]}, {"id": "1910.13903", "submitter": "Barbara Franci Dott.", "authors": "Barbara Franci, Mathias Staudigl and Sergio Grammatico", "title": "Distributed forward-backward (half) forward algorithms for generalized\n  Nash equilibrium seeking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present two distributed algorithms for the computation of a generalized\nNash equilibrium in monotone games. The first algorithm follows from a\nforward-backward-forward operator splitting, while the second, which requires\nthe pseudo-gradient mapping of the game to be cocoercive, follows from the\nforward-backward-half-forward operator splitting. Finally, we compare them with\nthe distributed, preconditioned, forward-backward algorithm via numerical\nexperiments.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2019 14:48:20 GMT"}, {"version": "v2", "created": "Fri, 14 Feb 2020 15:14:07 GMT"}], "update_date": "2020-02-17", "authors_parsed": [["Franci", "Barbara", ""], ["Staudigl", "Mathias", ""], ["Grammatico", "Sergio", ""]]}, {"id": "1910.14008", "submitter": "Kangning Wang", "authors": "Zhihao Jiang, Kamesh Munagala and Kangning Wang", "title": "Approximately Stable Committee Selection", "comments": "STOC 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the committee selection problem, we are given $m$ candidates, and $n$\nvoters. Candidates can have different weights. A committee is a subset of\ncandidates, and its weight is the sum of weights of its candidates. Each voter\nexpresses an ordinal ranking over all possible committees. The only assumption\nwe make on preferences is monotonicity: If $S \\subseteq S'$ are two committees,\nthen any voter weakly prefers $S'$ to $S$. We study a general notion of group\nfairness via stability: A committee of given total weight $K$ is stable if no\ncoalition of voters can deviate and choose a committee of proportional weight,\nso that all these voters strictly prefer the new committee to the existing one.\nExtending this notion to approximation, for parameter $c \\ge 1$, a committee\n$S$ of weight $K$ is said to be $c$-approximately stable if for any other\ncommittee $S'$ of weight $K'$, the fraction of voters that strictly prefer $S'$\nto $S$ is strictly less than $\\frac{c K'}{K}$. When $c = 1$, this condition is\nequivalent to classical core stability. The question we ask is: Does a\n$c$-approximately stable committee of weight at most any given value $K$ always\nexist for constant $c$? It is relatively easy to show that there exist monotone\npreferences for which $c \\ge 2$. However, even for simple and widely studied\npreference structures, a non-trivial upper bound on $c$ has been elusive. In\nthis paper, we show that $c = O(1)$ for all monotone preference structures. Our\nproof proceeds via showing an existence result for a randomized notion of\nstability, and iteratively rounding the resulting fractional solution.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2019 17:45:15 GMT"}, {"version": "v2", "created": "Sun, 3 Nov 2019 23:48:28 GMT"}, {"version": "v3", "created": "Mon, 27 Apr 2020 03:35:36 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Jiang", "Zhihao", ""], ["Munagala", "Kamesh", ""], ["Wang", "Kangning", ""]]}, {"id": "1910.14129", "submitter": "Warut Suksompong", "authors": "Xiaohui Bei, Warut Suksompong", "title": "Dividing a Graphical Cake", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the classical cake-cutting problem where we wish to fairly divide\na heterogeneous resource, often modeled as a cake, among interested agents.\nWork on the subject typically assumes that the cake is represented by an\ninterval. In this paper, we introduce a generalized setting where the cake can\nbe in the form of the set of edges of an undirected graph. This allows us to\nmodel the division of road or cable networks. Unlike in the canonical setting,\ncommon fairness criteria such as proportionality cannot always be satisfied in\nour setting if each agent must receive a connected subgraph. We determine the\noptimal approximation of proportionality that can be obtained for any number of\nagents with arbitrary valuations, and exhibit tight guarantees for each graph\nin the case of two agents. In addition, when more than one connected piece per\nagent is allowed, we establish the best egalitarian welfare guarantee for each\ntotal number of connected pieces. We also study a number of variants and\nextensions, including when approximate equitability is considered, or when the\nitem to be divided is undesirable (also known as chore division).\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2019 20:52:33 GMT"}], "update_date": "2019-11-01", "authors_parsed": [["Bei", "Xiaohui", ""], ["Suksompong", "Warut", ""]]}, {"id": "1910.14269", "submitter": "Biaoshuai Tao", "authors": "Yuqing Kong, Chris Peikert, Grant Schoenebeck and Biaoshuai Tao", "title": "Outsourcing Computation: the Minimal Refereed Mechanism", "comments": "17 pages, 1 figure; WINE 2019: The 15th Conference on Web and\n  Internet Economics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a setting where a verifier with limited computation power\ndelegates a resource intensive computation task---which requires a $T\\times S$\ncomputation tableau---to two provers where the provers are rational in that\neach prover maximizes their own payoff---taking into account losses incurred by\nthe cost of computation. We design a mechanism called the Minimal Refereed\nMechanism (MRM) such that if the verifier has $O(\\log S + \\log T)$ time and\n$O(\\log S + \\log T)$ space computation power, then both provers will provide a\nhonest result without the verifier putting any effort to verify the results.\nThe amount of computation required for the provers (and thus the cost) is a\nmultiplicative $\\log S$-factor more than the computation itself, making this\nschema efficient especially for low-space computations.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 06:01:39 GMT"}, {"version": "v2", "created": "Thu, 5 Dec 2019 17:16:35 GMT"}], "update_date": "2019-12-06", "authors_parsed": [["Kong", "Yuqing", ""], ["Peikert", "Chris", ""], ["Schoenebeck", "Grant", ""], ["Tao", "Biaoshuai", ""]]}]