[{"id": "1205.0124", "submitter": "Jagbeer Singh Prof.", "authors": "Jagbeer Singh, Satyendra Prasad Singh", "title": "Schedulability Test for Soft Real-Time Systems under Multiprocessor\n  Environment by using an Earliest Deadline First Scheduling Algorithm", "comments": "14 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the study of Earliest Deadline First (EDF) which is an\noptimal scheduling algorithm for uniprocessor real time systems use for\nscheduling the periodic task in soft real-time multiprocessor systems. In hard\nreal-time systems, a significant disparity exists EDF-based schemes and RMA\nscheduling (which is the only known way of optimally scheduling recurrent\nreal-time tasks on multiprocessors): on M processors, all known EDF variants\nhave utilization-based schedulability bounds of approximately M/2, while RMA\nalgorithms can fully utilize all processors. This is unfortunate because EDF\nbased algorithms entail lower scheduling and task migration overheads. In work\non hard real-time systems, it has been shown that this disparity in\nSchedulability can be lessened by placing caps on per task utilizations. Our\nmain contribution is a new EDF based scheme that ensures bounded deadline\ntardiness. In this scheme, per-task utilizations must be focused,but overall\nutilization need not be stricted. Our scheme should enable a wide range of soft\nreal-time applications to be scheduled with no constraints on total\nutilization. Also propose techniques and heuristics that can be used to reduce\ntardiness as well as increase the efficiency of task.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2012 09:17:43 GMT"}], "update_date": "2012-05-02", "authors_parsed": [["Singh", "Jagbeer", ""], ["Singh", "Satyendra Prasad", ""]]}, {"id": "1205.1687", "submitter": "Sumit Sharma", "authors": "Sumit Sharma, Rohitt Sharma, Paramjit Singh, Aditya Mahajan", "title": "Age Based User Interface in Mobile Operating System", "comments": null, "journal-ref": "International Journal of Computer Science, Engineering and\n  Applications (IJCSEA) 2,2: 177-184 April 2012", "doi": "10.5121/ijcsea.2012.2215", "report-no": null, "categories": "cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes the creation of different interfaces in the mobile\noperating system for different age groups. The different age groups identified\nare kids, elderly people and all others. The motive behind creating different\ninterfaces is to make the smartphones of today's world usable to all age\ngroups.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2012 13:12:27 GMT"}], "update_date": "2012-05-09", "authors_parsed": [["Sharma", "Sumit", ""], ["Sharma", "Rohitt", ""], ["Singh", "Paramjit", ""], ["Mahajan", "Aditya", ""]]}, {"id": "1205.6423", "submitter": "Plawan Kumar Rath", "authors": "Plawan Kumar Rath, G. N. Anil", "title": "Proposed Challenges And Areas of Concern in Operating System Research\n  and Development", "comments": "5 pages; International Journal for Computer Science Issues(IJCSI),\n  Volume 9, Issue 2, March 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OS", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Computers are a very important part of our lives and the major reason why\nthey have been such a success is because of the excellent graphical operating\nsystems that run on these powerful machines. As the computer hardware is\nbecoming more and more powerful, it is also vital to keep the software updated\nin order to utilize the hardware of the system efficiently and make it faster\nand smarter. This paper highlights some core issues that if dealt with in the\noperating system level would make use of the full potential of the computer\nhardware and provide an excellent user experience.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2012 17:10:29 GMT"}], "update_date": "2012-05-30", "authors_parsed": [["Rath", "Plawan Kumar", ""], ["Anil", "G. N.", ""]]}]