[{"id": "1106.0518", "submitter": "Homin Lee", "authors": "Mahdi Cheraghchi, Adam Klivans, Pravesh Kothari, Homin K. Lee", "title": "Submodular Functions Are Noise Stable", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that all non-negative submodular functions have high {\\em\nnoise-stability}. As a consequence, we obtain a polynomial-time learning\nalgorithm for this class with respect to any product distribution on\n$\\{-1,1\\}^n$ (for any constant accuracy parameter $\\epsilon$). Our algorithm\nalso succeeds in the agnostic setting. Previous work on learning submodular\nfunctions required either query access or strong assumptions about the types of\nsubmodular functions to be learned (and did not hold in the agnostic setting).\n", "versions": [{"version": "v1", "created": "Thu, 2 Jun 2011 21:30:50 GMT"}, {"version": "v2", "created": "Mon, 13 Jun 2011 14:32:55 GMT"}], "update_date": "2011-06-14", "authors_parsed": [["Cheraghchi", "Mahdi", ""], ["Klivans", "Adam", ""], ["Kothari", "Pravesh", ""], ["Lee", "Homin K.", ""]]}, {"id": "1106.0519", "submitter": "Yang Cai", "authors": "Yang Cai, Constantinos Daskalakis", "title": "Extreme-Value Theorems for Optimal Multidimensional Pricing", "comments": "58 pages, 2 figure, Appeared in FOCS 2011 and accepted to Games and\n  Economics Behavior", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a near-optimal, computationally efficient algorithm for the\nunit-demand pricing problem, where a seller wants to price n items to optimize\nrevenue against a unit-demand buyer whose values for the items are\nindependently drawn from known distributions. For any chosen accuracy eps>0 and\nitem values bounded in [0,1], our algorithm achieves revenue that is optimal up\nto an additive error of at most eps, in polynomial time. For values sampled\nfrom Monotone Hazard Rate (MHR) distributions, we achieve a (1-eps)-fraction of\nthe optimal revenue in polynomial time, while for values sampled from regular\ndistributions the same revenue guarantees are achieved in quasi-polynomial\ntime.\n  Our algorithm for bounded distributions applies probabilistic techniques to\nunderstand the statistical properties of revenue distributions, obtaining a\nreduction in the search space of the algorithm via dynamic programming.\nAdapting this approach to MHR and regular distributions requires the proof of\nnovel extreme value theorems for such distributions.\n  As a byproduct, our techniques establish structural properties of\napproximately-optimal and near-optimal solutions. We show that, for values\nindependently distributed according to MHR distributions, pricing all items at\nthe same price achieves a constant fraction of the optimal revenue. Moreover,\nfor all eps >0, g(1/eps) distinct prices suffice to obtain a (1-eps)-fraction\nof the optimal revenue, where g(1/eps) is quadratic in 1/eps and independent of\nn. Similarly, for all eps>0 and n>0, at most g(1/(eps log n)) distinct prices\nsuffice if the values are independently distributed according to regular\ndistributions, where g() is a polynomial function. Finally, when the values are\ni.i.d. from some MHR distribution, we show that, if n is a sufficiently large\nfunction of 1/eps, a single price suffices to achieve a (1-eps)-fraction of the\noptimal revenue.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jun 2011 21:37:16 GMT"}, {"version": "v2", "created": "Sun, 26 Oct 2014 20:31:08 GMT"}], "update_date": "2014-10-28", "authors_parsed": [["Cai", "Yang", ""], ["Daskalakis", "Constantinos", ""]]}, {"id": "1106.0778", "submitter": "Oliver Friedmann", "authors": "Oliver Friedmann (University of Munich)", "title": "An Exponential Lower Bound for the Latest Deterministic Strategy\n  Iteration Algorithms", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 7, Issue 3 (October 3,\n  2011) lmcs:1026", "doi": "10.2168/LMCS-7(3:23)2011", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a new exponential lower bound for the two most popular\ndeterministic variants of the strategy improvement algorithms for solving\nparity, mean payoff, discounted payoff and simple stochastic games. The first\nvariant improves every node in each step maximizing the current valuation\nlocally, whereas the second variant computes the globally optimal improvement\nin each step. We outline families of games on which both variants require\nexponentially many strategy iterations.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jun 2011 23:39:24 GMT"}, {"version": "v2", "created": "Fri, 30 Sep 2011 08:06:41 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Friedmann", "Oliver", "", "University of Munich"]]}, {"id": "1106.0833", "submitter": "Alexander Gnedin", "authors": "Alexander Gnedin", "title": "Dominance in the Monty Hall Problem", "comments": "http://www.springerlink.com/content/8402812734520774/fulltext.pdf", "journal-ref": "The Mathematical Intelligencer (26 October 2011), pp. 1-8", "doi": "10.1007/s00283-011-9253-0", "report-no": null, "categories": "math.HO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Elementary decision-theoretic analysis of the Monty Hall dilemma shows that\nthe problem has dominance. This makes possible to discard nonswitching\nstrategies, without making any assumptions on the prior distribution of factors\nout of control of the decision maker. A path to the Bayesian and the minimax\ndecision-making environments is then straightforward.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jun 2011 15:39:19 GMT"}], "update_date": "2011-11-24", "authors_parsed": [["Gnedin", "Alexander", ""]]}, {"id": "1106.0961", "submitter": "Saeed Alaei", "authors": "Saeed Alaei", "title": "Bayesian Combinatorial Auctions: Expanding Single Buyer Mechanisms to\n  Many Buyers", "comments": "A preliminary version was published in the proceedings of FOCS 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For Bayesian combinatorial auctions, we present a general framework for\napproximately reducing the mechanism design problem for multiple buyers to\nsingle buyer sub-problems. Our framework can be applied to any setting which\nroughly satisfies the following assumptions: (i) buyers' types must be\ndistributed independently (not necessarily identically), (ii) objective\nfunction must be linearly separable over the buyers, and (iii) except for the\nsupply constraints, there should be no other inter-buyer constraints. Our\nframework is general in the sense that it makes no explicit assumption about\nbuyers' valuations, type distributions, and single buyer constraints (e.g.,\nbudget, incentive compatibility, etc).\n  We present two generic multi buyer mechanisms which use single buyer\nmechanisms as black boxes; if an $\\alpha$-approximate single buyer mechanism\ncan be constructed for each buyer, and if no buyer requires more than\n$\\frac{1}{k}$ of all units of each item, then our generic multi buyer\nmechanisms are $\\gamma_k\\alpha$-approximation of the optimal multi buyer\nmechanism, where $\\gamma_k$ is a constant which is at least\n$1-\\frac{1}{\\sqrt{k+3}}$. Observe that $\\gamma_k$ is at least 1/2 (for $k=1$)\nand approaches 1 as $k \\to \\infty$. As a byproduct of our construction, we\npresent a generalization of prophet inequalities. Furthermore, as applications\nof our framework, we present multi buyer mechanisms with improved approximation\nfactor for several settings from the literature.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jun 2011 05:38:00 GMT"}, {"version": "v2", "created": "Thu, 22 Sep 2011 22:58:40 GMT"}, {"version": "v3", "created": "Wed, 23 May 2012 15:42:56 GMT"}, {"version": "v4", "created": "Fri, 15 Jun 2012 05:43:09 GMT"}], "update_date": "2012-06-18", "authors_parsed": [["Alaei", "Saeed", ""]]}, {"id": "1106.1232", "submitter": "EPTCS", "authors": "Krishnendu Chatterjee (Institute of Science and Technology (IST\n  Austria)), Nathana\\\"el Fijalkow (Institute of Science and Technology (IST\n  Austria))", "title": "A reduction from parity games to simple stochastic games", "comments": "In Proceedings GandALF 2011, arXiv:1106.0814", "journal-ref": "EPTCS 54, 2011, pp. 74-86", "doi": "10.4204/EPTCS.54.6", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Games on graphs provide a natural model for reactive non-terminating systems.\nIn such games, the interaction of two players on an arena results in an\ninfinite path that describes a run of the system. Different settings are used\nto model various open systems in computer science, as for instance turn-based\nor concurrent moves, and deterministic or stochastic transitions. In this\npaper, we are interested in turn-based games, and specifically in deterministic\nparity games and stochastic reachability games (also known as simple stochastic\ngames). We present a simple, direct and efficient reduction from deterministic\nparity games to simple stochastic games: it yields an arena whose size is\nlinear up to a logarithmic factor in size of the original arena.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jun 2011 01:06:10 GMT"}], "update_date": "2011-06-08", "authors_parsed": [["Chatterjee", "Krishnendu", "", "Institute of Science and Technology"], ["Fijalkow", "Nathanaël", "", "Institute of Science and Technology"]]}, {"id": "1106.1233", "submitter": "EPTCS", "authors": "Bastien Maubert (ENS Cachan - Bretagne), Sophie Pinchinat (IRISA),\n  Laura Bozzelli (UPM)", "title": "Opacity Issues in Games with Imperfect Information", "comments": "In Proceedings GandALF 2011, arXiv:1106.0814", "journal-ref": "EPTCS 54, 2011, pp. 87-101", "doi": "10.4204/EPTCS.54.7", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study in depth the class of games with opacity condition, which are\ntwo-player games with imperfect information in which one of the players only\nhas imperfect information, and where the winning condition relies on the\ninformation he has along the play. Those games are relevant for security\naspects of computing systems: a play is opaque whenever the player who has\nimperfect information never \"knows\" for sure that the current position is one\nof the distinguished \"secret\" positions. We study the problems of deciding the\nexistence of a winning strategy for each player, and we call them the\nopacity-violate problem and the opacity-guarantee problem. Focusing on the\nplayer with perfect information is new in the field of games with\nimperfect-information because when considering classical winning conditions it\namounts to solving the underlying perfect-information game. We establish the\nEXPTIME-completeness of both above-mentioned problems, showing that our winning\ncondition brings a gap of complexity for the player with perfect information,\nand we exhibit the relevant opacity-verify problem, which noticeably\ngeneralizes approaches considered in the literature for opacity analysis in\ndiscrete-event systems. In the case of blindfold games, this problem relates to\nthe two initial ones, yielding the determinacy of blindfold games with opacity\ncondition and the PSPACE-completeness of the three problems.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jun 2011 01:06:17 GMT"}], "update_date": "2011-06-08", "authors_parsed": [["Maubert", "Bastien", "", "ENS Cachan - Bretagne"], ["Pinchinat", "Sophie", "", "IRISA"], ["Bozzelli", "Laura", "", "UPM"]]}, {"id": "1106.1236", "submitter": "EPTCS", "authors": "Sten Gr\\\"uner, Frank G. Radmacher, Wolfgang Thomas (RWTH Aachen\n  University)", "title": "Connectivity Games over Dynamic Networks", "comments": "In Proceedings GandALF 2011, arXiv:1106.0814", "journal-ref": "EPTCS 54, 2011, pp. 131-145", "doi": "10.4204/EPTCS.54.10", "report-no": null, "categories": "cs.GT cs.CC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A game-theoretic model for the study of dynamic networks is analyzed. The\nmodel is motivated by communication networks that are subject to failure of\nnodes and where the restoration needs resources. The corresponding two-player\ngame is played between \"Destructor\" (who can delete nodes) and \"Constructor\"\n(who can restore or even create nodes under certain conditions). We also\ninclude the feature of information flow by allowing Constructor to change\nlabels of adjacent nodes. As objective for Constructor the network property to\nbe connected is considered, either as a safety condition or as a reachability\ncondition (in the latter case starting from a non-connected network). We show\nunder which conditions the solvability of the corresponding games for\nConstructor is decidable, and in this case obtain upper and lower complexity\nbounds, as well as algorithms derived from winning strategies. Due to the\nasymmetry between the players, safety and reachability objectives are not dual\nto each other and are treated separately.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jun 2011 01:06:40 GMT"}], "update_date": "2011-06-08", "authors_parsed": [["Grüner", "Sten", "", "RWTH Aachen\n  University"], ["Radmacher", "Frank G.", "", "RWTH Aachen\n  University"], ["Thomas", "Wolfgang", "", "RWTH Aachen\n  University"]]}, {"id": "1106.1237", "submitter": "EPTCS", "authors": "Martin Zimmermann (RWTH Aachen University)", "title": "Optimal Bounds in Parametric LTL Games", "comments": "In Proceedings GandALF 2011, arXiv:1106.0814", "journal-ref": "EPTCS 54, 2011, pp. 146-161", "doi": "10.4204/EPTCS.54.11", "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider graph games of infinite duration with winning conditions in\nparameterized linear temporal logic, where the temporal operators are equipped\nwith variables for time bounds. In model checking such specifications were\nintroduced as \"PLTL\" by Alur et al. and (in a different version called\n\"PROMPT-LTL\") by Kupferman et al..\n  We present an algorithm to determine optimal variable valuations that allow a\nplayer to win a game. Furthermore, we show how to determine whether a player\nwins a game with respect to some, infinitely many, or all valuations. All our\nalgorithms run in doubly-exponential time; so, adding bounded temporal\noperators does not increase the complexity compared to solving plain LTL games.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jun 2011 01:06:47 GMT"}], "update_date": "2011-06-08", "authors_parsed": [["Zimmermann", "Martin", "", "RWTH Aachen University"]]}, {"id": "1106.1244", "submitter": "EPTCS", "authors": "Davide Bresolin (University of Verona), Marta Capiluppi (University of\n  Verona)", "title": "A Game-Theoretic approach to Fault Diagnosis of Hybrid Systems", "comments": "In Proceedings GandALF 2011, arXiv:1106.0814", "journal-ref": "EPTCS 54, 2011, pp. 237-249", "doi": "10.4204/EPTCS.54.17", "report-no": null, "categories": "cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Physical systems can fail. For this reason the problem of identifying and\nreacting to faults has received a large attention in the control and computer\nscience communities. In this paper we study the fault diagnosis problem for\nhybrid systems from a game-theoretical point of view. A hybrid system is a\nsystem mixing continuous and discrete behaviours that cannot be faithfully\nmodeled neither by using a formalism with continuous dynamics only nor by a\nformalism including only discrete dynamics. We use the well known framework of\nhybrid automata for modeling hybrid systems, and we define a Fault Diagnosis\nGame on them, using two players: the environment and the diagnoser. The\nenvironment controls the evolution of the system and chooses whether and when a\nfault occurs. The diagnoser observes the external behaviour of the system and\nannounces whether a fault has occurred or not. Existence of a winning strategy\nfor the diagnoser implies that faults can be detected correctly, while\ncomputing such a winning strategy corresponds to implement a diagnoser for the\nsystem. We will show how to determine the existence of a winning strategy, and\nhow to compute it, for some decidable classes of hybrid automata like o-minimal\nhybrid automata.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jun 2011 01:07:30 GMT"}], "update_date": "2011-06-08", "authors_parsed": [["Bresolin", "Davide", "", "University of Verona"], ["Capiluppi", "Marta", "", "University of\n  Verona"]]}, {"id": "1106.1933", "submitter": "Puduru Reddy V", "authors": "Dario Bauso, Puduru Viswanadha Reddy and Tamer Basar", "title": "Lyapunov stochastic stability and control of robust dynamic coalitional\n  games with transferable utilities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG cs.SY math.OC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper considers a dynamic game with transferable utilities (TU), where\nthe characteristic function is a continuous-time bounded mean ergodic process.\nA central planner interacts continuously over time with the players by choosing\nthe instantaneous allocations subject to budget constraints. Before the game\nstarts, the central planner knows the nature of the process (bounded mean\nergodic), the bounded set from which the coalitions' values are sampled, and\nthe long run average coalitions' values. On the other hand, he has no knowledge\nof the underlying probability function generating the coalitions' values. Our\ngoal is to find allocation rules that use a measure of the extra reward that a\ncoalition has received up to the current time by re-distributing the budget\namong the players. The objective is two-fold: i) guaranteeing convergence of\nthe average allocations to the core (or a specific point in the core) of the\naverage game, ii) driving the coalitions' excesses to an a priori given cone.\nThe resulting allocation rules are robust as they guarantee the aforementioned\nconvergence properties despite the uncertain and time-varying nature of the\ncoaltions' values. We highlight three main contributions. First, we design an\nallocation rule based on full observation of the extra reward so that the\naverage allocation approaches a specific point in the core of the average game,\nwhile the coalitions' excesses converge to an a priori given direction. Second,\nwe design a new allocation rule based on partial observation on the extra\nreward so that the average allocation converges to the core of the average\ngame, while the coalitions' excesses converge to an a priori given cone. And\nthird, we establish connections to approachability theory and attainability\ntheory.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jun 2011 23:55:58 GMT"}, {"version": "v2", "created": "Mon, 23 Apr 2012 18:19:52 GMT"}], "update_date": "2012-04-24", "authors_parsed": [["Bauso", "Dario", ""], ["Reddy", "Puduru Viswanadha", ""], ["Basar", "Tamer", ""]]}, {"id": "1106.1978", "submitter": "Jun Pang", "authors": "Chenyi Zhang and Jun Pang", "title": "An Algorithm for Probabilistic Alternating Simulation", "comments": "We've fixed a problem in the SOFSEM'12 conference version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In probabilistic game structures, probabilistic alternating simulation\n(PA-simulation) relations preserve formulas defined in probabilistic\nalternating-time temporal logic with respect to the behaviour of a subset of\nplayers. We propose a partition based algorithm for computing the largest\nPA-simulation, which is to our knowledge the first such algorithm that works in\npolynomial time, by extending the generalised coarsest partition problem (GCPP)\nin a game-based setting with mixed strategies. The algorithm has higher\ncomplexities than those in the literature for non-probabilistic simulation and\nprobabilistic simulation without mixed actions, but slightly improves the\nexisting result for computing probabilistic simulation with respect to mixed\nactions.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jun 2011 08:43:28 GMT"}, {"version": "v2", "created": "Thu, 30 Jun 2011 08:29:00 GMT"}, {"version": "v3", "created": "Fri, 8 Jun 2012 11:56:55 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Zhang", "Chenyi", ""], ["Pang", "Jun", ""]]}, {"id": "1106.2378", "submitter": "Atsushi  Iwasaki", "authors": "Atsushi Iwasaki, David Kempe, Mahyar Salek, Makoto Yokoo", "title": "False-name-proof Mechanisms for Hiring a Team", "comments": "23 pages, 3 figures, This paper is an extented version of\n  \"False-name-proof Mechanisms for Hiring a Team\" in the Proceedings of the\n  Workshop on Internet and Network Economics, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of hiring a team of selfish agents to perform a task.\nEach agent is assumed to own one or more elements of a set system, and the\nauctioneer is trying to purchase a feasible solution by conducting an auction.\nOur goal is to design auctions that are truthful and false-name-proof, meaning\nthat it is in the agents' best interest to reveal ownership of all elements\n(which may not be known to the auctioneer a priori) as well as their true\nincurred costs.\n  We first propose and analyze a false-name-proof mechanism for the special\ncase where each agent owns only one element in reality, but may pretend that\nthis element is in fact a set of multiple elements. We prove that its frugality\nratio is bounded by $2^n$, which, up to constants, matches a lower bound of\n$\\Omega(2^n)$ for all false-name-proof mechanisms in this scenario. We then\npropose a second mechanism for the general case in which agents may own\nmultiple elements. It requires the auctioneer to choose a reserve cost a\npriori, and thus does not always purchase a solution. In return, it is\nfalse-name-proof even when agents own multiple elements. We experimentally\nevaluate the payment (as well as social surplus) of the second mechanism\nthrough simulation.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jun 2011 03:14:54 GMT"}], "update_date": "2011-06-14", "authors_parsed": [["Iwasaki", "Atsushi", ""], ["Kempe", "David", ""], ["Salek", "Mahyar", ""], ["Yokoo", "Makoto", ""]]}, {"id": "1106.2414", "submitter": "Athanasios Kehagias", "authors": "Athanasios Kehagias and Pawel Pralat", "title": "Some remarks on cops and drunk robbers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.GT cs.RO math.CO math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cops and robbers game has been extensively studied under the assumption\nof optimal play by both the cops and the robbers. In this paper we study the\nproblem in which cops are chasing a drunk robber (that is, a robber who\nperforms a random walk) on a graph. Our main goal is to characterize the \"cost\nof drunkenness.\" Specifically, we study the ratio of expected capture times for\nthe optimal version and the drunk robber one. We also examine the algorithmic\nside of the problem; that is, how to compute near-optimal search schedules for\nthe cops. Finally, we present a preliminary investigation of the invisible\nrobber game and point out differences between this game and graph search.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jun 2011 10:52:17 GMT"}], "update_date": "2017-01-09", "authors_parsed": [["Kehagias", "Athanasios", ""], ["Pralat", "Pawel", ""]]}, {"id": "1106.2440", "submitter": "Christopher Griffin", "authors": "Shaun Lichter, Christopher Griffin, and Terry Friesz", "title": "A Game Theoretic Perspective on Network Topologies", "comments": "25 pages, this revised version has been resubmitted to Computational\n  and Mathematical Organization Theory after being reviewed", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  As an alternative view to the graph formation models in the statistical\nphysics community, we introduce graph formation models using \\textit{network\nformation} through selfish competition as an approach to modeling graphs with\nparticular topologies. We further investigate a specific application of our\nresults to collaborative oligopolies. We extend the results of Goyal and Joshi\n(S. Goyal and S. Joshi. Networks of collaboration in oligopoly. Games and\nEconomic behavior, 43(1):57-85, 2003), who first considered the problem of\ncollaboration networks of oligopolies and showed that under certain linear\nassumptions network collaboration produced a stable complete graph through\nselfish competition. We show with nonlinear cost functions and player payoff\nalteration that stable collaboration graphs with an arbitrary degree sequence\ncan result.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jun 2011 13:33:37 GMT"}, {"version": "v2", "created": "Thu, 5 Apr 2012 13:18:23 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Lichter", "Shaun", ""], ["Griffin", "Christopher", ""], ["Friesz", "Terry", ""]]}, {"id": "1106.2489", "submitter": "Craig Boutilier", "authors": "Craig Boutilier (Department of Computer Science, University of\n  Toronto, Canada)", "title": "Eliciting Forecasts from Self-interested Experts: Scoring Rules for\n  Decision Makers", "comments": "11 pages 4 figures pdflatex See\n  http://www.cs.toronto.edu/~cebly/papers.html", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scoring rules for eliciting expert predictions of random variables are\nusually developed assuming that experts derive utility only from the quality of\ntheir predictions (e.g., score awarded by the rule, or payoff in a prediction\nmarket). We study a more realistic setting in which (a) the principal is a\ndecision maker and will take a decision based on the expert's prediction; and\n(b) the expert has an inherent interest in the decision. For example, in a\ncorporate decision market, the expert may derive different levels of utility\nfrom the actions taken by her manager. As a consequence the expert will usually\nhave an incentive to misreport her forecast to influence the choice of the\ndecision maker if typical scoring rules are used. We develop a general model\nfor this setting and introduce the concept of a compensation rule. When\ncombined with the expert's inherent utility for decisions, a compensation rule\ninduces a net scoring rule that behaves like a normal scoring rule. Assuming\nfull knowledge of expert utility, we provide a complete characterization of all\n(strictly) proper compensation rules. We then analyze the situation where the\nexpert's utility function is not fully known to the decision maker. We show\nbounds on: (a) expert incentive to misreport; (b) the degree to which an expert\nwill misreport; and (c) decision maker loss in utility due to such uncertainty.\nThese bounds depend in natural ways on the degree of uncertainty, the local\ndegree of convexity of net scoring function, and natural properties of the\ndecision maker's utility function. They also suggest optimization procedures\nfor the design of compensation rules. Finally, we briefly discuss the use of\ncompensation rules as market scoring rules for self-interested experts in a\nprediction market.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jun 2011 17:04:03 GMT"}], "update_date": "2011-06-14", "authors_parsed": [["Boutilier", "Craig", "", "Department of Computer Science, University of\n  Toronto, Canada"]]}, {"id": "1106.2650", "submitter": "Luca Rose", "authors": "Luca Rose, Samir M. Perlaza, M\\'erouane Debbah", "title": "On the Nash Equilibria in Decentralized Parallel Interference Channels", "comments": "6 pages, 4 figures, presented in ICCC Kyoto 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the 2-dimensional decentralized parallel interference channel\n(IC) with 2 transmitter-receiver pairs is modelled as a non-cooperative static\ngame. Each transmitter is assumed to be a fully rational entity with complete\ninformation on the game, aiming to maximize its own individual spectral\nefficiency by tuning its own power allocation (PA) vector. Two scenarios are\nanalysed. First, we consider that transmitters can split their transmit power\nbetween both dimensions (PA game). Second, we consider that each transmitter is\nlimited to use only one dimension (channel selection CS game). In the first\nscenario, the game might have either one or three NE in pure strategies (PS).\nHowever, two or infinitely many NE in PS might also be observed with zero\nprobability. In the second scenario, there always exists either one or two NE\nin PS. We show that in both games there always exists a non-zero probability of\nobserving more than one NE. More interestingly, using Monte-Carlo simulations,\nwe show that the highest and lowest network spectral efficiency at any of the\nNE in the CS game are always higher than the ones in the PA.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jun 2011 09:38:51 GMT"}], "update_date": "2011-06-15", "authors_parsed": [["Rose", "Luca", ""], ["Perlaza", "Samir M.", ""], ["Debbah", "Mérouane", ""]]}, {"id": "1106.2657", "submitter": "Joseph Y. Halpern", "authors": "Joseph Y. Halpern and Rafael Pass", "title": "I Don't Want to Think About it Now:Decision Theory With Costly\n  Computation", "comments": "In Conference on Knowledge Representation and Reasoning (KR '10)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computation plays a major role in decision making. Even if an agent is\nwilling to ascribe a probability to all states and a utility to all outcomes,\nand maximize expected utility, doing so might present serious computational\nproblems. Moreover, computing the outcome of a given act might be difficult. In\na companion paper we develop a framework for game theory with costly\ncomputation, where the objects of choice are Turing machines. Here we apply\nthat framework to decision theory. We show how well-known phenomena like\nfirst-impression-matters biases (i.e., people tend to put more weight on\nevidence they hear early on), belief polarization (two people with different\nprior beliefs, hearing the same evidence, can end up with diametrically opposed\nconclusions), and the status quo bias (people are much more likely to stick\nwith what they already have) can be easily captured in that framework. Finally,\nwe use the framework to define some new notions: value of computational\ninformation (a computational variant of value of information) and and\ncomputational value of conversation.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jun 2011 09:52:38 GMT"}], "update_date": "2011-06-15", "authors_parsed": [["Halpern", "Joseph Y.", ""], ["Pass", "Rafael", ""]]}, {"id": "1106.2662", "submitter": "Luca Rose", "authors": "Luca Rose, Samir M. Perlaza, Samson Lasaulce, M\\'erouane Debbah", "title": "Learning Equilibria with Partial Information in Decentralized Wireless\n  Networks", "comments": "16 pages, 5 figures, 1 table. To appear in IEEE Communication\n  Magazine, special Issue on Game Theory", "journal-ref": null, "doi": "10.1109/MCOM.2011.5978427", "report-no": null, "categories": "cs.LG cs.AI cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, a survey of several important equilibrium concepts for\ndecentralized networks is presented. The term decentralized is used here to\nrefer to scenarios where decisions (e.g., choosing a power allocation policy)\nare taken autonomously by devices interacting with each other (e.g., through\nmutual interference). The iterative long-term interaction is characterized by\nstable points of the wireless network called equilibria. The interest in these\nequilibria stems from the relevance of network stability and the fact that they\ncan be achieved by letting radio devices to repeatedly interact over time. To\nachieve these equilibria, several learning techniques, namely, the best\nresponse dynamics, fictitious play, smoothed fictitious play, reinforcement\nlearning algorithms, and regret matching, are discussed in terms of information\nrequirements and convergence properties. Most of the notions introduced here,\nfor both equilibria and learning schemes, are illustrated by a simple case\nstudy, namely, an interference channel with two transmitter-receiver pairs.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jun 2011 09:58:36 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Rose", "Luca", ""], ["Perlaza", "Samir M.", ""], ["Lasaulce", "Samson", ""], ["Debbah", "Mérouane", ""]]}, {"id": "1106.2673", "submitter": "Joseph Y. Halpern", "authors": "Danny Dolev, Dror G. Feitelson, Joseph Y. Halpern, Raz Kupferman, and\n  Nati Linial", "title": "No justified complaints: On fair sharing of multiple resources", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fair allocation has been studied intensively in both economics and computer\nscience, and fair sharing of resources has aroused renewed interest with the\nadvent of virtualization and cloud computing. Prior work has typically focused\non mechanisms for fair sharing of a single resource. We provide a new\ndefinition for the simultaneous fair allocation of multiple\ncontinuously-divisible resources. Roughly speaking, we define fairness as the\nsituation where every user either gets all the resources he wishes for, or else\ngets at least his entitlement on some bottleneck resource, and therefore cannot\ncomplain about not getting more. This definition has the same desirable\nproperties as the recently suggested dominant resource fairness, and also\nhandles the case of multiple bottlenecks. We then prove that a fair allocation\naccording to this definition is guaranteed to exist for any combination of user\nrequests and entitlements (where a user's relative use of the different\nresources is fixed). The proof, which uses tools from the theory of ordinary\ndifferential equations, is constructive and provides a method to compute the\nallocations numerically.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jun 2011 11:20:26 GMT"}], "update_date": "2011-06-15", "authors_parsed": [["Dolev", "Danny", ""], ["Feitelson", "Dror G.", ""], ["Halpern", "Joseph Y.", ""], ["Kupferman", "Raz", ""], ["Linial", "Nati", ""]]}, {"id": "1106.3242", "submitter": "Richard T. B. Ma", "authors": "Richard T. B. Ma and Vishal Misra", "title": "The Public Option: a Non-regulatory Alternative to Network Neutrality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network neutrality and the role of regulation on the Internet have been\nheavily debated in recent times. Amongst the various definitions of network\nneutrality, we focus on the one which prohibits paid prioritization of content\nand we present an analytical treatment of the topic. We develop a model of the\nInternet ecosystem in terms of three primary players: consumers, ISPs and\ncontent providers. Our analysis looks at this issue from the point of view of\nthe consumer, and we describe the desired state of the system as one which\nmaximizes consumer surplus. By analyzing different scenarios of monopoly and\ncompetition, we obtain different conclusions on the desirability of regulation.\nWe also introduce the notion of a Public Option ISP, an ISP that carries\ntraffic in a network neutral manner. Our major findings are (i) in a\nmonopolistic scenario, network neutral regulations benefit consumers; however,\nthe introduction of a Public Option ISP is even better for consumers, as it\naligns the interests of the monopolistic ISP with the consumer surplus and (ii)\nin an oligopolistic situation, the presence of a Public Option ISP is again\npreferable to network neutral regulations, although the presence of competing\nprice-discriminating ISPs provides the most desirable situation for the\nconsumers.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jun 2011 14:18:13 GMT"}, {"version": "v2", "created": "Fri, 1 Jul 2011 09:59:23 GMT"}], "update_date": "2011-07-04", "authors_parsed": [["Ma", "Richard T. B.", ""], ["Misra", "Vishal", ""]]}, {"id": "1106.3552", "submitter": "Sung-Ha Hwang", "authors": "Sung-Ha Hwang and Luc Rey-Bellet", "title": "Decompositions of two player games: potential, zero-sum, and stable\n  games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY math-ph math.MP math.OC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce several methods of decomposition for two player normal form\ngames. Viewing the set of all games as a vector space, we exhibit explicit\northonormal bases for the subspaces of potential games, zero-sum games, and\ntheir orthogonal complements which we call anti-potential games and\nanti-zero-sum games, respectively. Perhaps surprisingly, every anti-potential\ngame comes either from the Rock-Paper-Scissors type games (in the case of\nsymmetric games) or from the Matching Pennies type games (in the case of\nasymmetric games). Using these decompositions, we prove old (and some new)\ncycle criteria for potential and zero-sum games (as orthogonality relations\nbetween subspaces). We illustrate the usefulness of our decomposition by (a)\nanalyzing the generalized Rock-Paper-Scissors game, (b) completely\ncharacterizing the set of all null-stable games, (c) providing a large class of\nstrict stable games, (d) relating the game decomposition to the decomposition\nof vector fields for the replicator equations, (e) constructing Lyapunov\nfunctions for some replicator dynamics, and (f) constructing Zeeman games\n-games with an interior asymptotically stable Nash equilibrium and a pure\nstrategy ESS.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jun 2011 19:14:04 GMT"}, {"version": "v2", "created": "Mon, 18 Jul 2011 17:18:11 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Hwang", "Sung-Ha", ""], ["Rey-Bellet", "Luc", ""]]}, {"id": "1106.3679", "submitter": "Valerio Capraro", "authors": "Valerio Capraro", "title": "Solution of Wald's game using loadings and allowed strategies", "comments": "5 pages. The result of this paper is now part of the paper \"Existence\n  of equilibria for countable games: an algebraic approach\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new interpretation of the strange phenomena that some authors\nhave observed about the Wald game. This interpretation is possible thanks to\nthe new language of \\emph{loadings} that Morrison and the author have\nintroduced in a previous work. Using the theory of loadings and allowed\nstrategies, we are also able to prove that Wald's game admits a \\emph{natural}\nsolution and, as one can expect, the game turns out to be fair for this\nsolution. As a technical tool, we introduce the notion of \\emph{embedding a\ngame into another game} that could be of interest from a theoretical point of\nview. \\emph{En passant} we find a very easy example of a game which is loadable\nin infinitely many different ways.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jun 2011 19:04:32 GMT"}, {"version": "v2", "created": "Sun, 11 Mar 2012 01:47:36 GMT"}], "update_date": "2012-03-13", "authors_parsed": [["Capraro", "Valerio", ""]]}, {"id": "1106.3826", "submitter": "Pooya Jalaly Khalilabadi", "authors": "MohammadAmin Fazli, Mohammad Ghodsi, Jafar Habibi, Pooya Jalaly\n  Khalilabadi, Vahab Mirrokni, Sina Sadeghian Sadeghabad", "title": "On the Non-Progressive Spread of Influence through Social Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The spread of influence in social networks is studied in two main categories:\nthe progressive model and the non-progressive model (see e.g. the seminal work\nof Kempe, Kleinberg, and Tardos in KDD 2003). While the progressive models are\nsuitable for modeling the spread of influence in monopolistic settings,\nnon-progressive are more appropriate for modeling non-monopolistic settings,\ne.g., modeling diffusion of two competing technologies over a social network.\nDespite the extensive work on the progressive model, non-progressive models\nhave not been studied well. In this paper, we study the spread of influence in\nthe non-progressive model under the strict majority threshold: given a graph\n$G$ with a set of initially infected nodes, each node gets infected at time\n$\\tau$ iff a majority of its neighbors are infected at time $\\tau-1$. Our goal\nin the \\textit{MinPTS} problem is to find a minimum-cardinality initial set of\ninfected nodes that would eventually converge to a steady state where all nodes\nof $G$ are infected.\n  We prove that while the MinPTS is NP-hard for a restricted family of graphs,\nit admits an improved constant-factor approximation algorithm for power-law\ngraphs. We do so by proving lower and upper bounds in terms of the minimum and\nmaximum degree of nodes in the graph. The upper bound is achieved in turn by\napplying a natural greedy algorithm. Our experimental evaluation of the greedy\nalgorithm also shows its superior performance compared to other algorithms for\na set of real-world graphs as well as the random power-law graphs. Finally, we\nstudy the convergence properties of these algorithms and show that the\nnon-progressive model converges in at most $O(|E(G)|)$ steps.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jun 2011 07:17:44 GMT"}, {"version": "v2", "created": "Tue, 2 Aug 2011 06:39:31 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Fazli", "MohammadAmin", ""], ["Ghodsi", "Mohammad", ""], ["Habibi", "Jafar", ""], ["Khalilabadi", "Pooya Jalaly", ""], ["Mirrokni", "Vahab", ""], ["Sadeghabad", "Sina Sadeghian", ""]]}, {"id": "1106.3858", "submitter": "Yi Gai", "authors": "Yi Gai, Hua Liu, and Bhaskar Krishnamachari", "title": "A Packet Dropping Mechanism for Efficient Operation of M/M/1 Queues with\n  Selfish Users", "comments": "This work is an extended version of the conference paper: Y. Gai, H.\n  Liu and B. Krishnamachari, \"A packet dropping-based incentive mechanism for\n  M/M/1 queues with selfish users\", the 30th IEEE International Conference on\n  Computer Communications (IEEE INFOCOM 2011), China, April, 2011", "journal-ref": null, "doi": "10.1016/j.comnet.2015.12.009", "report-no": null, "categories": "cs.GT cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a fundamental game theoretic problem concerning selfish users\ncontributing packets to an M/M/1 queue. In this game, each user controls its\nown input rate so as to optimize a desired tradeoff between throughput and\ndelay. We first show that the original game has an inefficient Nash Equilibrium\n(NE), with a Price of Anarchy (PoA) that scales linearly or worse in the number\nof users. In order to improve the outcome efficiency, we propose an easily\nimplementable mechanism design whereby the server randomly drops packets with a\nprobability that is a function of the total arrival rate. We show that this\nresults in a modified M/M/1 queueing game that is an ordinal potential game\nwith at least one NE. In particular, for a linear packet dropping function,\nwhich is similar to the Random Early Detection (RED) algorithm used in Internet\nCongestion Control, we prove that there is a unique NE. We also show that the\nsimple best response dynamic converges to this unique equilibrium. Finally, for\nthis scheme, we prove that the social welfare (expressed either as the\nsummation of utilities of all players, or as the summation of the logarithm of\nutilities of all players) at the equilibrium point can be arbitrarily close to\nthe social welfare at the global optimal point, i.e. the PoA can be made\narbitrarily close to 1. We also study the impact of arrival rate estimation\nerror on the PoA through simulations.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jun 2011 10:40:21 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Gai", "Yi", ""], ["Liu", "Hua", ""], ["Krishnamachari", "Bhaskar", ""]]}, {"id": "1106.4570", "submitter": "M. Tennenholtz", "authors": "M. Tennenholtz", "title": "Competitive Safety Analysis: Robust Decision-Making in Multi-Agent\n  Systems", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 17, pages\n  363-378, 2002", "doi": "10.1613/jair.1065", "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Much work in AI deals with the selection of proper actions in a given (known\nor unknown) environment. However, the way to select a proper action when facing\nother agents is quite unclear. Most work in AI adopts classical game-theoretic\nequilibrium analysis to predict agent behavior in such settings. This approach\nhowever does not provide us with any guarantee for the agent. In this paper we\nintroduce competitive safety analysis. This approach bridges the gap between\nthe desired normative AI approach, where a strategy should be selected in order\nto guarantee a desired payoff, and equilibrium analysis. We show that a safety\nlevel strategy is able to guarantee the value obtained in a Nash equilibrium,\nin several classical computer science settings. Then, we discuss the concept of\ncompetitive safety strategies, and illustrate its use in a decentralized load\nbalancing setting, typical to network problems. In particular, we show that\nwhen we have many agents, it is possible to guarantee an expected payoff which\nis a factor of 8/9 of the payoff obtained in a Nash equilibrium. Our discussion\nof competitive safety analysis for decentralized load balancing is further\ndeveloped to deal with many communication links and arbitrary speeds. Finally,\nwe discuss the extension of the above concepts to Bayesian games, and\nillustrate their use in a basic auctions setup.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jun 2011 20:56:47 GMT"}], "update_date": "2011-06-24", "authors_parsed": [["Tennenholtz", "M.", ""]]}, {"id": "1106.5174", "submitter": "Dmitry Zinoviev", "authors": "Dmitry Zinoviev and Vy Duong", "title": "A Game Theoretical Approach to Broadcast Information Diffusion in Social\n  Networks", "comments": "6 pages, 3 figures, presented at ANSS-2011 (Boston, MA)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One major function of social networks (e.g., massive online social networks)\nis the dissemination of information, such as scientific knowledge, news, and\nrumors. Information can be propagated by the users of the network via natural\nconnections in written, oral or electronic form. The information passing from a\nsender to receivers and back (in the form of comments) involves all of the\nactors considering their knowledge, trust, and popularity, which shape their\npublishing and commenting strategies. To understand such human aspects of the\ninformation dissemination, we propose a game theoretical model of a one-way\ninformation forwarding and feedback mechanism in a star-shaped social network\nthat takes into account the personalities of the communicating actors.\n", "versions": [{"version": "v1", "created": "Sat, 25 Jun 2011 21:30:42 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Zinoviev", "Dmitry", ""], ["Duong", "Vy", ""]]}, {"id": "1106.5230", "submitter": "Mohammad Reza Javan", "authors": "Mohammad R. Javan and Ahmad R. Sharafat", "title": "Opportunistic Power Control for Multi-Carrier Interference Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We propose a new method for opportunistic power control in multi-carrier\ninterference channels for delay-tolerant data services. In doing so, we utilize\na game theoretic framework with novel constraints, where each user tries to\nmaximize its utility in a distributed and opportunistic manner, while\nsatisfying the game's constraints by adapting its transmit power to its\nchannel. In this scheme, users transmit with more power on good sub-channels\nand do the opposite on bad sub-channels. In this way, in addition to the\nallocated power on each sub-channel, the total power of all users also depends\non channel conditions. Since each user's power level depends on power levels of\nother users, the game belongs to the \\emph{generalized} Nash equilibrium (GNE)\nproblems, which in general, is hard to analyze. We show that the proposed game\nhas a GNE, and derive the sufficient conditions for its uniqueness. Besides, we\npropose a new pricing scheme for maximizing each user's throughput in an\nopportunistic manner under its total power constraint; and provide the\nsufficient conditions for the algorithm's convergence and its GNE's uniqueness.\nSimulations confirm that our proposed scheme yields a higher throughput for\neach user and/or has a significantly improved efficiency as compared to other\nexisting opportunistic methods.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jun 2011 15:44:45 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Javan", "Mohammad R.", ""], ["Sharafat", "Ahmad R.", ""]]}, {"id": "1106.5294", "submitter": "Yohji Akama", "authors": "Yohji Akama", "title": "Set systems: order types, continuous nondeterministic deformations, and\n  quasi-orders", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By reformulating a learning process of a set system L as a game between\nTeacher and Learner, we define the order type of L to be the order type of the\ngame tree, if the tree is well-founded. The features of the order type of L\n(dim L in symbol) are (1) We can represent any well-quasi-order (wqo for short)\nby the set system L of the upper-closed sets of the wqo such that the maximal\norder type of the wqo is equal to dim L. (2) dim L is an upper bound of the\nmind-change complexity of L. dim L is defined iff L has a finite elasticity (fe\nfor short), where, according to computational learning theory, if an indexed\nfamily of recursive languages has fe then it is learnable by an algorithm from\npositive data. Regarding set systems as subspaces of Cantor spaces, we prove\nthat fe of set systems is preserved by any continuous function which is\nmonotone with respect to the set-inclusion. By it, we prove that finite\nelasticity is preserved by various (nondeterministic) language operators\n(Kleene-closure, shuffle-closure, union, product, intersection,. . ..) The\nmonotone continuous functions represent nondeterministic computations. If a\nmonotone continuous function has a computation tree with each node followed by\nat most n immediate successors and the order type of a set system L is\n{\\alpha}, then the direct image of L is a set system of order type at most\nn-adic diagonal Ramsey number of {\\alpha}. Furthermore, we provide an\norder-type-preserving contravariant embedding from the category of quasi-orders\nand finitely branching simulations between them, into the complete category of\nsubspaces of Cantor spaces and monotone continuous functions having Girard's\nlinearity between them. Keyword: finite elasticity, shuffle-closure\n", "versions": [{"version": "v1", "created": "Mon, 27 Jun 2011 04:55:23 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Akama", "Yohji", ""]]}, {"id": "1106.5316", "submitter": "Toby Walsh", "authors": "Toby Walsh", "title": "Online Cake Cutting (published version)", "comments": "To appear in the Proceedings of the Second International Conference\n  on Algorithmic Decision Theory (ADT 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an online form of the cake cutting problem. This models situations\nwhere agents arrive and depart during the process of dividing a resource. We\nshow that well known fair division procedures like cut-and-choose and the\nDubins-Spanier moving knife procedure can be adapted to apply to such online\nproblems. We propose some fairness properties that online cake cutting\nprocedures can possess like online forms of proportionality and envy-freeness.\nWe also consider the impact of collusion between agents. Finally, we study\ntheoretically and empirically the competitive ratio of these online cake\ncutting procedures. Based on its resistance to collusion, and its good\nperformance in practice, our results favour the online version of the\ncut-and-choose procedure over the online version of the moving knife procedure.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jun 2011 07:13:37 GMT"}], "update_date": "2012-04-18", "authors_parsed": [["Walsh", "Toby", ""]]}, {"id": "1106.5326", "submitter": "Mohammad Reza Javan", "authors": "Mohammad R. Javan and Ahmad R. Sharafat", "title": "Efficient and Distributed SINR-based Joint Resource Allocation and Base\n  Station Assignment in Wireless CDMA Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We formulate the resource allocation problem for the uplink of code division\nmultiple access (CDMA) networks using a game theoretic framework, propose an\nefficient and distributed algorithm for a joint rate and power allocation, and\nshow that the proposed algorithm converges to the unique Nash equilibrium (NE)\nof the game. Our choice for the utility function enables each user to adapt its\ntransmit power and throughput to its channel. Due to users' selfish behavior,\nthe output of the game (its NE) may not be a desirable one. To avoid such\ncases, we use pricing to control each user's behavior, and analytically show\nthat similar to the no-pricing case, our pricing-based algorithm converges to\nthe unique NE of the game, at which, each user achieves its target\nsignal-to-interference-plus-noise ratio (SINR). We also extend our distributed\nresource allocation scheme to multi-cell environments for base station\nassignment. Simulation results confirm that our algorithm is computationally\nefficient and its signalling overhead is low. In particular, we will show that\nin addition to its ability to attain the required QoS of users, our scheme\nachieves better fairness in allocating resources and can significantly reduce\ntransmit power as compared to existing schemes.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jun 2011 08:17:40 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Javan", "Mohammad R.", ""], ["Sharafat", "Ahmad R.", ""]]}, {"id": "1106.5423", "submitter": "Joe Neeman", "authors": "Joe Neeman", "title": "A law of large numbers for weighted plurality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.GT math.CO", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Consider an election between k candidates in which each voter votes randomly\n(but not necessarily independently) and suppose that there is a single\ncandidate that every voter prefers (in the sense that each voter is more likely\nto vote for this special candidate than any other candidate). Suppose we have a\nvoting rule that takes all of the votes and produces a single outcome and\nsuppose that each individual voter has little effect on the outcome of the\nvoting rule. If the voting rule is a weighted plurality, then we show that with\nhigh probability, the preferred candidate will win the election. Conversely, we\nshow that this statement fails for all other reasonable voting rules.\n  This result is an extension of H\\\"aggstr\\\"om, Kalai and Mossel, who proved\nthe above in the case k=2.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jun 2011 15:53:48 GMT"}, {"version": "v2", "created": "Wed, 30 May 2012 07:54:49 GMT"}], "update_date": "2012-05-31", "authors_parsed": [["Neeman", "Joe", ""]]}, {"id": "1106.5448", "submitter": "Lirong Xia", "authors": "Vincent Conitzer and Toby Walsh and Lirong Xia", "title": "Dominating Manipulations in Voting with Partial Information", "comments": "7 pages by arxiv pdflatex, 1 figure. The 6-page version has the same\n  content and will be published in Proceedings of the Twenty-Fifth AAAI\n  Conference on Artificial Intelligence (AAAI-11)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CC cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider manipulation problems when the manipulator only has partial\ninformation about the votes of the nonmanipulators. Such partial information is\ndescribed by an information set, which is the set of profiles of the\nnonmanipulators that are indistinguishable to the manipulator. Given such an\ninformation set, a dominating manipulation is a non-truthful vote that the\nmanipulator can cast which makes the winner at least as preferable (and\nsometimes more preferable) as the winner when the manipulator votes truthfully.\nWhen the manipulator has full information, computing whether or not there\nexists a dominating manipulation is in P for many common voting rules (by known\nresults). We show that when the manipulator has no information, there is no\ndominating manipulation for many common voting rules. When the manipulator's\ninformation is represented by partial orders and only a small portion of the\npreferences are unknown, computing a dominating manipulation is NP-hard for\nmany common voting rules. Our results thus throw light on whether we can\nprevent strategic behavior by limiting information about the votes of other\nvoters.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jun 2011 17:10:55 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Conitzer", "Vincent", ""], ["Walsh", "Toby", ""], ["Xia", "Lirong", ""]]}, {"id": "1106.5596", "submitter": "Mario Bravo", "authors": "Mario Bravo", "title": "An adjusted payoff-based procedure for normal form games", "comments": "19 pages, final version appeared in Math. Oper. Res", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a simple adaptive model in the framework of an N -player normal form\ngame. The model consists of a repeated game where the players only know their\nown action space and their own payoff scored at each stage, not those of the\nother agents. Each player, in order to update her mixed action, computes the\naverage vector payoff she has obtained by using the number of times she has\nplayed each pure action. The resulting stochastic process is analyzed via the\nODE method from stochastic approximation theory. We are interested in the\nconvergence of the process to rest points of the related continuous dynamics.\nResults concerning almost sure convergence and convergence with positive\nprobability are obtained and applied to a traffic game. We also provide some\nexamples where convergence occurs with probability zero.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jun 2011 09:01:37 GMT"}, {"version": "v2", "created": "Fri, 9 Jun 2017 15:28:13 GMT"}], "update_date": "2017-06-12", "authors_parsed": [["Bravo", "Mario", ""]]}]