[{"id": "0806.0172", "submitter": "Grenville Croll", "authors": "David Chadwick", "title": "EuSpRIG TEAM work:Tools, Education, Audit, Management", "comments": "7 Pages, 1 Figure", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. (EuSpRIG) 2003 1-6 ISBN\n  1 86166 199 1", "doi": null, "report-no": null, "categories": "cs.HC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research on spreadsheet errors began over fifteen years ago. During that\ntime, there has been ample evidence demonstrating that spreadsheet errors are\ncommon and nontrivial. Quite simply, spreadsheet error rates are comparable to\nerror rates in other human cognitive activities and are caused by fundamental\nlimitations in human cognition, not mere sloppiness. Nor does ordinary \"being\ncareful\" eliminate errors or reduce them to acceptable levels.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jun 2008 21:01:15 GMT"}], "update_date": "2008-06-03", "authors_parsed": [["Chadwick", "David", ""]]}, {"id": "0806.0182", "submitter": "Grenville Croll", "authors": "David R. Chadwick", "title": "Training Gamble leads to Corporate Grumble?", "comments": "8 Pages, 4 Figures", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. (EuSpRIG) 2002 1-11\n  ISBN 1 86166 182", "doi": null, "report-no": null, "categories": "cs.HC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fifteen years of research studies have concluded unanimously that spreadsheet\nerrors are both common and non-trivial. Now we must seek ways to reduce\nspreadsheet errors. Several approaches have been suggested, some of which are\npromising and others, while appealing because they are easy to do, are not\nlikely to be effective. To date, only one technique, cell-by-cell code\ninspection, has been demonstrated to be effective. We need to conduct further\nresearch to determine the degree to which other techniques can reduce\nspreadsheet errors.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jun 2008 23:14:22 GMT"}], "update_date": "2008-06-03", "authors_parsed": [["Chadwick", "David R.", ""]]}, {"id": "0806.0189", "submitter": "Grenville Croll", "authors": "Pat Cleary, Dr David Ball, Mukul Madahar, Simon Thorne, Christopher\n  Gosling, Karen Fernandez", "title": "Investigating the use of Software Agents to Reduce The Risk of\n  Undetected Errors in Strategic Spreadsheet Applications", "comments": "12 Pages, 3 Tables, 3 Figures", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. (EuSpRIG) 2003 147-159\n  ISBN 1 86166 199 1", "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is an overlooked iceberg of problems in end user computing.\nSpreadsheets are developed by people who are very skilled in their main job\nfunction, be it finance, procurement, or production planning, but often have\nhad no formal training in spreadsheet use. IT auditors focus on mainstream\ninformation systems but regard spreadsheets as user problems, outside their\nconcerns. Internal auditors review processes, but not the tools that support\ndecision making in these processes.\n  This paper highlights the gaps between risk management and end user awareness\nin spreadsheet research. In addition the potential benefits of software agent\ntechnologies to the management of risk in spreadsheets are explored. This paper\ndiscusses the current research into end user computing and spreadsheet use\nawareness.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jun 2008 23:51:12 GMT"}], "update_date": "2008-06-03", "authors_parsed": [["Cleary", "Pat", ""], ["Ball", "Dr David", ""], ["Madahar", "Mukul", ""], ["Thorne", "Simon", ""], ["Gosling", "Christopher", ""], ["Fernandez", "Karen", ""]]}, {"id": "0806.0314", "submitter": "Nicholas Manoukis", "authors": "N. C. Manoukis and E. C. Anderson", "title": "GuiLiner: A Configurable and Extensible Graphical User Interface for\n  Scientific Analysis and Simulation Software", "comments": "4 pages; for the current version of this software, please visit\n  http://guiliner.sourceforge.net/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.SE", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  The computer programs most users interact with daily are driven by a\ngraphical user interface (GUI). However, many scientific applications are used\nwith a command line interface (CLI) for the ease of development and increased\nflexibility this mode provides. Scientific application developers would benefit\nfrom being able to provide a GUI easily for their CLI programs, thus retaining\nthe advantages of both modes of interaction. GuiLiner is a generic, extensible\nand flexible front-end designed to ``host'' a wide variety of data analysis or\nsimulation programs. Scientific application developers who produce a correctly\nformatted XML file describing their program's options and some of its\ndocumentation can immediately use GuiLiner to produce a carefully implemented\nGUI for their analysis or simulation programs.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2008 15:57:55 GMT"}], "update_date": "2008-06-03", "authors_parsed": [["Manoukis", "N. C.", ""], ["Anderson", "E. C.", ""]]}, {"id": "0806.0784", "submitter": "Sylvie Saget", "authors": "Sylvie Saget, Francois Legras, Gilles Coppin", "title": "Collaborative model of interaction and Unmanned Vehicle Systems'\n  interface", "comments": null, "journal-ref": "Dans HCP workshop on \"Supervisory Control in Critical Systems\n  Management\" - 3rd International Conference on Human Centered Processes\n  (HCP-2008), Delft : Pays-Bas (2008)", "doi": null, "report-no": null, "categories": "cs.AI cs.HC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The interface for the next generation of Unmanned Vehicle Systems should be\nan interface with multi-modal displays and input controls. Then, the role of\nthe interface will not be restricted to be a support of the interactions\nbetween the ground operator and vehicles. Interface must take part in the\ninteraction management too. In this paper, we show that recent works in\npragmatics and philosophy provide a suitable theoretical framework for the next\ngeneration of UV System's interface. We concentrate on two main aspects of the\ncollaborative model of interaction based on acceptance: multi-strategy approach\nfor communicative act generation and interpretation and communicative\nalignment.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jun 2008 14:22:38 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Saget", "Sylvie", ""], ["Legras", "Francois", ""], ["Coppin", "Gilles", ""]]}, {"id": "0806.1610", "submitter": "Andreas U. Schmidt", "authors": "Andreas U. Schmidt, Nicolai Kuntze, Rachid El Khayari", "title": "SPAM over Internet Telephony and how to deal with it", "comments": "7th annual Conference Information Security South Africa (ISSA 2008)\n  University of Johannesburg, South Africa, 7 -9 July 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In our modern society telephony has developed to an omnipresent service.\nPeople are available at anytime and anywhere. Furthermore the Internet has\nemerged to an important communication medium. These facts and the raising\navailability of broadband internet access has led to the fusion of these two\nservices. Voice over IP or short VoIP is the keyword, that describes this\ncombination. The advantages of VoIP in comparison to classic telephony are\nlocation independence, simplification of transport networks, ability to\nestablish multimedia communications and the low costs. Nevertheless one can\neasily see, that combining two technologies, always brings up new challenges\nand problems that have to be solved. It is undeniable that one of the most\nannoying facet of the Internet nowadays is email spam. According to different\nsources email spam is considered to be 80 to 90 percent of the email traffic\nproduced. The threat of so called voice spam or Spam over Internet Telephony\n(SPIT) is even more fatal, for the annoyance and disturbance factor is much\nhigher. As instance an email that hits the inbox at 4 p.m. is useless but will\nnot disturb the user much. In contrast a ringing phone at 4 p.m. will lead to a\nmuch higher disturbance. From the providers point of view both email spam and\nvoice spam produce unwanted traffic and loss of trust of customers into the\nservice. In order to mitigate this threat different approaches from different\nparties have been developed. This paper focuses on state of the art anti voice\nspam solutions, analyses them and reveals their weak points. In the end a SPIT\nproducing benchmark tool will be introduced, that attacks the presented anti\nvoice spam solutions. With this tool it is possible for an administrator of a\nVoIP network to test how vulnerable his system is.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 09:34:30 GMT"}], "update_date": "2008-06-11", "authors_parsed": [["Schmidt", "Andreas U.", ""], ["Kuntze", "Nicolai", ""], ["Khayari", "Rachid El", ""]]}, {"id": "0806.2216", "submitter": "Tshilidzi Marwala", "authors": "Vukosi N. Marivate, George Ssali and Tshilidzi Marwala", "title": "An Intelligent Multi-Agent Recommender System for Human Capacity\n  Building", "comments": "Proceedings of the 14th IEEE Mediterranean Electrotechnical\n  Conference, 2008, pages 909 to 915", "journal-ref": null, "doi": "10.1109/MELCON.2008.4618553", "report-no": null, "categories": "cs.AI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a Multi-Agent approach to the problem of recommending\ntraining courses to engineering professionals. The recommendation system is\nbuilt as a proof of concept and limited to the electrical and mechanical\nengineering disciplines. Through user modelling and data collection from a\nsurvey, collaborative filtering recommendation is implemented using intelligent\nagents. The agents work together in recommending meaningful training courses\nand updating the course information. The system uses a users profile and\nkeywords from courses to rank courses. A ranking accuracy for courses of 90% is\nachieved while flexibility is achieved using an agent that retrieves\ninformation autonomously using data mining techniques from websites. This\nmanner of recommendation is scalable and adaptable. Further improvements can be\nmade using clustering and recording user feedback.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jun 2008 09:56:36 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Marivate", "Vukosi N.", ""], ["Ssali", "George", ""], ["Marwala", "Tshilidzi", ""]]}, {"id": "0806.3536", "submitter": "Grenville Croll", "authors": "Grenville J. Croll", "title": "In Pursuit of Spreadsheet Excellence", "comments": "7 pages, 2 tables. To Appear Proc. European Spreadsheet Risks\n  Interest Group, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The first fully-documented study into the quantitative impact of errors in\noperational spreadsheets identified an interesting anomaly. One of the five\nparticipating organisations involved in the study contributed a set of five\nspreadsheets of such quality that they set the organisation apart in a\nstatistical sense. This virtuoso performance gave rise to a simple sampling\ntest - The Clean Sheet Test - which can be used to objectively evaluate if an\norganisation is in control of the spreadsheets it is using in important\nprocesses such as financial reporting.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jun 2008 00:14:09 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Croll", "Grenville J.", ""]]}]