[{"id": "1404.0086", "submitter": "EPTCS", "authors": "Mario Benevides (Federal University of Rio de Janeiro), Isaque Lima\n  (Federal University of Rio de Janeiro), Rafael Nader (Federal University of\n  Rio de Janeiro), Pedro Rougemont (Federal University of Rio de Janeiro)", "title": "Using HMM in Strategic Games", "comments": "In Proceedings DCM 2013, arXiv:1403.7685", "journal-ref": "EPTCS 144, 2014, pp. 73-84", "doi": "10.4204/EPTCS.144.6", "report-no": null, "categories": "cs.GT cs.IR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we describe an approach to resolve strategic games in which\nplayers can assume different types along the game. Our goal is to infer which\ntype the opponent is adopting at each moment so that we can increase the\nplayer's odds. To achieve that we use Markov games combined with hidden Markov\nmodel. We discuss a hypothetical example of a tennis game whose solution can be\napplied to any game with similar characteristics.\n", "versions": [{"version": "v1", "created": "Tue, 1 Apr 2014 00:39:19 GMT"}], "update_date": "2014-04-02", "authors_parsed": [["Benevides", "Mario", "", "Federal University of Rio de Janeiro"], ["Lima", "Isaque", "", "Federal University of Rio de Janeiro"], ["Nader", "Rafael", "", "Federal University of\n  Rio de Janeiro"], ["Rougemont", "Pedro", "", "Federal University of Rio de Janeiro"]]}, {"id": "1404.0414", "submitter": "EPTCS", "authors": "Fabio Mogavero (Universit\\`a degli Studi di Napoli Federico II),\n  Aniello Murano (Universit\\`a degli Studi di Napoli Federico II), Moshe Y.\n  Vardi (Rice University)", "title": "Proceedings 2nd International Workshop on Strategic Reasoning", "comments": null, "journal-ref": "EPTCS 146, 2014", "doi": "10.4204/EPTCS.146", "report-no": null, "categories": "cs.GT cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 2nd International Workshop on\nStrategic Reasoning 2014 (SR 2014), held in Grenoble (France), April 5-6, 2014.\nThe SR workshop aims to bring together researchers, possibly with different\nbackgrounds, working on various aspects of strategic reasoning in computer\nscience, both from a theoretical and a practical point of view. This year SR\nhas hosted four invited talks by Thomas A. Henzinger, Wiebe van der Hoek,\nAlessio R. Lomuscio, and Wolfgang Thomas. Moreover, the workshop has hosted 14\ncontributed talks, all selected among the full contributions submitted, which\nhave been deeply evaluated, by four reviewers, according to their quality and\nrelevance.\n", "versions": [{"version": "v1", "created": "Tue, 1 Apr 2014 22:43:16 GMT"}], "update_date": "2014-04-03", "authors_parsed": [["Mogavero", "Fabio", "", "Università degli Studi di Napoli Federico II"], ["Murano", "Aniello", "", "Università degli Studi di Napoli Federico II"], ["Vardi", "Moshe Y.", "", "Rice University"]]}, {"id": "1404.0542", "submitter": "Victor Naroditskiy", "authors": "Talal Rahwan, Victor Naroditskiy, Tomasz Michalak, Michael Wooldridge,\n  Nicholas R Jennings", "title": "Towards a Fair Allocation of Rewards in Multi-Level Marketing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An increasing number of businesses and organisations rely on existing users\nfor finding new users or spreading a message. One of the widely used\n\"refer-a-friend\" mechanisms offers an equal reward to both the referrer and the\ninvitee. This mechanism provides incentives for direct referrals and is fair to\nthe invitee. On the other hand, multi-level marketing and recent social\nmobilisation experiments focus on mechanisms that incentivise both direct and\nindirect referrals. Such mechanisms share the reward for inviting a new member\namong the ancestors, usually in geometrically decreasing shares. A new member\nreceives nothing at the time of joining. We study fairness in multi-level\nmarketing mechanisms. We show how characteristic function games can be used to\nmodel referral marketing, show how the canonical fairness concept of the\nShapley value can be applied to this setting, and establish the complexity of\nfinding the Shapley value in each class, and provide a comparison of the\nShapley value-based mechanism to existing referral mechanisms.\n", "versions": [{"version": "v1", "created": "Wed, 2 Apr 2014 13:24:33 GMT"}], "update_date": "2014-04-03", "authors_parsed": [["Rahwan", "Talal", ""], ["Naroditskiy", "Victor", ""], ["Michalak", "Tomasz", ""], ["Wooldridge", "Michael", ""], ["Jennings", "Nicholas R", ""]]}, {"id": "1404.0672", "submitter": "Hammurabi Mendes", "authors": "Hammurabi Mendes, Sorin Istrail", "title": "Thermodynamic Hypothesis as Social Choice: An Impossibility Theorem for\n  Protein Folding", "comments": "Submitted for peer review", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein Folding is concerned with the reasons and mechanism behind a\nprotein's tertiary structure. The thermodynamic hypothesis of Anfinsen\npostulates an universal energy function (UEF) characterizing the tertiary\nstructure, defined consistently across proteins, in terms of their aminoacid\nsequence.\n  We consider the approach of examining multiple protein structure descriptors\nin the PDB (Protein Data Bank), and infer individual preferences, biases\nfavoring particular classes of aminoacid interactions in each of them, later\naggregating these individual preferences into a global preference. This 2-step\nprocess would ideally expose intrinsic biases on classes of aminoacid\ninteractions in the UEF itself. The intuition is that any intrinsic biases in\nthe UEF are expressed within each protein in a specific manner consistent with\nits specific aminoacid sequence, size, and fold (consistently with Anfinsen's\nthermodynamic hypothesis), making a 1-step, holistic aggregation less\ndesirable.\n  Our intention is to illustrate how some impossibility results from voting\ntheory would apply in this setting, being possibly applicable to other protein\nfolding problems as well. We consider concepts and results from voting theory\nand unveil methodological difficulties for the approach mentioned above. With\nour observations, we intend to highlight how key theoretical barriers, already\nexposed by economists, can be relevant for the development of new methods, new\nalgorithms, for problems related to protein folding.\n", "versions": [{"version": "v1", "created": "Wed, 2 Apr 2014 05:40:39 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Mendes", "Hammurabi", ""], ["Istrail", "Sorin", ""]]}, {"id": "1404.0807", "submitter": "Marco Guazzone", "authors": "Cosimo Anglano, Marco Guazzone, Matteo Sereno", "title": "Maximizing Profit in Green Cellular Networks through Collaborative Games", "comments": "Added publisher info and citation notice", "journal-ref": "Computer Networks Volume 75, Part A, 2014, Pages 260-275", "doi": "10.1016/j.comnet.2014.10.003", "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we deal with the problem of maximizing the profit of Network\nOperators (NOs) of green cellular networks in situations where\nQuality-of-Service (QoS) guarantees must be ensured to users, and Base Stations\n(BSs) can be shared among different operators. We show that if NOs cooperate\namong them, by mutually sharing their users and BSs, then each one of them can\nimprove its net profit. By using a game-theoretic framework, we study the\nproblem of forming stable coalitions among NOs. Furthermore, we propose a\nmathematical optimization model to allocate users to a set of BSs, in order to\nreduce costs and, at the same time, to meet user QoS for NOs inside the same\ncoalition. Based on this, we propose an algorithm, based on cooperative game\ntheory, that enables each operator to decide with whom to cooperate in order to\nmaximize its profit. This algorithms adopts a distributed approach in which\neach NO autonomously makes its own decisions, and where the best solution\narises without the need to synchronize them or to resort to a trusted third\nparty. The effectiveness of the proposed algorithm is demonstrated through a\nthorough experimental evaluation considering real-world traffic traces, and a\nset of realistic scenarios. The results we obtain indicate that our algorithm\nallows a population of NOs to significantly improve their profits thanks to the\ncombination of energy reduction and satisfaction of QoS requirements.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 08:54:01 GMT"}, {"version": "v2", "created": "Mon, 22 Feb 2016 15:43:56 GMT"}], "update_date": "2016-02-23", "authors_parsed": [["Anglano", "Cosimo", ""], ["Guazzone", "Marco", ""], ["Sereno", "Matteo", ""]]}, {"id": "1404.0834", "submitter": "EPTCS", "authors": "V\\'eronique Bruy\\`ere (Universit\\'e de Mons, Belgium), Emmanuel Filiot\n  (Universit\\'e Libre de Bruxelles, Belgium), Mickael Randour (Universit\\'e de\n  Mons, Belgium), Jean-Fran\\c{c}ois Raskin (Universit\\'e Libre de Bruxelles,\n  Belgium)", "title": "Expectations or Guarantees? I Want It All! A crossroad between games and\n  MDPs", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 1-8", "doi": "10.4204/EPTCS.146.1", "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When reasoning about the strategic capabilities of an agent, it is important\nto consider the nature of its adversaries. In the particular context of\ncontroller synthesis for quantitative specifications, the usual problem is to\ndevise a strategy for a reactive system which yields some desired performance,\ntaking into account the possible impact of the environment of the system. There\nare at least two ways to look at this environment. In the classical analysis of\ntwo-player quantitative games, the environment is purely antagonistic and the\nproblem is to provide strict performance guarantees. In Markov decision\nprocesses, the environment is seen as purely stochastic: the aim is then to\noptimize the expected payoff, with no guarantee on individual outcomes.\n  In this expository work, we report on recent results introducing the beyond\nworst-case synthesis problem, which is to construct strategies that guarantee\nsome quantitative requirement in the worst-case while providing an higher\nexpected value against a particular stochastic model of the environment given\nas input. This problem is relevant to produce system controllers that provide\nnice expected performance in the everyday situation while ensuring a strict\n(but relaxed) performance threshold even in the event of very bad (while\nunlikely) circumstances. It has been studied for both the mean-payoff and the\nshortest path quantitative measures.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:37:30 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Bruyère", "Véronique", "", "Université de Mons, Belgium"], ["Filiot", "Emmanuel", "", "Université Libre de Bruxelles, Belgium"], ["Randour", "Mickael", "", "Université de\n  Mons, Belgium"], ["Raskin", "Jean-François", "", "Université Libre de Bruxelles,\n  Belgium"]]}, {"id": "1404.0835", "submitter": "EPTCS", "authors": "Llu\\'is Godo (IIIA - CSIC), Enrico Marchioni (IRIT - UPS)", "title": "Games for the Strategic Influence of Expectations", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 9-15", "doi": "10.4204/EPTCS.146.2", "report-no": null, "categories": "cs.GT cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new class of games where each player's aim is to randomise her\nstrategic choices in order to affect the other players' expectations aside from\nher own. The way each player intends to exert this influence is expressed\nthrough a Boolean combination of polynomial equalities and inequalities with\nrational coefficients. We offer a logical representation of these games as well\nas a computational study of the existence of equilibria.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:37:40 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Godo", "Lluís", "", "IIIA - CSIC"], ["Marchioni", "Enrico", "", "IRIT - UPS"]]}, {"id": "1404.0836", "submitter": "EPTCS", "authors": "Wojciech Jamroga (University of Luxembourg), Matthijs Melissen\n  (University of Birmingham), Henning Schnoor (University of Kiel)", "title": "On Defendability of Security Properties", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 17-25", "doi": "10.4204/EPTCS.146.3", "report-no": null, "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the security of interaction protocols when incentives of\nparticipants are taken into account. We begin by formally defining correctness\nof a protocol, given a notion of rationality and utilities of participating\nagents. Based on that, we propose how to assess security when the precise\nincentives are unknown. Then, the security level can be defined in terms of\ndefender sets, i.e., sets of participants who can effectively \"defend\" the\nsecurity property as long as they are in favor of the property.\n  We present some theoretical characterizations of defendable protocols under\nNash equilibrium, first for bijective games (a standard assumption in game\ntheory), and then for games with non-injective outcomes that better correspond\nto interaction protocols. Finally, we apply our concepts to analyze fairness in\nthe ASW contract-signing protocol.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:37:50 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Jamroga", "Wojciech", "", "University of Luxembourg"], ["Melissen", "Matthijs", "", "University of Birmingham"], ["Schnoor", "Henning", "", "University of Kiel"]]}, {"id": "1404.0839", "submitter": "EPTCS", "authors": "Patricia Bouyer (LSV -- CNRS & ENS Cachan), Nicolas Markey (LSV --\n  CNRS & ENS Cachan), Steen Vester (DTU, Kgs. Lyngby)", "title": "Nash Equilibria in Symmetric Games with Partial Observation", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 49-55", "doi": "10.4204/EPTCS.146.7", "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a model for representing large multiplayer games, which\nsatisfy strong symmetry properties. This model is made of multiple copies of an\narena; each player plays in his own arena, and can partially observe what the\nother players do. Therefore, this game has partial information and symmetry\nconstraints, which make the computation of Nash equilibria difficult. We show\nseveral undecidability results, and for bounded-memory strategies, we precisely\ncharacterize the complexity of computing pure Nash equilibria (for qualitative\nobjectives) in this game model.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:38:16 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Bouyer", "Patricia", "", "LSV -- CNRS & ENS Cachan"], ["Markey", "Nicolas", "", "LSV --\n  CNRS & ENS Cachan"], ["Vester", "Steen", "", "DTU, Kgs. Lyngby"]]}, {"id": "1404.0840", "submitter": "EPTCS", "authors": "Dimitar P. Guelev (Institute of Mathematics and Informatics, Bulgarian\n  Academy of Sciences)", "title": "Refining and Delegating Strategic Ability in ATL", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 57-63", "doi": "10.4204/EPTCS.146.8", "report-no": null, "categories": "cs.LO cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose extending Alternating-time Temporal Logic (ATL) by an operator <i\nrefines-to G> F to express that agent i can distribute its powers to a set of\nsub-agents G in a way which satisfies ATL condition f on the strategic ability\nof the coalitions they may form, possibly together with others agents. We prove\nthe decidability of model-checking of formulas whose subformulas with this\noperator as the main connective have the form <i_1 refines-to G_1>...<i_m\nrefines-to G_m> f, with no further occurrences of this operator in f.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:38:26 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Guelev", "Dimitar P.", "", "Institute of Mathematics and Informatics, Bulgarian\n  Academy of Sciences"]]}, {"id": "1404.0842", "submitter": "EPTCS", "authors": "Xiang Jiang (University of Cambridge), Arno Pauly (University of\n  Cambridge)", "title": "Efficient Decomposition of Bimatrix Games (Extended Abstract)", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 75-81", "doi": "10.4204/EPTCS.146.10", "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exploiting the algebraic structure of the set of bimatrix games, a\ndivide-and-conquer algorithm for finding Nash equilibria is proposed. The\nalgorithm is fixed-parameter tractable with the size of the largest irreducible\ncomponent of a game as parameter. An implementation of the algorithm is shown\nto yield a significant performance increase on inputs with small parameters.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:38:45 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Jiang", "Xiang", "", "University of Cambridge"], ["Pauly", "Arno", "", "University of\n  Cambridge"]]}, {"id": "1404.0843", "submitter": "EPTCS", "authors": "Benjamin Aminof (IST Austria), Sasha Rubin (IST Austria and TU Wien)", "title": "First Cycle Games", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 83-90", "doi": "10.4204/EPTCS.146.11", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  First cycle games (FCG) are played on a finite graph by two players who push\na token along the edges until a vertex is repeated, and a simple cycle is\nformed. The winner is determined by some fixed property Y of the sequence of\nlabels of the edges (or nodes) forming this cycle. These games are\ntraditionally of interest because of their connection with infinite-duration\ngames such as parity and mean-payoff games.\n  We study the memory requirements for winning strategies of FCGs and certain\nassociated infinite duration games. We exhibit a simple FCG that is not\nmemoryless determined (this corrects a mistake in \\it Memoryless determinacy of\nparity and mean payoff games: a simple proof by Bj\\\"orklund, Sandberg, Vorobyov\n(2004) that claims that FCGs for which Y is closed under cyclic permutations\nare memoryless determined). We show that /Theta(n)! memory (where n is the\nnumber of nodes in the graph), which is always sufficient, may be necessary to\nwin some FCGs. On the other hand, we identify easy to check conditions on Y\n(i.e., Y is closed under cyclic permutations, and both Y and its complement are\nclosed under concatenation) that are sufficient to ensure that the\ncorresponding FCGs and their associated infinite duration games are memoryless\ndetermined. We demonstrate that many games considered in the literature, such\nas mean-payoff, parity, energy, etc., satisfy these conditions. On the\ncomplexity side, we show (for efficiently computable Y) that while solving FCGs\nis in PSPACE, solving some families of FCGs is PSPACE-hard.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:38:54 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Aminof", "Benjamin", "", "IST Austria"], ["Rubin", "Sasha", "", "IST Austria and TU Wien"]]}, {"id": "1404.0845", "submitter": "EPTCS", "authors": "Piero A. Bonatti (D.I.E.T.I. Universit\\`a di Napoli Federico II),\n  Marco Faella (D.I.E.T.I. Universit\\`a di Napoli Federico II), Luigi Sauro\n  (D.I.E.T.I. Universit\\`a di Napoli Federico II)", "title": "Partial Preferences for Mediated Bargaining", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 105-111", "doi": "10.4204/EPTCS.146.14", "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we generalize standard Decision Theory by assuming that two\noutcomes can also be incomparable. Two motivating scenarios show how\nincomparability may be helpful to represent those situations where, due to lack\nof information, the decision maker would like to maintain different options\nalive and defer the final decision. In particular, a new axiomatization is\ngiven which turns out to be a weakening of the classical set of axioms used in\nDecision Theory. Preliminary results show how preferences involving complex\ndistributions are related to judgments on single alternatives.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:39:21 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Bonatti", "Piero A.", "", "D.I.E.T.I. Università di Napoli Federico II"], ["Faella", "Marco", "", "D.I.E.T.I. Università di Napoli Federico II"], ["Sauro", "Luigi", "", "D.I.E.T.I. Università di Napoli Federico II"]]}, {"id": "1404.1341", "submitter": "Nima Haghpanah", "authors": "Nima Haghpanah and Jason Hartline", "title": "Multi-dimensional Virtual Values and Second-degree Price Discrimination", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a multi-dimensional screening problem of selling a product with\nmultiple quality levels and design virtual value functions to derive conditions\nthat imply optimality of only selling highest quality. A challenge of designing\nvirtual values for multi-dimensional agents is that a mechanism that pointwise\noptimizes virtual values resulting from a general application of integration by\nparts is not incentive compatible, and no general methodology is known for\nselecting the right paths for integration by parts. We resolve this issue by\nfirst uniquely solving for paths that satisfy certain necessary conditions that\nthe pointwise optimality of the mechanism imposes on virtual values, and then\nidentifying distributions that ensure the resulting virtual surplus is indeed\npointwise optimized by the mechanism. Our method of solving for virtual values\nis general, and as a second application we use it to derive conditions of\noptimality for selling only the grand bundle of items to an agent with additive\npreferences.\n", "versions": [{"version": "v1", "created": "Fri, 4 Apr 2014 19:02:42 GMT"}, {"version": "v2", "created": "Fri, 26 Sep 2014 17:10:06 GMT"}, {"version": "v3", "created": "Mon, 23 Mar 2015 18:41:18 GMT"}, {"version": "v4", "created": "Mon, 24 Aug 2015 01:47:32 GMT"}], "update_date": "2015-08-25", "authors_parsed": [["Haghpanah", "Nima", ""], ["Hartline", "Jason", ""]]}, {"id": "1404.1405", "submitter": "Arastoo Fazeli", "authors": "Arastoo Fazeli, Amir Ajorlou, and Ali Jadbabaie", "title": "Optimal Budget Allocation in Social Networks: Quality or Seeding", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT math.OC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study a strategic model of marketing and product\nconsumption in social networks. We consider two competing firms in a market\nproviding two substitutable products with preset qualities. Agents choose their\nconsumptions following a myopic best response dynamics which results in a\nlocal, linear update for the consumptions. At some point in time, firms receive\na limited budget which they can use to trigger a larger consumption of their\nproducts in the network. Firms have to decide between marginally improving the\nquality of their products and giving free offers to a chosen set of agents in\nthe network in order to better facilitate spreading their products. We derive a\nsimple threshold rule for the optimal allocation of the budget and describe the\nresulting Nash equilibrium. It is shown that the optimal allocation of the\nbudget depends on the entire distribution of centralities in the network,\nquality of products and the model parameters. In particular, we show that in a\ngraph with a higher number of agents with centralities above a certain\nthreshold, firms spend more budget on seeding in the optimal allocation.\nFurthermore, if seeding budget is nonzero for a balanced graph, it will also be\nnonzero for any other graph, and if seeding budget is zero for a star graph, it\nwill be zero for any other graph too. We also show that firms allocate more\nbudget to quality improvement when their qualities are close, in order to\ndistance themselves from the rival firm. However, as the gap between qualities\nwidens, competition in qualities becomes less effective and firms spend more\nbudget on seeding.\n", "versions": [{"version": "v1", "created": "Fri, 4 Apr 2014 22:27:58 GMT"}], "update_date": "2014-04-08", "authors_parsed": [["Fazeli", "Arastoo", ""], ["Ajorlou", "Amir", ""], ["Jadbabaie", "Ali", ""]]}, {"id": "1404.1449", "submitter": "Hamidou Tembine", "authors": "Hamidou Tembine", "title": "Non-Asymptotic Mean-Field Games", "comments": "36 pages, 2 figures. Accepted and to appear in IEEE Transactions on\n  Systems, Man, and Cybernetics, Part B 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mean-field games have been studied under the assumption of very large number\nof players. For such large systems, the basic idea consists to approximate\nlarge games by a stylized game model with a continuum of players. The approach\nhas been shown to be useful in some applications. However, the stylized game\nmodel with continuum of decision-makers is rarely observed in practice and the\napproximation proposed in the asymptotic regime is meaningless for networks\nwith few entities. In this paper we propose a mean-field framework that is\nsuitable not only for large systems but also for a small world with few number\nof entities. The applicability of the proposed framework is illustrated through\nvarious examples including dynamic auction with asymmetric valuation\ndistributions, and spiteful bidders.\n", "versions": [{"version": "v1", "created": "Sat, 5 Apr 2014 09:11:05 GMT"}], "update_date": "2014-04-08", "authors_parsed": [["Tembine", "Hamidou", ""]]}, {"id": "1404.1782", "submitter": "Mohammad Hassan Lotfi", "authors": "Mohammad Hassan Lotfi, George Kesidis, and Saswati Sarkar", "title": "Network Non-Neutrality on the Internet: Content Provision Under a\n  Subscription Revenue Model", "comments": "6 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is to provide an insight into the equilibrium of the\nInternet market, when the current balance of the market is disrupted, and one\nof the ISPs switches to a non-neutral regime. We consider a content provider\nwith a subscription revenue model and a continuum of end-users. The CP is also\nnon-neutral, in the sense that she can charge users of different ISPs different\nsubscription fees, and use this \"leverage\" to control the equilibrium outcome.\nResults reveal that the CP is able to control the non-neutral ISP to some\nextend. However, switching to a non-neutral regime by an ISP tips the balance\nof the market in favor of this ISP.\n", "versions": [{"version": "v1", "created": "Mon, 7 Apr 2014 13:34:05 GMT"}, {"version": "v2", "created": "Tue, 8 Apr 2014 04:19:48 GMT"}], "update_date": "2014-04-09", "authors_parsed": [["Lotfi", "Mohammad Hassan", ""], ["Kesidis", "George", ""], ["Sarkar", "Saswati", ""]]}, {"id": "1404.1989", "submitter": "EPTCS", "authors": "Aitor Couce Vieira (Secure-NOK AS, Norway), Siv Hilde Houmb\n  (Secure-NOK AS, Norway), David Rios Insua (Royal Academy of Sciences, Spain)", "title": "A Graphical Adversarial Risk Analysis Model for Oil and Gas Drilling\n  Cybersecurity", "comments": "In Proceedings GraMSec 2014, arXiv:1404.1634", "journal-ref": "EPTCS 148, 2014, pp. 78-93", "doi": "10.4204/EPTCS.148.6", "report-no": null, "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Oil and gas drilling is based, increasingly, on operational technology, whose\ncybersecurity is complicated by several challenges. We propose a graphical\nmodel for cybersecurity risk assessment based on Adversarial Risk Analysis to\nface those challenges. We also provide an example of the model in the context\nof an offshore drilling rig. The proposed model provides a more formal and\ncomprehensive analysis of risks, still using the standard business language\nbased on decisions, risks, and value.\n", "versions": [{"version": "v1", "created": "Tue, 8 Apr 2014 01:47:08 GMT"}], "update_date": "2014-04-09", "authors_parsed": [["Vieira", "Aitor Couce", "", "Secure-NOK AS, Norway"], ["Houmb", "Siv Hilde", "", "Secure-NOK AS, Norway"], ["Insua", "David Rios", "", "Royal Academy of Sciences, Spain"]]}, {"id": "1404.2041", "submitter": "Hu Fu", "authors": "Shahar Dobzinski, Hu Fu, Robert Kleinberg", "title": "On the Complexity of Computing an Equilibrium in Combinatorial Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study combinatorial auctions where each item is sold separately but\nsimultaneously via a second price auction. We ask whether it is possible to\nefficiently compute in this game a pure Nash equilibrium with social welfare\nclose to the optimal one.\n  We show that when the valuations of the bidders are submodular, in many\ninteresting settings (e.g., constant number of bidders, budget additive\nbidders) computing an equilibrium with good welfare is essentially as easy as\ncomputing, completely ignoring incentives issues, an allocation with good\nwelfare. On the other hand, for subadditive valuations, we show that computing\nan equilibrium requires exponential communication. Finally, for XOS (a.k.a.\nfractionally subadditive) valuations, we show that if there exists an efficient\nalgorithm that finds an equilibrium, it must use techniques that are very\ndifferent from our current ones.\n", "versions": [{"version": "v1", "created": "Tue, 8 Apr 2014 08:39:24 GMT"}, {"version": "v2", "created": "Tue, 9 Jun 2015 16:12:41 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Dobzinski", "Shahar", ""], ["Fu", "Hu", ""], ["Kleinberg", "Robert", ""]]}, {"id": "1404.2305", "submitter": "Laura Ziani", "authors": "Flavio Pressacco (DIES), Giacomo Plazzotta, Laura Ziani (DIES)", "title": "Twin relationships in Parsimonious Games: some results", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a vintage paper concerning Parsimonious games, a subset of constant sum\nhomogeneous weighted majority games, Isbell introduced a twin relationship\nbased on transposition properties of the incidence matrices upon minimal\nwinning coalitions of such games. A careful investigation of such properties\nallowed the discovery of some results on twin games presented in this paper. In\ndetail we show that a) twin games have the same minimal winning quota and b)\neach Parsimonious game admits a unique balanced lottery on minimal winning\ncoalitions, whose probabilities are given by the individual weights of its twin\ngame.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2014 19:01:28 GMT"}], "update_date": "2014-04-10", "authors_parsed": [["Pressacco", "Flavio", "", "DIES"], ["Plazzotta", "Giacomo", "", "DIES"], ["Ziani", "Laura", "", "DIES"]]}, {"id": "1404.2306", "submitter": "Cesco Reale", "authors": "Cesco Reale", "title": "How much is convenient to defect? A method to estimate the cooperation\n  probability in Prisoner's Dilemma and other games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many cases the Nash equilibria are not predictive of the experimental\nplayers' behaviour. For some games of Game Theory it is proposed here a method\nto estimate the probabilities with which the different options will be actually\nchosen by balanced players, i.e. players that are neither too competitive, nor\ntoo cooperative. This will allow to measure the intrinsec cooperativeness\ndegree of a game, only in function of its payoffs. The method is shaped on the\nPrisoner's Dilemma, then generalized for asymmetric tables, N players and N\noptions. It is adapted to other conditions like Chicken Game, Battle of the\nSexes, Stag Hunt and Translators (a new name proposed for a particular\ncondition). Then the method is applied to other games like Diner's Dilemma,\nPublic Goods Game, Traveler's Dilemma and War of Attrition. These games are so\nanalyzed in a probabilistic way that is consistent to what we could expect\nintuitively, overcoming some known paradoxes of the Game Theory.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2014 23:31:39 GMT"}], "update_date": "2014-04-10", "authors_parsed": [["Reale", "Cesco", ""]]}, {"id": "1404.2329", "submitter": "Yiannis Giannakopoulos", "authors": "Yiannis Giannakopoulos and Elias Koutsoupias", "title": "Duality and Optimality of Auctions for Uniform Distributions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a general duality-theory framework for revenue maximization in\nadditive Bayesian auctions. The framework extends linear programming duality\nand complementarity to constraints with partial derivatives. The dual system\nreveals the geometric nature of the problem and highlights its connection with\nthe theory of bipartite graph matchings. We demonstrate the power of the\nframework by applying it to a multiple-good monopoly setting where the buyer\nhas uniformly distributed valuations for the items, the canonical long-standing\nopen problem in the area. We propose a deterministic selling mechanism called\nStraight-Jacket Auction (SJA), which we prove to be exactly optimal for up to 6\nitems, and conjecture its optimality for any number of goods. The duality\nframework is used not only for proving optimality, but perhaps more importantly\nfor deriving the optimal mechanism itself; as a result, SJA is defined by\nnatural geometric constraints.\n", "versions": [{"version": "v1", "created": "Tue, 8 Apr 2014 23:10:39 GMT"}, {"version": "v2", "created": "Mon, 12 Oct 2015 19:04:18 GMT"}, {"version": "v3", "created": "Mon, 20 Feb 2017 16:58:07 GMT"}, {"version": "v4", "created": "Mon, 15 Jan 2018 15:28:32 GMT"}], "update_date": "2018-01-16", "authors_parsed": [["Giannakopoulos", "Yiannis", ""], ["Koutsoupias", "Elias", ""]]}, {"id": "1404.2348", "submitter": "Xiaojun Feng", "authors": "Xiaojun Feng, Peng Lin, Qian Zhang", "title": "FlexAuc: Serving Dynamic Demands in a Spectrum Trading Market with\n  Flexible Auction", "comments": "11 pages, 7 figures, Preliminary version accepted in INFOCOM 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In secondary spectrum trading markets, auctions are widely used by spectrum\nholders (SHs) to redistribute their unused channels to secondary wireless\nservice providers (WSPs). As sellers, the SHs design proper auction schemes to\nstimulate more participants and maximize the revenue from the auction. As\nbuyers, the WSPs determine the bidding strategies in the auction to better\nserve their end users.\n  In this paper, we consider a three-layered spectrum trading market consisting\nof the SH, the WSPs and the end users. We jointly study the strategies of the\nthree parties. The SH determines the auction scheme and spectrum supplies to\noptimize its revenue. The WSPs have flexible bidding strategies in terms of\nboth demands and valuations considering the strategies of the end users. We\ndesign FlexAuc, a novel auction mechanism for this market to enable dynamic\nsupplies and demands in the auction. We prove theoretically that FlexAuc not\nonly maximizes the social welfare but also preserves other nice properties such\nas truthfulness and computational tractability.\n", "versions": [{"version": "v1", "created": "Wed, 9 Apr 2014 01:44:58 GMT"}], "update_date": "2014-04-10", "authors_parsed": [["Feng", "Xiaojun", ""], ["Lin", "Peng", ""], ["Zhang", "Qian", ""]]}, {"id": "1404.2367", "submitter": "Palash Dey", "authors": "Palash Dey, Neeldhara Misra, Y. Narahari", "title": "Detecting Possible Manipulators in Elections", "comments": "Accepted in AAMAS 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Manipulation is a problem of fundamental importance in the context of voting\nin which the voters exercise their votes strategically instead of voting\nhonestly to prevent selection of an alternative that is less preferred. The\nGibbard-Satterthwaite theorem shows that there is no strategy-proof voting rule\nthat simultaneously satisfies certain combinations of desirable properties.\nResearchers have attempted to get around the impossibility results in several\nways such as domain restriction and computational hardness of manipulation.\nHowever these approaches have been shown to have limitations. Since prevention\nof manipulation seems to be elusive, an interesting research direction\ntherefore is detection of manipulation. Motivated by this, we initiate the\nstudy of detection of possible manipulators in an election.\n  We formulate two pertinent computational problems - Coalitional Possible\nManipulators (CPM) and Coalitional Possible Manipulators given Winner (CPMW),\nwhere a suspect group of voters is provided as input to compute whether they\ncan be a potential coalition of possible manipulators. In the absence of any\nsuspect group, we formulate two more computational problems namely Coalitional\nPossible Manipulators Search (CPMS), and Coalitional Possible Manipulators\nSearch given Winner (CPMSW). We provide polynomial time algorithms for these\nproblems, for several popular voting rules. For a few other voting rules, we\nshow that these problems are in NP-complete. We observe that detecting\nmanipulation maybe easy even when manipulation is hard, as seen for example, in\nthe case of the Borda voting rule.\n", "versions": [{"version": "v1", "created": "Wed, 9 Apr 2014 05:21:05 GMT"}, {"version": "v2", "created": "Sun, 15 Feb 2015 19:41:45 GMT"}], "update_date": "2015-02-17", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""], ["Narahari", "Y.", ""]]}, {"id": "1404.2399", "submitter": "Dong Zhao", "authors": "Dong Zhao, Huadong Ma, Liang Liu", "title": "Frugal Online Incentive Mechanisms for Crowdsourcing Tasks Truthfully", "comments": "14 pages, 5 figures. arXiv admin note: substantial text overlap with\n  arXiv:1306.5677", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Crowd Sensing (MCS) is a new paradigm which takes advantage of\npervasive smartphones to efficiently collect data, enabling numerous novel\napplications. To achieve good service quality for a MCS application, incentive\nmechanisms are necessary to attract more user participation. Most of existing\nmechanisms apply only for the offline scenario where all users' information are\nknown a priori. On the contrary, we focus on a more realistic scenario where\nusers arrive one by one online in a random order. Based on the online auction\nmodel, we investigate the problem that users submit their private profiles to\nthe crowdsourcer when they arrive, and the crowdsourcer aims at selecting a\nsubset of users before a specified deadline for minimizing the total payment\nwhile a specific number of tasks can be completed.We design three online\nmechanisms, Homo-OMZ, Hetero-OMZ and Hetero-OMG, all of which can satisfy the\ncomputational efficiency, individual rationality, cost-truthfulness, and\nconsumer sovereignty. The Homo-OMZ mechanism is applicable to the homogeneous\nuser model and can satisfy the social efficiency but not constant frugality.\nThe Hetero-OMZ and Hetero-OMG mechanisms are applicable to both the homogeneous\nand heterogeneous user models, and can satisfy the constant frugality. Besides,\nthe Hetero-OMG mechanism can also satisfy the time-truthfulness. Through\nextensive simulations, we evaluate the performance and validate the theoretical\nproperties of our online mechanisms.\n", "versions": [{"version": "v1", "created": "Wed, 9 Apr 2014 09:05:46 GMT"}], "update_date": "2014-04-10", "authors_parsed": [["Zhao", "Dong", ""], ["Ma", "Huadong", ""], ["Liu", "Liang", ""]]}, {"id": "1404.2464", "submitter": "Yongjie Yang", "authors": "Jiong Guo, Yash Raj Shrestha, Yongjie Yang", "title": "How Credible is the Prediction of a Party-Based Election?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a party-based election system, the voters are grouped into parties and all\nvoters of a party are assumed to vote according to the party preferences over\nthe candidates. Hence, once the party preferences are declared the outcome of\nthe election can be determined. However, in the actual election, the members of\nsome \"instable\" parties often leave their own party to join other parties. We\nintroduce two parameters to measure the credibility of the prediction based on\nparty preferences: Min is the minimum number of voters leaving the instable\nparties such that the prediction is no longer true, while Max is the maximum\nnumber of voters leaving the instable parties such that the prediction remains\nvalid. Concerning the complexity of computing Min and Max, we consider both\npositional scoring rules (Plurality, Veto, r-Approval and Borda) and\nCondorcet-consistent rules (Copeland and Maximin). We show that for all\nconsidered scoring rules, Min is polynomial-time computable, while it is\nNP-hard to compute Min for Copeland and Maximin. With the only exception of\nBorda, Max can be computed in polynomial time for other scoring rules. We have\nNP-hardness results for the computation of Max under Borda, Maximin and\nCopeland.\n", "versions": [{"version": "v1", "created": "Wed, 9 Apr 2014 12:45:57 GMT"}], "update_date": "2014-04-10", "authors_parsed": [["Guo", "Jiong", ""], ["Shrestha", "Yash Raj", ""], ["Yang", "Yongjie", ""]]}, {"id": "1404.2514", "submitter": "Arnob Ghosh", "authors": "Arnob Ghosh and Saswati Sarkar", "title": "Quality Sensitive Price Competition in Spectrum Oligopoly:Part 1", "comments": "Accepted for publication in IEEE/ACM Transactions on Networking. 41\n  pages single column format.Conference version is available at arXiv:1305.3351", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a spectrum oligopoly market where primaries lease their\nchannels to secondaries in lieu of financial remuneration. Transmission quality\nof a channel evolves randomly. Each primary has to select the price it would\nquote without knowing the transmission qualities of its competitors' channels.\nEach secondary buys a channel depending on the price and the transmission\nquality a channel offers. We formulate the price selection problem as a non\nco-operative game with primaries as players. In the one-shot game, we show that\nthere exists a unique symmetric Nash Equilibrium(NE) strategy profile and\nexplicitly compute it. Our analysis reveals that under the NE strategy profile\na primary prices its channel to render high quality channel more preferable to\nthe secondary; this negates the popular belief that prices ought to be selected\nto render channels equally preferable to the secondary regardless of their\nqualities. We show the loss of revenue in the asymptotic limit due to the non\nco-operation of primaries. In the repeated version of the game, we characterize\na subgame perfect NE where a primary can attain a payoff arbitrarily close to\nthe payoff it would obtain when primaries co-operate.\n", "versions": [{"version": "v1", "created": "Sun, 6 Apr 2014 04:14:03 GMT"}, {"version": "v2", "created": "Fri, 14 Nov 2014 04:41:16 GMT"}, {"version": "v3", "created": "Sat, 18 Apr 2015 07:59:17 GMT"}, {"version": "v4", "created": "Thu, 21 May 2015 07:39:43 GMT"}], "update_date": "2015-05-22", "authors_parsed": [["Ghosh", "Arnob", ""], ["Sarkar", "Saswati", ""]]}, {"id": "1404.2671", "submitter": "Lingqing Ai", "authors": "Lingqing Ai, Xian Wu, Lingxiao Huang, Longbo Huang, Pingzhong Tang,\n  Jian Li", "title": "The Multi-shop Ski Rental Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the {\\em multi-shop ski rental} problem. This problem generalizes\nthe classic ski rental problem to a multi-shop setting, in which each shop has\ndifferent prices for renting and purchasing a pair of skis, and a\n\\emph{consumer} has to make decisions on when and where to buy. We are\ninterested in the {\\em optimal online (competitive-ratio minimizing) mixed\nstrategy} from the consumer's perspective. For our problem in its basic form,\nwe obtain exciting closed-form solutions and a linear time algorithm for\ncomputing them. We further demonstrate the generality of our approach by\ninvestigating three extensions of our basic problem, namely ones that consider\ncosts incurred by entering a shop or switching to another shop. Our solutions\nto these problems suggest that the consumer must assign positive probability in\n\\emph{exactly one} shop at any buying time. Our results apply to many\nreal-world applications, ranging from cost management in \\texttt{IaaS} cloud to\nscheduling in distributed computing.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2014 02:14:53 GMT"}], "update_date": "2014-04-11", "authors_parsed": [["Ai", "Lingqing", ""], ["Wu", "Xian", ""], ["Huang", "Lingxiao", ""], ["Huang", "Longbo", ""], ["Tang", "Pingzhong", ""], ["Li", "Jian", ""]]}, {"id": "1404.2750", "submitter": "Neil Walton", "authors": "Frank Kelly, Peter Key, Neil Walton", "title": "Efficient Advert Assignment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a framework for the analysis of large-scale Ad-auctions where\nadverts are assigned over a continuum of search types. For this pay-per-click\nmarket, we provide an efficient mechanism that maximizes social welfare. In\nparticular, we show that the social welfare optimization can be solved in\nseparate optimizations conducted on the time-scales relevant to the search\nplatform and advertisers. Here, on each search occurrence, the platform solves\nan assignment problem and, on a slower time-scale, each advertiser submits a\nbid which matches its demand for click-throughs with supply. Importantly,\nknowledge of global parameters, such as the distribution of search terms, is\nnot required when separating the problem in this way. Exploiting the\ninformation asymmetry between the platform and advertiser, we describe a simple\nmechanism which incentivizes truthful bidding and has a unique Nash equilibrium\nthat is socially optimal, and thus implements our decomposition. Further, we\nconsider models where advertisers adapt their bids smoothly over time, and\nprove convergence to the solution that maximizes social welfare. Finally, we\ndescribe several extensions which illustrate the flexibility and tractability\nof our framework.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2014 09:26:11 GMT"}, {"version": "v2", "created": "Tue, 10 Jun 2014 21:17:59 GMT"}, {"version": "v3", "created": "Wed, 10 Sep 2014 11:07:11 GMT"}, {"version": "v4", "created": "Wed, 17 Sep 2014 18:02:16 GMT"}, {"version": "v5", "created": "Fri, 18 Sep 2015 06:29:45 GMT"}, {"version": "v6", "created": "Thu, 2 Jun 2016 17:44:53 GMT"}], "update_date": "2016-06-03", "authors_parsed": [["Kelly", "Frank", ""], ["Key", "Peter", ""], ["Walton", "Neil", ""]]}, {"id": "1404.2832", "submitter": "Yiannis Giannakopoulos", "authors": "Yiannis Giannakopoulos", "title": "Bounding the Optimal Revenue of Selling Multiple Goods", "comments": null, "journal-ref": "Theoretical Computer Science 581 (2015) 83-96", "doi": "10.1016/j.tcs.2015.03.010", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using duality theory techniques we derive simple, closed-form formulas for\nbounding the optimal revenue of a monopolist selling many heterogeneous goods,\nin the case where the buyer's valuations for the items come i.i.d. from a\nuniform distribution and in the case where they follow independent (but not\nnecessarily identical) exponential distributions. We apply this in order to get\nin both these settings specific performance guarantees, as functions of the\nnumber of items $m$, for the simple deterministic selling mechanisms studied by\nHart and Nisan [EC 2012], namely the one that sells the items separately and\nthe one that offers them all in a single bundle.\n  We also propose and study the performance of a natural randomized mechanism\nfor exponential valuations, called Proportional. As an interesting corollary,\nfor the special case where the exponential distributions are also identical, we\ncan derive that offering the goods in a single full bundle is the optimal\nselling mechanism for any number of items. To our knowledge, this is the first\nresult of its kind: finding a revenue-maximizing auction in an additive setting\nwith arbitrarily many goods.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2014 14:46:38 GMT"}, {"version": "v2", "created": "Wed, 23 Jul 2014 20:17:36 GMT"}, {"version": "v3", "created": "Wed, 15 Oct 2014 15:39:28 GMT"}, {"version": "v4", "created": "Wed, 11 Feb 2015 02:10:07 GMT"}, {"version": "v5", "created": "Thu, 12 Mar 2015 18:08:14 GMT"}, {"version": "v6", "created": "Tue, 13 Oct 2015 04:52:12 GMT"}], "update_date": "2015-10-14", "authors_parsed": [["Giannakopoulos", "Yiannis", ""]]}, {"id": "1404.2861", "submitter": "Omri Weinstein", "authors": "Moran Feldman, Moshe Tennenholtz, Omri Weinstein", "title": "Distributed Signaling Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A recurring theme in recent computer science literature is that proper design\nof signaling schemes is a crucial aspect of effective mechanisms aiming to\noptimize social welfare or revenue. One of the research endeavors of this line\nof work is understanding the algorithmic and computational complexity of\ndesigning efficient signaling schemes. In reality, however, information is\ntypically not held by a central authority, but is distributed among multiple\nsources (third-party \"mediators\"), a fact that dramatically changes the\nstrategic and combinatorial nature of the signaling problem, making it a game\nbetween information providers, as opposed to a traditional mechanism design\nproblem.\n  In this paper we introduce {\\em distributed signaling games}, while using\ndisplay advertising as a canonical example for introducing this foundational\nframework. A distributed signaling game may be a pure coordination game (i.e.,\na distributed optimization task), or a non-cooperative game. In the context of\npure coordination games, we show a wide gap between the computational\ncomplexity of the centralized and distributed signaling problems. On the other\nhand, we show that if the information structure of each mediator is assumed to\nbe \"local\", then there is an efficient algorithm that finds a near-optimal\n($5$-approximation) distributed signaling scheme.\n  In the context of non-cooperative games, the outcome generated by the\nmediators' signals may have different value to each (due to the auctioneer's\ndesire to align the incentives of the mediators with his own by relative\ncompensations). We design a mechanism for this problem via a novel application\nof Shapley's value, and show that it possesses some interesting properties, in\nparticular, it always admits a pure Nash equilibrium, and it never decreases\nthe revenue of the auctioneer.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2014 16:06:56 GMT"}, {"version": "v2", "created": "Sun, 5 Jul 2015 08:31:25 GMT"}], "update_date": "2015-07-07", "authors_parsed": [["Feldman", "Moran", ""], ["Tennenholtz", "Moshe", ""], ["Weinstein", "Omri", ""]]}, {"id": "1404.2954", "submitter": "Talal Rahwan", "authors": "Talal Rahwan, Tomasz Michalak, Michael Wooldridge", "title": "A Measure of Synergy in Coalitions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When the performance of a team of agents exceeds our expectations or fall\nshort of them, we often explain this by saying that there was some synergy in\nthe team---either positive (the team exceeded our expectations) or negative\n(they fell short). Our aim in this article is to develop a formal and\nprincipled way of measuring synergies, both positive and negative. Using\ncharacteristic function cooperative games as our underlying model, we present a\nformal measure of synergy, based on the idea that a synergy is exhibited when\nthe performance of a team deviates from the norm. We then show that our synergy\nvalue is the only possible such measure that satisfies certain intuitive\nproperties. We then investigate some alternative characterisations of this\nmeasure.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2014 21:25:02 GMT"}], "update_date": "2014-04-14", "authors_parsed": [["Rahwan", "Talal", ""], ["Michalak", "Tomasz", ""], ["Wooldridge", "Michael", ""]]}, {"id": "1404.2964", "submitter": "Ali Pinar", "authors": "Richard Li-Yang Chen, Neng Fan, Ali Pinar, and Jean-Paul Watson", "title": "Contingency-Constrained Unit Commitment with Post-Contingency Corrective\n  Recourse", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of minimizing costs in the generation unit commitment\nproblem, a cornerstone in electric power system operations, while enforcing an\nN-k-e reliability criterion. This reliability criterion is a generalization of\nthe well-known $N$-$k$ criterion, and dictates that at least $(1-e_ j)$\nfraction of the total system demand must be met following the failures of $k$\nor fewer system components. We refer to this problem as the\nContingency-Constrained Unit Commitment problem, or CCUC. We present a\nmixed-integer programming formulation of the CCUC that accounts for both\ntransmission and generation element failures. We propose novel cutting plane\nalgorithms that avoid the need to explicitly consider an exponential number of\ncontingencies. Computational studies are performed on several IEEE test systems\nand a simplified model of the Western US interconnection network, which\ndemonstrate the effectiveness of our proposed methods relative to current\nstate-of-the-art.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2014 23:26:37 GMT"}], "update_date": "2014-04-14", "authors_parsed": [["Chen", "Richard Li-Yang", ""], ["Fan", "Neng", ""], ["Pinar", "Ali", ""], ["Watson", "Jean-Paul", ""]]}, {"id": "1404.3389", "submitter": "Hamidou Tembine", "authors": "Dario Bauso, Ben Mansour Dia, Boualem Djehiche, Hamidou Tembine, Raul\n  Tempone", "title": "Mean-Field Games for Marriage", "comments": "22 figures. Accepted and to appear in PLoS One", "journal-ref": null, "doi": "10.1371/journal.pone.0094933", "report-no": null, "categories": "math.OC cs.GT cs.SY math.DS math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article examines mean-field games for marriage. The results support the\nargument that optimizing the long-term well-being through effort and social\nfeeling state distribution (mean-field) will help to stabilize marriage.\nHowever, if the cost of effort is very high, the couple fluctuates in a bad\nfeeling state or the marriage breaks down. We then examine the influence of\nsociety on a couple using mean field sentimental games. We show that, in\nmean-field equilibrium, the optimal effort is always higher than the one-shot\noptimal effort. We illustrate numerically the influence of the couple's network\non their feeling states and their well-being.\n", "versions": [{"version": "v1", "created": "Sun, 13 Apr 2014 15:01:18 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Bauso", "Dario", ""], ["Dia", "Ben Mansour", ""], ["Djehiche", "Boualem", ""], ["Tembine", "Hamidou", ""], ["Tempone", "Raul", ""]]}, {"id": "1404.3442", "submitter": "S. Rasoul Etesami", "authors": "S. Rasoul Etesami", "title": "Optimal versus Nash Equilibrium Computation for Networked Resource\n  Allocation", "comments": "A more general version of this arXiv version is already published", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.SY math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by emerging resource allocation and data placement problems such as\nweb caches and peer-to-peer systems, we consider and study a class of resource\nallocation problems over a network of agents (nodes). In this model, nodes can\nstore only a limited number of resources while accessing the remaining ones\nthrough their closest neighbors. We consider this problem under both\noptimization and game-theoretic frameworks. In the case of optimal resource\nallocation we will first show that when there are only k=2 resources, the\noptimal allocation can be found efficiently in O(n^2\\log n) steps, where n\ndenotes the total number of nodes. However, for k>2 this problem becomes\nNP-hard with no polynomial time approximation algorithm with a performance\nguarantee better than 1+1/102k^2, even under metric access costs. We then\nprovide a 3-approximation algorithm for the optimal resource allocation which\nruns only in linear time O(n). Subsequently, we look at this problem under a\nselfish setting formulated as a noncooperative game and provide a\n3-approximation algorithm for obtaining its pure Nash equilibria under metric\naccess costs. We then establish an equivalence between the set of pure Nash\nequilibria and flip-optimal solutions of the Max-k-Cut problem over a specific\nweighted complete graph. Using this reduction, we show that finding the\nlexicographically smallest Nash equilibrium for k> 2 is NP-hard, and provide an\nalgorithm to find it in O(n^3 2^n) steps. While the reduction to weighted\nMax-k-Cut suggests that finding a pure Nash equilibrium using best response\ndynamics might be PLS-hard, it allows us to use tools from quadratic\nprogramming to devise more systematic algorithms towards obtaining Nash\nequilibrium points.\n", "versions": [{"version": "v1", "created": "Mon, 14 Apr 2014 00:49:19 GMT"}, {"version": "v2", "created": "Thu, 16 Jun 2016 19:19:19 GMT"}, {"version": "v3", "created": "Tue, 20 Dec 2016 12:46:04 GMT"}, {"version": "v4", "created": "Mon, 4 Jun 2018 21:02:52 GMT"}, {"version": "v5", "created": "Wed, 26 Dec 2018 05:16:08 GMT"}, {"version": "v6", "created": "Sat, 4 Jan 2020 19:37:52 GMT"}], "update_date": "2020-01-07", "authors_parsed": [["Etesami", "S. Rasoul", ""]]}, {"id": "1404.3789", "submitter": "Valerio Capraro", "authors": "Helene Barcelo, Valerio Capraro", "title": "Group size effect on cooperation in social dilemmas", "comments": "Forthcoming in Scientific Reports", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social dilemmas are central to human society. Depletion of natural resources,\nclimate protection, security of energy supply, and workplace collaborations are\nall examples of social dilemmas. Since cooperative behaviour in a social\ndilemma is individually costly, Nash equilibrium predicts that humans should\nnot cooperate. Yet experimental studies show that people do cooperate even in\nanonymous one-shot interactions. In spite of the large number of participants\nin many modern social dilemmas, little is known about the effect of group size\non cooperation. Does larger group size favour or prevent cooperation? We\naddress this problem both experimentally and theoretically. Experimentally, we\nfind that there is no general answer: it depends on the strategic situation.\nSpecifically, we find that larger groups are more cooperative in the Public\nGoods game, but less cooperative in the N-person Prisoner's dilemma.\nTheoretically, we show that this behaviour is not consistent with either the\nFehr & Schmidt model or (a one-parameter version of) the Charness & Rabin\nmodel, but it is consistent with the cooperative equilibrium model introduced\nby the second author.\n", "versions": [{"version": "v1", "created": "Tue, 15 Apr 2014 01:03:39 GMT"}, {"version": "v2", "created": "Tue, 29 Apr 2014 12:24:04 GMT"}, {"version": "v3", "created": "Fri, 16 May 2014 16:24:55 GMT"}, {"version": "v4", "created": "Wed, 28 May 2014 12:09:15 GMT"}, {"version": "v5", "created": "Tue, 23 Dec 2014 18:52:48 GMT"}], "update_date": "2014-12-24", "authors_parsed": [["Barcelo", "Helene", ""], ["Capraro", "Valerio", ""]]}, {"id": "1404.3828", "submitter": "Wei Chen", "authors": "Wei Chen, Di He, Tie-Yan Liu, Tao Qin, Yixin Tao, Liwei Wang", "title": "Generalized Second Price Auction with Probabilistic Broad Match", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generalized Second Price (GSP) auctions are widely used by search engines\ntoday to sell their ad slots. Most search engines have supported broad match\nbetween queries and bid keywords when executing GSP auctions, however, it has\nbeen revealed that GSP auction with the standard broad-match mechanism they are\ncurrently using (denoted as SBM-GSP) has several theoretical drawbacks (e.g.,\nits theoretical properties are known only for the single-slot case and\nfull-information setting, and even in this simple setting, the corresponding\nworst-case social welfare can be rather bad). To address this issue, we propose\na novel broad-match mechanism, which we call the Probabilistic Broad-Match\n(PBM) mechanism. Different from SBM that puts together the ads bidding on all\nthe keywords matched to a given query for the GSP auction, the GSP with PBM\n(denoted as PBM-GSP) randomly samples a keyword according to a predefined\nprobability distribution and only runs the GSP auction for the ads bidding on\nthis sampled keyword. We perform a comprehensive study on the theoretical\nproperties of the PBM-GSP. Specifically, we study its social welfare in the\nworst equilibrium, in both full-information and Bayesian settings. The results\nshow that PBM-GSP can generate larger welfare than SBM-GSP under mild\nconditions. Furthermore, we also study the revenue guarantee for PBM-GSP in\nBayesian setting. To the best of our knowledge, this is the first work on\nbroad-match mechanisms for GSP that goes beyond the single-slot case and the\nfull-information setting.\n", "versions": [{"version": "v1", "created": "Tue, 15 Apr 2014 07:02:46 GMT"}], "update_date": "2014-04-16", "authors_parsed": [["Chen", "Wei", ""], ["He", "Di", ""], ["Liu", "Tie-Yan", ""], ["Qin", "Tao", ""], ["Tao", "Yixin", ""], ["Wang", "Liwei", ""]]}, {"id": "1404.3945", "submitter": "Ahmed Douik", "authors": "Ahmed Douik, Sameh Sorour, Hamidou Tembine, Mohamed-Slim Alouini, and\n  Tareq Y. Al-Naffouri", "title": "A Game Theoretic Approach to Minimize the Completion Time of Network\n  Coded Cooperative Data Exchange", "comments": "conference version of arXiv:1404.3637", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a game theoretic framework for studying the\nproblem of minimizing the completion time of instantly decodable network coding\n(IDNC) for cooperative data exchange (CDE) in decentralized wireless network.\nIn this configuration, clients cooperate with each other to recover the erased\npackets without a central controller. Game theory is employed herein as a tool\nfor improving the distributed solution by overcoming the need for a central\ncontroller or additional signaling in the system. We model the session by\nself-interested players in a non-cooperative potential game. The utility\nfunction is designed such that increasing individual payoff results in a\ncollective behavior achieving both a desirable system performance in a shared\nnetwork environment and the Pareto optimal solution. Through extensive\nsimulations, our approach is compared to the best performance that could be\nfound in the conventional point-to-multipoint (PMP) recovery process. Numerical\nresults show that our formulation largely outperforms the conventional PMP\nscheme in most practical situations and achieves a lower delay.\n", "versions": [{"version": "v1", "created": "Mon, 14 Apr 2014 09:08:25 GMT"}], "update_date": "2014-04-16", "authors_parsed": [["Douik", "Ahmed", ""], ["Sorour", "Sameh", ""], ["Tembine", "Hamidou", ""], ["Alouini", "Mohamed-Slim", ""], ["Al-Naffouri", "Tareq Y.", ""]]}, {"id": "1404.4106", "submitter": "Marco Rocco", "authors": "Nicola Gatti and Marco Rocco and Sofia Ceppi and Enrico H. Gerding", "title": "Mechanism Design for Mobile Geo-Location Advertising", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile geo-location advertising, where mobile ads are targeted based on a\nuser's location, has been identified as a key growth factor for the mobile\nmarket. As with online advertising, a crucial ingredient for their success is\nthe development of effective economic mechanisms. An important difference is\nthat mobile ads are shown sequentially over time and information about the user\ncan be learned based on their movements. Furthermore, ads need to be shown\nselectively to prevent ad fatigue. To this end, we introduce, for the first\ntime, a user model and suitable economic mechanisms which take these factors\ninto account. Specifically, we design two truthful mechanisms which produce an\nadvertisement plan based on the user's movements. One mechanism is allocatively\nefficient, but requires exponential compute time in the worst case. The other\nrequires polynomial time, but is not allocatively efficient. Finally, we\nexperimentally evaluate the tradeoff between compute time and efficiency of our\nmechanisms.\n", "versions": [{"version": "v1", "created": "Tue, 15 Apr 2014 22:59:53 GMT"}], "update_date": "2014-04-17", "authors_parsed": [["Gatti", "Nicola", ""], ["Rocco", "Marco", ""], ["Ceppi", "Sofia", ""], ["Gerding", "Enrico H.", ""]]}, {"id": "1404.4163", "submitter": "Ioannis Avramopoulos", "authors": "Ioannis Avramopoulos", "title": "Multiplicative weights in monotropic games", "comments": "This paper has been withdrawn by the author due a crucial error in\n  the proof of the main result", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new class of population games that we call monotropic; these\nare games characterized by the presence of a unique globally neutrally stable\nNash equilibrium. Monotropic games generalize strictly concave potential games\nand zero sum games with a unique minimax solution. Within the class of\nmonotropic games, we study a multiplicative weights dynamic. We show that,\ndepending on a parameter called the learning rate, multiplicative weights are\ninterior globally convergent to the unique equilibrium of monotropic games, but\nmay also induce chaotic behavior if the learning rate is not carefully chosen.\n", "versions": [{"version": "v1", "created": "Wed, 16 Apr 2014 08:30:01 GMT"}, {"version": "v2", "created": "Mon, 21 Apr 2014 06:09:44 GMT"}], "update_date": "2014-04-22", "authors_parsed": [["Avramopoulos", "Ioannis", ""]]}, {"id": "1404.4388", "submitter": "Yanling Chang", "authors": "Yanling Chang, Alan L. Erera, and Chelsea C. White III", "title": "Partially Observed, Multi-objective Markov Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The intent of this research is to generate a set of non-dominated policies\nfrom which one of two agents (the leader) can select a most preferred policy to\ncontrol a dynamic system that is also affected by the control decisions of the\nother agent (the follower). The problem is described by an infinite horizon,\npartially observed Markov game (POMG). At each decision epoch, each agent\nknows: its past and present states, its past actions, and noise corrupted\nobservations of the other agent's past and present states. The actions of each\nagent are determined at each decision epoch based on these data. The leader\nconsiders multiple objectives in selecting its policy. The follower considers a\nsingle objective in selecting its policy with complete knowledge of and in\nresponse to the policy selected by the leader. This leader-follower assumption\nallows the POMG to be transformed into a specially structured, partially\nobserved Markov decision process (POMDP). This POMDP is used to determine the\nfollower's best response policy. A multi-objective genetic algorithm (MOGA) is\nused to create the next generation of leader policies based on the fitness\nmeasures of each leader policy in the current generation. Computing a fitness\nmeasure for a leader policy requires a value determination calculation, given\nthe leader policy and the follower's best response policy. The policies from\nwhich the leader can select a most preferred policy are the non-dominated\npolicies of the final generation of leader policies created by the MOGA. An\nexample is presented that illustrates how these results can be used to support\na manager of a liquid egg production process (the leader) in selecting a\nsequence of actions to best control this process over time, given that there is\nan attacker (the follower) who seeks to contaminate the liquid egg production\nprocess with a chemical or biological toxin.\n", "versions": [{"version": "v1", "created": "Wed, 16 Apr 2014 21:22:53 GMT"}], "update_date": "2014-04-18", "authors_parsed": [["Chang", "Yanling", ""], ["Erera", "Alan L.", ""], ["White", "Chelsea C.", "III"]]}, {"id": "1404.4502", "submitter": "Arnaud Lallouet", "authors": "Thi-Van-Anh Nguyen and Arnaud Lallouet", "title": "A Complete Solver for Constraint Games", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game Theory studies situations in which multiple agents having conflicting\nobjectives have to reach a collective decision. The question of a compact\nrepresentation language for agents utility function is of crucial importance\nsince the classical representation of a $n$-players game is given by a\n$n$-dimensional matrix of exponential size for each player. In this paper we\nuse the framework of Constraint Games in which CSP are used to represent\nutilities. Constraint Programming --including global constraints-- allows to\neasily give a compact and elegant model to many useful games. Constraint Games\ncome in two flavors: Constraint Satisfaction Games and Constraint Optimization\nGames, the first one using satisfaction to define boolean utilities. In\naddition to multimatrix games, it is also possible to model more complex games\nwhere hard constraints forbid certain situations. In this paper we study\ncomplete search techniques and show that our solver using the compact\nrepresentation of Constraint Games is faster than the classical game solver\nGambit by one to two orders of magnitude.\n", "versions": [{"version": "v1", "created": "Thu, 17 Apr 2014 12:09:51 GMT"}, {"version": "v2", "created": "Tue, 29 Apr 2014 09:14:33 GMT"}], "update_date": "2014-04-30", "authors_parsed": [["Nguyen", "Thi-Van-Anh", ""], ["Lallouet", "Arnaud", ""]]}, {"id": "1404.4560", "submitter": "Lane A. Hemaspaandra", "authors": "Edith Hemaspaandra and Lane A. Hemaspaandra and Henning Schnoor", "title": "A Control Dichotomy for Pure Scoring Rules", "comments": "A shorter version of this paper will appear in the proceedings of the\n  Twenty-Eighth AAAI Conference on Artificial Intelligence (AAAI 2014)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scoring systems are an extremely important class of election systems. A\nlength-$m$ (so-called) scoring vector applies only to $m$-candidate elections.\nTo handle general elections, one must use a family of vectors, one per length.\nThe most elegant approach to making sure such families are \"family-like\" is the\nrecently introduced notion of (polynomial-time uniform) pure scoring rules\n[Betzler and Dorn 2010], where each scoring vector is obtained from its\nprecursor by adding one new coefficient. We obtain the first dichotomy theorem\nfor pure scoring rules for a control problem. In particular, for constructive\ncontrol by adding voters (CCAV), we show that CCAV is solvable in polynomial\ntime for $k$-approval with $k \\leq 3$, $k$-veto with $k \\leq 2$, every pure\nscoring rule in which only the two top-rated candidates gain nonzero scores,\nand a particular rule that is a \"hybrid\" of 1-approval and 1-veto. For all\nother pure scoring rules, CCAV is NP-complete. We also investigate the\ndescriptive richness of different models for defining pure scoring rules,\nproving how more rule-generation time gives more rules, proving that rationals\ngive more rules than do the natural numbers, and proving that some restrictions\npreviously thought to be \"w.l.o.g.\" in fact do lose generality.\n", "versions": [{"version": "v1", "created": "Thu, 17 Apr 2014 15:38:54 GMT"}], "update_date": "2014-04-18", "authors_parsed": [["Hemaspaandra", "Edith", ""], ["Hemaspaandra", "Lane A.", ""], ["Schnoor", "Henning", ""]]}, {"id": "1404.4688", "submitter": "Reshef Meir", "authors": "Reshef Meir, Omer Lev, Jeffrey S. Rosenschein", "title": "A Local-Dominance Theory of Voting Equilibria", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that no reasonable voting rule is strategyproof. Moreover,\nthe common Plurality rule is particularly prone to strategic behavior of the\nvoters and empirical studies show that people often vote strategically in\npractice. Multiple game-theoretic models have been proposed to better\nunderstand and predict such behavior and the outcomes it induces. However,\nthese models often make unrealistic assumptions regarding voters' behavior and\nthe information on which they base their vote.\n  We suggest a new model for strategic voting that takes into account voters'\nbounded rationality, as well as their limited access to reliable information.\nWe introduce a simple behavioral heuristic based on \\emph{local dominance},\nwhere each voter considers a set of possible world states without assigning\nprobabilities to them. This set is constructed based on prospective candidates'\nscores (e.g., available from an inaccurate poll). In a \\emph{voting\nequilibrium}, all voters vote for candidates not dominated within the set of\npossible states.\n  We prove that these voting equilibria exist in the Plurality rule for a broad\nclass of local dominance relations (that is, different ways to decide which\nstates are possible). Furthermore, we show that in an iterative setting where\nvoters may repeatedly change their vote, local dominance-based dynamics quickly\nconverge to an equilibrium if voters start from the truthful state. Weaker\nconvergence guarantees in more general settings are also provided.\n  Using extensive simulations of strategic voting on generated and real\npreference profiles, we show that convergence is fast and robust, that emerging\nequilibria are consistent across various starting conditions, and that they\nreplicate widely known patterns of human voting behavior such as Duverger's\nlaw. Further, strategic voting generally improves the quality of the winner\ncompared to truthful voting.\n", "versions": [{"version": "v1", "created": "Fri, 18 Apr 2014 04:40:28 GMT"}, {"version": "v2", "created": "Mon, 21 Apr 2014 16:51:20 GMT"}], "update_date": "2014-04-22", "authors_parsed": [["Meir", "Reshef", ""], ["Lev", "Omer", ""], ["Rosenschein", "Jeffrey S.", ""]]}, {"id": "1404.4718", "submitter": "Shreyas Sekar", "authors": "Elliot Anshelevich and Shreyas Sekar", "title": "Approximate Equilibrium and Incentivizing Social Coordination", "comments": "A preliminary version of this work will appear in AAAI-14:\n  Twenty-Eighth Conference on Artificial Intelligence", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study techniques to incentivize self-interested agents to form socially\ndesirable solutions in scenarios where they benefit from mutual coordination.\nTowards this end, we consider coordination games where agents have different\nintrinsic preferences but they stand to gain if others choose the same strategy\nas them. For non-trivial versions of our game, stable solutions like Nash\nEquilibrium may not exist, or may be socially inefficient even when they do\nexist. This motivates us to focus on designing efficient algorithms to compute\n(almost) stable solutions like Approximate Equilibrium that can be realized if\nagents are provided some additional incentives. Our results apply in many\nsettings like adoption of new products, project selection, and group formation,\nwhere a central authority can direct agents towards a strategy but agents may\ndefect if they have better alternatives. We show that for any given instance,\nwe can either compute a high quality approximate equilibrium or a near-optimal\nsolution that can be stabilized by providing small payments to some players. We\nthen generalize our model to encompass situations where player relationships\nmay exhibit complementarities and present an algorithm to compute an\nApproximate Equilibrium whose stability factor is linear in the degree of\ncomplementarity. Our results imply that a little influence is necessary in\norder to ensure that selfish players coordinate and form socially efficient\nsolutions.\n", "versions": [{"version": "v1", "created": "Fri, 18 Apr 2014 08:28:09 GMT"}], "update_date": "2014-04-21", "authors_parsed": [["Anshelevich", "Elliot", ""], ["Sekar", "Shreyas", ""]]}, {"id": "1404.4856", "submitter": "Paul Hunter", "authors": "Paul Hunter and Jean-Fran\\c{c}ois Raskin", "title": "Quantitative games with interval objectives", "comments": "Full version of CONCUR submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditionally quantitative games such as mean-payoff games and discount sum\ngames have two players -- one trying to maximize the payoff, the other trying\nto minimize it. The associated decision problem, \"Can Eve (the maximizer)\nachieve, for example, a positive payoff?\" can be thought of as one player\ntrying to attain a payoff in the interval $(0,\\infty)$. In this paper we\nconsider the more general problem of determining if a player can attain a\npayoff in a finite union of arbitrary intervals for various payoff functions\n(liminf, mean-payoff, discount sum, total sum). In particular this includes the\ninteresting exact-value problem, \"Can Eve achieve a payoff of exactly (e.g.)\n0?\"\n", "versions": [{"version": "v1", "created": "Fri, 18 Apr 2014 18:56:33 GMT"}], "update_date": "2014-04-21", "authors_parsed": [["Hunter", "Paul", ""], ["Raskin", "Jean-François", ""]]}, {"id": "1404.5000", "submitter": "Renato Paes Leme", "authors": "Gagan Goel and Vahab Mirrokni and Renato Paes Leme", "title": "Clinching Auctions Beyond Hard Budget Constraints", "comments": "Accepted to EC'14", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Constraints on agent's ability to pay play a major role in auction design for\nany setting where the magnitude of financial transactions is sufficiently\nlarge. Those constraints have been traditionally modeled in mechanism design as\n\\emph{hard budget}, i.e., mechanism is not allowed to charge agents more than a\ncertain amount. Yet, real auction systems (such as Google AdWords) allow more\nsophisticated constraints on agents' ability to pay, such as \\emph{average\nbudgets}. In this work, we investigate the design of Pareto optimal and\nincentive compatible auctions for agents with \\emph{constrained quasi-linear\nutilities}, which captures more realistic models of liquidity constraints that\nthe agents may have. Our result applies to a very general class of allocation\nconstraints known as polymatroidal environments, encompassing many settings of\ninterest such as multi-unit auctions, matching markets, video-on-demand and\nadvertisement systems.\n  Our design is based Ausubel's \\emph{clinching framework}. Incentive\ncompatibility and feasibility with respect to ability-to-pay constraints are\ndirect consequences of the clinching framework. Pareto-optimality, on the other\nhand, is considerably more challenging, since the no-trade condition that\ncharacterizes it depends not only on whether agents have their budgets\nexhausted or not, but also on prices {at} which the goods are allocated. In\norder to get a handle on those prices, we introduce novel concepts of dropping\nprices and saturation. These concepts lead to our main structural result which\nis a characterization of the tight sets in the clinching auction outcome and\nits relation to dropping prices.\n", "versions": [{"version": "v1", "created": "Sun, 20 Apr 2014 01:21:39 GMT"}], "update_date": "2014-04-22", "authors_parsed": [["Goel", "Gagan", ""], ["Mirrokni", "Vahab", ""], ["Leme", "Renato Paes", ""]]}, {"id": "1404.5127", "submitter": "David Kurokawa", "authors": "Yoram Bachrach, Sofia Ceppi, Ian A. Kash, Peter Key, and David\n  Kurokawa", "title": "Optimising Trade-offs Among Stakeholders in Ad Auctions", "comments": "18 pages, 10 figures, ACM Conference on Economics and Computation\n  2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine trade-offs among stakeholders in ad auctions. Our metrics are the\nrevenue for the utility of the auctioneer, the number of clicks for the utility\nof the users and the welfare for the utility of the advertisers. We show how to\noptimize linear combinations of the stakeholder utilities, showing that these\ncan be tackled through a GSP auction with a per-click reserve price. We then\nexamine constrained optimization of stakeholder utilities.\n  We use simulations and analysis of real-world sponsored search auction data\nto demonstrate the feasible trade-offs, examining the effect of changing the\nallowed number of ads on the utilities of the stakeholders. We investigate both\nshort term effects, when the players do not have the time to modify their\nbehavior, and long term equilibrium conditions.\n  Finally, we examine a combinatorially richer constrained optimization\nproblem, where there are several possible allowed configurations (templates) of\nad formats. This model captures richer ad formats, which allow using the\navailable screen real estate in various ways. We show that two natural\ngeneralizations of the GSP auction rules to this domain are poorly behaved,\nresulting in not having a symmetric Nash equilibrium or having one with poor\nwelfare. We also provide positive results for restricted cases.\n", "versions": [{"version": "v1", "created": "Mon, 21 Apr 2014 07:06:22 GMT"}], "update_date": "2014-04-22", "authors_parsed": [["Bachrach", "Yoram", ""], ["Ceppi", "Sofia", ""], ["Kash", "Ian A.", ""], ["Key", "Peter", ""], ["Kurokawa", "David", ""]]}, {"id": "1404.5155", "submitter": "Tao Qin Dr.", "authors": "Yingce Xia, Tao Qin, Nenghai Yu, Tie-Yan Liu", "title": "Incentivizing High-quality Content from Heterogeneous Users: On the\n  Existence of Nash Equilibrium", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the existence of pure Nash equilibrium (PNE) for the mechanisms used\nin Internet services (e.g., online reviews and question-answer websites) to\nincentivize users to generate high-quality content. Most existing work assumes\nthat users are homogeneous and have the same ability. However, real-world users\nare heterogeneous and their abilities can be very different from each other due\nto their diverse background, culture, and profession. In this work, we consider\nheterogeneous users with the following framework: (1) the users are\nheterogeneous and each of them has a private type indicating the best quality\nof the content she can generate; (2) there is a fixed amount of reward to\nallocate to the participated users. Under this framework, we study the\nexistence of pure Nash equilibrium of several mechanisms composed by different\nallocation rules, action spaces, and information settings. We prove the\nexistence of PNE for some mechanisms and the non-existence of PNE for some\nmechanisms. We also discuss how to find a PNE for those mechanisms with PNE\neither through a constructive way or a search algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 21 Apr 2014 10:08:57 GMT"}], "update_date": "2014-04-22", "authors_parsed": [["Xia", "Yingce", ""], ["Qin", "Tao", ""], ["Yu", "Nenghai", ""], ["Liu", "Tie-Yan", ""]]}, {"id": "1404.5199", "submitter": "Hai-Jun Zhou", "authors": "Zhijian Wang, Bin Xu, Hai-Jun Zhou", "title": "Social cycling and conditional responses in the Rock-Paper-Scissors game", "comments": "7 pages + 14 pages supplementary information", "journal-ref": "Scientific Reports 4, 5830 (2014)", "doi": "10.1038/srep05830", "report-no": null, "categories": "physics.soc-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How humans make decisions in non-cooperative strategic interactions is a\nchallenging question. For the fundamental model system of Rock-Paper-Scissors\n(RPS) game, classic game theory of infinite rationality predicts the Nash\nequilibrium (NE) state with every player randomizing her choices to avoid being\nexploited, while evolutionary game theory of bounded rationality in general\npredicts persistent cyclic motions, especially for finite populations. However,\nas empirical studies on human subjects have been relatively sparse, it is still\na controversial issue as to which theoretical framework is more appropriate to\ndescribe decision making of human subjects. Here we observe population-level\ncyclic motions in a laboratory experiment of the discrete-time iterated RPS\ngame under the traditional random pairwise-matching protocol. The cycling\ndirection and frequency are not sensitive to the payoff parameter a. This\ncollective behavior contradicts with the NE theory but it is quantitatively\nexplained by a microscopic model of win-lose-tie conditional response without\nany adjustable parameter. Our theoretical calculations reveal that this new\nstrategy may offer higher payoffs to individual players in comparison with the\nNE mixed strategy, suggesting that high social efficiency is achievable through\noptimized conditional response.\n", "versions": [{"version": "v1", "created": "Mon, 21 Apr 2014 14:04:33 GMT"}], "update_date": "2014-07-29", "authors_parsed": [["Wang", "Zhijian", ""], ["Xu", "Bin", ""], ["Zhou", "Hai-Jun", ""]]}, {"id": "1404.5245", "submitter": "David Manlove", "authors": "Piotr Krysta, David Manlove, Baharak Rastegari and Jinshan Zhang", "title": "Size versus truthfulness in the House Allocation problem", "comments": "To appear in Algorithmica (preliminary version appeared in the\n  Proceedings of EC 2014)", "journal-ref": null, "doi": "10.1007/s00453-019-00584-7", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the House Allocation problem (also known as the Assignment problem),\ni.e., the problem of allocating a set of objects among a set of agents, where\neach agent has ordinal preferences (possibly involving ties) over a subset of\nthe objects. We focus on truthful mechanisms without monetary transfers for\nfinding large Pareto optimal matchings. It is straightforward to show that no\ndeterministic truthful mechanism can approximate a maximum cardinality Pareto\noptimal matching with ratio better than 2. We thus consider randomised\nmechanisms. We give a natural and explicit extension of the classical Random\nSerial Dictatorship Mechanism (RSDM) specifically for the House Allocation\nproblem where preference lists can include ties. We thus obtain a universally\ntruthful randomised mechanism for finding a Pareto optimal matching and show\nthat it achieves an approximation ratio of $\\frac{e}{e-1}$. The same bound\nholds even when agents have priorities (weights) and our goal is to find a\nmaximum weight (as opposed to maximum cardinality) Pareto optimal matching. On\nthe other hand we give a lower bound of $\\frac{18}{13}$ on the approximation\nratio of any universally truthful Pareto optimal mechanism in settings with\nstrict preferences. In the case that the mechanism must additionally be\nnon-bossy with an additional technical assumption, we show by utilising a\nresult of Bade that an improved lower bound of $\\frac{e}{e-1}$ holds. This\nlower bound is tight since RSDM for strict preference lists is non-bossy. We\nmoreover interpret our problem in terms of the classical secretary problem and\nprove that our mechanism provides the best randomised strategy of the\nadministrator who interviews the applicants.\n", "versions": [{"version": "v1", "created": "Mon, 21 Apr 2014 17:08:42 GMT"}, {"version": "v2", "created": "Wed, 11 Jun 2014 14:54:29 GMT"}, {"version": "v3", "created": "Thu, 26 Feb 2015 16:19:39 GMT"}, {"version": "v4", "created": "Sun, 5 May 2019 08:37:35 GMT"}, {"version": "v5", "created": "Tue, 7 May 2019 08:16:27 GMT"}, {"version": "v6", "created": "Thu, 9 May 2019 08:02:44 GMT"}], "update_date": "2019-05-10", "authors_parsed": [["Krysta", "Piotr", ""], ["Manlove", "David", ""], ["Rastegari", "Baharak", ""], ["Zhang", "Jinshan", ""]]}, {"id": "1404.5410", "submitter": "Giulio Cimini", "authors": "Giulio Cimini, Claudio Castellano and Angel S\\'anchez", "title": "Dynamics to equilibrium in Network Games: individual behavior and global\n  response", "comments": null, "journal-ref": "PLoS ONE 10(3): e0120343 (2015)", "doi": "10.1371/journal.pone.0120343", "report-no": null, "categories": "physics.soc-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various social contexts ranging from public goods provision to information\ncollection can be depicted as games of strategic interactions, where a player's\nwell-being depends on her own action as well as on the actions taken by her\nneighbors. Whereas much attention has been devoted to the identification and\ncharacterization of Bayes-Nash equilibria of such games, in this work we look\nat strategic interactions from an evolutionary perspective. Starting from a\nrecent mean-field analysis of the evolutionary dynamics in these games, here we\npresent results of numerical simulations designed to find out whether Nash\nequilibria are accessible by adaptation of players' strategies, and in general\nto find the attractors of the evolution. Simulations allow us to go beyond a\nglobal characterization of the cooperativeness of the equilibria and probe into\nthe individual behavior. We find that when players imitate each other, the\nevolution does not reach Nash equilibria and, worse, leads to very unfavorable\nstates in terms of welfare. On the contrary, when players update their behavior\nrationally, they self-organize into a rich variety of Nash equilibria, where\nindividual behavior and payoffs are shaped by the nature of the game, the\nstructure of the social network and the players' position within the topology.\nOur results allow us to assess the validity of the mean-field approaches and\nalso show qualitative agreement with theoretical predictions for equilibria in\nthe context of one-shot games under incomplete information.\n", "versions": [{"version": "v1", "created": "Tue, 22 Apr 2014 07:53:08 GMT"}], "update_date": "2015-04-01", "authors_parsed": [["Cimini", "Giulio", ""], ["Castellano", "Claudio", ""], ["Sánchez", "Angel", ""]]}, {"id": "1404.5433", "submitter": "Paolo Turrini", "authors": "Umberto Grandi, Davide Grossi and Paolo Turrini", "title": "Equilibrium Refinement through Negotiation in Binary Voting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study voting games on binary issues, where voters hold an objective over\nthe outcome of the collective decision and are allowed, before the vote takes\nplace, to negotiate their voting strategy with the other participants. We\nanalyse the voters' rational behaviour in the resulting two-phase game, showing\nunder what conditions undesirable equilibria can be removed and desirable ones\nsustained as a consequence of the pre-vote phase.\n", "versions": [{"version": "v1", "created": "Tue, 22 Apr 2014 09:26:29 GMT"}, {"version": "v2", "created": "Tue, 14 Jul 2015 16:28:16 GMT"}, {"version": "v3", "created": "Mon, 9 Jan 2017 13:26:14 GMT"}], "update_date": "2017-01-10", "authors_parsed": [["Grandi", "Umberto", ""], ["Grossi", "Davide", ""], ["Turrini", "Paolo", ""]]}, {"id": "1404.5453", "submitter": "Krishnendu Chatterjee", "authors": "Krishnendu Chatterjee and Laurent Doyen", "title": "Games with a Weak Adversary", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider multi-player graph games with partial-observation and parity\nobjective. While the decision problem for three-player games with a coalition\nof the first and second players against the third player is undecidable, we\npresent a decidability result for partial-observation games where the first and\nthird player are in a coalition against the second player, thus where the\nsecond player is adversarial but weaker due to partial-observation. We\nestablish tight complexity bounds in the case where player 1 is less informed\nthan player 2, namely 2-EXPTIME-completeness for parity objectives. The\nsymmetric case of player 1 more informed than player 2 is much more\ncomplicated, and we show that already in the case where player 1 has perfect\nobservation, memory of size non-elementary is necessary in general for\nreachability objectives, and the problem is decidable for safety and\nreachability objectives. Our results have tight connections with\npartial-observation stochastic games for which we derive new complexity\nresults.\n", "versions": [{"version": "v1", "created": "Tue, 22 Apr 2014 10:48:30 GMT"}], "update_date": "2014-04-23", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Doyen", "Laurent", ""]]}, {"id": "1404.5539", "submitter": "Mohammad Rasouli", "authors": "Mohammad Rasouli and Demosthenis Teneketzis", "title": "Electricity Pooling Markets with Strategic Producers Possessing\n  Asymmetric Information II: Inelastic Demand", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the restructured electricity industry, electricity pooling markets are an\noligopoly with strategic producers possessing private information (private\nproduction cost function). We focus on pooling markets where aggregate demand\nis represented by a non-strategic agent.\n  Inelasticity of demand is a main difficulty in electricity markets which can\npotentially result in market failure and high prices. We consider demand to be\ninelastic.\n  We propose a market mechanism that has the following features. (F1) It is\nindividually rational. (F2) It is budget balanced. (F3) It is price efficient,\nthat is, at equilibrium the price of electricity is equal to the marginal cost\nof production. (F4) The energy production profile corresponding to every\nnon-zero Nash equilibrium of the game induced by the mechanism is a solution of\nthe corresponding centralized problem where the objective is the maximization\nof the sum of the producers' and consumers' utilities.\n  We identify some open problems associated with our approach to electricity\npooling markets.\n", "versions": [{"version": "v1", "created": "Mon, 21 Apr 2014 17:29:57 GMT"}, {"version": "v2", "created": "Sun, 5 Oct 2014 16:04:40 GMT"}], "update_date": "2014-10-07", "authors_parsed": [["Rasouli", "Mohammad", ""], ["Teneketzis", "Demosthenis", ""]]}, {"id": "1404.5734", "submitter": "Krishnendu Chatterjee", "authors": "Krishnendu Chatterjee and Rasmus Ibsen-Jensen", "title": "The Complexity of Ergodic Mean-payoff Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two-player (zero-sum) concurrent mean-payoff games played on a\nfinite-state graph. We focus on the important sub-class of ergodic games where\nall states are visited infinitely often with probability 1. The algorithmic\nstudy of ergodic games was initiated in a seminal work of Hoffman and Karp in\n1966, but all basic complexity questions have remained unresolved. Our main\nresults for ergodic games are as follows: We establish (1) an optimal\nexponential bound on the patience of stationary strategies (where patience of a\ndistribution is the inverse of the smallest positive probability and represents\na complexity measure of a stationary strategy); (2) the approximation problem\nlie in FNP; (3) the approximation problem is at least as hard as the decision\nproblem for simple stochastic games (for which NP intersection coNP is the\nlong-standing best known bound). We present a variant of the strategy-iteration\nalgorithm by Hoffman and Karp; show that both our algorithm and the classical\nvalue-iteration algorithm can approximate the value in exponential time; and\nidentify a subclass where the value-iteration algorithm is a FPTAS. We also\nshow that the exact value can be expressed in the existential theory of the\nreals, and establish square-root sum hardness for a related class of games.\n", "versions": [{"version": "v1", "created": "Wed, 23 Apr 2014 08:12:19 GMT"}], "update_date": "2014-04-24", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Ibsen-Jensen", "Rasmus", ""]]}, {"id": "1404.5894", "submitter": "Gilles Geeraerts", "authors": "Thomas Brihaye, Gilles Geeraerts, Shankara Narayanan Krishna, Lakshmi\n  Manasa, Benjamin Monmege and Ashutosh Trivedi", "title": "Adding Negative Prices to Priced Timed Games", "comments": "Long version of a paper accepted for presentation at CONCUR 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Priced timed games (PTGs) are two-player zero-sum games played on the\ninfinite graph of configurations of priced timed automata where two players\ntake turns to choose transitions in order to optimize cost to reach target\nstates. Bouyer et al. and Alur, Bernadsky, and Madhusudan independently\nproposed algorithms to solve PTGs with nonnegative prices under certain\ndivergence restriction over prices. Brihaye, Bruyere, and Raskin later provided\na justification for such a restriction by showing the undecidability of the\noptimal strategy synthesis problem in the absence of this divergence\nrestriction. This problem for PTGs with one clock has long been conjectured to\nbe in polynomial time, however the current best known algorithm, by Hansen,\nIbsen-Jensen, and Miltersen, is exponential. We extend this picture by studying\nPTGs with both negative and positive prices. We refine the undecidability\nresults for optimal strategy synthesis problem, and show undecidability for\nseveral variants of optimal reachability cost objectives including reachability\ncost, time-bounded reachability cost, and repeated reachability cost\nobjectives. We also identify a subclass with bi-valued price-rates and give a\npseudo-polynomial algorithm to partially answer the conjecture on the\ncomplexity of one-clock PTGs.\n", "versions": [{"version": "v1", "created": "Wed, 23 Apr 2014 17:08:23 GMT"}, {"version": "v2", "created": "Thu, 24 Apr 2014 13:00:26 GMT"}, {"version": "v3", "created": "Sat, 21 Jun 2014 12:42:13 GMT"}, {"version": "v4", "created": "Wed, 25 Jun 2014 14:29:20 GMT"}, {"version": "v5", "created": "Mon, 25 Aug 2014 09:41:12 GMT"}, {"version": "v6", "created": "Mon, 17 Feb 2020 09:52:15 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Brihaye", "Thomas", ""], ["Geeraerts", "Gilles", ""], ["Krishna", "Shankara Narayanan", ""], ["Manasa", "Lakshmi", ""], ["Monmege", "Benjamin", ""], ["Trivedi", "Ashutosh", ""]]}, {"id": "1404.5943", "submitter": "Samuel Taggart", "authors": "Jason Hartline, Darrell Hoy, Sam Taggart", "title": "Price of Anarchy for Auction Revenue", "comments": "Earlier version appeared in EC 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops tools for welfare and revenue analyses of Bayes-Nash\nequilibria in asymmetric auctions with single-dimensional agents. We employ\nthese tools to derive price of anarchy results for social welfare and revenue.\nOur approach separates the standard smoothness framework into two distinct\nparts, isolating the analysis common to any auction from the analysis specific\nto a given auction. The first part relates a bidder's contribution to welfare\nin equilibrium to their contribution to welfare in the optimal auction using\nthe price the bidder faces for additional allocation. Intuitively, either an\nagent's utility and hence contribution to welfare is high, or the price she has\nto pay for additional allocation is high relative to her value. We call this\ncondition value covering; it holds in every Bayes-Nash equilibrium of any\nauction. The second part, revenue covering, relates the prices bidders face for\nadditional allocation to the revenue of the auction, using an auction's rules\nand feasibility constraints. Combining the two parts gives approximation\nresults to the optimal welfare, and, under the right conditions, the optimal\nrevenue. In mechanisms with reserve prices, our welfare results show\napproximation with respect to the optimal mechanism with the same reserves.\n  As a center-piece result, we analyze the single-item first-price auction with\nindividual monopoly reserves. When each distribution satisfies a regularity\ncondition the auction's revenue is at least a $2e/(e-1) \\approx 3.16$\napproximation to the revenue of the optimal auction. We also give bounds for\nmatroid auctions with first-price or all-pay semantics, and the generalized\nfirst-price position auction. Finally, we give an extension theorem for\nsimultaneous composition, i.e., when multiple auctions are run simultaneously,\nwith single-valued, unit-demand agents.\n", "versions": [{"version": "v1", "created": "Wed, 23 Apr 2014 19:57:35 GMT"}, {"version": "v2", "created": "Thu, 24 Apr 2014 19:37:37 GMT"}, {"version": "v3", "created": "Mon, 9 Jun 2014 19:54:34 GMT"}, {"version": "v4", "created": "Mon, 20 Feb 2017 18:59:16 GMT"}, {"version": "v5", "created": "Wed, 16 Jan 2019 16:28:01 GMT"}], "update_date": "2019-01-17", "authors_parsed": [["Hartline", "Jason", ""], ["Hoy", "Darrell", ""], ["Taggart", "Sam", ""]]}, {"id": "1404.5971", "submitter": "Shuchi Chawla", "authors": "Shuchi Chawla and Jason Hartline and Denis Nekipelov", "title": "Mechanism Design for Data Science", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Good economic mechanisms depend on the preferences of participants in the\nmechanism. For example, the revenue-optimal auction for selling an item is\nparameterized by a reserve price, and the appropriate reserve price depends on\nhow much the bidders are willing to pay. A mechanism designer can potentially\nlearn about the participants' preferences by observing historical data from the\nmechanism; the designer could then update the mechanism in response to learned\npreferences to improve its performance. The challenge of such an approach is\nthat the data corresponds to the actions of the participants and not their\npreferences. Preferences can potentially be inferred from actions but the\ndegree of inference possible depends on the mechanism. In the optimal auction\nexample, it is impossible to learn anything about preferences of bidders who\nare not willing to pay the reserve price. These bidders will not cast bids in\nthe auction and, from historical bid data, the auctioneer could never learn\nthat lowering the reserve price would give a higher revenue (even if it would).\nTo address this impossibility, the auctioneer could sacrifice revenue\noptimality in the initial auction to obtain better inference properties so that\nthe auction's parameters can be adapted to changing preferences in the future.\nThis paper develops the theory for optimal mechanism design subject to good\ninferability.\n", "versions": [{"version": "v1", "created": "Wed, 23 Apr 2014 20:27:58 GMT"}, {"version": "v2", "created": "Mon, 9 Jun 2014 19:41:44 GMT"}], "update_date": "2014-06-10", "authors_parsed": [["Chawla", "Shuchi", ""], ["Hartline", "Jason", ""], ["Nekipelov", "Denis", ""]]}, {"id": "1404.6003", "submitter": "Aaron Roth", "authors": "Arpita Ghosh and Katrina Ligett and Aaron Roth and Grant Schoenebeck", "title": "Buying Private Data without Verification", "comments": "Appears in EC 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of designing a survey to aggregate non-verifiable\ninformation from a privacy-sensitive population: an analyst wants to compute\nsome aggregate statistic from the private bits held by each member of a\npopulation, but cannot verify the correctness of the bits reported by\nparticipants in his survey. Individuals in the population are strategic agents\nwith a cost for privacy, \\ie, they not only account for the payments they\nexpect to receive from the mechanism, but also their privacy costs from any\ninformation revealed about them by the mechanism's outcome---the computed\nstatistic as well as the payments---to determine their utilities. How can the\nanalyst design payments to obtain an accurate estimate of the population\nstatistic when individuals strategically decide both whether to participate and\nwhether to truthfully report their sensitive information?\n  We design a differentially private peer-prediction mechanism that supports\naccurate estimation of the population statistic as a Bayes-Nash equilibrium in\nsettings where agents have explicit preferences for privacy. The mechanism\nrequires knowledge of the marginal prior distribution on bits $b_i$, but does\nnot need full knowledge of the marginal distribution on the costs $c_i$,\ninstead requiring only an approximate upper bound. Our mechanism guarantees\n$\\epsilon$-differential privacy to each agent $i$ against any adversary who can\nobserve the statistical estimate output by the mechanism, as well as the\npayments made to the $n-1$ other agents $j\\neq i$. Finally, we show that with\nslightly more structured assumptions on the privacy cost functions of each\nagent, the cost of running the survey goes to $0$ as the number of agents\ndiverges.\n", "versions": [{"version": "v1", "created": "Thu, 24 Apr 2014 00:30:35 GMT"}], "update_date": "2014-04-25", "authors_parsed": [["Ghosh", "Arpita", ""], ["Ligett", "Katrina", ""], ["Roth", "Aaron", ""], ["Schoenebeck", "Grant", ""]]}, {"id": "1404.6013", "submitter": "David Sun", "authors": "Jiajun Sun", "title": "Service-Constraint Based Truthful Incentive Mechanisms for Crowd Sensing", "comments": "arXiv admin note: substantial text overlap with arXiv:1306.5677,\n  arXiv:1404.2399 by other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crowd sensing is a new paradigm which leverages the pervasive smartphones to\nefficiently collect and upload sensing data, enabling numerous novel\napplications. To achieve good service quality for a crowd sensing application,\nincentive mechanisms are necessary for attracting more user participation. Most\nof existing mechanisms apply only for the budget-constraint scenario where the\nplatform (the crowd sensing organizer) has a budget limit. On the contrary, we\nfocus on a different scenario where the platform has a service limit. Based on\nthe offline and online auction model, we consider a general problem: users\nsubmit their private profiles to the platform, and the platform aims at\nselecting a subset of users before a specified deadline for minimizing the\ntotal payment while a specific service can be completed. Specially, we design\noffline and online service-constraint incentive mechanisms for the case where\nthe value function of selected users is monotone submodular. The mechanisms are\nindividual rationality, task feasibility, computational efficiency,\ntruthfulness, consumer sovereignty, constant frugality, and also performs well\nin practice. Finally, we use extensive simulations to demonstrate the\ntheoretical properties of our mechanisms.\n", "versions": [{"version": "v1", "created": "Thu, 24 Apr 2014 02:17:10 GMT"}, {"version": "v2", "created": "Mon, 1 Sep 2014 10:53:06 GMT"}, {"version": "v3", "created": "Wed, 3 Sep 2014 08:36:55 GMT"}, {"version": "v4", "created": "Thu, 4 Sep 2014 00:51:08 GMT"}, {"version": "v5", "created": "Fri, 12 Sep 2014 03:21:02 GMT"}, {"version": "v6", "created": "Tue, 16 Sep 2014 01:03:03 GMT"}, {"version": "v7", "created": "Wed, 24 Dec 2014 01:21:01 GMT"}], "update_date": "2014-12-25", "authors_parsed": [["Sun", "Jiajun", ""]]}, {"id": "1404.6103", "submitter": "Avinatan Hassidim", "authors": "Avinatan Hassidim and Assaf Romm", "title": "An Approximate \"Law of One Price\" in Random Assignment Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assignment games represent a tractable yet versatile model of two-sided\nmarkets with transfers. We study the likely properties of the core of randomly\ngenerated assignment games. If the joint productivities of every firm and\nworker are i.i.d bounded random variables, then with high probability all\nworkers are paid roughly equal wages, and all firms make similar profits. This\nimplies that core allocations vary significantly in balanced markets, but that\nthere is core convergence in even slightly unbalanced markets. For the\nbenchmark case of uniform distribution, we provide a tight bound for the\nworkers' share of the surplus under the firm-optimal core allocation. We\npresent simulation results suggesting that the phenomena analyzed appear even\nin medium-sized markets. Finally, we briefly discuss the effects of unbounded\ndistributions and the ways in which they may affect wage dispersion.\n", "versions": [{"version": "v1", "created": "Thu, 24 Apr 2014 12:26:04 GMT"}], "update_date": "2014-04-25", "authors_parsed": [["Hassidim", "Avinatan", ""], ["Romm", "Assaf", ""]]}, {"id": "1404.6228", "submitter": "Gilles Geeraerts", "authors": "Gilles Geeraerts, Jo\\\"el Goossens and Am\\'elie Stainer", "title": "Synthesising Succinct Strategies in Safety Games", "comments": "25 pags, 4 figures, 2 algorithms. Submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Finite turn-based safety games have been used for very different problems\nsuch as the synthesis of linear temporal logic (LTL), the synthesis of\nschedulers for computer systems running on multiprocessor platforms, and also\nfor the determinisation of timed automata. In these contexts, games are\nimplicitly defined, and their size is at least exponential in the size of the\ninput. Nevertheless, there are natural relations between states of arenas of\nsuch games. We first formalise the properties that we expect on the relation\nbetween states, thanks to the notion of alternating simulation. Then, we show\nhow such simulations can be exploited to (1) improve the running time of the\nOTFUR algorithm to compute winning strategies and (2) obtain a succinct\nrepresentation of a winning strategy. We also show that our general theory\napplies to the three applications mentioned above.\n", "versions": [{"version": "v1", "created": "Wed, 23 Apr 2014 09:47:29 GMT"}, {"version": "v2", "created": "Tue, 6 May 2014 21:41:28 GMT"}], "update_date": "2014-05-08", "authors_parsed": [["Geeraerts", "Gilles", ""], ["Goossens", "Joël", ""], ["Stainer", "Amélie", ""]]}, {"id": "1404.6766", "submitter": "Arnob Ghosh", "authors": "Arnob Ghosh, Saswati Sarkar", "title": "Quality Sensitive Price Competition in Spectrum Oligopoly: Part II", "comments": "Added several results from the other versions. Submitted to IEEE\n  Transactions on Information Theory. 63 pages one column, 22 figures", "journal-ref": null, "doi": "10.1109/ISIT.2013.6620730", "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a spectrum oligopoly market where each primary seeks to sell\nsecondary access to its channel at multiple locations. Transmission qualities\nof a channel evolve randomly. Each primary needs to select a price and a set of\nnon-interfering locations (which is an independent set in the conflict graph of\nthe region) at which to offer its channel without knowing the transmission\nqualities of the channels of its competitors. We formulate the above problem as\na non-cooperative game. We consider two scenarios-i) when the region is small,\nii) when the region is large. In the first setting, we focus on a class of\nconflict graphs, known as mean valid graphs which commonly arise when the\nregion is small. We explicitly compute a symmetric Nash equilibrium (NE); the\nNE is threshold type in that primaries only choose independent set whose\ncardinality is greater than a certain threshold. The threshold on the\ncardinality increases with increase in quality of the channel on sale. We show\nthat the symmetric NE strategy profile is unique in a special class of conflict\ngraphs (linear graph). In the second setting, we consider node symmetric\nconflict graphs which arises when the number of locations is large\n(potentially, infinite). We explicitly compute a symmetric NE that randomizes\nequally among the maximum independent sets at a given channel state vector. In\nthe NE a primary only selects the maximum independent set at a given channel\nstate vector. We show that the two symmetric NEs computed in two settings\nexhibit important structural difference.\n", "versions": [{"version": "v1", "created": "Sun, 27 Apr 2014 15:19:59 GMT"}, {"version": "v2", "created": "Sat, 15 Nov 2014 16:17:26 GMT"}, {"version": "v3", "created": "Sun, 11 Oct 2015 15:45:15 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Ghosh", "Arnob", ""], ["Sarkar", "Saswati", ""]]}, {"id": "1404.6786", "submitter": "Shahar Dobzinski", "authors": "Liad Blumrosen and Shahar Dobzinski", "title": "Reallocation Mechanisms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider reallocation problems in settings where the initial endowment of\neach agent consists of a subset of the resources. The private information of\nthe players is their value for every possible subset of the resources. The goal\nis to redistribute resources among agents to maximize efficiency. Monetary\ntransfers are allowed, but participation is voluntary.\n  We develop incentive-compatible, individually-rational and budget balanced\nmechanisms for several classic settings, including bilateral trade, partnership\ndissolving, Arrow-Debreu markets, and combinatorial exchanges. All our\nmechanisms (except one) provide a constant approximation to the optimal\nefficiency in these settings, even in ones where the preferences of the agents\nare complex multi-parameter functions.\n", "versions": [{"version": "v1", "created": "Sun, 27 Apr 2014 16:43:54 GMT"}], "update_date": "2014-04-29", "authors_parsed": [["Blumrosen", "Liad", ""], ["Dobzinski", "Shahar", ""]]}, {"id": "1404.7061", "submitter": "Setareh Maghsudi", "authors": "Setareh Maghsudi and Slawomir Stanczak", "title": "Channel Selection for Network-assisted D2D Communication via No-Regret\n  Bandit Learning with Calibrated Forecasting", "comments": "31 pages (one column), 9 figures", "journal-ref": null, "doi": "10.1109/TWC.2014.2365803", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the distributed channel selection problem in the context of\ndevice-to-device (D2D) communication as an underlay to a cellular network.\nUnderlaid D2D users communicate directly by utilizing the cellular spectrum but\ntheir decisions are not governed by any centralized controller. Selfish D2D\nusers that compete for access to the resources construct a distributed system,\nwhere the transmission performance depends on channel availability and quality.\nThis information, however, is difficult to acquire. Moreover, the adverse\neffects of D2D users on cellular transmissions should be minimized. In order to\novercome these limitations, we propose a network-assisted distributed channel\nselection approach in which D2D users are only allowed to use vacant cellular\nchannels. This scenario is modeled as a multi-player multi-armed bandit game\nwith side information, for which a distributed algorithmic solution is\nproposed. The solution is a combination of no-regret learning and calibrated\nforecasting, and can be applied to a broad class of multi-player stochastic\nlearning problems, in addition to the formulated channel selection problem.\nAnalytically, it is established that this approach not only yields vanishing\nregret (in comparison to the global optimal solution), but also guarantees that\nthe empirical joint frequencies of the game converge to the set of correlated\nequilibria.\n", "versions": [{"version": "v1", "created": "Mon, 28 Apr 2014 17:12:02 GMT"}], "update_date": "2015-02-13", "authors_parsed": [["Maghsudi", "Setareh", ""], ["Stanczak", "Slawomir", ""]]}, {"id": "1404.7076", "submitter": "Valerio Capraro", "authors": "Valerio Capraro, Jillian J. Jordan, and David G. Rand", "title": "Heuristics guide the implementation of social preferences in one-shot\n  Prisoner's Dilemma experiments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperation in one-shot anonymous interactions is a widely documented aspect\nof human behaviour. Here we shed light on the motivations behind this behaviour\nby experimentally exploring cooperation in a one-shot continuous-strategy\nPrisoner's Dilemma (i.e. one-shot two-player Public Goods Game). We examine the\ndistribution of cooperation amounts, and how that distribution varies based on\nthe benefit-to-cost ratio of cooperation (b/c). Interestingly, we find a\ntrimodal distribution at all b/c values investigated. Increasing b/c decreases\nthe fraction of participants engaging in zero cooperation and increases the\nfraction engaging in maximal cooperation, suggesting a role for efficiency\nconcerns. However, a substantial fraction of participants consistently engage\nin 50% cooperation regardless of b/c. The presence of these persistent 50%\ncooperators is surprising, and not easily explained by standard models of\nsocial preferences. We present evidence that this behaviour is a result of\nsocial preferences guided by simple decision heuristics, rather than the\nrational examination of payoffs assumed by most social preference models. We\nalso find a strong correlation between play in the Prisoner's Dilemma and in a\nsubsequent Dictator Game, confirming previous findings suggesting a common\nprosocial motivation underlying altruism and cooperation.\n", "versions": [{"version": "v1", "created": "Mon, 28 Apr 2014 18:05:10 GMT"}, {"version": "v2", "created": "Wed, 13 Aug 2014 17:23:58 GMT"}], "update_date": "2014-08-14", "authors_parsed": [["Capraro", "Valerio", ""], ["Jordan", "Jillian J.", ""], ["Rand", "David G.", ""]]}, {"id": "1404.7239", "submitter": "Gal Oshri", "authors": "Mark Braverman, Gal Oshri", "title": "Contracting Experts With Unknown Cost Structures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the problem of a principal looking to contract an expert to\nprovide a probability forecast for a categorical event. We assume all experts\nhave a common public prior on the event's probability, but can form more\naccurate opinions by engaging in research. Various experts' research costs are\nunknown to the principal. We present a truthful and efficient mechanism for the\nprincipal's problem of contracting an expert. This results in the principal\ncontracting the best expert to do the work, and the principal's expected\nutility is equivalent to having the second best expert in-house. Our mechanism\nconnects scoring rules with auctions, a connection that is useful when\nobtaining new information requires costly research.\n", "versions": [{"version": "v1", "created": "Tue, 29 Apr 2014 05:33:27 GMT"}], "update_date": "2014-04-30", "authors_parsed": [["Braverman", "Mark", ""], ["Oshri", "Gal", ""]]}, {"id": "1404.7770", "submitter": "EPTCS", "authors": "Dietmar Berwanger (Laboratoire Specification et Verification CNRS &\n  ENS Cachan, France), Anup Basil Mathew (Institute of Mathematical Sciences\n  Chennai, India)", "title": "Games with recurring certainty", "comments": "In Proceedings SR 2014, arXiv:1404.0414", "journal-ref": "EPTCS 146, 2014, pp. 91-96", "doi": "10.4204/EPTCS.146.12", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Infinite games where several players seek to coordinate under imperfect\ninformation are known to be intractable, unless the information flow is\nseverely restricted. Examples of undecidable cases typically feature a\nsituation where players become uncertain about the current state of the game,\nand this uncertainty lasts forever. Here we consider games where the players\nattain certainty about the current state over and over again along any play.\nFor finite-state games, we note that this kind of recurring certainty implies a\nstronger condition of periodic certainty, that is, the events of state\ncertainty ultimately occur at uniform, regular intervals. We show that it is\ndecidable whether a given game presents recurring certainty, and that, if so,\nthe problem of synthesising coordination strategies under w-regular winning\nconditions is solvable.\n", "versions": [{"version": "v1", "created": "Thu, 3 Apr 2014 10:39:03 GMT"}], "update_date": "2014-05-01", "authors_parsed": [["Berwanger", "Dietmar", "", "Laboratoire Specification et Verification CNRS &\n  ENS Cachan, France"], ["Mathew", "Anup Basil", "", "Institute of Mathematical Sciences\n  Chennai, India"]]}, {"id": "1404.7784", "submitter": "Ahuva Mu'alem", "authors": "Ahuva Mualem", "title": "Monotonicity, Revenue Equivalence and Budgets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study multidimensional mechanism design in a common scenario where players\nhave private information about their willingness to pay and their ability to\npay. We provide a complete characterization of dominant-strategy\nincentive-compatible direct mechanisms where over-reporting the budget is not\npossible. In several settings, reporting larger budgets can be made suboptimal\nwith a small randomized modification to the payments. We then derive a closely\nrelated partial characterization for the general case where players can\narbitrarily misreport their private budgets. Immediate applications of these\nresults include simple characterizations for mechanisms with publicly-known\nbudgets and for mechanisms without monetary transfers.\n  The celebrated revenue equivalence theorem states that the seller\"s revenue\nfor a broad class of standard auction formats and settings will be the same in\nequilibrium. Our main application is a revenue equivalence theorem for\nfinancially constrained bidders.\n", "versions": [{"version": "v1", "created": "Wed, 30 Apr 2014 16:28:08 GMT"}], "update_date": "2014-05-01", "authors_parsed": [["Mualem", "Ahuva", ""]]}]