[{"id": "1405.0055", "submitter": "Abuzer Yakaryilmaz", "authors": "Arseny M. Shur and Abuzer Yakaryilmaz", "title": "Quantum, Stochastic, and Pseudo Stochastic Languages with Few States", "comments": "A new version with new results. Previous version: Arseny M. Shur,\n  Abuzer Yakaryilmaz: Quantum, Stochastic, and Pseudo Stochastic Languages with\n  Few States. UCNC 2014: 327-339", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic languages are the languages recognized by probabilistic finite\nautomata (PFAs) with cutpoint over the field of real numbers. More general\ncomputational models over the same field such as generalized finite automata\n(GFAs) and quantum finite automata (QFAs) define the same class. In 1963, Rabin\nproved the set of stochastic languages to be uncountable presenting a single\n2-state PFA over the binary alphabet recognizing uncountably many languages\ndepending on the cutpoint. In this paper, we show the same result for unary\nstochastic languages. Namely, we exhibit a 2-state unary GFA, a 2-state unary\nQFA, and a family of 3-state unary PFAs recognizing uncountably many languages;\nall these numbers of states are optimal. After this, we completely characterize\nthe class of languages recognized by 1-state GFAs, which is the only nontrivial\nclass of languages recognized by 1-state automata. Finally, we consider the\nvariations of PFAs, QFAs, and GFAs based on the notion of inclusive/exclusive\ncutpoint, and present some results on their expressive power.\n", "versions": [{"version": "v1", "created": "Wed, 30 Apr 2014 23:29:33 GMT"}, {"version": "v2", "created": "Sat, 20 Dec 2014 11:32:09 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Shur", "Arseny M.", ""], ["Yakaryilmaz", "Abuzer", ""]]}, {"id": "1405.0500", "submitter": "Michael Riley", "authors": "Mehryar Mohri and Michael D. Riley", "title": "On the Disambiguation of Weighted Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a disambiguation algorithm for weighted automata. The algorithm\nadmits two main stages: a pre-disambiguation stage followed by a transition\nremoval stage. We give a detailed description of the algorithm and the proof of\nits correctness. The algorithm is not applicable to all weighted automata but\nwe prove sufficient conditions for its applicability in the case of the\ntropical semiring by introducing the *weak twins property*. In particular, the\nalgorithm can be used with all acyclic weighted automata, relevant to\napplications. While disambiguation can sometimes be achieved using\ndeterminization, our disambiguation algorithm in some cases can return a result\nthat is exponentially smaller than any equivalent deterministic automaton. We\nalso present some empirical evidence of the space benefits of disambiguation\nover determinization in speech recognition and machine translation\napplications.\n", "versions": [{"version": "v1", "created": "Fri, 2 May 2014 20:10:19 GMT"}], "update_date": "2014-05-06", "authors_parsed": [["Mohri", "Mehryar", ""], ["Riley", "Michael D.", ""]]}, {"id": "1405.0514", "submitter": "Ines Marusic", "authors": "Ines Marusic and James Worrell", "title": "Complexity of Equivalence and Learning for Multiplicity Tree Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the complexity of equivalence and learning for multiplicity tree\nautomata, i.e., weighted tree automata over a field. We first show that the\nequivalence problem is logspace equivalent to polynomial identity testing, the\ncomplexity of which is a longstanding open problem. Secondly, we derive lower\nbounds on the number of queries needed to learn multiplicity tree automata in\nAngluin's exact learning model, over both arbitrary and fixed fields.\n  Habrard and Oncina (2006) give an exact learning algorithm for multiplicity\ntree automata, in which the number of queries is proportional to the size of\nthe target automaton and the size of a largest counterexample, represented as a\ntree, that is returned by the Teacher. However, the smallest\ntree-counterexample may be exponential in the size of the target automaton.\nThus the above algorithm does not run in time polynomial in the size of the\ntarget automaton, and has query complexity exponential in the lower bound.\n  Assuming a Teacher that returns minimal DAG representations of\ncounterexamples, we give a new exact learning algorithm whose query complexity\nis quadratic in the target automaton size, almost matching the lower bound, and\nimproving the best previously-known algorithm by an exponential factor.\n", "versions": [{"version": "v1", "created": "Fri, 2 May 2014 20:58:39 GMT"}, {"version": "v2", "created": "Thu, 27 Nov 2014 18:59:45 GMT"}], "update_date": "2014-12-01", "authors_parsed": [["Marusic", "Ines", ""], ["Worrell", "James", ""]]}, {"id": "1405.0562", "submitter": "Ryoma Sin'ya", "authors": "Ryoma Sin'ya, Kiminori Matsuzaki, Masataka Sassa", "title": "Simultaneous Finite Automata: An Efficient Data-Parallel Model for\n  Regular Expression Matching", "comments": "This paper has been accepted at the following conference: 2013\n  International Conference on Parallel Processing (ICPP- 2013), October 1-4,\n  2013 Ecole Normale Suprieure de Lyon, Lyon, France", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automata play important roles in wide area of computing and the growth of\nmulticores calls for their efficient parallel implementation. Though it is\nknown in theory that we can perform the computation of a finite automaton in\nparallel by simulating transitions, its implementation has a large overhead due\nto the simulation. In this paper we propose a new automaton called simultaneous\nfinite automaton (SFA) for efficient parallel computation of an automaton. The\nkey idea is to extend an automaton so that it involves the simulation of\ntransitions. Since an SFA itself has a good property of parallelism, we can\ndevelop easily a parallel implementation without overheads. We have implemented\na regular expression matcher based on SFA, and it has achieved over 10-times\nspeedups on an environment with dual hexa-core CPUs in a typical case.\n", "versions": [{"version": "v1", "created": "Sat, 3 May 2014 09:35:47 GMT"}], "update_date": "2014-05-06", "authors_parsed": [["Sin'ya", "Ryoma", ""], ["Matsuzaki", "Kiminori", ""], ["Sassa", "Masataka", ""]]}, {"id": "1405.0628", "submitter": "Richard Mayr", "authors": "Parosh Aziz Abdulla, Mohamed Faouzi Atig, Piotr Hofman, Richard Mayr,\n  K. Narayan Kumar, Patrick Totzke", "title": "Infinite-State Energy Games", "comments": "11 pages", "journal-ref": "Full version (including proofs) of material presented at CSL-LICS\n  2014 (Vienna, Austria)", "doi": null, "report-no": "EDI-INF-RR-1419", "categories": "cs.GT cs.FL", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Energy games are a well-studied class of 2-player turn-based games on a\nfinite graph where transitions are labeled with integer vectors which represent\nchanges in a multidimensional resource (the energy). One player tries to keep\nthe cumulative changes non-negative in every component while the other tries to\nfrustrate this. We consider generalized energy games played on infinite game\ngraphs induced by pushdown automata (modelling recursion) or their subclass of\none-counter automata. Our main result is that energy games are decidable in the\ncase where the game graph is induced by a one-counter automaton and the energy\nis one-dimensional. On the other hand, every further generalization is\nundecidable: Energy games on one-counter automata with a 2-dimensional energy\nare undecidable, and energy games on pushdown automata are undecidable even if\nthe energy is one-dimensional. Furthermore, we show that energy games and\nsimulation games are inter-reducible, and thus we additionally obtain several\nnew (un)decidability results for the problem of checking simulation preorder\nbetween pushdown automata and vector addition systems.\n", "versions": [{"version": "v1", "created": "Sat, 3 May 2014 22:58:39 GMT"}], "update_date": "2014-05-06", "authors_parsed": [["Abdulla", "Parosh Aziz", ""], ["Atig", "Mohamed Faouzi", ""], ["Hofman", "Piotr", ""], ["Mayr", "Richard", ""], ["Kumar", "K. Narayan", ""], ["Totzke", "Patrick", ""]]}, {"id": "1405.0982", "submitter": "James M. Belk", "authors": "James Belk and Collin Bleak", "title": "Some undecidability results for asynchronous transducers and the\n  Brin-Thompson group 2V", "comments": "16 pages, 3 figures", "journal-ref": "Trans. Amer. Math. Soc. 369 (2017), 3157-3172", "doi": "10.1090/tran/6963", "report-no": null, "categories": "math.GR cs.FL math.DS math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using a result of Kari and Ollinger, we prove that the torsion problem for\nelements of the Brin-Thompson group 2V is undecidable. As a result, we show\nthat there does not exist an algorithm to determine whether an element of the\nrational group R of Grigorchuk, Nekrashevich, and Sushchanskii has finite\norder. A modification of the construction gives other undecidability results\nabout the dynamics of the action of elements of 2V on Cantor Space.\nArzhantseva, Lafont, and Minasyanin prove in 2012 that there exists a finitely\npresented group with solvable word problem and unsolvable torsion problem. To\nour knowledge, 2V furnishes the first concrete example of such a group, and\ngives an example of a direct undecidability result in the extended family of R.\nThompson type groups.\n", "versions": [{"version": "v1", "created": "Mon, 5 May 2014 18:35:09 GMT"}], "update_date": "2018-10-30", "authors_parsed": [["Belk", "James", ""], ["Bleak", "Collin", ""]]}, {"id": "1405.1107", "submitter": "Szabolcs Iv\\'an", "authors": "Szabolcs Ivan", "title": "On state complexity of unions of binary factor-free languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been conjectured in 2011 by Brzozowski et al. that if $K$ and $L$ are\nfactor-free regular languages over a binary alphabet having state complexity\n$m$ and $n$, resp, then the state complexity of $K\\cup L$ is at most\n$mn-(m+n)+3-\\min\\{m,n\\}$.\n  We disprove this conjecture by giving a lower bound of\n$mn-(m+n)-2-\\lfloor\\frac{\\min\\{m,n\\}-2}{2}\\rfloor$, which exceeds the\nconjectured bound whenever $\\min\\{m,n\\}\\geq 10$.\n", "versions": [{"version": "v1", "created": "Tue, 6 May 2014 00:10:08 GMT"}], "update_date": "2014-05-07", "authors_parsed": [["Ivan", "Szabolcs", ""]]}, {"id": "1405.1546", "submitter": "Daniele Gorla", "authors": "Thomas Given-Wilson (NICTA (Sydney, Australia)), Daniele Gorla (Dip.\n  Informatica - Univ. di Roma), Barry Jay (Centre for Quantum Computation and\n  Intelligent Systems and School of Software)", "title": "A Concurrent Pattern Calculus", "comments": "Logical Methods in Computer Science (2014)", "journal-ref": "Logical Methods in Computer Science, Volume 10, Issue 3 (August\n  23, 2014) lmcs:774", "doi": "10.2168/LMCS-10(3:10)2014", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concurrent pattern calculus (CPC) drives interaction between processes by\ncomparing data structures, just as sequential pattern calculus drives\ncomputation. By generalising from pattern matching to pattern unification,\ninteraction becomes symmetrical, with information flowing in both directions.\nCPC provides a natural language to express trade where information exchange is\npivotal to interaction. The unification allows some patterns to be more\ndiscriminating than others; hence, the behavioural theory must take this aspect\ninto account, so that bisimulation becomes subject to compatibility of\npatterns. Many popular process calculi can be encoded in CPC; this allows for a\ngain in expressiveness, formalised through encodings.\n", "versions": [{"version": "v1", "created": "Wed, 7 May 2014 09:35:48 GMT"}, {"version": "v2", "created": "Fri, 20 Jun 2014 13:56:30 GMT"}, {"version": "v3", "created": "Wed, 20 Aug 2014 23:26:48 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Given-Wilson", "Thomas", "", "NICTA"], ["Gorla", "Daniele", "", "Dip.\n  Informatica - Univ. di Roma"], ["Jay", "Barry", "", "Centre for Quantum Computation and\n  Intelligent Systems and School of Software"]]}, {"id": "1405.1655", "submitter": "Abuzer Yakaryilmaz", "authors": "Abuzer Yakaryilmaz and A. C. Cem Say, and H. G\\\"okalp Demirci", "title": "Debates with small transparent quantum verifiers", "comments": "18 pages. A revised and extended version. A preliminary version\n  appeared in the proceedings of DLT2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.FL quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a model where two opposing provers debate over the membership status\nof a given string in a language, trying to convince a weak verifier whose coins\nare visible to all. We show that the incorporation of just two qubits to an\notherwise classical constant-space verifier raises the class of debatable\nlanguages from at most $\\mathsf{NP}$ to the collection of all Turing-decidable\nlanguages (recursive languages). When the verifier is further constrained to\nmake the correct decision with probability 1, the corresponding class goes up\nfrom the regular languages up to at least $\\mathsf{E}$. We also show that the\nquantum model outperforms its classical counterpart when restricted to run in\npolynomial time, and demonstrate some non-context-free languages which have\nsuch short debates with quantum verifiers.\n", "versions": [{"version": "v1", "created": "Wed, 7 May 2014 16:08:56 GMT"}, {"version": "v2", "created": "Thu, 9 Jul 2015 22:55:20 GMT"}], "update_date": "2015-07-13", "authors_parsed": [["Yakaryilmaz", "Abuzer", ""], ["Say", "A. C. Cem", ""], ["Demirci", "H. Gökalp", ""]]}, {"id": "1405.1841", "submitter": "Javier Esparza", "authors": "Javier Esparza", "title": "Keeping a Crowd Safe: On the Complexity of Parameterized Verification\n  (Corrected version)", "comments": "A former version of this paper was published in the Proceedings of\n  STACS 2014. This version corrects two mistakes in Sections 3.3. and 3.4, and\n  some typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We survey some results on the automatic verification of parameterized\nprograms without identities. These are systems composed of arbitrarily many\ncomponents, all of them running exactly the same finite-state program. We\ndiscuss the complexity of deciding that no component reaches an unsafe state.\nThe note is addressed at theoretical computer scientists in general.\n", "versions": [{"version": "v1", "created": "Thu, 8 May 2014 08:58:33 GMT"}], "update_date": "2014-05-09", "authors_parsed": [["Esparza", "Javier", ""]]}, {"id": "1405.2435", "submitter": "Avraham N. Trahtman", "authors": "A.N. Trahtman", "title": "The length of a minimal synchronizing word and the \\v{C}erny conjecture", "comments": "21 pages, 15 figures. arXiv admin note: text overlap with\n  arXiv:1202.4626", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A word w of letters on edges of underlying graph Gamma of deterministic\nfinite automaton (DFA) is called the synchronizing word if w sends all states\nof the automaton to a unique state. J. Cerny discovered in 1964 a sequence of\nn-state complete DFA possessing a minimal synchronizing word of length (n-1)^2.\nThe hypothesis, well known today as the Cerny conjecture, claims that it is\nalso precise upper bound on the length of such a word for a complete DFA. This\nsimple looking conjecture is arguably the most fascinating and longstanding\nopen problem in the theory of finite automaton. The hypothesis was formulated\nin 1966 by Starke. The problem has motivated great and constantly growing\nnumber of investigations and generalizations. To prove the conjecture, we use\nalgebra with non-standard operations on a special class of matrices (row\nmonomial), induced by words in the alphabet of labels on edges. These matrices\ngenerate a space with respect to the mentioned operation. The proof is based on\nconnection between length of words u and dimension of the space generated by\nsolutions Lx of matrix equation MuLx =Ms for synchronizing word s, as well as\non the relation between ranks of Mu and Lx.\n", "versions": [{"version": "v1", "created": "Sat, 10 May 2014 13:59:46 GMT"}, {"version": "v10", "created": "Sat, 21 Oct 2017 06:26:08 GMT"}, {"version": "v11", "created": "Sun, 18 Jul 2021 14:02:36 GMT"}, {"version": "v2", "created": "Fri, 9 Sep 2016 11:05:15 GMT"}, {"version": "v3", "created": "Sat, 19 Nov 2016 07:17:59 GMT"}, {"version": "v4", "created": "Wed, 5 Apr 2017 08:31:46 GMT"}, {"version": "v5", "created": "Sat, 6 May 2017 10:13:28 GMT"}, {"version": "v6", "created": "Tue, 6 Jun 2017 05:59:35 GMT"}, {"version": "v7", "created": "Tue, 20 Jun 2017 11:23:09 GMT"}, {"version": "v8", "created": "Wed, 26 Jul 2017 07:32:22 GMT"}, {"version": "v9", "created": "Mon, 9 Oct 2017 09:11:49 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Trahtman", "A. N.", ""]]}, {"id": "1405.2553", "submitter": "Ryoma Sin'ya", "authors": "Ryoma Sin'ya", "title": "Graph Spectral Properties of Deterministic Finite Automata", "comments": "This paper has been accepted at the following conference: 18th\n  International Conference on Developments in Language Theory (DLT 2014),\n  August 26 - 29, 2014, Ekaterinburg, Russia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that a minimal automaton has a minimal adjacency matrix rank and a\nminimal adjacency matrix nullity using equitable partition (from graph spectra\ntheory) and Nerode partition (from automata theory). This result naturally\nintroduces the notion of matrix rank into a regular language L, the minimal\nadjacency matrix rank of a deterministic automaton that recognises L. We then\ndefine and focus on rank-one languages: the class of languages for which the\nrank of minimal automaton is one. We also define the expanded canonical\nautomaton of a rank-one language.\n", "versions": [{"version": "v1", "created": "Sun, 11 May 2014 17:13:04 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["Sin'ya", "Ryoma", ""]]}, {"id": "1405.2892", "submitter": "Abuzer Yakaryilmaz", "authors": "Zuzana Bedn\\'arov\\'a, Viliam Geffert, Klaus Reinhardt, and Abuzer\n  Yakaryilmaz", "title": "New Results on the Minimum Amount of Useful Space", "comments": "21 pages. An extended and revised version with two new authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CC quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present several new results on minimal space requirements to recognize a\nnonregular language: (i) realtime nondeterministic Turing machines can\nrecognize a nonregular unary language within weak $\\log\\log n$ space, (ii)\n$\\log\\log n$ is a tight space lower bound for accepting general nonregular\nlanguages on weak realtime pushdown automata, (iii) there exist unary\nnonregular languages accepted by realtime alternating one-counter automata\nwithin weak $\\log n$ space, (iv) there exist nonregular languages accepted by\ntwo-way deterministic pushdown automata within strong $\\log\\log n$ space, and,\n(v) there exist unary nonregular languages accepted by two-way one-counter\nautomata using quantum and classical states with middle $\\log n$ space and\nbounded error.\n", "versions": [{"version": "v1", "created": "Mon, 12 May 2014 19:35:39 GMT"}, {"version": "v2", "created": "Tue, 4 Aug 2015 12:55:50 GMT"}], "update_date": "2015-08-05", "authors_parsed": [["Bednárová", "Zuzana", ""], ["Geffert", "Viliam", ""], ["Reinhardt", "Klaus", ""], ["Yakaryilmaz", "Abuzer", ""]]}, {"id": "1405.3069", "submitter": "Pierre Ganty", "authors": "Pierre Ganty and Radu Iosif", "title": "Interprocedural Reachability for Flat Integer Programs", "comments": "38 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study programs with integer data, procedure calls and arbitrary call\ngraphs. We show that, whenever the guards and updates are given by octagonal\nrelations, the reachability problem along control flow paths within some\nlanguage w1* ... wd* over program statements is decidable in Nexptime. To\nachieve this upper bound, we combine a program transformation into the same\nclass of programs but without procedures, with an Np-completeness result for\nthe reachability problem of procedure-less programs. Besides the program, the\nexpression w1* ... wd* is also mapped onto an expression of a similar form but\nthis time over the transformed program statements. Several arguments involving\ncontext-free grammars and their generative process enable us to give tight\nbounds on the size of the resulting expression. The currently existing gap\nbetween Np-hard and Nexptime can be closed to Np-complete when a certain\nparameter of the analysis is assumed to be constant.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2014 08:48:24 GMT"}, {"version": "v2", "created": "Wed, 1 Oct 2014 12:02:24 GMT"}, {"version": "v3", "created": "Thu, 11 Jun 2015 19:41:24 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Ganty", "Pierre", ""], ["Iosif", "Radu", ""]]}, {"id": "1405.3532", "submitter": "Eric Rowland", "authors": "Aline Parreau, Michel Rigo, Eric Rowland, Elise Vandomme", "title": "A new approach to the $2$-regularity of the $\\ell$-abelian complexity of\n  $2$-automatic sequences", "comments": "44 pages, 2 figures; publication version", "journal-ref": "The Electronic Journal of Combinatorics 22 (2015) #P1.27", "doi": null, "report-no": null, "categories": "cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that a sequence satisfying a certain symmetry property is\n$2$-regular in the sense of Allouche and Shallit, i.e., the $\\mathbb{Z}$-module\ngenerated by its $2$-kernel is finitely generated. We apply this theorem to\ndevelop a general approach for studying the $\\ell$-abelian complexity of\n$2$-automatic sequences. In particular, we prove that the period-doubling word\nand the Thue--Morse word have $2$-abelian complexity sequences that are\n$2$-regular. Along the way, we also prove that the $2$-block codings of these\ntwo words have $1$-abelian complexity sequences that are $2$-regular.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2014 15:19:23 GMT"}, {"version": "v2", "created": "Thu, 19 Feb 2015 12:36:39 GMT"}], "update_date": "2015-02-20", "authors_parsed": [["Parreau", "Aline", ""], ["Rigo", "Michel", ""], ["Rowland", "Eric", ""], ["Vandomme", "Elise", ""]]}, {"id": "1405.3576", "submitter": "Marina Maslennikova", "authors": "Marina Maslennikova", "title": "Complexity of checking whether two automata are synchronized by the same\n  language", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A deterministic finite automaton is said to be synchronizing if it has a\nreset word, i.e. a word that brings all states of the automaton to a particular\none. We prove that it is a PSPACE-complete problem to check whether the\nlanguage of reset words for a given automaton coincides with the language of\nreset words for some particular automaton.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2014 17:20:40 GMT"}], "update_date": "2014-05-15", "authors_parsed": [["Maslennikova", "Marina", ""]]}, {"id": "1405.4070", "submitter": "Theodore Pavlic", "authors": "Theodore P. Pavlic and Alyssa M. Adams and Paul C. W. Davies and Sara\n  Imari Walker", "title": "Self-referencing cellular automata: A model of the evolution of\n  information control in biological systems", "comments": "Accepted to ALIFE 2014. 8 pages, 9 figures (20 subfigures), 2 tables", "journal-ref": null, "doi": "10.7551/978-0-262-32621-6-ch083", "report-no": null, "categories": "nlin.CG cs.FL nlin.CD nlin.PS q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Cellular automata have been useful artificial models for exploring how\nrelatively simple rules combined with spatial memory can give rise to complex\nemergent patterns. Moreover, studying the dynamics of how rules emerge under\nartificial selection for function has recently become a powerful tool for\nunderstanding how evolution can innovate within its genetic rule space.\nHowever, conventional cellular automata lack the kind of state feedback that is\nsurely present in natural evolving systems. Each new generation of a population\nleaves an indelible mark on its environment and thus affects the selective\npressures that shape future generations of that population. To model this\nphenomenon, we have augmented traditional cellular automata with\nstate-dependent feedback. Rather than generating automata executions from an\ninitial condition and a static rule, we introduce mappings which generate\niteration rules from the cellular automaton itself. We show that these new\nautomata contain disconnected regions which locally act like conventional\nautomata, thus encapsulating multiple functions into one structure.\nConsequently, we have provided a new model for processes like cell\ndifferentiation. Finally, by studying the size of these regions, we provide\nadditional evidence that the dynamics of self-reference may be critical to\nunderstanding the evolution of natural language. In particular, the rules of\nelementary cellular automata appear to be distributed in the same way as words\nin the corpus of a natural language.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2014 06:34:15 GMT"}], "update_date": "2014-07-11", "authors_parsed": [["Pavlic", "Theodore P.", ""], ["Adams", "Alyssa M.", ""], ["Davies", "Paul C. W.", ""], ["Walker", "Sara Imari", ""]]}, {"id": "1405.4560", "submitter": "James Worrell", "authors": "Michael Benedikt, Rastislav Lenhardt, James Worrell", "title": "Model Checking Markov Chains Against Unambiguous Buchi Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a polynomial-time algorithm for model checking finite Markov chains\nagainst omega-regular specifications given as unambiguous Buchi automata.\n", "versions": [{"version": "v1", "created": "Sun, 18 May 2014 21:55:12 GMT"}, {"version": "v2", "created": "Sat, 26 Mar 2016 23:17:34 GMT"}], "update_date": "2016-03-29", "authors_parsed": [["Benedikt", "Michael", ""], ["Lenhardt", "Rastislav", ""], ["Worrell", "James", ""]]}, {"id": "1405.4806", "submitter": "Tianrong Lin", "authors": "Tianrong Lin", "title": "Undecidability of model-checking branching-time properties of stateless\n  probabilistic pushdown process", "comments": "Author's comments on referee's report added, Interesting", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we settle a problem in probabilistic verification of\ninfinite--state process (specifically, {\\it probabilistic pushdown process}).\nWe show that model checking {\\it stateless probabilistic pushdown process}\n(pBPA) against {\\it probabilistic computational tree logic} (PCTL) is\nundecidable.\n", "versions": [{"version": "v1", "created": "Mon, 19 May 2014 16:58:04 GMT"}, {"version": "v10", "created": "Tue, 2 Apr 2019 14:12:15 GMT"}, {"version": "v11", "created": "Wed, 1 May 2019 05:19:19 GMT"}, {"version": "v12", "created": "Tue, 3 Mar 2020 17:17:35 GMT"}, {"version": "v2", "created": "Mon, 26 May 2014 13:30:09 GMT"}, {"version": "v3", "created": "Tue, 17 Jun 2014 14:07:31 GMT"}, {"version": "v4", "created": "Sun, 17 Aug 2014 12:36:23 GMT"}, {"version": "v5", "created": "Sat, 14 Mar 2015 16:58:52 GMT"}, {"version": "v6", "created": "Tue, 21 Jul 2015 17:59:49 GMT"}, {"version": "v7", "created": "Wed, 22 Jul 2015 12:21:45 GMT"}, {"version": "v8", "created": "Thu, 23 Jul 2015 16:38:38 GMT"}, {"version": "v9", "created": "Wed, 27 Mar 2019 21:49:48 GMT"}], "update_date": "2020-03-04", "authors_parsed": [["Lin", "Tianrong", ""]]}, {"id": "1405.4841", "submitter": "EPTCS", "authors": "Aaron Moss (Cheriton School of Computer Science, University of\n  Waterloo)", "title": "Derivatives of Parsing Expression Grammars", "comments": "In Proceedings AFL 2017, arXiv:1708.06226", "journal-ref": "EPTCS 252, 2017, pp. 180-194", "doi": "10.4204/EPTCS.252.18", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a new derivative parsing algorithm for recognition of\nparsing expression grammars. Derivative parsing is shown to have a polynomial\nworst-case time bound, an improvement on the exponential bound of the recursive\ndescent algorithm. This work also introduces asymptotic analysis based on\ninputs with a constant bound on both grammar nesting depth and number of\nbacktracking choices; derivative and recursive descent parsing are shown to run\nin linear time and constant space on this useful class of inputs, with both the\ntheoretical bounds and the reasonability of the input class validated\nempirically. This common-case constant memory usage of derivative parsing is an\nimprovement on the linear space required by the packrat algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 19 May 2014 19:06:07 GMT"}, {"version": "v2", "created": "Tue, 22 Aug 2017 00:51:39 GMT"}], "update_date": "2017-08-23", "authors_parsed": [["Moss", "Aaron", "", "Cheriton School of Computer Science, University of\n  Waterloo"]]}, {"id": "1405.5272", "submitter": "EPTCS", "authors": "Zolt\\'an \\'Esik (University of Szeged), Zolt\\'an F\\\"ul\\\"op (University\n  of Szeged)", "title": "Proceedings 14th International Conference on Automata and Formal\n  Languages", "comments": null, "journal-ref": "EPTCS 151, 2014", "doi": "10.4204/EPTCS.151", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 14th International Conference Automata and Formal Languages (AFL 2014)\nwas held in Szeged, Hungary, from the 27th to the 29th of May, 2014. The\nconference was organized by the Department of Foundations of Computer Science\nof the University of Szeged. Topics of interest covered the theory and\napplications of automata and formal languages and related areas.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2014 01:15:29 GMT"}], "update_date": "2014-05-22", "authors_parsed": [["Ésik", "Zoltán", "", "University of Szeged"], ["Fülöp", "Zoltán", "", "University\n  of Szeged"]]}, {"id": "1405.5593", "submitter": "EPTCS", "authors": "Arnaud Carayol (LIGM, Universit\\'e Paris-Est, CNRS), Matthew Hague\n  (Department of Computer Science, Royal Holloway University of London)", "title": "Saturation algorithms for model-checking pushdown systems", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 1-24", "doi": "10.4204/EPTCS.151.1", "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a survey of the saturation method for model-checking pushdown\nsystems.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:11:30 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Carayol", "Arnaud", "", "LIGM, Université Paris-Est, CNRS"], ["Hague", "Matthew", "", "Department of Computer Science, Royal Holloway University of London"]]}, {"id": "1405.5594", "submitter": "EPTCS", "authors": "Hermann Gruber (knowledgepark AG), Markus Holzer (Universit\\\"at\n  Giessen)", "title": "From Finite Automata to Regular Expressions and Back--A Summary on\n  Descriptional Complexity", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 25-48", "doi": "10.4204/EPTCS.151.2", "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The equivalence of finite automata and regular expressions dates back to the\nseminal paper of Kleene on events in nerve nets and finite automata from 1956.\nIn the present paper we tour a fragment of the literature and summarize results\non upper and lower bounds on the conversion of finite automata to regular\nexpressions and vice versa. We also briefly recall the known bounds for the\nremoval of spontaneous transitions (epsilon-transitions) on non-epsilon-free\nnondeterministic devices. Moreover, we report on recent results on the average\ncase descriptional complexity bounds for the conversion of regular expressions\nto finite automata and brand new developments on the state elimination\nalgorithm that converts finite automata to regular expressions.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:11:41 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Gruber", "Hermann", "", "knowledgepark AG"], ["Holzer", "Markus", "", "Universität\n  Giessen"]]}, {"id": "1405.5595", "submitter": "EPTCS", "authors": "Ond\\v{r}ej Kl\\'ima (Department of Mathematics and Statistics, Masaryk\n  University, Brno, Czech Republic)", "title": "On Varieties of Automata Enriched with an Algebraic Structure (Extended\n  Abstract)", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 49-54", "doi": "10.4204/EPTCS.151.3", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eilenberg correspondence, based on the concept of syntactic monoids, relates\nvarieties of regular languages with pseudovarieties of finite monoids. Various\nmodifications of this correspondence related more general classes of regular\nlanguages with classes of more complex algebraic objects. Such generalized\nvarieties also have natural counterparts formed by classes of finite automata\nequipped with a certain additional algebraic structure. In this survey, we\noverview several variants of such varieties of enriched automata.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:11:49 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Klíma", "Ondřej", "", "Department of Mathematics and Statistics, Masaryk\n  University, Brno, Czech Republic"]]}, {"id": "1405.5596", "submitter": "EPTCS", "authors": "Christof L\\\"oding", "title": "Decision Problems for Deterministic Pushdown Automata on Infinite Words", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 55-73", "doi": "10.4204/EPTCS.151.4", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The article surveys some decidability results for DPDAs on infinite words\n(omega-DPDA). We summarize some recent results on the decidability of the\nregularity and the equivalence problem for the class of weak omega-DPDAs.\nFurthermore, we present some new results on the parity index problem for\nomega-DPDAs. For the specification of a parity condition, the states of the\nomega-DPDA are assigned priorities (natural numbers), and a run is accepting if\nthe highest priority that appears infinitely often during a run is even. The\nbasic simplification question asks whether one can determine the minimal number\nof priorities that are needed to accept the language of a given omega-DPDA. We\nprovide some decidability results on variations of this question for some\nclasses of omega-DPDAs.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:12:02 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Löding", "Christof", ""]]}, {"id": "1405.5597", "submitter": "EPTCS", "authors": "Sebastian Maneth (University of Edinburgh)", "title": "Equivalence Problems for Tree Transducers: A Brief Survey", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 74-93", "doi": "10.4204/EPTCS.151.5", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The decidability of equivalence for three important classes of tree\ntransducers is discussed. Each class can be obtained as a natural restriction\nof deterministic macro tree transducers (MTTs): (1) no context parameters,\ni.e., top-down tree transducers, (2) linear size increase, i.e., MSO definable\ntree transducers, and (3) monadic input and output ranked alphabets. For the\nfull class of MTTs, decidability of equivalence remains a long-standing open\nproblem.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:12:08 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Maneth", "Sebastian", "", "University of Edinburgh"]]}, {"id": "1405.5598", "submitter": "EPTCS", "authors": "Mikhail Barash, Alexander Okhotin", "title": "Grammars with two-sided contexts", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 94-108", "doi": "10.4204/EPTCS.151.6", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper (M. Barash, A. Okhotin, \"Defining contexts in context-free\ngrammars\", LATA 2012), the authors introduced an extension of the context-free\ngrammars equipped with an operator for referring to the left context of the\nsubstring being defined. This paper proposes a more general model, in which\ncontext specifications may be two-sided, that is, both the left and the right\ncontexts can be specified by the corresponding operators. The paper gives the\ndefinitions and establishes the basic theory of such grammars, leading to a\nnormal form and a parsing algorithm working in time O(n^4), where n is the\nlength of the input string.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:12:21 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Barash", "Mikhail", ""], ["Okhotin", "Alexander", ""]]}, {"id": "1405.5599", "submitter": "EPTCS", "authors": "Martin Berglund, Frank Drewes, Brink van der Merwe", "title": "Analyzing Catastrophic Backtracking Behavior in Practical Regular\n  Expression Matching", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 109-123", "doi": "10.4204/EPTCS.151.7", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a formal perspective on how regular expression matching works in\nJava, a popular representative of the category of regex-directed matching\nengines. In particular, we define an automata model which captures all the\naspects needed to study such matching engines in a formal way. Based on this,\nwe propose two types of static analysis, which take a regular expression and\ntell whether there exists a family of strings which makes Java-style matching\nrun in exponential time.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:12:34 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Berglund", "Martin", ""], ["Drewes", "Frank", ""], ["van der Merwe", "Brink", ""]]}, {"id": "1405.5600", "submitter": "EPTCS", "authors": "Henning Bordihn, Martin Kutrib, Andreas Malcher", "title": "Measuring Communication in Parallel Communicating Finite Automata", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 124-138", "doi": "10.4204/EPTCS.151.8", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Systems of deterministic finite automata communicating by sending their\nstates upon request are investigated, when the amount of communication is\nrestricted. The computational power and decidability properties are studied for\nthe case of returning centralized systems, when the number of necessary\ncommunications during the computations of the system is bounded by a function\ndepending on the length of the input. It is proved that an infinite hierarchy\nof language families exists, depending on the number of messages sent during\ntheir most economical recognitions. Moreover, several properties are shown to\nbe not semi-decidable for the systems under consideration.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:12:42 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Bordihn", "Henning", ""], ["Kutrib", "Martin", ""], ["Malcher", "Andreas", ""]]}, {"id": "1405.5601", "submitter": "EPTCS", "authors": "Cezar C\\^ampeanu (The University of Prince Edward Island)", "title": "Simplifying Nondeterministic Finite Cover Automata", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 162-173", "doi": "10.4204/EPTCS.151.11", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of Deterministic Finite Cover Automata (DFCA) was introduced at\nWIA '98, as a more compact representation than Deterministic Finite Automata\n(DFA) for finite languages. In some cases representing a finite language,\nNondeterministic Finite Automata (NFA) may significantly reduce the number of\nstates used. The combined power of the succinctness of the representation of\nfinite languages using both cover languages and non-determinism has been\nsuggested, but never systematically studied. In the present paper, for\nnondeterministic finite cover automata (NFCA) and l-nondeterministic finite\ncover automaton (l-NFCA), we show that minimization can be as hard as\nminimizing NFAs for regular languages, even in the case of NFCAs using unary\nalphabets. Moreover, we show how we can adapt the methods used to reduce, or\nminimize the size of NFAs/DFCAs/l-DFCAs, for simplifying NFCAs/l-NFCAs.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:13:07 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Câmpeanu", "Cezar", "", "The University of Prince Edward Island"]]}, {"id": "1405.5602", "submitter": "EPTCS", "authors": "Vincent Carnino (LIGM, Universit\\'e Paris-Est), Sylvain Lombardy\n  (LaBRI, Insitut Polytechnique de Bordeaux)", "title": "On Determinism and Unambiguity of Weighted Two-way Automata", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 188-200", "doi": "10.4204/EPTCS.151.13", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we first study the conversion of weighted two-way automata to\none-way automata. We show that this conversion preserves the unambiguity but\ndoes not preserve the determinism. Yet, we prove that the conversion of an\nunambiguous weighted one-way automaton into a two-way automaton leads to a\ndeterministic two-way automaton. As a consequence, we prove that unambiguous\nweighted two-way automata are equivalent to deterministic weighted two-way\nautomata in commutative semirings.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:13:29 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Carnino", "Vincent", "", "LIGM, Université Paris-Est"], ["Lombardy", "Sylvain", "", "LaBRI, Insitut Polytechnique de Bordeaux"]]}, {"id": "1405.5603", "submitter": "EPTCS", "authors": "Krist\\'ina \\v{C}evorov\\'a, Galina Jir\\'askov\\'a, Peter\n  Mlyn\\'ar\\v{c}ik, Mat\\'u\\v{s} Palmovsk\\'y, Juraj \\v{S}ebej", "title": "Operations on Automata with All States Final", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 201-215", "doi": "10.4204/EPTCS.151.14", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the complexity of basic regular operations on languages represented\nby incomplete deterministic or nondeterministic automata, in which all states\nare final. Such languages are known to be prefix-closed. We get tight bounds on\nboth incomplete and nondeterministic state complexity of complement,\nintersection, union, concatenation, star, and reversal on prefix-closed\nlanguages.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:13:37 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Čevorová", "Kristína", ""], ["Jirásková", "Galina", ""], ["Mlynárčik", "Peter", ""], ["Palmovský", "Matúš", ""], ["Šebej", "Juraj", ""]]}, {"id": "1405.5604", "submitter": "EPTCS", "authors": "Stefano Crespi Reghizzi (DEIB, Politecnico di Milano and CNR-IEIIT),\n  Pierluigi San Pietro (DEIB, Politecnico di Milano and CNR-IEIIT)", "title": "Commutative Languages and their Composition by Consensual Methods", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 216-230", "doi": "10.4204/EPTCS.151.15", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Commutative languages with the semilinear property (SLIP) can be naturally\nrecognized by real-time NLOG-SPACE multi-counter machines. We show that unions\nand concatenations of such languages can be similarly recognized, relying on --\nand further developing, our recent results on the family of consensually\nregular (CREG) languages. A CREG language is defined by a regular language on\nthe alphabet that includes the terminal alphabet and its marked copy. New\nconditions, for ensuring that the union or concatenation of CREG languages is\nclosed, are presented and applied to the commutative SLIP languages. The paper\ncontributes to the knowledge of the CREG family, and introduces novel\ntechniques for language composition, based on arithmetic congruences that act\nas language signatures. Open problems are listed.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:13:46 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Reghizzi", "Stefano Crespi", "", "DEIB, Politecnico di Milano and CNR-IEIIT"], ["Pietro", "Pierluigi San", "", "DEIB, Politecnico di Milano and CNR-IEIIT"]]}, {"id": "1405.5605", "submitter": "EPTCS", "authors": "Chen Fei Du (University of Waterloo), Jeffrey Shallit (University of\n  Waterloo)", "title": "Similarity density of the Thue-Morse word with overlap-free infinite\n  binary words", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 231-245", "doi": "10.4204/EPTCS.151.16", "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a measure of similarity for infinite words that generalizes the\nnotion of asymptotic or natural density of subsets of natural numbers from\nnumber theory. We show that every overlap-free infinite binary word, other than\nthe Thue-Morse word t and its complement t bar, has this measure of similarity\nwith t between 1/4 and 3/4. This is a partial generalization of a classical\n1927 result of Mahler.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:13:56 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Du", "Chen Fei", "", "University of Waterloo"], ["Shallit", "Jeffrey", "", "University of\n  Waterloo"]]}, {"id": "1405.5606", "submitter": "EPTCS", "authors": "Henning Fernau (Universit\\\"at Trier, Germany), Rudolf Freund (TU Wien,\n  Austria), Markus Holzer (Universit\\\"at Gie{\\ss}en, Germany)", "title": "Cooperating Distributed Grammar Systems of Finite Index Working in\n  Hybrid Modes", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 246-260", "doi": "10.4204/EPTCS.151.17", "report-no": null, "categories": "cs.FL cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study cooperating distributed grammar systems working in hybrid modes in\nconnection with the finite index restriction in two different ways: firstly, we\ninvestigate cooperating distributed grammar systems working in hybrid modes\nwhich characterize programmed grammars with the finite index restriction;\nlooking at the number of components of such systems, we obtain surprisingly\nrich lattice structures for the inclusion relations between the corresponding\nlanguage families. Secondly, we impose the finite index restriction on\ncooperating distributed grammar systems working in hybrid modes themselves,\nwhich leads us to new characterizations of programmed grammars of finite index.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:14:04 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Fernau", "Henning", "", "Universität Trier, Germany"], ["Freund", "Rudolf", "", "TU Wien,\n  Austria"], ["Holzer", "Markus", "", "Universität Gießen, Germany"]]}, {"id": "1405.5607", "submitter": "EPTCS", "authors": "L\\'aszl\\'o Heged\\\"us (University of Debrecen), Benedek Nagy\n  (University of Debrecen)", "title": "Representations of Circular Words", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 261-270", "doi": "10.4204/EPTCS.151.18", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we give two different ways of representations of circular\nwords. Representations with tuples are intended as a compact notation, while\nrepresentations with trees give a way to easily process all conjugates of a\nword. The latter form can also be used as a graphical representation of\nperiodic properties of finite (in some cases, infinite) words. We also define\niterative representations which can be seen as an encoding utilizing the\nflexible properties of circular words. Every word over the two letter alphabet\ncan be constructed starting from ab by applying the fractional power and the\ncyclic shift operators one after the other, iteratively.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:14:14 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Hegedüs", "László", "", "University of Debrecen"], ["Nagy", "Benedek", "", "University of Debrecen"]]}, {"id": "1405.5608", "submitter": "EPTCS", "authors": "Markus Holzer, Sebastian Jakobi", "title": "More Structural Characterizations of Some Subregular Language Families\n  by Biautomata", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 271-285", "doi": "10.4204/EPTCS.151.19", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study structural restrictions on biautomata such as, e.g., acyclicity,\npermutation-freeness, strongly permutation-freeness, and orderability, to\nmention a few. We compare the obtained language families with those induced by\ndeterministic finite automata with the same property. In some cases, it is\nshown that there is no difference in characterization between deterministic\nfinite automata and biautomata as for the permutation-freeness, but there are\nalso other cases, where it makes a big difference whether one considers\ndeterministic finite automata or biautomata. This is, for instance, the case\nwhen comparing strongly permutation-freeness, which results in the family of\ndefinite language for deterministic finite automata, while biautomata induce\nthe family of finite and co-finite languages. The obtained results nicely fall\ninto the known landscape on classical language families.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:14:24 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Holzer", "Markus", ""], ["Jakobi", "Sebastian", ""]]}, {"id": "1405.5609", "submitter": "EPTCS", "authors": "Milka Hutagalung (University of Kassel), Martin Lange (University of\n  Kassel), Etienne Lozes (University of Kassel)", "title": "Buffered Simulation Games for B\\\"uchi Automata", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 286-300", "doi": "10.4204/EPTCS.151.20", "report-no": null, "categories": "cs.FL cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simulation relations are an important tool in automata theory because they\nprovide efficiently computable approximations to language inclusion. In recent\nyears, extensions of ordinary simulations have been studied, for instance\nmulti-pebble and multi-letter simulations which yield better approximations and\nare still polynomial-time computable.\n  In this paper we study the limitations of approximating language inclusion in\nthis way: we introduce a natural extension of multi-letter simulations called\nbuffered simulations. They are based on a simulation game in which the two\nplayers share a FIFO buffer of unbounded size. We consider two variants of\nthese buffered games called continuous and look-ahead simulation which differ\nin how elements can be removed from the FIFO buffer. We show that look-ahead\nsimulation, the simpler one, is already PSPACE-hard, i.e. computationally as\nhard as language inclusion itself. Continuous simulation is even EXPTIME-hard.\nWe also provide matching upper bounds for solving these games with infinite\nstate spaces.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:14:37 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Hutagalung", "Milka", "", "University of Kassel"], ["Lange", "Martin", "", "University of\n  Kassel"], ["Lozes", "Etienne", "", "University of Kassel"]]}, {"id": "1405.5610", "submitter": "EPTCS", "authors": "Andreas Maletti (Universit\\\"at Leipzig), Daniel Quernheim\n  (Universit\\\"at Stuttgart)", "title": "Hyper-Minimization for Deterministic Weighted Tree Automata", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 314-326", "doi": "10.4204/EPTCS.151.22", "report-no": null, "categories": "cs.FL cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hyper-minimization is a state reduction technique that allows a finite change\nin the semantics. The theory for hyper-minimization of deterministic weighted\ntree automata is provided. The presence of weights slightly complicates the\nsituation in comparison to the unweighted case. In addition, the first\nhyper-minimization algorithm for deterministic weighted tree automata, weighted\nover commutative semifields, is provided together with some implementation\nremarks that enable an efficient implementation. In fact, the same run-time O(m\nlog n) as in the unweighted case is obtained, where m is the size of the\ndeterministic weighted tree automaton and n is its number of states.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:14:51 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Maletti", "Andreas", "", "Universität Leipzig"], ["Quernheim", "Daniel", "", "Universität Stuttgart"]]}, {"id": "1405.5611", "submitter": "EPTCS", "authors": "Maris Valdats", "title": "Boolean Circuit Complexity of Regular Languages", "comments": "In Proceedings AFL 2014, arXiv:1405.5272", "journal-ref": "EPTCS 151, 2014, pp. 342-354", "doi": "10.4204/EPTCS.151.24", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we define a new descriptional complexity measure for\nDeterministic Finite Automata, BC-complexity, as an alternative to the state\ncomplexity. We prove that for two DFAs with the same number of states\nBC-complexity can differ exponentially. In some cases minimization of DFA can\nlead to an exponential increase in BC-complexity, on the other hand\nBC-complexity of DFAs with a large state space which are obtained by some\nstandard constructions (determinization of NFA, language operations), is\nreasonably small. But our main result is the analogue of the \"Shannon effect\"\nfor finite automata: almost all DFAs with a fixed number of states have\nBC-complexity that is close to the maximum.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2014 02:15:10 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Valdats", "Maris", ""]]}, {"id": "1405.6646", "submitter": "S\\'ergio Medeiros", "authors": "Andr\\'e Murbach Maidl, S\\'ergio Medeiros, Fabio Mascarenhas, Roberto\n  Ierusalimschy", "title": "Error Reporting in Parsing Expression Grammars", "comments": "Preprint (plus appendix) submitted to Science of Computer Programming", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Parsing Expression Grammars (PEGs) describe top-down parsers. Unfortunately,\nthe error-reporting techniques used in conventional top-down parsers do not\ndirectly apply to parsers based on Parsing Expression Grammars (PEGs), so they\nhave to be somehow simulated. While the PEG formalism has no account of\nsemantic actions, actual PEG implementations add them, and we show how to\nsimulate an error-reporting heuristic through these semantic actions.\n  We also propose a complementary error reporting strategy that may lead to\nbetter error messages: labeled failures. This approach is inspired by exception\nhandling of programming languages, and lets a PEG define different kinds of\nfailure, with each ordered choice operator specifying which kinds it catches.\nLabeled failures give a way to annotate grammars for better error reporting, to\nexpress some of the error reporting strategies used by deterministic parser\ncombinators, and to encode predictive top-down parsing in a PEG.\n", "versions": [{"version": "v1", "created": "Mon, 26 May 2014 17:14:52 GMT"}, {"version": "v2", "created": "Tue, 23 Feb 2016 13:24:53 GMT"}, {"version": "v3", "created": "Wed, 13 Jul 2016 15:33:47 GMT"}], "update_date": "2016-07-14", "authors_parsed": [["Maidl", "André Murbach", ""], ["Medeiros", "Sérgio", ""], ["Mascarenhas", "Fabio", ""], ["Ierusalimschy", "Roberto", ""]]}, {"id": "1405.6671", "submitter": "Abuzer Yakaryilmaz", "authors": "Viliam Geffert and Abuzer Yakaryilmaz", "title": "Classical automata on promise problems", "comments": "21 pages, significantly improved with a correction (the single\n  sentence statement given just before Corollary 4 in the previous version and\n  (in the conference version) is not correct). A preliminary version appeared\n  in DCFS2014 [vol. 8614 of LNCS, pp. 126--137, Springer-Verlag, 2014]", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Promise problems were mainly studied in quantum automata theory. Here we\nfocus on state complexity of classical automata for promise problems. First, it\nwas known that there is a family of unary promise problems solvable by quantum\nautomata by using a single qubit, but the number of states required by\ncorresponding one-way deterministic automata cannot be bounded by a constant.\nFor this family, we show that even two-way nondeterminism does not help to save\na single state. By comparing this with the corresponding state complexity of\nalternating machines, we then get a tight exponential gap between two-way\nnondeterministic and one-way alternating automata solving unary promise\nproblems. Second, despite of the existing quadratic gap between Las Vegas\nrealtime probabilistic automata and one-way deterministic automata for language\nrecognition, we show that, by turning to promise problems, the tight gap\nbecomes exponential. Last, we show that the situation is different for one-way\nprobabilistic automata with two-sided bounded-error. We present a family of\nunary promise problems that is very easy for these machines; solvable with only\ntwo states, but the number of states in two-way alternating or any simpler\nautomata is not limited by a constant. Moreover, we show that one-way\nbounded-error probabilistic automata can solve promise problems not solvable at\nall by any other classical model.\n", "versions": [{"version": "v1", "created": "Mon, 26 May 2014 18:34:55 GMT"}, {"version": "v2", "created": "Thu, 16 Oct 2014 16:57:05 GMT"}], "update_date": "2014-10-17", "authors_parsed": [["Geffert", "Viliam", ""], ["Yakaryilmaz", "Abuzer", ""]]}, {"id": "1405.7923", "submitter": "Petr Jancar", "authors": "Petr Jancar", "title": "Bisimulation Equivalence of First-Order Grammars", "comments": "This paper extends the version accepted to ICALP'14", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A decidability proof for bisimulation equivalence of first-order grammars\n(finite sets of labelled rules for rewriting roots of first-order terms) is\npresented. The equivalence generalizes the DPDA (deterministic pushdown\nautomata) equivalence, and the result corresponds to the result achieved by\nSenizergues (1998, 2005) in the framework of equational graphs, or of PDA with\nrestricted epsilon-steps. The framework of classical first-order terms seems\nparticularly useful for providing a proof that should be understandable for a\nwider audience. We also discuss an extension to branching bisimilarity,\nannounced by Fu and Yin (2014).\n", "versions": [{"version": "v1", "created": "Fri, 30 May 2014 17:32:24 GMT"}], "update_date": "2014-06-02", "authors_parsed": [["Jancar", "Petr", ""]]}]