[{"id": "1310.0522", "submitter": "Liane Gabora", "authors": "Liane Gabora", "title": "EVOC: A Computer Model of the Evolution of Culture", "comments": "6 pages. arXiv admin note: substantial text overlap with\n  arXiv:1005.1516, arXiv:0911.2390, arXiv:0811.2551; replaced version corrects\n  error in reference at top of first page", "journal-ref": "Gabora, L. (2008). EVOC: A computer model of cultural evolution.\n  In V. Sloutsky, B. Love & K. McRae (Eds.), 30th Annual Meeting of the\n  Cognitive Science Society. Washington DC, July 23-26, North Salt Lake, UT:\n  Sheridan Publishing", "doi": null, "report-no": null, "categories": "cs.MA cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  EVOC is a computer model of the EVOlution of Culture. It consists of neural\nnetwork based agents that invent ideas for actions, and imitate neighbors'\nactions. EVOC replicates using a different fitness function the results\nobtained with an earlier model (MAV), including (1) an increase in mean fitness\nof actions, and (2) an increase and then decrease in the diversity of actions.\nDiversity of actions is positively correlated with number of needs, population\nsize and density, and with the erosion of borders between populations. Slowly\neroding borders maximize diversity, fostering specialization followed by\nsharing of fit actions. Square (as opposed to toroidal) worlds also exhibit\nhigher diversity. Introducing a leader that broadcasts its actions throughout\nthe population increases the fitness of actions but reduces diversity; these\neffects diminish the more leaders there are. Low density populations have less\nfit ideas but broadcasting diminishes this effect.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 23:36:47 GMT"}, {"version": "v2", "created": "Wed, 3 Sep 2014 11:17:43 GMT"}], "update_date": "2014-09-04", "authors_parsed": [["Gabora", "Liane", ""]]}, {"id": "1310.1227", "submitter": "Om Pr", "authors": "Anagha P. Khedkar, Shaila Subbaraman", "title": "The Novel Approach of Adaptive Twin Probability for Genetic Algorithm", "comments": "7 pages, International Journal of Advanced Studies in Computer\n  Science and Engineering (IJASCSE), Volume 2, Special Issue 2, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of GA is measured and analyzed in terms of its performance\nparameters against variations in its genetic operators and associated\nparameters. Since last four decades huge numbers of researchers have been\nworking on the performance of GA and its enhancement. This earlier research\nwork on analyzing the performance of GA enforces the need to further\ninvestigate the exploration and exploitation characteristics and observe its\nimpact on the behavior and overall performance of GA. This paper introduces the\nnovel approach of adaptive twin probability associated with the advanced twin\noperator that enhances the performance of GA. The design of the advanced twin\noperator is extrapolated from the twin offspring birth due to single ovulation\nin natural genetic systems as mentioned in the earlier works. The twin\nprobability of this operator is adaptively varied based on the fitness of best\nindividual thereby relieving the GA user from statically defining its value.\nThis novel approach of adaptive twin probability is experimented and tested on\nthe standard benchmark optimization test functions. The experimental results\nshow the increased accuracy in terms of the best individual and reduced\nconvergence time.\n", "versions": [{"version": "v1", "created": "Fri, 4 Oct 2013 11:31:40 GMT"}], "update_date": "2013-10-07", "authors_parsed": [["Khedkar", "Anagha P.", ""], ["Subbaraman", "Shaila", ""]]}, {"id": "1310.1250", "submitter": "Rui Vilela-Mendes", "authors": "Rui Ligeiro and R. Vilela Mendes", "title": "Learning ambiguous functions by neural networks", "comments": "13 pages, 9 figures", "journal-ref": "Soft Computing 22 (2018) 2695 - 2703", "doi": "10.1007/s00500-017-2525-7", "report-no": null, "categories": "cs.NE cs.LG physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is not, in general, possible to have access to all variables that\ndetermine the behavior of a system. Having identified a number of variables\nwhose values can be accessed, there may still be hidden variables which\ninfluence the dynamics of the system. The result is model ambiguity in the\nsense that, for the same (or very similar) input values, different objective\noutputs should have been obtained. In addition, the degree of ambiguity may\nvary widely across the whole range of input values. Thus, to evaluate the\naccuracy of a model it is of utmost importance to create a method to obtain the\ndegree of reliability of each output result. In this paper we present such a\nscheme composed of two coupled artificial neural networks: the first one being\nresponsible for outputting the predicted value, whereas the other evaluates the\nreliability of the output, which is learned from the error values of the first\none. As an illustration, the scheme is applied to a model for tracking slopes\nin a straw chamber and to a credit scoring model.\n", "versions": [{"version": "v1", "created": "Thu, 15 Aug 2013 10:16:49 GMT"}], "update_date": "2018-04-30", "authors_parsed": [["Ligeiro", "Rui", ""], ["Mendes", "R. Vilela", ""]]}, {"id": "1310.2063", "submitter": "J.H. van Hateren", "authors": "J.H. van Hateren", "title": "Active causation and the origin of meaning", "comments": "revised and extended", "journal-ref": "Biological Cybernetics 109, 33-46 (2015)", "doi": "10.1007/s00422-014-0622-6", "report-no": null, "categories": "q-bio.PE cs.NE nlin.AO q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Purpose and meaning are necessary concepts for understanding mind and\nculture, but appear to be absent from the physical world and are not part of\nthe explanatory framework of the natural sciences. Understanding how meaning\n(in the broad sense of the term) could arise from a physical world has proven\nto be a tough problem. The basic scheme of Darwinian evolution produces\nadaptations that only represent apparent (\"as if\") goals and meaning. Here I\nuse evolutionary models to show that a slight, evolvable extension of the basic\nscheme is sufficient to produce genuine goals. The extension, targeted\nmodulation of mutation rate, is known to be generally present in biological\ncells, and gives rise to two phenomena that are absent from the non-living\nworld: intrinsic meaning and the ability to initiate goal-directed chains of\ncausation (active causation). The extended scheme accomplishes this by\nutilizing randomness modulated by a feedback loop that is itself regulated by\nevolutionary pressure. The mechanism can be extended to behavioural variability\nas well, and thus shows how freedom of behaviour is possible. A further\nextension to communication suggests that the active exchange of intrinsic\nmeaning between organisms may be the origin of consciousness, which in\ncombination with active causation can provide a physical basis for the\nphenomenon of free will.\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2013 09:49:39 GMT"}, {"version": "v2", "created": "Tue, 22 Oct 2013 11:37:41 GMT"}, {"version": "v3", "created": "Tue, 18 Feb 2014 15:10:27 GMT"}, {"version": "v4", "created": "Sun, 25 May 2014 08:39:42 GMT"}], "update_date": "2015-02-04", "authors_parsed": [["van Hateren", "J. H.", ""]]}, {"id": "1310.2350", "submitter": "Cm Pintea", "authors": "Camelia-M. Pintea, Petrica C. Pop, Camelia Chira", "title": "The Generalized Traveling Salesman Problem solved with Ant Algorithms", "comments": "indexed in Scopus, ORCID", "journal-ref": "Complex Adaptive Systems Modeling 5(1), 8 pages, 2017", "doi": "10.1186/s40294-017-0048-9", "report-no": null, "categories": "cs.AI cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A well known N P-hard problem called the Generalized Traveling Salesman\nProblem (GTSP) is considered. In GTSP the nodes of a complete undirected graph\nare partitioned into clusters. The objective is to find a minimum cost tour\npassing through exactly one node from each cluster. An exact exponential time\nalgorithm and an effective meta-heuristic algorithm for the problem are\npresented. The meta-heuristic proposed is a modified Ant Colony System (ACS)\nalgorithm called Reinforcing Ant Colony System (RACS) which introduces new\ncorrection rules in the ACS algorithm. Computational results are reported for\nmany standard test problems. The proposed algorithm is competitive with the\nother already proposed heuristics for the GTSP in both solution quality and\ncomputational time.\n", "versions": [{"version": "v1", "created": "Wed, 9 Oct 2013 05:17:16 GMT"}], "update_date": "2017-08-15", "authors_parsed": [["Pintea", "Camelia-M.", ""], ["Pop", "Petrica C.", ""], ["Chira", "Camelia", ""]]}, {"id": "1310.3805", "submitter": "Chiranjib Sur", "authors": "Chiranjib Sur, Anupam Shukla", "title": "Green Heron Swarm Optimization Algorithm - State-of-the-Art of a New\n  Nature Inspired Discrete Meta-Heuristics", "comments": "20 pages, Pre-print copy, submitted to a peer reviewed journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many real world problems are NP-Hard problems are a very large part of them\ncan be represented as graph based problems. This makes graph theory a very\nimportant and prevalent field of study. In this work a new bio-inspired\nmeta-heuristics called Green Heron Swarm Optimization (GHOSA) Algorithm is\nbeing introduced which is inspired by the fishing skills of the bird. The\nalgorithm basically suited for graph based problems like combinatorial\noptimization etc. However introduction of an adaptive mathematical variation\noperator called Location Based Neighbour Influenced Variation (LBNIV) makes it\nsuitable for high dimensional continuous domain problems. The new algorithm is\nbeing operated on the traditional benchmark equations and the results are\ncompared with Genetic Algorithm and Particle Swarm Optimization. The algorithm\nis also operated on Travelling Salesman Problem, Quadratic Assignment Problem,\nKnapsack Problem dataset. The procedure to operate the algorithm on the\nResource Constraint Shortest Path and road network optimization is also\ndiscussed. The results clearly demarcates the GHOSA algorithm as an efficient\nalgorithm specially considering that the number of algorithms for the discrete\noptimization is very low and robust and more explorative algorithm is required\nin this age of social networking and mostly graph based problem scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 19:42:26 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Sur", "Chiranjib", ""], ["Shukla", "Anupam", ""]]}, {"id": "1310.5568", "submitter": "Larry Bull", "authors": "Larry Bull", "title": "Towards Application of the RBNK Model", "comments": "arXiv admin note: substantial text overlap with arXiv:1306.4793,\n  arXiv:1303.7220", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The computational modeling of genetic regulatory networks is now common\nplace, either by fitting a system to experimental data or by exploring the\nbehaviour of abstract systems with the aim of identifying underlying\nprinciples. This paper presents an approach to the latter, considering the\nresponse to environmental changes of a well-known model placed upon tunable\nfitness landscapes. The effects on genome size and gene connectivity are\nexplored.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 14:31:20 GMT"}], "update_date": "2013-10-22", "authors_parsed": [["Bull", "Larry", ""]]}, {"id": "1310.6012", "submitter": "Christoph Adami", "authors": "Randal S. Olson, David B. Knoester, and Christoph Adami", "title": "Evolution of swarming behavior is shaped by how predators attack", "comments": "25 pages, 11 figures, 5 tables, including 2 Supplementary Figures.\n  Version to appear in \"Artificial Life\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Animal grouping behaviors have been widely studied due to their implications\nfor understanding social intelligence, collective cognition, and potential\napplications in engineering, artificial intelligence, and robotics. An\nimportant biological aspect of these studies is discerning which selection\npressures favor the evolution of grouping behavior. In the past decade,\nresearchers have begun using evolutionary computation to study the evolutionary\neffects of these selection pressures in predator-prey models. The selfish herd\nhypothesis states that concentrated groups arise because prey selfishly attempt\nto place their conspecifics between themselves and the predator, thus causing\nan endless cycle of movement toward the center of the group. Using an\nevolutionary model of a predator-prey system, we show that how predators attack\nis critical to the evolution of the selfish herd. Following this discovery, we\nshow that density-dependent predation provides an abstraction of Hamilton's\noriginal formulation of ``domains of danger.'' Finally, we verify that\ndensity-dependent predation provides a sufficient selective advantage for prey\nto evolve the selfish herd in response to predation by coevolving predators.\nThus, our work corroborates Hamilton's selfish herd hypothesis in a digital\nevolutionary model, refines the assumptions of the selfish herd hypothesis, and\ngeneralizes the domain of danger concept to density-dependent predation.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 19:10:38 GMT"}, {"version": "v2", "created": "Tue, 24 Nov 2015 20:05:54 GMT"}], "update_date": "2015-11-25", "authors_parsed": [["Olson", "Randal S.", ""], ["Knoester", "David B.", ""], ["Adami", "Christoph", ""]]}, {"id": "1310.6338", "submitter": "Randal Olson", "authors": "Arend Hintze, Randal S. Olson, Christoph Adami, and Ralph Hertwig", "title": "Risk aversion as an evolutionary adaptation", "comments": "18 pages, 7 figures", "journal-ref": "Scientific Reports 5 (2015) 8242", "doi": "10.1038/srep08242", "report-no": null, "categories": "q-bio.PE cs.GT cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risk aversion is a common behavior universal to humans and animals alike.\nEconomists have traditionally defined risk preferences by the curvature of the\nutility function. Psychologists and behavioral economists also make use of\nconcepts such as loss aversion and probability weighting to model risk\naversion. Neurophysiological evidence suggests that loss aversion has its\norigins in relatively ancient neural circuitries (e.g., ventral striatum).\nCould there thus be an evolutionary origin to risk avoidance? We study this\nquestion by evolving strategies that adapt to play the equivalent mean payoff\ngamble. We hypothesize that risk aversion in the equivalent mean payoff gamble\nis beneficial as an adaptation to living in small groups, and find that a\npreference for risk averse strategies only evolves in small populations of less\nthan 1,000 individuals, while agents exhibit no such strategy preference in\nlarger populations. Further, we discover that risk aversion can also evolve in\nlarger populations, but only when the population is segmented into small groups\nof around 150 individuals. Finally, we observe that risk aversion only evolves\nwhen the gamble is a rare event that has a large impact on the individual's\nfitness. These findings align with earlier reports that humans lived in small\ngroups for a large portion of their evolutionary history. As such, we suggest\nthat rare, high-risk, high-payoff events such as mating and mate competition\ncould have driven the evolution of risk averse behavior in humans living in\nsmall groups.\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 19:27:10 GMT"}], "update_date": "2015-11-18", "authors_parsed": [["Hintze", "Arend", ""], ["Olson", "Randal S.", ""], ["Adami", "Christoph", ""], ["Hertwig", "Ralph", ""]]}, {"id": "1310.7115", "submitter": "Mohammad AlHawarat Dr.", "authors": "Mohammad Alhawarat, Waleed Nazih and Mohammad Eldesouki", "title": "Studying a Chaotic Spiking Neural Model", "comments": "Journal, 13 pages", "journal-ref": "International Journal of Artificial Intelligence & Applications\n  (IJAIA), Vol. 4, No. 5, September 2013", "doi": "10.5121/ijaia.2013.4508", "report-no": null, "categories": "cs.AI cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamics of a chaotic spiking neuron model are being studied mathematically\nand experimentally. The Nonlinear Dynamic State neuron (NDS) is analysed to\nfurther understand the model and improve it. Chaos has many interesting\nproperties such as sensitivity to initial conditions, space filling, control\nand synchronization. As suggested by biologists, these properties may be\nexploited and play vital role in carrying out computational tasks in human\nbrain. The NDS model has some limitations; in thus paper the model is\ninvestigated to overcome some of these limitations in order to enhance the\nmodel. Therefore, the models parameters are tuned and the resulted dynamics are\nstudied. Also, the discretization method of the model is considered. Moreover,\na mathematical analysis is carried out to reveal the underlying dynamics of the\nmodel after tuning of its parameters. The results of the aforementioned methods\nrevealed some facts regarding the NDS attractor and suggest the stabilization\nof a large number of unstable periodic orbits (UPOs) which might correspond to\nmemories in phase space.\n", "versions": [{"version": "v1", "created": "Sat, 26 Oct 2013 14:21:10 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Alhawarat", "Mohammad", ""], ["Nazih", "Waleed", ""], ["Eldesouki", "Mohammad", ""]]}, {"id": "1310.7961", "submitter": "Seyyed Reza Khaze", "authors": "Seyyed Reza Khaze, Isa maleki, Sohrab Hojjatkhah and Ali Bagherinia", "title": "Evaluation the efficiency of artificial bee colony and the firefly\n  algorithm in solving the continuous optimization problem", "comments": null, "journal-ref": "International Journal on Computational Sciences & Applications\n  (IJCSA) Vol.3, No.4, August 2013", "doi": "10.5121/ijcsa.2013.3403", "report-no": null, "categories": "cs.NE cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Now the Meta-Heuristic algorithms have been used vastly in solving the\nproblem of continuous optimization. In this paper the Artificial Bee Colony\n(ABC) algorithm and the Firefly Algorithm (FA) are valuated. And for presenting\nthe efficiency of the algorithms and also for more analysis of them, the\ncontinuous optimization problems which are of the type of the problems of vast\nlimit of answer and the close optimized points are tested. So, in this paper\nthe efficiency of the ABC algorithm and FA are presented for solving the\ncontinuous optimization problems and also the said algorithms are studied from\nthe accuracy in reaching the optimized solution and the resulting time and the\nreliability of the optimized answer points of view.\n", "versions": [{"version": "v1", "created": "Mon, 16 Sep 2013 09:26:21 GMT"}], "update_date": "2013-10-31", "authors_parsed": [["Khaze", "Seyyed Reza", ""], ["maleki", "Isa", ""], ["Hojjatkhah", "Sohrab", ""], ["Bagherinia", "Ali", ""]]}]