[{"id": "1509.00070", "submitter": "Brian Ji", "authors": "B. L. Ji, H. Li, Q. Ye, S. Gausepohl, S. Deora, D. Veksler, S.\n  Vivekanand, H. Chong, H. Stamper, T. Burroughs, C. Johnson, M. Smalley, S.\n  Bennett, V. Kaushik, J. Piccirillo, M. Rodgers, M. Passaro, M. Liehr", "title": "In-Line-Test of Variability and Bit-Error-Rate of HfOx-Based Resistive\n  Memory", "comments": "4 pages. Memory Workshop (IMW), 2015 IEEE International", "journal-ref": "2015 IEEE International Memory Workshop(IMW), 17-20 May 2015 URL:\n  http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7150290&isnumber=7150256", "doi": "10.1109/IMW.2015.7150290", "report-no": null, "categories": "cs.ET cond-mat.mtrl-sci physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatial and temporal variability of HfOx-based resistive random access memory\n(RRAM) are investigated for manufacturing and product designs. Manufacturing\nvariability is characterized at different levels including lots, wafers, and\nchips. Bit-error-rate (BER) is proposed as a holistic parameter for the write\ncycle resistance statistics. Using the electrical in-line-test cycle data, a\nmethod is developed to derive BERs as functions of the design margin, to\nprovide guidance for technology evaluation and product design. The proposed BER\ncalculation can also be used in the off-line bench test and build-in-self-test\n(BIST) for adaptive error correction and for the other types of random access\nmemories.\n", "versions": [{"version": "v1", "created": "Mon, 31 Aug 2015 21:05:34 GMT"}], "update_date": "2015-09-02", "authors_parsed": [["Ji", "B. L.", ""], ["Li", "H.", ""], ["Ye", "Q.", ""], ["Gausepohl", "S.", ""], ["Deora", "S.", ""], ["Veksler", "D.", ""], ["Vivekanand", "S.", ""], ["Chong", "H.", ""], ["Stamper", "H.", ""], ["Burroughs", "T.", ""], ["Johnson", "C.", ""], ["Smalley", "M.", ""], ["Bennett", "S.", ""], ["Kaushik", "V.", ""], ["Piccirillo", "J.", ""], ["Rodgers", "M.", ""], ["Passaro", "M.", ""], ["Liehr", "M.", ""]]}, {"id": "1509.00408", "submitter": "Adam Bookatz", "authors": "Adam D. Bookatz, Martin Roetteler, Pawel Wocjan", "title": "Improved bounded-strength decoupling schemes for local Hamiltonians", "comments": "18 pages; added explanatory examples (with figures)", "journal-ref": "IEEE Trans. Inf. Theory, 62(5): 2881-2894, 2016", "doi": "10.1109/TIT.2016.2535183", "report-no": "MIT-CTP /4705", "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the task of switching off the Hamiltonian of a system by removing\nall internal and system-environment couplings. We propose dynamical decoupling\nschemes, that use only bounded-strength controls, for quantum many-body systems\nwith local system Hamiltonians and local environmental couplings. To do so, we\nintroduce the combinatorial concept of balanced-cycle orthogonal arrays (BOAs)\nand show how to construct them from classical error-correcting codes. The\nderived decoupling schemes may be useful as a primitive for more complex\nschemes, e.g., for Hamiltonian simulation. For the case of $n$ qubits and a\n$2$-local Hamiltonian, the length of the resulting decoupling scheme scales as\n$O(n \\log n)$, improving over the previously best-known schemes that scaled\nquadratically with $n$. More generally, using balanced-cycle orthogonal arrays\nconstructed from families of BCH codes, we show that bounded-strength\ndecoupling for any $\\ell$-local Hamiltonian, where $\\ell \\geq 2$, can be\nachieved using decoupling schemes of length at most $O(n^{\\ell-1} \\log n)$.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2015 17:33:24 GMT"}, {"version": "v2", "created": "Thu, 14 Apr 2016 22:29:34 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Bookatz", "Adam D.", ""], ["Roetteler", "Martin", ""], ["Wocjan", "Pawel", ""]]}, {"id": "1509.00885", "submitter": "Kaushik Vaidyanathan", "authors": "Kaushik Vaidyanathan", "title": "Exploiting Challenges of Sub-20 nm CMOS for Affordable Technology\n  Scaling", "comments": "CMU PhD Thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the past four decades, cost and features have driven CMOS scaling. Severe\nlithography and material limitations seen below the 20 nm node, however, are\nchallenging the fundamental premise of affordable CMOS scaling. Just continuing\nto co-optimize leaf cell circuit and layout designs with process technology\ndoes not enable us to exploit the challenges of a sub-20 nm CMOS. For\naffordable scaling it is imperative to work past sub-20 nm technology\nimpediments while exploiting its features. To this end, we propose to broaden\nthe scope of design technology co-optimization (DTCO) to be more holistic by\nincluding micro-architecture design and CAD, along with circuits, layout and\nprocess technology. Applying such holistic DTCO to the most significant block\nin a system-on-chip (SoC), embedded memory, we can synthesize smarter and\nefficient embedded memory blocks that are customized to application needs.\n  To evaluate the efficacy of the proposed holistic DTCO process, we designed,\nfabricated and tested several design experiments in a state-of-the-art IBM\n14SOI process. DTCOed leaf cells, standard cells and SRAM bitcells were robust\nduring testing, but failed to meet node to node area scaling requirements.\nHolistic DTCO, when applied to a widely used parallel access SRAM sub-block,\nconsumed 25% less area with a 50% better performance per watt compared to a\ntraditional implementation using compiled SRAM blocks and standard cells. To\nextend the benefits of holistic DTCO to other embedded memory intensive\nsub-blocks in SoCs, we developed a readily customizable smart memory synthesis\nframework (SMSF). We believe that such an approach is important to establish an\naffordable path for sub-20 nm scaling.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2015 21:46:29 GMT"}], "update_date": "2015-09-04", "authors_parsed": [["Vaidyanathan", "Kaushik", ""]]}, {"id": "1509.01226", "submitter": "Sajjad AbdollahRamezani", "authors": "Sajjad AbdollahRamezani, Kamalodin Arik, Amin Khavasi, Zahra Kavehvash", "title": "Analog Computing Using Graphene-based Metalines", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cond-mat.mes-hall physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the new concept of \"metalines\" for manipulating the amplitude\nand phase profile of an incident wave locally and independently. Thanks to the\nhighly confined graphene plasmons, a transmit-array of graphene-based metalines\nis used to realize analog computing on an ultra-compact, integrable and planar\nplatform. By employing the general concepts of spatial Fourier transformation,\na well-designed structure of such meta-transmit-array combined with graded\nindex lenses can perform two mathematical operations; i.e. differentiation and\nintegration, with high efficiency. The presented configuration is about 60\ntimes shorter than the recent structure proposed by Silva et al.(Science, 2014,\n343, 160-163); moreover, our simulated output responses are in more agreement\nwith the desired analytic results. These findings may lead to remarkable\nachievements in light-based plasmonic signal processors at nanoscale instead of\ntheir bulky conventional dielectric lens-based counterparts.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2015 19:54:03 GMT"}], "update_date": "2015-09-04", "authors_parsed": [["AbdollahRamezani", "Sajjad", ""], ["Arik", "Kamalodin", ""], ["Khavasi", "Amin", ""], ["Kavehvash", "Zahra", ""]]}, {"id": "1509.01998", "submitter": "Themistoklis Prodromakis", "authors": "Shari Lim Wei, Eleni Vasilaki, Ali Khiat, Iulia Salaoru, Radu Berdan,\n  Themistoklis Prodromakis", "title": "Emulating long-term synaptic dynamics with memristive devices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The potential of memristive devices is often seeing in implementing\nneuromorphic architectures for achieving brain-like computation. However, the\ndesigning procedures do not allow for extended manipulation of the material,\nunlike CMOS technology, the properties of the memristive material should be\nharnessed in the context of such computation, under the view that biological\nsynapses are memristors. Here we demonstrate that single solid-state TiO2\nmemristors can exhibit associative plasticity phenomena observed in biological\ncortical synapses, and are captured by a phenomenological plasticity model\ncalled triplet rule. This rule comprises of a spike-timing dependent plasticity\nregime and a classical hebbian associative regime, and is compatible with a\nlarge amount of electrophysiology data. Via a set of experiments with our\nartificial, memristive, synapses we show that, contrary to conventional uses of\nsolid-state memory, the co-existence of field- and thermally-driven switching\nmechanisms that could render bipolar and/or unipolar programming modes is a\nsalient feature for capturing long-term potentiation and depression synaptic\ndynamics. We further demonstrate that the non-linear accumulating nature of\nmemristors promotes long-term potentiating or depressing memory transitions.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2015 11:57:14 GMT"}, {"version": "v2", "created": "Fri, 22 Apr 2016 07:11:54 GMT"}], "update_date": "2016-04-25", "authors_parsed": [["Wei", "Shari Lim", ""], ["Vasilaki", "Eleni", ""], ["Khiat", "Ali", ""], ["Salaoru", "Iulia", ""], ["Berdan", "Radu", ""], ["Prodromakis", "Themistoklis", ""]]}, {"id": "1509.02673", "submitter": "Mihai Oltean", "authors": "Mihai Oltean, Oana Muntean", "title": "Solving NP-complete problems with delayed signals: an overview of\n  current research directions", "comments": "in Proceedings of 1st international workshop on Optical\n  SuperComputing, LNCS 5172, pp. 115-128, Springer-Verlag, 2008, more info at:\n  http://www.cs.ubbcluj.ro/~moltean/optical", "journal-ref": null, "doi": "10.1007/978-3-540-85673-3_10", "report-no": null, "categories": "cs.ET cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we summarize the existing principles for building\nunconventional computing devices that involve delayed signals for encoding\nsolutions to NP-complete problems. We are interested in the following aspects:\nthe properties of the signal, the operations performed within the devices, some\ncomponents required for the physical implementation, precision required for\ncorrectly reading the solution and the decrease in the signal's strength. Six\nproblems have been solved so far by using the above enumerated principles:\nHamiltonian path, travelling salesman, bounded and unbounded subset sum,\nDiophantine equations and exact cover. For the hardware implementation several\ntypes of signals can be used: light, electric power, sound, electro-magnetic\netc.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 08:14:52 GMT"}], "update_date": "2015-09-10", "authors_parsed": [["Oltean", "Mihai", ""], ["Muntean", "Oana", ""]]}, {"id": "1509.02986", "submitter": "Dmitri Strukov B", "authors": "Gina C. Adam, Brian D. Hoskins, Mirko Prezioso, and Dmitri B. Strukov", "title": "Three-Dimensional Stateful Material Implication Logic", "comments": "24 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cond-mat.mes-hall", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Monolithic three-dimensional integration of memory and logic circuits could\ndramatically improve performance and energy efficiency of computing systems.\nSome conventional and emerging memories are suitable for vertical integration,\nincluding highly scalable metal-oxide resistive switching devices (memristors),\nyet integration of logic circuits proves to be much more challenging. Here we\ndemonstrate memory and logic functionality in a monolithic three-dimensional\ncircuit by adapting recently proposed memristor-based stateful material\nimplication logic. Though such logic has been already implemented with a\nvariety of memory devices, prohibitively large device variability in the most\nprospective memristor-based circuits has limited experimental demonstrations to\nsimple gates and just a few cycles of operations. By developing a\nlow-temperature, low-variability fabrication process, and modifying the\noriginal circuit to increase its robustness to device imperfections, we\nexperimentally show, for the first time, reliable multi-cycle multi-gate\nmaterial implication logic operation within a three-dimensional stack of\nmonolithically integrated memristors. The direct data manipulation in three\ndimensions enables extremely compact and high-throughput logic-in-memory\ncomputing and, remarkably, presents a viable solution for the Feynman grand\nchallenge of implementing an 8-bit adder at the nanoscale.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2015 02:17:46 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Adam", "Gina C.", ""], ["Hoskins", "Brian D.", ""], ["Prezioso", "Mirko", ""], ["Strukov", "Dmitri B.", ""]]}, {"id": "1509.03091", "submitter": "Michael Kirsche", "authors": "Ryan D. L. Engle, Douglas D. Hodson, Michael R. Grimaila, Logan O.\n  Mailloux, Colin V. McLaughlin and Gerald Baumgartner", "title": "Modeling Quantum Optical Components, Pulses and Fiber Channels Using\n  OMNeT++", "comments": "Published in: A. F\\\"orster, C. Minkenberg, G. R. Herrera, M. Kirsche\n  (Eds.), Proc. of the 2nd OMNeT++ Community Summit, IBM Research - Zurich,\n  Switzerland, September 3-4, 2015", "journal-ref": null, "doi": null, "report-no": "OMNET/2015/04", "categories": "cs.CR cs.ET quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum Key Distribution (QKD) is an innovative technology which exploits the\nlaws of quantum mechanics to generate and distribute unconditionally secure\ncryptographic keys. While QKD offers the promise of unconditionally secure key\ndistribution, real world systems are built from non-ideal components which\nnecessitates the need to model and understand the impact these non-idealities\nhave on system performance and security. OMNeT++ has been used as a basis to\ndevelop a simulation framework to support this endeavor. This framework,\nreferred to as \"qkdX\" extends OMNeT++'s module and message abstractions to\nefficiently model optical components, optical pulses, operating protocols and\nprocesses. This paper presents the design of this framework including how\nOMNeT++'s abstractions have been utilized to model quantum optical components,\noptical pulses, fiber and free space channels. Furthermore, from our toolbox of\ncreated components, we present various notional and real QKD systems, which\nhave been studied and analyzed.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2015 10:55:37 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Engle", "Ryan D. L.", ""], ["Hodson", "Douglas D.", ""], ["Grimaila", "Michael R.", ""], ["Mailloux", "Logan O.", ""], ["McLaughlin", "Colin V.", ""], ["Baumgartner", "Gerald", ""]]}, {"id": "1509.04240", "submitter": "Neeraj Misra", "authors": "Neeraj Kumar Misra, Mukesh Kumar Kushwaha, Subodh Wairya and Amit\n  Kumar", "title": "Feasible methodology for optimization of a novel reversible binary\n  compressor", "comments": "13 pages, 9 figures", "journal-ref": "International Journal of VLSI design & Communication Systems\n  (VLSICS) Vol.6, No.4, August 2015", "doi": "10.5121/vlsic.2015.6401", "report-no": null, "categories": "cs.AR cs.ET", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Now a day reversible logic is an attractive research area due to its low\npower consumption in the area of VLSI circuit design. The reversible logic gate\nis utilized to optimize power consumption by a feature of retrieving input\nlogic from an output logic because of bijective mapping between input and\noutput. In this manuscript, we design 4 2 and 5 2 reversible compressor\ncircuits using a new type of reversible gate. In addition, we propose new gate,\nnamed as inventive0 gate for optimizing a compressor circuit. The utility of\nthe inventive0 gate is that it can be used as full adder and full subtraction\nwith low value of garbage outputs and quantum cost. An algorithm is shown for\ndesigning a compressor structure. The comparative study shows that the proposed\ncompressor structure outperforms the existing ones in terms of garbage outputs,\nnumber of gates and quantum cost. The compressor can reduce the effect of carry\n(Produce from full adder) of the arithmetic frame design. In addition, we\nimplement a basic reversible gate of MOS transistor with less number of MOS\ntransistor count.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2015 15:53:39 GMT"}], "update_date": "2015-09-15", "authors_parsed": [["Misra", "Neeraj Kumar", ""], ["Kushwaha", "Mukesh Kumar", ""], ["Wairya", "Subodh", ""], ["Kumar", "Amit", ""]]}, {"id": "1509.04328", "submitter": "Neeraj Misra Kumar", "authors": "Neeraj Kumar Misra, Subodh Wairya and Vinod Kumar Singh", "title": "Evolution of structure of some binary group based n bit comparator,\n  n-to-2n decoder by reversible technique", "comments": "22 pages, 19 figure, journal", "journal-ref": "International Journal of VLSI design & Communication Systems\n  (VLSICS) Vol.5, No.5, October 2014", "doi": "10.5121/vlsic.2014.5502", "report-no": null, "categories": "cs.ET", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Reversible logic has attracted substantial interest due to its low power\nconsumption which is the main concern of low power VLSI circuit design. In this\npaper, a novel 4x4 reversible gate called inventive gate has been introduced\nand using this gate 1-bit, 2-bit, 8-bit, 32-bit and n-bit group-based\nreversible comparator have been constructed with low value of reversible\nparameters. The MOS transistor realizations of 1-bit, 2- bit, and 8-bit of\nreversible comparator are also presented and finding power, delay and power\ndelay product (PDP) with appropriate aspect ratio W/L. Novel inventive gate has\nthe ability to use as an n-to-2n decoder. Different proposed novel reversible\ncircuit design style is compared with the existing ones. The relative results\nshows that the novel reversible gate wide utility, group-based reversible\ncomparator outperforms the present design style in terms of number of gates,\ngarbage outputs and constant input.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2015 16:06:51 GMT"}], "update_date": "2015-09-16", "authors_parsed": [["Misra", "Neeraj Kumar", ""], ["Wairya", "Subodh", ""], ["Singh", "Vinod Kumar", ""]]}, {"id": "1509.05001", "submitter": "Pooya Ronagh", "authors": "Pooya Ronagh, Brad Woods, Ehsan Iranmanesh", "title": "Solving constrained quadratic binary problems via quantum adiabatic\n  evolution", "comments": "20 pages, 2 figures", "journal-ref": "Quantum Information & Computation, Volume 16 (11-12), pp.\n  1029-1047 (2016)", "doi": null, "report-no": null, "categories": "math.OC cs.ET quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum adiabatic evolution is perceived as useful for binary quadratic\nprogramming problems that are a priori unconstrained. For constrained problems,\nit is a common practice to relax linear equality constraints as penalty terms\nin the objective function. However, there has not yet been proposed a method\nfor efficiently dealing with inequality constraints using the quantum adiabatic\napproach. In this paper, we give a method for solving the Lagrangian dual of a\nbinary quadratic programming (BQP) problem in the presence of inequality\nconstraints and employ this procedure within a branch-and-bound framework for\nconstrained BQP (CBQP) problems.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 19:06:18 GMT"}, {"version": "v2", "created": "Fri, 9 Feb 2018 20:26:18 GMT"}], "update_date": "2018-02-13", "authors_parsed": [["Ronagh", "Pooya", ""], ["Woods", "Brad", ""], ["Iranmanesh", "Ehsan", ""]]}, {"id": "1509.06898", "submitter": "Andrew Winslow", "authors": "S\\'andor P. Fekete, Robert T. Schweller, Andrew Winslow", "title": "Size-Dependent Tile Self-Assembly: Constant-Height Rectangles and\n  Stability", "comments": "In proceedings of ISAAC 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new model of algorithmic tile self-assembly called\nsize-dependent assembly. In previous models, supertiles are stable when the\ntotal strength of the bonds between any two halves exceeds some constant\ntemperature. In this model, this constant temperature requirement is replaced\nby an nondecreasing temperature function $\\tau : \\mathbb{N} \\rightarrow\n\\mathbb{N}$ that depends on the size of the smaller of the two halves. This\ngeneralization allows supertiles to become unstable and break apart, and\ncaptures the increased forces that large structures may place on the bonds\nholding them together.\n  We demonstrate the power of this model in two ways. First, we give fixed tile\nsets that assemble constant-height rectangles and squares of arbitrary input\nsize given an appropriate temperature function. Second, we prove that deciding\nwhether a supertile is stable is coNP-complete. Both results contrast with\nknown results for fixed temperature.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2015 09:27:22 GMT"}], "update_date": "2015-09-24", "authors_parsed": [["Fekete", "Sándor P.", ""], ["Schweller", "Robert T.", ""], ["Winslow", "Andrew", ""]]}, {"id": "1509.08150", "submitter": "Laszlo Kish", "authors": "Laszlo Bela Kish, Claes-Goran Granqvist", "title": "Random-resistor-random-temperature Kirchhoff-law-Johnson-noise\n  (RRRT-KLJN) key exchange", "comments": "submitted for journal publication; 8 pages, 4 figures", "journal-ref": "Metrology and Measurement Systems, Volume 23, Issue 1, Pages 3-11,\n  2016", "doi": "10.1515/mms-2016-0007", "report-no": null, "categories": "cs.ET cs.CR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We introduce two new Kirchhoff-law-Johnson-noise (KLJN) secure key\ndistribution schemes which are generalizations of the original KLJN scheme. The\nfirst of these, the Random-Resistor (RR-) KLJN scheme, uses random resistors\nwith values chosen from a quasi-continuum set. It is well-known since the\ncreation of the KLJN concept that such a system could work in cryptography,\nbecause Alice and Bob can calculate the unknown resistance value from\nmeasurements, but the RR-KLJN system has not been addressed in prior\npublications since it was considered impractical. The reason for discussing it\nnow is the second scheme, the Random-Resistor-Random-Temperature (RRRT-) KLJN\nkey exchange, inspired by a recent paper of Vadai, Mingesz and Gingl, wherein\nsecurity was shown to be maintained at non-zero power flow. In the RRRT-KLJN\nsecure key exchange scheme, both the resistances and their temperatures are\ncontinuum random variables. We prove that the security of the RRRT-KLJN scheme\ncan prevail at non-zero power flow, and thus the physical law guaranteeing\nsecurity is not the Second Law of Thermodynamics but the\nFluctuation-Dissipation Theorem. Alice and Bob know their own resistances and\ntemperatures and can calculate the resistance and temperature values at the\nother end of the communication channel from measured voltage, current and\npower-flow data in the wire. However, Eve cannot determine these values\nbecause, for her, there are four unknown quantities while she can set up only\nthree equations. The RRRT-KLJN scheme has several advantages and makes all\nformer attacks on the KLJN scheme invalid or incomplete.\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2015 22:07:33 GMT"}, {"version": "v2", "created": "Thu, 1 Oct 2015 21:37:33 GMT"}], "update_date": "2016-03-04", "authors_parsed": [["Kish", "Laszlo Bela", ""], ["Granqvist", "Claes-Goran", ""]]}, {"id": "1509.08885", "submitter": "Paul K. Radtke", "authors": "Paul K. Radtke and Lutz Schimansky-Geier", "title": "A Nonlinear HP-Type Complementary Resistive Switch", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.mes-hall cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Resistive Switching (RS) is the change in resistance of a dielectric under\nthe influence of an external current or electric field. This change is\nnon-volatile, and the basis of both the memristor and resistive random access\nmemory. In the latter, high integration densities favor the anti-serial\ncombination of two RS-elements to a single cell, termed the complementary\nresistive switch (CRS). Motivated by the irregular shape of the filament\nprotruding into the device, we suggest a nonlinearity in the\nresistance-interpolation function, and thereby expand the original\nHP-memristor. We numerically simulate and analytically solve this model.\nFurther, the nonlinearity allows for its application to the CRS.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2015 18:50:10 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Radtke", "Paul K.", ""], ["Schimansky-Geier", "Lutz", ""]]}]