[{"id": "1705.00589", "submitter": "Francis G. Woodhouse", "authors": "Francis G. Woodhouse, Joanna B. Fawcett, J\\\"orn Dunkel", "title": "Information transmission and signal permutation in active flow networks", "comments": null, "journal-ref": "New Journal of Physics vol. 20, 035003 (2018)", "doi": "10.1088/1367-2630/aab680", "report-no": null, "categories": "physics.bio-ph cond-mat.soft cond-mat.stat-mech cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent experiments show that both natural and artificial microswimmers in\nnarrow channel-like geometries will self-organise to form steady, directed\nflows. This suggests that networks of flowing active matter could function as\nnovel autonomous microfluidic devices. However, little is known about how\ninformation propagates through these far-from-equilibrium systems. Through a\nmathematical analogy with spin-ice vertex models, we investigate here the\ninput-output characteristics of generic incompressible active flow networks\n(AFNs). Our analysis shows that information transport through an AFN is\ninherently different from conventional pressure or voltage driven networks.\nActive flows on hexagonal arrays preserve input information over longer\ndistances than their passive counterparts and are highly sensitive to bulk\ntopological defects, whose presence can be inferred from marginal input-output\ndistributions alone. This sensitivity further allows controlled permutations on\nparallel inputs, revealing an unexpected link between active matter and group\ntheory that can guide new microfluidic mixing strategies facilitated by active\nmatter and aid the design of generic autonomous information transport networks.\n", "versions": [{"version": "v1", "created": "Mon, 1 May 2017 16:53:14 GMT"}, {"version": "v2", "created": "Mon, 7 May 2018 08:58:32 GMT"}], "update_date": "2018-05-08", "authors_parsed": [["Woodhouse", "Francis G.", ""], ["Fawcett", "Joanna B.", ""], ["Dunkel", "Jörn", ""]]}, {"id": "1705.00903", "submitter": "Oktay Cetinkaya", "authors": "O. Cetinkaya and Ozgur B. Akan", "title": "Fluorescent Troffer-powered Internet of Things: An Experimental Study of\n  Electric-field Energy Harvesting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.app-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A totally new energy harvesting architecture that exploits ambient\nelectric-field (E-field) emitting from fluorescent light fixtures is presented.\nA copper plate, 50 x 50 cm in size, is placed in between the ambient field to\nextract energy by capacitive coupling. A low voltage prototype is designed,\nstructured and tested on a conventional ceiling-type 4-light fluorescent\ntroffer operating in 50 Hz 220 V AC power grid. It is examined that the\nharvester is able to collect roughly 1.25 J of energy in 25 min when a 0.1 F of\nsuper-capacitor is employed. The equivalent circuit and the physical model of\nthe proposed harvesting paradigm are provided, and the attainable power is\nevaluated in both theoretical and experimental manner. The scavenged energy is\nplanned to be utilized for building battery-less Internet of Things (IoT)\nnetworks that are obliged to sense environmental parameters, analyze the\ngathered data, and remotely inform a higher authority within predefined\nperiods.\n", "versions": [{"version": "v1", "created": "Tue, 2 May 2017 10:54:17 GMT"}], "update_date": "2017-05-03", "authors_parsed": [["Cetinkaya", "O.", ""], ["Akan", "Ozgur B.", ""]]}, {"id": "1705.00971", "submitter": "S. Mohammadreza Rouzegar", "authors": "S. Mohammadreza Rouzegar, Umberto Spagnolini", "title": "Channel Estimation for Diffusive MIMO Molecular Communications", "comments": "5 pages, 5 figures, EuCNC 2017", "journal-ref": null, "doi": "10.1109/EuCNC.2017.7980701", "report-no": null, "categories": "cs.IT cs.ET math.IT stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In diffusion-based communication, as for molecular systems, the achievable\ndata rate is very low due to the slow nature of diffusion and the existence of\nsevere inter-symbol interference (ISI). Multiple-input multiple-output (MIMO)\ntechnique can be used to improve the data rate. Knowledge of channel impulse\nresponse (CIR) is essential for equalization and detection in MIMO systems.\nThis paper presents a training-based CIR estimation for diffusive MIMO (D-MIMO)\nchannels. Maximum likelihood and least-squares estimators are derived, and the\ntraining sequences are designed to minimize the corresponding Cram\\'er-Rao\nbound. Sub-optimal estimators are compared to Cram\\'er-Rao bound to validate\ntheir performance.\n", "versions": [{"version": "v1", "created": "Tue, 25 Apr 2017 23:02:39 GMT"}, {"version": "v2", "created": "Mon, 22 Jan 2018 09:37:53 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Rouzegar", "S. Mohammadreza", ""], ["Spagnolini", "Umberto", ""]]}, {"id": "1705.01942", "submitter": "John Dorband", "authors": "John E. Dorband", "title": "Improving the Accuracy of an Adiabatic Quantum Computer", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of the D-Wave adiabatic quantum computer is to find a set of\nqubit values that minimize its objective function. For various reasons, the set\nof qubit values returned by the D-Wave has errors. This paper presents a method\nof improving the results returned by the D-Wave. The method individually\nmodifies the qubit values returned by the D-Wave to find a set of values which\nis a minimum of the objective function. That set however is not necessarily\nguaranteed to be a global minimum. The method is simple and easily incorporated\ninto any algorithm that has direct access to the sets of values returned by the\nD-Wave. Examples are also presented that demonstrate the merit of using such a\nsample improvement method.\n", "versions": [{"version": "v1", "created": "Thu, 4 May 2017 15:50:52 GMT"}], "update_date": "2017-05-08", "authors_parsed": [["Dorband", "John E.", ""]]}, {"id": "1705.01943", "submitter": "Ahmed Zeeshan Pervaiz", "authors": "Ahmed Zeeshan Pervaiz, Lakshmi Anirudh Ghantasala, Kerem Yunus\n  Camsari, Supriyo Datta", "title": "Hardware emulation of stochastic p-bits for invertible logic", "comments": null, "journal-ref": "Sci. Rep. 7, 10994 (2017)", "doi": "10.1038/s41598-017-11011-8", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The common feature of nearly all logic and memory devices is that they make\nuse of stable units to represent 0's and 1's. A completely different paradigm\nis based on three-terminal stochastic units which could be called \"p-bits\",\nwhere the output is a random telegraphic signal continuously fluctuating\nbetween 0 and 1 with a tunable mean. p-bits can be interconnected to receive\nweighted contributions from others in a network, and these weighted\ncontributions can be chosen to not only solve problems of optimization and\ninference but also to implement precise Boolean functions in an inverted mode.\nThis inverted operation of Boolean gates is particularly striking: They provide\ninputs consistent to a given output along with unique outputs to a given set of\ninputs. The existing demonstrations of accurate invertible logic are\nintriguing, but will these striking properties observed in computer simulations\ncarry over to hardware implementations? This paper uses individual micro\ncontrollers to emulate p-bits, and we present results for a 4-bit ripple carry\nadder with 48 p-bits and a 4-bit multiplier with 46 p-bits working in inverted\nmode as a factorizer. Our results constitute a first step towards implementing\np-bits with nano devices, like stochastic Magnetic Tunnel Junctions.\n", "versions": [{"version": "v1", "created": "Thu, 4 May 2017 17:09:12 GMT"}, {"version": "v2", "created": "Tue, 12 Sep 2017 23:40:21 GMT"}], "update_date": "2017-09-14", "authors_parsed": [["Pervaiz", "Ahmed Zeeshan", ""], ["Ghantasala", "Lakshmi Anirudh", ""], ["Camsari", "Kerem Yunus", ""], ["Datta", "Supriyo", ""]]}, {"id": "1705.02338", "submitter": "Ashwani Kumar", "authors": "Ashwani Kumar, Mukul Sarkar, and Manan Suri", "title": "Exploiting OxRAM Resistive Switching for Dynamic Range Improvement of\n  CMOS Image Sensors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a unique application of OxRAM devices in CMOS Image Sensors (CIS)\nfor dynamic range (DR) improvement. We propose a modified 3T-APS (Active Pixel\nSensor) circuit that incorporates OxRAM in 1T-1R configuration. DR improvement\nis achieved by resistive compression of the pixel output signal through\nautonomous programming of OxRAM device resistance during exposure. We show that\nby carefully preconditioning the OxRAM resistance, pixel DR can be enhanced.\nDetailed impact of OxRAM SET-to-RESET and RESET-to-SET transitions on pixel DR\nis discussed. For experimental validation with specific OxRAM preprogrammed\nstates, a 4 Kb 10 nm thick HfOx (1T-1R) matrix was fabricated and\ncharacterized. Best case, relative pixel DR improvement of ~ 50 dB was obtained\nfor our design.\n", "versions": [{"version": "v1", "created": "Fri, 5 May 2017 15:50:28 GMT"}], "update_date": "2017-05-09", "authors_parsed": [["Kumar", "Ashwani", ""], ["Sarkar", "Mukul", ""], ["Suri", "Manan", ""]]}, {"id": "1705.03008", "submitter": "David Alejandro Trejo Pizzo", "authors": "David Alejandro Trejo Pizzo", "title": "Resistive communications based on neuristors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Memristors are passive elements that allow us to store information using a\nsingle element per bit. However, this is not the only utility of the memristor.\nConsidering the physical chemical structure of the element used, the memristor\ncan function at the same time as memory and as a communication unit. This paper\npresents a new approach to the use of the memristor and develops the concept of\nresistive communication.\n", "versions": [{"version": "v1", "created": "Sun, 7 May 2017 23:02:07 GMT"}], "update_date": "2017-05-10", "authors_parsed": [["Pizzo", "David Alejandro Trejo", ""]]}, {"id": "1705.04099", "submitter": "Bibhash Sen", "authors": "Mahabub Hasan Mahalat and Mrinal Goswami and Anindan Mondal and\n  Bibhash Sen", "title": "Synthesis and Optimization of Multi-Objective Multi-Output QCA Circuit\n  using Genetic Algorithm", "comments": "5 tables, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The physical limitations of CMOS technology triggered several research for\nfinding an alternative technology. QCA is one of the emerging nanotechnologies\nwhich is gaining attention as a substitute of CMOS. The main potential of QCA\nis its ultra low power consumption, less area overhead, and high speed.\nMajority and inverter gates are the basic gates in QCA,which together works as\na universal logic gate to implement any QCA circuit. This paper proposes an\nefficient methodology for optimal QCA circuit synthesis of arbitrary\nmulti-output boolean functions. A multi-objective genetic algorithm based\napproach is used to reduce worst case delay and gate count of a QCA circuit.\nDifferent importance is given to worst case delay, no. of majority and no. of\ninverter gates. Several efficient techniques are used in order to achieve the\noptimal result and reduce the computational complexity furthermore additional\nmethodologies are used to eliminate redundancies from the final solution.\nComparison of the obtained results with the existing best techniques indicates,\nthe proposed technique outperforms in terms of worst case delay and gate count.\n", "versions": [{"version": "v1", "created": "Thu, 11 May 2017 10:11:39 GMT"}], "update_date": "2017-05-12", "authors_parsed": [["Mahalat", "Mahabub Hasan", ""], ["Goswami", "Mrinal", ""], ["Mondal", "Anindan", ""], ["Sen", "Bibhash", ""]]}, {"id": "1705.04988", "submitter": "Bing Li", "authors": "Tsun-Ming Tseng, Bing Li, Tsung-Yi Ho, Ulf Schlichtmann", "title": "Storage and Caching: Synthesis of Flow-based Microfluidic Biochips", "comments": "IEEE Design and Test, December 2015", "journal-ref": null, "doi": "10.1109/MDAT.2015.2492473", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flow-based microfluidic biochips are widely used in lab- on-a-chip\nexperiments. In these chips, devices such as mixers and detectors connected by\nmicro-channels execute specific operations. Intermediate fluid samples are\nsaved in storage temporarily until target devices become avail- able. However,\nif the storage unit does not have enough capacity, fluid samples must wait in\ndevices, reducing their efficiency and thus increasing the overall execution\ntime. Consequently, storage and caching of fluid samples in such microfluidic\nchips must be considered during synthesis to balance execution efficiency and\nchip area.\n", "versions": [{"version": "v1", "created": "Sun, 14 May 2017 16:06:35 GMT"}], "update_date": "2017-05-16", "authors_parsed": [["Tseng", "Tsun-Ming", ""], ["Li", "Bing", ""], ["Ho", "Tsung-Yi", ""], ["Schlichtmann", "Ulf", ""]]}, {"id": "1705.04991", "submitter": "Bing Li", "authors": "Tsun-Ming Tseng, Bing Li, Ching-Feng Yeh, Hsiang-Chieh Jhan, Zuo-Ming\n  Tsai, Mark Po-Hung Lin, and Ulf Schlichtmann", "title": "Novel CMOS RFIC Layout Generation with Concurrent Device Placement and\n  Fixed-Length Microstrip Routing", "comments": "ACM/IEEE Design Automation Conference (DAC), 2016", "journal-ref": null, "doi": "10.1145/2897937.2898052", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With advancing process technologies and booming IoT markets, millimeter-wave\nCMOS RFICs have been widely developed in re- cent years. Since the performance\nof CMOS RFICs is very sensi- tive to the precision of the layout, precise\nplacement of devices and precisely matched microstrip lengths to given values\nhave been a labor-intensive and time-consuming task, and thus become a major\nbottleneck for time to market. This paper introduces a progressive\ninteger-linear-programming-based method to gener- ate high-quality RFIC layouts\nsatisfying very stringent routing requirements of microstrip lines, including\nspacing/non-crossing rules, precise length, and bend number minimization,\nwithin a given layout area. The resulting RFIC layouts excel in both per-\nformance and area with much fewer bends compared with the simulation-tuning\nbased manual layout, while the layout gener- ation time is significantly\nreduced from weeks to half an hour.\n", "versions": [{"version": "v1", "created": "Sun, 14 May 2017 16:15:25 GMT"}], "update_date": "2017-05-16", "authors_parsed": [["Tseng", "Tsun-Ming", ""], ["Li", "Bing", ""], ["Yeh", "Ching-Feng", ""], ["Jhan", "Hsiang-Chieh", ""], ["Tsai", "Zuo-Ming", ""], ["Lin", "Mark Po-Hung", ""], ["Schlichtmann", "Ulf", ""]]}, {"id": "1705.04996", "submitter": "Bing Li", "authors": "Chunfeng Liu, Bing Li, Bhargab B. Bhattacharya, Krishnendu\n  Chakrabarty, Tsung-Yi Ho, Ulf Schlichtmann", "title": "Testing Microfluidic Fully Programmable Valve Arrays (FPVAs)", "comments": "Design, Automation and Test in Europe (DATE), March 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fully Programmable Valve Array (FPVA) has emerged as a new architecture for\nthe next-generation flow-based microfluidic biochips. This 2D-array consists of\nregularly-arranged valves, which can be dynamically configured by users to\nrealize microfluidic devices of different shapes and sizes as well as\ninterconnections. Additionally, the regularity of the underlying structure\nrenders FPVAs easier to integrate on a tiny chip. However, these arrays may\nsuffer from various manufacturing defects such as blockage and leakage in\ncontrol and flow channels. Unfortunately, no efficient method is yet known for\ntesting such a general-purpose architecture. In this paper, we present a novel\nformulation using the concept of flow paths and cut-sets, and describe an\nILP-based hierarchical strategy for generating compact test sets that can\ndetect multiple faults in FPVAs. Simulation results demonstrate the efficacy of\nthe proposed method in detecting manufacturing faults with only a small number\nof test vectors.\n", "versions": [{"version": "v1", "created": "Sun, 14 May 2017 16:31:36 GMT"}], "update_date": "2017-05-16", "authors_parsed": [["Liu", "Chunfeng", ""], ["Li", "Bing", ""], ["Bhattacharya", "Bhargab B.", ""], ["Chakrabarty", "Krishnendu", ""], ["Ho", "Tsung-Yi", ""], ["Schlichtmann", "Ulf", ""]]}, {"id": "1705.04998", "submitter": "Bing Li", "authors": "Chunfeng Liu, Bing Li, Hailong Yao, Paul Pop, Tsung-Yi Ho, Ulf\n  Schlichtmann", "title": "Transport or Store? Synthesizing Flow-based Microfluidic Biochips using\n  Distributed Channel Storage", "comments": "ACM/IEEE Design Automation Conference (DAC), June 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flow-based microfluidic biochips have attracted much atten- tion in the EDA\ncommunity due to their miniaturized size and execution efficiency. Previous\nresearch, however, still follows the traditional computing model with a\ndedicated storage unit, which actually becomes a bottleneck of the performance\nof bio- chips. In this paper, we propose the first architectural synthe- sis\nframework considering distributed storage constructed tem- porarily from\ntransportation channels to cache fluid samples. Since distributed storage can\nbe accessed more efficiently than a dedicated storage unit and channels can\nswitch between the roles of transportation and storage easily, biochips with\nthis dis- tributed computing architecture can achieve a higher execution\nefficiency even with fewer resources. Experimental results con- firm that the\nexecution efficiency of a bioassay can be improved by up to 28% while the\nnumber of valves in the biochip can be reduced effectively.\n", "versions": [{"version": "v1", "created": "Sun, 14 May 2017 16:37:20 GMT"}], "update_date": "2017-05-16", "authors_parsed": [["Liu", "Chunfeng", ""], ["Li", "Bing", ""], ["Yao", "Hailong", ""], ["Pop", "Paul", ""], ["Ho", "Tsung-Yi", ""], ["Schlichtmann", "Ulf", ""]]}, {"id": "1705.05917", "submitter": "Roberto Leporini", "authors": "Gianpiero Cattaneo and Roberto Leporini", "title": "A discussion about LNG Experiment: Irreversible or Reversible Generation\n  of the OR Logic Gate?", "comments": "22 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper M. Lopez-Suarez, I. Neri, and L. Gammaitoni (LNG) present a\nconcrete realization of the Boolean OR irreversible gate, but contrary to the\nstandard Landauer principle, with an arbitrary small dissipation of energy. A\nPopperian good falsification! In this paper we discuss a theoretical\ndescription of the LNG device which is indeed a 3in/3out self--reversible\nrealization of the involved OR gate, satisfying in this way the Landauer\nprinciple of no dispersion of energy, contrary to the LNG conclusions. The\ndifferent point of view is due to a different interpretation of the two outputs\ncorresponding to the inputs 10 and 01, which are considered by LNG\nindistinguishable so producing a non reversible realization of the standard\n2in/1out gate. On the contrary, always considering these two outputs\nindistinguishable, by a suitable normalization function of the cantilever\nangles, the experimental results obtained by the LNG device coincide with the\nOR connective obtained from the third output of the self-reversible 3in/3out CL\ngate by the Inputs-Ancilla->Garbage-Output procedure. Thus, by the\nself-reversibility this realization is without dissipation of energy according\nto the Landauer principle. Furthermore, using the self-reversible Toffoli gate\nit is possible to obtain from the LNG device the realization of the connective\nAND adopting another normalization function on the cantilever angles. Finally,\nby other suitable normalization procedures on cantilever angles it is possible\nto obtain also the other logic NOR and NAND connectives, and in a more\nsophisticated way the XOR and NXOR connectives in a self-reversible way. All\nthis leads to introduce a universal logic machine consisting of the LNG device\nplus a memory containing all the necessary angle normalization functions to\nproduce in a self-reversible way, by choosing one of these latter, the logic\nconnectives now listed.\n", "versions": [{"version": "v1", "created": "Mon, 15 May 2017 12:58:28 GMT"}, {"version": "v2", "created": "Thu, 15 Jun 2017 17:49:45 GMT"}], "update_date": "2017-06-16", "authors_parsed": [["Cattaneo", "Gianpiero", ""], ["Leporini", "Roberto", ""]]}, {"id": "1705.06674", "submitter": "Shovan Maity", "authors": "Shovan Maity, Debayan Das, Shreyas Sen", "title": "Wearable Health Monitoring Using Capacitive Voltage-Mode Human Body\n  Communication", "comments": "International Conference of the IEEE Engineering in Medicine and\n  Biology Society (EMBC 17)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rapid miniaturization and cost reduction of computing, along with the\navailability of wearable and implantable physiological sensors have led to the\ngrowth of human Body Area Network (BAN) formed by a network of such sensors and\ncomputing devices. One promising application of such a network is wearable\nhealth monitoring where the collected data from the sensors would be\ntransmitted and analyzed to assess the health of a person. Typically, the\ndevices in a BAN are connected through wireless (WBAN), which suffers from\nenergy inefficiency due to the high-energy consumption of wireless\ntransmission. Human Body Communication (HBC) uses the relatively low loss human\nbody as the communication medium to connect these devices, promising order(s)\nof magnitude better energy-efficiency and built-in security compared to WBAN.\nIn this paper, we demonstrate a health monitoring device and system built using\nCommercial-Off-The- Shelf (COTS) sensors and components, that can collect data\nfrom physiological sensors and transmit it through a) intra-body HBC to another\ndevice (hub) worn on the body or b) upload health data through HBC-based\nhuman-machine interaction to an HBC capable machine. The system design\nconstraints and signal transfer characteristics for the implemented HBC-based\nwearable health monitoring system are measured and analyzed, showing reliable\nconnectivity with >8x power savings compared to Bluetooth lowenergy (BTLE).\n", "versions": [{"version": "v1", "created": "Sun, 14 May 2017 04:18:18 GMT"}], "update_date": "2017-05-19", "authors_parsed": [["Maity", "Shovan", ""], ["Das", "Debayan", ""], ["Sen", "Shreyas", ""]]}, {"id": "1705.06942", "submitter": "Akhilesh Jaiswal", "authors": "Akhilesh Jaiswal, Amogh Agrawal, Priyadarshini Panda, Kaushik Roy", "title": "Voltage-Driven Domain-Wall Motion based Neuro-Synaptic Devices for\n  Dynamic On-line Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conventional von-Neumann computing models have achieved remarkable feats for\nthe past few decades. However, they fail to deliver the required efficiency for\ncertain basic tasks like image and speech recognition when compared to\nbiological systems. As such, taking cues from biological systems, novel\ncomputing paradigms are being explored for efficient hardware implementations\nof recognition/classification tasks. The basic building blocks of such\nneuromorphic systems are neurons and synapses. Towards that end, we propose a\nleaky-integrate-fire (LIF) neuron and a programmable non-volatile synapse using\ndomain wall motion induced by magneto-electric effect. Due to a strong elastic\npinning between the ferro-magnetic domain wall (FM-DW) and the underlying\nferro-electric domain wall (FE-DW), the FM-DW gets dragged by the FE-DW on\napplication of a voltage pulse. The fact that FE materials are insulators\nallows for pure voltage-driven FM-DW motion, which in turn can be used to mimic\nthe behaviors of biological spiking neurons and synapses. The voltage driven\nnature of the proposed devices allows energy-efficient operation. A detailed\ndevice to system level simulation framework based on micromagnetic simulations\nhas been developed to analyze the feasibility of the proposed neuro-synaptic\ndevices. We also demonstrate that the energy-efficient voltage-controlled\nbehavior of the proposed devices make them suitable for dynamic on-line and\nlifelong learning in spiking neural networks (SNNs).\n", "versions": [{"version": "v1", "created": "Fri, 19 May 2017 11:37:04 GMT"}, {"version": "v2", "created": "Thu, 23 Nov 2017 03:47:06 GMT"}], "update_date": "2017-11-27", "authors_parsed": [["Jaiswal", "Akhilesh", ""], ["Agrawal", "Amogh", ""], ["Panda", "Priyadarshini", ""], ["Roy", "Kaushik", ""]]}, {"id": "1705.08040", "submitter": "Nariman Farsad", "authors": "Nariman Farsad and Christopher Rose and Muriel M\\'edard and Andrea\n  Goldsmith", "title": "Capacity of Molecular Channels with Imperfect Particle-Intensity\n  Modulation and Detection", "comments": "Accepted at IEEE International Symposium on Information Theory (ISIT)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.ET math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work introduces the particle-intensity channel (PIC) as a model for\nmolecular communication systems and characterizes the properties of the optimal\ninput distribution and the capacity limits for this system. In the PIC, the\ntransmitter encodes information, in symbols of a given duration, based on the\nnumber of particles released, and the receiver detects and decodes the message\nbased on the number of particles detected during the symbol interval. In this\nchannel, the transmitter may be unable to control precisely the number of\nparticles released, and the receiver may not detect all the particles that\narrive. We demonstrate that the optimal input distribution for this channel\nalways has mass points at zero and the maximum number of particles that can be\nreleased. We then consider diffusive particle transport, derive the capacity\nexpression when the input distribution is binary, and show conditions under\nwhich the binary input is capacity-achieving. In particular, we demonstrate\nthat when the transmitter cannot generate particles at a high rate, the optimal\ninput distribution is binary.\n", "versions": [{"version": "v1", "created": "Mon, 22 May 2017 23:21:02 GMT"}], "update_date": "2017-05-24", "authors_parsed": [["Farsad", "Nariman", ""], ["Rose", "Christopher", ""], ["Médard", "Muriel", ""], ["Goldsmith", "Andrea", ""]]}, {"id": "1705.08044", "submitter": "Nariman Farsad", "authors": "Nariman Farsad and Andrea Goldsmith", "title": "Detection Algorithms for Communication Systems Using Deep Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The design and analysis of communication systems typically rely on the\ndevelopment of mathematical models that describe the underlying communication\nchannel, which dictates the relationship between the transmitted and the\nreceived signals. However, in some systems, such as molecular communication\nsystems where chemical signals are used for transfer of information, it is not\npossible to accurately model this relationship. In these scenarios, because of\nthe lack of mathematical channel models, a completely new approach to design\nand analysis is required. In this work, we focus on one important aspect of\ncommunication systems, the detection algorithms, and demonstrate that by\nborrowing tools from deep learning, it is possible to train detectors that\nperform well, without any knowledge of the underlying channel models. We\nevaluate these algorithms using experimental data that is collected by a\nchemical communication platform, where the channel model is unknown and\ndifficult to model analytically. We show that deep learning algorithms perform\nsignificantly better than a simple detector that was used in previous works,\nwhich also did not assume any knowledge of the channel.\n", "versions": [{"version": "v1", "created": "Mon, 22 May 2017 23:47:47 GMT"}, {"version": "v2", "created": "Mon, 31 Jul 2017 02:43:27 GMT"}], "update_date": "2017-08-01", "authors_parsed": [["Farsad", "Nariman", ""], ["Goldsmith", "Andrea", ""]]}, {"id": "1705.08927", "submitter": "Davide Venturelli", "authors": "Davide Venturelli, Minh Do, Eleanor Rieffel, Jeremy Frank", "title": "Compiling quantum circuits to realistic hardware architectures using\n  temporal planners", "comments": "updated manuscript, more planners and results", "journal-ref": "2017 Quantum Sci. Technol. - also related to proceedings of IJCAI\n  2017, and ICAPS SPARK Workshop 2017", "doi": "10.1088/2058-9565/aaa331", "report-no": null, "categories": "quant-ph cs.AI cs.ET cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To run quantum algorithms on emerging gate-model quantum hardware, quantum\ncircuits must be compiled to take into account constraints on the hardware. For\nnear-term hardware, with only limited means to mitigate decoherence, it is\ncritical to minimize the duration of the circuit. We investigate the\napplication of temporal planners to the problem of compiling quantum circuits\nto newly emerging quantum hardware. While our approach is general, we focus on\ncompiling to superconducting hardware architectures with nearest neighbor\nconstraints. Our initial experiments focus on compiling Quantum Alternating\nOperator Ansatz (QAOA) circuits whose high number of commuting gates allow\ngreat flexibility in the order in which the gates can be applied. That freedom\nmakes it more challenging to find optimal compilations but also means there is\na greater potential win from more optimized compilation than for less flexible\ncircuits. We map this quantum circuit compilation problem to a temporal\nplanning problem, and generated a test suite of compilation problems for QAOA\ncircuits of various sizes to a realistic hardware architecture. We report\ncompilation results from several state-of-the-art temporal planners on this\ntest set. This early empirical evaluation demonstrates that temporal planning\nis a viable approach to quantum circuit compilation.\n", "versions": [{"version": "v1", "created": "Wed, 24 May 2017 18:52:43 GMT"}, {"version": "v2", "created": "Thu, 21 Dec 2017 10:41:42 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Venturelli", "Davide", ""], ["Do", "Minh", ""], ["Rieffel", "Eleanor", ""], ["Frank", "Jeremy", ""]]}, {"id": "1705.09176", "submitter": "Dmitri Maslov", "authors": "Dmitri Maslov and Martin Roetteler", "title": "Shorter stabilizer circuits via Bruhat decomposition and quantum circuit\n  transformations", "comments": "Supersedes arXiv:1703.00874", "journal-ref": "IEEE Transactions on Information Theory 64(7):4729-4738 (2018)", "doi": "10.1109/TIT.2018.2825602", "report-no": null, "categories": "quant-ph cs.ET cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we improve the layered implementation of arbitrary stabilizer\ncircuits introduced by Aaronson and Gottesman in Phys. Rev. A 70(052328), 2004:\nto obtain a general stabilizer circuit, we reduce their $11$-stage computation\n-H-C-P-C-P-C-H-P-C-P-C- over the gate set consisting of Hadamard,\nControlled-NOT, and Phase gates, into a $7$-stage computation of the form\n-C-CZ-P-H-P-CZ-C-. We show arguments in support of using -CZ- stages over the\n-C- stages: not only the use of -CZ- stages allows a shorter layered\nexpression, but -CZ- stages are simpler and appear to be easier to implement\ncompared to the -C- stages. Based on this decomposition, we develop a two-qubit\ngate depth-$(14n{-}4)$ implementation of stabilizer circuits over the gate\nlibrary $\\{$H, P, CNOT$\\}$, executable in the Linear Nearest Neighbor (LNN)\narchitecture, improving best previously known depth-$25n$ circuit, also\nexecutable in the LNN architecture. Our constructions rely on Bruhat\ndecomposition of the symplectic group and on folding arbitrarily long sequences\nof the form $($-P-C-$)^m$ into a 3-stage computation -P-CZ-C-. Our results\ninclude the reduction of the $11$-stage decomposition -H-C-P-C-P-C-H-P-C-P-C-\ninto a $9$-stage decomposition of the form -C-P-C-P-H-C-P-C-P-. This reduction\nis based on the Bruhat decomposition of the symplectic group. This result also\nimplies a new normal form for stabilizer circuits. We show that a circuit in\nthis normal form is optimal in the number of Hadamard gates used. We also show\nthat the normal form has an asymptotically optimal number of parameters.\n", "versions": [{"version": "v1", "created": "Thu, 25 May 2017 13:46:17 GMT"}, {"version": "v2", "created": "Sat, 23 Jun 2018 18:26:11 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Maslov", "Dmitri", ""], ["Roetteler", "Martin", ""]]}, {"id": "1705.09402", "submitter": "Andrew Adamatzky", "authors": "Andrew Adamatzky", "title": "On dynamics of excitation in F-actin: automaton model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We represent a filamentous actin molecule as a graph of finite-state machines\n(F-actin automaton). Each node in the graph takes three states --- resting,\nexcited, refractory. All nodes update their states simultaneously and by the\nsame rule, in discrete time steps. Two rules are considered: threshold rule ---\na resting node is excited if it has at least one excited neighbour and narrow\nexcitation interval rule --- a resting node is excited if it has exactly one\nexcited neighbour. We analyse distributions of transient periods and lengths of\nlimit cycles in evolution of F-actin automaton, propose mechanisms for\nformation of limit cycles and evaluate density of information storage in\nF-actin automata.\n", "versions": [{"version": "v1", "created": "Fri, 26 May 2017 00:36:28 GMT"}], "update_date": "2017-05-29", "authors_parsed": [["Adamatzky", "Andrew", ""]]}]