[{"id": "1010.4059", "submitter": "Vasil Kolev", "authors": "Vasil Kolev", "title": "Multiplierless Modules for Forward and Backward Integer Wavelet\n  Transform", "comments": "7 pages, The ACM proceedings of CompSysTech 2003", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is about the architecture of a lossless wavelet filter bank with\nreprogrammable logic. It is based on second generation of wavelets with a\nreduced of number of operations. A new basic structure for parallel\narchitecture and modules to forward and backward integer discrete wavelet\ntransform is proposed.\n", "versions": [{"version": "v1", "created": "Tue, 19 Oct 2010 21:58:14 GMT"}, {"version": "v2", "created": "Fri, 24 Jun 2011 19:01:09 GMT"}], "update_date": "2011-11-29", "authors_parsed": [["Kolev", "Vasil", ""]]}, {"id": "1010.4065", "submitter": "Bernhard Fischer", "authors": "Bernhard Fischer", "title": "Model-Based Development of Distributed Embedded Systems by the Example\n  of the Scicos/SynDEx Framework", "comments": "146 pages, Master's Thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.AR cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The embedded systems engineering industry faces increasing demands for more\nfunctionality, rapidly evolving components, and shrinking schedules. Abilities\nto quickly adapt to changes, develop products with safe design, minimize\nproject costs, and deliver timely are needed. Model-based development (MBD)\nfollows a separation of concerns by abstracting systems with an appropriate\nintensity. MBD promises higher comprehension by modeling on several\nabstraction-levels, formal verification, and automated code generation. This\nthesis demonstrates MBD with the Scicos/SynDEx framework on a distributed\nembedded system. Scicos is a modeling and simulation environment for hybrid\nsystems. SynDEx is a rapid prototyping integrated development environment for\ndistributed systems. Performed examples implement well-known control algorithms\non a target system containing several networked microcontrollers, sensors, and\nactuators. The addressed research question tackles the feasibility of MBD for\nmedium-sized embedded systems. In the case of single-processor applications\nexperiments show that the comforts of tool-provided simulation, verification,\nand code-generation have to be weighed against an additional memory consumption\nin dynamic and static memory compared to a hand-written approach. Establishing\na near-seamless modeling-framework with Scicos/SynDEx is expensive. An\nincreased development effort indicates a high price for developing single\napplications, but might pay off for product families. A further drawback was\nthat the distributed code generated with SynDEx could not be adapted to\nmicrocontrollers without a significant alteration of the scheduling tables. The\nScicos/SynDEx framework forms a valuable tool set that, however, still needs\nmany improvements. Therefore, its usage is only recommended for experimental\npurposes.\n", "versions": [{"version": "v1", "created": "Tue, 19 Oct 2010 22:25:36 GMT"}], "update_date": "2010-10-21", "authors_parsed": [["Fischer", "Bernhard", ""]]}]