[{"id": "1411.0782", "submitter": "Seung Woo Shin", "authors": "Seung Woo Shin, Chris Thachuk, Erik Winfree", "title": "Verifying Chemical Reaction Network Implementations: A Pathway\n  Decomposition Approach", "comments": "41 pages, 11 figures. Preliminary version appeared in VEMDP 2014, an\n  affiliated workshop of CAV 2014. This version submitted to Theoretical\n  Computer Science", "journal-ref": "Theoretical Computer Science, Volume 765, 18 April 2019, Pages\n  67-96", "doi": "10.1016/j.tcs.2017.10.011", "report-no": null, "categories": "cs.CE cs.ET cs.LO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we focus on the challenge of verifying the correctness of molecular\nimplementations of abstract chemical reaction networks, where operation in a\nwell-mixed \"soup\" of molecules is stochastic, asynchronous, concurrent, and\noften involves multiple intermediate steps in the implementation, parallel\npathways, and side reactions. This problem relates to the verification of Petri\nnets, but existing approaches are not sufficient for providing a single\nguarantee covering an infinite set of possible initial states (molecule counts)\nand an infinite state space potentially explored by the system given any\ninitial state. We address these issues by formulating a new theory of pathway\ndecomposition that provides an elegant formal basis for comparing chemical\nreaction network implementations, and we present an algorithm that computes\nthis basis. Our theory naturally handles certain situations that commonly arise\nin molecular implementations, such as what we call \"delayed choice,\" that are\nnot easily accommodated by other approaches. We further show how pathway\ndecomposition can be combined with weak bisimulation to handle a wider class\nthat includes most currently known enzyme-free DNA implementation techniques.\nWe anticipate that our notion of logical equivalence between chemical reaction\nnetwork implementations will be valuable for other molecular implementations\nsuch as biochemical enzyme systems, and perhaps even more broadly in\nconcurrency theory.\n", "versions": [{"version": "v1", "created": "Tue, 4 Nov 2014 04:53:25 GMT"}, {"version": "v2", "created": "Sat, 29 Apr 2017 18:22:00 GMT"}, {"version": "v3", "created": "Thu, 10 Aug 2017 20:01:53 GMT"}], "update_date": "2019-10-01", "authors_parsed": [["Shin", "Seung Woo", ""], ["Thachuk", "Chris", ""], ["Winfree", "Erik", ""]]}, {"id": "1411.0784", "submitter": "Genaro J. Martinez", "authors": "Rogelio Basurto, Paulina A. Le\\'on, Genaro J. Mart\\'inez, Juan C.\n  Seck-Tuoh-Mora", "title": "Logic gates and complex dynamics in a hexagonal cellular automaton: the\n  Spiral rule", "comments": "20 pages, 14 figures, 6 tables", "journal-ref": "Journal of Cellular Automata, 8(1-2), p. 53-71, 2013. URL:\n  http://www.oldcitypublishing.com/journals/jca-home/jca-issue-contents/jca-volume-8-number-1-2-2013/jca-8-1-2-p-53-71/", "doi": null, "report-no": null, "categories": "nlin.CG cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In previous works, hexagonal cellular automata (CA) have been studied as a\nvariation of the famous Game of Life CA, mainly for spiral phenomena\nsimulations; where the most interesting constructions are related to the\nBelousov-Zhabotinsky reaction. In this paper, we analyse a special kind of\nhexagonal CA, {\\it Spiral rule}. Such automaton shows a non-trivial complex\nbehaviour related to discrete models of reaction-diffusion chemical media,\ndominated by spiral guns which easily emerge from random initial conditions.\nThe computing capabilities of this automaton are shown by means of logic gates.\nThese are defined by collisions between mobile localizations. Also, an extended\nclassification of complex self-localisation patterns is presented, including\nsome self-organised patterns.\n", "versions": [{"version": "v1", "created": "Tue, 4 Nov 2014 05:08:27 GMT"}], "update_date": "2014-11-05", "authors_parsed": [["Basurto", "Rogelio", ""], ["León", "Paulina A.", ""], ["Martínez", "Genaro J.", ""], ["Seck-Tuoh-Mora", "Juan C.", ""]]}, {"id": "1411.0973", "submitter": "Andrew Winslow", "authors": "Benjamin Hescott, Caleb Malchik, Andrew Winslow", "title": "More Tight Bounds for Active Self-Assembly Using an Insertion Primitive", "comments": "A subset of the results appear in arXiv:1401.0359 and the proceedings\n  of ESA 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.ET cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove several limits on the behavior of a model of self-assembling\nparticles introduced by Dabby and Chen (SODA 2013), called insertion systems,\nwhere monomers insert themselves into the middle of a growing linear polymer.\nFirst, we prove that the expressive power of these systems is equal to\ncontext-free grammars, answering a question posed by Dabby and Chen.\n  Second, we give tight bounds on the maximum length and minimum expected time\nof constructed polymers in systems of three increasingly restricted classes. We\nprove that systems of $k$ monomer types can deterministically construct\npolymers of length $n = 2^{\\Theta(k^{3/2})}$ in $O(\\log^{5/3}(n))$ expected\ntime. We also prove that if non-deterministic construction of a finite number\nof polymers is permitted, then the expected construction time can be reduced to\n$O(\\log^{3/2}(n))$ at the trade-off of decreasing the length to\n$2^{\\Theta(k)}$. If the system is allowed to construct an infinite number of\npolymers, then constructing polymers of unbounded length in $O(\\log{n})$\nexpected time is possible. We follow these positive results with a set of lower\nbounds proving that these are the best possible polymer lengths and expected\nconstruction times.\n", "versions": [{"version": "v1", "created": "Tue, 4 Nov 2014 17:14:44 GMT"}, {"version": "v2", "created": "Thu, 13 Nov 2014 14:47:06 GMT"}], "update_date": "2015-10-29", "authors_parsed": [["Hescott", "Benjamin", ""], ["Malchik", "Caleb", ""], ["Winslow", "Andrew", ""]]}, {"id": "1411.1122", "submitter": "Scott Summers", "authors": "David Furcy and Samuel Micka and Scott M. Summers", "title": "Optimal program-size complexity for self-assembly at temperature 1 in 3D", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Working in a three-dimensional variant of Winfree's abstract Tile Assembly\nModel, we show that, for all $N \\in \\mathbb{N}$, there is a tile set that\nuniquely self-assembles into an $N \\times N$ square shape at temperature 1 with\noptimal program-size complexity of $O(\\log N / \\log \\log N)$ (the program-size\ncomplexity, also known as tile complexity, of a shape is the minimum number of\nunique tile types required to uniquely self-assemble it). Moreover, our\nconstruction is \"just barely\" 3D in the sense that it works even when the\nplacement of tiles is restricted to the $z = 0$ and $z = 1$ planes. This result\naffirmatively answers an open question from Cook, Fu, Schweller (SODA 2011). To\nachieve this result, we develop a general 3D temperature 1 optimal encoding\nconstruction, reminiscent of the 2D temperature 2 optimal encoding construction\nof Soloveichik and Winfree (SICOMP 2007), and perhaps of independent interest.\n", "versions": [{"version": "v1", "created": "Wed, 5 Nov 2014 00:59:20 GMT"}], "update_date": "2014-11-06", "authors_parsed": [["Furcy", "David", ""], ["Micka", "Samuel", ""], ["Summers", "Scott M.", ""]]}, {"id": "1411.1398", "submitter": "Nicholas Haynes", "authors": "Nicholas D. Haynes and Miguel C. Soriano and David P. Rosin and Ingo\n  Fischer and Daniel J. Gauthier", "title": "Reservoir computing with a single time-delay autonomous Boolean node", "comments": "5 pages, 5 figures", "journal-ref": "Physical Review E 91, 020801(R)(1-5) (2015)", "doi": "10.1103/PhysRevE.91.020801", "report-no": null, "categories": "cs.ET nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate reservoir computing with a physical system using a single\nautonomous Boolean logic element with time-delay feedback. The system generates\na chaotic transient with a window of consistency lasting between 30 and 300 ns,\nwhich we show is sufficient for reservoir computing. We then characterize the\ndependence of computational performance on system parameters to find the best\noperating point of the reservoir. When the best parameters are chosen, the\nreservoir is able to classify short input patterns with performance that\ndecreases over time. In particular, we show that four distinct input patterns\ncan be classified for 70 ns, even though the inputs are only provided to the\nreservoir for 7.5 ns.\n", "versions": [{"version": "v1", "created": "Tue, 4 Nov 2014 22:24:30 GMT"}, {"version": "v2", "created": "Fri, 30 Jan 2015 16:34:55 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Haynes", "Nicholas D.", ""], ["Soriano", "Miguel C.", ""], ["Rosin", "David P.", ""], ["Fischer", "Ingo", ""], ["Gauthier", "Daniel J.", ""]]}, {"id": "1411.1401", "submitter": "Frank Hoppensteadt", "authors": "Frank Hoppensteadt", "title": "Spin Wave Neuroanalog of von Neumann's Microwave Computer", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Frequency and phase of neural activity play important roles in the behaving\nbrain. The emerging understanding of these roles has been informed by the\ndesign of analog devices that have been important to neuroscience, among them\nthe neuroanalog computer developed by O. Schmitt in the 1930's. In the 1950's,\nJ. von Neumann, in a search for high performance computing using microwaves,\ninvented a logic machine based on similar devices, that can perform logic\nfunctions including binary arithmetic. Described here is a novel embodiment of\nhis machine using nano-magnetics. The embodiment is based on properties of\nferromagnetic thin films that are governed by a nonlinear Schrodinger equation\nfor magnetization in a film. Electrical currents through point contacts on a\nfilm create spin torque nano oscillators (STNO) that define the oscillator\nelements of the system. These oscillators may communicate through directed\ngraphs of electrical connections or by radiation in the form of spin waves. It\nis shown here how to construct a logic machine using STNO, that this machine\ncan perform several computations simultaneously using multiplexing of inputs,\nthat this system can evaluate iterated logic functions, and that spin waves can\ncommunicate frequency, phase and binary information. Neural tissue and the\nSchmitt, von Neumann and STNO devices share a common bifurcation structure,\nalthough these systems operate on vastly different space and time scales. This\nsuggests that neural circuits may be capable of computational functionality\ndescribed here.\n", "versions": [{"version": "v1", "created": "Wed, 5 Nov 2014 15:21:30 GMT"}], "update_date": "2014-11-07", "authors_parsed": [["Hoppensteadt", "Frank", ""]]}, {"id": "1411.2356", "submitter": "Thim Strothmann", "authors": "Zahra Derakhshandeh, Robert Gmyr, Andrea W. Richa, Christian\n  Scheideler, Thim Strothmann, Shimrit Tzur-David", "title": "Infinite Object Coating in the Amoebot Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The term programmable matter refers to matter which has the ability to change\nits physical properties (shape, density, moduli, conductivity, optical\nproperties, etc.) in a programmable fashion, based upon user input or\nautonomous sensing. This has many applications like smart materials, autonomous\nmonitoring and repair, and minimal invasive surgery. While programmable matter\nmight have been considered pure science fiction more than two decades ago, in\nrecent years a large amount of research has been conducted in this field. Often\nprogrammable matter is envisioned as a very large number of small locally\ninteracting computational particles. We propose the Amoebot model, a new model\nwhich builds upon this vision of programmable matter. Inspired by the behavior\nof amoeba, the Amoebot model offers a versatile framework to model\nself-organizing particles and facilitates rigorous algorithmic research in the\narea of programmable matter. We present an algorithm for the problem of coating\nan infinite object under this model, and prove the correctness of the algorithm\nand that it is work-optimal.\n", "versions": [{"version": "v1", "created": "Mon, 10 Nov 2014 09:12:15 GMT"}], "update_date": "2014-11-11", "authors_parsed": [["Derakhshandeh", "Zahra", ""], ["Gmyr", "Robert", ""], ["Richa", "Andrea W.", ""], ["Scheideler", "Christian", ""], ["Strothmann", "Thim", ""], ["Tzur-David", "Shimrit", ""]]}, {"id": "1411.2443", "submitter": "Bo-Kai Hsu", "authors": "Bo-Kai Hsu, Chia-Han Lee, and Ping-Cheng Yeh", "title": "On Timing Synchronization for Quantity-based Modulation in Additive\n  Inverse Gaussian Channel with Drift", "comments": "8 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Diffusion-based Molecular Communications, the channel between Transmitter\nNano-machine (TN) and Receiver Nano-machine (RN) can be modeled by Additive\nInverse Gaussian Channel, that is the first hitting time of messenger molecule\nreleased from TN and captured by RN follows Inverse Gaussian distribution. In\nthis channel, a quantity-based modulation embedding message on the different\nquantity levels of messenger molecules relies on a time-slotted system between\nTN and RN. Accordingly, their clocks need to synchronize with each other. In\nthis paper, we discuss the approaches to make RN estimate its timing offset\nbetween TN efficiently by the arrival times of molecules. We propose many\nmethods such as Maximum Likelihood Estimation (MLE), Unbiased Linear Estimation\n(ULE), Iterative ULE, and Decision Feedback (DF). The numerical results shows\nthe comparison of them. We evaluate these methods by not only the Mean Square\nError, but also the computational complexity.\n", "versions": [{"version": "v1", "created": "Mon, 10 Nov 2014 14:48:36 GMT"}], "update_date": "2014-11-11", "authors_parsed": [["Hsu", "Bo-Kai", ""], ["Lee", "Chia-Han", ""], ["Yeh", "Ping-Cheng", ""]]}, {"id": "1411.2890", "submitter": "Mahmood Mohassel Feghhi", "authors": "Mahmood Mohassel Feghhi, Aliazam Abbasfar, Mahtab Mirmohseni", "title": "Performance Analysis for Energy Harvesting Communication Protocols with\n  Fixed Rate Transmission", "comments": "29 pages, 12 figures, Accepted for publication in IET Communications,\n  August 2014", "journal-ref": "IET Communications, Vol. 8, No. 18, Dec. 2014, Pages 3259-3270", "doi": "10.1049/iet-com.2014.0281", "report-no": null, "categories": "cs.IT cs.ET cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy Harvesting (EH) has emerged as a promising technique for Green\nCommunications and it is a novel technique to prolong the lifetime of the\nwireless networks with replenishable nodes. In this paper, we consider the\nenergy shortage analysis of fixed rate transmission in communication systems\nwith energy harvesting nodes. First, we study the finite-horizon transmission\nand provide the general formula for the energy shortage probability. We also\ngive some examples as benchmarks. Then, we continue to derive a closed-form\nexpression for infinite-horizon transmission, which is a lower bound for the\nenergy shortage probability of any finite-horizon transmission. These results\nare proposed for both Additive White Gaussian Noise (AWGN) and fading channels.\nMoreover, we show that even under \\emph{random energy arrival}, one can\ntransmit at a fixed rate equal to capacity in the AWGN channels with negligible\naggregate shortage time. We achieve this result using our practical\ntransmission schemes, proposed for finite-horizon. Also, comprehensive\nnumerical simulations are performed in AWGN and fading channels with no Channel\nState Information (CSI) available at the transmitter, which corroborate our\ntheoretical findings. Furthermore, we improve the performance of our\ntransmission schemes in the fading channel with no CSI at the transmitter by\noptimizing the transmission initiation threshold.\n", "versions": [{"version": "v1", "created": "Tue, 11 Nov 2014 17:14:24 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Feghhi", "Mahmood Mohassel", ""], ["Abbasfar", "Aliazam", ""], ["Mirmohseni", "Mahtab", ""]]}, {"id": "1411.3049", "submitter": "Md. Humaun Kabir Dr.", "authors": "Md. Humaun Kabir and Kyung Sup Kwak", "title": "Enhanced Modulation Technique for Molecular Communication: OOMoSK", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.ET math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular communication in nanonetworks is an emerging communication paradigm\nwhere molecules are used as information carriers. Concentration Shift Keying\n(CSK) and Molecule Shift Keying (MoSK) are being studied extensively for the\nshort and medium range molecular nanonetworks. It is observed that MoSK\noutperforms CSK. However, MoSK requires different types of molecules for\nencoding which render transmitter and receiver complexities. We propose a\nmodulation scheme called On-Off MoSK (OOMoSK) in which, molecules are released\nfor information bit 1 and no molecule is released for 0. The proposed scheme\nenjoys reduced number of the types of molecules for encoding. Numerical results\nshow that the proposed scheme enhances channel capacity and Symbol Error Rate\n(SER).\n", "versions": [{"version": "v1", "created": "Wed, 12 Nov 2014 02:24:36 GMT"}], "update_date": "2014-11-13", "authors_parsed": [["Kabir", "Md. Humaun", ""], ["Kwak", "Kyung Sup", ""]]}, {"id": "1411.3716", "submitter": "Mahmood Mohassel Feghhi", "authors": "Mahmood Mohassel Feghhi, Mahtab Mirmohseni, Aliazam Abbasfar", "title": "Power Allocation in the Energy Harvesting Full-Duplex Gaussian Relay\n  Channels", "comments": "Accepted for publication in International Journal of Communication\n  Systems (Special Issue on Energy Efficient Wireless Communication Networks\n  with QoS), October 2014", "journal-ref": "International Journal of Communication Systems, Vol. 30, No. 2,\n  Jan 2017", "doi": "10.1002/dac.2903", "report-no": null, "categories": "cs.NI cs.ET cs.IT math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a general model to study the full-duplex\nnon-coherent decode-and-forward Gaussian relay channel with energy harvesting\n(EH) nodes, called NC-EH-$\\mathcal{RC}$, in three cases: $i)$ no energy\ntransfer (ET), $ii)$ one-way ET from the source (S) to the relay (R), and\n$iii)$ two-way ET. We consider the problem of optimal power allocation in\nNC-EH-$\\mathcal{RC}$ in order to maximize the total transmitted bits from S to\nthe destination in a given time duration. General stochastic energy arrivals at\nS and R with known EH times and values are assumed. In NC-EH-$\\mathcal{RC}$\nwith no ET, the complicated min-max optimization form along with its\nconstraints make the problem intractable. It is shown that this problem can be\ntransformed to a solvable convex form; however, convex optimization solution\ndoes not provide the structural properties of the optimal solution. Therefore,\nfollowing an alternative perspective, we investigate conditions on harvesting\nprocess of S and R where we find optimal algorithmic solution. Further, we\npropose some suboptimal algorithms and provide some examples, in which the\nalgorithms are optimal. Moreover, we find a class of problems for\nNC-EH-$\\mathcal{RC}$ with one-way ET from S to R, where the optimal algorithmic\nsolution is devised. For NC-EH-$\\mathcal{RC}$ with two-way ET, we propose\n\\emph{general} optimal algorithmic solution. Furthermore, the performance of\nthe proposed algorithms are evaluated numerically and compared with optimal\nnumerical convex optimization tools.\n", "versions": [{"version": "v1", "created": "Fri, 14 Nov 2014 08:17:31 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Feghhi", "Mahmood Mohassel", ""], ["Mirmohseni", "Mahtab", ""], ["Abbasfar", "Aliazam", ""]]}, {"id": "1411.4179", "submitter": "Sieu Ha", "authors": "Sieu D. Ha, Jian Shi, Yasmine Meroz, L. Mahadevan, and Shriram\n  Ramanathan", "title": "Neuromimetic Circuits with Synaptic Devices based on Strongly Correlated\n  Electron Systems", "comments": null, "journal-ref": "Phys. Rev. Applied 2, 064003 (2014)", "doi": "10.1103/PhysRevApplied.2.064003", "report-no": null, "categories": "cond-mat.str-el cs.ET q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strongly correlated electron systems such as the rare-earth nickelates\n(RNiO3, R = rare-earth element) can exhibit synapse-like continuous long term\npotentiation and depression when gated with ionic liquids; exploiting the\nextreme sensitivity of coupled charge, spin, orbital, and lattice degrees of\nfreedom to stoichiometry. We present experimental real-time, device-level\nclassical conditioning and unlearning using nickelate-based synaptic devices in\nan electronic circuit compatible with both excitatory and inhibitory neurons.\nWe establish a physical model for the device behavior based on electric-field\ndriven coupled ionic-electronic diffusion that can be utilized for design of\nmore complex systems. We use the model to simulate a variety of associate and\nnon-associative learning mechanisms, as well as a feedforward recurrent network\nfor storing memory. Our circuit intuitively parallels biological neural\narchitectures, and it can be readily generalized to other forms of cellular\nlearning and extinction. The simulation of neural function with electronic\ndevice analogues may provide insight into biological processes such as decision\nmaking, learning and adaptation, while facilitating advanced parallel\ninformation processing in hardware.\n", "versions": [{"version": "v1", "created": "Sat, 15 Nov 2014 20:05:10 GMT"}], "update_date": "2014-12-09", "authors_parsed": [["Ha", "Sieu D.", ""], ["Shi", "Jian", ""], ["Meroz", "Yasmine", ""], ["Mahadevan", "L.", ""], ["Ramanathan", "Shriram", ""]]}, {"id": "1411.4214", "submitter": "Monowar Hasan", "authors": "Monowar Hasan, Ekram Hossain, Sasitharan Balasubramaniam, and Yevgeni\n  Koucheryavy", "title": "Social Behavior in Bacterial Nanonetworks: Challenges and Opportunities", "comments": "Accepted for publication in IEEE Network Magazine as an open call\n  article", "journal-ref": null, "doi": "10.1109/MNET.2015.7018200", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular communication promises to enable communication between nanomachines\nwith a view to increasing their functionalities and open up new possible\napplications. Due to some of the biological properties, bacteria have been\nproposed as a possible information carrier for molecular communication, and the\ncorresponding communication networks are known as \\textit{bacterial\nnanonetworks}. The biological properties include the ability for bacteria to\nmobilize between locations and carry the information encoded in\nDeoxyribonucleic Acid (DNA) molecules. However, similar to most organisms,\nbacteria have complex social properties that govern their colony. These social\ncharacteristics enable the bacteria to evolve through various fluctuating\nenvironmental conditions by utilizing cooperative and non-cooperative\nbehaviors. This article provides an overview of the different types of\ncooperative and non-cooperative social behavior of bacteria. The challenges\n(due to non-cooperation) and the opportunities (due to cooperation) these\nbehaviors can bring to the reliability of communication in bacterial\nnanonetworks are also discussed. Finally, simulation results on the impact of\nbacterial cooperative social behavior on the end-to-end reliability of a\nsingle-link bacterial nanonetwork are presented. The article concludes with\nhighlighting the potential future research opportunities in this emerging\nfield.\n", "versions": [{"version": "v1", "created": "Sun, 16 Nov 2014 04:44:25 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Hasan", "Monowar", ""], ["Hossain", "Ekram", ""], ["Balasubramaniam", "Sasitharan", ""], ["Koucheryavy", "Yevgeni", ""]]}, {"id": "1411.4798", "submitter": "Fabio Lorenzo Traversa Ph.D.", "authors": "Fabio L. Traversa, Chiara Ramella, Fabrizio Bonani, Massimiliano Di\n  Ventra", "title": "Memcomputing NP-complete problems in polynomial time using polynomial\n  resources and collective states", "comments": "We have corrected minor typos and improved the presentation", "journal-ref": "Science Advances, Vol. 1, no. 6, pag e1500031, year 2015", "doi": "10.1126/sciadv.1500031", "report-no": null, "categories": "cs.ET cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Memcomputing is a novel non-Turing paradigm of computation that uses\ninteracting memory cells (memprocessors for short) to store and process\ninformation on the same physical platform. It was recently proved\nmathematically that memcomputing machines have the same computational power of\nnon-deterministic Turing machines. Therefore, they can solve NP-complete\nproblems in polynomial time and, using the appropriate architecture, with\nresources that only grow polynomially with the input size. The reason for this\ncomputational power stems from properties inspired by the brain and shared by\nany universal memcomputing machine, in particular intrinsic parallelism and\ninformation overhead, namely the capability of compressing information in the\ncollective state of the memprocessor network. Here, we show an experimental\ndemonstration of an actual memcomputing architecture that solves the\nNP-complete version of the subset-sum problem in only one step and is composed\nof a number of memprocessors that scales linearly with the size of the problem.\nWe have fabricated this architecture using standard microelectronic technology\nso that it can be easily realized in any laboratory setting. Even though the\nparticular machine presented here is eventually limited by noise--and will thus\nrequire error-correcting codes to scale to an arbitrary number of\nmemprocessors--it represents the first proof-of-concept of a machine capable of\nworking with the collective state of interacting memory cells, unlike the\npresent-day single-state machines built using the von Neumann architecture.\n", "versions": [{"version": "v1", "created": "Tue, 18 Nov 2014 10:35:17 GMT"}, {"version": "v2", "created": "Wed, 3 Dec 2014 11:30:43 GMT"}, {"version": "v3", "created": "Tue, 7 Jul 2015 22:41:52 GMT"}], "update_date": "2015-07-09", "authors_parsed": [["Traversa", "Fabio L.", ""], ["Ramella", "Chiara", ""], ["Bonani", "Fabrizio", ""], ["Di Ventra", "Massimiliano", ""]]}, {"id": "1411.5224", "submitter": "Dorian Aur", "authors": "Dorian Aur", "title": "Can we build a conscious machine?", "comments": "15 pages, 2 figures", "journal-ref": null, "doi": "10.13140/2.1.2286.5608", "report-no": null, "categories": "cs.ET cs.AI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The underlying physiological mechanisms of generating conscious states are\nstill unknown. To make progress on the problem of consciousness, we will need\nto experimentally design a system that evolves in a similar way our brains do.\nRecent experimental data show that the multiscale nature of the evolving human\nbrain can be implemented by reprogramming human cells. A hybrid system can be\ndesigned to include an evolving brain equipped with digital computers that\nmaintain homeostasis and provide the right amount of nutrients and oxygen for\nthe brain growth. Shaping the structure of the evolving brain will be\nprogressively achieved by controlling spatial organization of various types of\ncells. Following a specific program, the evolving brain can be trained using\nsubstitutional reality to learn and experience live scenes. We already know\nfrom neuroelectrodynamics that meaningful information in the brain is\nelectrically (wirelessly) read out and written fast in neurons and synapses at\nthe molecular (protein) level during the generation of action potentials and\nsynaptic activities. Since with training, meaningful information accumulates\nand is electrically integrated in the brain, one can predict, that this gradual\nprocess of training will trigger a tipping point for conscious experience to\nemerge in the hybrid system.\n", "versions": [{"version": "v1", "created": "Mon, 17 Nov 2014 23:12:25 GMT"}], "update_date": "2014-11-20", "authors_parsed": [["Aur", "Dorian", ""]]}, {"id": "1411.5255", "submitter": "Alex James Dr", "authors": "Alex Pappachen James, Dinesh S. Kumar, Arun Ajayan", "title": "Threshold Logic Computing: Memristive-CMOS Circuits for Fast Fourier\n  Transform and Vedic Multiplication", "comments": "5 Pages, IEEE Transactions on Very Large Scale Integration (VLSI)\n  Systems, 2014", "journal-ref": null, "doi": "10.1109/TVLSI.2014.2371857", "report-no": null, "categories": "cs.ET cs.AR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Brain inspired circuits can provide an alternative solution to implement\ncomputing architectures taking advantage of fault tolerance and generalisation\nability of logic gates. In this brief, we advance over the memristive threshold\ncircuit configuration consisting of memristive averaging circuit in combination\nwith operational amplifier and/or CMOS inverters in application to realizing\ncomplex computing circuits. The developed memristive threshold logic gates are\nused for designing FFT and multiplication circuits useful for modern\nmicroprocessors. Overall, the proposed threshold logic outperforms previous\nmemristive-CMOS logic cells on every aspect, however, indicate a lower chip\narea, lower THD, and controllable leakage power, but a higher power dissipation\nwith respect to CMOS logic.\n", "versions": [{"version": "v1", "created": "Wed, 19 Nov 2014 15:36:23 GMT"}], "update_date": "2014-11-20", "authors_parsed": [["James", "Alex Pappachen", ""], ["Kumar", "Dinesh S.", ""], ["Ajayan", "Arun", ""]]}, {"id": "1411.5458", "submitter": "Subhrajit Roy", "authors": "Subhrajit Roy, Amitava Banerjee and Arindam Basu", "title": "Liquid State Machine with Dendritically Enhanced Readout for Low-power,\n  Neuromorphic VLSI Implementations", "comments": "14 pages, 19 figures, Journal", "journal-ref": "IEEE Transactions on Biomedical Circuits and Systems, vol.8, no.5,\n  pp.681,695, Oct. 2014", "doi": "10.1109/TBCAS.2014.2362969", "report-no": null, "categories": "cs.ET cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we describe a new neuro-inspired, hardware-friendly readout\nstage for the liquid state machine (LSM), a popular model for reservoir\ncomputing. Compared to the parallel perceptron architecture trained by the\np-delta algorithm, which is the state of the art in terms of performance of\nreadout stages, our readout architecture and learning algorithm can attain\nbetter performance with significantly less synaptic resources making it\nattractive for VLSI implementation. Inspired by the nonlinear properties of\ndendrites in biological neurons, our readout stage incorporates neurons having\nmultiple dendrites with a lumped nonlinearity. The number of synaptic\nconnections on each branch is significantly lower than the total number of\nconnections from the liquid neurons and the learning algorithm tries to find\nthe best 'combination' of input connections on each branch to reduce the error.\nHence, the learning involves network rewiring (NRW) of the readout network\nsimilar to structural plasticity observed in its biological counterparts. We\nshow that compared to a single perceptron using analog weights, this\narchitecture for the readout can attain, even by using the same number of\nbinary valued synapses, up to 3.3 times less error for a two-class spike train\nclassification problem and 2.4 times less error for an input rate approximation\ntask. Even with 60 times larger synapses, a group of 60 parallel perceptrons\ncannot attain the performance of the proposed dendritically enhanced readout.\nAn additional advantage of this method for hardware implementations is that the\n'choice' of connectivity can be easily implemented exploiting address event\nrepresentation (AER) protocols commonly used in current neuromorphic systems\nwhere the connection matrix is stored in memory. Also, due to the use of binary\nsynapses, our proposed method is more robust against statistical variations.\n", "versions": [{"version": "v1", "created": "Thu, 20 Nov 2014 07:05:28 GMT"}], "update_date": "2014-11-21", "authors_parsed": [["Roy", "Subhrajit", ""], ["Banerjee", "Amitava", ""], ["Basu", "Arindam", ""]]}, {"id": "1411.6372", "submitter": "Huseyin Birkan Yilmaz", "authors": "Ali Akkaya and H. Birkan Yilmaz and Chan-Byoung Chae and Tuna Tugcu", "title": "Effect of Receptor Density and Size on Signal Reception in Molecular\n  Communication via Diffusion with an Absorbing Receiver", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of molecular communication is significantly impacted by the\nreception process of the messenger molecules. The receptors' size and density,\nhowever, have yet to be investigated. In this letter, we analyze the effect of\nreceptor density and size on the signal reception of an absorbing receiver with\nreceptors. The results show that, when the total receptor area is the same,\nbetter hitting probability is achieved by using a higher number of relatively\nsmall receptors. In addition, deploying receptors, which cover a small\npercentage of the receiver surface, is able to create an effective\ncommunication channel that has a detectable signal level.\n", "versions": [{"version": "v1", "created": "Mon, 24 Nov 2014 07:49:55 GMT"}, {"version": "v2", "created": "Tue, 25 Nov 2014 04:17:11 GMT"}], "update_date": "2014-11-26", "authors_parsed": [["Akkaya", "Ali", ""], ["Yilmaz", "H. Birkan", ""], ["Chae", "Chan-Byoung", ""], ["Tugcu", "Tuna", ""]]}, {"id": "1411.6831", "submitter": "James Whiting", "authors": "James G.H. Whiting, Ben P.J. de Lacy Costello, Andrew Adamatzky", "title": "Physarum Chip: Developments in growing computers from slime mould", "comments": "Conference abstract presented at the Unconventional Computation &\n  Natural Computation 2014. University of Western Ontario, London, Ontario,\n  Canada, July 14-18. 2 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Phychip project is a collaborative European research initiative to design\nand implement computation using the organism Physarum polycephalum; it is\nfunded by the Seventh Framework Programme (FP7) by the European Commission\nwithin CORDIS and the FET Proactive scheme. Included in this presentation are\ndetails the development of a Physarum based biosensor and biological logic\ngate, offering significant advancements in the respective fields. The work\ndemonstrates the first steps towards Physarum computation and practical\nPhysarum Biosensor; subsequent work will focus on development of a hybrid\nelectronic-Physarum device capable of implementing computation.\n", "versions": [{"version": "v1", "created": "Tue, 25 Nov 2014 12:19:55 GMT"}], "update_date": "2014-11-26", "authors_parsed": [["Whiting", "James G. H.", ""], ["Costello", "Ben P. J. de Lacy", ""], ["Adamatzky", "Andrew", ""]]}]