[{"id": "2106.11031", "submitter": "John Grundy", "authors": "John C. Grundy", "title": "A Graduate Course on E-commerce Information Systems Engineering", "comments": "Preprint to appear in", "journal-ref": "Journal of Informatics Education and Research, IAIM Press, Vol. 2,\n  No. 2. 2000", "doi": null, "report-no": null, "categories": "cs.CY cs.GL", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Interest in developing and deploying E-commerce systems has grown greatly\nover the past few years, leading to a major shortage of qualified developers.\nThis paper describes the development of a graduate course in E-commerce\neducation that has been implemented as part of an Honours degree programme and\na first year Masters offering for a traditional Information Systems programme.\nThe aim of this course is to give graduate students a broad grounding and\nholistic set of skills to enable them to begin successful E-commerce systems\ndevelopment. This paper provides a background and context for this course, an\noverview and discussion of the course content, delivery methods and practical\nfocus, and discusses experience in running and evolving the course over the\npast two years. We hope that our experiences and approaches will be useful for\nothers who are planning similar courses focusing on E-commerce systems\nengineering.\n", "versions": [{"version": "v1", "created": "Thu, 3 Jun 2021 23:05:22 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Grundy", "John C.", ""]]}, {"id": "2106.12739", "submitter": "Zhiheng Zhong", "authors": "Zhiheng Zhong, Minxian Xu, Maria Alejandra Rodriguez, Chengzhong Xu,\n  and Rajkumar Buyya", "title": "Machine Learning-based Orchestration of Containers: A Taxonomy and\n  Future Directions", "comments": "33 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.DC cs.GL", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Containerization is a lightweight application virtualization technology,\nproviding high environmental consistency, operating system distribution\nportability, and resource isolation. Existing mainstream cloud service\nproviders have prevalently adopted container technologies in their distributed\nsystem infrastructures for automated application management. To handle the\nautomation of deployment, maintenance, autoscaling, and networking of\ncontainerized applications, container orchestration is proposed as an essential\nresearch problem. However, the highly dynamic and diverse feature of cloud\nworkloads and environments considerably raises the complexity of orchestration\nmechanisms. Machine learning algorithms are accordingly employed by container\norchestration systems for behavior modelling and prediction of\nmulti-dimensional performance metrics. Such insights could further improve the\nquality of resource provisioning decisions in response to the changing\nworkloads under complex environments. In this paper, we present a comprehensive\nliterature review of existing machine learning-based container orchestration\napproaches. Detailed taxonomies are proposed to classify the current researches\nby their common features. Moreover, the evolution of machine learning-based\ncontainer orchestration technologies from the year 2016 to 2021 has been\ndesigned based on objectives and metrics. A comparative analysis of the\nreviewed techniques is conducted according to the proposed taxonomies, with\nemphasis on their key characteristics. Finally, various open research\nchallenges and potential future directions are highlighted.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2021 02:55:35 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Zhong", "Zhiheng", ""], ["Xu", "Minxian", ""], ["Rodriguez", "Maria Alejandra", ""], ["Xu", "Chengzhong", ""], ["Buyya", "Rajkumar", ""]]}]