[{"id": "0801.0102", "submitter": "Michael Baer", "authors": "Michael B. Baer", "title": "Reserved-Length Prefix Coding", "comments": "5 pages, submitted to ISIT 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DS math.IT", "license": null, "abstract": "  Huffman coding finds an optimal prefix code for a given probability mass\nfunction. Consider situations in which one wishes to find an optimal code with\nthe restriction that all codewords have lengths that lie in a user-specified\nset of lengths (or, equivalently, no codewords have lengths that lie in a\ncomplementary set). This paper introduces a polynomial-time dynamic programming\nalgorithm that finds optimal codes for this reserved-length prefix coding\nproblem. This has applications to quickly encoding and decoding lossless codes.\nIn addition, one modification of the approach solves any quasiarithmetic prefix\ncoding problem, while another finds optimal codes restricted to the set of\ncodes with g codeword lengths for user-specified g (e.g., g=2).\n", "versions": [{"version": "v1", "created": "Sun, 30 Dec 2007 00:14:24 GMT"}], "update_date": "2008-01-03", "authors_parsed": [["Baer", "Michael B.", ""]]}, {"id": "0801.0590", "submitter": "Kettani Omar", "authors": "Omar Kettani", "title": "An algorithm for finding the Independence Number of a graph", "comments": "15 pages; a corrected proof for the second method is added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS", "license": null, "abstract": "  In this paper, we prove that for every connected graph G, there exists a\nsplit graph H with the same independence number and the same order. Then we\npropose a first algorithm for finding this graph, given the degree sequence of\nthe input graph G. Further, we propose a second algorithm for finding the\nindependence number of G, given the adjacency matrix of G.\n", "versions": [{"version": "v1", "created": "Thu, 3 Jan 2008 20:51:38 GMT"}, {"version": "v2", "created": "Fri, 4 Jan 2008 16:00:32 GMT"}, {"version": "v3", "created": "Sun, 6 Jan 2008 20:50:20 GMT"}, {"version": "v4", "created": "Wed, 9 Jan 2008 13:51:59 GMT"}], "update_date": "2008-01-09", "authors_parsed": [["Kettani", "Omar", ""]]}, {"id": "0801.1300", "submitter": "Igor Razgon", "authors": "Igor Razgon and Barry O'Sullivan", "title": "Almost 2-SAT is Fixed-Parameter Tractable", "comments": "This new version fixes the bug found by Somnath Sikdar in the proof\n  of Claim 8. In the repaired version the modification of the Almost 2-SAT\n  problem called 2-SLASAT is no longer needed and only the modification called\n  2-ASLASAT remains relevant. Hence the whole manuscript is updated so that the\n  2-SLASAT problem is not mentioned there anymore", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CG cs.LO", "license": null, "abstract": "  We consider the following problem. Given a 2-CNF formula, is it possible to\nremove at most $k$ clauses so that the resulting 2-CNF formula is satisfiable?\nThis problem is known to different research communities in Theoretical Computer\nScience under the names 'Almost 2-SAT', 'All-but-$k$ 2-SAT', '2-CNF deletion',\n'2-SAT deletion'. The status of fixed-parameter tractability of this problem is\na long-standing open question in the area of Parameterized Complexity. We\nresolve this open question by proposing an algorithm which solves this problem\nin $O(15^k*k*m^3)$ and thus we show that this problem is fixed-parameter\ntractable.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2008 19:04:14 GMT"}, {"version": "v2", "created": "Wed, 9 Jan 2008 19:24:05 GMT"}, {"version": "v3", "created": "Mon, 18 Feb 2008 15:14:49 GMT"}, {"version": "v4", "created": "Fri, 18 Apr 2008 14:07:04 GMT"}], "update_date": "2008-04-18", "authors_parsed": [["Razgon", "Igor", ""], ["O'Sullivan", "Barry", ""]]}, {"id": "0801.1416", "submitter": "Piyush Kurur", "authors": "Anindya De, Piyush P Kurur, Chandan Saha and Ramprasad Saptharishi", "title": "Fast Integer Multiplication using Modular Arithmetic", "comments": "fixed some typos and references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give an $O(N\\cdot \\log N\\cdot 2^{O(\\log^*N)})$ algorithm for multiplying\ntwo $N$-bit integers that improves the $O(N\\cdot \\log N\\cdot \\log\\log N)$\nalgorithm by Sch\\\"{o}nhage-Strassen. Both these algorithms use modular\narithmetic. Recently, F\\\"{u}rer gave an $O(N\\cdot \\log N\\cdot 2^{O(\\log^*N)})$\nalgorithm which however uses arithmetic over complex numbers as opposed to\nmodular arithmetic. In this paper, we use multivariate polynomial\nmultiplication along with ideas from F\\\"{u}rer's algorithm to achieve this\nimprovement in the modular setting. Our algorithm can also be viewed as a\n$p$-adic version of F\\\"{u}rer's algorithm. Thus, we show that the two seemingly\ndifferent approaches to integer multiplication, modular and complex arithmetic,\nare similar.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jan 2008 12:44:55 GMT"}, {"version": "v2", "created": "Tue, 6 May 2008 07:05:09 GMT"}, {"version": "v3", "created": "Fri, 19 Sep 2008 06:45:16 GMT"}], "update_date": "2008-09-19", "authors_parsed": [["De", "Anindya", ""], ["Kurur", "Piyush P", ""], ["Saha", "Chandan", ""], ["Saptharishi", "Ramprasad", ""]]}, {"id": "0801.1979", "submitter": "Gregory Gutin", "authors": "G. Gutin, I. Razgon, E.J. Kim", "title": "Minimum Leaf Out-branching and Related Problems", "comments": "The main change is a quadratic kernel derivation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a digraph $D$, the Minimum Leaf Out-Branching problem (MinLOB) is the\nproblem of finding in $D$ an out-branching with the minimum possible number of\nleaves, i.e., vertices of out-degree 0. We prove that MinLOB is polynomial-time\nsolvable for acyclic digraphs. In general, MinLOB is NP-hard and we consider\nthree parameterizations of MinLOB. We prove that two of them are NP-complete\nfor every value of the parameter, but the third one is fixed-parameter\ntractable (FPT). The FPT parametrization is as follows: given a digraph $D$ of\norder $n$ and a positive integral parameter $k$, check whether $D$ contains an\nout-branching with at most $n-k$ leaves (and find such an out-branching if it\nexists). We find a problem kernel of order $O(k^2)$ and construct an algorithm\nof running time $O(2^{O(k\\log k)}+n^6),$ which is an `additive' FPT algorithm.\nWe also consider transformations from two related problems, the minimum path\ncovering and the maximum internal out-tree problems into MinLOB, which imply\nthat some parameterizations of the two problems are FPT as well.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jan 2008 19:33:29 GMT"}, {"version": "v2", "created": "Mon, 28 Jan 2008 17:41:09 GMT"}, {"version": "v3", "created": "Tue, 14 Oct 2008 20:51:12 GMT"}], "update_date": "2008-10-14", "authors_parsed": [["Gutin", "G.", ""], ["Razgon", "I.", ""], ["Kim", "E. J.", ""]]}, {"id": "0801.1987", "submitter": "Neal E. Young", "authors": "Christos Koufogiannakis and Neal E. Young", "title": "A Nearly Linear-Time PTAS for Explicit Fractional Packing and Covering\n  Linear Programs", "comments": "corrected version of FOCS 2007 paper: 10.1109/FOCS.2007.62. Accepted\n  to Algorithmica, 2013", "journal-ref": "Algorithmica 70(4):648-674(2014)", "doi": "10.1007/s00453-013-9771-6", "report-no": null, "categories": "cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give an approximation algorithm for packing and covering linear programs\n(linear programs with non-negative coefficients). Given a constraint matrix\nwith n non-zeros, r rows, and c columns, the algorithm computes feasible primal\nand dual solutions whose costs are within a factor of 1+eps of the optimal cost\nin time O((r+c)log(n)/eps^2 + n).\n", "versions": [{"version": "v1", "created": "Sun, 13 Jan 2008 22:04:49 GMT"}, {"version": "v2", "created": "Wed, 13 Mar 2013 16:03:10 GMT"}], "update_date": "2015-06-02", "authors_parsed": [["Koufogiannakis", "Christos", ""], ["Young", "Neal E.", ""]]}, {"id": "0801.2284", "submitter": "Kettani Omar", "authors": "Omar Kettani", "title": "Le probleme de l'isomorphisme de graphes est dans P", "comments": "This paper has been withdrawn", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS", "license": null, "abstract": "  This paper has been withdrawn by the author, due to possible\ncounter-examples.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2008 13:06:41 GMT"}, {"version": "v2", "created": "Sat, 19 Jan 2008 13:58:28 GMT"}], "update_date": "2008-01-19", "authors_parsed": [["Kettani", "Omar", ""]]}, {"id": "0801.2378", "submitter": "Paolo Ferragina", "authors": "Paolo Ferragina", "title": "String algorithms and data structures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.IR", "license": null, "abstract": "  The string-matching field has grown at a such complicated stage that various\nissues come into play when studying it: data structure and algorithmic design,\ndatabase principles, compression techniques, architectural features, cache and\nprefetching policies. The expertise nowadays required to design good string\ndata structures and algorithms is therefore transversal to many computer\nscience fields and much more study on the orchestration of known, or novel,\ntechniques is needed to make progress in this fascinating topic. This survey is\naimed at illustrating the key ideas which should constitute, in our opinion,\nthe current background of every index designer. We also discuss the positive\nfeatures and drawback of known indexing schemes and algorithms, and devote much\nattention to detail research issues and open problems both on the theoretical\nand the experimental side.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2008 20:54:18 GMT"}], "update_date": "2008-01-16", "authors_parsed": [["Ferragina", "Paolo", ""]]}, {"id": "0801.2931", "submitter": "Jon Feldman", "authors": "Jon Feldman, S. Muthukrishnan, Evdokia Nikolova, Martin Pal", "title": "A Truthful Mechanism for Offline Ad Slot Scheduling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": null, "abstract": "  We consider the \"Offline Ad Slot Scheduling\" problem, where advertisers must\nbe scheduled to \"sponsored search\" slots during a given period of time.\nAdvertisers specify a budget constraint, as well as a maximum cost per click,\nand may not be assigned to more than one slot for a particular search.\n  We give a truthful mechanism under the utility model where bidders try to\nmaximize their clicks, subject to their personal constraints. In addition, we\nshow that the revenue-maximizing mechanism is not truthful, but has a Nash\nequilibrium whose outcome is identical to our mechanism. As far as we can tell,\nthis is the first treatment of sponsored search that directly incorporates both\nmultiple slots and budget constraints into an analysis of incentives.\n  Our mechanism employs a descending-price auction that maintains a solution to\na certain machine scheduling problem whose job lengths depend on the price, and\nhence is variable over the auction. The price stops when the set of bidders\nthat can afford that price pack exactly into a block of ad slots, at which\npoint the mechanism allocates that block and continues on the remaining slots.\nTo prove our result on the equilibrium of the revenue-maximizing mechanism, we\nfirst show that a greedy algorithm suffices to solve the revenue-maximizing\nlinear program; we then use this insight to prove that bidders allocated in the\nsame block of our mechanism have no incentive to deviate from bidding the fixed\nprice of that block.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2008 16:34:30 GMT"}], "update_date": "2008-01-21", "authors_parsed": [["Feldman", "Jon", ""], ["Muthukrishnan", "S.", ""], ["Nikolova", "Evdokia", ""], ["Pal", "Martin", ""]]}, {"id": "0801.3147", "submitter": "Ke Xu", "authors": "Liang Li, Xin Li, Tian Liu, Ke Xu", "title": "From k-SAT to k-CSP: Two Generalized Algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.AI cs.CC", "license": null, "abstract": "  Constraint satisfaction problems (CSPs) models many important intractable\nNP-hard problems such as propositional satisfiability problem (SAT). Algorithms\nwith non-trivial upper bounds on running time for restricted SAT with bounded\nclause length k (k-SAT) can be classified into three styles: DPLL-like,\nPPSZ-like and Local Search, with local search algorithms having already been\ngeneralized to CSP with bounded constraint arity k (k-CSP). We generalize a\nDPLL-like algorithm in its simplest form and a PPSZ-like algorithm from k-SAT\nto k-CSP. As far as we know, this is the first attempt to use PPSZ-like\nstrategy to solve k-CSP, and before little work has been focused on the\nDPLL-like or PPSZ-like strategies for k-CSP.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jan 2008 08:07:33 GMT"}], "update_date": "2008-01-22", "authors_parsed": [["Li", "Liang", ""], ["Li", "Xin", ""], ["Liu", "Tian", ""], ["Xu", "Ke", ""]]}, {"id": "0801.3581", "submitter": "Shay Solomon", "authors": "Yefim Dinitz, Michael Elkin, Shay Solomon", "title": "Shallow, Low, and Light Trees, and Tight Lower Bounds for Euclidean\n  Spanners", "comments": "41 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": null, "abstract": "  We show that for every $n$-point metric space $M$ there exists a spanning\ntree $T$ with unweighted diameter $O(\\log n)$ and weight $\\omega(T) = O(\\log n)\n\\cdot \\omega(MST(M))$. Moreover, there is a designated point $rt$ such that for\nevery point $v$, $dist_T(rt,v) \\le (1+\\epsilon) \\cdot dist_M(rt,v)$, for an\narbitrarily small constant $\\epsilon > 0$. We extend this result, and provide a\ntradeoff between unweighted diameter and weight, and prove that this tradeoff\nis \\emph{tight up to constant factors} in the entire range of parameters. These\nresults enable us to settle a long-standing open question in Computational\nGeometry. In STOC'95 Arya et al. devised a construction of Euclidean Spanners\nwith unweighted diameter $O(\\log n)$ and weight $O(\\log n) \\cdot\n\\omega(MST(M))$. Ten years later in SODA'05 Agarwal et al. showed that this\nresult is tight up to a factor of $O(\\log \\log n)$. We close this gap and show\nthat the result of Arya et al. is tight up to constant factors.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2008 13:57:00 GMT"}], "update_date": "2011-08-31", "authors_parsed": [["Dinitz", "Yefim", ""], ["Elkin", "Michael", ""], ["Solomon", "Shay", ""]]}, {"id": "0801.3710", "submitter": "Amitabh Trehan", "authors": "Jared Saia, Amitabh Trehan", "title": "Picking up the Pieces: Self-Healing in Reconfigurable Networks", "comments": "To be presented at IPDPS (IEEE International Parallel & Distributed\n  Processing Symposium) 2008", "journal-ref": null, "doi": "10.1109/IPDPS.2008.4536326", "report-no": null, "categories": "cs.DS cs.DC cs.NI", "license": null, "abstract": "  We consider the problem of self-healing in networks that are reconfigurable\nin the sense that they can change their topology during an attack. Our goal is\nto maintain connectivity in these networks, even in the presence of repeated\nadversarial node deletion, by carefully adding edges after each attack. We\npresent a new algorithm, DASH, that provably ensures that: 1) the network stays\nconnected even if an adversary deletes up to all nodes in the network; and 2)\nno node ever increases its degree by more than 2 log n, where n is the number\nof nodes initially in the network. DASH is fully distributed; adds new edges\nonly among neighbors of deleted nodes; and has average latency and bandwidth\ncosts that are at most logarithmic in n. DASH has these properties irrespective\nof the topology of the initial network, and is thus orthogonal and\ncomplementary to traditional topology-based approaches to defending against\nattack.\n  We also prove lower-bounds showing that DASH is asymptotically optimal in\nterms of minimizing maximum degree increase over multiple attacks. Finally, we\npresent empirical results on power-law graphs that show that DASH performs well\nin practice, and that it significantly outperforms naive algorithms in reducing\nmaximum degree increase. We also present empirical results on performance of\nour algorithms and a new heuristic with regard to stretch (increase in shortest\npath lengths).\n", "versions": [{"version": "v1", "created": "Thu, 24 Jan 2008 07:46:50 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Saia", "Jared", ""], ["Trehan", "Amitabh", ""]]}, {"id": "0801.4130", "submitter": "Klas Olof Daniel Andersson", "authors": "Daniel Andersson", "title": "Solving Min-Max Problems with Applications to Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": null, "abstract": "  We refine existing general network optimization techniques, give new\ncharacterizations for the class of problems to which they can be applied, and\nshow that they can also be used to solve various two-player games in almost\nlinear time. Among these is a new variant of the network interdiction problem,\nwhere the interdictor wants to destroy high-capacity paths from the source to\nthe destination using a vertex-wise limited budget of arc removals. We also\nshow that replacing the limit average in mean payoff games by the maximum\nweight results in a class of games amenable to these techniques.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jan 2008 13:28:43 GMT"}], "update_date": "2008-01-29", "authors_parsed": [["Andersson", "Daniel", ""]]}, {"id": "0801.4190", "submitter": "Sebastian Roch", "authors": "Constantinos Daskalakis, Elchanan Mossel, Sebastien Roch", "title": "Phylogenies without Branch Bounds: Contracting the Short, Pruning the\n  Deep", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DS math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new phylogenetic reconstruction algorithm which, unlike most\nprevious rigorous inference techniques, does not rely on assumptions regarding\nthe branch lengths or the depth of the tree. The algorithm returns a forest\nwhich is guaranteed to contain all edges that are: 1) sufficiently long and 2)\nsufficiently close to the leaves. How much of the true tree is recovered\ndepends on the sequence length provided. The algorithm is distance-based and\nruns in polynomial time.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2008 05:10:22 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2009 01:48:27 GMT"}], "update_date": "2011-09-30", "authors_parsed": [["Daskalakis", "Constantinos", ""], ["Mossel", "Elchanan", ""], ["Roch", "Sebastien", ""]]}, {"id": "0801.4238", "submitter": "Christoph Durr", "authors": "Marek Chrobak, Christoph Durr, Mathilde Hurand and Julien Robert", "title": "Algorithms for Temperature-Aware Task Scheduling in Microprocessor\n  Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS", "license": null, "abstract": "  We study scheduling problems motivated by recently developed techniques for\nmicroprocessor thermal management at the operating systems level. The general\nscenario can be described as follows. The microprocessor's temperature is\ncontrolled by the hardware thermal management system that continuously monitors\nthe chip temperature and automatically reduces the processor's speed as soon as\nthe thermal threshold is exceeded. Some tasks are more CPU-intensive than other\nand thus generate more heat during execution. The cooling system operates\nnon-stop, reducing (at an exponential rate) the deviation of the processor's\ntemperature from the ambient temperature. As a result, the processor's\ntemperature, and thus the performance as well, depends on the order of the task\nexecution. Given a variety of possible underlying architectures, models for\ncooling and for hardware thermal management, as well as types of tasks, this\nscenario gives rise to a plethora of interesting and never studied scheduling\nproblems.\n  We focus on scheduling real-time jobs in a simplified model for cooling and\nthermal management. A collection of unit-length jobs is given, each job\nspecified by its release time, deadline and heat contribution. If, at some time\nstep, the temperature of the system is t and the processor executes a job with\nheat contribution h, then the temperature at the next step is (t+h)/2. The\ntemperature cannot exceed the given thermal threshold T. The objective is to\nmaximize the throughput, that is, the number of tasks that meet their\ndeadlines. We prove that, in the offline case, computing the optimum schedule\nis NP-hard, even if all jobs are released at the same time. In the online case,\nwe show a 2-competitive deterministic algorithm and a matching lower bound.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2008 10:47:42 GMT"}], "update_date": "2008-01-29", "authors_parsed": [["Chrobak", "Marek", ""], ["Durr", "Christoph", ""], ["Hurand", "Mathilde", ""], ["Robert", "Julien", ""]]}, {"id": "0801.4851", "submitter": "Rajgopal Kannan", "authors": "Costas Busch and Rajgopal Kannan", "title": "Bicretieria Optimization in Routing Games", "comments": "15 pages, submitted to SPAA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": null, "abstract": "  Two important metrics for measuring the quality of routing paths are the\nmaximum edge congestion $C$ and maximum path length $D$. Here, we study\nbicriteria in routing games where each player $i$ selfishly selects a path that\nsimultaneously minimizes its maximum edge congestion $C_i$ and path length\n$D_i$. We study the stability and price of anarchy of two bicriteria games:\n  - {\\em Max games}, where the social cost is $\\max(C,D)$ and the player cost\nis $\\max(C_i, D_i)$. We prove that max games are stable and convergent under\nbest-response dynamics, and that the price of anarchy is bounded above by the\nmaximum path length in the players' strategy sets. We also show that this bound\nis tight in worst-case scenarios.\n  - {\\em Sum games}, where the social cost is $C+D$ and the player cost is\n$C_i+D_i$. For sum games, we first show the negative result that there are game\ninstances that have no Nash-equilibria. Therefore, we examine an approximate\ngame called the {\\em sum-bucket game} that is always convergent (and therefore\nstable). We show that the price of anarchy in sum-bucket games is bounded above\nby $C^* \\cdot D^* / (C^* + D^*)$ (with a poly-log factor), where $C^*$ and\n$D^*$ are the optimal coordinated congestion and path length. Thus, the\nsum-bucket game has typically superior price of anarchy bounds than the max\ngame. In fact, when either $C^*$ or $D^*$ is small (e.g. constant) the social\ncost of the Nash-equilibria is very close to the coordinated optimal $C^* +\nD^*$ (within a poly-log factor). We also show that the price of anarchy bound\nis tight for cases where both $C^*$ and $D^*$ are large.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2008 19:29:13 GMT"}], "update_date": "2008-02-01", "authors_parsed": [["Busch", "Costas", ""], ["Kannan", "Rajgopal", ""]]}]