[{"id": "1409.0749", "submitter": "Vikas Verma", "authors": "Vikas Verma", "title": "Image Retrieval And Classification Using Local Feature Vectors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Content Based Image Retrieval(CBIR) is one of the important subfield in the\nfield of Information Retrieval. The goal of a CBIR algorithm is to retrieve\nsemantically similar images in response to a query image submitted by the end\nuser. CBIR is a hard problem because of the phenomenon known as $\\textit\n{semantic gap}$.\n  In this thesis, we aim at analyzing the performance of a CBIR system build\nusing local feature vectors and Intermediate Matching Kernel. We also propose a\nTwo-Step Matching process for reducing the response time of the CBIR systems.\nFurther, we develop a Meta-Learning framework for improving the retrieval\nperformance of these systems. Our results show that the Two-Step Matching\nprocess significantly reduces response time and the Meta-Learning Framework\nimproves the retrieval performance by more than two fold. We also analyze the\nperformance of various image classification systems that use different image\nrepresentations constructed from the local feature vectors.\n", "versions": [{"version": "v1", "created": "Tue, 2 Sep 2014 15:17:33 GMT"}], "update_date": "2014-09-03", "authors_parsed": [["Verma", "Vikas", ""]]}, {"id": "1409.0915", "submitter": "H. Hernan Moraldo", "authors": "H. Hernan Moraldo", "title": "An Approach for Text Steganography Based on Markov Chains", "comments": "Presented at 41 JAIIO - WSegI 2012", "journal-ref": "41 JAIIO - WSegI 2012, ISSN: 2313-9110, pages 21 - 35", "doi": null, "report-no": null, "categories": "cs.MM cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A text steganography method based on Markov chains is introduced, together\nwith a reference implementation. This method allows for information hiding in\ntexts that are automatically generated following a given Markov model. Other\nMarkov - based systems of this kind rely on big simplifications of the language\nmodel to work, which produces less natural looking and more easily detectable\ntexts. The method described here is designed to generate texts within a good\napproximation of the original language model provided.\n", "versions": [{"version": "v1", "created": "Tue, 2 Sep 2014 22:59:52 GMT"}], "update_date": "2014-09-04", "authors_parsed": [["Moraldo", "H. Hernan", ""]]}, {"id": "1409.1064", "submitter": "Liane Gabora", "authors": "Liane Gabora", "title": "Physical Light as a Metaphor for Inner Light", "comments": "17 pages; In a special issue of Aisthesis\n  (http://www.fupress.net/index.php/aisthesis/index) on \"Giving form through\n  metaphors\"; seeking collaborators in computer graphics, visualization, and\n  optics for further development of these projects. arXiv admin note:\n  substantial text overlap with arXiv:1501.00029", "journal-ref": "Aisthesis, 7(2), 43-61 (2014)", "doi": "10.13128/Aisthesis-15289", "report-no": null, "categories": "q-bio.NC cs.CG cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The metaphor between physical light and inner light has a long history that\npermeates diverse languages and cultures. This paper outlines a system for\nusing basic principles from optics to visually represent psychological states\nand processes such as ideation, enlightenment, mindfulness, and fragmentation\nversus integrity, as well as situations that occur between people involving\nphenomena such as honest versus deceptive communication, and understanding\nversus misunderstanding. The paper summarizes two ongoing projects based on\nthis system: The Light and Enlightenment art installation project, and the\nSoultracker virtual reality project. These projects enable people to depict\ntheir inner lives and external worlds including situations and relationships\nwith others, both as they are and as they could be, and explore alternative\npaths for navigating challenges and living to their fullest potential. The\nprojects aim to be of clinical value as therapeutic tools, as well as of\npedagogical value by providing a concrete language for depicting aspects of\nhuman nature that can otherwise seem elusive and intangible.\n", "versions": [{"version": "v1", "created": "Wed, 3 Sep 2014 12:39:00 GMT"}, {"version": "v2", "created": "Mon, 15 Sep 2014 16:16:39 GMT"}, {"version": "v3", "created": "Thu, 22 Jan 2015 17:32:58 GMT"}], "update_date": "2015-01-23", "authors_parsed": [["Gabora", "Liane", ""]]}, {"id": "1409.1148", "submitter": "Hatem Abou-zeid", "authors": "Hatem Abou-zeid and Hosssam S. Hassenein", "title": "Toward Green Media Delivery: Location-Aware Opportunities and Approaches", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile media has undoubtedly become the predominant source of traffic in\nwireless networks. The result is not only congestion and poor\nQuality-of-Experience, but also an unprecedented energy drain at both the\nnetwork and user devices. In order to sustain this continued growth, novel\ndisruptive paradigms of media delivery are urgently needed. We envision that\ntwo key contemporary advancements can be leveraged to develop greener media\ndelivery platforms: 1) the proliferation of navigation hardware and software in\nmobile devices has created an era of location-awareness, where both the current\nand future user locations can be predicted; and 2) the rise of context-aware\nnetwork architectures and self-organizing functionalities is enabling context\nsignaling and in-network adaptation. With these developments in mind, this\narticle investigates the opportunities of exploiting location-awareness to\nenable green end-to-end media delivery. In particular, we discuss and propose\napproaches for location-based adaptive video quality planning, in-network\ncaching, content prefetching, and long-term radio resource management. To\nprovide insights on the energy savings, we then present a cross-layer framework\nthat jointly optimizes resource allocation and multi-user video quality using\nlocation predictions. Finally, we highlight some of the future research\ndirections for location-aware media delivery in the conclusion.\n", "versions": [{"version": "v1", "created": "Wed, 3 Sep 2014 16:28:36 GMT"}], "update_date": "2014-09-04", "authors_parsed": [["Abou-zeid", "Hatem", ""], ["Hassenein", "Hosssam S.", ""]]}, {"id": "1409.2668", "submitter": "Martha Larson", "authors": "Mark Melenhorst (1), Mar\\'ia Men\\'endez Blanco (2), Martha Larson (1)\n  ((1) Delft University of Technology, (2) University of Trento)", "title": "A Crowdsourcing Procedure for the Discovery of Non-Obvious Attributes of\n  Social Image", "comments": "6 pages, 3 figures, Extended version of paper to appear in CrowdMM\n  2014: International ACM Workshop on Crowdsourcing for Multimedia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research on mid-level image representations has conventionally concentrated\nrelatively obvious attributes and overlooked non-obvious attributes, i.e.,\ncharacteristics that are not readily observable when images are viewed\nindependently of their context or function. Non-obvious attributes are not\nnecessarily easily nameable, but nonetheless they play a systematic role in\npeople`s interpretation of images. Clusters of related non-obvious attributes,\ncalled interpretation dimensions, emerge when people are asked to compare\nimages, and provide important insight on aspects of social images that are\nconsidered relevant. In contrast to aesthetic or affective approaches to image\nanalysis, non-obvious attributes are not related to the personal perspective of\nthe viewer. Instead, they encode a conventional understanding of the world,\nwhich is tacit, rather than explicitly expressed. This paper introduces a\nprocedure for discovering non-obvious attributes using crowdsourcing. We\ndiscuss this procedure using a concrete example of a crowdsourcing task on\nAmazon Mechanical Turk carried out in the domain of fashion. An analysis\ncomparing discovered non-obvious attributes with user tags demonstrated the\nadded value delivered by our procedure.\n", "versions": [{"version": "v1", "created": "Sat, 6 Sep 2014 21:26:28 GMT"}], "update_date": "2014-09-10", "authors_parsed": [["Melenhorst", "Mark", "", "Delft University of Technology"], ["Blanco", "María Menéndez", "", "University of Trento"], ["Larson", "Martha", "", "Delft University of Technology"]]}, {"id": "1409.4587", "submitter": "Med Karim Abdmouleh", "authors": "Med Karim Abdmouleh, Ali Khalfallah and Med Salim Bouhlel", "title": "A new Watermarking Technique for Medical Image using Hierarchical\n  Encryption", "comments": "6 pages, 9 figures", "journal-ref": "IJCSI International Journal of Computer Science Issues 11(4)\n  (2014) 27-32", "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, characterized by the innovation of technology and the\ndigital revolution, the field of media has become important. The transfer and\nexchange of multimedia data and duplication have become major concerns of\nresearchers. Consequently, protecting copyrights and ensuring service safety is\nneeded. Cryptography has a specific role, is to protect secret files against\nunauthorized access. In this paper, a hierarchical cryptosystem algorithm based\non Logistic Map chaotic systems is proposed. The results show that the proposed\nmethod improves the security of the image. Experimental results on a database\nof 200 medical images show that the proposed method significantly gives better\nresults.\n", "versions": [{"version": "v1", "created": "Tue, 16 Sep 2014 11:27:38 GMT"}], "update_date": "2016-02-10", "authors_parsed": [["Abdmouleh", "Med Karim", ""], ["Khalfallah", "Ali", ""], ["Bouhlel", "Med Salim", ""]]}, {"id": "1409.4883", "submitter": "Mike Stannett", "authors": "James Ridgway, Mike Stannett", "title": "Developing a Video Steganography Toolkit", "comments": "14 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although techniques for separate image and audio steganography are widely\nknown, relatively little has been described concerning the hiding of\ninformation within video streams (\"video steganography\"). In this paper we\nreview the current state of the art in this field, and describe the key issues\nwe have encountered in developing a practical video steganography system. A\nsupporting video is also available online at\nhttp://www.youtube.com/watch?v=YhnlHmZolRM\n", "versions": [{"version": "v1", "created": "Wed, 17 Sep 2014 07:33:46 GMT"}], "update_date": "2014-09-18", "authors_parsed": [["Ridgway", "James", ""], ["Stannett", "Mike", ""]]}, {"id": "1409.7787", "submitter": "Marco Crocco", "authors": "Marco Crocco, Marco Cristani, Andrea Trucco and Vittorio Murino", "title": "Audio Surveillance: a Systematic Review", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SD cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite surveillance systems are becoming increasingly ubiquitous in our\nliving environment, automated surveillance, currently based on video sensory\nmodality and machine intelligence, lacks most of the time the robustness and\nreliability required in several real applications. To tackle this issue, audio\nsensory devices have been taken into account, both alone or in combination with\nvideo, giving birth, in the last decade, to a considerable amount of research.\nIn this paper audio-based automated surveillance methods are organized into a\ncomprehensive survey: a general taxonomy, inspired by the more widespread video\nsurveillance field, is proposed in order to systematically describe the methods\ncovering background subtraction, event classification, object tracking and\nsituation analysis. For each of these tasks, all the significant works are\nreviewed, detailing their pros and cons and the context for which they have\nbeen proposed. Moreover, a specific section is devoted to audio features,\ndiscussing their expressiveness and their employment in the above described\ntasks. Differently, from other surveys on audio processing and analysis, the\npresent one is specifically targeted to automated surveillance, highlighting\nthe target applications of each described methods and providing the reader\ntables and schemes useful to retrieve the most suited algorithms for a specific\nrequirement.\n", "versions": [{"version": "v1", "created": "Sat, 27 Sep 2014 09:47:16 GMT"}], "update_date": "2014-09-30", "authors_parsed": [["Crocco", "Marco", ""], ["Cristani", "Marco", ""], ["Trucco", "Andrea", ""], ["Murino", "Vittorio", ""]]}, {"id": "1409.8650", "submitter": "Nikolaos Thomos", "authors": "Nikolaos Thomos, Eymen Kurdoglu, Pascal Frossard, and Mihaela Van der\n  Schaar", "title": "Adaptive Prioritized Random Linear Coding and Scheduling for Layered\n  Data Delivery from Multiple Servers", "comments": "submitted to IEEE Transactions on Multimedia", "journal-ref": null, "doi": "10.1109/TMM.2015.2425228", "report-no": null, "categories": "cs.IT cs.MM cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we deal with the problem of jointly determining the optimal\ncoding strategy and the scheduling decisions when receivers obtain layered data\nfrom multiple servers. The layered data is encoded by means of Prioritized\nRandom Linear Coding (PRLC) in order to be resilient to channel loss while\nrespecting the unequal levels of importance in the data, and data blocks are\ntransmitted simultaneously in order to reduce decoding delays and improve the\ndelivery performance. We formulate the optimal coding and scheduling decisions\nproblem in our novel framework with the help of Markov Decision Processes\n(MDP), which are effective tools for modeling adapting streaming systems.\nReinforcement learning approaches are then proposed to derive reduced\ncomputational complexity solutions to the adaptive coding and scheduling\nproblems. The novel reinforcement learning approaches and the MDP solution are\nexamined in an illustrative example for scalable video transmission. Our\nmethods offer large performance gains over competing methods that deliver the\ndata blocks sequentially. The experimental evaluation also shows that our novel\nalgorithms offer continuous playback and guarantee small quality variations\nwhich is not the case for baseline solutions. Finally, our work highlights the\nadvantages of reinforcement learning algorithms to forecast the temporal\nevolution of data demands and to decide the optimal coding and scheduling\ndecisions.\n", "versions": [{"version": "v1", "created": "Tue, 30 Sep 2014 18:47:09 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Thomos", "Nikolaos", ""], ["Kurdoglu", "Eymen", ""], ["Frossard", "Pascal", ""], ["Van der Schaar", "Mihaela", ""]]}]