[{"id": "0904.3148", "submitter": "Hao Chen", "authors": "Hao Chen", "title": "CRT-Based High Speed Parallel Architecture for Long BCH Encoding", "comments": "3 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BCH (Bose-Chaudhuri-Hocquenghen) error correcting codes ([1]-[2]) are now\nwidely used in communication systems and digital technology. Direct LFSR(linear\nfeedback shifted register)-based encoding of a long BCH code suffers from\nserial-in and serial-out limitation and large fanout effect of some XOR gates.\nThis makes the LFSR-based encoders of long BCH codes cannot keep up with the\ndata transmission speed in some applications. Several parallel long parallel\nencoders for long cyclic codes have been proposed in [3]-[8]. The technique for\neliminating the large fanout effect by J-unfolding method and some algebraic\nmanipulation was presented in [7] and [8] . In this paper we propose a\nCRT(Chinese Remainder Theorem)-based parallel architecture for long BCH\nencoding. Our novel technique can be used to eliminate the fanout bottleneck.\nThe only restriction on the speed of long BCH encoding of our CRT-based\narchitecture is $log_2N$, where $N$ is the length of the BCH code.\n", "versions": [{"version": "v1", "created": "Tue, 21 Apr 2009 00:34:43 GMT"}], "update_date": "2009-04-22", "authors_parsed": [["Chen", "Hao", ""]]}, {"id": "0904.4526", "submitter": "Syed Jafar", "authors": "Cenk M. Yetis, Syed A. Jafar, Ahmet H. Kayran", "title": "Feasibility Conditions for Interference Alignment", "comments": "6 pages. Submitted to IEEE Globecom March 31 2009", "journal-ref": "IEEE Transactions on Signal Processing, Sep. 2010, Vol. 58, Issue:\n  9, Pages: 4771-4782", "doi": "10.1109/TSP.2010.2050480", "report-no": null, "categories": "cs.IT cs.AR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The degrees of freedom of MIMO interference networks with constant channel\ncoefficients are not known in general. Determining the feasibility of a linear\ninterference alignment solution is a key step toward solving this open problem.\nOur approach in this paper is to view the alignment problem as a system of\nbilinear equations and determine its solvability by comparing the number of\nequations and the number of variables. To this end, we divide interference\nalignment problems into two classes - proper and improper. An interference\nalignment problem is called proper if the number of equations does not exceed\nthe number of variables. Otherwise, it is called improper. Examples are\npresented to support the intuition that for generic channel matrices, proper\nsystems are almost surely feasible and improper systems are almost surely\ninfeasible.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2009 03:11:52 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Yetis", "Cenk M.", ""], ["Jafar", "Syed A.", ""], ["Kayran", "Ahmet H.", ""]]}]