[{"id": "1709.00147", "submitter": "Bharath Sriperumbudur", "authors": "Motonobu Kanagawa, Bharath K. Sriperumbudur and Kenji Fukumizu", "title": "Convergence Analysis of Deterministic Kernel-Based Quadrature Rules in\n  Misspecified Settings", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a convergence analysis of kernel-based quadrature rules\nin misspecified settings, focusing on deterministic quadrature in Sobolev\nspaces. In particular, we deal with misspecified settings where a test\nintegrand is less smooth than a Sobolev RKHS based on which a quadrature rule\nis constructed. We provide convergence guarantees based on two different\nassumptions on a quadrature rule: one on quadrature weights, and the other on\ndesign points. More precisely, we show that convergence rates can be derived\n(i) if the sum of absolute weights remains constant (or does not increase\nquickly), or (ii) if the minimum distance between design points does not\ndecrease very quickly. As a consequence of the latter result, we derive a rate\nof convergence for Bayesian quadrature in misspecified settings. We reveal a\ncondition on design points to make Bayesian quadrature robust to\nmisspecification, and show that, under this condition, it may adaptively\nachieve the optimal rate of convergence in the Sobolev space of a lesser order\n(i.e., of the unknown smoothness of a test integrand), under a slightly\nstronger regularity condition on the integrand.\n", "versions": [{"version": "v1", "created": "Fri, 1 Sep 2017 04:08:50 GMT"}, {"version": "v2", "created": "Tue, 30 Oct 2018 16:12:25 GMT"}], "update_date": "2018-10-31", "authors_parsed": [["Kanagawa", "Motonobu", ""], ["Sriperumbudur", "Bharath K.", ""], ["Fukumizu", "Kenji", ""]]}, {"id": "1709.00483", "submitter": "Tao Sun", "authors": "Tao Sun, Hao Jiang, Lizhi Cheng, Wei Zhu", "title": "Iteratively Linearized Reweighted Alternating Direction Method of\n  Multipliers for a Class of Nonconvex Problems", "comments": null, "journal-ref": null, "doi": "10.1109/TSP.2018.2868269", "report-no": null, "categories": "cs.NA cs.CV math.NA math.OC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider solving a class of nonconvex and nonsmooth\nproblems frequently appearing in signal processing and machine learning\nresearch. The traditional alternating direction method of multipliers\nencounters troubles in both mathematics and computations in solving the\nnonconvex and nonsmooth subproblem. In view of this, we propose a reweighted\nalternating direction method of multipliers. In this algorithm, all subproblems\nare convex and easy to solve. We also provide several guarantees for the\nconvergence and prove that the algorithm globally converges to a critical point\nof an auxiliary function with the help of the Kurdyka-{\\L}ojasiewicz property.\nSeveral numerical results are presented to demonstrate the efficiency of the\nproposed algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 1 Sep 2017 21:20:30 GMT"}, {"version": "v2", "created": "Wed, 6 Sep 2017 04:03:33 GMT"}, {"version": "v3", "created": "Mon, 19 Mar 2018 04:15:28 GMT"}, {"version": "v4", "created": "Tue, 20 Mar 2018 00:52:41 GMT"}, {"version": "v5", "created": "Thu, 22 Mar 2018 23:26:33 GMT"}], "update_date": "2018-10-17", "authors_parsed": [["Sun", "Tao", ""], ["Jiang", "Hao", ""], ["Cheng", "Lizhi", ""], ["Zhu", "Wei", ""]]}, {"id": "1709.01071", "submitter": "Vladimir Katkovnik", "authors": "Vladimir Katkovnik", "title": "Phase retrieval from noisy data based on sparse approximation of object\n  phase and amplitude", "comments": "16 pages, 19 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A variational approach to reconstruction of phase and amplitude of a\ncomplex-valued object from Poissonian intensity observations is developed. The\nobservation model corresponds to the typical optical setups with a phase\nmodulation of wavefronts. The transform domain sparsity is applied for the\namplitude and phase modeling. It is demonstrated that this modeling results in\nthe essential advantage of the developed algorithm for heavily noisy\nobservations corresponding to a short exposure time in optical experiments. We\nconsider also two simplified versions of this algorithm where the sparsity\nmodeling of phase and amplitude is omitted. In the simulation study we compare\nthe developed algorithms versus the Gerchberg-Saxton and truncation Wirtinger\nflow algorithms. The latter algorithm being the maximum likelihood based is the\nstate-of-the-art for the phase retrieval from Poissonian observations. For\nnoisy and very noisy observations the proposed algorithm demonstrates a\nvaluable advantage.\n", "versions": [{"version": "v1", "created": "Mon, 4 Sep 2017 09:21:04 GMT"}], "update_date": "2017-09-06", "authors_parsed": [["Katkovnik", "Vladimir", ""]]}, {"id": "1709.01237", "submitter": "Hariprasad Kannan", "authors": "Hariprasad Kannan, Nikos Komodakis, Nikos Paragios", "title": "Newton-type Methods for Inference in Higher-Order Markov Random Fields", "comments": "10 pages, 3 figures, 3 tables, CVPR 2017", "journal-ref": "Poster at IEEE International Conference on Computer Vision and\n  Pattern Recognition 2017", "doi": null, "report-no": null, "categories": "cs.CV cs.LG cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linear programming relaxations are central to {\\sc map} inference in discrete\nMarkov Random Fields. The ability to properly solve the Lagrangian dual is a\ncritical component of such methods. In this paper, we study the benefit of\nusing Newton-type methods to solve the Lagrangian dual of a smooth version of\nthe problem. We investigate their ability to achieve superior convergence\nbehavior and to better handle the ill-conditioned nature of the formulation, as\ncompared to first order methods. We show that it is indeed possible to\nefficiently apply a trust region Newton method for a broad range of {\\sc map}\ninference problems. In this paper we propose a provably convergent and\nefficient framework that includes (i) excellent compromise between\ncomputational complexity and precision concerning the Hessian matrix\nconstruction, (ii) a damping strategy that aids efficient optimization, (iii) a\ntruncation strategy coupled with a generic pre-conditioner for Conjugate\nGradients, (iv) efficient sum-product computation for sparse clique potentials.\nResults for higher-order Markov Random Fields demonstrate the potential of this\napproach.\n", "versions": [{"version": "v1", "created": "Tue, 5 Sep 2017 04:55:47 GMT"}], "update_date": "2017-09-06", "authors_parsed": [["Kannan", "Hariprasad", ""], ["Komodakis", "Nikos", ""], ["Paragios", "Nikos", ""]]}, {"id": "1709.01268", "submitter": "Dat Thanh Tran", "authors": "Dat Thanh Tran, Martin Magris, Juho Kanniainen, Moncef Gabbouj,\n  Alexandros Iosifidis", "title": "Tensor Representation in High-Frequency Financial Data for Price Change\n  Prediction", "comments": "accepted in SSCI 2017, typos fixed", "journal-ref": "IEEE Symposium Series on Computational Intelligence (SSCI), 2017", "doi": "10.1109/SSCI.2017.8280812", "report-no": null, "categories": "cs.CE cs.LG cs.NA q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, with the availability of massive amount of trade data collected,\nthe dynamics of the financial markets pose both a challenge and an opportunity\nfor high frequency traders. In order to take advantage of the rapid, subtle\nmovement of assets in High Frequency Trading (HFT), an automatic algorithm to\nanalyze and detect patterns of price change based on transaction records must\nbe available. The multichannel, time-series representation of financial data\nnaturally suggests tensor-based learning algorithms. In this work, we\ninvestigate the effectiveness of two multilinear methods for the mid-price\nprediction problem against other existing methods. The experiments in a large\nscale dataset which contains more than 4 millions limit orders show that by\nutilizing tensor representation, multilinear models outperform vector-based\napproaches and other competing ones.\n", "versions": [{"version": "v1", "created": "Tue, 5 Sep 2017 07:48:33 GMT"}, {"version": "v2", "created": "Tue, 26 Sep 2017 05:14:34 GMT"}, {"version": "v3", "created": "Mon, 2 Oct 2017 17:33:50 GMT"}, {"version": "v4", "created": "Tue, 28 Nov 2017 11:03:45 GMT"}], "update_date": "2018-07-06", "authors_parsed": [["Tran", "Dat Thanh", ""], ["Magris", "Martin", ""], ["Kanniainen", "Juho", ""], ["Gabbouj", "Moncef", ""], ["Iosifidis", "Alexandros", ""]]}, {"id": "1709.01975", "submitter": "Melvin Leok", "authors": "Valentin Duruisseaux, Jeremy Schmitt, Melvin Leok", "title": "Adaptive Hamiltonian Variational Integrators and Symplectic Accelerated\n  Optimization", "comments": "32 pages, 8 figures. To appear in SIAM Journal on Scientific\n  Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that symplectic integrators lose their near energy\npreservation properties when variable step sizes are used. The most common\napproach to combine adaptive step sizes and symplectic integrators involves the\nPoincar\\'e transformation of the original Hamiltonian. In this article, we\nprovide a framework for the construction of variational integrators using the\nPoincar\\'e transformation. Since the transformed Hamiltonian is typically\ndegenerate, the use of Hamiltonian variational integrators based on Type II or\nType III generating functions is required instead of the more traditional\nLagrangian variational integrators based on Type I generating functions. Error\nanalysis is provided and numerical tests based on the Taylor variational\nintegrator approach of Schmitt, Shingel, Leok (2018) to time-adaptive\nvariational integration of Kepler's 2-Body problem are presented. Finally, we\nuse our adaptive framework together with the variational approach to\naccelerated optimization presented in Wibisono, Wilson, Jordan (2016) to design\nefficient variational and non-variational explicit integrators for symplectic\naccelerated optimization.\n", "versions": [{"version": "v1", "created": "Wed, 6 Sep 2017 19:55:28 GMT"}, {"version": "v2", "created": "Sat, 5 Dec 2020 11:14:44 GMT"}, {"version": "v3", "created": "Thu, 24 Jun 2021 14:10:34 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Duruisseaux", "Valentin", ""], ["Schmitt", "Jeremy", ""], ["Leok", "Melvin", ""]]}, {"id": "1709.02162", "submitter": "Przemys{\\l}aw Gospodarczyk Ph.D.", "authors": "Przemys{\\l}aw Gospodarczyk, Pawe{\\l} Wo\\'zny", "title": "An iterative approximate method of solving boundary value problems using\n  dual Bernstein polynomials", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a new iterative approximate method of solving\nboundary value problems. The idea is to compute approximate polynomial\nsolutions in the Bernstein form using least squares approximation combined with\nsome properties of dual Bernstein polynomials which guarantee high efficiency\nof our approach. The method can deal with both linear and nonlinear\ndifferential equations. Moreover, not only second order differential equations\ncan be solved but also higher order differential equations. Illustrative\nexamples confirm the versatility of our method.\n", "versions": [{"version": "v1", "created": "Thu, 7 Sep 2017 09:56:42 GMT"}], "update_date": "2017-09-08", "authors_parsed": [["Gospodarczyk", "Przemysław", ""], ["Woźny", "Paweł", ""]]}, {"id": "1709.02641", "submitter": "Longhao Yuan", "authors": "Longhao Yuan, Qibin Zhao and Jianting Cao", "title": "Completion of High Order Tensor Data with Missing Entries via\n  Tensor-train Decomposition", "comments": "8 pages, ICONIP 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we aim at the completion problem of high order tensor data\nwith missing entries. The existing tensor factorization and completion methods\nsuffer from the curse of dimensionality when the order of tensor N>>3. To\novercome this problem, we propose an efficient algorithm called TT-WOPT\n(Tensor-train Weighted OPTimization) to find the latent core tensors of tensor\ndata and recover the missing entries. Tensor-train decomposition, which has the\npowerful representation ability with linear scalability to tensor order, is\nemployed in our algorithm. The experimental results on synthetic data and\nnatural image completion demonstrate that our method significantly outperforms\nthe other related methods. Especially when the missing rate of data is very\nhigh, e.g., 85% to 99%, our algorithm can achieve much better performance than\nother state-of-the-art algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 8 Sep 2017 10:48:56 GMT"}, {"version": "v2", "created": "Thu, 14 Sep 2017 12:36:41 GMT"}], "update_date": "2017-09-15", "authors_parsed": [["Yuan", "Longhao", ""], ["Zhao", "Qibin", ""], ["Cao", "Jianting", ""]]}, {"id": "1709.02710", "submitter": "Espen Sande", "authors": "Michael S. Floater and Espen Sande", "title": "Optimal spline spaces for $L^2$ $n$-width problems with boundary\n  conditions", "comments": "17 pages, 4 figures. Fixed a typo. Article published in Constructive\n  Approximation", "journal-ref": "Constr Approx (2019) 50:1", "doi": "10.1007/s00365-018-9427-5", "report-no": null, "categories": "math.NA cs.NA math.CA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show that, with respect to the $L^2$ norm, three classes of\nfunctions in $H^r(0,1)$, defined by certain boundary conditions, admit optimal\nspline spaces of all degrees $\\geq r-1$, and all these spline spaces have\nuniform knots.\n", "versions": [{"version": "v1", "created": "Fri, 8 Sep 2017 14:08:18 GMT"}, {"version": "v2", "created": "Wed, 28 Feb 2018 08:55:12 GMT"}, {"version": "v3", "created": "Mon, 9 Apr 2018 07:55:56 GMT"}, {"version": "v4", "created": "Sat, 6 Jul 2019 15:04:15 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Floater", "Michael S.", ""], ["Sande", "Espen", ""]]}, {"id": "1709.03747", "submitter": "Nicolas Pignet", "authors": "Micka\\\"el Abbas, Alexandre Ern, Nicolas Pignet", "title": "Hybrid High-Order methods for finite deformations of hyperelastic\n  materials", "comments": "29 pages", "journal-ref": null, "doi": "10.1007/s00466-018-1538-0", "report-no": null, "categories": "cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We devise and evaluate numerically Hybrid High-Order (HHO) methods for\nhyperelastic materials undergoing finite deformations. The HHO methods use as\ndiscrete unknowns piecewise polynomials of order $k\\ge1$ on the mesh skeleton,\ntogether with cell-based polynomials that can be eliminated locally by static\ncondensation. The discrete problem is written as the minimization of the broken\nnonlinear elastic energy where a local reconstruction of the displacement\ngradient is used. Two HHO methods are considered: a stabilized method where the\ngradient is reconstructed as a tensor-valued polynomial of order $k$ and a\nstabilization is added to the discrete energy functional, and an unstabilized\nmethod which reconstructs a stable higher-order gradient and circumvents the\nneed for stabilization. Both methods satisfy the principle of virtual work\nlocally with equilibrated tractions. We present a numerical study of both HHO\nmethods on test cases with known solution and on more challenging\nthree-dimensional test cases including finite deformations with strong shear\nlayers and cavitating voids. We assess the computational efficiency of both\nmethods, and we compare our results to those obtained with an industrial\nsoftware using conforming finite elements and to results from the literature.\nBoth methods exhibit robust behavior in the quasi-incompressible regime.\n", "versions": [{"version": "v1", "created": "Tue, 12 Sep 2017 09:03:07 GMT"}, {"version": "v2", "created": "Wed, 6 Dec 2017 10:12:37 GMT"}, {"version": "v3", "created": "Tue, 7 Aug 2018 12:46:19 GMT"}], "update_date": "2018-09-25", "authors_parsed": [["Abbas", "Mickaël", ""], ["Ern", "Alexandre", ""], ["Pignet", "Nicolas", ""]]}, {"id": "1709.03783", "submitter": "Leonardo Robol", "authors": "Fernando De Ter\\'an, Bruno Iannazzo, Federico Poloni, Leonardo Robol", "title": "Nonsingular systems of generalized Sylvester equations: an algorithmic\n  approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the uniqueness of solution (i.e., nonsingularity) of systems of\n$r$ generalized Sylvester and $\\star$-Sylvester equations with $n\\times n$\ncoefficients. After several reductions, we show that it is sufficient to\nanalyze periodic systems having, at most, one generalized $\\star$-Sylvester\nequation. We provide characterizations for the nonsingularity in terms of\nspectral properties of either matrix pencils or formal matrix products, both\nconstructed from the coefficients of the system. The proposed approach uses the\nperiodic Schur decomposition, and leads to a backward stable $O(n^3r)$\nalgorithm for computing the (unique) solution.\n", "versions": [{"version": "v1", "created": "Tue, 12 Sep 2017 11:15:21 GMT"}, {"version": "v2", "created": "Sat, 15 Jun 2019 09:53:58 GMT"}], "update_date": "2019-06-18", "authors_parsed": [["De Terán", "Fernando", ""], ["Iannazzo", "Bruno", ""], ["Poloni", "Federico", ""], ["Robol", "Leonardo", ""]]}, {"id": "1709.04281", "submitter": "Wen-Shin Lee", "authors": "Matteo Briani, Annie Cuyt, Ferre Knaepkens, Wen-shin Lee", "title": "VEXPA: Validated EXPonential Analysis through regular sub-sampling", "comments": null, "journal-ref": null, "doi": "10.1016/j.sigpro.2020.107722", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a procedure that adds a number of desirable features to standard\nexponential analysis algorithms, among which output reliability, a\ndivide-and-conquer approach, the automatic detection of the exponential model\norder, robustness against some outliers, and the possibility to parallelize the\nanalysis. The key enabler for these features is the introduction of uniform\nsub-Nyquist sampling through decimation of the dense signal data. We actually\nmake use of possible aliasing effects to recondition the problem statement\nrather than that we avoid aliasing.\n  In Section 2 the standard exponential analysis is described, including a\nsensitivity analysis. In Section 3 the ingredients for the new approach are\ncollected, of which good use is made in Section 4 where we essentially bring\neverything together in what we call VEXPA.\n  Some numerical examples of the new procedure illustrate in Section 5 that the\nadditional features are indeed realized and that VEXPA is a valuable add-on to\nany stand-alone exponential analysis. While returning a lot of additional\noutput, it maintains a favourable comparison to the CRLB of the underlying\nmethod, for which we here choose a matrix pencil method. Moreover, the output\nreliability of VEXPA is similar to that of atomic norm minimization, whereas\nits computational complexity is far less.\n", "versions": [{"version": "v1", "created": "Wed, 13 Sep 2017 12:25:40 GMT"}, {"version": "v2", "created": "Mon, 2 Oct 2017 13:15:11 GMT"}, {"version": "v3", "created": "Fri, 1 Dec 2017 09:44:22 GMT"}, {"version": "v4", "created": "Mon, 27 Jul 2020 11:26:05 GMT"}, {"version": "v5", "created": "Tue, 28 Jul 2020 09:19:05 GMT"}], "update_date": "2020-07-29", "authors_parsed": [["Briani", "Matteo", ""], ["Cuyt", "Annie", ""], ["Knaepkens", "Ferre", ""], ["Lee", "Wen-shin", ""]]}, {"id": "1709.04765", "submitter": "Sulaiman Abo Diab", "authors": "Sulaiman Y. Abo Diab", "title": "Complete Pascal Interpolation Scheme For Approximating The Geometry Of A\n  Quadrilateral Element", "comments": "16 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper applies a complete parametric set for approximating the geometry\nof a quadrilateral element. The approximation basis used is a complete Pascal\npolynomial of second order with six free parameters. The interpolation\nprocedure is a natural interpolation scheme. The six free parameters are\ndetermined using the natural coordinates of the four nodal points (vertices) of\nthe quadrilateral element and the two intersections points of the lines\ncrossing every two opposite edges (poles). The presented scheme recovers the\nwell known Lagrangian interpolation scheme, when every two opposite edges are\nparallel. A third order Pascal interpolation scheme is also presented. The four\nmidpoints of the four edges in addition to the six nodal point from the second\norder case are used as significant nodal points. It is expected to reflect the\ngeometry properties better since the shape functions are complete\n", "versions": [{"version": "v1", "created": "Mon, 11 Sep 2017 11:58:30 GMT"}], "update_date": "2017-09-15", "authors_parsed": [["Diab", "Sulaiman Y. Abo", ""]]}, {"id": "1709.04794", "submitter": "Joris Tavernier", "authors": "Joris Tavernier, Jaak Simm, Karl Meerbergen, Joerg Kurt Wegner, Hugo\n  Ceulemans and Yves Moreau", "title": "Fast semi-supervised discriminant analysis for binary classification of\n  large data-sets", "comments": null, "journal-ref": null, "doi": "10.1016/j.patcog.2019.02.015", "report-no": null, "categories": "cs.AI cs.NA cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High-dimensional data requires scalable algorithms. We propose and analyze\nthree scalable and related algorithms for semi-supervised discriminant analysis\n(SDA). These methods are based on Krylov subspace methods which exploit the\ndata sparsity and the shift-invariance of Krylov subspaces. In addition, the\nproblem definition was improved by adding centralization to the semi-supervised\nsetting. The proposed methods are evaluated on a industry-scale data set from a\npharmaceutical company to predict compound activity on target proteins. The\nresults show that SDA achieves good predictive performance and our methods only\nrequire a few seconds, significantly improving computation time on previous\nstate of the art.\n", "versions": [{"version": "v1", "created": "Thu, 14 Sep 2017 13:53:49 GMT"}, {"version": "v2", "created": "Thu, 1 Mar 2018 14:00:31 GMT"}], "update_date": "2019-02-21", "authors_parsed": [["Tavernier", "Joris", ""], ["Simm", "Jaak", ""], ["Meerbergen", "Karl", ""], ["Wegner", "Joerg Kurt", ""], ["Ceulemans", "Hugo", ""], ["Moreau", "Yves", ""]]}, {"id": "1709.05125", "submitter": "Georgios Karpouzas", "authors": "Georgios K. Karpouzas and Eugene De Villiers", "title": "Generalized Internal Boundaries (GIB)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.flu-dyn cs.NA physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Representing large-scale motions and topological changes in the finite volume\n(FV) framework, while at the same time preserving the accuracy of the numerical\nsolution, is difficult. In this paper, we present a robust, highly efficient\nmethod designed to achieve this capability. The proposed approach conceptually\nshares many of the characteristics of the cut-cell interface tracking method,\nbut without the need for complex cell splitting/merging operations. The heart\nof the new technique is to align existing mesh facets with the geometry to be\nrepresented. We then modify the matrix contributions from these facets such\nthat they are represented in an identical fashion to traditional boundary\nconditions. The collection of such faces is named a Generalised Internal\nBoundary (GIB). In order to introduce motion into the system, we rely on the\nclassical ALE (Arbitrary Lagrangian-Eulerian) approach, but with the caveat\nthat the non-time-dependent motion of elements instantaneously crossing the\ninterface is handled separately from the time dependent component. The new\nmethodology is validated through comparison with: a) a body-fitted grid\nsimulation of an oscillating two dimensional cylinder and b) experimental\nresults of a butterfly valve.\n", "versions": [{"version": "v1", "created": "Fri, 15 Sep 2017 09:38:08 GMT"}, {"version": "v2", "created": "Thu, 16 Nov 2017 14:23:39 GMT"}], "update_date": "2017-11-17", "authors_parsed": [["Karpouzas", "Georgios K.", ""], ["De Villiers", "Eugene", ""]]}, {"id": "1709.05132", "submitter": "Francesco Tudisco", "authors": "Stefano Pozza and Francesco Tudisco", "title": "On the stability of network indices defined by means of matrix functions", "comments": null, "journal-ref": null, "doi": "10.1137/17M1133920", "report-no": null, "categories": "math.NA cs.IT cs.NA cs.SI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Identifying important components in a network is one of the major goals of\nnetwork analysis. Popular and effective measures of importance of a node or a\nset of nodes are defined in terms of suitable entries of functions of matrices\n$f(A)$. These kinds of measures are particularly relevant as they are able to\ncapture the global structure of connections involving a node. However,\ncomputing the entries of $f(A)$ requires a significant computational effort. In\nthis work we address the problem of estimating the changes in the entries of\n$f(A)$ with respect to changes in the edge structure. Intuition suggests that,\nif the topology of connections in the new graph $\\tilde G$ is not significantly\ndistorted, relevant components in $G$ maintain their leading role in $\\tilde\nG$. We propose several bounds giving mathematical reasoning to such intuition\nand showing, in particular, that the magnitude of the variation of the entry\n$f(A)_{k\\ell}$ decays exponentially with the shortest-path distance in $G$ that\nseparates either $k$ or $\\ell$ from the set of nodes touched by the edges that\nare perturbed. Moreover, we propose a simple method that exploits the\ncomputation of $f(A)$ to simultaneously compute the all-pairs shortest-path\ndistances of $G$, with essentially no additional cost. As the nodes whose edge\nconnection tends to change more often or tends to be more often affected by\nnoise have marginal role in the graph and are distant from the most central\nnodes, the proposed bounds are particularly relevant.\n", "versions": [{"version": "v1", "created": "Fri, 15 Sep 2017 09:50:15 GMT"}, {"version": "v2", "created": "Thu, 25 Oct 2018 17:40:39 GMT"}, {"version": "v3", "created": "Fri, 26 Feb 2021 09:28:38 GMT"}], "update_date": "2021-03-01", "authors_parsed": [["Pozza", "Stefano", ""], ["Tudisco", "Francesco", ""]]}, {"id": "1709.05832", "submitter": "Frits de Prenter", "authors": "Frits de Prenter, Christoph Lehrenfeld and Andr\\'e Massing", "title": "A note on the penalty parameter in Nitsche's method for unfitted\n  boundary value problems", "comments": null, "journal-ref": "Computers & Mathematics with applications 2018", "doi": "10.1016/j.camwa.2018.03.032", "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nitsche's method is a popular approach to implement Dirichlet-type boundary\nconditions in situations where a strong imposition is either inconvenient or\nsimply not feasible. The method is widely applied in the context of unfitted\nfinite element methods. From the classical (symmetric) Nitsche's method it is\nwell-known that the stabilization parameter in the method has to be chosen\nsufficiently large to obtain unique solvability of discrete systems. In this\nshort note we discuss an often used strategy to set the stabilization parameter\nand describe a possible problem that can arise from this. We show that in\nspecific situations error bounds can deteriorate and give examples of\ncomputations where Nitsche's method yields large and even diverging\ndiscretization errors.\n", "versions": [{"version": "v1", "created": "Mon, 18 Sep 2017 09:33:54 GMT"}], "update_date": "2019-12-17", "authors_parsed": [["de Prenter", "Frits", ""], ["Lehrenfeld", "Christoph", ""], ["Massing", "André", ""]]}, {"id": "1709.06677", "submitter": "Roland Pulch", "authors": "Roland Pulch and Akil Narayan", "title": "Balanced truncation for model order reduction of linear dynamical\n  systems with quadratic outputs", "comments": "35 pages, 20 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate model order reduction (MOR) for linear dynamical systems,\nwhere a quadratic output is defined as a quantity of interest. The system can\nbe transformed into a linear dynamical system with many linear outputs. MOR is\nfeasible by the method of balanced truncation, but suffers from the large\nnumber of outputs in approximate methods. To ameliorate this shortcoming we\nderive an equivalent quadratic-bilinear system with a single linear output and\nanalyze the properties of this system. We examine MOR for this system via the\ntechnique of balanced truncation, which requires a stabilization of the system.\nTherein, the solution of two quadratic Lyapunov equations is traced back to the\nsolution of just two linear Lyapunov equations. We present numerical results\nfor several test examples comparing the two MOR approaches.\n", "versions": [{"version": "v1", "created": "Tue, 19 Sep 2017 23:30:40 GMT"}, {"version": "v2", "created": "Tue, 23 Apr 2019 16:57:08 GMT"}, {"version": "v3", "created": "Wed, 14 Aug 2019 17:50:14 GMT"}], "update_date": "2019-08-15", "authors_parsed": [["Pulch", "Roland", ""], ["Narayan", "Akil", ""]]}, {"id": "1709.06793", "submitter": "Daniel Drzisga", "authors": "Simon Bauer, Daniel Drzisga, Marcus Mohr, Ulrich Ruede, Christian\n  Waluga, Barbara Wohlmuth", "title": "A stencil scaling approach for accelerating matrix-free finite element\n  implementations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel approach to fast on-the-fly low order finite element\nassembly for scalar elliptic partial differential equations of Darcy type with\nvariable coefficients optimized for matrix-free implementations. Our approach\nintroduces a new operator that is obtained by appropriately scaling the\nreference stiffness matrix from the constant coefficient case. Assuming\nsufficient regularity, an a priori analysis shows that solutions obtained by\nthis approach are unique and have asymptotically optimal order convergence in\nthe $H^1$- and the $L^2$-norm on hierarchical hybrid grids. For the\npre-asymptotic regime, we present a local modification that guarantees uniform\nellipticity of the operator. Cost considerations show that our novel approach\nrequires roughly one third of the floating-point operations compared to a\nclassical finite element assembly scheme employing nodal integration. Our\ntheoretical considerations are illustrated by numerical tests that confirm the\nexpectations with respect to accuracy and run-time. A large scale application\nwith more than a hundred billion ($1.6\\cdot10^{11}$) degrees of freedom\nexecuted on 14,310 compute cores demonstrates the efficiency of the new scaling\napproach.\n", "versions": [{"version": "v1", "created": "Wed, 20 Sep 2017 09:58:20 GMT"}, {"version": "v2", "created": "Mon, 23 Jul 2018 09:02:23 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Bauer", "Simon", ""], ["Drzisga", "Daniel", ""], ["Mohr", "Marcus", ""], ["Ruede", "Ulrich", ""], ["Waluga", "Christian", ""], ["Wohlmuth", "Barbara", ""]]}, {"id": "1709.06847", "submitter": "Moritz August", "authors": "Moritz August and Thomas Huckle", "title": "Towards a better understanding of the matrix product function\n  approximation algorithm in application to quantum physics", "comments": "17 pages, comments very welcome", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA physics.comp-ph quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We recently introduced a method to approximate functions of Hermitian Matrix\nProduct Operators or Tensor Trains that are of the form $\\mathsf{Tr} f(A)$.\nFunctions of this type occur in several applications, most notably in quantum\nphysics. In this work we aim at extending the theoretical understanding of our\nmethod by showing several properties of our algorithm that can be used to\ndetect and correct errors in its results. Most importantly, we show that there\nexists a more computationally efficient version of our algorithm for certain\ninputs. To illustrate the usefulness of our finding, we prove that several\nclasses of spin Hamiltonians in quantum physics fall into this input category.\nWe finally support our findings with numerical results obtained for an example\nfrom quantum physics.\n", "versions": [{"version": "v1", "created": "Wed, 20 Sep 2017 13:14:23 GMT"}, {"version": "v2", "created": "Tue, 27 Mar 2018 08:37:11 GMT"}], "update_date": "2018-03-28", "authors_parsed": [["August", "Moritz", ""], ["Huckle", "Thomas", ""]]}, {"id": "1709.06880", "submitter": "Haizhao Yang", "authors": "Haizhao Yang", "title": "Multiresolution Mode Decomposition for Adaptive Time Series Analysis", "comments": "arXiv admin note: text overlap with arXiv:1610.03819", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes the \\emph{multiresolution mode decomposition} as a novel\nmodel for adaptive time series analysis. The main conceptual innovation is the\nintroduction of the \\emph{multiresolution intrinsic mode function} (MIMF) of\nthe form \\[ \\sum_{n=-N/2}^{N/2-1} a_n\\cos(2\\pi n\\phi(t))s_{cn}(2\\pi\nN\\phi(t))+\\sum_{n=-N/2}^{N/2-1}b_n \\sin(2\\pi n\\phi(t))s_{sn}(2\\pi N\\phi(t))\\]\nto model nonlinear and non-stationary data with time-dependent amplitudes,\nfrequencies, and waveforms. %The MIMF explains the intrinsic difficulty in\nconcentrating time-frequency representation of nonlinear and non-stationary\ndata and provides a new direction for mode decomposition. The multiresolution\nexpansion coefficients $\\{a_n\\}$, $\\{b_n\\}$, and the shape function series\n$\\{s_{cn}(t)\\}$ and $\\{s_{sn}(t)\\}$ provide innovative features for adaptive\ntime series analysis. For complex signals that are a superposition of several\nMIMFs with well-differentiated phase functions $\\phi(t)$, a new recursive\nscheme based on Gauss-Seidel iteration and diffeomorphisms is proposed to\nidentify these MIMFs, their multiresolution expansion coefficients, and shape\nfunction series. Numerical examples from synthetic data and natural phenomena\nare given to demonstrate the power of this new method.\n", "versions": [{"version": "v1", "created": "Mon, 18 Sep 2017 22:13:05 GMT"}, {"version": "v2", "created": "Tue, 14 Aug 2018 11:41:48 GMT"}, {"version": "v3", "created": "Wed, 28 Aug 2019 20:04:36 GMT"}], "update_date": "2019-08-30", "authors_parsed": [["Yang", "Haizhao", ""]]}, {"id": "1709.07184", "submitter": "Anthony Chronopoulos", "authors": "Toshihiko Abe, Anthony Theodore Chronopoulos", "title": "Convergence characteristics of the generalized residual cutting method", "comments": "15 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The residual cutting (RC) method has been proposed for efficiently solving\nlinear equations obtained from elliptic partial differential equations. Based\non the RC, we have introduced the generalized residual cutting (GRC) method,\nwhich can be applied to general sparse matrix problems. In this paper, we study\nthe mathematics of the GRC algorithm and and prove it is a Krylov subspace\nmethod. Moreover, we show that it is deeply related to the conjugate residual\n(CR) method and that GRC becomes equivalent to CR for symmetric matrices. Also,\nin numerical experiments, GRC shows more robust convergence and needs less\nmemory compared to GMRES, for significantly larger matrix sizes.\n", "versions": [{"version": "v1", "created": "Thu, 21 Sep 2017 07:17:23 GMT"}, {"version": "v2", "created": "Wed, 31 Jan 2018 05:59:18 GMT"}, {"version": "v3", "created": "Thu, 1 Feb 2018 05:01:04 GMT"}], "update_date": "2018-02-02", "authors_parsed": [["Abe", "Toshihiko", ""], ["Chronopoulos", "Anthony Theodore", ""]]}, {"id": "1709.07270", "submitter": "Alessandro Castagnotto", "authors": "Alessandro Castagnotto, Boris Lohmann", "title": "A New Framework for $\\mathcal{H}_2$-Optimal Model Reduction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this contribution, a new framework for H2-optimal reduction of\nmultiple-input, multiple- output linear dynamical systems by tangential\ninterpolation is presented. The framework is motivated by the local nature of\nboth tangential interpolation and H2-optimal approxi- mations. The main\nadvantage is given by a decoupling of the cost of optimization from the cost of\nreduction, resulting in a significant speedup in H2-optimal reduction. In\naddition, a middle-sized surrogate model is produced at no additional cost and\ncan be used e.g. for error estimation. Numerical examples illustrate the new\nframework, showing its effectiveness in producing H2-optimal reduced models at\na far lower cost than conventional algorithms. The paper ends with a brief\ndiscussion on how the idea behind the framework can be extended to approximate\nfurther system classes, thus showing that this truly is a general framework for\ninterpolatory H2 reduction rather than just an additional reduction algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 21 Sep 2017 11:46:20 GMT"}], "update_date": "2017-09-22", "authors_parsed": [["Castagnotto", "Alessandro", ""], ["Lohmann", "Boris", ""]]}, {"id": "1709.08336", "submitter": "Anh Huy Phan", "authors": "Anh-Huy Phan, Petr Tichavsk\\'y and Andrzej Cichocki", "title": "Best Rank-One Tensor Approximation and Parallel Update Algorithm for CPD", "comments": "33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A novel algorithm is proposed for CANDECOMP/PARAFAC tensor decomposition to\nexploit best rank-1 tensor approximation. Different from the existing\nalgorithms, our algorithm updates rank-1 tensors simultaneously in parallel. In\norder to achieve this, we develop new all-at-once algorithms for best rank-1\ntensor approximation based on the Levenberg-Marquardt method and the rotational\nupdate. We show that the LM algorithm has the same complexity of first-order\noptimisation algorithms, while the rotational method leads to solving the best\nrank-1 approximation of tensors of size $2 \\times 2 \\times \\cdots \\times 2$. We\nderive a closed-form expression of the best rank-1 tensor of $2\\times 2 \\times\n2$ tensors and present an ALS algorithm which updates 3 component at a time for\nhigher order tensors. The proposed algorithm is illustrated in decomposition of\ndifficult tensors which are associated with multiplication of two matrices.\n", "versions": [{"version": "v1", "created": "Mon, 25 Sep 2017 06:15:22 GMT"}], "update_date": "2017-09-26", "authors_parsed": [["Phan", "Anh-Huy", ""], ["Tichavský", "Petr", ""], ["Cichocki", "Andrzej", ""]]}, {"id": "1709.08349", "submitter": "Anh Huy Phan", "authors": "Anh-Huy Phan, Petr Tichavsk\\'y and Andrzej Cichocki", "title": "Error Preserving Correction for CPD and Bounded-Norm CPD", "comments": "27 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In CANDECOMP/PARAFAC tensor decomposition, degeneracy often occurs in some\ndifficult scenarios, e.g., when the rank exceeds the tensor dimension, or when\nthe loading components are highly collinear in several or all modes, or when\nCPD does not have an optimal solution. In such the cases, norms of some rank-1\nterms become significantly large and cancel each other. This makes algorithms\ngetting stuck in local minima while running a huge number of iterations does\nnot improve the decomposition. In this paper, we propose an error preservation\ncorrection method to deal with such problem. Our aim is to seek a new tensor\nwhose norms of rank-1 tensor components are minimised in an optimization\nproblem, while it preserves the approximation error. An alternating correction\nalgorithm and an all-atone algorithm have been developed for the problem. In\naddition, we propose a novel CPD with a bound constraint on a norm of the\nrank-one tensors. The method can be useful for decomposing tensors that cannot\nbe analyzed by traditional algorithms, such as tensors corresponding to the\nmatrix multiplication.\n", "versions": [{"version": "v1", "created": "Mon, 25 Sep 2017 07:09:27 GMT"}], "update_date": "2017-09-26", "authors_parsed": [["Phan", "Anh-Huy", ""], ["Tichavský", "Petr", ""], ["Cichocki", "Andrzej", ""]]}, {"id": "1709.08471", "submitter": "Hans Kersting", "authors": "Emilia Magnani, Hans Kersting, Michael Schober, Philipp Hennig", "title": "Bayesian Filtering for ODEs with Bounded Derivatives", "comments": "14 pages, 9 figrues", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently there has been increasing interest in probabilistic solvers for\nordinary differential equations (ODEs) that return full probability measures,\ninstead of point estimates, over the solution and can incorporate uncertainty\nover the ODE at hand, e.g. if the vector field or the initial value is only\napproximately known or evaluable. The ODE filter proposed in recent work models\nthe solution of the ODE by a Gauss-Markov process which serves as a prior in\nthe sense of Bayesian statistics. While previous work employed a Wiener process\nprior on the (possibly multiple times) differentiated solution of the ODE and\nestablished equivalence of the corresponding solver with classical numerical\nmethods, this paper raises the question whether other priors also yield\npractically useful solvers. To this end, we discuss a range of possible priors\nwhich enable fast filtering and propose a new prior--the Integrated Ornstein\nUhlenbeck Process (IOUP)--that complements the existing Integrated Wiener\nprocess (IWP) filter by encoding the property that a derivative in time of the\nsolution is bounded in the sense that it tends to drift back to zero. We\nprovide experiments comparing IWP and IOUP filters which support the belief\nthat IWP approximates better divergent ODE's solutions whereas IOUP is a better\nprior for trajectories with bounded derivatives.\n", "versions": [{"version": "v1", "created": "Mon, 25 Sep 2017 13:11:31 GMT"}], "update_date": "2017-09-26", "authors_parsed": [["Magnani", "Emilia", ""], ["Kersting", "Hans", ""], ["Schober", "Michael", ""], ["Hennig", "Philipp", ""]]}, {"id": "1709.08477", "submitter": "Jaroslav Vond\\v{r}ejc", "authors": "Jaroslav Vond\\v{r}ejc and Tom W. J. de Geus", "title": "Energy-based comparison between the Fourier--Galerkin method and the\n  finite element method", "comments": "24 pages, 10 figures, 2 tables", "journal-ref": "Journal of Computational and Applied Mathematics, 374 (2020),\n  112585", "doi": "10.1016/j.cam.2019.112585", "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Fourier-Galerkin method (in short FFTH) has gained popularity in\nnumerical homogenisation because it can treat problems with a huge number of\ndegrees of freedom. Because the method incorporates the fast Fourier transform\n(FFT) in the linear solver, it is believed to provide an improvement in\ncomputational and memory requirements compared to the conventional finite\nelement method (FEM). Here, we systematically compare these two methods using\nthe energetic norm of local fields, which has the clear physical interpretation\nas being the error in the homogenised properties. This enables the comparison\nof memory and computational requirements at the same level of approximation\naccuracy. We show that the methods' effectiveness relies on the smoothness\n(regularity) of the solution and thus on the material coefficients. Thanks to\nits approximation properties, FEM outperforms FFTH for problems with jumps in\nmaterial coefficients, while ambivalent results are observed for the case that\nthe material coefficients vary continuously in space. FFTH profits from a good\nconditioning of the linear system, independent of the number of degrees of\nfreedom, but generally needs more degrees of freedom to reach the same\napproximation accuracy. More studies are needed for other FFT-based schemes,\nnon-linear problems, and dual problems (which require special treatment in FEM\nbut not in FFTH).\n", "versions": [{"version": "v1", "created": "Mon, 25 Sep 2017 13:23:52 GMT"}, {"version": "v2", "created": "Sat, 16 Nov 2019 11:35:05 GMT"}], "update_date": "2020-02-14", "authors_parsed": [["Vondřejc", "Jaroslav", ""], ["de Geus", "Tom W. J.", ""]]}, {"id": "1709.09147", "submitter": "Giorgio Pennesi", "authors": "P. F. Antonietti and G. Pennesi", "title": "V-cycle multigrid algorithms for discontinuous Galerkin methods on\n  non-nested polytopic meshes", "comments": "26 pages, 23 figures, submitted to Journal of Scientific Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper we analyse the convergence properties of V-cycle multigrid\nalgorithms for the numerical solution of the linear system of equations arising\nfrom discontinuous Galerkin discretization of second-order elliptic partial\ndifferential equations on polytopal meshes. Here, the sequence of spaces that\nstands at the basis of the multigrid scheme is possibly non nested and is\nobtained based on employing agglomeration with possible edge/face coarsening.\nWe prove that the method converges uniformly with respect to the granularity of\nthe grid and the polynomial approximation degree p, provided that the number of\nsmoothing steps, which depends on p, is chosen sufficiently large.\n", "versions": [{"version": "v1", "created": "Tue, 26 Sep 2017 17:32:43 GMT"}, {"version": "v2", "created": "Fri, 29 Sep 2017 08:33:22 GMT"}], "update_date": "2017-10-02", "authors_parsed": [["Antonietti", "P. F.", ""], ["Pennesi", "G.", ""]]}, {"id": "1709.10276", "submitter": "Hiroyuki Kasai", "authors": "Hiroyuki Kasai", "title": "Fast online low-rank tensor subspace tracking by CP decomposition using\n  recursive least squares from incomplete observations", "comments": "Extended version of arXiv:1602.07067 (IEEE International Conference\n  on Acoustics, Speech and Signal Processing (ICASSP 2016))", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of online subspace tracking of a partially observed\nhigh-dimensional data stream corrupted by noise, where we assume that the data\nlie in a low-dimensional linear subspace. This problem is cast as an online\nlow-rank tensor completion problem. We propose a novel online tensor subspace\ntracking algorithm based on the CANDECOMP/PARAFAC (CP) decomposition, dubbed\nOnLine Low-rank Subspace tracking by TEnsor CP Decomposition (OLSTEC). The\nproposed algorithm especially addresses the case in which the subspace of\ninterest is dynamically time-varying. To this end, we build up our proposed\nalgorithm exploiting the recursive least squares (RLS), which is the\nsecond-order gradient algorithm. Numerical evaluations on synthetic datasets\nand real-world datasets such as communication network traffic, environmental\ndata, and surveillance videos, show that the proposed OLSTEC algorithm\noutperforms state-of-the-art online algorithms in terms of the convergence rate\nper iteration.\n", "versions": [{"version": "v1", "created": "Fri, 29 Sep 2017 08:12:39 GMT"}], "update_date": "2017-10-02", "authors_parsed": [["Kasai", "Hiroyuki", ""]]}, {"id": "1709.10339", "submitter": "Pawan Kumar", "authors": "Pawan Kumar", "title": "Preconditioners for Saddle Point Problems on Truncated Domains in Phase\n  Separation Modelling", "comments": "arXiv admin note: text overlap with arXiv:1601.03230", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The discretization of Cahn-Hilliard equation with obstacle potential leads to\na block 2 by 2 non-linear system, where the p1, 1q block has a non-linear and\nnon-smooth term. Recently a globally convergent Newton Schur method was\nproposed for the non-linear Schur complement corresponding to this non-linear\nsystem. The solver may be seen as an inexact Uzawa method which has the falvour\nof an active set method in the sense that the active sets are first identified\nby solving a quadratic obstacle problem corresponding to the p1, 1q block of\nthe block 2 by 2 nonlinear system, and a new decent direction is obtained after\ndiscarding the active set region. The problem becomes linear on nonactive set,\nand corresponds to solving a linear saddle point problem on truncated domains.\nFor solving the quadratic obstacle problem, various optimal multigrid like\nmethods have been proposed. In this paper solvers for the truncated saddle\npoint problem is considered. Three preconditioners are considered, two of them\nhave block diagonal structure, and the third one has block tridiagonal\nstructure. One of the block diagonal preconditioners is obtained by adding\ncertain scaling of stiffness and mass matrices, whereas, the remaining two\ninvolves Schur complement. Eigenvalue bound and condition number estimates are\nderived for the preconditioned untruncated problem. It is shown that the\nextreme eigenvalues of the preconditioned truncated system remain bounded by\nthe extreme eigenvalues of the preconditioned untruncated system. Numerical\nexperiments confirm the optimality of the solvers.\n", "versions": [{"version": "v1", "created": "Thu, 28 Sep 2017 07:53:03 GMT"}, {"version": "v2", "created": "Fri, 29 Jan 2021 20:34:48 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Kumar", "Pawan", ""]]}, {"id": "1709.10352", "submitter": "Fattaneh Bayatbabolghani", "authors": "Fattaneh Bayatbabolghani and Kourosh Parand", "title": "A Comparison Between Laguerre, Hermite, and Sinc Orthogonal Functions", "comments": "31 pages. arXiv admin note: text overlap with arXiv:1604.01454", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A series of problems in different fields such as physics and chemistry are\nmodeled by differential equations. Differential equations are divided into\npartial differential equations and ordinary differential equations which can be\nlinear or nonlinear. One approach to solve those kinds of equations is using\northogonal functions into spectral methods. In this paper, we firstly describe\nLaguerre, Hermite, and Sinc orthogonal functions. Secondly, we select three\ninteresting problems which are modeled as differential equations over the\ninterval $[0, +\\infty)$. Then, we use the collocation method as a spectral\nmethod for solving those selected problems and compare the performance of\nLaguerre, Hermite, and Sinc orthogonal functions in solving those types of\nequations.\n", "versions": [{"version": "v1", "created": "Wed, 27 Sep 2017 15:05:11 GMT"}], "update_date": "2017-10-02", "authors_parsed": [["Bayatbabolghani", "Fattaneh", ""], ["Parand", "Kourosh", ""]]}]