[{"id": "0905.0869", "submitter": "Carlos P. Roca", "authors": "Carlos P. Roca, Jos\\'e A. Cuesta and Angel S\\'anchez", "title": "Imperfect Imitation Can Enhance Cooperation", "comments": "4 pages, 4 figures", "journal-ref": "Europhysics Letters 87, 48005 (2009)", "doi": "10.1209/0295-5075/87/48005", "report-no": null, "categories": "q-bio.PE cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The promotion of cooperation on spatial lattices is an important issue in\nevolutionary game theory. This effect clearly depends on the update rule: it\ndiminishes with stochastic imitative rules whereas it increases with\nunconditional imitation. To study the transition between both regimes, we\npropose a new evolutionary rule, which stochastically combines unconditional\nimitation with another imitative rule. We find that, surprinsingly, in many\nsocial dilemmas this rule yields higher cooperative levels than any of the two\noriginal ones. This nontrivial effect occurs because the basic rules induce a\nseparation of timescales in the microscopic processes at cluster interfaces.\nThe result is robust in the space of 2x2 symmetric games, on regular lattices\nand on scale-free networks.\n", "versions": [{"version": "v1", "created": "Wed, 6 May 2009 16:35:54 GMT"}], "update_date": "2009-11-07", "authors_parsed": [["Roca", "Carlos P.", ""], ["Cuesta", "José A.", ""], ["Sánchez", "Angel", ""]]}, {"id": "0905.1995", "submitter": "Michael Schapira", "authors": "Elchanan Mossel, Christos Papadimitriou, Michael Schapira and Yaron\n  Singer", "title": "VC v. VCG: Inapproximability of Combinatorial Auctions via\n  Generalizations of the VC Dimension", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The existence of incentive-compatible computationally-efficient protocols for\ncombinatorial auctions with decent approximation ratios is the paradigmatic\nproblem in computational mechanism design. It is believed that in many cases\ngood approximations for combinatorial auctions may be unattainable due to an\ninherent clash between truthfulness and computational efficiency. However, to\ndate, researchers lack the machinery to prove such results. In this paper, we\npresent a new approach that we believe holds great promise for making progress\non this important problem. We take the first steps towards the development of\nnew technologies for lower bounding the VC dimension of k-tuples of disjoint\nsets. We apply this machinery to prove the first computational-complexity\ninapproximability results for incentive-compatible mechanisms for combinatorial\nauctions. These results hold for the important class of VCG-based mechanisms,\nand are based on the complexity assumption that NP has no polynomial-size\ncircuits.\n", "versions": [{"version": "v1", "created": "Wed, 13 May 2009 01:50:21 GMT"}], "update_date": "2009-05-14", "authors_parsed": [["Mossel", "Elchanan", ""], ["Papadimitriou", "Christos", ""], ["Schapira", "Michael", ""], ["Singer", "Yaron", ""]]}, {"id": "0905.2659", "submitter": "Walid Saad", "authors": "Walid Saad, Zhu Han, Merouane Debbah, Are Hj{\\o}rungnes, and Tamer\n  Ba\\c{s}ar", "title": "Coalitional Games for Distributed Collaborative Spectrum Sensing in\n  Cognitive Radio Networks", "comments": "in proceedings of IEEE INFOCOM 2009", "journal-ref": "IEEE INFOCOM 2009", "doi": "10.1109/INFCOM.2009.5062135", "report-no": null, "categories": "cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collaborative spectrum sensing among secondary users (SUs) in cognitive\nnetworks is shown to yield a significant performance improvement. However,\nthere exists an inherent trade off between the gains in terms of probability of\ndetection of the primary user (PU) and the costs in terms of false alarm\nprobability. In this paper, we study the impact of this trade off on the\ntopology and the dynamics of a network of SUs seeking to reduce the\ninterference on the PU through collaborative sensing. Moreover, while existing\nliterature mainly focused on centralized solutions for collaborative sensing,\nwe propose distributed collaboration strategies through game theory. We model\nthe problem as a non-transferable coalitional game, and propose a distributed\nalgorithm for coalition formation through simple merge and split rules. Through\nthe proposed algorithm, SUs can autonomously collaborate and self-organize into\ndisjoint independent coalitions, while maximizing their detection probability\ntaking into account the cooperation costs (in terms of false alarm). We study\nthe stability of the resulting network structure, and show that a maximum\nnumber of SUs per formed coalition exists for the proposed utility model.\nSimulation results show that the proposed algorithm allows a reduction of up to\n86.6% of the average missing probability per SU (probability of missing the\ndetection of the PU) relative to the non-cooperative case, while maintaining a\ncertain false alarm level. In addition, through simulations, we compare the\nperformance of the proposed distributed solution with respect to an optimal\ncentralized solution that minimizes the average missing probability per SU.\nFinally, the results also show how the proposed algorithm autonomously adapts\nthe network topology to environmental changes such as mobility.\n", "versions": [{"version": "v1", "created": "Sat, 16 May 2009 07:12:14 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Saad", "Walid", ""], ["Han", "Zhu", ""], ["Debbah", "Merouane", ""], ["Hjørungnes", "Are", ""], ["Başar", "Tamer", ""]]}, {"id": "0905.3012", "submitter": "Ye Du", "authors": "Ye Du", "title": "On the Complexity of Deciding Degeneracy in Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that it is NP-Complete to decide whether a bimatrix game is\ndegenerate and it is Co-NP-Complete to decide whether a bimatrix game is\nnondegenerate.\n", "versions": [{"version": "v1", "created": "Tue, 19 May 2009 01:40:55 GMT"}], "update_date": "2009-05-20", "authors_parsed": [["Du", "Ye", ""]]}, {"id": "0905.3191", "submitter": "Tanmoy Chakraborty", "authors": "Tanmoy Chakraborty, Zhiyi Huang, Sanjeev Khanna", "title": "Dynamic and Non-Uniform Pricing Strategies for Revenue Maximization", "comments": "23 pages, 0 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the Item Pricing problem for revenue maximization in the limited\nsupply setting, where a single seller with $n$ items caters to $m$ buyers with\nunknown subadditive valuation functions who arrive in a sequence. The seller\nsets the prices on individual items. Each buyer buys a subset of yet unsold\nitems that maximizes her utility. Our goal is to design pricing strategies that\nguarantee an expected revenue that is within a small factor $\\alpha$ of the\nmaximum possible social welfare -- an upper bound on the maximum revenue that\ncan be generated. Most earlier work has focused on the unlimited supply\nsetting, where selling items to some buyer does not affect their availability\nto the future buyers. Balcan et. al. (EC 2008) studied the limited supply\nsetting, giving a randomized strategy that assigns a single price to all items\n(uniform strategy), and never changes it (static strategy), that gives an\n$2^{O(\\sqrt{\\log n \\log \\log n})}$-approximation, and moreover, no static\nuniform pricing strategy can give better than $2^{\\Omega(\\log^{1/4} n)}$-\napproximation. We improve this lower bound to $2^{\\Omega(sqrt{\\log n})}$.\n  We consider dynamic uniform strategies, which can change the price upon the\narrival of each buyer but the price on all unsold items is the same at all\ntimes, and static non-uniform strategies, which can assign different prices to\ndifferent items but can never change it after setting it initially. We design\nsuch pricing strategies that give a poly-logarithmic approximation to maximum\nrevenue. Thus in the limited supply setting, our results highlight a strong\nseparation between the power of dynamic and non-uniform pricing versus static\nuniform pricing. To our knowledge, this is the first non-trivial analysis of\ndynamic and non-uniform pricing schemes for revenue maximization.\n", "versions": [{"version": "v1", "created": "Tue, 19 May 2009 22:15:12 GMT"}], "update_date": "2009-05-21", "authors_parsed": [["Chakraborty", "Tanmoy", ""], ["Huang", "Zhiyi", ""], ["Khanna", "Sanjeev", ""]]}, {"id": "0905.3267", "submitter": "Asim Ghosh", "authors": "Asim Ghosh, Anindya Sundar Chakrabarti, Bikas K. Chakrabarti", "title": "Kolkata Paise Restaurant Problem in Some Uniform Learning Strategy\n  Limits", "comments": "to be published in \"Econophysics & Economics of Games, Social Choices\n  & Quantitative Techniques\", Proc. Econophys-Kolkata IV, Springer, Milan\n  (2009)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the dynamics of some uniform learning strategy limits or a\nprobabilistic version of the \"Kolkata Paise Restaurant\" problem, where N agents\nchoose among N equally priced but differently ranked restaurants every evening\nsuch that each agent can get dinner in the best possible ranked restaurant\n(each serving only one customer and the rest arriving there going without\ndinner that evening). We consider the learning to be uniform among the agents\nand assume that each follow the same probabilistic strategy dependent on the\ninformation of the past successes in the game. The numerical results for\nutilization of the restaurants in some limiting cases are analytically\nexamined.\n", "versions": [{"version": "v1", "created": "Wed, 20 May 2009 11:40:31 GMT"}], "update_date": "2009-05-21", "authors_parsed": [["Ghosh", "Asim", ""], ["Chakrabarti", "Anindya Sundar", ""], ["Chakrabarti", "Bikas K.", ""]]}, {"id": "0905.3348", "submitter": "Haris Aziz", "authors": "Haris Aziz and Mike Paterson", "title": "False name manipulations in weighted voting games: splitting, merging\n  and annexation", "comments": "Preprint of AAMAS 2009 (Eighth International Conference on Autonomous\n  Agents and Multiagent Systems) paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important aspect of mechanism design in social choice protocols and\nmultiagent systems is to discourage insincere and manipulative behaviour. We\nexamine the computational complexity of false-name manipulation in weighted\nvoting games which are an important class of coalitional voting games. Weighted\nvoting games have received increased interest in the multiagent community due\nto their compact representation and ability to model coalitional formation\nscenarios. Bachrach and Elkind in their AAMAS 2008 paper examined divide and\nconquer false-name manipulation in weighted voting games from the point of view\nof Shapley-Shubik index. We analyse the corresponding case of the Banzhaf index\nand check how much the Banzhaf index of a player increases or decreases if it\nsplits up into sub-players. A pseudo-polynomial algorithm to find the optimal\nsplit is also provided. Bachrach and Elkind also mentioned manipulation via\nmerging as an open problem. In the paper, we examine the cases where a player\nannexes other players or merges with them to increase their Banzhaf index or\nShapley-Shubik index payoff. We characterize the computational complexity of\nsuch manipulations and provide limits to the manipulation. The annexation\nnon-monotonicity paradox is also discovered in the case of the Banzhaf index.\nThe results give insight into coalition formation and manipulation.\n", "versions": [{"version": "v1", "created": "Wed, 20 May 2009 16:28:58 GMT"}], "update_date": "2009-05-21", "authors_parsed": [["Aziz", "Haris", ""], ["Paterson", "Mike", ""]]}, {"id": "0905.3356", "submitter": "Rom\\`an R. Zapatrin", "authors": "George Parfionov, Rom\\`an Zapatrin", "title": "Memento Ludi: Information Retrieval from a Game-Theoretic Perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a macro-model of information retrieval process using Game Theory\nas a mathematical theory of conflicts. We represent the participants of the\nInformation Retrieval process as a game of two abstract players. The first\nplayer is the `intellectual crowd' of users of search engines, the second is a\ncommunity of information retrieval systems. In order to apply Game Theory, we\ntreat search log data as Nash equilibrium strategies and solve the inverse\nproblem of finding appropriate payoff functions. For that, we suggest a\nparticular model, which we call Alpha model. Within this model, we suggest a\nmethod, called shifting, which makes it possible to partially control the\nbehavior of massive users.\n  This Note is addressed to researchers in both game theory (providing a new\nclass of real life problems) and information retrieval, for whom we present new\ntechniques to control the IR environment.\n", "versions": [{"version": "v1", "created": "Wed, 20 May 2009 17:04:07 GMT"}], "update_date": "2009-05-21", "authors_parsed": [["Parfionov", "George", ""], ["Zapatrin", "Romàn", ""]]}, {"id": "0905.3429", "submitter": "Aaron Roth", "authors": "Moshe Babaioff, Liad Blumrosen, Aaron L. Roth", "title": "Auctions with Online Supply", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of selling identical goods to n unit-demand bidders in a\nsetting in which the total supply of goods is unknown to the mechanism. Items\narrive dynamically, and the seller must make the allocation and payment\ndecisions online with the goal of maximizing social welfare. We consider two\nmodels of unknown supply: the adversarial supply model, in which the mechanism\nmust produce a welfare guarantee for any arbitrary supply, and the stochastic\nsupply model, in which supply is drawn from a distribution known to the\nmechanism, and the mechanism need only provide a welfare guarantee in\nexpectation.\n  Our main result is a separation between these two models. We show that all\ntruthful mechanisms, even randomized, achieve a diminishing fraction of the\noptimal social welfare (namely, no better than a Omega(loglog n) approximation)\nin the adversarial setting. In sharp contrast, in the stochastic model, under a\nstandard monotone hazard-rate condition, we present a truthful mechanism that\nachieves a constant approximation. We show that the monotone hazard rate\ncondition is necessary, and also characterize a natural subclass of truthful\nmechanisms in our setting, the set of online-envy-free mechanisms. All of the\nmechanisms we present fall into this class, and we prove almost optimal lower\nbounds for such mechanisms. Since auctions with unknown supply are regularly\nrun in many online-advertising settings, our main results emphasize the\nimportance of considering distributional information in the design of auctions\nin such environments.\n", "versions": [{"version": "v1", "created": "Thu, 21 May 2009 03:12:19 GMT"}], "update_date": "2009-05-22", "authors_parsed": [["Babaioff", "Moshe", ""], ["Blumrosen", "Liad", ""], ["Roth", "Aaron L.", ""]]}, {"id": "0905.3548", "submitter": "Dusko Pavlovic", "authors": "Dusko Pavlovic", "title": "A semantical approach to equilibria and rationality", "comments": "18 pages; Proceedings of CALCO 2009", "journal-ref": null, "doi": "10.1007/978-3-642-03741-2_22", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game theoretic equilibria are mathematical expressions of rationality.\nRational agents are used to model not only humans and their software\nrepresentatives, but also organisms, populations, species and genes,\ninteracting with each other and with the environment. Rational behaviors are\nachieved not only through conscious reasoning, but also through spontaneous\nstabilization at equilibrium points.\n  Formal theories of rationality are usually guided by informal intuitions,\nwhich are acquired by observing some concrete economic, biological, or network\nprocesses. Treating such processes as instances of computation, we reconstruct\nand refine some basic notions of equilibrium and rationality from the some\nbasic structures of computation.\n  It is, of course, well known that equilibria arise as fixed points; the point\nis that semantics of computation of fixed points seems to be providing novel\nmethods, algebraic and coalgebraic, for reasoning about them.\n", "versions": [{"version": "v1", "created": "Thu, 21 May 2009 19:36:11 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Pavlovic", "Dusko", ""]]}, {"id": "0905.3640", "submitter": "Mattheos Protopapas", "authors": "Mattheos K. Protopapas, Elias B. Kosmatopoulos, Francesco Battaglia", "title": "Coevolutionary Genetic Algorithms for Establishing Nash Equilibrium in\n  Symmetric Cournot Games", "comments": "18 pages, 4 figures", "journal-ref": "Advances in Decision Sciences, vol. 2010, Article ID 573107", "doi": "10.1155/2010/573107", "report-no": null, "categories": "cs.GT cs.LG", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We use co-evolutionary genetic algorithms to model the players' learning\nprocess in several Cournot models, and evaluate them in terms of their\nconvergence to the Nash Equilibrium. The \"social-learning\" versions of the two\nco-evolutionary algorithms we introduce, establish Nash Equilibrium in those\nmodels, in contrast to the \"individual learning\" versions which, as we see\nhere, do not imply the convergence of the players' strategies to the Nash\noutcome. When players use \"canonical co-evolutionary genetic algorithms\" as\nlearning algorithms, the process of the game is an ergodic Markov Chain, and\ntherefore we analyze simulation results using both the relevant methodology and\nmore general statistical tests, to find that in the \"social\" case, states\nleading to NE play are highly frequent at the stationary distribution of the\nchain, in contrast to the \"individual learning\" case, when NE is not reached at\nall in our simulations; to find that the expected Hamming distance of the\nstates at the limiting distribution from the \"NE state\" is significantly\nsmaller in the \"social\" than in the \"individual learning case\"; to estimate the\nexpected time that the \"social\" algorithms need to get to the \"NE state\" and\nverify their robustness and finally to show that a large fraction of the games\nplayed are indeed at the Nash Equilibrium.\n", "versions": [{"version": "v1", "created": "Fri, 22 May 2009 19:07:21 GMT"}], "update_date": "2010-05-13", "authors_parsed": [["Protopapas", "Mattheos K.", ""], ["Kosmatopoulos", "Elias B.", ""], ["Battaglia", "Francesco", ""]]}, {"id": "0905.3709", "submitter": "Rustam Tagiew", "authors": "Rustam Tagiew", "title": "Towards Barter Double Auction as Model for Bilateral Social Cooperations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The idea of this paper is an advanced game concept. This concept is expected\nto model non-monetary bilateral cooperations between self-interested agents.\nSuch non-monetary cases are social cooperations like allocation of high level\njobs or sexual relationships among humans. In a barter double auction, there is\na big amount of agents. Every agent has a vector of parameters which specifies\nhis demand and a vector which specifies his offer. Two agents can achieve a\ncommitment through barter exchange. The subjective satisfaction level (a number\nbetween 0% and 100%) of an agent is as high as small is the distance between\nhis demand and the accepted offer. This paper introduces some facets of this\ncomplex game concept.\n", "versions": [{"version": "v1", "created": "Fri, 22 May 2009 15:39:19 GMT"}], "update_date": "2009-05-25", "authors_parsed": [["Tagiew", "Rustam", ""]]}, {"id": "0905.3885", "submitter": "Piotr Faliszewski", "authors": "E. Elkind, P. Faliszewski, A. Slinko", "title": "Swap Bribery", "comments": "17 pages", "journal-ref": null, "doi": "10.1007/978-3-642-04645-2_27", "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In voting theory, bribery is a form of manipulative behavior in which an\nexternal actor (the briber) offers to pay the voters to change their votes in\norder to get her preferred candidate elected. We investigate a model of bribery\nwhere the price of each vote depends on the amount of change that the voter is\nasked to implement. Specifically, in our model the briber can change a voter's\npreference list by paying for a sequence of swaps of consecutive candidates.\nEach swap may have a different price; the price of a bribery is the sum of the\nprices of all swaps that it involves. We prove complexity results for this\nmodel, which we call swap bribery, for a broad class of election systems,\nincluding variants of approval and k-approval, Borda, Copeland, and maximin.\n", "versions": [{"version": "v1", "created": "Sun, 24 May 2009 10:01:53 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Elkind", "E.", ""], ["Faliszewski", "P.", ""], ["Slinko", "A.", ""]]}, {"id": "0905.4057", "submitter": "Waleed Saad", "authors": "Walid Saad, Zhu Han, Merouane Debbah, Are Hj{\\o}rungnes and Tamer\n  Basar", "title": "Coalitional Game Theory for Communication Networks: A Tutorial", "comments": "IEEE Signal Processing Magazine, Special Issue on Game Theory, to\n  appear, 2009. IEEE Signal Processing Magazine, Special Issue on Game Theory,\n  to appear, 2009", "journal-ref": null, "doi": "10.1109/MSP.2009.000000", "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game theoretical techniques have recently become prevalent in many\nengineering applications, notably in communications. With the emergence of\ncooperation as a new communication paradigm, and the need for self-organizing,\ndecentralized, and autonomic networks, it has become imperative to seek\nsuitable game theoretical tools that allow to analyze and study the behavior\nand interactions of the nodes in future communication networks. In this\ncontext, this tutorial introduces the concepts of cooperative game theory,\nnamely coalitional games, and their potential applications in communication and\nwireless networks. For this purpose, we classify coalitional games into three\ncategories: Canonical coalitional games, coalition formation games, and\ncoalitional graph games. This new classification represents an\napplication-oriented approach for understanding and analyzing coalitional\ngames. For each class of coalitional games, we present the fundamental\ncomponents, introduce the key properties, mathematical techniques, and solution\nconcepts, and describe the methodologies for applying these games in several\napplications drawn from the state-of-the-art research in communications. In a\nnutshell, this article constitutes a unified treatment of coalitional game\ntheory tailored to the demands of communications and network engineers.\n", "versions": [{"version": "v1", "created": "Mon, 25 May 2009 18:50:02 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Saad", "Walid", ""], ["Han", "Zhu", ""], ["Debbah", "Merouane", ""], ["Hjørungnes", "Are", ""], ["Basar", "Tamer", ""]]}]