[{"id": "1202.0116", "submitter": "Yuriy Ostapov", "authors": "Yuriy Ostapov", "title": "Inference and Plausible Reasoning in a Natural Language Understanding\n  System Based on Object-Oriented Semantics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Algorithms of inference in a computer system oriented to input and semantic\nprocessing of text information are presented. Such inference is necessary for\nlogical questions when the direct comparison of objects from a question and\ndatabase can not give a result. The following classes of problems are\nconsidered: a check of hypotheses for persons and non-typical actions, the\ndetermination of persons and circumstances for non-typical actions, planning\nactions, the determination of event cause and state of persons. To form an\nanswer both deduction and plausible reasoning are used. As a knowledge domain\nunder consideration is social behavior of persons, plausible reasoning is based\non laws of social psychology. Proposed algorithms of inference and plausible\nreasoning can be realized in computer systems closely connected with text\nprocessing (criminology, operation of business, medicine, document systems).\n", "versions": [{"version": "v1", "created": "Wed, 1 Feb 2012 08:36:50 GMT"}], "update_date": "2012-02-02", "authors_parsed": [["Ostapov", "Yuriy", ""]]}, {"id": "1202.0617", "submitter": "Dr. Nitin", "authors": "Nitin, Ankush Bansal, Siddhartha Mahadev Sharma, Kapil Kumar, Anuj\n  Aggarwal, Sheenu Goyal, Kanika Choudhary, Kunal Chawla, Kunal Jain and Manav\n  Bhasin", "title": "Classification of Flames in Computer Mediated Communications", "comments": "6 pages, 4 figures", "journal-ref": "International Journal of Computer Applications (0975-8887), Volume\n  14 - No.6, February 2011", "doi": null, "report-no": "pxc3872505", "categories": "cs.SI cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer Mediated Communication (CMC) has brought about a revolution in the\nway the world communicates with each other. With the increasing number of\npeople, interacting through the internet and the rise of new platforms and\ntechnologies has brought together the people from different social, cultural\nand geographical backgrounds to present their thoughts, ideas and opinions on\ntopics of their interest. CMC has, in some cases, gave users more freedom to\nexpress themselves as compared to Face-to-face communication. This has also led\nto rise in the use of hostile and aggressive language and terminologies\nuninhibitedly. Since such use of language is detrimental to the discussion\nprocess and affects the audience and individuals negatively, efforts are being\ntaken to control them. The research sees the need to understand the concept of\nflaming and hence attempts to classify them in order to give a better\nunderstanding of it. The classification is done on the basis of type of flame\ncontent being presented and the Style in which they are presented.\n", "versions": [{"version": "v1", "created": "Fri, 3 Feb 2012 07:09:23 GMT"}, {"version": "v2", "created": "Fri, 17 Feb 2012 05:14:17 GMT"}], "update_date": "2012-02-20", "authors_parsed": [["Nitin", "", ""], ["Bansal", "Ankush", ""], ["Sharma", "Siddhartha Mahadev", ""], ["Kumar", "Kapil", ""], ["Aggarwal", "Anuj", ""], ["Goyal", "Sheenu", ""], ["Choudhary", "Kanika", ""], ["Chawla", "Kunal", ""], ["Jain", "Kunal", ""], ["Bhasin", "Manav", ""]]}, {"id": "1202.1054", "submitter": "Alex Rudnick", "authors": "Alex Rudnick", "title": "Considering a resource-light approach to learning verb valencies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Here we describe work on learning the subcategories of verbs in a\nmorphologically rich language using only minimal linguistic resources. Our goal\nis to learn verb subcategorizations for Quechua, an under-resourced\nmorphologically rich language, from an unannotated corpus. We compare results\nfrom applying this approach to an unannotated Arabic corpus with those achieved\nby processing the same text in treebank form. The original plan was to use only\na morphological analyzer and an unannotated corpus, but experiments suggest\nthat this approach by itself will not be effective for learning the\ncombinatorial potential of Arabic verbs in general. The lower bound on\nresources for acquiring this information is somewhat higher, apparently\nrequiring a a part-of-speech tagger and chunker for most languages, and a\nmorphological disambiguater for Arabic.\n", "versions": [{"version": "v1", "created": "Mon, 6 Feb 2012 06:33:03 GMT"}], "update_date": "2012-02-07", "authors_parsed": [["Rudnick", "Alex", ""]]}, {"id": "1202.1568", "submitter": "Seungyeon Kim", "authors": "Seungyeon Kim, Fuxin Li, Guy Lebanon, and Irfan Essa", "title": "Beyond Sentiment: The Manifold of Human Emotions", "comments": "15 pages, 7 figures", "journal-ref": "Proceedings of the 16 International Conference on Artificial\n  Intelligence and Statistics (AISTATS) 2013, Scottsdale, AZ, USA. Volume 31 of\n  JMLR: W&CP 31", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sentiment analysis predicts the presence of positive or negative emotions in\na text document. In this paper we consider higher dimensional extensions of the\nsentiment concept, which represent a richer set of human emotions. Our approach\ngoes beyond previous work in that our model contains a continuous manifold\nrather than a finite set of human emotions. We investigate the resulting model,\ncompare it to psychological observations, and explore its predictive\ncapabilities. Besides obtaining significant improvements over a baseline\nwithout manifold, we are also able to visualize different notions of positive\nsentiment in different domains.\n", "versions": [{"version": "v1", "created": "Wed, 8 Feb 2012 00:49:36 GMT"}, {"version": "v2", "created": "Thu, 8 Aug 2013 16:25:27 GMT"}], "update_date": "2013-08-09", "authors_parsed": [["Kim", "Seungyeon", ""], ["Li", "Fuxin", ""], ["Lebanon", "Guy", ""], ["Essa", "Irfan", ""]]}, {"id": "1202.2518", "submitter": "Liang Wang", "authors": "Wang Liang", "title": "Segmenting DNA sequence into `words'", "comments": "12 pages,2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a novel method to segment/decode DNA sequences based on\nn-grams statistical language model. Firstly, we find the length of most DNA\n'words' is 12 to 15 bps by analyzing the genomes of 12 model species. Then we\ndesign an unsupervised probability based approach to segment the DNA sequences.\nThe benchmark of segmenting method is also proposed.\n", "versions": [{"version": "v1", "created": "Sun, 12 Feb 2012 11:23:38 GMT"}, {"version": "v2", "created": "Thu, 23 Feb 2012 02:39:32 GMT"}, {"version": "v3", "created": "Tue, 2 Oct 2012 12:49:43 GMT"}, {"version": "v4", "created": "Sat, 22 Jun 2013 10:14:11 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Liang", "Wang", ""]]}, {"id": "1202.3752", "submitter": "Nebojsa Jojic", "authors": "Nebojsa Jojic, Alessandro Perina", "title": "Multidimensional counting grids: Inferring word order from disordered\n  bags of words", "comments": null, "journal-ref": null, "doi": null, "report-no": "UAI-P-2011-PG-547-556", "categories": "cs.IR cs.CL cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Models of bags of words typically assume topic mixing so that the words in a\nsingle bag come from a limited number of topics. We show here that many sets of\nbag of words exhibit a very different pattern of variation than the patterns\nthat are efficiently captured by topic mixing. In many cases, from one bag of\nwords to the next, the words disappear and new ones appear as if the theme\nslowly and smoothly shifted across documents (providing that the documents are\nsomehow ordered). Examples of latent structure that describe such ordering are\neasily imagined. For example, the advancement of the date of the news stories\nis reflected in a smooth change over the theme of the day as certain evolving\nnews stories fall out of favor and new events create new stories. Overlaps\namong the stories of consecutive days can be modeled by using windows over\nlinearly arranged tight distributions over words. We show here that such\nstrategy can be extended to multiple dimensions and cases where the ordering of\ndata is not readily obvious. We demonstrate that this way of modeling\ncovariation in word occurrences outperforms standard topic models in\nclassification and prediction tasks in applications in biology, text modeling\nand computer vision.\n", "versions": [{"version": "v1", "created": "Tue, 14 Feb 2012 16:41:17 GMT"}], "update_date": "2012-02-20", "authors_parsed": [["Jojic", "Nebojsa", ""], ["Perina", "Alessandro", ""]]}, {"id": "1202.4837", "submitter": "EPTCS", "authors": "Jordi Saludes (UPC), Sebastian Xamb\\'o (UPC)", "title": "The GF Mathematics Library", "comments": "In Proceedings THedu'11, arXiv:1202.4535", "journal-ref": "EPTCS 79, 2012, pp. 102-110", "doi": "10.4204/EPTCS.79.6", "report-no": null, "categories": "cs.MS cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is devoted to present the Mathematics Grammar Library, a system\nfor multilingual mathematical text processing. We explain the context in which\nit originated, its current design and functionality and the current development\ngoals. We also present two prototype services and comment on possible future\napplications in the area of artificial mathematics assistants.\n", "versions": [{"version": "v1", "created": "Wed, 22 Feb 2012 06:43:11 GMT"}], "update_date": "2012-02-23", "authors_parsed": [["Saludes", "Jordi", "", "UPC"], ["Xambó", "Sebastian", "", "UPC"]]}, {"id": "1202.5913", "submitter": "Ralph Stoop", "authors": "Ruedi Stoop, Patrick N\\\"uesch, Ralph Lukas Stoop, and Leonid\n  Bunimovich", "title": "Fly out-smarts man", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CL physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Precopulatory courtship is a high-cost, non-well understood animal world\nmystery. Drosophila's (=D.'s) precopulatory courtship not only shows marked\nstructural similarities with mammalian courtship, but also with human spoken\nlanguage. This suggests the study of purpose, modalities and in particular of\nthe power of this language and to compare it to human language. Following a\nmathematical symbolic dynamics approach, we translate courtship videos of D.'s\nbody language into a formal language. This approach made it possible to show\nthat D. may use its body language to express individual information -\ninformation that may be important for evolutionary optimization, on top of the\nsexual group membership. Here, we use Chomsky's hierarchical language\nclassification to characterize the power of D.'s body language, and then\ncompare it with the power of languages spoken by humans. We find that from a\nformal language point of view, D.'s body language is at least as powerful as\nthe languages spoken by humans. From this we conclude that human intellect\ncannot be the direct consequence of the formal grammar complexity of human\nlanguage.\n", "versions": [{"version": "v1", "created": "Mon, 27 Feb 2012 12:44:23 GMT"}], "update_date": "2012-02-28", "authors_parsed": [["Stoop", "Ruedi", ""], ["Nüesch", "Patrick", ""], ["Stoop", "Ralph Lukas", ""], ["Bunimovich", "Leonid", ""]]}, {"id": "1202.6266", "submitter": "Florentina Pintea", "authors": "Ali Sadiqui, Noureddine Chenfour", "title": "Realisation d'un systeme de reconnaissance automatique de la parole\n  arabe base sur CMU Sphinx", "comments": null, "journal-ref": "Ann. Univ. Tibiscus Comp. Sci. Series VIII / 1 (2010), 27-40", "doi": null, "report-no": "14 pages", "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the continuation of the work completed by Satori and all.\n[SCH07] by the realization of an automatic speech recognition system (ASR) for\nArabic language based SPHINX 4 system. The previous work was limited to the\nrecognition of the first ten digits, whereas the present work is a remarkable\nprojection consisting in continuous Arabic speech recognition with a rate of\nrecognition of surroundings 96%.\n", "versions": [{"version": "v1", "created": "Tue, 28 Feb 2012 16:04:36 GMT"}], "update_date": "2012-02-29", "authors_parsed": [["Sadiqui", "Ali", ""], ["Chenfour", "Noureddine", ""]]}, {"id": "1202.6583", "submitter": "Luis Quesada", "authors": "Luis Quesada, Fernando Berzal, Francisco J. Cortijo", "title": "A Lexical Analysis Tool with Ambiguity Support", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lexical ambiguities naturally arise in languages. We present Lamb, a lexical\nanalyzer that produces a lexical analysis graph describing all the possible\nsequences of tokens that can be found within the input string. Parsers can\nprocess such lexical analysis graphs and discard any sequence of tokens that\ndoes not produce a valid syntactic sentence, therefore performing, together\nwith Lamb, a context-sensitive lexical analysis in lexically-ambiguous language\nspecifications.\n", "versions": [{"version": "v1", "created": "Wed, 29 Feb 2012 15:59:54 GMT"}], "update_date": "2012-03-01", "authors_parsed": [["Quesada", "Luis", ""], ["Berzal", "Fernando", ""], ["Cortijo", "Francisco J.", ""]]}]