[{"id": "0812.2769", "submitter": "Dan Gordon", "authors": "Dan Gordon (Univ. of Haifa), Rachel Gordon (Technion-Israel Inst. of\n  Technology)", "title": "Geometric scaling: a simple preconditioner for certain linear systems\n  with discontinuous coefficients", "comments": "22 pages, 13 tables, 14 figures, 22 references. Submitted for\n  publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linear systems with large differences between coefficients (\"discontinuous\ncoefficients\") arise in many cases in which partial differential\nequations(PDEs) model physical phenomena involving heterogeneous media. The\nstandard approach to solving such problems is to use domain decomposition\ntechniques, with domain boundaries conforming to the boundaries between the\ndifferent media. This approach can be difficult to implement when the geometry\nof the domain boundaries is complicated or the grid is unstructured. This work\nexamines the simple preconditioning technique of scaling the equations by\ndividing each equation by the Lp-norm of its coefficients. This preconditioning\nis called geometric scaling (GS). It has long been known that diagonal scaling\ncan be useful in improving convergence, but there is no study on the general\nusefulness of this approach for discontinuous coefficients. GS was tested on\nseveral nonsymmetric linear systems with discontinuous coefficients derived\nfrom convection-diffusion elliptic PDEs with small to moderate convection\nterms. It is shown that GS improved the convergence properties of restarted\nGMRES and Bi-CGSTAB, with and without the ILUT preconditioner. GS was also\nshown to improve the distribution of the eigenvalues by reducing their\nconcentration around the origin very significantly.\n", "versions": [{"version": "v1", "created": "Mon, 15 Dec 2008 11:35:17 GMT"}, {"version": "v2", "created": "Mon, 4 May 2009 15:31:09 GMT"}], "update_date": "2009-05-04", "authors_parsed": [["Gordon", "Dan", "", "Univ. of Haifa"], ["Gordon", "Rachel", "", "Technion-Israel Inst. of\n  Technology"]]}]