[{"id": "1212.0310", "submitter": "Majid Rezazadeh", "authors": "Mahsa Moazez, Farshad Safaei, Majid Rezazadeh", "title": "Design and Implementation of Multistage Interconnection Networks for SoC\n  Networks", "comments": "11 Pages, 14 Figures; International Journal of Computer Science,\n  Engineering and Information Technology (IJCSEIT), Vol.2, No.5, October 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper the focus is on a family of Interconnection Networks (INs)\nknown as Multistage Interconnection Networks (MINs). When it is exploited in\nNetwork-on-Chip (NoC) architecture designs, smaller circuit area, lower power\nconsumption, less junctions and broader bandwidth can be achieved. Each MIN can\nbe considered as an alternative for an NoC architecture design for its simple\ntopology and easy scalability with low degree. This paper includes two major\ncontributions. First, it compares the performance of seven prominent MINs (i.e.\nOmega, Butterfly, Flattened Butterfly, Flattened Baseline, Generalized Cube,\nBene\\v{s} and Clos networks) based on 45nm-CMOS technology and under different\ntypes of Synthetic and Trace-driven workloads. Second, a network called\nMeta-Flattened Network (MFN), was introduced that can decrease the blocking\nprobability by means of reduction the number of hops and increase the\nintermediate paths between stages. This is also led into significant decrease\nin power consumption.\n", "versions": [{"version": "v1", "created": "Mon, 3 Dec 2012 08:28:13 GMT"}], "update_date": "2012-12-04", "authors_parsed": [["Moazez", "Mahsa", ""], ["Safaei", "Farshad", ""], ["Rezazadeh", "Majid", ""]]}, {"id": "1212.2874", "submitter": "Prasun Ghosal PhD", "authors": "Prasun Ghosal, Sankar Karmakar", "title": "Diametrical Mesh Of Tree (D2D-MoT) Architecture: A Novel Routing\n  Solution For NoC", "comments": "5 pages", "journal-ref": "International Journal of Advanced Engineering Technology (IJAET),\n  Vol.III, Issue I, 2012, pp. 243-247", "doi": null, "report-no": null, "categories": "cs.ET cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network-on-chip (NoC) is a new aspect for designing of future System-On-Chips\n(SoC) where a vast number of IP cores are connected through interconnection\nnetwork. The communication between the nodes occurred by routing packets rather\nthan wires. It supports high degree of scalability, reusability and parallelism\nin communication. In this paper, we present a Mesh routing architecture, which\nis called Diametrical 2D Mesh of Tree, based on Mesh-of-Tree (MoT) routing and\nDiametrical 2D Mesh. It has the advantage of having small diameter as well as\nlarge bisection width and small node degree clubbed with being the fastest\nnetwork in terms of speed. The routing algorithm ensures that the packets will\nalways reach from source to sink through shortest path and is deadlock free.\n", "versions": [{"version": "v1", "created": "Wed, 12 Dec 2012 16:37:23 GMT"}], "update_date": "2012-12-13", "authors_parsed": [["Ghosal", "Prasun", ""], ["Karmakar", "Sankar", ""]]}, {"id": "1212.6303", "submitter": "Sangeet  Saha", "authors": "Sangeet Saha, Chandrajit pal, Rourab paul, Satyabrata Maity, Suman Sau", "title": "A brief experience on journey through hardware developments for image\n  processing and its applications on Cryptography", "comments": "In the proceedings of 100th Indian Science Congress,03-07\n  January,Kolkata", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.CR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of embedded applications on image and video\nprocessing,communication and cryptography domain has been taking a larger space\nin current research era. Improvement of pictorial information for betterment of\nhuman perception like deblurring, de-noising in several fields such as\nsatellite imaging, medical imaging etc are renewed research thrust.\nSpecifically we would like to elaborate our experience on the significance of\ncomputer vision as one of the domains where hardware implemented algorithms\nperform far better than those implemented through software. So far embedded\ndesign engineers have successfully implemented their designs by means of\nApplication Specific Integrated Circuits (ASICs) and/or Digital Signal\nProcessors (DSP), however with the advancement of VLSI technology a very\npowerful hardware device namely the Field Programmable Gate Array (FPGA)\ncombining the key advantages of ASICs and DSPs was developed which have the\npossibility of reprogramming making them a very attractive device for rapid\nprototyping.Communication of image and video data in multiple FPGA is no longer\nfar away from the thrust of secured transmission among them, and then the\nrelevance of cryptography is indeed unavoidable. This paper shows how the\nXilinx hardware development platform as well Mathworks Matlab can be used to\ndevelop hardware based computer vision algorithms and its corresponding crypto\ntransmission channel between multiple FPGA platform from a system level\napproach, making it favourable for developing a hardware-software co-design\nenvironment.\n", "versions": [{"version": "v1", "created": "Thu, 27 Dec 2012 05:16:25 GMT"}], "update_date": "2013-01-14", "authors_parsed": [["Saha", "Sangeet", ""], ["pal", "Chandrajit", ""], ["paul", "Rourab", ""], ["Maity", "Satyabrata", ""], ["Sau", "Suman", ""]]}]