[{"id": "1201.0351", "submitter": "Simon Bogner", "authors": "Simon Bogner and Ulrich R\\\"ude", "title": "Liquid-gas-solid flows with lattice Boltzmann: Simulation of floating\n  bodies", "comments": "22 pages, Preprint submitted to Computers and Mathematics with\n  Applications Special Issue ICMMES 2011, Proceedings of the Eighth\n  International Conference for Mesoscopic Methods in Engineering and Science", "journal-ref": null, "doi": "10.1016/j.camwa.2012.09.012", "report-no": null, "categories": "cs.CE physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a model for the simulation of liquid-gas-solid flows by\nmeans of the lattice Boltzmann method. The approach is built upon previous\nworks for the simulation of liquid-solid particle suspensions on the one hand,\nand on a liquid-gas free surface model on the other. We show how the two\napproaches can be unified by a novel set of dynamic cell conversion rules. For\nevaluation, we concentrate on the rotational stability of non-spherical rigid\nbodies floating on a plane water surface - a classical hydrostatic problem\nknown from naval architecture. We show the consistency of our method in this\nkind of flows and obtain convergence towards the ideal solution for the\nmeasured heeling stability of a floating box.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jan 2012 13:34:55 GMT"}], "update_date": "2014-01-08", "authors_parsed": [["Bogner", "Simon", ""], ["Rüde", "Ulrich", ""]]}, {"id": "1201.0469", "submitter": "Kin Cheong Sou", "authors": "Kin Cheong Sou, Henrik Sandberg and Karl Henrik Johansson", "title": "Computing Critical $k$-tuples in Power Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper the problem of finding the sparsest (i.e., minimum cardinality)\ncritical $k$-tuple including one arbitrarily specified measurement is\nconsidered. The solution to this problem can be used to identify weak points in\nthe measurement set, or aid the placement of new meters. The critical $k$-tuple\nproblem is a combinatorial generalization of the critical measurement\ncalculation problem. Using topological network observability results, this\npaper proposes an efficient and accurate approximate solution procedure for the\nconsidered problem based on solving a minimum-cut (Min-Cut) problem and\nenumerating all its optimal solutions. It is also shown that the sparsest\ncritical $k$-tuple problem can be formulated as a mixed integer linear\nprogramming (MILP) problem. This MILP problem can be solved exactly using\navailable solvers such as CPLEX and Gurobi. A detailed numerical study is\npresented to evaluate the efficiency and the accuracy of the proposed Min-Cut\nand MILP calculations.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 14:10:57 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Sou", "Kin Cheong", ""], ["Sandberg", "Henrik", ""], ["Johansson", "Karl Henrik", ""]]}, {"id": "1201.0913", "submitter": "Na-Rae Kim", "authors": "Na-Rae Kim and Chan-Byoung Chae", "title": "Novel Modulation Techniques using Isomers as Messenger Molecules for\n  Molecular Communication via Diffusion", "comments": "5 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CE cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose novel modulation techniques using isomers as\nmessenger molecules for nano communication via diffusion. To evaluate\nachievable rate performance, we compare the proposed techniques with\nconcentration-based and molecular-type-based methods. Analytical and numerical\nresults confirm that the proposed modulation techniques achieve higher data\ntransmission rate performance than conventional insulin based concepts.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 02:33:19 GMT"}], "update_date": "2012-01-05", "authors_parsed": [["Kim", "Na-Rae", ""], ["Chae", "Chan-Byoung", ""]]}, {"id": "1201.0942", "submitter": "Anna Kucerova", "authors": "Eliska Janouchova and Anna Kucerova", "title": "Competitive Comparison of Optimal Designs of Experiments for\n  Sampling-based Sensitivity Analysis", "comments": "18 pages, 15 figures, 4 tables, CSC2011 special issue, corrected and\n  extended after the first review", "journal-ref": "Computers & Structures, 124, 47-60, 2013", "doi": "10.1016/j.compstruc.2013.04.009", "report-no": null, "categories": "cs.CE cs.NA stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, the numerical models of real-world structures are more precise,\nmore complex and, of course, more time-consuming. Despite the growth of a\ncomputational effort, the exploration of model behaviour remains a complex\ntask. The sensitivity analysis is a basic tool for investigating the\nsensitivity of the model to its inputs. One widely used strategy to assess the\nsensitivity is based on a finite set of simulations for a given sets of input\nparameters, i.e. points in the design space. An estimate of the sensitivity can\nbe then obtained by computing correlations between the input parameters and the\nchosen response of the model. The accuracy of the sensitivity prediction\ndepends on the choice of design points called the design of experiments. The\naim of the presented paper is to review and compare available criteria\ndetermining the quality of the design of experiments suitable for\nsampling-based sensitivity analysis.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 17:35:27 GMT"}, {"version": "v2", "created": "Thu, 6 Dec 2012 08:11:50 GMT"}], "update_date": "2014-10-17", "authors_parsed": [["Janouchova", "Eliska", ""], ["Kucerova", "Anna", ""]]}, {"id": "1201.0962", "submitter": "Giuliano Andrea Pagani", "authors": "Giuliano Andrea Pagani and Marco Aiello", "title": "Power Grid Network Evolutions for Local Energy Trading", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CE cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The shift towards an energy Grid dominated by prosumers (consumers and\nproducers of energy) will inevitably have repercussions on the distribution\ninfrastructure. Today it is a hierarchical one designed to deliver energy from\nlarge scale facilities to end-users. Tomorrow it will be a capillary\ninfrastructure at the medium and Low Voltage levels that will support local\nenergy trading among prosumers. In our previous work, we analyzed the Dutch\nPower Grid and made an initial analysis of the economic impact topological\nproperties have on decentralized energy trading. In this paper, we go one step\nfurther and investigate how different networks topologies and growth models\nfacilitate the emergence of a decentralized market. In particular, we show how\nthe connectivity plays an important role in improving the properties of\nreliability and path-cost reduction. From the economic point of view, we\nestimate how the topological evolutions facilitate local electricity\ndistribution, taking into account the main cost ingredient required for\nincreasing network connectivity, i.e., the price of cabling.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 18:44:09 GMT"}, {"version": "v2", "created": "Fri, 6 Jan 2012 12:13:58 GMT"}, {"version": "v3", "created": "Tue, 7 Feb 2012 12:12:27 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Pagani", "Giuliano Andrea", ""], ["Aiello", "Marco", ""]]}, {"id": "1201.3479", "submitter": "Jan Zeman", "authors": "Alena Zemanov\\'a, Jan Zeman, Michal \\v{S}ejnoha", "title": "Simple Numerical Model of Laminated Glass Beams", "comments": "10 pages, 3 figures", "journal-ref": "Acta Polytechnica, 48(6), 22-26 (2008)", "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This contribution presents a simple Finite Element model aimed at efficient\nsimulation of layered glass units. The adopted approach is based on considering\nindependent kinematics of each layer, tied together via Lagrange multipliers.\nValidation and verification of the resulting model against independent data\ndemonstrate its accuracy, showing its potential for generalization towards more\ncomplex problems.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jan 2012 10:57:29 GMT"}], "update_date": "2012-01-18", "authors_parsed": [["Zemanová", "Alena", ""], ["Zeman", "Jan", ""], ["Šejnoha", "Michal", ""]]}, {"id": "1201.3519", "submitter": "Stanislav Avdoshenko", "authors": "Stas M. Avdoshenko, Claudia Gomes da Rocha, Gianaurelio Cuniberti", "title": "Nanoscale ear drum: Graphene based nanoscale sensors", "comments": null, "journal-ref": null, "doi": "10.1039/c2nr30097d", "report-no": null, "categories": "cond-mat.mtrl-sci cs.CE physics.chem-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The difficulty in determining the mass of a sample increases as its size\ndiminishes. At the nanoscale, there are no direct methods for resolving the\nmass of single molecules or nanoparticles and so more sophisticated approaches\nbased on electromechanical phenomena are required. More importantly, one\ndemands that such nanoelectromechanical techniques could provide not only\ninformation about the mass of the target molecules but also about their\ngeometrical properties. In this sense, we report a theoretical study that\nillustrates in detail how graphene membranes can operate as\nnanoelectromechanical mass-sensor devices. Wide graphene sheets were exposed to\ndifferent types and amounts of molecules and molecular dynamic simulations were\nemployed to treat these doping processes statistically. We demonstrate that the\nmass variation effect and information about the graphene-molecule interactions\ncan be inferred through dynamical response functions. Our results confirm the\npotential use of graphene as mass detector devices with remarkable precision in\nestimating variations in mass at molecular scale and other physical properties\nof the dopants.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jan 2012 14:32:09 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Avdoshenko", "Stas M.", ""], ["da Rocha", "Claudia Gomes", ""], ["Cuniberti", "Gianaurelio", ""]]}, {"id": "1201.3545", "submitter": "Larry Bull", "authors": "Larry Bull", "title": "On Natural Genetic Engineering: Structural Dynamism in Random Boolean\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This short paper presents an abstract, tunable model of genomic structural\nchange within the cell lifecycle and explores its use with simulated evolution.\nA well-known Boolean model of genetic regulatory networks is extended to\ninclude changes in node connectivity based upon the current cell state, e.g.,\nvia transposable elements. The underlying behaviour of the resulting dynamical\nnetworks is investigated before their evolvability is explored using a version\nof the NK model of fitness landscapes. Structural dynamism is found to be\nselected for in non-stationary environments and subsequently shown capable of\nproviding a mechanism for evolutionary innovation when such reorganizations are\ninherited.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2012 11:27:52 GMT"}], "update_date": "2012-01-18", "authors_parsed": [["Bull", "Larry", ""]]}, {"id": "1201.4049", "submitter": "Anna Kucerova", "authors": "Bojana V. Rosi\\'c and Anna Ku\\v{c}erov\\'a and Jan S\\'ykora and Oliver\n  Pajonk and Alexander Litvinenko and Hermann G. Matthies", "title": "Parameter Identification in a Probabilistic Setting", "comments": "29 pages, 16 figures", "journal-ref": "Engineering Structures, 50, 179-196, 2013", "doi": "10.1016/j.engstruct.2012.12.029", "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Parameter identification problems are formulated in a probabilistic language,\nwhere the randomness reflects the uncertainty about the knowledge of the true\nvalues. This setting allows conceptually easily to incorporate new information,\ne.g. through a measurement, by connecting it to Bayes's theorem. The unknown\nquantity is modelled as a (may be high-dimensional) random variable. Such a\ndescription has two constituents, the measurable function and the measure. One\ngroup of methods is identified as updating the measure, the other group changes\nthe measurable function. We connect both groups with the relatively recent\nmethods of functional approximation of stochastic problems, and introduce\nespecially in combination with the second group of methods a new procedure\nwhich does not need any sampling, hence works completely deterministically. It\nalso seems to be the fastest and more reliable when compared with other\nmethods. We show by example that it also works for highly nonlinear non-smooth\nproblems with non-Gaussian measures.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 13:00:34 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Rosić", "Bojana V.", ""], ["Kučerová", "Anna", ""], ["Sýkora", "Jan", ""], ["Pajonk", "Oliver", ""], ["Litvinenko", "Alexander", ""], ["Matthies", "Hermann G.", ""]]}, {"id": "1201.4499", "submitter": "Alvaro Juan Ojeda Garcia", "authors": "Alvaro Juan Ojeda Garcia", "title": "Mathematical and computational modeling for describing the basic\n  behavior of free radicals and antioxidants within epithelial cells", "comments": "4 pages, 5 figures. Treball de Recerca, gener de 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The traditional methods of the biology, based on illustrative descriptions\nand linear logic explanations, are discussed. This work aims to improve this\napproach by introducing alternative tools to describe and represent complex\nbiological systems. Two models were developed, one mathematical and another\ncomputational, both were made in order to study the biological process between\nfree radicals and antioxidants. Each model was used to study the same process\nbut in different scenarios. The mathematical model was used to study the\nbiological process in an epithelial cells culture; this model was validated\nwith the experimental data of Anne Hanneken's research group from the\nDepartment of Molecular and Experimental Medicine, published by the journal\nInvestigative Ophthalmology and Visual Science in July 2006. The computational\nmodel was used to study the same process in an individual. The model was made\nusing C++ programming language, supported by the network theory of aging.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jan 2012 19:12:38 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Garcia", "Alvaro Juan Ojeda", ""]]}, {"id": "1201.4914", "submitter": "Chandra Sekhar t", "authors": "T. Chandrasekhar, K. Thangavel, E. Elayaraja", "title": "Effective Clustering Algorithms for Gene Expression Data", "comments": "5 pages", "journal-ref": "International Journal of Computer Applications (0975 - 8887)\n  Volume 32 - No.4, October 2011", "doi": null, "report-no": null, "categories": "cs.CE q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Microarrays are made it possible to simultaneously monitor the expression\nprofiles of thousands of genes under various experimental conditions.\nIdentification of co-expressed genes and coherent patterns is the central goal\nin microarray or gene expression data analysis and is an important task in\nBioinformatics research. In this paper, K-Means algorithm hybridised with\nCluster Centre Initialization Algorithm (CCIA) is proposed Gene Expression\nData. The proposed algorithm overcomes the drawbacks of specifying the number\nof clusters in the K-Means methods. Experimental analysis shows that the\nproposed method performs well on gene Expression Data when compare with the\ntraditional K- Means clustering and Silhouette Coefficients cluster measure.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2012 06:37:49 GMT"}], "update_date": "2012-01-25", "authors_parsed": [["Chandrasekhar", "T.", ""], ["Thangavel", "K.", ""], ["Elayaraja", "E.", ""]]}, {"id": "1201.5019", "submitter": "Kin Cheong Sou", "authors": "Kin Cheong Sou, Henrik Sandberg and Karl Henrik Johansson", "title": "On the Exact Solution to a Smart Grid Cyber-Security Analysis Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CE cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a smart grid cyber-security problem analyzing the\nvulnerabilities of electric power networks to false data attacks. The analysis\nproblem is related to a constrained cardinality minimization problem. The main\nresult shows that an $l_1$ relaxation technique provides an exact optimal\nsolution to this cardinality minimization problem. The proposed result is based\non a polyhedral combinatorics argument. It is different from well-known results\nbased on mutual coherence and restricted isometry property. The results are\nillustrated on benchmarks including the IEEE 118-bus and 300-bus systems.\n", "versions": [{"version": "v1", "created": "Thu, 22 Dec 2011 12:19:47 GMT"}, {"version": "v2", "created": "Mon, 17 Sep 2012 10:22:35 GMT"}], "update_date": "2012-09-18", "authors_parsed": [["Sou", "Kin Cheong", ""], ["Sandberg", "Henrik", ""], ["Johansson", "Karl Henrik", ""]]}, {"id": "1201.5229", "submitter": "Sean Sedwards", "authors": "Cyrille J\\'egourel, Axel Legay, and Sean Sedwards", "title": "Cross-entropy optimisation of importance sampling parameters for\n  statistical model checking", "comments": "16 pages, 8 figures, LNCS style", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.CE cs.SY stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statistical model checking avoids the exponential growth of states associated\nwith probabilistic model checking by estimating properties from multiple\nexecutions of a system and by giving results within confidence bounds. Rare\nproperties are often very important but pose a particular challenge for\nsimulation-based approaches, hence a key objective under these circumstances is\nto reduce the number and length of simulations necessary to produce a given\nlevel of confidence. Importance sampling is a well-established technique that\nachieves this, however to maintain the advantages of statistical model checking\nit is necessary to find good importance sampling distributions without\nconsidering the entire state space.\n  Motivated by the above, we present a simple algorithm that uses the notion of\ncross-entropy to find the optimal parameters for an importance sampling\ndistribution. In contrast to previous work, our algorithm uses a low\ndimensional vector of parameters to define this distribution and thus avoids\nthe often intractable explicit representation of a transition matrix. We show\nthat our parametrisation leads to a unique optimum and can produce many orders\nof magnitude improvement in simulation efficiency. We demonstrate the efficacy\nof our methodology by applying it to models from reliability engineering and\nbiochemistry.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jan 2012 10:22:58 GMT"}], "update_date": "2012-01-26", "authors_parsed": [["Jégourel", "Cyrille", ""], ["Legay", "Axel", ""], ["Sedwards", "Sean", ""]]}, {"id": "1201.6358", "submitter": "Ming-Yang Kao", "authors": "Ming-Yang Kao, Henry C. M. Leung, He Sun, Yong Zhang", "title": "Deterministic Polynomial-Time Algorithms for Designing Short DNA Words", "comments": "27 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CE cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing short DNA words is a problem of constructing a set (i.e., code) of\nn DNA strings (i.e., words) with the minimum length such that the Hamming\ndistance between each pair of words is at least k and the n words satisfy a set\nof additional constraints. This problem has applications in, e.g., DNA\nself-assembly and DNA arrays. Previous works include those that extended\nresults from coding theory to obtain bounds on code and word sizes for\nbiologically motivated constraints and those that applied heuristic local\nsearches, genetic algorithms, and randomized algorithms. In particular, Kao,\nSanghi, and Schweller (2009) developed polynomial-time randomized algorithms to\nconstruct n DNA words of length within a multiplicative constant of the\nsmallest possible word length (e.g., 9 max{log n, k}) that satisfy various sets\nof constraints with high probability. In this paper, we give deterministic\npolynomial-time algorithms to construct DNA words based on derandomization\ntechniques. Our algorithms can construct n DNA words of shorter length (e.g.,\n2.1 log n + 6.28 k) and satisfy the same sets of constraints as the words\nconstructed by the algorithms of Kao et al. Furthermore, we extend these new\nalgorithms to construct words that satisfy a larger set of constraints for\nwhich the algorithms of Kao et al. do not work.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 18:31:15 GMT"}], "update_date": "2012-02-01", "authors_parsed": [["Kao", "Ming-Yang", ""], ["Leung", "Henry C. M.", ""], ["Sun", "He", ""], ["Zhang", "Yong", ""]]}]