[{"id": "1002.0169", "submitter": "Victor M. Preciado", "authors": "Victor M. Preciado and Ali Jadbabaie", "title": "Moment-Based Analysis of Synchronization in Small-World Networks of\n  Oscillators", "comments": "6 pages, 4 figures", "journal-ref": "IEEE Conference of Decision and Control, 2009", "doi": null, "report-no": null, "categories": "cs.MA cs.CE cs.DM nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate synchronization in a small-world network of\ncoupled nonlinear oscillators. This network is constructed by introducing\nrandom shortcuts in a nearest-neighbors ring. The local stability of the\nsynchronous state is closely related with the support of the eigenvalue\ndistribution of the Laplacian matrix of the network. We introduce, for the\nfirst time, analytical expressions for the first three moments of the\neigenvalue distribution of the Laplacian matrix as a function of the\nprobability of shortcuts and the connectivity of the underlying\nnearest-neighbor coupled ring. We apply these expressions to estimate the\nspectral support of the Laplacian matrix in order to predict synchronization in\nsmall-world networks. We verify the efficiency of our predictions with\nnumerical simulations.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2010 01:38:32 GMT"}], "update_date": "2010-02-02", "authors_parsed": [["Preciado", "Victor M.", ""], ["Jadbabaie", "Ali", ""]]}, {"id": "1002.0170", "submitter": "Victor M. Preciado", "authors": "Victor M. Preciado and Ali Jadbabaie", "title": "Spectral Analysis of Virus Spreading in Random Geometric Networks", "comments": "6 pages, 5 figures", "journal-ref": "IEEE Conference on Decision and Control, 2009", "doi": null, "report-no": null, "categories": "cs.MA cs.CE cs.DM nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the dynamics of a viral spreading process in random\ngeometric graphs (RGG). The spreading of the viral process we consider in this\npaper is closely related with the eigenvalues of the adjacency matrix of the\ngraph. We deduce new explicit expressions for all the moments of the eigenvalue\ndistribution of the adjacency matrix as a function of the spatial density of\nnodes and the radius of connection. We apply these expressions to study the\nbehavior of the viral infection in an RGG. Based on our results, we deduce an\nanalytical condition that can be used to design RGG's in order to tame an\ninitial viral infection. Numerical simulations are in accordance with our\nanalytical predictions.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2010 01:43:46 GMT"}, {"version": "v2", "created": "Tue, 2 Feb 2010 18:24:34 GMT"}], "update_date": "2010-02-02", "authors_parsed": [["Preciado", "Victor M.", ""], ["Jadbabaie", "Ali", ""]]}, {"id": "1002.0378", "submitter": "Jinzhong Niu", "authors": "Jinzhong Niu, Kai Cai, and Simon Parsons", "title": "A Grey-Box Approach to Automated Mechanism Design", "comments": "18 pages, 2 figures, 2 tables, and 1 algorithm. Extended abstract to\n  appear in the proceedings of AAMAS'2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Auctions play an important role in electronic commerce, and have been used to\nsolve problems in distributed computing. Automated approaches to designing\neffective auction mechanisms are helpful in reducing the burden of traditional\ngame theoretic, analytic approaches and in searching through the large space of\npossible auction mechanisms. This paper presents an approach to automated\nmechanism design (AMD) in the domain of double auctions. We describe a novel\nparametrized space of double auctions, and then introduce an evolutionary\nsearch method that searches this space of parameters. The approach evaluates\nauction mechanisms using the framework of the TAC Market Design Game and\nrelates the performance of the markets in that game to their constituent parts\nusing reinforcement learning. Experiments show that the strongest mechanisms we\nfound using this approach not only win the Market Design Game against known,\nstrong opponents, but also exhibit desirable economic properties when they run\nin isolation.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2010 01:53:55 GMT"}, {"version": "v2", "created": "Mon, 8 Feb 2010 15:50:13 GMT"}], "update_date": "2010-02-08", "authors_parsed": [["Niu", "Jinzhong", ""], ["Cai", "Kai", ""], ["Parsons", "Simon", ""]]}, {"id": "1002.1099", "submitter": "Ioannis Chatzigiannakis", "authors": "Ioannis Chatzigiannakis, Georgios Mylonas, Orestis Akribopoulos,\n  Marios Logaras, Panagiotis Kokkinos, Paul Spirakis", "title": "The \"Hot Potato\" Case: Challenges in Multiplayer Pervasive Games Based\n  on Ad hoc Mobile Sensor Networks and the Experimental Evaluation of a\n  Prototype Game", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.DC cs.MA cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we discuss multiplayer pervasive games that rely on the use of\nad hoc mobile sensor networks. The unique feature in such games is that players\ninteract with each other and their surrounding environment by using movement\nand presence as a means of performing game-related actions, utilizing sensor\ndevices. We discuss the fundamental issues and challenges related to these type\nof games and the scenarios associated with them. We also present and evaluate\nan example of such a game, called the \"Hot Potato\", developed using the Sun\nSPOT hardware platform. We provide a set of experimental results, so as to both\nevaluate our implementation and also to identify issues that arise in pervasive\ngames which utilize sensor network nodes, which show that there is great\npotential in this type of games.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2010 23:02:02 GMT"}], "update_date": "2010-02-08", "authors_parsed": [["Chatzigiannakis", "Ioannis", ""], ["Mylonas", "Georgios", ""], ["Akribopoulos", "Orestis", ""], ["Logaras", "Marios", ""], ["Kokkinos", "Panagiotis", ""], ["Spirakis", "Paul", ""]]}, {"id": "1002.1896", "submitter": "Floriana Gargiulo", "authors": "F. Gargiulo, S. Huet", "title": "When group level is different from the population level: an adaptive\n  network with the Deffuant model", "comments": "7 pages, 5 figures, Proc of 5th Int. Workshop on Emergent\n  Intelligence on networked Agents, Toronto 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model coupling the classical opinion dynamics of the bounded\nconfidence model, proposed by Deffuant et al., with an adaptive network forming\na community or group structure. At each step, an individual can decide if it\nchanges groups or interact on its opinion with one of its internal or external\nneighbour. If it decides to look at the group level, it changes groups if its\nopinion is far from the average of its group from more than a threshold. If it\nis the case, it joins the group which has proportionally the closest average\nopinion from its. If it decides to interact with one of its neighbour, it\nbecomes closer in opinion to it when its opinion and the one of the\nselected-to-interact neighbour are less distant from the threshold. From the\nstudy of this coupled model, we discover some surprising behaviours compared to\nthe known behaviour of the Deffuant bounded confidence model(BC): The coupled\nmodel exhibits a total consensus for an threshold value lower than the BC\nmodel; the distribution of sizes of the groups changes: some groups become\nlarger while other decrease in size, sometimes until containing only one\nindividual; from the point of view of the groups, the consensus remains for a\nlarge set of threshold values while, looking at the population level, there are\na lot of opinion clusters.\n", "versions": [{"version": "v1", "created": "Tue, 9 Feb 2010 15:53:54 GMT"}, {"version": "v2", "created": "Thu, 18 Mar 2010 14:55:21 GMT"}], "update_date": "2010-03-19", "authors_parsed": [["Gargiulo", "F.", ""], ["Huet", "S.", ""]]}, {"id": "1002.2171", "submitter": "Judith Wiesinger", "authors": "J. Wiesinger, D. Sornette, J. Satinover", "title": "Reverse Engineering Financial Markets with Majority and Minority Games\n  using Genetic Algorithms", "comments": "14 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR cs.LG cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using virtual stock markets with artificial interacting software investors,\naka agent-based models (ABMs), we present a method to reverse engineer\nreal-world financial time series. We model financial markets as made of a large\nnumber of interacting boundedly rational agents. By optimizing the similarity\nbetween the actual data and that generated by the reconstructed virtual stock\nmarket, we obtain parameters and strategies, which reveal some of the inner\nworkings of the target stock market. We validate our approach by out-of-sample\npredictions of directional moves of the Nasdaq Composite Index.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2010 18:48:43 GMT"}], "update_date": "2010-02-11", "authors_parsed": [["Wiesinger", "J.", ""], ["Sornette", "D.", ""], ["Satinover", "J.", ""]]}, {"id": "1002.3770", "submitter": "Tobias Kretz", "authors": "Antonia Perez Arias, Uwe D. Hanebeck, Peter Ehrhardt, Stefan Hengst,\n  Tobias Kretz and Peter Vortisch", "title": "Extended Range Telepresence for Evacuation Training in Pedestrian\n  Simulations", "comments": "Contribution to Pedestrian and Evacuation Dynamics 2010 (PED2010)\n  conference", "journal-ref": null, "doi": "10.1007/978-1-4419-9725-8_18", "report-no": null, "categories": "cs.HC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this contribution, we propose a new framework to evaluate pedestrian\nsimula-tions by using Extended Range Telepresence. Telepresence is used as a\nvirtual reality walking simulator, which provides the user with a realistic\nimpression of being present and walking in a virtual environment that is much\nlarger than the real physical environment, in which the user actually walks.\nThe validation of the simulation is performed by comparing motion data of the\ntelepresent user with simulated data at some points of the simulation. The use\nof haptic feedback from the simulation makes the framework suitable for\ntraining in emergency situations.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2010 16:22:04 GMT"}], "update_date": "2014-02-10", "authors_parsed": [["Arias", "Antonia Perez", ""], ["Hanebeck", "Uwe D.", ""], ["Ehrhardt", "Peter", ""], ["Hengst", "Stefan", ""], ["Kretz", "Tobias", ""], ["Vortisch", "Peter", ""]]}]