[{"id": "1408.0110", "submitter": "Marko Boon", "authors": "Marko Boon, Ivo Adan, Onno Boxma", "title": "A Two-Queue Polling Model with Two Priority Levels in the First Queue", "comments": "A shorter version of this paper appeared in the proceedings of\n  ValueTools 2008. The present paper is an extended version, selected for\n  publication in JDEDS", "journal-ref": "Discrete Event Dynamic Systems 20(4), pp. 511--536, 2010", "doi": "10.1007/s10626-009-0072-9", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider a single-server cyclic polling system consisting of\ntwo queues. Between visits to successive queues, the server is delayed by a\nrandom switch-over time. Two types of customers arrive at the first queue: high\nand low priority customers. For this situation the following service\ndisciplines are considered: gated, globally gated, and exhaustive. We study the\ncycle time distribution, the waiting times for each customer type, the joint\nqueue length distribution at polling epochs, and the steady-state marginal\nqueue length distributions for each customer type.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 09:31:44 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Boon", "Marko", ""], ["Adan", "Ivo", ""], ["Boxma", "Onno", ""]]}, {"id": "1408.0124", "submitter": "Marko Boon", "authors": "Marko Boon, Ivo Adan", "title": "Mixed Gated/Exhaustive Service in a Polling Model with Priorities", "comments": null, "journal-ref": "Queueing Systems 63(1-4), pp. 383-399, 2009. Special issue for the\n  Erlang Centennial", "doi": "10.1007/s11134-009-9115-z", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider a single-server polling system with switch-over\ntimes. We introduce a new service discipline, mixed gated/exhaustive service,\nthat can be used for queues with two types of customers: high and low priority\ncustomers. At the beginning of a visit of the server to such a queue, a gate is\nset behind all customers. High priority customers receive priority in the sense\nthat they are always served before any low priority customers. But high\npriority customers have a second advantage over low priority customers. Low\npriority customers are served according to the gated service discipline, i.e.\nonly customers standing in front of the gate are served during this visit. In\ncontrast, high priority customers arriving during the visit period of the queue\nare allowed to pass the gate and all low priority customers before the gate.\n  We study the cycle time distribution, the waiting time distributions for each\ncustomer type, the joint queue length distribution of all priority classes at\nall queues at polling epochs, and the steady-state marginal queue length\ndistributions for each customer type. Through numerical examples we illustrate\nthat the mixed gated/exhaustive service discipline can significantly decrease\nwaiting times of high priority jobs. In many cases there is a minimal negative\nimpact on the waiting times of low priority customers but, remarkably, it turns\nout that in polling systems with larger switch-over times there can be even a\npositive impact on the waiting times of low priority customers.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 10:42:45 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Boon", "Marko", ""], ["Adan", "Ivo", ""]]}, {"id": "1408.0131", "submitter": "Marko Boon", "authors": "Marko Boon", "title": "A Polling Model with Reneging at Polling Instants", "comments": null, "journal-ref": "Annals of Operations Research 198, pp. 5-23, 2012", "doi": "10.1007/s10479-010-0758-2", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider a single-server, cyclic polling system with\nswitch-over times and Poisson arrivals. The service disciplines that are\ndiscussed, are exhaustive and gated service. The novel contribution of the\npresent paper is that we consider the reneging of customers at polling\ninstants. In more detail, whenever the server starts or ends a visit to a\nqueue, some of the customers waiting in each queue leave the system before\nhaving received service. The probability that a certain customer leaves the\nqueue, depends on the queue in which the customer is waiting, and on the\nlocation of the server. We show that this system can be analysed by introducing\ncustomer subtypes, depending on their arrival periods, and keeping track of the\nmoment when they abandon the system. In order to determine waiting time\ndistributions, we regard the system as a polling model with varying arrival\nrates, and apply a generalised version of the distributional form of Little's\nlaw. The marginal queue length distribution can be found by conditioning on the\nstate of the system (position of the server, and whether it is serving or\nswitching).\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 11:16:27 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Boon", "Marko", ""]]}, {"id": "1408.0134", "submitter": "Marko Boon", "authors": "Marko Boon, Erik Winands, Ivo Adan, Sandra van Wijk", "title": "Closed-Form Waiting Time Approximations for Polling Systems", "comments": null, "journal-ref": "Performance Evaluation 68, pp. 290-306, 2011", "doi": "10.1016/j.peva.2010.12.004", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A typical polling system consists of a number of queues, attended by a single\nserver in a fixed order. The vast majority of papers on polling systems\nfocusses on Poisson arrivals, whereas very few results are available for\ngeneral arrivals. The current study is the first one presenting simple\nclosed-form approximations for the mean waiting times in polling systems with\nrenewal arrival processes, performing well for ALL workloads. The\napproximations are constructed using heavy traffic limits and newly developed\nlight traffic limits. The closed-form approximations may prove to be extremely\nuseful for system design and optimisation in application areas as diverse as\ntelecommunication, maintenance, manufacturing and transportation.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 11:24:42 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Boon", "Marko", ""], ["Winands", "Erik", ""], ["Adan", "Ivo", ""], ["van Wijk", "Sandra", ""]]}, {"id": "1408.0136", "submitter": "Marko Boon", "authors": "Marko Boon, Rob van der Mei, Erik Winands", "title": "Applications of polling systems", "comments": null, "journal-ref": "Surveys in Operations Research and Management Science 16, pp.\n  67-82, 2011", "doi": "10.1016/j.sorms.2011.01.001", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Since the first paper on polling systems, written by Mack in 1957, a huge\nnumber of papers on this topic has been written. A typical polling system\nconsists of a number of queues, attended by a single server. In several\nsurveys, the most notable ones written by Takagi, detailed and comprehensive\ndescriptions of the mathematical analysis of polling systems are provided. The\ngoal of the present survey paper is to complement these papers by putting the\nemphasis on \\emph{applications} of polling models. We discuss not only the\ncapabilities, but also the limitations of polling models in representing\nvarious applications. The present survey is directed at both academicians and\npractitioners.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 11:35:14 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Boon", "Marko", ""], ["van der Mei", "Rob", ""], ["Winands", "Erik", ""]]}, {"id": "1408.0137", "submitter": "Marko Boon", "authors": "Marko Boon, Ivo Adan, Erik Winands, Doug Down", "title": "Delays at signalised intersections with exhaustive traffic control", "comments": null, "journal-ref": "Probability in the Engineering and Informational Sciences 26(3),\n  pp. 337-373, 2012", "doi": "10.1017/S0269964812000058", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a traffic intersection with vehicle-actuated traffic\nsignal control. Traffic lights stay green until all lanes within a group are\nemptied. Assuming general renewal arrival processes, we derive exact limiting\ndistributions of the delays under Heavy Traffic (HT) conditions. Furthermore,\nwe derive the Light Traffic (LT) limit of the mean delays for intersections\nwith Poisson arrivals, and develop a heuristic adaptation of this limit to\ncapture the LT behaviour for other interarrival-time distributions. We combine\nthe LT and HT results to develop closed-form approximations for the mean delays\nof vehicles in each lane. These closed-form approximations are quite accurate,\nvery insightful and simple to implement.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 11:48:04 GMT"}], "update_date": "2014-09-11", "authors_parsed": [["Boon", "Marko", ""], ["Adan", "Ivo", ""], ["Winands", "Erik", ""], ["Down", "Doug", ""]]}, {"id": "1408.0142", "submitter": "Marko Boon", "authors": "Marko Boon, Onno Boxma, Erik Winands", "title": "On open problems in polling systems", "comments": null, "journal-ref": "Queueing Systems 68, pp. 365-374, 2011", "doi": "10.1007/s11134-011-9247-9", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper we address two open problems concerning polling systems,\nviz., queueing systems consisting of multiple queues attended by a single\nserver that visits the queues one at a time. The first open problem deals with\na system consisting of two queues, one of which has gated service, while the\nother receives 1-limited service. The second open problem concerns polling\nsystems with general (renewal) arrivals and deterministic switch-over times\nthat become infinitely large. We discuss related, known results for both\nproblems, and the difficulties encountered when trying to solve them.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 12:00:03 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Boon", "Marko", ""], ["Boxma", "Onno", ""], ["Winands", "Erik", ""]]}, {"id": "1408.0146", "submitter": "Marko Boon", "authors": "Marko Boon, Rob van der Mei, Erik Winands", "title": "Waiting times in queueing networks with a single shared server", "comments": null, "journal-ref": "Queueing Systems 74(4), pp. 403-429, 2013", "doi": "10.1007/s11134-012-9334-6", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a queueing network with a single shared server that serves the\nqueues in a cyclic order. External customers arrive at the queues according to\nindependent Poisson processes. After completing service, a customer either\nleaves the system or is routed to another queue. This model is very generic and\nfinds many applications in computer systems, communication networks,\nmanufacturing systems, and robotics. Special cases of the introduced network\ninclude well-known polling models, tandem queues, systems with a waiting room,\nmulti-stage models with parallel queues, and many others. A complicating factor\nof this model is that the internally rerouted customers do not arrive at the\nvarious queues according to a Poisson process, causing standard techniques to\nfind waiting-time distributions to fail. In this paper we develop a new method\nto obtain exact expressions for the Laplace-Stieltjes transforms of the\nsteady-state waiting-time distributions. This method can be applied to a wide\nvariety of models which lacked an analysis of the waiting-time distribution\nuntil now.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 12:08:55 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Boon", "Marko", ""], ["van der Mei", "Rob", ""], ["Winands", "Erik", ""]]}, {"id": "1408.0151", "submitter": "Marko Boon", "authors": "Marko Boon, Rob van der Mei, Erik Winands", "title": "Queueing networks with a single shared server: light and heavy traffic", "comments": "The short paper was published in the proceedings of Performance 2011,\n  Amsterdam", "journal-ref": "SIGMETRICS Performance Evaluation Review 39(2), pp. 44-46, 2011", "doi": "10.1145/2034832.2034843", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a queueing network with a single shared server, that serves the\nqueues in a cyclic order according to the gated service discipline. External\ncustomers arrive at the queues according to independent Poisson processes.\nAfter completing service, a customer either leaves the system or is routed to\nanother queue. This model is very generic and finds many applications in\ncomputer systems, communication networks, manufacturing systems and robotics.\nSpecial cases of the introduced network include well-known polling models and\ntandem queues. We derive exact limits of the mean delays under both\nheavy-traffic and light-traffic conditions. By interpolating between these\nasymptotic regimes, we develop simple closed-form approximations for the mean\ndelays for arbitrary loads.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 12:29:30 GMT"}], "update_date": "2014-09-11", "authors_parsed": [["Boon", "Marko", ""], ["van der Mei", "Rob", ""], ["Winands", "Erik", ""]]}, {"id": "1408.0282", "submitter": "Marko Boon", "authors": "Marko Boon, Ivo Adan, Onno Boxma", "title": "A Polling Model with Multiple Priority Levels", "comments": "arXiv admin note: substantial text overlap with arXiv:1408.0110", "journal-ref": "Performance Evaluation 67, pp. 468-484, 2010", "doi": "10.1016/j.peva.2010.01.002", "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider a single-server cyclic polling system. Between\nvisits to successive queues, the server is delayed by a random switch-over\ntime. The order in which customers are served in each queue is determined by a\npriority level that is assigned to each customer at his arrival. For this\nsituation the following service disciplines are considered: gated, exhaustive,\nand globally gated. We study the cycle time distribution, the waiting times for\neach customer type, the joint queue length distribution of all priority classes\nat all queues at polling epochs, and the steady-state marginal queue length\ndistributions for each customer type.\n", "versions": [{"version": "v1", "created": "Fri, 1 Aug 2014 09:43:15 GMT"}], "update_date": "2014-08-05", "authors_parsed": [["Boon", "Marko", ""], ["Adan", "Ivo", ""], ["Boxma", "Onno", ""]]}, {"id": "1408.4964", "submitter": "Martin Margala", "authors": "Oren Segal, Martin Margala, Sai Rahul Chalamalasetti, Mitch Wright", "title": "High Level Programming for Heterogeneous Architectures", "comments": "Presented at First International Workshop on FPGAs for Software\n  Programmers (FSP 2014) (arXiv:1408.4423)", "journal-ref": null, "doi": null, "report-no": "FSP/2014/10", "categories": "cs.PF cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents an effort to bridge the gap between abstract high level\nprogramming and OpenCL by extending an existing high level Java programming\nframework (APARAPI), based on OpenCL, so that it can be used to program FPGAs\nat a high level of abstraction and increased ease of programmability. We run\nseveral real world algorithms to assess the performance of the framework on\nboth a low end and a high end system. On the low end and high end systems\nrespectively we observed up to 78-80 percent power reduction and 4.8X-5.3X\nspeed increase running NBody simulation, as well as up to 65-80 percent power\nreduction and 6.2X-7X speed increase for a KMeans, MapReduce algorithm running\non top of the Hadoop framework and APARAPI.\n", "versions": [{"version": "v1", "created": "Thu, 21 Aug 2014 11:23:54 GMT"}], "update_date": "2014-08-22", "authors_parsed": [["Segal", "Oren", ""], ["Margala", "Martin", ""], ["Chalamalasetti", "Sai Rahul", ""], ["Wright", "Mitch", ""]]}, {"id": "1408.4965", "submitter": "Gordon Inggs", "authors": "Gordon Inggs, David Thomas, Wayne Luk", "title": "A Domain Specific Approach to Heterogeneous Computing: From Availability\n  to Accessibility", "comments": "Presented at First International Workshop on FPGAs for Software\n  Programmers (FSP 2014) (arXiv:1408.4423)", "journal-ref": null, "doi": null, "report-no": "FSP/2014/11", "categories": "cs.CE cs.DC cs.PF cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We advocate a domain specific software development methodology for\nheterogeneous computing platforms such as Multicore CPUs, GPUs and FPGAs. We\nargue that three specific benefits are realised from adopting such an approach:\nportable, efficient implementations across heterogeneous platforms; domain\nspecific metrics of quality that characterise platforms in a form software\ndevelopers will understand; automatic, optimal partitioning across the\navailable computing resources. These three benefits allow a development\nmethodology for software developers where they describe their computational\nproblems in a single, easy to understand form, and after a modeling procedure\non the available resources, select how they would like to trade between various\ndomain specific metrics. Our work on the Forward Financial Framework ($F^3$)\ndemonstrates this methodology in practise. We are able to execute a range of\ncomputational finance option pricing tasks efficiently upon a wide range of\nCPU, GPU and FPGA computing platforms. We can also create accurate financial\ndomain metric models of walltime latency and statistical confidence.\nFurthermore, we believe that we can support automatic, optimal partitioning\nusing this execution and modelling capability.\n", "versions": [{"version": "v1", "created": "Thu, 21 Aug 2014 11:32:53 GMT"}], "update_date": "2014-08-22", "authors_parsed": [["Inggs", "Gordon", ""], ["Thomas", "David", ""], ["Luk", "Wayne", ""]]}, {"id": "1408.5715", "submitter": "Antal Hiba", "authors": "Zoltan Nagy, Csaba Nemes, Antal Hiba, Arpad Csik, Andras Kiss, Miklos\n  Ruszinko, Peter Szolgay", "title": "Accelerating unstructured finite volume computations on\n  field-programmable gate arrays", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Accurate simulations of various physical processes on digital computers\nrequires huge computing performance, therefore accelerating these scientific\nand engineering applications has a great importance. Density of programmable\nlogic devices doubles in every 18 months according to Moore's Law. On the\nrecent devices around one hundred double precision floating-point adders and\nmultipliers can be implemented. In the paper an FPGA based framework is\ndescribed to efficiently utilize this huge computing power to accelerate\nsimulation of complex physical spatiotemporal phenomena. Simulating complicated\ngeometries requires unstructured spatial discretization which results in\nirregular memory access patterns severely limiting computing performance. Data\nlocality is improved by mesh node renumbering technique which results in\npredictable memory access pattern. Additionally storing a small window of node\ndata in the on-chip memory of the FPGA can increase data reuse and decrease\nmemory bandwidth requirements. Generation of the floating-point data path and\ncontrol structure of the arithmetic unit containing dozens of operators is a\nvery challenging task when the goal is high operating frequency. Long and high\nfanout control lines and improper placement can severely affect computing\nperformance. In the paper an automatic data path generation and partitioning\nalgorithm is presented to eliminate long delays and aid placement of the\ncircuit. Efficiency and use of the framework is described by a case study\nsolving the Euler equations on an unstructured mesh using finite volume\ntechnique. On the currently available largest FPGA the generated architecture\ncontains three processing elements working in parallel providing 90 times\nspeedup compared to a high performance microprocessor core.\n", "versions": [{"version": "v1", "created": "Mon, 25 Aug 2014 10:40:43 GMT"}], "update_date": "2014-08-26", "authors_parsed": [["Nagy", "Zoltan", ""], ["Nemes", "Csaba", ""], ["Hiba", "Antal", ""], ["Csik", "Arpad", ""], ["Kiss", "Andras", ""], ["Ruszinko", "Miklos", ""], ["Szolgay", "Peter", ""]]}, {"id": "1408.6721", "submitter": "Reza Arablouei", "authors": "Reza Arablouei and Kutluy{\\i}l Do\\u{g}an\\c{c}ay", "title": "Performance Analysis of Linear-Equality-Constrained Least-Squares\n  Estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the performance of a linear-equality-constrained least-squares\n(CLS) algorithm and its relaxed version, called rCLS, that is obtained via the\nmethod of weighting. The rCLS algorithm solves an unconstrained least-squares\nproblem that is augmented by incorporating a weighted form of the linear\nconstraints. As a result, unlike the CLS algorithm, the rCLS algorithm is\namenable to our approach to performance analysis presented here, which is akin\nto the energy-conservation-based methodology. Therefore, we initially inspect\nthe convergence properties and evaluate the precision of estimation as well as\nsatisfaction of the constraints for the rCLS algorithm in both mean and\nmean-square senses. Afterwards, we examine the performance of the CLS algorithm\nby evaluating the limiting performance of the rCLS algorithm as the relaxation\nparameter (weight) approaches infinity. Numerical examples verify the accuracy\nof the theoretical findings.\n", "versions": [{"version": "v1", "created": "Tue, 26 Aug 2014 15:20:55 GMT"}, {"version": "v2", "created": "Sun, 22 Feb 2015 23:57:45 GMT"}], "update_date": "2015-02-24", "authors_parsed": [["Arablouei", "Reza", ""], ["Doğançay", "Kutluyıl", ""]]}]