[{"id": "1112.0032", "submitter": "G\\'erald Kembellec", "authors": "G\\'erald Kembellec and Imad Saleh and Catherine Sauvaget", "title": "A model of Cross Language Retrieval for IT domain papers through a map\n  of ACM Computing Classification System", "comments": "7 pages, 3 figures, 1 table", "journal-ref": null, "doi": "10.1109/MMCS.2009.5256709", "report-no": null, "categories": "cs.DL cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a concept model, and the associated tool to help\nadvanced learners to find adapted bibliography. The purpose is the use of an IT\nrepresentation as educational research software for newcomers in research. We\nuse an ontology based on the ACM's Computing Classification System in order to\nfind scientific articles directly related to the new researcher's domain\nwithout any formal request. An ontology translation in French is automatically\nproposed and can be based on Web 2.0 enhanced by a community of users. A\nvisualization and navigation model is proposed to make it more accessible and\nexamples are given to show the interface of our tool: Ontology Navigator.\n", "versions": [{"version": "v1", "created": "Wed, 30 Nov 2011 21:18:44 GMT"}], "update_date": "2012-02-07", "authors_parsed": [["Kembellec", "Gérald", ""], ["Saleh", "Imad", ""], ["Sauvaget", "Catherine", ""]]}, {"id": "1112.0329", "submitter": "Fabrizio Bocchino", "authors": "F. Bocchino, J. Lopez-Santiago, F. Albacete-Colombo and N. Bucciantini", "title": "YouASTRO: a web-based bibliography management system with distributed\n  comments and rating features for SAO/NASA ADS papers", "comments": "4 pages, 1 figure, proceedings of the ADASS conference, Paris,\n  November 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM astro-ph.GA cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a working prototype of YouASTRO (www.youastro.org), a web-based\nBibTeX-compliant reference management software (RMS) for astrophysical papers\nin the SAO/NASA ADS database. It also includes as a main feature the concept of\ndistributed paper comments and ratings. In these paper, we introduce the main\ncharacteristics of the web application, and we will briefly discuss what could\nbe the advantages and drawbacks of such a system being widespread adopted by\nthe astrophysical community for its scientific literature.\n", "versions": [{"version": "v1", "created": "Thu, 1 Dec 2011 21:05:34 GMT"}], "update_date": "2011-12-05", "authors_parsed": [["Bocchino", "F.", ""], ["Lopez-Santiago", "J.", ""], ["Albacete-Colombo", "F.", ""], ["Bucciantini", "N.", ""]]}, {"id": "1112.0742", "submitter": "Massimo Brescia Dr", "authors": "M. Brescia, A. Corazza, S. Cavuoti, G. d'Angelo, R. D'Abrusco, C.\n  Donalek, S. G. Djorgovski, N. Deniskina, M. Fiore, M. Garofalo, O. Laurino,\n  G. Longo A. Mahabal, F. Manna, A. Nocella, B. Skordovski", "title": "The DAME/VO-Neural Infrastructure: an Integrated Data Mining System\n  Support for the Science Community", "comments": "10 pages, Proceedings of the Final Workshop of the Grid Projects of\n  the Italian National Operational Programme 2000-2006 Call 1575; Edited by\n  Cometa Consortium, 2009, ISBN: 978-88-95892-02-3", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Astronomical data are gathered through a very large number of heterogeneous\ntechniques and stored in very diversified and often incompatible data\nrepositories. Moreover in the e-science environment, it is needed to integrate\nservices across distributed, heterogeneous, dynamic \"virtual organizations\"\nformed by different resources within a single enterprise and/or external\nresource sharing and service provider relationships. The DAME/VONeural project,\nrun jointly by the University Federico II, INAF (National Institute of\nAstrophysics) Astronomical Observatories of Napoli and the California Institute\nof Technology, aims at creating a single, sustainable, distributed\ne-infrastructure for data mining and exploration in massive data sets, to be\noffered to the astronomical (but not only) community as a web application. The\nframework makes use of distributed computing environments (e.g. S.Co.P.E.) and\nmatches the international IVOA standards and requirements. The integration\nprocess is technically challenging due to the need of achieving a specific\nquality of service when running on top of different native platforms. In these\nterms, the result of the DAME/VO-Neural project effort will be a\nservice-oriented architecture, obtained by using appropriate standards and\nincorporating Grid paradigms and restful Web services frameworks where needed,\nthat will have as main target the integration of interdisciplinary distributed\nsystems within and across organizational domains.\n", "versions": [{"version": "v1", "created": "Sun, 4 Dec 2011 10:41:01 GMT"}], "update_date": "2011-12-06", "authors_parsed": [["Brescia", "M.", ""], ["Corazza", "A.", ""], ["Cavuoti", "S.", ""], ["d'Angelo", "G.", ""], ["D'Abrusco", "R.", ""], ["Donalek", "C.", ""], ["Djorgovski", "S. G.", ""], ["Deniskina", "N.", ""], ["Fiore", "M.", ""], ["Garofalo", "M.", ""], ["Laurino", "O.", ""], ["Mahabal", "G. Longo A.", ""], ["Manna", "F.", ""], ["Nocella", "A.", ""], ["Skordovski", "B.", ""]]}, {"id": "1112.0750", "submitter": "Massimo Brescia Dr", "authors": "M. Brescia, S. Cavuoti, R. D'Abrusco, O. Laurino, G. Longo", "title": "DAME: A Distributed Data Mining & Exploration Framework within the\n  Virtual Observatory", "comments": "20 pages, INGRID 2010 - 5th International Workshop on Distributed\n  Cooperative Laboratories: \"Instrumenting\" the Grid, May 12-14, 2010, Poznan,\n  Poland; Volume Remote Instrumentation for eScience and Related Aspects, 2011,\n  F. Davoli et al. (eds.), SPRINGER NY", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, many scientific areas share the same broad requirements of being\nable to deal with massive and distributed datasets while, when possible, being\nintegrated with services and applications. In order to solve the growing gap\nbetween the incremental generation of data and our understanding of it, it is\nrequired to know how to access, retrieve, analyze, mine and integrate data from\ndisparate sources. One of the fundamental aspects of any new generation of data\nmining software tool or package which really wants to become a service for the\ncommunity is the possibility to use it within complex workflows which each user\ncan fine tune in order to match the specific demands of his scientific goal.\nThese workflows need often to access different resources (data, providers,\ncomputing facilities and packages) and require a strict interoperability on (at\nleast) the client side. The project DAME (DAta Mining & Exploration) arises\nfrom these requirements by providing a distributed WEB-based data mining\ninfrastructure specialized on Massive Data Sets exploration with Soft Computing\nmethods. Originally designed to deal with astrophysical use cases, where first\nscientific application examples have demonstrated its effectiveness, the DAME\nSuite results as a multi-disciplinary platform-independent tool perfectly\ncompliant with modern KDD (Knowledge Discovery in Databases) requirements and\nInformation & Communication Technology trends.\n", "versions": [{"version": "v1", "created": "Sun, 4 Dec 2011 13:06:35 GMT"}], "update_date": "2011-12-06", "authors_parsed": [["Brescia", "M.", ""], ["Cavuoti", "S.", ""], ["D'Abrusco", "R.", ""], ["Laurino", "O.", ""], ["Longo", "G.", ""]]}, {"id": "1112.1681", "submitter": "Jyue Tyan Low", "authors": "Jyue Tyan Low", "title": "A literature review: What exactly should we preserve? How scholars\n  address this question and where is the gap", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This review addresses the question of what exactly should we preserve, and\nhow the digital preservation community and scholars address this question. The\npaper first introduces the much-abused-term \"significant properties,\" before\nrevealing how some scholars are of the opinion that characteristics of digital\nobjects to be preserved (i.e., significant properties) can be identified and\nshould be expressed formally, while others are not of that opinion. The digital\npreservation community's attempt to expound on the general characteristics of\ndigital objects and significant properties will then be discussed. Finally, the\nreview shows that while there may be ways to identify the technical makeup or\ngeneral characteristics of a digital object, there is currently no formal and\nobjective methodology to help stakeholders identify and decide what the\nsignificant properties of the objects are. This review thus helps open\nquestions and generates a formative recommendation based on expert opinion that\nexpressing an object's functions in an explicit and formal way (using didactic\nguides from the archives community) could be the solution to help stakeholders\ndecide what characteristics/ elements exactly we should preserve.\n", "versions": [{"version": "v1", "created": "Wed, 7 Dec 2011 20:24:35 GMT"}], "update_date": "2011-12-08", "authors_parsed": [["Low", "Jyue Tyan", ""]]}, {"id": "1112.1688", "submitter": "Alberto Accomazzi", "authors": "Alberto Accomazzi, Sebastien Derriere, Chris Biemesderfer and Norman\n  Gray", "title": "Why don't we already have an Integrated Framework for the Publication\n  and Preservation of all Data Products?", "comments": "4 pages, submitted to the ADASS XXI proceedings", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Astronomy has long had a working network of archives supporting the curation\nof publications and data. The discipline has already created many of the\nfeatures which perplex other areas of science: (1) data repositories:\n(supra)national institutes, dedicated to large projects; a culture of\nuser-contributed data; practical experience of long-term data preservation; (2)\ndataset identifiers: the community has already piloted experiments, knows what\ncan undermine these efforts, and is participating in the development of\nnext-generation standards; (3) citation of datasets in papers: the community\nhas an innovative and expanding infrastructure for the curation of data and\nbibliographic resources, and through them a community of author s and editors\nfamiliar with such electronic publication efforts; as well, it has experimented\nwith next-generation web standards (e.g. the Semantic Web); (4) publisher\nbuy-in: publishers in this area have been willing to innovate within the\nconstraints of their commercial imperatives. What can possibly be missing? Why\ndon't we have an integrated framework for the publication and preservation of\nall data products already? Are there technical barriers? We don't believe so.\nAre there cultural or commercial forces inhibiting this? We aren't aware of\nany. This Birds of a Feather session (BoF) attempted to identify existing\nbarriers to the creation of such a framework, and attempted to identify the\nparties or groups which can contribute to the creation of a VO-powered\ndata-publishing framework.\n", "versions": [{"version": "v1", "created": "Wed, 7 Dec 2011 20:58:34 GMT"}], "update_date": "2011-12-08", "authors_parsed": [["Accomazzi", "Alberto", ""], ["Derriere", "Sebastien", ""], ["Biemesderfer", "Chris", ""], ["Gray", "Norman", ""]]}, {"id": "1112.2193", "submitter": "Massimo Di Pierro", "authors": "Massimo Di Pierro, James Hetrick, Shreyas Cholia, David Skinner", "title": "Making QCD Lattice Data Accessible and Organized through Advanced Web\n  Interfaces", "comments": null, "journal-ref": "Lattice 2011 Proceedings", "doi": null, "report-no": null, "categories": "hep-lat cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Gauge Connection at qcd.nersc.gov is one of the most popular repositories\nof QCD lattice ensembles. It is used to access 16TB of archived QCD data from\nthe High Performance Storage System (HPSS) at the National Energy Research\nScientific Computing Center (NERSC). Here, we present a new web interface for\nqcd.nersc.gov which allows physicists to browse and search the data, as well as\ndownload individual files or entire ensembles in batch. Our system\ndistinguishes itself from others because of its ease of use and web based\nworkflow.\n", "versions": [{"version": "v1", "created": "Fri, 9 Dec 2011 19:47:27 GMT"}], "update_date": "2011-12-12", "authors_parsed": [["Di Pierro", "Massimo", ""], ["Hetrick", "James", ""], ["Cholia", "Shreyas", ""], ["Skinner", "David", ""]]}, {"id": "1112.2459", "submitter": "Alireza Abbasi", "authors": "Alireza Abbasi, Liaquat Hossain", "title": "Hybrid Centrality Measures for Binary and Weighted Networks", "comments": "a short version accepted in the 3rd workshop on Complex Network [Full\n  Paper submitted to JASIST in April 2011]", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Existing centrality measures for social network analysis suggest the\nim-portance of an actor and give consideration to actor's given structural\nposition in a network. These existing measures suggest specific attribute of an\nactor (i.e., popularity, accessibility, and brokerage behavior). In this study,\nwe propose new hybrid centrality measures (i.e., Degree-Degree,\nDegree-Closeness and Degree-Betweenness), by combining existing measures (i.e.,\ndegree, closeness and betweenness) with a proposition to better understand the\nimportance of actors in a given network. Generalized set of measures are also\nproposed for weighted networks. Our analysis of co-authorship networks dataset\nsuggests significant correlation of our proposed new centrality measures\n(especially weighted networks) than traditional centrality measures with\nperformance of the scholars. Thus, they are useful measures which can be used\ninstead of traditional measures to show prominence of the actors in a network.\n", "versions": [{"version": "v1", "created": "Mon, 12 Dec 2011 07:19:26 GMT"}, {"version": "v2", "created": "Mon, 16 Jan 2012 15:22:11 GMT"}, {"version": "v3", "created": "Sat, 21 Jan 2012 04:53:33 GMT"}, {"version": "v4", "created": "Fri, 10 Feb 2012 04:29:14 GMT"}], "update_date": "2012-02-13", "authors_parsed": [["Abbasi", "Alireza", ""], ["Hossain", "Liaquat", ""]]}, {"id": "1112.2516", "submitter": "Jesper Schneider jws", "authors": "Jesper W. Schneider", "title": "Caveats for using statistical significance tests in research assessments", "comments": "Accepted version for Journal of Informetrics", "journal-ref": null, "doi": "10.1016/j.joi.2012.08.005", "report-no": null, "categories": "cs.DL stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper raises concerns about the advantages of using statistical\nsignificance tests in research assessments as has recently been suggested in\nthe debate about proper normalization procedures for citation indicators.\nStatistical significance tests are highly controversial and numerous criticisms\nhave been leveled against their use. Based on examples from articles by\nproponents of the use statistical significance tests in research assessments,\nwe address some of the numerous problems with such tests. The issues\nspecifically discussed are the ritual practice of such tests, their dichotomous\napplication in decision making, the difference between statistical and\nsubstantive significance, the implausibility of most null hypotheses, the\ncrucial assumption of randomness, as well as the utility of standard errors and\nconfidence intervals for inferential purposes. We argue that applying\nstatistical significance tests and mechanically adhering to their results is\nhighly problematic and detrimental to critical thinking. We claim that the use\nof such tests do not provide any advantages in relation to citation indicators,\ninterpretations of them, or the decision making processes based upon them. On\nthe contrary their use may be harmful. Like many other critics, we generally\nbelieve that statistical significance tests are over- and misused in the social\nsciences including scientometrics and we encourage a reform on these matters.\n", "versions": [{"version": "v1", "created": "Mon, 12 Dec 2011 11:57:12 GMT"}, {"version": "v2", "created": "Tue, 25 Sep 2012 07:15:27 GMT"}], "update_date": "2012-09-26", "authors_parsed": [["Schneider", "Jesper W.", ""]]}, {"id": "1112.2619", "submitter": "Paola Di Maio", "authors": "Paola Di Maio", "title": "Towards a Reference Model for Open Access and Knowledge Sharing, Lessons\n  from Systems Research", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Open Access Movement has been striving to grant universal unrestricted\naccess to the knowledge and data outputs of publicly funded research.\nleveraging the real time, virtually cost free publishing opportunities offered\nby the internet and the web. However, evidence suggests that in the systems\nengineering domain open access policies are not widely adopted. This paper\npresents the rationale, methodology and results of an evidence based inquiry\nthat investigates the dichotomy between policy and practice in Open Access (OA)\nof systems engineering research in the UK, explores entangled dimensions of the\nproblem space from a socio-technical perspective, and issues a set of\nrecommendations, including a reference model outline for knowledge sharing in\nsystems research\n", "versions": [{"version": "v1", "created": "Fri, 9 Dec 2011 19:38:35 GMT"}], "update_date": "2011-12-13", "authors_parsed": [["Di Maio", "Paola", ""]]}, {"id": "1112.4019", "submitter": "Phuc V. Nguyen Mr.", "authors": "Phuc V. Nguyen", "title": "Legal Resources Information System for Information Agencies of\n  Specialized Libraries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, the rapid development of information technology and\ncommunication has a strong impact to industry information - the library. The\nmission of the industry when in fact the great social place to see the library\nas knowledge management. Vietnam is in the process of building the rule of law\nsocialist orientation and improves the legal system. So in the current\ndevelopment process, the law library plays an important role in the retention,\ndissemination and provision of legal information service of legislative,\nexecutive and judiciary, particularly especially research, teaching and\nlearning of law school. But the response of the legal information library\ninformation agencies remains limited compared to the increasing demand of\nusers.\n", "versions": [{"version": "v1", "created": "Sat, 17 Dec 2011 03:48:36 GMT"}], "update_date": "2011-12-20", "authors_parsed": [["Nguyen", "Phuc V.", ""]]}, {"id": "1112.6090", "submitter": "Philip Davies", "authors": "Philip Davies, David Newell, Abigail Davies and Damla Karagozlu", "title": "Multi-Connected Ontologies", "comments": "8 pages, 13 figures, submitted to IARIA MMEDIA2012 Conference,\n  Chamonix, France", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ontologies have been used for the purpose of bringing system and consistency\nto subject and knowledge areas. We present a criticism of the present\nmathematical structure of ontologies and indicate that they are not sufficient\nin their present form to represent the many different valid expressions of a\nsubject knowledge domain. We propose an alternative structure for ontologies\nbased on a richer multi connected complex network which contains the present\nontology structure as a projection. We demonstrate how this new multi connected\nontology should be represented as an asymmetric probability matrix.\n", "versions": [{"version": "v1", "created": "Wed, 28 Dec 2011 10:23:16 GMT"}], "update_date": "2015-03-12", "authors_parsed": [["Davies", "Philip", ""], ["Newell", "David", ""], ["Davies", "Abigail", ""], ["Karagozlu", "Damla", ""]]}]