[{"id": "2103.01099", "submitter": "Peter Kokol PhD", "authors": "Peter Kokol, Jernej Zavr\\v{s}nik, Marko Tur\\v{c}in, Helena Bla\\v{z}un\n  Vo\\v{s}ner", "title": "Enhancing the role of academic librarians in conducting scoping reviews", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Information exposing, in conjunction with technological innovations and the\nemergence of social media, altered the traditional roles of academic libraries\nand enabled librarians to become necessary partners in research. The role of\nacademic librarians in conducting systematic reviews is well recognised,\nhowever, their role in conducting scoping reviews is not yet well established.\nNevertheless, we propose that, in more and more frequent situations when it is\nnot feasible to read and analyse all relevant literature to be scoped manually,\nlibrarians employ bibliometric analysis and mapping to visualise and chart\nliterature content. Our study demonstrated that science landscapes induced\nautomatically by bibliometric mapping software could serve as a tool to\nvisualise and chart the content of relevant literature when conducting the\nfourth step of scoping reviews. Additionaly science landscapes can help also\nserve to help improve the decision strategies when conducting scoping reviews.\nKeywords: Scoping\n", "versions": [{"version": "v1", "created": "Mon, 1 Mar 2021 16:08:18 GMT"}], "update_date": "2021-03-02", "authors_parsed": [["Kokol", "Peter", ""], ["Završnik", "Jernej", ""], ["Turčin", "Marko", ""], ["Vošner", "Helena Blažun", ""]]}, {"id": "2103.02052", "submitter": "Saurabh Mishra", "authors": "Saurabh Mishra and Kuansan Wang", "title": "Convergence and Inequality in Research Globalization", "comments": "19 pages, 31 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The catch-up effect and the Matthew effect offer opposing characterizations\nof globalization: the former predicts an eventual convergence as the poor can\ngrow faster than the rich due to free exchanges of complementary resources,\nwhile the latter, a deepening inequality between the rich and the poor. To\nunderstand these effects on the globalization of research, we conduct an\nin-depth study based on scholarly and patent publications covering STEM\nresearch from 218 countries/regions over the past four decades, covering more\nthan 55 million scholarly articles and 1.7 billion citations. Unique to this\ninvestigation is the simultaneous examination of both the research output and\nits impact in the same data set, using a novel machine learning based measure,\ncalled saliency, to mitigate the intrinsic biases in quantifying the research\nimpact. The results show that the two effects are in fact co-occurring: there\nare clear indications of convergence among the high income and upper middle\nincome countries across the STEM fields, but a widening gap is developing that\nsegregates the lower middle and low income regions from the higher income\nregions. Furthermore, the rate of convergence varies notably among the STEM\nsub-fields, with the highly strategic area of Artificial Intelligence (AI)\nsandwiched between fields such as Medicine and Materials Science that occupy\nthe opposite ends of the spectrum. The data support the argument that a leading\nexplanation of the Matthew effect, namely, the preferential attachment theory,\ncan actually foster the catch-up effect when organizations from lower income\ncountries forge substantial research collaborations with those already\ndominant. The data resoundingly show such collaborations benefit all parties\ninvolved, and a case of role reversal can be seen in the Materials Science\nfield where the most advanced signs of convergence are observed.\n", "versions": [{"version": "v1", "created": "Tue, 2 Mar 2021 22:04:24 GMT"}], "update_date": "2021-03-04", "authors_parsed": [["Mishra", "Saurabh", ""], ["Wang", "Kuansan", ""]]}, {"id": "2103.02942", "submitter": "Susanne Kunis", "authors": "Susanne Kunis, Sebastian H\\\"ansch, Christian Schmidt, Frances Wong,\n  Caterina Strambio-De-Castillia, and Stefanie Weidtkamp-Peters", "title": "MDEmic in a use case for microscopy metadata harmonization: Facilitating\n  FAIR principles in practical application with metadata annotation tools", "comments": "submitted version", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  While the FAIR principles are well accepted in the scientific community, the\nimplementation of appropriate metadata editing and transfer to ensure FAIR\nresearch data in practice is significantly lagging behind. On the one hand, it\nstrongly depends on the availability of tools that efficiently support this\nstep in research data management. On the other hand, it depends on the\navailable standards regarding the interpretability of metadata. Here, we\nintroduce a tool, MDEmic, for editing metadata of microscopic imaging data in\nan easy and comfortable way that provides high flexibility in terms of\nadjustment of metadata sets. This functionality was in great demand by many\nresearchers applying microscopic techniques. MDEmic has already become a part\nof the standard installation package of the image database OMERO as OMERO.mde.\nThis database helps to organize and visualize microscopic image data and keep\ntrack of their further processing and linkage to other data sets. For this\nreason, many imaging core facilities provide OMERO to their users. We present a\nuse case scenario for the tailored application of OMERO.mde to imaging data of\nan institutional OMERO-based Membrane Dye Database, which requires specific\nexperimental metadata. Similar to public image data repositories like the Image\nData Resource, IDR, this database facilitates image data storage including rich\nmetadata which enables data mining and re-use, one of the major goals of the\nFAIR principles.\n", "versions": [{"version": "v1", "created": "Thu, 4 Mar 2021 10:46:18 GMT"}, {"version": "v2", "created": "Fri, 19 Mar 2021 14:45:49 GMT"}, {"version": "v3", "created": "Wed, 28 Jul 2021 07:55:34 GMT"}], "update_date": "2021-07-29", "authors_parsed": [["Kunis", "Susanne", ""], ["Hänsch", "Sebastian", ""], ["Schmidt", "Christian", ""], ["Wong", "Frances", ""], ["Strambio-De-Castillia", "Caterina", ""], ["Weidtkamp-Peters", "Stefanie", ""]]}, {"id": "2103.02953", "submitter": "Jo\\~ao Silva", "authors": "Filipe Fernandes, Helena Serrano, Maria Alexandra Oliveira, Cristina\n  Branquinho, Jo\\~ao Nuno Silva", "title": "GAPS: Geo Data Portals for Air Pollution Studies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a wealth of data on air pollution within several users' reach,\nincluding modelled concentrations and depositions as well as observations from\nair quality stations. However, data integration to perceive spatial and\ntemporal trends at the national level is a complex undertaking. The\ndifficulties are mainly related to the data sources (many files with a lot of\ninformation and in different formats). In addition, the processing of this data\nis time-consuming and impractical when the time period under analysis\nincreases. Furthermore,the processing of spatial-temporal data requires the use\nof multiple specific tools, such as geographic information systems software and\nstatistical, which are not readily accessible to non-specialised users. The\nproposed solution is to develop libraries that are responsible for aggregating\ndifferent types of data related with pollution. In addition to allowing the\nintegration of different data, the libraries are also the basis for developing\nweb applications. The libraries allow the collection of data made available by\nthe Portuguese Environment Agency (APA) and official modelling results for\nEurope. The applications developed will extend the libraries to allow data\nprocessing and representation through Dashboards. These Dashboards provide\naccess to non-specialised users, namely regarding the trends of pollutants in\neach region. The implemented libraries allow the development of projects that\nwould need access to the same data sources. These Dashboards allow for\nsimplified access to data and for studies that have so far been beyond the\nreach of researchers.\n", "versions": [{"version": "v1", "created": "Thu, 4 Mar 2021 11:08:13 GMT"}], "update_date": "2021-03-05", "authors_parsed": [["Fernandes", "Filipe", ""], ["Serrano", "Helena", ""], ["Oliveira", "Maria Alexandra", ""], ["Branquinho", "Cristina", ""], ["Silva", "João Nuno", ""]]}, {"id": "2103.03351", "submitter": "Sanjay Rathee", "authors": "Sanjay Rathee and Sheah Lin Lee", "title": "So you want to be a Super Researcher?", "comments": "Available: https://researchmind.co.uk/super-researcher/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.DL", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Publishing original scientific research is inherent to the work of a\nresearcher. However, the pressure to maintain productivity and scientific\nimpact can lead to research group publishing excessively, negatively affecting\nthe mental health of a researcher. Ph.D. students and early career researchers\nare particularly susceptible to this pressure due to the inherent vulnerability\nof their positions. At present, there are no resources that concisely summarise\nthe publication culture of a research group to help the researcher make an\ninformed decision before joining. In this article, we present the 'Super\nResearcher' app, an R Shiny application(app) with a user-friendly interface.\nUsing text-mining methodology to extract publicly available author data from\nScopus, this pilot app has four fundamental functions to provide snapshot\ninformation that will help researchers grasp the publication culture of a\nresearch group within minutes. The 'Super Researcher' app provides information\non: 1) institution data, 2) author's publication, 3) co-author network plots\nand 4) publication journals. The 'Super Researcher' app is built on R shiny\nwhich provides an interactive interface to users. This app utilizes the Big\nData framework Apache Spark to mine relevant information from a huge author\ninformation database. The author's information is stored and manipulated using\nboth SQL(SQLite) and NoSQL(HBase) databases. Hbase is used for local data\nstorage and manipulation while SQLite feeds data to the R Shiny interface. In\nthis paper, we introduce these functionalities and illustrate how this\ninformation can help guide a researcher to select a new Principle Investigator\n(PI) with better compatibility in terms of publication attitude using a case\nstudy.\n  Available: https://researchmind.co.uk/super-researcher/\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2021 02:11:57 GMT"}], "update_date": "2021-03-08", "authors_parsed": [["Rathee", "Sanjay", ""], ["Lee", "Sheah Lin", ""]]}, {"id": "2103.03398", "submitter": "Yiling Lin", "authors": "Yiling Lin (University of Chicago, University of Pittsburgh), James\n  Allen Evans (University of Chicago), Lingfei Wu (University of Pittsburgh)", "title": "New Directions in Science Emerge from Disconnection and Discord", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Since the 1950s, citation number or \"impact\" has been the dominant metric by\nwhich science is quantitatively evaluated. But research contributions play\ndistinct roles in the unfolding drama of scientific debate, agreement and\nadvance, which are differentially valued by scientists and their institutions.\nComputational power, access to citation data and an array of modeling\ntechniques have given rise to a widening portfolio of metrics that extract\ndifferent signals regarding their contribution. Here we unpack the complex,\ntemporally evolving relationship between citation impact alongside novelty and\ndisruption, two emerging measures that capture the degree to which science not\nonly influences, but transforms later work. Novelty is measured at the point of\nproduction and captures how research draws upon unusual combinations of prior\nwork. Disruption is measured over time and captures how research comes to\neclipse or amplify the prior work on which it builds. We theorize that novel\npapers will exhibit disruptive impact over time, and demonstrate how they are\nmuch more likely than conventional papers to disrupt current literature. Novel\npapers do not do so immediately, but often become \"sleeping beauties\",\naccumulating surprising attention and citation impact over the long run. In\nsummary, new directions for science are created from a lack of consensus.\nFinally, we show how novelty can be reformulated as the combination of ideas\nacross knowledge space to reveal the combinatorial nature of advance. The\nevolution of knowledge space over time characterizes how yesterday's novelty\nforms today's scientific conventions, which condition the novelty-and\nsurprise-of tomorrow's breakthroughs.\n", "versions": [{"version": "v1", "created": "Fri, 5 Mar 2021 00:25:57 GMT"}, {"version": "v2", "created": "Wed, 30 Jun 2021 04:04:28 GMT"}], "update_date": "2021-07-01", "authors_parsed": [["Lin", "Yiling", "", "University of Chicago, University of Pittsburgh"], ["Evans", "James Allen", "", "University of Chicago"], ["Wu", "Lingfei", "", "University of Pittsburgh"]]}, {"id": "2103.03738", "submitter": "Muneer Ahmad", "authors": "Muneer Ahmad, M Sadik Batcha", "title": "Lotka's Law and Authorship Distribution in Coronary Artery Disease\n  Research in South Africa", "comments": "10 pages, 1 figure. arXiv admin note: substantial text overlap with\n  arXiv:2102.09182; text overlap with arXiv:2102.11739, arXiv:2102.11983", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Coronary artery disease (CAD) is a major cause of death and disability in\ndeveloped countries. Although CAD mortality rates worldwide have declined over\nthe past 4 decades, CAD remains responsible for approximately one-third or more\nof all deaths in individuals over age 35, and it has been estimated that nearly\nhalf of all middle-aged men and one-third of middle aged women in the United\nStates will develop clinical CAD. The present paper attempts to check the\napplicability of Lotka's Law on South African publication on Coronary artery\ndisease research. The study lights on Lotka's empirical law of scientific\nproductivity, i.e., Inverse Square Law, to measure the scientific productivity\nof authors, to test Lotka's Exponent value and the K.S test for the fitness of\nLotka's Law.\n", "versions": [{"version": "v1", "created": "Wed, 3 Mar 2021 07:24:36 GMT"}], "update_date": "2021-03-08", "authors_parsed": [["Ahmad", "Muneer", ""], ["Batcha", "M Sadik", ""]]}, {"id": "2103.04899", "submitter": "Shawn Jones", "authors": "Shawn M. Jones and Michele C. Weigle and Martin Klein and Michael L.\n  Nelson", "title": "Automatically Selecting Striking Images for Social Cards", "comments": "10 pages, 5 figures, 10 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To allow previewing a web page, social media platforms have developed social\ncards: visualizations consisting of vital information about the underlying\nresource. At a minimum, social cards often include features such as the web\nresource's title, text summary, striking image, and domain name. News and\nscholarly articles on the web are frequently subject to social card creation\nwhen being shared on social media. However, we noticed that not all web\nresources offer sufficient metadata elements to enable appealing social cards.\nFor example, the COVID-19 emergency has made it clear that scholarly articles,\nin particular, are at an aesthetic disadvantage in social media platforms when\ncompared to their often more flashy disinformation rivals. Also, social cards\nare often not generated correctly for archived web resources, including pages\nthat lack or predate standards for specifying striking images. With these\nobservations, we are motivated to quantify the levels of inclusion of required\nmetadata in web resources, its evolution over time for archived resources, and\ncreate and evaluate an algorithm to automatically select a striking image for\nsocial cards. We find that more than 40% of archived news articles sampled from\nthe NEWSROOM dataset and 22% of scholarly articles sampled from the PubMed\nCentral dataset fail to supply striking images. We demonstrate that we can\nautomatically predict the striking image with a Precision@1 of 0.83 for news\narticles from NEWSROOM and 0.78 for scholarly articles from the open access\njournal PLOS ONE.\n", "versions": [{"version": "v1", "created": "Mon, 8 Mar 2021 17:01:45 GMT"}], "update_date": "2021-03-09", "authors_parsed": [["Jones", "Shawn M.", ""], ["Weigle", "Michele C.", ""], ["Klein", "Martin", ""], ["Nelson", "Michael L.", ""]]}, {"id": "2103.05770", "submitter": "Cristel Chandre", "authors": "Cristel Chandre (I2M), Jonathan Dubois (MPI-PKS)", "title": "Notebook articles: towards a transformative publishing experience in\n  nonlinear science", "comments": "This article is an editorial viewpoint", "journal-ref": "Communications in Nonlinear Science and Numerical Simulation,\n  Elsevier, 2021, 97, pp.105753", "doi": "10.1016/j.cnsns.2021.105753", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Open Science, Reproducible Research, Findable, Accessible, Interoperable and\nReusable (FAIR) data principles are long term goals for scientific\ndissemination. However, the implementation of these principles calls for a\nreinspection of our means of dissemination. In our viewpoint, we discuss and\nadvocate, in the context of nonlinear science, how a notebook article\nrepresents an essential step toward this objective by fully embracing cloud\ncomputing solutions. Notebook articles as scholar articles offer an\nalternative, efficient and more ethical way to disseminate research through\ntheir versatile environment. This format invites the readers to delve deeper\ninto the reported research. Through the interactivity of the notebook articles,\nresearch results such as for instance equations and figures are reproducible\neven for non-expert readers. The codes and methods are available, in a\ntransparent manner, to interested readers. The methods can be reused and\nadapted to answer additional questions in related topics. The codes run on\ncloud computing services, which provide easy access, even to low-income\ncountries and research groups. The versatility of this environment provides the\nstakeholders - from the researchers to the publishers - with opportunities to\ndisseminate the research results in innovative ways.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2021 09:27:45 GMT"}], "update_date": "2021-03-11", "authors_parsed": [["Chandre", "Cristel", "", "I2M"], ["Dubois", "Jonathan", "", "MPI-PKS"]]}, {"id": "2103.05885", "submitter": "Gang Wang", "authors": "Gang Wang, Qi Peng, Yanfeng Zhang, Mingyang Zhang", "title": "What Have We Learned from OpenReview?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Anonymous peer review is used by the great majority of computer science\nconferences. OpenReview is such a platform that aims to promote openness in\npeer review process. The paper, (meta) reviews, rebuttals, and final decisions\nare all released to public. We collect 5,527 submissions and their 16,853\nreviews from the OpenReview platform. We also collect these submissions'\ncitation data from Google Scholar and their non-peer-reviewed versions from\narXiv.org. By acquiring deep insights into these data, we have several\ninteresting findings that could help understand the effectiveness of the\npublic-accessible double-blind peer review process. Our results can potentially\nhelp writing a paper, reviewing it, and deciding on its acceptance.\n", "versions": [{"version": "v1", "created": "Wed, 10 Mar 2021 06:00:12 GMT"}, {"version": "v2", "created": "Wed, 17 Mar 2021 01:34:32 GMT"}, {"version": "v3", "created": "Sat, 3 Apr 2021 06:56:17 GMT"}, {"version": "v4", "created": "Tue, 6 Apr 2021 10:31:13 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Wang", "Gang", ""], ["Peng", "Qi", ""], ["Zhang", "Yanfeng", ""], ["Zhang", "Mingyang", ""]]}, {"id": "2103.06989", "submitter": "Lucy Lu Wang", "authors": "Lucy Lu Wang, Kelly Mack, Emma McDonnell, Dhruv Jain, Leah Findlater,\n  Jon E. Froehlich", "title": "A bibliometric analysis of citation diversity in accessibility and HCI\n  research", "comments": "11 pages, 5 figures, 3 tables, 2 appendices; CHI LBW 2021; accessible\n  PDF available at https://makeabilitylab.cs.washington.edu/", "journal-ref": null, "doi": "10.1145/3411763.3451618", "report-no": null, "categories": "cs.DL cs.HC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Accessibility research sits at the junction of several disciplines, drawing\ninfluence from HCI, disability studies, psychology, education, and more. To\ncharacterize the influences and extensions of accessibility research, we\nundertake a study of citation trends for accessibility and related HCI\ncommunities. We assess the diversity of venues and fields of study represented\namong the referenced and citing papers of 836 accessibility research papers\nfrom ASSETS and CHI, finding that though publications in computer science\ndominate these citation relationships, the relative proportion of citations\nfrom papers on psychology and medicine has grown over time. Though ASSETS is a\nmore niche venue than CHI in terms of citational diversity, both conferences\ndisplay standard levels of diversity among their incoming and outgoing\ncitations when analyzed in the context of 53K papers from 13 accessibility and\nHCI conference venues.\n", "versions": [{"version": "v1", "created": "Thu, 11 Mar 2021 22:24:28 GMT"}], "update_date": "2021-03-15", "authors_parsed": [["Wang", "Lucy Lu", ""], ["Mack", "Kelly", ""], ["McDonnell", "Emma", ""], ["Jain", "Dhruv", ""], ["Findlater", "Leah", ""], ["Froehlich", "Jon E.", ""]]}, {"id": "2103.07007", "submitter": "Vlad Atanasiu", "authors": "Vlad Atanasiu, Rolf Ingold", "title": "Document Towers: A MATLAB software implementing a three-dimensional\n  architectural paradigm for the visual exploration of digital documents and\n  libraries", "comments": "Afferent Open Source software is found at\n  https://github.com/ElsevierSoftwareX/SOFTX-D-21-00009", "journal-ref": "SoftwareX, 2021 (14): 100684", "doi": "10.1016/j.softx.2021.100684", "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This article introduces the generic Document Towers paradigm, visualization,\nand software for visualizing the structure of paginated documents, based on the\nmetaphor of documents-as-architecture. The Document Towers visualizations\nresemble three-dimensional building models and represent the physical\nboundaries of logical (e.g., titles, images), semantic (e.g., topics, named\nentities), graphical (e.g., typefaces, colors), and other types of information\nwith spatial extent as a stack of rooms and floors. The software takes as input\nuser-supplied JSON-formatted coordinates and labels of document entities, or\nextracts them itself from ALTO and InDesign IDML files. The Document Towers\nparadigm and visualization enable information systems to support information\nbehaviors other than goal-oriented searches. Visualization encourages\nexploration by generating panoramic overviews and fostering serendipitous\ninsights, while the use of metaphors assists with comprehension of the\nrepresentations through the application of a familiar cognitive model. Document\nTowers visualizations also provide access to types of information other than\ntextual content, specifically by means of their physical structure, which\ncorresponds to the material, logical, semantic, and contextual aspects of\ndocuments. Visualization renders documents transparent, making the invisible\nvisible and facilitating analysis at a glance and without the need for physical\nmanipulation. Keyword searches and other language-based interactions with\ndocuments must be clearly expressed and will return only answers to questions\nasked; by contrast, visual observation is well suited to fuzzy goals and\nuncovering unexpected aspects of the data.\n", "versions": [{"version": "v1", "created": "Thu, 11 Mar 2021 23:46:45 GMT"}], "update_date": "2021-03-17", "authors_parsed": [["Atanasiu", "Vlad", ""], ["Ingold", "Rolf", ""]]}, {"id": "2103.07534", "submitter": "Sergey Feldman", "authors": "Shivashankar Subramanian, Daniel King, Doug Downey and Sergey Feldman", "title": "S2AND: A Benchmark and Evaluation System for Author Name Disambiguation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Author Name Disambiguation (AND) is the task of resolving which author\nmentions in a bibliographic database refer to the same real-world person, and\nis a critical ingredient of digital library applications such as search and\ncitation analysis. While many AND algorithms have been proposed, comparing them\nis difficult because they often employ distinct features and are evaluated on\ndifferent datasets. In response to this challenge, we present S2AND, a unified\nbenchmark dataset for AND on scholarly papers, as well as an open-source\nreference model implementation. Our dataset harmonizes eight disparate AND\ndatasets into a uniform format, with a single rich feature set drawn from the\nSemantic Scholar (S2) database. Our evaluation suite for S2AND reports\nperformance split by facets like publication year and number of papers,\nallowing researchers to track both global performance and measures of fairness\nacross facet values. Our experiments show that because previous datasets tend\nto cover idiosyncratic and biased slices of the literature, algorithms trained\nto perform well on one on them may generalize poorly to others. By contrast, we\nshow how training on a union of datasets in S2AND results in more robust models\nthat perform well even on datasets unseen in training. The resulting AND model\nalso substantially improves over the production algorithm in S2, reducing error\nby over 50% in terms of $B^3$ F1. We release our unified dataset, model code,\ntrained models, and evaluation suite to the research community.\nhttps://github.com/allenai/S2AND/\n", "versions": [{"version": "v1", "created": "Fri, 12 Mar 2021 21:22:36 GMT"}, {"version": "v2", "created": "Thu, 15 Jul 2021 16:17:13 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Subramanian", "Shivashankar", ""], ["King", "Daniel", ""], ["Downey", "Doug", ""], ["Feldman", "Sergey", ""]]}, {"id": "2103.07538", "submitter": "Sandeep Soni", "authors": "Sandeep Soni and Lauren Klein and Jacob Eisenstein", "title": "Abolitionist Networks: Modeling Language Change in Nineteenth-Century\n  Activist Newspapers", "comments": "23 pages, 6 figures, 2 tables", "journal-ref": "Journal of Cultural Analytics (2021)", "doi": null, "report-no": null, "categories": "cs.CL cs.CY cs.DL cs.SI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The abolitionist movement of the nineteenth-century United States remains\namong the most significant social and political movements in US history.\nAbolitionist newspapers played a crucial role in spreading information and\nshaping public opinion around a range of issues relating to the abolition of\nslavery. These newspapers also serve as a primary source of information about\nthe movement for scholars today, resulting in powerful new accounts of the\nmovement and its leaders. This paper supplements recent qualitative work on the\nrole of women in abolition's vanguard, as well as the role of the Black press,\nwith a quantitative text modeling approach. Using diachronic word embeddings,\nwe identify which newspapers tended to lead lexical semantic innovations -- the\nintroduction of new usages of specific words -- and which newspapers tended to\nfollow. We then aggregate the evidence across hundreds of changes into a\nweighted network with the newspapers as nodes; directed edge weights represent\nthe frequency with which each newspaper led the other in the adoption of a\nlexical semantic change. Analysis of this network reveals pathways of lexical\nsemantic influence, distinguishing leaders from followers, as well as others\nwho stood apart from the semantic changes that swept through this period. More\nspecifically, we find that two newspapers edited by women -- THE PROVINCIAL\nFREEMAN and THE LILY -- led a large number of semantic changes in our corpus,\nlending additional credence to the argument that a multiracial coalition of\nwomen led the abolitionist movement in terms of both thought and action. It\nalso contributes additional complexity to the scholarship that has sought to\ntease apart the relation of the abolitionist movement to the women's suffrage\nmovement, and the vexed racial politics that characterized their relation.\n", "versions": [{"version": "v1", "created": "Fri, 12 Mar 2021 21:26:30 GMT"}], "update_date": "2021-03-16", "authors_parsed": [["Soni", "Sandeep", ""], ["Klein", "Lauren", ""], ["Eisenstein", "Jacob", ""]]}, {"id": "2103.07942", "submitter": "Francesco Poggi", "authors": "Federica Bologna, Angelo Di Iorio, Silvio Peroni, Francesco Poggi", "title": "Do open citations inform the qualitative peer-review evaluation in\n  research assessments? An analysis of the Italian National Scientific\n  Qualification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In the past, several works have investigated ways for combining quantitative\nand qualitative methods in research assessment exercises. Indeed, the Italian\nNational Scientific Qualification (NSQ), i.e. the national assessment exercise\nwhich aims at deciding whether a scholar can apply to professorial academic\npositions as Associate Professor and Full Professor, adopts a quantitative and\nqualitative evaluation process: it makes use of bibliometrics followed by a\npeer-review process of candidates' CVs. The NSQ divides academic disciplines\ninto two categories, i.e. citation-based disciplines (CDs) and\nnon-citation-based disciplines (NDs), a division that affects the metrics used\nfor assessing the candidates of that discipline in the first part of the\nprocess, which is based on bibliometrics. In this work, we aim at exploring\nwhether citation-based metrics, calculated only considering open bibliographic\nand citation data, can support the human peer-review of NDs and yield insights\non how it is conducted. To understand if and what citation-based (and,\npossibly, other) metrics provide relevant information, we created a series of\nmachine learning models to replicate the decisions of the NSQ committees. As\none of the main outcomes of our study, we noticed that the strength of the\ncitational relationship between the candidate and the commission in charge of\nassessing his/her CV seems to play a role in the peer-review phase of the NSQ\nof NDs.\n", "versions": [{"version": "v1", "created": "Sun, 14 Mar 2021 14:44:45 GMT"}], "update_date": "2021-03-16", "authors_parsed": [["Bologna", "Federica", ""], ["Di Iorio", "Angelo", ""], ["Peroni", "Silvio", ""], ["Poggi", "Francesco", ""]]}, {"id": "2103.08931", "submitter": "Jian Wang", "authors": "Jian Wang and Suzan Verberne", "title": "Two tales of science technology linkage: Patent in-text versus\n  front-page references", "comments": "45 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  There is recurrent debate about how useful science is for technological\ndevelopment, but we know little about what kinds of science are more useful for\ntechnology. This paper fills this gap in the literature by exploring how the\nvalue of a patent (as measured by patent forward citations and the stock market\nresponse to the issuing of the patent) depends on the characteristics of the\nscientific papers that it builds on, specifically, basicness,\ninterdisciplinarity, novelty, and scientific citations. Using a dataset of\n33,337 USPTO biotech utility patents and their 860,879 in-text references to\nWeb of Science journal articles, we find (1) a positive effect of the number of\nreferenced scientific papers, (2) an inverted U-shaped effect of basicness, (3)\nan insignificant effect of interdisciplinarity, (4) a discontinuous and\nnonlinear effect of novelty, and (5) a positive effect of scientific citations\nfor patent market value but an insignificant effect on patent citations. In\naddition, in-text referenced papers have a higher chance of being listed on the\nfront-page of the same patent when they are moderately basic, less\ninterdisciplinary, less novel, and more highly cited. Accordingly, using\nfront-page reference yields substantially different results than using in-text\nreferences.\n", "versions": [{"version": "v1", "created": "Tue, 16 Mar 2021 09:28:28 GMT"}], "update_date": "2021-03-17", "authors_parsed": [["Wang", "Jian", ""], ["Verberne", "Suzan", ""]]}, {"id": "2103.09311", "submitter": "Arash Shaban-Nejad", "authors": "Nariman Ammar, James E Bailey, Robert L Davis, Arash Shaban-Nejad", "title": "Using a Personal Health Library-Enabled mHealth Recommender System for\n  Self-Management of Diabetes Among Underserved Populations: Use Case for\n  Knowledge Graphs and Linked Data", "comments": "21 Pages, 13 Figures", "journal-ref": "JMIR Form Res. 2021 March 16;5(3):e24738", "doi": "10.2196/24738", "report-no": null, "categories": "cs.AI cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Personal health libraries (PHLs) provide a single point of secure access to\npatients digital health data and enable the integration of knowledge stored in\ntheir digital health profiles with other sources of global knowledge. PHLs can\nhelp empower caregivers and health care providers to make informed decisions\nabout patients health by understanding medical events in the context of their\nlives. This paper reports the implementation of a mobile health digital\nintervention that incorporates both digital health data stored in patients PHLs\nand other sources of contextual knowledge to deliver tailored recommendations\nfor improving self-care behaviors in diabetic adults. We conducted a thematic\nassessment of patient functional and nonfunctional requirements that are\nmissing from current EHRs based on evidence from the literature. We used the\nresults to identify the technologies needed to address those requirements. We\ndescribe the technological infrastructures used to construct, manage, and\nintegrate the types of knowledge stored in the PHL. We leverage the Social\nLinked Data (Solid) platform to design a fully decentralized and privacy-aware\nplatform that supports interoperability and care integration. We provided an\ninitial prototype design of a PHL and drafted a use case scenario that involves\nfour actors to demonstrate how the proposed prototype can be used to address\nuser requirements, including the construction and management of the PHL and its\nutilization for developing a mobile app that queries the knowledge stored and\nintegrated into the PHL in a private and fully decentralized manner to provide\nbetter recommendations. The proposed PHL helps patients and their caregivers\ntake a central role in making decisions regarding their health and equips their\nhealth care providers with informatics tools that support the collection and\ninterpretation of the collected knowledge.\n", "versions": [{"version": "v1", "created": "Tue, 16 Mar 2021 20:43:17 GMT"}], "update_date": "2021-03-18", "authors_parsed": [["Ammar", "Nariman", ""], ["Bailey", "James E", ""], ["Davis", "Robert L", ""], ["Shaban-Nejad", "Arash", ""]]}, {"id": "2103.09431", "submitter": "Sergio Rojas-Galeano", "authors": "Nathalia Chaparro and Sergio Rojas-Galeano", "title": "Revealing the research landscape of Master's degrees via bibliometric\n  analyses", "comments": "https://digitalcommons.unl.edu/libphilprac/5351/", "journal-ref": "Library Philosophy and Practice (e-journal), 2021", "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The evolution of a Master's programme, like many other human institutions,\ncan be viewed as a self-organising system whose underlying structures and\ndynamics arise primarily from the interaction of its faculty and students.\nIdentifying these hidden properties may not be a trivial task, due to the\ncomplex behaviour implicit in such evolution. Nonetheless, we argue that the\nprogramme's body of research production (represented mainly by dissertations)\ncan serve this purpose. Bibliometric analyses of such data can reveal insights\nabout production growth, collaborative networks, and visual mapping of\nestablished, niche, and emerging research topics, among other facets. Thus, we\npropose a bibliometric workflow aimed at discovering the production dynamics,\nas well as the conceptual, social and intellectual structures developed by the\nMaster's degree, in the interest of guiding decision-makers to better assess\nthe strengths of the programme and to prioritise strategic goals. In addition,\nwe report two case studies to illustrate the realisation of the proposed\nworkflow. We conclude with considerations on the possible application of the\napproach to other academic research units.\n", "versions": [{"version": "v1", "created": "Wed, 17 Mar 2021 04:18:16 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Chaparro", "Nathalia", ""], ["Rojas-Galeano", "Sergio", ""]]}, {"id": "2103.09917", "submitter": "Fabian Scheller", "authors": "Dominik Franjo Dominkovi\\'c, Jann Michael Weinand, Fabian Scheller,\n  Matteo D'Andrea, Russell McKenna", "title": "Reviewing two decades of energy system analysis with bibliometrics", "comments": "Energy system analysis, bibliometrics, collaboration networks,\n  renewable energy, paper impact, h-index, gross expenditure on research and\n  development, Scopus analysis, scientific productivity of nations", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SY eess.SY", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The field of Energy System Analysis (ESA) has experienced exponential growth\nin the number of publications since at least the year 2000. This paper presents\na comprehensive bibliometric analysis on ESA by employing different algorithms\nin Matlab and R. The focus of results is on quantitative indicators relating to\nnumber and type of publication outputs, collaboration links between\ninstitutions, authors and countries, and dynamic trends within the field. The\nfive and twelve most productive countries have 50% and 80% of ESA publications\nrespectively. The dominant institutions are even more concentrated within a\nsmall number of countries. A significant concentration of published papers\nwithin countries and institutions was also confirmed by analysing collaboration\nnetworks. These show dominant collaboration within the same university or at\nleast the same country. There is also is a strong link among the most\nsuccessful journals, authors and institutions. The Energy journal has had the\nmost publications in the field, and its editor-in-chief Lund H is the author\nwith most of the publications in the field, as well as the author with most of\nthe highly cited publications in the field. In terms of the dynamics within the\nfield in the past decade, recent years have seen a higher impact of topics\nrelated to flexibility and hybrid/integrated energy systems alongside a decline\nin individual technologies. This paper provides a holistic overview of two\ndecades' research output and enables interested readers to obtain a\ncomprehensive overview of the key trends in this active field.\n", "versions": [{"version": "v1", "created": "Wed, 17 Mar 2021 21:26:04 GMT"}], "update_date": "2021-03-24", "authors_parsed": [["Dominković", "Dominik Franjo", ""], ["Weinand", "Jann Michael", ""], ["Scheller", "Fabian", ""], ["D'Andrea", "Matteo", ""], ["McKenna", "Russell", ""]]}, {"id": "2103.10225", "submitter": "Lutz Bornmann Dr.", "authors": "Lutz Bornmann, Ruediger Mutz, Robin Haunschild, Felix de Moya-Anegon,\n  Mirko de Almeida Madeira Clemente, Moritz Stefaner", "title": "Mapping the impact of papers on various status groups: A new excellence\n  mapping tool based on citation and reader scores", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In over five years, Bornmann, Stefaner, de Moya Anegon, and Mutz (2014) and\nBornmann, Stefaner, de Moya Anegon, and Mutz (2014, 2015) have published\nseveral releases of the www.excellencemapping.net tool revealing (clusters of)\nexcellent institutions worldwide based on citation data. With the new release,\na completely revised tool has been published. It is not only based on citation\ndata (bibliometrics), but also Mendeley data (altmetrics). Thus, the\ninstitutional impact measurement of the tool has been expanded by focusing on\nadditional status groups besides researchers such as students and librarians.\nFurthermore, the visualization of the data has been completely updated by\nimproving the operability for the user and including new features such as\ninstitutional profile pages. In this paper, we describe the datasets for the\ncurrent excellencemapping.net tool and the indicators applied. Furthermore, the\nunderlying statistics for the tool and the use of the web application are\nexplained.\n", "versions": [{"version": "v1", "created": "Thu, 18 Mar 2021 12:56:14 GMT"}], "update_date": "2021-03-19", "authors_parsed": [["Bornmann", "Lutz", ""], ["Mutz", "Ruediger", ""], ["Haunschild", "Robin", ""], ["de Moya-Anegon", "Felix", ""], ["Clemente", "Mirko de Almeida Madeira", ""], ["Stefaner", "Moritz", ""]]}, {"id": "2103.10641", "submitter": "Alexander Petersen", "authors": "Dong Yang and Ioannis Pavlidis and Alexander M. Petersen", "title": "Biomedical Convergence Facilitated by the Emergence of Technological and\n  Informatic Capabilities", "comments": "12 pages, 4 figures; 8 pages of Supplementary Information", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We analyzed Medical Subject Headings (MeSH) from 21.6 million research\narticles indexed by PubMed to map this vast space of entities and their\nrelations, providing insights into the origins and future of biomedical\nconvergence. Detailed analysis of MeSH co-occurrence networks identifies three\nrobust knowledge clusters: the vast universe of microscopic biological entities\nand structures; systems, disease and diagnostics; and emergent biological and\nsocial phenomena underlying the complex problems driving the health, behavioral\nand brain science frontiers. These domains integrated from the 1990s onward by\nway of technological and informatic capabilities that introduced highly\ncontrollable, scalable and permutable research processes and invaluable imaging\ntechniques for illuminating fundamental structure-function-behavior questions.\nArticle-level analysis confirms a positive relationship between team size and\ntopical diversity, and shows convergence to be increasing in prominence but\nwith recent saturation. Together, our results invite additional policy support\nfor cross-disciplinary team assembly to harness transdisciplinary convergence.\n", "versions": [{"version": "v1", "created": "Fri, 19 Mar 2021 05:39:05 GMT"}], "update_date": "2021-03-22", "authors_parsed": [["Yang", "Dong", ""], ["Pavlidis", "Ioannis", ""], ["Petersen", "Alexander M.", ""]]}, {"id": "2103.10761", "submitter": "Mikhail Gorbunov-Posadov", "authors": "Mikhail Mikhailovich Gorbunov-Posadov", "title": "Alive publication", "comments": "26 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  An alive publication is a scientific work published on the Internet that is\nconstantly being developed and improved by its author. In this case, serious\nerrors and typos are no longer fatal, nor do they haunt the author for the rest\nof his or her life. The reader of an alive publication knows that the author is\nconstantly monitoring changes occurring in the science branch under\nconsideration. The dynamics of an alive publication and rejection of the\nleading role of printing open the door for many of the indispensable qualities\nthat were absent from a printed version. These features allow us to discuss a\nnew genre or a new paradigm of scientific publication.\n", "versions": [{"version": "v1", "created": "Fri, 19 Mar 2021 12:16:34 GMT"}], "update_date": "2021-03-22", "authors_parsed": [["Gorbunov-Posadov", "Mikhail Mikhailovich", ""]]}, {"id": "2103.10944", "submitter": "Buddhika Nettasinghe", "authors": "Buddhika Nettasinghe, Nazanin Alipourfard, Vikram Krishnamurthy,\n  Kristina Lerman", "title": "Emergence of Structural Inequalities in Scientific Citation Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CY cs.DL cs.SI stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Structural inequalities persist in society, conferring systematic advantages\nto some people at the expense of others, for example, by giving them\nsubstantially more influence and opportunities. Using bibliometric data about\nauthors of scientific publications, we identify two types of structural\ninequalities in scientific citations. First, female authors, who represent a\nminority of researchers, receive less recognition for their work (through\ncitations) relative to male authors; second, authors affiliated with top-ranked\ninstitutions, who are also a minority, receive substantially more recognition\ncompared to other authors. We present a model for the growth of directed\ncitation networks and show that citations disparities arise from individual\npreferences to cite authors from the same group (homophily), highly cited or\nactive authors (preferential attachment), as well as the size of the group and\nhow frequently new authors join. We analyze the model and show that its\npredictions align well with real-world observations. Our theoretical and\nempirical analysis also suggests potential strategies to mitigate structural\ninequalities in science. In particular, we find that merely increasing the\nminority group size does little to narrow the disparities. Instead, reducing\nthe homophily of each group, frequently adding new authors to a research field\nwhile providing them an accessible platform among existing, established\nauthors, together with balanced group sizes can have the largest impact on\nreducing inequality. Our work highlights additional complexities of mitigating\nstructural disparities stemming from asymmetric relations (e.g., directed\ncitations) compared to symmetric relations (e.g., collaborations).\n", "versions": [{"version": "v1", "created": "Fri, 19 Mar 2021 17:53:08 GMT"}, {"version": "v2", "created": "Sun, 2 May 2021 02:52:08 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Nettasinghe", "Buddhika", ""], ["Alipourfard", "Nazanin", ""], ["Krishnamurthy", "Vikram", ""], ["Lerman", "Kristina", ""]]}, {"id": "2103.11100", "submitter": "Vivek Kumar Singh Ph.D.", "authors": "Vivek Kumar Singh, Prashasti Singh, Ashraf Uddin, Parveen Arora, Sujit\n  Bhattacharya", "title": "Influence of journals indexed from a country on its research output: An\n  empirical investigation", "comments": "6 figures and 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Scientific journals are currently the primary medium used by researchers to\nreport their research findings. The transformation of print journals into\ne-journals has simplified the process of submissions to journals and also their\naccess has become wider. Journals are usually published by commercial\npublishers, learned societies as well as Universities. There are different\nnumber of journals published from different countries. This paper attempts to\nexplore whether the number of journals published from a country influences its\nresearch output. Scopus master journal list is analysed to identify journals\npublished from 50 selected countries with significant volume of research\noutput. The following relationship are analysed: (a) number of journals from a\ncountry and its research output, (b) growth rate of journals and research\noutput for different countries, (c) global share of journals and research\noutput for different countries, and (d) subject area-wise number of journals\nand research output in that subject area for different countries. Factors like\njournal packing density are also analysed. The results obtained show that for\nmajority of the countries, the number of journals is positively correlated to\ntheir research output volume, though some other factors also play a role in\ngrowth of research output. The study at the end presents a discussion of the\nanalytical outcomes and provides useful suggestions on policy perspectives for\ndifferent countries.\n", "versions": [{"version": "v1", "created": "Sat, 20 Mar 2021 05:17:16 GMT"}], "update_date": "2021-03-23", "authors_parsed": [["Singh", "Vivek Kumar", ""], ["Singh", "Prashasti", ""], ["Uddin", "Ashraf", ""], ["Arora", "Parveen", ""], ["Bhattacharya", "Sujit", ""]]}, {"id": "2103.11547", "submitter": "Alexander Petersen", "authors": "Alexander M. Petersen and Mohammed E. Ahmed and Ioannis Pavlidis", "title": "Grand challenges and emergent modes of convergence science", "comments": "15 pages, 5 figures; Supplementary Information: 25 pages, 12 Figures\n  and 5 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI econ.GN physics.soc-ph q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  To address complex problems, scholars are increasingly faced with challenges\nof integrating diverse knowledge domains. We analyzed the evolution of this\nconvergence paradigm in the broad ecosystem of brain science, which provides a\nreal-time testbed for evaluating two modes of cross-domain integration -\nsubject area exploration via expansive learning and cross-disciplinary\ncollaboration among domain experts. We show that research involving both modes\nfeatures a 16% citation premium relative to a mono-disciplinary baseline.\nFurther comparison of research integrating neighboring versus distant research\ndomains shows that the cross-disciplinary mode is essential for integrating\nacross relatively large disciplinary distances. Yet we find research utilizing\ncross-domain subject area exploration alone - a convergence shortcut - to be\ngrowing in prevalence at roughly 3% per year, significantly faster than the\nalternative cross-disciplinary mode, despite being less effective at\nintegrating domains and markedly less impactful. By measuring shifts in the\nprevalence and impact of different convergence modes in the 5-year intervals\nbefore and after 2013, our results indicate that these counterproductive\npatterns may relate to competitive pressures associated with global Human Brain\nflagship funding initiatives. Without additional policy guidance, such Grand\nChallenge flagships may unintentionally incentivize such convergence shortcuts,\nthereby undercutting the advantages of cross-disciplinary teams in tackling\nchallenges calling on convergence.\n", "versions": [{"version": "v1", "created": "Mon, 22 Mar 2021 02:35:51 GMT"}], "update_date": "2021-03-23", "authors_parsed": [["Petersen", "Alexander M.", ""], ["Ahmed", "Mohammed E.", ""], ["Pavlidis", "Ioannis", ""]]}, {"id": "2103.11909", "submitter": "Jan Philip Wahle", "authors": "Jan Philip Wahle, Terry Ruas, Tom\\'a\\v{s} Folt\\'ynek, Norman Meuschke,\n  Bela Gipp", "title": "Identifying Machine-Paraphrased Plagiarism", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI cs.DL", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Employing paraphrasing tools to conceal plagiarized text is a severe threat\nto academic integrity. To enable the detection of machine-paraphrased text, we\nevaluate the effectiveness of five pre-trained word embedding models combined\nwith machine learning classifiers and state-of-the-art neural language models.\nWe analyze preprints of research papers, graduation theses, and Wikipedia\narticles, which we paraphrased using different configurations of the tools\nSpinBot and SpinnerChief. The best performing technique, Longformer, achieved\nan average F1 score of 80.99% (F1=99.68% for SpinBot and F1=71.64% for\nSpinnerChief cases), while human evaluators achieved F1=78.4% for SpinBot and\nF1=65.6% for SpinnerChief cases. We show that the automated classification\nalleviates shortcomings of widely-used text-matching systems, such as Turnitin\nand PlagScan. To facilitate future research, all data, code, and two web\napplications showcasing our contributions are openly available.\n", "versions": [{"version": "v1", "created": "Mon, 22 Mar 2021 14:54:54 GMT"}], "update_date": "2021-03-23", "authors_parsed": [["Wahle", "Jan Philip", ""], ["Ruas", "Terry", ""], ["Foltýnek", "Tomáš", ""], ["Meuschke", "Norman", ""], ["Gipp", "Bela", ""]]}, {"id": "2103.11911", "submitter": "Zhao Qu", "authors": "Zhao Qu", "title": "Research networks generated by organizational structures, co-authorships\n  and citations: A Case Study of German Centre for Integrative Biodiversity\n  Research (iDiv)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exploring whether different patterns emerge across networks generated by\norganizational structures, co-authorships and citations for characterizing and\nevaluating cooperative relationships is particularly important for transferring\nthe research results into practice. This research-in-progress paper focuses on\nusing the structure of scientific collaborations and mapping knowledge transfer\nto gain insight into the influence of collaborative research centres linked to\nthe German Research Foundation (DFG) funding. Within the German Centre for\nIntegrative Biodiversity Research (iDiv), the DFG sponsors research conducted\nacross all participating universities and institutes by more than hundred\nresearch groups who bring their expertise to the manifold research fields of\nbiodiversity. Using iDiv research from 2013-2020, we build co-authorship\nnetworks and identify the most cohesive communities in terms of collaboration\nand compare them with groups presented on its website. Corresponding cited and\nciting works are analysed by distributions to investigate disciplinary\ncollaboration. Our findings show that the number of publications and the\nintensity of research collaboration have maintained a steady increase. Despite\nthe highly cohesive cooperation structure addressed by iDiv, the internal\nscientific collaboration has not gained strong momentum compared with its\ngrowing trends in international collaborations. The tendency towards covering\ncross-disciplinary research foci is not evident.\n", "versions": [{"version": "v1", "created": "Mon, 22 Mar 2021 14:55:13 GMT"}], "update_date": "2021-03-23", "authors_parsed": [["Qu", "Zhao", ""]]}, {"id": "2103.11987", "submitter": "Ram\\'on Feenstra", "authors": "Ramon A. Feenstra and Emilio Delgado Lopez-Cozar", "title": "The footprint of a metrics-based research evaluation system on Spanish\n  philosophical scholarship: an analysis of researchers perceptions", "comments": "28 pages, 4 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The use of bibliometric indicators in research evaluation has a series of\ncomplex impacts on academic inquiry. These systems have gradually spread into a\nwide range of locations and disciplines, including the humanities. The aim of\nthe present study is to examine their effects as perceived by philosophy\nresearchers in Spain, a country where bibliometric indicators have long been\nused to evaluate research. The study combines data from a self-administered\nquestionnaire completed by 201 researchers and from 14 in-depth interviews with\nresearchers selected according to their affiliation, professional category,\ngender and area of knowledge. Results show that the evaluation system is widely\nperceived to affect research behaviour in significant ways, particularly\nrelated to publication practices (document type and publication language), the\ntransformation of research agendas and the neglect of teaching work, as well as\nincreasing research misconduct and negatively affecting mental health. Although\nto a lesser extent, other consequences included increased research productivity\nand enhanced transparency and impartiality in academic selection processes.\n", "versions": [{"version": "v1", "created": "Mon, 22 Mar 2021 16:34:06 GMT"}], "update_date": "2021-03-23", "authors_parsed": [["Feenstra", "Ramon A.", ""], ["Lopez-Cozar", "Emilio Delgado", ""]]}, {"id": "2103.12227", "submitter": "Tat-Thang Vo", "authors": "Tat-Thang Vo and Stijn Vansteelandt", "title": "Challenges in systematic reviews and meta-analyses of mediation analyses", "comments": "Currently under peer-review at the American Journal of Epidemiology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL stat.AP", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Systematic reviews and meta-analyses of mediation studies are increasingly\nbeing implemented in practice. Nonetheless, the methodology for conducting such\nreview and analysis is still in a development phase, with much room for\nimprovement. In this paper, we highlight and discuss challenges that\ninvestigators face in mediation systematic reviews and meta-analyses, then\npropose ways of accommodating these in practice.\n", "versions": [{"version": "v1", "created": "Mon, 22 Mar 2021 23:26:34 GMT"}], "update_date": "2021-03-24", "authors_parsed": [["Vo", "Tat-Thang", ""], ["Vansteelandt", "Stijn", ""]]}, {"id": "2103.12450", "submitter": "Jan Philip Wahle", "authors": "Jan Philip Wahle, Terry Ruas, Norman Meuschke, Bela Gipp", "title": "Are Neural Language Models Good Plagiarists? A Benchmark for Neural\n  Paraphrase Detection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI cs.DL", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  The rise of language models such as BERT allows for high-quality text\nparaphrasing. This is a problem to academic integrity, as it is difficult to\ndifferentiate between original and machine-generated content. We propose a\nbenchmark consisting of paraphrased articles using recent language models\nrelying on the Transformer architecture. Our contribution fosters future\nresearch of paraphrase detection systems as it offers a large collection of\naligned original and paraphrased documents, a study regarding its structure,\nclassification experiments with state-of-the-art systems, and we make our\nfindings publicly available.\n", "versions": [{"version": "v1", "created": "Tue, 23 Mar 2021 11:01:35 GMT"}], "update_date": "2021-03-24", "authors_parsed": [["Wahle", "Jan Philip", ""], ["Ruas", "Terry", ""], ["Meuschke", "Norman", ""], ["Gipp", "Bela", ""]]}, {"id": "2103.12488", "submitter": "Riccardo Bertoglio", "authors": "Riccardo Bertoglio, Chiara Corbo, Filippo M. Renga, Matteo Matteucci", "title": "The Digital Agricultural Revolution: a Bibliometric Analysis Literature\n  Review", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The application of digital technologies in agriculture can improve\ntraditional practices to adapt to climate changes, reduce greenhouse gas\nemissions, and promote a sustainable intensification for food security. The\nterms Smart Agriculture, Digital Agriculture, and Agriculture 4.0 are used in\nthe literature to describe the digitalization of agricultural practices. Some\nauthors argued that we are experiencing a Digital Agricultural Revolution (DAR)\nthat will boost sustainable farming. Nevertheless, there is no clear and\ncommonly accepted definition of the DAR-related terms, and it is not even\nevident which are the technological pillars supporting the DAR. To find\nevidence of the DAR's on-going process, we investigated the scientific\nliterature with bibliometric analysis tools to produce an objective and\nreproducible literature review. We retrieved 4995 articles by querying the Web\nof Science database in the timespan 2012-2019, and we analyzed the obtained\ndataset to answer three specific research questions: i) what is the spectrum of\nthe DAR-related terminology?; ii) what are the key articles and the most\ninfluential authors, journals, institutions, and countries?; iii) what are the\nmain research streams and the emerging topics? By grouping the authors'\nkeywords reported on publications, we identified five main research streams:\nClimate-Smart Agriculture, Site-Specific Management, Remote Sensing, Internet\nof Things, and Machine Learning. To provide a broad overview of each of these\ntopics, we analyzed relevant review articles, and we present here the main\nachievements and the on-going challenges. Finally, we showed the trending\ntopics of the last three years (2017, 2018, 2019).\n", "versions": [{"version": "v1", "created": "Tue, 23 Mar 2021 12:27:55 GMT"}], "update_date": "2021-03-24", "authors_parsed": [["Bertoglio", "Riccardo", ""], ["Corbo", "Chiara", ""], ["Renga", "Filippo M.", ""], ["Matteucci", "Matteo", ""]]}, {"id": "2103.12793", "submitter": "Ana Trisovic", "authors": "Ana Trisovic, Matthew K. Lau, Thomas Pasquier and Merc\\`e Crosas", "title": "A large-scale study on research code quality and execution", "comments": "30 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a study on the quality and execution of research code\nfrom publicly-available replication datasets at the Harvard Dataverse\nrepository. Research code is typically created by a group of scientists and\npublished together with academic papers to facilitate research transparency and\nreproducibility. For this study, we define ten questions to address aspects\nimpacting research reproducibility and reuse. First, we retrieve and analyze\nmore than 2000 replication datasets with over 9000 unique R files published\nfrom 2010 to 2020. Second, we execute the code in a clean runtime environment\nto assess its ease of reuse. Common coding errors were identified, and some of\nthem were solved with automatic code cleaning to aid code execution. We find\nthat 74\\% of R files crashed in the initial execution, while 56\\% crashed when\ncode cleaning was applied, showing that many errors can be prevented with good\ncoding practices. We also analyze the replication datasets from journals'\ncollections and discuss the impact of the journal policy strictness on the code\nre-execution rate. Finally, based on our results, we propose a set of\nrecommendations for code dissemination aimed at researchers, journals, and\nrepositories.\n", "versions": [{"version": "v1", "created": "Tue, 23 Mar 2021 18:55:09 GMT"}], "update_date": "2021-03-25", "authors_parsed": [["Trisovic", "Ana", ""], ["Lau", "Matthew K.", ""], ["Pasquier", "Thomas", ""], ["Crosas", "Mercè", ""]]}, {"id": "2103.12841", "submitter": "Arianna Betti", "authors": "Yvette Oortwijn, Hein van den Berg, and Arianna Betti", "title": "Ground Truths for the Humanities", "comments": "Provocation paper presented at the 5th Workshop on Visualization for\n  the Digital Humanities (VIS4DH), part of the 31st IEEE Visualization\n  Conference, IEEE VIS 2020, Virtual Event, Salt Lake City, USA, October 25-30,\n  2020. 1 page + 1 page of references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ensuring a faithful interaction with data and its representation for\nhumanities can and should depend on expert-constructed ground truths.\n", "versions": [{"version": "v1", "created": "Tue, 23 Mar 2021 21:05:42 GMT"}], "update_date": "2021-03-25", "authors_parsed": [["Oortwijn", "Yvette", ""], ["Berg", "Hein van den", ""], ["Betti", "Arianna", ""]]}, {"id": "2103.13526", "submitter": "Francesco Osborne", "authors": "Thiviyan Thanapalasingam, Francesco Osborne, Aliaksandr Birukou and\n  Enrico Motta", "title": "Ontology-Based Recommendation of Editorial Products", "comments": "In: The Semantic Web - ISWC 2018. Lecture Notes in Computer Science,\n  vol 11137. Springer, Cham", "journal-ref": null, "doi": "10.1007/978-3-030-00668-6_21", "report-no": null, "categories": "cs.DL cs.AI cs.IR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Major academic publishers need to be able to analyse their vast catalogue of\nproducts and select the best items to be marketed in scientific venues. This is\na complex exercise that requires characterising with a high precision the\ntopics of thousands of books and matching them with the interests of the\nrelevant communities. In Springer Nature, this task has been traditionally\nhandled manually by publishing editors. However, the rapid growth in the number\nof scientific publications and the dynamic nature of the Computer Science\nlandscape has made this solution increasingly inefficient. We have addressed\nthis issue by creating Smart Book Recommender (SBR), an ontology-based\nrecommender system developed by The Open University (OU) in collaboration with\nSpringer Nature, which supports their Computer Science editorial team in\nselecting the products to market at specific venues. SBR recommends books,\njournals, and conference proceedings relevant to a conference by taking\nadvantage of a semantically enhanced representation of about 27K editorial\nproducts. This is based on the Computer Science Ontology, a very large-scale,\nautomatically generated taxonomy of research areas. SBR also allows users to\ninvestigate why a certain publication was suggested by the system. It does so\nby means of an interactive graph view that displays the topic taxonomy of the\nrecommended editorial product and compares it with the topic-centric\ncharacterization of the input conference. An evaluation carried out with seven\nSpringer Nature editors and seven OU researchers has confirmed the\neffectiveness of the solution.\n", "versions": [{"version": "v1", "created": "Wed, 24 Mar 2021 23:23:53 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Thanapalasingam", "Thiviyan", ""], ["Osborne", "Francesco", ""], ["Birukou", "Aliaksandr", ""], ["Motta", "Enrico", ""]]}, {"id": "2103.13527", "submitter": "Francesco Osborne", "authors": "Angelo A. Salatino, Francesco Osborne, Aliaksandr Birukou and Enrico\n  Motta", "title": "Improving Editorial Workflow and Metadata Quality at Springer Nature", "comments": "In: The Semantic Web - ISWC 2019. Lecture Notes in Computer Science,\n  vol 11779. Springer, Cham", "journal-ref": null, "doi": "10.1007/978-3-030-30796-7_31", "report-no": null, "categories": "cs.DL cs.AI cs.IR cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Identifying the research topics that best describe the scope of a scientific\npublication is a crucial task for editors, in particular because the quality of\nthese annotations determine how effectively users are able to discover the\nright content in online libraries. For this reason, Springer Nature, the\nworld's largest academic book publisher, has traditionally entrusted this task\nto their most expert editors. These editors manually analyse all new books,\npossibly including hundreds of chapters, and produce a list of the most\nrelevant topics. Hence, this process has traditionally been very expensive,\ntime-consuming, and confined to a few senior editors. For these reasons, back\nin 2016 we developed Smart Topic Miner (STM), an ontology-driven application\nthat assists the Springer Nature editorial team in annotating the volumes of\nall books covering conference proceedings in Computer Science. Since then STM\nhas been regularly used by editors in Germany, China, Brazil, India, and Japan,\nfor a total of about 800 volumes per year. Over the past three years the\ninitial prototype has iteratively evolved in response to feedback from the\nusers and evolving requirements. In this paper we present the most recent\nversion of the tool and describe the evolution of the system over the years,\nthe key lessons learnt, and the impact on the Springer Nature workflow. In\nparticular, our solution has drastically reduced the time needed to annotate\nproceedings and significantly improved their discoverability, resulting in 9.3\nmillion additional downloads. We also present a user study involving 9 editors,\nwhich yielded excellent results in term of usability, and report an evaluation\nof the new topic classifier used by STM, which outperforms previous versions in\nrecall and F-measure.\n", "versions": [{"version": "v1", "created": "Wed, 24 Mar 2021 23:23:59 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Salatino", "Angelo A.", ""], ["Osborne", "Francesco", ""], ["Birukou", "Aliaksandr", ""], ["Motta", "Enrico", ""]]}, {"id": "2103.13742", "submitter": "Luigi Brugnano", "authors": "Pierluigi Amodio, Luigi Brugnano, Filippo Scarselli", "title": "Implementation of the PaperRank and AuthorRank indices in the Scopus\n  database", "comments": "19 pages, 3 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We implement the PaperRank and AuthorRank indices introduced in [Amodio &\nBrugnano, 2014] in the Scopus database, in order to highlight quantitative and\nqualitative information that the bare number of citations and/or the h-index of\nan author are unable to provide. In addition to this, the new indices can be\ncheaply updated in Scopus, since this has a cost comparable to that of updating\nthe number of citations. Some examples are reported to provide insight in their\npotentialities, as well as possible extensions.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 10:45:37 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Amodio", "Pierluigi", ""], ["Brugnano", "Luigi", ""], ["Scarselli", "Filippo", ""]]}, {"id": "2103.13816", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo, Flavia Di Costa", "title": "On the relation between the degree of internationalization of cited and\n  citing publications: A field level analysis, including and excluding\n  self-citations", "comments": null, "journal-ref": "Journal of Informetrics, 2021, 15(1), 101101", "doi": "10.1016/j.joi.2020.101101", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growing complexity of scientific challenges demands increasingly intense\nresearch collaboration, both domestic and international. The resulting trend\naffects not only the modes of producing new knowledge, but also the way it is\ndisseminated within scientific communities. This paper analyses the\nrelationship between the \"degree of internationalization\" of a country's\nscientific production and that of the relevant citing publications. The\nempirical analysis is based on 2010-2012 Italian publications. Findings show:\ni) the probability of being cited increases with the degree of\ninternationalization of the research team; ii) totally domestic research teams\ntend to cite to a greater extent totally domestic publications; iii) vice\nversa, publications resulting from international collaborations tend to be more\ncited by totally foreign publications rather than by publications including\ndomestic authors. These results emerge both at overall and at discipline level.\nFindings might inform research policies geared towards internationalization.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 13:13:09 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Di Costa", "Flavia", ""]]}, {"id": "2103.13817", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo", "title": "The domestic localization of knowledge flows as evidenced by publication\n  citation: The case of Italy", "comments": "arXiv admin note: text overlap with arXiv:1909.08911", "journal-ref": "The case of Italy. Scientometrics, 125(2), 1305-1329", "doi": "10.1007/s11192-020-03487-5", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work applies a new approach to measure knowledge flows. Assuming that\ncitation linkages between articles imply a flow of knowledge from the cited to\nthe citing authors, we investigate the geographic flows of scientific knowledge\nproduced in Italy across its regions, at both overall and field level.\nFurthermore, we measure the the specialization indexes for outflows and inflows\nof knowledge by a given region. Findings show that larger regions in terms of\nresearch output are more likely net exporters of new knowledge. At the same\ntime, we register a positive correlation between the share of intraregional\nflows and the size of overall scientific output of a region.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 13:13:29 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""]]}, {"id": "2103.13818", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo, Giovanni Felici", "title": "Informed peer review for publication assessments: Are improved impact\n  measures worth the hassle?", "comments": null, "journal-ref": "Quantitative Science Studies, 1(3), 1321-1333 (2020)", "doi": "10.1162/qss_a_00051", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we ask whether and to what extent applying a predictor of\npublications' impact better than early citations, has an effect on the\nassessment of research performance of individual scientists. Specifically, we\nmeasure the total impact of Italian professors in the sciences and economics in\na period of time, valuing their publications first by early citations and then\nby a weighted combination of early citations and impact factor of the hosting\njournal. As expected, scores and ranks by the two indicators show a very strong\ncorrelation, but there occur also significant shifts in many fields, mainly in\nEconomics and statistics, and Mathematics and computer science. The higher the\nshare of uncited professors in a field and the shorter the citation time\nwindow, the more recommendable the recourse to the above combination.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 13:13:38 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Felici", "Giovanni", ""]]}, {"id": "2103.13819", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo, Flavia Di Costa", "title": "Knowledge spillovers: does the geographic proximity effect decay over\n  time? A discipline-level analysis, accounting for cognitive proximity, with\n  and without self-citations", "comments": null, "journal-ref": "Journal of Informetrics, 14(4), 2020, 101072", "doi": "10.1016/j.joi.2020.101072", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work analyzes the variation over time of the effect of geographic\ndistance on knowledge flows. The flows are measured through the citations\nexchanged between scientific publications, including and excluding\nself-citations. To calculate geographic distances between citing and cited\npublication, each publication is associated with a \"prevailing\" territory,\naccording to the authors' affiliations. We then apply a gravity model to\naccount for the research size of the territories, in terms of cognitive\nproximity of citing-cited publications. The field of observation is the\n2010-2017 world publications citing the 2010-2012 Italian publications, as\nindexed in the Web of Science. The results show that in domestic knowledge\nflows, geographic proximity remains an influential factor through time,\nalthough with differences among disciplines and trends of attenuating effects.\nFinally, we replicate the analyses of knowledge flows but with the exclusion of\nself-citations: in this manner the effect of geographic proximity seems\nreduced, particularly at the national scale, but the differences (with vs\nwithout self-citations) lessen through time. As shown in previous works, the\neffect of distance on continental flows is modest (imperceptible for\nintercontinental flows), yet here too time has some influence, including\nconcerning exclusion of self-citations.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 13:13:44 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Di Costa", "Flavia", ""]]}, {"id": "2103.13946", "submitter": "Diego Amancio", "authors": "Adilson Vital Jr. and Diego R. Amancio", "title": "A comparative analysis of local network similarity measurements:\n  application to author citation networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the evolution of paper and author citations is of paramount\nimportance for the design of research policies and evaluation criteria that can\npromote and accelerate scientific discoveries. Recently many studies on the\nevolution of science have been conducted in the context of the emergent science\nof science field. While many studies have probed the link problem in citation\nnetworks, only a few works have analyzed the temporal nature of link prediction\nin author citation networks. In this study we compared the performance of 10\nwell-known local network similarity measurements to predict future links in\nauthor citations networks. Differently from traditional link prediction\nmethods, the temporal nature of the predict links is relevant for our approach.\nOur analysis revealed interesting results. The Jaccard coefficient was found to\nbe among the most relevant measurements. The preferential attachment\nmeasurement, conversely, displayed the worst performance. We also found that\nthe extension of local measurements to their weighted version do not\nsignificantly improved the performance of predicting citations. Finally, we\nalso found that a neural network approach summarizing the information from all\n10 considered similarity measurements was not able to provide the highest\nprediction performance.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 16:06:13 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Vital", "Adilson", "Jr."], ["Amancio", "Diego R.", ""]]}, {"id": "2103.14124", "submitter": "Ansgar Scherp", "authors": "Steffen Epp, Marcel Hoffmann, Nicolas Lell, Michael Mohr, Ansgar\n  Scherp", "title": "A Machine Learning Pipeline for Automatic Extraction of Statistic\n  Reports and Experimental Conditions from Scientific Papers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  A common writing style for statistical results are the recommendations of the\nAmerican Psychology Association, known as APA-style. However, in practice,\nwriting styles vary as reports are not 100% following APA-style or parameters\nare not reported despite being mandatory. In addition, the statistics are not\nreported in isolation but in context of experimental conditions investigated\nand the general topic. We address these challenges by proposing a flexible\npipeline STEREO based on active wrapper induction and unsupervised aspect\nextraction. We applied our pipeline to the over 100,000 documents in the\nCORD-19 dataset. It required only 0.25% of the corpus (about 500 documents) to\nlearn statistics extraction rules that cover 95% of the sentences in CORD-19.\nThe statistic extraction has nearly 100% precision on APA-conform and 95%\nprecision on non-APA writing styles. In total, we were able to extract 113k\nreported statistics, of which only <1% is APA conform. We could extract in 46%\nthe correct conditions from APA-conform reports (30% for non-APA). The best\nmodel for topic extraction achieves a precision of 75% on statistics reported\nin APA style (73% for non-APA conform). We conclude that STEREO is a good\nfoundation for automatic statistic extraction and future developments for\nscientific paper analysis. Particularly the extraction of non-APA conform\nreports is important and allows applications such as giving feedback to authors\nabout what is missing and could be changed.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 20:30:57 GMT"}], "update_date": "2021-03-29", "authors_parsed": [["Epp", "Steffen", ""], ["Hoffmann", "Marcel", ""], ["Lell", "Nicolas", ""], ["Mohr", "Michael", ""], ["Scherp", "Ansgar", ""]]}, {"id": "2103.14125", "submitter": "Mike Thelwall Prof", "authors": "Mike Thelwall", "title": "Can Twitter Give Insights into International Differences in Covid-19\n  Vaccination? Eight countries' English tweets to 21 March 2021", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Vaccination programs may help the world to reduce or eliminate Covid-19.\nInformation about them may help countries to design theirs more effectively,\nwith important benefits for public health. This article investigates whether it\nis possible to get insights into national vaccination programmes from a quick\ninternational comparison of public comments on Twitter. For this, word\nassociation thematic analysis (WATA) was applied to English-language\nvaccine-related tweets from eight countries gathered between 5 December 2020\nand 21 March 2021. The method was able to quickly identify multiple\ninternational differences. Whilst some were irrelevant, potentially non-trivial\ndifferences include differing extents to which non-government scientific\nexperts are important to national vaccination discussions. For example, Ireland\nseemed to be the only country in which university presidents were widely\ntweeted about in vaccine discussions. India's vaccine kindness term\n#VaccineMaitri was another interesting difference, highlighting the need for\ninternational sharing.\n", "versions": [{"version": "v1", "created": "Thu, 25 Mar 2021 20:31:39 GMT"}], "update_date": "2021-03-29", "authors_parsed": [["Thelwall", "Mike", ""]]}, {"id": "2103.14522", "submitter": "Philipp Mayr", "authors": "Fakhri Momeni, Philipp Mayr, Nicholas Fraser, Isabella Peters", "title": "What happens when a journal converts to Open Access? A bibliometric\n  analysis", "comments": "16 pages, 5 figures, Accepted in Scientometrics", "journal-ref": null, "doi": "10.1007/s11192-021-03972-5", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, increased stakeholder pressure to transition research to\nOpen Access has led to many journals converting, or 'flipping', from a closed\naccess (CA) to an open access (OA) publishing model. Changing the publishing\nmodel can influence the decision of authors to submit their papers to a\njournal, and increased article accessibility may influence citation behaviour.\nIn this paper we aimed to understand how flipping a journal to an OA model\ninfluences the journal's future publication volumes and citation impact. We\nanalysed two independent sets of journals that had flipped to an OA model, one\nfrom the Directory of Open Access Journals (DOAJ) and one from the Open Access\nDirectory (OAD), and compared their development with two respective control\ngroups of similar journals. For bibliometric analyses, journals were matched to\nthe Scopus database. We assessed changes in the number of articles published\nover time, as well as two citation metrics at the journal and article level:\nthe normalised impact factor (IF) and the average relative citations (ARC),\nrespectively. Our results show that overall, journals that flipped to an OA\nmodel increased their publication output compared to journals that remained\nclosed. Mean normalised IF and ARC also generally increased following the flip\nto an OA model, at a greater rate than was observed in the control groups.\nHowever, the changes appear to vary largely by scientific discipline. Overall,\nthese results indicate that flipping to an OA publishing model can bring\npositive changes to a journal.\n", "versions": [{"version": "v1", "created": "Fri, 26 Mar 2021 15:20:29 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Momeni", "Fakhri", ""], ["Mayr", "Philipp", ""], ["Fraser", "Nicholas", ""], ["Peters", "Isabella", ""]]}, {"id": "2103.14556", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Andrea Fronzetti Colladon, Ciriaco Andrea D'Angelo, Peter A. Gloor", "title": "Predicting the future success of scientific publications through social\n  network and semantic analysis", "comments": null, "journal-ref": "Scientometrics, 124(1), 357-377(2020)", "doi": "10.1007/s11192-020-03479-5", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Citations acknowledge the impact a scientific publication has on subsequent\nwork. At the same time, deciding how and when to cite a paper, is also heavily\ninfluenced by social factors. In this work, we conduct an empirical analysis\nbased on a dataset of 2010-2012 global publications in chemical engineering. We\nuse social network analysis and text mining to measure publication attributes\nand understand which variables can better help predicting their future success.\nControlling for intrinsic quality of a publication and for the number of\nauthors in the byline, we are able to predict scholarly impact of a paper in\nterms of citations received six years after publication with almost 80 percent\naccuracy. Results suggest that, all other things being equal, it is better to\nco-publish with rotating co-authors and write the papers' abstract using more\npositive words, and a more complex, thus more informative, language.\nPublications that result from the collaboration of different social groups also\nattract more citations.\n", "versions": [{"version": "v1", "created": "Fri, 26 Mar 2021 16:17:29 GMT"}], "update_date": "2021-03-29", "authors_parsed": [["Colladon", "Andrea Fronzetti", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Gloor", "Peter A.", ""]]}, {"id": "2103.14557", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo, Flavia Di Costa", "title": "Does the geographic proximity effect on knowledge spillovers vary across\n  research fields?", "comments": "arXiv admin note: text overlap with arXiv:2002.00742,\n  arXiv:2103.13819", "journal-ref": "Scientometrics, 123(2), 1021-1036 (2020)", "doi": "10.1007/s11192-020-03411-x", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Policy makers are interested in the influence of geographic distance on\nknowledge flows, however these can be expected to vary across research fields.\nThe effects of geographic distance on flows are analyzed by means of citations\nto scientific literature. The field of observation consists of the 2010-2012\nItalian publications and relevant citations up to the close of 2017. The\ngeographic proximity effect is analyzed at national, continental, and\nintercontinental level in 244 fields, and results as evident at national level\nand in some cases at continental level, but not at intercontinental level. For\nflows between Italian municipalities, citations decrease with distance in all\nfields. At continental level, four fields are identified having knowledge flows\nthat grow with distance; at intercontinental level, this occurs in 26 fields.\nThe influence of distance is more limited in the fields of Humanities and\nSocial sciences, much more significant in the Sciences, mainly in the Natural\nsciences.\n", "versions": [{"version": "v1", "created": "Fri, 26 Mar 2021 16:18:12 GMT"}], "update_date": "2021-03-29", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Di Costa", "Flavia", ""]]}, {"id": "2103.14558", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Ciriaco Andrea D'Angelo, Nees Jan van Eck", "title": "Collecting large-scale publication data at the level of individual\n  researchers: A practical proposal for author name disambiguation", "comments": null, "journal-ref": "Scientometrics, 123(2), 883-907 (2020)", "doi": "10.1007/s11192-020-03410-y", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The disambiguation of author names is an important and challenging task in\nbibliometrics. We propose an approach that relies on an external source of\ninformation for selecting and validating clusters of publications identified\nthrough an unsupervised author name disambiguation method. The application of\nthe proposed approach to a random sample of Italian scholars shows encouraging\nresults, with an overall precision, recall, and F-Measure of over 96%. The\nproposed approach can serve as a starting point for large-scale census of\npublication portfolios for bibliometric analyses at the level of individual\nresearchers.\n", "versions": [{"version": "v1", "created": "Fri, 26 Mar 2021 16:18:35 GMT"}], "update_date": "2021-03-29", "authors_parsed": [["D'Angelo", "Ciriaco Andrea", ""], ["van Eck", "Nees Jan", ""]]}, {"id": "2103.14560", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo", "title": "A novel methodology to assess the scientific standing of nations at\n  field level", "comments": null, "journal-ref": "AJournal of Informetrics, 14(1) 100986 (2020)", "doi": "10.1016/j.joi.2019.100986", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The formulation of national research policies would benefit greatly from\nreliable strategic analysis of the scientific infrastructure, aimed at\nidentifying the relevant strengths and weaknesses at field level. Bibliometric\nmethodologies thus far proposed in the literature are not completely\nsatisfactory. This work proposes a novel \"output-to-input-oriented\" approach,\nwhich permits identification of research strengths and weaknesses on the basis\nof the ratios of top scientists and highly cited articles to research\nexpenditures in each field. The proposed approach is applied to the Italian\nacademic system. 2012-2016 scientific publications are analyzed, in the 218\nresearch fields where bibliometric assessment is appropriate.\n", "versions": [{"version": "v1", "created": "Fri, 26 Mar 2021 16:18:56 GMT"}], "update_date": "2021-03-29", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""]]}, {"id": "2103.14855", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Dag W. Aksnes, Ciriaco Andrea D'Angelo", "title": "Gender differences in research performance within and between countries:\n  Italy vs Norway", "comments": null, "journal-ref": "Journal of Informetrics, 15(2), 101144 (2021)", "doi": "10.1016/j.joi.2021.101144", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, the scientific performance of Italian and Norwegian university\nprofessors is analysed using bibliometric indicators. The study is based on\nover 36,000 individuals and their publication output during the period\n2011-2015. Applying a multidimensional indicator in which several aspects of\nthe research performance are captured, we find large differences in the\nperformance of men and women. These gender differences are evident across all\nanalysed levels, such as country, field, and academic position. However, most\nof the gender differences can be explained by the tails of the distributions-in\nparticular, there is a much higher proportion of men among the top 10%\nperforming scientists. For the remaining 90% of the population, the gender\ndifferences are practically non-existent. The results of the two countries,\nwhich differ in terms of the societal role of women, are contrasting. Further,\nwe discuss possible biases that are intrinsic in quantitative performance\nindicators, which might disfavour female researchers.\n", "versions": [{"version": "v1", "created": "Sat, 27 Mar 2021 09:34:17 GMT"}], "update_date": "2021-03-30", "authors_parsed": [["Abramo", "Giovanni", ""], ["Aksnes", "Dag W.", ""], ["D'Angelo", "Ciriaco Andrea", ""]]}, {"id": "2103.14856", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo, Lin Zhang", "title": "A comparison of two approaches for measuring interdisciplinary research\n  output: the disciplinary diversity of authors vs the disciplinary diversity\n  of the reference list", "comments": null, "journal-ref": "Journal of Informetrics, 12(4), 2018, 1182-1193", "doi": "10.1016/j.joi.2018.09.001", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study investigates the convergence of two bibliometric approaches to the\nmeasurement of interdisciplinary research: one based on analyzing disciplinary\ndiversity in the reference list of publications, the other based on the\ndisciplinary diversity of authors of publications. In particular we measure the\nvariety, balance, disparity and integrated diversity index of, respectively,\nsingle-author, multi-author single-field, and multi-author multi-field\npublications. We find that, in general, the diversity of the reference list\ngrows with the number of fields reflected in a paper's authors' list and, to a\nlesser extent, with the number of authors being equal the number of fields.\nFurther, we find that when fields belonging to different disciplines are\nreflected in the authors' list, the disparity in the reference list is higher\nthan in the case of fields belonging to the same discipline. However, this\ngeneral tendency varies across disciplines, and noticeable exceptions are found\nat individual paper level.\n", "versions": [{"version": "v1", "created": "Sat, 27 Mar 2021 09:34:53 GMT"}], "update_date": "2021-03-30", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Zhang", "Lin", ""]]}, {"id": "2103.15934", "submitter": "Rongqian Ma", "authors": "Rongqian Ma and Kai Li", "title": "Visuality in a Cross-disciplinary Battleground: Analysis of Inscriptions\n  in Digital Humanities Journal Publications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Like the old saying, \"a graph is worth a thousand words,\" the non-verbal\nlanguage, encapsulated in the concept of inscription, is a fundamental\nrhetorical device in the construction of knowledge represented by research\noutputs. As many inscriptions are deeply situated in a scientific and\ndata-driven research paradigm, they can be used to understand the relationships\nbetween research traditions involved in the field of digital humanities (DH), a\nhighly cross-disciplinary field that is frequently regarded as a battleground\nbetween these distinct research traditions, especially the humanities and STEM\nfields. This paper presents a quantitative, community-focused examination of\nhow inscriptions are used in English-language research articles in DH journals.\nWe randomly selected 252 articles published between 2011 and 2020 from a\nrepresentative DH journal list, and manually coded and classified inscriptions\nand author domains in these publications. We found that inscriptions have been\nincreasingly used during the past decade and their uses are more intensive in\npublications led by STEM authors comparing to other domains. This study offers\na timely survey of the disciplinary landscape of DH from the perspective of\ninscriptions and sheds light on how different research approaches collaborated\nand combated in the field of DH.\n", "versions": [{"version": "v1", "created": "Mon, 29 Mar 2021 20:11:20 GMT"}], "update_date": "2021-03-31", "authors_parsed": [["Ma", "Rongqian", ""], ["Li", "Kai", ""]]}, {"id": "2103.16008", "submitter": "Xianwen Wang", "authors": "Huixu Li, Lanjian Liu, Xianwen Wang", "title": "The open access effect in social media exposure of scholarly articles: A\n  matched-pair analysis", "comments": "18 pages, 6 figures", "journal-ref": "Journal of Informetrics, 2021, (15)3, 101154", "doi": "10.1016/j.joi.2021.101154", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scholarly journals are increasingly using social media to share their latest\nresearch publications and communicate with their readers. Having a presence on\nsocial media gives journals a platform to raise their profile and promote their\ncontent. This study compares the number of clicks received when journals\nprovide two types of links to subscription articles: open access (OA) and paid\ncontent links. We examine the OA effect using unique matched-pair data for the\njournal Nature Materials. Our study finds that OA links perform better than\npaid content links. In particular, when the journal does not indicate that a\nlink to an article is an OA link, there is an obvious drop in performance\nagainst clicks on links indicating OA status. OA has a positive effect on the\nnumber of clicks in all countries, but its positive impact is slightly greater\nin developed countries. The results suggest that free content is more\nattractive to users than paid content. Social media exposure of scholarly\narticles promotes the use of research outputs. Combining social media\ndissemination with OA appears to enhance the reach of scientific information.\nHowever, extensive further efforts are needed to remove barriers to OA.\n", "versions": [{"version": "v1", "created": "Tue, 30 Mar 2021 00:46:56 GMT"}], "update_date": "2021-03-31", "authors_parsed": [["Li", "Huixu", ""], ["Liu", "Lanjian", ""], ["Wang", "Xianwen", ""]]}, {"id": "2103.16025", "submitter": "Sen Tian", "authors": "Sen Tian, Panos Ipeirotis", "title": "On the Predictability of Utilizing Rank Percentile to Evaluate\n  Scientific Impact", "comments": "The dataset and the code to reproduce the results in this paper are\n  available online at https://github.com/sentian/SciImpactRanking", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bibliographic metrics are commonly utilized for evaluation purposes within\nacademia, often in conjunction with other metrics. These metrics vary widely\nacross fields and change with the seniority of the scholar; consequently, the\nonly way to interpret these values is by comparison with other academics within\nthe same field who are of similar seniority. Among the field- and time-\nnormalized indicators, rank percentile has grown in popularity, and it is\npreferred over other types of indicators. In this paper, we propose and justify\na novel rank percentile indicator for scholars. Furthermore, we emphasize on\nthe time factor that is built into the rank percentile, and we demonstrate that\nthe rank percentile is highly predictable. The publication percentile is highly\nstable over time, while the scholar percentile exhibits short-term stability\nand can be predicted via a simple linear regression model. More advanced models\nthat utilize extensive lists of features offer slightly superior performance;\nhowever, the simplicity and interpretability of the simple model impose\nsignificant advantages over the additional complexity of other models.\n", "versions": [{"version": "v1", "created": "Tue, 30 Mar 2021 02:07:58 GMT"}, {"version": "v2", "created": "Fri, 9 Jul 2021 04:04:23 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Tian", "Sen", ""], ["Ipeirotis", "Panos", ""]]}, {"id": "2103.16504", "submitter": "Vladimir Ivanov", "authors": "V. K. Ivanov", "title": "Computational Model to Quantify Object Innovativeness", "comments": "10 pages", "journal-ref": "Fuzzy Technologies in the Industry. 2018. Vol. 2258", "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The article considers the quantitative assessment approach to the\ninnovativeness of different objects. The proposed assessment model is based on\nthe object data retrieval from various databases including the Internet. We\npresent an object linguistic model, the processing technique for the\nmeasurement results including the results retrieved from the different search\nengines, and the evaluating technique of the source credibility. Empirical\nresearch of the computational model adequacy includes the acquisition and\npreprocessing of patent data from different databases and the computation of\ninvention innovativeness values: their novelty and relevance. The experiment\nresults, namely the comparative assessments of innovativeness values and major\ntrends, show the models developed are sufficiently adequate and can be used in\nfurther research.\n", "versions": [{"version": "v1", "created": "Fri, 26 Mar 2021 07:21:11 GMT"}], "update_date": "2021-03-31", "authors_parsed": [["Ivanov", "V. K.", ""]]}, {"id": "2103.16783", "submitter": "Vivek Kumar Singh Ph.D.", "authors": "Vivek Kumar Singh, Satya Swarup Srichandan, Sujit Bhattacharya", "title": "What do Indian Researchers download from Sci-Hub", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Recently three foreign academic publishers filed a case of copyright\ninfringement against Sci-Hub and LibGen before the Delhi High Court and prayed\nfor complete blocking these websites in India. In this context, this paper\nattempted to assess the impact that blocking of Sci-Hub may have on Indian\nresearch community. The download requests originating from India on a\ndaily-basis are counted, geotagged and analysed by discipline, publisher,\ncountry and publication year etc. Results indicate that blocking Sci-Hub in\nIndia may actually hurt Indian research community in a significant way.\n", "versions": [{"version": "v1", "created": "Wed, 31 Mar 2021 02:58:26 GMT"}], "update_date": "2021-04-01", "authors_parsed": [["Singh", "Vivek Kumar", ""], ["Srichandan", "Satya Swarup", ""], ["Bhattacharya", "Sujit", ""]]}]