[{"id": "1803.00554", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff, Caroline S. Wagner, and Lutz Bornmann", "title": "Discontinuities in Citation Relations among Journals: Self-organized\n  Criticality as a Model of Scientific Revolutions and Change", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using three-year moving averages of the complete Journal Citation Reports\n1994-2016 of the Science Citation Index and the Social Sciences Citation Index\n(combined), we analyze links between citing and cited journals in terms of (1)\nwhether discontinuities among the networks of consecutive years have occurred;\n(2) are these discontinuities relatively isolated or networked? (3) Can these\ndiscontinuities be used as indicators of novelty, change, and innovation in the\nsciences? We examine each of the N2 links among the N journals across the\nyears. We find power-laws for the top 10,000 instances of change, which we\nsuggest interpreting in terms of \"self-organized criticality\": co-evolutions of\navalanches in aggregated citation relations and meta-stable states in the\nknowledge base can be expected to drive the sciences towards the edges of\nchaos. The flux of journal-journal citations in new manuscripts may generate an\navalanche in the meta-stable networks, but one can expect the effects to remain\nlocal (for example, within a specialty). The avalanches can be of any size;\nthey reorient the relevant citation environments by inducing a rewrite of\nhistory in the affected partitions.\n", "versions": [{"version": "v1", "created": "Thu, 1 Mar 2018 18:45:28 GMT"}], "update_date": "2018-03-02", "authors_parsed": [["Leydesdorff", "Loet", ""], ["Wagner", "Caroline S.", ""], ["Bornmann", "Lutz", ""]]}, {"id": "1803.01333", "submitter": "Serhii Nazarovets", "authors": "Serhii Nazarovets", "title": "Highly Cited Papers of Ukrainian Scientists Written in Collaboration: A\n  Bibliometric Analysis (2011-2015)", "comments": null, "journal-ref": "COLLNET Journal of Scientometrics and Information Management.\n  2018, 12(1): 35-47", "doi": "10.1080/09737766.2017.1332613", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents the results of the study of international and national\ncooperation of Ukrainian scientists from different scientific fields using\ncitation analysis data from Scopus in the period of 2011-2015. The results show\nthat during the period under study, the number of documents of highly cited\nUkrainian scientists that have received enough citations to be included to the\ntop 1%, 5% and 10% most cited documents in the world, evidenced an increase and\nwere significantly different in different subjects areas. Papers written by a\ngroup of co-authors predominate among highly cited documents of Ukrainian\nscientists. Consequently, international cooperation plays an important role in\nUkrainian scientists research results visibility and impact. At the same time,\nup to 16%-27% highly cited articles of Ukrainian scientists have been written\nwithout partnering with foreign colleagues, that means a significant part of\nimportant scientific results in Ukraine are carried out by oneself. Therefore,\nfor generating an optimal policy of science development in Ukraine it is\nimportant to provide a balanced view of the expectations of the results of the\ninternational cooperation of Ukrainian scientists and achieving a required\nbalance between the inter-country and international collaboration.\n", "versions": [{"version": "v1", "created": "Sun, 4 Mar 2018 10:39:06 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Nazarovets", "Serhii", ""]]}, {"id": "1803.01788", "submitter": "Yi Shen", "authors": "Yi Shen", "title": "Data Sustainability and Reuse Pathways of Natural Resources and\n  Environmental Scientists", "comments": "Manuscript accepted for publication, Editing version will appear\n  spring 2018, New Review of Academic Librarianship", "journal-ref": null, "doi": "10.1080/13614533.2018.1424642", "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper presents a multifarious examination of natural resources and\nenvironmental scientists' adventures navigating the policy change towards open\naccess and cultural shift in data management, sharing, and reuse. Situated in\nthe institutional context of Virginia Tech, a focus group and multiple\nindividual interviews were conducted exploring the domain scientists'\nall-around experiences, performances, and perspectives on their collection,\nadoption, integration, preservation, and management of data. The results reveal\nthe scientists' struggles, concerns, and barriers encountered, as well as their\nshared values, beliefs, passions, and aspirations when working with data. Based\non these findings, this study provides suggestions on data modeling and\nknowledge representation strategies to support the long-term viability,\nstewardship, accessibility, and sustainability of scientific data. It also\ndiscusses the art of curation as creative scholarship and new opportunities for\ndata librarians and information professionals to mobilize the data revolution.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2018 17:21:01 GMT"}], "update_date": "2018-03-06", "authors_parsed": [["Shen", "Yi", ""]]}, {"id": "1803.01807", "submitter": "Yi Shen", "authors": "Yi Shen", "title": "Burgeoning Data Repository Systems, Characteristics and Development\n  Strategies: Insights of Natural Resources and Environmental Scientists", "comments": "Manuscript accepted for publication, Editing version will appear\n  spring 2018, 1(2)", "journal-ref": "Data and Information Management, 1(2) (2017)", "doi": "10.1515/dim-2017-0009", "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Nowadays, we have the emergence and abundance of many different data\nrepositories and archival systems for scientific data discovery, use, and\nanalysis. With the burgeoning data sharing platforms available, this study\naddresses how natural resources and environmental scientists navigate these\ndiverse data sources, what their concerns and value propositions are towards\nmultiple data discovery channels, and most importantly, how they perceive the\ncharacteristics and compare the functionalities of different types of data\nrepository systems. Through a user community research of domain scientists on\ntheir data use dynamics and insights, this research provides strategies and\ndiscusses ideas on how to leverage these different platforms. Further, it\nproposes a top-down, novel approach to search, browsing, and visualization for\ndynamic exploration of environmental data.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2018 18:01:00 GMT"}], "update_date": "2018-03-06", "authors_parsed": [["Shen", "Yi", ""]]}, {"id": "1803.02282", "submitter": "Bedoor AlShebli", "authors": "Bedoor K AlShebli, Talal Rahwan, Wei Lee Woon", "title": "The Preeminence of Ethnic Diversity in Scientific Collaboration", "comments": null, "journal-ref": "Nature communications, 9(1), 2018, 5163", "doi": "10.1038/s41467-018-07634-8", "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by the social and economic benefits of diversity, we analyze over 9\nmillion papers and 6 million scientists to study the relationship between\nresearch impact and five classes of diversity: ethnicity, discipline, gender,\naffiliation, and academic age. Using randomized baseline models, we establish\nthe presence of homophily in ethnicity, gender and affiliation. We then study\nthe effect of diversity on scientific impact, as reflected in citations.\nRemarkably, of the classes considered, ethnic diversity had the strongest\ncorrelation with scientific impact. To further isolate the effects of ethnic\ndiversity, we used randomized baseline models and again found a clear link\nbetween diversity and impact. To further support these findings, we use\ncoarsened exact matching to compare the scientific impact of ethnically diverse\npapers and scientists with closely-matched control groups. Here, we find that\nethnic diversity resulted in an impact gain of 10.63% for papers, and 47.67%\nfor scientists.\n", "versions": [{"version": "v1", "created": "Tue, 6 Mar 2018 16:20:27 GMT"}, {"version": "v2", "created": "Tue, 20 Mar 2018 10:38:22 GMT"}, {"version": "v3", "created": "Sun, 10 Jun 2018 12:22:30 GMT"}, {"version": "v4", "created": "Fri, 20 Nov 2020 19:09:56 GMT"}], "update_date": "2020-11-24", "authors_parsed": [["AlShebli", "Bedoor K", ""], ["Rahwan", "Talal", ""], ["Woon", "Wei Lee", ""]]}, {"id": "1803.02352", "submitter": "Snehanshu Saha", "authors": "Sandra Anil, Abu Kurian, Sudeepa Roy Dey, Snehanshu Saha, Ankit Sinha", "title": "Genealogy tree: understanding academic lineage of authors via\n  algorithmic and visual analysis", "comments": "This is uploaded in Researchgate", "journal-ref": null, "doi": "10.13140/RG.2.2.35076.01923", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ancestry and genealogy tree are proven tools to determine the lineage of any\nperson and establish dependencies among individuals. Genealogy tree can be\nexploited further to gain information about the researcher and his scholastic\nlineage which is of paramount importance in today's world of computer\ntechnology. this insight into academic genealogy could be a way of helping PHD\nstudents achieve academic socialization within the discipline, by making\nexplicit connections that may be influential. Awareness of his scientific\nheritage gives the user a broader perspective of his own research project. This\npaper also highlights and investigates how this academic network is exploited\nby certain researchers using various visualization tools. It was observed\nduring this work that the credibility and influence factor is determined by the\nvarious citations obtained by an author and to improve their rankings in\nvarious forms, they tend to collaborate in their academic circle and boost\ntheir citation count. A recent trend among researchers is to form communities\nbased on their academic relationships and rely on copious citations for their\nmutual benefit. Tracing the genealogical relationships can be helpful in\ndetecting such communities and also create a more quality aware metric using a\nlineage independent model for computation of author level metrics.\n", "versions": [{"version": "v1", "created": "Tue, 6 Mar 2018 15:48:31 GMT"}], "update_date": "2018-03-08", "authors_parsed": [["Anil", "Sandra", ""], ["Kurian", "Abu", ""], ["Dey", "Sudeepa Roy", ""], ["Saha", "Snehanshu", ""], ["Sinha", "Ankit", ""]]}, {"id": "1803.02436", "submitter": "Manolis Antonoyiannakis", "authors": "Manolis Antonoyiannakis", "title": "Impact Factors and the Central Limit Theorem: Why Citation Averages Are\n  Scale Dependent", "comments": null, "journal-ref": "Journal of Informetrics 12 (4), 1072-1088 (2018)", "doi": "10.1016/j.joi.2018.08.011", "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Citation averages, and Impact Factors (IFs) in particular, are sensitive to\nsample size. We apply the Central Limit Theorem (CLT) to IFs to understand\ntheir scale-dependent behavior. For a journal of $n$ randomly selected papers\nfrom a population of all papers, we expect from the CLT that its IF fluctuates\naround the population average $\\mu$, and spans a range of values proportional\nto $\\sigma/\\sqrt[]{n}$, where $\\sigma^2$ is the variance of the population's\ncitation distribution. The $1/\\sqrt[]{n}$ dependence has profound implications\nfor IF rankings: The larger a journal, the narrower the range around $\\mu$\nwhere its IF lies. IF rankings therefore allocate an unfair advantage to\nsmaller journals in the high IF ranks, and to larger journals in the low IF\nranks. We expect a scale-dependent stratification of journals in IF rankings,\nwhereby small journals occupy top, middle, and bottom ranks; mid-sized journals\noccupy middle ranks; and very large journals have IFs that asymptotically\napproach $\\mu$. We confirm these predictions by analyzing (i) 166,498 IF \\&\njournal-size data pairs in the 1997--2016 Journal Citation Reports of Clarivate\nAnalytics, (ii) the top-cited portion of 276,000 physics papers published in\n2014--2015, and (iii) the citation distributions of an arbitrarily sampled list\nof physics journals. We conclude that the CLT is a good predictor of the IF\nrange of actual journals, while sustained deviations from its predictions are a\nmark of true, non-random, citation impact. IF rankings are thus misleading\nunless one compares like-sized journals or adjusts for these effects. We\npropose the $\\Phi$ index, a rescaled IF adjusted for size, which can be\ngeneralized to account also for different citation practices across research\nfields. Our methodology applies also to citation averages used to compare\nresearch fields, university departments or countries in various rankings.\n", "versions": [{"version": "v1", "created": "Tue, 6 Mar 2018 21:55:11 GMT"}, {"version": "v2", "created": "Sat, 7 Apr 2018 13:23:11 GMT"}, {"version": "v3", "created": "Thu, 20 Sep 2018 19:26:01 GMT"}], "update_date": "2018-09-24", "authors_parsed": [["Antonoyiannakis", "Manolis", ""]]}, {"id": "1803.03198", "submitter": "Bernhard Haslhofer", "authors": "Bernhard Haslhofer and Antoine Isaac and Rainer Simon", "title": "Knowledge Graphs in the Libraries and Digital Humanities Domain", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-319-63962-8_291-1", "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Knowledge graphs represent concepts (e.g., people, places, events) and their\nsemantic relationships. As a data structure, they underpin a digital\ninformation system, support users in resource discovery and retrieval, and are\nuseful for navigation and visualization purposes. Within the libaries and\nhumanities domain, knowledge graphs are typically rooted in knowledge\norganization systems, which have a century-old tradition and have undergone\ntheir digital transformation with the advent of the Web and Linked Data. Being\nexposed to the Web, metadata and concept definitions are now forming an\ninterconnected and decentralized global knowledge network that can be curated\nand enriched by community-driven editorial processes. In the future, knowledge\ngraphs could be vehicles for formalizing and connecting findings and insights\nderived from the analysis of possibly large-scale corpora in the libraries and\ndigital humanities domain.\n", "versions": [{"version": "v1", "created": "Thu, 8 Mar 2018 16:50:11 GMT"}], "update_date": "2018-09-13", "authors_parsed": [["Haslhofer", "Bernhard", ""], ["Isaac", "Antoine", ""], ["Simon", "Rainer", ""]]}, {"id": "1803.03200", "submitter": "Donatella Firmani", "authors": "Donatella Firmani, Marco Maiorino, Paolo Merialdo, and Elena Nieddu", "title": "Towards Knowledge Discovery from the Vatican Secret Archives. In Codice\n  Ratio -- Episode 1: Machine Transcription of the Manuscripts", "comments": "Donatella Firmani, Marco Maiorino, Paolo Merialdo, and Elena Nieddu.\n  2018. Towards Knowledge Discovery from the Vatican Secret Archives. In Codice\n  Ratio - Episode 1: Machine Transcription of the Manuscripts. In Proceedings\n  of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data\n  Mining (KDD '18). ACM, New York, NY, USA, 263-272", "journal-ref": null, "doi": "10.1145/3219819.3219879", "report-no": null, "categories": "cs.DL cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Codice Ratio is a research project to study tools and techniques for\nanalyzing the contents of historical documents conserved in the Vatican Secret\nArchives (VSA). In this paper, we present our efforts to develop a system to\nsupport the transcription of medieval manuscripts. The goal is to provide\npaleographers with a tool to reduce their efforts in transcribing large\nvolumes, as those stored in the VSA, producing good transcriptions for\nsignificant portions of the manuscripts. We propose an original approach based\non character segmentation. Our solution is able to deal with the dirty\nsegmentation that inevitably occurs in handwritten documents. We use a\nconvolutional neural network to recognize characters and language models to\ncompose word transcriptions. Our approach requires minimal training efforts,\nmaking the transcription process more scalable as the production of training\nsets requires a few pages and can be easily crowdsourced. We have conducted\nexperiments on manuscripts from the Vatican Registers, an unreleased corpus\ncontaining the correspondence of the popes. With training data produced by 120\nhigh school students, our system has been able to produce good transcriptions\nthat can be used by paleographers as a solid basis to speedup the transcription\nprocess at a large scale.\n", "versions": [{"version": "v1", "created": "Thu, 8 Mar 2018 17:01:32 GMT"}, {"version": "v2", "created": "Tue, 8 May 2018 12:20:09 GMT"}, {"version": "v3", "created": "Wed, 12 Sep 2018 12:49:24 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Firmani", "Donatella", ""], ["Maiorino", "Marco", ""], ["Merialdo", "Paolo", ""], ["Nieddu", "Elena", ""]]}, {"id": "1803.03449", "submitter": "Nicolas Robinson-Garcia", "authors": "Nicolas Robinson-Garcia, Cassidy R. Sugimoto, Dakota Murray, Alfredo\n  Yegros-Yegros, Vincent Larivi\\`ere and Rodrigo Costas", "title": "The many faces of mobility: Using bibliometric data to measure the\n  movement of scientists", "comments": "Paper accepted for publication in Journal of Informetrics", "journal-ref": "Journal of Informetrics 2019", "doi": "10.1016/j.joi.2018.11.002", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a methodological framework for developing scientific\nmobility indicators based on bibliometric data. We identify nearly 16 million\nindividual authors from publications covered in the Web of Science for the\n2008-2015 period. Based on the information provided across individuals'\npublication records, we propose a general classification for analyzing\nscientific mobility using institutional affiliation changes. We distinguish\nbetween migrants--authors who have ruptures with their country of origin--and\ntravelers--authors who gain additional affiliations while maintaining\naffiliation with their country of origin. We find that 3.7 percent of\nresearchers who have published at least one paper over the period are mobile.\nTravelers represent 72.7 percent of all mobile scholars, but migrants have\nhigher scientific impact. We apply this classification at the country level,\nexpanding the classification to incorporate the directionality of scientists'\nmobility (i.e., incoming and outgoing). We provide a brief analysis to\nhighlight the utility of the proposed taxonomy to study scholarly mobility and\ndiscuss the implications for science policy.\n", "versions": [{"version": "v1", "created": "Fri, 9 Mar 2018 10:10:37 GMT"}, {"version": "v2", "created": "Tue, 13 Nov 2018 11:07:23 GMT"}], "update_date": "2021-02-12", "authors_parsed": [["Robinson-Garcia", "Nicolas", ""], ["Sugimoto", "Cassidy R.", ""], ["Murray", "Dakota", ""], ["Yegros-Yegros", "Alfredo", ""], ["Larivière", "Vincent", ""], ["Costas", "Rodrigo", ""]]}, {"id": "1803.03598", "submitter": "Michael J. Kurtz", "authors": "Michael J. Kurtz, Alberto Accomazzi, Edwin A. Henneken", "title": "Merging the Astrophysics and Planetary Science Information Systems", "comments": "Whitepaper submitted to the Committee on an Exoplanet Science\n  Strategy", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conceptually exoplanet research has one foot in the discipline of\nAstrophysics and the other foot in Planetary Science. Research strategies for\nexoplanets will require efficient access to data and information from both\nrealms. Astrophysics has a sophisticated, well integrated, distributed\ninformation system with archives and data centers which are interlinked with\nthe technical literature via the Astrophysics Data System (ADS). The\ninformation system for Planetary Science does not have a central component\nlinking the literature with the observational and theoretical data. Here we\npropose that the Committee on an Exoplanet Science Strategy recommend that this\nlinkage be built, with the ADS playing the role in Planetary Science which it\nalready plays in Astrophysics. This will require additional resources for the\nADS, and the Planetary Data System (PDS), as well as other international\ncollaborators\n", "versions": [{"version": "v1", "created": "Fri, 9 Mar 2018 17:05:18 GMT"}], "update_date": "2018-03-12", "authors_parsed": [["Kurtz", "Michael J.", ""], ["Accomazzi", "Alberto", ""], ["Henneken", "Edwin A.", ""]]}, {"id": "1803.04225", "submitter": "Philipp Mayr", "authors": "Fariba Karimi, Philipp Mayr, Fakhri Momeni", "title": "Analyzing the network structure and gender differences among the members\n  of the Networked Knowledge Organization Systems (NKOS) community", "comments": "14 pages, 6 figures, accepted paper in International Journal on\n  Digital Libraries (IJDL)", "journal-ref": null, "doi": "10.1007/s00799-018-0243-0", "report-no": null, "categories": "cs.SI cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we analyze a major part of the research output of the\nNetworked Knowledge Organization Systems (NKOS) community in the period 2000 to\n2016 from a network analytical perspective. We focus on the papers presented at\nthe European and U.S. NKOS workshops and in addition four special issues on\nNKOS in the last 16 years. For this purpose, we have generated an open dataset,\nthe \"NKOS bibliography\" which covers the bibliographic information of the\nresearch output. We analyze the co-authorship network of this community which\nresults in 123 papers with a sum of 256 distinct authors. We use standard\nnetwork analytic measures such as degree, betweenness and closeness centrality\nto describe the co-authorship network of the NKOS dataset. First, we\ninvestigate global properties of the network over time. Second, we analyze the\ncentrality of the authors in the NKOS network. Lastly, we investigate gender\ndifferences in collaboration behavior in this community. Our results show that\napart from differences in centrality measures of the scholars, they have higher\ntendency to collaborate with those in the same institution or the same\ngeographic proximity. We also find that homophily is higher among women in this\ncommunity. Apart from small differences in closeness and clustering among men\nand women, we do not find any significant dissimilarities with respect to other\ncentralities.\n", "versions": [{"version": "v1", "created": "Mon, 12 Mar 2018 12:44:29 GMT"}], "update_date": "2018-12-24", "authors_parsed": [["Karimi", "Fariba", ""], ["Mayr", "Philipp", ""], ["Momeni", "Fakhri", ""]]}, {"id": "1803.04349", "submitter": "Finn {\\AA}rup Nielsen", "authors": "Finn {\\AA}rup Nielsen", "title": "Linking ImageNet WordNet Synsets with Wikidata", "comments": "6 pages, Wiki Workshop 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The linkage of ImageNet WordNet synsets to Wikidata items will leverage deep\nlearning algorithm with access to a rich multilingual knowledge graph. Here I\nwill describe our on-going efforts in linking the two resources and issues\nfaced in matching the Wikidata and WordNet knowledge graphs. I show an example\non how the linkage can be used in a deep learning setting with real-time image\nclassification and labeling in a non-English language and discuss what\nopportunities lies ahead.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2018 17:07:44 GMT"}], "update_date": "2018-03-13", "authors_parsed": [["Nielsen", "Finn Årup", ""]]}, {"id": "1803.04410", "submitter": "Daniele Cassese", "authors": "Vsevolod Salnikov, Daniele Cassese, Renaud Lambiotte and Nick S. Jones", "title": "Co-occurrence simplicial complexes in mathematics: identifying the holes\n  of knowledge", "comments": "24 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.DL math.HO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last years complex networks tools contributed to provide insights on\nthe structure of research, through the study of collaboration, citation and\nco-occurrence networks. The network approach focuses on pairwise relationships,\noften compressing multidimensional data structures and inevitably losing\ninformation. In this paper we propose for the first time a simplicial complex\napproach to word co-occurrences, providing a natural framework for the study of\nhigher-order relations in the space of scientific knowledge. Using topological\nmethods we explore the conceptual landscape of mathematical research, focusing\non homological holes, regions with low connectivity in the simplicial\nstructure. We find that homological holes are ubiquitous, which suggests that\nthey capture some essential feature of research practice in mathematics. Holes\ndie when a subset of their concepts appear in the same article, hence their\ndeath may be a sign of the creation of new knowledge, as we show with some\nexamples. We find a positive relation between the dimension of a hole and the\ntime it takes to be closed: larger holes may represent potential for important\nadvances in the field because they separate conceptually distant areas. We also\nshow that authors' conceptual entropy is positively related with their\ncontribution to homological holes, suggesting that polymaths tend to be on the\nfrontier of research.\n", "versions": [{"version": "v1", "created": "Sun, 11 Mar 2018 22:38:38 GMT"}], "update_date": "2018-03-14", "authors_parsed": [["Salnikov", "Vsevolod", ""], ["Cassese", "Daniele", ""], ["Lambiotte", "Renaud", ""], ["Jones", "Nick S.", ""]]}, {"id": "1803.04552", "submitter": "Christine Borgman", "authors": "Christine L. Borgman", "title": "Text Data Mining from the Author's Perspective: Whose Text, Whose\n  Mining, and to Whose Benefit?", "comments": "Forum Statement: Data Mining with Limited Access Text: National\n  Forum. April 5-6, 2018. https://publish.illinois.edu/limitedaccess-tdm/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Given the many technical, social, and policy shifts in access to scholarly\ncontent since the early days of text data mining, it is time to expand the\nconversation about text data mining from concerns of the researcher wishing to\nmine data to include concerns of researcher-authors about how their data are\nmined, by whom, for what purposes, and to whose benefits.\n", "versions": [{"version": "v1", "created": "Mon, 12 Mar 2018 22:11:40 GMT"}], "update_date": "2018-03-14", "authors_parsed": [["Borgman", "Christine L.", ""]]}, {"id": "1803.04644", "submitter": "Archana Mathur", "authors": "Snehanshu Saha, Poulami Sarkar, Archana Mathur, Suryoday Basak", "title": "Model Visualization in understanding rapid growth of a journal in an\n  emerging area", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A recent independent study resulted in a ranking system which ranked\nAstronomy and Computing (ASCOM) much higher than most of the older journals\nhighlighting the niche prominence of the particular journal. We investigate the\nremarkable ascendancy in reputation of ASCOM by proposing a novel differential\nequation based modeling. The Modeling is a consequence of knowledge discovery\nfrom big data-centric methods, namely L1-SVD. The inadequacy of the ranking\nmethod in explaining the reason behind the growth in reputation of ASCOM is\nreasonable to understand given that the study was post-facto. Thus, we propose\na growth model by accounting for the behavior of parameters that contribute to\nthe growth of a field. It is worthwhile to spend some time in analysing the\ncause and control variables behind rapid rise in reputation of a journal in a\nniche area. We intent to probe and bring out parameters responsible for its\ngrowing influence. Delay differential equations are used to model the change of\ninfluence on a journal's status by exploiting the effects of historical data.\n", "versions": [{"version": "v1", "created": "Tue, 13 Mar 2018 06:20:38 GMT"}], "update_date": "2018-03-14", "authors_parsed": [["Saha", "Snehanshu", ""], ["Sarkar", "Poulami", ""], ["Mathur", "Archana", ""], ["Basak", "Suryoday", ""]]}, {"id": "1803.05399", "submitter": "Lutz Bornmann Dr.", "authors": "Lutz Bornmann, Wolfgang Gl\\\"anzel", "title": "Which differences can be expected when two universities in the Leiden\n  Ranking are compared? Some benchmarks for institutional research evaluations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The comparison of two universities in terms of bibliometric indicators\nfrequently faces the problem of assessing the differences as meaningful or not.\nThis Letter to the Editor proposes some benchmarks which can be used for\nsupporting the interpretation of institutional differences.\n", "versions": [{"version": "v1", "created": "Mon, 26 Feb 2018 07:30:58 GMT"}], "update_date": "2018-03-15", "authors_parsed": [["Bornmann", "Lutz", ""], ["Glänzel", "Wolfgang", ""]]}, {"id": "1803.05808", "submitter": "Thomas Pasquier", "authors": "Thomas Pasquier and Matthew K. Lau and Xueyuan Han and Elizabeth Fong\n  and Barbara S. Lerner and Emery Boose and Merce Crosas and Aaron M. Ellison\n  and Margo Seltzer", "title": "Sharing and Preserving Computational Analyses for Posterity with\n  encapsulator", "comments": "11 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Open data and open-source software may be part of the solution to science's\n\"reproducibility crisis\", but they are insufficient to guarantee\nreproducibility. Requiring minimal end-user expertise, encapsulator creates a\n\"time capsule\" with reproducible code in a self-contained computational\nenvironment. encapsulator provides end-users with a fully-featured desktop\nenvironment for reproducible research.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2018 15:31:36 GMT"}, {"version": "v2", "created": "Sun, 6 May 2018 09:08:19 GMT"}], "update_date": "2018-05-08", "authors_parsed": [["Pasquier", "Thomas", ""], ["Lau", "Matthew K.", ""], ["Han", "Xueyuan", ""], ["Fong", "Elizabeth", ""], ["Lerner", "Barbara S.", ""], ["Boose", "Emery", ""], ["Crosas", "Merce", ""], ["Ellison", "Aaron M.", ""], ["Seltzer", "Margo", ""]]}, {"id": "1803.06161", "submitter": "Alberto Mart\\'in-Mart\\'in", "authors": "Alberto Mart\\'in-Mart\\'in, Rodrigo Costas, Thed van Leeuwen, Emilio\n  Delgado L\\'opez-C\\'ozar", "title": "Evidence of Open Access of scientific publications in Google Scholar: a\n  large-scale analysis", "comments": "38 pages, 8 figures, 3 tables. Complementary materials available at\n  https://osf.io/fsujy/", "journal-ref": "Journal of Informetrics, 12(3), 819-841, 2018", "doi": "10.1016/J.JOI.2018.06.012", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article uses Google Scholar (GS) as a source of data to analyse Open\nAccess (OA) levels across all countries and fields of research. All articles\nand reviews with a DOI and published in 2009 or 2014 and covered by the three\nmain citation indexes in the Web of Science (2,269,022 documents) were selected\nfor study. The links to freely available versions of these documents displayed\nin GS were collected. To differentiate between more reliable (sustainable and\nlegal) forms of access and less reliable ones, the data extracted from GS was\ncombined with information available in DOAJ, CrossRef, OpenDOAR, and ROAR. This\nallowed us to distinguish the percentage of documents in our sample that are\nmade OA by the publisher (23.1%, including Gold, Hybrid, Delayed, and Bronze\nOA) from those available as Green OA (17.6%), and those available from other\nsources (40.6%, mainly due to ResearchGate). The data shows an overall free\navailability of 54.6%, with important differences at the country and subject\ncategory levels. The data extracted from GS yielded very similar results to\nthose found by other studies that analysed similar samples of documents, but\nemployed different methods to find evidence of OA, thus suggesting a relative\nconsistency among methods.\n", "versions": [{"version": "v1", "created": "Fri, 16 Mar 2018 11:02:27 GMT"}, {"version": "v2", "created": "Tue, 24 Jul 2018 19:41:19 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Martín-Martín", "Alberto", ""], ["Costas", "Rodrigo", ""], ["van Leeuwen", "Thed", ""], ["López-Cózar", "Emilio Delgado", ""]]}, {"id": "1803.06249", "submitter": "Yi Yu", "authors": "Haeran Cho and Yi Yu", "title": "Link prediction for interdisciplinary collaboration via co-authorship\n  network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyse the Publication and Research (PURE) data set of University of\nBristol collected between $2008$ and $2013$. Using the existing co-authorship\nnetwork and academic information thereof, we propose a new link prediction\nmethodology, with the specific aim of identifying potential interdisciplinary\ncollaboration in a university-wide collaboration network.\n", "versions": [{"version": "v1", "created": "Fri, 16 Mar 2018 14:34:53 GMT"}], "update_date": "2018-03-19", "authors_parsed": [["Cho", "Haeran", ""], ["Yu", "Yi", ""]]}, {"id": "1803.07525", "submitter": "Mike Thelwall Prof", "authors": "Mike Thelwall", "title": "Dimensions: A Competitor to Scopus and the Web of Science?", "comments": "Thelwall, M. (2018). Dimensions: A Competitor to Scopus and the Web\n  of Science? Journal of Informetrics", "journal-ref": "Thelwall, M. (2018). Dimensions: A competitor to Scopus and the\n  Web of Science? Journal of Informetrics, 12(2), 430-435.\n  10.1016/j.joi.2018.03.006", "doi": "10.1016/j.joi.2018.03.006", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dimensions is a partly free scholarly database launched by Digital Science in\nJanuary 2018. Dimensions includes journal articles and citation counts, making\nit a potential new source of impact data. This article explores the value of\nDimensions from an impact assessment perspective with an examination of Food\nScience research 2008-2018 and a random sample of 10,000 Scopus articles from\n2012. The results include high correlations between citation counts from Scopus\nand Dimensions (0.96 by narrow field in 2012) as well as similar average\ncounts. Almost all Scopus articles with DOIs were found in Dimensions (97% in\n2012). Thus, the scholarly database component of Dimensions seems to be a\nplausible alternative to Scopus and the Web of Science for general citation\nanalyses and for citation data in support of some types of research\nevaluations.\n", "versions": [{"version": "v1", "created": "Tue, 20 Mar 2018 17:06:26 GMT"}], "update_date": "2018-04-20", "authors_parsed": [["Thelwall", "Mike", ""]]}, {"id": "1803.07622", "submitter": "Patrick Diehl", "authors": "Patrick Diehl and Ilyass Tabiai and Felix W. Baumann and Martin\n  Levesque", "title": "Long term availability of raw experimental data in experimental fracture\n  mechanics", "comments": null, "journal-ref": null, "doi": "10.1016/j.engfracmech.2018.04.030", "report-no": null, "categories": "cs.DL stat.AP", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Experimental data availability is a cornerstone for reproducibility in\nexperimental fracture mechanics, which is crucial to the scientific method.\nThis short communication focuses on the accessibility and long term\navailability of raw experimental data. The corresponding authors of the eleven\nmost cited papers, related to experimental fracture mechanics, for every year\nfrom 2000 up to 2016, were kindly asked about the availability of the raw\nexperimental data associated with each publication. For the 187 e-mails sent:\n22.46% resulted in outdated contact information, 57.75% of the authors did\nreceived our request and did not reply, and 19.79 replied to our request. The\navailability of data is generally low with only $11$ available data sets\n(5.9%). The authors identified two main issues for the lacking availability of\nraw experimental data. First, the ability to retrieve data is strongly attached\nto the the possibility to contact the corresponding author. This study suggests\nthat institutional e-mail addresses are insufficient means for obtaining\nexperimental data sets. Second, lack of experimental data is also due that\nsubmission and publication does not require to make the raw experimental data\navailable. The following solutions are proposed: (1) Requirement of unique\nidentifiers, like ORCID or ResearcherID, to detach the author(s) from their\ninstitutional e-mail address, (2) Provide DOIs, like Zenodo or Dataverse, to\nmake raw experimental data citable, and (3) grant providing organizations\nshould ensure that experimental data by public funded projects is available to\nthe public.\n", "versions": [{"version": "v1", "created": "Tue, 20 Mar 2018 19:49:46 GMT"}], "update_date": "2018-05-02", "authors_parsed": [["Diehl", "Patrick", ""], ["Tabiai", "Ilyass", ""], ["Baumann", "Felix W.", ""], ["Levesque", "Martin", ""]]}, {"id": "1803.09104", "submitter": "Francesco Alessandro Massucci", "authors": "Francesco Alessandro Massucci and Domingo Docampo", "title": "Measuring the academic reputation through citation networks via PageRank", "comments": "20 pages; 7 figures", "journal-ref": "Journal of Informetrics 13, 1, February 2019, Pages 185-201", "doi": "10.1016/j.joi.2018.12.001", "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective assessment of the prestige of an academic institution is a\ndifficult and hotly debated task. In the last few years, different types of\nUniversity Rankings have been proposed to quantify the excellence of different\nresearch institutions in the world. Albeit met with criticism in some cases,\nthe relevance of university rankings is being increasingly acknowledged:\nindeed, rankings are having a major impact on the design of research policies,\nboth at the institutional and governmental level. Yet, the debate on what\nrankings are {\\em exactly} measuring is enduring. Here, we address the issue by\nmeasuring a quantitive and reliable proxy of the academic reputation of a given\ninstitution and by evaluating its correlation with different university\nrankings. Specifically, we study citation patterns among universities in five\ndifferent Web of Science Subject Categories and use the \\pr~algorithm on the\nfive resulting citation networks. The rationale behind our work is that\nscientific citations are driven by the reputation of the reference so that the\nPageRank algorithm is expected to yield a rank which reflects the reputation of\nan academic institution in a specific field. Our results allow to quantifying\nthe prestige of a set of institutions in a certain research field based only on\nhard bibliometric data. Given the volume of the data analysed, our findings are\nstatistically robust and less prone to bias, at odds with ad--hoc surveys often\nemployed by ranking bodies in order to attain similar results. Because our\nfindings are found to correlate extremely well with the ARWU Subject rankings,\nthe approach we propose in our paper may open the door to new, Academic Ranking\nmethodologies that go beyond current methods by reconciling the qualitative\nevaluation of Academic Prestige with its quantitative measurements via\npublication impact.\n", "versions": [{"version": "v1", "created": "Sat, 24 Mar 2018 13:11:20 GMT"}, {"version": "v2", "created": "Fri, 4 Jan 2019 11:50:35 GMT"}], "update_date": "2019-01-07", "authors_parsed": [["Massucci", "Francesco Alessandro", ""], ["Docampo", "Domingo", ""]]}, {"id": "1803.09317", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff", "title": "Diversity and Interdisciplinarity: How Can One Distinguish and Recombine\n  Disparity, Variety, and Balance?", "comments": "Scientometrics, accepted June 7, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dilemma which remained unsolved using Rao-Stirling diversity, namely of\nhow variety and balance can be combined into \"dual concept diversity\"\n(Stirling, 1998, pp. 48f.) can be clarified by using Nijssen et al.'s (1998)\nargument that the Gini coefficient is a perfect indicator of balance. However,\nthe Gini coefficient is not an indicator of variety; this latter term can be\noperationalized independently as relative variety. The three components of\ndiversity--variety, balance, and disparity--can thus be clearly distinguished\nand independently operationalized as measures varying between zero and one. The\nnew diversity indicator ranges with more resolving power in the empirical case.\n", "versions": [{"version": "v1", "created": "Sun, 25 Mar 2018 19:22:02 GMT"}, {"version": "v2", "created": "Thu, 7 Jun 2018 12:33:57 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Leydesdorff", "Loet", ""]]}, {"id": "1803.09701", "submitter": "Martin Klein", "authors": "Martin Klein, Peter Broadwell, Sharon E. Farb, Todd Grappone", "title": "Comparing Published Scientific Journal Articles to Their Pre-Print\n  Versions -- Extended Version", "comments": "extended version of arXiv:1604.05363", "journal-ref": null, "doi": "10.1007/s00799-018-0234-1", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Academic publishers claim that they add value to scholarly communications by\ncoordinating reviews and contributing and enhancing text during publication.\nThese contributions come at a considerable cost: U.S. academic libraries paid\n$1.7 billion for serial subscriptions in 2008 alone. Library budgets, in\ncontrast, are flat and not able to keep pace with serial price inflation. We\nhave investigated the publishers' value proposition by conducting a comparative\nstudy of pre-print papers from two distinct science, technology, and medicine\n(STM) corpora and their final published counterparts. This comparison had two\nworking assumptions: 1) if the publishers' argument is valid, the text of a\npre-print paper should vary measurably from its corresponding final published\nversion, and 2) by applying standard similarity measures, we should be able to\ndetect and quantify such differences. Our analysis revealed that the text\ncontents of the scientific papers generally changed very little from their\npre-print to final published versions. These findings contribute empirical\nindicators to discussions of the added value of commercial publishers and\ntherefore should influence libraries' economic decisions regarding access to\nscholarly publications.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2018 16:28:18 GMT"}], "update_date": "2018-03-28", "authors_parsed": [["Klein", "Martin", ""], ["Broadwell", "Peter", ""], ["Farb", "Sharon E.", ""], ["Grappone", "Todd", ""]]}, {"id": "1803.09814", "submitter": "Evgeny Krivosheev", "authors": "Evgeny Krivosheev, Fabio Casati and Boualem Benatallah", "title": "Crowd-based Multi-Predicate Screening of Papers in Literature Reviews", "comments": "Please cite the www2018 version of this paper:\n  @inproceedings{krivosheev2018, title={Crowd-based Multi-Predicate Screening\n  of Papers in Literature Reviews}, author={Evgeny Krivosheev, Fabio Casati and\n  Boualem Benatallah}, year={2018}, organization={International World Wide Web\n  Conferences Steering Committee} }", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Systematic literature reviews (SLRs) are one of the most common and useful\nform of scientific research and publication. Tens of thousands of SLRs are\npublished each year, and this rate is growing across all fields of science.\nPerforming an accurate, complete and unbiased SLR is however a difficult and\nexpensive endeavor. This is true in general for all phases of a literature\nreview, and in particular for the paper screening phase, where authors lter a\nset of potentially in-scope papers based on a number of exclusion criteria. To\naddress the problem, in recent years the research community has began to\nexplore the use of the crowd to allow for a faster, accurate, cheaper and\nunbiased screening of papers. Initial results show that crowdsourcing can be\neffective, even for relatively complex reviews. In this paper we derive and\nanalyze a set of strategies for crowd-based screening, and show that an\nadaptive strategy, that continuously re-assesses the statistical properties of\nthe problem to minimize the number of votes needed to take decisions for each\npaper, significantly outperforms a number of non-adaptive approaches in terms\nof cost and accuracy. We validate both applicability and results of the\napproach through a set of crowdsourcing experiments, and discuss properties of\nthe problem and algorithms that we believe to be generally of interest for\nclassification problems where items are classified via a series of successive\ntests (as it often happens in medicine).\n", "versions": [{"version": "v1", "created": "Wed, 21 Mar 2018 14:38:07 GMT"}], "update_date": "2018-03-28", "authors_parsed": [["Krivosheev", "Evgeny", ""], ["Casati", "Fabio", ""], ["Benatallah", "Boualem", ""]]}, {"id": "1803.10713", "submitter": "Alessandro Strumia", "authors": "Alessandro Strumia and Riccardo Torre", "title": "Biblioranking fundamental physics", "comments": "41 pages, 16 figures, 13 tables, 1 appendix; updated to 2021/1/1.\n  Additional results and full tables are available at the link:\n  http://rtorre.web.cern.ch/rtorre/PhysRank/index.html", "journal-ref": "J. of Informetrics 13 (2019) 515", "doi": "10.1016/j.joi.2019.01.011", "report-no": null, "categories": "cs.DL astro-ph.CO hep-ph hep-th physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose measures of the impact of research that improve on existing ones\nsuch as counting of number of papers, citations and $h$-index. Since different\npapers and different fields have largely different average number of co-authors\nand of references we replace citations with individual citations, shared among\nco-authors. Next, we improve on citation counting applying the PageRank\nalgorithm to citations among papers. Being time-ordered, this reduces to a\nweighted counting of citation descendants that we call PaperRank. Similarly, we\ncompute an AuthorRank applying the PageRank algorithm to citations among\nauthors. These metrics quantify the impact of an author or paper taking into\naccount the impact of those authors that cite it. Finally, we show how self-\nand circular- citations can be eliminated by defining a closed market of\ncitation-coins. We apply these metrics to the InSpire database that covers\nfundamental physics, ranking papers, authors, journals, institutes, towns,\ncountries, continents, genders, for all-time and in recent time periods.\n", "versions": [{"version": "v1", "created": "Wed, 28 Mar 2018 16:28:28 GMT"}, {"version": "v2", "created": "Tue, 6 Apr 2021 16:08:40 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Strumia", "Alessandro", ""], ["Torre", "Riccardo", ""]]}]