[{"id": "1310.0100", "submitter": "Christelle Hobeika", "authors": "Christelle Hobeika, Claude Thibeault and Jean-Fran\\c{c}ois Boland", "title": "Technical report: Functional Constraint Extraction From Register\n  Transfer Level for ATPG", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We proposed in \"Functional Constraint Extraction From Register Transfer Level\nfor ATPG\" that is currently submitted to TVLSI, an automatic functional\nconstraint extractor that can be applied on the RT level. These functional\nconstraints are used to generate pseudo functional test patterns with ATPG\ntools. The patterns are then used to improve the verification process. This\ntechnical report complements the work proposed as it contains the\nimplementation details of the proposed methodology and shows the detailed\nintermediate and final results of the application of this methodology on a\nconcrete example.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 00:06:15 GMT"}], "update_date": "2013-10-02", "authors_parsed": [["Hobeika", "Christelle", ""], ["Thibeault", "Claude", ""], ["Boland", "Jean-François", ""]]}, {"id": "1310.1032", "submitter": "David Yllanes", "authors": "Janus Collaboration: M. Baity-Jesi, R. A. Ba\\~nos, A. Cruz, L. A.\n  Fernandez, J. M. Gil-Narvion, A. Gordillo-Guerrero, D. I\\~niguez, A.\n  Maiorano, F. Mantovani, E. Marinari, V. Martin-Mayor, J. Monforte-Garcia, A.\n  Mu\\~noz Sudupe, D. Navarro, G. Parisi, S. Perez-Gaviro, M. Pivanti, F.\n  Ricci-Tersenghi, J. J. Ruiz-Lorenzo, S. F. Schifano, B. Seoane, A. Tarancon,\n  R. Tripiccione, D. Yllanes", "title": "Janus II: a new generation application-driven computer for spin-system\n  simulations", "comments": "28 pages, 6 figures", "journal-ref": "Computer Physics Communications 185 (2014) 550-559", "doi": "10.1016/j.cpc.2013.10.019", "report-no": null, "categories": "cs.AR cond-mat.dis-nn cond-mat.stat-mech physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes the architecture, the development and the implementation\nof Janus II, a new generation application-driven number cruncher optimized for\nMonte Carlo simulations of spin systems (mainly spin glasses). This domain of\ncomputational physics is a recognized grand challenge of high-performance\ncomputing: the resources necessary to study in detail theoretical models that\ncan make contact with experimental data are by far beyond those available using\ncommodity computer systems. On the other hand, several specific features of the\nassociated algorithms suggest that unconventional computer architectures, which\ncan be implemented with available electronics technologies, may lead to order\nof magnitude increases in performance, reducing to acceptable values on human\nscales the time needed to carry out simulation campaigns that would take\ncenturies on commercially available machines. Janus II is one such machine,\nrecently developed and commissioned, that builds upon and improves on the\nsuccessful JANUS machine, which has been used for physics since 2008 and is\nstill in operation today. This paper describes in detail the motivations behind\nthe project, the computational requirements, the architecture and the\nimplementation of this new machine and compares its expected performances with\nthose of currently available commercial systems.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2013 16:49:55 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Janus Collaboration", "", ""], ["Baity-Jesi", "M.", ""], ["Baños", "R. A.", ""], ["Cruz", "A.", ""], ["Fernandez", "L. A.", ""], ["Gil-Narvion", "J. M.", ""], ["Gordillo-Guerrero", "A.", ""], ["Iñiguez", "D.", ""], ["Maiorano", "A.", ""], ["Mantovani", "F.", ""], ["Marinari", "E.", ""], ["Martin-Mayor", "V.", ""], ["Monforte-Garcia", "J.", ""], ["Sudupe", "A. Muñoz", ""], ["Navarro", "D.", ""], ["Parisi", "G.", ""], ["Perez-Gaviro", "S.", ""], ["Pivanti", "M.", ""], ["Ricci-Tersenghi", "F.", ""], ["Ruiz-Lorenzo", "J. J.", ""], ["Schifano", "S. F.", ""], ["Seoane", "B.", ""], ["Tarancon", "A.", ""], ["Tripiccione", "R.", ""], ["Yllanes", "D.", ""]]}, {"id": "1310.1712", "submitter": "Guillaume Berhault", "authors": "Guillaume Berhault, Camille Leroux, Christophe Jego, Dominique Dallet", "title": "Partial Sums Computation In Polar Codes Decoding", "comments": "Accepted to ISCAS 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Polar codes are the first error-correcting codes to provably achieve the\nchannel capacity but with infinite codelengths. For finite codelengths the\nexisting decoder architectures are limited in working frequency by the partial\nsums computation unit. We explain in this paper how the partial sums\ncomputation can be seen as a matrix multiplication. Then, an efficient hardware\nimplementation of this product is investigated. It has reduced logic resources\nand interconnections. Formalized architectures, to compute partial sums and to\ngenerate the bits of the generator matrix k^n, are presented. The proposed\narchitecture allows removing the multiplexing resources used to assigned to\neach processing elements the required partial sums.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 09:29:02 GMT"}, {"version": "v2", "created": "Fri, 9 Jan 2015 14:11:44 GMT"}], "update_date": "2015-01-12", "authors_parsed": [["Berhault", "Guillaume", ""], ["Leroux", "Camille", ""], ["Jego", "Christophe", ""], ["Dallet", "Dominique", ""]]}, {"id": "1310.3356", "submitter": "Feitian Li", "authors": "Feitian Li, Fei Qiao, Qi Wei, Huazhong Yang", "title": "A Novel Reconfigurable Computing Architecture for Image Signal\n  Processing Using Circuit-Switched NoC and Synchronous Dataflow Model", "comments": "ISQED 2014,6 pages,7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel reconfigurable architecture is proposed for\nmultifunctional image signal processing systems. A circuit-switched NoC is used\nto provide interconnection because the non-TMD links ensure fixed throughput,\nwhich is a desirable behavior for computational intensive image processing\nalgorithms compared with packet-switched NoC. Image processing algorithms are\nmodeled as synchronous dataflow graphs which provide a unified model for\ngeneral computing procedure. An image processing system is considered as\nseveral temporally mutually exclusive algorithms. Thus, their dataflow graph\nrepresentations could be considered as a group and a merging algorithm could be\napplied to generate a union graph while eliminating spatial redundancy for area\nconsumption optimization. After the union graph have been mapped and routed on\nthe NoC, the reconfigurable system could be configured to any of its target\nimage processing algorithms by properly setting the NoC topology. Experiments\nshow the demo reconfigurable system with two image processing applications cost\n26.4% less hardware resource, compared with the non-reconfigurable\nimplementations.\n", "versions": [{"version": "v1", "created": "Sat, 12 Oct 2013 10:05:07 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Li", "Feitian", ""], ["Qiao", "Fei", ""], ["Wei", "Qi", ""], ["Yang", "Huazhong", ""]]}, {"id": "1310.4231", "submitter": "Sparsh Mittal", "authors": "Sparsh Mittal", "title": "Dynamic cache reconfiguration based techniques for improving cache\n  energy efficiency", "comments": "PhD thesis, dynamic cache reconfiguration", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern multicore processors are employing large last-level caches, for\nexample Intel's E7-8800 processor uses 24MB L3 cache. Further, with each CMOS\ntechnology generation, leakage energy has been dramatically increasing and\nhence, leakage energy is expected to become a major source of energy\ndissipation, especially in last-level caches (LLCs). The conventional schemes\nof cache energy saving either aim at saving dynamic energy or are based on\nproperties specific to first-level caches, and thus these schemes have limited\nutility for last-level caches. Further, several other techniques require\noffline profiling or per-application tuning and hence are not suitable for\nproduct systems. In this research, we propose novel cache leakage energy saving\nschemes for single-core and multicore systems; desktop, QoS, real-time and\nserver systems. We propose software-controlled, hardware-assisted techniques\nwhich use dynamic cache reconfiguration to configure the cache to the most\nenergy efficient configuration while keeping the performance loss bounded. To\nprofile and test a large number of potential configurations, we utilize\nlow-overhead, micro-architecture components, which can be easily integrated\ninto modern processor chips. We adopt a system-wide approach to save energy to\nensure that cache reconfiguration does not increase energy consumption of other\ncomponents of the processor. We have compared our techniques with the\nstate-of-art techniques and have found that our techniques outperform them in\ntheir energy efficiency. This research has important applications in improving\nenergy-efficiency of higher-end embedded, desktop, server processors and\nmultitasking systems. We have also proposed performance estimation approach for\nefficient design space exploration and have implemented time-sampling based\nsimulation acceleration approach for full-system architectural simulators.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2013 00:41:12 GMT"}], "update_date": "2013-10-17", "authors_parsed": [["Mittal", "Sparsh", ""]]}, {"id": "1310.4349", "submitter": "Juliane Bertram", "authors": "Juliane Bertram, Peter Hauck, Michael Huber", "title": "An Improved Majority-Logic Decoder Offering Massively Parallel Decoding\n  for Real-Time Control in Embedded Systems", "comments": "8 pages; to appear in \"IEEE Transactions on Communications\"", "journal-ref": null, "doi": "10.1109/TCOMM.2013.102413.130109", "report-no": null, "categories": "cs.IT cs.AR cs.DM cs.ET math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an easy-to-implement hard-decision majority-logic decoding\nalgorithm for Reed-Muller codes RM(r,m) with m >= 3, m/2 >= r >= 1. The\npresented algorithm outperforms the best known majority-logic decoding\nalgorithms and offers highly parallel decoding. The result is of special\nimportance for safety- and time-critical applications in embedded systems. A\nsimple combinational circuit can perform the proposed decoding. In particular,\nwe show how our decoder for the three-error-correcting code RM(2,5) of\ndimension 16 and length 32 can be realized on hardware level.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2013 12:31:01 GMT"}, {"version": "v2", "created": "Wed, 23 Oct 2013 12:43:36 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Bertram", "Juliane", ""], ["Hauck", "Peter", ""], ["Huber", "Michael", ""]]}, {"id": "1310.7792", "submitter": "Daniel Sorin", "authors": "Blake A. Hechtman and Daniel J. Sorin", "title": "Evaluating Cache Coherent Shared Virtual Memory for Heterogeneous\n  Multicore Chips", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The trend in industry is towards heterogeneous multicore processors (HMCs),\nincluding chips with CPUs and massively-threaded throughput-oriented processors\n(MTTOPs) such as GPUs. Although current homogeneous chips tightly couple the\ncores with cache-coherent shared virtual memory (CCSVM), this is not the\ncommunication paradigm used by any current HMC. In this paper, we present a\nCCSVM design for a CPU/MTTOP chip, as well as an extension of the pthreads\nprogramming model, called xthreads, for programming this HMC. Our goal is to\nevaluate the potential performance benefits of tightly coupling heterogeneous\ncores with CCSVM.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2013 13:03:38 GMT"}], "update_date": "2013-10-30", "authors_parsed": [["Hechtman", "Blake A.", ""], ["Sorin", "Daniel J.", ""]]}, {"id": "1310.8494", "submitter": "Sparsh Mittal", "authors": "Sparsh Mittal", "title": "Using Cache-coloring to Mitigate Inter-set Write Variation in\n  Non-volatile Caches", "comments": "STT-RAM cache", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, researchers have explored use of non-volatile devices such\nas STT-RAM (spin torque transfer RAM) for designing on-chip caches, since they\nprovide high density and consume low leakage power. A common limitation of all\nnon-volatile devices is their limited write endurance. Further, since existing\ncache management policies are write-variation unaware, excessive writes to a\nfew blocks may lead to a quick failure of the whole cache. We propose an\narchitectural technique for wear-leveling of non-volatile last level caches\n(LLCs). Our technique uses cache-coloring approach which adds a\nsoftware-controlled mapping layer between groups of physical pages and cache\nsets. Periodically the mapping is altered to ensure that write-traffic can be\nspread uniformly to different sets of the cache to achieve wear-leveling.\nSimulations performed with an x86-64 simulator and SPEC2006 benchmarks show\nthat our technique reduces the worst-case writes to cache blocks and thus\nimproves the cache lifetime by 4.07X.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 13:33:16 GMT"}], "update_date": "2013-11-01", "authors_parsed": [["Mittal", "Sparsh", ""]]}]