[{"id": "0705.0078", "submitter": "Claudius Gros", "authors": "Claudius Gros", "title": "Neural networks with transient state dynamics", "comments": null, "journal-ref": "New J.Phys.9:109,2007", "doi": "10.1088/1367-2630/9/4/109", "report-no": null, "categories": "cond-mat.dis-nn astro-ph cond-mat.other nlin.AO q-bio.NC", "license": null, "abstract": "  We investigate dynamical systems characterized by a time series of distinct\nsemi-stable activity patterns, as they are observed in cortical neural activity\npatterns. We propose and discuss a general mechanism allowing for an adiabatic\ncontinuation between attractor networks and a specific adjoined transient-state\nnetwork, which is strictly dissipative. Dynamical systems with transient states\nretain functionality when their working point is autoregulated; avoiding\nprolonged periods of stasis or drifting into a regime of rapid fluctuations. We\nshow, within a continuous-time neural network model, that a single local\nupdating rule for online learning allows simultaneously (i) for information\nstorage via unsupervised Hebbian-type learning, (ii) for adaptive regulation of\nthe working point and (iii) for the suppression of runaway synaptic growth.\nSimulation results are presented; the spontaneous breaking of time-reversal\nsymmetry and link symmetry are discussed.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 06:27:50 GMT"}], "update_date": "2010-02-11", "authors_parsed": [["Gros", "Claudius", ""]]}, {"id": "0705.1307", "submitter": "Yohan Payan", "authors": "Nicolas Vuillerme (TIMC - IMAG), Olivier Chenu (TIMC - IMAG), Jacques\n  Demongeot (TIMC - IMAG), Yohan Payan (TIMC - IMAG)", "title": "Controlling posture using a plantar pressure-based, tongue-placed\n  tactile biofeedback system", "comments": null, "journal-ref": "Experimental Brain Research 179, 3 (2007) 409-14", "doi": "10.1007/s00221-006-0800-4", "report-no": null, "categories": "physics.med-ph q-bio.NC", "license": null, "abstract": "  The present paper introduces an original biofeedback system for improving\nhuman balance control, whose underlying principle consists in providing\nadditional sensory information related to foot sole pressure distribution to\nthe user through a tongue-placed tactile output device. To assess the effect of\nthis biofeedback system on postural control during quiet standing, ten young\nhealthy adults were asked to stand as immobile as possible with their eyes\nclosed in two conditions of No-biofeedback and Biofeedback. Centre of foot\npressure (CoP) displacements were recorded using a force platform. Results\nshowed reduced CoP displacements in the Biofeedback relative to the\nNo-biofeedback condition. The present findings evidenced the ability of the\ncentral nervous system to efficiently integrate an artificial plantar-based,\ntongue-placed tactile biofeedback for controlling control posture during quiet\nstanding.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2007 15:27:34 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Vuillerme", "Nicolas", "", "TIMC - IMAG"], ["Chenu", "Olivier", "", "TIMC - IMAG"], ["Demongeot", "Jacques", "", "TIMC - IMAG"], ["Payan", "Yohan", "", "TIMC - IMAG"]]}, {"id": "0705.2491", "submitter": "Kazuya Ishibashi", "authors": "Kazuya Ishibashi, Kosuke Hamaguchi, and Masato Okada", "title": "Sparse and Dense Encoding in Layered Associative Network of Spiking\n  Neurons", "comments": null, "journal-ref": null, "doi": "10.1143/JPSJ.76.124801", "report-no": null, "categories": "q-bio.NC", "license": null, "abstract": "  A synfire chain is a simple neural network model which can propagate stable\nsynchronous spikes called a pulse packet and widely researched. However how\nsynfire chains coexist in one network remains to be elucidated. We have studied\nthe activity of a layered associative network of Leaky Integrate-and-Fire\nneurons in which connection we embed memory patterns by the Hebbian Learning.\nWe analyzed their activity by the Fokker-Planck method. In our previous report,\nwhen a half of neurons belongs to each memory pattern (memory pattern rate\n$F=0.5$), the temporal profiles of the network activity is split into\ntemporally clustered groups called sublattices under certain input conditions.\nIn this study, we show that when the network is sparsely connected ($F<0.5$),\nsynchronous firings of the memory pattern are promoted. On the contrary, the\ndensely connected network ($F>0.5$) inhibit synchronous firings. The sparseness\nand denseness also effect the basin of attraction and the storage capacity of\nthe embedded memory patterns. We show that the sparsely(densely) connected\nnetworks enlarge(shrink) the basion of attraction and increase(decrease) the\nstorage capacity.\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2007 07:18:34 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Ishibashi", "Kazuya", ""], ["Hamaguchi", "Kosuke", ""], ["Okada", "Masato", ""]]}, {"id": "0705.2811", "submitter": "Alessandro Torcini", "authors": "R\\\"udiger Zillmer, Roberto Livi, Antonio Politi, and Alessandro\n  Torcini", "title": "Stability of the splay state in pulse--coupled networks", "comments": "13 pages, 10 figures, submitted for pubblication to Physical Review E", "journal-ref": "Phys. Rev. E 76, 046102 (2007)", "doi": "10.1103/PhysRevE.76.046102", "report-no": null, "categories": "cond-mat.dis-nn q-bio.NC", "license": null, "abstract": "  The stability of the dynamical states characterized by a uniform firing rate\n({\\it splay states}) is analyzed in a network of globally coupled leaky\nintegrate-and-fire neurons. This is done by reducing the set of differential\nequations to a map that is investigated in the limit of large network size. We\nshow that the stability of the splay state depends crucially on the ratio\nbetween the pulse--width and the inter-spike interval. More precisely, the\nspectrum of Floquet exponents turns out to consist of three components: (i) one\nthat coincides with the predictions of the mean-field analysis [Abbott-van\nVreesvijk, 1993]; (ii) a component measuring the instability of\n\"finite-frequency\" modes; (iii) a number of \"isolated\" eigenvalues that are\nconnected to the characteristics of the single pulse and may give rise to\nstrong instabilities (the Floquet exponent being proportional to the network\nsize). Finally, as a side result, we find that the splay state can be stable\neven for inhibitory coupling.\n", "versions": [{"version": "v1", "created": "Sat, 19 May 2007 10:32:10 GMT"}], "update_date": "2007-11-27", "authors_parsed": [["Zillmer", "Rüdiger", ""], ["Livi", "Roberto", ""], ["Politi", "Antonio", ""], ["Torcini", "Alessandro", ""]]}, {"id": "0705.2913", "submitter": "Jan Karbowski", "authors": "Jan Karbowski", "title": "Global and regional brain metabolic scaling and its functional\n  consequences", "comments": "Brain metabolism scales with its mass well above 3/4 exponent", "journal-ref": "BMC Biology 5:18 (2007)", "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": null, "abstract": "  Background: Information processing in the brain requires large amounts of\nmetabolic energy, the spatial distribution of which is highly heterogeneous\nreflecting complex activity patterns in the mammalian brain.\n  Results: Here, it is found based on empirical data that, despite this\nheterogeneity, the volume-specific cerebral glucose metabolic rate of many\ndifferent brain structures scales with brain volume with almost the same\nexponent around -0.15. The exception is white matter, the metabolism of which\nseems to scale with a standard specific exponent -1/4. The scaling exponents\nfor the total oxygen and glucose consumptions in the brain in relation to its\nvolume are identical and equal to $0.86\\pm 0.03$, which is significantly larger\nthan the exponents 3/4 and 2/3 suggested for whole body basal metabolism on\nbody mass.\n  Conclusions: These findings show explicitly that in mammals (i)\nvolume-specific scaling exponents of the cerebral energy expenditure in\ndifferent brain parts are approximately constant (except brain stem\nstructures), and (ii) the total cerebral metabolic exponent against brain\nvolume is greater than the much-cited Kleiber's 3/4 exponent. The\nneurophysiological factors that might account for the regional uniformity of\nthe exponents and for the excessive scaling of the total brain metabolism are\ndiscussed, along with the relationship between brain metabolic scaling and\ncomputation.\n", "versions": [{"version": "v1", "created": "Mon, 21 May 2007 04:13:41 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Karbowski", "Jan", ""]]}, {"id": "0705.3690", "submitter": "Hugues Berry", "authors": "Benoit Siri (INRIA Futurs), Hugues Berry (INRIA Futurs), Bruno Cessac\n  (INLN), Bruno Delord (ANIM), Mathias Quoy (ETIS)", "title": "A mathematical analysis of the effects of Hebbian learning rules on the\n  dynamics and structure of discrete-time random recurrent neural networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.CD q-bio.NC", "license": null, "abstract": "  We present a mathematical analysis of the effects of Hebbian learning in\nrandom recurrent neural networks, with a generic Hebbian learning rule\nincluding passive forgetting and different time scales for neuronal activity\nand learning dynamics. Previous numerical works have reported that Hebbian\nlearning drives the system from chaos to a steady state through a sequence of\nbifurcations. Here, we interpret these results mathematically and show that\nthese effects, involving a complex coupling between neuronal dynamics and\nsynaptic graph structure, can be analyzed using Jacobian matrices, which\nintroduce both a structural and a dynamical point of view on the neural network\nevolution. Furthermore, we show that the sensitivity to a learned pattern is\nmaximal when the largest Lyapunov exponent is close to 0. We discuss how neural\nnetworks may take advantage of this regime of high functional interest.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2007 04:56:59 GMT"}, {"version": "v2", "created": "Mon, 7 Apr 2008 09:40:27 GMT"}], "update_date": "2008-04-07", "authors_parsed": [["Siri", "Benoit", "", "INRIA Futurs"], ["Berry", "Hugues", "", "INRIA Futurs"], ["Cessac", "Bruno", "", "INLN"], ["Delord", "Bruno", "", "ANIM"], ["Quoy", "Mathias", "", "ETIS"]]}, {"id": "0705.3691", "submitter": "David Hsu", "authors": "David Hsu (1), Aonan Tang (2), Murielle Hsu (1), and John M. Beggs (2)\n  ((1) Department of Neurology, University of Wisconsin, Madison WI, (2)\n  Department of Physics, Indiana University, Bloomington IN)", "title": "A simple spontaneously active Hebbian learning model: homeostasis of\n  activity and connectivity, and consequences for learning and epileptogenesis", "comments": "37 pages, 1 table, 7 figures", "journal-ref": "Phys Rev E vol 76, October 2007", "doi": "10.1103/PhysRevE.76.041909", "report-no": null, "categories": "q-bio.NC", "license": null, "abstract": "  A spontaneously active neural system that is capable of continual learning\nshould also be capable of homeostasis of both firing rate and connectivity.\nExperimental evidence suggests that both types of homeostasis exist, and that\nconnectivity is maintained at a state that is optimal for information\ntransmission and storage. This state is referred to as the critical state. We\npresent a simple stochastic computational Hebbian learning model that\nincorporates both firing rate and critical homeostasis, and we explore its\nstability and connectivity properties. We also examine the behavior of our\nmodel with a simulated seizure and with simulated acute deafferentation. We\nargue that a neural system that is more highly connected than the critical\nstate (i.e., one that is \"supercritical\") is epileptogenic. Based on our\nsimulations, we predict that the post-seizural and post-deafferentation states\nshould be supercritical and epileptogenic. Furthermore, interventions that\nboost spontaneous activity should be protective against epileptogenesis.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2007 02:55:15 GMT"}], "update_date": "2007-10-15", "authors_parsed": [["Hsu", "David", ""], ["Tang", "Aonan", ""], ["Hsu", "Murielle", ""], ["Beggs", "John M.", ""]]}, {"id": "0705.3759", "submitter": "Alain Destexhe", "authors": "Claude Bedard and Alain Destexhe", "title": "A modified cable formalism for modeling neuronal membranes at high\n  frequencies", "comments": "To appear in Biophysical Journal; Submitted on May 25, 2007; accepted\n  on Sept 11th, 2007", "journal-ref": "Biophysical Journal 2008 Feb 15;94(4):1133-43. Epub 2007 Oct 5", "doi": "10.1529/biophysj.107.113571", "report-no": null, "categories": "q-bio.NC", "license": null, "abstract": "  Intracellular recordings of cortical neurons in vivo display intense\nsubthreshold membrane potential (Vm) activity. The power spectral density (PSD)\nof the Vm displays a power-law structure at high frequencies (>50 Hz) with a\nslope of about -2.5. This type of frequency scaling cannot be accounted for by\ntraditional models, as either single-compartment models or models based on\nreconstructed cell morphologies display a frequency scaling with a slope close\nto -4. This slope is due to the fact that the membrane resistance is\n\"short-circuited\" by the capacitance for high frequencies, a situation which\nmay not be realistic. Here, we integrate non-ideal capacitors in cable\nequations to reflect the fact that the capacitance cannot be charged\ninstantaneously. We show that the resulting \"non-ideal\" cable model can be\nsolved analytically using Fourier transforms. Numerical simulations using a\nball-and-stick model yield membrane potential activity with similar frequency\nscaling as in the experiments. We also discuss the consequences of using\nnon-ideal capacitors on other cellular properties such as the transmission of\nhigh frequencies, which is boosted in non-ideal cables, or voltage attenuation\nin dendrites. These results suggest that cable equations based on non-ideal\ncapacitors should be used to capture the behavior of neuronal membranes at high\nfrequencies.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2007 12:34:43 GMT"}, {"version": "v2", "created": "Mon, 20 Aug 2007 08:30:58 GMT"}, {"version": "v3", "created": "Tue, 18 Sep 2007 18:57:14 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Bedard", "Claude", ""], ["Destexhe", "Alain", ""]]}, {"id": "0705.4316", "submitter": "Sungho Hong", "authors": "Brian Nils Lundstrom, Sungho Hong, Matthew H. Higgs, and Adrienne L.\n  Fairhall (U. Washington)", "title": "Two computational regimes of a single-compartment neuron separated by a\n  planar boundary in conductance space", "comments": "18 pages, 5 figures, accepted version", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": null, "abstract": "  Recent in vitro data show that neurons respond to input variance with varying\nsensitivities. Here, we demonstrate that Hodgkin-Huxley (HH) neurons can\noperate in two computational regimes, one that is more sensitive to input\nvariance (differentiating) and one that is less sensitive (integrating). A\nboundary plane in the 3D conductance space separates these two regimes. For a\nreduced HH model, this plane can be derived analytically from the V nullcline,\nthus suggesting a means of relating biophysical parameters to neural\ncomputation by analyzing the neuron's dynamical system.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2007 23:19:18 GMT"}, {"version": "v2", "created": "Mon, 16 Jul 2007 21:09:20 GMT"}], "update_date": "2007-07-17", "authors_parsed": [["Lundstrom", "Brian Nils", "", "U. Washington"], ["Hong", "Sungho", "", "U. Washington"], ["Higgs", "Matthew H.", "", "U. Washington"], ["Fairhall", "Adrienne L.", "", "U. Washington"]]}]