[{"id": "0806.0084", "submitter": "Nicolas Vuillerme", "authors": "Nicolas Vuillerme (TIMC), Matthieu Boisgontier (TIMC)", "title": "Muscle fatigue degrades force sense at the ankle joint", "comments": null, "journal-ref": null, "doi": "10.1016/j.gaitpost.2008.03.005", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To investigate the effects of muscle fatigue on force sense at the ankle\njoint, 10 young healthy adults were asked to perform an isometric\ncontra-lateral force ankle-matching task in two experimental conditions of: (1)\nno-fatigue and (2) fatigue of the plantar-flexor muscles. Measures of the\noverall accuracy and the variability of the force matching performances were\ndetermined using the absolute error and the variable error, respectively.\nResults showed less accurate and less consistent force matching performances in\nthe fatigue than no fatigue condition, as indicated by decreased absolute and\nvariable errors, respectively. The present findings evidence that muscle\nfatigue degrades force sense at the ankle joint.\n", "versions": [{"version": "v1", "created": "Sat, 31 May 2008 16:07:33 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Vuillerme", "Nicolas", "", "TIMC"], ["Boisgontier", "Matthieu", "", "TIMC"]]}, {"id": "0806.0087", "submitter": "Nicolas Vuillerme", "authors": "Nicolas Vuillerme (TIMC), Nicolas Pinsault (TIMC), Olivier Chenu\n  (TIMC), Anthony Fleury (TIMC), Yohan Payan (TIMC), Jacques Demongeot (TIMC)", "title": "Postural destabilization induced by trunk extensor muscles fatigue is\n  suppressed by use of a plantar pressure-based electro-tactile biofeedback", "comments": null, "journal-ref": "Arbeitsphysiologie (2008) epub ahead of print", "doi": "10.1007/s00421-008-0768-9", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Separate studies have reported that postural control during quiet standing\ncould be (1) impaired with muscle fatigue localized at the lower back, and (2)\nimproved through the use of plantar pressure-based electro-tactile biofeedback,\nunder normal neuromuscular state. The aim of this experiment was to investigate\nwhether this biofeedback could reduce postural destabilization induced by trunk\nextensor muscles. Ten healthy adults were asked to stand as immobile as\npossible in four experimental conditions: (1) no fatigue/no biofeedback, (2) no\nfatigue/biofeedback, (3) fatigue/no biofeedback and (4) fatigue/biofeedback.\nMuscular fatigue was achieved by performing trunk repetitive extensions until\nmaximal exhaustion. The underlying principle of the biofeedback consisted of\nproviding supplementary information related to foot sole pressure distribution\nthrough electro-tactile stimulation of the tongue. Centre of foot pressure\n(CoP) displacements were recorded using a force platform. Results showed (1)\nincreased CoP displacements along the antero-posterior axis in the fatigue than\nno fatigue condition in the absence of biofeedback and (2) no significant\ndifference between the no fatigue and fatigue conditions in the presence of\nbiofeedback. This suggests that subjects were able to efficiently integrate an\nartificial plantar pressure information delivered through electro-tactile\nstimulation of the tongue that allowed them to suppress the destabilizing\neffect induced by trunk extensor muscles fatigue.\n", "versions": [{"version": "v1", "created": "Sat, 31 May 2008 16:12:05 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Vuillerme", "Nicolas", "", "TIMC"], ["Pinsault", "Nicolas", "", "TIMC"], ["Chenu", "Olivier", "", "TIMC"], ["Fleury", "Anthony", "", "TIMC"], ["Payan", "Yohan", "", "TIMC"], ["Demongeot", "Jacques", "", "TIMC"]]}, {"id": "0806.0537", "submitter": "Sachin Talathi", "authors": "Abraham Miliotis, Sachin S. Talathi, William L. Ditto", "title": "Flexible Logic from Neuronal Dynamics", "comments": "5 pages, 5 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We present two novel methods for performing logic operations. Our methods are\nbased on using the time dimension for programming and data representation. The\nfirst method is based on varying the sampling moment in time of a neuronal\naction potential, and the second method is based on a neural delay system,\nwhere the generation of the action potential is delayed by specific time\nlengths, to be sampled at a fixed moment in time. Both methods are supported by\nexplicit examples.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jun 2008 14:03:17 GMT"}], "update_date": "2008-06-04", "authors_parsed": [["Miliotis", "Abraham", ""], ["Talathi", "Sachin S.", ""], ["Ditto", "William L.", ""]]}, {"id": "0806.0690", "submitter": "Vladimir Ivancevic", "authors": "Vladimir Ivancevic, Eugene Aidman, Leong Yen and Darryn Reid", "title": "Phase Transitions, Chaos and Joint Action in the Life Space Foam", "comments": "20 pages, no figures, elsart", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper extends our recently developed Life Space Foam (LSF) model of\nmotivated cognitive dynamics \\cite{IA}. LSF uses adaptive path integrals to\ngenerate Lewinian force--fields on smooth manifolds, in order to characterize\nthe dynamics of individual goal--directed action. According to explanatory\ntheories growing in acceptance in cognitive neuroscience, one of the key\nproperties of this dynamics, capable of linking it to microscopic-level\ncortical neurodynamics, is its meta-stability and the resulting phase\ntransitions. Our extended LSF model incorporates the notion of phase\ntransitions and complements it with embedded geometrical chaos. To describe\nthis LSF phase transition, a general path--integral is used, along the\ncorresponding LSF topology change. As a result, our extended LSF model is able\nto rigorously represent co-action by two or more actors in the common\nLSF--manifold. The model yields substantial qualitative differences in\ngeometrical properties between bilateral and multi-lateral co-action due to\nintrinsic chaotic coupling between $n$ actors when $n\\geq 3$.\n  Keywords: cognitive dynamics, adaptive path integrals, phase transitions,\nchaos, topology change, human joint action, function approximation\n", "versions": [{"version": "v1", "created": "Wed, 4 Jun 2008 05:06:16 GMT"}], "update_date": "2008-06-05", "authors_parsed": [["Ivancevic", "Vladimir", ""], ["Aidman", "Eugene", ""], ["Yen", "Leong", ""], ["Reid", "Darryn", ""]]}, {"id": "0806.1264", "submitter": "Nicolas Vuillerme", "authors": "Nicolas Vuillerme (TIMC), Olivier Chenu (TIMC), Nicolas Pinsault\n  (TIMC), Anthony Fleury (TIMC), Jacques Demongeot (TIMC), Yohan Payan (TIMC)", "title": "Can a Plantar Pressure-Based Tongue-Placed Electrotactile Biofeedback\n  Improve Postural Control Under Altered Vestibular and Neck Proprioceptive\n  Conditions?", "comments": null, "journal-ref": "Neuroscience / Neurosciences (2008)", "doi": "10.1016/j.neuroscience.2008.05.018", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigated the effects of a plantar pressure-based tongue-placed\nelectrotactile biofeedback on postural control during quiet standing under\nnormal and altered vestibular and neck proprioceptive conditions. To achieve\nthis goal, fourteen young healthy adults were asked to stand upright as\nimmobile as possible with their eyes closed in two Neutral and Extended head\npostures and two conditions of No-biofeedback and Biofeedback. The underlying\nprinciple of the biofeedback consisted of providing supplementary information\nrelated to foot sole pressure distribution through a wireless embedded\ntongue-placed tactile output device. Centre of foot pressure (CoP)\ndisplacements were recorded using a plantar pressure data acquisition system.\nResults showed that (1) the Extended head posture yielded increased CoP\ndisplacements relative to the Neutral head posture in the No-biofeedback\ncondition, with a greater effect along the anteroposterior than mediolateral\naxis, whereas (2) no significant difference between the two Neutral and\nExtended head postures was observed in the Biofeedback condition. The present\nfindings suggested that the availability of the plantar pressure-based\ntongue-placed electrotactile biofeedback allowed the subjects to suppress the\ndestabilizing effect induced by the disruption of vestibular and neck\nproprioceptive inputs associated with the head extended posture. These results\nare discussed according to the sensory re-weighting hypothesis, whereby the\ncentral nervous system would dynamically and selectively adjust the relative\ncontributions of sensory inputs (i.e., the sensory weights) to maintain upright\nstance depending on the sensory contexts and the neuromuscular constraints\nacting on the subject.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jun 2008 06:20:40 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Vuillerme", "Nicolas", "", "TIMC"], ["Chenu", "Olivier", "", "TIMC"], ["Pinsault", "Nicolas", "", "TIMC"], ["Fleury", "Anthony", "", "TIMC"], ["Demongeot", "Jacques", "", "TIMC"], ["Payan", "Yohan", "", "TIMC"]]}, {"id": "0806.1382", "submitter": "Mathilde Himgi", "authors": "Arnaud Rabat (IMNSSA)", "title": "Extra-auditory effects of noise in laboratory animals: the relationship\n  between noise and sleep", "comments": null, "journal-ref": "J Am Assoc Lab Anim Sci 46, 1 (2007) 35-41", "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Noise has both auditory and extra-auditory effects. Some of the most\ndeleterious extra-auditory effects of noise are those leading to sleep\ndisturbances. These disturbances seem to be related to both endogenous\n(physical parameters) and exogenous (sex, age) factors of noise. Despite\ncorrelative relations between noise level and awakenings, the scientific\ncommunity has not reached consensus regarding a specific action of these\nfactors on the different sleep stages. In animal research, 2 complementary main\nfields of research exist. One is focused on the positive modulation of sleep by\nrepeated tone stimulation. The other concerns noise-related sleep disturbances.\nThe few studies that have investigated noise-related sleep disturbances suggest\nthe following conclusions. First, sleep disturbances are greater upon exposure\nto environmental noise, whose frequency spectrum is characterized by high and\nultrasonic sounds, than white noise. Second, unpredictability and pattern of\nnoise events are responsible for extractions from both SWS and PS. Third,\nchronic exposure to noise permanently reduces and fragments sleep. Finally, in\nchronic noise exposure, an inter-individual variability in SWS deficits is\nobserved and correlated to a psychobiological profile related to an\nincapability to face stressful situations. Based on results from other\nresearch, acute noise-related sleep perturbations could result from an\nimbalance in the sleep-wake cycle in favor of arousing ascending systems.\nChronic noise-related sleep disturbances may arise due to imbalance of the\nsleep-wake cycle and malfunctioning of the hypothalamo-pituitary-adrenal axis\nwhich may both contribute to the development of pathology.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2008 07:28:22 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Rabat", "Arnaud", "", "IMNSSA"]]}, {"id": "0806.1685", "submitter": "Vladislav Volman", "authors": "Vladislav Volman and Herbert Levine", "title": "Activity-dependent stochastic resonance in recurrent neuronal networks", "comments": "4 pages, 4 figures, published in Physical Review E", "journal-ref": null, "doi": "10.1103/PhysRevE.77.060903", "report-no": null, "categories": "q-bio.NC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use a biophysical model of a local neuronal circuit to study the\nimplications of synaptic plasticity for the detection of weak sensory stimuli.\nNetworks with fast plastic coupling show behavior consistent with stochastic\nresonance. Addition of an additional slow coupling that accounts for the\nasynchronous release of neurotransmitter results in qualitatively different\nproperties of signal detection, and also leads to the appearance of transient\npost-stimulus bistability. Our results suggest testable hypothesis with regard\nto the self-organization and dynamics of local neuronal circuits.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 15:04:03 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Volman", "Vladislav", ""], ["Levine", "Herbert", ""]]}, {"id": "0806.2694", "submitter": "William Bialek", "authors": "Greg J Stephens, Thierry Mora, Gasper Tkacik and William Bialek", "title": "Thermodynamics of natural images", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevLett.110.018701", "report-no": null, "categories": "q-bio.NC cond-mat.stat-mech q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The scale invariance of natural images suggests an analogy to the statistical\nmechanics of physical systems at a critical point. Here we examine the\ndistribution of pixels in small image patches and show how to construct the\ncorresponding thermodynamics. We find evidence for criticality in a diverging\nspecific heat, which corresponds to large fluctuations in how \"surprising\" we\nfind individual images, and in the quantitative form of the entropy vs. energy.\nThe energy landscape derived from our thermodynamic framework identifies\nspecial image configurations that have intrinsic error correcting properties,\nand neurons which could detect these features have a strong resemblance to the\ncells found in primary visual cortex.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2008 02:25:52 GMT"}], "update_date": "2013-05-30", "authors_parsed": [["Stephens", "Greg J", ""], ["Mora", "Thierry", ""], ["Tkacik", "Gasper", ""], ["Bialek", "William", ""]]}, {"id": "0806.2840", "submitter": "Roberta Sinatra", "authors": "Roberta Sinatra, Fabrizio De Vico Fallani, Laura Astolfi, Fabio\n  Babiloni, Febo Cincotti, Vito Latora, and Donatella Mattia", "title": "Cluster structure of functional networks estimated from high-resolution\n  EEG data", "comments": "21 pages, 4 figures", "journal-ref": null, "doi": "10.1142/S0218127409023020", "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the topological properties of functional connectivity patterns among\ncortical areas in the frequency domain. The cortical networks were estimated\nfrom high-resolution EEG recordings in a group of spinal cord injured patients\nand in a group of healthy subjects, during the preparation of a limb movement.\nWe first evaluate global and local efficiency, as indicators of the structural\nconnectivity respectively at a global and local scale. Then, we use the Markov\nClustering method to analyse the division of the network into community\nstructures. The results indicate large differences between the injured patients\nand the healthy subjects. In particular, the networks of spinal cord injured\npatient exhibited a higher density of efficient clusters. In the Alpha (7-12\nHz) frequency band, the two observed largest communities were mainly composed\nby the cingulate motor areas with the supplementary motor areas, and by the\npre-motor areas with the right primary motor area of the foot. This functional\nseparation strengthens the hypothesis of a compensative mechanism due to the\npartial alteration in the primary motor areas because of the effects of the\nspinal cord injury.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2008 17:04:27 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Sinatra", "Roberta", ""], ["Fallani", "Fabrizio De Vico", ""], ["Astolfi", "Laura", ""], ["Babiloni", "Fabio", ""], ["Cincotti", "Febo", ""], ["Latora", "Vito", ""], ["Mattia", "Donatella", ""]]}, {"id": "0806.3738", "submitter": "Ernest Barreto", "authors": "John R. Cressman Jr., Ghanim Ullah, Jokubas Ziburkus, Steven J.\n  Schiff, and Ernest Barreto", "title": "The Influence of Sodium and Potassium Dynamics on Excitability,\n  Seizures, and the Stability of Persistent States: I. Single Neuron Dynamics", "comments": "Post-review revision. 8 figures. This is the first of a pair of\n  related papers; see also arXiv:0806.3741", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In these companion papers, we study how the interrelated dynamics of sodium\nand potassium affect the excitability of neurons, the occurrence of seizures,\nand the stability of persistent states of activity. In this first paper, we\nconstruct a mathematical model consisting of a single conductance-based neuron\ntogether with intra- and extracellular ion concentration dynamics. We formulate\na reduction of this model that permits a detailed bifurcation analysis, and\nshow that the reduced model is a reasonable approximation of the full model. We\nfind that competition between intrinsic neuronal currents, sodium-potassium\npumps, glia, and diffusion can produce very slow and large-amplitude\noscillations in ion concentrations similar to what is seen physiologically in\nseizures. Using the reduced model, we identify the dynamical mechanisms that\ngive rise to these phenomena. These models reveal several experimentally\ntestable predictions. Our work emphasizes the critical role of ion\nconcentration homeostasis in the proper functioning of neurons, and points to\nimportant fundamental processes that may underlie pathological states such as\nepilepsy.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 19:25:29 GMT"}, {"version": "v2", "created": "Tue, 24 Jun 2008 14:38:42 GMT"}, {"version": "v3", "created": "Wed, 22 Oct 2008 00:31:53 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Cressman", "John R.", "Jr."], ["Ullah", "Ghanim", ""], ["Ziburkus", "Jokubas", ""], ["Schiff", "Steven J.", ""], ["Barreto", "Ernest", ""]]}, {"id": "0806.3741", "submitter": "Ernest Barreto", "authors": "Ghanim Ullah, John R. Cressman Jr., Ernest Barreto, and Steven J.\n  Schiff", "title": "The Influence of Sodium and Potassium Dynamics on Excitability,\n  Seizures, and the Stability of Persistent States: II. Network and Glial\n  Dynamics", "comments": "Post-review revision. 5 figures. This is the second of a pair of\n  related papers; see also arXiv:0806.3738", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In these companion papers, we study how the interrelated dynamics of sodium\nand potassium affect the excitability of neurons, the occurrence of seizures,\nand the stability of persistent states of activity. We seek to study these\ndynamics with respect to the following compartments: neurons, glia, and\nextracellular space. We are particularly interested in the slower time-scale\ndynamics that determine overall excitability, and set the stage for transient\nepisodes of persistent oscillations, working memory, or seizures. In this\nsecond of two companion papers, we present an ionic current network model\ncomposed of populations of Hodgkin-Huxley type excitatory and inhibitory\nneurons embedded within extracellular space and glia, in order to investigate\nthe role of micro-environmental ionic dynamics on the stability of persistent\nactivity. We show that these networks reproduce seizure-like activity if glial\ncells fail to maintain the proper micro-environmental conditions surrounding\nneurons, and produce several experimentally testable predictions. Our work\nsuggests that the stability of persistent states to perturbation is set by\nglial activity, and that how the response to such perturbations decays or grows\nmay be a critical factor in a variety of disparate transient phenomena such as\nworking memory, burst firing in neonatal brain or spinal cord, up states,\nseizures, and cortical oscillations.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 19:21:17 GMT"}, {"version": "v2", "created": "Tue, 24 Jun 2008 14:40:46 GMT"}, {"version": "v3", "created": "Wed, 22 Oct 2008 16:33:09 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Ullah", "Ghanim", ""], ["Cressman", "John R.", "Jr."], ["Barreto", "Ernest", ""], ["Schiff", "Steven J.", ""]]}, {"id": "0806.3978", "submitter": "Vincent Vu", "authors": "Vincent Q. Vu, Bin Yu, Robert E. Kass", "title": "Information In The Non-Stationary Case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.IT math.IT q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information estimates such as the ``direct method'' of Strong et al. (1998)\nsidestep the difficult problem of estimating the joint distribution of response\nand stimulus by instead estimating the difference between the marginal and\nconditional entropies of the response. While this is an effective estimation\nstrategy, it tempts the practitioner to ignore the role of the stimulus and the\nmeaning of mutual information. We show here that, as the number of trials\nincreases indefinitely, the direct (or ``plug-in'') estimate of marginal\nentropy converges (with probability 1) to the entropy of the time-averaged\nconditional distribution of the response, and the direct estimate of the\nconditional entropy converges to the time-averaged entropy of the conditional\ndistribution of the response. Under joint stationarity and ergodicity of the\nresponse and stimulus, the difference of these quantities converges to the\nmutual information. When the stimulus is deterministic or non-stationary the\ndirect estimate of information no longer estimates mutual information, which is\nno longer meaningful, but it remains a measure of variability of the response\ndistribution across time.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2008 20:13:08 GMT"}, {"version": "v2", "created": "Fri, 18 Jul 2008 23:29:00 GMT"}], "update_date": "2008-07-19", "authors_parsed": [["Vu", "Vincent Q.", ""], ["Yu", "Bin", ""], ["Kass", "Robert E.", ""]]}, {"id": "0806.4161", "submitter": "Erez Persi", "authors": "Erez Persi", "title": "Two Potential Mechanisms of Spatial Attention in Early Visual Areas", "comments": "15 pages, 4 figures, part of this work was presented in the 34th SFN\n  annual meeting (2004)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate theoretically the effect of spatial attention on the\ncontrast-response function (CRF) and orientation-tuning curves in early visual\nareas.We look at a model of a hypercolumn developed recently (Persi et al.,\n2008), that accounts for both the contrast response and tuning properties in\nthe primary visual cortex, and extend it to two visual areas.\n  The effect of spatial attention is studied in a model of two inter-connected\nvisual areas, under two hypothesis that do not necessarily contradict. The\nfirst hypothesis is that attention alters inter-areal feedback synaptic\nstrength, as has been proposed by many previous studies. A second new\nhypothesis is that attention effectively alters single neuron input-output\nproperties. We show that with both mechanisms it is possible to achieve\nattentional effects similarly to those observed in experiments, namely\ncontrast-gain and response-gain effects, while keeping the orientation-tuning\ncurves width approximately contrast-invariant and attention-invariant.\nNevertheless, some differences occur and are discussed. We propose a simple\ntest on existing data based on the second hypothesis.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jun 2008 17:47:32 GMT"}], "update_date": "2008-06-26", "authors_parsed": [["Persi", "Erez", ""]]}, {"id": "0806.4662", "submitter": "Casey Diekman", "authors": "C. O. Diekman, P. S. Sastry, K. P. Unnikrishnan", "title": "On the statistical significance of temporal firing patterns in\n  multi-neuronal spike trains", "comments": "17 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Repeated occurrences of serial firing sequences of a group of neurons with\nfixed time delays between neurons are observed in many experiments involving\nsimultaneous recordings from multiple neurons. Such temporal patterns are\npotentially indicative of underlying microcircuits and it is important to know\nwhen a repeatedly occurring pattern is statistically significant. These\nsequences are typically identified through correlation counts, such as in the\ntwo-tape algorithm of Abeles and Gerstein. In this paper we present a method\nfor deciding on the significance of such correlations by characterizing the\ninfluence of one neuron on another in terms of conditional probabilities and\nspecifying our null hypothesis in terms of a bound on the conditional\nprobabilities. This method of testing significance of correlation counts is\nmore general than the currently available methods since under our null\nhypothesis we do not assume that the spiking processes of different neurons are\nindependent. The structure of our null hypothesis also allows us to rank order\nthe detected patterns in terms of the strength of interaction among the neurons\nconstituting the pattern. We demonstrate our method of assessing significance\non simulated spike trains involving inhomogeneous Poisson processes with strong\ninteractions, where the correlation counts are obtained using the two-tape\nalgorithm.\n", "versions": [{"version": "v1", "created": "Sat, 28 Jun 2008 06:14:58 GMT"}, {"version": "v2", "created": "Mon, 1 Sep 2008 14:45:30 GMT"}], "update_date": "2008-09-01", "authors_parsed": [["Diekman", "C. O.", ""], ["Sastry", "P. S.", ""], ["Unnikrishnan", "K. P.", ""]]}, {"id": "0806.4845", "submitter": "Avni Pllana", "authors": "Avni Pllana, Herbert Bauer", "title": "Localization of Simultaneous Multiple Sources using SMS-LORETA", "comments": "6 pages, 1 figure. From a talk available at\n  http://psychologie.univie.ac.at/index.php?id=184&projektid=7", "journal-ref": null, "doi": null, "report-no": "FWF: P19830-B02", "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a new localization method SMS-LORETA (Simultaneous\nMultiple Sources- Low Resolution Brain Electromagnetic Tomography), capable to\nlocate efficiently multiple simultaneous sources. The new method overcomes some\nof the drawbacks of sLORETA (standardized Low Resolution Brain Electromagnetic\nTomography). The key idea of the new method is the iterative search for current\ndipoles, harnessing the low error single source localization performance of\nsLORETA. An evaluation of the new method by simulation has been enclosed.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2008 10:24:29 GMT"}, {"version": "v2", "created": "Fri, 5 Mar 2010 09:12:46 GMT"}, {"version": "v3", "created": "Thu, 6 Jan 2011 14:33:15 GMT"}], "update_date": "2011-01-07", "authors_parsed": [["Pllana", "Avni", ""], ["Bauer", "Herbert", ""]]}]