[{"id": "1002.0184", "submitter": "Emanuel Diamant", "authors": "Emanuel Diamant", "title": "Some considerations on how the human brain must be arranged in order to\n  make its replication in a thinking machine possible", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the most of my life, I have earned my living as a computer vision\nprofessional busy with image processing tasks and problems. In the computer\nvision community there is a widespread belief that artificial vision systems\nfaithfully replicate human vision abilities or at least very closely mimic\nthem. It was a great surprise to me when one day I have realized that computer\nand human vision have next to nothing in common. The former is occupied with\nextensive data processing, carrying out massive pixel-based calculations, while\nthe latter is busy with meaningful information processing, concerned with smart\nobjects-based manipulations. And the gap between the two is insurmountable. To\nresolve this confusion, I had had to return and revaluate first the vision\nphenomenon itself, define more carefully what visual information is and how to\ntreat it properly. In this work I have not been, as it is usually accepted,\nbiologically inspired . On the contrary, I have drawn my inspirations from a\npure mathematical theory, the Kolmogorov s complexity theory. The results of my\nwork have been already published elsewhere. So the objective of this paper is\nto try and apply the insights gained in course of this my enterprise to a more\ngeneral case of information processing in human brain and the challenging issue\nof human intelligence.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2010 06:05:12 GMT"}], "update_date": "2010-02-02", "authors_parsed": [["Diamant", "Emanuel", ""]]}, {"id": "1002.0299", "submitter": "Adam Barrett DPhil", "authors": "Adam B. Barrett, Lionel Barnett, Anil K. Seth", "title": "Multivariate Granger Causality and Generalized Variance", "comments": "added 1 reference, minor change to discussion, typos corrected; 28\n  pages, 3 figures, 1 table, LaTeX", "journal-ref": "Physical Rev E, Vol 81, 041907 (2010)", "doi": "10.1103/PhysRevE.81.041907", "report-no": null, "categories": "q-bio.NC physics.data-an q-bio.QM stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Granger causality analysis is a popular method for inference on directed\ninteractions in complex systems of many variables. A shortcoming of the\nstandard framework for Granger causality is that it only allows for examination\nof interactions between single (univariate) variables within a system, perhaps\nconditioned on other variables. However, interactions do not necessarily take\nplace between single variables, but may occur among groups, or \"ensembles\", of\nvariables. In this study we establish a principled framework for Granger\ncausality in the context of causal interactions among two or more multivariate\nsets of variables. Building on Geweke's seminal 1982 work, we offer new\njustifications for one particular form of multivariate Granger causality based\non the generalized variances of residual errors. Taken together, our results\nsupport a comprehensive and theoretically consistent extension of Granger\ncausality to the multivariate case. Treated individually, they highlight\nseveral specific advantages of the generalized variance measure, which we\nillustrate using applications in neuroscience as an example. We further show\nhow the measure can be used to define \"partial\" Granger causality in the\nmultivariate context and we also motivate reformulations of \"causal density\"\nand \"Granger autonomy\". Our results are directly applicable to experimental\ndata and promise to reveal new types of functional relations in complex\nsystems, neural and otherwise.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2010 18:31:12 GMT"}, {"version": "v2", "created": "Tue, 13 Apr 2010 17:43:51 GMT"}], "update_date": "2010-04-14", "authors_parsed": [["Barrett", "Adam B.", ""], ["Barnett", "Lionel", ""], ["Seth", "Anil K.", ""]]}, {"id": "1002.0697", "submitter": "Mario Chavez Mr", "authors": "Mario Chavez, Miguel Valencia, Vito Latora and Jacques Martinerie", "title": "Complex networks: new trends for the analysis of brain connectivity", "comments": "Tutorial paper to appear in the Int. J. Bif. Chaos", "journal-ref": "International Journal of Bifurcation and Chaos (IJBC); 20\n  (6):1677-1686 (2010)", "doi": "10.1142/S0218127410026757", "report-no": null, "categories": "physics.data-an nlin.AO physics.bio-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today, the human brain can be studied as a whole. Electroencephalography,\nmagnetoencephalography, or functional magnetic resonance imaging techniques\nprovide functional connectivity patterns between different brain areas, and\nduring different pathological and cognitive neuro-dynamical states. In this\nTutorial we review novel complex networks approaches to unveil how brain\nnetworks can efficiently manage local processing and global integration for the\ntransfer of information, while being at the same time capable of adapting to\nsatisfy changing neural demands.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2010 10:43:55 GMT"}], "update_date": "2011-01-21", "authors_parsed": [["Chavez", "Mario", ""], ["Valencia", "Miguel", ""], ["Latora", "Vito", ""], ["Martinerie", "Jacques", ""]]}, {"id": "1002.2251", "submitter": "Steve Yaeli", "authors": "Steve Yaeli, Ron Meir", "title": "MSE-based analysis of optimal tuning functions predicts phenomena\n  observed in sensory neurons", "comments": "Submitted to Frontiers in Computational Neuroscience", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological systems display impressive capabilities in effectively responding\nto environmental signals in real time. There is increasing evidence that\norganisms may indeed be employing near optimal Bayesian calculations in their\ndecision-making. An intriguing question relates to the properties of optimal\nencoding methods, namely determining the properties of neural populations in\nsensory layers that optimize performance, subject to physiological constraints.\nWithin an ecological theory of neural encoding/decoding, we show that optimal\nBayesian performance requires neural adaptation which reflects environmental\nchanges. Specifically, we predict that neuronal tuning functions possess an\noptimal width, which increases with prior uncertainty and environmental noise,\nand decreases with the decoding time window. Furthermore, even for static\nstimuli, we demonstrate that dynamic sensory tuning functions, acting at\nrelatively short time scales, lead to improved performance. Interestingly, the\nnarrowing of tuning functions as a function of time was recently observed in\nseveral biological systems. Such results set the stage for a functional theory\nwhich may explain the high reliability of sensory systems, and the utility of\nneuronal adaptation occurring at multiple time scales.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2010 15:39:20 GMT"}], "update_date": "2010-02-12", "authors_parsed": [["Yaeli", "Steve", ""], ["Meir", "Ron", ""]]}, {"id": "1002.2892", "submitter": "Kenneth Segall", "authors": "Patrick Crotty, Daniel Schult, Ken Segall (Colgate University)", "title": "Josephson junction simulation of neurons", "comments": "10 Pages, 9 figures. Submitted to Physical Review E", "journal-ref": null, "doi": "10.1103/PhysRevE.82.011914", "report-no": null, "categories": "cond-mat.supr-con cond-mat.dis-nn physics.bio-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the goal of understanding the intricate behavior and dynamics of\ncollections of neurons, we present superconducting circuits containing\nJosephson junctions that model biologically realistic neurons. These \"Josephson\njunction neurons\" reproduce many characteristic behaviors of biological neurons\nsuch as action potentials, refractory periods, and firing thresholds. They can\nbe coupled together in ways that mimic electrical and chemical synapses. Using\nexisting fabrication technologies, large interconnected networks of Josephson\njunction neurons would operate fully in parallel. They would be orders of\nmagnitude faster than both traditional computer simulations and biological\nneural networks. Josephson junction neurons provide a new tool for exploring\nlong-term large-scale dynamics for networks of neurons.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2010 15:21:08 GMT"}, {"version": "v2", "created": "Tue, 23 Feb 2010 15:26:50 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Crotty", "Patrick", "", "Colgate University"], ["Schult", "Daniel", "", "Colgate University"], ["Segall", "Ken", "", "Colgate University"]]}, {"id": "1002.3035", "submitter": "Claudius Gros", "authors": "Claudius Gros", "title": "Cognition and Emotion: Perspectives of a Closing Gap", "comments": "A review. Cognitive Computation (in press)", "journal-ref": "Cognitive Computation 2, 78 (2010)", "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The primary tasks of a cognitive system is to survive and to maximize a\nlife-long utility function, like the number of offsprings. A direct\ncomputational maximization of life-long utility is however not possible in\ncomplex environments, especially in the context, of real-world time\nconstraints. The central role of emotions is to serve as an intermediate layer\nin the space of policies available to agents and animals, leading to a large\ndimensional reduction of complexity.\n  We review our current understanding of the functional role of emotions,\nstressing the role of the neuromodulators mediating emotions for the diffusive\nhomeostatic control system of the brain. We discuss a recent proposal, that\nemotional diffusive control is characterized, in contrast to neutral diffusive\ncontrol, by interaction effects, viz by interferences between emotional arousal\nand reward signaling. Several proposals for the realization of synthetic\nemotions are discussed in this context, together with key open issues regarding\nthe interplay between emotional motivational drives and diffusive control.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2010 09:06:58 GMT"}], "update_date": "2010-05-25", "authors_parsed": [["Gros", "Claudius", ""]]}, {"id": "1002.3275", "submitter": "Bruno. Cessac", "authors": "B. Cessac", "title": "A discrete time neural network model with spiking neurons II. Dynamics\n  with noise", "comments": "43 pages - revised version - to appear il Journal of Mathematical\n  Biology", "journal-ref": "Journal of Mathematical Biology: Volume 62, Issue 6 (2011), Page\n  863", "doi": "10.1007/s00285-010-0358-4", "report-no": null, "categories": "math.DS math.PR physics.bio-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide rigorous and exact results characterizing the statistics of spike\ntrains in a network of leaky integrate and fire neurons, where time is discrete\nand where neurons are submitted to noise, without restriction on the synaptic\nweights. We show the existence and uniqueness of an invariant measure of Gibbs\ntype and discuss its properties. We also discuss Markovian approximations and\nrelate them to the approaches currently used in computational neuroscience to\nanalyse experimental spike trains statistics.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2010 14:16:06 GMT"}, {"version": "v2", "created": "Mon, 12 Jul 2010 14:49:05 GMT"}, {"version": "v3", "created": "Thu, 12 Aug 2010 08:09:18 GMT"}], "update_date": "2011-05-18", "authors_parsed": [["Cessac", "B.", ""]]}, {"id": "1002.3552", "submitter": "Caglar Tuncay", "authors": "Caglar Tuncay", "title": "Entropy analyses of spatiotemporal synchronizations in brain signals\n  from patients with focal epilepsies", "comments": "30 pages 25 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph physics.data-an q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The electroencephalographic (EEG) data intracerebrally recorded from 20\nepileptic humans with different brain origins of focal epilepsies or types of\nseizures, ages and sexes are investigated (nearly 700 million data). Multi\nchannel univariate amplitude analyses are performed and it is shown that time\ndependent Shannon entropies can be used to predict focal epileptic seizure\nonsets in different epileptogenic brain zones of different patients. Formations\nor time evolutions of the synchronizations in the brain signals from\nepileptogenic or non epileptogenic areas of the patients in ictal interval or\ninter-ictal interval are further investigated employing spatial or temporal\ndifferences of the entropies.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2010 15:56:39 GMT"}], "update_date": "2010-02-19", "authors_parsed": [["Tuncay", "Caglar", ""]]}, {"id": "1002.3798", "submitter": "Moritz Deger", "authors": "Moritz Deger, Moritz Helias, Stefano Cardanobile, Fatihcan M. Atay and\n  Stefan Rotter", "title": "Non-equilibrium dynamics of stochastic point processes with\n  refractoriness", "comments": "8 pages, 4 figures", "journal-ref": "Phys Rev E 82, 021129 (2010)", "doi": "10.1103/PhysRevE.82.021129", "report-no": null, "categories": "math.PR q-bio.NC stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic point processes with refractoriness appear frequently in the\nquantitative analysis of physical and biological systems, such as the\ngeneration of action potentials by nerve cells, the release and reuptake of\nvesicles at a synapse, and the counting of particles by detector devices. Here\nwe present an extension of renewal theory to describe ensembles of point\nprocesses with time varying input. This is made possible by a representation in\nterms of occupation numbers of two states: Active and refractory. The dynamics\nof these occupation numbers follows a distributed delay differential equation.\nIn particular, our theory enables us to uncover the effect of refractoriness on\nthe time-dependent rate of an ensemble of encoding point processes in response\nto modulation of the input. We present exact solutions that demonstrate generic\nfeatures, such as stochastic transients and oscillations in the step response\nas well as resonances, phase jumps and frequency doubling in the transfer of\nperiodic signals. We show that a large class of renewal processes can indeed be\nregarded as special cases of the model we analyze. Hence our approach\nrepresents a widely applicable framework to define and analyze non-stationary\nrenewal processes.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2010 18:57:47 GMT"}, {"version": "v2", "created": "Sat, 8 May 2010 09:02:08 GMT"}, {"version": "v3", "created": "Thu, 24 Jun 2010 05:17:10 GMT"}], "update_date": "2015-07-28", "authors_parsed": [["Deger", "Moritz", ""], ["Helias", "Moritz", ""], ["Cardanobile", "Stefano", ""], ["Atay", "Fatihcan M.", ""], ["Rotter", "Stefan", ""]]}, {"id": "1002.4368", "submitter": "Alexei Koulakov", "authors": "Alexei A. Koulakov", "title": "On the scaling law for cortical magnification factor", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Primate visual system samples different parts of the world unevenly. The part\nof the visual scene corresponding to the eye center is represented densely,\nwhile away from the center the sampling becomes progressively sparser. Such\ndistribution allows a more effective use of the limited transfer rate of the\noptic nerve, since animals can aim area centralis (AC) at the relevant position\nin the scene by performing saccadic eye movements. To locate a new saccade\ntarget the animal has to sample the corresponding region of the visual scene,\naway from AC. In this work we derive the sampling density away from AC, which\noptimizes the trajectory of saccadic eye movements. We obtain the scaling law\nfor the sampling density as a function of eccentricity, which results from the\nevolutionary pressure to locate the target in the shortest time under the\nconstraint of limited transfer rate of the optic nerve. In case of very small\nAC the visual scene is optimally represented by logarithmic conformal mapping,\nin which geometrically similar circular bands around AC are equally represented\nby the visual system. We also obtain corrections to the logarithmic scaling for\nthe case of a larger AC and compare them to experimental findings.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2010 18:25:00 GMT"}], "update_date": "2010-02-24", "authors_parsed": [["Koulakov", "Alexei A.", ""]]}, {"id": "1002.4583", "submitter": "Dima Shepelyansky L", "authors": "D.L.Shepelyansky and O.V.Zhirov (CNRS, Toulouse & BINP, Novosibirsk)", "title": "Towards Google matrix of brain", "comments": "revtex 5 pages, 7 figs, data added, research at\n  http://www.quantware.ups-tlse.fr", "journal-ref": "Phys. Lett. A v.374, p.3206-3209 (2010)", "doi": "10.1016/j.physleta.2010.06.007", "report-no": null, "categories": "cond-mat.dis-nn cs.NI nlin.AO physics.soc-ph q-bio.NC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply the approach of the Google matrix, used in computer science and\nWorld Wide Web, to description of properties of neuronal networks. The Google\nmatrix ${\\bf G}$ is constructed on the basis of neuronal network of a brain\nmodel discussed in PNAS {\\bf 105}, 3593 (2008). We show that the spectrum of\neigenvalues of ${\\bf G}$ has a gapless structure with long living relaxation\nmodes. The PageRank of the network becomes delocalized for certain values of\nthe Google damping factor $\\alpha$. The properties of other eigenstates are\nalso analyzed. We discuss further parallels and similarities between the World\nWide Web and neuronal networks.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2010 17:03:03 GMT"}, {"version": "v2", "created": "Sat, 1 May 2010 11:59:59 GMT"}], "update_date": "2010-07-12", "authors_parsed": [["Shepelyansky", "D. L.", "", "CNRS, Toulouse & BINP, Novosibirsk"], ["Zhirov", "O. V.", "", "CNRS, Toulouse & BINP, Novosibirsk"]]}, {"id": "1002.4835", "submitter": "Jesus Gomez-Gardenes", "authors": "Jesus Gomez-Gardenes, Gorka Zamora-Lopez, Yamir Moreno, Alex Arenas", "title": "From modular to centralized organization of synchronization in\n  functional areas of the cat cerebral cortex", "comments": "24 pages, 8 figures. Final version published in PLoS One", "journal-ref": "PLoS ONE 5, e12313 (2010)", "doi": "10.1371/journal.pone.0012313", "report-no": null, "categories": "q-bio.NC nlin.AO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent studies have pointed out the importance of transient synchronization\nbetween widely distributed neural assemblies to understand conscious\nperception. These neural assemblies form intricate networks of neurons and\nsynapses whose detailed map for mammals is still unknown and far from our\nexperimental capabilities. Only in a few cases, for example the C. elegans, we\nknow the complete mapping of the neuronal tissue or its mesoscopic level of\ndescription provided by cortical areas. Here we study the process of transient\nand global synchronization using a simple model of phase-coupled oscillators\nassigned to cortical areas in the cerebral cat cortex. Our results highlight\nthe impact of the topological connectivity in the developing of\nsynchronization, revealing a transition in the synchronization organization\nthat goes from a modular decentralized coherence to a centralized synchronized\nregime controlled by a few cortical areas forming a Rich-Club connectivity\npattern.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2010 17:21:58 GMT"}, {"version": "v2", "created": "Sat, 6 Nov 2010 11:59:27 GMT"}], "update_date": "2010-11-09", "authors_parsed": [["Gomez-Gardenes", "Jesus", ""], ["Zamora-Lopez", "Gorka", ""], ["Moreno", "Yamir", ""], ["Arenas", "Alex", ""]]}, {"id": "1002.4903", "submitter": "Alexei Koulakov", "authors": "Alexei A. Koulakov and Dmitry Rinberg", "title": "Sparse incomplete representations: A novel role for olfactory granule\n  cells", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mitral cells of the olfactory bulb form sparse representations of the\nodorants and transmit this information to the cortex. The olfactory code\ncarried by the mitral cells is sparser than the inputs that they receive. In\nthis study we analyze the mechanisms and functional significance of sparse\nolfactory codes. We consider a model of olfactory bulb containing populations\nof excitatory mitral and inhibitory granule cells. We argue that sparse codes\nmay emerge as a result of self organization in the network leading to the\nprecise balance between mitral cells' excitatory inputs and inhibition provided\nby the granule cells. We propose a novel role for the olfactory granule cells.\nWe show that these cells can build representations of odorant stimuli that are\nnot fully accurate. Due to the incompleteness in the granule cell\nrepresentation, the exact excitation-inhibition balance is established only for\nsome mitral cells leading to sparse responses of the mitral cell. Our model\nsuggests a functional significance to the dendrodendritic synapses that mediate\ninteractions between mitral and granule cells. The model accounts for the\nsparse olfactory code in the steady state and predicts that transient dynamics\nmay be less sparse.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2010 00:33:16 GMT"}], "update_date": "2010-03-01", "authors_parsed": [["Koulakov", "Alexei A.", ""], ["Rinberg", "Dmitry", ""]]}]