[{"id": "1107.1160", "submitter": "Jean-Marc Luck", "authors": "A. Mehta and J.M. Luck", "title": "Power-law forgetting in synapses with metaplasticity", "comments": "31 pages, 17 figures. A few updates and other minor changes", "journal-ref": "J. Stat. Mech. (2011) P09025", "doi": "10.1088/1742-5468/2011/09/P09025", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The idea of using metaplastic synapses to incorporate the separate storage of\nlong- and short-term memories via an array of hidden states was put forward in\nthe cascade model of Fusi et al. In this paper, we devise and investigate two\nmodels of a metaplastic synapse based on these general principles. The main\ndifference between the two models lies in their available mechanisms of decay,\nwhen a contrarian event occurs after the build-up of a long-term memory. In one\ncase, this leads to the conversion of the long-term memory to a short-term\nmemory of the opposite kind, while in the other, a long-term memory of the\nopposite kind may be generated as a result. Appropriately enough, the response\nof both models to short-term events is not affected by this difference in\narchitecture. On the contrary, the transient response of both models, after\nlong-term memories have been created by the passage of sustained signals, is\nrather different. The asymptotic behaviour of both models is, however,\ncharacterised by power-law forgetting with the same universal exponent.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2011 15:29:30 GMT"}, {"version": "v2", "created": "Fri, 23 Sep 2011 12:11:35 GMT"}], "update_date": "2011-09-26", "authors_parsed": [["Mehta", "A.", ""], ["Luck", "J. M.", ""]]}, {"id": "1107.1621", "submitter": "Gaurang Mahajan", "authors": "Gaurang Mahajan, Anita Mehta", "title": "Competing synapses with two timescales: a basis for learning and\n  forgetting", "comments": "7 pages, 3 figures, to appear in Europhysics Letters", "journal-ref": null, "doi": "10.1209/0295-5075/95/48008", "report-no": null, "categories": "cond-mat.dis-nn nlin.AO q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Competitive dynamics are thought to occur in many processes of learning\ninvolving synaptic plasticity. Here we show, in a game theory-inspired model of\nsynaptic interactions, that the competition between synapses in their weak and\nstrong states gives rise to a natural framework of learning, with the\nprediction of memory inherent in a timescale for `forgetting' a learned signal.\nAmong our main results is the prediction that memory is optimized if the weak\nsynapses are really weak, and the strong synapses are really strong. Our work\nadmits of many extensions and possible experiments to test its validity, and in\nparticular might complement an existing model of reaching, which has strong\nexperimental support.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jul 2011 13:03:41 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Mahajan", "Gaurang", ""], ["Mehta", "Anita", ""]]}, {"id": "1107.2521", "submitter": "Valmir Barbosa", "authors": "Andre Nathan, Valmir C. Barbosa", "title": "Network algorithmics and the emergence of synchronization in cortical\n  models", "comments": "Presentation improved", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When brain signals are recorded in an electroencephalogram or some similar\nlarge-scale record of brain activity, oscillatory patterns are typically\nobserved that are thought to reflect the aggregate electrical activity of the\nunderlying neuronal ensemble. Although it now seems that such patterns\nparticipate in feedback loops both temporally with the neurons' spikes and\nspatially with other brain regions, the mechanisms that might explain the\nexistence of such loops have remained essentially unknown. Here we present a\ntheoretical study of these issues on a cortical model we introduced earlier\n[Nathan A, Barbosa VC (2010) Network algorithmics and the emergence of the\ncortical synaptic-weight distribution. Phys Rev E 81: 021916]. We start with\nthe definition of two synchronization measures that aim to capture the\nsynchronization possibilities offered by the model regarding both the overall\nspiking activity of the neurons and the spiking activity that causes the\nimmediate firing of the postsynaptic neurons. We present computational results\non our cortical model, on a model that is random in the Erd\\H{o}s-R\\'enyi\nsense, and on a structurally deterministic model. We have found that the\nalgorithmic component underlying our cortical model ultimately provides,\nthrough the two synchronization measures, a strong quantitative basis for the\nemergence of both types of synchronization in all cases. This, in turn, may\nexplain the rise both of temporal feedback loops in the neurons' combined\nelectrical activity and of spatial feedback loops as brain regions that are\nspatially separated engage in rhythmic behavior.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jul 2011 10:59:42 GMT"}, {"version": "v2", "created": "Fri, 22 Jul 2011 13:31:09 GMT"}, {"version": "v3", "created": "Sat, 1 Jun 2013 14:49:02 GMT"}], "update_date": "2013-06-04", "authors_parsed": [["Nathan", "Andre", ""], ["Barbosa", "Valmir C.", ""]]}, {"id": "1107.2834", "submitter": "John Burke", "authors": "John Burke, Mathieu Desroches, Anna M. Barry, Tasso J. Kaper, and Mark\n  A. Kramer", "title": "A showcase of torus canards in neuronal bursters", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rapid action potential generation --- spiking --- and alternating intervals\nof spiking and quiescence --- bursting --- are two dynamic patterns observed in\nneuronal activity. In computational models of neuronal systems, the transition\nfrom spiking to bursting often exhibits complex bifurcation structure. One type\nof transition involves the torus canard, which was originally observed in a\nsimple biophysical model of a Purkinje cell. In this article, we expand on that\noriginal result by showing that torus canards arise in a broad array of\nwell-known computational neuronal models with three different classes of\nbursting dynamics: sub-Hopf/fold cycle bursting, circle/fold cycle bursting,\nand fold/fold cycle bursting. The essential features that these models share\nare multiple time scales leading naturally to decomposition into slow and fast\nsystems, a saddle-node of periodic orbits in the fast system, and a torus\nbifurcation in the full system. We show that the transition from spiking to\nbursting in each model system is given by an explosion of torus canards. Based\non these examples, as well as on emerging theory, we propose that torus canards\nare a common dynamic phenomenon separating the regimes of spiking and bursting\nactivity.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jul 2011 14:14:29 GMT"}], "update_date": "2011-07-15", "authors_parsed": [["Burke", "John", ""], ["Desroches", "Mathieu", ""], ["Barry", "Anna M.", ""], ["Kaper", "Tasso J.", ""], ["Kramer", "Mark A.", ""]]}, {"id": "1107.3111", "submitter": "Alberto Bernacchia Ph.D.", "authors": "Alberto Bernacchia and Xiao-Jing Wang", "title": "Decorrelation by recurrent inhibition in heterogeneous neural circuits", "comments": "31 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The activity of neurons is correlated, and this correlation affects how the\nbrain processes information. We study the neural circuit mechanisms of\ncorrelations by analyzing a network model characterized by strong and\nheterogeneous interactions: excitatory input drives the fluctuations of neural\nactivity, which are counterbalanced by inhibitory feedback. In particular,\nexcitatory input tends to correlate neurons, while inhibitory feedback reduces\ncorrelations. We demonstrate that heterogeneity of synaptic connections is\nnecessary for this inhibition of correlations. We calculate statistical\naverages over the disordered synaptic interactions, and we apply our findings\nto both a simple linear model and to a more realistic spiking network model. We\nfind that correlations at zero time-lag are positive and of magnitude K^{-1/2},\nwhere K is the number of connections to a neuron. Correlations at longer\ntimescales are of smaller magnitude, of order K^{-1}, implying that inhibition\nof correlations occurs quickly, on a timescale of K^{-1/2}. The small magnitude\nof correlations agrees qualitatively with physiological measurements in the\nCerebral Cortex and Basal Ganglia. The model could be used to study\ncorrelations in brain regions dominated by recurrent inhibition, such as the\nStriatum and Globus Pallidus.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jul 2011 17:20:20 GMT"}, {"version": "v2", "created": "Fri, 19 Aug 2011 15:28:41 GMT"}, {"version": "v3", "created": "Tue, 15 Nov 2011 22:07:02 GMT"}, {"version": "v4", "created": "Fri, 30 Nov 2012 20:55:08 GMT"}], "update_date": "2012-12-03", "authors_parsed": [["Bernacchia", "Alberto", ""], ["Wang", "Xiao-Jing", ""]]}, {"id": "1107.3410", "submitter": "Kseniia Kravchuk", "authors": "Alexander K. Vidybida and Kseniya G. Kravchuk", "title": "Firing statistics of inhibitory neuron with delayed feedback. I. Output\n  ISI probability density", "comments": "23 pages, 8 figures", "journal-ref": "BioSystems 112 (2013) 224-232", "doi": "10.1016/j.biosystems.2012.12.006", "report-no": null, "categories": "q-bio.NC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Activity of inhibitory neuron with delayed feedback is considered in the\nframework of point stochastic processes. The neuron receives excitatory input\nimpulses from a Poisson stream, and inhibitory impulses from the feedback line\nwith a delay. We investigate here, how does the presence of inhibitory feedback\naffect the output firing statistics. Using binding neuron (BN) as a model, we\nderive analytically the exact expressions for the output interspike intervals\n(ISI) probability density, mean output ISI and coefficient of variation as\nfunctions of model's parameters for the case of threshold 2. Using the leaky\nintegrate-and-fire (LIF) model, as well as the BN model with higher thresholds,\nthese statistical quantities are found numerically. In contrast to the\npreviously studied situation of no feedback, the ISI probability densities\nfound here both for BN and LIF neuron become bimodal and have discontinuity of\njump type. Nevertheless, the presence of inhibitory delayed feedback was not\nfound to affect substantially the output ISI coefficient of variation. The ISI\ncoefficient of variation found ranges between 0.5 and 1. It is concluded that\nintroduction of delayed inhibitory feedback can radically change neuronal\noutput firing statistics. This statistics is as well distinct from what was\nfound previously (Vidybida & Kravchuk, 2009) by a similar method for excitatory\nneuron with delayed feedback.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 12:05:31 GMT"}, {"version": "v2", "created": "Mon, 9 Sep 2013 11:53:34 GMT"}], "update_date": "2013-09-10", "authors_parsed": [["Vidybida", "Alexander K.", ""], ["Kravchuk", "Kseniya G.", ""]]}, {"id": "1107.3443", "submitter": "Henry Tuckwell", "authors": "Henry C Tuckwell", "title": "Quantitative aspects of L-type calcium currents", "comments": "92 pages 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Calcium currents in neurons and muscle cells have been classified as being\none of 5 types of which four, L, N, P/Q and R were said to be high threshold\nand one, T, was designated low threshold. This review focuses on quantitative\naspects of L-type currents. L-type channels are now distinguished according to\ntheir structure as one of four main subtypes 1.1-1.4. L-type calcium currents\nplay many fundamental roles in cellular dynamical processes including\npacemaking in neurons and cardiac cells, the activation of transcription\nfactors involved in synaptic plasticity and in immune cells. The\nhalf-activation potentials of L-type currents have been ascribed values as low\nas -50 mV and as high as near 0 mV. The inactivation of I_L has been found to\nbe both voltage (VDI) and calcium-dependent (CDI) and the latter component may\ninvolve calcium-induced calcium release. CDI is often an important aspect of\ndynamical models of cell electrophysiology. We describe the basic components in\nmodeling I_L including activation and both voltage and calcium dependent\ninactivation and the two main approaches to determining the current. We review,\nby means of tables of values from over 65 representative studies, the various\ndetails of the dynamical properties associated with I_L that have been found\nexperimentally or employed in the last 25 years in deterministic modeling in\nvarious nervous system and cardiac cells. Distributions and statistics of\nseveral parameters related to activation and inactivation are obtained. There\nare few reliable experimental data on L-type calcium current kinetics for cells\nat physiological calcium ion concentrations. Neurons are divided approximately\ninto two groups with experimental half-activation potentials.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 14:14:09 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Tuckwell", "Henry C", ""]]}, {"id": "1107.3450", "submitter": "Henry Tuckwell", "authors": "Nicholas J Penington, Henry C Tuckwell", "title": "Properties of IA in a serotonergic neuron of the dorsal raphe nucleus", "comments": "16 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Voltage clamp data were analyzed in order to characterize the properties of\nthe fast potassium transient current IA for a serotonergic neuron of the rat\ndorsal raphe nucleus (DRN). We obtain maximal conductance, time constants of\nactivation and inactivation, and the steady state activation and inactivation\nfunctions, as Boltzmann curves, defined by half-activation potentials and slope\nfactors. We employ a novel method to accurately obtain the activation function\nand compare the results with those obtained by other methods. The form of IA is\nestimated as g(V-V_{rev}) m^4h with g=20.5 nS. For activation, the\nhalf-activation potential is V_a=-52.5 mV with slope factor k_a=16.5 mV,\nwhereas for inactivation the corresponding quantities are -91.5 mV and -9.3 mV.\nWe discuss the results in terms of the corresponding properties of \\IA in other\ncell types and their possible relevance to pacemaking activity in 5-HT cells of\nthe DRN.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 14:36:01 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Penington", "Nicholas J", ""], ["Tuckwell", "Henry C", ""]]}, {"id": "1107.3911", "submitter": "Christoph Feenders (n\\'e Echtermeyer)", "authors": "Christoph Echtermeyer, Cheol E. Han, Anna Rotarska-Jagiela, Harald\n  Mohr, Peter J. Uhlhaas, Marcus Kaiser", "title": "Integrating temporal and spatial scales: Human structural network motifs\n  across age and region-of-interest size", "comments": "31 pages, 8 figures; Front. Neuroinform. 5:10 (2011)", "journal-ref": null, "doi": "10.3389/fninf.2011.00010", "report-no": null, "categories": "physics.bio-ph physics.soc-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human brain networks can be characterized at different temporal or spatial\nscales given by the age of the subject or the spatial resolution of the\nneuroimaging method. Integration of data across scales can only be successful\nif the combined networks show a similar architecture. One way to compare\nnetworks is to look at spatial features, based on fibre length, and topological\nfeatures of individual nodes where outlier nodes form single node motifs whose\nfrequency yields a fingerprint of the network. Here, we observe how\ncharacteristic single node motifs change over age (12-23 years) and network\nsize (414, 813, and 1615 nodes) for diffusion tensor imaging (DTI) structural\nconnectivity in healthy human subjects. First, we find the number and diversity\nof motifs in a network to be strongly correlated. Second, comparing different\nscales, the number and diversity of motifs varied across the temporal (subject\nage) and spatial (network resolution) scale: certain motifs might only occur at\none spatial scale or for a certain age range. Third, regions of interest which\nshow one motif at a lower resolution may show a range of motifs at a higher\nresolution which may or may not include the original motif at the lower\nresolution. Therefore, both the type and localisation of motifs differ for\ndifferent spatial resolutions. Our results also indicate that spatial\nresolution has a higher effect on topological measures whereas spatial\nmeasures, based on fibre lengths, remain more comparable between resolutions.\nTherefore, spatial resolution is crucial when comparing characteristic node\nfingerprints given by topological and spatial network features. As node motifs\nare based on topological and spatial properties of brain connectivity networks,\nthese conclusions are also relevant to other studies using connectome analysis.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jul 2011 07:31:28 GMT"}], "update_date": "2011-07-21", "authors_parsed": [["Echtermeyer", "Christoph", ""], ["Han", "Cheol E.", ""], ["Rotarska-Jagiela", "Anna", ""], ["Mohr", "Harald", ""], ["Uhlhaas", "Peter J.", ""], ["Kaiser", "Marcus", ""]]}, {"id": "1107.4228", "submitter": "Yuriy Mishchencko", "authors": "Yuriy Mishchencko, Joshua T. Vogelstein, Liam Paninski", "title": "A Bayesian approach for inferring neuronal connectivity from calcium\n  fluorescent imaging data", "comments": "Published in at http://dx.doi.org/10.1214/09-AOAS303 the Annals of\n  Applied Statistics (http://www.imstat.org/aoas/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Statistics 2011, Vol. 5, No. 2B, 1229-1261", "doi": "10.1214/09-AOAS303", "report-no": "IMS-AOAS-AOAS303", "categories": "stat.AP q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deducing the structure of neural circuits is one of the central problems of\nmodern neuroscience. Recently-introduced calcium fluorescent imaging methods\npermit experimentalists to observe network activity in large populations of\nneurons, but these techniques provide only indirect observations of neural\nspike trains, with limited time resolution and signal quality. In this work we\npresent a Bayesian approach for inferring neural circuitry given this type of\nimaging data. We model the network activity in terms of a collection of coupled\nhidden Markov chains, with each chain corresponding to a single neuron in the\nnetwork and the coupling between the chains reflecting the network's\nconnectivity matrix. We derive a Monte Carlo Expectation--Maximization\nalgorithm for fitting the model parameters; to obtain the sufficient statistics\nin a computationally-efficient manner, we introduce a specialized\nblockwise-Gibbs algorithm for sampling from the joint activity of all observed\nneurons given the observed fluorescence data. We perform large-scale\nsimulations of randomly connected neuronal networks with biophysically\nrealistic parameters and find that the proposed methods can accurately infer\nthe connectivity in these networks given reasonable experimental and\ncomputational constraints. In addition, the estimation accuracy may be improved\nsignificantly by incorporating prior knowledge about the sparseness of\nconnectivity in the network, via standard L$_1$ penalization methods.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2011 10:33:59 GMT"}], "update_date": "2011-07-22", "authors_parsed": [["Mishchencko", "Yuriy", ""], ["Vogelstein", "Joshua T.", ""], ["Paninski", "Liam", ""]]}, {"id": "1107.4572", "submitter": "Dante Chialvo", "authors": "Enzo Tagliazucchi, Pablo Balenzuela, Daniel Fraiman, Dante R. Chialvo", "title": "Point process analysis of large-scale brain fMRI dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Functional magnetic resonance imaging (fMRI) techniques have contributed\nsignificantly to our understanding of brain function. Current methods are based\non the analysis of \\emph{gradual and continuous} changes in the brain blood\noxygenated level dependent (BOLD) signal. Departing from that approach, recent\nwork has shown that equivalent results can be obtained by inspecting only the\nrelatively large amplitude BOLD signal peaks, suggesting that relevant\ninformation can be condensed in \\emph{discrete} events. This idea is further\nexplored here to demonstrate how brain dynamics at resting state can be\ncaptured just by the timing and location of such events, i.e., in terms of a\nspatiotemporal point process. As a proof of principle, we show that the resting\nstate networks (RSN) maps can be extracted from such point processes.\nFurthermore, the analysis uncovers avalanches of activity which are ruled by\nthe same dynamical and statistical properties described previously for neuronal\nevents at smaller scales. Given the demonstrated functional relevance of the\nresting state brain dynamics, its representation as a discrete process might\nfacilitate large scale analysis of brain function both in health and disease.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2011 16:52:47 GMT"}], "update_date": "2011-07-25", "authors_parsed": [["Tagliazucchi", "Enzo", ""], ["Balenzuela", "Pablo", ""], ["Fraiman", "Daniel", ""], ["Chialvo", "Dante R.", ""]]}, {"id": "1107.5124", "submitter": "Shivendra Tewari", "authors": "Shivendra Tewari and Kaushik Majumdar", "title": "A Mathematical model for Astrocytes mediated LTP at Single Hippocampal\n  Synapses", "comments": "51 pages, 15 figures, Journal of Computational Neuroscience (to\n  appear)", "journal-ref": null, "doi": "10.1007/s10827-012-0389-5", "report-no": null, "categories": "q-bio.NC math.DS q-bio.CB q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many contemporary studies have shown that astrocytes play a significant role\nin modulating both short and long form of synaptic plasticity. There are very\nfew experimental models which elucidate the role of astrocyte over Long-term\nPotentiation (LTP). Recently, Perea & Araque (2007) demonstrated a role of\nastrocytes in induction of LTP at single hippocampal synapses. They suggested a\npurely pre-synaptic basis for induction of this N-methyl-D- Aspartate (NMDA)\nReceptor-independent LTP. Also, the mechanisms underlying this pre-synaptic\ninduction were not investigated. Here, in this article, we propose a\nmathematical model for astrocyte modulated LTP which successfully emulates the\nexperimental findings of Perea & Araque (2007). Our study suggests the role of\nretrograde messengers, possibly Nitric Oxide (NO), for this pre-synaptically\nmodulated LTP.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2011 06:23:36 GMT"}, {"version": "v2", "created": "Sun, 4 Dec 2011 18:24:52 GMT"}, {"version": "v3", "created": "Thu, 23 Feb 2012 01:52:50 GMT"}, {"version": "v4", "created": "Mon, 12 Mar 2012 14:02:54 GMT"}], "update_date": "2012-06-05", "authors_parsed": [["Tewari", "Shivendra", ""], ["Majumdar", "Kaushik", ""]]}, {"id": "1107.5872", "submitter": "Robert E. Kass", "authors": "Robert E. Kass, Ryan C. Kelly, Wei-Liem Loh", "title": "Assessment of synchrony in multiple neural spike trains using loglinear\n  point process models", "comments": "Published in at http://dx.doi.org/10.1214/10-AOAS429 the Annals of\n  Applied Statistics (http://www.imstat.org/aoas/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Statistics 2011, Vol. 5, No. 2B, 1262-1292", "doi": "10.1214/10-AOAS429", "report-no": "IMS-AOAS-AOAS429", "categories": "stat.AP q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural spike trains, which are sequences of very brief jumps in voltage\nacross the cell membrane, were one of the motivating applications for the\ndevelopment of point process methodology. Early work required the assumption of\nstationarity, but contemporary experiments often use time-varying stimuli and\nproduce time-varying neural responses. More recently, many statistical methods\nhave been developed for nonstationary neural point process data. There has also\nbeen much interest in identifying synchrony, meaning events across two or more\nneurons that are nearly simultaneous at the time scale of the recordings. A\nnatural statistical approach is to discretize time, using short time bins, and\nto introduce loglinear models for dependency among neurons, but previous use of\nloglinear modeling technology has assumed stationarity. We introduce a succinct\nyet powerful class of time-varying loglinear models by (a) allowing\nindividual-neuron effects (main effects) to involve time-varying intensities;\n(b) also allowing the individual-neuron effects to involve autocovariation\neffects (history effects) due to past spiking, (c) assuming excess synchrony\neffects (interaction effects) do not depend on history, and (d) assuming all\neffects vary smoothly across time.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jul 2011 05:18:38 GMT"}], "update_date": "2011-08-01", "authors_parsed": [["Kass", "Robert E.", ""], ["Kelly", "Ryan C.", ""], ["Loh", "Wei-Liem", ""]]}]