[{"id": "1203.0441", "submitter": "Monica De Angelis", "authors": "M.De Angelis, P. Renno", "title": "Existence, uniqueness and a priori estimates for a non linear\n  integro-differential equation", "comments": null, "journal-ref": "Ricerche mat. 57 p. 95-109 (2008)", "doi": "10.1007/S11587(08)0028-7", "report-no": null, "categories": "math-ph cond-mat.dis-nn cond-mat.supr-con math.MP q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper deals with the explicit calculus and the properties of the\nfundamental solution K of a parabolic operator related to a semilinear equation\nthat models reaction diffusion systems with excitable kinetics. The initial\nvalue problem in all of the space is analyzed together with continuous\ndependence and a priori estimates of the solution. These estimates show that\nthe asymptotic behavior is determined by the reaction mechanism. Moreover it's\npossible a rigorous singular perturbation analysis for discussing travelling\nwaves with their characteristic times.\n", "versions": [{"version": "v1", "created": "Fri, 2 Mar 2012 12:22:12 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["De Angelis", "M.", ""], ["Renno", "P.", ""]]}, {"id": "1203.0448", "submitter": "Monica De Angelis", "authors": "Monica De Angelis", "title": "On a Model of Superconductivity and Biology", "comments": null, "journal-ref": "Advances and Appications in Mathematical Sciences, vol 7, Issue 1,\n  2010, pages 41-50", "doi": null, "report-no": null, "categories": "q-bio.NC cond-mat.supr-con math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper deals with a semilinear integrodifferential equation that\ncharacterizes several dissipative models of Viscoelasticity, Biology and\nSuperconductivity. The initial - boundary problem with Neumann conditions is\nanalyzed. When the source term F is a linear function, then the explicit\nsolution is obtained. When F is non linear, some results on existence,\nuniqueness and a priori estimates are deduced. As example of physical model the\nreaction - diffusion system of Fitzhugh Nagumo is considered.\n", "versions": [{"version": "v1", "created": "Fri, 2 Mar 2012 13:01:39 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["De Angelis", "Monica", ""]]}, {"id": "1203.0738", "submitter": "Alain Destexhe", "authors": "Nima Dehghani, Nicholas G. Hatsopoulos, Zach D. Haga, Rebecca A.\n  Parker, Bradley Greger, Eric Halgren, Sydney S. Cash and Alain Destexhe", "title": "Avalanche analysis from multi-electrode ensemble recordings in cat,\n  monkey and human cerebral cortex during wakefulness and sleep", "comments": "In press in: Frontiers in Physiology, 2012, special issue \"Critical\n  Brain Dynamics\" (Edited by He BY, Daffertshofer A, Boonstra TW); 33 pages, 13\n  figures. 3 tables", "journal-ref": "Frontiers in Physiology 3: 302, 2012", "doi": null, "report-no": null, "categories": "q-bio.NC nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Self-organized critical states are found in many natural systems, from\nearthquakes to forest fires, they have also been observed in neural systems,\nparticularly, in neuronal cultures. However, the presence of critical states in\nthe awake brain remains controversial. Here, we compared avalanche analyses\nperformed on different in vivo preparations during wakefulness, slow-wave sleep\nand REM sleep, using high-density electrode arrays in cat motor cortex (96\nelectrodes), monkey motor cortex and premotor cortex and human temporal cortex\n(96 electrodes) in epileptic patients. In neuronal avalanches defined from\nunits (up to 160 single units), the size of avalanches never clearly scaled as\npower-law, but rather scaled exponentially or displayed intermediate scaling.\nWe also analyzed the dynamics of local field potentials (LFPs) and in\nparticular LFP negative peaks (nLFPs) among the different electrodes (up to 96\nsites in temporal cortex or up to 128 sites in adjacent motor and pre-motor\ncortices). In this case, the avalanches defined from nLFPs displayed power-law\nscaling in double log representations, as reported previously in monkey.\nHowever, avalanche defined as positive LFP (pLFP) peaks, which are less\ndirectly related to neuronal firing, also displayed apparent power-law scaling.\nCloser examination of this scaling using more reliable cumulative distribution\nfunctions (CDF) and other rigorous statistical measures, did not confirm\npower-law scaling. The same pattern was seen for cats, monkey and human, as\nwell as for different brain states of wakefulness and sleep. We also tested\nother alternative distributions. Multiple exponential fitting yielded optimal\nfits of the avalanche dynamics with bi-exponential distributions. Collectively,\nthese results show no clear evidence for power-law scaling or self-organized\ncritical states in the awake and sleeping brain of mammals, from cat to man.\n", "versions": [{"version": "v1", "created": "Sun, 4 Mar 2012 13:16:19 GMT"}, {"version": "v2", "created": "Wed, 25 Apr 2012 12:27:31 GMT"}, {"version": "v3", "created": "Fri, 22 Jun 2012 21:24:58 GMT"}, {"version": "v4", "created": "Sun, 15 Jul 2012 12:54:06 GMT"}], "update_date": "2012-08-20", "authors_parsed": [["Dehghani", "Nima", ""], ["Hatsopoulos", "Nicholas G.", ""], ["Haga", "Zach D.", ""], ["Parker", "Rebecca A.", ""], ["Greger", "Bradley", ""], ["Halgren", "Eric", ""], ["Cash", "Sydney S.", ""], ["Destexhe", "Alain", ""]]}, {"id": "1203.0834", "submitter": "Abdelmalik Moujahid", "authors": "A. Moujahid, A. d'Anjou, F. J. Torrealdea", "title": "Efficient synchronization of structurally adaptive coupled\n  Hindmarsh-Rose neurons", "comments": null, "journal-ref": "Chaos, Solitons and Fractals, 44 (2011) 929-933", "doi": "10.1016/j.chaos.2011.07.005", "report-no": null, "categories": "nlin.CD q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of spikes to carry information between brain areas implies complete\nor partial synchronization of the neurons involved. The degree of\nsynchronization reached by two coupled systems and the energy cost of\nmaintaining their synchronized behaviour is highly dependent on the nature of\nthe systems. For non-identical systems the maintenance of a synchronized regime\nis energetically a costly process. In this work, we study conditions under\nwhich two non-identical electrically coupled neurons can reach an efficient\nregime of synchronization at low energy cost. We show that the energy\nconsumption required to keep the synchronized regime can be spontaneously\nreduced if the receiving neuron has adaptive mechanisms able to bring its\nbiological parameters closer in value to the corresponding ones in the sending\nneuron.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 09:00:50 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Moujahid", "A.", ""], ["d'Anjou", "A.", ""], ["Torrealdea", "F. J.", ""]]}, {"id": "1203.0868", "submitter": "Yu Wu", "authors": "Xuejuan Zhang, Jianfeng Feng", "title": "Computational modeling of neuronal networks", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.MN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human brain contains about 10 billion neurons, each of which has about\n10~10,000 nerve endings from which neurotransmitters are released in response\nto incoming spikes, and the released neurotransmitters then bind to receptors\nlocated in the postsynaptic neurons. However, individually, neurons are noisy\nand synaptic release is in general unreliable. But groups of neurons that are\narranged in specialized modules can collectively perform complex information\nprocessing tasks robustly and reliably. How functionally groups of neurons\nperform behavioural related tasks crucial rely on a coherent organization of\ndynamics from membrane ionic kinetics to synaptic coupling of the network and\ndynamics of rhythmic oscillations that are tightly linked to behavioural state.\n  To capture essential features of the biological system at multiple\nspatial-temporal scales, it is important to construct a suitable computational\nmodel that is closely or solely based on experimental data. Depending on what\none wants to understand, these models can either be very functional and\nbiologically realistic descriptions with thousands of coupled differential\nequations (Hodgkin-Huxley type) or greatly simplified caricatures\n(integrate-and-fire type) which are useful for studying large interconnected\nnetworks.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 11:29:15 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Zhang", "Xuejuan", ""], ["Feng", "Jianfeng", ""]]}, {"id": "1203.0872", "submitter": "Jing Kang Dr.", "authors": "Jing Kang, Hugh P. C. Robinson, Jianfeng Feng", "title": "Diversity of Intrinsic Frequency Encoding Patterns in Rat Cortical\n  Neurons -Mechanisms and Possible Functions", "comments": "11 pages, 7 figures; PloS One 2010", "journal-ref": null, "doi": "10.1371/journal.pone.0009608", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extracellular recordings of single neurons in primary and secondary\nsomatosensory cortices of monkeys in vivo have shown that their firing rate can\nincrease, decrease, or remain constant in different cells, as the external\nstimulus frequency increases. We observed similar intrinsic firing patterns\n(increasing, decreasing or constant) in rat somatosensory cortex in vitro, when\nstimulated with oscillatory input using conductance injection (dynamic clamp).\nThe underlying mechanism of this observation is not obvious, and presents a\nchallenge for mathematical modelling. We propose a simple principle for\ndescribing this phenomenon using a leaky integrate-and-fire model with\nsinusoidal input, an intrinsic oscillation and Poisson noise. Additional\nenhancement of the gain of encoding could be achieved by local network\nconnections amongst diverse intrinsic response patterns. Our work sheds light\non the possible cellular and network mechanisms underlying these opposing\nneuronal responses, which serve to enhance signal detection.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 11:45:39 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Kang", "Jing", ""], ["Robinson", "Hugh P. C.", ""], ["Feng", "Jianfeng", ""]]}, {"id": "1203.0873", "submitter": "Jing Kang Dr.", "authors": "Jing Kang, Jianhua Wu, Anteo Smerieri and Jianfeng Feng", "title": "Weber's law implies neural discharge more regular than a Poisson process", "comments": "13 pages, 8 figures; European Journal of Neuroscience 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Weber's law is one of the basic laws in psychophysics, but the link between\nthis psychophysical behavior and the neuronal response has not yet been\nestablished. In this paper, we carried out an analysis on the spike train\nstatistics when Weber's law holds, and found that the efferent spike train of a\nsingle neuron is less variable than a Poisson process. For population neurons,\nWeber's law is satisfied only when the population size is small (< 10 neurons).\nHowever, if the population neurons share a weak correlation in their discharges\nand individual neuronal spike train is more regular than a Poisson process,\nWeber's law is true without any restriction on the population size. Biased\ncompetition attractor network also demonstrates that the coefficient of\nvariation of interspike interval in the winning pool should be less than one\nfor the validity of Weber's law. Our work links Weber's law with neural firing\nproperty quantitatively, shedding light on the relation between psychophysical\nbehavior and neuronal responses.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 11:51:23 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Kang", "Jing", ""], ["Wu", "Jianhua", ""], ["Smerieri", "Anteo", ""], ["Feng", "Jianfeng", ""]]}, {"id": "1203.0886", "submitter": "Abdelmalik Moujahid", "authors": "A. Moujahid, A. d'Anjou, and F. J. Torrealdea", "title": "Energy and information in Hodgkin-Huxley neurons", "comments": "This paper has been withdrawn by the author due to technical issues", "journal-ref": "Physical Review E 83, 031912(2011)", "doi": "10.1103/PhysRevE.83.031912", "report-no": null, "categories": "nlin.CD physics.comp-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The generation of spikes by neurons is energetically a costly process and the\nevaluation of the metabolic energy required to maintain the signalling activity\nof neurons a challenge of practical interest. Neuron models are frequently used\nto represent the dynamics of real neurons but hardly ever to evaluate the\nelectrochemical energy required to maintain that dynamics. This paper discusses\nthe interpretation of a Hodgkin-Huxley circuit as an energy model for real\nbiological neurons and uses it to evaluate the consumption of metabolic energy\nin the transmission of information between neurons coupled by electrical\nsynapses, i.e. gap junctions. We show that for a single postsynaptic neuron\nmaximum energy efficiency, measured in bits of mutual information per ATP\nmolecule consumed, requires maximum energy consumption. On the contrary, for\ngroups of parallel postsynaptic neurons we determine values of the synaptic\nconductance at which the energy efficiency of the transmission presents clear\nmaxima at relatively very low values of metabolic energy consumption. Contrary\nto what it could be expected best performance occurs at low energy cost.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 12:32:50 GMT"}, {"version": "v2", "created": "Wed, 2 May 2012 16:59:30 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Moujahid", "A.", ""], ["d'Anjou", "A.", ""], ["Torrealdea", "F. J.", ""]]}, {"id": "1203.1067", "submitter": "Alessandro Treves", "authors": "Eleonora Russo and Alessandro Treves", "title": "Cortical free association dynamics: distinct phases of a latching\n  network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO q-bio.NC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Potts associative memory network has been proposed as a simplified model of\nmacroscopic cortical dynamics, in which each Potts unit stands for a patch of\ncortex, which can be activated in one of S local attractor states. The internal\nneuronal dynamics of the patch is not described by the model, rather it is\nsubsumed into an effective description in terms of graded Potts units, with\nadaptation effects both specific to each attractor state and generic to the\npatch. If each unit, or patch, receives effective (tensor) connections from C\nother units, the network has been shown to be able to store a large number p of\nglobal patterns, or network attractors, each with a fraction a of the units\nactive, where the critical load p_c scales roughly like p_c ~ (C S^2)/(a\nln(1/a)) (if the patterns are randomly correlated). Interestingly, after\nretrieving an externally cued attractor, the network can continue jumping, or\nlatching, from attractor to attractor, driven by adaptation effects. The\noccurrence and duration of latching dynamics is found through simulations to\ndepend critically on the strength of local attractor states, expressed in the\nPotts model by a parameter w. Here we describe with simulations and then\nanalytically the boundaries between distinct phases of no latching, of\ntransient and sustained latching, deriving a phase diagram in the plane w-T,\nwhere T parametrizes thermal noise effects. Implications for real cortical\ndynamics are briefly reviewed in the conclusions.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 22:31:32 GMT"}], "update_date": "2012-03-07", "authors_parsed": [["Russo", "Eleonora", ""], ["Treves", "Alessandro", ""]]}, {"id": "1203.1076", "submitter": "Shinsuke Koyama", "authors": "Shinsuke Koyama", "title": "On the Relation between Encoding and Decoding of Neuronal Spikes", "comments": "21 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural coding is a field of study that concerns how sensory information is\nrepresented in the brain by networks of neurons. The link between external\nstimulus and neural response can be studied from two parallel points of view.\nThe first, neural encoding refers to the mapping from stimulus to response, and\nprimarily focuses on understanding how neurons respond to a wide variety of\nstimuli, and on constructing models that accurately describe the\nstimulus-response relationship. Neural decoding, on the other hand, refers to\nthe reverse mapping, from response to stimulus, where the challenge is to\nreconstruct a stimulus from the spikes it evokes. Since neuronal response is\nstochastic, a one-to-one mapping of stimuli into neural responses does not\nexist, causing a mismatch between the two viewpoints of neural coding. Here, we\nuse these two perspectives to investigate the question of what rate coding is,\nin the simple setting of a single stationary stimulus parameter and a single\nstationary spike train represented by a renewal process. We show that when rate\ncodes are defined in terms of encoding, i.e., the stimulus parameter is mapped\nonto the mean firing rate, the rate decoder given by spike counts or the sample\nmean, does not always efficiently decode the rate codes, but can improve\nefficiency in reading certain rate codes, when correlations within a spike\ntrain are taken into account.\n", "versions": [{"version": "v1", "created": "Tue, 6 Mar 2012 00:25:23 GMT"}], "update_date": "2012-03-07", "authors_parsed": [["Koyama", "Shinsuke", ""]]}, {"id": "1203.3073", "submitter": "Taro Toyoizumi", "authors": "Taro Toyoizumi", "title": "Nearly extensive sequential memory lifetime achieved by coupled\n  nonlinear neurons", "comments": "21 pages, 5 figures, the manuscript has been accepted for publication\n  in Neural Computation", "journal-ref": "Neural Computation 24 (2012) 2678-2699", "doi": "10.1162/NECO_a_00324", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many cognitive processes rely on the ability of the brain to hold sequences\nof events in short-term memory. Recent studies have revealed that such memory\ncan be read out from the transient dynamics of a network of neurons. However,\nthe memory performance of such a network in buffering past information has only\nbeen rigorously estimated in networks of linear neurons. When signal gain is\nkept low, so that neurons operate primarily in the linear part of their\nresponse nonlinearity, the memory lifetime is bounded by the square root of the\nnetwork size. In this work, I demonstrate that it is possible to achieve a\nmemory lifetime almost proportional to the network size, \"an extensive memory\nlifetime\", when the nonlinearity of neurons is appropriately utilized. The\nanalysis of neural activity revealed that nonlinear dynamics prevented the\naccumulation of noise by partially removing noise in each time step. With this\nerror-correcting mechanism, I demonstrate that a memory lifetime of order\n$N/\\log N$ can be achieved.\n", "versions": [{"version": "v1", "created": "Wed, 14 Mar 2012 13:00:51 GMT"}], "update_date": "2012-08-31", "authors_parsed": [["Toyoizumi", "Taro", ""]]}, {"id": "1203.3113", "submitter": "Jonathan Mason", "authors": "Jonathan W. Mason", "title": "Consciousness and the structuring property of typical data", "comments": "16 pages, 8 figures, First submitted for publication March 2012", "journal-ref": null, "doi": "10.1002/cplx.21431", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The theoretical base for consciousness, in particular an explanation of how\nconsciousness is defined by the brain, has long been sought by science. We\npropose a partial theory of consciousness as relations defined by typical data.\nThe theory is based on the idea that a brain state on its own is almost\nmeaningless but in the context of the typical brain states, defined by the\nbrain's structure, a particular brain state is highly structured by relations.\nThe proposed theory can be applied and tested both theoretically and\nexperimentally. Precisely how typical data determines relations is fully\nestablished using discrete mathematics.\n", "versions": [{"version": "v1", "created": "Wed, 14 Mar 2012 15:27:17 GMT"}, {"version": "v2", "created": "Mon, 31 Dec 2012 18:57:29 GMT"}], "update_date": "2013-01-01", "authors_parsed": [["Mason", "Jonathan W.", ""]]}, {"id": "1203.3596", "submitter": "Alex Urban Dr.", "authors": "Alexander Urban and Bard Ermentrout", "title": "Formation of antiwaves in gap-junction-coupled chains of neurons", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.86.011907", "report-no": null, "categories": "q-bio.NC nlin.PS physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using network models consisting of gap junction coupled Wang-Buszaki neurons,\nwe demonstrate that it is possible to obtain not only synchronous activity\nbetween neurons but also a variety of constant phase shifts between 0 and \\pi.\nWe call these phase shifts intermediate stable phaselocked states. These phase\nshifts can produce a large variety of wave-like activity patterns in\none-dimensional chains and two-dimensional arrays of neurons, which can be\nstudied by reducing the system of equations to a phase model. The 2\\pi periodic\ncoupling functions of these models are characterized by prominent higher order\nterms in their Fourier expansion, which can be varied by changing model\nparameters. We study how the relative contribution of the odd and even terms\naffect what solutions are possible, the basin of attraction of those solutions\nand their stability. These models may be applicable to the spinal central\npattern generators of the dogfish and also to the developing neocortex of the\nneonatal rat.\n", "versions": [{"version": "v1", "created": "Fri, 16 Mar 2012 01:07:40 GMT"}, {"version": "v2", "created": "Wed, 6 Jun 2012 01:01:51 GMT"}, {"version": "v3", "created": "Fri, 8 Jun 2012 01:26:57 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Urban", "Alexander", ""], ["Ermentrout", "Bard", ""]]}, {"id": "1203.3954", "submitter": "Klaus Jaffe Dr", "authors": "Klaus Jaffe, Guillermo Mascitti and Daniella Seguias", "title": "Gender differences in time perception and its relation with academic\n  performance: non-linear dynamics in the formation of cognitive systems", "comments": "Politically incorrect paper practically impossible to publish in a\n  psychology journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-linear dynamics is probably much more common in the epigenetic dynamics\nof living beings than hitherto recognized. Here we report a case of global\nbifurcation triggered by gender that affects higher cognitive functions in\nhumans. We report a cross-cultural study showing deviations in time perception,\nas assessed by estimating the duration of brief sounds, according to their\ndurations and to the gender of the perciver. Results show that the duration of\nsounds lasting less than 10 s were on average overestimated, whereas those\nlasting longer were underestimated; estimates of sounds shorter than 1 s were\nextremely inaccurate. Females consistently gave longer estimates than males.\nAccuracy in time estimation was correlated to academic performance in\ndisciplines requiring mathematical or scientific skills in male, but not in\nfemale students. This difference in correlation however had nothing to do with\noverall skills in mathematics. Both sexes scored similarly in scientific and\ntechnical disciplines, but females had higher grades than males in languages\nand lower ones in physical education. Our results confirm existing evidence for\ngender differences in cognitive processing, hinting to the existence of\ndifferent \"mathematical intelligences\" with different non-linear relationships\nbetween natural or biological mathematical intuition and time perception.\n", "versions": [{"version": "v1", "created": "Sun, 18 Mar 2012 14:29:30 GMT"}, {"version": "v2", "created": "Sat, 24 Mar 2012 13:57:49 GMT"}], "update_date": "2012-03-27", "authors_parsed": [["Jaffe", "Klaus", ""], ["Mascitti", "Guillermo", ""], ["Seguias", "Daniella", ""]]}, {"id": "1203.3966", "submitter": "Bailu Si", "authors": "Bailu Si, Emilio Kropff, Alessandro Treves", "title": "Grid Alignment in Entorhinal Cortex", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn nlin.AO nlin.PS physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The spatial responses of many of the cells recorded in all layers of rodent\nmedial entorhinal cortex (mEC) show a triangular grid pattern, and once\nestablished might be based in part on path-integration mechanisms. Grid axes\nare tightly aligned across simultaneously recorded units. Recent experimental\nfindings have shown that grids can often be better described as elliptical\nrather than purely circular and that, beyond the mutual alignment of their grid\naxes, ellipses tend to also orient their long axis along preferred directions.\nAre grid alignment and ellipse orientation the same phenomenon? Does the grid\nalignment result from single-unit mechanisms or does it require network\ninteractions?\n  We address these issues by refining our model, to describe specifically the\nspontaneous emergence of conjunctive grid-by-head-direction cells in layers\nIII, V and VI of mEC. We find that tight alignment can be produced by recurrent\ncollateral interactions, but this requires head-direction modulation. Through a\ncompetitive learning process driven by spatial inputs, grid fields then form\nalready aligned, and with randomly distributed spatial phases. In addition, we\nfind that the self-organization process is influenced by the behavior of the\nsimulated rat. The common grid alignment often orients along preferred running\ndirections. The shape of individual grids is distorted towards an ellipsoid\narrangement when some speed anisotropy is present in exploration behavior.\nSpeed anisotropy on its own also tends to align grids, even without\ncollaterals, but the alignment is seen to be loose. Finally, the alignment of\nspatial grid fields in multiple environments shows that the network expresses\nthe same set of grid fields across environments, modulo a coherent rotation and\ntranslation. Thus, an efficient metric encoding of space may emerge through\nspontaneous pattern formation at the single-unit level.\n", "versions": [{"version": "v1", "created": "Sun, 18 Mar 2012 15:53:01 GMT"}], "update_date": "2012-03-20", "authors_parsed": [["Si", "Bailu", ""], ["Kropff", "Emilio", ""], ["Treves", "Alessandro", ""]]}, {"id": "1203.4771", "submitter": "Jens Christian Claussen", "authors": "Markus Sch\\\"utt and Jens Christian Claussen", "title": "Desynchronizing effect of high-frequency stimulation in a generic\n  cortical network model", "comments": "9 pages, figs included. Accepted for publication in Cognitive\n  Neurodynamics", "journal-ref": "Cognitive Neurodynamics 6 (4), 343-351 (2012)", "doi": "10.1007/s11571-012-9199-8", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn nlin.CD physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transcranial Electrical Stimulation (TCES) and Deep Brain Stimulation (DBS)\nare two different applications of electrical current to the brain used in\ndifferent areas of medicine. Both have a similar frequency dependence of their\nefficiency, with the most pronounced effects around 100Hz. We apply\nsuperthreshold electrical stimulation, specifically depolarizing DC current,\ninterrupted at different frequencies, to a simple model of a population of\ncortical neurons which uses phenomenological descriptions of neurons by\nIzhikevich and synaptic connections on a similar level of sophistication. With\nthis model, we are able to reproduce the optimal desynchronization around\n100Hz, as well as to predict the full frequency dependence of the efficiency of\ndesynchronization, and thereby to give a possible explanation for the action\nmechanism of TCES.\n", "versions": [{"version": "v1", "created": "Wed, 21 Mar 2012 16:16:30 GMT"}], "update_date": "2019-07-15", "authors_parsed": [["Schütt", "Markus", ""], ["Claussen", "Jens Christian", ""]]}, {"id": "1203.5673", "submitter": "Yasser Roudi", "authors": "Joanna Tyrcha, Yasser Roudi, Matteo Marsili, John Hertz", "title": "The Effect of Nonstationarity on Models Inferred from Neural Data", "comments": "version in press in J Stat Mech", "journal-ref": "J. Stat. Mech. (2013) P03005", "doi": "10.1088/1742-5468/2013/03/P03005", "report-no": null, "categories": "q-bio.QM q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neurons subject to a common non-stationary input may exhibit a correlated\nfiring behavior. Correlations in the statistics of neural spike trains also\narise as the effect of interaction between neurons. Here we show that these two\nsituations can be distinguished, with machine learning techniques, provided the\ndata are rich enough. In order to do this, we study the problem of inferring a\nkinetic Ising model, stationary or nonstationary, from the available data. We\napply the inference procedure to two data sets: one from salamander retinal\nganglion cells and the other from a realistic computational cortical network\nmodel. We show that many aspects of the concerted activity of the salamander\nretinal neurons can be traced simply to the external input. A model of\nnon-interacting neurons subject to a non-stationary external field outperforms\na model with stationary input with couplings between neurons, even accounting\nfor the differences in the number of model parameters. When couplings are added\nto the non-stationary model, for the retinal data, little is gained: the\ninferred couplings are generally not significant. Likewise, the distribution of\nthe sizes of sets of neurons that spike simultaneously and the frequency of\nspike patterns as function of their rank (Zipf plots) are well-explained by an\nindependent-neuron model with time-dependent external input, and adding\nconnections to such a model does not offer significant improvement. For the\ncortical model data, robust couplings, well correlated with the real\nconnections, can be inferred using the non-stationary model. Adding connections\nto this model slightly improves the agreement with the data for the probability\nof synchronous spikes but hardly affects the Zipf plot.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2012 14:08:44 GMT"}, {"version": "v2", "created": "Thu, 31 Jan 2013 13:19:52 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Tyrcha", "Joanna", ""], ["Roudi", "Yasser", ""], ["Marsili", "Matteo", ""], ["Hertz", "John", ""]]}, {"id": "1203.6832", "submitter": "Lucilla de Arcangelis", "authors": "Lucilla de Arcangelis and Hans J. Herrmann", "title": "Activity-dependent neuronal model on complex networks", "comments": "9 pages, 8 figures", "journal-ref": "published on Frontiers in Physiology vol3, 62 (2012)", "doi": null, "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neuronal avalanches are a novel mode of activity in neuronal networks,\nexperimentally found in vitro and in vivo, and exhibit a robust critical\nbehaviour: These avalanches are characterized by a power law distribution for\nthe size and duration, features found in other problems in the context of the\nphysics of complex systems. We present a recent model inspired in\nself-organized criticality, which consists of an electrical network with\nthreshold firing, refractory period and activity-dependent synaptic plasticity.\nThe model reproduces the critical behaviour of the distribution of avalanche\nsizes and durations measured experimentally. Moreover, the power spectra of the\nelectrical signal reproduce very robustly the power law behaviour found in\nhuman electroencephalogram (EEG) spectra. We implement this model on a variety\nof complex networks, i.e. regular, small-world and scale-free and verify the\nrobustness of the critical behaviour.\n", "versions": [{"version": "v1", "created": "Fri, 30 Mar 2012 14:46:47 GMT"}], "update_date": "2012-04-02", "authors_parsed": [["de Arcangelis", "Lucilla", ""], ["Herrmann", "Hans J.", ""]]}]