[{"id": "1204.0119", "submitter": "Leonardo L. Gollo", "authors": "Leonardo L. Gollo, Claudio Mirasso and V\\'ictor M. Egu\\'iluz", "title": "Signal integration enhances the dynamic range in neuronal systems", "comments": "5 pages, 4 figures", "journal-ref": "Phys. Rev. E, 85, 040902 (2012)", "doi": "10.1103/PhysRevE.85.040902", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn cond-mat.stat-mech nlin.CG physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamic range measures the capacity of a system to discriminate the\nintensity of an external stimulus. Such an ability is fundamental for living\nbeings to survive: to leverage resources and to avoid danger. Consequently, the\nlarger is the dynamic range, the greater is the probability of survival. We\ninvestigate how the integration of different input signals affects the dynamic\nrange, and in general the collective behavior of a network of excitable units.\nBy means of numerical simulations and a mean-field approach, we explore the\nnonequilibrium phase transition in the presence of integration. We show that\nthe firing rate in random and scale-free networks undergoes a discontinuous\nphase transition depending on both the integration time and the density of\nintegrator units. Moreover, in the presence of external stimuli, we find that a\nsystem of excitable integrator units operating in a bistable regime largely\nenhances its dynamic range.\n", "versions": [{"version": "v1", "created": "Sat, 31 Mar 2012 17:46:07 GMT"}, {"version": "v2", "created": "Fri, 27 Apr 2012 17:34:37 GMT"}], "update_date": "2012-05-02", "authors_parsed": [["Gollo", "Leonardo L.", ""], ["Mirasso", "Claudio", ""], ["Eguíluz", "Víctor M.", ""]]}, {"id": "1204.0142", "submitter": "Donald  Cooper Ph.D.", "authors": "Kurt R. Illig, Kristin C. Rasmus, Andrew L. Varnell, Eric M. Ostertag,\n  William D. Klipec and Donald C. Cooper", "title": "TRPC4 ion channel protein is selectively expressed in a subpopulation of\n  dopamine neurons in the ventral tegmental area", "comments": "2 pages 2 figures; Nature Precedings\n  http://dx.doi.org/10.1038/npre.2011.6577.1 (2011)", "journal-ref": null, "doi": "10.1038/npre.2011.6577.1", "report-no": null, "categories": "q-bio.NC q-bio.CB", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The nonselective cation channel TRPC4 has been shown to be present in high\nabundance in the corticolimbic regions of the brain and play a pivotal role in\nmodulating cellular excitability due to their involvement in intracellular Ca2+\nregulation. Recently we reported their involvement in socialization and\nregulating anxiety-like behaviors in rats. Given the important role for\ndopamine in modulating emotions involved in social anxiety we investigated\nwhether TRPC4 protein and mRNA was found on dopaminergic neurons of the ventral\ntegmental area (VTA). Using emulsion autoradiography we found that TRPC4 mRNA\nis indeed present in the VTA and the substantia nigra. Additionally,\nimmunohistochemistry verified it's presence on a subpopulation of dopamine\nneurons in the VTA. We confirmed these findings by testing Trpc4 knock-out rats\nin addition to wild-type animals. This novel finding suggests that TRPC4 plays\na pivotal role in regulating dopamine release in a sub-population of neurons\nthat may modulate emotional and cognitive responses in social situations.\n", "versions": [{"version": "v1", "created": "Sat, 31 Mar 2012 22:13:06 GMT"}, {"version": "v2", "created": "Tue, 3 Apr 2012 19:58:13 GMT"}], "update_date": "2012-04-04", "authors_parsed": [["Illig", "Kurt R.", ""], ["Rasmus", "Kristin C.", ""], ["Varnell", "Andrew L.", ""], ["Ostertag", "Eric M.", ""], ["Klipec", "William D.", ""], ["Cooper", "Donald C.", ""]]}, {"id": "1204.0574", "submitter": "Hamidreza Namazi Dr.", "authors": "Karthik Seetharaman, Hamidreza Namazi, Vladimir V.Kulish", "title": "Phase lagging model of brain response to external stimuli - modeling of\n  single action potential", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we detail a phase lagging model of brain response to external\nstimuli. The model is derived using the basic laws of physics like conservation\nof energy law. This model eliminates the paradox of instantaneous propagation\nof the action potential in the brain. The solution of this model is then\npresented. The model is further applied in the case of a single neuron and is\nverified by simulating a single action potential. The results of this modeling\nare useful not only for the fundamental understanding of single action\npotential generation, but also they can be applied in case of neuronal\ninteractions where the results can be verified against the real EEG signal.\n", "versions": [{"version": "v1", "created": "Tue, 3 Apr 2012 02:20:09 GMT"}], "update_date": "2012-05-21", "authors_parsed": [["Seetharaman", "Karthik", ""], ["Namazi", "Hamidreza", ""], ["Kulish", "Vladimir V.", ""]]}, {"id": "1204.0576", "submitter": "Hamidreza Namazi Dr.", "authors": "Hamidreza Namazi, Vladimir V.Kulish", "title": "Diffusion Based Modeling of Human Brain Response to External Stimuli", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human brain response is the overall ability of the brain in analyzing\ninternal and external stimuli in the form of transferred energy to the\nmind/brain phase-space and thus, making the proper decisions. During the last\ndecade scientists discovered about this phenomenon and proposed some models\nbased on computational, biological, or neuropsychological methods. Despite some\nadvances in studies related to this area of the brain research there was less\neffort which have been done on the mathematical modeling of the human brain\nresponse to external stimuli. This research is devoted to the modeling of human\nEEG signal, as an alert state of overall human brain activity monitoring, due\nto receiving external stimuli, based on fractional diffusion equation. The\nresults of this modeling show very good agreement with the real human EEG\nsignal and thus, this model can be used as a strong representative of the human\nbrain activity.\n", "versions": [{"version": "v1", "created": "Tue, 3 Apr 2012 02:42:45 GMT"}], "update_date": "2012-04-04", "authors_parsed": [["Namazi", "Hamidreza", ""], ["Kulish", "Vladimir V.", ""]]}, {"id": "1204.0710", "submitter": "Donald  Cooper Ph.D.", "authors": "Michael V. Baratta, Shinya Nakamura, Peter Dobelis, Matthew B.\n  Pomrenze, Samuel D. Dolzani and Donald C. Cooper", "title": "Optogenetic control of genetically-targeted pyramidal neuron activity in\n  prefrontal cortex", "comments": "2 pages, 2 figures Posted on\n  http://www.neuro-cloud.net/nature-precedings/baratta", "journal-ref": null, "doi": "10.1038/npre.2012.7102.1", "report-no": null, "categories": "q-bio.NC q-bio.CB", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  A salient feature of prefrontal cortex organization is the vast diversity of\ncell types that support the temporal integration of events required for\nsculpting future responses. A major obstacle in understanding the routing of\ninformation among prefrontal neuronal subtypes is the inability to manipulate\nthe electrical activity of genetically defined cell types over behaviorally\nrelevant timescales and activity patterns. To address these constraints, we\npresent here a simple approach for selective activation of prefrontal\nexcitatory neurons in both in vitro and in vivo preparations. Rat prelimbic\npyramidal neurons were genetically targeted to express a light-activated\nnonselective cation channel, channelrhodopsin-2, or a light-driven inward\nchloride pump, halorhodopsin, which enabled them to be rapidly and reversibly\nactivated or inhibited by pulses of light. These light responsive tools provide\na spatially and temporally precise means of studying how different cell types\ncontribute to information processing in cortical circuits. Our customized\noptrodes and optical commutators for in vivo recording allow for efficient\nlight delivery and recording and can be requested at\nwww.neuro-cloud.net/nature-precedings/baratta.\n", "versions": [{"version": "v1", "created": "Tue, 3 Apr 2012 15:26:53 GMT"}], "update_date": "2012-04-04", "authors_parsed": [["Baratta", "Michael V.", ""], ["Nakamura", "Shinya", ""], ["Dobelis", "Peter", ""], ["Pomrenze", "Matthew B.", ""], ["Dolzani", "Samuel D.", ""], ["Cooper", "Donald C.", ""]]}, {"id": "1204.0751", "submitter": "Thiago Mosqueiro", "authors": "Thiago S. Mosqueiro and Leonardo P. Maia", "title": "Optimal Channel Efficiency in a Sensory Network", "comments": "11 pages, 4 captions, submitted", "journal-ref": "Phys. Rev. E 88 (1) 012712 - 2013", "doi": "10.1103/PhysRevE.88.012712", "report-no": null, "categories": "physics.bio-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the entropy of the distribution of avalanche lifetimes in the\nKinouchi-Copelli model always achieves a maximum jointly with the dynamic\nrange. This is noteworthy and nontrivial because while the dynamic range is an\nequilibrium average measure of the sensibility of a sensory system to a\nstimulus, the entropy of relaxation times is a purely dynamical quantity,\nindependent of the stimulus rate, that can be interpreted as the efficiency of\nthe network seen as a communication channel. The newly found optimization\noccurs for all topologies we tested, even when the distribution of avalanche\nlifetimes itself is not a power-law and when the entropy of the size\ndistribution of avalanches is not concomitantly maximized, strongly suggesting\nthat dynamical rules allowing a proper temporal matching of the states of the\ninteracting neurons is the key for achieving good performance in information\nprocessing, rather than increasing the number of available units.\n", "versions": [{"version": "v1", "created": "Tue, 3 Apr 2012 18:02:02 GMT"}, {"version": "v2", "created": "Sun, 13 Jan 2013 01:00:17 GMT"}], "update_date": "2013-07-15", "authors_parsed": [["Mosqueiro", "Thiago S.", ""], ["Maia", "Leonardo P.", ""]]}, {"id": "1204.1094", "submitter": "Donald  Cooper Ph.D.", "authors": "Juan A. Varela, Jungang Wang, Andrew L. Varnell and Donald C. Cooper", "title": "Control over stress induces plasticity of individual prefrontal cortical\n  neurons: A conductance-based neural simulation", "comments": "2 pages 2 figures Nature Precedings\n  <http://dx.doi.org/10.1038/npre.2011.6267.1> (2011)", "journal-ref": null, "doi": "10.1038/npre.2011.6267.1", "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Behavioral control over stressful stimuli induces resilience to future\nconditions when control is lacking. The medial prefrontal cortex(mPFC) is a\ncritically important brain region required for plasticity of stress resilience.\nWe found that control over stress induces plasticity of the intrinsic\nvoltage-gated conductances of pyramidal neurons in the PFC. To gain insight\ninto the underlying biophysical mechanisms of this plasticity we used the\nconductance- based neural simulation software tool, NEURON, to model the\nincrease in membrane excitability associated with resilience to stress. A ball\nand stick multicompartment conductance-based model was used to realistically\nfit passive and active data traces from prototypical pyramidal neurons in\nneurons in rats with control over tail shock stress and those lacking control.\nThe results indicate that the plasticity of membrane excitability associated\nwith control over stress can be attributed to an increase in Na+ and Ca2+\nT-type conductances and an increase in the leak conductance. Using simulated\ndendritic synaptic inputs we observed an increase in excitatory postsynaptic\nsummation and amplification resulting in elevated action potential output. This\nrealistic simulation suggests that control over stress enhances the output of\nthe PFC and offers specific testable hypotheses to guide future\nelectrophysiological mechanistic studies in animal models of resilience and\nvulnerability to stress.\n", "versions": [{"version": "v1", "created": "Wed, 4 Apr 2012 23:38:57 GMT"}], "update_date": "2012-04-06", "authors_parsed": [["Varela", "Juan A.", ""], ["Wang", "Jungang", ""], ["Varnell", "Andrew L.", ""], ["Cooper", "Donald C.", ""]]}, {"id": "1204.1395", "submitter": "Donald  Cooper Ph.D.", "authors": "Melissa A. Fowler, Andrew L. Varnell and Donald C. Cooper", "title": "mGluR5 Knockout mice exhibit normal conditioned place-preference to\n  cocaine", "comments": "2 pages,2 figures Nature Precedings\n  http://precedings.nature.com/documents/6180/version/2", "journal-ref": null, "doi": "10.1038/npre.2011.6180.2", "report-no": null, "categories": "q-bio.NC q-bio.GN", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Metabotropic glutamate receptor 5 (mGluR5) null mutant (-/-) mice have been\nreported to totally lack the rein- forcing or locomotor stimulating effects of\ncocaine. We tested mGluR5 -/- and +/+ mice for their locomotor and conditioned\nplace- preference response to cocaine. Unlike the previous finding, here we\nshow that compared to mGluR5 +/+ mice, -/- mice exhibit no difference in the\nlocomotor response to low to moderate doses of cocaine (10 or 20 mg/kg). A high\ndose of cocaine (40 mg/kg) resulted in a blunted rather than absent locomo- tor\nresponse. We tested mGluR5 -/- and +/+ mice for conditioned place-preference to\ncocaine and found no group differences at a conditioning dose of 10 mg/kg,\nsuggesting normal conditioned rewarding properties of cocaine. These results\ndiffer substantially from Chiamulera et al. (2001) and replicates Olsen et al.,\n(2010), who found normal cocaine place-preference in mGluR5 -/- mice at 5\nmg/kg. Our results indicate mGluR5 receptors exert a modulatory rather than\nnecessary role in cocaine-induced locomotor stimulation and exert no effect on\nthe conditioned rewarding effects of cocaine.\n", "versions": [{"version": "v1", "created": "Fri, 6 Apr 2012 02:04:55 GMT"}], "update_date": "2012-04-09", "authors_parsed": [["Fowler", "Melissa A.", ""], ["Varnell", "Andrew L.", ""], ["Cooper", "Donald C.", ""]]}, {"id": "1204.1558", "submitter": "Donald  Cooper Ph.D.", "authors": "Peter Dobelis, Andrew L. Varnell, Kevin J. Staley, and Donald C.\n  Cooper", "title": "Nicotinic {\\alpha}7 acetylcholine receptor-mediated currents are not\n  modulated by the tryptophan metabolite kynurenic acid in adult hippocampal\n  interneurons", "comments": "2 pages, 2 figures, Nature Precedings\n  http://dx.doi.org/10.1038/npre.2011.6277.1", "journal-ref": null, "doi": "10.1038/npre.2011.6277.1", "report-no": null, "categories": "q-bio.NC q-bio.BM q-bio.CB", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The tryptophan metabolite, kynurenic acid (KYNA), is classically known to be\nan antagonist of ionotropic glutamate receptors. Within the last decade several\nreports have been published suggesting that KYNA also blocks nicotinic\nacetylcholine receptors (nAChRs) containing the \\alpha7 subunit (\\alpha7*).\nMost of these reports involve either indirect measurements of KYNA effects on\n\\alpha7 nAChR function, or are reports of KYNA effects in complicated in vivo\nsystems. However, a recent report investigating KYNA interactions with \\alpha7\nnAChRs failed to detect an interaction using direct measurements of \\alpha7\nnAChRs function. Further, it showed that a KYNA blockade of \\alpha7 nAChR\nstimulated GABA release (an indirect measure of \\alpha7 nAChR function) was not\ndue to KYNA blockade of the \\alpha7 nAChRs. The current study measured the\ndirect effects of KYNA on \\alpha7-containing nAChRs expressed on interneurons\nin the hilar and CA1 stratum radiatum regions of the mouse hippocampus and on\ninterneurons in the CA1 region of the rat hippocampus. Here we show that KYNA\ndoes not block \\alpha7* nACHRs using direct patch-clamprecording of \\alpha7\ncurrents in adult brain slices.\n", "versions": [{"version": "v1", "created": "Fri, 6 Apr 2012 20:33:47 GMT"}], "update_date": "2012-04-10", "authors_parsed": [["Dobelis", "Peter", ""], ["Varnell", "Andrew L.", ""], ["Staley", "Kevin J.", ""], ["Cooper", "Donald C.", ""]]}, {"id": "1204.1564", "submitter": "Jose Fontanari", "authors": "Paulo F. C. Tilles and Jose F. Fontanari", "title": "Minimal model of associative learning for cross-situational lexicon\n  acquisition", "comments": null, "journal-ref": "J. Math. Psych. 56, 396-403 (2012)", "doi": "10.1016/j.jmp.2012.11.002", "report-no": null, "categories": "q-bio.NC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An explanation for the acquisition of word-object mappings is the associative\nlearning in a cross-situational scenario. Here we present analytical results of\nthe performance of a simple associative learning algorithm for acquiring a\none-to-one mapping between $N$ objects and $N$ words based solely on the\nco-occurrence between objects and words. In particular, a learning trial in our\nlearning scenario consists of the presentation of $C + 1 < N$ objects together\nwith a target word, which refers to one of the objects in the context. We find\nthat the learning times are distributed exponentially and the learning rates\nare given by $\\ln{[\\frac{N(N-1)}{C + (N-1)^{2}}]}$ in the case the $N$ target\nwords are sampled randomly and by $\\frac{1}{N} \\ln [\\frac{N-1}{C}] $ in the\ncase they follow a deterministic presentation sequence. This learning\nperformance is much superior to those exhibited by humans and more realistic\nlearning algorithms in cross-situational experiments. We show that introduction\nof discrimination limitations using Weber's law and forgetting reduce the\nperformance of the associative algorithm to the human level.\n", "versions": [{"version": "v1", "created": "Fri, 6 Apr 2012 20:57:07 GMT"}, {"version": "v2", "created": "Fri, 1 Jun 2012 12:04:12 GMT"}, {"version": "v3", "created": "Wed, 22 Aug 2012 12:15:10 GMT"}, {"version": "v4", "created": "Mon, 17 Dec 2012 16:58:04 GMT"}], "update_date": "2012-12-18", "authors_parsed": [["Tilles", "Paulo F. C.", ""], ["Fontanari", "Jose F.", ""]]}, {"id": "1204.2916", "submitter": "Christopher Hillar", "authors": "Christopher Hillar, Jascha Sohl-Dickstein, Kilian Koepsell", "title": "Efficient and optimal binary Hopfield associative memory storage using\n  minimum probability flow", "comments": "6 pages, 4 figures, 2012 Neural Information Processing Systems (NIPS)\n  workshop on Discrete Optimization in Machine Learning (DISCML)", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an algorithm to store binary memories in a Hopfield neural network\nusing minimum probability flow, a recent technique to fit parameters in\nenergy-based probabilistic models. In the case of memories without noise, our\nalgorithm provably achieves optimal pattern storage (which we show is at least\none pattern per neuron) and outperforms classical methods both in speed and\nmemory recovery. Moreover, when trained on noisy or corrupted versions of a\nfixed set of binary patterns, our algorithm finds networks which correctly\nstore the originals. We also demonstrate this finding visually with the\nunsupervised storage and clean-up of large binary fingerprint images from\nsignificantly corrupted samples.\n", "versions": [{"version": "v1", "created": "Fri, 13 Apr 2012 08:28:53 GMT"}, {"version": "v2", "created": "Tue, 19 May 2015 21:46:42 GMT"}], "update_date": "2015-05-21", "authors_parsed": [["Hillar", "Christopher", ""], ["Sohl-Dickstein", "Jascha", ""], ["Koepsell", "Kilian", ""]]}, {"id": "1204.2945", "submitter": "Guillaume Hennequin", "authors": "Guillaume Hennequin, Tim P. Vogels, Wulfram Gerstner", "title": "Nonnormal amplification in random balanced neuronal networks", "comments": "13 pages, 7 figures", "journal-ref": "Physical Review E (2012) 86:011909", "doi": "10.1103/PhysRevE.86.011909", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In dynamical models of cortical networks, the recurrent connectivity can\namplify the input given to the network in two distinct ways. One is induced by\nthe presence of near-critical eigenvalues in the connectivity matrix W,\nproducing large but slow activity fluctuations along the corresponding\neigenvectors (dynamical slowing). The other relies on W being nonnormal, which\nallows the network activity to make large but fast excursions along specific\ndirections. Here we investigate the tradeoff between nonnormal amplification\nand dynamical slowing in the spontaneous activity of large random neuronal\nnetworks composed of excitatory and inhibitory neurons. We use a Schur\ndecomposition of W to separate the two amplification mechanisms. Assuming\nlinear stochastic dynamics, we derive an exact expression for the expected\namount of purely nonnormal amplification. We find that amplification is very\nlimited if dynamical slowing must be kept weak. We conclude that, to achieve\nstrong transient amplification with little slowing, the connectivity must be\nstructured. We show that unidirectional connections between neurons of the same\ntype together with reciprocal connections between neurons of different types,\nallow for amplification already in the fast dynamical regime. Finally, our\nresults also shed light on the differences between balanced networks in which\ninhibition exactly cancels excitation, and those where inhibition dominates.\n", "versions": [{"version": "v1", "created": "Fri, 13 Apr 2012 10:37:50 GMT"}], "update_date": "2012-07-31", "authors_parsed": [["Hennequin", "Guillaume", ""], ["Vogels", "Tim P.", ""], ["Gerstner", "Wulfram", ""]]}, {"id": "1204.3198", "submitter": "Ramon Ferrer i Cancho", "authors": "Ramon Ferrer-i-Cancho and Antoni Hern\\'andez-Fern\\'andez", "title": "The failure of the law of brevity in two New World primates. Statistical\n  caveats", "comments": "Little improvements in the statistical arguments", "journal-ref": "Statistical caveats. Glottotheory 4 (1), 45-55 (2013)", "doi": "10.1524/glot.2013.0004", "report-no": null, "categories": "q-bio.NC cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Parallels of Zipf's law of brevity, the tendency of more frequent words to be\nshorter, have been found in bottlenose dolphins and Formosan macaques. Although\nthese findings suggest that behavioral repertoires are shaped by a general\nprinciple of compression, common marmosets and golden-backed uakaris do not\nexhibit the law. However, we argue that the law may be impossible or difficult\nto detect statistically in a given species if the repertoire is too small, a\nproblem that could be affecting golden backed uakaris, and show that the law is\npresent in a subset of the repertoire of common marmosets. We suggest that the\nvisibility of the law will depend on the subset of the repertoire under\nconsideration or the repertoire size.\n", "versions": [{"version": "v1", "created": "Sat, 14 Apr 2012 19:25:54 GMT"}, {"version": "v2", "created": "Fri, 28 Sep 2012 17:26:00 GMT"}], "update_date": "2014-12-03", "authors_parsed": [["Ferrer-i-Cancho", "Ramon", ""], ["Hernández-Fernández", "Antoni", ""]]}, {"id": "1204.3270", "submitter": "Pat Scott", "authors": "Pat Scott, Anna I. Cowan, Christian Stricker", "title": "Quantifying impacts of short-term plasticity on neuronal information\n  transfer", "comments": "Accepted for publication in Phys Rev E. 42 pages in referee format, 9\n  figures", "journal-ref": "Phys. Rev. E 85, 041921 (2012)", "doi": "10.1103/PhysRevE.85.041921", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Short-term changes in efficacy have been postulated to enhance the ability of\nsynapses to transmit information between neurons, and within neuronal networks.\nEven at the level of connections between single neurons, direct confirmation of\nthis simple conjecture has proven elusive. By combining paired-cell recordings,\nrealistic synaptic modelling and information theory, we provide evidence that\nshort-term plasticity can not only improve, but also reduce information\ntransfer between neurons. We focus on a concrete example in rat neocortex, but\nour results may generalise to other systems. When information is contained in\nthe timings of individual spikes, we find that facilitation, depression and\nrecovery affect information transmission in proportion to their impacts upon\nthe probability of neurotransmitter release. When information is instead\nconveyed by mean spike rate only, the influences of short-term plasticity\ncritically depend on the range of spike frequencies that the target network can\ndistinguish (its effective dynamic range). Our results suggest that to\nefficiently transmit information, the brain must match synaptic type, coding\nstrategy and network connectivity during development and behaviour.\n", "versions": [{"version": "v1", "created": "Sun, 15 Apr 2012 13:59:36 GMT"}], "update_date": "2012-04-30", "authors_parsed": [["Scott", "Pat", ""], ["Cowan", "Anna I.", ""], ["Stricker", "Christian", ""]]}, {"id": "1204.3683", "submitter": "Balaji Sriram", "authors": "Balaji Sriram and Pamela Reinagel", "title": "Strong surround antagonism in the dLGN of the awake rat", "comments": "29 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classical center-surround antagonism in the early visual system is thought to\nserve important functions such as enhancing edge detection and increasing\nsparseness. The relative strength of the center and surround determine the\nspecific computation achieved. For example, weak surrounds achieve low-pass\nspatial frequency filtering and are optimal for denoising when signal-to-noise\nratio (SNR) is low. Balanced surrounds achieve band-pass spatial frequency\nfiltering and are optimal for decorrelation of responses when SNR is high.\nSurround strength has been measured in the retina and dorsal Lateral Geniculate\nNucleus (dLGN), primarily in anesthetized or ex vivo preparations. Here we\nrevisit the center-surround architecture of dLGN neurons in the un-anesthetized\nrat. We report the spatial frequency tuning responses of N=47 neurons. We fit\nthese tuning curves to a difference-of-Gaussians (DOG) model of the spatial\nreceptive field. We find that some dLGN neurons in the awake rat (N=8/47) have\nweak surrounds. The majority of cells in our sample (N=29/47), however, have\nwell-balanced center and surround strengths and band-pass tuning curves. We\nalso observed several neurons (N=10/47) with notched or dual-band-pass tuning\ncurves, a response class that has not been described previously. Within the\nspace of circularly concentric DOG models, strong surrounds were necessary and\nsufficient to explain the dual-band-pass spatial frequency tuning of these\ncells. It remains to be determined what advantage if any is conferred by this\nnovel response class, or by the heterogeneity of surround strength as such. We\nconclude that surround antagonism can be strong in the dLGN of the awake rat.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 01:46:27 GMT"}], "update_date": "2012-04-18", "authors_parsed": [["Sriram", "Balaji", ""], ["Reinagel", "Pamela", ""]]}, {"id": "1204.3822", "submitter": "Abdelmalik Moujahid", "authors": "Francisco J. Torrealdea, Cecilia Sarasola, Alicia d'Anjou, Abdelmalik\n  Moujahid, N. V\\'elez de Mendiz\\'abal", "title": "Energy efficiency of information transmission by electrically coupled\n  neurons", "comments": null, "journal-ref": "Biosystems 97 (2009) 60-71", "doi": "10.1016/j.biosystems.2009.04.004", "report-no": null, "categories": "nlin.CD math.DS q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The generation of spikes by neurons is energetically a costly process. This\npaper studies the consumption of energy and the information entropy in the\nsignalling activity of a model neuron both when it is supposed isolated and\nwhen it is coupled to another neuron by an electrical synapse. The neuron has\nbeen modelled by a four dimensional Hindmarsh-Rose type kinetic model for which\nan energy function has been deduced. For the isolated neuron values of energy\nconsumption and information entropy at different signalling regimes have been\ncomputed. For two neurons coupled by a gap junction we have analyzed the roles\nof the membrane and synapse in the contribution of the energy that is required\nfor their organized signalling. Computational results are provided for cases of\nidentical and nonidentical neurons coupled by unidirectional and bidirectional\ngap junctions. One relevant result is that there are values of the coupling\nstrength at which the organized signalling of two neurons induced by the gap\njunction takes place at relatively low values of energy consumption and the\nratio of mutual information to energy consumption is relatively high.\nTherefore, communicating at these coupling values could be energetically the\nmost efficient option.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 16:05:55 GMT"}], "update_date": "2012-04-18", "authors_parsed": [["Torrealdea", "Francisco J.", ""], ["Sarasola", "Cecilia", ""], ["d'Anjou", "Alicia", ""], ["Moujahid", "Abdelmalik", ""], ["de Mendizábal", "N. Vélez", ""]]}, {"id": "1204.3838", "submitter": "Abdelmalik Moujahid", "authors": "A. Moujahid, A. D'Anjou, F.J. Torrealdea and C. Sarasola", "title": "Energy cost reduction in the synchronization of a pair of nonidentical\n  coupled Hindmarsh-Rose neurons", "comments": null, "journal-ref": "Advances in Intelligent and Soft Computing, 2010, Volume 71/2010,\n  657-664", "doi": "10.1007/978-3-642-12433-4_77", "report-no": null, "categories": "cs.AI nlin.CD q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many biological processes involve synchronization between nonequivalent\nsystems, i.e, systems where the difference is limited to a rather small\nparameter mismatch. The maintenance of the synchronized regime in this cases is\nenergetically costly \\cite{1}. This work studies the energy implications of\nsynchronization phenomena in a pair of structurally flexible coupled neurons\nthat interact through electrical coupling. We show that the forced\nsynchronization between two nonidentical neurons creates appropriate conditions\nfor an efficient actuation of adaptive laws able to make the neurons\nstructurally approach their behaviours in order to decrease the flow of energy\nrequired to maintain the synchronization regime.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 16:50:25 GMT"}], "update_date": "2012-04-19", "authors_parsed": [["Moujahid", "A.", ""], ["D'Anjou", "A.", ""], ["Torrealdea", "F. J.", ""], ["Sarasola", "C.", ""]]}, {"id": "1204.3861", "submitter": "Daniel Larremore", "authors": "Daniel B. Larremore, Marshall Y. Carpenter, Edward Ott, Juan G.\n  Restrepo", "title": "Statistical Properties of Avalanches in Networks", "comments": "11 pages, 7 figures", "journal-ref": "Phys. Rev. E 85, 066131 (2012)", "doi": "10.1103/PhysRevE.85.066131", "report-no": null, "categories": "cond-mat.dis-nn nlin.CG physics.soc-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We characterize the distributions of size and duration of avalanches\npropagating in complex networks. By an avalanche we mean the sequence of events\ninitiated by the externally stimulated `excitation' of a network node, which\nmay, with some probability, then stimulate subsequent firings of the nodes to\nwhich it is connected, resulting in a cascade of firings. This type of process\nis relevant to a wide variety of situations, including neuroscience, cascading\nfailures on electrical power grids, and epidemology. We find that the\nstatistics of avalanches can be characterized in terms of the largest\neigenvalue and corresponding eigenvector of an appropriate adjacency matrix\nwhich encodes the structure of the network. By using mean-field analyses,\nprevious studies of avalanches in networks have not considered the effect of\nnetwork structure on the distribution of size and duration of avalanches. Our\nresults apply to individual networks (rather than network ensembles) and\nprovide expressions for the distributions of size and duration of avalanches\nstarting at particular nodes in the network. These findings might find\napplication in the analysis of branching processes in networks, such as\ncascading power grid failures and critical brain dynamics. In particular, our\nresults show that some experimental signatures of critical brain dynamics\n(i.e., power-law distributions of size and duration of neuronal avalanches),\nare robust to complex underlying network topologies.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 18:03:56 GMT"}], "update_date": "2013-10-22", "authors_parsed": [["Larremore", "Daniel B.", ""], ["Carpenter", "Marshall Y.", ""], ["Ott", "Edward", ""], ["Restrepo", "Juan G.", ""]]}, {"id": "1204.3928", "submitter": "Jan Karbowski", "authors": "Jan Karbowski", "title": "Approximate invariance of metabolic energy per synapse during\n  development in mammalian brains", "comments": "brain development, synaptogenesis, brain metabolism", "journal-ref": "PLoS ONE 7(3): e33425 (2012)", "doi": "10.1371/journal.pone.0033425", "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During mammalian development the cerebral metabolic rate correlates\nqualitatively with synaptogenesis, and both often exhibit bimodal temporal\nprofiles. Despite these non-monotonic dependencies, it is found based on\nempirical data for different mammals that regional metabolic rate per synapse\nis approximately conserved from birth to adulthood for a given species (with a\nslight deviation from this constancy for human visual and temporal cortices\nduring adolescence). A typical synapse uses about $(7\\pm 2)\\cdot 10^{3}$\nglucose molecules per second in primate cerebral cortex, and about 5 times of\nthat amount in cat and rat visual cortices. A theoretical model for brain\nmetabolic expenditure is used to estimate synaptic signaling and neural spiking\nactivity during development. It is found that synaptic efficacy is generally\ninversely correlated with average firing rate, and additionally, synapses\nconsume a bulk of metabolic energy, roughly $50-90 %$ during most of the\ndevelopmental process (except human temporal cortex $ < 50%$). Overall, these\nresults suggest a tight regulation of brain electrical and chemical activities\nduring the formation and consolidation of neural connections. This presumably\nreflects strong energetic constraints on brain development.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 21:51:34 GMT"}], "update_date": "2012-04-19", "authors_parsed": [["Karbowski", "Jan", ""]]}, {"id": "1204.4393", "submitter": "Tom Tetzlaff", "authors": "Tom Tetzlaff, Moritz Helias, Gaute T. Einevoll, Markus Diesmann", "title": "Decorrelation of neural-network activity by inhibitory feedback", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1002596", "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Correlations in spike-train ensembles can seriously impair the encoding of\ninformation by their spatio-temporal structure. An inevitable source of\ncorrelation in finite neural networks is common presynaptic input to pairs of\nneurons. Recent theoretical and experimental studies demonstrate that spike\ncorrelations in recurrent neural networks are considerably smaller than\nexpected based on the amount of shared presynaptic input. By means of a linear\nnetwork model and simulations of networks of leaky integrate-and-fire neurons,\nwe show that shared-input correlations are efficiently suppressed by inhibitory\nfeedback. To elucidate the effect of feedback, we compare the responses of the\nintact recurrent network and systems where the statistics of the feedback\nchannel is perturbed. The suppression of spike-train correlations and\npopulation-rate fluctuations by inhibitory feedback can be observed both in\npurely inhibitory and in excitatory-inhibitory networks. The effect is fully\nunderstood by a linear theory and becomes already apparent at the macroscopic\nlevel of the population averaged activity. At the microscopic level,\nshared-input correlations are suppressed by spike-train correlations: In purely\ninhibitory networks, they are canceled by negative spike-train correlations. In\nexcitatory-inhibitory networks, spike-train correlations are typically\npositive. Here, the suppression of input correlations is not a result of the\nmere existence of correlations between excitatory (E) and inhibitory (I)\nneurons, but a consequence of a particular structure of correlations among the\nthree possible pairings (EE, EI, II).\n", "versions": [{"version": "v1", "created": "Thu, 19 Apr 2012 16:01:02 GMT"}, {"version": "v2", "created": "Wed, 16 May 2012 14:09:55 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Tetzlaff", "Tom", ""], ["Helias", "Moritz", ""], ["Einevoll", "Gaute T.", ""], ["Diesmann", "Markus", ""]]}, {"id": "1204.4558", "submitter": "Ralph Stoop", "authors": "Ralph L. Stoop, Victor Saase, Clemens Wagner, Britta Stoop, Ruedi\n  Stoop", "title": "Cortical columns for quick brains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is widely believed that the particular wiring observed within cortical\ncolumns boosts neural computation. We use rewiring of neural networks\nperforming real-world cognitive tasks to study the validity of this argument.\nIn a vast survey of wirings within the column we detect, however, no traces of\nthe proposed effect. It is on the mesoscopic inter-columnar scale that the\nexistence of columns - largely irrespective of their inner organization -\nenhances the speed of information transfer and minimizes the total wiring\nlength required to bind the distributed columnar computations towards\nspatio-temporally coherent results.\n", "versions": [{"version": "v1", "created": "Fri, 20 Apr 2012 08:19:08 GMT"}], "update_date": "2012-04-23", "authors_parsed": [["Stoop", "Ralph L.", ""], ["Saase", "Victor", ""], ["Wagner", "Clemens", ""], ["Stoop", "Britta", ""], ["Stoop", "Ruedi", ""]]}, {"id": "1204.4559", "submitter": "Alessandro Farini", "authors": "F. T. Arecchi, A. Farini and N. Megna", "title": "Violation of the Leggett-Garg inequality in cognitive processes", "comments": "This paper has been withdrawn by the author due to a different\n  interpretation of data", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Leggett and Garg Inequality (LGI) is a test of the classical behaviour of\nan observed system, in the case of a single measurement channel monitored at\ndifferent times. Here we report LGI violation in cognitive tasks consisting in\nthe identification of mutually incompatible words with negligible semantic\ncontent; the violation is maximal at an inter-measurement time {\\tau}LG around\n2 sec, close to, but consistently lower than, the characteristic times\nassociated with other, semantically rich, linguistic endeavors. The LGI\nviolation persists over a time window of 1 sec around {\\tau}LG; outside this\nwindow LGI is recovered.\n", "versions": [{"version": "v1", "created": "Fri, 20 Apr 2012 08:19:59 GMT"}, {"version": "v2", "created": "Wed, 16 Jan 2013 10:31:55 GMT"}, {"version": "v3", "created": "Fri, 24 May 2013 11:49:54 GMT"}], "update_date": "2013-05-27", "authors_parsed": [["Arecchi", "F. T.", ""], ["Farini", "A.", ""], ["Megna", "N.", ""]]}, {"id": "1204.5001", "submitter": "Andrea Grigorescu", "authors": "Andrea Grigorescu, Marek Rudnicki, Michael Isik, Werner Hemmert and\n  Stefano Rini", "title": "Improving the Entropy Estimate of Neuronal Firings of Modeled Cochlear\n  Nucleus Neurons", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this correspondence information theoretical tools are used to investigate\nthe statistical properties of modeled cochlear nucleus globular bushy cell\nspike trains. The firing patterns are obtained from a simulation software that\ngenerates sample spike trains from any auditory input. Here we analyze for the\nfirst time the responses of globular bushy cells to voiced and unvoiced speech\nsounds. Classical entropy estimates, such as the direct method, are improved\nupon by considering a time-varying and time-dependent entropy estimate. With\nthis method we investigated the relationship between the predictability of the\nneuronal response and the frequency content in the auditory signals. The\nanalysis quantifies the temporal precision of the neuronal coding and the\nmemory in the neuronal response.\n", "versions": [{"version": "v1", "created": "Mon, 23 Apr 2012 08:48:14 GMT"}, {"version": "v2", "created": "Tue, 24 Apr 2012 13:30:27 GMT"}], "update_date": "2012-04-25", "authors_parsed": [["Grigorescu", "Andrea", ""], ["Rudnicki", "Marek", ""], ["Isik", "Michael", ""], ["Hemmert", "Werner", ""], ["Rini", "Stefano", ""]]}, {"id": "1204.5307", "submitter": "Elisa Benedetto", "authors": "Elisa Benedetto, Laura Sacerdote and Cristina Zucca", "title": "A first passage problem for a bivariate diffusion process: numerical\n  solution with an application to neuroscience", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a bivariate diffusion process and we study the first passage time\nof one component through a boundary. We prove that its probability density is\nthe unique solution of a new integral equation and we propose a numerical\nalgorithm for its solution. Convergence properties of this algorithm are\ndiscussed and the method is applied to the study of the integrated Brownian\nMotion and to the integrated Ornstein Uhlenbeck process. Finally a model of\nneuroscience interest is also discussed.\n", "versions": [{"version": "v1", "created": "Tue, 24 Apr 2012 08:50:14 GMT"}, {"version": "v2", "created": "Tue, 15 May 2012 11:18:01 GMT"}], "update_date": "2012-05-16", "authors_parsed": [["Benedetto", "Elisa", ""], ["Sacerdote", "Laura", ""], ["Zucca", "Cristina", ""]]}, {"id": "1204.5686", "submitter": "Alessio Franci", "authors": "Alessio Franci, Guillaume Drion, and Rodolphe Sepulchre", "title": "An organizing center in a planar model of neuronal excitability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper studies the excitability properties of a generalized\nFitzHugh-Nagumo model. The model differs from the purely competitive\nFitzHugh-Nagumo model in that it accounts for the effect of cooperative gating\nvariables such as activation of calcium currents. Excitability is explored by\nunfolding a pitchfork bifurcation that is shown to organize five different\ntypes of excitability. In addition to the three classical types of neuronal\nexcitability, two novel types are described and distinctly associated to the\npresence of cooperative variables.\n", "versions": [{"version": "v1", "created": "Wed, 25 Apr 2012 15:44:14 GMT"}], "update_date": "2012-04-26", "authors_parsed": [["Franci", "Alessio", ""], ["Drion", "Guillaume", ""], ["Sepulchre", "Rodolphe", ""]]}, {"id": "1204.5841", "submitter": "Jose Acacio de Barros", "authors": "J. Acacio de Barros, C. G. Carvalhaes, J. P. R. F. de Mendon\\c{c}a, P.\n  Suppes", "title": "Recognition of Words from the EEG Laplacian", "comments": null, "journal-ref": "Revista Brasileira de Engenharia Biom\\'edica 21, 45-59 (2006)", "doi": null, "report-no": null, "categories": "physics.med-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent works on the relationship between the electro-encephalogram (EEG) data\nand psychological stimuli show that EEG recordings can be used to recognize an\nauditory stimulus presented to a subject. The recognition rate is, however,\nstrongly affected by technical and physiological artifacts. In this work,\nsubjects were presented seven auditory simuli in the form of English words\n(first, second, third, left, right, yes, and no), and the time-locked electric\nfield was recorded with a 64 channel Neuroscan EEG system. We used the surface\nLaplacian operator to eliminate artifacts due to sources located at regions far\nfrom the electrode. Our intent with the Laplacian was to improve the\nrecognition rates of auditory stimuli from the electric field. To compute the\nLaplacian, we used a spline interpolation from spherical harmonics. The EEG\nLaplacian of the electric field were average over trials for the same auditory\nstimulus, and with those averages we constructed prototypes and test samples.\nIn addition to the Laplacian, we applied Butterworth bandpass digital filters\nto the averaged prototypes and test samples, and compared the filtered test\nsamples against the prototypes using a least squares metric in the time domain.\nWe also analyzed the effects of the spline interpolation order and bandpass\nfilter parameters in the recognition rates. Our results show that the use of\nthe Laplacian improves the recognition rates and suggests a spatial isomorphism\nbetween both subjects.\n", "versions": [{"version": "v1", "created": "Thu, 26 Apr 2012 06:38:39 GMT"}], "update_date": "2012-04-27", "authors_parsed": [["de Barros", "J. Acacio", ""], ["Carvalhaes", "C. G.", ""], ["de Mendonça", "J. P. R. F.", ""], ["Suppes", "P.", ""]]}, {"id": "1204.6176", "submitter": "Lucilla de Arcangelis", "authors": "F. Lombardi, H. J. Herrmann, C. Perrone-Capano, D. Plenz and L. de\n  Arcangelis", "title": "The balance between excitation and inhibition controls the temporal\n  organization of neuronal avalanches", "comments": "5 pages, 3 figures, to appear on Physical Review Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neuronal avalanches, measured in vitro and in vivo, exhibit a robust critical\nbehaviour. Their temporal organization hides the presence of correlations. Here\nwe present experimental measurements of the waiting time distribution between\nsuccessive avalanches in the rat cortex in vitro. This exhibits a non-monotonic\nbehaviour, not usually found in other natural processes. Numerical simulations\nprovide evidence that this behaviour is a consequence of the alternation\nbetween states of high and low activity, named up and down states, leading to a\nbalance between excitation and inhibition controlled by a single parameter.\nDuring these periods both the single neuron state and the network excitability\nlevel, keeping memory of past activity, are tuned by homeostatic mechanisms.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 11:51:56 GMT"}], "update_date": "2012-04-30", "authors_parsed": [["Lombardi", "F.", ""], ["Herrmann", "H. J.", ""], ["Perrone-Capano", "C.", ""], ["Plenz", "D.", ""], ["de Arcangelis", "L.", ""]]}, {"id": "1204.6189", "submitter": "Robert Vickerstaff BA(Hons) MA MSc DPhil", "authors": "Robert J. Vickerstaff and Allen Cheung", "title": "Which coordinate system for modelling path integration?", "comments": "55 pages, 8 figures, 7 tables. Contains one change compared to the\n  published version: the reference to Fuhs & Touretzky (2006) J. Neurosci. has\n  been changed to Burak & Fiete (2009) PLoS Comput. Biol", "journal-ref": "J. Theor. Biol. 263, 242-261 (2010)", "doi": "10.1016/j.jtbi.2009.11.021", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Path integration is a navigation strategy widely observed in nature where an\nanimal maintains a running estimate of its location during an excursion.\nEvidence suggests it is both ancient and ubiquitous in nature. Over the past\ncentury or so, canonical and neural network models have flourished, based on a\nwide range of assumptions, justifications and supporting data. Despite the\nimportance of the phenomenon, consensus and unifying principles appear lacking.\nA fundamental issue is the neural representation of space needed for biological\npath integration. This paper presents a scheme to classify path integration\nsystems on the basis of the way the home vector records and updates the spatial\nrelationship between the animal and its home location. Four extended classes of\ncoordinate systems are used to unify and review both canonical and neural\nnetwork models of path integration, from the arthropod and mammalian\nliterature. This scheme demonstrates analytical equivalence between models\nwhich may otherwise appear unrelated, and distinguishes between models which\nmay superficially appear similar. A thorough analysis is carried out of the\nequational forms of important facets of path integration including updating,\nsteering, searching and systematic errors, using each of the four coordinate\nsystems. The type of available directional cue, namely allothetic or\nidiothetic, is also considered. It is shown that on balance, the class of home\nvectors which includes the geocentric Cartesian coordinate system, appears to\nbe the most robust for biological systems. A key conclusion is that deducing\ncomputational structure from behavioural data alone will be difficult or\nimpossible, at least in the absence of an analysis of random errors.\nConsequently it is likely that further theoretical insights into path\nintegration will require an in-depth study of the effect of noise on the four\nclasses of home vectors.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 12:42:11 GMT"}], "update_date": "2012-04-30", "authors_parsed": [["Vickerstaff", "Robert J.", ""], ["Cheung", "Allen", ""]]}, {"id": "1204.6539", "submitter": "Michael Small", "authors": "Xiumin Li and Michael Small", "title": "Neuronal avalanches of a self-organized neural network with\n  active-neuron-dominant structure", "comments": "Non-final version submitted to Chaos", "journal-ref": "Chaos 22, 023104 (2012)", "doi": "10.1063/1.3701946", "report-no": null, "categories": "q-bio.NC nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neuronal avalanche is a spontaneous neuronal activity which obeys a power-law\ndistribution of population event sizes with an exponent of -3/2. It has been\nobserved in the superficial layers of cortex both \\emph{in vivo} and \\emph{in\nvitro}. In this paper we analyze the information transmission of a novel\nself-organized neural network with active-neuron-dominant structure. Neuronal\navalanches can be observed in this network with appropriate input intensity. We\nfind that the process of network learning via spike-timing dependent plasticity\ndramatically increases the complexity of network structure, which is finally\nself-organized to be active-neuron-dominant connectivity. Both the entropy of\nactivity patterns and the complexity of their resulting post-synaptic inputs\nare maximized when the network dynamics are propagated as neuronal avalanches.\nThis emergent topology is beneficial for information transmission with high\nefficiency and also could be responsible for the large information capacity of\nthis network compared with alternative archetypal networks with different\nneural connectivity.\n", "versions": [{"version": "v1", "created": "Mon, 30 Apr 2012 03:01:25 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Li", "Xiumin", ""], ["Small", "Michael", ""]]}]