[{"id": "1303.0013", "submitter": "Pascal Grange", "authors": "Pascal Grange, Michael Hawrylycz, Partha P. Mitra", "title": "Cell-type-specific microarray data and the Allen atlas: quantitative\n  analysis of brain-wide patterns of correlation and density", "comments": "V1: 88 pages, 37 figures, 43 tables; V2: 137 pages, new section\n  discussing different fitting panels", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Allen Atlas of the adult mouse brain is used to estimate the\nregion-specificity of 64 cell types whose transcriptional profile in the mouse\nbrain has been measured in microarray experiments. We systematically analyze\nthe preliminary results presented in [arXiv:1111.6217], using the techniques\nimplemented in the Brain Gene Expression Analysis toolbox. In particular, for\neach cell-type-specific sample in the study, we compute a brain-wide\ncorrelation profile to the Allen Atlas, and estimate a brain-wide density\nprofile by solving a quadratic optimization problem at each voxel in the mouse\nbrain. We characterize the neuroanatomical properties of the correlation and\ndensity profiles by ranking the regions of the left hemisphere delineated in\nthe Allen Reference Atlas. We compare these rankings to prior biological\nknowledge of the brain region from which the cell-type-specific sample was\nextracted.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2013 21:02:36 GMT"}, {"version": "v2", "created": "Sat, 12 Oct 2013 01:45:57 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Grange", "Pascal", ""], ["Hawrylycz", "Michael", ""], ["Mitra", "Partha P.", ""]]}, {"id": "1303.0256", "submitter": "Marcelo Tragtenberg Dr.", "authors": "M. Girardi-Schappo, M. H. R. Tragtenberg, O. Kinouchi", "title": "A Brief History of Excitable Map-Based Neurons and Neural Networks", "comments": "53 pages, 13 figures, submitted to Journal of Neuroscience Methods", "journal-ref": "Journal of Neuroscience Methods, Volume 220, Issue 2, 15 November\n  2013, Pages 116-130", "doi": "10.1016/j.jneumeth.2013.07.014", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn nlin.CD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This review gives a short historical account of the excitable maps approach\nfor modeling neurons and neuronal networks. Some early models, due to Pasemann\n(1993), Chialvo (1995) and Kinouchi and Tragtenberg (1996), are compared with\nmore recent proposals by Rulkov (2002) and Izhikevich (2003). We also review\nmap-based schemes for electrical and chemical synapses and some recent findings\nas critical avalanches in map-based neural networks. We conclude with\nsuggestions for further work in this area like more efficient maps,\ncompartmental modeling and close dynamical comparison with conductance-based\nmodels.\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2013 19:25:54 GMT"}], "update_date": "2016-02-03", "authors_parsed": [["Girardi-Schappo", "M.", ""], ["Tragtenberg", "M. H. R.", ""], ["Kinouchi", "O.", ""]]}, {"id": "1303.0402", "submitter": "Mayya Miftakhova", "authors": "V.V. Babenko, M.M. Miftakhova, D.V. Yavna", "title": "Organizational properties of second-order visual filters sensitive to\n  the orientation modulations", "comments": "4 pages, 3 figures; this is the English version of paper; it's\n  published in Russian", "journal-ref": "Babenko V.V., Miftakhova M.M., Yavna D.V. Organizational\n  properties of second-order visual filters sensitive to the orientation\n  modulations // Proceedings of 10th International Conference \"Applied Optics\",\n  St. Petersburg. P. 331-334. 2012", "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we show psychophysical study of second-order visual mechanisms sensitive\nto the orientation modulations. Selectivity to orientation, phase and spatial\nfrequency of modulation is measured. Bandwidths for phase (0,5{\\pi}) and\norientation (33,75 deg) are defined, but there is no evidence for spatial\nfrequency selectivity.\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2013 16:50:14 GMT"}], "update_date": "2013-03-05", "authors_parsed": [["Babenko", "V. V.", ""], ["Miftakhova", "M. M.", ""], ["Yavna", "D. V.", ""]]}, {"id": "1303.0591", "submitter": "Yandong Huang", "authors": "Yandong Huang, Sten R\\\"udiger, and Jianwei Shuai", "title": "Intrinsically discrete channel-gating dynamics at small membrane patch\n  area for the Hodgkin-Huxley neurons", "comments": "This paper has been withdrawn", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the author due to some incorrect\npresentation in the results and discussion part.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 02:46:19 GMT"}, {"version": "v2", "created": "Mon, 11 Mar 2013 02:23:59 GMT"}, {"version": "v3", "created": "Sun, 17 Mar 2013 06:36:01 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Huang", "Yandong", ""], ["Rüdiger", "Sten", ""], ["Shuai", "Jianwei", ""]]}, {"id": "1303.0742", "submitter": "Yoann Isaac", "authors": "Quentin Barth\\'elemy, C\\'edric Gouy-Pailler, Yoann Isaac, Antoine\n  Souloumiac, Anthony Larue, J\\'er\\^ome I. Mars", "title": "Multivariate Temporal Dictionary Learning for EEG", "comments": null, "journal-ref": "Published in Journal of Neuroscience Methods, vol. 215, pp. 19-28,\n  2013", "doi": null, "report-no": null, "categories": "cs.LG q-bio.NC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article addresses the issue of representing electroencephalographic\n(EEG) signals in an efficient way. While classical approaches use a fixed Gabor\ndictionary to analyze EEG signals, this article proposes a data-driven method\nto obtain an adapted dictionary. To reach an efficient dictionary learning,\nappropriate spatial and temporal modeling is required. Inter-channels links are\ntaken into account in the spatial multivariate model, and shift-invariance is\nused for the temporal model. Multivariate learned kernels are informative (a\nfew atoms code plentiful energy) and interpretable (the atoms can have a\nphysiological meaning). Using real EEG data, the proposed method is shown to\noutperform the classical multichannel matching pursuit used with a Gabor\ndictionary, as measured by the representative power of the learned dictionary\nand its spatial flexibility. Moreover, dictionary learning can capture\ninterpretable patterns: this ability is illustrated on real data, learning a\nP300 evoked potential.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 15:58:24 GMT"}], "update_date": "2013-03-22", "authors_parsed": [["Barthélemy", "Quentin", ""], ["Gouy-Pailler", "Cédric", ""], ["Isaac", "Yoann", ""], ["Souloumiac", "Antoine", ""], ["Larue", "Anthony", ""], ["Mars", "Jérôme I.", ""]]}, {"id": "1303.0875", "submitter": "Sergio Romano", "authors": "Sergio Romano, Mariano Sigman, Santiago Figueira", "title": "LT^2C^2: A language of thought with Turing-computable Kolmogorov\n  complexity", "comments": "14 pages, 4 figures", "journal-ref": "Papers in Physics 5, 050001 (2013)", "doi": "10.4279/PIP.050001", "report-no": null, "categories": "q-bio.NC cs.AI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, we present a theoretical effort to connect the theory of\nprogram size to psychology by implementing a concrete language of thought with\nTuring-computable Kolmogorov complexity (LT^2C^2) satisfying the following\nrequirements: 1) to be simple enough so that the complexity of any given finite\nbinary sequence can be computed, 2) to be based on tangible operations of human\nreasoning (printing, repeating,...), 3) to be sufficiently powerful to generate\nall possible sequences but not too powerful as to identify regularities which\nwould be invisible to humans. We first formalize LT^2C^2, giving its syntax and\nsemantics and defining an adequate notion of program size. Our setting leads to\na Kolmogorov complexity function relative to LT^2C^2 which is computable in\npolynomial time, and it also induces a prediction algorithm in the spirit of\nSolomonoff's inductive inference theory. We then prove the efficacy of this\nlanguage by investigating regularities in strings produced by participants\nattempting to generate random strings. Participants had a profound\nunderstanding of randomness and hence avoided typical misconceptions such as\nexaggerating the number of alternations. We reasoned that remaining\nregularities would express the algorithmic nature of human thoughts, revealed\nin the form of specific patterns. Kolmogorov complexity relative to LT^2C^2\npassed three expected tests examined here: 1) human sequences were less complex\nthan control PRNG sequences, 2) human sequences were not stationary, showing\ndecreasing values of complexity resulting from fatigue, 3) each individual\nshowed traces of algorithmic stability since fitting of partial sequences was\nmore effective to predict subsequent sequences than average fits. This work\nextends on previous efforts to combine notions of Kolmogorov complexity theory\nand algorithmic information theory to psychology, by explicitly ...\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2013 21:51:55 GMT"}], "update_date": "2013-03-06", "authors_parsed": [["Romano", "Sergio", ""], ["Sigman", "Mariano", ""], ["Figueira", "Santiago", ""]]}, {"id": "1303.1018", "submitter": "Tilo Schwalger", "authors": "Tilo Schwalger and Benjamin Lindner", "title": "Patterns of interval correlations in neural oscillators with adaptation", "comments": "Without the typo occurring in the journal publication (page 2, symbol\n  $v_T$ has been misprinted in the reference below)", "journal-ref": "Front. Comput. Neurosci. 2017; 7:164", "doi": "10.3389/fncom.2013.00164", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural firing is often subject to negative feedback by adaptation currents.\nThese currents can induce strong correlations among the time intervals between\nspikes. Here we study analytically the interval correlations of a broad class\nof noisy neural oscillators with spike-triggered adaptation of arbitrary\nstrength and time scale. Our weak-noise theory provides a general relation\nbetween the correlations and the phase-response curve (PRC) of the oscillator,\nproves anti-correlations between neighboring intervals for adapting neurons\nwith type I PRC and identifies a single order parameter that determines the\nqualitative pattern of correlations. Monotonically decaying or oscillating\ncorrelation structures can be related to qualitatively different voltage traces\nafter spiking, which can be explained by the phase plane geometry. At high\nfiring rates, the long-term variability of the spike train associated with the\ncumulative interval correlations becomes small, independent of model details.\nOur results are verified by comparison with stochastic simulations of the\nexponential, leaky, and generalized integrate-and-fire models with adaptation.\n", "versions": [{"version": "v1", "created": "Tue, 5 Mar 2013 12:45:24 GMT"}, {"version": "v2", "created": "Wed, 26 Apr 2017 07:08:30 GMT"}], "update_date": "2017-04-27", "authors_parsed": [["Schwalger", "Tilo", ""], ["Lindner", "Benjamin", ""]]}, {"id": "1303.1939", "submitter": "Adrien Wohrer", "authors": "Adrien Wohrer and Christian K. Machens", "title": "Percept formation from neural populations in sensory decision-making\n  tasks", "comments": "Main text: 31 pages, 7 figures. Supplementary information: 10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a standard linear readout model of perceptual integration from a\npopulation of sensory neurons. We show that the readout can be associated to a\nset of characteristic equations which summarize the joint trial-to-trial\ncovariance structure of neural activities and animal percept. These\ncharacteristic equations implicitly determine the readout parameters that were\nused by the animal to create its percept. In particular, they implicitly\nconstrain the temporal integration window w and the typical number of neurons K\nwhich give rise to the percept. Comparing neural and behavioral sensitivity\nalone cannot disentangle these two sources of perceptual integration, so the\ncharacteristic equations also involve a measure of choice signals, like those\nassessed by the classic experimental measure of choice probabilities. We then\npropose a statistical method of analysis which allows to recover the typical\nscales of integration w and K from finite numbers of recorded neurons and\nrecording trials, and show the efficiency of this method on an artificial\nencoding network. We also study the statistical method theoretically, and\nrelate its laws of convergence to the underlying structure of neural activity\nin the population, as described through its singular value decomposition.\nAltogether, our method provides the first thorough interpretation of\nfeedforward percept formation from a population of sensory neurons. It can\nreadily be applied to experimental recordings in classic sensory\ndecision-making tasks, and hopefully provide new insights into the nature of\nperceptual integration.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2013 10:28:35 GMT"}], "update_date": "2013-03-11", "authors_parsed": [["Wohrer", "Adrien", ""], ["Machens", "Christian K.", ""]]}, {"id": "1303.2256", "submitter": "Markus Dahlem", "authors": "Markus A. Dahlem", "title": "Migraine generator network and spreading depression dynamics as\n  neuromodulation targets in episodic migraine", "comments": "12 pages, 8 figures, revised version", "journal-ref": null, "doi": "10.1063/1.4813815", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Migraine is a common disabling headache disorder characterized by recurrent\nepisodes sometimes preceded or accompanied by focal neurological symptoms\ncalled aura. The relation between two subtypes, migraine without aura (MWoA)\nand migraine with aura (MWA), is explored with the aim to identify targets for\nneuromodulation techniques. To this end, a dynamically regulated control system\nis schematically reduced to a network of the trigeminal nerve, which innervates\nthe cranial circulation, an associated descending modulatory network of\nbrainstem nuclei, and parasympathetic vasomotor efferents. This extends the\nidea of a migraine generator region in the brainstem to a larger network and is\nstill simple and explicit enough to open up possibilities for mathematical\nmodeling in the future. In this study, it is suggested that the migraine\ngenerator network (MGN) is driven and may therefore respond differently to\ndifferent spatio-temporal noxious input in the migraine subtypes MWA and MWoA.\nThe noxious input is caused by a cortical perturbation of homeostasis, known as\nspreading depression (SD). The MGN might even trigger SD in the first place by\na failure in vasomotor control. As a consequence, migraine is considered as an\ninherently dynamical disease to which a linear course from upstream to\ndownstream events would not do justice. Minimally invasive and noninvasive\nneuromodulation techniques are briefly reviewed and their rational is discussed\nin the context of the proposed mechanism.\n", "versions": [{"version": "v1", "created": "Sat, 9 Mar 2013 19:21:41 GMT"}, {"version": "v2", "created": "Wed, 15 May 2013 14:37:01 GMT"}], "update_date": "2014-08-13", "authors_parsed": [["Dahlem", "Markus A.", ""]]}, {"id": "1303.2380", "submitter": "Le Ny Arnaud", "authors": "Arnaud Le Ny", "title": "Parsimonious Description of Generalized Gibbs Measures : Decimation of\n  the 2d-Ising Model", "comments": "32 pages, preliminary version", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cond-mat.stat-mech q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we detail and complete the existing characterizations of the\ndecimation of the Ising model on $\\Z^2$ in the generalized Gibbs context. We\nfirst recall a few features of the Dobrushin program of restoration of\nGibbsianness and present the construction of global specifications consistent\nwith the extremal decimated measures. We use them to consider these\nrenormalized measures as almost Gibbsian measures and to precise its convex set\nof DLR measures. We also recall the weakly Gibbsian description and complete it\nusing a potential that admits a quenched correlation decay, i.e. a well-defined\nconfiguration-dependent length beyond which this potential decays\nexponentially. We use these results to incorporate these decimated measures in\nthe new framework of parsimonious random fields that has been recently\ndeveloped to investigate probability aspects related to neurosciences.\n", "versions": [{"version": "v1", "created": "Sun, 10 Mar 2013 21:47:15 GMT"}], "update_date": "2013-03-12", "authors_parsed": [["Ny", "Arnaud Le", ""]]}, {"id": "1303.2876", "submitter": "Andrew Leifer", "authors": "Steven J. Husson (1 and 2) Alexander Gottschalk (3) and Andrew M.\n  Leifer (4) ((1) Functional Genomics and Proteomics, Department of Biology, KU\n  Leuven, Belgium. (2) SPHERE - Systemic Physiological & Ecotoxicological\n  Research, Department of Biology, University of Antwerp, Belgium. (3) Buchmann\n  Institute for Molecular Life Sciences, Johann Wolfgang Goethe-University\n  Frankfurt, Germany. (4) Lewis-Sigler Institute for Integrative Genomics,\n  Princeton University, USA.)", "title": "Optogenetic manipulation of neural activity in C. elegans: from synapse\n  to circuits and behavior", "comments": "28 pages, 3 figures. Accepted for publication in Biology of the Cell.\n  Available from publisher at\n  http://onlinelibrary.wiley.com/doi/10.1111/boc.201200069/abstract Princeton\n  University's Open Access Policy is at\n  http://www.princeton.edu/dof/policies/publ/fac/open-access-policy/", "journal-ref": null, "doi": "10.1111/boc.201200069", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emerging field of optogenetics allows for optical activation or\ninhibition of neurons and other tissue in the nervous system. In 2005\noptogenetic proteins were expressed in the nematode C. elegans for the first\ntime. Since then, C. elegans has served as a powerful platform upon which to\nconduct optogenetic investigations of synaptic function, circuit dynamics and\nthe neuronal basis of behavior. The C. elegans nervous system, consisting of\n302 neurons, whose connectivity and morphology has been mapped completely,\ndrives a rich repertoire of behaviors that are quantifiable by video\nmicroscopy. This model organism's compact nervous system, quantifiable\nbehavior, genetic tractability and optical accessibility make it especially\namenable to optogenetic interrogation. Channelrhodopsin-2 (ChR2), halorhodopsin\n(NpHR/Halo) and other common optogenetic proteins have all been expressed in C.\nelegans. Moreover recent advances leveraging molecular genetics and patterned\nlight illumination have now made it possible to target photoactivation and\ninhibition to single cells and to do so in worms as they behave freely. Here we\ndescribe techniques and methods for optogenetic manipulation in C. elegans. We\nreview recent work using optogenetics and C. elegans for neuroscience\ninvestigations at the level of synapses, circuits and behavior.\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2013 13:33:50 GMT"}, {"version": "v2", "created": "Thu, 9 May 2013 21:33:08 GMT"}], "update_date": "2013-05-13", "authors_parsed": [["Husson", "Steven J.", "", "1 and 2"], ["Gottschalk", "Alexander", ""], ["Leifer", "Andrew M.", ""]]}, {"id": "1303.3067", "submitter": "Chuan Kai Kenneth Lim", "authors": "Chuan Kai Kenneth. Lim, T. Prodromakis", "title": "Computing Motion with 3D Memristive Grid", "comments": "Supplementary Materials not uploaded online yet", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computing the relative motion of objects is an important navigation task that\nwe routinely perform by relying on inherently unreliable biological cells in\nthe retina. The non-linear and adaptive response of memristive devices make\nthem excellent building blocks for realizing complex synaptic-like\narchitectures that are common in the human retina. Here, we introduce a novel\nmemristive thresholding scheme that facilitates the detection of moving edges.\nIn addition, a double-layered 3-D memristive network is employed for modeling\nthe motion computations that take place in both the Outer Plexiform Layer (OPL)\nand Inner Plexiform Layer (IPL) that enables the detection of on-center and\noff-center transient responses. Applying the transient detection results, it is\nshown that it is possible to generate an estimation of the speed and direction\na moving object.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2013 00:11:15 GMT"}], "update_date": "2013-03-14", "authors_parsed": [["Lim", "Chuan Kai Kenneth.", ""], ["Prodromakis", "T.", ""]]}, {"id": "1303.3287", "submitter": "Michael Okun", "authors": "Michael Okun, Pierre Yger and Kenneth D. Harris", "title": "How (not) to assess the importance of correlations for the matching of\n  spontaneous and evoked activity: a response", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A response to a comment of Fiser et al.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2013 20:39:44 GMT"}], "update_date": "2013-03-15", "authors_parsed": [["Okun", "Michael", ""], ["Yger", "Pierre", ""], ["Harris", "Kenneth D.", ""]]}, {"id": "1303.3483", "submitter": "Horacio G. Rotstein", "authors": "Horacio G. Rotstein and Farzan Nadim", "title": "Frequency preference in two-dimensional neural models: a linear analysis\n  of the interaction between resonant and amplifying currents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.PS q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many neuron types exhibit preferred frequency responses in their voltage\namplitude (resonance) or phase shift to subthreshold oscillatory currents, but\nthe effect of biophysical parameters on these properties is not well\nunderstood. We propose a general framework to analyze the role of different\nionic currents and their interactions in shaping the properties of impedance\namplitude and phase in linearized biophysical models and demonstrate this\napproach in a two-dimensional linear model with two effective conductances gL\nand g1. We compute the key attributes of impedance and phase (resonance\nfrequency and amplitude, zero-phase frequency, selectivity, etc.) in the gL-g1\nparameter space. Using these attribute diagrams we identify two basic\nmechanisms for the generation of resonance: an increase in the resonance\namplitude as g1 increases while the overall impedance is decreased, and an\nincrease in the maximal impedance, without any change in the input resistance,\nas the ionic current time constant increases. We use the attribute diagrams to\nanalyze resonance and phase of the linearizations of two biophysical models\nthat include resonant (Ih or slow potassium) and amplifying currents\n(persistent sodium). In the absence of amplifying currents, the two models\nbehave similarly as the conductances of the resonant currents is increased\nwhereas, with the amplifying current present, the two models have qualitatively\nopposite responses. This work provides a general method for decoding the effect\nof biophysical parameters on linear membrane resonance and phase by tracking\ntrajectories, parametrized by the relevant biophysical parameter, in\npre-constructed attribute diagrams.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2013 15:45:24 GMT"}], "update_date": "2013-03-15", "authors_parsed": [["Rotstein", "Horacio G.", ""], ["Nadim", "Farzan", ""]]}, {"id": "1303.3907", "submitter": "Eugene Lerman", "authors": "Lee DeVille and Eugene Lerman", "title": "Modular dynamical systems on networks", "comments": "37 pages. Major revision of arXiv:1008.5359 [math.DS]. Following\n  referees' suggestions we made the paper more accessible for applied\n  dynamicists", "journal-ref": "J EMS 17, Issue 12, 2015, pp. 2977--3013", "doi": null, "report-no": null, "categories": "math.DS physics.soc-ph q-bio.MN q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new framework for the study of continuous time dynamical systems\non networks. We view such dynamical systems as collections of interacting\ncontrol systems. We show that a class of maps between graphs called graph\nfibrations give rise to maps between dynamical systems on networks. This allows\nus to produce conjugacy between dynamical systems out of combinatorial data. In\nparticular we show that surjective graph fibrations lead to synchrony subspaces\nin networks. The injective graph fibrations, on the other hand, give rise to\nsurjective maps from large dynamical systems to smaller ones. One can view\nthese surjections as a kind of \"fast/slow\" variable decompositions or as\n\"abstractions\" in the computer science sense of the word.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2013 21:10:25 GMT"}], "update_date": "2018-08-30", "authors_parsed": [["DeVille", "Lee", ""], ["Lerman", "Eugene", ""]]}, {"id": "1303.4164", "submitter": "Garrett Evans", "authors": "Garrett N. Evans and John C. Collins", "title": "Neurally Implementable Semantic Networks", "comments": "32 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose general principles for semantic networks allowing them to be\nimplemented as dynamical neural networks. Major features of our scheme include:\n(a) the interpretation that each node in a network stands for a bound\nintegration of the meanings of all nodes and external events the node links\nwith; (b) the systematic use of nodes that stand for categories or types, with\nseparate nodes for instances of these types; (c) an implementation of\nrelationships that does not use intrinsically typed links between nodes.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2013 06:18:25 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Evans", "Garrett N.", ""], ["Collins", "John C.", ""]]}, {"id": "1303.5111", "submitter": "Marcelo A. Montemurro", "authors": "In\\'es Samengo, Germ\\'an Mato, Daniel H. Elijah, Susanne Schreiber,\n  and Marcelo A. Montemurro", "title": "Linking dynamical and functional properties of intrinsically bursting\n  neurons", "comments": "22 pages, 11 figure, to appear in the Journal of Computational\n  Neuroscience", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several studies have shown that bursting neurons can encode information in\nthe number of spikes per burst: As the stimulus varies, so does the length of\nindividual bursts. The represented stimuli, however, vary substantially among\ndifferent sensory modalities and different neurons. The goal of this paper is\nto determine which kind of stimulus features can be encoded in burst length,\nand how those features depend on the mathematical properties of the underlying\ndynamical system. We show that the initiation and termination of each burst is\ntriggered by specific stimulus features whose temporal characteristsics are\ndetermined by the types of bifurcations that initiate and terminate firing in\neach burst. As only a few bifurcations are possible, only a restricted number\nof encoded features exists. Here we focus specifically on describing parabolic,\nsquare-wave and elliptic bursters. We find that parabolic bursters, whose\nfiring is initiated and terminated by saddle-node bifurcations, behave as\nprototypical integrators: Firing is triggered by depolarizing stimuli, and\nlasts for as long as excitation is prolonged. Elliptic bursters, contrastingly,\nconstitute prototypical resonators, since both the initiating and terminating\nbifurcations possess well-defined oscillation time scales. Firing is therefore\ntriggered by stimulus stretches of matching frequency and terminated by a\nphase-inversion in the oscillation. The behavior of square-wave bursters is\nsomewhat intermediate, since they are triggered by a fold bifurcation of cycles\nof well-defined frequency but are terminated by a homoclinic bifurcation\nlacking an oscillating time scale. These correspondences show that stimulus\nselectivity is determined by the type of bifurcations. We also demonstrate that\nadditional biological properties that do not modify the bifurcation structure\nplay a minor role in stimulus encoding.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 22:30:46 GMT"}], "update_date": "2013-03-22", "authors_parsed": [["Samengo", "Inés", ""], ["Mato", "Germán", ""], ["Elijah", "Daniel H.", ""], ["Schreiber", "Susanne", ""], ["Montemurro", "Marcelo A.", ""]]}, {"id": "1303.5616", "submitter": "Thomas Wiecki", "authors": "Thomas V. Wiecki", "title": "Sequential sampling models in computational psychiatry: Bayesian\n  parameter estimation, model selection and classification", "comments": "Review. Final prelim paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Current psychiatric research is in crisis. In this review I will describe the\ncauses of this crisis and highlight recent efforts to overcome current\nchallenges. One particularly promising approach is the emerging field of\ncomputational psychiatry. By using methods and insights from computational\ncognitive neuroscience, computational psychiatry might enable us to move from a\nsymptom-based description of mental illness to descriptors based on objective\ncomputational multidimensional functional variables. To exemplify this I will\nsurvey recent efforts towards this goal. I will then describe a set of methods\nthat together form a toolbox of cognitive models to aid this research program.\nAt the core of this toolbox are sequential sampling models which have been used\nto explain diverse cognitive neuroscience phenomena but have so far seen little\nadoption in psychiatric research. I will then describe how these models can be\nfitted to subject data and highlight how hierarchical Bayesian estimation\nprovides a rich framework with many desirable properties and benefits compared\nto traditional optimization-based approaches. Finally, non-parametric Bayesian\nmethods provide general solutions to the problem of classifying mental illness\nwithin this framework.\n", "versions": [{"version": "v1", "created": "Fri, 22 Mar 2013 13:38:14 GMT"}], "update_date": "2013-03-25", "authors_parsed": [["Wiecki", "Thomas V.", ""]]}, {"id": "1303.6175", "submitter": "Ramon Ferrer i Cancho", "authors": "R. Ferrer-i-Cancho, A. Hern\\'andez-Fern\\'andez, D. Lusseau, G.\n  Agoramoorthy, M. J. Hsu and S. Semple", "title": "Compression as a universal principle of animal behavior", "comments": "This is the pre-proofed version. The published version will be\n  available at\n  http://onlinelibrary.wiley.com/journal/10.1111/%28ISSN%291551-6709", "journal-ref": null, "doi": "10.1111/cogs.12061", "report-no": null, "categories": "q-bio.NC cs.CL cs.IT math.IT physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A key aim in biology and psychology is to identify fundamental principles\nunderpinning the behavior of animals, including humans. Analyses of human\nlanguage and the behavior of a range of non-human animal species have provided\nevidence for a common pattern underlying diverse behavioral phenomena: words\nfollow Zipf's law of brevity (the tendency of more frequently used words to be\nshorter), and conformity to this general pattern has been seen in the behavior\nof a number of other animals. It has been argued that the presence of this law\nis a sign of efficient coding in the information theoretic sense. However, no\nstrong direct connection has been demonstrated between the law and compression,\nthe information theoretic principle of minimizing the expected length of a\ncode. Here we show that minimizing the expected code length implies that the\nlength of a word cannot increase as its frequency increases. Furthermore, we\nshow that the mean code length or duration is significantly small in human\nlanguage, and also in the behavior of other species in all cases where\nagreement with the law of brevity has been found. We argue that compression is\na general principle of animal behavior, that reflects selection for efficiency\nof coding.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2013 15:43:48 GMT"}], "update_date": "2014-12-03", "authors_parsed": [["Ferrer-i-Cancho", "R.", ""], ["Hernández-Fernández", "A.", ""], ["Lusseau", "D.", ""], ["Agoramoorthy", "G.", ""], ["Hsu", "M. J.", ""], ["Semple", "S.", ""]]}, {"id": "1303.6708", "submitter": "Simon Friedmann", "authors": "Simon Friedmann, Nicolas Fr\\'emaux, Johannes Schemmel, Wulfram\n  Gerstner, Karlheinz Meier", "title": "Reward-based learning under hardware constraints - Using a RISC\n  processor embedded in a neuromorphic substrate", "comments": "37 pages, 11 figures, to be published in Frontiers in Neuromorphic\n  Engineering. This version contains major additions to the result and\n  discussion parts", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, we propose and analyze in simulations a new, highly flexible\nmethod of implementing synaptic plasticity in a wafer-scale, accelerated\nneuromorphic hardware system. The study focuses on globally modulated STDP, as\na special use-case of this method. Flexibility is achieved by embedding a\ngeneral-purpose processor dedicated to plasticity into the wafer. To evaluate\nthe suitability of the proposed system, we use a reward modulated STDP rule in\na spike train learning task. A single layer of neurons is trained to fire at\nspecific points in time with only the reward as feedback. This model is\nsimulated to measure its performance, i.e. the increase in received reward\nafter learning. Using this performance as baseline, we then simulate the model\nwith various constraints imposed by the proposed implementation and compare the\nperformance. The simulated constraints include discretized synaptic weights, a\nrestricted interface between analog synapses and embedded processor, and\nmismatch of analog circuits. We find that probabilistic updates can increase\nthe performance of low-resolution weights, a simple interface between analog\nsynapses and processor is sufficient for learning, and performance is\ninsensitive to mismatch. Further, we consider communication latency between\nwafer and the conventional control computer system that is simulating the\nenvironment. This latency increases the delay, with which the reward is sent to\nthe embedded processor. Because of the time continuous operation of the analog\nsynapses, delay can cause a deviation of the updates as compared to the not\ndelayed situation. We find that for highly accelerated systems latency has to\nbe kept to a minimum. This study demonstrates the suitability of the proposed\nimplementation to emulate the selected reward modulated STDP learning rule.\n", "versions": [{"version": "v1", "created": "Wed, 27 Mar 2013 00:05:35 GMT"}, {"version": "v2", "created": "Tue, 20 Aug 2013 08:04:03 GMT"}], "update_date": "2013-08-21", "authors_parsed": [["Friedmann", "Simon", ""], ["Frémaux", "Nicolas", ""], ["Schemmel", "Johannes", ""], ["Gerstner", "Wulfram", ""], ["Meier", "Karlheinz", ""]]}, {"id": "1303.7186", "submitter": "Thouis Jones", "authors": "Verena Kaynig, Amelio Vazquez-Reina, Seymour Knowles-Barley, Mike\n  Roberts, Thouis R. Jones, Narayanan Kasthuri, Eric Miller, Jeff Lichtman,\n  Hanspeter Pfister", "title": "Large-Scale Automatic Reconstruction of Neuronal Processes from Electron\n  Microscopy Images", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automated sample preparation and electron microscopy enables acquisition of\nvery large image data sets. These technical advances are of special importance\nto the field of neuroanatomy, as 3D reconstructions of neuronal processes at\nthe nm scale can provide new insight into the fine grained structure of the\nbrain. Segmentation of large-scale electron microscopy data is the main\nbottleneck in the analysis of these data sets. In this paper we present a\npipeline that provides state-of-the art reconstruction performance while\nscaling to data sets in the GB-TB range. First, we train a random forest\nclassifier on interactive sparse user annotations. The classifier output is\ncombined with an anisotropic smoothing prior in a Conditional Random Field\nframework to generate multiple segmentation hypotheses per image. These\nsegmentations are then combined into geometrically consistent 3D objects by\nsegmentation fusion. We provide qualitative and quantitative evaluation of the\nautomatic segmentation and demonstrate large-scale 3D reconstructions of\nneuronal processes from a $\\mathbf{27,000}$ $\\mathbf{\\mu m^3}$ volume of brain\ntissue over a cube of $\\mathbf{30 \\; \\mu m}$ in each dimension corresponding to\n1000 consecutive image sections. We also introduce Mojo, a proofreading tool\nincluding semi-automated correction of merge errors based on sparse user\nscribbles.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 17:20:20 GMT"}], "update_date": "2013-03-29", "authors_parsed": [["Kaynig", "Verena", ""], ["Vazquez-Reina", "Amelio", ""], ["Knowles-Barley", "Seymour", ""], ["Roberts", "Mike", ""], ["Jones", "Thouis R.", ""], ["Kasthuri", "Narayanan", ""], ["Miller", "Eric", ""], ["Lichtman", "Jeff", ""], ["Pfister", "Hanspeter", ""]]}, {"id": "1303.7200", "submitter": "Chrisantha Fernando Dr", "authors": "Chrisantha Fernando", "title": "Design for a Darwinian Brain: Part 1. Philosophy and Neuroscience", "comments": "Darwinian Neurodynamics. Submitted as a two part paper to Living\n  Machines 2013 Natural History Museum, London", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI q-bio.NC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Physical symbol systems are needed for open-ended cognition. A good way to\nunderstand physical symbol systems is by comparison of thought to chemistry.\nBoth have systematicity, productivity and compositionality. The state of the\nart in cognitive architectures for open-ended cognition is critically assessed.\nI conclude that a cognitive architecture that evolves symbol structures in the\nbrain is a promising candidate to explain open-ended cognition. Part 2 of the\npaper presents such a cognitive architecture.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 18:45:52 GMT"}], "update_date": "2013-03-29", "authors_parsed": [["Fernando", "Chrisantha", ""]]}]