[{"id": "1401.0444", "submitter": "Vincent Wens", "authors": "Vincent Wens", "title": "Investigating complex networks with inverse models: analytical aspects\n  of spatial leakage and connectivity estimation", "comments": "19 pages, 4 figures, including 5 appendices; v2: minor edits, 1\n  appendix added; v3: expanded version, v4: minor edits", "journal-ref": "Physical Review E 91, 012823 (2015)", "doi": "10.1103/PhysRevE.91.012823", "report-no": null, "categories": "physics.data-an q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network theory and inverse modeling are two standard tools of applied\nphysics, whose combination is needed when studying the dynamical organization\nof spatially distributed systems from indirect measurements. However, the\nassociated connectivity estimation may be affected by spatial leakage, an\nartifact of inverse modeling that limits the interpretability of network\nanalysis. This paper investigates general analytical aspects pertaining to this\nissue. First, the existence of spatial leakage is derived from the topological\nstructure of inverse operators. Then, the geometry of spatial leakage is\nmodeled and used to define a geometric correction scheme, which limits spatial\nleakage effects in connectivity estimation. Finally, this new approach for\nnetwork analysis is compared analytically to existing methods based on linear\nregressions, which are shown to yield biased coupling estimates.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2014 14:09:31 GMT"}, {"version": "v2", "created": "Mon, 6 Jan 2014 08:16:56 GMT"}, {"version": "v3", "created": "Wed, 10 Dec 2014 17:36:40 GMT"}, {"version": "v4", "created": "Thu, 29 Jan 2015 13:37:24 GMT"}], "update_date": "2015-01-30", "authors_parsed": [["Wens", "Vincent", ""]]}, {"id": "1401.0471", "submitter": "Zachary Kilpatrick PhD", "authors": "Zachary P Kilpatrick and Gregory Faye", "title": "Pulse bifurcations in stochastic neural fields", "comments": "28 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.PS q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the effects of additive noise on traveling pulse solutions in\nspatially extended neural fields with linear adaptation. Neural fields are\nevolution equations with an integral term characterizing synaptic interactions\nbetween neurons at different spatial locations of the network. We introduce an\nauxiliary variable to model the effects of local negative feedback and consider\nrandom fluctuations by modeling the system as a set of spatially extended\nLangevin equations whose noise term is a $Q$-Wiener process. Due to the\ntranslation invariance of the network, neural fields can support a continuum of\nspatially localized bump solutions that can be destabilized by increasing the\nstrength of the adaptation, giving rise to traveling pulse solutions. Near this\ncriticality, we derive a stochastic amplitude equation describing the dynamics\nof these bifurcating pulses when the noise and the deterministic instability\nare of comparable magnitude. Away from this bifurcation, we investigate the\neffects of additive noise on the propagation of traveling pulses and\ndemonstrate that noise induces wandering of traveling pulses. Our results are\ncomplemented with numerical simulations.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2014 16:58:49 GMT"}], "update_date": "2014-01-03", "authors_parsed": [["Kilpatrick", "Zachary P", ""], ["Faye", "Gregory", ""]]}, {"id": "1401.1465", "submitter": "David Balduzzi", "authors": "David Balduzzi", "title": "Cortical prediction markets", "comments": "To appear, AAMAS 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.LG cs.MA q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate cortical learning from the perspective of mechanism design.\nFirst, we show that discretizing standard models of neurons and synaptic\nplasticity leads to rational agents maximizing simple scoring rules. Second,\nour main result is that the scoring rules are proper, implying that neurons\nfaithfully encode expected utilities in their synaptic weights and encode\nhigh-scoring outcomes in their spikes. Third, with this foundation in hand, we\npropose a biologically plausible mechanism whereby neurons backpropagate\nincentives which allows them to optimize their usefulness to the rest of\ncortex. Finally, experiments show that networks that backpropagate incentives\ncan learn simple tasks.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2014 18:28:20 GMT"}], "update_date": "2014-01-08", "authors_parsed": [["Balduzzi", "David", ""]]}, {"id": "1401.1863", "submitter": "Anatoly Zlotnik", "authors": "Anatoly Zlotnik and Jr-Shin Li", "title": "Optimal Subharmonic Entrainment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS math.OC q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For many natural and engineered systems, a central function or design goal is\nthe synchronization of one or more rhythmic or oscillating processes to an\nexternal forcing signal, which may be periodic on a different time-scale from\nthe actuated process. Such subharmonic synchrony, which is dynamically\nestablished when N control cycles occur for every M cycles of a forced\noscillator, is referred to as N:M entrainment. In many applications,\nentrainment must be established in an optimal manner, for example by minimizing\ncontrol energy or the transient time to phase locking. We present a theory for\nderiving inputs that establish subharmonic N:M entrainment of general nonlinear\noscillators, or of collections of rhythmic dynamical units, while optimizing\nsuch objectives. Ordinary differential equation models of oscillating systems\nare reduced to phase variable representations, each of which consists of a\nnatural frequency and phase response curve. Formal averaging and the calculus\nof variations are then applied to such reduced models in order to derive\noptimal subharmonic entrainment waveforms. The optimal entrainment of a\ncanonical model for a spiking neuron is used to illustrate this approach, which\nis readily extended to arbitrary oscillating systems.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 23:57:18 GMT"}], "update_date": "2014-01-10", "authors_parsed": [["Zlotnik", "Anatoly", ""], ["Li", "Jr-Shin", ""]]}, {"id": "1401.2231", "submitter": "Daqing Guo", "authors": "Mingming Chen, Daqing Guo, Tiebin Wang, Wei Jing, Yang Xia, Peng Xu,\n  Cheng Luo, Pedro A. Valdes-Sosa, and Dezhong Yao", "title": "Bidirectional Control of Absence Seizures by the Basal Ganglia: A\n  Computational Evidence", "comments": "10 figures and 1 table. This paper has been accepted by PLoS\n  Computational Biology", "journal-ref": null, "doi": "10.1371/journal.pcbi.1003495", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Absence epilepsy is believed to be associated with the abnormal interactions\nbetween the cerebral cortex and thalamus. Besides the direct coupling,\nanatomical evidence indicates that the cerebral cortex and thalamus also\ncommunicate indirectly through an important intermediate bridge--basal ganglia.\nIt has been thus postulated that the basal ganglia might play key roles in the\nmodulation of absence seizures, but the relevant biophysical mechanisms are\nstill not completely established. Using a biophysically based model, we\ndemonstrate here that the typical absence seizure activities can be controlled\nand modulated by the direct GABAergic projections from the substantia nigra\npars reticulata (SNr) to either the thalamic reticular nucleus (TRN) or the\nspecific relay nuclei (SRN) of thalamus, through different biophysical\nmechanisms. Under certain conditions, these two types of seizure control are\nobserved to coexist in the same network. More importantly, due to the\ncompetition between the inhibitory SNr-TRN and SNr-SRN pathways, we find that\nboth decreasing and increasing the activation of SNr neurons from the normal\nlevel may considerably suppress the generation of SWDs in the coexistence\nregion. Overall, these results highlight the bidirectional functional roles of\nbasal ganglia in controlling and modulating absence seizures, and might provide\nnovel insights into the therapeutic treatments of this brain disorder.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 05:54:11 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Chen", "Mingming", ""], ["Guo", "Daqing", ""], ["Wang", "Tiebin", ""], ["Jing", "Wei", ""], ["Xia", "Yang", ""], ["Xu", "Peng", ""], ["Luo", "Cheng", ""], ["Valdes-Sosa", "Pedro A.", ""], ["Yao", "Dezhong", ""]]}, {"id": "1401.2331", "submitter": "Helene Loevenbruck", "authors": "Lucile Rapin (GIPSA-lab), Marion Dohen (GIPSA-lab), Mircea Polosan\n  (GIN), Pascal Perrier (GIPSA-lab), H\\'el\\`ene Loevenbruck (GIPSA-lab, LPNC)", "title": "An EMG study of the lip muscles during covert auditory verbal\n  hallucinations in schizophrenia", "comments": null, "journal-ref": "Journal of Speech, Language, and Hearing Research 56 (2013)\n  S1882-S1893", "doi": "10.1044/1092-4388(2013/12-0210)", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Purpose: Auditory verbal hallucinations (AVHs) are speech perceptions in the\nabsence of a external stimulation. An influential theoretical account of AVHs\nin schizophrenia claims that a deficit in inner speech monitoring would cause\nthe verbal thoughts of the patient to be perceived as external voices. The\naccount is based on a predictive control model, in which verbal self-monitoring\nis implemented. The aim of this study was to examine lip muscle activity during\nAVHs in schizophrenia patients, in order to check whether inner speech\noccurred. Methods: Lip muscle activity was recorded during covert AVHs (without\narticulation) and rest. Surface electromyography (EMG) was used on eleven\nschizophrenia patients. Results: Our results show an increase in EMG activity\nin the orbicularis oris inferior muscle, during covert AVHs relative to rest.\nThis increase is not due to general muscular tension since there was no\nincrease of muscular activity in the forearm muscle. Conclusion: This evidence\nthat AVHs might be self-generated inner speech is discussed in the framework of\na predictive control model. Further work is needed to better describe how the\ninner speech monitoring dysfunction occurs and how inner speech is controlled\nand monitored. This will help better understanding how AVHs occur.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 14:01:56 GMT"}], "update_date": "2014-01-13", "authors_parsed": [["Rapin", "Lucile", "", "GIPSA-lab"], ["Dohen", "Marion", "", "GIPSA-lab"], ["Polosan", "Mircea", "", "GIN"], ["Perrier", "Pascal", "", "GIPSA-lab"], ["Loevenbruck", "Hélène", "", "GIPSA-lab, LPNC"]]}, {"id": "1401.2469", "submitter": "Joel Nishimura", "authors": "Joel Nishimura", "title": "Frequency adjustment and synchrony in networks of delayed pulse coupled\n  oscillators", "comments": "5 pages, 2 figures, for submission to PRL", "journal-ref": null, "doi": "10.1103/PhysRevE.91.012916", "report-no": null, "categories": "q-bio.NC nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a system of pulse coupled oscillators that can change both their\nphases and frequencies; and prove that when there is a separation of time\nscales between phase and frequency adjustment the system converges to exact\nsynchrony on strongly connected graphs with time delays. The analysis involves\ndecomposing the network into a forest of tree-like structures that capture\ncausality. Furthermore, we provide a lower bound for the size of the basin of\nattraction with immediate implications for empirical networks and random graph\nmodels. These results provide a robust method of sensor net synchronization as\nwell as demonstrate a new avenue of possible pulse coupled oscillator research.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 21:20:38 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Nishimura", "Joel", ""]]}, {"id": "1401.2897", "submitter": "Andrei Khrennikov Yu", "authors": "Masanari Asano, Takahisa Hashimoto, Andrei Khrennikov, Masanori Ohya,\n  Yoshiharu Tanaka", "title": "Violation of contextual generalization of the Leggett-Garg inequality\n  for recognition of ambiguous figures", "comments": "Presented at the conference Quantum Interactions 14, University of\n  Leicester, July 2014; submitted to Physica Scripta, IOP; new version contains\n  discussions on Bell and contextuality, marginal selectivity,\n  Kolmogorovization of contextual data", "journal-ref": "Phys. Scr. T 163 (2014) 014006", "doi": "10.1088/0031-8949/2014/T163/014006", "report-no": null, "categories": "q-bio.NC math.PR math.ST quant-ph stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We interpret the Leggett-Garg (LG) inequality as a kind of contextual\nprobabilistic inequality in which one combines data collected in experiments\nperformed for three different contexts. In the original version of the\ninequality these contexts have the temporal nature and they are given by three\npairs of instances of time, $(t_1, t_2), (t_2, t_3), (t_3, t_4),$ where $t_1 <\nt_2 < t_3.$ We generalize LG conditions of macroscopic realism and noninvasive\nmeasurability in the general contextual framework. Our formulation is done in\nthe purely probabilistic terms: existence of the context independent joint\nprobability distribution $P$ and the possibility to reconstruct the\nexperimentally found marginal (two dimensional) probability distributions from\nthe $P.$ We derive an analog of the LG inequality, \"contextual LG inequality\",\nand use it as a test of \"quantum-likeness\" of statistical data collected in a\nseries of experiments on recognition of ambiguous figures. In our experimental\nstudy the figure under recognition is the Schroeder stair which is shown with\nrotations for different angles. Contexts are encoded by dynamics of rotations:\nclockwise, anticlockwise, and random. Our data demonstrated violation of the\ncontextual LG inequality for some combinations of aforementioned contexts.\nSince in quantum theory and experiments with quantum physical systems this\ninequality is violated, e.g., in the form of the original LG-inequality, our\nresult can be interpreted as a sign that the quantum(-like) models can provide\na more adequate description of the data generated in the process of recognition\nof ambiguous figures.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 09:33:13 GMT"}, {"version": "v2", "created": "Wed, 15 Jan 2014 18:16:15 GMT"}, {"version": "v3", "created": "Fri, 2 May 2014 14:01:00 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Asano", "Masanari", ""], ["Hashimoto", "Takahisa", ""], ["Khrennikov", "Andrei", ""], ["Ohya", "Masanori", ""], ["Tanaka", "Yoshiharu", ""]]}, {"id": "1401.3518", "submitter": "Cedric Ginestet", "authors": "Wes Viles, Cedric E. Ginestet, Ariana Tang, Mark A. Kramer, Eric D.\n  Kolaczyk", "title": "Percolation under Noise: Detecting Explosive Percolation Using the\n  Second Largest Component", "comments": "9 pages and 8 figures. Submitted to Physics Review, Series E", "journal-ref": "Phys. Rev. E 93, 052301 (2016)", "doi": "10.1103/PhysRevE.93.052301", "report-no": null, "categories": "stat.AP q-bio.NC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We consider the problem of distinguishing classical (Erd\\H{o}s-R\\'{e}nyi)\npercolation from explosive (Achlioptas) percolation, under noise. A statistical\nmodel of percolation is constructed allowing for the birth and death of edges\nas well as the presence of noise in the observations. This graph-valued\nstochastic process is composed of a latent and an observed non-stationary\nprocess, where the observed graph process is corrupted by Type I and Type II\nerrors. This produces a hidden Markov graph model. We show that for certain\nchoices of parameters controlling the noise, the classical (ER) percolation is\nvisually indistinguishable from the explosive (Achlioptas) percolation model.\nIn this setting, we compare two different criteria for discriminating between\nthese two percolation models, based on a quantile difference (QD) of the first\ncomponent's size and on the maximal size of the second largest component. We\nshow through data simulations that this second criterion outperforms the QD of\nthe first component's size, in terms of discriminatory power. The maximal size\nof the second component therefore provides a useful statistic for\ndistinguishing between the ER and Achlioptas models of percolation, under\nphysically motivated conditions for the birth and death of edges, and under\nnoise. The potential application of the proposed criteria for percolation\ndetection in clinical neuroscience is also discussed.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 08:52:29 GMT"}], "update_date": "2016-05-11", "authors_parsed": [["Viles", "Wes", ""], ["Ginestet", "Cedric E.", ""], ["Tang", "Ariana", ""], ["Kramer", "Mark A.", ""], ["Kolaczyk", "Eric D.", ""]]}, {"id": "1401.3790", "submitter": "William  Marshall", "authors": "William Marshall and Paul Marriott", "title": "Detection of Phase Shift Events", "comments": "20 pages, 8 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of change-point estimation of the instantaneous phase\nof an observed time series. Such change points, or phase shifts, can be markers\nof information transfer in complex systems; their analysis occurring in\ngeology, biology and physics, but most notably in neuroscience. We develop two\nnon-parametric approaches to this problem: the cumulative summation (CUSUM) and\nphase derivative (PD) estimators. In general the CUSUM estimator has higher\npower for identifying single shift events, while the PD estimator has better\ntemporal resolution for multiple ones. A system of weakly coupled Rossler\nattractors provides an application in which there are high levels of systematic\nand time-dependent noise. Shift identification is also performed on beta-band\nactivity from electroencephalogram recordings of a visual attention task, an\nunsupervised application which requires high temporal resolution.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 23:41:31 GMT"}], "update_date": "2014-01-17", "authors_parsed": [["Marshall", "William", ""], ["Marriott", "Paul", ""]]}, {"id": "1401.4068", "submitter": "Patricia Wollstadt", "authors": "Patricia Wollstadt, Mario Mart\\'inez-Zarzuela, Raul Vicente, Francisco\n  J. D\\'iaz-Pernas, Michael Wibral", "title": "Efficient transfer entropy analysis of non-stationary neural time series", "comments": "27 pages, 7 figures, submitted to PLOS ONE", "journal-ref": "PLoS ONE 10(10): e0140530 (2014)", "doi": "10.1371/journal.pone.0102833", "report-no": null, "categories": "cs.IT math.IT q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information theory allows us to investigate information processing in neural\nsystems in terms of information transfer, storage and modification. Especially\nthe measure of information transfer, transfer entropy, has seen a dramatic\nsurge of interest in neuroscience. Estimating transfer entropy from two\nprocesses requires the observation of multiple realizations of these processes\nto estimate associated probability density functions. To obtain these\nobservations, available estimators assume stationarity of processes to allow\npooling of observations over time. This assumption however, is a major obstacle\nto the application of these estimators in neuroscience as observed processes\nare often non-stationary. As a solution, Gomez-Herrero and colleagues\ntheoretically showed that the stationarity assumption may be avoided by\nestimating transfer entropy from an ensemble of realizations. Such an ensemble\nis often readily available in neuroscience experiments in the form of\nexperimental trials. Thus, in this work we combine the ensemble method with a\nrecently proposed transfer entropy estimator to make transfer entropy\nestimation applicable to non-stationary time series. We present an efficient\nimplementation of the approach that deals with the increased computational\ndemand of the ensemble method's practical application. In particular, we use a\nmassively parallel implementation for a graphics processing unit to handle the\ncomputationally most heavy aspects of the ensemble method. We test the\nperformance and robustness of our implementation on data from simulated\nstochastic processes and demonstrate the method's applicability to\nmagnetoencephalographic data. While we mainly evaluate the proposed method for\nneuroscientific data, we expect it to be applicable in a variety of fields that\nare concerned with the analysis of information transfer in complex biological,\nsocial, and artificial systems.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 15:55:11 GMT"}, {"version": "v2", "created": "Mon, 23 Nov 2015 10:53:17 GMT"}], "update_date": "2015-11-24", "authors_parsed": [["Wollstadt", "Patricia", ""], ["Martínez-Zarzuela", "Mario", ""], ["Vicente", "Raul", ""], ["Díaz-Pernas", "Francisco J.", ""], ["Wibral", "Michael", ""]]}, {"id": "1401.4122", "submitter": "Carsten Allefeld", "authors": "Carsten Allefeld, John-Dylan Haynes", "title": "Searchlight-based multi-voxel pattern analysis of fMRI by\n  cross-validated MANOVA", "comments": null, "journal-ref": "NeuroImage, 89:345-357, 2014", "doi": "10.1016/j.neuroimage.2013.11.043", "report-no": null, "categories": "q-bio.NC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-voxel pattern analysis (MVPA) is a fruitful and increasingly popular\ncomplement to traditional univariate methods of analyzing neuroimaging data. We\npropose to replace the standard 'decoding' approach to searchlight-based MVPA,\nmeasuring the performance of a classifier by its accuracy, with a method based\non the multivariate form of the general linear model. Following the\nwell-established methodology of multivariate analysis of variance (MANOVA), we\ndefine a measure that directly characterizes the structure of multi-voxel data,\nthe pattern distinctness $D$. Our measure is related to standard multivariate\nstatistics, but we apply cross-validation to obtain an unbiased estimate of its\npopulation value, independent of the amount of data or its partitioning into\n'training' and 'test' sets. The estimate $\\hat D$ can therefore serve not only\nas a test statistic, but as an interpretable measure of multivariate effect\nsize. The pattern distinctness generalizes the Mahalanobis distance to an\narbitrary number of classes, but also the case where there are no classes of\ntrials because the design is described by parametric regressors. It is defined\nfor arbitrary estimable contrasts, including main effects (pattern differences)\nand interactions (pattern changes). In this way, our approach makes the full\nanalytical power of complex factorial designs known from univariate fMRI\nanalyses available to MVPA studies. Moreover, we show how the results of a\nfactorial analysis can be used to obtain a measure of pattern stability, the\nequivalent of 'cross-decoding'.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 18:44:28 GMT"}, {"version": "v2", "created": "Fri, 7 Feb 2014 15:05:10 GMT"}], "update_date": "2014-02-10", "authors_parsed": [["Allefeld", "Carsten", ""], ["Haynes", "John-Dylan", ""]]}, {"id": "1401.4127", "submitter": "Emanuel Diamant", "authors": "Emanuel Diamant", "title": "Cognitive Robotics: for never was a story of more woe than this", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.CY q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are now on the verge of the next technical revolution - robots are going\nto invade our lives. However, to interact with humans or to be incorporated\ninto a human \"collective\" robots have to be provided with some human-like\ncognitive abilities. What does it mean? - nobody knows. But robotics research\ncommunities are trying hard to find out a way to cope with this problem.\nMeanwhile, despite abundant funding these efforts did not lead to any\nmeaningful result (only in Europe, only in the past ten years, Cognitive\nRobotics research funding has reached a ceiling of 1.39 billion euros). In the\nnext ten years, a similar budget is going to be spent to tackle the Cognitive\nRobotics problems in the frame of the Human Brain Project. There is no reason\nto expect that this time the result will be different. I would like to try to\nexplain why I'm so unhappy about this.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 13:05:55 GMT"}, {"version": "v2", "created": "Sat, 12 Jul 2014 04:40:29 GMT"}, {"version": "v3", "created": "Sat, 19 Jul 2014 18:32:34 GMT"}], "update_date": "2014-07-22", "authors_parsed": [["Diamant", "Emanuel", ""]]}, {"id": "1401.4668", "submitter": "Sadra Sadeh", "authors": "Sadra Sadeh, Stefano Cardanobile and Stefan Rotter", "title": "Mean-Field Analysis of Orientation Selectivity in Inhibition-Dominated\n  Networks of Spiking Neurons", "comments": "19 figures", "journal-ref": "SpringerPlus 3: 148, 2014", "doi": "10.1186/2193-1801-3-148.", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mechanisms underlying the emergence of orientation selectivity in the primary\nvisual cortex are highly debated. Here we study the contribution of\ninhibition-dominated random recurrent networks to orientation selectivity, and\nmore generally to sensory processing. By simulating and analyzing large-scale\nnetworks of spiking neurons, we investigate tuning amplification and contrast\ninvariance of orientation selectivity in these networks. In particular, we show\nhow selective attenuation of the common mode and amplification of the\nmodulation component take place in these networks. Selective attenuation of the\nbaseline, which is governed by the exceptional eigenvalue of the connectivity\nmatrix, removes the unspecific, redundant signal component and ensures the\ninvariance of selectivity across different contrasts. Selective amplification\nof modulation, which is governed by the operating regime of the network and\ndepends on the strength of coupling, amplifies the informative signal component\nand thus increases the signal-to-noise ratio. Here, we perform a mean-field\nanalysis which accounts for this process.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2014 13:59:09 GMT"}, {"version": "v2", "created": "Sun, 1 Jun 2014 11:40:10 GMT"}], "update_date": "2014-06-03", "authors_parsed": [["Sadeh", "Sadra", ""], ["Cardanobile", "Stefano", ""], ["Rotter", "Stefan", ""]]}, {"id": "1401.4938", "submitter": "A. Dietrich", "authors": "Axel Dietrich and Willem Been", "title": "Consciousness and Learning based on DNA Recombination and Memristor\n  Quality of Microtubules", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is a completion of an earlier model proposed by us. In the model\ndifferent memories are attached at cell surface determinants which are the\nresult of DNA recombination. Our earlier experiments strongly suggest that DNA\nrecombination actually takes place during a short period of early development\nin the brain in a limited number of neurons. In the present paper a model is\npresented in which switchboard neurons play a key role in the storage and\nretrieving of memory. And as a consequence, they play a major role in the\nprocess of learning and form the basic material for consciousness. In the\noriginal model there was insufficient explanation for the realization of the\ninternal connection of one cell surface determinant to the other. We realized\nthat tubulin should play a role in these intracellular connections. The tubulin\nmolecules can form a connective wire because of a change of shape of the\nindividual tubulin dimers. This way the fast switch is realized by the switch\nof the tubulin dimer configuration. Because the cell should remember which\nswitch was activated and which one was not or less activated, we postulate the\nmemristor quality of microtubules.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jan 2014 10:07:47 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Dietrich", "Axel", ""], ["Been", "Willem", ""]]}, {"id": "1401.5186", "submitter": "Tomokatsu Onaga", "authors": "Tomokatsu Onaga and Shigeru Shinomoto", "title": "Bursting transition in a linear self-exciting point process", "comments": "6 pages, 3 figures", "journal-ref": "Physical Review E 89 (2014) 042817", "doi": "10.1103/PhysRevE.89.042817", "report-no": null, "categories": "physics.data-an q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Self-exciting point processes describe the manner in which every event\nfacilitates the occurrence of succeeding events. By increasing excitability,\nthe event occurrences start to exhibit bursts even in the absence of external\nstimuli. We revealed that the transition is uniquely determined by the average\nnumber of events added by a single event, $1-1/\\sqrt{2} \\approx 0.2929$,\nindependently of the temporal excitation profile. We further extended the\ntheory to multi-dimensional processes, to be able to incite or inhibit bursting\nin networks of agents.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2014 05:42:13 GMT"}], "update_date": "2014-05-01", "authors_parsed": [["Onaga", "Tomokatsu", ""], ["Shinomoto", "Shigeru", ""]]}, {"id": "1401.5333", "submitter": "Robert Prevedel", "authors": "R. Prevedel, Y.-G. Yoon, M. Hoffmann, N. Pak, G. Wetzstein, S. Kato,\n  T. Schr\\\"odel, R. Raskar, M. Zimmer, E.S. Boyden, A. Vaziri", "title": "Simultaneous whole-animal 3D-imaging of neuronal activity using light\n  field microscopy", "comments": "25 pages, 7 figures, incl. supplementary information", "journal-ref": "Nature Methods 11, 727 (2014)", "doi": "10.1038/nmeth.2964", "report-no": null, "categories": "physics.optics q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  3D functional imaging of neuronal activity in entire organisms at single cell\nlevel and physiologically relevant time scales faces major obstacles due to\ntrade-offs between the size of the imaged volumes, and spatial and temporal\nresolution. Here, using light-field microscopy in combination with 3D\ndeconvolution, we demonstrate intrinsically simultaneous volumetric functional\nimaging of neuronal population activity at single neuron resolution for an\nentire organism, the nematode Caenorhabditis elegans. The simplicity of our\ntechnique and possibility of the integration into epi-fluoresence microscopes\nmakes it an attractive tool for high-speed volumetric calcium imaging.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2014 14:53:14 GMT"}, {"version": "v2", "created": "Mon, 22 Dec 2014 09:58:09 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Prevedel", "R.", ""], ["Yoon", "Y. -G.", ""], ["Hoffmann", "M.", ""], ["Pak", "N.", ""], ["Wetzstein", "G.", ""], ["Kato", "S.", ""], ["Schrödel", "T.", ""], ["Raskar", "R.", ""], ["Zimmer", "M.", ""], ["Boyden", "E. S.", ""], ["Vaziri", "A.", ""]]}, {"id": "1401.5589", "submitter": "Stephen Odaibo", "authors": "Stephen G. Odaibo", "title": "The Gabor-Einstein Wavelet: A Model for the Receptive Fields of V1 to MT\n  Neurons", "comments": "40 pages, 13 Figures. We presented a portion of this work in various\n  parts at the National Medical Association's 111th Annual Convention and\n  Scientific Assembly in Toronto Ontario, Canada (Jul. 2013); at the 23rd\n  Annual Washington Retina Symposium in Washington D.C., U.S.A. (Oct. 2013);\n  and at the Society for Neuroscience's 43rd Annual Meeting in San Diego\n  California, U.S.A. (Nov. 2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.CV physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our visual system is astonishingly efficient at detecting moving objects.\nThis process is mediated by the neurons which connect the primary visual cortex\n(V1) to the middle temporal (MT) area. Interestingly, since Kuffler's\npioneering experiments on retinal ganglion cells, mathematical models have been\nvital for advancing our understanding of the receptive fields of visual\nneurons. However, existing models were not designed to describe the most\nsalient attributes of the highly specialized neurons in the V1 to MT motion\nprocessing stream; and they have not been able to do so. Here, we introduce the\nGabor-Einstein wavelet, a new family of functions for representing the\nreceptive fields of V1 to MT neurons. We show that the way space and time are\nmixed in the visual cortex is analogous to the way they are mixed in the\nspecial theory of relativity (STR). Hence we constrained the Gabor-Einstein\nmodel by requiring: (i) relativistic-invariance of the wave carrier, and (ii)\nthe minimum possible number of parameters. From these two constraints, the sinc\nfunction emerged as a natural descriptor of the wave carrier. The particular\ndistribution of lowpass to bandpass temporal frequency filtering properties of\nV1 to MT neurons (Foster et al 1985; DeAngelis et al 1993b; Hawken et al 1996)\nis clearly explained by the Gabor-Einstein basis. Furthermore, it does so in a\nmanner innately representative of the motion-processing stream's neuronal\nhierarchy. Our analysis and computer simulations show that the distribution of\ntemporal frequency filtering properties along the motion processing stream is a\ndirect effect of the way the brain jointly encodes space and time. We uncovered\nthis fundamental link by demonstrating that analogous mathematical structures\nunderlie STR and joint cortical spacetime encoding. This link will provide new\nphysiological insights into how the brain represents visual information.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2014 08:48:53 GMT"}], "update_date": "2014-01-23", "authors_parsed": [["Odaibo", "Stephen G.", ""]]}, {"id": "1401.6207", "submitter": "Huisheng Liu", "authors": "Huisheng Liu, Hua Bai, Enfu Hui, Lu Yang, Chantell Evans, Zhao Wang,\n  Sung Kwon, and Edwin Chapman", "title": "Synaptotagmin 7 Functions as a Ca2+-sensor for Synaptic Vesicle\n  Replenishment", "comments": "41 pages, 17 Figures", "journal-ref": null, "doi": "10.7554/eLife.01524", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Synaptotagmin (syt) 7 is one of three syt isoforms found in all metazoans; it\nis ubiquitously expressed, yet its function in neurons remains obscure. Here,\nwe resolved Ca2+-dependent and Ca2+-independent synaptic vesicle (SV)\nreplenishment pathways, and found that syt 7 plays a selective and critical\nrole in the Ca2+-dependent pathway. Mutations that disrupt Ca2+-binding to syt\n7 abolish this function, suggesting that syt 7 functions as a Ca2+-sensor for\nreplenishment. The Ca2+-binding protein calmodulin (CaM) has also been\nimplicated in SV replenishment, and we found that loss of syt 7 was phenocopied\nby a CaM antagonist. Moreover, we discovered that syt 7 binds to CaM in a\nhighly specific and Ca2+-dependent manner; this interaction requires intact\nCa2+-binding sites within syt 7. Together, these data indicate that a complex\nof two conserved Ca2+-binding proteins, syt 7 and CaM, serve as a key regulator\nof SV replenishment in presynaptic nerve terminals.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 22:48:27 GMT"}], "update_date": "2014-01-27", "authors_parsed": [["Liu", "Huisheng", ""], ["Bai", "Hua", ""], ["Hui", "Enfu", ""], ["Yang", "Lu", ""], ["Evans", "Chantell", ""], ["Wang", "Zhao", ""], ["Kwon", "Sung", ""], ["Chapman", "Edwin", ""]]}, {"id": "1401.6761", "submitter": "J.H. van Hateren", "authors": "J.H. van Hateren", "title": "Consciousness results when communication modifies the form of\n  self-estimated fitness", "comments": "Minor revision; 10 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The origin and development of consciousness is poorly understood. Although it\nis clearly a naturalistic phenomenon evolved through Darwinian evolution,\nexplaining it in terms of physicochemical, neural, or symbolic mechanisms\nremains elusive. Here I propose that two steps had to be taken in its\nevolution. First, living systems evolved an intrinsic goal-directedness by\ninternalizing Darwinian fitness as a self-estimated fitness. The self-estimated\nfitness participates in a feedback loop that effectively produces intrinsic\nmeaning in the organism. Second, animals with advanced nervous systems evolved\na special form of communication that modifies the way each partner estimates\nfitness. The resulting change in intrinsic meaning is experienced subjectively\nas a primary form of consciousness. This primary form is subsequently used to\ngenerate, partly through internalized dialogue, more complex forms of\nconsciousness, such as consciousness of the natural and social worlds,\nconsciousness of the self, and language-dependent forms of consciousness.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2014 07:58:20 GMT"}, {"version": "v2", "created": "Fri, 17 Oct 2014 09:34:08 GMT"}], "update_date": "2014-10-20", "authors_parsed": [["van Hateren", "J. H.", ""]]}]