[{"id": "1408.0985", "submitter": "Lucas Lacasa", "authors": "Jordi Luque, Bartolo Luque and Lucas Lacasa", "title": "Speech earthquakes: scaling and universality in human voice", "comments": "Submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CL q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Speech is a distinctive complex feature of human capabilities. In order to\nunderstand the physics underlying speech production, in this work we\nempirically analyse the statistics of large human speech datasets ranging\nseveral languages. We first show that during speech the energy is unevenly\nreleased and power-law distributed, reporting a universal robust\nGutenberg-Richter-like law in speech. We further show that such earthquakes in\nspeech show temporal correlations, as the interevent statistics are again\npower-law distributed. Since this feature takes place in the intra-phoneme\nrange, we conjecture that the responsible for this complex phenomenon is not\ncognitive, but it resides on the physiological speech production mechanism.\nMoreover, we show that these waiting time distributions are scale invariant\nunder a renormalisation group transformation, suggesting that the process of\nspeech generation is indeed operating close to a critical point. These results\nare put in contrast with current paradigms in speech processing, which point\ntowards low dimensional deterministic chaos as the origin of nonlinear traits\nin speech fluctuations. As these latter fluctuations are indeed the aspects\nthat humanize synthetic speech, these findings may have an impact in future\nspeech synthesis technologies. Results are robust and independent of the\ncommunication language or the number of speakers, pointing towards an universal\npattern and yet another hint of complexity in human speech.\n", "versions": [{"version": "v1", "created": "Tue, 5 Aug 2014 14:34:20 GMT"}], "update_date": "2014-08-06", "authors_parsed": [["Luque", "Jordi", ""], ["Luque", "Bartolo", ""], ["Lacasa", "Lucas", ""]]}, {"id": "1408.1015", "submitter": "Guido Gigante", "authors": "Cristiano Capone, Carla Filosa, Guido Gigante, Federico\n  Ricci-Tersenghi, Paolo del Giudice", "title": "Inferring Synaptic Structure in presence of Neural Interaction Time\n  Scales", "comments": null, "journal-ref": "PLoS ONE 10, e0118412 (2015)", "doi": "10.1371/journal.pone.0118412", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological networks display a variety of activity patterns reflecting a web\nof interactions that is complex both in space and time. Yet inference methods\nhave mainly focused on reconstructing, from the network's activity, the spatial\nstructure, by assuming equilibrium conditions or, more recently, a\nprobabilistic dynamics with a single arbitrary time-step. Here we show that,\nunder this latter assumption, the inference procedure fails to reconstruct the\nsynaptic matrix of a network of integrate-and-fire neurons when the chosen time\nscale of interaction does not closely match the synaptic delay or when no\nsingle time scale for the interaction can be identified; such failure,\nmoreover, exposes a distinctive bias of the inference method that can lead to\ninfer as inhibitory the excitatory synapses with interaction time scales longer\nthan the model's time-step. We therefore introduce a new two-step method, that\nfirst infers through cross-correlation profiles the delay-structure of the\nnetwork and then reconstructs the synaptic matrix, and successfully test it on\nnetworks with different topologies and in different activity regimes. Although\nstep one is able to accurately recover the delay-structure of the network, thus\ngetting rid of any \\textit{a priori} guess about the time scales of the\ninteraction, the inference method introduces nonetheless an arbitrary time\nscale, the time-bin $dt$ used to binarize the spike trains. We therefore\nanalytically and numerically study how the choice of $dt$ affects the inference\nin our network model, finding that the relationship between the inferred\ncouplings and the real synaptic efficacies, albeit being quadratic in both\ncases, depends critically on $dt$ for the excitatory synapses only, whilst\nbeing basically independent of it for the inhibitory ones.\n", "versions": [{"version": "v1", "created": "Tue, 5 Aug 2014 16:10:45 GMT"}, {"version": "v2", "created": "Wed, 6 Aug 2014 09:33:44 GMT"}, {"version": "v3", "created": "Wed, 18 Feb 2015 14:35:21 GMT"}], "update_date": "2015-08-19", "authors_parsed": [["Capone", "Cristiano", ""], ["Filosa", "Carla", ""], ["Gigante", "Guido", ""], ["Ricci-Tersenghi", "Federico", ""], ["del Giudice", "Paolo", ""]]}, {"id": "1408.1245", "submitter": "Saeed Afshar", "authors": "Saeed Afshar (1), Libin George (1,2), Jonathan Tapson (1), Andre van\n  Schaik (1), Tara Julia Hamilton (1,2) ((1) University of Western Sydney, (2)\n  University of New South Wales)", "title": "Racing to Learn: Statistical Inference and Learning in a Single Spiking\n  Neuron with Adaptive Kernels", "comments": "In submission to Frontiers in Neuroscience", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE q-bio.NC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper describes the Synapto-dendritic Kernel Adapting Neuron (SKAN), a\nsimple spiking neuron model that performs statistical inference and\nunsupervised learning of spatiotemporal spike patterns. SKAN is the first\nproposed neuron model to investigate the effects of dynamic synapto-dendritic\nkernels and demonstrate their computational power even at the single neuron\nscale. The rule-set defining the neuron is simple there are no complex\nmathematical operations such as normalization, exponentiation or even\nmultiplication. The functionalities of SKAN emerge from the real-time\ninteraction of simple additive and binary processes. Like a biological neuron,\nSKAN is robust to signal and parameter noise, and can utilize both in its\noperations. At the network scale neurons are locked in a race with each other\nwith the fastest neuron to spike effectively hiding its learnt pattern from its\nneighbors. The robustness to noise, high speed and simple building blocks not\nonly make SKAN an interesting neuron model in computational neuroscience, but\nalso make it ideal for implementation in digital and analog neuromorphic\nsystems which is demonstrated through an implementation in a Field Programmable\nGate Array (FPGA).\n", "versions": [{"version": "v1", "created": "Wed, 6 Aug 2014 11:11:41 GMT"}, {"version": "v2", "created": "Thu, 7 Aug 2014 02:02:13 GMT"}, {"version": "v3", "created": "Wed, 20 Aug 2014 06:12:16 GMT"}, {"version": "v4", "created": "Sat, 15 Nov 2014 16:40:51 GMT"}], "update_date": "2014-11-18", "authors_parsed": [["Afshar", "Saeed", ""], ["George", "Libin", ""], ["Tapson", "Jonathan", ""], ["van Schaik", "Andre", ""], ["Hamilton", "Tara Julia", ""]]}, {"id": "1408.1784", "submitter": "Haiping Huang", "authors": "Haiping Huang and Yoshiyuki Kabashima", "title": "Origin of the computational hardness for learning with binary synapses", "comments": "9 pages, 1 figure", "journal-ref": "Phys. Rev. E 90, 052813 (2014)", "doi": "10.1103/PhysRevE.90.052813", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech cs.LG q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Supervised learning in a binary perceptron is able to classify an extensive\nnumber of random patterns by a proper assignment of binary synaptic weights.\nHowever, to find such assignments in practice, is quite a nontrivial task. The\nrelation between the weight space structure and the algorithmic hardness has\nnot yet been fully understood. To this end, we analytically derive the\nFranz-Parisi potential for the binary preceptron problem, by starting from an\nequilibrium solution of weights and exploring the weight space structure around\nit. Our result reveals the geometrical organization of the weight\nspace\\textemdash the weight space is composed of isolated solutions, rather\nthan clusters of exponentially many close-by solutions. The point-like clusters\nfar apart from each other in the weight space explain the previously observed\nglassy behavior of stochastic local search heuristics.\n", "versions": [{"version": "v1", "created": "Fri, 8 Aug 2014 08:13:52 GMT"}], "update_date": "2014-11-19", "authors_parsed": [["Huang", "Haiping", ""], ["Kabashima", "Yoshiyuki", ""]]}, {"id": "1408.1921", "submitter": "Paul Smolen", "authors": "Paul Smolen, Douglas A. Baxter, John H. Byrne", "title": "Simulations Suggest Pharmacological Methods for Rescuing Long-Term\n  Potentiation", "comments": "21 pages, 4 figures", "journal-ref": "Journal of Theoretical Biology, 7 Nov 2014, pp. 243-250", "doi": "10.1016/j.jtbi.2014.07.006", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Congenital cognitive dysfunctions are frequently due to deficits in molecular\npathways that underlie synaptic plasticity. For example, Rubinstein-Taybi\nsyndrome (RTS) is due to a mutation in cbp, encoding the histone\nacetyltransferase CREB-binding protein (CBP). CBP is a transcriptional\nco-activator for CREB, and induction of CREB-dependent transcription plays a\nkey role in long-term memory (LTM). In animal models of RTS, mutations of cbp\nimpair LTM and late-phase long-term potentiation (LTP). To explore intervention\nstrategies to rescue the deficits in LTP, we extended a previous model of LTP\ninduction to describe histone acetylation and simulated LTP impairment due to\ncbp mutation. Plausible drug effects were simulated by parameter changes, and\nmany increased LTP. However no parameter variation consistent with a\nbiochemical effect of a known drug fully restored LTP. Thus we examined paired\nparameter variations. A pair that simulated the effects of a phosphodiesterase\ninhibitor (slowing cAMP degradation) concurrent with a deacetylase inhibitor\n(prolonging histone acetylation) restored LTP. Importantly these paired\nparameter changes did not alter basal synaptic weight. A pair that simulated a\nphosphodiesterase inhibitor and an acetyltransferase activator was similarly\neffective. For both pairs strong additive synergism was present. These results\nsuggest that promoting histone acetylation while simultaneously slowing the\ndegradation of cAMP may constitute a promising strategy for restoring deficits\nin LTP that may be associated with learning deficits in RTS. More generally\nthese results illustrate the strategy of combining modeling and empirical\nstudies may help design effective therapies for improving long-term synaptic\nplasticity and learning in cognitive disorders.\n", "versions": [{"version": "v1", "created": "Fri, 8 Aug 2014 17:24:28 GMT"}], "update_date": "2014-08-11", "authors_parsed": [["Smolen", "Paul", ""], ["Baxter", "Douglas A.", ""], ["Byrne", "John H.", ""]]}, {"id": "1408.1986", "submitter": "Christian Mayr", "authors": "C. Mayr, A. Heittmann, R. Sch\\\"uffny", "title": "Gabor-like Image Filtering using a Neural Microcircuit", "comments": null, "journal-ref": "IEEE Transactions on Neural Networks, vol. 18, pages 955-959, 2007", "doi": "10.1109/TNN.2007.891687", "report-no": null, "categories": "cs.CV cs.ET q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this letter, we present an implementation of a neural microcircuit for\nimage processing employing Hebbian-adaptive learning. The neuronal circuit\nutilizes only excitatory synapses to correlate action potentials, extracting\nthe uncorrelated ones, which contain significant image information. This\ncircuit is capable of approximating Gabor-like image filtering and other image\nprocessing functions\n", "versions": [{"version": "v1", "created": "Fri, 8 Aug 2014 21:24:59 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Mayr", "C.", ""], ["Heittmann", "A.", ""], ["Schüffny", "R.", ""]]}, {"id": "1408.2085", "submitter": "Tobias Reichenbach", "authors": "T. Reichenbach, A. J. Hudspeth", "title": "The physics of hearing: fluid mechanics and the active process of the\n  inner ear", "comments": "86 pages, 24 figures", "journal-ref": "Rep. Progr. Phys. 77:7 (2014)", "doi": "10.1088/0034-4885/77/7/076601", "report-no": null, "categories": "q-bio.NC nlin.AO physics.bio-ph q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most sounds of interest consist of complex, time-dependent admixtures of\ntones of diverse frequencies and variable amplitudes. To detect and process\nthese signals, the ear employs a highly nonlinear, adaptive, real-time spectral\nanalyzer: the cochlea. Sound excites vibration of the eardrum and the three\nminiscule bones of the middle ear, the last of which acts as a piston to\ninitiate oscillatory pressure changes within the liquid-filled chambers of the\ncochlea. The basilar membrane, an elastic band spiraling along the cochlea\nbetween two of these chambers, responds to these pressures by conducting a\nlargely independent traveling wave for each frequency component of the input.\nBecause the basilar membrane is graded in mass and stiffness along its length,\nhowever, each traveling wave grows in magnitude and decreases in wavelength\nuntil it peaks at a specific, frequency-dependent position: low frequencies\npropagate to the cochlear apex, whereas high frequencies culminate at the base.\nThe oscillations of the basilar membrane deflect hair bundles, the mechanically\nsensitive organelles of the ear's sensory receptors, the hair cells. As\nmechanically sensitive ion channels open and close, each hair cell responds\nwith an electrical signal that is chemically transmitted to an afferent nerve\nfiber and thence into the brain. In addition to transducing mechanical inputs,\nhair cells amplify them [...]\n", "versions": [{"version": "v1", "created": "Sat, 9 Aug 2014 12:09:27 GMT"}], "update_date": "2014-08-12", "authors_parsed": [["Reichenbach", "T.", ""], ["Hudspeth", "A. J.", ""]]}, {"id": "1408.2314", "submitter": "Liane Gabora", "authors": "Courtney Chrusch and Liane Gabora", "title": "A Tentative Role for FOXP2 in the Evolution of Dual Processing Modes and\n  Generative Abilities", "comments": "6 pages", "journal-ref": "Proceedings of the 36th Annual Meeting of the Cognitive Science\n  Society (pp. 499-504). Austin, TX: Cognitive Science Society. (2014)", "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been suggested that the origins of cognitive modernity in the\nMiddle/Upper Paleolithic following the appearance of anatomically modern humans\nwas due to the onset of dual processing or contextual focus (CF), the ability\nto shift between different modes of thought: an explicit mode conducive to\nlogical problem solving, and an implicit mode conducive to free-association and\nbreaking out of a rut. Mathematical and computational models of CF supported\nthis hypothesis, showing that CF is conducive to making creative connections by\nplacing concepts in new contexts. This paper proposes that CF was made possible\nby mutation of the FOXP2 gene in the Paleolithic. FOXP2, once thought to be the\n'language gene', turned out not to be uniquely associated with language. In its\nmodern form FOXP2 enabled fine-tuning of the neurological mechanisms underlying\nthe capacity to shift between processing modes by varying the size of the\nactivated region of memory.\n", "versions": [{"version": "v1", "created": "Mon, 11 Aug 2014 05:21:18 GMT"}, {"version": "v2", "created": "Mon, 15 Jul 2019 22:06:24 GMT"}], "update_date": "2019-07-17", "authors_parsed": [["Chrusch", "Courtney", ""], ["Gabora", "Liane", ""]]}, {"id": "1408.2463", "submitter": "Pascal Grange", "authors": "Pascal Grange, Idan Menashe, Michael Hawrylycz", "title": "Cell-type-specific neuroanatomy of brain-wide expression of\n  autism-related genes", "comments": "13 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two cliques of genes identified computationally for their high co-expression\nin the mouse brain according to the Allen Brain Atlas, and for their enrichment\nin genes related to autism spectrum disorder, have recently been shown to be\nhighly co-expressed in the cerebellar cortex, compared to what could be\nexpected by chance. Moreover, the expression of these cliques of genes is not\nhomogeneous across the cerebellum, and it has been noted that their gene\nexpression pattern seems to highlight the granular layer. However, this\nobservation was only made by eye, and recent advances in computational\nneuroanatomy allow to rank cell types in the mouse brain (characterized by\ntheir transcriptome profiles) according to the similarity between their density\nprofiles and the expression profiles of the cliques. We establish by Monte\nCarlo simulation that with probability at least 99 percent, the expression\nprofiles of the two cliques are more similar to the density profile of granule\ncells than 99 percent of the expression of cliques containing the same number\nof genes (Purkinje cells also score above 99 percent in one of the cliques).\nThresholding the expression profiles shows that the signal is more intense in\nthe granular layer.\n", "versions": [{"version": "v1", "created": "Mon, 11 Aug 2014 16:39:02 GMT"}], "update_date": "2014-08-12", "authors_parsed": [["Grange", "Pascal", ""], ["Menashe", "Idan", ""], ["Hawrylycz", "Michael", ""]]}, {"id": "1408.2512", "submitter": "Liane Gabora", "authors": "Liane Gabora and Simon Tseng", "title": "Computational Evidence that Self-regulation of Creativity is Good for\n  Society", "comments": "6 pages. arXiv admin note: substantial text overlap with\n  arXiv:1310.4753", "journal-ref": "Proceedings of the 36th Annual Meeting of the Cognitive Science\n  Society (pp. 2240-2245). Houston TX: Cognitive Science Society", "doi": null, "report-no": null, "categories": "cs.CY q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Excess individual creativity can be detrimental to society because creators\ninvest in unproven ideas at the expense of propagating proven ones. Moreover, a\nproportion of individuals can benefit from creativity without being creative\nthemselves by copying creators. We hypothesized that (1) societies increase\ntheir rate of cultural evolution by tempering the novelty-generating effects of\ncreativity with the novelty-preserving effects of imitation, and (2) this is\ncarried out by selectively rewarding and punishing creativity according to the\nvalue of the individuals' creative outputs. We tested this using an agent-based\nmodel of cultural evolution in which each agent self-regulated its\ninvention-to-imitation ratio as a function of the fitness of its cultural\noutputs. In self-regulating societies, agents segregated into creators and\nimitators. The mean fitness of cultural outputs was higher than in\nnon-self-regulating societies, and changes in diversity were rapider and more\npronounced. We discuss limitations and possible social implications of our\nfindings.\n", "versions": [{"version": "v1", "created": "Mon, 11 Aug 2014 15:58:22 GMT"}], "update_date": "2014-08-13", "authors_parsed": [["Gabora", "Liane", ""], ["Tseng", "Simon", ""]]}, {"id": "1408.3028", "submitter": "Olivier Marre", "authors": "Olivier Marre, Vicente Botella-Soler, Kristina D. Simmons, Thierry\n  Mora, Ga\\v{s}per Tka\\v{c}ik, Michael J. Berry II", "title": "High accuracy decoding of dynamical motion from a large retinal\n  population", "comments": "23 pages, 7 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1004304", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motion tracking is a challenge the visual system has to solve by reading out\nthe retinal population. Here we recorded a large population of ganglion cells\nin a dense patch of salamander and guinea pig retinas while displaying a bar\nmoving diffusively. We show that the bar position can be reconstructed from\nretinal activity with a precision in the hyperacuity regime using a linear\ndecoder acting on 100+ cells. The classical view would have suggested that the\nfiring rates of the cells form a moving hill of activity tracking the bar's\nposition. Instead, we found that ganglion cells fired sparsely over an area\nmuch larger than predicted by their receptive fields, so that the neural image\ndid not track the bar. This highly redundant organization allows for diverse\ncollections of ganglion cells to represent high-accuracy motion information in\na form easily read out by downstream neural circuits.\n", "versions": [{"version": "v1", "created": "Wed, 13 Aug 2014 15:25:15 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Marre", "Olivier", ""], ["Botella-Soler", "Vicente", ""], ["Simmons", "Kristina D.", ""], ["Mora", "Thierry", ""], ["Tkačik", "Gašper", ""], ["Berry", "Michael J.", "II"]]}, {"id": "1408.3101", "submitter": "Sergio Verduzco-Flores", "authors": "Sergio Verduzco-Flores", "title": "How stochastic synchrony could work in cerebellar Purkinje cells", "comments": "46 pages, 8 figures. Similar to a version submitted to the Journal of\n  Mathematical Neuroscience", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Simple spike synchrony between Purkinje cells projecting to a common neuron\nin the deep cerebellar nucleus is emerging as an important factor in the\nencoding of output information from cerebellar cortex. Stochastic\nsynchronization is a viable mechanism through which this synchrony could be\ngenerated, but it has received scarce attention, perhaps because the presence\nof feedforward inhibition in the input to Purkinje cells makes insights\ndifficult. This paper presents a method to account for feedforward inhibition\nso the usual mathematical approaches to stochastic synchronization can be\napplied. Three concepts (input correlation, heterogeneity, and PRC shape) are\nthen introduced to facilitate an intuitive understanding of how different\nfactors can affect synchronization in Purkinje cells. This is followed by a\ndiscussion of how stochastic synchrony could play a role in the cerebellar\nresponse under different assumptions.\n", "versions": [{"version": "v1", "created": "Wed, 13 Aug 2014 19:35:00 GMT"}], "update_date": "2014-08-14", "authors_parsed": [["Verduzco-Flores", "Sergio", ""]]}, {"id": "1408.3444", "submitter": "Sergio Verduzco-Flores", "authors": "Sergio Verduzco-Flores, Randall C. O'Reilly", "title": "The cerebellum could solve the motor error problem through error\n  increase prediction", "comments": "34 pages (without bibliography), 13 figures", "journal-ref": null, "doi": "10.3389/fncom.2015.00039", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a cerebellar architecture with two main characteristics. The first\none is that complex spikes respond to increases in sensory errors. The second\none is that cerebellar modules associate particular contexts where errors have\nincreased in the past with corrective commands that stop the increase in error.\nWe analyze our architecture formally and computationally for the case of\nreaching in a 3D environment. In the case of motor control, we show that there\nare synergies of this architecture with the Equilibrium-Point hypothesis,\nleading to novel ways to solve the motor error problem. In particular, the\npresence of desired equilibrium lengths for muscles provides a way to know when\nthe error is increasing, and which corrections to apply. In the context of\nThreshold Control Theory and Perceptual Control Theory we show how to extend\nour model so it implements anticipative corrections in cascade control systems\nthat span from muscle contractions to cognitive operations.\n", "versions": [{"version": "v1", "created": "Thu, 14 Aug 2014 23:54:17 GMT"}, {"version": "v2", "created": "Sat, 21 Feb 2015 23:11:40 GMT"}], "update_date": "2015-03-25", "authors_parsed": [["Verduzco-Flores", "Sergio", ""], ["O'Reilly", "Randall C.", ""]]}, {"id": "1408.3878", "submitter": "Changsoo Shin", "authors": "Changsoo Shin, Wansoo Ha, Wookeen Chung, and Sunyoung Park", "title": "Unresolvable human mental states based on a parallel universe theory", "comments": "17 pages, 6 figures, 3 tables", "journal-ref": "Advancement and Developments in Applied Mathematics 1 (2012) 18-29", "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that human mental states are unresolvable by suggesting a\nmathematical function that describes human mental states in relation to\nparallel universe theory. The function is a solution to a multi-dimensional\nadvection equation; representing a situation a person is faced with, and its\ntime-derivative showing the mental state in that situation. This function has\ninteresting characteristics that explain why each person has different thoughts\nin a particular situation. Because the multi-dimensional advection equation has\nan infinite number of solutions, we can use them to represent an infinite\nnumber of mental states. We focus on the basic concepts of the model and\nexplain the function using extremely simple cases. We also use the functions to\nexplain remembering and forgetting.\n", "versions": [{"version": "v1", "created": "Mon, 18 Aug 2014 01:03:49 GMT"}], "update_date": "2014-08-19", "authors_parsed": [["Shin", "Changsoo", ""], ["Ha", "Wansoo", ""], ["Chung", "Wookeen", ""], ["Park", "Sunyoung", ""]]}, {"id": "1408.4180", "submitter": "Fabian Soto", "authors": "F. A. Soto, D. S. Bassett, F. G. Ashby", "title": "Dissociable changes in functional network topology underlie early\n  category learning and development of automaticity", "comments": null, "journal-ref": null, "doi": "10.1016/j.neuroimage.2016.07.032", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work has shown that multimodal association areas-including frontal,\ntemporal and parietal cortex-are focal points of functional network\nreconfiguration during human learning and performance of cognitive tasks. On\nthe other hand, neurocomputational theories of category learning suggest that\nthe basal ganglia and related subcortical structures are focal points of\nfunctional network reconfiguration during early learning of some categorization\ntasks, but become less so with the development of automatic categorization\nperformance. Using a combination of network science and multilevel regression,\nwe explore how changes in the connectivity of small brain regions can predict\nbehavioral changes during training in a visual categorization task. We find\nthat initial category learning, as indexed by changes in accuracy, is predicted\nby increasingly efficient integrative processing in subcortical areas, with\nhigher functional specialization, more efficient integration across modules,\nbut a lower cost in terms of redundancy of information processing. The\ndevelopment of automaticity, as indexed by changes in the speed of correct\nresponses, was predicted by lower clustering (particularly in subcortical\nareas), higher strength (highest in cortical areas) and higher betweenness\ncentrality. By combining neurocomputational theories and network scientific\nmethods, these results synthesize the dissociative roles of multimodal\nassociation areas and subcortical structures in the development of automaticity\nduring category learning.\n", "versions": [{"version": "v1", "created": "Tue, 19 Aug 2014 00:12:51 GMT"}], "update_date": "2016-10-12", "authors_parsed": [["Soto", "F. A.", ""], ["Bassett", "D. S.", ""], ["Ashby", "F. G.", ""]]}, {"id": "1408.4587", "submitter": "Pier Stanislao Paolucci", "authors": "Pier Stanislao Paolucci, Iuliana Bacivarov, Devendra Rai, Lars Schor,\n  Lothar Thiele, Hoeseok Yang, Elena Pastorelli, Roberto Ammendola, Andrea\n  Biagioni, Ottorino Frezza, Francesca Lo Cicero, Alessandro Lonardo, Francesco\n  Simula, Laura Tosoratto, Piero Vicini", "title": "EURETILE D7.3 - Dynamic DAL benchmark coding, measurements on MPI\n  version of DPSNN-STDP (distributed plastic spiking neural net) and\n  improvements to other DAL codes", "comments": "34 pages. arXiv admin note: substantial text overlap with\n  arXiv:1310.8478", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CE cs.MS cs.NE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The EURETILE project required the selection and coding of a set of dedicated\nbenchmarks. The project is about the software and hardware architecture of\nfuture many-tile distributed fault-tolerant systems. We focus on dynamic\nworkloads characterised by heavy numerical processing requirements. The\nambition is to identify common techniques that could be applied to both the\nEmbedded Systems and HPC domains. This document is the first public deliverable\nof Work Package 7: Challenging Tiled Applications.\n", "versions": [{"version": "v1", "created": "Wed, 20 Aug 2014 10:00:15 GMT"}], "update_date": "2014-08-21", "authors_parsed": [["Paolucci", "Pier Stanislao", ""], ["Bacivarov", "Iuliana", ""], ["Rai", "Devendra", ""], ["Schor", "Lars", ""], ["Thiele", "Lothar", ""], ["Yang", "Hoeseok", ""], ["Pastorelli", "Elena", ""], ["Ammendola", "Roberto", ""], ["Biagioni", "Andrea", ""], ["Frezza", "Ottorino", ""], ["Cicero", "Francesca Lo", ""], ["Lonardo", "Alessandro", ""], ["Simula", "Francesco", ""], ["Tosoratto", "Laura", ""], ["Vicini", "Piero", ""]]}, {"id": "1408.4767", "submitter": "Wilten Nicola", "authors": "Wilten Nicola and Sue Ann Campbell", "title": "Non-smooth Bifurcations of Mean Field Systems of Two-Dimensional\n  Integrate and Fire Neurons", "comments": "35 Pages , 12 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mean-field systems have been recently derived that adequately predict the\nbehaviors of large networks of coupled integrate-and-fire neurons [14]. The\nmean-field system for a network of neurons with spike frequency adaptation is\ntypically a pair of differential equations for the mean adaptation and mean\nsynaptic gating variable of the network. These differential equations are\nnon-smooth, and in particular are piecewise smooth continuous (PWSC). Here, we\nanalyze the smooth and non-smooth bifurcation structure of these equations and\nshow that the system is organized around a pair of co-dimension two\nbifurcations that involve, respectively, the collision between a Hopf\nequilibrium point and a switching manifold, and a saddle-node equilibrium point\nand a switching manifold. These two co-dimension 2 bifurcations can coalesce\ninto a co-dimension 3 non-smooth bifurcation. As the mean-field system we study\nis a non-generic piecewise smooth continuous system, we discuss possible\nregularizations of this system and how the bifurcations which occur are related\nto non-smooth bifurcations displayed by generic PWSC systems.\n", "versions": [{"version": "v1", "created": "Wed, 20 Aug 2014 19:12:07 GMT"}], "update_date": "2014-08-21", "authors_parsed": [["Nicola", "Wilten", ""], ["Campbell", "Sue Ann", ""]]}, {"id": "1408.5371", "submitter": "Robert Leech", "authors": "Gregory Scott, Peter J. Hellyer, Adam Hampshire, Robert Leech", "title": "Exploring spatiotemporal network transitions in task functional MRI", "comments": "43 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A critical question for cognitive neuroscience regards how transitions\nbetween cognitive states emerge from the dynamic activity of functional brain\nnetworks. However, current methodologies cannot easily evaluate both the\nspatial and temporal changes in brain networks with cognitive state. Here we\ncombine a simple data reorganization with spatial ICA, enabling a\nspatiotemporal ICA (stICA) which captures the consistent evolution of networks\nduring onset and offset of a task. The technique was applied to FMRI datasets\ninvolving alternating between rest and task and to simple synthetic data.\nStarting and finishing time-points of periods of interest (anchors) were\ndefined at task block onsets and offsets. For each subject, the ten volumes\nfollowing each anchor were extracted and concatenated spatially, producing a\nsingle 3D sample. Samples for all anchors and subjects were concatenated along\nthe fourth dimension. This 4D dataset was decomposed using ICA into\nspatiotemporal components. One component exhibited the transition with task\nonset from a default mode network (DMN) becoming less active to a\nfronto-parietal control network (FPCN) becoming more active. We observed other\nchanges with relevance to understanding network dynamics, e.g., the DMN showed\na changing spatial distribution, shifting to an anterior/superior pattern of\ndeactivation during task from a posterior/inferior pattern during rest. By\nanchoring analyses to periods associated with the onsets and offsets of task,\nour approach reveals novel aspects of the dynamics of network activity\naccompanying these transitions. Importantly, these findings were observed\nwithout specifying a priori either the spatial networks or the task time\ncourses.\n", "versions": [{"version": "v1", "created": "Fri, 22 Aug 2014 17:58:42 GMT"}], "update_date": "2014-08-25", "authors_parsed": [["Scott", "Gregory", ""], ["Hellyer", "Peter J.", ""], ["Hampshire", "Adam", ""], ["Leech", "Robert", ""]]}, {"id": "1408.5403", "submitter": "Peilei Liu", "authors": "Peilei Liu, Ting Wang", "title": "Neural Mechanism of Language", "comments": "6 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CL q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is based on our previous work on neural coding. It is a\nself-organized model supported by existing evidences. Firstly, we briefly\nintroduce this model in this paper, and then we explain the neural mechanism of\nlanguage and reasoning with it. Moreover, we find that the position of an area\ndetermines its importance. Specifically, language relevant areas are in the\ncapital position of the cortical kingdom. Therefore they are closely related\nwith autonomous consciousness and working memories. In essence, language is a\nminiature of the real world. Briefly, this paper would like to bridge the gap\nbetween molecule mechanism of neurons and advanced functions such as language\nand reasoning.\n", "versions": [{"version": "v1", "created": "Fri, 22 Aug 2014 12:15:54 GMT"}], "update_date": "2014-08-26", "authors_parsed": [["Liu", "Peilei", ""], ["Wang", "Ting", ""]]}, {"id": "1408.6079", "submitter": "Gerrit Ansmann", "authors": "Gerrit Ansmann, Klaus Lehnertz", "title": "Surrogate-assisted analysis of weighted functional brain networks", "comments": null, "journal-ref": "Journal of Neuroscience Methods 208, 165-172 (2012)", "doi": "10.1016/j.jneumeth.2012.05.008", "report-no": null, "categories": "q-bio.NC physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graph-theoretical analyses of complex brain networks is a rapidly evolving\nfield with a strong impact for neuroscientific and related clinical research.\nDue to a number of confounding variables, however, a reliable and meaningful\ncharacterization of particularly functional brain networks is a major\nchallenge. Addressing this problem, we present an analysis approach for\nweighted networks that makes use of surrogate networks with preserved edge\nweights or vertex strengths. We first investigate whether characteristics of\nweighted networks are influenced by trivial properties of the edge weights or\nvertex strengths (e.g., their standard deviations). If so, these influences are\nthen effectively segregated with an appropriate surrogate normalization of the\nrespective network characteristic. We demonstrate this approach by\nre-examining, in a time-resolved manner, weighted functional brain networks of\nepilepsy patients and control subjects derived from simultaneous EEG/MEG\nrecordings during different behavioral states. We show that this\nsurrogate-assisted analysis approach reveals complementary information about\nthese networks, can aid with their interpretation, and thus can prevent\nderiving inappropriate conclusions.\n", "versions": [{"version": "v1", "created": "Tue, 26 Aug 2014 11:32:27 GMT"}], "update_date": "2014-08-27", "authors_parsed": [["Ansmann", "Gerrit", ""], ["Lehnertz", "Klaus", ""]]}, {"id": "1408.6132", "submitter": "Johannes Hjorth", "authors": "J. J. Johannes Hjorth, David C. Sterratt, Catherine S. Cutts, David J.\n  Willshaw, Stephen J. Eglen", "title": "Quantitative assessment of computational models for retinotopic map\n  formation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular and activity-based cues acting together are thought to guide\nretinal axons to their terminal sites in vertebrate optic tectum or superior\ncolliculus to form an ordered map of connections. The details of mechanisms\ninvolved, and the degree to which they might interact, are still not well\nunderstood. We have developed a framework within which existing computational\nmodels can be assessed in an unbiased and quantitative manner against a set of\nexperimental data curated from the mouse retinocollicular system. Our framework\nfacilitates comparison between models, testing new models against known\nphenotypes and simulating new phenotypes in existing models. We have used this\nframework to assess four representative models that combine Eph/ephrin\ngradients and/or activity-based mechanisms and competition. Two of the models\nwere updated from their original form to fit into our framework. The models\nwere tested against five different phenotypes: wild type, Isl2-EphA3 ki/ki,\nIsl2-EphA3 ki/+, ephrin-A2,A3,A5 triple knock-out and Math-/- (Atoh7). Only one\nmodel could account for the collapse point in Isl2-EphA3 ki/+, and two models\nsuccessfully reproduced the extent of the Math5-/- anteromedial projection. The\nmodels needed a weak anteroposterior gradient in the superior colliculus in\norder to reproduce the residual order in the ephrin-A2,A3,A5 triple knock-out\nphenotype, suggesting either an incomplete knock-out or the presence of another\nguidance molecule. This points to the need for future modelling and\nexperimental work to improve our understanding of the developmental mechanisms\ninvolved.\n", "versions": [{"version": "v1", "created": "Tue, 26 Aug 2014 14:43:38 GMT"}], "update_date": "2014-08-27", "authors_parsed": [["Hjorth", "J. J. Johannes", ""], ["Sterratt", "David C.", ""], ["Cutts", "Catherine S.", ""], ["Willshaw", "David J.", ""], ["Eglen", "Stephen J.", ""]]}, {"id": "1408.6777", "submitter": "William Levy Ph. D.", "authors": "William B. Levy, Toby Berger, Ilya A. Fleidervish", "title": "Neural computation at the thermal limit", "comments": "2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Although several measurements and analyses support the idea that the brain is\nenergy-optimized, there is one disturbing, contradictory observation: In\ntheory, computation limited by thermal noise can occur as cheaply as ~$2.9\\cdot\n10^{-21}$ joules per bit (kTln2). Unfortunately, for a neuron the ostensible\ndiscrepancy from this minimum is startling - ignoring inhibition the\ndiscrepancy is $10^7$ times this amount and taking inhibition into account\n$>10^9$. Here we point out that what has been defined as neural computation is\nactually a combination of computation and neural communication: the\ncommunication costs, transmission from each excitatory postsynaptic activation\nto the S4-gating-charges of the fast Na+ channels of the initial segment\n(fNa's), dominate the joule-costs. Making this distinction between\ncommunication to the initial segment and computation at the initial segment\n(i.e., adding up of the activated fNa's) implies that the size of the average\nsynaptic event reaching the fNa's is the size of the standard deviation of the\nthermal noise. Moreover, defining computation as the addition of activated\nfNa's, yields a biophysically plausible mechanism for approaching the desired\nminimum. This mechanism, requiring something like the electrical engineer's\nequalizer (not much more than the action potential generating conductances),\nonly operates at threshold. This active filter modifies the last few synaptic\nexcitations, providing barely enough energy to allow the last sub-threshold\ngating charge to transport. That is, the last, threshold-achieving S4-subunit\nactivation requires an energy that matches the information being provided by\nthe last few synaptic events, a ratio that is near kTln2 joules per bit.\n", "versions": [{"version": "v1", "created": "Thu, 28 Aug 2014 17:02:11 GMT"}, {"version": "v2", "created": "Fri, 21 Nov 2014 01:55:14 GMT"}], "update_date": "2014-11-24", "authors_parsed": [["Levy", "William B.", ""], ["Berger", "Toby", ""], ["Fleidervish", "Ilya A.", ""]]}, {"id": "1408.6849", "submitter": "Liane Gabora", "authors": "Nicole Carbert, Liane Gabora, Jasmine Schwartz, and Apara Ranjan", "title": "Cognitive States of Potentiality in Art-making", "comments": "6 pages", "journal-ref": "Carbert, N., Gabora, L., Schwartz, J., & Ranjan, A. (2014). States\n  of cognitive potentiality in art-making. Proceedings of the AIEA Congress on\n  Empirical Aesthetics (pp. 121-126). Held August 22-24, New York", "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Creativity is thought to involve searching and selecting amongst multiple\ndiscrete idea candidates. Honing theory predicts that it involves actualizing\nthe potentiality of as few as a single ill-defined idea by viewing it from\ndifferent contexts. This paper reports on a study that tests between these\ntheories. Participants were invited to \"Create a painting that expresses\nyourself in any style that appeals to you\", and asked \"Were all of your ideas\nfor your painting distinct and separate ideas?\" Naive judges were provided with\ndescriptions of the two theories of creativity, sample answers, and practice\nresponses to classify. The judges were significantly more likely to classify\nthe artists' responses as 'H', indicative of honing theory rather than 'S'\nindicative of a search-select view of creativity.\n", "versions": [{"version": "v1", "created": "Thu, 28 Aug 2014 20:05:17 GMT"}], "update_date": "2014-09-01", "authors_parsed": [["Carbert", "Nicole", ""], ["Gabora", "Liane", ""], ["Schwartz", "Jasmine", ""], ["Ranjan", "Apara", ""]]}, {"id": "1408.6896", "submitter": "Benjamin de Bivort", "authors": "Sean Buchanan, Jamey Kain and Benjamin de Bivort", "title": "Neuronal control of locomotor handedness in Drosophila", "comments": "14 pages, 13 figures", "journal-ref": null, "doi": "10.1073/pnas.1500804112", "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Handedness in humans - better performance using either the left or right hand\n- is personally familiar, moderately heritable, and regulated by many genes,\nincluding those involved in general body symmetry. But behavioral handedness,\ni.e. lateralization, is a multifaceted phenomenon. For example, people display\nclockwise or counter-clockwise biases in their walking behavior that is\nuncorrelated to their hand dominance, and lateralized behavioral biases have\nbeen shown in species as disparate as mice (paw usage), octopi (eye usage), and\ntortoises (side rolled on during righting). However, the mechanisms by which\nasymmetries are instilled in behavior are unknown, and a system for studying\nbehavioral handedness in a genetically tractable model system is needed. Here\nwe show that Drosophila melanogaster flies exhibit striking variability in\ntheir left-right choice behavior during locomotion. Very strongly biased\n\"left-handed\" and \"right-handed\" individuals are common in every line assayed.\nThe handedness of an individual persists for its lifetime, but is not passed on\nto progeny, suggesting that mechanisms other than genetics determine individual\nhandedness. We use the Drosophila transgenic toolkit to map a specific set of\nneurons within the central complex that regulates the strength of behavioral\nhandedness within a line. These findings give insights into choice behaviors\nand laterality in a simple model organism, and demonstrate that individuals\nfrom isogenic populations reared under experimentally identical conditions\nnevertheless display idiosyncratic behaviors.\n", "versions": [{"version": "v1", "created": "Fri, 29 Aug 2014 01:29:45 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Buchanan", "Sean", ""], ["Kain", "Jamey", ""], ["de Bivort", "Benjamin", ""]]}]