[{"id": "1509.00171", "submitter": "Yuri A. Dabaghian", "authors": "A. Babichev, S. Cheng and Yu. Dabaghian", "title": "Topological schemas of cognitive maps and spatial learning in the\n  hippocampus", "comments": "17 pages, 11 figures, Frontiers in Computational Neuroscience, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatial navigation in mammals is based on building a mental representation of\ntheir environment---a cognitive map. However, both the nature of this cognitive\nmap and its underpinning in neural structures and activity remains vague. A key\ndifficulty is that these maps are collective, emergent phenomena that cannot be\nreduced to a simple combination of inputs provided by individual neurons. In\nthis paper we suggest computational frameworks for integrating the spiking\nsignals of individual cells into a spatial map, which we call schemas. We\nprovide examples of four schemas defined by different types of topological\nrelations that may be neurophysiologically encoded in the brain and demonstrate\nthat each schema provides its own large-scale characteristics of the\nenvironment---the schema integrals. Moreover, we find that, in all cases, these\nintegrals are learned at a rate which is faster than the rate of complete\ntraining of neural networks. Thus, the proposed schema framework differentiates\nbetween the cognitive aspect of spatial learning and the physiological aspect\nat the neural network level.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2015 08:13:59 GMT"}, {"version": "v2", "created": "Sun, 20 Mar 2016 19:33:00 GMT"}], "update_date": "2016-03-22", "authors_parsed": [["Babichev", "A.", ""], ["Cheng", "S.", ""], ["Dabaghian", "Yu.", ""]]}, {"id": "1509.00998", "submitter": "Zhaofei Yu", "authors": "Zhaofei Yu, Feng Chen, Jianwu Dong, Qionghai Dai", "title": "Sampling-based Causal Inference in Cue Combination and its Neural\n  Implementation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Causal inference in cue combination is to decide whether the cues have a\nsingle cause or multiple causes. Although the Bayesian causal inference model\nexplains the problem of causal inference in cue combination successfully, how\ncausal inference in cue combination could be implemented by neural circuits, is\nunclear. The existing method based on calculating log posterior ratio with\nvariable elimination has the problem of being unrealistic and task-specific. In\nthis paper, we take advantages of the special structure of the Bayesian causal\ninference model and propose a hierarchical inference algorithm based on\nimportance sampling. A simple neural circuit is designed to implement the\nproposed inference algorithm. Theoretical analyses and experimental results\ndemonstrate that our algorithm converges to the accurate value as the sample\nsize goes to infinite. Moreover, the neural circuit we design can be easily\ngeneralized to implement inference for other problems, such as the\nmulti-stimuli cause inference and the same-different judgment.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2015 09:13:05 GMT"}], "update_date": "2015-09-04", "authors_parsed": [["Yu", "Zhaofei", ""], ["Chen", "Feng", ""], ["Dong", "Jianwu", ""], ["Dai", "Qionghai", ""]]}, {"id": "1509.01206", "submitter": "Raimondo D'Ambrosio", "authors": "Raimondo D'Ambrosio, Clifford L. Eastman, John W. Miller", "title": "Inadequate experimental methods and erroneous epilepsy diagnostic\n  criteria result in confounding acquired focal epilepsy with genetic absence\n  epilepsy", "comments": "Supplementary document, 10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we provide a thorough discussion of the study conducted by Rodgers et\nal. (J Neurosci. 2015; 35(24):9194-204. doi: 10.1523/JNEUROSCI.0919-15.2015) to\ninvestigate focal seizures and acquired epileptogenesis induced by head injury\nin the rat. This manuscript serves as supplementary document for our letter to\nthe Editor to appear in the Journal of Neuroscience. We find that the subject\narticle suffers from poor experimental design, very selective consideration of\nantecedent literature, and application of inappropriate epilepsy diagnostic\ncriteria which, together, lead to unwarranted conclusions.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2015 18:48:46 GMT"}], "update_date": "2015-09-04", "authors_parsed": [["D'Ambrosio", "Raimondo", ""], ["Eastman", "Clifford L.", ""], ["Miller", "John W.", ""]]}, {"id": "1509.01224", "submitter": "James Kunert", "authors": "James Kunert, Eli Shlizerman, Andrew Walker and J. Nathan Kutz", "title": "The role of multistability and transient trajectories in networked\n  dynamical systems: Connectomic dynamics of C. elegans and behavioral assays", "comments": "8 Pages, 5 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The neural dynamics of the nematode C. elegans are experimentally\nlow-dimensional and correspond to discrete behavioral states, where previous\nmodeling work has found neural proxies for some of these states. Experimental\nresults further suggest that dynamics may be understood as long-timescale\ntransitions between multiple low-dimensional attractors. To identify\nmultistable regimes of our model, we develop a method for systematic generation\nof bifurcation diagrams and their analysis in an interpretable low-dimensional\nsubspace, showing the existence and nature of multistable input responses at a\nglance. Stimulation of the PLM neuron pair, experimentally associated with\nforward movement and shown in simulation to drive a limit cycle, defines our\nlow-dimensional projection space. We then obtain bifurcation diagrams for\nsingle-neuron excitation over a range of amplitudes and which classify whether\nthe dynamics in this projection space are associated with a limit cycle, fixed\npoint, or multiple states. In the specific case of compound input into both the\nPLM pair and ASK pair we discover bistability of a limit cycle and a fixed\npoint, with transitional timescales between different states being much longer\nthan other timescales in the system. This suggests consistency of our model\nwith the characterization of dynamics in neural systems as long-timescale\ntransitions between discrete, low-dimensional attractors corresponding to\nbehavioral states. Our methodology thus prescribes a method for identifying\nthese states and transitions in response to arbitrary input.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2015 19:22:04 GMT"}], "update_date": "2015-09-04", "authors_parsed": [["Kunert", "James", ""], ["Shlizerman", "Eli", ""], ["Walker", "Andrew", ""], ["Kutz", "J. Nathan", ""]]}, {"id": "1509.01315", "submitter": "Denis Boyer", "authors": "Denis Boyer, Inti Pineda", "title": "Slow L\\'evy flights", "comments": "6 pages, 2 figures", "journal-ref": "Phys. Rev. E 93, 022103 (2016)", "doi": "10.1103/PhysRevE.93.022103", "report-no": null, "categories": "cond-mat.stat-mech q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Among Markovian processes, the hallmark of L\\'evy flights is superdiffusion,\nor faster-than-Brownian dynamics. Here we show that L\\'evy laws, as well as\nGaussians, can also be the limit distributions of processes with long range\nmemory that exhibit very slow diffusion, logarithmic in time. These processes\nare path-dependent and anomalous motion emerges from frequent relocations to\nalready visited sites. We show how the Central Limit Theorem is modified in\nthis context, keeping the usual distinction between analytic and non-analytic\ncharacteristic functions. A fluctuation-dissipation relation is also derived.\nOur results may have important applications in the study of animal and human\ndisplacements.\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2015 00:43:35 GMT"}, {"version": "v2", "created": "Thu, 4 Feb 2016 17:50:44 GMT"}], "update_date": "2016-02-10", "authors_parsed": [["Boyer", "Denis", ""], ["Pineda", "Inti", ""]]}, {"id": "1509.01481", "submitter": "Jurgis Pods", "authors": "Jurgis Pods", "title": "A Comparison of Computational Models for the Extracellular Potential of\n  Neurons", "comments": "12 pages (incl. references), 4 figures (color)", "journal-ref": "Journal of Integrative Neuroscience, vol. 16, no. 1, pp. 19-32,\n  2017", "doi": "10.3233/JIN-170009", "report-no": null, "categories": "q-bio.NC cs.CE cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The extracellular space has an ambiguous role in neuroscience. It is present\nin every physiologically relevant system and often used as a measurement site\nin experimental recordings, but it has received subordinate attention compared\nto the intracellular domain. In computational modeling, it is often regarded as\na passive, homogeneous resistive medium with a constant conductivity, which\ngreatly simplifies the computation of extracellular potentials. However, recent\nstudies have shown that local ionic diffusion and capacitive effects of\nelectrically active membranes can have a substantial impact on the\nextracellular potential. These effects can not be described by traditional\nmodels, and they have been subject to theoretical and experimental analyses. We\nstrive to give an overview over recent progress in modeling the extracellular\nspace with special regard towards the concentration and potential dynamics on\ndifferent temporal and spatial scales. Three models with distinct assumptions\nand levels of detail are compared both theoretically and by means of numerical\nsimulations: the classical volume conductor (VC) model, which is most\nfrequently used in form of the line source approximation (LSA); the very\ndetailed, but computationally intensive Poisson-Nernst-Planck model of\nelectrodiffusion (PNP); and an intermediate one called the electroneutral model\n(EN). The results clearly show that there is no one model for all applications,\nas they show significantly different responses especially close to neuronal\nmembranes. Finally, we list some common use cases for model simulations and\ngive recommendations on which model to use in each situation.\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2015 15:01:44 GMT"}], "update_date": "2017-05-02", "authors_parsed": [["Pods", "Jurgis", ""]]}, {"id": "1509.01677", "submitter": "Yuri A. Dabaghian", "authors": "A. Babichev, D. Ji, F. Memoli and Y. Dabaghian", "title": "Combinatorics of Place Cell Coactivity and Hippocampal Maps", "comments": "22 pages, 9 Figures, 6 Supplementary Figures, 4 Supplementary Movies\n  available upon request", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is widely accepted that the hippocampal place cells' spiking activity\nproduces a cognitive map of space. However, many details of this\nrepresentation's physiological mechanism remain unknown. For example, it is\nbelieved that the place cells exhibiting frequent coactivity form functionally\ninterconnected groups---place cell assemblies---that drive readout neurons in\nthe downstream networks. However, the sheer number of coactive combinations is\nextremely large, which implies that only a small fraction of them actually\ngives rise to cell assemblies. The physiological processes responsible for\nselecting the winning combinations are highly complex and are usually modeled\nvia detailed synaptic and structural plasticity mechanisms. Here we propose an\nalternative approach that allows modeling the cell assembly network directly,\nbased on a small number of phenomenological selection rules. We then\ndemonstrate that the selected population of place cell assemblies correctly\nencodes the topology of the environment in biologically plausible time, and may\nserve as a schematic model of the hippocampal network.\n", "versions": [{"version": "v1", "created": "Sat, 5 Sep 2015 08:31:44 GMT"}], "update_date": "2015-09-08", "authors_parsed": [["Babichev", "A.", ""], ["Ji", "D.", ""], ["Memoli", "F.", ""], ["Dabaghian", "Y.", ""]]}, {"id": "1509.01893", "submitter": "Herv\\'e Rouault", "authors": "Herv\\'e Rouault and Shaul Druckmann", "title": "Spectrum density of large sparse random matrices associated to neural\n  networks", "comments": "5 pages, 3 figures and one supplementary information (8 pages, 1\n  figure)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The eigendecomposition of the coupling matrix of large biological networks is\ncentral to the study of the dynamics of these networks. For neural networks,\nthis matrix should reflect the topology of the network and conform with Dale's\nlaw which states that a neuron can have only all excitatory or only all\ninhibitory output connections, i.e., coefficients of one column of the coupling\nmatrix must all have the same sign. The eigenspectrum density has been\ndetermined before for dense matrices $J_{ij}$, when several populations are\nconsidered. However, the expressions were derived under the assumption of dense\nconnectivity, whereas neural circuits have sparse connections. Here, we\nfollowed mean-field approaches in order to come up with exact self-consistent\nexpressions for the spectrum density in the limit of sparse matrices for both\nsymmetric and neural network matrices. Furthermore we introduced approximations\nthat allow for good numerical evaluation of the density. Finally, we studied\nthe phenomenology of localization properties of the eigenvectors.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2015 03:43:47 GMT"}], "update_date": "2015-09-08", "authors_parsed": [["Rouault", "Hervé", ""], ["Druckmann", "Shaul", ""]]}, {"id": "1509.01913", "submitter": "Philippe Terrier PhD", "authors": "Philippe Terrier", "title": "Fractal Fluctuations in Human Walking: Comparison between Auditory and\n  Visually Guided Stepping", "comments": "Article accepted for publication in the Annals of Biomedical\n  Engineering. Revised in February 2016: final author's version", "journal-ref": null, "doi": "10.1007/s10439-016-1573-y", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In human locomotion, sensorimotor synchronization of gait consists of the\ncoordination of stepping with rhythmic auditory cues (auditory cueing, AC). AC\nchanges the long-range correlations among consecutive strides (fractal\ndynamics) into anti-correlations. Visual cueing (VC) is the alignment of step\nlengths with marks on the floor. The effects of VC on the fluctuation structure\nof walking have not been investigated. Therefore, the objective was to compare\nthe effects of AC and VC on the fluctuation pattern of basic spatiotemporal\ngait parameters. Thirty-six healthy individuals walked 3 x 500 strides on an\ninstrumented treadmill with augmented reality capabilities. The conditions were\nno cueing (NC), AC, and VC. AC included an isochronous metronome. In VC,\nprojected stepping stones were synchronized with the treadmill speed. Detrended\nfluctuation analysis assessed the correlation structure. The coefficient of\nvariation (CV) was also assessed. The results showed that AC and VC similarly\ninduced a strong anti-correlated pattern in the gait parameters. The CVs were\nsimilar between the NC and AC conditions but substantially higher in the VC\ncondition. AC and VC probably mobilize similar motor control pathways and can\nbe used alternatively in gait rehabilitation. However, the increased gait\nvariability induced by VC should be considered.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2015 06:20:48 GMT"}, {"version": "v2", "created": "Thu, 10 Dec 2015 10:48:38 GMT"}, {"version": "v3", "created": "Thu, 18 Feb 2016 08:20:46 GMT"}], "update_date": "2016-02-19", "authors_parsed": [["Terrier", "Philippe", ""]]}, {"id": "1509.01972", "submitter": "Sebastian Bitzer", "authors": "Sebastian Bitzer and Stefan J. Kiebel", "title": "The Brain Uses Reliability of Stimulus Information when Making\n  Perceptual Decisions", "comments": "submission to NIPS 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In simple perceptual decisions the brain has to identify a stimulus based on\nnoisy sensory samples from the stimulus. Basic statistical considerations state\nthat the reliability of the stimulus information, i.e., the amount of noise in\nthe samples, should be taken into account when the decision is made. However,\nfor perceptual decision making experiments it has been questioned whether the\nbrain indeed uses the reliability for making decisions when confronted with\nunpredictable changes in stimulus reliability. We here show that even the basic\ndrift diffusion model, which has frequently been used to explain experimental\nfindings in perceptual decision making, implicitly relies on estimates of\nstimulus reliability. We then show that only those variants of the drift\ndiffusion model which allow stimulus-specific reliabilities are consistent with\nneurophysiological findings. Our analysis suggests that the brain estimates the\nreliability of the stimulus on a short time scale of at most a few hundred\nmilliseconds.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2015 10:21:42 GMT"}], "update_date": "2015-09-08", "authors_parsed": [["Bitzer", "Sebastian", ""], ["Kiebel", "Stefan J.", ""]]}, {"id": "1509.02546", "submitter": "Johnatan Aljadeff", "authors": "Johnatan Aljadeff, David Renfrew, Marina Vegu\\'e, Tatyana O. Sharpee", "title": "On the low dimensional dynamics of structured random networks", "comments": "16 pages, 4 figures", "journal-ref": "Phys. Rev. E 93, 022302 (2016)", "doi": "10.1103/PhysRevE.93.022302", "report-no": null, "categories": "cond-mat.dis-nn q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using a generalized random recurrent neural network model, and by extending\nour recently developed mean-field approach [J. Aljadeff, M. Stern, T. Sharpee,\nPhys. Rev. Lett. 114, 088101 (2015)], we study the relationship between the\nnetwork connectivity structure and its low dimensional dynamics. Each\nconnection in the network is a random number with mean 0 and variance that\ndepends on pre- and post-synaptic neurons through a sufficiently smooth\nfunction $g$ of their identities. We find that these networks undergo a phase\ntransition from a silent to a chaotic state at a critical point we derive as a\nfunction of $g$. Above the critical point, although unit activation levels are\nchaotic, their autocorrelation functions are restricted to a low dimensional\nsubspace. This provides a direct link between the network's structure and some\nof its functional characteristics. We discuss example applications of the\ngeneral results to neuroscience where we derive the support of the spectrum of\nconnectivity matrices with heterogeneous and possibly correlated degree\ndistributions, and to ecology where we study the stability of the cascade model\nfor food web structure.\n", "versions": [{"version": "v1", "created": "Tue, 8 Sep 2015 20:30:14 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Aljadeff", "Johnatan", ""], ["Renfrew", "David", ""], ["Vegué", "Marina", ""], ["Sharpee", "Tatyana O.", ""]]}, {"id": "1509.02580", "submitter": "James Kozloski", "authors": "James Kozloski", "title": "Brain Model of Information Based Exchange", "comments": "27 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we describe an \"information based exchange\" model of brain function that\nascribes to neocortex, basal ganglia, and thalamus distinct network functions.\nThe model allows us to analyze whole brain system set point measures, such as\nthe rate and heterogeneity of transitions in striatum and neocortex, in the\ncontext of disease perturbations. Our closed-loop model invokes different forms\nof plasticity at specific tissue interfaces and their principle cell synapses\nto achieve these transitions. By modulating information based exchange of\naction potentials between modeled neocortical areas, we observe changes to\nthese measures in simulation. We hypothesize that similar dynamic set points\nand modulations exist in the brain's resting state activity, and that germ line\nmodifications of information based exchange may increase the risk of diseases\nsuch as Huntington's, Parkinson's, and Alzheimer's. Disturbances in synaptic\nplasticity at distinct tissue interfaces in the model may be used to estimate\nrisks of system dysfunction and neuronal cell death from quantitative analyses\nof the global dynamics that maintain system set points. The model is targeted\nfor further development using IBM's Neural Tissue Simulator, which allows\nscalable elaboration of networks, tissues, and their neural and synaptic\ncomponents towards ever greater complexity and biological realism. Elaboration\nof these simulations within each modeled neural tissue allows in silico study\nof therapeutic interventions in living brain tissue.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 00:09:15 GMT"}, {"version": "v2", "created": "Tue, 15 Sep 2015 20:33:53 GMT"}], "update_date": "2015-09-17", "authors_parsed": [["Kozloski", "James", ""]]}, {"id": "1509.02697", "submitter": "Daniele Marinazzo", "authors": "Sebastiano Stramaglia, Mario Pellicoro, Leonardo Angelini, Enrico\n  Amico, Hannelore Aerts, Jesus Cort\\'es, Steven Laureys, Daniele Marinazzo", "title": "Conserved Ising Model on the Human Connectome", "comments": null, "journal-ref": "Chaos 27, 047407 (2017)", "doi": "10.1063/1.4978999", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamical models implemented on the large scale architecture of the human\nbrain may shed light on how function arises from the underlying structure. This\nis the case notably for simple abstract models, such as the Ising model. We\ncompare the spin correlations of the Ising model and the empirical functional\nbrain correlations, both at the single link level and at the modular level, and\nshow that their match increases at the modular level in anesthesia, in line\nwith recent results and theories. Moreover, we show that at the peak of the\nspecific heat (the \\it{critical state}) the spin correlations are minimally\nshaped by the underlying structural network, explaining how the best match\nbetween structure and function is obtained at the onset of criticality, as\npreviously observed. These findings confirm that brain dynamics under\nanesthesia shows a departure from criticality and could open the way to novel\nperspectives when the conserved magnetization is interpreted in terms of an\nhomeostatic principle imposed to neural activity.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 09:51:53 GMT"}, {"version": "v2", "created": "Thu, 6 Apr 2017 15:12:44 GMT"}], "update_date": "2017-04-07", "authors_parsed": [["Stramaglia", "Sebastiano", ""], ["Pellicoro", "Mario", ""], ["Angelini", "Leonardo", ""], ["Amico", "Enrico", ""], ["Aerts", "Hannelore", ""], ["Cortés", "Jesus", ""], ["Laureys", "Steven", ""], ["Marinazzo", "Daniele", ""]]}, {"id": "1509.02781", "submitter": "Longfei Wang", "authors": "Longfei Wang, Hengtong Wang, Lianchun Yu, Yong Chen", "title": "Spike-Threshold Variability Originated from Separatrix-Crossing in\n  Neuronal Dynamics", "comments": "28 pages, 17 figures with 9 in supporting information", "journal-ref": "Sci Rep 6, 31719 (2016)", "doi": "10.1038/srep31719", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The threshold voltage for action potential generation is a key regulator of\nneuronal signal transduction, yet the mechanism of its dynamic variation is\nstill not well described. In this paper, we propose that threshold phenomena\ncan be classified as parameter thresholds and state thresholds. Voltage\nthresholds which belong to the state threshold are determined by the `general\nseparatrix' in state space. We demonstrate that the separatrix generally exists\nin the state space of neuron models. The general form of separatrix was assumed\nas the function of both states and stimuli and the previously assumed threshold\nevolving equation versus time is naturally deduced from the separatrix. In\nterms of neuron dynamics, the threshold voltage variation, which is affected by\ndifferent stimuli, is determined by crossing the separatrix at different points\nin state space. We suggest that the separatrix-crossing mechanism in state\nspace is the intrinsic dynamic mechanism for threshold voltages and\npost-stimulus threshold phenomena. These proposals are also systematically\nverified in example models, three of which have analytic separatrices and one\nis the classic Hodgkin-Huxley model. The separatrix-crossing framework provides\nan overview of the neuronal threshold and will facilitate understanding of the\nnature of threshold variability.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 13:58:53 GMT"}, {"version": "v2", "created": "Wed, 13 Jan 2016 13:49:40 GMT"}, {"version": "v3", "created": "Sat, 4 Jun 2016 03:21:24 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Wang", "Longfei", ""], ["Wang", "Hengtong", ""], ["Yu", "Lianchun", ""], ["Chen", "Yong", ""]]}, {"id": "1509.03162", "submitter": "Jannis Schuecker", "authors": "Jannis Schuecker, Maximilian Schmidt, Sacha J. van Albada, Markus\n  Diesmann, Moritz Helias", "title": "Fundamental activity constraints lead to specific interpretations of the\n  connectome", "comments": "J. Schuecker and M. Schmidt contributed equally to this work", "journal-ref": "PLOS CB 13, 1-25 (2017)", "doi": "10.1371/journal.pcbi.1005179", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The continuous integration of experimental data into coherent models of the\nbrain is an increasing challenge of modern neuroscience. Such models provide a\nbridge between structure and activity, and identify the mechanisms giving rise\nto experimental observations. Nevertheless, structurally realistic network\nmodels of spiking neurons are necessarily underconstrained even if experimental\ndata on brain connectivity are incorporated to the best of our knowledge.\nGuided by physiological observations, any model must therefore explore the\nparameter ranges within the uncertainty of the data. Based on simulation\nresults alone, however, the mechanisms underlying stable and physiologically\nrealistic activity often remain obscure. We here employ a mean-field reduction\nof the dynamics, which allows us to include activity constraints into the\nprocess of model construction. We shape the phase space of a multi-scale\nnetwork model of the vision-related areas of macaque cortex by systematically\nrefining its connectivity. Fundamental constraints on the activity, i.e.,\nprohibiting quiescence and requiring global stability, prove sufficient to\nobtain realistic layer- and area-specific activity. Only small adaptations of\nthe structure are required, showing that the network operates close to an\ninstability. The procedure identifies components of the network critical to its\ncollective dynamics and creates hypotheses for structural data and future\nexperiments. The method can be applied to networks involving any neuron model\nwith a known gain function.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2015 14:01:48 GMT"}, {"version": "v2", "created": "Fri, 19 Feb 2016 16:33:55 GMT"}, {"version": "v3", "created": "Mon, 4 Apr 2016 07:34:37 GMT"}, {"version": "v4", "created": "Thu, 2 Mar 2017 08:03:15 GMT"}], "update_date": "2017-03-03", "authors_parsed": [["Schuecker", "Jannis", ""], ["Schmidt", "Maximilian", ""], ["van Albada", "Sacha J.", ""], ["Diesmann", "Markus", ""], ["Helias", "Moritz", ""]]}, {"id": "1509.03328", "submitter": "Anne Shiu", "authors": "Caitlin Lienkaemper, Anne Shiu, and Zev Woodstock", "title": "Obstructions to convexity in neural codes", "comments": "21 pages, 1 table; published version", "journal-ref": "Advances in Applied Mathematics, vol. 85, pp. 31-59 (2017)", "doi": "10.1016/j.aam.2016.11.006", "report-no": null, "categories": "q-bio.NC math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How does the brain encode spatial structure? One way is through hippocampal\nneurons called place cells, which become associated to convex regions of space\nknown as their receptive fields: each place cell fires at a high rate precisely\nwhen the animal is in the receptive field. The firing patterns of multiple\nplace cells form what is known as a convex neural code. How can we tell when a\nneural code is convex? To address this question, Giusti and Itskov identified a\nlocal obstruction, defined via the topology of a code's simplicial complex, and\nproved that convex neural codes have no local obstructions. Curto et al. proved\nthe converse for all neural codes on at most four neurons. Via a counterexample\non five neurons, we show that this converse is false in general. Additionally,\nwe classify all codes on five neurons with no local obstructions. This\nclassification is enabled by our enumeration of connected simplicial complexes\non 5 vertices up to isomorphism. Finally, we examine how local obstructions are\nrelated to maximal codewords (maximal sets of neurons that co-fire). Curto et\nal. proved that a code has no local obstructions if and only if it contains\ncertain \"mandatory\" intersections of maximal codewords. We give a new criterion\nfor an intersection of maximal codewords to be non-mandatory, and prove that it\nclassifies all such non-mandatory codewords for codes on up to 5 neurons.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2015 20:33:19 GMT"}, {"version": "v2", "created": "Mon, 19 Dec 2016 02:33:20 GMT"}], "update_date": "2016-12-20", "authors_parsed": [["Lienkaemper", "Caitlin", ""], ["Shiu", "Anne", ""], ["Woodstock", "Zev", ""]]}, {"id": "1509.03621", "submitter": "Luca Mazzucato", "authors": "Luca Mazzucato, Alfredo Fontanini, Giancarlo La Camera", "title": "Stimuli reduce the dimensionality of cortical activity", "comments": "30 pages, 8 figures; v2 in press, 9 figures, major improvements,\n  including comparison to shuffled datasets, analytical derivation of\n  estimation bias; v3, fixed typo in Fig. 8A", "journal-ref": "Front Syst Neurosci. 2016 Feb 17;10:11", "doi": "10.3389/fnsys.2016.00011", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The activity of ensembles of simultaneously recorded neurons can be\nrepresented as a set of points in the space of firing rates. Even though the\ndimension of this space is equal to the ensemble size, neural activity can be\neffectively localized on smaller subspaces. The dimensionality of the neural\nspace is an important determinant of the computational tasks supported by the\nneural activity. Here, we investigate the dimensionality of neural ensembles\nfrom the sensory cortex of alert rats during period of ongoing (inter-trial)\nand stimulus-evoked activity. We find that dimensionality grows linearly with\nensemble size, and grows significantly faster during ongoing activity compared\nto evoked activity. We explain these results using a spiking network model\nbased on a clustered architecture. The model captures the difference in growth\nrate between ongoing and evoked activity and predicts a characteristic scaling\nwith ensemble size that could be tested in high-density multi-electrode\nrecordings. Moreover, the model predicts the existence of an upper bound on\ndimensionality. This upper bound is inversely proportional to the amount of\npair-wise correlations and, compared to a homogeneous network without clusters,\nit is larger by a factor equal to the number of clusters. The empirical\nestimation of such bounds depends on the number and duration of trials.\nTogether, these results provide a framework to analyze neural dimensionality in\nalert animals, its behavior under stimulus presentation, and its theoretical\ndependence on ensemble size, number of clusters, and pair-wise correlations in\nspiking network models.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2015 19:36:39 GMT"}, {"version": "v2", "created": "Thu, 4 Feb 2016 19:15:49 GMT"}, {"version": "v3", "created": "Wed, 16 Mar 2016 14:25:55 GMT"}], "update_date": "2016-03-17", "authors_parsed": [["Mazzucato", "Luca", ""], ["Fontanini", "Alfredo", ""], ["La Camera", "Giancarlo", ""]]}, {"id": "1509.03937", "submitter": "Ketan Mehta", "authors": "Ketan Mehta and J\\\"org Kliewer", "title": "An Information Theoretic Approach Towards Assessing Perceptual Audio\n  Quality using EEG", "comments": "29 pages, 10 figures, IEEE Transactions on Molecular, Biological and\n  Multi-scale Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel information theoretic model to interpret\nthe entire \"transmission chain\" comprising stimulus generation, brain\nprocessing by the human subject, and the electroencephalograph (EEG) response\nmeasurements as a nonlinear, time-varying communication channel with memory. We\nuse mutual information (MI) as a measure to assess audio quality perception by\ndirectly measuring the brainwave responses of the human subjects using a high\nresolution EEG. Our focus here is on audio where the quality is impaired by\ntime varying distortions. In particular, we conduct experiments where subjects\nare presented with audio whose quality varies with time between different\npossible quality levels. The recorded EEG measurements can be modeled as a\nmultidimensional Gaussian mixture model (GMM). In order to make the computation\nof the MI feasible, we present a novel low-complexity approximation technique\nfor the differential entropy of the multidimensional GMM. We find the proposed\ninformation theoretic approach to be successful in quantifying subjective audio\nquality perception, with the results being consistent across different music\nsequences and distortion types.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2015 03:07:43 GMT"}], "update_date": "2015-09-15", "authors_parsed": [["Mehta", "Ketan", ""], ["Kliewer", "Jörg", ""]]}, {"id": "1509.03942", "submitter": "Davide Barbieri", "authors": "Davide Barbieri", "title": "Geometry and dimensionality reduction of feature spaces in primary\n  visual cortex", "comments": null, "journal-ref": null, "doi": "10.1117/12.2187026", "report-no": null, "categories": "q-bio.NC cs.CV math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Some geometric properties of the wavelet analysis performed by visual neurons\nare discussed and compared with experimental data. In particular, several\nrelationships between the cortical morphologies and the parametric dependencies\nof extracted features are formalized and considered from a harmonic analysis\npoint of view.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2015 03:21:54 GMT"}], "update_date": "2016-01-20", "authors_parsed": [["Barbieri", "Davide", ""]]}, {"id": "1509.04304", "submitter": "Enzo Tagliazucchi", "authors": "Enzo Tagliazucchi, Dante R. Chialvo, Michael Siniatchkin,\n  Jean-Francois Brichant, Vincent Bonhomme, Quentin Noirhomme, Helmut Laufs,\n  Steven Laureys", "title": "Large-scale signatures of unconsciousness are consistent with a\n  departure from critical dynamics", "comments": "to appear in Journal of the Royal Society Interface", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Loss of cortical integration and changes in the dynamics of\nelectrophysiological brain signals characterize the transition from wakefulness\ntowards unconsciousness. The common mechanism underlying these observations\nremains unknown. In this study we arrive at a basic model, which explains these\nempirical observations based on the theory of phase transitions in complex\nsystems. We studied the link between spatial and temporal correlations of\nlarge-scale brain activity recorded with functional magnetic resonance imaging\nduring wakefulness, propofol-induced sedation and loss of consciousness, as\nwell as during the subsequent recovery. We observed that during unconsciousness\nactivity in frontal and thalamic regions exhibited a reduction of long-range\ntemporal correlations and a departure of functional connectivity from the\nunderlying anatomical constraints. These changes in dynamics and\nanatomy-function coupling were correlated across participants, suggesting that\ntemporal complexity and an efficient exploration of anatomical connectivity are\ninter-related phenomena. A model of a system exhibiting a phase transition\nreproduced our findings, as well as the diminished sensitivity of the cortex to\nexternal perturbations during unconsciousness. This theoretical framework\nunifies different empirical observations about brain activity during\nunconsciousness and predicts that the principles we identified are universal\nand independent of the causes behind loss of awareness.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2015 20:23:37 GMT"}, {"version": "v2", "created": "Wed, 23 Dec 2015 16:48:00 GMT"}], "update_date": "2015-12-24", "authors_parsed": [["Tagliazucchi", "Enzo", ""], ["Chialvo", "Dante R.", ""], ["Siniatchkin", "Michael", ""], ["Brichant", "Jean-Francois", ""], ["Bonhomme", "Vincent", ""], ["Noirhomme", "Quentin", ""], ["Laufs", "Helmut", ""], ["Laureys", "Steven", ""]]}, {"id": "1509.04420", "submitter": "Jonathan Heras", "authors": "J\\'onathan Heras and Gadea Mata and Germ\\'an Cuesto and Julio Rubio\n  and Miguel Morales", "title": "Neuron detection in stack images: a persistent homology interpretation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automation and reliability are the two main requirements when computers are\napplied in Life Sciences. In this paper we report on an application to neuron\nrecognition, an important step in our long-term project of providing software\nsystems to the study of neural morphology and functionality from biomedical\nimages. Our algorithms have been implemented in an ImageJ plugin called\nNeuronPersistentJ, which has been validated experimentally. The soundness and\nreliability of our approach are based on the interpretation of our processing\nmethods with respect to persistent homology, a well-known tool in computational\nmathematics.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2015 07:06:32 GMT"}], "update_date": "2015-09-16", "authors_parsed": [["Heras", "Jónathan", ""], ["Mata", "Gadea", ""], ["Cuesto", "Germán", ""], ["Rubio", "Julio", ""], ["Morales", "Miguel", ""]]}, {"id": "1509.04570", "submitter": "Todd Young", "authors": "Valentin S. Afraimovich, Gregory Moses, Todd R. Young", "title": "Two dimensional heteroclinic attractor in the generalized Lotka-Volterra\n  system", "comments": null, "journal-ref": null, "doi": "10.1088/0951-7715/29/5/1645", "report-no": null, "categories": "math.DS q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a simple dynamical model exhibiting sequential dynamics. We show\nthat in this model there exist sets of parameter values for which a cyclic\nchain of saddle equilibria, $O_k$, $k=1, \\ldots, p$, have two dimensional\nunstable manifolds that contain orbits connecting each $O_k$ to the next two\nequilibrium points $O_{k+1}$ and $O_{k+2}$ in the chain ($O_{p+1} = O_1$). We\nshow that the union of these equilibria and their unstable manifolds form a\n$2$-dimensional surface with boundary that is homeomorphic to a cylinder if $p$\nis even and a M\\\"{o}bius strip if $p$ is odd. If, further, each equilibrium in\nthe chain satisfies a condition called ``dissipativity,\" then this surface is\nasymptotically stable.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2015 14:13:50 GMT"}], "update_date": "2016-05-04", "authors_parsed": [["Afraimovich", "Valentin S.", ""], ["Moses", "Gregory", ""], ["Young", "Todd R.", ""]]}, {"id": "1509.04771", "submitter": "Moo K. Chung", "authors": "Moo K. Chung, Victoria Vilalta-Gil, Paul J. Rathouz, Benjamin B.\n  Lahey, David H. Zald", "title": "Mapping Heritability of Large-Scale Brain Networks with a Billion\n  Connections {\\em via} Persistent Homology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI q-bio.NC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many human brain network studies, we do not have sufficient number (n) of\nimages relative to the number (p) of voxels due to the prohibitively expensive\ncost of scanning enough subjects. Thus, brain network models usually suffer the\nsmall-n large-p problem. Such a problem is often remedied by sparse network\nmodels, which are usually solved numerically by optimizing L1-penalties.\nUnfortunately, due to the computational bottleneck associated with optimizing\nL1-penalties, it is not practical to apply such methods to construct\nlarge-scale brain networks at the voxel-level. In this paper, we propose a new\nscalable sparse network model using cross-correlations that bypass the\ncomputational bottleneck. Our model can build sparse brain networks at the\nvoxel level with p > 25000. Instead of using a single sparse parameter that may\nnot be optimal in other studies and datasets, the computational speed gain\nenables us to analyze the collection of networks at every possible sparse\nparameter in a coherent mathematical framework via persistent homology. The\nmethod is subsequently applied in determining the extent of heritability on a\nfunctional brain network at the voxel-level for the first time using twin fMRI.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2015 23:54:12 GMT"}, {"version": "v2", "created": "Wed, 29 Jun 2016 13:28:31 GMT"}], "update_date": "2016-06-30", "authors_parsed": [["Chung", "Moo K.", ""], ["Vilalta-Gil", "Victoria", ""], ["Rathouz", "Paul J.", ""], ["Lahey", "Benjamin B.", ""], ["Zald", "David H.", ""]]}, {"id": "1509.05556", "submitter": "Hengtong Wang", "authors": "Hengtong Wang and Yong Chen", "title": "Firing dynamics of an autaptic neuron", "comments": null, "journal-ref": null, "doi": "10.1088/1674-1056/24/12/128709", "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autapses are synapses that connect a neuron to itself in the nervous system.\nPreviously, both experimental and theoretical studies have demonstrated that\nautaptic connections in the nervous system have a significant physiological\nfunction. Autapses in nature provide self-delayed feedback, thus introducing an\nadditional time scale to neuronal activities and causing many dynamic behaviors\nin neurons. Recently, theoretical studies have revealed that an autapse\nprovides a control option for adjusting the response of a neuron: e.g., an\nautaptic connection can cause the electrical activities of the Hindmarsh-Rose\nneuron to switch between quiescent, periodic, and chaotic firing patterns; an\nautapse can enhance or suppress the mode-locking status of a neuron injected\nwith sinusoidal current; and the firing frequency and interspike interval\ndistributions of the response spike train can also be modified by the autapse.\nIn this paper, we review recent studies that showed how an autapse affects the\nresponse of a single neuron.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 09:16:12 GMT"}], "update_date": "2016-01-11", "authors_parsed": [["Wang", "Hengtong", ""], ["Chen", "Yong", ""]]}, {"id": "1509.05646", "submitter": "Peter Kvam", "authors": "Peter Kvam, Joseph Cesario, Jory Schossau, Heather Eisthen, Arend\n  Hintze", "title": "Computational evolution of decision-making strategies", "comments": "Conference paper, 6 pages / 3 figures", "journal-ref": "Proceedings of the 37th Annual Meeting of the Cognitive Science\n  Society, 2015, pp. 1225-1230. Cognitive Science Society, Austin, TX", "doi": null, "report-no": null, "categories": "cs.NE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most research on adaptive decision-making takes a strategy-first approach,\nproposing a method of solving a problem and then examining whether it can be\nimplemented in the brain and in what environments it succeeds. We present a\nmethod for studying strategy development based on computational evolution that\ntakes the opposite approach, allowing strategies to develop in response to the\ndecision-making environment via Darwinian evolution. We apply this approach to\na dynamic decision-making problem where artificial agents make decisions about\nthe source of incoming information. In doing so, we show that the complexity of\nthe brains and strategies of evolved agents are a function of the environment\nin which they develop. More difficult environments lead to larger brains and\nmore information use, resulting in strategies resembling a sequential sampling\napproach. Less difficult environments drive evolution toward smaller brains and\nless information use, resulting in simpler heuristic-like strategies.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 15:02:39 GMT"}], "update_date": "2015-09-21", "authors_parsed": [["Kvam", "Peter", ""], ["Cesario", "Joseph", ""], ["Schossau", "Jory", ""], ["Eisthen", "Heather", ""], ["Hintze", "Arend", ""]]}, {"id": "1509.05703", "submitter": "Vince Grolmusz", "authors": "Csaba Kerepesi, Bal\\'azs Szalkai, B\\'alint Varga, Vince Grolmusz", "title": "How to Direct the Edges of the Connectomes: Dynamics of the Consensus\n  Connectomes and the Development of the Connections in the Human Brain", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0158680", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The human connectome is the object of an intensive research today. In these\ngraphs, the vertices correspond to the small areas of the gray matter, and two\nvertices are connected by an edge, if a diffusion-MRI based workflow finds\nconnections between those areas. One main question of the field is discovering\nthe directions of the edges. In a previous work we have reported the\nconstruction of the Budapest Reference Connectome Server\nhttp://connectome.pitgroup.org from the data recorded in the Human Connectome\nProject of the NIH. After the server had been published, we recognized a\nsurprising and unforeseen property of it: The server can generate the\nbraingraph of connections that are present in at least $k$ graphs out of the\n418, for any value of $k=1,2,...,418$. When the value of $k$ is changed from\n$k=418$ through 1 by moving a slider at the webserver from right to left, more\nand more edges appear in the consensus graph. The astonishing observation is\nthat the appearance of the new edges is not random: it is similar to a growing\ntree. We hypothesize that this movement of the slider in the webserver may copy\nthe development of the connections in the human brain in the following sense:\nthe connections that are present in all subjects are the oldest ones, and those\nthat are present in a decreasing fraction of subjects are gradually the newer\nconnections in the individual brain development. An animation on the phenomenon\nis available at https://youtu.be/EnWwIf_HNjw. Based on this hypothesis, we can\nassign directions to the edges of the connectome as follows: Let $G_i$ denote\nthe consensus connectome where each edge is present in at least $i$ graphs.\nSuppose that vertex $v$ is isolated in $G_{k+1}$, and becomes connected to a\nvertex $u$ in $G_k$, where $u$ was connected to other vertices already in\n$G_{k+1}$. Then we direct this $(v,u)$ edge from $v$ to $u$.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 17:03:36 GMT"}, {"version": "v2", "created": "Mon, 12 Oct 2015 15:13:50 GMT"}, {"version": "v3", "created": "Sun, 13 Mar 2016 11:30:57 GMT"}], "update_date": "2016-09-28", "authors_parsed": [["Kerepesi", "Csaba", ""], ["Szalkai", "Balázs", ""], ["Varga", "Bálint", ""], ["Grolmusz", "Vince", ""]]}, {"id": "1509.05753", "submitter": "Carlo Baldassi", "authors": "Carlo Baldassi, Alessandro Ingrosso, Carlo Lucibello, Luca Saglietti\n  and Riccardo Zecchina", "title": "Subdominant Dense Clusters Allow for Simple Learning and High\n  Computational Performance in Neural Networks with Discrete Synapses", "comments": "11 pages, 4 figures (main text: 5 pages, 3 figures; Supplemental\n  Material: 6 pages, 1 figure)", "journal-ref": "Physical Review Letters, 15, 128101 (2015)\n  url=http://journals.aps.org/prl/abstract/10.1103/PhysRevLett.115.128101", "doi": "10.1103/PhysRevLett.115.128101", "report-no": null, "categories": "cond-mat.dis-nn q-bio.NC stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We show that discrete synaptic weights can be efficiently used for learning\nin large scale neural systems, and lead to unanticipated computational\nperformance. We focus on the representative case of learning random patterns\nwith binary synapses in single layer networks. The standard statistical\nanalysis shows that this problem is exponentially dominated by isolated\nsolutions that are extremely hard to find algorithmically. Here, we introduce a\nnovel method that allows us to find analytical evidence for the existence of\nsubdominant and extremely dense regions of solutions. Numerical experiments\nconfirm these findings. We also show that the dense regions are surprisingly\naccessible by simple learning protocols, and that these synaptic configurations\nare robust to perturbations and generalize better than typical solutions. These\noutcomes extend to synapses with multiple states and to deeper neural\narchitectures. The large deviation measure also suggests how to design novel\nalgorithmic schemes for optimization based on local entropy maximization.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 19:12:55 GMT"}], "update_date": "2015-09-21", "authors_parsed": [["Baldassi", "Carlo", ""], ["Ingrosso", "Alessandro", ""], ["Lucibello", "Carlo", ""], ["Saglietti", "Luca", ""], ["Zecchina", "Riccardo", ""]]}, {"id": "1509.05802", "submitter": "Daniel Barth", "authors": "Krista M. Rodgers, F. Edward Dudek and Daniel S. Barth", "title": "Lack of appropriate controls leads to mistaking absence seizures for\n  post-traumatic epilepsy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we provide a thorough discussion of a rebuttal by D'Ambrosio et al to a\nstudy conducted by Rodgers et al. (Rodgers KM, Dudek FE, Barth DS (2015)\nProgressive, Seizure-Like, Spike- Wave Discharges Are Common in Both Injured\nand Uninjured Sprague-Dawley Rats: Implications for the Fluid Percussion Injury\nModel of Post-Traumatic Epilepsy. J Neurosci. 35(24):9194-204. doi:\n10.1523/JNEUROSCI.0919-15.2015.) to investigate focal seizures and acquired\nepileptogenesis induced by head injury in the rat. This manuscript serves as\nsupplementary document for our letter to the Editor to appear in the Journal of\nNeuroscience. We find the rebuttal is flawed on all points, particularly\nconcerning use of proper controls, experimental methods, analytical methods,\nand epilepsy diagnostic criteria, leading to mistaking absence seizures for\npost-traumatic epilepsy.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 21:35:38 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Rodgers", "Krista M.", ""], ["Dudek", "F. Edward", ""], ["Barth", "Daniel S.", ""]]}, {"id": "1509.05936", "submitter": "Yoshua Bengio", "authors": "Yoshua Bengio, Thomas Mesnard, Asja Fischer, Saizheng Zhang and Yuhuai\n  Wu", "title": "STDP as presynaptic activity times rate of change of postsynaptic\n  activity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.LG q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a weight update formula that is expressed only in terms of\nfiring rates and their derivatives and that results in changes consistent with\nthose associated with spike-timing dependent plasticity (STDP) rules and\nbiological observations, even though the explicit timing of spikes is not\nneeded. The new rule changes a synaptic weight in proportion to the product of\nthe presynaptic firing rate and the temporal rate of change of activity on the\npostsynaptic side. These quantities are interesting for studying theoretical\nexplanation for synaptic changes from a machine learning perspective. In\nparticular, if neural dynamics moved neural activity towards reducing some\nobjective function, then this STDP rule would correspond to stochastic gradient\ndescent on that objective function.\n", "versions": [{"version": "v1", "created": "Sat, 19 Sep 2015 21:05:18 GMT"}, {"version": "v2", "created": "Mon, 21 Mar 2016 10:54:18 GMT"}], "update_date": "2016-03-22", "authors_parsed": [["Bengio", "Yoshua", ""], ["Mesnard", "Thomas", ""], ["Fischer", "Asja", ""], ["Zhang", "Saizheng", ""], ["Wu", "Yuhuai", ""]]}, {"id": "1509.05986", "submitter": "R.K. Brojen Singh", "authors": "Soibam Shyamchand Singh, Khundrakpam Budhachandra Singh, Romana\n  Ishrat, B. Indrajit Sharma and R.K. Brojen Singh", "title": "Scaling in topological properties of brain networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The organization in brain networks shows highly modular features with weak\ninter-modular interaction. The topology of the networks involves emergence of\nmodules and sub-modules at different levels of constitution governed by fractal\nlaws. The modular organization, in terms of modular mass, inter-modular, and\nintra-modular interaction, also obeys fractal nature. The parameters which\ncharacterize topological properties of brain networks follow one parameter\nscaling theory in all levels of network structure which reveals the\nself-similar rules governing the network structure. The calculated fractal\ndimensions of brain networks of different species are found to decrease when\none goes from lower to higher level species which implicates the more ordered\nand self-organized topography at higher level species. The sparsely distributed\nhubs in brain networks may be most influencing nodes but their absence may not\ncause network breakdown, and centrality parameters characterizing them also\nfollow one parameter scaling law indicating self-similar roles of these hubs at\ndifferent levels of organization in brain networks.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2015 09:33:50 GMT"}], "update_date": "2015-09-22", "authors_parsed": [["Singh", "Soibam Shyamchand", ""], ["Singh", "Khundrakpam Budhachandra", ""], ["Ishrat", "Romana", ""], ["Sharma", "B. Indrajit", ""], ["Singh", "R. K. Brojen", ""]]}, {"id": "1509.06679", "submitter": "Liane Gabora", "authors": "Liane Gabora", "title": "Mental Wormholes and the Inner Workings of Creative Thought", "comments": "10 pages", "journal-ref": "In J. C. Penagos-Corzo & M. A. P. Vargas (Eds.), Challenges in\n  creativity & psychology for the XXI century (pp. 113-123). Mexico City:\n  Editorial UDLAP. (2019)", "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most creative outputs are readily classified as belonging to a particular\ndomain such as art, music, or technology. But does that mean the creative\nthinking that goes into creative projects respects these conventional domain\nboundaries? This question provides the departure point for this chapter. It is\nan important question because the answer has implications for how the creative\nprocess works, as well as for computational models of creativity, and thus it\nprovides the departure point for this chapter. Next we look at how the creator\nsifts out from its vast contents those items to incorporate into a creative\nproject, and converts these raw materials into a form that \"gels\" with the\nproject. We then explore the hypothesis that the creative mind forges \"mental\nwormholes\" that connect concepts and percepts, often from seemingly disparate\ndomains. Finally, we take a brief look at the strangely non-compositional\ninteractions that take place in these mental wormholes, and techniques being\nadvanced to model and understand these interactions.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2015 16:48:04 GMT"}, {"version": "v2", "created": "Mon, 15 Jul 2019 21:21:13 GMT"}], "update_date": "2019-07-17", "authors_parsed": [["Gabora", "Liane", ""]]}, {"id": "1509.07258", "submitter": "Tuomo M\\\"aki-Marttunen", "authors": "Tuomo M\\\"aki-Marttunen, Geir Halnes, Anna Devor, Aree Witoelar,\n  Francesco Bettella, Srdjan Djurovic, Yunpeng Wang, Gaute T. Einevoll, Ole A.\n  Andreassen, Anders M. Dale", "title": "Functional effects of schizophrenia-linked genetic variants on intrinsic\n  single-neuron excitability: A modeling study", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Recent genome-wide association studies (GWAS) have identified a\nlarge number of genetic risk factors for schizophrenia (SCZ) featuring ion\nchannels and calcium transporters. For some of these risk factors, independent\nprior investigations have examined the effects of genetic alterations on the\ncellular electrical excitability and calcium homeostasis. In the present\nproof-of-concept study, we harnessed these experimental results for modeling of\ncomputational properties on layer V cortical pyramidal cell and identify\npossible common alterations in behavior across SCZ-related genes.\n  Methods: We applied a biophysically detailed multi-compartmental model to\nstudy the excitability of a layer V pyramidal cell. We reviewed the literature\non functional genomics for variants of genes associated with SCZ, and used\nchanges in neuron model parameters to represent the effects of these variants.\n  Results: We present and apply a framework for examining the effects of subtle\nsingle nucleotide polymorphisms in ion channel and Ca2+ transporter-encoding\ngenes on neuron excitability. Our analysis indicates that most of the\nconsidered SCZ- related genetic variants affect the spiking behavior and\nintracellular calcium dynamics resulting from summation of inputs across the\ndendritic tree.\n  Conclusions: Our results suggest that alteration in the ability of a single\nneuron to integrate the inputs and scale its excitability may constitute a\nfundamental mechanistic contributor to mental disease, alongside with the\npreviously proposed deficits in synaptic communication and network behavior.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2015 07:12:16 GMT"}], "update_date": "2015-09-25", "authors_parsed": [["Mäki-Marttunen", "Tuomo", ""], ["Halnes", "Geir", ""], ["Devor", "Anna", ""], ["Witoelar", "Aree", ""], ["Bettella", "Francesco", ""], ["Djurovic", "Srdjan", ""], ["Wang", "Yunpeng", ""], ["Einevoll", "Gaute T.", ""], ["Andreassen", "Ole A.", ""], ["Dale", "Anders M.", ""]]}, {"id": "1509.07302", "submitter": "Bruno Umbria Pedroni", "authors": "Bruno U. Pedroni, Srinjoy Das, John V. Arthur, Paul A. Merolla, Bryan\n  L. Jackson, Dharmendra S. Modha, Kenneth Kreutz-Delgado, and Gert\n  Cauwenberghs", "title": "Mapping Generative Models onto a Network of Digital Spiking Neurons", "comments": "A similar version of this manuscript has been submitted to IEEE\n  TBioCAS for revision in October 2015", "journal-ref": null, "doi": "10.1109/TBCAS.2016.2539352", "report-no": null, "categories": "cs.NE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic neural networks such as Restricted Boltzmann Machines (RBMs) have\nbeen successfully used in applications ranging from speech recognition to image\nclassification. Inference and learning in these algorithms use a Markov Chain\nMonte Carlo procedure called Gibbs sampling, where a logistic function forms\nthe kernel of this sampler. On the other side of the spectrum, neuromorphic\nsystems have shown great promise for low-power and parallelized cognitive\ncomputing, but lack well-suited applications and automation procedures. In this\nwork, we propose a systematic method for bridging the RBM algorithm and digital\nneuromorphic systems, with a generative pattern completion task as proof of\nconcept. For this, we first propose a method of producing the Gibbs sampler\nusing bio-inspired digital noisy integrate-and-fire neurons. Next, we describe\nthe process of mapping generative RBMs trained offline onto the IBM TrueNorth\nneurosynaptic processor -- a low-power digital neuromorphic VLSI substrate.\nMapping these algorithms onto neuromorphic hardware presents unique challenges\nin network connectivity and weight and bias quantization, which, in turn,\nrequire architectural and design strategies for the physical realization.\nGenerative performance metrics are analyzed to validate the neuromorphic\nrequirements and to best select the neuron parameters for the model. Lastly, we\ndescribe a design automation procedure which achieves optimal resource usage,\naccounting for the novel hardware adaptations. This work represents the first\nimplementation of generative RBM inference on a neuromorphic VLSI substrate.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2015 10:25:03 GMT"}, {"version": "v2", "created": "Fri, 9 Oct 2015 21:06:02 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Pedroni", "Bruno U.", ""], ["Das", "Srinjoy", ""], ["Arthur", "John V.", ""], ["Merolla", "Paul A.", ""], ["Jackson", "Bryan L.", ""], ["Modha", "Dharmendra S.", ""], ["Kreutz-Delgado", "Kenneth", ""], ["Cauwenberghs", "Gert", ""]]}, {"id": "1509.07897", "submitter": "Evgenii D. Vol", "authors": "E. D. Vol", "title": "Quantum Look at two Common Logics: the Logic of Primitive Thinking and\n  the Logic of Everyday Human Reasoning", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.AI math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on ideas of quantum theory of open systems and psychological dual\nsystem theory we propose two novel versions of Non-Boolean logic. The first\nversion can be interpreted in our opinion as simplified description of\nprimitive (mythological) thinking and the second one as the toy model of\neveryday human reasoning in which aside from logical deduction, heuristic\nelements and beliefs also play the considerable role. Several arguments in\nfavor of the interpretations proposed are adduced and discussed in the paper as\nwell.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2015 06:02:26 GMT"}], "update_date": "2015-09-29", "authors_parsed": [["Vol", "E. D.", ""]]}, {"id": "1509.08056", "submitter": "Kun Zhang", "authors": "Kun Zhang, Biwei Huang, Jiji Zhang, Bernhard Sch\\\"olkopf, Clark\n  Glymour", "title": "Discovery and Visualization of Nonstationary Causal Models", "comments": "25 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI q-bio.NC stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is commonplace to encounter nonstationary data, of which the underlying\ngenerating process may change over time or across domains. The nonstationarity\npresents both challenges and opportunities for causal discovery. In this paper\nwe propose a principled framework to handle nonstationarity, and develop some\nmethods to address three important questions. First, we propose an enhanced\nconstraint-based method to detect variables whose local mechanisms are\nnonstationary and recover the skeleton of the causal structure over observed\nvariables. Second, we present a way to determine some causal directions by\ntaking advantage of information carried by changing distributions. Third, we\ndevelop a method for visualizing the nonstationarity of causal modules.\nExperimental results on various synthetic and real-world data sets are\npresented to demonstrate the efficacy of our methods.\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2015 06:22:01 GMT"}, {"version": "v2", "created": "Sun, 22 May 2016 17:54:26 GMT"}, {"version": "v3", "created": "Sat, 18 Jun 2016 09:36:50 GMT"}], "update_date": "2016-06-21", "authors_parsed": [["Zhang", "Kun", ""], ["Huang", "Biwei", ""], ["Zhang", "Jiji", ""], ["Schölkopf", "Bernhard", ""], ["Glymour", "Clark", ""]]}, {"id": "1509.08241", "submitter": "Joaquin Torres", "authors": "M. Uzuntarla, M. Ozer, U. Ileri, A. Calim and J.J. Torres", "title": "Effects of dynamic synapses on noise-delayed response latency of a\n  single neuron", "comments": "14 pages, 10 figures", "journal-ref": "Phys. Rev. E 92, 062710 (2015)", "doi": "10.1103/PhysRevE.92.062710", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Noise-delayed decay (NDD) phenomenon emerges when the first-spike latency of\na periodically forced stochastic neuron exhibits a maximum for a particular\nrange of noise intensity. Here, we investigate the latency response dynamics of\na single Hodgkin-Huxley neuron that is subject to both a suprathreshold\nperiodic stimulus and a background activity arriving through dynamic synapses.\nWe study the first spike latency response as a function of the presynaptic\nfiring rate f. This constitutes a more realistic scenario than previous works,\nsince f provides a suitable biophysically realistic parameter to control the\nlevel of activity in actual neural systems. We first report on the emergence of\nclassical NDD behavior as a function of f for the limit of static synapses.\nSecondly, we show that when short-term depression and facilitation mechanisms\nare included at synapses, different NDD features can be found due to the their\nmodulatory effect on synaptic current fluctuations. For example a new\nintriguing double NDD (DNDD) behavior occurs for different sets of relevant\nsynaptic parameters. Moreover, depending on the balance between synaptic\ndepression and synaptic facilitation, single NDD or DNDD can prevails, in such\na way that synaptic facilitation favors the emergence of DNDD whereas synaptic\ndepression favors the existence of single NDD. This is the first time it has\nbeen reported the existence of DNDD effect in response latency dynamics of a\nneuron.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2015 09:11:44 GMT"}], "update_date": "2015-12-23", "authors_parsed": [["Uzuntarla", "M.", ""], ["Ozer", "M.", ""], ["Ileri", "U.", ""], ["Calim", "A.", ""], ["Torres", "J. J.", ""]]}, {"id": "1509.08668", "submitter": "Astero Provata", "authors": "N.D. Tsigkri-DeSmedt, J. Hizanidis, P. Hoevel, A. Provata", "title": "Multi-chimera states in the Leaky Integrate-and-Fire model", "comments": "12 pages, 10 figures, YSC-2015 (4th International Young Scientists\n  Conference)", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO nlin.CD q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the dynamics of identical leaky integrate-and-fire neurons with\nsymmetric non-local coupling. Upon varying control parameters (coupling\nstrength, coupling range, refractory period) we investigate the system's\nbehaviour and highlight the formation of chimera states. We show that the\nintroduction of a refractory period enlarges the parameter region where chimera\nstates appear and affects the chimera multiplicity.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2015 09:53:13 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Tsigkri-DeSmedt", "N. D.", ""], ["Hizanidis", "J.", ""], ["Hoevel", "P.", ""], ["Provata", "A.", ""]]}, {"id": "1509.08954", "submitter": "Mauricio Girardi-Schappo", "authors": "Mauricio Girardi-Schappo, Germano S. Bortolotto, Jheniffer J.\n  Gonsalves, Leonel T. Pinto, Marcelo H. R. Tragtenberg", "title": "Griffiths phase and long-range correlations in a biologically motivated\n  V1 model", "comments": "14 pages, 5 figures, PACS: 05.70.Jk,45.70.Ht,87.19.lt", "journal-ref": "Scientific Reports 6, Article number: 29561 (2016)", "doi": "10.1038/srep29561", "report-no": null, "categories": "q-bio.NC cond-mat.dis-nn cond-mat.stat-mech nlin.AO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Activity in the brain propagates as waves of firing neurons, namely\navalanches. These waves' size and duration distributions have been\nexperimentally shown to display a stable power-law profile, long-range\ncorrelations and $1/f^{b}$ power spectrum \\textit{in vivo} and \\textit{in\nvitro}. We study an avalanching biologically motivated model of mammals visual\ncortex and find an extended critical-like region -- a Griffiths phase --\ncharacterized by divergent susceptibility and zero order parameter. This phase\nlies close to the expected experimental value of the \\textit{excitatory\npostsynaptic potential} in the cortex suggesting that critical behavior may be\nfound in the visual system. Avalanches are not perfectly power-law distributed,\nbut it is possible to collapse the distributions and define a cutoff avalanche\nsize that diverges as the network size is increased inside the critical region.\nThe avalanches present long-range correlations and $1/f^{b}$ power spectrum,\nmatching experiments. The phase transition is analytically determined by a\nmean-field approximation.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2015 19:10:53 GMT"}, {"version": "v2", "created": "Tue, 2 Feb 2016 12:54:53 GMT"}, {"version": "v3", "created": "Fri, 18 Nov 2016 18:56:06 GMT"}], "update_date": "2016-11-21", "authors_parsed": [["Girardi-Schappo", "Mauricio", ""], ["Bortolotto", "Germano S.", ""], ["Gonsalves", "Jheniffer J.", ""], ["Pinto", "Leonel T.", ""], ["Tragtenberg", "Marcelo H. R.", ""]]}]