[{"id": "1903.00372", "submitter": "Alfonso Represa", "authors": "Fanny Sandrine Martineau (AMU), Lauriane Fournier, Emmanuelle Buhler\n  (INMED), Fran\\c{c}oise Watrin (IBDM), Francesca Sargolini (LNC), Jean-Bernard\n  Manent, Bruno Poucet (LNC), Alfonso Represa (INMED)", "title": "Spared cognitive and behavioral functions prior to epilepsy onset in a\n  rat model of 2 subcortical band heteropia", "comments": null, "journal-ref": "Brain Research, Elsevier, 2019, 1711, pp.146-155", "doi": "10.1016/j.brainres.2019.01.030", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  13 Subcortical band heterotopia (SBH), also known as doublecortex syndrome,\nis a 14 malformation of cortical development resulting from mutations in the\ndoublecortin gene 15 (DCX). It is characterized by a lack of migration of\ncortical neurons that accumulate in the 16 white matter forming a heterotopic\nband. Patients with SBH may present mild to moderate 17 intellectual disability\nas well as epilepsy. The SBH condition can be modeled in rats by in 18 utero\nknockdown (KD) of Dcx. The affected cells form an SBH reminiscent of that\nobserved in 19 human patients and the animals develop a chronic epileptic\ncondition in adulthood. Here, 20 we investigated if the presence of an SBH is\nsufficient to induce cognitive impairment in 21\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2019 15:36:30 GMT"}], "update_date": "2019-03-04", "authors_parsed": [["Martineau", "Fanny Sandrine", "", "AMU"], ["Fournier", "Lauriane", "", "INMED"], ["Buhler", "Emmanuelle", "", "INMED"], ["Watrin", "Françoise", "", "IBDM"], ["Sargolini", "Francesca", "", "LNC"], ["Manent", "Jean-Bernard", "", "LNC"], ["Poucet", "Bruno", "", "LNC"], ["Represa", "Alfonso", "", "INMED"]]}, {"id": "1903.00385", "submitter": "Geza Odor", "authors": "G\\'eza \\'Odor and Jeffrey Kelling", "title": "Critical synchronization dynamics of the Kuramoto model on connectome\n  and small world graphs", "comments": "12 pages, 9 figures + Supplemenraty material pdf 2 pages 4 figs, 1\n  table, accepted version in Scientific Reports", "journal-ref": "Scientific Reports 9 (2019) 19621", "doi": "10.1038/s41598-019-54769-9", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech physics.bio-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The hypothesis, that cortical dynamics operates near criticality also\nsuggests, that it exhibits universal critical exponents which marks the\nKuramoto equation, a fundamental model for synchronization, as a prime\ncandidate for an underlying universal model. Here, we determined the\nsynchronization behavior of this model by solving it numerically on a large,\nweighted human connectome network, containing 804092 nodes, in an assumed\nhomeostatic state. Since this graph has a topological dimension $d < 4$, a real\nsynchronization phase transition is not possible in the thermodynamic limit,\nstill we could locate a transition between partially synchronized and\ndesynchronized states. At this crossover point we observe power-law--tailed\nsynchronization durations, with $\\tau_t \\simeq 1.2(1)$, away from experimental\nvalues for the brain. For comparison, on a large two-dimensional lattice,\nhaving additional random, long-range links, we obtain a mean-field value:\n$\\tau_t \\simeq 1.6(1)$. However, below the transition of the connectome we\nfound global coupling control-parameter dependent exponents $1 < \\tau_t \\le 2$,\noverlapping with the range of human brain experiments. We also studied the\neffects of random flipping of a small portion of link weights, mimicking a\nnetwork with inhibitory interactions, and found similar results. The\ncontrol-parameter dependent exponent suggests extended dynamical criticality\nbelow the transition point.\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2019 16:06:33 GMT"}, {"version": "v2", "created": "Tue, 12 Mar 2019 14:43:14 GMT"}, {"version": "v3", "created": "Sun, 17 Nov 2019 15:32:03 GMT"}], "update_date": "2019-12-24", "authors_parsed": [["Ódor", "Géza", ""], ["Kelling", "Jeffrey", ""]]}, {"id": "1903.00742", "submitter": "Joel Leibo", "authors": "Joel Z. Leibo, Edward Hughes, Marc Lanctot, Thore Graepel", "title": "Autocurricula and the Emergence of Innovation from Social Interaction: A\n  Manifesto for Multi-Agent Intelligence Research", "comments": "16 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.MA cs.NE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolution has produced a multi-scale mosaic of interacting adaptive units.\nInnovations arise when perturbations push parts of the system away from stable\nequilibria into new regimes where previously well-adapted solutions no longer\nwork. Here we explore the hypothesis that multi-agent systems sometimes display\nintrinsic dynamics arising from competition and cooperation that provide a\nnaturally emergent curriculum, which we term an autocurriculum. The solution of\none social task often begets new social tasks, continually generating novel\nchallenges, and thereby promoting innovation. Under certain conditions these\nchallenges may become increasingly complex over time, demanding that agents\naccumulate ever more innovations.\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2019 18:13:25 GMT"}, {"version": "v2", "created": "Mon, 11 Mar 2019 15:25:43 GMT"}], "update_date": "2019-03-12", "authors_parsed": [["Leibo", "Joel Z.", ""], ["Hughes", "Edward", ""], ["Lanctot", "Marc", ""], ["Graepel", "Thore", ""]]}, {"id": "1903.01301", "submitter": "Bingxin Zhao", "authors": "Bingxin Zhao and Hongtu Zhu", "title": "On genetic correlation estimation with summary statistics from\n  genome-wide association studies", "comments": "50 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-bio.GN q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genome-wide association studies (GWAS) have been widely used to examine the\nassociation between single nucleotide polymorphisms (SNPs) and complex traits,\nwhere both the sample size n and the number of SNPs p can be very large.\nRecently, cross-trait polygenic risk score (PRS) method has gained extremely\npopular for assessing genetic correlation of complex traits based on GWAS\nsummary statistics (e.g., SNP effect size). However, empirical evidence has\nshown a common bias phenomenon that even highly significant cross-trait PRS can\nonly account for a very small amount of genetic variance (R^2 often <1%). The\naim of this paper is to develop a novel and powerful method to address the bias\nphenomenon of cross-trait PRS. We theoretically show that the estimated genetic\ncorrelation is asymptotically biased towards zero when complex traits are\nhighly polygenic/omnigenic. When all p SNPs are used to construct PRS, we show\nthat the asymptotic bias of PRS estimator is independent of the unknown number\nof causal SNPs m. We propose a consistent PRS estimator to correct such\nasymptotic bias. We also develop a novel estimator of genetic correlation which\nis solely based on two sets of GWAS summary statistics. In addition, we\ninvestigate whether or not SNP screening by GWAS p-values can lead to improved\nestimation and show the effect of overlapping samples among GWAS. Our results\nmay help demystify and tackle the puzzling \"missing genetic overlap\" phenomenon\nof cross-trait PRS for dissecting the genetic similarity of closely related\nheritable traits. We illustrate the finite sample performance of our\nbias-corrected PRS estimator by using both numerical experiments and the UK\nBiobank data, in which we assess the genetic correlation between brain white\nmatter tracts and neuropsychiatric disorders.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2019 15:11:29 GMT"}], "update_date": "2019-03-05", "authors_parsed": [["Zhao", "Bingxin", ""], ["Zhu", "Hongtu", ""]]}, {"id": "1903.01458", "submitter": "Katherine Storrs", "authors": "Katherine R. Storrs and Nikolaus Kriegeskorte", "title": "Deep Learning for Cognitive Neuroscience", "comments": "Chapter to appear in The Cognitive Neurosciences, 6th Edition", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural network models can now recognise images, understand text, translate\nlanguages, and play many human games at human or superhuman levels. These\nsystems are highly abstracted, but are inspired by biological brains and use\nonly biologically plausible computations. In the coming years, neural networks\nare likely to become less reliant on learning from massive labelled datasets,\nand more robust and generalisable in their task performance. From their\nsuccesses and failures, we can learn about the computational requirements of\nthe different tasks at which brains excel. Deep learning also provides the\ntools for testing cognitive theories. In order to test a theory, we need to\nrealise the proposed information-processing system at scale, so as to be able\nto assess its feasibility and emergent behaviours. Deep learning allows us to\nscale up from principles and circuit models to end-to-end trainable models\ncapable of performing complex tasks. There are many levels at which cognitive\nneuroscientists can use deep learning in their work, from inspiring theories to\nserving as full computational models. Ongoing advances in deep learning bring\nus closer to understanding how cognition and perception may be implemented in\nthe brain -- the grand challenge at the core of cognitive neuroscience.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2019 14:34:52 GMT"}], "update_date": "2019-03-06", "authors_parsed": [["Storrs", "Katherine R.", ""], ["Kriegeskorte", "Nikolaus", ""]]}, {"id": "1903.01500", "submitter": "Wentao Huang", "authors": "Wentao Huang and Kechen Zhang", "title": "Approximations of Shannon Mutual Information for Discrete Variables with\n  Applications to Neural Population Coding", "comments": "31 pages, 6 figures", "journal-ref": "Entropy 2019, 21(3), 243", "doi": "10.3390/e21030243", "report-no": null, "categories": "cs.IT math.IT math.ST q-bio.NC stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although Shannon mutual information has been widely used, its effective\ncalculation is often difficult for many practical problems, including those in\nneural population coding. Asymptotic formulas based on Fisher information\nsometimes provide accurate approximations to the mutual information but this\napproach is restricted to continuous variables because the calculation of\nFisher information requires derivatives with respect to the encoded variables.\nIn this paper, we consider information-theoretic bounds and approximations of\nthe mutual information based on Kullback--Leibler divergence and R\\'{e}nyi\ndivergence. We propose several information metrics to approximate Shannon\nmutual information in the context of neural population coding. While our\nasymptotic formulas all work for discrete variables, one of them has consistent\nperformance and high accuracy regardless of whether the encoded variables are\ndiscrete or continuous. We performed numerical simulations and confirmed that\nour approximation formulas were highly accurate for approximating the mutual\ninformation between the stimuli and the responses of a large neural population.\nThese approximation formulas may potentially bring convenience to the\napplications of information theory to many practical and theoretical problems.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2019 19:33:03 GMT"}], "update_date": "2019-03-06", "authors_parsed": [["Huang", "Wentao", ""], ["Zhang", "Kechen", ""]]}, {"id": "1903.02147", "submitter": "Tamal Batabyal", "authors": "Tamal Batabyal, Barry Condron, Scott T. Acton", "title": "NeuroPath2Path: Classification and elastic morphing between neuronal\n  arbors using path-wise similarity", "comments": "Submitted to Neuroinformatics", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The shape and connectivity of a neuron determine its function. Modern imaging\nmethods have proven successful at extracting such information. However, in\norder to analyze this type of data, neuronal morphology needs to be encoded in\na graph-theoretic method. This encoding enables the use of high throughput\ninformatic methods to extract and infer brain function. The application of\ngraph-theoretic methods to neuronal morphological representation comes with\ncertain difficulties. Here we report a novel, effective method to accomplish\nthis task.\n  The morphology of a neuron, which consists of its overall size, global shape,\nlocal branch patterns, and cell-specific biophysical properties, can vary\nsignificantly with the cell's identity, location, as well as developmental and\nphysiological state. Various algorithms have been developed to customize shape\nbased statistical and graph related features for quantitative analysis of\nneuromorphology, followed by the classification of neuron cell types using the\nfeatures. Unlike the classical feature extraction based methods from imaged or\n3D reconstructed neurons, we propose a model based on the rooted path\ndecomposition from the soma to the dendrites of a neuron and extract\nmorphological features on each path. We hypothesize that measuring the distance\nbetween two neurons can be realized by minimizing the cost of continuously\nmorphing the set of all rooted paths of one neuron to another. To validate this\nclaim, we first establish the correspondence of paths between two neurons using\na modified Munkres algorithm. Next, an elastic deformation framework that\nemploys the square root velocity function is established to perform the\ncontinuous morphing, which, in addition, provides an effective visualization\ntool. We experimentally show the efficacy of NeuroPath2Path, NeuroP2P, over the\nstate of the art.\n", "versions": [{"version": "v1", "created": "Wed, 6 Mar 2019 02:52:59 GMT"}], "update_date": "2019-03-07", "authors_parsed": [["Batabyal", "Tamal", ""], ["Condron", "Barry", ""], ["Acton", "Scott T.", ""]]}, {"id": "1903.02440", "submitter": "Milad Mozafari", "authors": "Milad Mozafari, Mohammad Ganjtabesh, Abbas Nowzari-Dalini, Timoth\\'ee\n  Masquelier", "title": "SpykeTorch: Efficient Simulation of Convolutional Spiking Neural\n  Networks with at most one Spike per Neuron", "comments": null, "journal-ref": null, "doi": "10.3389/fnins.2019.00625", "report-no": null, "categories": "cs.NE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Application of deep convolutional spiking neural networks (SNNs) to\nartificial intelligence (AI) tasks has recently gained a lot of interest since\nSNNs are hardware-friendly and energy-efficient. Unlike the non-spiking\ncounterparts, most of the existing SNN simulation frameworks are not\npractically efficient enough for large-scale AI tasks. In this paper, we\nintroduce SpykeTorch, an open-source high-speed simulation framework based on\nPyTorch. This framework simulates convolutional SNNs with at most one spike per\nneuron and the rank-order encoding scheme. In terms of learning rules, both\nspike-timing-dependent plasticity (STDP) and reward-modulated STDP (R-STDP) are\nimplemented, but other rules could be implemented easily. Apart from the\naforementioned properties, SpykeTorch is highly generic and capable of\nreproducing the results of various studies. Computations in the proposed\nframework are tensor-based and totally done by PyTorch functions, which in turn\nbrings the ability of just-in-time optimization for running on CPUs, GPUs, or\nMulti-GPU platforms.\n", "versions": [{"version": "v1", "created": "Wed, 6 Mar 2019 15:15:53 GMT"}, {"version": "v2", "created": "Tue, 16 Jul 2019 15:50:20 GMT"}], "update_date": "2019-07-17", "authors_parsed": [["Mozafari", "Milad", ""], ["Ganjtabesh", "Mohammad", ""], ["Nowzari-Dalini", "Abbas", ""], ["Masquelier", "Timothée", ""]]}, {"id": "1903.02519", "submitter": "Roshan Gopalakrishnan", "authors": "Roshan Gopalakrishnan", "title": "RRAM based neuromorphic algorithms", "comments": "12 pages, 6 figures, A version of this survey report is submitting as\n  Springer book chapter", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.ET cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This submission is a report on RRAM based neuromorphic algorithms. This\nreport basically gives an overview of the algorithms implemented on\nneuromorphic hardware with crossbar array of RRAM synapses. This report mainly\ntalks about the work on deep neural network to spiking neural network\nconversion and its significance.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2019 14:27:19 GMT"}], "update_date": "2019-03-07", "authors_parsed": [["Gopalakrishnan", "Roshan", ""]]}, {"id": "1903.02580", "submitter": "Vijay Singh", "authors": "Vijay Singh, Martin Tchernookov, Vijay Balasubramanian", "title": "What the odor is not: Estimation by elimination", "comments": "7 pages; 4 Figures, SI", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The olfactory system uses responses of a small number of broadly sensitive\nreceptors to combinatorially encode a vast number of odors. Here, we propose a\nmethod for decoding such a distributed representation. Our main idea is that a\nreceptor that does not respond to an odor carries more information than a\nreceptor that does, because a typical receptor binds to many odorants. So a\nresponse below threshold signals absence of all such odorants. As a result, it\nis easier to identify what the odor is not, rather than what the odor is. We\ndemonstrate that, for biologically realistic numbers of receptors, response\nfunctions, and odor mixture complexity, this remarkably simple method of\nelimination turns an underdetermined decoding problem into an overdetermined\none, allowing accurate determination of odorants in a mixture and their\nconcentrations. We give a simple neural network realization of our algorithm\nresembling the circuit architecture in piriform cortex, and propose\nexperimental tests.\n", "versions": [{"version": "v1", "created": "Wed, 6 Mar 2019 19:02:07 GMT"}, {"version": "v2", "created": "Mon, 5 Aug 2019 22:57:19 GMT"}], "update_date": "2019-08-07", "authors_parsed": [["Singh", "Vijay", ""], ["Tchernookov", "Martin", ""], ["Balasubramanian", "Vijay", ""]]}, {"id": "1903.02594", "submitter": "Pavel Kraikivski", "authors": "Pavel Kraikivski", "title": "Systems of Oscillators Designed for a Specific Conscious Percept", "comments": "submitted to New Mathematics and Natural Computation journal on July\n  2017", "journal-ref": null, "doi": "10.1142/S1793005720500052", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As put forward by neuroscientists, the mechanisms of consciousness can be\nelucidated by revealing correlations between neural dynamics and specific\nconscious percepts. Recently, I have elaborated on the mathematical formulation\nfor a system of processes that are mutually connected to be isomorphic to a\nconscious percept of a point in space. Importantly, in such a system, any\nprocess can be derived through all other processes that form its complement, or\ninterpretation. To generate such a solution, I am proposing a dynamical system\nof oscillators coupled in a manner to preserve the properties of a percept.\nSpecifically, I crafted a dynamical system that retains the mutual\nrelationships among processes, forming an operational map isomorphic to a\ndistance matrix that mimics a percept of space-like properties. The study and\nresults pave a novel way to analyze the dynamics of neural-like (oscillatory)\nprocesses with a purpose of extracting the information relevant to specific\nconscious percepts, which will facilitate the search for neural correlates of\nconsciousness.\n", "versions": [{"version": "v1", "created": "Tue, 5 Mar 2019 15:34:55 GMT"}], "update_date": "2019-09-10", "authors_parsed": [["Kraikivski", "Pavel", ""]]}, {"id": "1903.02633", "submitter": "J.K. Chen", "authors": "Jiao-Kai Chen", "title": "A novel quantum theory of psychology", "comments": "11 pages. Part of the manuscript is rewritten and part of it is added", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC quant-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The behavior coordinate system and the ideal individual model are presented.\nThe behavior state of an ideal individual is assumed to be represented by a\nbehavior state function. Based on the ideal individual model, the behavior\ncoordinate system and the quantum probability, a novel quantum theory of\npsychology is offered here in a different way. It can give some enlightening\nviewpoints through which some phenomena can be discussed from a different\nperspective.\n", "versions": [{"version": "v1", "created": "Tue, 5 Mar 2019 15:49:52 GMT"}, {"version": "v2", "created": "Sun, 2 Jun 2019 03:50:40 GMT"}], "update_date": "2019-06-04", "authors_parsed": [["Chen", "Jiao-Kai", ""]]}, {"id": "1903.03232", "submitter": "Umar Asif", "authors": "Umar Asif, Subhrajit Roy, Jianbin Tang and Stefan Harrer", "title": "SeizureNet: Multi-Spectral Deep Feature Learning for Seizure Type\n  Classification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-bio.NC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automatic classification of epileptic seizure types in electroencephalograms\n(EEGs) data can enable more precise diagnosis and efficient management of the\ndisease. This task is challenging due to factors such as low signal-to-noise\nratios, signal artefacts, high variance in seizure semiology among epileptic\npatients, and limited availability of clinical data. To overcome these\nchallenges, in this paper, we present SeizureNet, a deep learning framework\nwhich learns multi-spectral feature embeddings using an ensemble architecture\nfor cross-patient seizure type classification. We used the recently released\nTUH EEG Seizure Corpus (V1.4.0 and V1.5.2) to evaluate the performance of\nSeizureNet. Experiments show that SeizureNet can reach a weighted F1 score of\nup to 0.94 for seizure-wise cross validation and 0.59 for patient-wise cross\nvalidation for scalp EEG based multi-class seizure type classification. We also\nshow that the high-level feature embeddings learnt by SeizureNet considerably\nimprove the accuracy of smaller networks through knowledge distillation for\napplications with low-memory constraints.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2019 00:49:31 GMT"}, {"version": "v2", "created": "Sat, 7 Sep 2019 03:17:25 GMT"}, {"version": "v3", "created": "Tue, 12 Nov 2019 07:48:25 GMT"}, {"version": "v4", "created": "Thu, 2 Apr 2020 06:32:59 GMT"}, {"version": "v5", "created": "Sun, 23 Aug 2020 05:08:41 GMT"}, {"version": "v6", "created": "Wed, 30 Sep 2020 03:09:00 GMT"}], "update_date": "2020-10-01", "authors_parsed": [["Asif", "Umar", ""], ["Roy", "Subhrajit", ""], ["Tang", "Jianbin", ""], ["Harrer", "Stefan", ""]]}, {"id": "1903.03418", "submitter": "Marcel Kvassay", "authors": "Marcel Kvassay", "title": "The meta-problem and the transfer of knowledge between theories of\n  consciousness: a software engineer's take", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This contribution examines two radically different explanations of our\nphenomenal intuitions, one reductive and one strongly non-reductive, and\nidentifies two germane ideas that could benefit many other theories of\nconsciousness. Firstly, the ability of sophisticated agent architectures with a\npurely physical implementation to support certain functional forms of qualia or\nproto-qualia appears to entail the possibility of machine consciousness with\nqualia, not only for reductive theories but also for the nonreductive ones that\nregard consciousness as ubiquitous in Nature. Secondly, analysis of\nintrospective psychological material seems to hint that, under the threshold of\nour ordinary waking awareness, there exist further 'submerged' or 'subliminal'\nlayers of consciousness which constitute a hidden foundation and support and\nanother source of our phenomenal intuitions. These 'submerged' layers might\nhelp explain certain puzzling phenomena concerning subliminal perception, such\nas the apparently 'unconscious' multisensory integration and learning of\nsubliminal stimuli.\n", "versions": [{"version": "v1", "created": "Mon, 18 Feb 2019 19:17:44 GMT"}], "update_date": "2019-03-11", "authors_parsed": [["Kvassay", "Marcel", ""]]}, {"id": "1903.03964", "submitter": "J.K. Chen", "authors": "Jiao-Kai Chen", "title": "Identical ideal individual hypothesis", "comments": "7 pages. Part of the manuscript is rewritten and part is added. arXiv\n  admin note: substantial text overlap with arXiv:1903.02633", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The identical ideal individual hypothesis is proposed. According to this\nhypothesis, the identical ideal individuals should be classified into two\nclasses: the bosonic individuals and the fermionic individuals. The bosonic\nindividuals can occupy the same behavior state while the fermionic individuals\ncan not be in the same behavior state. We propose that human beings and many\nspecies of animals are fermionic, which can not occupy the same behavior state\naccording to the Pauli exclusion principle. An unified theoretical explanation\nis given for the natures of two important and seemingly irrelated phenomena in\npsychology: the existence of the personal space and the behavior\ndifferentiation under high population density condition.\n", "versions": [{"version": "v1", "created": "Sun, 10 Mar 2019 10:06:53 GMT"}, {"version": "v2", "created": "Sun, 9 Jun 2019 12:30:38 GMT"}], "update_date": "2019-06-12", "authors_parsed": [["Chen", "Jiao-Kai", ""]]}, {"id": "1903.04201", "submitter": "Brian Mathias", "authors": "Brian Mathias, Leona Sureth, Gesa Hartwigsen, Manuela Macedonia, Katja\n  M. Mayer, and Katharina von Kriegstein", "title": "A causal role of sensory cortices in behavioral benefits of 'learning by\n  doing'", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite a rise in the use of \"learning by doing\" pedagogical methods in\npraxis, little is known as to how these methods improve learning outcomes. Here\nwe show that visual association cortex causally contributes to performance\nbenefits of a learning by doing method. This finding derives from transcranial\nmagnetic stimulation (TMS) and a gesture-enriched foreign language (L2)\nvocabulary learning paradigm performed by 22 young adults. Inhibitory TMS of\nvisual motion cortex reduced learning outcomes for abstract and concrete\ngesture-enriched words in comparison to sham stimulation. There were no TMS\neffects on words learned with pictures. These results adjudicate between\nopposing predictions of two neuroscientific learning theories: While\nreactivation-based theories predict no functional role of visual motion cortex\nin vocabulary learning outcomes, the current study supports the predictive\ncoding theory view that specialized sensory cortices precipitate\nsensorimotor-based learning benefits.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2019 10:28:42 GMT"}, {"version": "v2", "created": "Wed, 16 Oct 2019 00:45:27 GMT"}], "update_date": "2019-10-17", "authors_parsed": [["Mathias", "Brian", ""], ["Sureth", "Leona", ""], ["Hartwigsen", "Gesa", ""], ["Macedonia", "Manuela", ""], ["Mayer", "Katja M.", ""], ["von Kriegstein", "Katharina", ""]]}, {"id": "1903.04337", "submitter": "Daniel Wesierski", "authors": "Lukasz Czekaj, Wojciech Ziembla, Pawel Jezierski, Pawel Swiniarski,\n  Anna Kolodziejak, Pawel Ogniewski, Pawel Niedbalski, Anna Jezierska, Daniel\n  Wesierski", "title": "Labeler-hot Detection of EEG Epileptic Transients", "comments": "5 pages, 6 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NE q-bio.NC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Preventing early progression of epilepsy and so the severity of seizures\nrequires an effective diagnosis. Epileptic transients indicate the ability to\ndevelop seizures but humans overlook such brief events in an\nelectroencephalogram (EEG) what compromises patient treatment. Traditionally,\ntraining of the EEG event detection algorithms has relied on ground truth\nlabels, obtained from the consensus of the majority of labelers. In this work,\nwe go beyond labeler consensus on EEG data. Our event descriptor integrates EEG\nsignal features with one-hot encoded labeler category that is a key to improved\ngeneralization performance. Notably, boosted decision trees take advantage of\nsingly-labeled but more varied training sets. Our quantitative experiments show\nthe proposed labeler-hot epileptic event detector consistently outperforms a\nconsensus-trained detector and maintains confidence bounds of the detection.\nThe results on our infant EEG recordings suggest datasets can gain higher event\nvariety faster and thus better performance by shifting available human effort\nfrom consensus-oriented to separate labeling when labels include both, the\nevent and the labeler category.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2019 14:48:49 GMT"}, {"version": "v2", "created": "Tue, 2 Apr 2019 12:01:55 GMT"}, {"version": "v3", "created": "Tue, 9 Jul 2019 08:59:41 GMT"}], "update_date": "2019-07-10", "authors_parsed": [["Czekaj", "Lukasz", ""], ["Ziembla", "Wojciech", ""], ["Jezierski", "Pawel", ""], ["Swiniarski", "Pawel", ""], ["Kolodziejak", "Anna", ""], ["Ogniewski", "Pawel", ""], ["Niedbalski", "Pawel", ""], ["Jezierska", "Anna", ""], ["Wesierski", "Daniel", ""]]}, {"id": "1903.04377", "submitter": "Bahareh Pourbabaee", "authors": "Bahareh Pourbabaee, Matthew Howe-Patterson, Matthew Patterson,\n  Frederic Benard", "title": "SleepNet: Automated Sleep Analysis via Dense Convolutional Neural\n  Network Using Physiological Time Series", "comments": "20 pages, 4 figures, Accepted to be published by Physiological\n  Measurement Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NE q-bio.NC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, a dense recurrent convolutional neural network (DRCNN) was\nconstructed to detect sleep disorders including arousal, apnea and hypopnea\nusing Polysomnography (PSG) measurement channels provided in the 2018 Physionet\nchallenge database. Our model structure is composed of multiple dense\nconvolutional units (DCU) followed by a bidirectional long-short term memory\n(LSTM) layer followed by a softmax output layer. The sleep events including\nsleep stages, arousal regions and multiple types of apnea and hypopnea are\nmanually annotated by experts which enables us to train our proposed network\nusing a multi-task learning mechanism. Three binary cross-entropy loss\nfunctions corresponding to sleep/wake, target arousal and apnea-hypopnea/normal\ndetection tasks are summed up to generate our overall network loss function\nthat is optimized using the Adam method. Our model performance was evaluated\nusing two metrics: the area under the precision-recall curve (AUPRC) and the\narea under the receiver operating characteristic curve (AUROC). To measure our\nmodel generalization, 4-fold cross-validation was also performed. For training,\nour model was applied to full night recording data. Finally, the average AUPRC\nand AUROC values associated with the arousal detection task were 0.505 and\n0.922, respectively on our testing dataset. An ensemble of four models trained\non different data folds improved the AUPRC and AUROC to 0.543 and 0.931,\nrespectively. Our proposed algorithm achieved the first place in the official\nstage of the 2018 Physionet challenge for detecting sleep arousals with AUPRC\nof 0.54 on the blind testing dataset.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2019 15:41:55 GMT"}, {"version": "v2", "created": "Wed, 24 Jul 2019 16:17:16 GMT"}], "update_date": "2019-07-25", "authors_parsed": [["Pourbabaee", "Bahareh", ""], ["Howe-Patterson", "Matthew", ""], ["Patterson", "Matthew", ""], ["Benard", "Frederic", ""]]}, {"id": "1903.04476", "submitter": "Siavash Golkar", "authors": "Siavash Golkar, Michael Kagan, Kyunghyun Cho", "title": "Continual Learning via Neural Pruning", "comments": "12 pages, 5 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NE q-bio.NC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce Continual Learning via Neural Pruning (CLNP), a new method aimed\nat lifelong learning in fixed capacity models based on neuronal model\nsparsification. In this method, subsequent tasks are trained using the inactive\nneurons and filters of the sparsified network and cause zero deterioration to\nthe performance of previous tasks. In order to deal with the possible\ncompromise between model sparsity and performance, we formalize and incorporate\nthe concept of graceful forgetting: the idea that it is preferable to suffer a\nsmall amount of forgetting in a controlled manner if it helps regain network\ncapacity and prevents uncontrolled loss of performance during the training of\nfuture tasks. CLNP also provides simple continual learning diagnostic tools in\nterms of the number of free neurons left for the training of future tasks as\nwell as the number of neurons that are being reused. In particular, we see in\nexperiments that CLNP verifies and automatically takes advantage of the fact\nthat the features of earlier layers are more transferable. We show empirically\nthat CLNP leads to significantly improved results over current weight\nelasticity based methods.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2019 17:53:34 GMT"}], "update_date": "2019-03-12", "authors_parsed": [["Golkar", "Siavash", ""], ["Kagan", "Michael", ""], ["Cho", "Kyunghyun", ""]]}, {"id": "1903.04576", "submitter": "Joaquin Torres", "authors": "Javier A. Galad\\'i and Joaqu\\'in J. Torres and J. Marro", "title": "Emergence of Brain Rhythms: Model Interpretation of EEG Data", "comments": "24 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electroencephalography (EEG) monitors ---by either intrusive or noninvasive\nelectrodes--- time and frequency variations and spectral content of voltage\nfluctuations or waves, known as brain rhythms, which in some way uncover\nactivity during both rest periods and specific events in which the subject is\nunder stimulus. This is a useful tool to explore brain behavior, as it\ncomplements imaging techniques that have a poorer temporal resolution. We here\napproach the understanding of EEG data from first principles by studying a\nnetworked model of excitatory and inhibitory neurons which generates a variety\nof comparable waves. In fact, we thus reproduce $\\alpha$, $\\beta,$ $\\gamma$ and\nother rhythms as observed by EEG, and identify the details of the respectively\ninvolved complex phenomena, including a precise relationship between an input\nand the collective response to it. It ensues the potentiality of our model to\nbetter understand actual mind mechanisms and its possible disorders, and we\nalso describe kind of stochastic resonance phenomena which locate main\nqualitative changes of mental behavior in (e.g.) humans. We also discuss the\nplausible use of these findings to design deep learning algorithms to detect\nthe occurence of phase transitions in the brain and to analyse its\nconsequences.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2019 20:13:42 GMT"}], "update_date": "2019-03-13", "authors_parsed": [["Galadí", "Javier A.", ""], ["Torres", "Joaquín J.", ""], ["Marro", "J.", ""]]}, {"id": "1903.05129", "submitter": "Jens Wilting", "authors": "J. Wilting and V. Priesemann", "title": "25 years of criticality in neuroscience -- established results, open\n  controversies, novel concepts", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Twenty-five years ago, Dunkelmann and Radons (1994) proposed that neural\nnetworks should self-organize to a critical state. In models, criticality\noffers a number of computational advantages. Thus this hypothesis, and in\nparticular the experimental work by Beggs and Plenz (2003), has triggered an\navalanche of research, with thousands of studies referring to it. Nonetheless,\nexperimental results are still contradictory. How is it possible, that a\nhypothesis has attracted active research for decades, but nonetheless remains\ncontroversial? We discuss the experimental and conceptual controversy, and then\npresent a parsimonious solution that (i) unifies the contradictory experimental\nresults, (ii) avoids disadvantages of a critical state, and (iii) enables\nrapid, adaptive tuning of network properties to task requirements.\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2019 18:24:27 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Wilting", "J.", ""], ["Priesemann", "V.", ""]]}, {"id": "1903.05288", "submitter": "Sang-Yoon  Kim", "authors": "Sang-Yoon Kim and Woochang Lim", "title": "Effect of Interpopulation Spike-Timing-Dependent Plasticity on\n  Synchronized Rhythms in Neuronal Networks with Inhibitory and Excitatory\n  Populations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider clustered small-world networks with both inhibitory (I) and\nexcitatory (E) populations. This I-E neuronal network has adaptive dynamic I to\nE and E to I interpopulation synaptic strengths, governed by interpopulation\nspike-timing-dependent plasticity (STDP). In previous works without STDPs, fast\nsparsely synchronized rhythms, related to diverse cognitive functions, were\nfound to appear in a range of noise intensity $D$ for static synaptic\nstrengths. By varying $D$, we investigate the effect of interpopulation STDPs\non diverse population and individual properties of fast sparsely synchronized\nrhythms that emerge in both the I- and the E-populations. Depending on values\nof $D$, long-term potentiation (LTP) and long-term depression (LTD) for\npopulation-averaged values of saturated interpopulation synaptic strengths are\nfound to occur, and they make effects on the degree of fast sparse\nsynchronization. In a broad region of intermediate $D$, the degree of good\nsynchronization (with higher spiking measure) becomes decreased, while in a\nregion of large $D$, the degree of bad synchronization (with lower spiking\nmeasure) gets increased. Consequently, in each I- or E-population, the\nsynchronization degree becomes nearly the same in a wide range of $D$. This\nkind of \"equalization effect\" is found to occur via cooperative interplay\nbetween the average occupation and pacing degrees of fast sparsely synchronized\nrhythms. We note that the equalization effect in interpopulation synaptic\nplasticity is distinctly in contrast to the Matthew (bipolarization) effect in\nintrapopulation (I to I and E to E) synaptic plasticity where good (bad)\nsynchronization gets better (worse). Finally, emergences of LTP and LTD of\ninterpopulation synaptic strengths are intensively investigated via a\nmicroscopic method based on the distributions of time delays between the pre-\nand the post-synaptic spike times.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2019 01:55:15 GMT"}, {"version": "v2", "created": "Tue, 13 Aug 2019 01:02:38 GMT"}, {"version": "v3", "created": "Mon, 10 Feb 2020 08:26:23 GMT"}, {"version": "v4", "created": "Tue, 11 Feb 2020 05:43:03 GMT"}], "update_date": "2020-02-12", "authors_parsed": [["Kim", "Sang-Yoon", ""], ["Lim", "Woochang", ""]]}, {"id": "1903.05590", "submitter": "Jennifer Creaser", "authors": "Jennifer Creaser, Peter Ashwin, Claire Postlethwaite, and Juliane\n  Britz", "title": "Noisy network attractor models for transitions between EEG microstates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The brain is intrinsically organized into large-scale networks that\nconstantly re-organize on multiple timescales, even when the brain is at rest.\nThe timing of these dynamics is crucial for sensation, perception, cognition\nand ultimately consciousness, but the underlying dynamics governing the\nconstant reorganization and switching between networks are not yet well\nunderstood. Functional magnetic resonance imaging (fMRI) and\nelectroencephalography (EEG) provide anatomical and temporal information about\nthe resting-state networks (RSNs), respectively. EEG microstates are brief\nperiods of stable scalp topography, and four distinct configurations with\ncharacteristic switching patterns between them are reliably identified at rest.\nMicrostates have been identified as the electrophysiological correlate of\nfMRI-defined RSNs, this link could be established because EEG microstate\nsequences are scale-free and have long-range temporal correlations. This\nproperty is crucial for any approach to model EEG microstates. This paper\nproposes a novel modeling approach for microstates: we consider nonlinear\nstochastic differential equations (SDEs) that exhibit a noisy network attractor\nbetween nodes that represent the microstates. Using a single layer network\nbetween four states, we can reproduce the transition probabilities between\nmicrostates but not the heavy tailed residence time distributions. Introducing\na two layer network with a hidden layer gives the flexibility to capture these\nheavy tails and their long-range temporal correlations. We fit these models to\ncapture the statistical properties of microstate sequences from EEG data\nrecorded inside and outside the MRI scanner and show that the processing\nrequired to separate the EEG signal from the fMRI machine noise results in a\nloss of information which is reflected in differences in the long tail of the\ndwell-time distributions.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2019 16:40:59 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Creaser", "Jennifer", ""], ["Ashwin", "Peter", ""], ["Postlethwaite", "Claire", ""], ["Britz", "Juliane", ""]]}, {"id": "1903.05610", "submitter": "Paul Smolen", "authors": "Paul Smolen, Douglas A. Baxter, John H. Byrne", "title": "How Can Memories Last for Days, Years, or a Lifetime? Proposed\n  Mechanisms for Maintaining Synaptic Potentiation and Memory", "comments": null, "journal-ref": "Learn. Mem. (2019) 26: 133-150", "doi": "10.1101/lm.049395.119", "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  With memory encoding reliant on persistent changes in the properties of\nsynapses, a key question is how can memories be maintained from days to months\nor a lifetime given molecular turnover? It is likely that positive feedback\nloops are necessary to persistently maintain the strength of synapses that\nparticipate in encoding. Such feedback may occur within signal-transduction\ncascades and/or the regulation of translation, and it may occur within specific\nsubcellular compartments or within neuronal networks. Not surprisingly,\nnumerous positive feedback loops have been proposed. Some posited loops operate\nat the level of biochemical signal transduction cascades, such as persistent\nactivation of calcium/calmodulin kinase II or protein kinase M. Another level\nconsists of feedback loops involving transcriptional, epigenetic and\ntranslational pathways, and autocrine actions of growth factors such as BDNF.\nFinally, at the neuronal network level, recurrent reactivation of cell\nassemblies encoding memories is likely to be essential for late maintenance of\nmemory. These levels are not isolated, but linked by shared components of\nfeedback loops. Here, we review characteristics of some commonly discussed\nfeedback loops proposed to underlie the maintenance of memory and long-term\nsynaptic plasticity, assess evidence for and against their necessity, and\nsuggest experiments that could further delineate the dynamics of these feedback\nloops. We also discuss crosstalk between proposed loops, and ways in which such\ninteraction can facilitate the rapidity and robustness of memory formation and\nstorage.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2019 17:16:52 GMT"}, {"version": "v2", "created": "Fri, 5 Apr 2019 17:02:01 GMT"}, {"version": "v3", "created": "Tue, 16 Apr 2019 21:58:51 GMT"}], "update_date": "2019-04-18", "authors_parsed": [["Smolen", "Paul", ""], ["Baxter", "Douglas A.", ""], ["Byrne", "John H.", ""]]}, {"id": "1903.05946", "submitter": "Tim C Kietzmann", "authors": "Tim C Kietzmann, Courtney J Spoerer, Lynn S\\\"orensen, Radoslaw M\n  Cichy, Olaf Hauk, and Nikolaus Kriegeskorte", "title": "Recurrence is required to capture the representational dynamics of the\n  human visual system", "comments": "https://www.pnas.org/content/early/2019/10/04/1905544116.short?rss=1", "journal-ref": "Proceedings of the National Academy of Sciences, p. 1-10 (2019)", "doi": "10.1073/pnas.1905544116", "report-no": null, "categories": "q-bio.NC cs.CV cs.LG", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The human visual system is an intricate network of brain regions that enables\nus to recognize the world around us. Despite its abundant lateral and feedback\nconnections, object processing is commonly viewed and studied as a feedforward\nprocess. Here, we measure and model the rapid representational dynamics across\nmultiple stages of the human ventral stream using time-resolved brain imaging\nand deep learning. We observe substantial representational transformations\nduring the first 300 ms of processing within and across ventral-stream regions.\nCategorical divisions emerge in sequence, cascading forward and in reverse\nacross regions, and Granger causality analysis suggests bidirectional\ninformation flow between regions. Finally, recurrent deep neural network models\nclearly outperform parameter-matched feedforward models in terms of their\nability to capture the multi-region cortical dynamics. Targeted virtual cooling\nexperiments on the recurrent deep network models further substantiate the\nimportance of their lateral and top-down connections. These results establish\nthat recurrent models are required to understand information processing in the\nhuman ventral stream.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2019 12:43:38 GMT"}, {"version": "v2", "created": "Tue, 8 Oct 2019 08:45:53 GMT"}], "update_date": "2019-10-09", "authors_parsed": [["Kietzmann", "Tim C", ""], ["Spoerer", "Courtney J", ""], ["Sörensen", "Lynn", ""], ["Cichy", "Radoslaw M", ""], ["Hauk", "Olaf", ""], ["Kriegeskorte", "Nikolaus", ""]]}, {"id": "1903.05979", "submitter": "Vince Grolmusz", "authors": "Mate Fellner and Balint Varga and Vince Grolmusz", "title": "The Frequent Complete Subgraphs in the Human Connectome", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0236883", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While it is still not possible to describe the neural-level connections of\nthe human brain, we can map the human connectome with several hundred vertices,\nby the application of diffusion-MRI based techniques. In these graphs, the\nnodes correspond to anatomically identified gray matter areas of the brain,\nwhile the edges correspond to the axonal fibers, connecting these areas. In our\nprevious contributions, we have described numerous graph-theoretical phenomena\nof the human connectomes. Here we map the frequent complete subgraphs of the\nhuman brain networks: in these subgraphs, every pair of vertices is connected\nby an edge. We also examine sex differences in the results. The mapping of the\nfrequent subgraphs gives robust substructures in the graph: if a subgraph is\npresent in the 80% of the graphs, then, most probably, it could not be an\nartifact of the measurement or the data processing workflow. We list here the\nfrequent complete subgraphs of the human braingraphs of 414 subjects, each with\n463 nodes, with a frequency threshold of 80%, and identify 812 complete\nsubgraphs, which are more frequent in male and 224 complete subgraphs, which\nare more frequent in female connectomes.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2019 13:26:38 GMT"}, {"version": "v2", "created": "Wed, 27 Mar 2019 18:31:13 GMT"}], "update_date": "2020-09-09", "authors_parsed": [["Fellner", "Mate", ""], ["Varga", "Balint", ""], ["Grolmusz", "Vince", ""]]}, {"id": "1903.07027", "submitter": "James Gornet", "authors": "James Gornet, Kannan Umadevi Venkataraju, Arun Narasimhan, Nicholas\n  Turner, Kisuk Lee, H. Sebastian Seung, Pavel Osten, Uygar S\\\"umb\\\"ul", "title": "Reconstructing neuronal anatomy from whole-brain images", "comments": "2019 IEEE 16th International Symposium on Biomedical Imaging (ISBI\n  2019)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.LG q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reconstructing multiple molecularly defined neurons from individual brains\nand across multiple brain regions can reveal organizational principles of the\nnervous system. However, high resolution imaging of the whole brain is a\ntechnically challenging and slow process. Recently, oblique light sheet\nmicroscopy has emerged as a rapid imaging method that can provide whole brain\nfluorescence microscopy at a voxel size of 0.4 by 0.4 by 2.5 cubic microns. On\nthe other hand, complex image artifacts due to whole-brain coverage produce\napparent discontinuities in neuronal arbors. Here, we present\nconnectivity-preserving methods and data augmentation strategies for supervised\nlearning of neuroanatomy from light microscopy using neural networks. We\nquantify the merit of our approach by implementing an end-to-end automated\ntracing pipeline. Lastly, we demonstrate a scalable, distributed implementation\nthat can reconstruct the large datasets that sub-micron whole-brain images\nproduce.\n", "versions": [{"version": "v1", "created": "Sun, 17 Mar 2019 05:06:29 GMT"}], "update_date": "2019-03-19", "authors_parsed": [["Gornet", "James", ""], ["Venkataraju", "Kannan Umadevi", ""], ["Narasimhan", "Arun", ""], ["Turner", "Nicholas", ""], ["Lee", "Kisuk", ""], ["Seung", "H. Sebastian", ""], ["Osten", "Pavel", ""], ["Sümbül", "Uygar", ""]]}, {"id": "1903.07394", "submitter": "Keith Willison", "authors": "Keith R Willison", "title": "An intracellular calcium frequency code model extended to the Riemann\n  zeta function", "comments": "11 pages, 5 figures,1 table, 1 appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have used the Nernst chemical potential treatment to couple the time\ndomains of sodium and calcium ion channel opening and closing rates to the\nspatial domain of the diffusing waves of the travelling calcium ions inside\nsingle cells. The model is plausibly evolvable with respect to the origins of\nthe molecular components and the scaling of the system from simple cells to\nneurons. The mixed chemical potentials are calculated by summing the\nconcentrations or particle numbers of the two constituent ions which are pure\nnumbers and thus dimensionless. Chemical potentials are true thermodynamic free\nGibbs/Fermi energies and the forces acting on chemical flows are calculated\nfrom the natural logarithms of the particle numbers or their concentrations.\nThe mixed chemical potential is converted to the time domain of an action\npotential by assuming that the injection of calcium ions accelerates\ndepolarization in direct proportion to the amplitude of the total charge\ncontribution of the calcium pulse. We assert that the natural logarithm of the\nreal component of the imaginary term of any Riemann zeta zero corresponds to an\ninstantaneous calcium potential. In principle, in a physiologically plausible\nfashion, the first few thousand Riemann zeta-zeros can be encoded on this\nchemical scale manifested as regulated step-changes in the amplitudes of\nnaturally occurring calcium current transients. We show that pairs of Zn\nchannels can form Dirac fences which encode the logarithmic spacings and summed\namplitudes of any pair of Riemann zeros. Remarkably the beat frequencies of the\npairings of the early frequency terms overlap the naturally occurring frequency\nmodes in vertebrate brains. The equation for the time domain in the biological\nmodel has a similar form to the Riemann zeta function on the half-plane and\nmimics analytical continuation on the complex plane.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2019 12:04:20 GMT"}], "update_date": "2019-03-19", "authors_parsed": [["Willison", "Keith R", ""]]}, {"id": "1903.07526", "submitter": "Miguel Ib\\'a\\~nez Berganza", "authors": "Miguel Ib\\'a\\~nez-Berganza, Ambra Amico, Vittorio Loreto", "title": "Subjectivity and complexity of facial attractiveness", "comments": "15 pages, 5 figures. Supplementary information: 26 pages, 13 figures", "journal-ref": "Scientific Reports 9, Article number: 8364 (2019)", "doi": "10.1038/s41598-019-44655-9", "report-no": null, "categories": "q-bio.NC cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The origin and meaning of facial beauty represent a longstanding puzzle.\nDespite the profuse literature devoted to facial attractiveness, its very\nnature, its determinants and the nature of inter-person differences remain\ncontroversial issues. Here we tackle such questions proposing a novel\nexperimental approach in which human subjects, instead of rating natural faces,\nare allowed to efficiently explore the face-space and 'sculpt' their favorite\nvariation of a reference facial image. The results reveal that different\nsubjects prefer distinguishable regions of the face-space, highlighting the\nessential subjectivity of the phenomenon.The different sculpted facial vectors\nexhibit strong correlations among pairs of facial distances, characterising the\nunderlying universality and complexity of the cognitive processes, and the\nrelative relevance and robustness of the different facial distances.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2019 16:08:16 GMT"}, {"version": "v2", "created": "Tue, 11 Jun 2019 12:42:42 GMT"}], "update_date": "2019-06-12", "authors_parsed": [["Ibáñez-Berganza", "Miguel", ""], ["Amico", "Ambra", ""], ["Loreto", "Vittorio", ""]]}, {"id": "1903.07762", "submitter": "Edward D Lee", "authors": "Edward D. Lee, Bryan C. Daniels, Christopher R. Myers, David C.\n  Krakauer, Jessica C. Flack", "title": "Emergent regularities and scaling in armed conflict data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech nlin.AO q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Armed conflict exhibits regularities beyond known power law distributions of\nfatalities and duration over varying culture and geography. We systematically\ncluster conflict reports from a database of $10^5$ events from Africa spanning\n20 years into conflict avalanches. Conflict profiles collapse over a range of\nscales. Duration, diameter, extent, fatalities, and report totals satisfy\nmutually consistent scaling relations captured with a model combining\ngeographic spread and local conflict-site growth. The emergence of such social\nscaling laws hints at principles guiding conflict evolution.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2019 23:20:37 GMT"}, {"version": "v2", "created": "Sat, 30 Mar 2019 02:20:39 GMT"}, {"version": "v3", "created": "Thu, 10 Oct 2019 14:22:56 GMT"}, {"version": "v4", "created": "Thu, 30 Apr 2020 03:25:23 GMT"}], "update_date": "2020-05-01", "authors_parsed": [["Lee", "Edward D.", ""], ["Daniels", "Bryan C.", ""], ["Myers", "Christopher R.", ""], ["Krakauer", "David C.", ""], ["Flack", "Jessica C.", ""]]}, {"id": "1903.07783", "submitter": "Kai Qiao", "authors": "Kai Qiao, Jian Chen, Linyuan Wang, Chi Zhang, Lei Zeng, Li Tong, Bin\n  Yan", "title": "Category decoding of visual stimuli from human brain activity using a\n  bidirectional recurrent neural network to simulate bidirectional information\n  flows in human visual cortices", "comments": "submitted to the Frontiers in neuroscience", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, visual encoding and decoding based on functional magnetic resonance\nimaging (fMRI) have realized many achievements with the rapid development of\ndeep network computation. Despite the hierarchically similar representations of\ndeep network and human vision, visual information flows from primary visual\ncortices to high visual cortices and vice versa based on the bottom-up and\ntop-down manners, respectively. Inspired by the bidirectional information\nflows, we proposed a bidirectional recurrent neural network (BRNN)-based method\nto decode the categories from fMRI data. The forward and backward directions in\nthe BRNN module characterized the bottom-up and top-down manners, respectively.\nThe proposed method regarded the selected voxels of each visual cortex region\n(V1, V2, V3, V4, and LO) as one node in the sequence fed into the BRNN module\nand combined the output of the BRNN module to decode the categories with the\nsubsequent fully connected layer. This new method allows the efficient\nutilization of hierarchical information representations and bidirectional\ninformation flows in human visual cortices. Experiment results demonstrated\nthat our method improved the accuracy of three-level category decoding than\nother methods, which implicitly validated the hierarchical and bidirectional\nhuman visual representations. Comparative analysis revealed that the category\nrepresentations of human visual cortices were hierarchical, distributed,\ncomplementary, and correlative.\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2019 01:08:13 GMT"}], "update_date": "2019-03-20", "authors_parsed": [["Qiao", "Kai", ""], ["Chen", "Jian", ""], ["Wang", "Linyuan", ""], ["Zhang", "Chi", ""], ["Zeng", "Lei", ""], ["Tong", "Li", ""], ["Yan", "Bin", ""]]}, {"id": "1903.07885", "submitter": "Jannes Jegminat", "authors": "Jannes Jegminat, Maya Jastrzebowska, Matt Pachai, Michael Herzog,\n  Jean-Pascal Pfister", "title": "Bayesian regression explains how human participants handle parameter\n  uncertainty", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1007886", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The human brain copes with sensory uncertainty in accordance with Bayes'\nrule. However, it is unknown how the brain makes predictions in the presence of\nparameter uncertainty. Here, we tested whether and how humans take parameter\nuncertainty into account in a regression task. Participants extrapolated a\nparabola from a limited number of noisy points, shown on a computer screen. The\nquadratic parameter was drawn from a prior distribution, unknown to the\nobservers. We tested whether human observers take full advantage of the given\ninformation, including the likelihood function of the observed points and the\nprior distribution of the quadratic parameter. We compared human performance\nwith Bayesian regression, which is the (Bayes) optimal solution to this\nproblem, and three sub-optimal models, namely maximum likelihood regression,\nprior regression and maximum a posteriori regression, which are simpler to\ncompute. Our results clearly show that humans use Bayesian regression. We\nfurther investigated several variants of Bayesian regression models depending\non how the generative noise is treated and found that participants act in line\nwith the more sophisticated version.\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2019 09:01:46 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Jegminat", "Jannes", ""], ["Jastrzebowska", "Maya", ""], ["Pachai", "Matt", ""], ["Herzog", "Michael", ""], ["Pfister", "Jean-Pascal", ""]]}, {"id": "1903.08133", "submitter": "Noam Shemesh", "authors": "Daniel Nunes, Andrada Ianus, Noam Shemesh", "title": "Layer-specific connectivity revealed by diffusion-weighted functional\n  MRI in the rat thalamocortical pathway", "comments": null, "journal-ref": "Neuroimage. 2019 Jan 1;184:646-657", "doi": "10.1016/j.neuroimage.2018.09.050", "report-no": null, "categories": "physics.med-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Investigating neural activity from a global brain perspective in-vivo has\nbeen in the domain of functional Magnetic Resonance Imaging (fMRI) over the\npast few decades. The intricate neurovascular couplings that govern fMRI's\nblood-oxygenation-level-dependent (BOLD) functional contrast are invaluable in\nmapping active brain regions, but they also entail significant limitations,\nsuch as non-specificity of the signal to active foci. Diffusion-weighted\nfunctional MRI (dfMRI) with relatively high diffusion-weighting strives to\nameliorate this shortcoming as it offers functional contrasts more intimately\nlinked with the underlying activity. Insofar, apart from somewhat smaller\nactivation foci, dfMRI's contrasts have not been convincingly shown to offer\nsignificant advantages over BOLD, and its contrasts relied on significant\nmodelling. Here, we study whether dfMRI could offer a better representation of\nneural activity in the thalamocortical pathway compared to its (spin-echo (SE))\nBOLD counterpart. Using high-end forepaw stimulation experiments in the rat at\n9.4 T, and with significant sensitivity enhancements due to the use of\ncryocoils, we show for the first time that dfMRI signals exhibit layer\nspecificity, and, additionally, display signals in areas devoid of SE-BOLD\nresponses. We find that dfMRI signals in the thalamocortical pathway cohere\nwith each other, namely, dfMRI signals in the ventral posterolateral (VPL)\nthalamic nucleus cohere specifically with layers IV and V in the somatosensory\ncortex. These activity patterns are much better correlated (compared with\nSE-BOLD signals) with literature-based electrophysiological recordings in the\ncortex as well as thalamus. All these findings suggest that dfMRI signals\nbetter represent the underlying neural activity in the pathway. In turn, this\nmay entail significant implications towards a much more specific and accurate\n(...)\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2019 17:43:15 GMT"}], "update_date": "2019-03-20", "authors_parsed": [["Nunes", "Daniel", ""], ["Ianus", "Andrada", ""], ["Shemesh", "Noam", ""]]}, {"id": "1903.08440", "submitter": "Mattia Bramini", "authors": "Mattia Bramini, Giulio Alberini, Elisabetta Colombo, Martina\n  Chiacchiaretta, Mattia Lorenzo DiFrancesco, Jos\\'e Fernando Maya-Vetencourt,\n  Luca Maragliano, Fabio Benfenati and Fabrizia Cesca", "title": "Interfacing Graphene-Based Materials With Neural Cells", "comments": "Invited Review paper, 42 pages, 6 figures. This document is the\n  unedited Author's version of a Submitted Work that was subsequently accepted\n  for publication in Frontiers in Systems Neuroscience. To access the final\n  edited and published work see\n  https://www.frontiersin.org/articles/10.3389/fnsys.2018.00012/full", "journal-ref": "Front Syst Neurosci. 2018 Apr 11;12:12. doi:\n  10.3389/fnsys.2018.00012. eCollection 2018", "doi": "10.3389/fnsys.2018.00012", "report-no": null, "categories": "physics.bio-ph q-bio.NC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The scientific community has witnessed an exponential increase in the\napplications of graphene and graphene-based materials in a wide range of\nfields. For what concerns neuroscience, the interest raised by these materials\nis two-fold. On one side, nanosheets made of graphene or graphene derivatives\n(graphene oxide, or its reduced form) can be used as carriers for drug\ndelivery. Here, an important aspect is to evaluate their toxicity, which\nstrongly depends on flake composition, chemical functionalization and\ndimensions. On the other side, graphene can be exploited as a substrate for\ntissue engineering. In this case, conductivity is probably the most relevant\namongst the various properties of the different graphene materials, as it may\nallow to instruct and interrogate neural networks, as well as to drive neural\ngrowth and differentiation. In this review, we try to give a comprehensive view\nof the accomplishments and new challenges of the field, as well as which in our\nview are the most exciting directions to take in the immediate future. These\ninclude the need to engineer multifunctional nanoparticles able to cross the\nblood-brain-barrier to reach neural cells, and to achieve on-demand delivery of\nspecific drugs. We describe the state-of-the-art in the use of graphene\nmaterials to engineer three-dimensional scaffolds to drive neuronal growth and\nregeneration in vivo, and the possibility of using graphene as a component of\nhybrid composites/multi-layer organic electronics devices. Last but not least,\nwe address the need of an accurate theoretical modeling of the interface\nbetween graphene and biological material, by modeling the interaction of\ngraphene with proteins and cell membranes at the nanoscale, and describing the\nphysical mechanism(s) of charge transfer by which the various graphene\nmaterials can influence the excitability and physiology of neural cells.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2019 11:05:25 GMT"}], "update_date": "2019-03-21", "authors_parsed": [["Bramini", "Mattia", ""], ["Alberini", "Giulio", ""], ["Colombo", "Elisabetta", ""], ["Chiacchiaretta", "Martina", ""], ["DiFrancesco", "Mattia Lorenzo", ""], ["Maya-Vetencourt", "José Fernando", ""], ["Maragliano", "Luca", ""], ["Benfenati", "Fabio", ""], ["Cesca", "Fabrizia", ""]]}, {"id": "1903.08447", "submitter": "Mattia Bramini", "authors": "Mattia Bramini, Martina Chiacchiaretta, Andrea Armirotti, Anna Rocchi,\n  Deepali D. Kale, Cristina Martin Jimenez, Ester V\\'azquez, Tiziano Bandiera,\n  Stefano Ferroni, Fabrizia Cesca and Fabio Benfenati", "title": "An increase in membrane cholesterol by graphene oxide disrupts calcium\n  homeostasis in primary astrocytes", "comments": "This document is the unedited Author's version of a Submitted Work\n  that was subsequently accepted for publication in Small after peer review. To\n  access the final edited and published work see\n  https://onlinelibrary.wiley.com/doi/10.1002/smll.201900147 40 pages, 6 main\n  figures and 1 supplementary figure", "journal-ref": "Small 2019, 1900147", "doi": "10.1002/smll.201900147", "report-no": null, "categories": "q-bio.NC physics.bio-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The use of graphene nanomaterials (GNMs) for biomedical applications targeted\nto the central nervous system is exponentially increasing, although precise\ninformation on their effects on brain cells is lacking. In this work, we\naddressed the molecular changes induced in cortical astrocytes by few-layer\ngraphene (FLG) and graphene oxide (GO) flakes. Our results show that exposure\nto FLG/GO does not affect cell viability or proliferation. However, proteomic\nand lipidomic analyses unveiled alterations in several cellular processes,\nincluding intracellular Ca2+ ([Ca2+]i) homeostasis and cholesterol metabolism,\nwhich were particularly intense in cells exposed to GO. Indeed, GO exposure\nimpaired spontaneous and evoked astrocyte [Ca2+]i signals and induced a marked\nincrease in membrane cholesterol levels. Importantly, cholesterol depletion\nfully rescued [Ca2+]i dynamics in GO-treated cells, indicating a causal\nrelationship between these GO-mediated effects. Our results indicate that\nexposure to GNMs alters intracellular signaling in astrocytes and may impact on\nastrocyte-neuron interactions.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2019 11:21:17 GMT"}], "update_date": "2019-03-21", "authors_parsed": [["Bramini", "Mattia", ""], ["Chiacchiaretta", "Martina", ""], ["Armirotti", "Andrea", ""], ["Rocchi", "Anna", ""], ["Kale", "Deepali D.", ""], ["Jimenez", "Cristina Martin", ""], ["Vázquez", "Ester", ""], ["Bandiera", "Tiziano", ""], ["Ferroni", "Stefano", ""], ["Cesca", "Fabrizia", ""], ["Benfenati", "Fabio", ""]]}, {"id": "1903.08460", "submitter": "Pietro Verzelli", "authors": "Pietro Verzelli and Laura Sacerdote", "title": "A study of dependency features of spike trains through copulas", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simultaneous recordings from many neurons hide important information and the\nconnections characterizing the network remain generally undiscovered despite\nthe progresses of statistical and machine learning techniques. Discerning the\npresence of direct links between neuron from data is still a not completely\nsolved problem. To enlarge the number of tools for detecting the underlying\nnetwork structure, we propose here the use of copulas, pursuing on a research\ndirection we started in [1]. Here, we adapt their use to distinguish different\ntypes of connections on a very simple network. Our proposal consists in\nchoosing suitable random intervals in pairs of spike trains determining the\nshapes of their copulas. We show that this approach allows to detect different\ntypes of dependencies. We illustrate the features of the proposed method on\nsynthetic data from suitably connected networks of two or three formal neurons\ndirectly connected or influenced by the surrounding network. We show how a\nsmart choice of pairs of random times together with the use of empirical\ncopulas allows to discern between direct and un-direct interactions.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2019 11:52:43 GMT"}], "update_date": "2019-03-21", "authors_parsed": [["Verzelli", "Pietro", ""], ["Sacerdote", "Laura", ""]]}, {"id": "1903.08511", "submitter": "Fares Al-Shargie", "authors": "Fares Al-Shargie", "title": "Early Detection of Mental Stress Using Advanced Neuroimaging and\n  Artificial Intelligence", "comments": "190 Pages, 67 Figure, 9 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While different neuroimaging modalities have been proposed to detect mental\nstress, each modality experiences certain limitations. This study proposed\nnovel approaches to detect stress based on fusion of EEG and fNIRS signals in\nthe feature-level using joint independent component analysis (jICA) and\ncanonical correlation analysis method (CCA) and predected the level of stress\nusing machine-learning approach. The jICA and CCA were then developed to\ncombine the features to detect mental stress. The jICA fusion scheme discovers\nrelationships between modalities by utilizing ICA to identify sources from each\nmodality that modulate in the same way across subjects. The CCA fuse\ninformation from two sets of features to discover the associations across\nmodalities and to ultimately estimate the sources responsible for these\nassociations. The study further explored the functional connectivity (FC) and\nevaluated the performance of the fusion methods based on their classification\nperformance and compared it with the result obtained by each individual\nmodality. The jICA fusion technique significantly improved the classification\naccuracy, sensitivity and specificity on average by +3.46% compared to the EEG\nand +11.13% compared to the fNIRS. Similarly, CCA method improved the\nclassification accuracy, sensitivity and specificity on average by +8.56%\ncompared to the EEG and +13.03% compared to the fNIRS, respectively. The\noverall performance of the proposed fusion methods significantly improved the\ndetection rate of mental stress, p<0.05. The FC significantly reduced under\nstress and suggested EEG and fNIRS as a potential biomarker of stress.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2019 14:13:41 GMT"}], "update_date": "2019-03-21", "authors_parsed": [["Al-Shargie", "Fares", ""]]}, {"id": "1903.08858", "submitter": "Fuad Noman", "authors": "Chun-Ren Phang, Chee-Ming Ting, Fuad Noman, Hernando Ombao", "title": "Classification of EEG-Based Brain Connectivity Networks in Schizophrenia\n  Using a Multi-Domain Connectome Convolutional Neural Network", "comments": "15 pages, 9 figures", "journal-ref": null, "doi": "10.1109/JBHI.2019.2941222", "report-no": null, "categories": "cs.LG cs.CV q-bio.NC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We exploit altered patterns in brain functional connectivity as features for\nautomatic discriminative analysis of neuropsychiatric patients. Deep learning\nmethods have been introduced to functional network classification only very\nrecently for fMRI, and the proposed architectures essentially focused on a\nsingle type of connectivity measure. We propose a deep convolutional neural\nnetwork (CNN) framework for classification of electroencephalogram\n(EEG)-derived brain connectome in schizophrenia (SZ). To capture complementary\naspects of disrupted connectivity in SZ, we explore combination of various\nconnectivity features consisting of time and frequency-domain metrics of\neffective connectivity based on vector autoregressive model and partial\ndirected coherence, and complex network measures of network topology. We design\na novel multi-domain connectome CNN (MDC-CNN) based on a parallel ensemble of\n1D and 2D CNNs to integrate the features from various domains and dimensions\nusing different fusion strategies. Hierarchical latent representations learned\nby the multiple convolutional layers from EEG connectivity reveal apparent\ngroup differences between SZ and healthy controls (HC). Results on a large\nresting-state EEG dataset show that the proposed CNNs significantly outperform\ntraditional support vector machine classifiers. The MDC-CNN with combined\nconnectivity features further improves performance over single-domain CNNs\nusing individual features, achieving remarkable accuracy of $93.06\\%$ with a\ndecision-level fusion. The proposed MDC-CNN by integrating information from\ndiverse brain connectivity descriptors is able to accurately discriminate SZ\nfrom HC. The new framework is potentially useful for developing diagnostic\ntools for SZ and other disorders.\n", "versions": [{"version": "v1", "created": "Thu, 21 Mar 2019 07:35:54 GMT"}], "update_date": "2020-04-27", "authors_parsed": [["Phang", "Chun-Ren", ""], ["Ting", "Chee-Ming", ""], ["Noman", "Fuad", ""], ["Ombao", "Hernando", ""]]}, {"id": "1903.09103", "submitter": "Diederik Aerts", "authors": "Diederik Aerts, Jonito Aerts Argu\\\"elles, Lester Beltran, Suzette\n  Geriente, Massimiliano Sassoli de Bianchi, Sandro Sozzo and Tomas Veloz", "title": "Quantum entanglement in physical and cognitive systems: a conceptual\n  analysis and a general representation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a general description of the phenomenon of entanglement in\nbipartite systems, as it manifests in micro and macro physical systems, as well\nas in human cognitive processes. We do so by observing that when genuine\ncoincidence measurements are considered, the violation of the 'marginal laws',\nin addition to the Bell-CHSH inequality, is also to be expected. The situation\ncan be described in the quantum formalism by considering the presence of\nentanglement not only at the level of the states, but also at the level of the\nmeasurements. However, at the \"local'\" level of a specific joint measurement, a\ndescription where entanglement is only incorporated in the state remains always\npossible, by adopting a fine-tuned tensor product representation. But\ncontextual tensor product representations should only be considered when there\nare good reasons to describe the outcome-states as (non-entangled) product\nstates. This will not in general be true, hence, the entangement resource will\nhave to generally be allocated both in the states and in the measurements. In\nview of the numerous violations of the marginal laws observed in physics'\nlaboratories, it remains unclear to date if entanglement in micro-physical\nsystems is to be understood only as an 'entanglement of the states', or also as\nan 'entanglement of the measurements'. But even if measurements would also be\nentangled, the corresponding violation of the marginal laws (no-signaling\nconditions) would not for this imply that a superluminal communication would be\npossible.\n", "versions": [{"version": "v1", "created": "Thu, 21 Mar 2019 16:38:49 GMT"}], "update_date": "2019-03-22", "authors_parsed": [["Aerts", "Diederik", ""], ["Arguëlles", "Jonito Aerts", ""], ["Beltran", "Lester", ""], ["Geriente", "Suzette", ""], ["de Bianchi", "Massimiliano Sassoli", ""], ["Sozzo", "Sandro", ""], ["Veloz", "Tomas", ""]]}, {"id": "1903.09412", "submitter": "Simon Wein", "authors": "Simon Wein, Ana Maria Tom\\'e, Markus Goldhacker, Mark W. Greenlee,\n  Elmar W. Lang", "title": "A constrained ICA-EMD Model for Group Level fMRI Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Independent component analysis (ICA), as a data driven method, has shown to\nbe a powerful tool for functional magnetic resonance imaging (fMRI) data\nanalysis. One drawback of this multivariate approach is, that it is not\ncompatible to the analysis of group data in general. Therefore various\ntechniques have been proposed in order to overcome this limitation of ICA. In\nthis paper a novel ICA-based work-flow for extracting resting state networks\nfrom fMRI group studies is proposed. An empirical mode decomposition (EMD) is\nused to generate reference signals in a data driven manner, which can be\nincorporated into a constrained version of ICA (cICA), what helps to eliminate\nthe inherent ambiguities of ICA. The results of the proposed workflow are then\ncompared to those obtained by a widely used group ICA approach for fMRI\nanalysis. In this paper it is demonstrated that intrinsic modes, extracted by\nEMD, are suitable to serve as references for cICA to obtain typical resting\nstate patterns, which are consistent over subjects. By introducing these\nreference signals into the ICA, our processing pipeline makes it transparent\nfor the user, how comparable activity patterns across subjects emerge. This\nadditionally allows adapting the trade-off between enforcing similarity across\nsubjects and preserving individual subject features.\n", "versions": [{"version": "v1", "created": "Fri, 22 Mar 2019 09:15:23 GMT"}], "update_date": "2019-03-25", "authors_parsed": [["Wein", "Simon", ""], ["Tomé", "Ana Maria", ""], ["Goldhacker", "Markus", ""], ["Greenlee", "Mark W.", ""], ["Lang", "Elmar W.", ""]]}, {"id": "1903.09542", "submitter": "Manuel Baltieri Mr", "authors": "Manuel Baltieri and Christopher L. Buckley", "title": "Nonmodular architectures of cognitive systems based on active inference", "comments": "Accepted at IJCNN 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In psychology and neuroscience it is common to describe cognitive systems as\ninput/output devices where perceptual and motor functions are implemented in a\npurely feedforward, open-loop fashion. On this view, perception and action are\noften seen as encapsulated modules with limited interaction between them. While\nembodied and enactive approaches to cognitive science have challenged the\nidealisation of the brain as an input/output device, we argue that even the\nmore recent attempts to model systems using closed-loop architectures still\nheavily rely on a strong separation between motor and perceptual functions.\nPreviously, we have suggested that the mainstream notion of modularity strongly\nresonates with the separation principle of control theory. In this work we\npresent a minimal model of a sensorimotor loop implementing an architecture\nbased on the separation principle. We link this to popular formulations of\nperception and action in the cognitive sciences, and show its limitations when,\nfor instance, external forces are not modelled by an agent. These forces can be\nseen as variables that an agent cannot directly control, i.e., a perturbation\nfrom the environment or an interference caused by other agents. As an\nalternative approach inspired by embodied cognitive science, we then propose a\nnonmodular architecture based on the active inference framework. We demonstrate\nthe robustness of this architecture to unknown external inputs and show that\nthe mechanism with which this is achieved in linear models is equivalent to\nintegral control.\n", "versions": [{"version": "v1", "created": "Fri, 22 Mar 2019 15:00:25 GMT"}], "update_date": "2019-03-25", "authors_parsed": [["Baltieri", "Manuel", ""], ["Buckley", "Christopher L.", ""]]}, {"id": "1903.09630", "submitter": "Francesca Arese Lucini", "authors": "Francesca Arese Lucini and Gino Del Ferraro and Mariano Sigman and\n  Hernan A. Makse", "title": "How the Brain Transitions from Conscious to Subliminal Perception", "comments": null, "journal-ref": "Neuroscience 2019", "doi": null, "report-no": null, "categories": "q-bio.NC physics.bio-ph physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the transition in the functional networks that characterize the\nhuman brains' conscious-state to an unconscious subliminal state of perception\nby using k-core percolation. We find that the most inner core (i.e., the most\nconnected kernel) of the conscious-state functional network corresponds to\nareas which remain functionally active when the brain transitions from the\nconscious-state to the subliminal-state. That is, the inner core of the\nconscious network coincides with the subliminal-state. Mathematical modeling\nallows to interpret the conscious to subliminal transition as driven by k-core\npercolation, through which the conscious state is lost by the inactivation of\nthe peripheral k-shells of the conscious functional network. Thus, the inner\ncore and most robust component of the conscious brain corresponds to the\nunconscious subliminal state. This finding imposes constraints to theoretical\nmodels of consciousness, in that the location of the core of the functional\nbrain network is in the unconscious part of the brain rather than in the\nconscious state as previously thought.\n", "versions": [{"version": "v1", "created": "Thu, 21 Mar 2019 01:09:05 GMT"}, {"version": "v2", "created": "Mon, 13 May 2019 18:40:24 GMT"}, {"version": "v3", "created": "Wed, 29 May 2019 15:40:08 GMT"}], "update_date": "2019-05-30", "authors_parsed": [["Lucini", "Francesca Arese", ""], ["Del Ferraro", "Gino", ""], ["Sigman", "Mariano", ""], ["Makse", "Hernan A.", ""]]}, {"id": "1903.09671", "submitter": "Konstantinos Michmizos", "authors": "Vladimir A. Ivanov, Ioannis E. Polykretis, Konstantinos P. Michmizos", "title": "Axonal Conduction Velocity Impacts Neuronal Network Oscillations", "comments": "4 pages, 5 figures, IEEE-EMBS International Conference on Biomedical\n  and Health Informatics (BHI '19)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Increasing experimental evidence suggests that axonal action potential\nconduction velocity is a highly adaptive parameter in the adult central nervous\nsystem. Yet, the effects of this newfound plasticity on global brain dynamics\nis poorly understood. In this work, we analyzed oscillations in biologically\nplausible neuronal networks with different conduction velocity distributions.\nChanges of 1-2 (ms) in network mean signal transmission time resulted in\nsubstantial network oscillation frequency changes ranging in 0-120 (Hz). Our\nresults suggest that changes in axonal conduction velocity may significantly\naffect both the frequency and synchrony of brain rhythms, which have well\nestablished connections to learning, memory, and other cognitive processes.\n", "versions": [{"version": "v1", "created": "Fri, 22 Mar 2019 18:38:12 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Ivanov", "Vladimir A.", ""], ["Polykretis", "Ioannis E.", ""], ["Michmizos", "Konstantinos P.", ""]]}, {"id": "1903.09710", "submitter": "Bryan Daniels", "authors": "Bryan C. Daniels and Pawel Romanczuk", "title": "Quantifying the impact of network structure on speed and accuracy in\n  collective decision-making", "comments": "16 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Found in varied contexts from neurons to ants to fish, binary decision-making\nis one of the simplest forms of collective computation. In this process,\ninformation collected by individuals about an uncertain environment is\naccumulated to guide behavior at the aggregate scale. We study binary\ndecision-making dynamics in networks responding to inputs with small\nsignal-to-noise ratios, looking for quantitative measures of collectivity that\ncontrol decision-making performance. We find that decision accuracy is\ncontrolled largely by three factors: the leading eigenvalue of the network\nadjacency matrix, the corresponding eigenvector's participation ratio, and\ndistance from the corresponding symmetry-breaking bifurcation. This allows us\nto predict how decision-making performance scales in large networks based on\ntheir spectral properties. Specifically, we explore the effects of localization\ncaused by the hierarchical assortative structure of a \"rich club\" topology.\nThis gives insight into the tradeoffs involved in the higher-order structure\nfound in living networks performing collective computations.\n", "versions": [{"version": "v1", "created": "Fri, 22 Mar 2019 21:07:16 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Daniels", "Bryan C.", ""], ["Romanczuk", "Pawel", ""]]}, {"id": "1903.10120", "submitter": "Andrey Kuznetsov", "authors": "Ivan A. Kuznetsov and Andrey V. Kuznetsov", "title": "Modeling transport and mean age of dense core vesicles in large axonal\n  arbors", "comments": "Added an acknowledgement to Holger Metzler", "journal-ref": "Proceedings of the Royal Society A, vol. 475, 20190284, 2019", "doi": "10.1098/rspa.2019.0284", "report-no": null, "categories": "q-bio.NC q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model simulating transport of dense core vesicles (DCVs) in type II axonal\nterminals of Drosophila motoneurons has been developed. The morphology of type\nII terminals is characterized by the large number of en passant boutons. The\nlack of both scaled up DCV transport and scaled down DCV capture in boutons\nresults in a less efficient supply of DCVs to distal boutons. Furthermore, the\nlarge number of boutons that DCVs pass as they move anterogradely, until they\nreach the most distal bouton, may lead to the capture of a majority of DCVs\nbefore they turn around in the most distal bouton to move in the retrograde\ndirection. This may lead to a reduced retrograde flux of DCVs and a lack of DCV\ncirculation in type II terminals. The developed model simulates DCV\nconcentrations in boutons, DCV fluxes between the boutons, age density\ndistributions of DCVs, and the mean age of DCVs in various boutons. Unlike\npublished experimental observations, our model predicts DCV circulation in type\nII terminals after these terminals are filled to saturation. This disagreement\nis likely because experimentally observed terminals were not at steady-state,\nbut rather were accumulating DCVs for later release. Our estimates show that\nthe number of DCVs in the transiting state is much smaller than that in the\nresident state. DCVs traveling in the axon, rather than DCVs transiting in the\nterminal, may provide a reserve of DCVs for replenishing boutons after a\nrelease. The techniques for modeling transport of DCVs developed in our paper\ncan be used to model the transport of other organelles in axons.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 03:44:22 GMT"}, {"version": "v2", "created": "Thu, 2 May 2019 17:57:58 GMT"}, {"version": "v3", "created": "Sat, 7 Sep 2019 14:33:09 GMT"}, {"version": "v4", "created": "Sat, 1 Feb 2020 18:36:09 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Kuznetsov", "Ivan A.", ""], ["Kuznetsov", "Andrey V.", ""]]}, {"id": "1903.10131", "submitter": "Zachary Kilpatrick PhD", "authors": "Nicholas W. Barendregt, Kre\\v{s}imir Josi\\'c, and Zachary P.\n  Kilpatrick", "title": "Analyzing dynamic decision-making models using Chapman-Kolmogorov\n  equations", "comments": "24 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decision-making in dynamic environments typically requires adaptive evidence\naccumulation that weights new evidence more heavily than old observations.\nRecent experimental studies of dynamic decision tasks require subjects to make\ndecisions for which the correct choice switches stochastically throughout a\nsingle trial. In such cases, an ideal observer's belief is described by an\nevolution equation that is doubly stochastic, reflecting stochasticity in the\nboth observations and environmental changes. In these contexts, we show that\nthe probability density of the belief can be represented using differential\nChapman-Kolmogorov equations, allowing efficient computation of ensemble\nstatistics. This allows us to reliably compare normative models to\nnear-normative approximations using, as model performance metrics, decision\nresponse accuracy and Kullback-Leibler divergence of the belief distributions.\nSuch belief distributions could be obtained empirically from subjects by asking\nthem to report their decision confidence. We also study how response accuracy\nis affected by additional internal noise, showing optimality requires longer\nintegration timescales as more noise is added. Lastly, we demonstrate that our\nmethod can be applied to tasks in which evidence arrives in a discrete,\npulsatile fashion, rather than continuously.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 04:29:34 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Barendregt", "Nicholas W.", ""], ["Josić", "Krešimir", ""], ["Kilpatrick", "Zachary P.", ""]]}, {"id": "1903.10310", "submitter": "Danilo Bzdok", "authors": "Danilo Bzdok (PARIETAL), John Ioannidis", "title": "Exploration, inference and prediction in neuroscience and biomedicine", "comments": null, "journal-ref": "Trends in Neurosciences, Elsevier, 2019", "doi": null, "report-no": null, "categories": "q-bio.NC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The last decades saw dramatic progress in brain research. These advances were\noften buttressed by probing single variables to make circumscribed discoveries,\ntypically through null hypothesis significance testing. New ways for generating\nmassive data fueled tension between the traditional methodology, used to infer\nstatistically relevant effects in carefully-chosen variables, and\npattern-learning algorithms, used to identify predictive signatures by\nsearching through abundant information. In this article, we detail the\nantagonistic philosophies behind two quantitative approaches: certifying robust\neffects in understandable variables, and evaluating how accurately a built\nmodel can forecast future outcomes. We discourage choosing analysis tools via\ncategories like 'statistics' or 'machine learning'. Rather, to establish\nreproducible knowledge about the brain, we advocate prioritizing tools in view\nof the core motivation of each quantitative analysis: aiming towards\nmechanistic insight, or optimizing predictive accuracy.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2019 13:08:29 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Bzdok", "Danilo", "", "PARIETAL"], ["Ioannidis", "John", ""]]}, {"id": "1903.10327", "submitter": "Massimiliano Tamborrino Dr", "authors": "Giuseppe D'Onofrio, Petr Lansky and Massimiliano Tamborrino", "title": "Inhibition enhances the coherence in the Jacobi neuronal model", "comments": null, "journal-ref": null, "doi": "10.1016/j.chaos.2019.07.040", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The output signal is examined for the Jacobi neuronal model which is\ncharacterized by input-dependent multiplicative noise. The dependence of the\nnoise on the rate of inhibition turns out to be of primary importance to\nobserve maxima both in the output firing rate and in the diffusion coefficient\nof the spike count and, simultaneously, a minimum in the coefficient of\nvariation (Fano factor). Moreover, we observe that an increment of the rate of\ninhibition can increase the degree of coherence computed from the power\nspectrum. This means that inhibition can enhance the coherence and thus the\ninformation transmission between the input and the output in this neuronal\nmodel. Finally, we stress that the firing rate, the coefficient of variation\nand the diffusion coefficient of the spike count cannot be used as the only\nindicator of coherence resonance without considering the power spectrum.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2019 09:16:03 GMT"}], "update_date": "2019-09-04", "authors_parsed": [["D'Onofrio", "Giuseppe", ""], ["Lansky", "Petr", ""], ["Tamborrino", "Massimiliano", ""]]}, {"id": "1903.10334", "submitter": "Jon Borresen", "authors": "Jon Borresen and Killian O'Brien", "title": "An Upper Bound on the Number of Discrete States Possible for the Human\n  Brain", "comments": "10 Pages, 5 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Human brains are arguably the most complex entities known. Composed of\nbillions of neurons, connected via a highly detailed structure where the\nunderlying method by which functionality occurs is still debated. Here we\nconsider one theory for neural coding, synchronization coding, which gives rise\nto the highest possible number of discrete states that a brain could exist in.\nA strict upper bound on the number of these states is determined. We conclude\nthat the theoretical upper limit on the capacity of one human brain is almost\ninconceivably large and massively larger than the corresponding theoretical\nlimit that could be obtained using every transistor ever built.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2019 11:47:11 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Borresen", "Jon", ""], ["O'Brien", "Killian", ""]]}, {"id": "1903.10425", "submitter": "In\\^es Esteves", "authors": "In\\^es Esteves, Wenya Nan, Cristiana Alves, Alexandre Calapez,\n  Fernando Mel\\'icio, Agostinho Rosa", "title": "Comparative study of training intensity in neurofeedback", "comments": "8 figures and 5 tables (presented at the end of the document)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neurofeedback has proved to be useful in many instances. This technique is\noften used to address both medical issues and performance improvement. Despite\nthe wide range of applications, no consensus has been reached about the optimal\ntraining schedule.\n  In this work, a practical experiment was conducted aiming to compare the\neffects of intensive and sparse training modalities of enhancement of the\nindividual upper alpha band at Fz, for working memory improvement, in 19\nhealthy subjects. The INTENSIVE group was submitted to 4 sessions of 37.5\nminutes each, during consecutive days, while the SPARSE group performed 15\nsessions of 25 minutes along approximately 2 months.\n  The intensive modality proved to be significantly more effective in\nincreasing the target frequency at Fz within session. However, no significant\ndifferences were found across sessions neither regarding cognitive\nimprovements. The distinction between learners and non-learners led to\nsignificant results for the two groups across sessions, but only the learners\nof the INTENSIVE group show significant changes within session. Besides, for\nthis subsample the effects in the INTENSIVE group are significantly stronger\nboth within and across sessions.\n  The results suggest that longer sessions with shorter trials and more breaks\ncould be advantageous when training healthy subjects. Although further\ninvestigation is needed to establish if one modality outperforms the other,\nbetter outcomes might be obtained if each session consists in many short trials\n(in this case 30 seconds) and is performed on consecutive days.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 16:08:45 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Esteves", "Inês", ""], ["Nan", "Wenya", ""], ["Alves", "Cristiana", ""], ["Calapez", "Alexandre", ""], ["Melício", "Fernando", ""], ["Rosa", "Agostinho", ""]]}, {"id": "1903.10446", "submitter": "Sushrut Thorat", "authors": "Sushrut Thorat, Marcel van Gerven, Marius Peelen", "title": "The functional role of cue-driven feature-based feedback in object\n  recognition", "comments": "4 pages, 4 figures, published at the Conference on Cognitive\n  Computational Neuroscience (CCN) 2018", "journal-ref": null, "doi": "10.32470/CCN.2018.1044-0", "report-no": null, "categories": "q-bio.NC cs.CV cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Visual object recognition is not a trivial task, especially when the objects\nare degraded or surrounded by clutter or presented briefly. External cues (such\nas verbal cues or visual context) can boost recognition performance in such\nconditions. In this work, we build an artificial neural network to model the\ninteraction between the object processing stream (OPS) and the cue. We study\nthe effects of varying neural and representational capacities of the OPS on the\nperformance boost provided by cue-driven feature-based feedback in the OPS. We\nobserve that the feedback provides performance boosts only if the\ncategory-specific features about the objects cannot be fully represented in the\nOPS. This representational limit is more dependent on task demands than neural\ncapacity. We also observe that the feedback scheme trained to maximise\nrecognition performance boost is not the same as tuning-based feedback, and\nactually performs better than tuning-based feedback.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 16:27:07 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Thorat", "Sushrut", ""], ["van Gerven", "Marcel", ""], ["Peelen", "Marius", ""]]}, {"id": "1903.10626", "submitter": "Milena \\v{C}uki\\'c Dr", "authors": "Milena Cukic", "title": "The role of physiological complexity changes in resting-state EEG in\n  clinical effectiveness of rTMS and tDCS in treatments of resistant depression", "comments": "26 pages, 7 figures", "journal-ref": "Frontiers in Psychology, section Neuropsychology,Volume 10,\n  Article 2923. 10 December 2019", "doi": "10.3389/fpsyg.2019.02923", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present literature about possible mechanisms behind the effectivity of\nnoninvasive electromagnetic stimulation in major depressive disorder (MDD) is\nnot very rich. Despite extensive research in applications for clinical\npractice, the exact effects are yet not clear. We are comparing our previous\nresults about the complexity changes induced by repetitive Transcranial\nMagnetic Stimulation (rTMS), and transcranial direct current stimulation (tDCS)\nwhich are known to modulate neural dynamics. Also, we are reviewing different\nbiomarkers of complexity changes connected to depression, and how they change\nwith the stimulation. TDCS is low-intensity TES, known to have polarity\nspecific effects (neuromodulatory effects), and rTMS is inducing an electric\nfield in the tissue circumstantially via Faraday's law. Both nonlinear\nmodalities of electromagnetic stimulation may affect the levels of\nphysiological complexity in the brain. We also compare the changes of\ncomplexity in electroencephalogram (EEG) and electrocardiogram (ECG), as\npotential future predictors of therapy outcome.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 23:06:22 GMT"}], "update_date": "2019-12-19", "authors_parsed": [["Cukic", "Milena", ""]]}, {"id": "1903.11454", "submitter": "Milena \\v{C}uki\\'c Dr", "authors": "Milena Cukic Radenkovic", "title": "Machine learning approaches in Detecting the Depression from\n  Resting-state Electroencephalogram (EEG): A Review Study", "comments": "31 pages, 4 Figures. arXiv admin note: text overlap with\n  arXiv:1803.05985 by other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.LG stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we aimed at reviewing several different approaches present\ntoday in the search for more accurate diagnostic and treatment management in\nmental healthcare. Our focus is on mood disorders, and in particular on the\nmajor depressive disorder (MDD). We are reviewing and discussing findings based\non neuroimaging studies (MRI and fMRI) first to get the impression of the body\nof knowledge about the anatomical and functional differences in depression.\nThen, we are focusing on less expensive data-driven approach, applicable for\neveryday clinical practice, in particular, those based on\nelectroencephalographic (EEG) recordings. Among those studies utilizing EEG, we\nare discussing a group of applications used for detecting of depression based\non the resting state EEG (detection studies) and interventional studies (using\nstimulus in their protocols or aiming to predict the outcome of therapy). We\nconclude with a discussion and review of guidelines to improve the reliability\nof developed models that could serve improvement of diagnostic of depression in\npsychiatry.\n", "versions": [{"version": "v1", "created": "Tue, 26 Mar 2019 14:45:43 GMT"}], "update_date": "2019-03-28", "authors_parsed": [["Radenkovic", "Milena Cukic", ""]]}, {"id": "1903.11915", "submitter": "Karolina Finc", "authors": "Kamil Bonna, Karolina Finc, Maria Zimmermann, {\\L}ukasz Bola, Piotr\n  Mostowski, Maciej Szul, Pawe{\\l} Rutkowski, W{\\l}odzis{\\l}aw Duch, Artur\n  Marchewka, Katarzyna Jednor\\'og, Marcin Szwed", "title": "Early deafness leads to re-shaping of global functional connectivity\n  beyond the auditory cortex", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Early sensory deprivation such as blindness or deafness shapes brain\ndevelopment in multiple ways. While it is established that deprived brain areas\nstart to be engaged in the processing of stimuli from the remaining modalities\nand in high-level cognitive tasks, some reports have also suggested the\npossibility of structural and functional changes in non-deprived brain areas.\nWe compared resting-state functional network organization of the brain in\nearly-deaf adults and hearing controls by examining global network segregation\nand integration. Relative to hearing controls, deaf adults exhibited an altered\nmodular organization, with regions of the salience network coupled with the\nfronto-parietal network. They showed weaker connections between auditory and\nsomatomotor regions, stronger coupling between the fronto-parietal network and\nseveral other large-scale networks (visual, memory, cingulo-opercular and\nsomatomotor), and an enlargement of the default mode network. Their overall\nfunctional segregation of brain networks was also lower. Our findings suggest\nthat brain plasticity in deaf adults is not limited to changes in auditory\ncortex but additionally alters the coupling between other large-scale networks.\nThese widespread functional connectivity changes may provide a mechanism for\nthe superior behavioral performance of the deaf in visual and attentional\ntasks.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2019 12:27:32 GMT"}], "update_date": "2019-03-29", "authors_parsed": [["Bonna", "Kamil", ""], ["Finc", "Karolina", ""], ["Zimmermann", "Maria", ""], ["Bola", "Łukasz", ""], ["Mostowski", "Piotr", ""], ["Szul", "Maciej", ""], ["Rutkowski", "Paweł", ""], ["Duch", "Włodzisław", ""], ["Marchewka", "Artur", ""], ["Jednoróg", "Katarzyna", ""], ["Szwed", "Marcin", ""]]}, {"id": "1903.11972", "submitter": "Sitabhra Sinha", "authors": "Anand Pathak, Nivedita Chatterjee and Sitabhra Sinha", "title": "Developmental trajectory of Caenorhabditis elegans nervous system\n  governs its structural organization", "comments": "25 pages, 8 figures + 24 pages supplementary material", "journal-ref": null, "doi": "10.1371/journal.pcbi.1007602", "report-no": null, "categories": "q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A central problem of neuroscience involves uncovering the principles\ngoverning the organization of nervous systems which ensure robustness in brain\ndevelopment. The nematode Caenorhabditis elegans provides us with a model\norganism for studying this question. In this paper, we focus on the invariant\nconnection structure and spatial arrangement of the neurons comprising the\nsomatic neuronal network of this organism to understand the key developmental\nconstraints underlying its design. We observe that neurons with certain shared\ncharacteristics - such as, neural process lengths, birth time cohort, lineage\nand bilateral symmetry - exhibit a preference for connecting to each other.\nRecognizing the existence of such homophily helps in connecting the physical\nlocation and morphology of neurons with the topological organization of the\nnetwork. Further, the functional identities of neurons appear to dictate the\ntemporal hierarchy of their appearance during the course of development.\nProviding crucial insights into principles that may be common across many\norganisms, our study shows how the trajectory in the developmental landscape\nconstrains the eventual spatial and network topological organization of a\nnervous system.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2019 13:48:29 GMT"}, {"version": "v2", "created": "Tue, 14 May 2019 11:34:30 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Pathak", "Anand", ""], ["Chatterjee", "Nivedita", ""], ["Sinha", "Sitabhra", ""]]}, {"id": "1903.12009", "submitter": "Dana Sherman", "authors": "Dana Sherman and David Harel", "title": "Deciphering the underlying mechanisms of the pharyngeal motions in\n  Caenorhabditis elegans", "comments": "32 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The pharynx of the nematode Caenorhabditis elegans is a neuromuscular pump\nthat exhibits two typical motions: pumping and peristalsis. While the dynamics\nof these motions are well characterized, the underlying mechanisms generating\nmost of them are not known. In this paper, we propose comprehensive and\ndetailed mechanisms that can explain the various observed dynamics of the\ndifferent pharyngeal areas: the dynamics of the pumping muscles - corpus,\nanterior isthmus, and terminal bulb - and the peristalsis dynamics of the\nposterior isthmus muscles. While the suggested mechanisms are consistent with\nall available relevant data, the assumptions on which they are based and the\nopen questions they raise could point at additional interesting research\ndirections on the C. elegans pharynx. We are hoping that appropriate\nexperiments on the nematode will eventually corroborate our results, and\nimprove our understanding of the functioning of the C. elegans pharynx, and\npossibly of the mammalian digestive system.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2019 14:35:02 GMT"}], "update_date": "2019-03-29", "authors_parsed": [["Sherman", "Dana", ""], ["Harel", "David", ""]]}, {"id": "1903.12155", "submitter": "Akihiko Akao", "authors": "Akihiko Akao, Sho Shirasaka, Yasuhiko Jimbo, Bard Ermentrout and\n  Kiyoshi Kotani", "title": "Theta-gamma cross-frequency coupling enables covariance between distant\n  brain regions", "comments": "13 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC nlin.PS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cross-frequency coupling (CFC) is thought to play an important role in\ncommunication across distant brain regions. However, neither the mechanism of\nits generation nor the influence on the underlying spiking dynamics is well\nunderstood. Here, we investigate the dynamics of two interacting distant\nneuronal modules coupled by inter-regional long-range connections. Each\nneuronal module comprises an excitatory and inhibitory population of quadratic\nintegrate-and-fire neurons connected locally with conductance-based synapses.\nThe two modules are coupled reciprocally with delays that represent the\nlong-range conduction time. We applied the Ott-Antonsen ansatz to reduce the\nspiking dynamics to the corresponding mean field equations as a small set of\ndelay differential equations. Bifurcation analysis on these mean field\nequations shows inter-regional conduction delay is sufficient to produce CFC\nvia a torus bifurcation. Spike correlation analysis during the CFC revealed\nthat several local clusters exhibit synchronized firing in gamma-band\nfrequencies. These clusters exhibit locally decorrelated firings between the\ncluster pairs within the same population. In contrast, the clusters exhibit\nlong-range gamma-band cross-covariance between the distant clusters that have\nsimilar firing frequency. The interactions of the different gamma frequencies\nproduce a beat leading to population-level CFC. We analyzed spike counts in\nrelation to the phases of the macroscopic fast and slow oscillations and found\npopulation spike counts vary with respect to macroscopic phases. Such firing\nphase preference accompanies a phase window with high spike count and low Fano\nfactor, which is suitable for a population rate code. Our work suggests the\ninter-regional conduction delay plays a significant role in the emergence of\nCFC and the underlying spiking dynamics may support long-range communication\nand neural coding.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2019 17:42:05 GMT"}], "update_date": "2019-03-29", "authors_parsed": [["Akao", "Akihiko", ""], ["Shirasaka", "Sho", ""], ["Jimbo", "Yasuhiko", ""], ["Ermentrout", "Bard", ""], ["Kotani", "Kiyoshi", ""]]}, {"id": "1903.12632", "submitter": "Stefan Bornholdt", "authors": "Lorenz Baumgarten and Stefan Bornholdt", "title": "Critical excitation-inhibition balance in dense neural networks", "comments": "10 pages 8 figures, revised version", "journal-ref": "Phys. Rev. E 100, 010301 (2019)", "doi": "10.1103/PhysRevE.100.010301", "report-no": null, "categories": "cond-mat.dis-nn q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The \"edge of chaos\" phase transition in artificial neural networks is of\nrenewed interest in light of recent evidence for criticality in brain dynamics.\nStatistical mechanics traditionally studied this transition with connectivity\n$k$ as the control parameter and an exactly balanced excitation-inhibition\nratio. While critical connectivity has been found to be low in these model\nsystems, typically around $k=2$, which is unrealistic for natural systems, a\nrecent study utilizing the excitation-inhibition ratio as the control parameter\nfound a new, nearly degree independent, critical point when connectivity is\nlarge. However, the new phase transition is accompanied by an unnaturally high\nlevel of activity in the network.\n  Here we study random neural networks with the additional properties of (i) a\nhigh clustering coefficient and (ii) neurons that are solely either excitatory\nor inhibitory, a prominent property of natural neurons. As a result, we observe\nan additional critical point for networks with large connectivity, regardless\nof degree distribution, which exhibits low activity levels that compare well\nwith neuronal brain networks.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2019 17:33:02 GMT"}, {"version": "v2", "created": "Wed, 3 Jul 2019 21:39:41 GMT"}], "update_date": "2019-07-17", "authors_parsed": [["Baumgarten", "Lorenz", ""], ["Bornholdt", "Stefan", ""]]}]