[{"id": "1107.0015", "submitter": "Jitesh Dundas", "authors": "Jitesh Dundas", "title": "Automaton based detection of affected cells in three dimensional\n  biological system", "comments": "38 pages including 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this research review is to propose the logic and search mechanism\nfor the development of an artificially intelligent automaton (AIA) that can\nfind affected cells in a 3-dimensional biological system. Research on the\npossible application of such automatons to detect and control cancer cells in\nthe human body are greatly focused MRI and PET scans finds the affected regions\nat the tissue level even as we can find the affected regions at the cellular\nlevel using the framework. The AIA may be designed to ensure optimum\nutilization as they record and might control the presence of affected cells in\na human body. The proposed models and techniques can be generalized and used in\nany application where cells are injured or affected by some disease or\naccident. The best method to import AIA into the body without surgery or\ninjection is to insert small pill like automata, carrying material viz drugs or\nleukocytes that is needed to correct the infection. In this process, the AIA\ncan be compared to nano pills to deliver or support therapy. NanoHive\nsimulation software was used to validate the framework of this paper. The\nexisting nanomedicine models such as obstacle avoidance algorithm based models\n(Hla K H S et al 2008) and the framework in this model were tested in different\nsimulation based experiments. The existing models such as obstacle avoidance\nbased models failed in complex environmental conditions (such as changing\nenvironmental conditions, presence of semi-solid particles, etc) while the\nmodel in this paper executed its framework successfully.Come systems biology,\nthis field of automatons deserves a bigger leap of understanding especially\nwhen pharmacogenomics is at its peak. The results also indicate the importance\nof artificial intelligence and other computational capabilities in the proposed\nmodel for the successful detection of affected cells.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jun 2011 20:11:58 GMT"}], "update_date": "2011-07-04", "authors_parsed": [["Dundas", "Jitesh", ""]]}, {"id": "1107.1128", "submitter": "Seeja K. R.", "authors": "K.R Seeja", "title": "AISMOTIF-An Artificial Immune System for DNA Motif Discovery", "comments": "7 pages", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 2, March 2011 IJCSI International Journal of Computer Science Issues,\n  Vol. 8, Issue 2, March 2011, ISSN (Online): 1694-0814, pages 143-149", "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Discovery of transcription factor binding sites is a much explored and still\nexploring area of research in functional genomics. Many computational tools\nhave been developed for finding motifs and each of them has their own\nadvantages as well as disadvantages. Most of these algorithms need prior\nknowledge about the data to construct background models. However there is not a\nsingle technique that can be considered as best for finding regulatory motifs.\nThis paper proposes an artificial immune system based algorithm for finding the\ntranscription factor binding sites or motifs and two new weighted scores for\nmotif evaluation. The algorithm is enumerative, but sufficient pruning of the\npattern search space has been incorporated using immune system concepts. The\nperformance of AISMOTIF has been evaluated by comparing it with eight state of\nart composite motif discovery algorithms and found that AISMOTIF predicts known\nmotifs as well as new motifs from the benchmark dataset without any prior\nknowledge about the data.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2011 06:01:20 GMT"}], "update_date": "2011-07-07", "authors_parsed": [["Seeja", "K. R", ""]]}, {"id": "1107.1608", "submitter": "Jesus Emeterio Navarro-Barrientos", "authors": "J.-Emeterio Navarro-Barrientos", "title": "Formation of Common Investment Networks by Project Establishment between\n  Agents", "comments": null, "journal-ref": "SBP 2011, LNCS 6589, Springer (2011) pp.172-179", "doi": "10.1007/978-3-642-19656-0_26", "report-no": null, "categories": "cs.SI cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an investment model integrated with trust-reputation mechanisms\nwhere agents interact with each other to establish investment projects. We\ninvestigate the establishment of investment projects, the influence of the\ninteraction between agents in the evolution of the distribution of wealth, as\nwell as the formation of common investment networks and some of their\nproperties. Simulation results show that the wealth distribution presents a\npower law in its tail. Also, it is shown that the trust and reputation\nmechanism presented leads to the establishment of networks among agents, which\npresent some of the typical characteristics of real-life networks like a high\nclustering coefficient and short average path length.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jul 2011 11:15:59 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Navarro-Barrientos", "J. -Emeterio", ""]]}, {"id": "1107.4104", "submitter": "Jiapu Zhang", "authors": "Jiapu Zhang, David Y. Gao, and Johh Yearwood", "title": "A novel canonical dual computational approach for prion AGAAAAGA amyloid\n  fibril molecular modeling", "comments": null, "journal-ref": "J Theor Biol 284 (1) 149-157 (2011); selected by Protein\n  Crystallography Newsletter Volume 3, No. 9, September 2011, Crystallography\n  Times; Prions Research Today Volume 7 Issue 7, July 2011, p.14; the 18th of\n  the Top 25 Hottest Articles (picked up from papers of Jul 2011 to Sept 2011\n  of J Theor Biol)", "doi": "10.1016/j.jtbi.2011.06.024", "report-no": null, "categories": "q-bio.BM cs.CE math-ph math.MP math.OC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Many experimental studies have shown that the prion AGAAAAGA palindrome\nhydrophobic region (113-120) has amyloid fibril forming properties and plays an\nimportant role in prion diseases. However, due to the unstable, noncrystalline\nand insoluble nature of the amyloid fibril, to date structural information on\nAGAAAAGA region (113-120) has been very limited. This region falls just within\nthe N-terminal unstructured region PrP (1-123) of prion proteins. Traditional\nX-ray crystallography and nuclear magnetic resonance (NMR) spectroscopy\nexperimental methods cannot be used to get its structural information. Under\nthis background, this paper introduces a novel approach of the canonical dual\ntheory to address the 3D atomic-resolution structure of prion AGAAAAGA amyloid\nfibrils. The novel and powerful canonical dual computational approach\nintroduced in this paper is for the molecular modeling of prion AGAAAAGA\namyloid fibrils, and that the optimal atomic-resolution structures of prion\nAGAAAAGA amyloid fibils presented in this paper are useful for the drive to\nfind treatments for prion diseases in the field of medicinal chemistry.\nOverall, this paper presents an important method and provides useful\ninformation for treatments of prion diseases. Overall, this paper could be of\ninterest to the general readership of Theoretical Biology.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 23:20:34 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Zhang", "Jiapu", ""], ["Gao", "David Y.", ""], ["Yearwood", "Johh", ""]]}, {"id": "1107.4157", "submitter": "Nizami Gasilov", "authors": "Nizami Gasilov, \\c{S}ahin Emrah Amrahov and Afet Golayo\\u{g}lu\n  Fatullayev", "title": "Linear Differential Equations with Fuzzy Boundary Values", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE math.DS math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, we consider a linear differential equation with fuzzy boundary\nvalues. We express the solution of the problem in terms of a fuzzy set of crisp\nreal functions. Each real function from the solution set satisfies differential\nequation, and its boundary values belong to intervals, determined by the\ncorresponding fuzzy numbers. The least possibility among possibilities of\nboundary values in corresponding fuzzy sets is defined as the possibility of\nthe real function in the fuzzy solution. In order to find the fuzzy solution we\npropose a method based on the properties of linear transformations. We show\nthat, if the corresponding crisp problem has a unique solution then the fuzzy\nproblem has unique solution too. We also prove that if the boundary values are\ntriangular fuzzy numbers, then the value of the solution at any time is also a\ntriangular fuzzy number. We find that the fuzzy solution determined by our\nmethod is the same as the one that is obtained from solution of crisp problem\nby the application of the extension principle. We present two examples\ndescribing the proposed method.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2011 04:46:02 GMT"}], "update_date": "2011-07-22", "authors_parsed": [["Gasilov", "Nizami", ""], ["Amrahov", "Şahin Emrah", ""], ["Fatullayev", "Afet Golayoğlu", ""]]}, {"id": "1107.4264", "submitter": "Michael A. Clark", "authors": "M. A. Clark and P. C. La Plante and L. J. Greenhill", "title": "Accelerating Radio Astronomy Cross-Correlation with Graphics Processing\n  Units", "comments": "Submitted to the International Journal of High Performance Computing\n  Applications (IJHPCA). 36 pages and 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a highly parallel implementation of the cross-correlation of\ntime-series data using graphics processing units (GPUs), which is scalable to\nhundreds of independent inputs and suitable for the processing of signals from\n\"Large-N\" arrays of many radio antennas. The computational part of the\nalgorithm, the X-engine, is implementated efficiently on Nvidia's Fermi\narchitecture, sustaining up to 79% of the peak single precision floating-point\nthroughput. We compare performance obtained for hardware- and software-managed\ncaches, observing significantly better performance for the latter. The high\nperformance reported involves use of a multi-level data tiling strategy in\nmemory and use of a pipelined algorithm with simultaneous computation and\ntransfer of data from host to device memory. The speed of code development,\nflexibility, and low cost of the GPU implementations compared to ASIC and FPGA\nimplementations have the potential to greatly shorten the cycle of correlator\ndevelopment and deployment, for cases where some power consumption penalty can\nbe tolerated.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2011 13:16:30 GMT"}, {"version": "v2", "created": "Mon, 1 Aug 2011 16:51:49 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Clark", "M. A.", ""], ["La Plante", "P. C.", ""], ["Greenhill", "L. J.", ""]]}, {"id": "1107.4918", "submitter": "H. O. Ghaffari", "authors": "H. O. Ghaffari, M. H. B. Nasseri, R. P. Young", "title": "Fluid Flow Complexity in Fracture Networks: Analysis with Graph Theory\n  and LBM", "comments": "ARMA21012-ARMA 12-269", "journal-ref": null, "doi": null, "report-no": "ARMA 12-269", "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Through this research, embedded synthetic fracture networks in rock masses\nare studied. To analysis the fluid flow complexity in fracture networks with\nrespect to the variation of connectivity patterns, two different approaches are\nemployed, namely, the Lattice Boltzmann method and graph theory. The Lattice\nBoltzmann method is used to show the sensitivity of the permeability and fluid\nvelocity distribution to synthetic fracture networks' connectivity patterns.\nFurthermore, the fracture networks are mapped into the graphs, and the\ncharacteristics of these graphs are compared to the main spatial fracture\nnetworks. Among different characteristics of networks, we distinguish the\nmodularity of networks and sub-graphs distributions. We map the flow regimes\ninto the proper regions of the network's modularity space. Also, for each type\nof fluid regime, corresponding motifs shapes are scaled. Implemented power law\ndistributions of fracture length in spatial fracture networks yielded the same\nnode's degree distribution in transformed networks. Two general spatial\nnetworks are considered: random networks and networks with \"hubness\" properties\nmimicking a spatial damage zone (both with power law distribution of fracture\nlength). In the first case, the fractures are embedded in uniformly distributed\nfracture sets; the second case covers spatial fracture zones. We prove\nnumerically that the abnormal change (transition) in permeability is controlled\nby the hub growth rate. Also, comparing LBM results with the characteristic\nmean length of transformed networks' links shows a reverse relationship between\nthe aforementioned parameters. In addition, the abnormalities in advection\nthrough nodes are presented.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jul 2011 12:28:50 GMT"}, {"version": "v2", "created": "Wed, 22 Feb 2012 02:27:35 GMT"}], "update_date": "2012-02-23", "authors_parsed": [["Ghaffari", "H. O.", ""], ["Nasseri", "M. H. B.", ""], ["Young", "R. P.", ""]]}, {"id": "1107.5676", "submitter": "Victor M. Preciado", "authors": "Victor M. Preciado, Ali Jadbabaie, George C. Verghese", "title": "Structural Analysis of Laplacian Spectral Properties of Large-Scale\n  Networks", "comments": "IEEE Automatic Control, accepted for publication", "journal-ref": null, "doi": "10.1109/TAC.2013.2261187", "report-no": null, "categories": "math.OC cs.CE cs.DM cs.SI cs.SY physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using methods from algebraic graph theory and convex optimization, we study\nthe relationship between local structural features of a network and spectral\nproperties of its Laplacian matrix. In particular, we derive expressions for\nthe so-called spectral moments of the Laplacian matrix of a network in terms of\na collection of local structural measurements. Furthermore, we propose a series\nof semidefinite programs to compute bounds on the spectral radius and the\nspectral gap of the Laplacian matrix from a truncated sequence of Laplacian\nspectral moments. Our analysis shows that the Laplacian spectral moments and\nspectral radius are strongly constrained by local structural features of the\nnetwork. On the other hand, we illustrate how local structural features are\nusually not enough to estimate the Laplacian spectral gap.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2011 10:55:39 GMT"}, {"version": "v2", "created": "Sat, 13 Aug 2011 14:23:38 GMT"}, {"version": "v3", "created": "Fri, 7 Sep 2012 13:29:43 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Preciado", "Victor M.", ""], ["Jadbabaie", "Ali", ""], ["Verghese", "George C.", ""]]}, {"id": "1107.5951", "submitter": "Matthew Knepley", "authors": "Dave A. May, Matthew G. Knepley", "title": "Optimal, scalable forward models for computing gravity anomalies", "comments": "38 pages, 13 figures; accepted by Geophysical Journal International", "journal-ref": "Geophysical Journal International, 187(1):161-177, 2011", "doi": "10.1111/j.1365-246X.2011.05167.x", "report-no": null, "categories": "cs.CE cs.DC physics.geo-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe three approaches for computing a gravity signal from a density\nanomaly. The first approach consists of the classical \"summation\" technique,\nwhilst the remaining two methods solve the Poisson problem for the\ngravitational potential using either a Finite Element (FE) discretization\nemploying a multilevel preconditioner, or a Green's function evaluated with the\nFast Multipole Method (FMM). The methods utilizing the PDE formulation\ndescribed here differ from previously published approaches used in gravity\nmodeling in that they are optimal, implying that both the memory and\ncomputational time required scale linearly with respect to the number of\nunknowns in the potential field. Additionally, all of the implementations\npresented here are developed such that the computations can be performed in a\nmassively parallel, distributed memory computing environment. Through numerical\nexperiments, we compare the methods on the basis of their discretization error,\nCPU time and parallel scalability. We demonstrate the parallel scalability of\nall these techniques by running forward models with up to $10^8$ voxels on\n1000's of cores.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jul 2011 12:31:59 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["May", "Dave A.", ""], ["Knepley", "Matthew G.", ""]]}]