[{"id": "0705.1232", "submitter": "Jens Eisert", "authors": "H.M. Wiseman and J. Eisert", "title": "Nontrivial quantum effects in biology: A skeptical physicists' view", "comments": "15 pages, minor typographical errors corrected", "journal-ref": null, "doi": "10.1142/9781848162556_0017", "report-no": null, "categories": "physics.gen-ph q-bio.OT quant-ph", "license": null, "abstract": "  Invited contribution to \"Quantum Aspects of Life\", D. Abbott Ed. (World\nScientific, Singapore, 2007).\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2007 09:00:41 GMT"}, {"version": "v2", "created": "Sun, 27 May 2007 12:13:13 GMT"}], "update_date": "2016-12-21", "authors_parsed": [["Wiseman", "H. M.", ""], ["Eisert", "J.", ""]]}, {"id": "0705.1460", "submitter": "Thomas Maeke", "authors": "Rudolf M. Fuechslin, Thomas Maeke, Uwe Tangen, John S. McCaskill", "title": "Evolving inductive generalization via genetic self-assembly", "comments": null, "journal-ref": "Adv. Complex Syst., Vol. 9, Nos. 1&2 (2006) 1-29", "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.OT", "license": null, "abstract": "  We propose that genetic encoding of self-assembling components greatly\nenhances the evolution of complex systems and provides an efficient platform\nfor inductive generalization, i.e. the inductive derivation of a solution to a\nproblem with a potentially infinite number of instances from a limited set of\ntest examples. We exemplify this in simulations by evolving scalable circuitry\nfor several problems. One of them, digital multiplication, has been intensively\nstudied in recent years, where hitherto the evolutionary design of only\nspecific small multipliers was achieved. The fact that this and other problems\ncan be solved in full generality employing self-assembly sheds light on the\nevolutionary role of self-assembly in biology and is of relevance for the\ndesign of complex systems in nano- and bionanotechnology.\n", "versions": [{"version": "v1", "created": "Thu, 10 May 2007 12:40:14 GMT"}], "update_date": "2007-05-23", "authors_parsed": [["Fuechslin", "Rudolf M.", ""], ["Maeke", "Thomas", ""], ["Tangen", "Uwe", ""], ["McCaskill", "John S.", ""]]}, {"id": "0705.1548", "submitter": "Greg Stephens", "authors": "Greg J Stephens, Bethany Johnson-Kerner, William Bialek and William S\n  Ryu", "title": "Dimensionality and dynamics in the behavior of C. elegans", "comments": "9 pages, 6 figures, minor corrections", "journal-ref": "PLoS Comput Biol 4(4): e1000028 (2008)", "doi": "10.1371/journal.pcbi.1000028", "report-no": null, "categories": "q-bio.OT", "license": null, "abstract": "  A major challenge in analyzing animal behavior is to discover some underlying\nsimplicity in complex motor actions. Here we show that the space of shapes\nadopted by the nematode C. elegans is surprisingly low dimensional, with just\nfour dimensions accounting for 95% of the shape variance, and we partially\nreconstruct \"equations of motion\" for the dynamics in this space. These\ndynamics have multiple attractors, and we find that the worm visits these in a\nrapid and almost completely deterministic response to weak thermal stimuli.\nStimulus-dependent correlations among the different modes suggest that one can\ngenerate more reliable behaviors by synchronizing stimuli to the state of the\nworm in shape space. We confirm this prediction, effectively \"steering\" the\nworm in real time.\n", "versions": [{"version": "v1", "created": "Fri, 11 May 2007 18:40:22 GMT"}, {"version": "v2", "created": "Thu, 17 May 2007 03:55:56 GMT"}], "update_date": "2016-01-05", "authors_parsed": [["Stephens", "Greg J", ""], ["Johnson-Kerner", "Bethany", ""], ["Bialek", "William", ""], ["Ryu", "William S", ""]]}, {"id": "0705.1974", "submitter": "Franco Bagnoli", "authors": "Franco Bagnoli, Pietro Lio, Luca Sguanci", "title": "Risk perception in epidemic modeling", "comments": "6 pages, 6 figures, completely new version", "journal-ref": "Phys. Rev. E 76, 061904 (2007)", "doi": "10.1103/PhysRevE.76.061904", "report-no": null, "categories": "q-bio.PE q-bio.OT", "license": null, "abstract": "  We investigate the effects of risk perception in a simple model of epidemic\nspreading. We assume that the perception of the risk of being infected depends\non the fraction of neighbors that are ill. The effect of this factor is to\ndecrease the infectivity, that therefore becomes a dynamical component of the\nmodel. We study the problem in the mean-field approximation and by numerical\nsimulations for regular, random and scale-free networks.\n  We show that for homogeneous and random networks, there is always a value of\nperception that stops the epidemics. In the ``worst-case'' scenario of a\nscale-free network with diverging input connectivity, a linear perception\ncannot stop the epidemics; however we show that a non-linear increase of the\nperception risk may lead to the extinction of the disease. This transition is\ndiscontinuous, and is not predicted by the mean-field analysis.\n", "versions": [{"version": "v1", "created": "Mon, 14 May 2007 16:16:34 GMT"}, {"version": "v2", "created": "Fri, 18 May 2007 12:54:36 GMT"}, {"version": "v3", "created": "Thu, 23 Aug 2007 15:56:01 GMT"}], "update_date": "2007-12-06", "authors_parsed": [["Bagnoli", "Franco", ""], ["Lio", "Pietro", ""], ["Sguanci", "Luca", ""]]}, {"id": "0705.3612", "submitter": "Christopher Pooley", "authors": "C. M. Pooley, G. P. Alexander, and J. M. Yeomans", "title": "Swimming with a friend at low Reynolds number", "comments": "6 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft cond-mat.other physics.bio-ph q-bio.OT", "license": null, "abstract": "  We investigate the hydrodynamic interactions between microorganisms swimming\nat low Reynolds number. By considering simple model swimmers, and combining\nanalytic and numerical approaches, we investigate the time-averaged flow field\naround a swimmer. At short distances the swimmer behaves like a pump. At large\ndistances the velocity field depends on whether the swimming stroke is\ninvariant under a combined time-reversal and parity transformation. We then\nconsider two swimmers and find that the interaction between them consists of\ntwo parts; a dead term, independent of the motion of the second swimmer, which\ntakes the expected dipolar form and a live term resulting from the simultaneous\nswimming action of both swimmers which does not. We argue that, in general, the\nlatter dominates. The swimmer--swimmer interaction is a complicated function of\ntheir relative displacement, orientation and phase, leading to motion that can\nbe attractive, repulsive or oscillatory.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2007 16:11:59 GMT"}], "update_date": "2007-05-25", "authors_parsed": [["Pooley", "C. M.", ""], ["Alexander", "G. P.", ""], ["Yeomans", "J. M.", ""]]}, {"id": "0705.3724", "submitter": "Liu Quanxing", "authors": "Quan-Xing Liu, Bai-Lian Li and Zhen Jin", "title": "Resonance and frequency-locking phenomena in spatially extended\n  phytoplankton-zooplankton system with additive noise and periodic forces", "comments": "Some typos errors are proof, and some strong relate references are\n  added", "journal-ref": "J. Stat. Mech. (2008) P05011", "doi": "10.1088/1742-5468/2008/05/P05011", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.PS q-bio.OT", "license": null, "abstract": "  In this paper, we present a spatial version of phytoplankton-zooplankton\nmodel that includes some important factors such as external periodic forces,\nnoise, and diffusion processes. The spatially extended\nphytoplankton-zooplankton system is from the original study by Scheffer [M\nScheffer, Fish and nutrients interplay determines algal biomass: a minimal\nmodel, Oikos \\textbf{62} (1991) 271-282]. Our results show that the spatially\nextended system exhibit a resonant patterns and frequency-locking phenomena.\nThe system also shows that the noise and the external periodic forces play a\nconstructive role in the Scheffer's model: first, the noise can enhance the\noscillation of phytoplankton species' density and format a large clusters in\nthe space when the noise intensity is within certain interval. Second, the\nexternal periodic forces can induce 4:1 and 1:1 frequency-locking and spatially\nhomogeneous oscillation phenomena to appear. Finally, the resonant patterns are\nobserved in the system when the spatial noises and external periodic forces are\nboth turned on. Moreover, we found that the 4:1 frequency-locking transform\ninto 1:1 frequency-locking when the noise intensity increased. In addition to\nelucidating our results outside the domain of Turing instability, we provide\nfurther analysis of Turing linear stability with the help of the numerical\ncalculation by using the Maple software. Significantly, oscillations are\nenhanced in the system when the noise term presents. These results indicate\nthat the oceanic plankton bloom may partly due to interplay between the\nstochastic factors and external forces instead of deterministic factors. These\nresults also may help us to understand the effects arising from undeniable\nsubject to random fluctuations in oceanic plankton bloom.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2007 11:38:18 GMT"}, {"version": "v2", "created": "Fri, 7 Dec 2007 08:30:41 GMT"}], "update_date": "2008-05-23", "authors_parsed": [["Liu", "Quan-Xing", ""], ["Li", "Bai-Lian", ""], ["Jin", "Zhen", ""]]}, {"id": "0705.4429", "submitter": "Stefano Marino", "authors": "Stefano Marino", "title": "A successive sub-grouping method for multiple sequence alignments\n  analysis", "comments": "11 pages, 7 figures, the M_Al program is downloadable at\n  http://xoomer.alice.it/marinostefano/", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  A novel approach to protein multiple sequence alignment is discussed:\nsubstantially this method counterparts with substitution matrix based methods\n(like Blosum or PAM based methods), and implies a more deterministic approach\nto chemical/physical sub-grouping of amino acids . Amino acids (aa) are divided\ninto sub-groups with successive derivations, that result in a clustering based\non the considered property. The properties can be user defined or chosen\nbetween default schemes, like those used in the analysis described here.\nStarting from an initial set of the 20 naturally occurring amino acids, they\nare successively divided on the basis of their polarity/hydrophobic index, with\nincreasing resolution up to four level of subdivision. Other schemes of\nsubdivision are possible: in this thesis work it was employed also a scheme\nbased on physical/structural properties (solvent exposure, lateral chain\nmobility and secondary structure tendency), that have been compared to the\nchemical scheme with testing purposes. In the method described in this chapter,\nthe total score for each position in the alignment accounts for different\ndegree of similarity between amino acids. The scoring value result form the\ncontribution of each level of selectivity for every individual property\nconsidered. Simply the method (called M_Al) analyse the n sequence alignment\nposition per position and assigns a score which have contributes by aa identity\nplus a composed valuation of the chemical or of the structural affinity between\nthe n aligned amino acids. This method has been implemented in a series of\nprograms written in python language; these programs have been tested in some\nbiological cases, with benchmark purposes.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2007 16:55:59 GMT"}, {"version": "v2", "created": "Wed, 30 May 2007 21:51:07 GMT"}, {"version": "v3", "created": "Thu, 7 Jun 2007 17:34:11 GMT"}], "update_date": "2007-06-07", "authors_parsed": [["Marino", "Stefano", ""]]}, {"id": "0705.4635", "submitter": "Thierry Emonet", "authors": "Thierry Emonet and Philippe Cluzel", "title": "Relationship between cellular response and behavioral variability in\n  bacterial chemotaxis", "comments": "15 pages, 4 figures, Supporting information available here\n  http://cluzel.uchicago.edu/data/emonet/arxiv_070531_supp.pdf", "journal-ref": null, "doi": "10.1073/pnas.0705463105", "report-no": null, "categories": "q-bio.MN q-bio.CB q-bio.OT", "license": null, "abstract": "  Bacterial chemotaxis in Escherichia coli is a canonical system for the study\nof signal transduction. A remarkable feature of this system is the coexistence\nof precise adaptation in population with large fluctuating cellular behavior in\nsingle cells (Korobkova et al. 2004, Nature, 428, 574). Using a stochastic\nmodel, we found that the large behavioral variability experimentally observed\nin non-stimulated cells is a direct consequence of the architecture of this\nadaptive system. Reversible covalent modification cycles, in which methylation\nand demethylation reactions antagonistically regulate the activity of\nreceptor-kinase complexes, operate outside the region of first-order kinetics.\nAs a result, the receptor-kinase that governs cellular behavior exhibits a\nsigmoidal activation curve. This curve simultaneously amplifies the inherent\nstochastic fluctuations in the system and lengthens the relaxation time in\nresponse to stimulus. Because stochastic fluctuations cause large behavioral\nvariability and the relaxation time governs the average duration of runs in\nresponse to small stimuli, cells with the greatest fluctuating behavior also\ndisplay the largest chemotactic response. Finally, Large-scale simulations of\ndigital bacteria suggest that the chemotaxis network is tuned to simultaneously\noptimize the random spread of cells in absence of nutrients and the cellular\nresponse to gradients of attractant.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2007 16:05:09 GMT"}], "update_date": "2019-08-19", "authors_parsed": [["Emonet", "Thierry", ""], ["Cluzel", "Philippe", ""]]}]