[{"id": "0706.0163", "submitter": "Alexander K. Vidybida", "authors": "Alexander K. Vidybida", "title": "Output Stream of Binding Neuron with Feedback", "comments": "Version #1: 4 pages, 5 figures, manuscript submitted to Biological\n  Cybernetics. Version #2 (this version): added 3 pages of new text with\n  additional analytical and numerical calculations, 2 more figures, 11 more\n  references, added Discussion section", "journal-ref": "Eur. Phys. J. B 65, 577-584 (2008); Eur. Phys. J. B 69, 313 (2009)", "doi": "10.1140/epjb/e2008-00360-1", "report-no": null, "categories": "q-bio.NC q-bio.OT", "license": null, "abstract": "  The binding neuron model is inspired by numerical simulation of\nHodgkin-Huxley-type point neuron, as well as by the leaky integrate-and-fire\nmodel. In the binding neuron, the trace of an input is remembered for a fixed\nperiod of time after which it disappears completely. This is in the contrast\nwith the above two models, where the postsynaptic potentials decay\nexponentially and can be forgotten only after triggering. The finiteness of\nmemory in the binding neuron allows one to construct fast recurrent networks\nfor computer modeling. Recently, the finiteness is utilized for exact\nmathematical description of the output stochastic process if the binding neuron\nis driven with the Poissonian input stream. In this paper, the simplest\nnetworking is considered for binding neuron. Namely, it is expected that every\noutput spike of single neuron is immediately fed into its input. For this\nconstruction, externally fed with Poissonian stream, the output stream is\ncharacterized in terms of interspike interval probability density distribution\nif the binding neuron has threshold 2. For higher thresholds, the distribution\nis calculated numerically. The distributions are compared with those found for\nbinding neuron without feedback, and for leaky integrator. Sample distributions\nfor leaky integrator with feedback are calculated numerically as well. It is\noncluded that even the simplest networking can radically alter spikng\nstatistics. Information condensation at the level of single neuron is\ndiscussed.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2007 14:20:19 GMT"}, {"version": "v2", "created": "Tue, 25 Sep 2007 15:00:26 GMT"}], "update_date": "2011-07-20", "authors_parsed": [["Vidybida", "Alexander K.", ""]]}, {"id": "0706.0349", "submitter": "Nabanita Dasgupta-Schubert", "authors": "N. Dasgupta-Schubert (UMSNH), S. Alexander (SWU), L. Sommer (SWU), T.\n  Whelan (UTPA), R. Alfaro Cuevas Villanueva (UMSNH), M. E. Mendez Lopez\n  (UMSNH), M. W. Persans (UTPA)", "title": "The Light Quanta Modulated Physiological Response of Brassica Juncea\n  Seedlings Subjected to Ni(II) Stress", "comments": "9 pages, 7 figures, PDF file only. Based on a lecture presented by N.\n  Dasgupta-Schubert at the ISEB/ESEB/JSEB International Symposium on\n  Environmental Biotechnology in Leipzig, Germany, July 9-13, 2006", "journal-ref": "Engineering in the Life Sciences, 7(3), 259-267 (2007)", "doi": null, "report-no": null, "categories": "q-bio.OT", "license": null, "abstract": "  This work is a study of the inter-relationship between parameters that\nprincipally affect metal up-take in the plant. The relationships between the\nconcentration of metal in the growth medium, Cs, the concentration of metal\nabsorbed by the plant, Cp, and the total biomass achieved, M, all of which are\nfactors relevant to the efficiency of phytoremediation of the plant, have been\ninvestigated via the macro-physiological response of Brassica juncea seedlings\nto Ni(II) stress. The factorial growth experiments treated the Ni(II)\nconcentration in the agar gel and the diurnal light quanta (DLQ) as\nindependently variable parameters. Observations included the evidence of light\nenhancement of Ni toxicity at the root as well as at the whole plant level, the\nshoot mass index as a possible indicator of shoot metal sequestration in B.\njuncea, the logarithmic variation of Cp with Cs and the power-law dependence of\nM on Cp. The sum total of these observations indicate that for the metal\naccumulator B. juncea with regard to its capacity to accumulate Ni, the overall\nmetabolic nature of the plant is important; neither rapid biomass increase nor\na high metal concentration capability favor the removal of high metal mass from\nthe medium, but rather the plant with the moderate photosynthetically driven\nbiomass growth and moderate metal concentrations demonstrated the ability to\nremove the maximum mass of metal from the medium. The implications of these\nobservations in the context of the perceived need in phytoremediation\nengineering to maximize Cp and M simultaneously in the same plant, are\ndiscussed.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jun 2007 21:00:45 GMT"}], "update_date": "2007-06-05", "authors_parsed": [["Dasgupta-Schubert", "N.", "", "UMSNH"], ["Alexander", "S.", "", "SWU"], ["Sommer", "L.", "", "SWU"], ["Whelan", "T.", "", "UTPA"], ["Villanueva", "R. Alfaro Cuevas", "", "UMSNH"], ["Lopez", "M. E. Mendez", "", "UMSNH"], ["Persans", "M. W.", "", "UTPA"]]}, {"id": "0706.1293", "submitter": "Natalia Kudryavtseva", "authors": "N.P. Bondar, I.L. Kovalenko, D.F. Avgustinovich, N.N. Kudryavtseva", "title": "Influence of experimental context on the development of anhedonia in\n  male mice imposed to chronic social stress", "comments": "9 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  Anhedonia is one of the key symptoms of depression in humans. Consumption of\n1% sucrose solution supplemented with 0.2% vanillin was studied in two\nexperimental contexts in male mice living under chronic social stress induced\nby daily experience of defeats in agonistic interactions and leading to\ndevelopment of depression. In the first experiment, vanillin sucrose solution\nwas made available as an option of water during 10 days to mice living in group\nhome cages. Then the mice were subjected to social defeat stress and during\nstress exposure they were provided with both vanillin sucrose solution and\nwater using a free two bottles choice paradigm. In the other experiment,\nvanillin sucrose solution were first offered to mice after 8 days of exposure\nto social defeat stress. Males familiar with vanillin sucrose solution showed\nvanillin sucrose preference while experiencing defeat stress: consumption of\nvanillin sucrose solution was about 70% of total liquid consumption. However,\nthe consumption of vanillin sucrose solution per gram of body weight in mice\nimposed to social stress during 20 days was significantly lower than in control\nmales. In the second experiment, males after 8 days of social defeat stress\nwere found to consume significantly less vanillin sucrose solution as compared\nwith control males. On average during two weeks of measurements, vanillin\nsucrose solution intake was less than 20% of total liquid consumption in males\nwith symptoms of depression and anxiety. Consumption per gram of body weight\nalso appeared to be significantly lower than in control group. Influence of the\nexperimental context on the development of anhedonia, which was measured by the\nreduction in sucrose solution intake by chronically stressed male mice, has\nbeen discussed.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jun 2007 08:12:55 GMT"}, {"version": "v2", "created": "Sat, 16 Jun 2007 08:20:15 GMT"}, {"version": "v3", "created": "Sat, 10 May 2008 08:45:09 GMT"}], "update_date": "2008-05-10", "authors_parsed": [["Bondar", "N. P.", ""], ["Kovalenko", "I. L.", ""], ["Avgustinovich", "D. F.", ""], ["Kudryavtseva", "N. N.", ""]]}, {"id": "0706.2328", "submitter": "Ophir Flomenbom", "authors": "Ophir Flomenbom, Robert J. Silbey", "title": "Unique mechanisms from finite two-state trajectories", "comments": null, "journal-ref": "E. Barkai, F. L. H. Brown, M. Orrit & H. Yang Eds. THEORY AND\n  EVALUATION OF SINGLE-MOLECULE SIGNALS, (October, 2008)", "doi": null, "report-no": null, "categories": "q-bio.QM cond-mat.other q-bio.OT", "license": null, "abstract": "  Single molecule data made of on and off events are ubiquitous. Famous\nexamples include enzyme turnover, probed via fluorescence, and opening and\nclosing of ion-channel, probed via the flux of ions. The data reflects the\ndynamics in the underlying multi-substate on-off kinetic scheme (KS) of the\nprocess, but the determination of the underlying KS is difficult, and sometimes\neven impossible, due to the loss of information in the mapping of the\nmutli-dimensional KS onto two dimensions. A way to deal with this problem\nconsiders canonical (unique) forms. (Unique canonical form is constructed from\nan infinitely long trajectory, but many KSs.) Here we introduce canonical forms\nof reduced dimensions that can handle any KS (i.e. also KSs with symmetry and\nirreversible transitions). We give the mapping of KSs into reduced dimensions\nforms, which is based on topology of KSs, and the tools for extracting the\nreduced dimensions form from finite data. The canonical forms of reduced\ndimensions constitute a powerful tool in discriminating between KSs.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2007 16:17:11 GMT"}, {"version": "v2", "created": "Fri, 31 Aug 2007 22:27:44 GMT"}], "update_date": "2010-08-16", "authors_parsed": [["Flomenbom", "Ophir", ""], ["Silbey", "Robert J.", ""]]}, {"id": "0706.3211", "submitter": "Ophir Flomenbom", "authors": "O. Flomenbom and R. J. Silbey", "title": "Path probability density functions for semi-Markovian random walks", "comments": null, "journal-ref": "Phys. Rev. E 76, 041101 (2007)", "doi": "10.1103/PhysRevE.76.041101", "report-no": null, "categories": "math-ph math.MP physics.bio-ph q-bio.OT", "license": null, "abstract": "  In random walks, the path representation of the Green's function is an\ninfinite sum over the length of path probability density functions (PDFs). Here\nwe derive and solve, in Laplace space, the recursion relation for the n order\npath PDF for any arbitrarily inhomogeneous semi-Markovian random walk in a\none-dimensional (1D) chain of L states. The recursion relation relates the n\norder path PDF to L/2 (round towards zero for an odd L) shorter path PDFs, and\nhas n independent coefficients that obey a universal formula. The z transform\nof the recursion relation straightforwardly gives the generating function for\npath PDFs, from which we obtain the Green's function of the random walk, and\nderive an explicit expression for any path PDF of the random walk. These\nexpressions give the most detailed description of arbitrarily inhomogeneous\nsemi-Markovian random walks in 1D.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2007 19:53:37 GMT"}], "update_date": "2019-08-19", "authors_parsed": [["Flomenbom", "O.", ""], ["Silbey", "R. J.", ""]]}, {"id": "0706.3676", "submitter": "Marcin Molski", "authors": "Marcin Molski and Jerzy Konarski", "title": "On the Gompertzian dynamics of growth and self-organization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  Comment on the Waliszewski's article \"A principle of fractal-sto-chastic\ndualism and Gompertzian dynamics of growth and self-organization\" (BioSystems\n82 (2005)61-73) is presented. It has been proved that the main idea of this\nwork that Gompertzian dynamics is governed by the Schr\\\"{o}dinger-like equation\nincluding anharmonic Morse potential has been already introduced by Molski and\nKonarski in 2003. Some inconsistencies and mathematical errors in the\nWaliszewski's model are also pointed out.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 17:11:09 GMT"}], "update_date": "2007-06-26", "authors_parsed": [["Molski", "Marcin", ""], ["Konarski", "Jerzy", ""]]}, {"id": "0706.3681", "submitter": "Marcin Molski", "authors": "Marcin Molski", "title": "On the Classification Scheme for Phenomenological Universalities in\n  Growth Problems in Physics and Other Sciences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  Comment on \"Classification Scheme for Phenomenological Universalities in\nGrowth Problems in Physics and Other Sciences\" by P. Castorina, P. P. Delsanto\nand C. Guiot, Phys. Rev. Lett. {\\bf 96}, 188701 (2006) is presented. It has\nbeen proved that the West-like function of growth derived by the authors is\nincorrect and the approach does not take into account the growth of the\nbiological systems undergoing atrophy or demographic and economic systems\nundergoing involution or regression. A simple extension of the model, which\npermits derivation of the so far unknown involuted Gompertz function of growth\nis proposed.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2007 17:40:10 GMT"}], "update_date": "2007-06-26", "authors_parsed": [["Molski", "Marcin", ""]]}]