[{"id": "0707.1238", "submitter": "V. Moskovkin", "authors": "M. B. Manuylov, I. I. Mavrov, and V. M. Moskovkin", "title": "Infected surfaces of vehicles as possible way of people's infection by\n  bird flu pathogenic culture", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": null, "abstract": "  Possible variant of people's infection by bird flu pathogenic culture in\npassing of everyday infection is presented in the work: through the contact of\nopen parts of the skin with infected surfaces of the vehicle, that is the\nsequent of the reused water, which contains all species spectrum of pathogen\naccumulated on the urban areas, used in process of washing\n", "versions": [{"version": "v1", "created": "Mon, 9 Jul 2007 12:21:20 GMT"}], "update_date": "2007-07-10", "authors_parsed": [["Manuylov", "M. B.", ""], ["Mavrov", "I. I.", ""], ["Moskovkin", "V. M.", ""]]}, {"id": "0707.1672", "submitter": "Jesus Gomez-Gardenes", "authors": "J. Gomez-Gardenes, V. Latora, Y. Moreno and E.V. Profumo", "title": "Spreading of sexually transmitted diseases in heterosexual populations", "comments": "7 pages, 3 figures and 2 tables", "journal-ref": "Proceedings of the National Academy of Sciences (USA) 105, 1399\n  (2008)", "doi": "10.1073/pnas.0707332105", "report-no": null, "categories": "physics.soc-ph physics.bio-ph q-bio.OT", "license": null, "abstract": "  The spread of sexually transmitted diseases (e.g. Chlamydia, Syphilis,\nGonorrhea, HIV) across populations is a major concern for scientists and health\nagencies. In this context, both data collection on sexual contact networks and\nthe modeling of disease spreading, are intensively contributing to the search\nfor effective immunization policies. Here, the spreading of sexually\ntransmitted diseases on bipartite scale-free graphs, representing heterosexual\ncontact networks, is considered. We analytically derive the expression for the\nepidemic threshold and its dependence with the system size in finite\npopulations. We show that the epidemic outbreak in bipartite populations, with\nnumber of sexual partners distributed as in empirical observations from\nnational sex surveys, takes place for larger spreading rates than for the case\nin which the bipartite nature of the network is not taken into account.\nNumerical simulations confirm the validity of the theoretical results. Our\nfindings indicate that the restriction to crossed infections between the two\nclasses of individuals (males and females) has to be taken into account in the\ndesign of efficient immunization strategies for sexually transmitted diseases.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2007 18:03:02 GMT"}, {"version": "v2", "created": "Thu, 7 Feb 2008 14:56:04 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Gomez-Gardenes", "J.", ""], ["Latora", "V.", ""], ["Moreno", "Y.", ""], ["Profumo", "E. V.", ""]]}, {"id": "0707.2011", "submitter": "Negadi Tidjani none", "authors": "Tidjani Negadi", "title": "The genetic code multiplet structure, in one number", "comments": "9 pages", "journal-ref": "Symmetry: Culture and Science, Volume 18, Numbers 2-3, pages\n  149-160 (2007)", "doi": null, "report-no": null, "categories": "q-bio.OT", "license": null, "abstract": "  The standard genetic code multiplet structure as well as the correct\ndegeneracies, class by class, are all extracted from the (unique) number 23,\nthe order of the permutation group of 23 objects.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jul 2007 13:58:01 GMT"}], "update_date": "2008-09-01", "authors_parsed": [["Negadi", "Tidjani", ""]]}, {"id": "0707.3043", "submitter": "Branko Dragovich", "authors": "Branko Dragovich and Alexandra Dragovich", "title": "p-Adic Modelling of the Genome and the Genetic Code", "comments": "26 pages. Submitted to the Computer Journal for a special issue", "journal-ref": "The Computer Journal 53 (2010) 432-442", "doi": "10.1093/comjnl/bxm083", "report-no": null, "categories": "q-bio.OT cs.IT math.IT physics.bio-ph", "license": null, "abstract": "  The present paper is devoted to foundations of p-adic modelling in genomics.\nConsidering nucleotides, codons, DNA and RNA sequences, amino acids, and\nproteins as information systems, we have formulated the corresponding p-adic\nformalisms for their investigations. Each of these systems has its\ncharacteristic prime number used for construction of the related information\nspace. Relevance of this approach is illustrated by some examples. In\nparticular, it is shown that degeneration of the genetic code is a p-adic\nphenomenon. We have also put forward a hypothesis on evolution of the genetic\ncode assuming that primitive code was based on single nucleotides and\nchronologically first four amino acids. This formalism of p-adic genomic\ninformation systems can be implemented in computer programs and applied to\nvarious concrete cases.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jul 2007 11:20:34 GMT"}], "update_date": "2010-12-01", "authors_parsed": [["Dragovich", "Branko", ""], ["Dragovich", "Alexandra", ""]]}, {"id": "0707.3224", "submitter": "Rudolf A. Roemer", "authors": "G. Cuniberti, E. Macia, A. Rodriguez, R. A. R\\\"omer", "title": "Tight-binding modeling of charge migration in DNA devices", "comments": "24 PDF pages of Springer SVMult LaTeX (included), ISBN-10:\n  3540724931, ISBN-13: 978-3540724933", "journal-ref": "in \"Charge Migration in DNA: Perspectives from Physics, Chemistry\n  and Biology\" (T. Chakraborty, Ed.), Springer Verlag, Berlin, pp. 1-21 (2007),\n  ISBN: 978-3-540-72493-3", "doi": "10.1007/978-3-540-72494-0_1", "report-no": null, "categories": "q-bio.GN cond-mat.soft q-bio.OT", "license": null, "abstract": "  Long range charge transfer experiments in DNA oligomers and the subsequently\nmeasured -- and very diverse -- transport response of DNA wires in solid state\nexperiments exemplifies the need for a thorough theoretical understanding of\ncharge migration in DNA-based natural and artificial materials. Here we present\na review of tight-binding models for DNA conduction which have the intrinsic\nmerit of containing more structural information than plain rate-equation models\nwhile still retaining sufficient detail of the electronic properties. This\nallows for simulations of transport properties to be more manageable with\nrespect to density functional theory methods or correlated first principle\nalgorithms.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jul 2007 19:53:08 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Cuniberti", "G.", ""], ["Macia", "E.", ""], ["Rodriguez", "A.", ""], ["Römer", "R. A.", ""]]}, {"id": "0707.3642", "submitter": "Joshua E. S. Socolar", "authors": "Andre S. Ribeiro, Stuart A. Kauffman, Jason Lloyd-Price, Bj\\\"orn\n  Samuelsson and Joshua E. S. Socolar", "title": "Mutual information in random Boolean models of regulatory networks", "comments": "11 pages, 6 figures; Minor revisions for clarity and figure format,\n  one reference added", "journal-ref": null, "doi": "10.1103/PhysRevE.77.011901", "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  The amount of mutual information contained in time series of two elements\ngives a measure of how well their activities are coordinated. In a large,\ncomplex network of interacting elements, such as a genetic regulatory network\nwithin a cell, the average of the mutual information over all pairs <I> is a\nglobal measure of how well the system can coordinate its internal dynamics. We\nstudy this average pairwise mutual information in random Boolean networks\n(RBNs) as a function of the distribution of Boolean rules implemented at each\nelement, assuming that the links in the network are randomly placed. Efficient\nnumerical methods for calculating <I> show that as the number of network nodes\nN approaches infinity, the quantity N<I> exhibits a discontinuity at parameter\nvalues corresponding to critical RBNs. For finite systems it peaks near the\ncritical value, but slightly in the disordered regime for typical parameter\nvariations. The source of high values of N<I> is the indirect correlations\nbetween pairs of elements from different long chains with a common starting\npoint. The contribution from pairs that are directly linked approaches zero for\ncritical networks and peaks deep in the disordered regime.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2007 21:51:15 GMT"}, {"version": "v2", "created": "Thu, 15 Nov 2007 20:43:11 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Ribeiro", "Andre S.", ""], ["Kauffman", "Stuart A.", ""], ["Lloyd-Price", "Jason", ""], ["Samuelsson", "Björn", ""], ["Socolar", "Joshua E. S.", ""]]}, {"id": "0707.3671", "submitter": "Natalia Kudryavtseva", "authors": "N. N. Kudryavtseva, D. F. Avgustinovich, N. P. Bondar, M. V.\n  Tenditnik, I. L. Kovalenko, L. A. Koryakina", "title": "New method for the study of psychotropic drug effects under simulated\n  clinical conditions", "comments": "15 pages, 9 figures, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.QM", "license": null, "abstract": "  The sensory contact model allows forming different psychopathological states\n(anxious depression, catalepsy, social withdrawal, pathological aggression,\nhypersensitivity, cognition disturbances, anhedonia, alcoholism etc.) produced\nby repeated agonistic interactions in male mice and investigating the\ntherapeutic and preventive properties of any drug as well as its efficiency\nunder simulated clinical conditions. This approach can be useful for a better\nunderstanding of the drugs' action in different stages of disease development\nin individuals. It is suggested that this pharmacological approach may be\napplied for the screening of different novel psychotropic drugs.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2007 05:56:18 GMT"}, {"version": "v2", "created": "Wed, 21 May 2008 10:03:51 GMT"}], "update_date": "2008-05-21", "authors_parsed": [["Kudryavtseva", "N. N.", ""], ["Avgustinovich", "D. F.", ""], ["Bondar", "N. P.", ""], ["Tenditnik", "M. V.", ""], ["Kovalenko", "I. L.", ""], ["Koryakina", "L. A.", ""]]}]