[{"id": "0710.4235", "submitter": "George F. R. Ellis", "authors": "G. Auletta, G. F. R. Ellis, and L. Jaeger", "title": "Top-Down Causation by Information Control: From a Philosophical Problem\n  to a Scientific Research Program", "comments": "Revised version to meet referee's comments, and responding to a paper\n  by Wegscheid et al that was not mentioned in the previous version. 23 pages,\n  9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": null, "abstract": "  It has been claimed that different types of causes must be considered in\nbiological systems, including top-down as well as same-level and bottom-up\ncausation, thus enabling the top levels to be causally efficacious in their own\nright. To clarify this issue, important distinctions between information and\nsigns are introduced here and the concepts of information control and\nfunctional equivalence classes in those systems are rigorously defined and used\nto characterise when top down causation by feedback control happens, in a way\nthat is testable. The causally significant elements we consider are equivalence\nclasses of lower level processes, realised in biological systems through\ndifferent operations having the same outcome within the context of information\ncontrol and networks.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2007 10:59:08 GMT"}, {"version": "v2", "created": "Fri, 18 Jan 2008 08:38:25 GMT"}], "update_date": "2011-11-10", "authors_parsed": [["Auletta", "G.", ""], ["Ellis", "G. F. R.", ""], ["Jaeger", "L.", ""]]}, {"id": "0710.5423", "submitter": "Paolo Tieri", "authors": "Paolo Tieri", "title": "The immune system: look who's talking", "comments": "8 pages, from \"Biocomplexity, a paradigm useful for other\n  disciplines?\", International Italo-Canadian workshop, Bologna, Italy, 13-15\n  July 2005. Added references for section X.5; corrected typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": null, "abstract": "  Human language and its governing rules present a number of analogies with the\norganization and structure of communication and information management in\nliving organisms. This chapter will provide a short general introduction about\ngrammar, as well as a brief explanation on how linguistic approaches\neffectively contaminate scientific practice, and, finally, how they can also\nprovide systems biology with further tools and paradigms to analyse emergent\nbehaviours and interactions among the components of a biological system.\n", "versions": [{"version": "v1", "created": "Mon, 29 Oct 2007 13:27:23 GMT"}, {"version": "v2", "created": "Wed, 14 May 2008 10:28:19 GMT"}], "update_date": "2008-05-14", "authors_parsed": [["Tieri", "Paolo", ""]]}]