[{"id": "0907.0040", "submitter": "Karo Michaelian", "authors": "K. Michaelian", "title": "Thermodynamic Function of Life", "comments": "19 pages, no figures, new evidences, new calculations, new references", "journal-ref": "Hydrol. Earth Syst. Sci., 16, 2629-2645, 2012", "doi": "10.5194/hess-16-2629-2012", "report-no": null, "categories": "physics.gen-ph physics.ao-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Darwinian Theory depicts life as being overwhelmingly consumed by a fight for\nsurvival in a hostile environment. However, from a thermodynamic perspective,\nlife is a dynamic, out of equilibrium process, stabilizing and coevolving in\nconcert with its abiotic environment. The living component of the biosphere of\ngreatest mass, the plants and cyanobacteria, are involved in the transpiration\nof vast amounts of water. Transpiration is part of the global water cycle, and\nit is this cycle that distinguishes Earth from its apparently life barren\nneighboring planets, Venus and Mars. The water cycle, including the absorption\nof sunlight in the biosphere, is by far the greatest entropy producing process\noccurring on Earth. Life, from this perspective, can therefore be viewed as\nperforming an important thermodynamic function; acting as a dynamic catalyst by\naiding process such as the water cycle, hurricanes, and ocean and wind currents\nto produce entropy. The role of animals in this view is that of unwitting but\ndedicated servants of the plants and cyanobacteria, helping them to grow and to\nspread into initially inhospitable areas.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2009 23:56:37 GMT"}, {"version": "v2", "created": "Thu, 24 Dec 2009 02:28:53 GMT"}], "update_date": "2014-03-03", "authors_parsed": [["Michaelian", "K.", ""]]}, {"id": "0907.0042", "submitter": "Karo Michaelian", "authors": "K. Michaelian", "title": "Thermodynamic Origin of Life", "comments": "15 pages, no figures, new section comparing new theory with\n  traditional theories, new evidence, new references", "journal-ref": "Earth Syst. Dynam., 2, 37-51, 2011", "doi": "10.5194/esd-2-37-2011", "report-no": null, "categories": "physics.gen-ph physics.ao-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the thermodynamic function of life may shed light on its\norigin. Life, as are all irreversible processes, is contingent on entropy\nproduction. Entropy production is a measure of the rate of the tendency of\nNature to explore available microstates. The most important irreversible\nprocess generating entropy in the biosphere, and thus facilitating this\nexploration, is the absorption and transformation of sunlight into heat. Here\nwe hypothesize that life began, and persists today, as a catalyst for the\nabsorption and dissipation of sunlight at the surface of shallow seas. The\nresulting heat is then efficiently harvested by other irreversible processes\nsuch as the water cycle, hurricanes, and ocean and wind currents. RNA and DNA\nare the most efficient of all known molecules for absorbing the intense\nultraviolet light that could have penetrated the dense early atmosphere, and\nare remarkably rapid in transforming this light into heat in the presence of\nliquid water. From this perspective, the origin and evolution of life,\ninseparable from water and the water cycle, can be understood as resulting from\nthe natural thermodynamic imperative of increasing the entropy production of\nthe Earth in its interaction with its solar environment. A mechanism is\nproposed for the reproduction of RNA and DNA without the need for enzymes,\npromoted instead through UV light dissipation and the ambient conditions of\nprebiotic Earth.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jul 2009 00:06:21 GMT"}, {"version": "v2", "created": "Thu, 24 Dec 2009 02:37:44 GMT"}, {"version": "v3", "created": "Wed, 8 Sep 2010 19:05:13 GMT"}], "update_date": "2014-03-03", "authors_parsed": [["Michaelian", "K.", ""]]}, {"id": "0907.2492", "submitter": "Stuart Kauffman", "authors": "Stuart Kauffman", "title": "Towards a Post Reductionist Science: The Open Universe", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.hist-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper I discuss the reality that deductive inference is not the only\nway we explain in science. I discuss the role of the opportunity for an\nadaptation in the biosphere and claim that such an opportunity is a 'blind\nfinal cause', not an efficient cause, yet shapes evolution. I also argue that\nDarwinian exaptations are not describable by sufficient natural law. Based on\nan argument of Sir Karl Popper, I claim that no law, or function, f, maps a\ndecoherence process in a Special Relativity setting from a specific space-time\nslice into its future. If true this suggests there can be no theory of\neverything entailing all that happens. I then discuss whether we can view laws\nas 'enabling constraints' and what they enable. Finally, in place of the weak\nAnthropic principle in a multiverse, I suggest that we might consider Darwin\nall the way down. It is not impossible that a single universe has an abiotic\nnatural selection process for laws as enabling constraints and that the single\nuniverse that 'wins' is ours. One possible criterion of winning might be 'most\nrapid growth of the Adjacent Possible of the universe'.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jul 2009 05:28:19 GMT"}], "update_date": "2009-07-16", "authors_parsed": [["Kauffman", "Stuart", ""]]}, {"id": "0907.3537", "submitter": "Felix Filatov P.", "authors": "Felix Filatov", "title": "A Molecular Mass Gradient is the Key Parameter of the Genetc Code\n  Organization", "comments": "9 pages including 6 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.BM q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The structure of the genetic code is discussed in formal terms. A rectangular\ntable of the code (\"the code matrix\"), whose properties reveal its arithmetical\ncontent tagged with the information symbols in several notations. New\nparameters used to analyze of the code matrix, the serial numbers of the\nencoded products and coding elements, ordered by molecular mass. The structural\nsimilarity of the amino acid sequences corresponding to two aminoacyl tRNA\nsynthetases classes is found. The code matrix shows how can be organized the\nso-called second genetic code. The symmetrical pattern of the matrix is\nsupported with the other parameters; it also serves as a basis to construct a\n3D model of the genetic code which follows the structure of the simplest Plato\nsolid, tetrahedron. The reasons for this unusual structure of the genetic code\nremains unclear.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jul 2009 04:34:37 GMT"}], "update_date": "2009-07-22", "authors_parsed": [["Filatov", "Felix", ""]]}, {"id": "0907.3964", "submitter": "Alexei Koulakov", "authors": "Alexei A. Koulakov, Armen G. Enikolopov, and Dmitry Rinberg", "title": "The structure of human olfactory space", "comments": "7 pages, 4 figures, 1 table. Includes Supplementary Material", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the psychophysical responses of human observers to an ensemble of\nmonomolecular odorants. Each odorant is characterized by a set of 146\nperceptual descriptors obtained from a database of odor character profiles.\nEach odorant is therefore represented by a point in highly multidimensional\nsensory space. In this work we study the arrangement of odorants in this\nperceptual space. We argue that odorants densely sample a two-dimensional\ncurved surface embedded in the multidimensional sensory space. This surface can\naccount for more than half of the variance of the psychophysical data. We also\nshow that only 12 percent of experimental variance cannot be explained by\ncurved surfaces of substantially small dimensionality (<10). We suggest that\nthese curved manifolds represent the relevant spaces sampled by the human\nolfactory system, thereby providing surrogates for olfactory sensory space. For\nthe case of 2D approximation, we relate the two parameters on the curved\nsurface to the physico-chemical parameters of odorant molecules. We show that\none of the dimensions is related to eigenvalues of the molecule connectivity\nmatrix, while the other is correlated with measures of the molecule polarity.\nWe discuss the behavioral significance of these findings.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2009 05:07:02 GMT"}], "update_date": "2009-07-24", "authors_parsed": [["Koulakov", "Alexei A.", ""], ["Enikolopov", "Armen G.", ""], ["Rinberg", "Dmitry", ""]]}]