[{"id": "1011.0449", "submitter": "Raul Isea", "authors": "Raul Isea", "title": "Identificaci\\'on de nuevos medicamentos a trav\\'es de m\\'etodos\n  computacionales", "comments": "20 pages, 4 figures, Spanish paper", "journal-ref": "Revista del Instituto Nacional de Higiene Rafael Rangel (2010)\n  Vol. 41(1), pp: 43-49", "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Resumen: El desarrollo de nuevos medicamentos es un problema complejo que\ncarece de una soluci\\'on \\'unica y autom\\'atica desde un punto de vista\ncomputacional, debido a la carencia de programas que permitan manejar grandes\nvol\\'umenes de informaci\\'on que est\\'an distribuidos a lo largo de todo el\nmundo entre m\\'ultiples bases de datos. Por ello se describe una metodolog\\'ia\nque permita realizar experimentos in silico para la identificaci\\'on actual de\nnuevos medicamentos.\n  Abstract: The development of new drugs is a problem that nowadays has no\nsolution in terms of computational power due to the lack of software for\nhandling the big volume of available information; besides, these data are\nstored in multiple formats and are distributed all around the world. To resolve\nthat, a development of an in silico drug design methodology.\n", "versions": [{"version": "v1", "created": "Mon, 1 Nov 2010 20:57:56 GMT"}], "update_date": "2010-11-03", "authors_parsed": [["Isea", "Raul", ""]]}, {"id": "1011.0466", "submitter": "Thomas Butler", "authors": "Thomas Butler, Nigel Goldenfeld", "title": "Fluctuation-driven Turing patterns", "comments": "Minor changes to manuscript", "journal-ref": null, "doi": "10.1103/PhysRevE.84.011112", "report-no": null, "categories": "q-bio.OT nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Models of diffusion driven pattern formation that rely on the Turing\nmechanism are utilized in many areas of science. However, many such models\nsuffer from the defect of requiring fine tuning of parameters or an unrealistic\nseparation of scales in the diffusivities of the constituents of the system in\norder to predict the formation of spatial patterns. In the context of a very\ngeneric model of ecological pattern formation, we show that the inclusion of\nintrinsic noise in Turing models leads to the formation of \"quasi-patterns\"\nthat form in generic regions of parameter space and are experimentally\ndistinguishable from standard Turing patterns. The existence of quasi-patterns\nremoves the need for unphysical fine tuning or separation of scales in the\napplication of Turing models to real systems.\n", "versions": [{"version": "v1", "created": "Mon, 1 Nov 2010 23:03:07 GMT"}, {"version": "v2", "created": "Thu, 4 Nov 2010 21:03:47 GMT"}, {"version": "v3", "created": "Mon, 31 Jan 2011 22:17:12 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Butler", "Thomas", ""], ["Goldenfeld", "Nigel", ""]]}]