[{"id": "1103.1833", "submitter": "Ma\\\"el Mont\\'evil", "authors": "Giuseppe Longo and Ma\\\"el Mont\\'evil", "title": "From Physics to Biology by Extending Criticality and Symmetry Breakings", "comments": "Written for the special issue \"Systems Biology and Cancer\", edited by\n  Ana Soto and Carlos Sonnenschein; ISSN: 0079-6107", "journal-ref": "Progress in Biophysics and Molecular Biology 106 (2): 340-347\n  (2011)", "doi": "10.1016/j.pbiomolbio.2011.03.005", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Symmetries play a major role in physics, in particular since the work by E.\nNoether and H. Weyl in the first half of last century. Herein, we briefly\nreview their role by recalling how symmetry changes allow to conceptually move\nfrom classical to relativistic and quantum physics. We then introduce our\nongoing theoretical analysis in biology and show that symmetries play a\nradically different role in this discipline, when compared to those in current\nphysics. By this comparison, we stress that symmetries must be understood in\nrelation to conservation and stability properties, as represented in the\ntheories. We posit that the dynamics of biological organisms, in their various\nlevels of organization, are not \"just\" processes, but permanent (extended, in\nour terminology) critical transitions and, thus, symmetry changes. Within the\nlimits of a relative structural stability (or interval of viability),\nvariability is at the core of these transitions.\n", "versions": [{"version": "v1", "created": "Wed, 9 Mar 2011 17:08:48 GMT"}, {"version": "v2", "created": "Fri, 6 Apr 2012 03:42:47 GMT"}], "update_date": "2012-04-09", "authors_parsed": [["Longo", "Giuseppe", ""], ["Montévil", "Maël", ""]]}, {"id": "1103.1923", "submitter": "Delfim F. M. Torres", "authors": "Helena Sofia Rodrigues, M. Teresa T. Monteiro, Delfim F. M. Torres,\n  Alan Zinober", "title": "Dengue disease, basic reproduction number and control", "comments": "This is a preprint of a paper whose final and definitive form has\n  appeared in International Journal of Computer Mathematics (2011), DOI:\n  10.1080/00207160.2011.554540", "journal-ref": "Int. J. Comput. Math. 89 (2012), no. 3, 334--346", "doi": "10.1080/00207160.2011.554540", "report-no": null, "categories": "math.OC cs.SY physics.med-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dengue is one of the major international public health concerns. Although\nprogress is underway, developing a vaccine against the disease is challenging.\nThus, the main approach to fight the disease is vector control. A model for the\ntransmission of Dengue disease is presented. It consists of eight mutually\nexclusive compartments representing the human and vector dynamics. It also\nincludes a control parameter (insecticide) in order to fight the mosquito. The\nmodel presents three possible equilibria: two disease-free equilibria (DFE) and\nanother endemic equilibrium. It has been proved that a DFE is locally\nasymptotically stable, whenever a certain epidemiological threshold, known as\nthe basic reproduction number, is less than one. We show that if we apply a\nminimum level of insecticide, it is possible to maintain the basic reproduction\nnumber below unity. A case study, using data of the outbreak that occurred in\n2009 in Cape Verde, is presented.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 00:37:59 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Rodrigues", "Helena Sofia", ""], ["Monteiro", "M. Teresa T.", ""], ["Torres", "Delfim F. M.", ""], ["Zinober", "Alan", ""]]}]