[{"id": "1110.0190", "submitter": "Dal Young Kim Prof.", "authors": "Dal-Young Kim", "title": "A Simple Proposal for a Solution to the Accommodation-Vergence Mismatch\n  Problem in 3D Displays", "comments": "Presented as a poster at IMID 2012 (The 12th International Meeting on\n  Information Display, 28-31 Aug 2012, EXCO, Daegu, Korea)", "journal-ref": "IMID 2012 Digest pp. 679-680", "doi": null, "report-no": null, "categories": "physics.optics physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here is suggested a solution to the accommodation-vergence mismatch problem\nin 3D stereoscopic displays. It can be achieved by compensating the mismatched\nfocal length with refractive power of adjustable-focus 3D glasses. The\ncompensation would make vergence of human eyes match with position of virtual\nstereoscopic motion pictures, reducing visual fatigue.\n", "versions": [{"version": "v1", "created": "Sun, 2 Oct 2011 14:20:07 GMT"}, {"version": "v2", "created": "Wed, 21 Mar 2012 08:53:46 GMT"}, {"version": "v3", "created": "Fri, 4 May 2012 08:44:50 GMT"}, {"version": "v4", "created": "Thu, 10 May 2012 09:12:00 GMT"}, {"version": "v5", "created": "Mon, 17 Sep 2012 16:50:06 GMT"}], "update_date": "2012-09-19", "authors_parsed": [["Kim", "Dal-Young", ""]]}, {"id": "1110.1739", "submitter": "Graciano Dieck Kattas", "authors": "Graciano Dieck Kattas, Xiao-Ke Xu and Michael Small", "title": "Dynamical modeling of collective behavior from pigeon flight data: flock\n  cohesion and dispersion", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1002449", "report-no": null, "categories": "q-bio.OT physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several models of flocking have been promoted based on simulations with\nqualitatively naturalistic behavior. In this paper we provide the first direct\napplication of computational modeling methods to infer flocking behavior from\nexperimental field data. We show that this approach is able to infer general\nrules for interaction, or lack of interaction, among members of a flock or,\nmore generally, any community. Using experimental field measurements of homing\npigeons in flight we demonstrate the existence of a basic distance dependent\nattraction/repulsion relationship and show that this rule is sufficient to\nexplain collective behavior observed in nature. Positional data of individuals\nover time are used as input data to a computational algorithm capable of\nbuilding complex nonlinear functions that can represent the system behavior.\nTopological nearest neighbor interactions are considered to characterize the\ncomponents within this model. The efficacy of this method is demonstrated with\nsimulated noisy data generated from the classical (two dimensional) Vicsek\nmodel. When applied to experimental data from homing pigeon flights we show\nthat the more complex three dimensional models are capable of predicting and\nsimulating trajectories, as well as exhibiting realistic collective dynamics.\nThe simulations of the reconstructed models are used to extract properties of\nthe collective behavior in pigeons, and how it is affected by changing the\ninitial conditions of the system. Our results demonstrate that this approach\nmay be applied to construct models capable of simulating trajectories and\ncollective dynamics using experimental field measurements of herd movement.\nFrom these models, the behavior of the individual agents (animals) may be\ninferred.\n", "versions": [{"version": "v1", "created": "Sat, 8 Oct 2011 14:08:23 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["Kattas", "Graciano Dieck", ""], ["Xu", "Xiao-Ke", ""], ["Small", "Michael", ""]]}, {"id": "1110.2966", "submitter": "Irina Manina", "authors": "I.V. Manina, N.M. Peretolchina, N.S. Saprikina, A.M. Kozlov, I.N.\n  Mikhaylova, A.Yu.Barishnikov", "title": "Experimental Researches of Cutaneous Melanoma Immunotherapy by Antitumor\n  Cell-Whole GM-CSF-Producing Vaccines", "comments": "8 pages, 4 figures; ISSN 1726-9784. Russian Journal of Biotherapy.\n  /2010.-#3- P.47-50", "journal-ref": "Russian Journal of Biotherapy. 3/2010.-#3- P.47-50", "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Various approaches to increase efficiency of antitumor therapy by a\ncombination of vaccinotherapy, chemotherapy and surgical excision of primary\ntumor nodes, and also the comparative analyses of therapeutic and preventive\napplication of antitumoral vaccines were carried out in melanoma experimental\nmodel. It was postulated that preventive vaccination is able to prevent tumor\nincidence by 70 %. The combination of vaccinotherapy and surgical treatment of\nmelanoma increases antimetastatic activity of vaccination by 43 %. We conclude\nthe combined therapy would lead to more effective antitumor response.\n", "versions": [{"version": "v1", "created": "Wed, 12 Oct 2011 18:32:11 GMT"}], "update_date": "2011-10-14", "authors_parsed": [["Manina", "I. V.", ""], ["Peretolchina", "N. M.", ""], ["Saprikina", "N. S.", ""], ["Kozlov", "A. M.", ""], ["Mikhaylova", "I. N.", ""], ["Barishnikov", "A. Yu.", ""]]}, {"id": "1110.3398", "submitter": "Gaurav Pachpute Mr.", "authors": "Gaurav Pachpute, Kriti Saxena", "title": "Free Final-Time Optimal Control for HIV Viral Dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we examine a well-established model for HIV wild-type\ninfection. The algorithm for steepest descent method for fixed final-time is\nstated and a modified method for free final-time is presented. The first type\nof cost functional considered, seeks to minimize the total time of therapy. An\neasy implementation for this problem suggests that it can be effective in the\nearly stages of treatment as well as for individual-based studies, due to the\n\"hit first and hit hard\" nature of optimal control.\n  An LQR based cost functional is also presented and the solution is found\nusing steepest descent method. It suggests that the optimal therapy must remain\nhigh until the patient shows signs of recovery after which, the therapy\ngradually decreases. This is in line with the biomedical philosophy. Solution\nto a modified problem which includes a weight for total time is approximated\nusing the modified algorithm. It shows a considerable drop in the total period.\nWe conclude that, a decreased and optimized therapy period can help us increase\nefficiency as well as the turnover rate for patient care.\n", "versions": [{"version": "v1", "created": "Sat, 15 Oct 2011 09:54:08 GMT"}], "update_date": "2011-10-18", "authors_parsed": [["Pachpute", "Gaurav", ""], ["Saxena", "Kriti", ""]]}, {"id": "1110.5265", "submitter": "Eric  Werner", "authors": "Eric Werner", "title": "On Programs and Genomes", "comments": "This a slightly extended version of Part I of a position paper\n  distributed on November 18, 2007 to the participants of our Balliol Seminar\n  on the Conceptual Foundations of Systems Biology. It presented my ideas on\n  the global control architecture of genomes. Denis Noble and myself started\n  the seminar in the Michaelmas term in the autumn of 2006 at Balliol College,\n  University of Oxford", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT cs.CE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We outline the global control architecture of genomes. A theory of genomic\ncontrol information is presented. The concept of a developmental control\nnetwork called a cene (for control gene) is introduced. We distinguish\nparts-genes from control genes or cenes. Cenes are interpreted and executed by\nthe cell and, thereby, direct cell actions including communication, growth,\ndivision, differentiation and multi-cellular development. The cenome is the\nglobal developmental control network in the genome. The cenome is also a cene\nthat consists of interlinked sub-cenes that guide the ontogeny of the organism.\nThe complexity of organisms is linked to the complexity of the cenome. The\nrelevance to ontogeny and evolution is mentioned. We introduce the concept of a\nuniversal cell and a universal genome.\n", "versions": [{"version": "v1", "created": "Mon, 24 Oct 2011 15:49:30 GMT"}], "update_date": "2011-10-25", "authors_parsed": [["Werner", "Eric", ""]]}, {"id": "1110.6413", "submitter": "Gonzalo Robledo", "authors": "Fernando C\\'ordova-Lepe, Rodrigo del Valle, Gonzalo Robledo", "title": "A pulse fishery model with closures as function of the catch: Conditions\n  for sustainability", "comments": "15 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a model of single species fishery which alternates closed seasons\nwith pulse captures. The novelty is that the length of a closed season is\ndetermined by the stock size of the last capture. The process is described by a\nnew type of impulsive differential equations recently introduced. The main\nresult is a fishing effort threshold which determines either the sustainability\nof the fishery or the extinction of the resource.\n", "versions": [{"version": "v1", "created": "Thu, 13 Oct 2011 15:25:22 GMT"}], "update_date": "2011-10-31", "authors_parsed": [["Córdova-Lepe", "Fernando", ""], ["del Valle", "Rodrigo", ""], ["Robledo", "Gonzalo", ""]]}]