[{"id": "1207.2929", "submitter": "M. Cristina Marchetti", "authors": "M. C. Marchetti, J.-F. Joanny, S. Ramaswamy, T. B. Liverpool, J.\n  Prost, Madan Rao and R. Aditi Simha", "title": "Soft Active Matter", "comments": "50 pages, 33 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this review we summarize theoretical progress in the field of active\nmatter, placing it in the context of recent experiments. Our approach offers a\nunified framework for the mechanical and statistical properties of living\nmatter: biofilaments and molecular motors in vitro or in vivo, collections of\nmotile microorganisms, animal flocks, and chemical or mechanical imitations. A\nmajor goal of the review is to integrate the several approaches proposed in the\nliterature, from semi-microscopic to phenomenological. In particular, we first\nconsider \"dry\" systems, defined as those where momentum is not conserved due to\nfriction with a substrate or an embedding porous medium, and clarify the\ndifferences and similarities between two types of orientationally ordered\nstates, the nematic and the polar. We then consider the active hydrodynamics of\na suspension, and relate as well as contrast it with the dry case. We further\nhighlight various large-scale instabilities of these nonequilibrium states of\nmatter. We discuss and connect various semi-microscopic derivations of the\ncontinuum theory, highlighting the unifying and generic nature of the continuum\nmodel. Throughout the review, we discuss the experimental relevance of these\ntheories for describing bacterial swarms and suspensions, the cytoskeleton of\nliving cells, and vibrated granular materials. We suggest promising extensions\ntowards greater realism in specific contexts from cell biology to ethology, and\nremark on some exotic active-matter analogues. Lastly, we summarize the outlook\nfor a quantitative understanding of active matter, through the interplay of\ndetailed theory with controlled experiments on simplified systems, with living\nor artificial constituents.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2012 11:38:28 GMT"}], "update_date": "2012-07-13", "authors_parsed": [["Marchetti", "M. C.", ""], ["Joanny", "J. -F.", ""], ["Ramaswamy", "S.", ""], ["Liverpool", "T. B.", ""], ["Prost", "J.", ""], ["Rao", "Madan", ""], ["Simha", "R. Aditi", ""]]}, {"id": "1207.3454", "submitter": "Tidjani Negadi", "authors": "Tidjani Negadi", "title": "The irregular (integer) tetrahedron as a warehouse of biological\n  information", "comments": "to be published in 2012; Symmetry: Culture and Science, 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is devoted to a new classification of the twenty amino acids based\non the heronian (integer) tetrahedron.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jul 2012 19:45:48 GMT"}], "update_date": "2012-07-17", "authors_parsed": [["Negadi", "Tidjani", ""]]}, {"id": "1207.4737", "submitter": "Bob Eisenberg", "authors": "Bob Eisenberg", "title": "Life's Solutions are Complex Fluids. A Mathematical Challenge", "comments": "Typos and infelicities corrected, I hope; \"Structural\n  Bioinformatics\", 2012, part of the Springer series Advances in Experimental\n  Medicine and Biology, editor Dongqing Wei, JiaoTong University (Shanghai)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT cond-mat.soft physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classical thermodynamics and statistical mechanics describe systems in which\nnothing interacts with nothing. Even the highly refined theory of simple fluids\ndoes not deal very well with electrical interactions, boundary conditions, or\nflows, if at all. Electrical interactions, boundary conditions, and flows are\nessential features of living systems. Life without flow is death and so a\ndifferent approach is needed to study biology alive. The theory of complex\nfluids deals with interactions, boundary conditions, and flows quite well as\ncan be seen in its successful treatment of liquid crystals. I advocate treating\nionic solutions in general as complex fluids, with microelements that are the\nsolutes and components of the solution. Enzyme active sites are a special case\nwhere some solutes are reactants. Solutes are crowded into active sites of\nenzyme by the high density of protein charges. The electric field links\nchemical reactions to charges in the protein and surrounding solutions.\nInteractions potentiate catalysis and control biological function. I suspect\nthat most chemical reactions that occur in liquids also need to be treated by\nthe theory of complex fluids. The electron movements of these reactions occur\nin a temporary highly concentrated fluctuation, a transient spatial\ninhomogeneity in the bulk solution. The electron movements of these reactions\n(described by quantum mechanics) are coupled to the electric (and sometimes\nsteric) fields of the bulk solution. I suspect the electron movements,\ninhomogeneities, and chemical reaction (in the condensed phase) need to be\ntreated by the theory of complex fluids because everything interacts with\neverything else, in this system, as in so many others.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2012 17:16:28 GMT"}, {"version": "v2", "created": "Thu, 30 Aug 2012 16:21:35 GMT"}], "update_date": "2012-08-31", "authors_parsed": [["Eisenberg", "Bob", ""]]}, {"id": "1207.4803", "submitter": "Sara Walker", "authors": "Sara Imari Walker and Paul C. W. Davies", "title": "The Algorithmic Origins of Life", "comments": "13 pages, 1 table", "journal-ref": "J. R. Soc. Interface 2013 vol. 10 no. 79 20120869", "doi": "10.1098/rsif.2012.0869", "report-no": null, "categories": "nlin.AO q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although it has been notoriously difficult to pin down precisely what it is\nthat makes life so distinctive and remarkable, there is general agreement that\nits informational aspect is one key property, perhaps the key property. The\nunique informational narrative of living systems suggests that life may be\ncharacterized by context-dependent causal influences, and in particular, that\ntop-down (or downward) causation -- where higher-levels influence and constrain\nthe dynamics of lower-levels in organizational hierarchies -- may be a major\ncontributor to the hierarchal structure of living systems. Here we propose that\nthe origin of life may correspond to a physical transition associated with a\nshift in causal structure, where information gains direct, and\ncontext-dependent causal efficacy over the matter it is instantiated in. Such a\ntransition may be akin to more traditional physical transitions (e.g.\nthermodynamic phase transitions), with the crucial distinction that determining\nwhich phase (non-life or life) a given system is in requires dynamical\ninformation and therefore can only be inferred by identifying causal\narchitecture. We discuss some potential novel research directions based on this\nhypothesis, including potential measures of such a transition that may be\namenable to laboratory study, and how the proposed mechanism corresponds to the\nonset of the unique mode of (algorithmic) information processing characteristic\nof living systems.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2012 20:23:56 GMT"}, {"version": "v2", "created": "Mon, 22 Oct 2012 00:49:48 GMT"}], "update_date": "2012-12-20", "authors_parsed": [["Walker", "Sara Imari", ""], ["Davies", "Paul C. W.", ""]]}, {"id": "1207.4808", "submitter": "Sara Walker", "authors": "Sara Imari Walker, Luis Cisneros and Paul C. W. Davies", "title": "Evolutionary Transitions and Top-Down Causation", "comments": "8 pages, 4 figures", "journal-ref": "Proceedings of Artificial Life XIII (2012) p. 283-290", "doi": null, "report-no": null, "categories": "nlin.AO q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Top-down causation has been suggested to occur at all scales of biological\norganization as a mechanism for explaining the hierarchy of structure and\ncausation in living systems. Here we propose that a transition from bottom-up\nto top-down causation -- mediated by a reversal in the flow of information from\nlower to higher levels of organization, to that from higher to lower levels of\norganization -- is a driving force for most major evolutionary transitions. We\nsuggest that many major evolutionary transitions might therefore be marked by a\ntransition in causal structure. We use logistic growth as a toy model for\ndemonstrating how such a transition can drive the emergence of collective\nbehavior in replicative systems. We then outline how this scenario may have\nplayed out in those major evolutionary transitions in which new, higher levels\nof organization emerged, and propose possible methods via which our hypothesis\nmight be tested.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2012 20:44:59 GMT"}], "update_date": "2012-07-23", "authors_parsed": [["Walker", "Sara Imari", ""], ["Cisneros", "Luis", ""], ["Davies", "Paul C. W.", ""]]}, {"id": "1207.5025", "submitter": "Julyan Cartwright", "authors": "Antonio G. Checa, Julyan H. E. Cartwright, Marc-Georg Willinger", "title": "Mineral bridges in nacre revisited", "comments": "To appear in Proceedings of the International Symposium on Pearl\n  Research (Tokyo, 2011)", "journal-ref": "Recent Advances in Pearl Research, Eds., S. Watabe, K. Maeyama and\n  H. Nagasawa, Terrapub (Tokyo), 2013, pp. 109-123", "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.mtrl-sci cond-mat.soft nlin.AO q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We confirm with high-resolution techniques the existence of mineral bridges\nbetween superposed nacre tablets. In the towered nacre of both gastropods and\nthe cephalopod Nautilus there are large bridges aligned along the tower axes,\ncorresponding to gaps (150-200 nm) in the interlamellar membranes. Gaps are\nproduced by the interaction of the nascent tablets with a surface membrane that\ncovers the nacre compartment. In the terraced nacre of bivalves bridges\nassociated with elongated gaps in the interlamellar membrane (> 100 nm) have\nmainly been found at or close to the edges of superposed parental tablets. To\nexplain this placement, we hypothesize that the interlamellar membrane breaks\ndue to differences in osmotic pressure across it when the interlamellar space\nbelow becomes reduced at an advanced stage of calcification. In no cases are\nthe minor connections between superimposed tablets (< 60 nm), earlier reported\nto be mineral bridges, found to be such.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jul 2012 19:04:00 GMT"}], "update_date": "2013-03-14", "authors_parsed": [["Checa", "Antonio G.", ""], ["Cartwright", "Julyan H. E.", ""], ["Willinger", "Marc-Georg", ""]]}]