[{"id": "1304.0683", "submitter": "Vasily Ogryzko V", "authors": "Michael Bordonaro, Vasily Ogryzko", "title": "Quantum Biology at the Cellular Level - elements of the research program", "comments": "53 pages, 8 figures, with 3 open reviews", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum Biology is emerging as a new field at the intersection between\nfundamental physics and biology, promising novel insights into the nature and\norigin of biological order. We discuss several elements of QBCL (Quantum\nBiology at Cellular Level), a research program designed to extend the reach of\nquantum concepts to higher than molecular levels of biological organization.\n  Key words. decoherence, macroscopic superpositions, basis-dependence, formal\nsuperposition, non-classical correlations, Basis-Dependent Selection (BDS),\nsynthetic biology, evolvability mechanism loophole.\n", "versions": [{"version": "v1", "created": "Tue, 2 Apr 2013 16:38:18 GMT"}, {"version": "v2", "created": "Wed, 3 Apr 2013 12:45:52 GMT"}], "update_date": "2013-04-04", "authors_parsed": [["Bordonaro", "Michael", ""], ["Ogryzko", "Vasily", ""]]}, {"id": "1304.1842", "submitter": "Carlos Gershenson", "authors": "Nelson Fernandez, Carlos Maldonado and Carlos Gershenson", "title": "Information Measures of Complexity, Emergence, Self-organization,\n  Homeostasis, and Autopoiesis", "comments": "35 pages, 12 figures, to be published in Prokopenko, M., editor,\n  Guided Self-Organization: Inception. Springer. In Press", "journal-ref": null, "doi": null, "report-no": "C3 Report 2013.02", "categories": "nlin.AO cs.IT math.IT q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This chapter reviews measures of emergence, self-organization, complexity,\nhomeostasis, and autopoiesis based on information theory. These measures are\nderived from proposed axioms and tested in two case studies: random Boolean\nnetworks and an Arctic lake ecosystem.\n  Emergence is defined as the information a system or process produces.\nSelf-organization is defined as the opposite of emergence, while complexity is\ndefined as the balance between emergence and self-organization. Homeostasis\nreflects the stability of a system. Autopoiesis is defined as the ratio between\nthe complexity of a system and the complexity of its environment. The proposed\nmeasures can be applied at different scales, which can be studied with\nmulti-scale profiles.\n", "versions": [{"version": "v1", "created": "Sat, 6 Apr 2013 01:46:31 GMT"}, {"version": "v2", "created": "Fri, 12 Apr 2013 15:34:55 GMT"}, {"version": "v3", "created": "Wed, 31 Jul 2013 15:58:54 GMT"}], "update_date": "2013-08-01", "authors_parsed": [["Fernandez", "Nelson", ""], ["Maldonado", "Carlos", ""], ["Gershenson", "Carlos", ""]]}, {"id": "1304.3747", "submitter": "Marcel Salathe", "authors": "Todd J Bodnar, Marcel Salath\\'e", "title": "The Social Maintenance of Cooperation through Hypocrisy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI physics.soc-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperation is widespread in human societies, but its maintenance at the\ngroup level remains puzzling if individuals benefit from not cooperating.\nExplanations of the maintenance of cooperation generally assume that\ncooperative and non-cooperative behavior in others can be assessed and copied\naccurately. However, humans have a well known capacity to deceive and thus to\nmanipulate how others assess their behavior. Here, we show that hypocrisy -\nclaiming to be acting cooperatively while acting selfishly - can maintain\nsocial cooperation because it prevents the spread of selfish behavior. We\ndemonstrate this effect both theoretically and experimentally. Hypocrisy allows\nthe cooperative strategy to spread by taking credit for the success of the\nnon-cooperative strategy.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 22:48:15 GMT"}], "update_date": "2013-04-16", "authors_parsed": [["Bodnar", "Todd J", ""], ["Salathé", "Marcel", ""]]}, {"id": "1304.5163", "submitter": "Maria Wittmann Dr", "authors": "Zolt\\'an Noszticzius, Maria Wittmann, Krist\\'of K\\'aly-Kullai,\n  Zolt\\'an Beregv\\'ari, Istv\\'an Kiss, L\\'aszl\\'o Rosivall, J\\'anos Szegedi", "title": "Demonstrating that chlorine dioxide is a size-selective antimicrobial\n  agent and high purity ClO2 can be used as a local antiseptic", "comments": "32 pages incl. 12 pages of Supplementary information; 6+1 figures, 3\n  tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background / Aims ClO2, the so-called \"ideal biocide\", could also be applied\nas an antiseptic if it was understood why the solution's rapid killing of\nmicrobes does not cause any harm to humans or to animals. Our aim was to study\nboth theoretically and experimentally its reaction-diffusion mechanism to find\nthe source of that selectivity. Methods ClO2 permeation measurements through\nprotein membranes were performed and the time delay of ClO2 transport due to\nreaction and diffusion was determined. To calculate ClO2 penetration depths and\nestimate bacterial killing times, approximate solutions of the\nreaction-diffusion equation were derived. Additionally, as a preliminary test,\nthree patients with infected wounds were treated with a 300 ppm high purity\nClO2 solution and the healing process was documented. Results The rate law of\nthe reaction-diffusion model predicts that the killing time is proportional to\nthe square of the characteristic size (e.g. diameter) of a body, thus, small\nones will be killed extremely fast. For example, the killing time for a\nbacterium is on the order of milliseconds in a 300 ppm ClO2 solution. Thus, the\nfew minutes of contact time (owing to the volatility of ClO2) is quite enough\nto kill all bacteria, but short enough to keep ClO2 penetration into the living\ntissues safely below 0.1 mm, minimizing cytotoxic effects. Pictures of\nsuccessful wound healings confirm these considerations. Various properties of\nClO2, advantageous for an antiseptic, are also discussed. Most importantly,\nbacteria are not able to develop resistance against ClO2 as it reacts with\nbiological thiols which play a vital role in all living organisms. Conclusion\nSelectivity of ClO2 between humans and bacteria is based not on their different\nbiochemistry, but on their different size. Preliminary clinical results\nencourage further research with this promising local antiseptic.\n", "versions": [{"version": "v1", "created": "Thu, 18 Apr 2013 15:27:38 GMT"}], "update_date": "2013-04-19", "authors_parsed": [["Noszticzius", "Zoltán", ""], ["Wittmann", "Maria", ""], ["Kály-Kullai", "Kristóf", ""], ["Beregvári", "Zoltán", ""], ["Kiss", "István", ""], ["Rosivall", "László", ""], ["Szegedi", "János", ""]]}]