[{"id": "1310.0213", "submitter": "Valentina Agoni", "authors": "Valentina Agoni", "title": "G-quadruplexes and mRNA localization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  G-quadruplexes represent a novelty for molecular biology. Their role inside\nthe cell remains mysterious. We investigate a possible correlation with mRNA\nlocalization. In particular, we hypothesize that Gquadruplexes influence fluid\ndynamics.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 09:43:40 GMT"}], "update_date": "2013-10-02", "authors_parsed": [["Agoni", "Valentina", ""]]}, {"id": "1310.2182", "submitter": "Ayad Ghany Ismaeel", "authors": "Ayad Ghany Ismaeel", "title": "New Approach for Prediction Pre-cancer via Detecting Mutated in Tumor\n  Protein P53", "comments": "6 pages, 9 figures and 1 table,\n  http://www.ijser.org/researchpaper/New-Approach-for-Prediction-Pre-cancer-via-Detecting-Mutated-in-Tumor-Protein-P53.pdf", "journal-ref": "International Journal of Scientific & Engineering Research, Volume\n  4,Issue 10, October 2013 ISSN 2229-5518", "doi": null, "report-no": null, "categories": "cs.CE q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tumor protein P53 is believed to be involved in over half of human cancers\ncases, the prediction of malignancies plays essential roles not only in advance\ndetection for cancer, but also in discovering effective prevention and\ntreatment of cancer, till now there isn't approach be able in prediction the\nmutated in tumor protein P53 which is caused high ratio of human cancers like\nbreast, Blood, skin, liver, lung, bladder etc. This research proposed a new\napproach for prediction pre-cancer via detection malignant mutations in tumor\nprotein P53 using bioinformatics tools like FASTA, BLAST, CLUSTALW and TP53\ndatabases worldwide. Implement and apply this new approach of prediction\npre-cancer through mutations at tumor protein P53 shows an effective result\nwhen used more specific parameters/features to extract the prediction result\nthat means when the user increase the number of filters of the results which\nobtained from the database gives more specific diagnosis and classify, addition\nthat the detecting pre-cancer via prediction mutated tumor protein P53 will\nreduces a person's cancers in the future by avoiding exposure to toxins,\nradiation or monitoring themselves at older ages by change their food,\nenvironment, even the pace of living. Also that new approach of prediction\npre-cancer will help if there is any treatment can give for that person to\ntherapy the mutated tumor protein P53. Index Terms (Normal Homology TP53 gene,\nTumor Protein P53, Oncogene Labs, GC and AT content, FASTA, BLAST, ClustalW)\n", "versions": [{"version": "v1", "created": "Tue, 8 Oct 2013 15:43:25 GMT"}], "update_date": "2013-10-09", "authors_parsed": [["Ismaeel", "Ayad Ghany", ""]]}, {"id": "1310.3200", "submitter": "Denis Semenov A.", "authors": "Denis A. Semyonov", "title": "Lagerkvist versus Crick", "comments": "23 pages, 8 figures, 5 supplemental figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Present day data allow significant reconsideration of ideas on mechanisms\nunderlying the degeneracy in the genetic code. Here a hypothesis is presented\nwhich links the degeneracy to possible conformational alterations in the\ncodon-anticodon duplex. This enables explanation of Rumer symmetry in the table\nof the genetic code, coding of methionine and tryptophane without degeneracy\nand predict significant difference between thymine and uracyl. The suggested\nhypothesis has something in common with Lagerkvist idea that only two\nnucleotides in codon are coding.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 15:15:29 GMT"}], "update_date": "2013-10-14", "authors_parsed": [["Semyonov", "Denis A.", ""]]}, {"id": "1310.3459", "submitter": "Vladimir Chechetkin R.", "authors": "V.R. Chechetkin", "title": "Statistics of genome architecture", "comments": "25 pages, 8 figures, 1 table", "journal-ref": null, "doi": "10.1016/j.physleta.2013.10.021", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main statistical distributions applicable to the analysis of genome\narchitecture and genome tracks are briefly discussed and critically assessed.\nAlthough the observed features in distributions of element lengths can be\nequally well fitted by the different statistical approximations, the\ninterpretation of observed regularities may strongly depend on the chosen\nscheme. We discuss the possible evolution scenarios and describe the main\ncharacteristics obtained with different distributions. The expression for the\nassessment of levels in hierarchical chromatin folding is derived and the\nquantitative measure of genome architecture inhomogeneity is suggested. This\ntheory provides the ground for the regular statistical study of genome\narchitecture and genome tracks.\n", "versions": [{"version": "v1", "created": "Sun, 13 Oct 2013 09:26:19 GMT"}, {"version": "v2", "created": "Sat, 19 Oct 2013 13:12:26 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Chechetkin", "V. R.", ""]]}, {"id": "1310.3475", "submitter": "Debashish Chowdhury", "authors": "Debashish Chowdhury", "title": "Centenary of \"Researches on irritability of plants\" by Jagadis Chandra\n  Bose", "comments": "This is an author-created, un-copyedited final version of the article\n  published in CURRENT SCIENCE (published by Current Science Association, in\n  collaboration with Indian Academy of Sciences)", "journal-ref": "Current Science, vol.105, 1002-1004 (2013)", "doi": null, "report-no": null, "categories": "physics.hist-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This note celebrates the centenary of Jagadis Chandra Bose's classic\nmonograph entitled \"Researches on irritability of plants\".\n", "versions": [{"version": "v1", "created": "Sun, 13 Oct 2013 12:42:18 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Chowdhury", "Debashish", ""]]}, {"id": "1310.3737", "submitter": "Patricia Yang", "authors": "Patricia J. Yang, Jonathan C. Pham, Jerome Choo and David L. Hu", "title": "Law of Urination: all mammals empty their bladders over the same\n  duration", "comments": "Full version including supporting information", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.flu-dyn q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many urological studies rely upon animal models such as rats and pigs whose\nurination physics and correlation to humans are poorly understood. Here we\nelucidate the hydrodynamics of urination across five orders of magnitude in\nanimal mass. Using high-speed videography and flow rate measurement at Zoo\nAtlanta, we discover the \"Law of Urination,\" which states animals empty their\nbladders over nearly constant duration of average 21 seconds (standard\ndeviation 13 seconds). This feat is made possible by larger animals having\nlonger urethras, thus higher gravitational force and flow speed. Smaller\nmammals are challenged during urination due to high viscous and surface tension\nforces that limit their urine to single drops. Our findings reveal the urethra\nconstitutes as a flow enhancing device, enabling the urinary system to be\nscaled up without compromising its function. This study may help in the\ndiagnosis of urinary problems in animals and in inspiring the design of\nscalable hydrodynamic systems based on those in nature.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 16:29:25 GMT"}, {"version": "v2", "created": "Tue, 15 Oct 2013 13:31:01 GMT"}, {"version": "v3", "created": "Wed, 26 Mar 2014 21:37:47 GMT"}], "update_date": "2014-03-28", "authors_parsed": [["Yang", "Patricia J.", ""], ["Pham", "Jonathan C.", ""], ["Choo", "Jerome", ""], ["Hu", "David L.", ""]]}, {"id": "1310.4946", "submitter": "Philippe Terrier PhD", "authors": "Fabienne Reynard and Philippe Terrier", "title": "Local dynamic stability of treadmill walking: intrasession and\n  week-to-week repeatability", "comments": "author's version of a manuscript accepted for publication in the\n  journal of biomechanics", "journal-ref": "J Biomech. 2014 Jan 3;47(1):74-80", "doi": "10.1016/j.jbiomech.2013.10.011", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Repetitive falls degrade the quality of life of elderly people and of\npatients suffering of various neurological disorders. In order to prevent falls\nwhile walking, one should rely on relevant early indicators of impaired dynamic\nbalance. The local dynamic stability (LDS) represents the sensitivity of gait\nto small perturbations: divergence exponents (maximal Lyapunov exponents)\nassess how fast a dynamical system diverges from neighbor points. Although\nnumerous findings attest the validity of LDS as a fall risk index, reliability\nresults are still sparse. The present study explores the intrasession and\nintersession repeatability of gait LDS using intraclass correlation\ncoefficients (ICC) and standard error of measurement (SEM). Ninety-five healthy\nindividuals performed 5min. treadmill walking in two sessions separated by 9\ndays. Trunk acceleration was measured with a 3D accelerometer. Three time\nscales were used to estimate LDS: over 4 to 10 strides ({\\lambda}4-10), over\none stride ({\\lambda}1) and over one step ({\\lambda}0.5). The intrasession\nrepeatability was assessed from three repetitions of either 35 strides or 70\nstrides taken within the 5min tests. The intersession repeatability compared\nthe two sessions, which totalized 210 strides. The intrasession ICCs\n(70-strides estimates/35-strides estimates) were 0.52/0.18 for {\\lambda}4-10\nand 0.84/0.77 for {\\lambda}1 and {\\lambda}0.5. The intersession ICCs were\naround 0.60. The SEM results revealed that {\\lambda}0.5 measured in\nmedio-lateral direction exhibited the best reliability, sufficient to detect\nmoderate changes at individual level (20%). However, due to the low\nintersession repeatability, one should average several measurements taken on\ndifferent days in order to better approximate the true LDS.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 08:39:45 GMT"}], "update_date": "2014-02-17", "authors_parsed": [["Reynard", "Fabienne", ""], ["Terrier", "Philippe", ""]]}, {"id": "1310.8383", "submitter": "Etienne Gnimpieba Z.", "authors": "Etienne Z. Gnimpieba, Douglas Jennewein, Luke Fuhrman, Carol M.\n  Lushbough", "title": "Bioinformatics Knowledge Transmission (training, learning, and\n  teaching): overview and flexible comparison of computer based training\n  approaches", "comments": "Proc. IKE'13, World Academy of Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY q-bio.OT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  The merger of computer science, mathematics, and life sciences has brought\nabout the discipline known as bioinformatics. However, the transmission (e.g.\ntraining, learning, and teaching) of this knowledge becomes an important issue.\nMany tools have been developed to help the bioinformatics community with that\ntransmission challenge. When selecting the best of these tools, called here\nBKTMS (Bioinformatics Knowledge Transmission Management Systems), there may be\nconfusion. What makes a good BKTMS? How can we make this choice efficiently?\nThese questions remain unanswered for many users (e.g. learner, teacher and\nstudent, trainer and trainee, administrator). This paper provides a critical\nreview of 32 existing BKTMS and a flexible comparison. This review and\nevaluation will be used to gain insight into the tools, systems, and\ncapabilities that will be added to or excluded from a new proposed model for\nthe next generation of BKTMS, involving multidisciplinary, web semantic tools\n(e.g. web services, workflow) and standards like LOM, or SCORM.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 05:05:51 GMT"}], "update_date": "2013-11-01", "authors_parsed": [["Gnimpieba", "Etienne Z.", ""], ["Jennewein", "Douglas", ""], ["Fuhrman", "Luke", ""], ["Lushbough", "Carol M.", ""]]}, {"id": "1310.8387", "submitter": "Sang Hoon Lee", "authors": "Sang Hoon Lee, Mihai Cucuringu, Mason A. Porter", "title": "Density-based and transport-based core-periphery structures in networks", "comments": "14 pages, 7 figures, 5 tables", "journal-ref": "Phys. Rev. E 89, 032810 (2014)", "doi": "10.1103/PhysRevE.89.032810", "report-no": null, "categories": "physics.soc-ph cond-mat.dis-nn cs.SI q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Networks often possess mesoscale structures, and studying them can yield\ninsights into both structure and function. It is most common to study community\nstructure, but numerous other types of mesoscale structures also exist. In this\npaper, we examine core-periphery structures based on both density and\ntransport. In such structures, core network components are well-connected both\namong themselves and to peripheral components, which are not well-connected to\nanything. We examine core-periphery structures in a wide range of examples of\ntransportation, social, and financial networks---including road networks in\nlarge urban areas, a rabbit warren, a dolphin social network, a European\ninterbank network, and a migration network between counties in the United\nStates. We illustrate that a recently developed transport-based notion of node\ncoreness is very useful for characterizing transportation networks. We also\ngeneralize this notion to examine core versus peripheral edges, and we show\nthat the resulting diagnostic is also useful for transportation networks. To\nexamine the properties of transportation networks further, we develop a family\nof generative models of roadlike networks. We illustrate the effect of the\ndimensionality of the embedding space on transportation networks, and we\ndemonstrate that the correlations between different measures of coreness can be\nvery different for different types of networks.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 05:28:11 GMT"}, {"version": "v2", "created": "Thu, 20 Mar 2014 14:34:47 GMT"}], "update_date": "2014-03-21", "authors_parsed": [["Lee", "Sang Hoon", ""], ["Cucuringu", "Mihai", ""], ["Porter", "Mason A.", ""]]}, {"id": "1310.8469", "submitter": "Sergey Petoukhov", "authors": "Ivan V. Stepanyan, Sergey V. Petoukhov", "title": "The matrix method of representation, analysis and classification of long\n  genetic sequences", "comments": "22 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The article is devoted to a matrix method of comparative analysis of long\nnucleotide sequences by means of a presentation of each sequence in a form of\nthree digital binary sequences. This method uses biochemical attributes of\nnucleotides and it also uses a possibility of presentation of every whole set\nof n-mers in a form of one of members of a Kronecker family of genetic\nmatrices. Due to this method, a long nucleotide sequence can be visually\nrepresented as an individual fractal-like mosaic or another regular mosaic of\nbinary type. In contrast to natural nucleotide sequences, artificial random\nsequences give non-regular patterns. Examples of binary mosaics of long\nnucleotide sequences are shown, including cases of human chromosomes and\npenicillins. Interpretation of binary presentations of nucleotide sequences\nfrom the point of view of Gray code is also tested. Possible reasons of genetic\nmeaning of Kronecker multiplication of matrices are analyzed. The received\nresults are discussed.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 12:12:30 GMT"}], "update_date": "2013-11-01", "authors_parsed": [["Stepanyan", "Ivan V.", ""], ["Petoukhov", "Sergey V.", ""]]}, {"id": "1310.8619", "submitter": "James P. Brody", "authors": "James P. Brody", "title": "The age specific incidence anomaly suggests that cancers originate\n  during development", "comments": "11 pages, 4 figures. Paper for a special issue of Biophysical Reviews\n  and Letters: \"Research on the Physics of Cancer: A Global Perspective\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Cancers are caused by the accumulation of genetic alterations. Since this\naccumulation takes time, the incidence of most cancers is thought to increase\nexponentially with age. However, careful measurements of the age-specific\nincidence shows that the specific incidence for many forms of cancer rises with\nage to a maximum, then decreases. This decrease in the age-specific incidence\nwith age is an anomaly. Understanding this anomaly should lead to a better\nunderstanding of how tumors develop and grow. Here I derive the shape of the\nage-specific incidence, showing that it should follow the shape of a Weibull\ndistribution. Measurements indicate that the age-specific incidence for colon\ncancer does indeed follow a Weibull distribution. This analysis leads to the\ninterpretation that for colon cancer two sub-populations exist in the general\npopulation: a susceptible population and an immune population. Colon tumors\nwill only occur in the susceptible population. This analysis is consistent with\nthe developmental origins of disease hypothesis and generalizable to many other\ncommon forms of cancer.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 17:57:27 GMT"}], "update_date": "2013-11-01", "authors_parsed": [["Brody", "James P.", ""]]}]