[{"id": "1411.1498", "submitter": "Vahid Salari", "authors": "B. Hashemibeni, M Sadeghian, M Aliakbari, Z Alinasab, M. Akbari, V.\n  Salari", "title": "Experimental Investigation of Distant Cellular Interaction among Adipose\n  Derived Stem-Cells", "comments": "17 pages, 8 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In addition to chemical and mechanical interactions between cells\nelectromagnetic field produced by cells has been considered as another form of\nsignaling for cell-cell communication. The aim of this study is evaluation of\nelectromagnetic effects on viability of Adipose-derived stem cells (ADSCs)\nwithout co-culturing. In this study, stem cells were isolated from human\nadipose tissue enzymatically and proliferated in monolayer culture. Then,\n5.(10^4) adipose-derived stem cells were cultured in each well of the test\nplate. In the first row (4 wells), ADSCs as inducer cells were cultured in\nDMEM1 with 10 ng/ml Fibroblast growth factor (FGF). In adjacent and the last\nrows, ADSCs were cultured without FGF (as detector cells). After the three and\nfive days the viability of cells were evaluated. Moreover, ADSCs were cultured\nin the same conditions but the inducer cells were placed once in the UV-filter\ntube and once in the quartz tube to see whether there is electromagnetic\ninteraction among cells. Inducer cells caused significant cell proliferation in\nadjacent row cells (p- value<0.01) in the fifth day. However, using the\nUV-filter tube and quartz tube both reduced the effect of inducer cells on\nadjacent cells significantly. As a conclusion, we could detect distant cellular\ninteraction (DCI) among adipose derived stem cells (ADSCs), but it was not\nelectromagnetic signaling. Our results show that ADSCs affect each other via\nvolatile signaling as a chemical distant cellular interaction (CDCI).\n", "versions": [{"version": "v1", "created": "Thu, 6 Nov 2014 04:58:56 GMT"}], "update_date": "2014-11-07", "authors_parsed": [["Hashemibeni", "B.", ""], ["Sadeghian", "M", ""], ["Aliakbari", "M", ""], ["Alinasab", "Z", ""], ["Akbari", "M.", ""], ["Salari", "V.", ""]]}, {"id": "1411.1955", "submitter": "Valeria Aman", "authors": "Valeria Aman", "title": "Is there any measurable benefit in publishing preprints in the arXiv\n  section Quantitative Biology?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A public preprint server such as arXiv allows authors to publish their\nmanuscripts before submitting them to journals for peer review. It offers the\nchance to establish priority by making the results available upon completion.\nThis article presents the arXiv section Quantitative Biology and investigates\nthe advantages of preprint publications in terms of reception, which can be\nmeasured by means of citations. This paper focuses on the publication and\ncitation delay, citation counts and the authors publishing their e-prints on\narXiv. Moreover, the paper discusses the benefit for scientists as well as\npublishers. The results that are based on 12 selected journals show that\nsubmitting preprints to arXiv has become more common in the past few years, but\nthe number of papers submitted to Quantitative Biology is still small and\nrepresents only a fraction of the total research output in biology. An immense\nadvantage of arXiv is to overcome the long publication delay resulting from\npeer review. Although preprints are visible prior to the officially published\narticles, a significant citation advantage was only found for the Journal of\nTheoretical Biology.\n", "versions": [{"version": "v1", "created": "Fri, 7 Nov 2014 15:46:16 GMT"}], "update_date": "2014-11-10", "authors_parsed": [["Aman", "Valeria", ""]]}, {"id": "1411.2205", "submitter": "Liaofu Luo", "authors": "Liaofu Luo", "title": "A Model on Genome Evolution", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model of genome evolution is proposed. Based on three assumptions the\nevolutionary theory of a genome is formulated. The general law on the direction\nof genome evolution is given. Both the deterministic classical equation and the\nstochastic quantum equation are proposed. It is proved that the classical\nequation can be put in a form of the least action principle and the latter can\nbe used for obtaining the quantum generalization of the evolutionary law. The\nwave equation and uncertainty relation for the quantum evolution are deduced\nlogically. It is shown that the classical trajectory is a limiting case of the\ngeneral quantum evolution depicted in the coarse-grained time. The observed\nsmooth/sudden evolution is interpreted by the alternating occurrence of the\nclassical and quantum phases. The speciation event is explained by the quantum\ntransition in quantum phase. Fundamental constants of time dimension, the\nquantization constant and the evolutionary inertia, are introduced for\ncharacterizing the genome evolution. The size of minimum genome is deduced from\nthe quantum uncertainty lower bound. The present work shows the quantum law may\nbe more general than thought, since it plays key roles not only in atomic\nphysics, but also in genome evolution.\n", "versions": [{"version": "v1", "created": "Sun, 9 Nov 2014 07:20:08 GMT"}], "update_date": "2014-11-11", "authors_parsed": [["Luo", "Liaofu", ""]]}, {"id": "1411.2761", "submitter": "Oleg Usatenko", "authors": "S.S. Melnik and O.V. Usatenko", "title": "Entropy and long-range correlations in DNA sequences", "comments": "8 pages, 5 figures", "journal-ref": "Comput.Biol.Chem.53, 26 (2014)", "doi": "10.1016/j.compbiolchem.2014.08.006", "report-no": null, "categories": "q-bio.OT cond-mat.soft cond-mat.stat-mech physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the structure of DNA molecules of different organisms by using the\nadditive Markov chain approach. Transforming nucleotide sequences into binary\nstrings, we perform statistical analysis of the corresponding \"texts\". We\ndevelop the theory of N-step additive binary stationary ergodic Markov chains\nand analyze their differential entropy. Supposing that the correlations are\nweak we express the conditional probability function of the chain by means of\nthe pair correlation function and represent the entropy as a functional of the\npair correlator. Since the model uses two point correlators instead of\nprobability of block occurring, it makes possible to calculate the entropy of\nsubsequences at much longer distances than with the use of the standard\nmethods. We utilize the obtained analytical result for numerical evaluation of\nthe entropy of coarse-grained DNA texts. We believe that the entropy study can\nbe used for biological classification of living species.\n", "versions": [{"version": "v1", "created": "Tue, 11 Nov 2014 10:53:55 GMT"}], "update_date": "2014-11-14", "authors_parsed": [["Melnik", "S. S.", ""], ["Usatenko", "O. V.", ""]]}, {"id": "1411.4908", "submitter": "Valentina Agoni", "authors": "Valentina Agoni", "title": "Beta sheet propensity and the genetic code", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  So far mutations analysis was performed in terms of transitions and\ntrasversions, so on the basis of the molecule, or in terms of GC-content and\nisochors, through the quantification of GC->AT mutations over AT->GC mutations.\nWe tried a different approach hypothesizing that probably we are partially\nprotected (by the genetic code) from amyloid fibrils formation.\n", "versions": [{"version": "v1", "created": "Sun, 9 Nov 2014 18:03:55 GMT"}], "update_date": "2014-11-19", "authors_parsed": [["Agoni", "Valentina", ""]]}, {"id": "1411.5948", "submitter": "Thomas Muller", "authors": "Paolo Bombelli, Thomas M\\\"uller, Therese W. Herling, Christopher J.\n  Howe, and Tuomas P. J. Knowles", "title": "A High Power-Density Mediator-Free Microfluidic Biophotovoltaic Device\n  for Cyanobacterial Cells", "comments": "9 pages, 7 figures, including supporting material. appears in\n  Advanced Energy Materials, in print, 2014", "journal-ref": null, "doi": "10.1002/aenm.201401299", "report-no": null, "categories": "physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biophotovoltaics has emerged as a promising technology for generating\nrenewable energy since it relies on living organisms as inexpensive,\nself-repairing and readily available catalysts to produce electricity from an\nabundant resource - sunlight. The efficiency of biophotovoltaic cells, however,\nhas remained significantly lower than that achievable through synthetic\nmaterials. Here, we devise a platform to harness the large power densities\nafforded by miniaturised geometries. To this effect, we have developed a\nsoft-lithography approach for the fabrication of microfluidic biophotovoltaic\ndevices that do not require membranes or mediators. Synechocystis sp. PCC 6803\ncells were injected and allowed to settle on the anode, permitting the physical\nproximity between cells and electrode required for mediator-free operation. We\ndemonstrate power densities of above 100 mW/m2 for a chlorophyll concentration\nof 100 {\\mu}M under white light, a high value for biophotovoltaic devices\nwithout extrinsic supply of additional energy.\n", "versions": [{"version": "v1", "created": "Fri, 21 Nov 2014 16:44:01 GMT"}], "update_date": "2014-11-24", "authors_parsed": [["Bombelli", "Paolo", ""], ["Müller", "Thomas", ""], ["Herling", "Therese W.", ""], ["Howe", "Christopher J.", ""], ["Knowles", "Tuomas P. J.", ""]]}, {"id": "1411.6576", "submitter": "Larissa Brizhik", "authors": "Larissa Brizhik", "title": "Biological effects of pulsating magnetic fields: role of solitons", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph physics.med-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we analyze biological effects produced by magnetic fields in\norder to elucidate the physical mechanisms, which can produce them. We show\nthat there is a chierarchy of such mechanisms and that the mutual interplay\nbetween them can result in the synergetic outcome. In particular, we analyze\nthe biological effects of magnetic fields on soliton mediated charge transport\nin the redox processes in living organisms. Such solitons are described by\nnonlinear systems of equations and represent electrons that are self-trapped in\nalpha-helical polypeptides due to the moderately strong electron-lattice\ninteraction. They represent a particular type of disssipativeless large\npolarons in low-dimensional systems. We show that the effective mass of\nsolitons in the is different from the mass of free electrons, and that there is\na resonant effect of the magnetic fields on the dynamics of solitons, and,\nhence, on charge transport that accompanies photosynthesis and respiration.\nThese effects can result in non-thermal resonant effects of magnetic fields on\nredox processes in particular, and on the metabolism of the organism in\ngeneral. This can explain physical mechanisms of therapies based on applying\nmagnetic fields.\n", "versions": [{"version": "v1", "created": "Wed, 12 Nov 2014 17:14:41 GMT"}], "update_date": "2014-11-25", "authors_parsed": [["Brizhik", "Larissa", ""]]}]