[{"id": "1507.03197", "submitter": "Chao Wang", "authors": "Jianwei Zhu, Haicang Zhang, Chao Wang, Bin Ling, Wei-Mou Zheng, Dongbo\n  Bu", "title": "TOPO: Improving remote homologue recognition via identifying common\n  protein structure framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein structure prediction remains a challenge in the field of\ncomputational biology. Traditional protein structure prediction approaches\ninclude template-based modelling (say, homology modelling, and threading), and\nab initio. A threading algorithm takes a query protein sequence as input,\nrecognizes the most likely fold, and finally reports the alignments of the\nquery sequence to structure-known templates as output. The existing threading\napproaches mainly utilizes the information of protein sequence profile, solvent\naccessibility, contact probability, etc., and correctly recognize folds for\nsome proteins. However, the existing threading approaches show poorly\nperformance for remote homology proteins. How to improve the fold recognition\nfor remote homology proteins remains to be a difficult task for protein\nstructure prediction.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jul 2015 07:31:22 GMT"}], "update_date": "2015-07-14", "authors_parsed": [["Zhu", "Jianwei", ""], ["Zhang", "Haicang", ""], ["Wang", "Chao", ""], ["Ling", "Bin", ""], ["Zheng", "Wei-Mou", ""], ["Bu", "Dongbo", ""]]}, {"id": "1507.05042", "submitter": "Ricardo Gobato", "authors": "Ricardo Gobato, Desire Francine Gobato Fedrigo and Alekssander Gobato", "title": "Molecular geometry of alkaloids present in seeds of mexican prickly\n  poppy", "comments": "12 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The work is a study of the geometry of the molecules via molecular mechanics\nof the main alkaloids found in the seeds of Argemone Mexicana Linn, a prickly\npoppy, which is considered one of the most important species of plants in\ntraditional Mexican and Indian medicine system. The seeds have toxic properties\nas well as bactericide, hallucinogenic, fungicide, insecticide, in\nisoquinolines and sanguinarine alkaloids such as berberine. A computational\nstudy of the molecular geometry of the molecules through molecular mechanics of\nthe main alkaloids compounds present in plant seeds is described in a computer\nsimulation. The plant has active ingredients compounds: allocryptopine,\nberberine, chelerythrine, copsitine, dihydrosanguinarine, protopine and\nsanguinarine. The studied alkaloids form two groups having similar charge\ndistribution among themselves, which have dipole moments of these two times\nhigher than in the other group.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jul 2015 01:45:44 GMT"}], "update_date": "2015-07-20", "authors_parsed": [["Gobato", "Ricardo", ""], ["Fedrigo", "Desire Francine Gobato", ""], ["Gobato", "Alekssander", ""]]}]