[{"id": "1508.06816", "submitter": "Katar\\'ina Bo\\v{d}ov\\'a", "authors": "Miriam Mal\\'i\\v{c}kov\\'a, Christian Yates, Katar\\'ina Bo\\v{d}ov\\'a", "title": "A stochastic model of ant trail following with two pheromones", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Colonies of ants are systems of interacting living organisms in which\ninteractions between individuals and their environment can produce a reliable\nperformance of a complex tasks without the need for centralised control.\nParticularly remarkable is the process of formation of refined paths between\nthe nest and food sources that is essential for successful foraging. We have\ndesigned a simple stochastic off-lattice model of ant foraging in the absence\nof direct communication. The motion of ants is governed by two components - a\nrandom change in direction of motion that improves ability to explore the\nenvironment (facilitating food discovery), and a non-random global indirect\ninteraction component based on pheromone signalling. Using numerical\nsimulations we have studied the model behaviour in different parameter regimes\nand tested the ability of our model ants to adapt to changes in the external\nenvironment. The simulated behaviour of ants in the model recapitulated the\nexperimentally observed behaviours of real ants. Furthermore we observe\ninteresting synchronization in ant movement patterns which vary with the\ndiffusion properties of the pheromones.\n", "versions": [{"version": "v1", "created": "Thu, 27 Aug 2015 11:46:56 GMT"}], "update_date": "2015-08-28", "authors_parsed": [["Malíčková", "Miriam", ""], ["Yates", "Christian", ""], ["Boďová", "Katarína", ""]]}, {"id": "1508.07244", "submitter": "J. C. Phillips", "authors": "J. C. Phillips", "title": "Vaccine escape in 2013-4 and the hydropathic evolution of glycoproteins\n  of A/H3N2 viruses", "comments": "12 pages, 3 figures", "journal-ref": null, "doi": "10.1016/j.physa.2016.02.040", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  More virulent strains of influenza virus subtypes H1N1 appeared widely in\n2007 and H3N2 in 2011, and especially 2013-4, when the effectiveness of the\nH3N2 vaccine decreased nearly to zero. The amino acid differences of\nneuraminidase from prior less virulent strains appear to be small (<1%) when\ntabulated through sequence alignments and counting site identities and\nsimilarities. Here we show how analyzing fractal hydropathic forces responsible\nfor neuraminidase globular compaction and modularity quantifies the mutational\norigins of increased virulence. It also predicts vaccine escape and specifies\noptimized targets for the 2015 H3N2 vaccine different from the WHO target.\nUnlike some earlier methods based on measuring hemagglutinin antigenic drift\nand ferret sera, which take several years, cover only a few candidate strains,\nand are ambiguous, the new methods are timely and can be completed, using NCBI\nand GISAID amino acid sequences only, in a few days.\n", "versions": [{"version": "v1", "created": "Thu, 27 Aug 2015 19:24:51 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Phillips", "J. C.", ""]]}]