[{"id": "1603.02062", "submitter": "Erich Schmid", "authors": "Erich W. Schmid", "title": "Extracellular stimulation of nerve cells with electric current spikes\n  induced by voltage steps", "comments": "17 pages, 9 figuress", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new stimulation paradigm is presented for the stimulation of nerve cells by\nextracellular electric currents. In the new paradigm stimulation is achieved\nwith the current spike induced by a voltage step whenever the voltage step is\napplied to a live biological tissue. By experimental evidence and theoretical\narguments, it is shown that this spike is well suited for the stimulation of\nnerve cells. Stimulation of the human tongue is used for proof of principle.\nCharge injection thresholds are measured for various voltages. The time-profile\nof the current spike used in the experiment has a half-width of about 1\nmicrosecond. The decay of the spike is non-exponential. The spike has at least\nthree distinctly different phases. A Maxwell phase is followed by a\ncharge-rearrangement phase. Charging of cell membranes is completed in a third\nphase. All three phases contribute to depolarization or hyperpolarization of\ncell membranes. Due to the short duration of the spike the charge transfer is\nvery small. The activation time (time of no return) of nerve cell membranes\nleading to an action potential is measured and found to be unexpectedly short.\nIt can become as short as 3 microseconds for a voltage step of 10 V or higher.\n", "versions": [{"version": "v1", "created": "Sat, 27 Feb 2016 15:22:33 GMT"}], "update_date": "2016-03-08", "authors_parsed": [["Schmid", "Erich W.", ""]]}, {"id": "1603.04429", "submitter": "James Burridge", "authors": "James Burridge and Steven Kenney", "title": "Birdsong dialect patterns explained using magnetic domains", "comments": null, "journal-ref": "Phys. Rev. E 93, 062402 (2016)", "doi": "10.1103/PhysRevE.93.062402", "report-no": null, "categories": "q-bio.PE q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The songs and calls of many bird species, like human speech, form distinct\nregional dialects. We suggest that the process of dialect formation is\nanalogous to the physical process of magnetic domain formation. We take the\ncoastal breeding grounds of the Puget Sound white crowned sparrow as an\nexample. Previous field studies suggest that birds of this species learn\nmultiple songs early in life, and when establishing a territory for the first\ntime, retain one of these dialects in order to match the majority of their\nneighbours. We introduce a simple lattice model of the process, showing that\nthis matching behaviour can produce single dialect domains provided the death\nrate of adult birds is sufficiently low. We relate death rate to thermodynamic\ntemperature in magnetic materials, and calculate the critical death rate by\nanalogy with the Ising model. Using parameters consistent with the known\nbehavior of these birds we show that coastal dialect domain shapes may be\nexplained by viewing them as low temperature \"stripe states\".\n", "versions": [{"version": "v1", "created": "Sat, 12 Mar 2016 22:41:46 GMT"}], "update_date": "2016-06-15", "authors_parsed": [["Burridge", "James", ""], ["Kenney", "Steven", ""]]}, {"id": "1603.06219", "submitter": "J. C. Phillips", "authors": "Vedant Sachdeva and James C. Phillips", "title": "Oxygen Channels and Fractal Wave-Particle Duality in the Evolution of\n  Myoglobin and Neuroglobin", "comments": "27 pages, 12 figures", "journal-ref": null, "doi": "10.1016/j.physa.2016.07.007", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolution of terrestrial and aquatic wild type (WT) globins is dominated\nby changes in two proximate - distal Histidine ligand exit channels, here\nmonitored quantitatively by hydropathic waves. These waves reveal allometric\nfunctional features inaccessible to single amino acid stereochemical contact\nmodels, and even very large all-atom Newtonian simulations. The evolutionary\ndifferences between these features between myoglobin and neuroglobin are\nrelated to the two oxidation channels through hydropathic wave analysis, which\nidentifies subtle interspecies functional differences inaccessible to\ntraditional size and metabolic scaling studies. Our analysis involves dynamic\nsynchronization of allometric interactions across entire globins.\n", "versions": [{"version": "v1", "created": "Sun, 20 Mar 2016 14:25:13 GMT"}], "update_date": "2016-08-24", "authors_parsed": [["Sachdeva", "Vedant", ""], ["Phillips", "James C.", ""]]}]