[{"id": "1710.00652", "submitter": "Piotr Gas Dr", "authors": "Piotr Gas", "title": "Essential Facts on the History of Hyperthermia and their Connections\n  with Electromedicine", "comments": null, "journal-ref": "Przeglad Elektrotechniczny, 2011, 87(12b) 37-40", "doi": null, "report-no": null, "categories": "physics.med-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The term hyperthermia is a combination of two Greek words: HYPER (rise) and\nTHERME (heat) and refers to the increasing of body temperature or selected\ntissues in order to achieve a precise therapeutic effect. This paper reviews\nthe development of thermotherapy by describing the most important moments in\nits history. For decades, the development of hyperthermia ran parallel with the\ndevelopment of cancer treatment and had numerous connections with\nelectromedicine. Throughout its history, hyperthermia evoked a number of hopes,\nbrought spectacular successes, but also was the subject of many\ndisappointments.\n", "versions": [{"version": "v1", "created": "Mon, 2 Oct 2017 14:02:21 GMT"}], "update_date": "2017-10-31", "authors_parsed": [["Gas", "Piotr", ""]]}, {"id": "1710.03571", "submitter": "Plamen L. Simeonov", "authors": "Plamen L. Simeonov and Andr\\'ee C. Ehresmann", "title": "Adapting a Formal Model Theory to Applications in Augmented Personalized\n  Medicine", "comments": "56 pages, 18 figures, technical application paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is to advance an extensible theory of living systems\nusing an approach to biomathematics and biocomputation that suitably addresses\nself-organized, self-referential and anticipatory systems with multi-temporal\nmulti-agents. Our first step is to provide foundations for modelling of\nemergent and evolving dynamic multi-level organic complexes and their\nsustentative processes in artificial and natural life systems. Main\napplications are in life sciences, medicine, ecology and astrobiology, as well\nas robotics, industrial automation and man-machine interface. Since 2011 over\n100 scientists from a number of disciplines have been exploring a substantial\nset of theoretical frameworks for a comprehensive theory of life known as\nIntegral Biomathics. That effort identified the need for a robust core model of\norganisms as dynamic wholes, using advanced and adequately computable\nmathematics. The work described here for that core combines the advantages of a\nsituation and context aware multivalent computational logic for active\nself-organizing networks, Wandering Logic Intelligence (WLI), and a multi-scale\ndynamic category theory, Memory Evolutive Systems (MES), hence WLIMES. This is\npresented to the modeller via a formal augmented reality language as a first\nstep towards practical modelling and simulation of multi-level living systems.\nInitial work focuses on the design and implementation of this visual language\nand calculus (VLC) and its graphical user interface. The results will be\nintegrated within the current methodology and practices of theoretical biology\nand (personalized) medicine to deepen and to enhance the holistic understanding\nof life.\n", "versions": [{"version": "v1", "created": "Sun, 1 Oct 2017 20:10:11 GMT"}, {"version": "v2", "created": "Wed, 25 Oct 2017 11:15:57 GMT"}, {"version": "v3", "created": "Sun, 29 Oct 2017 11:14:32 GMT"}, {"version": "v4", "created": "Mon, 13 Nov 2017 01:37:31 GMT"}], "update_date": "2017-11-15", "authors_parsed": [["Simeonov", "Plamen L.", ""], ["Ehresmann", "Andrée C.", ""]]}]