[{"id": "1811.02478", "submitter": "Ren\\'e Vestergaard", "authors": "Ren\\'e Vestergaard and Emmanuel Pietriga", "title": "Proofs of life: molecular-biology reasoning simulates cell behaviors\n  from first principles", "comments": "37 pages, including 9 figures, plus 244 pages of supplementary\n  information", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We axiomatize the molecular-biology reasoning style, show compliance of the\nstandard reference: Ptashne, A Genetic Switch, and present proof-theory-induced\ntechnologies to help infer phenotypes and to predict life cycles from\ngenotypes. The key is to note that `reductionist discipline' entails\nconstructive reasoning: any proof of a compound property can be decomposed to\nproofs of constituent properties. Proof theory makes explicit the inner\nstructure of the axiomatized reasoning style and allows the permissible\ndynamics to be presented as a mode of computation that can be executed and\nanalyzed. Constructivity and execution guarantee simulation when working over\ndomain-specific languages. Here, we exhibit phenotype properties for genotype\nreasons: a molecular-biology argument is an open-system concurrent computation\nthat results in compartment changes and is performed among processes of\nphysiology change as determined from the molecular programming of given DNA.\nLife cycles are the possible sequentializations of the processes. A main\nimplication of our construction is that formal correctness provides a\ncomplementary perspective on science that is as fundamental there as for pure\nmathematics. The bulk of the presented work has been verified formally correct\nby computer.\n", "versions": [{"version": "v1", "created": "Tue, 30 Oct 2018 11:29:45 GMT"}, {"version": "v2", "created": "Tue, 22 Jan 2019 12:46:36 GMT"}, {"version": "v3", "created": "Mon, 18 Mar 2019 09:00:35 GMT"}], "update_date": "2019-03-19", "authors_parsed": [["Vestergaard", "René", ""], ["Pietriga", "Emmanuel", ""]]}, {"id": "1811.02526", "submitter": "Les Hatton", "authors": "Les Hatton, Gregory Warr", "title": "CoHSI IV: Unifying Horizontal and Vertical Gene Transfer - is Mechanism\n  Irrelevant ?", "comments": "16 pages, 8 figures, 8 tables, 37 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In previous papers we have described with strong experimental support, the\norganising role that CoHSI (Conservation of Hartley-Shannon Information) plays\nin determining important global properties of all known proteins, from defining\nthe length distribution, to the natural emergence of very long proteins and\ntheir relationship to evolutionary time. Here we consider the insight that\nCoHSI might bring to a different problem, the distribution of identical\nproteins across species. Horizontal and Vertical Gene Transfer (HGT/VGT) both\nlead to the replication of protein sequences across species through a diversity\nof mechanisms some of which remain unknown. In contrast, CoHSI predicts from\nfundamental theory that such systems will demonstrate power law behavior\nindependently of any mechanisms, and using the Uniprot database we show that\nthe global pattern of protein re-use is emphatically linear on a log-log plot\n(adj. $R^{2} = 0.99, p < 2.2 \\times 10^{-16}$ over 4 decades); i.e. it is\nextremely close to the predicted power law. Specifically we show that over 6.9\nmillion proteins in TrEMBL 18-02 are re-used, i.e. their sequence appears\nidentically in between 2 and 9,812 species, with re-used proteins varying in\nlength from 7 to as long as 14,596 amino acids. Using (DL+V) to denote the\nthree domains of life plus viruses, 21,676 proteins are shared between two\n(DL+V); 22 between three (DL+V) and 5 are shared in all four (DL+V). Although\nthe majority of protein re-use occurs between bacterial species those proteins\nmost frequently re-used occur disproportionately in viruses, which play a\nfundamental role in this distribution.\n  These results suggest that diverse mechanisms of gene transfer (including\ntraditional inheritance) are irrelevant in determining the global distribution\nof protein re-use.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2018 17:40:05 GMT"}], "update_date": "2018-11-07", "authors_parsed": [["Hatton", "Les", ""], ["Warr", "Gregory", ""]]}, {"id": "1811.05205", "submitter": "Thu Thuy Nguyen", "authors": "C. Burdet, J. Guegan, X. Duval, M. Le Tyrant, H. Bergeron (ISMO), C.\n  Manuguerra, J. Raude, C. Leport (IAME), P. Zylberman", "title": "The need for an integrative thinking to fight against emerging\n  infectious diseases", "comments": null, "journal-ref": "Epidemiology and Public Health / Revue d'Epid{\\'e}miologie et de\n  Sant{\\'e} Publique, Elsevier Masson, 2018, 66 (1), pp.81 - 90", "doi": "10.1016/j.respe.2017.08.001", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present here the proceedings of the 5th seminar on emerging infectious\ndiseases (EIDs), held in Paris on March 22nd, 2016, with seven priority\nproposals that can be outlined as follows:$\\bullet$Encourage research on the\nprediction, screening and early detection of new risks of\ninfection$\\bullet$Develop research and surveillance concerning transmission of\npathogens between animals and humans, with their reinforcement in particular in\nintertropical areas (`hot-spots') thanks to public support$\\bullet$Pursue aid\ndevelopment and support in these areas of prevention and training for local\nhealth personnel, and to foster risk awareness in the population$\\bullet$Ensure\nadapted patient care in order to promote adherence to treatment and to epidemic\npropagation reduction measures$\\bullet$Develop greater sensitization and\ntraining among politicians and healthcare providers, in order to better prepare\nthem to respond to new types of crises$\\bullet$Modify the logic of governance,\ndrawing from all available modes of communication and incorporating new\ninformation-sharing tools$\\bullet$Develop economic research on the fight\nagainst EIDs, taking into account specific driving factors in order to create a\nbalance between preventive and treatment approaches.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2018 10:49:05 GMT"}], "update_date": "2018-11-14", "authors_parsed": [["Burdet", "C.", "", "ISMO"], ["Guegan", "J.", "", "ISMO"], ["Duval", "X.", "", "ISMO"], ["Tyrant", "M. Le", "", "ISMO"], ["Bergeron", "H.", "", "ISMO"], ["Manuguerra", "C.", "", "IAME"], ["Raude", "J.", "", "IAME"], ["Leport", "C.", "", "IAME"], ["Zylberman", "P.", ""]]}]