[{"id": "1812.02003", "submitter": "Bernard Feldman", "authors": "Bernard J. Feldman", "title": "Thermoregulation in mice, rats and humans: An insight into the evolution\n  of human hairlessness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The thermoregulation system in animals removes body heat in hot temperatures\nand retains body heat in cold temperatures. The better the animal removes heat,\nthe worse the animal retains heat and visa versa. It is the balance between\nthese two conflicting goals that determines the mammal's size, heart rate and\namount of hair. The rat's loss of tail hair and human's loss of its body hair\nare responses to these conflicting thermoregulation needs as these animals\nevolved to larger size over time.\n", "versions": [{"version": "v1", "created": "Tue, 4 Dec 2018 15:17:31 GMT"}], "update_date": "2018-12-06", "authors_parsed": [["Feldman", "Bernard J.", ""]]}, {"id": "1812.05992", "submitter": "Soraida Fiol Gonzalez", "authors": "Soraida Fiol Gonz\\'alez", "title": "La fauna de mam\\'iferos f\\'osiles del dep\\'osito paleontol\\'ogico \"El\n  Abr\\'on\" (nivel ix), Pinar del R\\'io, Cuba", "comments": "in Spanish. Advisor: Joao G. Mart\\'inez L\\'opez", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \"El Abr\\'on\" is a fossil deposit located in Pinar del Rio, Cuba, and whose\nage is only reference level VII (17 406 years BP), it is classified as the\nlargest collection of fossils accumulated for our archipelago, produced by\ntrophic action of barn owls for thousands of years. The aim of this study was\nto determine the living taxonomic composition of the fauna of extinct mammals,\nand throughout the paleontological study of the deeper level of said tank\n(Level IX). The extracted material which it is currently stored in the\nwarehouse of paleontological collections of the National Museum of Natural\nHistory in Havana, Cuba (MNHNCu) was analyzed. We proceeded to clean the bones,\nto classify and to identify them from the species and also the taphonomic\nanalysis of the condition of the remains. It was found that the mammal fauna of\nthe paleontological deposit under study is composed essentially of 3 orders, 7\nfamilies and 14 species. The most significative order is Chiroptera (bat\nfauna), represented by 4 families, 9 genus and 9 species of the total which\nwere identified. There were reported four species of bats Erophylla sezecorni,\nMonophyllus redmani, Pteronotus parnelli and Tadarida brasiliensis in the\nlocation. The results are the basis of the future paleoecological studies in\norder to reconstruct the natural history of these species. Moreover, the\ndiscovery of new species in this area is a contribution to the knowledge about\nthe distribution of these species in the Cuban archipelago and the age of them.\nFinally, the taphonomic analysis of the conservation status of these remains\npermitted the understanding of the processes that gave rise to the tank and its\ncharacteristics, and also it contribute to an adequate estimation of the\nspecies present in it and the relationship between spatiotemporal with the\nfossil.\n", "versions": [{"version": "v1", "created": "Fri, 14 Dec 2018 15:53:01 GMT"}], "update_date": "2018-12-17", "authors_parsed": [["González", "Soraida Fiol", ""]]}, {"id": "1812.07522", "submitter": "Antonio Culla", "authors": "Andrea Cavagna and Antonio Culla and Luca Di Carlo and Irene Giardina\n  and Tomas S. Grigera", "title": "Low-temperature marginal ferromagnetism explains anomalous scale-free\n  correlations in natural flocks", "comments": "14 pages, 8 pdf figures", "journal-ref": "Comptes Rendus Physique, Volume 20, Issue 4, May-June 2019, Pages\n  319-328", "doi": "10.1016/j.crhy.2019.05.008", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new ferromagnetic model capable of reproducing one of the most\nintriguing properties of collective behaviour in starling flocks, namely the\nfact that strong collective order of the system coexists with scale-free\ncorrelations of the modulus of the microscopic degrees of freedom, that is the\nbirds' speeds. The key idea of the new theory is that the single-particle\npotential needed to bound the modulus of the microscopic degrees of freedom\naround a finite value, is marginal, that is has zero curvature. We study the\nmodel by using mean-field approximation and Monte Carlo simulations in three\ndimensions, complemented by finite-size scaling analysis. While at the standard\ncritical temperature, $T_c$, the properties of the marginal model are exactly\nthe same as a normal ferromagnet with continuous symmetry-breaking, our results\nshow that a novel zero-temperature critical point emerges, so that in its\ndeeply ordered phase the marginal model develops divergent susceptibility and\ncorrelation length of the modulus of the microscopic degrees of freedom, in\ncomplete analogy with experimental data on natural flocks of starlings.\n", "versions": [{"version": "v1", "created": "Tue, 18 Dec 2018 17:39:12 GMT"}, {"version": "v2", "created": "Tue, 17 Sep 2019 13:57:11 GMT"}], "update_date": "2019-09-18", "authors_parsed": [["Cavagna", "Andrea", ""], ["Culla", "Antonio", ""], ["Di Carlo", "Luca", ""], ["Giardina", "Irene", ""], ["Grigera", "Tomas S.", ""]]}, {"id": "1812.10421", "submitter": "Vyacheslav Volov", "authors": "V.V. Eskov, V.T. Volov, V.M. Eskov, L.K. Ilyashenko", "title": "Chaotic dynamics of movements stochastic instability and the hypothesis\n  of N.A. Bernstein about \"repetition without repetition\"", "comments": "13 pages, 2 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT nlin.CD physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The registration of tremor was performed in two groups of subjects (15 people\nin each group) with different physical fitness at rest and at a static loads of\n3N. Each subject has been tested 15 series (number of series N=15) in both\nstates (with and without physical loads) and each series contained 15 samples\n(n=15) of tremorogramm measurements (500 elements in each sample, registered\ncoordinates x1(t) of the finger position relative to eddy current sensor) of\nthe finger. Using non-parametric Wilcoxon test of each series of experiment a\npairwise comparison was made forming 15 tables in which the results of\ncalculation of pairwise comparison was presented as a matrix (15x15) for\ntremorogramms are presented. The average number of hits random pairs of samples\n(<k>) and standard deviation {\\sigma} were calculated for all 15 matrices\nwithout load and under the impact of physical load (3N), which showed an\nincrease almost in twice in the number k of pairs of matching samples of\ntremorogramms at conditions of a static load. For all these samples it was\ncalculated special quasi-attractor (this square was presented the distinguishes\nbetween physical load and without it. All samples present the stochastic\nunstable state.\n", "versions": [{"version": "v1", "created": "Fri, 21 Dec 2018 16:39:00 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Eskov", "V. V.", ""], ["Volov", "V. T.", ""], ["Eskov", "V. M.", ""], ["Ilyashenko", "L. K.", ""]]}]