[{"id": "1907.03119", "submitter": "Pavlos Kolias", "authors": "Pavlos Kolias and Alexandra Papadopoulou", "title": "Investigating some attributes of periodicity in DNA sequences via\n  semi-Markov modelling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  DNA segments and sequences have been studied thoroughly during the past\ndecades. One of the main problems in computational biology is the\nidentification of exon-intron structures inside genes using mathematical\ntechniques. Previous studies have used different methods, such as Fourier\nanalysis and hidden-Markov models, in order to be able to predict which parts\nof a gene correspond to a protein encoding area. In this paper, a semi-Markov\nmodel is applied to 3-base periodic sequences, which characterize the\nprotein-coding regions of the gene. Analytic forms of the related probabilities\nand the corresponding indexes are provided, which yield a description of the\nunderlying periodic pattern. Last, the previous theoretical results are\nillustrated with DNA sequences of synthetic and real data.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jul 2019 11:58:51 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Kolias", "Pavlos", ""], ["Papadopoulou", "Alexandra", ""]]}, {"id": "1907.05529", "submitter": "Leo Marcus", "authors": "Leo Marcus", "title": "A Model-Theoretic Approach to Modular Implementation, with Application\n  to Biological Systems", "comments": "19 pages Reason for withdrawal: There is an erroneous theorem, or at\n  least one that needs further explication", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a method for logical specification of the behavior of a system\nbased on the specification of its components and for representing and\nspecifying the effect of a class of communication \"signaling pathways\" among\nthem. Variations in the actions and effects (semantics) of the pathways can be\nseen in the resulting system. We show how to \"enrich\" the behavior of the\noriginal components by exactly what is provided by the signaling pathways. This\nhas the potential to allow a formal proof of a property of the system as a\nwhole, or a formal diagnosis why a system of communicating modules may not\nsatisfy a desired specification, and if and how it can be \"fixed.\" There are\nfive distinct stages in our view: 1. A description of the connections between\npotential components at the level of which potential modules are connected. 2.\nSpecific choices for those modules 3. An \"elaboration\" of the connections among\ndifferent modules to connections among members of those different modules 4. A\ndescription of the semantics of those connections (what they actually do) 5. A\n\"padding\" of the modules chosen in step 2 to allow for the action of the\nconnections (step 3), as described in step 4. The formalism is completely\nhierarchical -- in other words, the formalism works equally for the system as a\nwhole, for each of the modules, and for any larger system in which the original\nsystem is a component. As it turns out, for whatever reason -- perhaps\nevolutionary advantage optimization at the right level of abstraction -- many\nbiological systems are hierarchically modular, with the modules communicating\nvia various pathways. Thus, a formalism such as the one presented here could\nhave application to questions in biology.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jul 2019 00:26:21 GMT"}, {"version": "v2", "created": "Thu, 5 Sep 2019 18:18:40 GMT"}], "update_date": "2019-09-09", "authors_parsed": [["Marcus", "Leo", ""]]}, {"id": "1907.13472", "submitter": "Jean-Marc Ginoux", "authors": "Jean-Marc Ginoux (LIS), Heikki Ruskeep\\\"a\\\"a, Matja\\v{z} Perc, Roomila\n  Naeck, V\\'eronique Di Costanzo, Moez Bouchouicha (LIS), Farhat Fnaiech,\n  Mounir Sayadi, Takoua Hamdi", "title": "Is type 1 diabetes a chaotic phenomenon?", "comments": null, "journal-ref": "Chaos, Solitons & Fractals 111, 198-205 (2018)", "doi": "10.1016/j.chaos.2018.03.033", "report-no": null, "categories": "q-bio.OT nlin.CD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A database of ten type 1 diabetes patients wearing a continuous glucose\nmonitoring device has enabled to record their blood glucose continuous\nvariations every minute all day long during fourteen consecutive days. These\nrecordings represent, for each patient, a time series consisting of 1 value of\nglycaemia per minute during 24 hours and 14 days, i.e., 20,160 data point.\nThus, while using numerical methods, these time series have been anonymously\nanalyzed. Nevertheless, because of the stochastic inputs induced by daily\nactivities of any human being, it has not been possible to discriminate chaos\nfrom noise. So, we have decided to keep only the 14 nights of these ten\npatients. Then, the determination of the time delay and embedding dimension\naccording to the delay coordinate embedding method has allowed us to estimate\nfor each patient the correlation dimension and the maximal Lyapunov exponent.\nThis has led us to show that type 1 diabetes could indeed be a chaotic\nphenomenon. Once this result has been confirmed by the determinism test, we\nhave computed the Lyapunov time and found that the limit of predictability of\nthis phenomenon is nearly equal to half the 90-minutes sleep-dream cycle. We\nhope that our results will prove to be useful to characterize and predict blood\nglucose variations.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jul 2019 13:09:02 GMT"}], "update_date": "2019-08-07", "authors_parsed": [["Ginoux", "Jean-Marc", "", "LIS"], ["Ruskeepää", "Heikki", "", "LIS"], ["Perc", "Matjaž", "", "LIS"], ["Naeck", "Roomila", "", "LIS"], ["Di Costanzo", "Véronique", "", "LIS"], ["Bouchouicha", "Moez", "", "LIS"], ["Fnaiech", "Farhat", ""], ["Sayadi", "Mounir", ""], ["Hamdi", "Takoua", ""]]}]