[{"id": "1908.00785", "submitter": "Francois Coste", "authors": "Fran\\c{c}ois Coste (Dyliss)", "title": "Deep learning languages: a key fundamental shift from probabilities to\n  weights?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT cs.CL cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent successes in language modeling, notably with deep learning methods,\ncoincide with a shift from probabilistic to weighted representations. We raise\nhere the question of the importance of this evolution, in the light of the\npractical limitations of a classical and simple probabilistic modeling approach\nfor the classification of protein sequences and in relation to the need for\nprincipled methods to learn non-probabilistic models.\n", "versions": [{"version": "v1", "created": "Fri, 2 Aug 2019 10:09:51 GMT"}], "update_date": "2019-08-05", "authors_parsed": [["Coste", "François", "", "Dyliss"]]}, {"id": "1908.01234", "submitter": "Lorenzo Fassina PhD", "authors": "Maria Evelina Mognaschi, Paolo Di Barba, Giovanni Magenes, Andrea\n  Lenzi, Fabio Naro, Lorenzo Fassina", "title": "Field models and numerical dosimetry inside an extremely-low-frequency\n  electromagnetic bioreactor: the theoretical link between the\n  electromagnetically induced mechanical forces and the biological mechanisms\n  of the cell tensegrity", "comments": null, "journal-ref": "SpringerPlus 2014;3:473", "doi": "10.1186/2193-1801-3-473", "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We have implemented field models and performed a detailed numerical dosimetry\ninside our extremely-low-frequency electromagnetic bioreactor which has been\nsuccessfully used in $\\textit{in vitro}$ Biotechnology and Tissue Engineering\nresearches. The numerical dosimetry permitted to map the magnetic induction\nfield (maximum module equal to about 3.3 mT) and to discuss its biological\neffects in terms of induced electric currents and induced mechanical forces\n(compression and traction). So, in the frame of the\ntensegrity-mechanotransduction theory of Ingber, the study of these\nelectromagnetically induced mechanical forces could be, in our opinion, a\npowerful tool to understand some effects of the electromagnetic stimulation\nwhose mechanisms remain still elusive.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2019 20:59:56 GMT"}], "update_date": "2019-08-06", "authors_parsed": [["Mognaschi", "Maria Evelina", ""], ["Di Barba", "Paolo", ""], ["Magenes", "Giovanni", ""], ["Lenzi", "Andrea", ""], ["Naro", "Fabio", ""], ["Fassina", "Lorenzo", ""]]}, {"id": "1908.01472", "submitter": "Chunyang Ma", "authors": "C. Y. Ma", "title": "A trial for theoretical prediction of microalgae growth for parallel\n  flow", "comments": "23 pages, 4 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many models established for solving the problem of the prediction of\nmicroalgae growth. However, the models are semi-empirical or considerable\nfitting coefficients exist in the theoretical model. Therefore, the prediction\nability of the model is reduced by the fitting coefficients. The growth\nmechanism of microalgae is not clearly understood until now, and the growth\nstate is related to the microalgae strains. The above reasons conducted the\nproblem of microalgae growth is much difficult in theoretical prediction.\nFurthermore, the predicted results of the established models are dependent on\nthe size of the photobioreactor (PBR), light intensity, flow field, and\nconcentration field. Therefore, the growth rate of the dependent variable is\nthe function of independent variables including nutrients concentration, light\nintensity, flow field, PBR size, temperature, pH. The experimental works are\n106 for each independent variable selects 10 values of 6 variables which can\nnot be accomplished. The dimensionless method maybe provide a way to solve the\nproblem. In this paper, the analytical solution of the growth rate was obtained\nfor the parallel flow. The dimensionless growth rate expressed as function of\nReynolds number and Schmidt number, which can be used for arbitrary parallel\nflow due to the parameters are expressed as dimensionless quantity. The\nsolution of growth rate was used to predict the experimentally measured data.\nThe results show that the theoretically predicted growth rate is consistent\nwith the experimentally measured growth rate of microalgae on the order of\nmagnitude. These results will be useful in the design and operation of PBRs for\nbiofuel production.\n", "versions": [{"version": "v1", "created": "Mon, 5 Aug 2019 05:25:35 GMT"}], "update_date": "2019-08-06", "authors_parsed": [["Ma", "C. Y.", ""]]}, {"id": "1908.03342", "submitter": "Farhang Yeganegi", "authors": "Salman Mohamadi, Farhang Yeganegi, Hamidreza Amindavar", "title": "A New Framework For Spatial Modeling And Synthesis of Genome Sequence", "comments": "6 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper provides a framework in order to statistically model sequences\nfrom human genome, which is allowing a formulation to synthesize gene\nsequences. We start by converting the alphabetic sequence of genome to decimal\nsequence by Huffman coding. Then, this decimal sequence is decomposed by HP\nfilter into two components, trend and cyclic. Next, a statistical modeling,\nARIMA-GARCH, is implemented on trend component exhibiting heteroskedasticity,\nautoregressive integrated moving average (ARIMA) to capture the linear\ncharacteristics of the sequence and later, generalized autoregressive\nconditional heteroskedasticity (GARCH) is then appropriated for the statistical\nnonlinearity of genome sequence. This modeling approach synthesizes a given\ngenome sequence regarding to its statistical features. Finally, the PDF of a\ngiven sequence is estimated using Gaussian mixture model and based on estimated\nPDF, we determine a new PDF presenting sequences that counteract statistically\nthe original sequence. Our strategy is performed on several genes as well as\nHIV nucleotide sequence and corresponding results is presented.\n", "versions": [{"version": "v1", "created": "Fri, 9 Aug 2019 07:21:13 GMT"}], "update_date": "2019-08-12", "authors_parsed": [["Mohamadi", "Salman", ""], ["Yeganegi", "Farhang", ""], ["Amindavar", "Hamidreza", ""]]}, {"id": "1908.06746", "submitter": "Mohsen Shahhosseini", "authors": "Mohsen Shahhosseini, Rafael A. Martinez-Feria, Guiping Hu, Sotirios V.\n  Archontoulis", "title": "Maize Yield and Nitrate Loss Prediction with Machine Learning Algorithms", "comments": null, "journal-ref": "Environmental Research Letters 14(12) (2019) 124026", "doi": "10.1088/1748-9326/ab5268", "report-no": null, "categories": "q-bio.OT cs.LG stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pre-season prediction of crop production outcomes such as grain yields and N\nlosses can provide insights to stakeholders when making decisions. Simulation\nmodels can assist in scenario planning, but their use is limited because of\ndata requirements and long run times. Thus, there is a need for more\ncomputationally expedient approaches to scale up predictions. We evaluated the\npotential of five machine learning (ML) algorithms as meta-models for a\ncropping systems simulator (APSIM) to inform future decision-support tool\ndevelopment. We asked: 1) How well do ML meta-models predict maize yield and N\nlosses using pre-season information? 2) How many data are needed to train ML\nalgorithms to achieve acceptable predictions?; 3) Which input data variables\nare most important for accurate prediction?; and 4) Do ensembles of ML\nmeta-models improve prediction? The simulated dataset included more than 3\nmillion genotype, environment and management scenarios. Random forests most\naccurately predicted maize yield and N loss at planting time, with a RRMSE of\n14% and 55%, respectively. ML meta-models reasonably reproduced simulated maize\nyields but not N loss. They also differed in their sensitivities to the size of\nthe training dataset. Across all ML models, yield prediction error decreased by\n10-40% as the training dataset increased from 0.5 to 1.8 million data points,\nwhereas N loss prediction error showed no consistent pattern. ML models also\ndiffered in their sensitivities to input variables. Averaged across all ML\nmodels, weather conditions, soil properties, management information and initial\nconditions were roughly equally important when predicting yields. Modest\nprediction improvements resulted from ML ensembles. These results can help\naccelerate progress in coupling simulation models and ML toward developing\ndynamic decision support tools for pre-season management.\n", "versions": [{"version": "v1", "created": "Wed, 14 Aug 2019 18:43:24 GMT"}, {"version": "v2", "created": "Tue, 20 Aug 2019 18:23:37 GMT"}, {"version": "v3", "created": "Thu, 29 Aug 2019 17:48:56 GMT"}, {"version": "v4", "created": "Thu, 19 Sep 2019 15:12:00 GMT"}, {"version": "v5", "created": "Fri, 6 Nov 2020 18:18:11 GMT"}], "update_date": "2020-11-09", "authors_parsed": [["Shahhosseini", "Mohsen", ""], ["Martinez-Feria", "Rafael A.", ""], ["Hu", "Guiping", ""], ["Archontoulis", "Sotirios V.", ""]]}]