[{"id": "2002.05114", "submitter": "Nam Lyong Kang", "authors": "Nam. Lyong Kang", "title": "New method for evaluating fitness using the waist-to-height ratio among\n  Korean adults", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objectives: This paper introduces a new method for evaluating fitness and\ndetermining effective exercises for reducing abdominal obesity in Korean adults\nusing the new kind of waist-to-height ratio (WHT2R). Materials and Methods: The\nbody mass index (BMI), body shape index (ABSI), and two other waist-to-height\nratios (WHT.5R, WHTR) were considered as possible contenders for the WHT2R. The\ncorrelation coefficients were calculated by correlation analyses between the\nindices and four fitness tests for comparison. The LMV (lump mean value) and\nFSPW (fitness sensitivity percentage to WHT2R) were introduced to find the\nassociation between fitness and abdominal obesity using a linear regression\nmethod and to use as an indicator for the effective control of abdominal\nobesity. Results: The WHT2R is more suitable for assessing fitness than the\nother indices and can be controlled effectively by decreasing the 10-m shuttle\nrun score for both males and females. Conclusions: The WHT2R can be used as a\npossible contender for evaluating fitness and is an effective indicator for the\nreduction of abdominal obesity. The LMV and FSPW can be used to establish\npersonal exercise aims.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 01:19:17 GMT"}], "update_date": "2020-02-13", "authors_parsed": [["Kang", "Nam. Lyong", ""]]}, {"id": "2002.07112", "submitter": "Z.X. Hu", "authors": "Zixin Hu, Qiyang Ge, Shudi Li, Li Jin and Momiao Xiong", "title": "Artificial Intelligence Forecasting of Covid-19 in China", "comments": "14 pages, 5 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BACKGROUND An alternative to epidemiological models for transmission dynamics\nof Covid-19 in China, we propose the artificial intelligence (AI)-inspired\nmethods for real-time forecasting of Covid-19 to estimate the size, lengths and\nending time of Covid-19 across China. METHODS We developed a modified stacked\nauto-encoder for modeling the transmission dynamics of the epidemics. We\napplied this model to real-time forecasting the confirmed cases of Covid-19\nacross China. The data were collected from January 11 to February 27, 2020 by\nWHO. We used the latent variables in the auto-encoder and clustering algorithms\nto group the provinces/cities for investigating the transmission structure.\nRESULTS We forecasted curves of cumulative confirmed cases of Covid-19 across\nChina from Jan 20, 2020 to April 20, 2020. Using the multiple-step forecasting,\nthe estimated average errors of 6-step, 7-step, 8-step, 9-step and 10-step\nforecasting were 1.64%, 2.27%, 2.14%, 2.08%, 0.73%, respectively. We predicted\nthat the time points of the provinces/cities entering the plateau of the\nforecasted transmission dynamic curves varied, ranging from Jan 21 to April 19,\n2020. The 34 provinces/cities were grouped into 9 clusters. CONCLUSIONS The\naccuracy of the AI-based methods for forecasting the trajectory of Covid-19 was\nhigh. We predicted that the epidemics of Covid-19 will be over by the middle of\nApril. If the data are reliable and there are no second transmissions, we can\naccurately forecast the transmission dynamics of the Covid-19 across the\nprovinces/cities in China. The AI-inspired methods are a powerful tool for\nhelping public health planning and policymaking.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 18:14:47 GMT"}, {"version": "v2", "created": "Sun, 1 Mar 2020 05:19:42 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Hu", "Zixin", ""], ["Ge", "Qiyang", ""], ["Li", "Shudi", ""], ["Jin", "Li", ""], ["Xiong", "Momiao", ""]]}, {"id": "2002.07480", "submitter": "Kizito Nkurikiyeyezu", "authors": "Kizito Nkurikiyeyezu, Yuta Suzuki, Yoshito Tobe, Guillaume Lopez,\n  Kiyoshi Itao", "title": "Heart Rate Variability as an Indicator of Thermal Comfort State", "comments": null, "journal-ref": "2017 56th Annual Conference of the Society of Instrument and\n  Control Engineers of Japan (SICE)", "doi": "10.23919/SICE.2017.8105506", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Thermal comfort is a personal assessment of one's satisfaction with the\nsurroundings. Yet, most thermal comfort delivery mechanisms preclude\nphysiological and psychological precursors to thermal comfort. Accordingly,\nmany people feel either cold or hot in an environment that is supposedly\nthermally comfortable to most people. To address this issue, this paper\nproposes to use people's heart rate variability (HRV) as an alternative\nindicator of thermal comfort. Since HRV is linked to homeostasis, we\nhypothesize that it could be used to predict people's thermal comfort status.\nTo test our hypothesis, we analyzed statistical, spectral, and nonlinear HRV\nindices of 17 human subjects doing light office work in a cold, a neutral, and\na hot environment. The resulting HRV indices were used as inputs to machine\nlearning classification algorithms. We observed that HRV is distinctively\naltered depending on the thermal environment and that it is possible to\nsteadfastly predict each subject's thermal environment (cold, neutral, and hot)\nwith up to a 93.7% prediction accuracy. The result of this study implies that\nit could be possible to design automatic real-Time thermal comfort controllers\nbased on people's HRV.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 10:38:11 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Nkurikiyeyezu", "Kizito", ""], ["Suzuki", "Yuta", ""], ["Tobe", "Yoshito", ""], ["Lopez", "Guillaume", ""], ["Itao", "Kiyoshi", ""]]}, {"id": "2002.12138", "submitter": "Noemie Globus", "authors": "Noemie Globus, Roger D. Blandford", "title": "The Chiral Puzzle of Life", "comments": "18 pages, 6 figures, accepted for publication in The Astrophysical\n  Journal Letters. arXiv admin note: text overlap with arXiv:1911.02525", "journal-ref": null, "doi": "10.3847/2041-8213/ab8dc6", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological molecules chose one of two structurally, chiral systems which are\nrelated by reflection in a mirror. It is proposed that this choice was made,\ncausally, by magnetically polarized and physically chiral cosmic-rays, which\nare known to have a large role in mutagenesis. It is shown that the cosmic rays\ncan impose a small, but persistent, chiral bias in the rate at which they\ninduce structural changes in simple, chiral monomers that are the building\nblocks of biopolymers. A much larger effect should be present with helical\nbiopolymers, in particular, those that may have been the progenitors of RNA and\nDNA. It is shown that the interaction can be both electrostatic, just involving\nthe molecular electric field, and electromagnetic, also involving a magnetic\nfield. It is argued that this bias can lead to the emergence of a single,\nchiral life form over an evolutionary timescale. If this mechanism dominates,\nthen the handedness of living systems should be universal. Experiments are\nproposed to assess the efficacy of this process.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2020 20:02:56 GMT"}, {"version": "v2", "created": "Fri, 1 May 2020 18:13:41 GMT"}], "update_date": "2020-05-27", "authors_parsed": [["Globus", "Noemie", ""], ["Blandford", "Roger D.", ""]]}, {"id": "2002.12784", "submitter": "Alexander Kholmanskiy", "authors": "Alexander Kholmanskiy, Nataliya Zaytseva", "title": "Dependence of chlorophyll content in leaves from light regime,\n  electromagnetic fields and plant species", "comments": null, "journal-ref": "JOJ Hortic Arboric. 2020; 3(1): 555602", "doi": "10.19080/JOJHA.2020.03.555602", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The regularity of the distribution of chlorophylls content in a series of 30\ncultivated plants and 75 steppe grasses was studied. The increased content of\nchlorophyll and magnesium in vegetables and grains compared with greens and\nsteppe grasses is associated with more complex genetics of metabolism, which\nhas stages of flowering and fruiting. The chlorophyll content increases with\nthe use of LED phytoirradiators with an emission band coinciding with the first\nabsorption band of chlorophyll. Industrial electromagnetic fields can affect\nthe biosynthesis of pigments in deciduous trees, but cultivated herbaceous\nplants are not sensitive to them.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2020 15:01:52 GMT"}], "update_date": "2021-03-30", "authors_parsed": [["Kholmanskiy", "Alexander", ""], ["Zaytseva", "Nataliya", ""]]}]