[{"id": "2003.00328", "submitter": "Gerhard Mayer", "authors": "Gerhard Mayer", "title": "Mass spectrometry for semi-experimental protein structure determination\n  and modeling", "comments": "28 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The structure of proteins is essential for its function. The determination of\nprotein structures is possible by experimental or predicted by computational\nmethods, but also a combination of both approaches is possible. Here, first an\noverview about experimental structure determination methods with their pros and\ncons is given. Then we describe how mass spectrometry is useful for\nsemi-experimental integrative protein structure determination. We review the\nmethodology and describe software programs supporting such integrated protein\nstructure prediction approaches, making use of distance constraints got from\nmass spectrometry cross-linking experiments\n", "versions": [{"version": "v1", "created": "Sat, 29 Feb 2020 18:43:09 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Mayer", "Gerhard", ""]]}, {"id": "2003.01553", "submitter": "Alex Kasman", "authors": "Alex Kasman and Brenton LeMesurier", "title": "Did Sequence Dependent Geometry Influence the Evolution of the Genetic\n  Code?", "comments": "To appear in Contemporary Mathematics", "journal-ref": null, "doi": "10.1090/conm/746/15001", "report-no": null, "categories": "q-bio.OT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The genetic code is the function from the set of codons to the set of amino\nacids by which a DNA sequence encodes proteins. Since the codons also influence\nthe shape of the DNA molecule itself, the same sequence that encodes a protein\nalso has a separate geometric interpretation. A question then arises: How\nwell-duplexed are these two \"codes\"? In other words, in choosing a genetic\nsequence to encode a particular protein, how much freedom does one still have\nto vary the geometry (or vice versa). A recent paper by the first author\naddressed this question using two different methods. After reviewing those\nresults, this paper addresses the same question with a third method: the use of\nMonte Carlo and Gaussian sampling methods to approximate a multi-integral\nrepresenting the mutual information of a variety of possible genetic codes.\nOnce again, it is found that the genetic code used in nuclear DNA has a\nslightly lower than average duplexing efficiency as compared with other\nhypothetical genetic codes. A concluding section discusses the significance of\nthese surprising results.\n", "versions": [{"version": "v1", "created": "Sun, 1 Mar 2020 19:18:37 GMT"}], "update_date": "2020-03-04", "authors_parsed": [["Kasman", "Alex", ""], ["LeMesurier", "Brenton", ""]]}, {"id": "2003.01812", "submitter": "Matthew Macauley", "authors": "Matthew Macauley, Nora Youngs", "title": "The case for algebraic biology: from research to education", "comments": "14 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though it goes without saying that linear algebra is fundamental to\nmathematical biology, polynomial algebra is less visible. In this article, we\nwill give a brief tour of four diverse biological problems where multivariate\npolynomials play a central role -- a subfield that is sometimes called\n\"algebraic biology.\" Namely, these topics include biochemical reaction\nnetworks, Boolean models of gene regulatory networks, algebraic statistics and\ngenomics, and place fields in neuroscience. After that, we will summarize the\nhistory of discrete and algebraic structures in mathematical biology, from\ntheir early appearances in the late 1960s to the current day. Finally, we will\ndiscuss the role of algebraic biology in the modern classroom and curriculum,\nincluding resources in the literature and relevant software. Our goal is to\nmake this article widely accessible, reaching the mathematical biologist who\nknows no algebra, the algebraist who knows no biology, and especially the\ninterested student who is curious about the synergy between these two seemingly\nunrelated fields.\n", "versions": [{"version": "v1", "created": "Sat, 29 Feb 2020 18:06:29 GMT"}], "update_date": "2020-03-05", "authors_parsed": [["Macauley", "Matthew", ""], ["Youngs", "Nora", ""]]}, {"id": "2003.05507", "submitter": "Sam-Shajing Sun", "authors": "Sam-Shajing Sun", "title": "Pathogen Infection Recovery Probability (PIRP) Versus Proinflammatory\n  Anti-Pathogen Species (PIAPS) Levels: Modelling and Therapeutic Strategies", "comments": "8 pages, 2 figures, 1 equation", "journal-ref": "Int. J. Med. Sci. Clin. Inv., Vol. 7 No. 08 (2020) | Page No.:\n  4925-4930", "doi": "10.18535/ijmsci/v7i08.06", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current CoVID-19 pandemic is spreading rapidly worldwide, and it may become\none of the largest pandemic events in modern history if out of control. It\nappears most of the SARS-CoV2 virus infection resulted deaths are mainly due to\ndysfunctions or failures of the lung or multiple organs that could be\nattributed to hosts immunodysfunctions particularly hyperinflammatory type\ndisorders. In this brief review and study, a math model is proposed to\ncorrelate the Pathogen Infection Recovery Probability (PIRP) versus\nProinflammatory Anti-Pathogen Species (PIAPS) levels within a host unit, where\na maximum PIRP is exhibited when the PIAPS levels are equal to or around PIAPS\nequilibrium levels at the pathogen elimination or clearance onset. Based on\nthis model, rational or effective therapeutic strategies at right stages or\ntiming, with right type of agents (immuno-stimulators or immuno-suppressors),\nand right dosages, may be designed and implemented that are expected to\neffectively achieve maximum PIRP or reduce the mortality.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 20:11:16 GMT"}, {"version": "v2", "created": "Wed, 18 Mar 2020 18:01:03 GMT"}, {"version": "v3", "created": "Sun, 5 Apr 2020 20:26:06 GMT"}], "update_date": "2020-09-28", "authors_parsed": [["Sun", "Sam-Shajing", ""]]}, {"id": "2003.09865", "submitter": "Sonja Aits", "authors": "Salma Kazemi Rashed, Johan Frid, Sonja Aits", "title": "English dictionaries, gold and silver standard corpora for biomedical\n  natural language processing related to SARS-CoV-2 and COVID-19", "comments": "5 pages, 1 table, 7 supplementary files (available online)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we present a toolbox for natural language processing tasks related to\nSARS-CoV-2. It comprises English dictionaries of synonyms for SARS-CoV-2 and\nCOVID-19, a silver standard corpus generated with the dictionaries and a gold\nstandard corpus of 10 Pubmed abstracts manually annotated for disease, virus,\nsymptom and protein/gene terms. This toolbox is freely available on github (on\nhttps://github.com/Aitslab/corona) and can be used for text analytics in a\nvariety of settings related to the COVID-19 crisis. It will be expanded and\napplied in NLP tasks over the next weeks and the community is invited to\ncontribute.\n", "versions": [{"version": "v1", "created": "Sun, 22 Mar 2020 11:37:58 GMT"}], "update_date": "2020-03-24", "authors_parsed": [["Rashed", "Salma Kazemi", ""], ["Frid", "Johan", ""], ["Aits", "Sonja", ""]]}, {"id": "2003.10434", "submitter": "Victor Castano", "authors": "Cesar Aguado-Cort\\'es and Victor M. Casta\\~no", "title": "Translational Knowledge Map of COVID-19", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A translational knowledge map of COVID-19, based on the analysis of\nscientific papers and networks citation concurrence of terms and keywords of\nthe terms: covid- 19, 2019-ncov and sars-cov-2 in leading databases (MEDLINE,\nweb of Science and Scopus), was constructed. Some fields of the research on\ncovid-19 are connected together, differing in structure, content and evolution.\n", "versions": [{"version": "v1", "created": "Sun, 22 Mar 2020 00:04:10 GMT"}], "update_date": "2020-03-25", "authors_parsed": [["Aguado-Cortés", "Cesar", ""], ["Castaño", "Victor M.", ""]]}, {"id": "2003.11779", "submitter": "Kenji Toma Dr.", "authors": "Yasuji Sawada, Yasukazu Daigaku, Kenji Toma", "title": "A Thermodynamic Approach towards the Question \"What is Cellular Life?\"", "comments": "17 pages, 8 figures, revised after the first referee comments", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph nlin.AO q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The question \"What is life?\" has been asked and studied by the researchers of\nvarious fields. Nevertheless, no global theory which unified various aspects of\nlife has been proposed so far. Considering that the physical principle for the\ntheory of birth should be the one known for the unanimated world, and that the\nlife processes are irreversibly selective, we showed by a deductive inference\nthat the maximum entropy production principle plays an essential role for the\nbirth and the evolution of life in a fertile environment. In order to explain\nthe survival strategy of life in a barren period of environment, we also\nproposed that life had simultaneously developed a reversible on and off\nswitching mechanism of the chemical reactions by the dynamics of equilibrium\nthermodynamics. Thus, the birth and evolution of life have been achieved by the\ncooperation between the driving force due to the non-equilibrium thermodynamics\nand the protective force due to the equilibrium thermodynamics in the\nalternating environmental conditions.\n", "versions": [{"version": "v1", "created": "Thu, 26 Mar 2020 07:47:57 GMT"}, {"version": "v2", "created": "Mon, 20 Jul 2020 15:19:00 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Sawada", "Yasuji", ""], ["Daigaku", "Yasukazu", ""], ["Toma", "Kenji", ""]]}, {"id": "2003.12886", "submitter": "Avi Flamholz", "authors": "Yinon M. Bar-On, Avi I. Flamholz, Rob Phillips, Ron Milo", "title": "SARS-CoV-2 (COVID-19) by the numbers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The current SARS-CoV-2 pandemic is a harsh reminder of the fact that, whether\nin a single human host or a wave of infection across continents, viral dynamics\nis often a story about the numbers. In this snapshot, our aim is to provide a\none-stop, curated graphical source for the key numbers that help us understand\nthe virus driving our current global crisis. The discussion is framed around\ntwo broad themes: 1) the biology of the virus itself and 2) the characteristics\nof the infection of a single human host. Our one-page summary provides the key\nnumbers pertaining to SARS-CoV-2, based mostly on peer-reviewed literature. The\nnumbers reported in summary format are substantiated by the annotated\nreferences below. Readers are urged to remember that much uncertainty remains\nand knowledge of this pandemic and the virus driving it is rapidly evolving. In\nthe paragraphs below we provide \"back of the envelope\" calculations that\nexemplify the insights that can be gained from knowing some key numbers and\nusing quantitative logic. These calculations serve to improve our intuition\nthrough sanity checks, but do not replace detailed epidemiological analysis.\n", "versions": [{"version": "v1", "created": "Sat, 28 Mar 2020 20:49:04 GMT"}, {"version": "v2", "created": "Tue, 31 Mar 2020 03:04:03 GMT"}], "update_date": "2020-04-01", "authors_parsed": [["Bar-On", "Yinon M.", ""], ["Flamholz", "Avi I.", ""], ["Phillips", "Rob", ""], ["Milo", "Ron", ""]]}, {"id": "2003.12916", "submitter": "Andrea Armani", "authors": "Rosemary C. She, Dongyu Chen, Pil Pak, Deniz K. Armani, Andreas\n  Schubert, Andrea M. Armani", "title": "Build-at-home UV-C disinfection system for healthcare settings", "comments": "7 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.med-ph physics.soc-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Significant research has shown that UV-C exposure is an effective\ndisinfectant for a range of bacteria and viruses, including coronaviruses. As\nsuch, a UV-C treatment in combination with a chemical wipe, such as EPA\nhydrogen peroxide, is a common cleaning protocol in a medical setting, and such\ndisinfection protocols have gained in importance during the current COVID-19\npandemic due to the need to reuse PPE. However, given the substantial increase\nin patient volume, the quantity of materials requiring disinfection exceeds the\nUV-C equipment throughput capabilities at many medical facilities. Therefore,\nthere is a need for a UV-C disinfection system that can be rapidly deployed. In\nresponse to this demand, we designed, constructed, and validated a UV-C\ndisinfection system from readily accessible components; specifically, a plastic\nbin, UV-C light bulb and conventional light housing. To further improve the\nperformance, the interior of the tub was spray-painted with chrome paint,\nforming a low quality-factor (Q) Fabry-Perot optical cavity. As part of this\nwork, a set of modular design criteria which allows for flexibility in\ncomponent selection without degradation of UV-C dose performance is\nestablished. This flexibility is critical given the current fluctuating\navailability of source materials. The disinfection capabilities of the system\nare validated using Bacillus cereus, a gram-positive endospore-forming\nbacteria.\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2020 00:43:16 GMT"}, {"version": "v2", "created": "Wed, 1 Apr 2020 14:36:43 GMT"}], "update_date": "2020-04-02", "authors_parsed": [["She", "Rosemary C.", ""], ["Chen", "Dongyu", ""], ["Pak", "Pil", ""], ["Armani", "Deniz K.", ""], ["Schubert", "Andreas", ""], ["Armani", "Andrea M.", ""]]}, {"id": "2003.13282", "submitter": "Tarun Jain", "authors": "Tarun Jain, Bijendra Nath Jain", "title": "Accelerated infection testing at scale: a proposal for inference with\n  single test on multiple patients", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In pandemics or epidemics, public health authorities need to rapidly test a\nlarge number of individuals, both to determine the line of treatment as well as\nto know the spread of infection to plan containment, mitigation and future\nresponses. However, the lack of adequate testing kits could be a bottleneck,\nespecially in the case of unanticipated new diseases, such as COVID-19, where\nthe testing technology, manufacturing capability, distribution, human skills\nand laboratories might be unavailable or in short supply. In addition, the cost\nof the standard PCR test is approximately USD 48, which is prohibitive for\npoorer patients and most governments. We address this bottleneck by proposing a\ntest methodology that pools the sample from two (or more) patients in a single\ntest. The key insight is that a single negative result from a pooled sample\nlikely implies negative infection of all the individual patients. and It\nthereby rules out further tests for the patients. This protocol, therefore,\nrequires significantly fewer tests. This may, however, result in somewhat\nincreased false negatives. Our simulations show that combining samples from two\npatients with 7% underlying likelihood of infection implies that 36% fewer test\nkits are required, with 14% additional units of time for testing.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 09:06:08 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Jain", "Tarun", ""], ["Jain", "Bijendra Nath", ""]]}, {"id": "2003.13473", "submitter": "Shi Huang", "authors": "Hongyao Chen and Shi Huang", "title": "Modern alleles in archaic human Y chromosomes support origin of modern\n  human paternal lineages in Asia rather than Africa", "comments": "14 pages, 2 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent studies have shown that hybridization between modern and archaic\nhumans was commonplace in the history of our species. After admixture, some\nindividuals with admixed autosomes carried the modern Homo Sapiens uniparental\nDNAs, while the rest carried the archaic versions. Coevolution of admixed\nautosomes and uniparental DNAs is expected to cause some of the sites in modern\nuniparental DNAs to revert back to archaic alleles, while the opposite process\nwould occur (from archaic to modern) in some of the sites in archaic\nuniparental DNAs. This type of coevolution is one of the elements that\ndifferentiate the two different models of the Y phylogenetic tree of modern\nhumans, rooting it either in Africa or East Asia. The expected reversion to\narchaic alleles is assumed to occur and is easily traceable in the Asia model,\nbut is absent in the Africa model due to its infinite site assumption, which\nalso precludes the independent or convergent mutation to modern alleles in\narchaic uniparental DNAs since mutations are assumed to occur randomly across a\nneutral genome, and convergent evolution is assumed not to occur. Here, we\nexamined newly published high coverage Y chromosome sequencing data of two\nDenisovan and two Neanderthal samples to determine whether they carry\nmodern-Homo Sapiens alleles in sites where they are not supposed to according\nto the Africa model. The results showed that a significant fraction of the\nsites that, according to the Asia model, should differentiate the original\nmodern Y from the original archaic Y carried modern alleles in the archaic Y\nsamples here. Some of these modern alleles were shared among all archaic humans\nwhile others could differentiate Denisovans from Neanderthals. The observation\nis best accounted for by coevolution of archaic Y and admixed modern autosomes,\nand hence supports the Asia model, since it takes such coevolution into\naccount.\n", "versions": [{"version": "v1", "created": "Thu, 26 Mar 2020 23:06:13 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Chen", "Hongyao", ""], ["Huang", "Shi", ""]]}, {"id": "2003.13890", "submitter": "Efr\\'en M. Benavides", "authors": "Efren M. Benavides", "title": "Robust predictive model for Carriers, Infections and Recoveries (CIR):\n  predicting death rates for CoVid-19 in Spain", "comments": "11 pages, 2 figures; spelling and typos corrected", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a new model to predict the evolution of infective\ndiseases under uncertainty or low-quality information, just as it has happened\nin the initial scenario during the CoVid-19 spread in China and Europe. The\nmodel has been used to predict the death rate in Spain but can be used to\npredict the demand of ICUs or mechanical ventilators under different restraint\npolicies. The main novelty of the model is that it keeps track of the date of\ninfection of a single individual and uses stochastic distributions to aggregate\nindividuals who share the same date of infection. In addition, it uses two\ntypes of infections, mild and serious, with a different recovery time. These\nfeatures are implemented in a set of differential equations which determine the\nnumber of Carriers, Infections, Recoveries, Hospitalized and Deaths. Comparison\nwith real data shows good agreement.\n", "versions": [{"version": "v1", "created": "Tue, 31 Mar 2020 00:52:59 GMT"}, {"version": "v2", "created": "Fri, 10 Apr 2020 21:32:27 GMT"}], "update_date": "2020-04-14", "authors_parsed": [["Benavides", "Efren M.", ""]]}]