[{"id": "2004.00579", "submitter": "Julian Monge-Najera", "authors": "Julian Monge-Najera", "title": "History of Onychophorology, 1826-2020", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Velvet worms, or onychophorans, are animals of extraordinary importance in\nthe study of evolution. This is the first history of their study. They were\ndescribed by Lansdown Guilding (1797-1831). This paper identifies the landmarks\nof their study, in a worldwide level, for almost 200 years. The beginning,\n1826-1879, was based on describing their anatomy with light miscroscopy, mostly\nby famous French naturalists such as Milne-Edwards and Blanchard. In 1880-1929\npeiord, work concentrated in anatomy, physiology, behavior, biogeography and\necology, but the most important work was Bouvier`s mammoth monograph. The next\nperiod, 1930-1979, was important for the discovery of Cambrian species; Vachons\nexplanation of how ancient distribution defined the existence of two families;\nPioneer DNA and electron microscopy from Brazil; and primitive attempts at\nsystematics using embryology or isolated anatomical characteristics. Finally,\nthe 1980-2020 period, with research centered in Australia, Brazil, Costa Rica\nand Germany, is marked by an evolutionary approach to everything, from body and\nbehavior to distribution; for the solution of the old problem of how they form\ntheir adhesive net and how the glue works; the reconstruction of Cambrian\nonychophoran communities, the first experimental taphonomy; the first\ncountrywide map of conservation status (from Costa Rica); the first model of\nwhy they survive in cities; the discovery of new phenomena like food hiding,\nparental feeding investment and ontogenetic diet shift; and for the birth of a\nnew research branh, Onychophoran Etnobiology, founded in 2015,\n", "versions": [{"version": "v1", "created": "Wed, 1 Apr 2020 17:10:00 GMT"}], "update_date": "2020-04-02", "authors_parsed": [["Monge-Najera", "Julian", ""]]}, {"id": "2004.01000", "submitter": "Andres Ospina-Alvarez Dr.", "authors": "Vicen\\c{c} Molt\\'o, Andres Ospina-Alvarez, Mark Gatt, Miquel Palmer,\n  Ignacio A. Catal\\'an", "title": "A Bayesian approach to recover the theoretical temperature-dependent\n  hatch date distribution from biased samples: the case of the common\n  dolphinfish (Coryphaena hippurus)", "comments": "7 pages, 2 figure, 2 appendices", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Reproductive phenology, growth and mortality rates are key ecological\nparameters that determine population dynamics and are therefore of vital\nimportance to stock assessment models for fisheries management. In many fish\nspecies, the spawning phenology is sensitive to environmental factors that\nmodulate or trigger the spawning event, which differ between regions and\nseasons. In addition, climate change may also alter patterns of reproductive\nphenology at the community level. Usually, hatch-date distributions are\ndetermined back-calculating the age estimated on calcified structures from the\ncapture date. However, these estimated distributions could be biased due to\nmortality processes or time spaced samplings derived from fishery. Here, we\npresent a Bayesian approach that functions as a predictive model for the\nhatching date of individuals from a fishery-dependent sampling with temporal\nbiases. We show that the shape and shift of the observed distribution is\ncorrected. This model can be applied in fisheries with multiple cohorts, for\nspecies with a wide geographical distribution and living under contrasting\nenvironmental regimes and individuals with different life histories such as\nthermo-dependent growth, length-dependent mortality rates, etc.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2020 16:04:45 GMT"}, {"version": "v2", "created": "Mon, 22 Jun 2020 16:31:14 GMT"}], "update_date": "2020-06-23", "authors_parsed": [["Moltó", "Vicenç", ""], ["Ospina-Alvarez", "Andres", ""], ["Gatt", "Mark", ""], ["Palmer", "Miquel", ""], ["Catalán", "Ignacio A.", ""]]}, {"id": "2004.03411", "submitter": "Ambrish Kumar Srivastava", "authors": "Ambrish Kumar Srivastava, Abhishek Kumar, Neeraj Misra", "title": "On the Inhibition of COVID-19 Protease by Indian Herbal Plants: An In\n  Silico Investigation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  COVID-19 has quickly spread across the globe, becoming a pandemic. This\ndisease has a variable impact in different countries depending on their\ncultural norms, mitigation efforts and health infrastructure. In India, a\nmajority of people rely upon traditional Indian medicine to treat human\nmaladies due to less-cost, easier availability and without any side-effect.\nThese medicines are made by herbal plants. This study aims to assess the Indian\nherbal plants in the pursuit of potential COVID-19 inhibitors using in silico\napproaches. We have considered 18 extracted compounds of 11 different species\nof these plants. Our calculated lipophilicity, aqueous solubility and binding\naffinity of the extracted compounds suggest that the inhibition potentials in\nthe order; harsingar > aloe vera > giloy > turmeric > neem > ashwagandha > red\nonion > tulsi > cannabis > black pepper. On comparing the binding affinity with\nhydroxychloroquine, we note that the inhibition potentials of the extracts of\nharsingar, aloe vera and giloy are very promising. Therefore, we believe that\nthese findings will open further possibilities and accelerate the works towards\nfinding an antidote for this malady.\n", "versions": [{"version": "v1", "created": "Sun, 5 Apr 2020 10:16:35 GMT"}], "update_date": "2020-04-08", "authors_parsed": [["Srivastava", "Ambrish Kumar", ""], ["Kumar", "Abhishek", ""], ["Misra", "Neeraj", ""]]}, {"id": "2004.04567", "submitter": "Pavel Golovinski", "authors": "P.A. Golovinski", "title": "The pandemic of viruses with a long incubation phase in the small world", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model of the spread of viruses in selected city and in a network of cities\nis considered, taking into account the delay caused by the long incubation\nperiod of the virus. The effect of delay effects is shown in comparison with\npandemics without such delay. A temporary asymmetry of the spread of infection\nhas been identified, which means that the time for a pandemic to develop\nsignificantly exceeds the time for its completion. Model calculations of the\nspread of viruses in a network of interconnected large and small cities were\ncarried out, and dynamics features were revealed in comparison with the spread\nof viruses in a single city, including the possibility of reinfection of\nmegalopolis.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2020 08:02:53 GMT"}, {"version": "v2", "created": "Sun, 3 May 2020 09:18:51 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Golovinski", "P. A.", ""]]}, {"id": "2004.06111", "submitter": "Martina Mammarella Dr.", "authors": "Teodoro Alamo and Daniel G. Reina and Martina Mammarella and Alberto\n  Abella", "title": "Open Data Resources for Fighting COVID-19", "comments": "30 pages Minor improvements", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide an insight into the open data resources pertinent to the study of\nthe spread of Covid-19 pandemic and its control. We identify the variables\nrequired to analyze fundamental aspects like seasonal behaviour, regional\nmortality rates, and effectiveness of government measures. Open data resources,\nalong with data-driven methodologies, provide many opportunities to improve the\nresponse of the different administrations to the virus. We describe the present\nlimitations and difficulties encountered in most of the open-data resources. To\nfacilitate the access to the main open-data portals and resources, we identify\nthe most relevant institutions, at a world scale, providing Covid-19\ninformation and/or auxiliary variables (demographics, mobility, etc.). We also\ndescribe several open resources to access Covid-19 data-sets at a country-wide\nlevel (i.e. China, Italy, Spain, France, Germany, U.S., etc.). In an attempt to\nfacilitate the rapid response to the study of the seasonal behaviour of\nCovid-19, we enumerate the main open resources in terms of weather and climate\nvariables. CONCO-Team: The authors of this paper belong to the CONtrol COvid-19\nTeam, which is composed of different researches from universities of Spain,\nItaly, France, Germany, United Kingdom and Argentina. The main goal of\nCONCO-Team is to develop data-driven methods for the better understanding and\ncontrol of the pandemic.\n", "versions": [{"version": "v1", "created": "Mon, 13 Apr 2020 09:52:53 GMT"}, {"version": "v2", "created": "Fri, 17 Apr 2020 09:56:29 GMT"}, {"version": "v3", "created": "Mon, 11 May 2020 13:38:06 GMT"}], "update_date": "2020-05-12", "authors_parsed": [["Alamo", "Teodoro", ""], ["Reina", "Daniel G.", ""], ["Mammarella", "Martina", ""], ["Abella", "Alberto", ""]]}, {"id": "2004.06450", "submitter": "Irina  Biktasheva", "authors": "Irina V. Biktasheva", "title": "Role of a Habitat's Air Humidity in Covid-19 Mortality", "comments": "3 pages; 1 figure; as accepted to Science of the Total Environment on\n  15/04/2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transient local over-dry environment might be a contributor and an\nexplanation for the observed asynchronous local rises in Covid-19 mortality. We\npropose that a habitat's air humidity negatively correlate with Covid-19\nmorbidity and mortality, and support this hypothesis on the example of publicly\navailable data from German federal states.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2020 12:33:18 GMT"}, {"version": "v2", "created": "Wed, 15 Apr 2020 18:43:50 GMT"}], "update_date": "2020-04-17", "authors_parsed": [["Biktasheva", "Irina V.", ""]]}, {"id": "2004.08553", "submitter": "Weidong Huang", "authors": "Weidong Huang", "title": "A new method for life table and life expectancy calculation", "comments": "8 pages, in Chinese, 2 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The existing life table method needs to calculate the age-specific mortality\nfirst, not only has too many and complicated calculation steps, but also\nintroduces the multiple approximation to bring error. This paper redefines the\nprobability of death for the life table as the average probability of death of\na group of people born in a certain period at a later time. Based on this\ndefinition, a new method for the life table is proposed to obtain the life\nexpectancy, which has the same meaning to that from the traditional life table.\nUsing the Japanese population data to verify the method, the results show that\nit is consistent with the life expectancy of the birth of the baby, the maximum\nrelative difference is no more than 0.1%, and average relative difference is\nless than 0.03%. The theory and method of life table described in this paper\nare simple and easy to understand. The needed data are easy to obtained from\nstatistics, and the calculation is easy, the results obtained are accurate and\nreliable. It should be a very valuable demographic method for application.\n", "versions": [{"version": "v1", "created": "Sat, 18 Apr 2020 08:24:35 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Huang", "Weidong", ""]]}, {"id": "2004.09230", "submitter": "Alexander Nesterov-Mueller Dr.", "authors": "A. Nesterov-Mueller and R. Popov", "title": "On the origin of the standard genetic code as a fusion of prebiotic\n  single-base-pair codes", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The genesis of the stand genetic code is considered as a result of a fusion\nof two AU- and GC-codes distributed in two dominant and two recessive domains.\nThe fusion of these codes is described with simple empirical rules. This formal\napproach explains the number of the proteinogenic amino acids and the codon\nassignment in the resulting standard genetic code. It shows how norleucine,\npyrrolysine, selenocysteine and two other unknown amino acids, included into\nthe prebiotic codes, disappeared after the fusion. The properties of these two\nmissing amino acids were described. The ambiguous translation observed in\nmitochondria is explained. The internal structure of the codes allows a more\ndetailed insights into molecular evolution in prebiotic time. In particular,\nthe structure of the oldest single base-pair code is presented. The fusion\nconcept reveals the appearance of the DNA machinery on the level of the single\ndominant AU-code. The time before the appearance of standard genetic code is\ndivided into four epochs: pre-DNA, 2-code, pre-fusion, and after-fusion epochs.\nThe prebiotic single-base-pair codes may help design novel peptide-based\ncatalysts.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2020 12:15:39 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Nesterov-Mueller", "A.", ""], ["Popov", "R.", ""]]}, {"id": "2004.11287", "submitter": "Leonidas Karakatsanis", "authors": "L. P. Karakatsanis, E. G. Pavlos, G. Tsoulouhas, G. L. Stamokostas, T.\n  L. Mosbruger, J. L. Duke, G. P. Pavlos, and D. S. Monos", "title": "Information and order of genomic sequences within chromosomes as\n  identified by complexity theory. An integrated methodology", "comments": "28 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Complexity metrics and machine learning (ML) models have been utilized to\nanalyze the lengths of segmental genomic entities like: exons, introns,\nintergenic and repeat/unique DNA sequences, in each of the 22 human\nchromosomes. The purpose of the study was to assess information and order that\nmay be concealed within the size distribution of these sequences. For this\npurpose, we developed an innovative integrated methodology. Our analysis is\nbased upon the reconstructed phase space theorem, the non-extensive statistical\ntheory of Tsallis, ML techniques and a new technical index, integrating the\ngenerated information, which we introduce and named it Complexity Factor\n(COFA). The low-dimensional deterministic nonlinear chaotic and non-extensive\nstatistical character of the DNA sequences was verified with strong\nmultifractal characteristics and long-range correlations with significant\nvariations per genomic entity and per chromosome. The results of the analysis\nreveal changes in complexity behavior per genomic entity and chromosome\nregarding the size distribution of individual genomic segment. The lengths of\nintron regions show greater complexity behavior in all metrics than the exonic\nones, with longer range correlations, and stronger memory effects, for all\nchromosomes. We conclude from our analysis, that the size distribution of the\ngenomic regions within chromosomes, are not random, but follow a specific\npattern with characteristic features, that have been seen here through its\ncomplexity character, and it is part of the dynamics of the whole genome\naccording to complexity theory. This picture of dynamics of the redundancy of\ninformation in DNA recognized from ML tools for clustering, classification and\nprediction.\n", "versions": [{"version": "v1", "created": "Wed, 22 Apr 2020 10:18:01 GMT"}], "update_date": "2020-04-24", "authors_parsed": [["Karakatsanis", "L. P.", ""], ["Pavlos", "E. G.", ""], ["Tsoulouhas", "G.", ""], ["Stamokostas", "G. L.", ""], ["Mosbruger", "T. L.", ""], ["Duke", "J. L.", ""], ["Pavlos", "G. P.", ""], ["Monos", "D. S.", ""]]}, {"id": "2004.13485", "submitter": "Nathalie Henrich Bernardoni", "authors": "Jean-Philippe Epron, Jocelyne Sarfati, Nathalie Henrich Bernardoni\n  (GIPSA-GAMA)", "title": "Callas or the trajectory of the meteor", "comments": "in French", "journal-ref": "Revue de Laryngologie Otologie Rhinologie, Revue de Laryngologie,\n  2010, 131 (1), pp.35-38", "doi": null, "report-no": null, "categories": "q-bio.OT physics.class-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The lyric career of Maria Callas, though exceptional, is also noteworthy for\nits brevity. The first signs of downturn appeared at the age of 36 and her\nvoice fell silent at only 40. Though the literature has massively commented on\nthis premature worsening, few analyses of its characteristics have been made\npublic so far. The purpose of our study was to realise a perceptual and\nacoustical analysis of recorded arias by the artist at the climax to the fall.\nThe audible impairments were first verbally described, and then compared to\nacoustical observations based on spectrographic analyses and\nfundamental-frequency measurements.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2020 12:23:45 GMT"}], "update_date": "2020-04-29", "authors_parsed": [["Epron", "Jean-Philippe", "", "GIPSA-GAMA"], ["Sarfati", "Jocelyne", "", "GIPSA-GAMA"], ["Bernardoni", "Nathalie Henrich", "", "GIPSA-GAMA"]]}]