[{"id": "2007.00383", "submitter": "Juri Rappsilber", "authors": "Alexander Leitner, Alexandre M.J.J. Bonvin, Christoph H. Borchers,\n  Robert J. Chalkley, Julia Chamot-Rooke, Colin W. Combe, J\\\"urgen Cox,\n  Meng-Qiu Dong, Lutz Fischer, Michael G\\\"otze, Fabio C. Gozzo, Albert J. R.\n  Heck, Michael R. Hoopmann, Lan Huang, Yasushi Ishihama, Andrew R. Jones, Nir\n  Kalisman, Oliver Kohlbacher, Karl Mechtler, Robert L. Moritz, Eugen Netz,\n  Petr Novak, Evgeniy Petrotchenko, Andrej Sali, Richard A. Scheltema, Carla\n  Schmidt, David Schriemer, Andrea Sinz, Frank Sobott, Florian Stengel,\n  Konstantinos Thalassinos, Henning Urlaub, Rosa Viner, Juan A. Vizcaino, Marc\n  R. Wilkins, Juri Rappsilber", "title": "Towards Increased Reliability, Transparency and Accessibility in\n  Crosslinking Mass Spectrometry", "comments": "26 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Crosslinking mass spectrometry (Crosslinking MS) has substantially matured as\na method over the last two decades through parallel development in multiple\nlabs, demonstrating its applicability for protein structure determination,\nconformation analysis and mapping protein interactions in complex mixtures.\nCrosslinking MS has become a much-appreciated and routinely applied tool\nespecially in structural biology. Therefore, it is timely that the community\ncommits to the development of methodological and reporting standards. This\nwhite paper builds on an open process comprising a number of events at\ncommunity conferences since 2015 and identifies aspects of Crosslinking MS for\nwhich guidelines should be developed as part of a Crosslinking MS standards\ninitiative.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jul 2020 11:22:38 GMT"}], "update_date": "2020-07-02", "authors_parsed": [["Leitner", "Alexander", ""], ["Bonvin", "Alexandre M. J. J.", ""], ["Borchers", "Christoph H.", ""], ["Chalkley", "Robert J.", ""], ["Chamot-Rooke", "Julia", ""], ["Combe", "Colin W.", ""], ["Cox", "Jürgen", ""], ["Dong", "Meng-Qiu", ""], ["Fischer", "Lutz", ""], ["Götze", "Michael", ""], ["Gozzo", "Fabio C.", ""], ["Heck", "Albert J. R.", ""], ["Hoopmann", "Michael R.", ""], ["Huang", "Lan", ""], ["Ishihama", "Yasushi", ""], ["Jones", "Andrew R.", ""], ["Kalisman", "Nir", ""], ["Kohlbacher", "Oliver", ""], ["Mechtler", "Karl", ""], ["Moritz", "Robert L.", ""], ["Netz", "Eugen", ""], ["Novak", "Petr", ""], ["Petrotchenko", "Evgeniy", ""], ["Sali", "Andrej", ""], ["Scheltema", "Richard A.", ""], ["Schmidt", "Carla", ""], ["Schriemer", "David", ""], ["Sinz", "Andrea", ""], ["Sobott", "Frank", ""], ["Stengel", "Florian", ""], ["Thalassinos", "Konstantinos", ""], ["Urlaub", "Henning", ""], ["Viner", "Rosa", ""], ["Vizcaino", "Juan A.", ""], ["Wilkins", "Marc R.", ""], ["Rappsilber", "Juri", ""]]}, {"id": "2007.02580", "submitter": "Fabrizio Nicastro", "authors": "F. Nicastro (1), G. Sironi (2), E. Antonello (2), A. Bianco (2), M.\n  Biasin (3), J.R. Brucato (4), I. Ermolli (1), G. Pareschi (2), M. Salvati\n  (5), P. Tozzi (4), D. Trabattoni (3), M. Clerici (6) ((1) Italian National\n  Institute for Astrophysics - Rome Astronomical Observatory, Rome, Italy, (2)\n  Italian National Institute for Astrophysics - Brera Astronomical Observatory,\n  Milano, Italy, (3) Department of Biomedical and Clinical Sciences L. Sacco,\n  University of Milano, Milano, Italy, (4) Italian National Institute for\n  Astrophysics - Arcetri Astrophysical Observatory, Firenze, Italy, (5)\n  Regional Agency for Environmental Protection of Lombardia (ARPA Lombardia),\n  Milano, Italy, (6) Department of Pathophysiology and Transplantation,\n  University of Milano and Don C. Gnocchi Foundation, IRCCS, Milano, Italy)", "title": "Forcing Seasonality of influenza-like epidemics with daily Solar\n  resonance", "comments": "Accepted for publication by iScience. This version has been modified\n  according to referee's comments. Models for the SARS-CoV-2 epidemic have been\n  updated to model the Italian data from 24 February 2020 through 21 August\n  2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Seasonality of acute viral respiratory diseases is a well-known and yet not\nfully understood phenomenon. Several models have been proposed to explain the\nregularity of yearly recurring outbreaks and the phase-differences observed at\ndifferent latitudes on Earth. Such models take into account known internal\ncauses, primarily the periodic emergence of new virus variants that evade the\nhost immune response. Yet, this alone, is generally unable to explain the\nregularity of recurrences and the observed phase-differences. Here we show that\nseasonality of viral respiratory diseases, as well as its distribution with\nlatitude on Earth, can be fully explained by the virucidal properties of UV-B\nand A Solar photons through a daily, minute-scale, resonant forcing mechanism.\nSuch an induced periodicity can last, virtually unperturbed, from tens to\nhundreds of cycles, and even in presence of internal dynamics (host's loss of\nimmunity) much slower than seasonal will, on a long period, generate seasonal\noscillations.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jul 2020 08:36:02 GMT"}, {"version": "v2", "created": "Fri, 10 Jul 2020 16:16:48 GMT"}, {"version": "v3", "created": "Tue, 28 Jul 2020 10:47:15 GMT"}, {"version": "v4", "created": "Mon, 31 Aug 2020 11:58:27 GMT"}], "update_date": "2020-09-01", "authors_parsed": [["Nicastro", "F.", ""], ["Sironi", "G.", ""], ["Antonello", "E.", ""], ["Bianco", "A.", ""], ["Biasin", "M.", ""], ["Brucato", "J. R.", ""], ["Ermolli", "I.", ""], ["Pareschi", "G.", ""], ["Salvati", "M.", ""], ["Tozzi", "P.", ""], ["Trabattoni", "D.", ""], ["Clerici", "M.", ""]]}, {"id": "2007.05362", "submitter": "Avi Flamholz", "authors": "Yinon M. Bar-On, Ron Sender, Avi I. Flamholz, Rob Phillips, Ron Milo", "title": "Quantitative clarification of key questions about COVID-19 epidemiology", "comments": "arXiv admin note: substantial text overlap with arXiv:2006.01283", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Modeling the spread of COVID-19 is crucial for informing public health\npolicy. All models for COVID-19 epidemiology rely on parameters describing the\ndynamics of the infection process. The meanings of epidemiological parameters\nlike R_0, R_t, the \"serial interval\" and \"generation interval\" can be\nchallenging to understand, especially as these and other parameters are\nconceptually overlapping and sometimes confusingly named. Moreover, the\nprocedures used to estimate these parameters make various assumptions and use\ndifferent mathematical approaches that should be understood and accounted for\nwhen relying on parameter values and reporting them to the public. Here, we\noffer several insights regarding the derivation of commonly-reported\nepidemiological parameters, and describe how mitigation measures like lockdown\nare expected to affect their values. We aim to present these quantitative\nrelationships in a manner that is accessible to the widest audience possible.\nWe hope that better communicating the intricacies of epidemiological models\nwill improve our collective understanding of their strengths and weaknesses,\nand will help avoid possible pitfalls when using them.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jul 2020 17:35:40 GMT"}], "update_date": "2020-07-13", "authors_parsed": [["Bar-On", "Yinon M.", ""], ["Sender", "Ron", ""], ["Flamholz", "Avi I.", ""], ["Phillips", "Rob", ""], ["Milo", "Ron", ""]]}, {"id": "2007.05410", "submitter": "Luis Anchordoqui", "authors": "Luis A. Anchordoqui, James B. Dent, Thomas J. Weiler", "title": "A Physics Modeling Study of SARS-CoV-2 Transport in Air", "comments": "6 pages, 1 figure", "journal-ref": "SciMedJ 2 (2020) 83-91", "doi": "10.28991/SciMedJ-2020-02-SI-7", "report-no": null, "categories": "physics.bio-ph q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The health threat from SARS-CoV-2 airborne infection has become a public\nemergency of international concern. During the ongoing coronavirus pandemic,\npeople have been advised by the Centers for Disease Control and Prevention to\nmaintain social distancing of at least 2 m to limit the risk of exposure to the\ncoronavirus. Experimental data, however, show that infected aerosols and\ndroplets trapped inside a turbulent puff cloud can travel up to 7 to 8 m. We\npropose a nuclear physics analogy-based modeling of the complex gas cloud and\nits payload of pathogen-virions. We show that the cloud stopping range is\nproportional to the product of the puff's diameter and its density. We use our\npuff model to determine the average density of the buoyant fluid in the\nturbulent cloud. A fit to the experimental data yields $1.8 < \\rho_P/\\rho_{\\rm\nair} < 4.0$, where $\\rho_P$ and $\\rho_{\\rm air}$ are the average density of the\npuff and the air. We demonstrate that temperature variation could cause an\n${\\cal O}(\\pm 8\\%)$ effect in the puff stopping range for extreme ambient cold\nor warmth. We also demonstrate that aerosols and droplets can remain suspended\nfor hours in the air. Therefore, once the puff slows down sufficiently, and its\ncoherence is lost, the eventual spreading of the infected aerosols becomes\ndependent on the ambient air currents and turbulence.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jul 2020 14:29:16 GMT"}, {"version": "v2", "created": "Mon, 7 Sep 2020 15:37:20 GMT"}, {"version": "v3", "created": "Tue, 15 Sep 2020 14:22:34 GMT"}], "update_date": "2020-10-07", "authors_parsed": [["Anchordoqui", "Luis A.", ""], ["Dent", "James B.", ""], ["Weiler", "Thomas J.", ""]]}, {"id": "2007.05495", "submitter": "Mason A. Porter", "authors": "Heather Z. Brooks, Unchitta Kanjanasaratool, Yacoub H. Kureh, and\n  Mason A. Porter", "title": "Disease Detectives: Using Mathematics to Forecast the Spread of\n  Infectious Diseases", "comments": "This article is for young readers (e.g., ages 12 and up)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT math.DS math.HO nlin.AO physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The COVID-19 pandemic has led to significant changes in how people are\ncurrently living their lives. To determine how to best reduce the effects of\nthe pandemic and start reopening societies, governments have drawn insights\nfrom mathematical models of the spread of infectious diseases. In this article,\nwe give an introduction to a family of mathematical models (called\n\"compartmental models\") and discuss how the results of analyzing these models\ninfluence government policies and human behavior, such as encouraging mask\nwearing and physical distancing to help slow the spread of the disease.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2020 21:51:16 GMT"}, {"version": "v2", "created": "Mon, 7 Sep 2020 02:44:03 GMT"}], "update_date": "2020-09-08", "authors_parsed": [["Brooks", "Heather Z.", ""], ["Kanjanasaratool", "Unchitta", ""], ["Kureh", "Yacoub H.", ""], ["Porter", "Mason A.", ""]]}, {"id": "2007.10274", "submitter": "Vladimir Chechetkin R.", "authors": "Vladimir R. Chechetkin, Vasily V. Lobzin", "title": "Ribonucleocapsid assembly/packaging signals in the genomes of the\n  coronaviruses SARS-CoV and SARS-CoV-2: Detection, comparison and implications\n  for therapeutic targeting", "comments": "31 pages, 6 figures, 3 tables", "journal-ref": null, "doi": "10.1080/07391102.2020.1815581", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The genomic ssRNA of coronaviruses is packaged within a helical nucleocapsid.\nDue to transitional symmetry of a helix, weakly specific cooperative\ninteraction between ssRNA and nucleocapsid proteins leads to the natural\nselection of specific quasi-periodic assembly/packaging signals in the related\ngenomic sequence. Such signals coordinated with the nucleocapsid helical\nstructure were detected and reconstructed in the genomes of the coronaviruses\nSARS-CoV and SARS-CoV-2. The main period of the signals for both viruses was\nabout 54 nt, that implies 6.75 nt per N protein. The complete coverage of ssRNA\ngenome of length about 30,000 nt by the nucleocapsid would need 4,400 N\nproteins, that makes them the most abundant among the structural proteins. The\nrepertoires of motifs for SARS-CoV and SARS-CoV-2 were divergent but nearly\ncoincided for different isolates of SARS-CoV-2. We obtained the distributions\nof assembly/packaging signals over the genomes with non-overlapping windows of\nwidth 432 nt. Finally, using the spectral entropy, we compared the load from\npoint mutations and indels during virus age for SARS-CoV and SARS-CoV-2. We\nfound the higher mutational load on SARS-CoV. In this sense, SARS-CoV-2 can be\ntreated as a \"newborn\" virus. These observations may be helpful in practical\nmedical applications and are of basic interest.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 16:55:51 GMT"}, {"version": "v2", "created": "Thu, 3 Sep 2020 14:59:18 GMT"}], "update_date": "2020-09-04", "authors_parsed": [["Chechetkin", "Vladimir R.", ""], ["Lobzin", "Vasily V.", ""]]}, {"id": "2007.10823", "submitter": "Andreas Kamilaris", "authors": "Andreas Kamilaris, Immaculada Funes Mesa, Robert Sav\\'e, Felicidad De\n  Herralde and Francesc X. Prenafeta-Bold\\'u", "title": "Can animal manure be used to increase soil organic carbon stocks in the\n  Mediterranean as a mitigation climate change strategy?", "comments": "Proc. of EnviroInfo 2020, Nicosia, Cyprus, September 2020. arXiv\n  admin note: text overlap with arXiv:2006.09122", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Soil organic carbon (SOC) plays an important role on improving soil\nconditions and soil functions. Increasing land use changes have induced an\nimportant decline of SOC content at global scale. Increasing SOC in\nagricultural soils has been proposed as a strategy to mitigate climate change.\nAnimal manure has the characteristic of enriching SOC, when applied to crop\nfields, while, in parallel, it could constitute a natural fertilizer for the\ncrops. In this paper, a simulation is performed using the area of Catalonia,\nSpain as a case study for the characteristic low SOC in the Mediterranean, to\nexamine whether animal manure can improve substantially the SOC of agricultural\nfields, when applied as organic fertilizers. Our results show that the policy\ngoals of the 4x1000 strategy can be achieved only partially by using manure\ntransported to the fields. This implies that the proposed approach needs to be\ncombined with other strategies.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jul 2020 11:30:56 GMT"}], "update_date": "2020-07-22", "authors_parsed": [["Kamilaris", "Andreas", ""], ["Mesa", "Immaculada Funes", ""], ["Savé", "Robert", ""], ["De Herralde", "Felicidad", ""], ["Prenafeta-Boldú", "Francesc X.", ""]]}, {"id": "2007.14926", "submitter": "Mai He", "authors": "Yu-Whuei Hu (1), Li-Shan Huang (2), Eric J. Yeh (3), Mai He (4) ((1)\n  National Dong Hwa University, Hualian, Taiwan (2) National Tsing Hua\n  University, Hsinchu, Taiwan (3) Amgen Inc. Thousand Oaks, CA, USA (4)\n  Department of Pathology & Immunology, Washington University School of\n  Medicine, St. Louis, MO, USA)", "title": "Healthcare Utilization and Perceived Health Status from Falun Gong\n  Practitioners in Taiwan: A Pilot SF-36 Survey", "comments": "Five tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objective: Falun Gong (FLG) is a practice of mind and body focusing on moral\ncharacter improvement along with meditative exercises. This 2002 pilot study\nexplored perceived health status, medical resource utilization and related\nfactors among Taiwanese FLG practitioners, compared to the general Taiwanese\nnorm estimated by the 2001 National Health Interview Survey (NHIS). Methods:\nThis cross-sectional, observational study was based on a voluntary, paper-based\nsurvey conducted from October 2002 to February 2003 using the same Taiwanese\nSF-36 instrument employed by the NHIS. Primary outcomes included eight SF-36\ndomain scores and the number of medical visits. One-sample t-tests, one-way\nANOVA and multivariate linear regression analyses were performed. Results: The\nresponse rate was 75.6% (1,210/1,600). Compared to the norm, the study cohort\nhad significantly higher scores in six of eight SF-36 domains across gender and\nage (p<0.05). Among those with chronic diseases, 70% to 89% reported their\nconditions either improved or cured. 74.2%, 79.2%, 83.3%, and 85.6% quitted\nalcohol drinking, smoking, chewing betel nuts, and gambling. 62.7% reported a\nreduced number of medical visits (mean=13.53 before; mean=5.87 after).\nConclusions: In this subject cohort, practicing FLG led to higher perceived\nhealth scores and reduced health resource utilization compared to the norm.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2020 16:00:28 GMT"}], "update_date": "2020-07-30", "authors_parsed": [["Hu", "Yu-Whuei", ""], ["Huang", "Li-Shan", ""], ["Yeh", "Eric J.", ""], ["He", "Mai", ""]]}, {"id": "2007.15117", "submitter": "Gabriele Mongiano", "authors": "Gabriele Mongiano, Patrizia Titone, Simone Pagnoncelli, Davide Sacco,\n  Luigi Tamborini, Roberto Pilu, Simone Bregaglio", "title": "Phenotypic variability in Italian rice germplasm", "comments": "Published in European Journal of Agronomy", "journal-ref": "Eur J Agron 120, 126131 (2020)", "doi": "10.1016/j.eja.2020.126131", "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Plant breeding is one of the key strategies for further enhancement of crop\nyields; however, effective breeding strategies require phenotypic\ncharacterisation of the available germplasm. This study sought to characterise\nthe phenotypic expression of fourteen crop traits related to phenology, plant\narchitecture, and yield in a panel of 40 cultivars selected to represent the\nphenotypic variability present in Italian rice germplasm during a two-season\nfield experiment. The observed range of phenotypic variation was high for many\ntraits (coefficients of variation ranging from 5.9\\% to 45.4\\%) including yield\n(mean: 6.47 t ha\\textsuperscript{-1}; CV: 15.4\\%; min: 2.19 t\nha\\textsuperscript{-1}; max: 8.95 t ha\\textsuperscript{-1}), and multiple\nstrong associations emerged in all the analysed traits. Cluster analysis\nextracted three groups of genotypes characterised by alternative yield\nstrategies, i.e. \"high-tillering\", \"early maturing\", and \"increased\nsource-sink\". Our findings highlight that rice yield decrease when one strategy\nis overemphasised. In contrast, the highest-yielding genotypes have a balanced\nratio between sink and source organs, along with a proportional duration of\nvegetative and reproductive phases. This study depicts the phenotypic\nvariability in Italian rice cultivars and proposes a novel classification based\non yield-related traits which could be of use in multiple rice breeding\napplications.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2020 21:24:31 GMT"}, {"version": "v2", "created": "Tue, 11 Aug 2020 08:17:04 GMT"}], "update_date": "2020-08-12", "authors_parsed": [["Mongiano", "Gabriele", ""], ["Titone", "Patrizia", ""], ["Pagnoncelli", "Simone", ""], ["Sacco", "Davide", ""], ["Tamborini", "Luigi", ""], ["Pilu", "Roberto", ""], ["Bregaglio", "Simone", ""]]}, {"id": "2007.15507", "submitter": "Emer Duffy", "authors": "Emer Duffy, Aoife Morrin", "title": "Endogenous and microbial volatile organic compounds in cutaneous health\n  and disease", "comments": null, "journal-ref": null, "doi": "10.1016/j.trac.2018.12.012", "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Human skin is a region of high metabolic activity where a rich variety of\nbiomarkers are secreted from the stratum corneum. The skin is a constant source\nof volatile organic compounds (VOCs) derived from skin glands and resident\nmicrobiota. Skin VOCs contain the footprints of cellular activities and thus\noffer unique insights into the intricate processes of cutaneous physiology.\nThis review examines the growing body of research on skin VOC markers as they\nrelate to skin physiology, whereby variations in skin-intrinsic and microbial\nmetabolic processes give rise to unique volatile profiles. Emerging evidence\nfor volatile biomarkers linked to skin perturbations and skin cancer are\nexamined. Microbial-derived VOCs are also investigated as prospective\ndiagnostic markers, and their potential to shape the composition of the local\nskin microbiota, and consequently cutaneous health, is considered. Finally, a\nbrief outlook on emerging analytical challenges and opportunities for skin\nVOC-based research and diagnostics is presented.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jul 2020 14:59:51 GMT"}, {"version": "v2", "created": "Fri, 31 Jul 2020 11:26:07 GMT"}], "update_date": "2020-08-03", "authors_parsed": [["Duffy", "Emer", ""], ["Morrin", "Aoife", ""]]}]