[{"id": "2105.01540", "submitter": "Fabiano L. Ribeiro", "authors": "Fabiano L. Ribeiro and William R. L. S. Pereira", "title": "A Gentle Introduction to Scaling Laws in Biological Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper investigates the role of size in biological organisms. More\nspecifically, how the energy demand, expressed by the metabolic rate, changes\naccording to the mass of an organism. Empirical evidence suggests a power-law\nrelation between mass and metabolic rate, namely allometric law. For vascular\norganisms, the exponent $\\beta$ of this power-law is smaller than one, which\nimplies scaling economy; that is, the greater the organism is, the lesser\nenergy per cell it demands. However, the numerical value of this exponent is a\ntheme of an extensive debate and a central issue in comparative physiology. It\nis presented in this work some empirical data and a detailed discussion about\nthe most successful theories to explain these issues. A historical perspective\nis also shown, beginning with the first empirical insights in the sec. 19 about\nscaling properties in biology, passing through the two more important theories\nthat explain the scaling properties quantitatively. Firstly, the Rubner model,\nthat consider organism surface area and heat dissipation to derive $\\beta =\n2/3$. Secondly, the West-Brown-Enquist theory, that explains such scaling\nproperties as a consequence of the hierarchical and fractal nutrient\ndistribution network, deriving $\\beta = 3/4$.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 14:47:28 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Ribeiro", "Fabiano L.", ""], ["Pereira", "William R. L. S.", ""]]}, {"id": "2105.02217", "submitter": "Fernando Adri\\'an Fern\\'andez Tojo", "authors": "Iv\\'an Area, F.J. Fern\\'andez, Juan J. Nieto, F. Adri\\'an F. Tojo", "title": "A Digital Twin of a Compartmental Epidemiological Model based on a\n  Stieltjes Differential Equation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a digital twin of the classical compartmental SIR (Susceptible,\nInfected, Recovered) epidemic model and study the interrelation between the\ndigital twin and the system. In doing so, we use Stieltjes derivatives to feed\nthe data from the real system to the virtual model which, in return, improves\nit in real time. As a byproduct of the model, we present a precise mathematical\ndefinition of solution to the problem. We also analyze the existence and\nuniqueness of solutions, introduce the concept of Main Digital Twin and present\nsome numerical simulations with real data of the COVID-19 epidemic, showing the\naccuracy of the proposed ideas.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 10:20:15 GMT"}], "update_date": "2021-05-06", "authors_parsed": [["Area", "Iván", ""], ["Fernández", "F. J.", ""], ["Nieto", "Juan J.", ""], ["Tojo", "F. Adrián F.", ""]]}, {"id": "2105.05672", "submitter": "Mario V Balzan", "authors": "Mario V Balzan", "title": "Assessing ecosystem services for evidence-based nature-based solutions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The term nature-based solutions has often been used to refer to adequate\ngreen infrastructure, which is cost-effective and simultaneously provides\nenvironmental, social and economic benefits, through the delivery of ecosystem\nservices, and contributes to build resilience. This paper provides an overview\nof the recent work mapping and assessing ecosystem services in Malta and the\nimplications for decision-making. Research has focused on the identification\nand mapping of ecosystems, and ecosystem condition, the capacity to deliver key\necosystem services and the actual use (flow) of these services by local\ncommunities leading to benefits to human well-being. The integration of results\nfrom these different assessments demonstrates several significant synergies\nbetween ecosystem services, indicating multifunctionality in the provision of\necosystem services leading to human well-being. This is considered as key\ncriterion in the identification of green infrastructure in the Maltese Islands.\nA gradient in green infrastructure cover and ecosystem services capacity is\nobserved between rural and urban areas but ecosystem services flow per unit\narea was in some cases higher in urban environments. These results indicate a\npotential mismatch between ecosystem service demand and capacity but also\nprovide a scientific baseline for evidence-based policy which fosters the\ndevelopment of green infrastructure through nature-based innovation promoting\nmore specific and novel solutions for landscape and urban planning.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2021 14:13:04 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Balzan", "Mario V", ""]]}, {"id": "2105.07865", "submitter": "Jacques Van Helden", "authors": "Jacques van Helden, Colin D Butler, Bruno Canard, Guillaume Achaz,\n  Fran\\c{c}ois Graner, Rossana Segreto, Yuri Deigin, Fabien Colombo, Serge\n  Morand, Didier Casane, Dan Sirotkin, Karl Sirotkin, Etienne Decroly Jos\\'e\n  Halloy", "title": "An appeal for an open scientific debate about the proximal origin of\n  SARS-CoV-2", "comments": "This letter was submitted to The Lancet on January 6, 2021. When the\n  letter was rejected, we asked the editors whether this refusal meant that\n  they consider this scientific evaluation of the alternative hypotheses should\n  not be hosted by scientific journals. The submission was reassessed by the\n  chief editor, who confirmed the decision to reject the letter without peer\n  review", "journal-ref": null, "doi": "10.13140/RG.2.2.15356.46727", "report-no": null, "categories": "q-bio.OT physics.soc-ph", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  One year after the onset of the COVID-19 pandemic, the origin of SARS-CoV-2\nstill eludes humanity. Early publications firmly stated that the virus was of\nnatural origin, and the possibility that the virus might have escaped from a\nlab was discarded in most subsequent publications. However, based on a\nre-analysis of the initial arguments, highlighted by the current knowledge\nabout the virus, we show that the natural origin is not supported by conclusive\narguments, and that a lab origin cannot be formally discarded. We call for an\nopening of peer-reviewed journals to a rational, evidence-based and\nprejudice-free evaluation of all the reasonable hypotheses about the virus'\norigin. We advocate that this debate should take place in the columns of\nrenowned scientific journals, rather than being left to social media and\nnewspapers.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 05:02:48 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["van Helden", "Jacques", ""], ["Butler", "Colin D", ""], ["Canard", "Bruno", ""], ["Achaz", "Guillaume", ""], ["Graner", "François", ""], ["Segreto", "Rossana", ""], ["Deigin", "Yuri", ""], ["Colombo", "Fabien", ""], ["Morand", "Serge", ""], ["Casane", "Didier", ""], ["Sirotkin", "Dan", ""], ["Sirotkin", "Karl", ""], ["Halloy", "Etienne Decroly José", ""]]}, {"id": "2105.09158", "submitter": "Wayne Huggins", "authors": "Alexander J. Ropelewski, Megan A. Rizzo, Jason R. Swedlow, Jan\n  Huisken, Pavel Osten, Neda Khanjani, Kurt Weiss, Vesselina Bakalov, Michelle\n  Engle, Lauren Gridley, Michelle Krzyzanowski, Tom Madden, Deborah Maiese,\n  Justin Waterfield, David Williams, Carol Hamilton, and Wayne Huggins", "title": "Essential Metadata for 3D BRAIN Microscopy", "comments": "10 pages, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Recent advances in fluorescence microscopy techniques and tissue clearing,\nlabeling, and staining provide unprecedented opportunities to investigate brain\nstructure and function. These experiments' images make it possible to catalog\nbrain cell types and define their location, morphology, and connectivity in a\nnative context, leading to a better understanding of normal development and\ndisease etiology. Consistent annotation of metadata is needed to provide the\ncontext necessary to understand, reuse, and integrate these data. This report\ndescribes an effort to establish metadata standards for 3D microscopy datasets\nfor use by the Brain Research through Advancing Innovative Neurotechnologies\n(BRAIN) Initiative and the neuroscience research community. These standards\nwere built on existing efforts and developed with input from the brain\nmicroscopy community to promote adoption. The resulting Essential Metadata for\n3D BRAIN Microscopy includes 91 fields organized into seven categories:\nContributors, Funders, Publication, Instrument, Dataset, Specimen, and Image.\nAdoption of these metadata standards will ensure that investigators receive\ncredit for their work, promote data reuse, facilitate downstream analysis of\nshared data, and encourage collaboration.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 10:32:13 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Ropelewski", "Alexander J.", ""], ["Rizzo", "Megan A.", ""], ["Swedlow", "Jason R.", ""], ["Huisken", "Jan", ""], ["Osten", "Pavel", ""], ["Khanjani", "Neda", ""], ["Weiss", "Kurt", ""], ["Bakalov", "Vesselina", ""], ["Engle", "Michelle", ""], ["Gridley", "Lauren", ""], ["Krzyzanowski", "Michelle", ""], ["Madden", "Tom", ""], ["Maiese", "Deborah", ""], ["Waterfield", "Justin", ""], ["Williams", "David", ""], ["Hamilton", "Carol", ""], ["Huggins", "Wayne", ""]]}, {"id": "2105.10865", "submitter": "Ryan Badman", "authors": "Ryan P. Badman, Yunxin Wu, Keigo Inukai, Rei Akaishi", "title": "Blessing or Curse of Democracy?: Current Evidence from the Covid-19\n  Pandemic", "comments": "21 pages, 2 main figures, 1 main table, 1 supplementary data table", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-bio.OT q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Background: A major question in Covid-19 research is whether democracies\nhandled the Covid-19 pandemic crisis better or worse than authoritarian\ncountries. However, it is important to consider the issues of democracy versus\nauthoritarianism, and state fragility, when examining official Covid-19 death\ncounts in research, because these factors can influence the accurate reporting\nof pandemic deaths by governments. In contrast, excess deaths are less prone to\nvariability in differences in definitions of Covid-19 deaths and testing\ncapacities across countries. Here we use excess pandemic deaths to explore\npotential relationships between political systems and public health outcomes.\n  Methods: We address these issues by comparing the official government\nCovid-19 death counts in a well-established John Hopkins database to the\ngenerally more reliable excess mortality measure of Covid-19 deaths, taken from\nthe recently released World Mortality Dataset. We put the comparison in the\ncontext of the political and fragile state dimensions.\n  Findings: We find (1) significant potential underreporting of Covid-19 deaths\nby authoritarian governments and governments with high state fragility and (2)\nsubstantial geographic variation among countries and regions with regard to\nstandard democracy indices. Additionally, we find that more authoritarian\ngovernments are (weakly) associated with more excess deaths during the pandemic\nthan democratic governments.\n  Interpretations: The inhibition and censorship of information flows, inherent\nto authoritarian states, likely results in major inaccuracies in pandemic\nstatistics that confound global public health analyses. Thus, both excess\npandemic deaths and official Covid-19 death counts should be examined in\nstudies using death as an outcome variable.\n", "versions": [{"version": "v1", "created": "Sun, 23 May 2021 06:52:50 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Badman", "Ryan P.", ""], ["Wu", "Yunxin", ""], ["Inukai", "Keigo", ""], ["Akaishi", "Rei", ""]]}, {"id": "2105.14372", "submitter": "Anthony Gitter", "authors": "Benjamin D. Lee, Anthony Gitter, Casey S. Greene, Sebastian Raschka,\n  Finlay Maguire, Alexander J. Titus, Michael D. Kessler, Alexandra J. Lee,\n  Marc G. Chevrette, Paul Allen Stewart, Thiago Britto-Borges, Evan M. Cofer,\n  Kun-Hsing Yu, Juan Jose Carmona, Elana J. Fertig, Alexandr A. Kalinin, Beth\n  Signal, Benjamin J. Lengerich, Timothy J. Triche Jr, Simina M. Boca", "title": "Ten Quick Tips for Deep Learning in Biology", "comments": "23 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Machine learning is a modern approach to problem-solving and task automation.\nIn particular, machine learning is concerned with the development and\napplications of algorithms that can recognize patterns in data and use them for\npredictive modeling. Artificial neural networks are a particular class of\nmachine learning algorithms and models that evolved into what is now described\nas deep learning. Given the computational advances made in the last decade,\ndeep learning can now be applied to massive data sets and in innumerable\ncontexts. Therefore, deep learning has become its own subfield of machine\nlearning. In the context of biological research, it has been increasingly used\nto derive novel insights from high-dimensional biological data. To make the\nbiological applications of deep learning more accessible to scientists who have\nsome experience with machine learning, we solicited input from a community of\nresearchers with varied biological and deep learning interests. These\nindividuals collaboratively contributed to this manuscript's writing using the\nGitHub version control platform and the Manubot manuscript generation toolset.\nThe goal was to articulate a practical, accessible, and concise set of\nguidelines and suggestions to follow when using deep learning. In the course of\nour discussions, several themes became clear: the importance of understanding\nand applying machine learning fundamentals as a baseline for utilizing deep\nlearning, the necessity for extensive model comparisons with careful\nevaluation, and the need for critical thought in interpreting results generated\nby deep learning, among others.\n", "versions": [{"version": "v1", "created": "Sat, 29 May 2021 21:02:44 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Lee", "Benjamin D.", ""], ["Gitter", "Anthony", ""], ["Greene", "Casey S.", ""], ["Raschka", "Sebastian", ""], ["Maguire", "Finlay", ""], ["Titus", "Alexander J.", ""], ["Kessler", "Michael D.", ""], ["Lee", "Alexandra J.", ""], ["Chevrette", "Marc G.", ""], ["Stewart", "Paul Allen", ""], ["Britto-Borges", "Thiago", ""], ["Cofer", "Evan M.", ""], ["Yu", "Kun-Hsing", ""], ["Carmona", "Juan Jose", ""], ["Fertig", "Elana J.", ""], ["Kalinin", "Alexandr A.", ""], ["Signal", "Beth", ""], ["Lengerich", "Benjamin J.", ""], ["Triche", "Timothy J.", "Jr"], ["Boca", "Simina M.", ""]]}]