[{"id": "1312.0045", "submitter": "Hossein Shokri Ghadikolaei", "authors": "Hossein Shokri-Ghadikolaei, Ioannis Glaropoulos, Viktoria Fodor, Carlo\n  Fischione, Konstantinos Dimou", "title": "Energy Efficient Spectrum Sensing and Handoff Strategies in Cognitive\n  Radio Networks", "comments": "7 pages, 5 figures, submitted to IEEE Commun. Mag", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.ET cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The limited spectrum resources and dramatic growth of high data rate\ncommunications have motivated opportunistic spectrum access using the promising\nconcept of cognitive radio networks. Although this concept has emerged\nprimarily to enhance spectrum utilization, the importance of energy consumption\nposes new challenges, because energy efficiency and communication performance\ncan be at odds. In this paper, the existing approaches to energy efficiency\nspectrum sensing and handoff are classified. The tradeoff between energy\nconsumption and throughput is established as function of the numerous design\nparameters of cognitive radio networks, both in the case of local and of\ncooperative spectrum sensing. It is argued that a number of important aspects\nstill needs to be researched, such as fairness, dynamic behavior, reactive and\nproactive schemes for energy efficiency.\n", "versions": [{"version": "v1", "created": "Sat, 30 Nov 2013 00:28:44 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Shokri-Ghadikolaei", "Hossein", ""], ["Glaropoulos", "Ioannis", ""], ["Fodor", "Viktoria", ""], ["Fischione", "Carlo", ""], ["Dimou", "Konstantinos", ""]]}, {"id": "1312.0309", "submitter": "Laszlo Kish", "authors": "Laszlo B. Kish", "title": "Times in noise-based logic: increased dimensions of logic hyperspace", "comments": "4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Time shifts beyond the correlation time of the logic and reference signals\ncreate new elements that are orthogonal to the original components. This fact\ncan be utilized to increase the number of dimensions of the logic space while\nkeeping the number of reference noises fixed. Using just a single noise and\ntime shifts can realize exponentially large hyperspaces with large numbers of\ndimensions. Other, independent applications of time shifts include holographic\nnoise-based logic systems and changing commutative operations into\nnon-commuting ones. For the sake of simplicity, these ideas are illustrated by\ndeterministic time shifts, even though random timing and random time shifts\nwould yield the most robust systems.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 02:50:48 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Kish", "Laszlo B.", ""]]}, {"id": "1312.0617", "submitter": "Jing Liu", "authors": "Yi Zheng, Zhi-Zhu He, Jun Yang, Jing Liu", "title": "Fully Automatic Liquid Metal Printer towards Personal Electronics\n  Manufacture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Printed electronics is quickly emerging with tremendous value in a wide\nvariety of latest electrical engineering areas. However, restricted to the\nrather limited conductive inks and printing strategies, the currently existing\nelectronics manufacturing tools are generally complicated, expensive, time,\nmaterial, water and energy consuming, and thus mainly restricted to the\nindustrial use. Here from an alternative way, the present article demonstrated\nfor the first time an entirely automatic printing system for personal\nelectronics manufacturing through introducing a composite liquid metal ink\ndelivery and printing mechanism to overcome the large surface tension facing\nthe solution, and integrating it with the notebook computer controlling\nalgorithm. With the developed printer, any desired electronically conductive\npatterns spanning from single wires to various complex structures like\nintegrated circuit (IC), antenna, PCB, RFID, electronic greeting cards,\ndecoration arts, classical buildings (White House, Great Wall etc.) or more\ndo-it-yourself (DIY) circuits were demonstrated to be printed out in a moment\nwith high precision. And the total cost for the whole system has reached\npersonal affordability, which is hard to offer by so far the state of the art\ntechnologies. Some fundamental fluid dynamics mechanisms related to the\nproposed tapping mode enabled reliable printing and adhesion of the liquid\nmetal electronics on the flexible substrate was systematically disclosed\nthrough theoretical interpretation and experimental measurements. This clearly\nbeyond-the-lab technology and pervasively available liquid metal printer opens\nthe way for large scale home level electronics making in the coming time.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2013 08:01:38 GMT"}], "update_date": "2013-12-04", "authors_parsed": [["Zheng", "Yi", ""], ["He", "Zhi-Zhu", ""], ["Yang", "Jun", ""], ["Liu", "Jing", ""]]}, {"id": "1312.1178", "submitter": "Ben de Lacy Costello Dr", "authors": "Ben de Lacy Costello and Andrew Adamatzky", "title": "Routing of Physarum polycephalum signals using simple chemicals", "comments": "19 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In previous work the chemotaxis towards simple organic chemicals was\nassessed. We utilise the knowledge gained from these chemotactic assays to\nroute Physarum polycephalum at a series of junctions. By applying chemical\ninputs at a simple T-junction we were able to reproducibly control the path\ntaken by the plasmodium of P. Polycephalum. Where the chemoattractant farnesene\nwas used at one input a routed signal could be reproducibly generated i.e. P.\nPolycephalum moves towards the source of chemoattractant. Where the\nchemoattractant was applied at both inputs the signal was reproducibly split.\nIf a chemorepellent was used then the signal was reproducibly suppressed. If no\nchemical input was used in the simple circuit then a random signal was\ngenerated, whereby P. Polycephalum would move towards one output at the\njunction, but the direction was randomly selected. We extended this study to a\nmore complex series of T-junctions to explore further the potential of routing\nP. Polycephalum. Although many of the circuits were completed effectively, any\nerrors from the implementation of the simple T-junction were magnified. There\nwere also issues with cascading effects through multiple junctions. For example\nsignal splitting could be reproducibly initiated at the first junction but not\nat subsequent junctions. This work highlights the potential for exploiting\nchemotaxis to achieve complex and reliable routing of P. Polycephalum signals.\nThis may be useful in implementing computing algorithms, design of autonomous\nrobots and directed material synthesis. In additional experiments we showed\nthat the application of chemoattractant compounds at specific locations on a\nhomogeneous substrate could be used to reliably control the spatial\nconfiguration of P. Polycephalum. This may have applications in implementing\ngeometric calculations and in robot navigation tasks such as mapping chemical\nplumes.\n", "versions": [{"version": "v1", "created": "Wed, 4 Dec 2013 14:30:24 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["Costello", "Ben de Lacy", ""], ["Adamatzky", "Andrew", ""]]}, {"id": "1312.4139", "submitter": "Andrew Adamatzky", "authors": "Andrew Adamatzky", "title": "Towards slime mould colour sensor: Recognition of colours by Physarum\n  polycephalum", "comments": null, "journal-ref": "Adamatzky A. Towards slime mould colour sensor: Recognition of\n  colours by Physarum polycephalum. Organic Electronics 14 (2013) 12, 3355-3361", "doi": null, "report-no": null, "categories": "cs.ET physics.bio-ph q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Acellular slime mould Physarum polycephalum is a popular now user-friendly\nliving substrate for designing of future and emergent sensing and computing\ndevices. P. polycephalum exhibits regular patterns of oscillations of its\nsurface electrical potential. The oscillation patterns are changed when the\nslime mould is subjected to mechanical, chemical, electrical or optical\nstimuli. We evaluate feasibility of slime-mould based colour sensors by\nilluminating Physarum with red, green, blue and white colours and analysing\npatterns of the slime mould's electrical potential oscillations. We define that\nthe slime mould recognises a colour if it reacts to illumination with the\ncolour by a unique changes in amplitude and periods of oscillatory activity. In\nlaboratory experiments we found that the slime mould recognises red and blue\ncolour. The slime mould does not differentiate between green and white colours.\nThe slime mould also recognises when red colour is switched off. We also map\ncolours to diversity of the oscillations: illumination with a white colour\nincreases diversity of amplitudes and periods of oscillations, other colours\nstudied increase diversity either of amplitude or period.\n", "versions": [{"version": "v1", "created": "Sun, 15 Dec 2013 12:02:44 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Adamatzky", "Andrew", ""]]}, {"id": "1312.4189", "submitter": "Andrew Adamatzky", "authors": "James G.H. Whiting, Ben P.J. de Lacy Costello, Andrew Adamatzky", "title": "Towards slime mould chemical sensor: Mapping chemical inputs onto\n  electrical potential dynamics of Physarum Polycephalum", "comments": null, "journal-ref": "Sensors and Actuators B: Chemical 191 (2014) 844-853", "doi": null, "report-no": null, "categories": "cs.ET physics.bio-ph q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We experimentally derived a unique one-to-one mapping between a range of\nselected bioactive chemicals and patterns of oscillations of the slime mould's\nextacellular electrical potential.\n", "versions": [{"version": "v1", "created": "Sun, 15 Dec 2013 20:48:34 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Whiting", "James G. H.", ""], ["Costello", "Ben P. J. de Lacy", ""], ["Adamatzky", "Andrew", ""]]}, {"id": "1312.4422", "submitter": "Ella Gale", "authors": "Ella M. Gale, Benjamin de Lacy Costello and Andrew Adamatzky", "title": "Which Memristor Theory is Best for Relating Devices Properties to\n  Memristive Function?", "comments": "32 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.mtrl-sci cond-mat.mes-hall cs.ET physics.chem-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are three theoretical models which purport to relate\nexperimentally-measurable or fabrication-controllable device properties to the\nmemristor's operation: 1. Strukov et al's phenomenological model; 2. Georgiou\net al's Bernoulli rewrite of that phenomenological model; 3. Gale's\nmemory-conservation model. They differ in their prediction of the effect on\nmemristance of changing the electrode size and factors that affect the\nhysteresis. Using a batch of TiO$_2$ sol-gel memristors fabricated with\ndifferent top electrode widths we test and compare these three theories. It was\nfound that, contrary to model 2's prediction, the `dimensionless lumped\nparameter', $\\beta$, did not correlate to any measure of the hysteresis.\nContrary to model 1, memristance was found to be dependent on the three spatial\ndimensions of the TiO$_2$ layer, as was predicted by model 3. Model 3 was found\nto fit the change in resistance value with electrode size. Simulations using\nmodel 3 and experimentally derived values for contact resistance gave\nhysteresis values that were linearly related to (and only one order of\nmagnitude out) from the experimentally-measured values. Memristor hysteresis\nwas found to be related to the ON state resistance and thus the electrode size\n(as those two are related). These results offer a verification of the\nmemory-conservation theory of memristance and its association of the vacancy\nmagnetic flux with the missing magnetic flux in memristor theory. This is the\nfirst paper to experimentally test various theories pertaining to the operation\nof memristor devices.\n", "versions": [{"version": "v1", "created": "Mon, 16 Dec 2013 16:45:42 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Gale", "Ella M.", ""], ["Costello", "Benjamin de Lacy", ""], ["Adamatzky", "Andrew", ""]]}, {"id": "1312.5169", "submitter": "Micah McCurdy", "authors": "Micah Blake McCurdy, Jeffrey Egger, Jordan Kyriakidis", "title": "Decomposition and Gluing for Adiabatic Quantum Optimization", "comments": "15 pages, many figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Farhi and others have introduced the notion of solving NP problems using\nadiabatic quantum com- puters. We discuss an application of this idea to the\nproblem of integer factorization, together with a technique we call gluing\nwhich can be used to build adiabatic models of interesting problems. Although\nadiabatic quantum computers already exist, they are likely to be too small to\ndirectly tackle problems of interesting practical sizes for the foreseeable\nfuture. Therefore, we discuss techniques for decomposition of large problems,\nwhich permits us to fully exploit such hardware as may be available. Numerical\nre- sults suggest that even simple decomposition techniques may yield\nacceptable results with subexponential overhead, independent of the performance\nof the underlying device.\n", "versions": [{"version": "v1", "created": "Tue, 17 Dec 2013 19:54:07 GMT"}], "update_date": "2013-12-19", "authors_parsed": [["McCurdy", "Micah Blake", ""], ["Egger", "Jeffrey", ""], ["Kyriakidis", "Jordan", ""]]}, {"id": "1312.6584", "submitter": "Peter Selinger", "authors": "Brett Giles and Peter Selinger", "title": "Remarks on Matsumoto and Amano's normal form for single-qubit Clifford+T\n  operators", "comments": "13 pages. Changes in v2: minor typos corrected, small updates to\n  introduction", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Matsumoto and Amano (2008) showed that every single-qubit Clifford+T operator\ncan be uniquely written of a particular form, which we call the Matsumoto-Amano\nnormal form. In this mostly expository paper, we give a detailed and\nstreamlined presentation of Matsumoto and Amano's results, simplifying some\nproofs along the way. We also point out some corollaries to Matsumoto and\nAmano's work, including an intrinsic characterization of the Clifford+T\nsubgroup of SO(3), which also yields an efficient T-optimal exact single-qubit\nsynthesis algorithm. Interestingly, this also gives an alternative proof of\nKliuchnikov, Maslov, and Mosca's exact synthesis result for the Clifford+T\nsubgroup of U(2).\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2013 15:52:38 GMT"}, {"version": "v2", "created": "Thu, 21 Feb 2019 14:12:13 GMT"}], "update_date": "2019-02-22", "authors_parsed": [["Giles", "Brett", ""], ["Selinger", "Peter", ""]]}, {"id": "1312.7354", "submitter": "Md. Selim Al Mamun", "authors": "Md. Selim Al Mamun, Syed Monowar Hossain", "title": "Design of Reversible Random Access Memory", "comments": null, "journal-ref": "International Journal of Computer Applications,Volume 56 - Number\n  15 , Year of Publication: 2012", "doi": "10.5120/8967-3182", "report-no": null, "categories": "cs.ET cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reversible logic has become immensely popular research area and its\napplications have spread in various technologies for their low power\nconsumption. In this paper we proposed an efficient design of random access\nmemory using reversible logic. In the way of designing the reversible random\naccess memory we proposed a reversible decoder and a write enable reversible\nmaster slave D flip-flop. All the reversible designs are superior in terms of\nquantum cost, delay and garbage outputs compared to the designs existing in\nliterature.\n", "versions": [{"version": "v1", "created": "Sun, 22 Dec 2013 15:13:12 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Mamun", "Md. Selim Al", ""], ["Hossain", "Syed Monowar", ""]]}, {"id": "1312.7355", "submitter": "Md. Selim Al Mamun", "authors": "Md. Selim Al Mamun, Pronab Kumar Mondal, Uzzal Kumar Prodhan", "title": "A Novel Approach for Designing Online Testable Reversible Circuits", "comments": null, "journal-ref": "International Journal of Engineering Research and Development,\n  Volume 5, Issue 2, PP. 39-44 Year 2012", "doi": null, "report-no": null, "categories": "cs.ET cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reversible logic is gaining interest of many researchers due to its low power\ndissipating characteristic. In this paper we proposed a new approach for\ndesigning online testable reversible circuits. The resultant testable\nreversible circuit can detect any single bit error whiles it is operating.\nAppropriate theorems and lemmas are presented to clarify the proposed design.\nThe experimental results show that our design approach is superior in terms of\nnumber of number of gates, garbage outputs and quantum cost.\n", "versions": [{"version": "v1", "created": "Sun, 22 Dec 2013 15:59:43 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Mamun", "Md. Selim Al", ""], ["Mondal", "Pronab Kumar", ""], ["Prodhan", "Uzzal Kumar", ""]]}]