[{"id": "1808.00458", "submitter": "Sunil Pai", "authors": "Sunil Pai, Ben Bartlett, Olav Solgaard, David A. B. Miller", "title": "Matrix optimization on universal unitary photonic devices", "comments": "18 pages, 2 tables, 14 figures, 6 videos (videos provided in Appendix\n  via external URL link)", "journal-ref": "Phys. Rev. Applied 11, 064044 (2019)", "doi": "10.1103/PhysRevApplied.11.064044", "report-no": null, "categories": "eess.SP cs.ET cs.NE physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Universal unitary photonic devices can apply arbitrary unitary\ntransformations to a vector of input modes and provide a promising hardware\nplatform for fast and energy-efficient machine learning using light. We\nsimulate the gradient-based optimization of random unitary matrices on\nuniversal photonic devices composed of imperfect tunable interferometers. If\ndevice components are initialized uniform-randomly, the locally-interacting\nnature of the mesh components biases the optimization search space towards\nbanded unitary matrices, limiting convergence to random unitary matrices. We\ndetail a procedure for initializing the device by sampling from the\ndistribution of random unitary matrices and show that this greatly improves\nconvergence speed. We also explore mesh architecture improvements such as\nadding extra tunable beamsplitters or permuting waveguide layers to further\nimprove the training speed and scalability of these devices.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2018 01:27:13 GMT"}, {"version": "v2", "created": "Tue, 18 Dec 2018 19:14:24 GMT"}, {"version": "v3", "created": "Wed, 22 May 2019 01:44:06 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Pai", "Sunil", ""], ["Bartlett", "Ben", ""], ["Solgaard", "Olav", ""], ["Miller", "David A. B.", ""]]}, {"id": "1808.00679", "submitter": "Alex James Dr", "authors": "Irina Dolzhikova, Khaled Salama, Vipin Kizheppatt, Alex Pappachen\n  James", "title": "Memristor-based Synaptic Sampling Machines", "comments": null, "journal-ref": "IEEE NANO, 2018", "doi": null, "report-no": null, "categories": "cs.ET cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Synaptic Sampling Machine (SSM) is a type of neural network model that\nconsiders biological unreliability of the synapses. We propose the circuit\ndesign of the SSM neural network which is realized through the memristive-CMOS\ncrossbar structure with the synaptic sampling cell (SSC) being used as a basic\nstochastic unit. The increase in the edge computing devices in the Internet of\nthings era, drives the need for hardware acceleration for data processing and\ncomputing. The computational considerations of the processing speed and\npossibility for the real-time realization pushes the synaptic sampling\nalgorithm that demonstrated promising results on software for hardware\nimplementation.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2018 06:05:07 GMT"}], "update_date": "2018-08-03", "authors_parsed": [["Dolzhikova", "Irina", ""], ["Salama", "Khaled", ""], ["Kizheppatt", "Vipin", ""], ["James", "Alex Pappachen", ""]]}, {"id": "1808.00733", "submitter": "Alex James Dr", "authors": "Olga Krestinskaya, Alex Pappachen James", "title": "Approximate Probabilistic Neural Networks with Gated Threshold Logic", "comments": null, "journal-ref": "IEEE NANO 2018", "doi": null, "report-no": null, "categories": "cs.ET cs.AI cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Probabilistic Neural Network (PNN) is a feed-forward artificial neural\nnetwork developed for solving classification problems. This paper proposes a\nhardware implementation of an approximated PNN (APNN) algorithm in which the\nconventional exponential function of the PNN is replaced with gated threshold\nlogic. The weights of the PNN are approximated using a memristive crossbar\narchitecture. In particular, the proposed algorithm performs normalization of\nthe training weights, and quantization into 16 levels which significantly\nreduces the complexity of the circuit.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2018 09:48:11 GMT"}], "update_date": "2018-08-03", "authors_parsed": [["Krestinskaya", "Olga", ""], ["James", "Alex Pappachen", ""]]}, {"id": "1808.00737", "submitter": "Alex James Dr", "authors": "Olga Krestinskaya, Alex Pappachen James", "title": "Binary Weighted Memristive Analog Deep Neural Network for Near-Sensor\n  Edge Processing", "comments": null, "journal-ref": "IEEE NANO 2018", "doi": null, "report-no": null, "categories": "cs.ET cs.AI cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The memristive crossbar aims to implement analog weighted neural network,\nhowever, the realistic implementation of such crossbar arrays is not possible\ndue to limited switching states of memristive devices. In this work, we propose\nthe design of an analog deep neural network with binary weight update through\nbackpropagation algorithm using binary state memristive devices. We show that\nsuch networks can be successfully used for image processing task and has the\nadvantage of lower power consumption and small on-chip area in comparison with\ndigital counterparts. The proposed network was benchmarked for MNIST\nhandwritten digits recognition achieving an accuracy of approximately 90%.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2018 09:51:07 GMT"}], "update_date": "2018-08-03", "authors_parsed": [["Krestinskaya", "Olga", ""], ["James", "Alex Pappachen", ""]]}, {"id": "1808.01241", "submitter": "Indranil Chakraborty", "authors": "Indranil Chakraborty, Gobinda Saha and Kaushik Roy", "title": "A Photonic In-Memory Computing primitive for Spiking Neural Networks\n  using Phase-Change Materials", "comments": "14 pages, 11 figures, submitted to Physical Review Applied", "journal-ref": "Phys. Rev. Applied 11, 014063 (2019)", "doi": "10.1103/PhysRevApplied.11.014063", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spiking Neural Networks (SNNs) offer an event-driven and more biologically\nrealistic alternative to standard Artificial Neural Networks based on analog\ninformation processing. This can potentially enable energy-efficient hardware\nimplementations of neuromorphic systems which emulate the functional units of\nthe brain, namely, neurons and synapses. Recent demonstrations of ultra-fast\nphotonic computing devices based on phase-change materials (PCMs) show promise\nof addressing limitations of electrically driven neuromorphic systems. However,\nscaling these standalone computing devices to a parallel in-memory computing\nprimitive is a challenge. In this work, we utilize the optical properties of\nthe PCM, Ge\\textsubscript{2}Sb\\textsubscript{2}Te\\textsubscript{5} (GST), to\npropose a Photonic Spiking Neural Network computing primitive, comprising of a\nnon-volatile synaptic array integrated seamlessly with previously explored\n`integrate-and-fire' neurons. The proposed design realizes an `in-memory'\ncomputing platform that leverages the inherent parallelism of\nwavelength-division-multiplexing (WDM). We show that the proposed computing\nplatform can be used to emulate a SNN inferencing engine for image\nclassification tasks. The proposed design not only bridges the gap between\nisolated computing devices and parallel large-scale implementation, but also\npaves the way for ultra-fast computing and localized on-chip learning.\n", "versions": [{"version": "v1", "created": "Fri, 3 Aug 2018 16:03:17 GMT"}, {"version": "v2", "created": "Sun, 12 Aug 2018 23:19:34 GMT"}, {"version": "v3", "created": "Wed, 24 Oct 2018 01:28:41 GMT"}], "update_date": "2019-02-06", "authors_parsed": [["Chakraborty", "Indranil", ""], ["Saha", "Gobinda", ""], ["Roy", "Kaushik", ""]]}, {"id": "1808.02537", "submitter": "Dominique Vuillaume", "authors": "Y. Viero, D. Guerin, A. Vladyka, F. Alibart, S. Lenfant, M. Calame and\n  D. Vuillaume", "title": "Light-stimulable molecules/nanoparticles networks for switchable logical\n  functions and reservoir computing", "comments": null, "journal-ref": "Adv. Func. Mater. 28, 1801506, 2018", "doi": "10.1002/adfm.201801506", "report-no": null, "categories": "physics.app-ph cond-mat.mes-hall cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report the fabrication and electron transport properties of nanoparticles\nself-assembled networks (NPSAN) of molecular switches (azobenzene derivatives)\ninterconnected by Au nanoparticles, and we demonstrate optically-driven\nswitchable logical operations associated to the light controlled switching of\nthe molecules. The switching yield is up to 74%. We also demonstrate that these\nNPSANs are prone for light-stimulable reservoir computing. The complex\nnon-linearity of electron transport and dynamics in these highly connected and\nrecurrent networks of molecular junctions exhibit rich high harmonics\ngeneration (HHG) required for reservoir computing (RC) approaches. Logical\nfunctions and HHG are controlled by the isomerization of the molecules upon\nlight illumination. These results, without direct analogs in semiconductor\ndevices, open new perspectives to molecular electronics in unconventional\ncomputing.\n", "versions": [{"version": "v1", "created": "Tue, 7 Aug 2018 20:08:26 GMT"}], "update_date": "2018-10-09", "authors_parsed": [["Viero", "Y.", ""], ["Guerin", "D.", ""], ["Vladyka", "A.", ""], ["Alibart", "F.", ""], ["Lenfant", "S.", ""], ["Calame", "M.", ""], ["Vuillaume", "D.", ""]]}, {"id": "1808.03303", "submitter": "Hengameh Bagherian", "authors": "Hengameh Bagherian, Scott Skirlo, Yichen Shen, Huaiyu Meng, Vladimir\n  Ceperic, and Marin Soljacic", "title": "On-Chip Optical Convolutional Neural Networks", "comments": "18 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Convolutional Neural Networks (CNNs) are a class of Artificial Neural\nNetworks(ANNs) that employ the method of convolving input images with\nfilter-kernels for object recognition and classification purposes. In this\npaper, we propose a photonics circuit architecture which could consume a\nfraction of energy per inference compared with state of the art electronics.\n", "versions": [{"version": "v1", "created": "Thu, 9 Aug 2018 18:52:50 GMT"}, {"version": "v2", "created": "Thu, 16 Aug 2018 22:16:27 GMT"}], "update_date": "2018-08-20", "authors_parsed": [["Bagherian", "Hengameh", ""], ["Skirlo", "Scott", ""], ["Shen", "Yichen", ""], ["Meng", "Huaiyu", ""], ["Ceperic", "Vladimir", ""], ["Soljacic", "Marin", ""]]}, {"id": "1808.03388", "submitter": "Roozbeh Khodambashi", "authors": "Ningquan Wang, Ruxiu Liu, Roozbeh Khodambashi, Norh Asmare, and A.\n  Fatih Sarioglu", "title": "Code-division multiplexed resistive pulse sensor networks for\n  spatio-temporal detection of particles in microfluidic devices", "comments": "2017 IEEE 30th International Conference on Micro Electro Mechanical\n  Systems (MEMS)", "journal-ref": null, "doi": "10.1109/MEMSYS.2017.7863416", "report-no": null, "categories": "cs.ET cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatial separation of suspended particles based on contrast in their physical\nor chemical properties forms the basis of various biological assays performed\non lab-on-achip devices. To electronically acquire this information, we have\nrecently introduced a microfluidic sensing platform, called Microfluidic CODES,\nwhich combines the resistive pulse sensing with the code division multiple\naccess in multiplexing a network of integrated electrical sensors. In this\npaper, we enhance the multiplexing capacity of the Microfluidic CODES by\nemploying sensors that generate non-orthogonal code waveforms and a new\ndecoding algorithm that combines machine learning techniques with minimum\nmean-squared error estimation. As a proof of principle, we fabricated a\nmicrofluidic device with a network of 10 code-multiplexed sensors and\ncharacterized it using cells suspended in phosphate buffer saline solution.\n", "versions": [{"version": "v1", "created": "Fri, 10 Aug 2018 01:58:27 GMT"}], "update_date": "2018-08-13", "authors_parsed": [["Wang", "Ningquan", ""], ["Liu", "Ruxiu", ""], ["Khodambashi", "Roozbeh", ""], ["Asmare", "Norh", ""], ["Sarioglu", "A. Fatih", ""]]}, {"id": "1808.04242", "submitter": "Mauro Femminella", "authors": "Luca Felicetti, Mauro Femminella, Gianluca Reali, Pietro Li\\`o", "title": "Applications of molecular communications to medicine: a survey", "comments": null, "journal-ref": "Nano Communication Networks, Volume 7, March 2016, Pages 27-45", "doi": "10.1016/j.nancom.2015.08.004", "report-no": null, "categories": "cs.ET physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, progresses in nanotechnology have established the\nfoundations for implementing nanomachines capable of carrying out simple but\nsignificant tasks. Under this stimulus, researchers have been proposing various\nsolutions for realizing nanoscale communications, considering both\nelectromagnetic and biological communications. Their aim is to extend the\ncapabilities of nanodevices, so as to enable the execution of more complex\ntasks by means of mutual coordination, achievable through communications.\nHowever, although most of these proposals show how devices can communicate at\nthe nanoscales, they leave in the background specific applications of these new\ntechnologies. Thus, this paper shows an overview of the actual and potential\napplications that can rely on a specific class of such communications\ntechniques, commonly referred to as molecular communications. In particular, we\nfocus on health-related applications. This decision is due to the rapidly\nincreasing interests of research communities and companies to minimally\ninvasive, biocompatible, and targeted health-care solutions. Molecular\ncommunication techniques have actually the potentials of becoming the main\ntechnology for implementing advanced medical solution. Hence, in this paper we\nprovide a taxonomy of potential applications, illustrate them in some details,\nalong with the existing open challenges for them to be actually deployed, and\ndraw future perspectives.\n", "versions": [{"version": "v1", "created": "Mon, 13 Aug 2018 14:11:21 GMT"}], "update_date": "2018-08-14", "authors_parsed": [["Felicetti", "Luca", ""], ["Femminella", "Mauro", ""], ["Reali", "Gianluca", ""], ["Liò", "Pietro", ""]]}, {"id": "1808.04273", "submitter": "Mauro Femminella", "authors": "Mauro Femminella, Gianluca Reali, Athanasios V. Vasilakos", "title": "A molecular communications model for drug delivery", "comments": null, "journal-ref": "IEEE Trans Nanobioscience. 2015 Dec;14(8):935-45", "doi": "10.1109/TNB.2015.2489565", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the scenario of a targeted drug delivery system, which\nconsists of deploying a number of biological nanomachines close to a biological\ntarget (e.g. a tumor), able to deliver drug molecules in the diseased area.\nSuitably located transmitters are designed to release a continuous flow of drug\nmolecules in the surrounding environment, where they diffuse and reach the\ntarget. These molecules are received when they chemically react with compliant\nreceptors deployed on the receiver surface. In these conditions, if the release\nrate is relatively high and the drug absorption time is significant, congestion\nmay happen, essentially at the receiver site. This phenomenon limits the drug\nabsorption rate and makes the signal transmission ineffective, with an\nundesired diffusion of drug molecules elsewhere in the body. The original\ncontribution of this paper consists of a theoretical analysis of the causes of\ncongestion in diffusion-based molecular communications. For this purpose, it is\nproposed a reception model consisting of a set of pure loss queuing systems.\nThe proposed model exhibits an excellent agreement with the results of a\nsimulation campaign made by using the Biological and Nano-Scale communication\nsimulator version 2 (BiNS2), a well-known simulator for molecular\ncommunications, whose reliability has been assessed through in-vitro\nexperiments. The obtained results can be used in rate control algorithms to\noptimally determine the optimal release rate of molecules in drug delivery\napplications.\n", "versions": [{"version": "v1", "created": "Mon, 13 Aug 2018 14:38:06 GMT"}], "update_date": "2018-08-14", "authors_parsed": [["Femminella", "Mauro", ""], ["Reali", "Gianluca", ""], ["Vasilakos", "Athanasios V.", ""]]}, {"id": "1808.04790", "submitter": "Shalin Shah", "authors": "Shalin Shah, Manish Gupta", "title": "DNA-based chemical compiler", "comments": "This work was done as part of Shalin's bachelor's thesis in 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Marcello, in 1997, formally proved that chemical kinetics can make a\nuniversal computer i.e they can replicate any digital circuit. Recently,\nSoloveichik et al. showed that chemical kinetics can perform fast and reliable\nTuring Universal computations. To simulate the behavior of chemical reactions,\nSean et al. developed a software called CAIN which represents chemical\nreactions in XML format. In this work, we have made an attempt to create\ntrans-compiler which can take python like code as input and gives CAIN\nsupported chemical reactions file as output. This can be compared to generating\nassembly code from a high-level programming language. Additionally, Soloveichik\net al. also showed DNA as a universal primer for implementing CRN's and Andrews\nPhillips developed Visual DSD programming language for simulating all the\npossible DSD reactions. CRN2DSD, a software developed by Manish Gupta's team,\ncan, already, convert a CAIN file to Microsoft's Visual DSD code i.e assembly\nlevel to machine level. Hence, our attempt to convert high-level code to\nassembly code takes us one step closer to completing the dream of making a\nchemical compiler.\n", "versions": [{"version": "v1", "created": "Tue, 14 Aug 2018 16:50:48 GMT"}], "update_date": "2018-08-15", "authors_parsed": [["Shah", "Shalin", ""], ["Gupta", "Manish", ""]]}, {"id": "1808.04962", "submitter": "Gouhei Tanaka", "authors": "Gouhei Tanaka, Toshiyuki Yamane, Jean Benoit H\\'eroux, Ryosho Nakane,\n  Naoki Kanazawa, Seiji Takeda, Hidetoshi Numata, Daiju Nakano, and Akira\n  Hirose", "title": "Recent Advances in Physical Reservoir Computing: A Review", "comments": "62 pages, 13 figures", "journal-ref": "Neural Networks, Vol. 115, Pages 100-123 (2019)", "doi": "10.1016/j.neunet.2019.03.005", "report-no": null, "categories": "cs.ET", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Reservoir computing is a computational framework suited for\ntemporal/sequential data processing. It is derived from several recurrent\nneural network models, including echo state networks and liquid state machines.\nA reservoir computing system consists of a reservoir for mapping inputs into a\nhigh-dimensional space and a readout for pattern analysis from the\nhigh-dimensional states in the reservoir. The reservoir is fixed and only the\nreadout is trained with a simple method such as linear regression and\nclassification. Thus, the major advantage of reservoir computing compared to\nother recurrent neural networks is fast learning, resulting in low training\ncost. Another advantage is that the reservoir without adaptive updating is\namenable to hardware implementation using a variety of physical systems,\nsubstrates, and devices. In fact, such physical reservoir computing has\nattracted increasing attention in diverse fields of research. The purpose of\nthis review is to provide an overview of recent advances in physical reservoir\ncomputing by classifying them according to the type of the reservoir. We\ndiscuss the current issues and perspectives related to physical reservoir\ncomputing, in order to further expand its practical applications and develop\nnext-generation machine learning systems.\n", "versions": [{"version": "v1", "created": "Wed, 15 Aug 2018 04:09:41 GMT"}, {"version": "v2", "created": "Wed, 19 Dec 2018 08:32:33 GMT"}, {"version": "v3", "created": "Mon, 15 Apr 2019 09:10:25 GMT"}], "update_date": "2019-04-16", "authors_parsed": [["Tanaka", "Gouhei", ""], ["Yamane", "Toshiyuki", ""], ["Héroux", "Jean Benoit", ""], ["Nakane", "Ryosho", ""], ["Kanazawa", "Naoki", ""], ["Takeda", "Seiji", ""], ["Numata", "Hidetoshi", ""], ["Nakano", "Daiju", ""], ["Hirose", "Akira", ""]]}, {"id": "1808.05145", "submitter": "Wayan Wicke", "authors": "Laura Grebenstein and Jens Kirchner and Renata Stavracakis Peixoto and\n  Wiebke Zimmermann and Florian Irnstorfer and Wayan Wicke and Arman Ahmadzadeh\n  and Vahid Jamali and Georg Fischer and Robert Weigel and Andreas Burkovski\n  and Robert Schober", "title": "Biological Optical-to-Chemical Signal Conversion Interface: A\n  Small-scale Modulator for Molecular Communications", "comments": "28 pages, 10 figures. This work has been submitted to the IEEE for\n  possible publication. Copyright may be transferred without notice, after\n  which this version may no longer be accessible. arXiv admin note: substantial\n  text overlap with arXiv:1804.05555", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although many exciting applications of molecular communication (MC) systems\nare envisioned to be at microscale, the MC testbeds reported so far are mostly\nat macroscale. To link the macroworld to the microworld, we propose and\ndemonstrate a biological signal conversion interface that can also be seen as a\nmicroscale modulator. In particular, the proposed interface transduces an\noptical signal, which is controlled using an LED, into a chemical signal by\nchanging the pH of the environment. The modulator is realized using E. coli\nbacteria as microscale entity expressing the light-driven proton pump\ngloeorhodopsin from Gloeobacter violaceus. Upon inducing external light\nstimuli, these bacteria locally change their surrounding pH level by exporting\nprotons into the environment. To verify the effectiveness of the proposed\noptical-to-chemical signal converter, we analyze the pH signal measured by a pH\nsensor, which serves as receiver. We develop an analytical parametric model for\nthe induced chemical signal as a function of the applied optical signal. Using\nthis model, we derive a training-based channel estimator which estimates the\nparameters of the proposed model to fit the measurement data. We further derive\nthe optimal maximum likelihood detector and a suboptimal low-complexity\ndetector to recover the transmitted data from the measured received signal. It\nis shown that the proposed parametric model is in good agreement with the\nmeasurement data. Moreover, for an example scenario, we show that the proposed\nsetup is able to successfully convert an optical signal representing a sequence\nof binary symbols into a chemical signal with a bit rate of 1 bit/minute and\nrecover the transmitted data from the chemical signal using the proposed\nestimation and detection~schemes. The proposed modulator may form the basis for\nfuture MC testbeds and applications at microscale.\n", "versions": [{"version": "v1", "created": "Tue, 14 Aug 2018 15:07:59 GMT"}], "update_date": "2018-08-16", "authors_parsed": [["Grebenstein", "Laura", ""], ["Kirchner", "Jens", ""], ["Peixoto", "Renata Stavracakis", ""], ["Zimmermann", "Wiebke", ""], ["Irnstorfer", "Florian", ""], ["Wicke", "Wayan", ""], ["Ahmadzadeh", "Arman", ""], ["Jamali", "Vahid", ""], ["Fischer", "Georg", ""], ["Weigel", "Robert", ""], ["Burkovski", "Andreas", ""], ["Schober", "Robert", ""]]}, {"id": "1808.05147", "submitter": "Wayan Wicke", "authors": "Wayan Wicke and Arman Ahmadzadeh and Vahid Jamali and Harald\n  Unterweger and Christoph Alexiou and Robert Schober", "title": "Magnetic Nanoparticle Based Molecular Communication in Microfluidic\n  Environments", "comments": "15 pages (double column), 8 figures, 1 table. Accepted for\n  publication in the IEEE Transactions on NanoBioscience (TNB). (Author's\n  comment: This is the extended journal version of the conference paper\n  arXiv:1704.04206)", "journal-ref": null, "doi": "10.1109/TNB.2019.2895244", "report-no": null, "categories": "cs.ET physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The possibility to guide and control magnetic nanoparticles in a non-invasive\nmanner has spawned various applications in biotechnology such as targeted drug\ndelivery and sensing of biological substances. These applications are\nfacilitated by the engineering of the size, selective chemical reactivity, and\ngeneral chemical composition of the employed particles. Motivated by their\nwidespread use and favorable properties, in this paper, we provide a\ntheoretical study of the potential benefits of magnetic nanoparticles for the\ndesign of molecular communication systems. In particular, we consider magnetic\nnanoparticle based communication in a microfluidic channel where an external\nmagnetic field is employed to attract the information-carrying particles to the\nreceiver. We show that the particle transport affected by Brownian motion,\nfluid flow, and an external magnetic field can be mathematically modeled as\ndiffusion with drift. Thereby, we reveal that the key parameters determining\nthe magnetic force are the particle size and the magnetic field gradient.\nMoreover, we derive an analytical expression for the channel impulse response,\nwhich is used to evaluate the potential gain in the expected number of observed\nnanoparticles due to the magnetic field. Furthermore, adopting the symbol error\nrate as performance metric, we show that using magnetic nanoparticles can\nenable reliable communication in the presence of disruptive fluid flow.\nNumerical results obtained by particle-based simulation validate the accuracy\nof the derived analytical expressions.\n", "versions": [{"version": "v1", "created": "Tue, 14 Aug 2018 15:16:52 GMT"}, {"version": "v2", "created": "Mon, 4 Feb 2019 18:05:50 GMT"}], "update_date": "2019-02-05", "authors_parsed": [["Wicke", "Wayan", ""], ["Ahmadzadeh", "Arman", ""], ["Jamali", "Vahid", ""], ["Unterweger", "Harald", ""], ["Alexiou", "Christoph", ""], ["Schober", "Robert", ""]]}, {"id": "1808.05839", "submitter": "Abdullah Zyarah", "authors": "Abdullah M. Zyarah and Dhireesha Kudithipudi", "title": "Neuromorphic Architecture for the Hierarchical Temporal Memory", "comments": null, "journal-ref": null, "doi": "10.1109/TETCI.2018.2850314", "report-no": null, "categories": "cs.AI cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A biomimetic machine intelligence algorithm, that holds promise in creating\ninvariant representations of spatiotemporal input streams is the hierarchical\ntemporal memory (HTM). This unsupervised online algorithm has been demonstrated\non several machine-learning tasks, including anomaly detection. Significant\neffort has been made in formalizing and applying the HTM algorithm to different\nclasses of problems. There are few early explorations of the HTM hardware\narchitecture, especially for the earlier version of the spatial pooler of HTM\nalgorithm. In this article, we present a full-scale HTM architecture for both\nspatial pooler and temporal memory. Synthetic synapse design is proposed to\naddress the potential and dynamic interconnections occurring during learning.\nThe architecture is interweaved with parallel cells and columns that enable\nhigh processing speed for the HTM. The proposed architecture is verified for\ntwo different datasets: MNIST and the European number plate font (EUNF), with\nand without the presence of noise. The spatial pooler architecture is\nsynthesized on Xilinx ZYNQ-7, with 91.16% classification accuracy for MNIST and\n90\\% accuracy for EUNF, with noise. For the temporal memory sequence\nprediction, first and second order predictions are observed for a 5-number long\nsequence generated from EUNF dataset and 95% accuracy is obtained. Moreover,\nthe proposed hardware architecture offers 1364X speedup over the software\nrealization. These results indicate that the proposed architecture can serve as\na digital core to build the HTM in hardware and eventually as a standalone\nself-learning system.\n", "versions": [{"version": "v1", "created": "Fri, 17 Aug 2018 12:37:58 GMT"}], "update_date": "2018-08-20", "authors_parsed": [["Zyarah", "Abdullah M.", ""], ["Kudithipudi", "Dhireesha", ""]]}, {"id": "1808.05982", "submitter": "Isaac Abraham", "authors": "Isaac Abraham", "title": "Memristor - The fictional circuit element", "comments": "15 pages, 6 figures, Sci Rep published + additional material", "journal-ref": "Scientific Reports volume 8, Article number: 10972 (2018)", "doi": "10.1038/s41598-018-29394-7", "report-no": null, "categories": "cs.ET physics.app-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The memory resistor abbreviated memristor was a harmless postulate in 1971.\nIn the decade since 2008, a device claiming to be the missing memristor is on\nthe prowl, seeking recognition as a fundamental circuit element, sometimes\nwanting electronics textbooks to be rewritten, always promising remarkable\ndigital, analog and neuromorphic computing possibilities. A systematic\ndiscussion about the fundamental nature of the device is almost universally\nabsent. This report investigates the assertion that the memristor is a\nfundamental passive circuit element, from the perspective that electrical\nengineering is the science of charge management. With a periodic table of\nfundamental elements, we demonstrate that there can only be three fundamental\npassive circuit elements. The ideal memristor is shown to be an unphysical\nactive device. A vacancy transport model further reveals that a physically\nrealizable memristor is a nonlinear composition of two resistors with active\nhysteresis.\n", "versions": [{"version": "v1", "created": "Fri, 17 Aug 2018 20:21:31 GMT"}], "update_date": "2018-08-21", "authors_parsed": [["Abraham", "Isaac", ""]]}, {"id": "1808.06500", "submitter": "Werner Haselmayr", "authors": "Werner Haselmayr, Daniel Wiesinger, Michael Lunglmayr", "title": "High-Accuracy and Fault Tolerant Stochastic Inner Product Design", "comments": "This paper has been submitted to IEEE Transactions on Circuits and\n  Systems II: Express Briefs", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we present a novel inner product design for stochastic\ncomputing. Stochastic computing is an emerging computing technique, that\nencodes a number in the probability of observing a one in a random bit stream.\nThis leads to reduced hardware costs and high error tolerance. The proposed\ninner product design is based on a two-line bipolar encoding format and applies\nsequential processing of the input in a central accumulation unit. Sequential\nprocessing significantly increases the computation accuracy, since it allows\nfor preliminary cancelation of carry bits. Moreover, the central accumulation\nunit gives a much better scalability compared to conventional adder tree\napproaches. We show that the proposed inner product design outperforms\nstate-of-the-art designs in terms of hardware costs for high accuracy\nrequirements and fault tolerance.\n", "versions": [{"version": "v1", "created": "Fri, 17 Aug 2018 07:56:46 GMT"}, {"version": "v2", "created": "Tue, 20 Nov 2018 12:47:21 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Haselmayr", "Werner", ""], ["Wiesinger", "Daniel", ""], ["Lunglmayr", "Michael", ""]]}, {"id": "1808.06780", "submitter": "Alex James Dr", "authors": "Olga Krestinskaya and Alex Pappachen James", "title": "Real-time Analog Pixel-to-pixel Dynamic Frame Differencing with\n  Memristive Sensing Circuits", "comments": "IEEE SENSORS 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an analog pixel differencing circuit for\ndifferentiating pixels between frames directly from CMOS pixels. The analog\ninformation processing at sensor is a topic of growing appeal to develop edge\nAI devices. The proposed circuit is integrated into a pixel-parallel and\npixel-column architectures. The proposed system is design using TSMC $180nm$\nCMOS technology. The power dissipation of the proposed circuit is $96.64mW$,\nand on-chip ares is $531.66 \\mu m^2$. The architectures are tested for moving\nobject detection application.\n", "versions": [{"version": "v1", "created": "Tue, 21 Aug 2018 06:40:54 GMT"}], "update_date": "2018-08-22", "authors_parsed": [["Krestinskaya", "Olga", ""], ["James", "Alex Pappachen", ""]]}, {"id": "1808.06928", "submitter": "W B Langdon", "authors": "W. B. Langdon", "title": "The Distribution of Reversible Functions is Normal", "comments": "Published as Chapter 11, pp173-187, in Genetic Programming Theory and\n  Practice, 2003, Rick L. Riolo and Bill Worzel (editors)", "journal-ref": null, "doi": "10.1007/978-1-4419-8983-3_11", "report-no": null, "categories": "cs.ET cs.NE quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The distribution of reversible programs tends to a limit as their size\nincreases. For problems with a Hamming distance fitness function the limiting\ndistribution is binomial with an exponentially small chance (but non~zero)\nchance of perfect solution. Sufficiently good reversible circuits are more\ncommon. Expected RMS error is also calculated. Random unitary matrices may\nsuggest possible extension to quantum computing. Using the genetic programming\n(GP) benchmark, the six multiplexor, circuits of Toffoli gates are shown to\ngive a fitness landscape amenable to evolutionary search. Minimal CCNOT\nsolutions to the six multiplexer are found but larger circuits are more\nevolvable.\n", "versions": [{"version": "v1", "created": "Sat, 18 Aug 2018 13:06:25 GMT"}], "update_date": "2018-08-22", "authors_parsed": [["Langdon", "W. B.", ""]]}, {"id": "1808.06969", "submitter": "Titus Klinge", "authors": "Samuel J. Ellis and Titus H. Klinge and James I. Lathrop", "title": "Robust Chemical Circuits", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new motif for constructing robust digital logic circuits using\ninput/output chemical reaction networks. These chemical circuits robustly\nhandle perturbations in input signals, initial concentrations, rate constants,\nand measurements. In particular, we show that all combinatorial circuits and\nseveral sequential circuits enjoy this robustness. Our results complement\nexisting literature in the following three ways: (1) our logic gates read their\ninputs catalytically which make `fanout' gates unnecessary; (2) formal\nrequirements and rigorous proofs of satisfaction are provided for each circuit;\nand (3) robustness of every circuit is closed under modular composition.\n", "versions": [{"version": "v1", "created": "Tue, 21 Aug 2018 15:30:33 GMT"}], "update_date": "2018-08-22", "authors_parsed": [["Ellis", "Samuel J.", ""], ["Klinge", "Titus H.", ""], ["Lathrop", "James I.", ""]]}, {"id": "1808.07329", "submitter": "Abdullah Zyarah", "authors": "Abdullah M. Zyarah and Dhireesha Kudithipudi", "title": "Semi-Trained Memristive Crossbar Computing Engine with In-Situ Learning\n  Accelerator", "comments": null, "journal-ref": "ACM Journal on Emerging Technologies in Computing Systems (JETC),\n  14, 2018", "doi": "10.1145/3233987", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On-device intelligence is gaining significant attention recently as it offers\nlocal data processing and low power consumption. In this research, an on-device\ntraining circuitry for threshold-current memristors integrated in a crossbar\nstructure is proposed. Furthermore, alternate approaches of mapping the\nsynaptic weights into fully-trained and semi-trained crossbars are\ninvestigated. In a semi-trained crossbar a confined subset of memristors are\ntuned and the remaining subset of memristors are not programmed. This\ntranslates to optimal resource utilization and power consumption, compared to a\nfully programmed crossbar. The semi-trained crossbar architecture is applicable\nto a broad class of neural networks. System level verification is performed\nwith an extreme learning machine for binomial and multinomial classification.\nThe total power for a single 4x4 layer network, when implemented in IBM 65nm\nnode, is estimated to be ~ 42.16uW and the area is estimated to be 26.48um x\n22.35um.\n", "versions": [{"version": "v1", "created": "Wed, 22 Aug 2018 12:12:59 GMT"}], "update_date": "2018-12-31", "authors_parsed": [["Zyarah", "Abdullah M.", ""], ["Kudithipudi", "Dhireesha", ""]]}, {"id": "1808.08124", "submitter": "Charles Delahunt", "authors": "Charles B Delahunt, J Nathan Kutz", "title": "Insect cyborgs: Bio-mimetic feature generators improve machine learning\n  accuracy on limited data", "comments": "14 pages, 5 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning (ML) classifiers always benefit from more informative input\nfeatures. We seek to auto-generate stronger feature sets in order to address\nthe difficulty that ML methods often experience given limited training data. A\nwide range of biological neural nets (BNNs) excel at fast learning, implying\nthat they are adept at extracting informative features. We can thus look to\nBNNs for tools to improve ML performance in this low-data regime. The insect\nolfactory network learns new odors very rapidly, by means of three key\nelements: A competitive inhibition layer; a high-dimensional sparse plastic\nlayer; and Hebbian updates of synaptic weights.\n  In this work, we deployed MothNet, a computational model of the insect\nolfactory network, as an automatic feature generator: Attached as a front-end\npre-processor, its Readout Neurons provided new features, derived from the\noriginal features, for use by standard ML classifiers. We found that these\n\"insect cyborgs\", i.e. classifiers that are part-insect model and part-ML\nmethod, had significantly better performance than baseline ML methods alone on\na vectorized MNIST dataset. The MothNet feature generator also substantially\nout-performed other feature generating methods such as PCA, PLS, and NNs, as\nwell as pre-training to initialize NN weights. Cyborgs improved relative test\nset accuracy by an average of 6% to 33% depending on baseline ML accuracy,\nwhile relative reduction in test set error exceeded 50% for higher baseline\naccuracy ML models. These results indicate the potential value of BNN-inspired\nfeature generators in the ML context.\n", "versions": [{"version": "v1", "created": "Thu, 23 Aug 2018 05:01:05 GMT"}, {"version": "v2", "created": "Sat, 26 Jan 2019 22:11:48 GMT"}, {"version": "v3", "created": "Tue, 16 Apr 2019 18:21:02 GMT"}, {"version": "v4", "created": "Fri, 6 Dec 2019 00:49:17 GMT"}, {"version": "v5", "created": "Fri, 11 Sep 2020 22:19:39 GMT"}], "update_date": "2020-09-15", "authors_parsed": [["Delahunt", "Charles B", ""], ["Kutz", "J Nathan", ""]]}, {"id": "1808.08429", "submitter": "Ines Dutra", "authors": "Carla Silva, In\\^es Dutra, Marcus S. Dahlem", "title": "Driven tabu search: a quantum inherent optimisation", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum computers are different from binary digital electronic computers\nbased on transistors. Common digital computing encodes the data into binary\ndigits (bits), each of which is always in one of two definite states (0 or 1),\nquantum computation uses quantum bits (qubits). A circuit-based qubit quantum\ncomputer exists and is available for experiments via cloud, the IBM quantum\nexperience project. We implemented a Quantum Tabu Search in order to obtain a\nquantum combinatorial optimisation, suggesting that an\nentanglement-metaheuristic can display optimal solutions and accelerate the\noptimisation process by using entangled states. We show by building optimal\ncoupling maps that the distribution of our results gave similar shape as shown\nprevious results in an existing teleport circuit. Our research aims to find\nwhich graph of coupling better matches a quantum circuit.\n", "versions": [{"version": "v1", "created": "Sat, 25 Aug 2018 13:49:27 GMT"}], "update_date": "2018-08-28", "authors_parsed": [["Silva", "Carla", ""], ["Dutra", "Inês", ""], ["Dahlem", "Marcus S.", ""]]}, {"id": "1808.08808", "submitter": "Shilin Zhu", "authors": "Shilin Zhu, Yilong Li", "title": "2DR: Towards Fine-Grained 2-D RFID Touch Sensing", "comments": "RFID Touch Sensing", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.ET cs.HC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce 2DR, a single RFID tag which can seamlessly sense\ntwo-dimensional human touch using off-the-shelf RFID readers. Instead of using\na two-dimensional tag array to sense human finger touch on a surface, 2DR only\nuses one or two RFID chip(s), which reduces the manufacturing cost and makes\nthe tag more suitable for printing on flexible materials. The key idea behind\n2DR is to design a custom-shape antenna and classify human finger touch based\non unique phase information using statistical learning. We printed 2DR tag on\nFR-4 substrate and use off-the-shelf UHF-RFID readers (FCC frequency band) to\nsense different touch activities. Experiments show great potential of our\ndesign. Moreover, 2DR can be further extended to 3D by building stereoscopic\nmodel.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2018 04:38:14 GMT"}], "update_date": "2018-08-28", "authors_parsed": [["Zhu", "Shilin", ""], ["Li", "Yilong", ""]]}, {"id": "1808.09999", "submitter": "Fabio Lorenzo Traversa Ph.D.", "authors": "Fabio L. Traversa, Massimiliano Di Ventra", "title": "MemComputing Integer Linear Programming", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.PF math.OC nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Integer linear programming (ILP) encompasses a very important class of\noptimization problems that are of great interest to both academia and industry.\nSeveral algorithms are available that attempt to explore the solution space of\nthis class efficiently, while requiring a reasonable compute time. However,\nalthough these algorithms have reached various degrees of success over the\nyears, they still face considerable challenges when confronted with\nparticularly hard problem instances, such as those of the MIPLIB 2010 library.\nIn this work we propose a radically different non-algorithmic approach to ILP\nbased on a novel physics-inspired computing paradigm: Memcomputing. This\nparadigm is based on digital (hence scalable) machines represented by\nappropriate electrical circuits with memory. These machines can be either built\nin hardware or, as we do here, their equations of motion can be efficiently\nsimulated on our traditional computers. We first describe a new circuit\narchitecture of memcomputing machines specifically designed to solve for the\nlinear inequalities representing a general ILP problem. We call these\nself-organizing algebraic circuits, since they self-organize dynamically to\nsatisfy the correct (algebraic) linear inequalities. We then show simulations\nof these machines using MATLAB running on a single core of a Xeon processor for\nseveral ILP benchmark problems taken from the MIPLIB 2010 library, and compare\nour results against a renowned commercial solver. We show that our approach is\nvery efficient when dealing with these hard problems. In particular, we find\nwithin minutes feasible solutions for one of these hard problems (f2000 from\nMIPLIB 2010) whose feasibility, to the best of our knowledge, has remained\nunknown for the past eight years.\n", "versions": [{"version": "v1", "created": "Wed, 29 Aug 2018 18:19:48 GMT"}], "update_date": "2018-08-31", "authors_parsed": [["Traversa", "Fabio L.", ""], ["Di Ventra", "Massimiliano", ""]]}, {"id": "1808.10631", "submitter": "Alex James Dr", "authors": "Olga Krestinskaya, Khaled Nabil Salama, Alex Pappachen James", "title": "Learning in Memristive Neural Network Architectures using Analog\n  Backpropagation Circuits", "comments": null, "journal-ref": "IEEE Transactions on Circuits and Systems 1: Regular Papers, 2018", "doi": "10.1109/TCSI.2018.2866510", "report-no": null, "categories": "cs.ET cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The on-chip implementation of learning algorithms would speed-up the training\nof neural networks in crossbar arrays. The circuit level design and\nimplementation of backpropagation algorithm using gradient descent operation\nfor neural network architectures is an open problem. In this paper, we proposed\nthe analog backpropagation learning circuits for various memristive learning\narchitectures, such as Deep Neural Network (DNN), Binary Neural Network (BNN),\nMultiple Neural Network (MNN), Hierarchical Temporal Memory (HTM) and\nLong-Short Term Memory (LSTM). The circuit design and verification is done\nusing TSMC 180nm CMOS process models, and TiO2 based memristor models. The\napplication level validations of the system are done using XOR problem, MNIST\ncharacter and Yale face image databases\n", "versions": [{"version": "v1", "created": "Fri, 31 Aug 2018 08:31:15 GMT"}], "update_date": "2018-09-03", "authors_parsed": [["Krestinskaya", "Olga", ""], ["Salama", "Khaled Nabil", ""], ["James", "Alex Pappachen", ""]]}]