[{"id": "1107.4171", "submitter": "Umer Farooq mir", "authors": "Umer Farooq and M. Aqeel Iqbal", "title": "Next Generation High Speed Computing Using Photonic Based Technolog", "comments": "8 pages, 9 figures, published in (IJCSE) International Journal on\n  Computer Science and Engineering Vol. 02, No. 05, 2010, 1496-1503", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present era of technology computer has facilitated the human life up\nto a great extent. The speed of computation has raised to astonish level but\nthe pace of development of other technologies which have core dependency over\ncomputers have raised relatively exponentially huge, though the computer speed\nof computation is very fast with respect to human abilities but still it has to\nbe increased a lot more to meet the future requirements. We have pushed\nelectrons to their maximum limit to a stage that nothing further could be\nexpected from electrons. Alternately one can use photon to replace the\nrelatively sluggish electrons. An alternate that posses all feature that an\nelectron holds but only millions of time faster and with a far more reliability\nin one way or the other stretching the computers speed to a stage that no one\nwould have ever even wonder. In this research paper the photonics\nimplementations in computation industry have been presented along with its\nscope as an alternate to electron with comparative study of electron and photon\nunder the computation perspective, generalized working of silicon based optical\ncomputers, the application of photons and their crucial role in the upcoming\ntimes. Keywords: Photonic Technology, H\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2011 05:55:18 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Farooq", "Umer", ""], ["Iqbal", "M. Aqeel", ""]]}, {"id": "1107.4417", "submitter": "Annapurna Sharma Ms", "authors": "Wan-Young Chung, Amit Purwar and Annapurna Sharma", "title": "Frequency Domain Approach for Activity Classification using\n  Accelerometer", "comments": "30th Annual International IEEE EMBS Conference, Vancouver, British\n  Columbia, Canada, August 20-24, 2008", "journal-ref": null, "doi": "10.1109/IEMBS.2008.4649357", "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Activity classification was performed using MEMS accelerometer and wireless\nsensor node for wireless sensor network environment. Three axes MEMS\naccelerometer measures body's acceleration and transmits measured data with the\nhelp of sensor node to base station attached to PC. On the PC, real time\naccelerometer data is processed for movement classifications. In this paper,\nRest, walking and running are the classified activities of the person. Both\ntime and frequency analysis was performed to classify running and walking. The\nclassification of rest and movement is done using Signal magnitude area (SMA).\nThe classification accuracy for rest and movement is 100%. For the\nclassification of walk and Run two parameters i.e. SMA and Median frequency\nwere used. The classification accuracy for walk and running was detected as\n81.25% in the experiments performed by the test persons.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2011 05:38:29 GMT"}], "update_date": "2011-07-25", "authors_parsed": [["Chung", "Wan-Young", ""], ["Purwar", "Amit", ""], ["Sharma", "Annapurna", ""]]}]