[{"id": "0706.1066", "submitter": "Matthias Brust R.", "authors": "Matthias R. Brust", "title": "Applying Test-Paradigms in a Generic Tutoring System Concept for\n  Web-based Learning", "comments": "Information and Resource Management (IRMA 2003)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": null, "abstract": "  Realizing test scenarios through a tutoring system involve questions about\narchitecture and didactic methods in such a system. Observing the fact that\ntraditional tutoring systems normally are domain-static, this paper shows\ninvestigations for a generic domain-independent tutoring system for utilizing\ntest scenarios in computer-based and web-based environments. Furthermore, test\nparadigms are analyzed and it is presented an approach for realizing\nfunctionality for applying test paradigms in the presented generic tutoring\nsystem architecture by an XML-specified language.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2007 19:55:11 GMT"}], "update_date": "2007-06-08", "authors_parsed": [["Brust", "Matthias R.", ""]]}, {"id": "0706.1087", "submitter": "Matthias Brust R.", "authors": "Matthias R. Brust, Steffen Rothkugel", "title": "On Anomalies in Annotation Systems", "comments": "The Third International Workshop on E-learning and Mobile Learning on\n  Telecommunications (ELETE 2007)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY", "license": null, "abstract": "  Today's computer-based annotation systems implement a wide range of\nfunctionalities that often go beyond those available in traditional\npaper-and-pencil annotations. Conceptually, annotation systems are based on\nthoroughly investigated psycho-sociological and pedagogical learning theories.\nThey offer a huge diversity of annotation types that can be placed in textual\nas well as in multimedia format. Additionally, annotations can be published or\nshared with a group of interested parties via well-organized repositories.\nAlthough highly sophisticated annotation systems exist both conceptually as\nwell as technologically, we still observe that their acceptance is somewhat\nlimited. In this paper, we argue that nowadays annotation systems suffer from\nseveral fundamental problems that are inherent in the traditional\npaper-and-pencil annotation paradigm. As a solution, we propose to shift the\nannotation paradigm for the implementation of annotation system.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2007 21:23:40 GMT"}], "update_date": "2007-06-11", "authors_parsed": [["Brust", "Matthias R.", ""], ["Rothkugel", "Steffen", ""]]}, {"id": "0706.1127", "submitter": "Matthias Brust R.", "authors": "Matthias R. Brust, Christian M. Adriano, Ivan M.L. Ricarte", "title": "Redesigning Computer-based Learning Environments: Evaluation as\n  Communication", "comments": "International Conference on Education and Information Systems (EISTA\n  04), ISBN 980-6560-11-6", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": null, "abstract": "  In the field of evaluation research, computer scientists live constantly upon\ndilemmas and conflicting theories. As evaluation is differently perceived and\nmodeled among educational areas, it is not difficult to become trapped in\ndilemmas, which reflects an epistemological weakness. Additionally, designing\nand developing a computer-based learning scenario is not an easy task.\nAdvancing further, with end-users probing the system in realistic settings, is\neven harder. Computer science research in evaluation faces an immense\nchallenge, having to cope with contributions from several conflicting and\ncontroversial research fields. We believe that deep changes must be made in our\nfield if we are to advance beyond the CBT (computer-based training) learning\nmodel and to build an adequate epistemology for this challenge. The first task\nis to relocate our field by building upon recent results from philosophy,\npsychology, social sciences, and engineering. In this article we locate\nevaluation in respect to communication studies. Evaluation presupposes a\ndefinition of goals to be reached, and we suggest that it is, by many means, a\nsilent communication between teacher and student, peers, and institutional\nentities. If we accept that evaluation can be viewed as set of invisible rules\nknown by nobody, but somehow understood by everybody, we should add\nanthropological inquiries to our research toolkit. The paper is organized\naround some elements of the social communication and how they convey new\ninsights to evaluation research for computer and related scientists. We found\nsome technical limitations and offer discussions on how we relate to technology\nat same time we establish expectancies and perceive others work.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2007 08:12:21 GMT"}], "update_date": "2007-06-11", "authors_parsed": [["Brust", "Matthias R.", ""], ["Adriano", "Christian M.", ""], ["Ricarte", "Ivan M. L.", ""]]}, {"id": "0706.1130", "submitter": "Matthias Brust R.", "authors": "Matthias R. Brust, Steffen Rothkugel", "title": "A Communication Model for Adaptive Service Provisioning in Hybrid\n  Wireless Networks", "comments": "WSEAS Transactions on Circuits and Systems 2004", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.AR cs.CY cs.HC", "license": null, "abstract": "  Mobile entities with wireless links are able to form a mobile ad-hoc network.\nSuch an infrastructureless network does not have to be administrated. However,\nself-organizing principles have to be applied to deal with upcoming problems,\ne.g. information dissemination. These kinds of problems are not easy to tackle,\nrequiring complex algorithms. Moreover, the usefulness of pure ad-hoc networks\nis arguably limited. Hence, enthusiasm for mobile ad-hoc networks, which could\neliminate the need for any fixed infrastructure, has been damped. The goal is\nto overcome the limitations of pure ad-hoc networks by augmenting them with\ninstant Internet access, e.g. via integration of UMTS respectively GSM links.\nHowever, this raises multiple questions at the technical as well as the\norganizational level. Motivated by characteristics of small-world networks that\ndescribe an efficient network even without central or organized design, this\npaper proposes to combine mobile ad-hoc networks and infrastructured networks\nto form hybrid wireless networks. One main objective is to investigate how this\napproach can reduce the costs of a permanent backbone link and providing in the\nsame way the benefits of useful information from Internet connectivity or\nservice providers. For the purpose of bridging between the different types of\nnetworks, an adequate middleware service is the focus of our investigation.\nThis paper shows our first steps forward to this middleware by introducing the\nInjection Communication paradigm as principal concept.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2007 08:23:14 GMT"}], "update_date": "2007-06-11", "authors_parsed": [["Brust", "Matthias R.", ""], ["Rothkugel", "Steffen", ""]]}, {"id": "0706.1201", "submitter": "Matthias Brust R.", "authors": "Jose Eduardo M. Lobo, Jorge Luis Risco Becerra, Matthias R. Brust,\n  Steffen Rothkugel, Christian M. Adriano", "title": "Developing a Collaborative and Autonomous Training and Learning\n  Environment for Hybrid Wireless Networks", "comments": "Global Congress on Engineering and Technology Education (GCETE 2005)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC cs.NI", "license": null, "abstract": "  With larger memory capacities and the ability to link into wireless networks,\nmore and more students uses palmtop and handheld computers for learning\nactivities. However, existing software for Web-based learning is not\nwell-suited for such mobile devices, both due to constrained user interfaces as\nwell as communication effort required. A new generation of applications for the\nlearning domain that is explicitly designed to work on these kinds of small\nmobile devices has to be developed. For this purpose, we introduce CARLA, a\ncooperative learning system that is designed to act in hybrid wireless\nnetworks. As a cooperative environment, CARLA aims at disseminating teaching\nmaterial, notes, and even components of itself through both fixed and mobile\nnetworks to interested nodes. Due to the mobility of nodes, CARLA deals with\nupcoming problems such as network partitions and synchronization of teaching\nmaterial, resource dependencies, and time constraints.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2007 16:38:32 GMT"}], "update_date": "2007-06-11", "authors_parsed": [["Lobo", "Jose Eduardo M.", ""], ["Becerra", "Jorge Luis Risco", ""], ["Brust", "Matthias R.", ""], ["Rothkugel", "Steffen", ""], ["Adriano", "Christian M.", ""]]}, {"id": "0706.1402", "submitter": "Matthias Brust R.", "authors": "Matthias R. Brust, Steffen Rothkugel", "title": "Analyzing Design Process and Experiments on the AnITA Generic Tutoring\n  System", "comments": "Published in: Proceedings of International Conference on Education\n  and Information Systems (EISTA 04), 2004, ISBN 980-6560-11-6", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the field of tutoring systems, investigations have shown that there are\nmany tutoring systems specific to a specific domain that, because of their\nstatic architecture, cannot be adapted to other domains. As consequence, often\nneither methods nor knowledge can be reused. In addition, the knowledge\nengineer must have programming skills in order to enhance and evaluate the\nsystem. One particular challenge is to tackle these problems with the\ndevelopment of a generic tutoring system. AnITA, as a stand-alone application,\nhas been developed and implemented particularly for this purpose. However, in\nthe testing phase, we discovered that this architecture did not fully match the\nuser's intuitive understanding of the use of a learning tool. Therefore, AnITA\nhas been redesigned to exclusively work as a client/server application and\nrenamed to AnITA2. This paper discusses the evolvements made on the AnITA\ntutoring system, the goal of which is to use generic principles for system\nre-use in any domain. Two experiments were conducted, and the results are\npresented in this paper.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2007 06:09:25 GMT"}, {"version": "v2", "created": "Tue, 12 Jun 2018 19:54:33 GMT"}], "update_date": "2018-06-14", "authors_parsed": [["Brust", "Matthias R.", ""], ["Rothkugel", "Steffen", ""]]}, {"id": "0706.1926", "submitter": "Michele Bezzi", "authors": "Michele Bezzi, Robin Groenevelt", "title": "Towards understanding and modelling office daily life", "comments": "5 pages, ECHISE 2006 - 2nd International Workshop on Exploiting\n  Context Histories in Smart Environments - Infrastructures and Design, 8th\n  International Conference of Ubiquitous Computing (Ubicomp 2006), Orange\n  County, CA, 17-21 September 2006", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CY", "license": null, "abstract": "  Measuring and modeling human behavior is a very complex task. In this paper\nwe present our initial thoughts on modeling and automatic recognition of some\nhuman activities in an office. We argue that to successfully model human\nactivities, we need to consider both individual behavior and group dynamics. To\ndemonstrate these theoretical approaches, we introduce an experimental system\nfor analyzing everyday activity in our office.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2007 15:15:00 GMT"}], "update_date": "2007-06-14", "authors_parsed": [["Bezzi", "Michele", ""], ["Groenevelt", "Robin", ""]]}, {"id": "0706.3132", "submitter": "Paulo Condado", "authors": "Paulo A. Condado and Fernando G. Lobo", "title": "EasyVoice: Integrating voice synthesis with Skype", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": null, "abstract": "  This paper presents EasyVoice, a system that integrates voice synthesis with\nSkype. EasyVoice allows a person with voice disabilities to talk with another\nperson located anywhere in the world, removing an important obstacle that\naffect these people during a phone or VoIP-based conversation.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2007 12:04:40 GMT"}], "update_date": "2007-06-22", "authors_parsed": [["Condado", "Paulo A.", ""], ["Lobo", "Fernando G.", ""]]}]