[{"id": "1609.00099", "submitter": "Zhiyong Shan", "authors": "Zhiyong Shan, Bin Liao", "title": "Design and Implementation of A Network Security Management System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, the emerged network worms and attacks have distributive\ncharacteristic, which can spread globally in a very short time. Security\nmanagement crossing network to co-defense network-wide attacks and improve\nefficiency of security administration is urgently needed. This paper proposes a\nhierarchical distributed network security management system (HD-NSMS), which\ncan centrally manage security across networks. First describes the system in\nmacrostructure and microstructure; then discusses three key problems when\nbuilding HD-NSMS: device model, alert mechanism and emergency response\nmechanism; at last, describes the implementation of HD-NSMS. The paper is\nvaluable for implementing NSMS in that it derives from a practical network\nsecurity management system (NSMS).\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2016 03:38:16 GMT"}, {"version": "v2", "created": "Sat, 3 Sep 2016 22:45:33 GMT"}], "update_date": "2016-09-06", "authors_parsed": [["Shan", "Zhiyong", ""], ["Liao", "Bin", ""]]}, {"id": "1609.00126", "submitter": "Radhika Sukapuram", "authors": "Radhika Sukapuram and Gautam Barua", "title": "PPCU: Proportional Per-packet Consistent Updates for Software Defined\n  Networks - A Technical Report", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Software Defined Networks, where the network control plane can be\nprogrammed by updating switch rules, consistently updating switches is a\nchallenging problem. In a per-packet consistent update (PPC), a packet either\nmatches the new rules added or the old rules to be deleted, throughout the\nnetwork, but not a combination of both. PPC must be preserved during an update\nto prevent packet drops and loops, provide waypoint invariance and to apply\npolicies consistently. No algorithm exists today that confines changes required\nduring an update to only the affected switches, yet preserves PPC and does not\nrestrict applicable scenarios. We propose a general update algorithm called\nPPCU that preserves PPC, is concurrent and provides an all-or-nothing semantics\nfor an update, irrespective of the execution speeds of switches and links,\nwhile confining changes to only the affected switches and affected rules. We\nuse data plane time stamps to identify when the switches must move from the old\nrules to the new rules. For this, we use the powerful programming features\nprovided to the data plane by the emerging programmable switches, which also\nguarantee line rate. We prove the algorithm, identify its significant\nparameters and analyze the parameters with respect to other algorithms in the\nliterature.\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2016 07:01:36 GMT"}], "update_date": "2016-09-02", "authors_parsed": [["Sukapuram", "Radhika", ""], ["Barua", "Gautam", ""]]}, {"id": "1609.00300", "submitter": "Arun I B", "authors": "Arun I B, T. G. Venkatesh and Bhasker Dappuri", "title": "QoS Provisioning with Adaptive Backoff Algorithm for IEEE 802.11ac Under\n  Multipacket Reception", "comments": "5 pages, 4 figures, In Proceedings of 9th International Symposium on\n  Communication Systems, Networks & Digital Sign (CSNDSP), Manchester, 2014.\n  arXiv admin note: text overlap with arXiv:1308.5360", "journal-ref": null, "doi": "10.1109/CSNDSP.2014.6923941", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances in physical layer communication techniques, enable receivers\nto decode multiple simultaneous transmissions. This technique is known as the\nmultipacket reception (MPR). In this paper, we propose an enhancement to the\nIEEE 802.11ac EDCA protocol for channels supporting MPR for QoS provisioning.\nWe show that in the case of MPR, in addition to CWmin, CWmax and AIFSN, we can\nuse two more parameters namely (i) threshold and (ii) counter decrement value,\nthat can offer service differentiation. The performance evaluation of the\ndifferent metrics of the proposed protocol (throughput, delay, and jitter) is\ncarried out using extensive simulations.\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2016 16:19:10 GMT"}], "update_date": "2016-09-02", "authors_parsed": [["B", "Arun I", ""], ["Venkatesh", "T. G.", ""], ["Dappuri", "Bhasker", ""]]}, {"id": "1609.00419", "submitter": "Derya Malak", "authors": "Derya Malak, Mazin Al-Shalash, and Jeffrey G. Andrews", "title": "Spatially Correlated Content Caching for Device-to-Device Communications", "comments": "a shorter version appeared in Proc. IEEE Intl. Symposium on Info.\n  Theory, Barcelona, Spain, [arXiv:1608.07856]", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study optimal geographic content placement for device-to-device (D2D)\nnetworks in which each file's popularity follows the Zipf distribution. The\nlocations of the D2D users (caches) are modeled by a Poisson point process\n(PPP) and have limited communication range and finite storage. Inspired by the\nMat\\'{e}rn hard-core (type II) point process that captures pairwise\ninteractions between nodes, we devise a novel spatially correlated caching\nstrategy called {\\em hard-core placement} (HCP) such that the D2D nodes caching\nthe same file are never closer to each other than the {\\em exclusion radius}.\nThe exclusion radius plays the role of a substitute for caching probability. We\nderive and optimize the exclusion radii to maximize the {\\em hit probability},\nwhich is the probability that a given D2D node can find a desired file at\nanother node's cache within its communication range. Contrasting it with\nindependent content placement, which is used in most prior work, our HCP\nstrategy often yields a significantly higher cache hit probability. We further\ndemonstrate that the HCP strategy is effective for small cache sizes and a\nsmall communication radius, which are likely conditions for D2D.\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2016 22:55:22 GMT"}, {"version": "v2", "created": "Tue, 3 Oct 2017 02:09:02 GMT"}], "update_date": "2017-10-04", "authors_parsed": [["Malak", "Derya", ""], ["Al-Shalash", "Mazin", ""], ["Andrews", "Jeffrey G.", ""]]}, {"id": "1609.00424", "submitter": "Jason Cloud", "authors": "Jason Cloud, Muriel Medard", "title": "Multi-Path Low Delay Network Codes", "comments": "7 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capability of mobile devices to use multiple interfaces to support a\nsingle session is becoming more prevalent. Prime examples include the desire to\nimplement WiFi offloading and the introduction of 5G. Furthermore, an\nincreasing fraction of Internet traffic is becoming delay sensitive. These two\ntrends drive the need to investigate methods that enable communication over\nmultiple parallel heterogeneous networks, while also ensuring that delay\nconstraints are met. This paper approaches these challenges using a multi-path\nstreaming code that uses forward error correction to reduce the in-order\ndelivery delay of packets in networks with poor link quality and transient\nconnectivity. A simple analysis is developed that provides a good approximation\nof the in-order delivery delay. Furthermore, numerical results help show that\nthe delay penalty of communicating over multiple paths is insignificant when\nconsidering the potential throughput gains obtained through the fusion of\nmultiple networks.\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2016 23:24:06 GMT"}], "update_date": "2016-09-05", "authors_parsed": [["Cloud", "Jason", ""], ["Medard", "Muriel", ""]]}, {"id": "1609.00426", "submitter": "Paul M. Aoki", "authors": "Paul M. Aoki", "title": "New Rain Rate Statistics for Emerging Regions: Implications for Wireless\n  Backhaul Planning", "comments": "14 pages; 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  As demand for broadband service increases in emerging regions, high-capacity\nwireless links can accelerate and cost-reduce the deployment of new networks\n(both backhaul and customer site connection). Such links are increasingly\ncommon in developed countries, but their reliability in emerging regions is\nquestioned where very heavy tropical rain is present. Here, we investigate the\nrobustness of the standard (ITU-R P.837-6) method for estimating rain rates\nusing an expanded test dataset. We illustrate how bias/variance issues cause\nproblematic predictions at higher rain rates. We confirm (by construction) that\nan improved rainfall climatology can largely address these prediction issues\nwithout compromising standard ITU fit evaluation metrics.\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2016 23:37:04 GMT"}], "update_date": "2016-09-05", "authors_parsed": [["Aoki", "Paul M.", ""]]}, {"id": "1609.00475", "submitter": "Pushpam Aji John", "authors": "Pushpam Aji John, Rudolf Agren, Yu-Jung Chen, Christian Rohner, and\n  Edith Ngai (Uppsala University)", "title": "868 MHz Wireless Sensor Network - A Study", "comments": "11th Swedish National Computer Networking Workshop SNCNW 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Today 2.4 GHz based wireless sensor networks are increasing at a tremendous\npace, and are seen in widespread applications. Product innovation and support\nby many vendors in 2.4 GHz makes it a preferred choice, but the networks are\nprone to issues like interference, and range issues. On the other hand, the\nless popular 868 MHz in the ISM band has not seen significant usage. In this\npaper we explore the use of 868 MHz channel to implement a wireless sensor\nnetwork, and study the efficacy of this channel\n", "versions": [{"version": "v1", "created": "Fri, 2 Sep 2016 06:23:24 GMT"}], "update_date": "2016-09-05", "authors_parsed": [["John", "Pushpam Aji", "", "Uppsala University"], ["Agren", "Rudolf", "", "Uppsala University"], ["Chen", "Yu-Jung", "", "Uppsala University"], ["Rohner", "Christian", "", "Uppsala University"], ["Ngai", "Edith", "", "Uppsala University"]]}, {"id": "1609.00653", "submitter": "Markus Fidler", "authors": "Ralf L\\\"ubben, Markus Fidler", "title": "A Benchmark for the Performance of Time-varying Closed-loop Flow Control\n  with Application to TCP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Closed-loop flow control protocols, such as the prominent implementation TCP,\nare prevalent in the Internet, today. TCP has continuously been improved for\ngreedy traffic sources to achieve high throughput over networks with large\nbandwidth delay products. Recently, the increasing use for streaming and\ninteractive applications, such as voice and video, has shifted the focus\ntowards its delay performance. Given the need for real-time communication of\nnon-greedy sources via TCP, we present an estimation method for performance\nevaluation of closed-loop flow control protocols. We characterize an end-to-end\nconnection by a transfer function that provides statistical service guarantees\nfor arbitrary traffic. The estimation is based on end-to-end measurements at\nthe application level that include all effects induced by the network and by\nthe protocol stacks of the end systems. From our measurements, we identify\ndifferent causes for delays. We show that significant delays are due to\nqueueing in protocol stacks. Notably, this occurs even if the utilization is\nmoderate. Using our estimation method, we compare the impact of fundamental\nmechanisms of TCP on delays at the application level: In detail, we analyze\nparameters relevant for network dimensioning, including buffer provisioning and\nactive queue management, and parameters for server configuration, such as the\ncongestion control algorithm. By applying our method as a benchmark, we find\nthat a good selection can largely improve the delay performance of TCP.\n", "versions": [{"version": "v1", "created": "Fri, 2 Sep 2016 16:20:22 GMT"}], "update_date": "2016-09-05", "authors_parsed": [["Lübben", "Ralf", ""], ["Fidler", "Markus", ""]]}, {"id": "1609.00664", "submitter": "Reza Farrahi Moghaddam", "authors": "Reza Farrahi Moghaddam and Yves Lemieux and Mohamed Cheriet", "title": "Transparent Clouds: An Enhancement to Abstraction", "comments": "10 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the introduction of various hardware/software technologies such as Cloud\nTechnologies or Virtualization technologies, there has been a great potential\nto reuse ICT artifacts thanks to Abstraction and also Exchangeability features\nachieved via these technologies. These technologies also provide various\nadvantages with respect to sustainability including resource consumption\nreduction (in the use phase only or in the whole life cycle). However, there is\nan additional but untapped potential associated with the anonymization of\nresources introduced by both abstraction and exchangeability features. By\nrealizing on this potential, we can improve cloud solutions and reduce their\nby-product opacity, which usually prevents leveraging on the specialized but\ntweakable (i.e., nonessential modifications without changing the main function)\nfeatures of components that are captured in the component models. This is\nespecially a challenge in the case heterogeneous/disaggregated infrastructure\nwhere developing models to cover everything is practically impossible. In this\nwork, by leveraging on the concept of pathways, we develop a few mechanisms\nthat enable transparency and therefore tweakability of features even in the\npresence of abstraction and heterogeneity. In particular, the layered-stack\napproach to system decomposition is considered because of its role in both\nsoftware defined networking (SDN) and Network Function Virtualization (NFV)\nsystem decompositions. For a concrete example, the case of dynamic frequency\nscaling of processors is considered and it is shown that the associated\nconsumption could be considerably reduced without requiring additional changes\nto the middle components.\n", "versions": [{"version": "v1", "created": "Fri, 2 Sep 2016 16:50:53 GMT"}], "update_date": "2016-09-05", "authors_parsed": [["Moghaddam", "Reza Farrahi", ""], ["Lemieux", "Yves", ""], ["Cheriet", "Mohamed", ""]]}, {"id": "1609.00852", "submitter": "Mohammad Hajimirsadeghi", "authors": "Mohammad Hajimirsadeghi, Narayan B.Mandayam and Alex Reznik", "title": "Joint Caching and Pricing Strategies for Popular Content in Information\n  Centric Networks", "comments": "Accepted to be published in Journal of Selected Area in\n  Communication(JSAC special issue on game theory in networks)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an analytical framework for distribution of popular content in an\nInformation Centric Network (ICN) that comprises of Access ICNs, a Transit ICN\nand a Content Provider. Using a generalized Zipf distribution to model content\npopularity, we devise a game theoretic approach to jointly determine caching\nand pricing strategies in such an ICN. Under the assumption that the caching\ncost of the access and transit ICNs is inversely proportional to popularity, we\nshow that the Nash caching strategies in the ICN are 0-1 (all or nothing)\nstrategies. Further, for the case of symmetric Access ICNs, we show that the\nNash equilibrium is unique and the caching policy (0 or 1) is determined by a\nthreshold on the popularity of the content (reflected by the Zipf probability\nmetric), i.e., all content more popular than the threshold value is cached. We\nalso show that the resulting threshold of the Access and Transit ICNs, as well\nas all prices can be obtained by a decomposition of the joint caching and\npricing problem into two independent caching only and pricing only problems.\n", "versions": [{"version": "v1", "created": "Sat, 3 Sep 2016 19:00:18 GMT"}, {"version": "v2", "created": "Tue, 4 Oct 2016 21:40:26 GMT"}, {"version": "v3", "created": "Mon, 30 Jan 2017 18:10:44 GMT"}], "update_date": "2017-01-31", "authors_parsed": [["Hajimirsadeghi", "Mohammad", ""], ["Mandayam", "Narayan B.", ""], ["Reznik", "Alex", ""]]}, {"id": "1609.00889", "submitter": "Vesal Hakami", "authors": "Vesal Hakami and Mehdi Dehghan", "title": "Distributed Power Control for Delay Optimization in Energy Harvesting\n  Cooperative Relay Networks", "comments": "13 pages, 6 figures, IEEE Transactions on Vehicular Technology", "journal-ref": "IEEE Transactions on Vehicular Technology, Vol. 66, No. 6, June\n  2017", "doi": "10.1109/TVT.2016.2610444", "report-no": null, "categories": "cs.NI cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider cooperative communications with energy harvesting (EH) relays,\nand develop a distributed power control mechanism for the relaying terminals.\nUnlike prior art which mainly deal with single-relay systems with saturated\ntraffic flow, we address the case of bursty data arrival at the source\ncooperatively forwarded by multiple half-duplex EH relays. We aim at optimizing\nthe long-run average delay of the source packets under the energy neutrality\nconstraint on power consumption of each relay. While EH relay systems have been\npredominantly optimized using either offline or online methodologies, we take\non a more realistic learning-theoretic approach. Hence, our scheme can be\ndeployed for real-time operation without assuming acausal information on\nchannel realizations, data/energy arrivals as required by offline optimization,\nnor does it rely on precise statistics of the system processes as is the case\nwith online optimization. We formulate the problem as a partially observable\nidentical payoff stochastic game (PO-IPSG) with factored controllers, in which\nthe power control policy of each relay is adaptive to its local\nsource-to-relay/relay-to-destination channel states, its local energy state as\nwell as to the source buffer state information. We derive a multi-agent\nreinforcement learning algorithm which is convergent to a locally optimal\nsolution of the formulated PO-IPSG. The proposed algorithm operates without\nexplicit message exchange between the relays, while inducing only little\nsource-relay signaling overhead. By simulation, we contrast the delay\nperformance of the proposed method against existing heuristics for throughput\nmaximization. It is shown that compared with these heuristics, the systematic\napproach adopted in this paper has a smaller sub-optimality gap once evaluated\nagainst a centralized optimal policy armed with perfect statistics.\n", "versions": [{"version": "v1", "created": "Sun, 4 Sep 2016 02:52:20 GMT"}, {"version": "v2", "created": "Wed, 24 Oct 2018 20:42:10 GMT"}], "update_date": "2018-10-26", "authors_parsed": [["Hakami", "Vesal", ""], ["Dehghan", "Mehdi", ""]]}, {"id": "1609.01043", "submitter": "Jose Aznar", "authors": "J. Aznar, E. Escalona, I. Canyameres, O. Moya, A. Vi\\~nes", "title": "CNSMO: A Network Services Manager/Orchestrator Tool for Cloud Federated\n  Environments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Application service providers (ASPs) now develop, deploy, and maintain\ncomplex computing platforms within multiple cloud infrastructures to improve\nresilience, responsiveness and elasticity of their applications. On the other\nhand, complex applications have little control and visibility over network\nresources, and need to use low-level hacks to extract network properties and\nprioritize traffic. This biased view, limits tenants flexibility while\ndeploying their applications and prevents them from implementing part of the\napplication logic in the network. In this paper, we propose the CNSMO (CYCLONE\nNetwork Services Manager/Orchestrator) tool to bring the innovation at\nfederated cloud environments by bridging these network service capabilities to\ncloud based services as part of the overall CYCLONE solution. The integration\nof networking aspects with purely federated clouds, will allow users to request\nspecific infrastructures and manage their dedicated set of coordinated network\nand IT resources in an easy and transparent way while operating dynamic\ndeployments of distributed applications.\n", "versions": [{"version": "v1", "created": "Mon, 5 Sep 2016 07:43:35 GMT"}], "update_date": "2016-09-06", "authors_parsed": [["Aznar", "J.", ""], ["Escalona", "E.", ""], ["Canyameres", "I.", ""], ["Moya", "O.", ""], ["Viñes", "A.", ""]]}, {"id": "1609.01101", "submitter": "Yang Chen", "authors": "Yang Chen, Zhong-Yi Wang, Lan Huang", "title": "Performance analysis of a non-beacon enabled IEEE 802.15.4 network with\n  retransmission and ACK mode", "comments": "This paper contians 48 pages, 14 Figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of our work is to evaluate the performance of non-beacon IEEE\n802.15.4 networks with acknowledgement (ACK) mode and retransmission limits in\na finer time unit. Moreover, we predict network performance parameters using\nbackpropagation artificial neural networks (BP-ANNs) with respect to a given\nquality of service for real-world applications. Therefore, our proposed methods\ncan assist the deployment of a star network with its performance specified in a\nmore practical way. First, the discrete time Markov chain model and M/M/1/k\nqueue are used to describe the full unslotted carrier sense multiple access\nwith collision avoidance (CSMA/CA) algorithm in a non-beacon network.\nConsidering MAC buffer size, unsaturated traffic, and saturated traffic, we\nbuild three analytical models to derive eight important performance metrics,\ne.g., throughput, delay, and reliability. In addition, extensive simulation\nresults show the accuracy of the analytical models in throughput and\nreliability. Finally, we use the analytical data to train the BP-ANNs models to\npredict the key parameters such as node number and delay. All results from the\nsimulation data used to test the BP-ANNs show the accuracy these models. Thus,\nthese methods and results can be used to deploy star networks in application\nenvironments.\n", "versions": [{"version": "v1", "created": "Mon, 5 Sep 2016 11:12:14 GMT"}], "update_date": "2016-09-06", "authors_parsed": [["Chen", "Yang", ""], ["Wang", "Zhong-Yi", ""], ["Huang", "Lan", ""]]}, {"id": "1609.01190", "submitter": "Harshit Gupta", "authors": "Harshit Gupta, Shubha Brata Nath, Sandip Chakraborty, Soumya K. Ghosh", "title": "SDFog: A Software Defined Computing Architecture for QoS Aware Service\n  Orchestration over Edge Devices", "comments": "This work has been submitted to the IEEE for possible publication.\n  Copyright may be transferred without notice, after which this version may no\n  longer be accessible", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing revolutionized the information technology (IT) industry by\noffering dynamic and infinite scaling, on-demand resources and utility-oriented\nusage. However, recent changes in user traffic and requirements have exposed\nthe shortcomings of cloud computing, particularly the inability to deliver\nreal-time responses and handle massive surge in data volumes. Fog computing,\nthat brings back partial computation load from the cloud to the edge devices,\nis envisioned to be the next big change in computing, and has the potential to\naddress these challenges. Being a highly distributed, loosely coupled and still\nin the emerging phase, standardization, quality-of-service management and\ndynamic adaptability are the key challenges faced by fog computing research\nfraternity today. This article aims to address these issues by proposing a\nservice-oriented middleware that leverages the convergence of cloud and fog\ncomputing along with software defined networking (SDN) and network function\nvirtualization (NFV) to achieve the aforementioned goals. The proposed system,\ncalled \"Software Defined Fog\" (SDFog), abstracts connected entities as services\nand allows applications to orchestrate these services with end-to-end QoS\nrequirements. A use-case showing the necessity of such a middleware has been\npresented to show the efficacy of the SDN-based QoS control over the Fog. This\narticle aims at developing an integrated system to realize the software-defined\ncontrol over fog infrastructure.\n", "versions": [{"version": "v1", "created": "Mon, 5 Sep 2016 15:02:07 GMT"}], "update_date": "2016-09-06", "authors_parsed": [["Gupta", "Harshit", ""], ["Nath", "Shubha Brata", ""], ["Chakraborty", "Sandip", ""], ["Ghosh", "Soumya K.", ""]]}, {"id": "1609.01374", "submitter": "Mohamed Alrshah", "authors": "Mohamed A. Alrshah, Mohamed Othman", "title": "Test-Bed based Comparison of Single and Parallel TCP and the Impact Of\n  Parallelism on Throughput and Fairness in Heterogenous Networks", "comments": "4 pages", "journal-ref": "IEEE ICCTD 2009. (pp.332-335)", "doi": "10.1109/ICCTD.2009.144", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Parallel Transport Control Protocol (TCP) has been used to effectively\nutilize bandwidth for data intensive applications over high Bandwidth-Delay\nProduct (BDP) networks. On the other hand, it has been argued that, a\nsingle-based TCP connection with proper modification such as HSTCP can emulate\nand capture the robustness of parallel TCP and can well replace it. In this\nwork a Comparison between Single-Based and the proposed parallel TCP has been\nconducted to show the differences in their performance measurements such as\nthroughput performance and throughput ratio, as well as the link sharing\nFairness also has been observed to show the impact of using the proposed\nParallel TCP on the existing Single-Based TCP connections. The experiment\nresults show that, single-based TCP cannot overcome Parallel TCP especially in\nheterogeneous networks where the packet losses are common. Furthermore, the\nproposed parallel TCP does not affect TCP fairness which makes parallel TCP\nhighly recommended to effectively utilize bandwidth for data intensive\napplications.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2016 02:39:03 GMT"}], "update_date": "2016-09-07", "authors_parsed": [["Alrshah", "Mohamed A.", ""], ["Othman", "Mohamed", ""]]}, {"id": "1609.01443", "submitter": "Quentin Bodinier", "authors": "Quentin Bodinier and Faouzi Bader and Jacques Palicot", "title": "Coexistence in 5G: Analysis of Cross-Interference between OFDM/OQAM and\n  Legacy Users", "comments": "5 pages, 7 figures, Accepted at IEEE Globecom Workshops 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To optimize the use of the spectrum, it is expected that the next generation\nof wireless networks (5G) will enable coexistence of newly introduced services\nwith legacy cellular networks. These new services, like Device-To-Device (D2D)\ncommunication, should require limited synchronization with the legacy cell to\nlimit the amount of signaling overhead in the network. However, it is known\nthat Cyclic Prefix-Orthogonal Frequency Division Multiplexing (CP-OFDM) used in\nLong Term Evolution-Advanced (LTE-A) is not fit for asynchronous environments.\nThis has motivated the search for a new waveform, able to enhance coexistence\nwith CP-OFDM. Namely, it has been widely suggested that new devices could use\nOFDM/Offset-Quadrature Amplitude Modulation (OFDM/OQAM) to reduce the\ninterference they inject to legacy cellular users. However, values of\ninterference are usually measured at the input antenna of the receiver, based\non the PSD of the interfering signal. We showed in previous works that this\nmeasurement is not representative of the actual interference that is seen after\nthe demodulation operations. Building on this finding, we provide in this paper\nthe first exact closed forms of cross-interference between OFDM/OQAM and\nCP-OFDM users. Our results prove that using OFDM/OQAM only marginally reduces\ninterference to legacy users, in contradiction with many results in the\nliterature.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2016 09:06:03 GMT"}, {"version": "v2", "created": "Thu, 8 Sep 2016 06:57:36 GMT"}], "update_date": "2016-09-09", "authors_parsed": [["Bodinier", "Quentin", ""], ["Bader", "Faouzi", ""], ["Palicot", "Jacques", ""]]}, {"id": "1609.01622", "submitter": "Ripudaman Singh", "authors": "Ripudaman Singh, Brijesh Kumar Rai, and Sanjay Kumar Bose", "title": "A Cross-layer Contention Based Synchronous MAC Protocol for Transmission\n  Delay Reduction in Multi-Hop WSNs", "comments": "Accepted to TENCON 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently designed cross-layer contention based synchronous MAC protocols like\nthe PRMAC protocol, for wireless sensor networks (WSNs) enable a node to\nschedule multi-hop transmission of multiple data packets in a cycle. However,\nthese systems accommodate both the request-to-send data process and the\nconfirmation-to-send data process in the same data transmission scheduling\nwindow (i.e. data window). This reduces the length of the multi-hop flow setup\nin the data window. In a multi-hop scenario, this degrades both the packet\ndelivery ratio (PDR) and the end-to-end transmission delay (E2ETD). In this\npaper, we propose a cross-layer contention based synchronous MAC protocol,\nwhich accommodates the request-to-send data process in the data window and the\nconfirmation-to-send data process in the sleep window for increased efficiency.\nWe evaluate our proposed protocol through ns-2.35 simulations and compare its\nperformance with the PRMAC protocol. Results suggest that in multi-hop\nscenario, proposed protocol outperforms PRMAC both in terms of the E2ETD and\nthe packet delivery ratio (PDR).\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2016 15:51:59 GMT"}], "update_date": "2016-09-07", "authors_parsed": [["Singh", "Ripudaman", ""], ["Rai", "Brijesh Kumar", ""], ["Bose", "Sanjay Kumar", ""]]}, {"id": "1609.01860", "submitter": "Venkatesh Venkatesh Venkatesh", "authors": "Venkatesh, C S Sengar, K R Venugopal, S S Iyengar, L M Patnaik", "title": "RRDVCR: Real-Time Reliable Data Delivery Based on Virtual Coordinating\n  Routing for Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real-time industrial application requires routing protocol that guarantees\ndata delivery with reliable, efficient and low end-to-end delay. Existing\nRouting(THVR) [13] is based velocity of Two-Hop Velocity and protocol relates\ntwo-hop velocity to delay to select the next forwarding node, that has overhead\nof exchanging control packets, and depleting the available energy in nodes. We\npropose a Real-Time Reliable Data delivery based on Virtual Coordinates Routing\n(RRDVCR) algorithm, based on the number of hops to the destination rather than\ngeographic distance. Selection of forwarding node is based on packet progress\noffered by two-hops, link quality and available energy at the forwarding nodes.\nAll these metric are co-related by dynamic co-relation factor. The proposed\nprotocol uses selective acknowledgment scheme that results in lower overhead\nand energy consumption. Simulation results shows that there is about 22% and\n9.5% decrease in energy consumption compared to SPEED [8] and THVR [13]\nrespectively, 16% and 38% increase in packet delivery compared to THVR [13] and\nSPEED[8] respectively, and overhead is reduced by 50%.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2016 07:26:34 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Venkatesh", "", ""], ["Sengar", "C S", ""], ["Venugopal", "K R", ""], ["Iyengar", "S S", ""], ["Patnaik", "L M", ""]]}, {"id": "1609.01883", "submitter": "Pavan Kumar Reddy Mule", "authors": "Mule Pavan Kumar Reddy, Srikant Manas Kala, Bheemarjuna Reddy Tamma", "title": "Enhancing Channel Assignment Performance in Wireless Mesh Networks\n  Through Interference Mitigation Functions", "comments": "6 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion of Total Interference Degree (TID) is traditionally used to\nestimate the intensity of prevalent interference in a\nMulti-RadioMulti-ChannelWirelessMesh Network (MRMC WMN). Numerous Channel\nAssignment (CA) approaches, linkscheduling algorithms and routing schemes have\nbeen proposed for WMNs which rely entirely on the concept of TID estimates.\nThey focus on minimizing TID to create a minimal interference scenario for the\nnetwork. In our prior works [1] and [2], we have questioned the efficacy of TID\nestimate and then proposed two reliable interference estimation metrics viz.,\nChannel Distribution Across Links Cost (CDALcost) and Cumulative X-Link-Set\nWeight (CXLSwt). In this work, we assess the ability of these interference\nestimation metrics to replace TID as the interferenceminimizing factor in a CA\nscheme implemented on a grid MRMC WMN. We carry out a comprehensive evaluation\non ns-3 and then conclude from the results that the performance of the network\nincreases by 10-15% when the CA scheme uses CXLSwt as the underlying\nInterference Mitigation Function (IMF) when compared with CA using TID as IMF.\nWe also confirm that CDALcost is not a better IMF than TID and CXLSwt.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2016 08:46:45 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Reddy", "Mule Pavan Kumar", ""], ["Kala", "Srikant Manas", ""], ["Tamma", "Bheemarjuna Reddy", ""]]}, {"id": "1609.02286", "submitter": "Yoghitha Ramamoorthi", "authors": "Yoghitha Ramamoorthi and Abhinav Kumar", "title": "Resource Allocation for CoMP in Cellular Networks with Base Station\n  Switching", "comments": "13 Pages, 11 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Base station switching (BSS) can results in significant reduction in energy\nconsumption of cellular networks during low traffic conditions. We show that\nthe coverage loss due to BSS can be compensated via coordinated multi-point\n(CoMP) based transmission in a cluster of base stations. For a BSS with CoMP\nbased system, we propose various BSS patterns to achieve suitable trade-offs\nbetween energy savings and throughput. We formulate the CoMP resource\nallocation and user scheduling as a joint optimization problem. We derive the\noptimal time fraction and user scheduling for this problem and use it to\nformulate a simplified BSS with CoMP optimization problem. A heuristic that\nsolves this problem is presented. Through extensive simulations, we show that\nsuitable trade-offs among energy, coverage, and rate can be achieved by\nappropriately selecting the BSS pattern, CoMP cluster, and rate threshold.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 06:10:52 GMT"}, {"version": "v2", "created": "Tue, 24 Jan 2017 07:09:23 GMT"}, {"version": "v3", "created": "Wed, 28 Mar 2018 08:49:58 GMT"}], "update_date": "2018-03-29", "authors_parsed": [["Ramamoorthi", "Yoghitha", ""], ["Kumar", "Abhinav", ""]]}, {"id": "1609.02305", "submitter": "Klaus-Tycho Foerster", "authors": "Klaus-Tycho Foerster, Stefan Schmid, Stefano Vissicchio", "title": "Survey of Consistent Software-Defined Network Updates", "comments": null, "journal-ref": "IEEE Communications Surveys & Tutorials 2019", "doi": "10.1109/COMST.2018.2876749", "report-no": null, "categories": "cs.NI cs.DC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer networks have become a critical infrastructure. In fact, networks\nshould not only meet strict requirements in terms of correctness, availability,\nand performance, but they should also be very flexible and support fast\nupdates, e.g., due to policy changes, increasing traffic, or failures. This\npaper presents a structured survey of mechanism and protocols to update\ncomputer networks in a fast and consistent manner. In particular, we identify\nand discuss the different desirable consistency properties that should be\nprovided throughout a network update, the algorithmic techniques which are\nneeded to meet these consistency properties, and the implications on the speed\nand costs at which updates can be performed. We also explain the relationship\nbetween consistent network update problems and classic algorithmic optimization\nones. While our survey is mainly motivated by the advent of Software-Defined\nNetworks (SDNs) and their primary need for correct and efficient update\ntechniques, the fundamental underlying problems are not new, and we provide a\nhistorical perspective of the subject as well.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 07:34:39 GMT"}, {"version": "v2", "created": "Thu, 8 Feb 2018 15:42:18 GMT"}, {"version": "v3", "created": "Tue, 26 Mar 2019 13:33:38 GMT"}], "update_date": "2019-03-27", "authors_parsed": [["Foerster", "Klaus-Tycho", ""], ["Schmid", "Stefan", ""], ["Vissicchio", "Stefano", ""]]}, {"id": "1609.02324", "submitter": "Stefan Schmid", "authors": "Liron Schiff, Kashyap Thimmaraju, Stefan Schmid", "title": "Routing-Verification-as-a-Service (RVaaS): Trustworthy Routing Despite\n  Insecure Providers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer networks today typically do not provide any mechanisms to the users\nto learn, in a reliable manner, which paths have (and have not) been taken by\ntheir packets. Rather, it seems inevitable that as soon as a packet leaves the\nnetwork card, the user is forced to trust the network provider to forward the\npackets as expected or agreed upon. This can be undesirable, especially in the\nlight of today's trend toward more programmable networks: after a successful\ncyber attack on the network management system or Software-Defined Network (SDN)\ncontrol plane, an adversary in principle has complete control over the network.\n  This paper presents a low-cost and efficient solution to detect misbehaviors\nand ensure trustworthy routing over untrusted or insecure providers, in\nparticular providers whose management system or control plane has been\ncompromised (e.g., using a cyber attack). We propose\nRouting-Verification-as-a-Service (RVaaS): RVaaS offers clients a flexible\ninterface to query information relevant to their traffic, while respecting the\nautonomy of the network provider. RVaaS leverages key features of\nOpenFlow-based SDNs to combine (passive and active) configuration monitoring,\nlogical data plane verification and actual in-band tests, in a novel manner.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 08:35:50 GMT"}], "update_date": "2016-09-09", "authors_parsed": [["Schiff", "Liron", ""], ["Thimmaraju", "Kashyap", ""], ["Schmid", "Stefan", ""]]}, {"id": "1609.02375", "submitter": "Julius Mboli Sechang", "authors": "Julius Sechang Mboli", "title": "Feasibility Study on Disaster Management with Hybrid Network of LTE and\n  Satellite Links", "comments": "This is a summary of my MSc Dissertation. It has 8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are highly vulnerable to either natural or artificial catastrophes and\ntherefore, Public Protection and Disaster Relief (PPDR) operators need reliable\nwireless communications for successful operations especially in critical rescue\nmissions. PPDR dedicated or commercial terrestrial networks have always been\nused which at most times lead to unsuccessful operations. This is due to the\nfact these networks are all infrastructure-based which can be destroyed, fail\nto deliver the required service or the networks are not able to support and\nsustain the sudden traffic surge. Long-Term Evolution (LTE) is earmarked as the\nfuture candidate technology for PPDR purpose and so much have been put into it\nin terms of research, perhaps suitable architecture that will meet\nmission-critical requirements can be developed. This can only work if\nterrestrial networks will always be available. Unfortunately, in worst case\nscenarios, infrastructures might get damaged totally or might be destroyed by\nsubsequent disasters. As a result, adequate guarantees can only be possible in\nthe hypothesis of very high financial involvement. Fortunately, considering\navailability, coverage ubiquity and reliability, satellite technologies have\nlately proven good. So, to maximize the high channel performance of terrestrial\nnetworks and the availability and reliability of non-terrestrial networks, the\nsolution lies in a hybrid system. It is on this ground that this work deals\nwith the integration of LTE and satellite networks in both infrastructure-based\nand infrastructure-less topologies for PPDR purpose. It is aim at providing\npeople trapped in disaster and field operators with a transparent accessibility\nand guaranteed coverage even when infrastructures are damaged. The requirements\nare defined and the model simulated. The network is able to provide network\ncoverage, enhanced capacity and promised greater resilience.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 11:21:27 GMT"}], "update_date": "2016-09-09", "authors_parsed": [["Mboli", "Julius Sechang", ""]]}, {"id": "1609.02391", "submitter": "Samarth Gupta", "authors": "Samarth Gupta and Sharayu Moharir", "title": "Request Patterns and Caching for VoD Services with Recommendation\n  Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Video on Demand (VoD) services like Netflix and YouTube account for ever\nincreasing fractions of Internet traffic. It is estimated that this fraction\nwill cross 80% in the next three years. Most popular VoD services have\nrecommendation engines which recommend videos to users based on their viewing\nhistory, thus introducing time-correlation in user requests. Understanding and\nmodeling this time-correlation in user requests is critical for network traffic\nengineering. The primary goal of this work is to use empirically observed\nproperties of user requests to model the effect of recommendation engines on\nthe request patterns in VoD services. We propose a Markovian request model to\ncapture the time-correlation in user requests and show that our model is\nconsistent with the observations of existing empirical studies.\n  Most large-scale VoD services deliver content to users via a distributed\nnetwork of servers as serving users requests via geographically co-located\nservers reduces latency and network bandwidth consumption. The content\nreplication policy, i.e., determining which contents to cache on the servers is\na key resource allocation problem for VoD services. Recent studies show that\nlow start-up delay is a key Quality of Service (QoS) requirement of users of\nVoD services. This motivates the need to pre-fetch (fetch before contents are\nrequested) and cache content likely to be request in the near future. Since\npre-fetching leads to an increase in the network bandwidth usage, we use our\nMarkovian model to explore the trade-offs and feasibility of implementing\nrecommendation based pre-fetching.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 12:17:11 GMT"}, {"version": "v2", "created": "Wed, 23 Nov 2016 16:55:06 GMT"}, {"version": "v3", "created": "Wed, 3 May 2017 10:37:58 GMT"}], "update_date": "2017-05-04", "authors_parsed": [["Gupta", "Samarth", ""], ["Moharir", "Sharayu", ""]]}, {"id": "1609.02411", "submitter": "Rabe Arshad", "authors": "Rabe Arshad, Sameh Sorour, Hesham Elsawy, Tareq Y. Al-Naffouri, and\n  Mohamed-Slim Alouini", "title": "Velocity-Aware Handover Management in Two-Tier Cellular Networks", "comments": "Submitted in IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While network densification is considered an important solution to cater the\never-increasing capacity demand, its effect on the handover (HO) rate is\noverlooked. In dense 5G networks, HO delays may neutralize or even negate the\ngains offered by network densification. Hence, user mobility imposes a\nnontrivial challenge to harvest capacity gains via network densification. In\nthis paper, we propose a velocity-aware HO management scheme for two-tier\ndownlink cellular network to mitigate the HO effect on the foreseen\ndensification throughput gains. The proposed HO scheme sacrifices the best BS\nconnectivity, by skipping HO to some BSs along the user's trajectory, to\nmaintain longer connection durations and reduce HO rates. Furthermore, the\nproposed scheme enables cooperative BS service and strongest interference\ncancellation to compensate for skipping the best connectivity. To this end, we\nconsider different HO skipping scenarios and develop a velocity-aware\nmathematical model, via stochastic geometry, to quantify the performance of the\nproposed HO scheme in terms of the coverage probability and user throughput.\nThe results highlight the HO rate problem in dense cellular environments and\nshow the importance of the proposed HO schemes. Finally, the value of BS\ncooperation along with handover skipping is quantified for different user\nmobility profiles.\n", "versions": [{"version": "v1", "created": "Sun, 4 Sep 2016 14:06:07 GMT"}], "update_date": "2016-09-09", "authors_parsed": [["Arshad", "Rabe", ""], ["Sorour", "Sameh", ""], ["Elsawy", "Hesham", ""], ["Al-Naffouri", "Tareq Y.", ""], ["Alouini", "Mohamed-Slim", ""]]}, {"id": "1609.02532", "submitter": "Cristina Mu\\~noz", "authors": "Cristina Mu\\~noz, Liang Wang, Eduardo Solana, Jon Crowcroft", "title": "I(FIB)F: Iterated Bloom Filters for Routing in Named Data Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Named Data Networks provide a clean-slate redesign of the Future Internet for\nefficient content distribution. Because Internet of Things are expected to\ncompose a significant part of Future Internet, most content will be managed by\nconstrained devices. Such devices are often equipped with limited CPU, memory,\nbandwidth, and energy supply. However, the current Named Data Networks design\nneglects the specific requirements of Internet of Things scenarios and many\ndata structures need to be further optimised. The purpose of this research is\nto provide an efficient strategy to route in Named Data Networks by\nconstructing a Forwarding Information Base using Iterated Bloom Filters defined\nas I(FIB)F. We propose the use of content names based on iterative hashes. This\nstrategy leads to reduce the overhead of packets. Moreover, the memory and the\ncomplexity required in the forwarding strategy are lower than in current\nsolutions. We compare our proposal with solutions based on hierarchical names\nand Standard Bloom Filters. We show how to further optimise I(FIB)F by\nexploiting the structure information contained in hierarchical content names.\nFinally, two strategies may be followed to reduce: (i) the overall memory for\nrouting or (ii) the probability of false positives.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 19:02:51 GMT"}], "update_date": "2016-09-09", "authors_parsed": [["Muñoz", "Cristina", ""], ["Wang", "Liang", ""], ["Solana", "Eduardo", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1609.02596", "submitter": "Ejder Ba\\c{s}tu\\u{g}", "authors": "Fei Shen, Kenza Hamidouche, Ejder Ba\\c{s}tu\\u{g}, and M\\'erouane\n  Debbah", "title": "A Stackelberg Game for Incentive Proactive Caching Mechanisms in\n  Wireless Networks", "comments": "to be presented at IEEE Global Communications Conference\n  (GLOBECOM'2016), Washington DC, USA, December 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, an incentive proactive cache mechanism in cache-enabled small\ncell networks (SCNs) is proposed, in order to motivate the content providers\n(CPs) to participate in the caching procedure. A network composed of a single\nmobile network operator (MNO) and multiple CPs is considered. The MNO aims to\ndefine the price it charges the CPs to maximize its revenue while the CPs\ncompete to determine the number of files they cache at the MNO's small base\nstations (SBSs) to improve the quality of service (QoS) of their users. This\nproblem is formulated as a Stackelberg game where a single MNO is considered as\nthe leader and the multiple CPs willing to cache files are the followers. The\nfollowers game is modeled as a non-cooperative game and both the existence and\nuniqueness of a Nash equilibrium (NE) are proved. The closed-form expression of\nthe NE which corresponds to the amount of storage each CP requests from the MNO\nis derived. An optimization problem is formulated at the MNO side to determine\nthe optimal price that the MNO should charge the CPs. Simulation results show\nthat at the equilibrium, the MNO and CPs can all achieve a utility that is up\nto 50% higher than the cases in which the prices and storage quantities are\nrequested arbitrarily.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 21:20:45 GMT"}], "update_date": "2016-09-12", "authors_parsed": [["Shen", "Fei", ""], ["Hamidouche", "Kenza", ""], ["Baştuğ", "Ejder", ""], ["Debbah", "Mérouane", ""]]}, {"id": "1609.02603", "submitter": "Ali Sedighimanesh", "authors": "Ali Sedighimanesh, Mohammad Sedighimanesh, Javad Baqeri", "title": "Cutting down energy usage in wireless sensor networks using Duty Cycle\n  technique and multi-hop routing", "comments": "19 page, 7 Figures", "journal-ref": "International Journal of Wireless & Mobile Networks.\n  2016;8(4):23-41", "doi": "10.5121/ijwmn.2016.8402", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A wireless sensor network is composed of many sensor nodes that have been\ngiven out in a specific zone and each of them had an ability of collecting\ninformation from the environment and sending collected data to the sink. The\nmost significant issues in wireless sensor networks despite the recent progress\nis the trouble of the severe limitations of energy resources. Since that in\ndifferent applications of sensor nets we could throw a static or mobile sink\nthen all aspects of such networks should be planned with an awareness of\nenergy. One of the most significant topics related to these networks is\nrouting. One of the most widely used and efficient methods of routing is a\nhierarchy (based on clustering) method. In The present study with the objective\nof cutting down energy consumption and persistence of network coverage we have\noffered a novel algorithm based on clustering algorithms and multi hop routing.\nTo achieve this goal first we layer the network environment based on the size\nof the network. We will identify the optimal number of cluster heads and every\ncluster head based on the mechanism of topology control will start to accept\nmembers. Likewise we set the first layer as gate layer and subsequently\nidentifying the gate nodes we would turn away half of the sensors and then stop\nusing energy and the remaining nodes in this layer will join the gate nodes\nbecause they hold a critical part in bettering the functioning of the system.\nCluster heads off following layers send the information to cluster heads in the\nabove layer until sent data will be sent to gate nodes and finally will be sent\nto sink. We have tested the proposed algorithm in two situations 1) when the\nsink is off and 2) when a sink is on and simulation data shows that proposed\nalgorithm has better performance in terms of the life span of a network than\nLEACH and E LEACH protocols.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 21:41:06 GMT"}], "update_date": "2016-09-12", "authors_parsed": [["Sedighimanesh", "Ali", ""], ["Sedighimanesh", "Mohammad", ""], ["Baqeri", "Javad", ""]]}, {"id": "1609.02682", "submitter": "Ali Sedighimanesh", "authors": "Mohammad Sedighimanesh, Javad Baqeri, Ali Sedighimanesh", "title": "Increasing Wireless Sensor Networks Lifetime with New Method", "comments": "16 pages; 9 Figure; International Journal", "journal-ref": "International Journal of Wireless & Mobile Networks.\n  2016;8(4):65-80", "doi": "10.1155/2016/8743927", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most important issues in Wireless Sensor Networks (WSNs) is severe\nenergy restrictions. As the performance of Sensor Networks is strongly\ndependence to the network lifetime, researchers seek a way to use node energy\nsupply effectively and increasing network lifetime. As a consequence, it is\ncrucial to use routing algorithms result in decrease energy consumption and\nbetter bandwidth utilization. The purpose of this paper is to increase Wireless\nSensor Networks lifetime using LEACH-algorithm. So before clustering Network\nenvironment, it is divided into two virtual layers (using distance between\nsensor nodes and base station) and then regarding to sensors position in each\nof two layers, residual energy of sensor and distance from base station is used\nin clustering. In this article, we compare proposed algorithm with well-known\nLEACH and ELEACH algorithms in homogeneous environment (with equal energy for\nall sensors) and heterogeneous one (energy of half of sensors get doubled),\nalso for static and dynamic situation of base station. Results show that our\nproposed algorithm delivers improved performance.\n", "versions": [{"version": "v1", "created": "Fri, 9 Sep 2016 08:05:42 GMT"}], "update_date": "2016-09-12", "authors_parsed": [["Sedighimanesh", "Mohammad", ""], ["Baqeri", "Javad", ""], ["Sedighimanesh", "Ali", ""]]}, {"id": "1609.02694", "submitter": "Antonella Del Pozzo", "authors": "Silvia Bonomi (DIAG), Antonella Del Pozzo (DIAG, NPA), Maria\n  Potop-Butucaru (NPA), S\\'ebastien Tixeuil (NPA, IUF, LINCS)", "title": "Optimal Self-Stabilizing Mobile Byzantine-Tolerant Regular Register with\n  bounded timestamp", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes the first implementation of a self-stabilizing regular\nregister emulated by $n$ servers that is tolerant to both mobile Byzantine\nagents, and \\emph{transient failures} in a round-free synchronous model.\nDifferently from existing Mobile Byzantine tolerant register implementations,\nthis paper considers a more powerful adversary where (i) the message delay\n(i.e., $\\delta$) and the period of mobile Byzantine agents movement (i.e.,\n$\\Delta$) are completely decoupled and (ii) servers are not aware of their\nstate i.e., they do not know if they have been corrupted or not by a mobile\nByzantine agent.The proposed protocol tolerates \\emph{(i)} any number of\ntransient failures, and \\emph{(ii)} up to $f$ Mobile Byzantine agents. In\naddition, our implementation uses bounded timestamps from the\n$\\mathcal{Z}\\_{13}$ domain and it is optimal with respect to the number of\nservers needed to tolerate $f$ mobile Byzantine agents in the given model.\n", "versions": [{"version": "v1", "created": "Fri, 9 Sep 2016 08:34:31 GMT"}, {"version": "v2", "created": "Tue, 23 Oct 2018 06:36:50 GMT"}], "update_date": "2018-10-24", "authors_parsed": [["Bonomi", "Silvia", "", "DIAG"], ["Del Pozzo", "Antonella", "", "DIAG, NPA"], ["Potop-Butucaru", "Maria", "", "NPA"], ["Tixeuil", "Sébastien", "", "NPA, IUF, LINCS"]]}, {"id": "1609.02982", "submitter": "Haoyu Song", "authors": "Haoyu Song and Jun Gong and Hongfei Chen", "title": "Network Map Reduce", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Networking data analytics is increasingly used for enhanced network\nvisibility and controllability. We draw the similarities between the Software\nDefined Networking (SDN) architecture and the MapReduce programming model.\nInspired by the similarity, we suggest the necessary data plane innovations to\nmake network data plane devices function as distributed mappers and optionally,\nreducers. A streaming network data MapReduce architecture can therefore\nconveniently solve a series of network monitoring and management problems.\nUnlike the traditional networking data analytical system, our proposed system\nembeds the data analytics engine directly in the network infrastructure. The\naffinity leads to a concise system architecture and better cost performance\nratio. On top of this architecture, we propose a general MapReduce-like\nprogramming model for real-time and one-pass networking data analytics, which\ninvolves joint in-network and out-of-network computing. We show this model can\naddress a wide range of interactive queries from various network applications.\nThis position paper strives to make a point that the white-box trend does not\nnecessarily lead to simple and dumb networking devices. Rather, the defining\ncharacteristics of the next generation white-box are open and programmable, so\nthat the network devices can be made smart and versatile to support new\nservices and applications.\n", "versions": [{"version": "v1", "created": "Sat, 10 Sep 2016 00:56:04 GMT"}], "update_date": "2016-09-13", "authors_parsed": [["Song", "Haoyu", ""], ["Gong", "Jun", ""], ["Chen", "Hongfei", ""]]}, {"id": "1609.03130", "submitter": "Maani Ghaffari Jadidi", "authors": "Maani Ghaffari Jadidi, Mitesh Patel, Jaime Valls Miro", "title": "Gaussian Processes Online Observation Classification for RSSI-based\n  Low-cost Indoor Positioning Systems", "comments": "Accepted for 2017 ICRA, final submission", "journal-ref": null, "doi": "10.1109/ICRA.2017.7989743", "report-no": null, "categories": "cs.NI cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a real-time classification scheme to cope with\nnoisy Radio Signal Strength Indicator (RSSI) measurements utilized in indoor\npositioning systems. RSSI values are often converted to distances for position\nestimation. However due to multipathing and shadowing effects, finding a unique\nsensor model using both parametric and non-parametric methods is highly\nchallenging. We learn decision regions using the Gaussian Processes\nclassification to accept measurements that are consistent with the operating\nsensor model. The proposed approach can perform online, does not rely on a\nparticular sensor model or parameters, and is robust to sensor failures. The\nexperimental results achieved using hardware show that available positioning\nalgorithms can benefit from incorporating the classifier into their measurement\nmodel as a meta-sensor modeling technique.\n", "versions": [{"version": "v1", "created": "Sun, 11 Sep 2016 07:31:03 GMT"}, {"version": "v2", "created": "Mon, 20 Feb 2017 13:27:07 GMT"}], "update_date": "2019-05-22", "authors_parsed": [["Jadidi", "Maani Ghaffari", ""], ["Patel", "Mitesh", ""], ["Miro", "Jaime Valls", ""]]}, {"id": "1609.03289", "submitter": "Pradipta Ghosh", "authors": "Pradipta Ghosh, He Ren, Reza Banirazi, Bhaskar Krishnamachari and\n  Edmond Jonckheere", "title": "Empirical Evaluation of the Heat-Diffusion Collection Protocol for\n  Wireless Sensor Networks", "comments": null, "journal-ref": "Elsevier Computer Networks, Volume 127, 2017, Pages 217-232", "doi": "10.1016/j.comnet.2017.08.018.", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heat-Diffusion (HD) routing is our recently-developed queue-aware routing\npolicy for multi-hop wireless networks inspired by Thermodynamics. In the prior\ntheoretical studies, we have shown that HD routing guarantees throughput\noptimality, minimizes a quadratic routing cost, minimizes queue congestion on\nthe network, and provides a trade-off between routing cost and queueing delay\nthat is Pareto-Optimal. While striking, these guarantees are based on idealized\nassumptions (including global synchronization, centralized control, and\ninfinite buffers) and heretofore have only been evaluated through simplified\nnumerical simulations. We present here the first practical decentralized\nversion of HD algorithm, which we refer to as Heat-Diffusion Collection\nProtocol (HDCP), for wireless sensor networks. We present a thorough evaluation\nof HDCP based on real testbed experiments, including a comparative analysis of\nits performance with respect to the state of the art Collection Tree Protocol\n(CTP) and Backpressure Collection Protocol (BCP) for wireless sensor networks.\nWe find that HDCP has a significantly higher throughput region and greater\nresilience to interference compared to CTP. However, we also find that the best\nperformance of HDCP is comparable to the best performance of BCP, due to the\nsimilarity in their neighbor rankings, which we verify through a Kendall's-Tau\ntest.\n", "versions": [{"version": "v1", "created": "Mon, 12 Sep 2016 07:36:02 GMT"}, {"version": "v2", "created": "Sun, 2 Sep 2018 23:21:59 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Ghosh", "Pradipta", ""], ["Ren", "He", ""], ["Banirazi", "Reza", ""], ["Krishnamachari", "Bhaskar", ""], ["Jonckheere", "Edmond", ""]]}, {"id": "1609.03312", "submitter": "Charith Perera", "authors": "Charith Perera, Susan Wakenshaw, Tim Baarslag, Hamed Haddadi, Arosha\n  Bandara, Richard Mortier, Andy Crabtree, Irene Ng, Derek McAuley, Jon\n  Crowcroft", "title": "Valorising the IoT Databox: Creating Value for Everyone", "comments": "Accepted for Transactions on Emerging Telecommunications Technologies", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT) is expected to generate large amounts of\nheterogeneous data from diverse sources including physical sensors, user\ndevices, and social media platforms. Over the last few years, significant\nattention has been focused on personal data, particularly data generated by\nsmart wearable and smart home devices. Making personal data available for\naccess and trade is expected to become a part of the data driven digital\neconomy. In this position paper, we review the research challenges in building\npersonal Databoxes that hold personal data and enable data access by other\nparties, and potentially thus sharing of data with other parties. These\nDataboxes are expected to become a core part of future data marketplaces.\n", "versions": [{"version": "v1", "created": "Mon, 12 Sep 2016 08:52:25 GMT"}], "update_date": "2016-09-13", "authors_parsed": [["Perera", "Charith", ""], ["Wakenshaw", "Susan", ""], ["Baarslag", "Tim", ""], ["Haddadi", "Hamed", ""], ["Bandara", "Arosha", ""], ["Mortier", "Richard", ""], ["Crabtree", "Andy", ""], ["Ng", "Irene", ""], ["McAuley", "Derek", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1609.03363", "submitter": "Dejan Vukobratovic", "authors": "Dejan Vukobratovic, Dusan Jakovetic, Vitaly Skachek, Dragana Bajovic,\n  Dino Sejdinovic, Gunes Karabulut Kurt, Camilla Hollanti, Ingo Fischer", "title": "CONDENSE: A Reconfigurable Knowledge Acquisition Architecture for Future\n  5G IoT", "comments": "17 pages, 7 figures in IEEE Access, Vol. 4, 2016", "journal-ref": null, "doi": "10.1109/ACCESS.2016.2585468", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  In forthcoming years, the Internet of Things (IoT) will connect billions of\nsmart devices generating and uploading a deluge of data to the cloud. If\nsuccessfully extracted, the knowledge buried in the data can significantly\nimprove the quality of life and foster economic growth. However, a critical\nbottleneck for realising the efficient IoT is the pressure it puts on the\nexisting communication infrastructures, requiring transfer of enormous data\nvolumes. Aiming at addressing this problem, we propose a novel architecture\ndubbed Condense, which integrates the IoT-communication infrastructure into\ndata analysis. This is achieved via the generic concept of network function\ncomputation: Instead of merely transferring data from the IoT sources to the\ncloud, the communication infrastructure should actively participate in the data\nanalysis by carefully designed en-route processing. We define the Condense\narchitecture, its basic layers, and the interactions among its constituent\nmodules. Further, from the implementation side, we describe how Condense can be\nintegrated into the 3rd Generation Partnership Project (3GPP) Machine Type\nCommunications (MTC) architecture, as well as the prospects of making it a\npractically viable technology in a short time frame, relying on Network\nFunction Virtualization (NFV) and Software Defined Networking (SDN). Finally,\nfrom the theoretical side, we survey the relevant literature on computing\n\"atomic\" functions in both analog and digital domains, as well as on function\ndecomposition over networks, highlighting challenges, insights, and future\ndirections for exploiting these techniques within practical 3GPP MTC\narchitecture.\n", "versions": [{"version": "v1", "created": "Mon, 12 Sep 2016 12:23:03 GMT"}], "update_date": "2016-09-13", "authors_parsed": [["Vukobratovic", "Dejan", ""], ["Jakovetic", "Dusan", ""], ["Skachek", "Vitaly", ""], ["Bajovic", "Dragana", ""], ["Sejdinovic", "Dino", ""], ["Kurt", "Gunes Karabulut", ""], ["Hollanti", "Camilla", ""], ["Fischer", "Ingo", ""]]}, {"id": "1609.03387", "submitter": "Manlio Bacco", "authors": "Manlio Bacco, Tomaso De Cola, Giovanni Giambene, Alberto Gotta", "title": "M2M Traffic via Random Access Satellite links: Interactions between\n  Transport and MAC Layers", "comments": null, "journal-ref": null, "doi": "10.1109/TAES.2018.2865150", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine-to-machine services are witnessing an unprecedented diffusion, which\nis expected to result in an ever-increasing data traffic load. In this context,\nsatellite technology is playing a pivotal role, since it enables a widespread\nprovisioning of machine-to-machine services. In particular, oil industry,\nmaritime communications, as well as remote monitoring are sectors where the use\nof satellite communications is expected to dramatically explode within the next\nfew years. In the light of this sudden increase of machine-to-machine data\ntransported over satellite, a more thorough understanding of machine-to-machine\nservice implementation over satellite is required, especially focusing on the\ninteraction between transport and MAC layers of the protocol stack. Starting\nfrom these observations, this paper thoroughly analyses the interaction between\nTCP and the Contention Resolution Diversity Slotted Aloha access scheme defined\nin the DVB-RCS2 standard, assuming the use of an MQTT-like protocol to\ndistribute machine-to-machine services. A novel TCP model is developed and\nvalidated through extensive simulation campaigns, which also shed important\nlights on the design choices enabling the efficient transport of\nmachine-to-machine data via satellite.\n", "versions": [{"version": "v1", "created": "Mon, 12 Sep 2016 13:25:53 GMT"}], "update_date": "2018-08-24", "authors_parsed": [["Bacco", "Manlio", ""], ["De Cola", "Tomaso", ""], ["Giambene", "Giovanni", ""], ["Gotta", "Alberto", ""]]}, {"id": "1609.03498", "submitter": "Ljiljana Simi\\'c", "authors": "Ljiljana Simi\\'c, Andra M. Voicu, Petri M\\\"ah\\\"onen, Marina Petrova\n  and J. Pierre de Vries", "title": "LTE in Unlicensed Bands is neither Friend nor Foe to Wi-Fi", "comments": "accepted for publication in IEEE Access", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proponents of deploying LTE in the 5 GHz band for providing additional\ncellular network capacity have claimed that LTE would be a better neighbour to\nWi-Fi in the unlicensed band, than Wi-Fi is to itself. On the other side of the\ndebate, the Wi-Fi community has objected that LTE would be highly detrimental\nto Wi-Fi network performance. However, there is a lack of transparent and\nsystematic engineering evidence supporting the contradicting claims of the two\ncamps, which is essential for ascertaining whether regulatory intervention is\nin fact required to protect the Wi-Fi incumbent from the new LTE entrant. To\nthis end, we present a comprehensive coexistence study of Wi-Fi and\nLTE-in-unlicensed, surveying a large parameter space of coexistence mechanisms\nand a range of representative network densities and deployment scenarios. Our\nresults show that, typically, harmonious coexistence between Wi-Fi and LTE is\nensured by the large number of 5 GHz channels. For the worst-case scenario of\nforced co-channel operation, LTE is sometimes a better neighbour to Wi-Fi -\nwhen effective node density is low - but sometimes worse - when density is\nhigh. We find that distributed interference coordination is only necessary to\nprevent a \"tragedy of the commons\" in regimes where interference is very\nlikely. We also show that in practice it does not make a difference to the\nincumbent what kind of coexistence mechanism is added to LTE-in-unlicensed, as\nlong as one is in place. We therefore conclude that LTE is neither friend nor\nfoe to Wi-Fi in the unlicensed bands in general. We submit that the systematic\nengineering analysis exemplified by our case study is a best-practice approach\nfor supporting evidence-based rulemaking by the regulator.\n", "versions": [{"version": "v1", "created": "Mon, 12 Sep 2016 17:27:23 GMT"}], "update_date": "2016-09-13", "authors_parsed": [["Simić", "Ljiljana", ""], ["Voicu", "Andra M.", ""], ["Mähönen", "Petri", ""], ["Petrova", "Marina", ""], ["de Vries", "J. Pierre", ""]]}, {"id": "1609.03717", "submitter": "Muhammad Ikram Ashraf", "authors": "Muhammad Ikram Ashraf, Mehdi Bennis, Cristina Perfecto, and Walid Saad", "title": "Dynamic Proximity-aware Resource Allocation in Vehicle-to-Vehicle (V2V)\n  Communications", "comments": "6 pages, 4 figures, IEEE GLOBECOM 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel proximity and load-aware resource allocation for\nvehicle-to-vehicle (V2V) communication is proposed. The proposed approach\nexploits the spatio-temporal traffic patterns, in terms of load and vehicles'\nphysical proximity, to minimize the total network cost which captures the\ntradeoffs between load (i.e., service delay) and successful transmissions while\nsatisfying vehicles's quality-of-service (QoS) requirements. To solve the\noptimization problem under slowly varying channel information, it is decoupled\nthe problem into two interrelated subproblems. First, a dynamic clustering\nmechanism is proposed to group vehicles in zones based on their traffic\npatterns and proximity information. Second, a matching game is proposed to\nallocate resources for each V2V pair within each zone. The problem is cast as\nmany-to-one matching game in which V2V pairs and resource blocks (RBs) rank one\nanother in order to minimize their service delay. The proposed game is shown to\nbelong to the class of matching games with externalities. To solve this game, a\ndistributed algorithm is proposed using which V2V pairs and RBs interact to\nreach a stable matching. Simulation results for a Manhattan model shown that\nthe proposed scheme yields a higher percentage of V2V pairs satisfying QoS as\nwell as significant gain in terms of the signal-to-interference-plus-noise\nratio (SINR) as compared to a state-of-art resource allocation baseline.\n", "versions": [{"version": "v1", "created": "Tue, 13 Sep 2016 07:50:32 GMT"}], "update_date": "2016-09-14", "authors_parsed": [["Ashraf", "Muhammad Ikram", ""], ["Bennis", "Mehdi", ""], ["Perfecto", "Cristina", ""], ["Saad", "Walid", ""]]}, {"id": "1609.03876", "submitter": "Katrin Sj\\\"oberg", "authors": "Katrin Sj\\\"oberg, Peter Andres, Teodor Buburuzan, Achim Brakemeier", "title": "C-ITS Deployment in Europe - Current Status and Outlook", "comments": "7 pages, 2 figures, Accepted for publication in IEEE Vechicular\n  Technology Magazine during 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative Intelligent Transport Systems (C-ITS) refers to applications\nusing vehicle-to-vehicle and vehicle-to-infrastructure communications at a\ncarrier frequency of 5.9 GHz to increase road traffic safety and road traffic\nefficiency in Europe (a.k.a. connected vehicle technology in the US). This\narticle will shed some light on the current status of C-ITS in Europe and what\nis left before deployment can commence in 2019 as announced by C2C-CC. Even\nthough there is an immense activity for the launch of C-ITS in Europe, the\nautomotive industry is also planning for the future.\n", "versions": [{"version": "v1", "created": "Tue, 13 Sep 2016 14:51:53 GMT"}, {"version": "v2", "created": "Mon, 16 Jan 2017 08:32:46 GMT"}], "update_date": "2017-01-17", "authors_parsed": [["Sjöberg", "Katrin", ""], ["Andres", "Peter", ""], ["Buburuzan", "Teodor", ""], ["Brakemeier", "Achim", ""]]}, {"id": "1609.04069", "submitter": "Shaoshi Yang Dr.", "authors": "Zesong Fei, Bin Li, Shaoshi Yang, Chengwen Xing, Hongbin Chen, and\n  Lajos Hanzo", "title": "A Survey of Multi-Objective Optimization in Wireless Sensor Networks:\n  Metrics, Algorithms and Open Problems", "comments": "38 pages, 17 figures, 11 tables, 289 references, accepted to appear\n  on IEEE Communications Surveys & Tutorials, Sept. 2016", "journal-ref": "IEEE Communications Surveys & Tutorials, vol. 19, no. 1, pp.\n  550-586, First Quarter, 2017", "doi": "10.1109/COMST.2016.2610578", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs) have attracted substantial research interest,\nespecially in the context of performing monitoring and surveillance tasks.\nHowever, it is challenging to strike compelling trade-offs amongst the various\nconflicting optimization criteria, such as the network's energy dissipation,\npacket-loss rate, coverage and lifetime. This paper provides a tutorial and\nsurvey of recent research and development efforts addressing this issue by\nusing the technique of multi-objective optimization (MOO). First, we provide an\noverview of the main optimization objectives used in WSNs. Then, we elaborate\non various prevalent approaches conceived for MOO, such as the family of\nmathematical programming based scalarization methods, the family of\nheuristics/metaheuristics based optimization algorithms, and a variety of other\nadvanced optimization techniques. Furthermore, we summarize a range of recent\nstudies of MOO in the context of WSNs, which are intended to provide useful\nguidelines for researchers to understand the referenced literature. Finally, we\ndiscuss a range of open problems to be tackled by future research.\n", "versions": [{"version": "v1", "created": "Tue, 13 Sep 2016 22:48:15 GMT"}], "update_date": "2017-08-15", "authors_parsed": [["Fei", "Zesong", ""], ["Li", "Bin", ""], ["Yang", "Shaoshi", ""], ["Xing", "Chengwen", ""], ["Chen", "Hongbin", ""], ["Hanzo", "Lajos", ""]]}, {"id": "1609.04180", "submitter": "Philippe Robert S.", "authors": "Philippe Robert and Amandine V\\'eber", "title": "A Scaling Analysis of a Star Network with Logarithmic Weights", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper investigates the properties of a class of resource allocation\nalgorithms for communication networks: if a node of this network has $x$\nrequests to transmit, then it receives a fraction of the capacity proportional\nto $\\log(1{+}L)$, the logarithm of its current load $L$. A stochastic model of\nsuch an algorithm is investigated in the case of the star network, in which $J$\nnodes can transmit simultaneously, but interfere with a central node $0$ in\nsuch a way that node $0$ cannot transmit while one of the other nodes does. One\nstudies the impact of the log policy on these $J+1$ interacting communication\nnodes. A fluid scaling analysis of the network is derived with the scaling\nparameter $N$ being the norm of the initial state. It is shown that the\nasymptotic fluid behaviour of the system is a consequence of the evolution of\nthe state of the network on a specific time scale $(N^t,\\, t{\\in}(0,1))$. The\nmain result is that, on this time scale and under appropriate conditions, the\nstate of a node with index $j\\geq 1$ is of the order of $N^{a_j(t)}$, with\n$0{\\leq}a_j(t){<}1$, where $t\\mapsto a_j(t)$ is a piecewise linear function.\nConvergence results on the fluid time scale and a stability property are\nderived as a consequence of this study.\n", "versions": [{"version": "v1", "created": "Wed, 14 Sep 2016 09:06:10 GMT"}], "update_date": "2016-09-15", "authors_parsed": [["Robert", "Philippe", ""], ["Véber", "Amandine", ""]]}, {"id": "1609.04197", "submitter": "Albert Sunny", "authors": "Albert Sunny, Sumankumar Panchal, Nikhil Vidhani, Subhashini\n  Krishnasamy, S.V.R. Anand, Malati Hegde, Joy Kuri, Anurag Kumar", "title": "ADWISERv2: A Plug-and-play Controller for Managing TCP Transfers in\n  IEEE~802.11 Infrastructure WLANs with Multiple Access Points", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a generic plug-and-play controller that ensures\nfair and efficient operation of IEEE~802.11 infrastructure wireless local area\nnetworks with multiple co-channel access points, without any change to\nhardware/firmware of the network devices. Our controller addresses performance\nissues of TCP transfers in multi-AP WLANs, by overlaying a coarse time-slicing\nscheduler on top of a cascaded fair queuing scheduler. The time slices and\nqueue weights, used in our controller, are obtained from the solution of a\nconstrained utility optimization formulation. A study of the impact of coarse\ntime-slicing on TCP is also presented in this paper. We present an improved\nalgorithm for adaptation of the service rate of the fair queuing scheduler and\nprovide experimental results to illustrate its efficacy. We also present the\nchanges that need to be incorporated to the proposed approach, to handle\nshort-lived and interactive TCP flows. Finally, we report the results of\nexperiments performed on a real testbed, demonstrating the efficacy of our\ncontroller.\n", "versions": [{"version": "v1", "created": "Wed, 14 Sep 2016 10:07:06 GMT"}], "update_date": "2016-09-15", "authors_parsed": [["Sunny", "Albert", ""], ["Panchal", "Sumankumar", ""], ["Vidhani", "Nikhil", ""], ["Krishnasamy", "Subhashini", ""], ["Anand", "S. V. R.", ""], ["Hegde", "Malati", ""], ["Kuri", "Joy", ""], ["Kumar", "Anurag", ""]]}, {"id": "1609.04214", "submitter": "Shujun Li Dr.", "authors": "Aamo Iorliam, Santosh Tirunagari, Anthony T.S. Ho, Shujun Li, Adrian\n  Waller and Norman Poh", "title": "\"Flow Size Difference\" Can Make a Difference: Detecting Malicious TCP\n  Network Flows Based on Benford's Law", "comments": "13 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Statistical characteristics of network traffic have attracted a significant\namount of research for automated network intrusion detection, some of which\nlooked at applications of natural statistical laws such as Zipf's law,\nBenford's law and the Pareto distribution. In this paper, we present the\napplication of Benford's law to a new network flow metric \"flow size\ndifference\", which have not been studied before by other researchers, to build\nan unsupervised flow-based intrusion detection system (IDS). The method was\ninspired by our observation on a large number of TCP flow datasets where normal\nflows tend to follow Benford's law closely but malicious flows tend to deviate\nsignificantly from it. The proposed IDS is unsupervised, so it can be easily\ndeployed without any training. It has two simple operational parameters with a\nclear semantic meaning, allowing the IDS operator to set and adapt their values\nintuitively to adjust the overall performance of the IDS. We tested the\nproposed IDS on two (one closed and one public) datasets, and proved its\nefficiency in terms of AUC (area under the ROC curve). Our work showed the\n\"flow size difference\" has a great potential to improve the performance of any\nflow-based network IDSs.\n", "versions": [{"version": "v1", "created": "Wed, 14 Sep 2016 10:51:00 GMT"}, {"version": "v2", "created": "Fri, 20 Jan 2017 18:22:47 GMT"}], "update_date": "2017-01-23", "authors_parsed": [["Iorliam", "Aamo", ""], ["Tirunagari", "Santosh", ""], ["Ho", "Anthony T. S.", ""], ["Li", "Shujun", ""], ["Waller", "Adrian", ""], ["Poh", "Norman", ""]]}, {"id": "1609.04521", "submitter": "Yaniv Ben-Itzhak", "authors": "Yaniv Ben-Itzhak, Cosmin Caba, Liran Schour, Shay Vargaftik", "title": "C-Share: Optical Circuits Sharing for Software-Defined Data-Centers", "comments": null, "journal-ref": null, "doi": "10.1145/3390251.3390253", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Integrating optical circuit switches in data-centers is an on-going research\nchallenge. In recent years, state-of-the-art solutions introduce hybrid\npacket/circuit architectures for different optical circuit switch technologies,\ncontrol techniques, and traffic rerouting methods. These solutions are based on\nseparated packet and circuit planes which do not have the ability to utilize an\noptical circuit with flows that do not arrive from or delivered to switches\ndirectly connected to the circuit's end-points. Moreover, current SDN-based\nelephant flow rerouting methods require a forwarding rule for each flow, which\nraise scalability issues. In this paper, we present C-Share -- a practical,\nscalable SDN-based circuit sharing solution for data center networks. C-Share\ninherently enable elephant flows to share optical circuits by exploiting a flat\nupper tier network topology. C-Share is based on a scalable and decoupled\nSDN-based elephant flow rerouting method comprised of elephant flow detection,\ntagging and identification, which is utilized by using a prevalent network\nsampling method (e.g., sFlow). C-Share requires only a single OpenFlow rule for\neach optical circuit, and therefore significantly reduces the required OpenFlow\nrule entry footprint and setup rule rate. It also mitigates the OpenFlow\noutbound latency for subsequent elephant flows. We implement a proof-of-concept\nsystem for C-Share based on Mininet, and test the scalability of C-Share by\nusing an event driven simulation. Our results show a consistent increase in the\nmice/elephant flow separation in the network which, in turn, improves both\nnetwork throughput and flow completion time.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 06:36:52 GMT"}], "update_date": "2020-09-01", "authors_parsed": [["Ben-Itzhak", "Yaniv", ""], ["Caba", "Cosmin", ""], ["Schour", "Liran", ""], ["Vargaftik", "Shay", ""]]}, {"id": "1609.04552", "submitter": "Felix Weinrank", "authors": "Felix Weinrank, Irene R\\\"ungeler, Michael T\\\"uxen, Erwin Rathgeb", "title": "SCTP User Message Interleaving Integration and Validation", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/01", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Stream Control Transmission Protocol (SCTP) is a connection and message\noriented transport protocol. It supports multiple uni-directional streams in\neach direction allowing user message sequence preservation within each stream.\nThis minimizes the re-sequencing delay at the receiver side in case of message\nloss. The base protocol, although being optimized for small messages, supports\narbitrary large user messages by using fragmentation and reassembly at the cost\nof adding delays at the sender side. To overcome this limitation, a protocol\nextension called User Message Interleaving is currently being specified by the\nInternet Engineering Task Force (IETF). This paper describes the new extension,\nits integration and validation in the context of the INET framework.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 09:44:28 GMT"}], "update_date": "2016-09-16", "authors_parsed": [["Weinrank", "Felix", ""], ["Rüngeler", "Irene", ""], ["Tüxen", "Michael", ""], ["Rathgeb", "Erwin", ""]]}, {"id": "1609.04553", "submitter": "Atheer Al-Rubaye", "authors": "Atheer Al-Rubaye, Ariel Aguirre, Jochen Seitz", "title": "Enabling Soft Vertical Handover for MIPv6 in OMNeT++", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/02", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Switching connectivity over multiple wireless interfaces of a mobile node is\nessential when performing handover between heterogeneous networks. In such a\ncommunication scenario, session continuity as experienced by the user can be\nenhanced if soft handover is enabled through the concept of make-before-break.\nHowever, some of the available networking protocols need to be modified to\nsupport this feature. This work gives an insight into the supplementary modules\nwe implemented and the modification conducted in MIPv6 model of OMNeT++ to\nfacilitate soft handover and data offloading for mobile nodes.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 09:45:05 GMT"}], "update_date": "2016-09-16", "authors_parsed": [["Al-Rubaye", "Atheer", ""], ["Aguirre", "Ariel", ""], ["Seitz", "Jochen", ""]]}, {"id": "1609.04554", "submitter": "Marco Tiloca", "authors": "Marco Tiloca, Alexandra Stagkopoulou, Gianluca Dini", "title": "Performance and Security Evaluation of SDN Networks in OMNeT++/INET", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/03", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Software Defined Networking (SDN) has been recently introduced as a new\ncommunication paradigm in computer networks. By separating the control plane\nfrom the data plane and entrusting packet forwarding to straightforward\nswitches, SDN makes it possible to deploy and run networks which are more\nflexible to manage and easier to configure. This paper describes a set of\nextensions for the INET framework, which allow researchers and network\ndesigners to simulate SDN architectures and evaluate their performance and\nsecurity at design time. Together with performance evaluation and design\noptimization of SDN networks, our extensions enable the simulation of SDN-based\nanomaly detection and mitigation techniques, as well as the quantitative\nevaluation of cyber-physical attacks and their impact on the network and\napplication. This work is an ongoing research activity, and we plan to propose\nit for an official contribution to the INET framework.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 09:46:32 GMT"}], "update_date": "2016-09-16", "authors_parsed": [["Tiloca", "Marco", ""], ["Stagkopoulou", "Alexandra", ""], ["Dini", "Gianluca", ""]]}, {"id": "1609.04604", "submitter": "Syphax Iskounen", "authors": "Syphax Iskounen, Thi Mai Trang Nguyen, Sebastien Monnet", "title": "WiFi-Direct Simulation for INET in OMNeT++", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/06", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wi-Fi Direct is a popular wireless technology which is integrated in most of\ntoday's smartphones and tablets. This technology allows a set of devices to\ndynamically negotiate and select a group owner which plays the role access\npoint. This important feature is the strength of Wi-Fi Direct and makes it more\nand more widely used in telecommunications networks. In this paper, we present\nthe implementation of Wi-Fi Direct in the INET framework of OMNeT++. We have\nimplemented the main procedures of Wi-Fi Direct such as discovery, negotiation\nand group formation. The implementation has been validated by two test\nscenarios which show the conformity of the implementation to the protocol\nspecification.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 12:42:08 GMT"}], "update_date": "2016-09-16", "authors_parsed": [["Iskounen", "Syphax", ""], ["Nguyen", "Thi Mai Trang", ""], ["Monnet", "Sebastien", ""]]}, {"id": "1609.04735", "submitter": "Bruno Silvestre", "authors": "Vinicius N. Medeiros, Douglas V. Santana, Bruno Silvestre, Vinicius da\n  C. M. Borges", "title": "RALL - Routing-Aware Of Path Length, Link Quality, And Traffic Load For\n  Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": "10.1145/3019612.3019730", "report-no": null, "categories": "cs.NI cs.DS", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Due to the enormous variety of application scenarios and ubiquity,Internet of\nThings (IoT) brought a new perspective of applications for the current and\nfuture Internet. The Wireless Sensor Networks provide key devices for\ndeveloping the IoT communication paradigm, such as the sensors collecting\nvarious kind of information and the routing and MAC protocols. However, this\ntype of network has strong power consumption and transmission capacity\nrestrictions (low speed wireless links and subject to interference). In this\ncontext, it is necessary to develop solutions that enable a more efficient\ncommunication based on the optimized utilization of the network resources. This\npapers aims to present a multi-objective routing algorithm, named Routing-Aware\nof path Length, Link quality, and traffic Load (RALL), that seeks to balance\nthree objectives: to minimize bottlenecks, to minimize path length, and to\navoid links with low quality. RALL results in good performance when taking into\nconsideration delivery rate, overhead, delay, and power consumption.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 16:59:05 GMT"}], "update_date": "2017-06-19", "authors_parsed": [["Medeiros", "Vinicius N.", ""], ["Santana", "Douglas V.", ""], ["Silvestre", "Bruno", ""], ["Borges", "Vinicius da C. M.", ""]]}, {"id": "1609.04844", "submitter": "Claudio Casetti Prof.", "authors": "Senay Semu Tadesse, Claudio Casetti, Carla Fabiana Chiasserini", "title": "Energy-efficient Traffic Allocation in SDN-based Backhaul Networks:\n  Theory and Implementation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  5G networks are expected to be highly energy efficient, with a 10 times lower\nconsumption than today's systems. An effective way to achieve such a goal is to\nact on the backhaul network by controlling the nodes operational state and the\nallocation of traffic flows. To this end, in this paper we formulate\nenergy-efficient flow routing on the backhaul network as an optimization\nproblem. In light of its complexity, which impairs the solution in large-scale\nscenarios, we then propose a heuristic approach. Our scheme, named EMMA, aims\nto both turn off idle nodes and concentrate traffic on the smallest possible\nset of links, which in its turn increases the number of idle nodes. We\nimplement EMMA on top of ONOS and derive experimental results by emulating the\nnetwork through Mininet. Our results show that EMMA provides excellent energy\nsaving performance, which closely approaches the optimum. In larger network\nscenarios, the gain in energy consumption that EMMA provides with respect to\nthe simple benchmark where all nodes are active, is extremely high, reaching\nalmost 1 under medium-low traffic load.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 20:19:39 GMT"}], "update_date": "2016-09-19", "authors_parsed": [["Tadesse", "Senay Semu", ""], ["Casetti", "Claudio", ""], ["Chiasserini", "Carla Fabiana", ""]]}, {"id": "1609.04906", "submitter": "Ireneusz Szcze\\'sniak", "authors": "Ireneusz Szcze\\'sniak, Artur Gola, Andrzej Jajszczyk, Andrzej R. Pach,\n  and Bo\\.zena Wo\\'zna-Szcze\\'sniak", "title": "Itinerant routing in elastic optical networks", "comments": "submitted for publication to an IEEE journal", "journal-ref": "Journal of Lightwave Technology, volume: 35, issue: 10, May 15,\n  2017", "doi": "10.1109/JLT.2017.2674182", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We state a new problem of \\emph{itinerant routing} in elastic optical\nnetworks, which we define as the establishment and reconfiguration of an\n\\emph{itinerant connection}. In an itinerant connection, one of the connection\nend nodes is allowed to change. Itinerant routing could also be considered a\nform of connection restoration, where a connection has to be restored to a\ndifferent end node. With the introduction of new mobile-network architectures,\nthe progressing integration of wireless and optical networks, the continuing\ngrowth of wireless high-bitrate services, and the eventual deployment of\nelastic optical networks, there is a need to support this itinerant routing in\nthe elastic optical networks. We present and discuss two major use cases of the\nitinerant routing, and propose a \\emph{novel reconfiguration algorithm}. Our\nalgorithm does not deteriorate the network performance, and requires half as\nmany new links to configure as the shortest-path reconfiguration algorithm. The\nperformance evaluation was carried out with 46800 simulation runs using\nrandomly-generated realistic transport networks.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2016 03:58:27 GMT"}], "update_date": "2017-12-18", "authors_parsed": [["Szcześniak", "Ireneusz", ""], ["Gola", "Artur", ""], ["Jajszczyk", "Andrzej", ""], ["Pach", "Andrzej R.", ""], ["Woźna-Szcześniak", "Bożena", ""]]}, {"id": "1609.05173", "submitter": "Antonio Virdis", "authors": "Giovanni Nardini, Antonio Virdis, Giovanni Stea", "title": "Simulating device-to-device communications in OMNeT++ with SimuLTE:\n  scenarios and configurations", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/07", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  SimuLTE is a tool that enables system-level simulations of LTE/LTE-Advanced\nnetworks within OMNeT++. It is designed such that it can be plugged within\nnetwork elements as an additional Network Interface Card (NIC) to those already\nprovided by the INET framework (e.g. Wi-Fi). Recently, device-to-device (D2D)\ntechnology has been widely studied by the research community, as a mechanism to\nallow direct communications between devices of a LTE cellular network. In this\nwork, we present how SimuLTE can be employed to simulate both one-to-one and\none-to-many D2D communications, so that the latter can be exploited as a new\ncommunication opportunity in several research fields, like vehicular networks,\nIoT and machine-to-machine (M2M) applications.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2016 18:50:01 GMT"}], "update_date": "2016-09-19", "authors_parsed": [["Nardini", "Giovanni", ""], ["Virdis", "Antonio", ""], ["Stea", "Giovanni", ""]]}, {"id": "1609.05179", "submitter": "Philipp Meyer", "authors": "Till Steinbach, Philipp Meyer, Stefan Buschmann, Franz Korf", "title": "Extending OMNeT++ Towards a Platform for the Design of Future In-Vehicle\n  Network Architectures", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/08", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In-vehicle communication technologies are evolving. While today's cars are\nequipped with fieldbusses to interconnect the various electronic control units,\nnext generation vehicles have timing and bandwidth requirements that exceed the\ncapacities. In particular Advanced Driver Assistance Systems (ADAS) and\nautomated driving using high bandwidth sensors such as cameras, LIDAR or radar\nwill challenge the in-car network. Automotive Ethernet is the most promising\ncandidate to solve the upcoming challenges. But to design and evaluate new\nprotocols, concepts, and architectures suitable analysis tools are required.\nEspecially in the interim period with architectures using automotive Ethernet\nand legacy fieldbusses together, careful planning and design is of vital\nimportance. Simulation can provide a good understanding of the expectable\nnetwork metrics in an early development phase. This paper contributes a\nworkflow as well as the required toolchain to evaluate new real-time Ethernet\ncommunication architectures using event based simulation in OMNeT++. We\nintroduce a domain specific language (DSL) - the Abstract Network Description\nLanguage (ANDL) - to describe and configure the simulation and present the\nrequired simulation models for real-time Ethernet and fieldbus technologies\nsuch as CAN and FlexRay. We further introduce new analysis tools for special\nin-vehicle network use-cases and the interaction of the simulation with\nthird-party applications established in the automotive domain.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2016 19:04:47 GMT"}], "update_date": "2016-09-19", "authors_parsed": [["Steinbach", "Till", ""], ["Meyer", "Philipp", ""], ["Buschmann", "Stefan", ""], ["Korf", "Franz", ""]]}, {"id": "1609.05198", "submitter": "Kyeong Soo Kim", "authors": "Kyeong Soo Kim", "title": "Stacked-VLAN-Based Modeling of Hybrid ISP Traffic Control Schemes and\n  Service Plans Exploiting Excess Bandwidth in Shared Access Networks", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/10", "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current practice of shaping subscriber traffic using a token bucket\nfilter by Internet service providers may result in a severe waste of network\nresources in shared access networks; except for a short period of time\nproportional to the size of a token bucket, it cannot allocate excess bandwidth\namong active subscribers even when there are only a few active subscribers. To\nbetter utilize the network resources in shared access networks, therefore, we\nrecently proposed and analyzed the performance of access traffic control\nschemes, which can allocate excess bandwidth among active subscribers\nproportional to their token generation rates. Also, to exploit the excess\nbandwidth allocation enabled by the proposed traffic control schemes, we have\nbeen studying flexible yet practical service plans under a hybrid traffic\ncontrol architecture, which are attractive to both an Internet service provider\nand its subscribers in terms of revenue and quality of service. In this paper\nwe report the current status of our modeling of the hybrid traffic control\nschemes and service plans with OMNeT++/INET-HNRL based on IEEE standard 802.1Q\nstacked VLANs.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2016 19:52:29 GMT"}], "update_date": "2016-09-19", "authors_parsed": [["Kim", "Kyeong Soo", ""]]}, {"id": "1609.05199", "submitter": "Asanga Udugama", "authors": "Asanga Udugama, Behruz Khalilov, Anas Bin Muslim, Anna F\\\"orster", "title": "Implementation of the SWIM Mobility Model in OMNeT++", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/12", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT) is expected to grow into billions of devices in\nthe near future. Evaluating mechanisms such as networking architectures for\ncommunications in the IoT require the use of simulators due to the scale of the\nsize of networks. Mobility is one of the key aspects that need to be evaluated\nwhen considering the different scenarios of the IoT. Small Worlds in Motion\n(SWIM) is a mobility model that mathematically characterises the movement\npatterns of humans. The work presented in this paper details the development\nand verification of the SWIM mobility model in the OMNeT++ simulator.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2016 19:56:31 GMT"}], "update_date": "2016-09-19", "authors_parsed": [["Udugama", "Asanga", ""], ["Khalilov", "Behruz", ""], ["Muslim", "Anas Bin", ""], ["Förster", "Anna", ""]]}, {"id": "1609.05215", "submitter": "Vladimir Vesely", "authors": "Vladim\\'ir Vesel\\'y, V\\'it Rek, Ond\\v{r}ej Ry\\v{s}av\\'y", "title": "Babel Routing Protocol for OMNeT++ - More than just a new simulation\n  module for INET framework", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/13", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Routing and switching capabilities of computer networks seem as the closed\nenvironment containing a limited set of deployed protocols, which nobody dares\nto change. The majority of wired network designs are stuck with OSPF\n(guaranteeing dynamic routing exchange on network layer) and RSTP (securing\nloop-free data-link layer topology). Recently, more use-case specific routing\nprotocols, such as Babel, have appeared. These technologies claim to have\nbetter characteristic than current industry standards. Babel is a fresh\ncontribution to the family of distance-vector routing protocols, which is\ngaining its momentum for small double-stack (IPv6 and IPv4) networks. This\npaper briefly describes Babel behavior and provides details on its\nimplementation in OMNeT++ discrete event simulator.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2016 20:00:18 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Veselý", "Vladimír", ""], ["Rek", "Vít", ""], ["Ryšavý", "Ondřej", ""]]}, {"id": "1609.05256", "submitter": "Kemal Davaslioglu Kemal Davaslioglu", "authors": "Kemal Davaslioglu, Yang Liu, and Richard D. Gitlin", "title": "CLOEE - Cross-Layer Optimization for Energy Efficiency of IEEE 802.15.6\n  IR-UWB WBANs", "comments": "IEEE Global Communications Conference, Ad Hoc and Sensor Networks,\n  December 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in sensor networks enable pervasive health monitoring and\npatient-specific treatments that take into account the patients medical\nhistory, current state, genetic background, and personal habits. However,\nsensors are often battery power limited and vastly differ in their application\nrelated requirements. In this paper, we address both of these problems.\nSpecifically, we study IEEE 802.15.6 ultra-wideband (UWB) wireless body area\nnetworks (WBANs) that use impulse radio (IR). We formulate the joint\noptimization of the payload size and number of pulses per symbol to optimize\nthe energy efficiency under the minimum rate constraint. The proposed\nalgorithm, cross-layer optimization for energy efficiency (CLOEE), enables us\nto carry out a cross-layer resource allocation that addresses the rate and\nreliability trade-off in the physical (PHY) layer as well as the packet size\noptimization and transmission efficiency for the medium access control (MAC)\nlayer. Simulation results demonstrate that CLOEE can provide an order of\nmagnitude improvement in to static strategies.\n", "versions": [{"version": "v1", "created": "Sat, 17 Sep 2016 00:02:47 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Davaslioglu", "Kemal", ""], ["Liu", "Yang", ""], ["Gitlin", "Richard D.", ""]]}, {"id": "1609.05351", "submitter": "Benjamin Sliwa", "authors": "Benjamin Sliwa, Christoph Ide, Christian Wietfeld", "title": "An OMNeT++ based Framework for Mobility-aware Routing in Mobile Robotic\n  Networks", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/11", "categories": "cs.NI cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a cross-layer extension for the INETMANET framework\nof OMNeT++, which utilizes mobility control knowledge to enhance the forwarding\nof routing messages. The well-known mobility meta-model from Reynolds is used\nto provide a realistic representation of the mobility behavior of autonomous\nagents with respect to the various influences those agents have to face in\nreal-world applications. Knowledge about the current mobility properties and\nits predicted development is used by mobility-aware routing mechanisms in order\nto optimize routing decisions and avoid path losses at runtime. In a proof of\nconcept evaluation, we show that our proposed methods can achieve significant\nimprovements to the robustness of communication paths.\n", "versions": [{"version": "v1", "created": "Sat, 17 Sep 2016 15:21:21 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Sliwa", "Benjamin", ""], ["Ide", "Christoph", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1609.05362", "submitter": "Seongah Jeong", "authors": "Seongah Jeong and Osvaldo Simeone and Joonhyuk Kang", "title": "Mobile Edge Computing via a UAV-Mounted Cloudlet: Optimization of Bit\n  Allocation and Path Planning", "comments": "14 pages, 5 figures, 2 tables, IEEE Transactions on Vehicular\n  Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unmanned Aerial Vehicles (UAVs) have been recently considered as means to\nprovide enhanced coverage or relaying services to mobile users (MUs) in\nwireless systems with limited or no infrastructure. In this paper, a UAV-based\nmobile cloud computing system is studied in which a moving UAV is endowed with\ncomputing capabilities to offer computation offloading opportunities to MUs\nwith limited local processing capabilities. The system aims at minimizing the\ntotal mobile energy consumption while satisfying quality of service\nrequirements of the offloaded mobile application. Offloading is enabled by\nuplink and downlink communications between the mobile devices and the UAV that\ntake place by means of frequency division duplex (FDD) via orthogonal or\nnon-orthogonal multiple access (NOMA) schemes. The problem of jointly\noptimizing the bit allocation for uplink and downlink communication as well as\nfor computing at the UAV, along with the cloudlet's trajectory under latency\nand UAV's energy budget constraints is formulated and addressed by leveraging\nsuccessive convex approximation (SCA) strategies. Numerical results demonstrate\nthe significant energy savings that can be accrued by means of the proposed\njoint optimization of bit allocation and cloudlet's trajectory as compared to\nlocal mobile execution as well as to partial optimization approaches that\ndesign only the bit allocation or the cloudlet's trajectory.\n", "versions": [{"version": "v1", "created": "Sat, 17 Sep 2016 16:41:25 GMT"}, {"version": "v2", "created": "Tue, 21 Mar 2017 16:14:42 GMT"}, {"version": "v3", "created": "Thu, 18 May 2017 17:42:50 GMT"}], "update_date": "2017-05-19", "authors_parsed": [["Jeong", "Seongah", ""], ["Simeone", "Osvaldo", ""], ["Kang", "Joonhyuk", ""]]}, {"id": "1609.05503", "submitter": "Michael Azmy", "authors": "Yaser A. Elnakieb, Michael Azmy and Mustafa ElNainay", "title": "Genetic Algorithm-based Mapper to Support Multiple Concurrent Users on\n  Wireless Testbeds", "comments": "IEEE Wireless Communications and Networking Conference (WCNC) 2016", "journal-ref": null, "doi": "10.1109/WCNC.2016.7564763", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Communication and networking research introduces new protocols and standards\nwith an increasing number of researchers relying on real experiments rather\nthan simulations to evaluate the performance of their new protocols. A number\nof testbeds are currently available for this purpose and a growing number of\nusers are requesting access to those testbeds. This motivates the need for\nbetter utilization of the testbeds by allowing concurrent experimentations. In\nthis work, we introduce a novel mapping algorithm that aims to maximize\nwireless testbed utilization using frequency slicing of the spectrum resources.\nThe mapper employs genetic algorithm to find the best combination of requests\nthat can be served concurrently, after getting all possible mappings of each\nrequest via an induced sub-graph isomorphism stage. The proposed mapper is\ntested on grid testbeds and randomly generated topologies. The solution of our\nmapper is compared to the optimal one, obtained through a brute-force search,\nand was able to serve the same number of requests in 82.96% of testing\nscenarios. Furthermore, we show the effect of the careful design of testbed\ntopology on enhancing the testbed utilization by applying our mapper on a\ncarefully positioned 8-nodes testbed. In addition, our proposed approach for\ntestbed slicing and requests mapping has shown an improved performance in terms\nof total served requests, about five folds, compared to the simple allocation\npolicy with no slicing.\n", "versions": [{"version": "v1", "created": "Sun, 18 Sep 2016 15:46:58 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Elnakieb", "Yaser A.", ""], ["Azmy", "Michael", ""], ["ElNainay", "Mustafa", ""]]}, {"id": "1609.05670", "submitter": "Praful Mankar Dr.", "authors": "Praful D. Mankar, Goutam Das, and S. S. Pathak", "title": "Load-aware Performance Analysis of Cell Center/Edge Users in Random\n  HetNets", "comments": "13 pages and 11 figures. This paper is submitted to IEEE Transaction\n  on Vehicular Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For real-time traffic, the link quality and call blocking probability (both\nderived from coverage probability) are realized to be poor for cell edge users\n(CEUs) compared to cell center users (CCUs) as the signal reception in the cell\ncenter region is better compared to the cell edge region. In heterogeneous\nnetworks (HetNets), the uncoordinated channel access by different types of base\nstations determine the interference statistics that further arbitrates the\ncoverage probability. Thus, the spectrum allocation techniques have major\nimpact on the performance of CCU and CEU. In this paper, the performance of\nCCUs and CEUs in a random two-tier network is studied for two spectrum\nallocation techniques namely: 1) co-channel (CSA), and 2) shared (SSA). For\nperformance analysis, the widely accepted conception of modeling the tiers of\nHetNet using independent homogeneous Poisson point process (PPP) is considered\nto accommodate the spatial randomness in location of BSs. To incorporate the\nspatial randomness in the arrival of service and to aid the load-aware\nanalysis, the cellular traffic is modeled using spatio-temporal PPP. Under this\nscenario, we have developed an analytical framework to evaluate the load-aware\nperformance, including coverage and blocking probabilities, of CCUs and CEUs\nunder both spectrum allocation techniques. Further, we provide insight into\nachievable area energy efficiency for SSA and CSA. The developed analytical\nframework is validated through extensive simulations. Next, we demonstrate the\nimpact of traffic load and femto access points density on the performance of\nCCUs/CEUs under CSA and SSA.\n", "versions": [{"version": "v1", "created": "Mon, 19 Sep 2016 11:32:12 GMT"}, {"version": "v2", "created": "Thu, 9 Mar 2017 11:16:40 GMT"}], "update_date": "2017-03-10", "authors_parsed": [["Mankar", "Praful D.", ""], ["Das", "Goutam", ""], ["Pathak", "S. S.", ""]]}, {"id": "1609.05702", "submitter": "Pavlos Sermpezis", "authors": "Pavlos Sermpezis, Gavriil Chaviaras, Petros Gigis, and Xenofontas\n  Dimitropoulos", "title": "Monitor, Detect, Mitigate: Combating BGP Prefix Hijacking in Real-Time\n  with ARTEMIS", "comments": null, "journal-ref": "In Proceedings of the ACM SIGCOMM 2016 Conference (SIGCOMM '16),\n  625-626", "doi": "10.1145/2934872.2959078", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Border Gateway Protocol (BGP) is globally used by Autonomous Systems\n(ASes) to establish route paths for IP prefixes in the Internet. Due to the\nlack of authentication in BGP, an AS can hijack IP prefixes owned by other ASes\n(i.e., announce illegitimate route paths), impacting thus the Internet routing\nsystem and economy. To this end, a number of hijacking detection systems have\nbeen proposed. However, existing systems are usually third party services that\n-inherently- introduce a significant delay between the hijacking detection (by\nthe service) and its mitigation (by the network administrators). To overcome\nthis shortcoming, in this paper, we propose ARTEMIS, a tool that enables an AS\nto timely detect hijacks on its own prefixes, and automatically proceed to\nmitigation actions. To evaluate the performance of ARTEMIS, we conduct real\nhijacking experiments. To our best knowledge, it is the first time that a\nhijacking detection/mitigation system is evaluated through extensive\nexperiments in the real Internet. Our results (a) show that ARTEMIS can detect\n(mitigate) a hijack within a few seconds (minutes) after it has been launched,\nand (b) demonstrate the efficiency of the different control-plane sources used\nby ARTEMIS, towards monitoring routing changes.\n", "versions": [{"version": "v1", "created": "Mon, 19 Sep 2016 13:04:18 GMT"}], "update_date": "2016-11-09", "authors_parsed": [["Sermpezis", "Pavlos", ""], ["Chaviaras", "Gavriil", ""], ["Gigis", "Petros", ""], ["Dimitropoulos", "Xenofontas", ""]]}, {"id": "1609.05708", "submitter": "Eric Rondeau", "authors": "Mohammad Habibullah Khan (UL), Eric Rondeau (UL, CRAN), Jean-Philippe\n  Georges (CRAN, UL)", "title": "Reducing energy consumption of network infrastructure using spectral\n  approach", "comments": "International Sustainable Ecological Engineering Design for Society\n  (SEEDS) Conference, Sep 2016, Leeds, United Kingdom", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The energy consumption by ICT (Information and Communication Technology)\nequipment is rapidly increasing which causes a significant economic and\nenvironmental problem. At present, the network infrastructure is becoming a\nlarge portion of the energy footprint in ICT. Thus, the concept of energy\nefficient or green networking has been introduced. Now one of the main concerns\nof network industry is to minimize energy consumption of network infrastructure\nbecause of the potential economic benefits, ethical responsibility, and its\nenvironmental impact. In this paper, the energy management strategies to reduce\nthe energy consumed by network switches in LAN (Local Area Network) have been\ndeveloped. According to the life-cycle assessment of network switches, the\nhighest amount of energy is consumed during usage phase. The study considers\nbandwidth, link load and traffic matrices as input parameters which have the\nhighest contribution to energy footprints of network switches during usage\nphase and energy consumption as output. Then with the objective of reducing\nenergy usage of network infrastructure, the feasibility of putting Ethernet\nswitches hibernate or sleep mode was investigated. After that, the network\ntopology was reorganized using clustering method based on the spectral approach\nfor putting network switches to hibernate or switched off mode considering the\ntime and communications among them. Experimental results show the interest in\nthis approach in terms of energy consumption. .\n", "versions": [{"version": "v1", "created": "Mon, 19 Sep 2016 13:18:47 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Khan", "Mohammad Habibullah", "", "UL"], ["Rondeau", "Eric", "", "UL, CRAN"], ["Georges", "Jean-Philippe", "", "CRAN, UL"]]}, {"id": "1609.05710", "submitter": "Eric Rondeau", "authors": "Dimitar Minovski (UL), Eric Rondeau (UL, CRAN), Jean-Philippe Georges\n  (CRAN, UL)", "title": "Monitoring the energy consumed by a network infrastructure to detect and\n  isolate faults in communication architecture", "comments": "International Sustainable Ecological Engineering Design for Society\n  (SEEDS) Conference, Sep 2016, Leeds, United Kingdom. 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, a number of major improvements were introduced in the area\nof computer networks, energy-efficient network protocols and network management\nsystems. Software Defined Networking (SDN) as a new paradigm for managing\ncomplex networks brings a significant opportunity to reduce the energy\nconsumption among ICT. In this paper, we are tackling improvements in the\nprocess of monitoring the states of the networking devices and optimizing the\nexisting solutions. We are monitoring the energy consumption of a network\narchitecture and augment the retrieved raw power data to detect changes in the\nstate of the devices. The goal is to benchmark the difference between the power\ndata fetched from the real-measures and the data extracted from the power\nmodels, translated as the expected behavior of the devices. An application is\ndesigned to monitor and analyze the retrieved power data of a simulated ICT\ninfrastructure composed of Cisco switches and routers, Dell Precision stations\nand Raritan PDUs. Moreover, smart algorithms are developed which outcome\nresults with detection of changes in the state of the devices, as well as with\ndetection and isolation of possible anomalies and their impact on the energy\nconsumption. The application is envisioned to be an extension to the existing\nSDN controllers for monitoring and reporting the changes in the state of the\nICT devices.\n", "versions": [{"version": "v1", "created": "Mon, 19 Sep 2016 13:20:08 GMT"}], "update_date": "2016-09-20", "authors_parsed": [["Minovski", "Dimitar", "", "UL"], ["Rondeau", "Eric", "", "UL, CRAN"], ["Georges", "Jean-Philippe", "", "CRAN, UL"]]}, {"id": "1609.06012", "submitter": "Gyan Tiwary Prakash", "authors": "Gyan Prakash Tiwary, Abhishek Srivastava", "title": "A Novel Approach to Implement Message Level Security in RESTful Web\n  Services", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The world is rapidly adopting RESTful web services for most of its tasks. The\nonce popular SOAP-based web services are fast losing ground owing to this.\nRESTful web services are light weight services without strict message formats.\nRESTful web services, unlike SOAP, are capable of message transfer in any\nformat be it XML, JSON, plain text. However, in spite of these positives,\nensuring message level security in REST is a challenge. Security in RESTful web\nservices is still largely dependent upon transport layer security. There has\nbeen some work recently towards message level security in such environments\nwherein the transfer of message level security metadata is done through\nutilising new HTTP headers. We feel, however, that any method that compromises\nthe generality of the HTTP protocol should be avoided. In this paper,\ntherefore, we propose two new ways of encryption that promise to ensure message\nlevel security in RESTful web services without the need for special HTTP\nheaders. This approach works seamlessly on most famous content-types of RESTful\nweb services: XML, JSON, HTML, plain-text and various ASCII printable content\ntypes. Further, the proposed approach removes the need for content negotiation\nin cases where the content comprises XML, JSON, HTML, plain-text, and ASCII\nprintable content types and also removes the need for XML or JSON\ncanonicalization.\n", "versions": [{"version": "v1", "created": "Tue, 20 Sep 2016 04:03:18 GMT"}], "update_date": "2016-09-21", "authors_parsed": [["Tiwary", "Gyan Prakash", ""], ["Srivastava", "Abhishek", ""]]}, {"id": "1609.06071", "submitter": "Engin Zeydan", "authors": "Omer Narmanlioglu, Engin Zeydan", "title": "Software-Defined Networking Based Network Virtualization for Mobile\n  Operators", "comments": "accepted for publication in Computers & Electrical Engineering\n  Journal (Elsevier) Special Issue on Software-Defined Control for Next\n  Generation Wireless Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Software-Defined Networking (SDN) paradigm provides many features including\nhardware abstraction, programmable networking and centralized policy control.\nOne of the main benefits used along with these features is core/backhaul\nnetwork virtualization which ensures sharing of mobile core and backhaul\nnetworks among Mobile Operators (MOs). In this paper, we propose a virtualized\nSDN-based Evolved Packet System (EPS) cellular network architecture including\ndesign of network virtualization controller. After virtualization of\ncore/backhaul network elements, eNodeBs associated with MOs become a part of\nresource allocation problem for Backhaul Transport Providers (BTPs). We\ninvestigate the performance of our proposed architecture where eNodeBs are\nassigned to the MOs using quality-of-service (QoS)-aware and QoS-unaware\nscheduling algorithms under the consideration of time-varying numbers and\nlocations of user equipments (UEs) through Monte-Carlo simulations. The\nperformances are compared with traditional EPS in Long Term Evolution (LTE)\narchitecture and the results reveal that our proposed architecture outperforms\nthe traditional cellular network architecture.\n", "versions": [{"version": "v1", "created": "Tue, 20 Sep 2016 09:43:29 GMT"}, {"version": "v2", "created": "Sat, 24 Sep 2016 05:58:52 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Narmanlioglu", "Omer", ""], ["Zeydan", "Engin", ""]]}, {"id": "1609.06261", "submitter": "S.M. Riazul Islam PhD", "authors": "S. M. Riazul Islam, Nurilla Avazov, Octavia A. Dobre, and Kyung Sup\n  Kwak", "title": "Power-Domain Non-Orthogonal Multiple Access (NOMA) in 5G Systems:\n  Potentials and Challenges", "comments": "41 pages, 19 figures, IEEE Communications Surveys and Tutorials, 2016", "journal-ref": null, "doi": "10.1109/COMST.2016.2621116", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-orthogonal multiple access (NOMA) is one of the promising radio access\ntechniques for performance enhancement in next-generation cellular\ncommunications. Compared to orthogonal frequency division multiple access\n(OFDMA), which is a well-known high-capacity orthogonal multiple access (OMA)\ntechnique, NOMA offers a set of desirable benefits, including greater spectrum\nefficiency. There are different types of NOMA techniques, including\npower-domain and code-domain. This paper primarily focuses on power-domain NOMA\nthat utilizes superposition coding (SC) at the transmitter and successive\ninterference cancellation (SIC) at the receiver. Various researchers have\ndemonstrated that NOMA can be used effectively to meet both network-level and\nuser-experienced data rate requirements of fifth-generation (5G) technologies.\nFrom that perspective, this paper comprehensively surveys the recent progress\nof NOMA in 5G systems, reviewing the state-of-the-art capacity analysis, power\nallocation strategies, user fairness, and user-pairing schemes in NOMA. In\naddition, this paper discusses how NOMA performs when it is integrated with\nvarious proven wireless communications techniques, such as cooperative\ncommunications, multiple input multiple output (MIMO), beamforming, space time\ncoding, and network coding, among others. Furthermore, this paper discusses\nseveral important issues on NOMA implementation and provides some avenues for\nfuture research.\n", "versions": [{"version": "v1", "created": "Tue, 20 Sep 2016 17:32:35 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Islam", "S. M. Riazul", ""], ["Avazov", "Nurilla", ""], ["Dobre", "Octavia A.", ""], ["Kwak", "Kyung Sup", ""]]}, {"id": "1609.06270", "submitter": "Thiago Teixeira", "authors": "Thiago Teixeira, Cong Wang, Michael Zink", "title": "Can NDN Perform Better than OLSR in Wireless Ad Hoc Networks?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  The emerging paradigm of Information-Centric Networking is an exciting field\nof research, opening opportunities in many areas, such as forwarding\nstrategies, caching placement policies, applications (e.g. video streaming and\ninstant messaging), to name a few. In this paper, we address the mobility\naspect of ICN, as well as how it performs in tactical wireless ad hoc\nenvironments. In this paper, we present results from a simulation study that\ninvestigates the performance of Named Data Networking, an instantiation of ICN,\nin such environments. We perform a series of simulations based on ndnSIM\nstudying different mobility scenarios. Our simulations show that even in the\nshort-term absence of the producer, consumers can still achieve better file\nretrieval when caches are used. As an effort to increase the cache diversity\nand have a better utilization of the Content Store we study probabilistic LRU.\nFurthermore, we compare the performance of our NDN network with a TCP based\napproach, using OLSR routing protocol, discussing advantages and disadvantages\nof each approach.\n", "versions": [{"version": "v1", "created": "Tue, 20 Sep 2016 18:01:07 GMT"}], "update_date": "2016-09-21", "authors_parsed": [["Teixeira", "Thiago", ""], ["Wang", "Cong", ""], ["Zink", "Michael", ""]]}, {"id": "1609.06345", "submitter": "Christoph Ponikwar", "authors": "Christoph Ponikwar", "title": "Entwicklung eines Reputationssystems f\\\"ur cyber-physikalische Systeme\n  am Beispiel des inHMotion Forschungsprojektes", "comments": "Masterthesis, Masterarbeit, 180 Pages, 180 Seiten, in German", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Through the continued progress and advances of networking technology and also\nthrough efforts like Industry 4.0, SmartGrid, SmartCities, systems, that have\nbeen self-sustaining for the most part are now forming networked Cyber-physical\nSystems (CPS). Networking does not only have undoubtely benefits but also\nincrease the often overlooked attack surface of these systems. A basic problem\nin information technology systems is building and sustaining trust. This work\nlooks at the usage of reputation systems in the field of CPS and whether they\ncould be used to assert the trustworthyness of communication partners. This is\ndone in context of a research project inHMotion of the University of applied\nSciences Munich, which is in the field of Intelligent Transportation Systems\n(ITS). A risk based analysis is performed for this project. Based on solicited\nthreats mitigations are proposed. A possible solution might be the usage of a\nreputation system, which is designed and a prototype implementation for a\nsimulation ist done. The concept of a meta reputation system, which combines\ndifferent reputation systems and verification systems can achieve promising\nresults in a simple simulation. In a concluding discussion criticism and\npossible improvements are given.\n", "versions": [{"version": "v1", "created": "Tue, 20 Sep 2016 20:34:05 GMT"}], "update_date": "2016-09-22", "authors_parsed": [["Ponikwar", "Christoph", ""]]}, {"id": "1609.06395", "submitter": "Andrew Eckford", "authors": "S. Alireza Banani, Andrew W. Eckford, and Raviraj S. Adve", "title": "Analyzing Dependent Placements of Small Cells in a Two-Layer\n  Heterogeneous Network with a Rate Coverage Constraint", "comments": "Accepted for publication in IEEE Transactions on Vehicular Technology", "journal-ref": null, "doi": "10.1109/TVT.2016.2522468", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the downlink of a two-layer heterogeneous network, comprising\nmacro cells (MCs) and small cells (SCs). The existing literature generally\nassumes independent placements of the access points (APs) in different layers;\nin contrast, we analyze a dependent placement where SC APs are placed at\nlocations with poor service from the MC layer. Our goal is to obtain an\nestimate of the number of SCs required to maintain a target outage rate. Such\nan analysis is trivial if the MCs are located according to a Poisson point\nprocess (PPP), which provides a lower bound on performance. Here, we consider\nMCs placed on a hexagonal grid, which complements the PPP model by providing an\nupper bound on performance. We first provide accurate bounds for the average\ninterference within a MC when SCs are not used. Then, by obtaining the outage\nareas, we estimate the number of SCs required within an MC to overcome outage.\nIf resource allocation amongst SCs is not used, we show that the problem of\noutage is not solved completely, and the residual outage area depends on\nwhether co-channel or orthogonal SCs are used. Simulations show that a much\nsmaller residual outage area is obtained with orthogonal SCs.\n", "versions": [{"version": "v1", "created": "Wed, 21 Sep 2016 01:19:06 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Banani", "S. Alireza", ""], ["Eckford", "Andrew W.", ""], ["Adve", "Raviraj S.", ""]]}, {"id": "1609.06632", "submitter": "Tao Han", "authors": "Tao Han, Xiaohu Ge, Lijun Wang, Kyung Sup Kwak, Yujie Han, Xiong Liu", "title": "5G Converged Cell-less Communications in Smart Cities", "comments": "18 pages, 5 figures", "journal-ref": "IEEE Communications Magazine, vol. 55, no. 3, pp. 44-50, Mar. 2017", "doi": "10.1109/MCOM.2017.1600256CM", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ubiquitous information service converged by different types of heterogeneous\nnetworks is one of fundamental functions for smart cities. Considering the\ndeployment of 5G ultra-dense wireless networks, the 5G converged cell-less\ncommunication networks are proposed to support mobile terminals in smart\ncities. To break obstacles of heterogeneous wireless networks, the 5G converged\ncell-less communication network is vertically converged in different tiers of\nheterogeneous wireless networks and horizontally converged in celled\narchitectures of base stations/access points. Moreover, the software defined\nnetwork controllers are configured to manage the traffic scheduling and\nresource allocation in 5G converged cell-less communication networks.\nSimulation results indicate the coverage probability and the energy saving at\nboth base stations and mobile terminals are improved by the cooperative\ngrouping scheme in 5G converged cell-less communication networks.\n", "versions": [{"version": "v1", "created": "Wed, 21 Sep 2016 16:49:16 GMT"}, {"version": "v2", "created": "Wed, 15 Mar 2017 06:46:31 GMT"}], "update_date": "2017-03-16", "authors_parsed": [["Han", "Tao", ""], ["Ge", "Xiaohu", ""], ["Wang", "Lijun", ""], ["Kwak", "Kyung Sup", ""], ["Han", "Yujie", ""], ["Liu", "Xiong", ""]]}, {"id": "1609.06678", "submitter": "J\\'eferson Campos Nobre", "authors": "J\\'eferson Campos Nobre and Lisandro Zambenedetti Granville", "title": "Consistency Maintenance of State of Management Data in P2P-based\n  Autonomic Network Management", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Complex Dynamic Networks can be exploited in solving problems where\ntraditional solutions may not be sufficient. The increasing complexity of\ncomputer networks imposes problems to the current network management solutions.\nIn this context, network management is an example of a research area that could\nbenefit from the use of CDNs. However, the consistency of state of management\ndata among the elements that build management CDNs (management nodes) is an\nimportant challenge. Traditional mechanisms to maintain consistency of these\nstates are supported by some centralization which wastes some desirable\nproperties of CDNs (e.g., robustness). In contrast to these mechanisms, we\npropose a distributed, scalable and robust mechanism to maintain the\nconsistency of state of management data in management CDNs. Our mechanism\nintroduces multi-agent truth maintenance features and communication strategies\nbased on dynamic process to provide consistency maintenance of state of\nmanagement data. We developed a model of a management CDN on Peersim simulator\nto perform experiments. Besides, 2 case studies are presented. The result\nobtained supports our scalability and robustness claims.\n", "versions": [{"version": "v1", "created": "Wed, 21 Sep 2016 18:45:32 GMT"}], "update_date": "2016-09-22", "authors_parsed": [["Nobre", "Jéferson Campos", ""], ["Granville", "Lisandro Zambenedetti", ""]]}, {"id": "1609.06771", "submitter": "Wolfgang Wallner", "authors": "Wolfgang Wallner", "title": "Simulation of the IEEE 1588 Precision Time Protocol in OMNeT++", "comments": "Published in: A. Foerster, V. Vesely, A. Virdis, M. Kirsche (Eds.),\n  Proc. of the 3rd OMNeT++ Community Summit, Brno University of Technology -\n  Czech Republic - September 15-16, 2016", "journal-ref": null, "doi": null, "report-no": "OMNET/2016/09", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real-time systems rely on a distributed global time base. As any physical\nclock device suffers from noise, it is necessary to provide some kind of clock\nsynchronization to establish such a global time base. Different clock\nsynchronization methods have been invented for individual application domains.\nThe Precision Time Protocol (PTP), which is specified in IEEE 1588, is another\ninteresting option. It targets local networks, where it is acceptable to assume\nsmall amounts of hardware support, and promises sub-microsecond precision. PTP\nprovides many different implementation and configuration options, and thus the\nDesign Space Exploration (DSE) is challenging. In this paper we discuss the\nimplementation of realistic clock noise and its synchronization via PTP in\nOMNeT++. The components presented in this paper are intended to assist\nengineers with the configuration of PTP networks.\n", "versions": [{"version": "v1", "created": "Wed, 21 Sep 2016 22:43:29 GMT"}], "update_date": "2016-09-23", "authors_parsed": [["Wallner", "Wolfgang", ""]]}, {"id": "1609.06862", "submitter": "Gewu Bu", "authors": "Gewu Bu (LIP6, NPA), Maria Potop-Butucaru (LIP6, NPA)", "title": "Total Order Reliable Convergecast in WBAN", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is the first extensive work on total order reliable convergecast\nin multi-hop Wireless Body Area Networks (WBAN). Convergecast is a many-to-one\ncooperative scheme where each node of the network transmits data towards the\nsame sink. Our contribution is threefold. First, we stress existing WBAN\nconvergecast strategies with respect to their capacity to be reliable and to\nensure the total order delivery at sink. That is, packets sent in a specific\norder should be received in the same order by the sink. When stressed with\ntransmission rates up to 500 packets per second the performances of these\nstrategies decrease dramatically (more than 90% of packets lost). Secondly, we\npropose a new posture-centric model for WBAN. This model offers a good\ncharacterization of the path availability which is further used to fine tune\nthe retransmission rate thresholds. Third, based on our model we propose a new\nmechanism for reliability and a new converge-cast strategy that outperforms\nWBAN dedicated strategies but also strategies adapted from DTN and WSN areas.\nOur extensive performance evaluations use essential parameters for WBAN: packet\nlost, total order reliability (messages sent in a specific order should be\ndelivered in that specific order) and various human body postures. In\nparticular, our strategy ensures zero packet order inversions for various\ntransmission rates and mobility postures. Interestingly, our strategy respects\nthis property without the need of additional energy-guzzler mechanisms.\n", "versions": [{"version": "v1", "created": "Thu, 22 Sep 2016 08:23:46 GMT"}], "update_date": "2016-09-23", "authors_parsed": [["Bu", "Gewu", "", "LIP6, NPA"], ["Potop-Butucaru", "Maria", "", "LIP6, NPA"]]}, {"id": "1609.06888", "submitter": "Sateeshkrishna Dhuli", "authors": "Sateeshkrishna Dhuli, Chakravarthy Gopi, Yatindra Nath Singh", "title": "Analysis of Network Robustness for Finite Sized Wireless Sensor Networks", "comments": "Paper has some fundamental mistakes in calculations. So we would like\n  to withdraw our work from arxiv", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Studying network robustness for wireless sensor networks(WSNs) is an exciting\ntopic of research as sensor nodes often fail due to hardware degradation,\nresource constraints, and environmental changes. The application of spectral\ngraph theory to networked systems has generated several important results.\nHowever, previous research has often failed to consider the network parameters,\nwhich is crucial to study the real network applications. Network criticality is\none of the effective metrics to quantify the network robustness against such\nfailures and attacks. In this work, we derive the exact formulas of network\ncriticality for WSNs using r-nearest neighbor networks and we show the effect\nof nearest neighbors and network dimension on robustness using analytical and\nnumerical evaluations. Furthermore, we also show how symmetric and static\napproximations can wrongly designate the network robustness when implemented to\nWSNs.\n", "versions": [{"version": "v1", "created": "Thu, 22 Sep 2016 09:53:22 GMT"}, {"version": "v2", "created": "Thu, 1 Apr 2021 17:30:32 GMT"}], "update_date": "2021-04-02", "authors_parsed": [["Dhuli", "Sateeshkrishna", ""], ["Gopi", "Chakravarthy", ""], ["Singh", "Yatindra Nath", ""]]}, {"id": "1609.07192", "submitter": "Balajee Vamanan", "authors": "Yiyang Chang, Ashkan Rezaei, Balajee Vamanan, Jahangir Hasan, Sanjay\n  Rao and T. N. Vijaykumar", "title": "Hydra: Leveraging Functional Slicing for Efficient Distributed SDN\n  Controllers", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The conventional approach to scaling Software Defined Networking (SDN)\ncontrollers today is to partition switches based on network topology, with each\npartition being controlled by a single physical controller, running all SDN\napplications. However, topological partitioning is limited by the fact that (i)\nperformance of latency-sensitive (e.g., monitoring) SDN applications associated\nwith a given partition may be impacted by co-located compute-intensive (e.g.,\nroute computation) applications; (ii) simultaneously achieving low convergence\ntime and response times might be challenging; and (iii) communication between\ninstances of an application across partitions may increase latencies. To tackle\nthese issues, in this paper, we explore functional slicing, a complementary\napproach to scaling, where multiple SDN applications belonging to the same\ntopological partition may be placed in physically distinct servers. We present\nHydra, a framework for distributed SDN controllers based on functional slicing.\nHydra chooses partitions based on convergence time as the primary metric, but\nplaces application instances across partitions in a manner that keeps response\ntimes low while considering communication between applications of a partition,\nand instances of an application across partitions. Evaluations using the\nFloodlight controller show the importance and effectiveness of Hydra in\nsimultaneously keeping convergence times on failures small, while sustaining\nhigher throughput per partition and ensuring responsiveness to\nlatency-sensitive applications.\n", "versions": [{"version": "v1", "created": "Fri, 23 Sep 2016 00:12:25 GMT"}], "update_date": "2016-09-26", "authors_parsed": [["Chang", "Yiyang", ""], ["Rezaei", "Ashkan", ""], ["Vamanan", "Balajee", ""], ["Hasan", "Jahangir", ""], ["Rao", "Sanjay", ""], ["Vijaykumar", "T. N.", ""]]}, {"id": "1609.07589", "submitter": "Won-Yong Shin", "authors": "Won-Yong Shin, Vien V. Mai, Bang Chul Jung, Hyun Jong Yang", "title": "Opportunistic Network Decoupling With Virtual Full-Duplex Operation in\n  Multi-Source Interfering Relay Networks", "comments": "22 pages, 5 figures, To appear in IEEE Transactions on Mobile\n  Computing", "journal-ref": null, "doi": "10.1109/TMC.2016.2614979", "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new achievability scheme, termed opportunistic network\ndecoupling (OND), operating in virtual full-duplex mode. In the scheme, a novel\nrelay scheduling strategy is utilized in the $K\\times N\\times K$ channel with\ninterfering relays, consisting of $K$ source--destination pairs and $N$\nhalf-duplex relays in-between them. A subset of relays using alternate relaying\nis opportunistically selected in terms of producing the minimum total\ninterference level, thereby resulting in network decoupling. As our main\nresult, it is shown that under a certain relay scaling condition, the OND\nprotocol achieves $K$ degrees of freedom even in the presence of interfering\nlinks among relays. Numerical evaluation is also shown to validate the\nperformance of the proposed OND. Our protocol basically operates in a fully\ndistributed fashion along with local channel state information, thereby\nresulting in a relatively easy implementation.\n", "versions": [{"version": "v1", "created": "Sat, 24 Sep 2016 09:36:49 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Shin", "Won-Yong", ""], ["Mai", "Vien V.", ""], ["Jung", "Bang Chul", ""], ["Yang", "Hyun Jong", ""]]}, {"id": "1609.07629", "submitter": "Michael Kirsche", "authors": "Anna F\\\"orster, Vladim\\'ir Vesel\\'y, Antonio Virdis, Michael Kirsche", "title": "Proceedings of the 3rd OMNeT++ Community Summit, Brno University of\n  Technology - Czech Republic, September 15-16, 2016", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These are the Proceedings of the 3rd OMNeT++ Community Summit, which was held\nat the University of Technology in Brno - Czech Republic - on September 15-16,\n2016.\n", "versions": [{"version": "v1", "created": "Sat, 24 Sep 2016 14:47:00 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Förster", "Anna", ""], ["Veselý", "Vladimír", ""], ["Virdis", "Antonio", ""], ["Kirsche", "Michael", ""]]}, {"id": "1609.07643", "submitter": "Andres Arcia Moret", "authors": "Andres Arcia-Moret and Zafar Gilani and Arjuna Sathiaseelan and Jon\n  Crowcroft", "title": "Peer provided cell-like networks built out of thin air", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The success of Wi-Fi technology as an efficient and low-cost last-mile access\nsolution has enabled massive spontaneous deployments generating storms of\nbeacons all across the globe. Emerging location systems are using these beacons\nto observe mobility patterns of people through portable or wearable devices and\noffers promising use-cases that can help to solve critical problems in the\ndeveloping world. In this paper, we design and develop a novel prototype to\norganise these spontaneous deployments of Access Points into what we call\nvirtual cells (vcells). We compute virtual cells from a list of Access Points\ncollected from different active scans for a geographical region. We argue that\nvirtual cells can be encoded using Bloom filters to implement the location\nprocess. Lastly, we present two illustrative use-cases to showcase the\nsuitability and challenges of the technique.\n", "versions": [{"version": "v1", "created": "Sat, 24 Sep 2016 16:32:24 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Arcia-Moret", "Andres", ""], ["Gilani", "Zafar", ""], ["Sathiaseelan", "Arjuna", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1609.07710", "submitter": "Ming Ding Dr.", "authors": "Ming Ding, David Lopez-Perez, Guoqiang Mao, Zihuai Lin", "title": "Performance Impact of Idle Mode Capability on Dense Small Cell Networks", "comments": "To appear in IEEE TVT", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Very recent studies showed that in a fully loaded dense small cell network\n(SCN), the coverage probability performance will continuously decrease with the\nnetwork densification. Such new results were captured in IEEE ComSoc Technology\nNews with an alarming title of \"Will Densification Be the Death of 5G?\". In\nthis paper, we revisit this issue from more practical views of realistic\nnetwork deployment, such as a finite number of active base stations (BSs) and\nuser equipments (UEs), a decreasing BS transmission power with the network\ndensification, etc. Particularly, in dense SCNs, due to an oversupply of BSs\nwith respect to UEs, a large number of BSs can be put into idle modes without\nsignal transmission, if there is no active UE within their coverage areas.\nSetting those BSs into idle modes mitigates unnecessary inter-cell interference\nand reduces energy consumption. In this paper, we investigate the performance\nimpact of such BS idle mode capability (IMC) on dense SCNs. Different from\nexisting work, we consider a realistic path loss model incorporating both\nline-of-sight (LoS) and non-line-of-sight (NLoS) transmissions. Moreover, we\nobtain analytical results for the coverage probability, the area spectral\nefficiency (ASE) and the energy efficiency (EE) performance for SCNs with the\nBS IMC and show that the performance impact of the IMC on dense SCNs is\nsignificant. As the BS density surpasses the UE density in dense SCNs, the\ncoverage probability will continuously increase toward one, addressing previous\nconcerns on \"the death of 5G\". Finally, the performance improvement in terms of\nthe EE performance is also investigated for dense SCNs using practical energy\nmodels developed in the Green-Touch project.\n", "versions": [{"version": "v1", "created": "Sun, 25 Sep 2016 07:31:39 GMT"}, {"version": "v2", "created": "Wed, 14 Dec 2016 03:25:10 GMT"}, {"version": "v3", "created": "Tue, 3 Jan 2017 06:36:45 GMT"}, {"version": "v4", "created": "Tue, 14 Mar 2017 22:29:51 GMT"}, {"version": "v5", "created": "Tue, 26 Sep 2017 06:38:41 GMT"}], "update_date": "2017-09-27", "authors_parsed": [["Ding", "Ming", ""], ["Lopez-Perez", "David", ""], ["Mao", "Guoqiang", ""], ["Lin", "Zihuai", ""]]}, {"id": "1609.07712", "submitter": "Lu Hou", "authors": "Lu Hou, Shaohang Zhao, Xiong Xiong, Kan Zheng, Periklis Chatzimisios,\n  M. Shamim Hossain and Wei Xiang", "title": "Internet of Things Cloud: Architecture and Implementation", "comments": "19pages, 4figures, IEEE Communications Magazine", "journal-ref": "IEEE Communications Magazine, Communications Standards Supplement,\n  December 2016", "doi": "10.1109/MCOM.2016.1600398CM", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT), which enables common objects to be intelligent\nand interactive, is considered the next evolution of the Internet. Its\npervasiveness and abilities to collect and analyze data which can be converted\ninto information have motivated a plethora of IoT applications. For the\nsuccessful deployment and management of these applications, cloud computing\ntechniques are indispensable since they provide high computational capabilities\nas well as large storage capacity. This paper aims at providing insights about\nthe architecture, implementation and performance of the IoT cloud. Several\npotential application scenarios of IoT cloud are studied, and an architecture\nis discussed regarding the functionality of each component. Moreover, the\nimplementation details of the IoT cloud are presented along with the services\nthat it offers. The main contributions of this paper lie in the combination of\nthe Hypertext Transfer Protocol (HTTP) and Message Queuing Telemetry Transport\n(MQTT) servers to offer IoT services in the architecture of the IoT cloud with\nvarious techniques to guarantee high performance. Finally, experimental results\nare given in order to demonstrate the service capabilities of the IoT cloud\nunder certain conditions.\n", "versions": [{"version": "v1", "created": "Sun, 25 Sep 2016 08:15:24 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Hou", "Lu", ""], ["Zhao", "Shaohang", ""], ["Xiong", "Xiong", ""], ["Zheng", "Kan", ""], ["Chatzimisios", "Periklis", ""], ["Hossain", "M. Shamim", ""], ["Xiang", "Wei", ""]]}, {"id": "1609.07781", "submitter": "Cory James Kleinheksel", "authors": "Cory J. Kleinheksel, Arun K. Somani", "title": "Unidirectional Quorum-based Cycle Planning for Efficient Resource\n  Utilization and Fault-Tolerance", "comments": "Computer Communication and Networks (ICCCN), 2016 25th International\n  Conference on. arXiv admin note: substantial text overlap with\n  arXiv:1608.05172, arXiv:1608.05168, arXiv:1608.05170", "journal-ref": "2016 25th International Conference on Computer Communication and\n  Networks (ICCCN), pp. 1-8", "doi": "10.1109/ICCCN.2016.7568595", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a greedy cycle direction heuristic to improve the\ngeneralized $\\mathbf{R}$ redundancy quorum cycle technique. When applied using\nonly single cycles rather than the standard paired cycles, the generalized\n$\\mathbf{R}$ redundancy technique has been shown to almost halve the necessary\nlight-trail resources in the network. Our greedy heuristic improves this\ncycle-based routing technique's fault-tolerance and dependability.\n  For efficiency and distributed control, it is common in distributed systems\nand algorithms to group nodes into intersecting sets referred to as quorum\nsets. Optimal communication quorum sets forming optical cycles based on\nlight-trails have been shown to flexibly and efficiently route both\npoint-to-point and multipoint-to-multipoint traffic requests. Commonly cycle\nrouting techniques will use pairs of cycles to achieve both routing and\nfault-tolerance, which uses substantial resources and creates the potential for\nunderutilization. Instead, we use a single cycle and intentionally utilize\n$\\mathbf{R}$ redundancy within the quorum cycles such that every point-to-point\ncommunication pairs occur in at least $\\mathbf{R}$ cycles. Without the paired\ncycles the direction of the quorum cycles becomes critical to the fault\ntolerance performance. For this we developed a greedy cycle direction heuristic\nand our single fault network simulations show a reduction of missing pairs by\ngreater than 30%, which translates to significant improvements in fault\ncoverage.\n", "versions": [{"version": "v1", "created": "Sun, 25 Sep 2016 18:28:56 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Kleinheksel", "Cory J.", ""], ["Somani", "Arun K.", ""]]}, {"id": "1609.08141", "submitter": "Trung Kien Vu", "authors": "Trung Kien Vu, Sungoh Kwon", "title": "On-Demand Routing Algorithm with Mobility Prediction in the Mobile\n  Ad-hoc Networks", "comments": "Preprint submitted to Computer Networks, 10 pages, 15 figues. arXiv\n  admin note: text overlap with arXiv:1604.03330", "journal-ref": null, "doi": "10.1016/j.comnet.2005.11.008", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an ad-hoc on-demand distance vector routing\nalgorithm for mobile ad-hoc networks taking into account node mobility.\nChangeable topology of such mobile ad-hoc networks provokes overhead messages\nin order to search available routes and maintain found routes. The overhead\nmessages impede data delivery from sources to destination and deteriorate\nnetwork performance. To overcome such a challenge, our proposed algorithm\nestimates link duration based neighboring node mobility and chooses the most\nreliable route. The proposed algorithm also applies the estimate for route\nmaintenance to lessen the number of overhead messages. Via simulations, the\nproposed algorithm is verified in various mobile environments. In the low\nmobility environment, by reducing route maintenance messages, the proposed\nalgorithm significantly improves network performance such as packet data rate\nand end-to-end delay. In the high mobility environment, the reduction of route\ndiscovery message enhances network performance since the proposed algorithm\nprovides more reliable routes.\n", "versions": [{"version": "v1", "created": "Mon, 26 Sep 2016 19:54:39 GMT"}], "update_date": "2017-06-30", "authors_parsed": [["Vu", "Trung Kien", ""], ["Kwon", "Sungoh", ""]]}, {"id": "1609.08476", "submitter": "Shahram Shahsavari", "authors": "Shahram Shahsavari, Nail Akar, and Babak Hossein Khalaj", "title": "Joint Cell Muting and User Scheduling in Multi-Cell Networks with\n  Temporal Fairness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A semi-centralized joint cell muting and user scheduling scheme for\ninterference coordination in a multicell network is proposed under two\ndifferent temporal fairness criteria. The main principle behind the proposed\nscheme is that a central entity selects a cell muting pattern out of a pattern\nset at a decision instant, and subsequently the un-muted base stations\nopportunistically schedule the users in the associated cells, both decisions\nmade on a temporal-fair basis. Although some pattern sets are easily obtainable\nfrom static frequency reuse systems, we propose a more general pattern set\nconstruction algorithm in this paper. As for the first fairness criterion, all\ncells are assigned to receive the same temporal share with the ratio between\nthe temporal share of a cell center section and that of the cell edge section\nis set to a fixed desired value for all cells. The second fairness criterion is\nbased on the max-min temporal fairness for which the temporal share of the\nnetwork-wide worst-case user is maximized. Numerical results are provided to\nvalidate the effectiveness of the proposed scheme for both criteria. The impact\nof choice of the cell muting pattern set is also studied through numerical\nexamples for various cellular topologies.\n", "versions": [{"version": "v1", "created": "Tue, 27 Sep 2016 14:34:19 GMT"}, {"version": "v2", "created": "Tue, 4 Jul 2017 22:51:42 GMT"}], "update_date": "2017-07-06", "authors_parsed": [["Shahsavari", "Shahram", ""], ["Akar", "Nail", ""], ["Khalaj", "Babak Hossein", ""]]}, {"id": "1609.08497", "submitter": "Hyesung Kim", "authors": "Hyesung Kim, Seung-Woo Ko, and Seong-Lyun Kim", "title": "Cognitive Random Access for Internet-of-Things Networks", "comments": "5 pages, to be presented in IEEE VTC Spring 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on cognitive radio (CR) internet- of-things (IoT) networks\nwhere spectrum sensors are deployed for IoT CR devices, which do not have\nenough hardware capability to identify an unoccupied spectrum by themselves. In\nthis sensor- enabled IoT CR network, the CR devices and the sensors are\nseparated. It induces that spectrum occupancies at locations of CR devices and\nsensors could be different. To handle this difference, we investigate a\nconditional interference distribution (CID) at the CR device for a given\nmeasured interference at the sensor. We can observe a spatial correlation of\nthe aggregate interference distribution through the CID. Reflecting the CID, we\ndevise a cognitive random access scheme which adaptively adjusts transmission\nprobability with respect to the interference measurement of the sensor. Our\nscheme improves area spectral efficiency (ASE) compared to a conventional ALOHA\nand an adaptive transmission scheme which attempts to send data when the sensor\nmeasurement is lower than an interference threshold.\n", "versions": [{"version": "v1", "created": "Tue, 27 Sep 2016 15:33:25 GMT"}, {"version": "v2", "created": "Wed, 22 Mar 2017 05:20:43 GMT"}], "update_date": "2017-03-23", "authors_parsed": [["Kim", "Hyesung", ""], ["Ko", "Seung-Woo", ""], ["Kim", "Seong-Lyun", ""]]}, {"id": "1609.08583", "submitter": "Fatemeh Afghah", "authors": "Radhika Radhakrishnan, William Edmonson, Fatemeh Afghah, R.\n  Rodriguez-Osorio, Frank Pinto, and Scott Burleigh", "title": "Survey of Inter-satellite Communication for Small Satellite Systems:\n  Physical Layer to Network Layer View", "comments": "51 pages, 21 Figures, 11 Tables, accepted in IEEE Communications\n  Surveys and Tutorials", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Small satellite systems enable whole new class of missions for navigation,\ncommunications, remote sensing and scientific research for both civilian and\nmilitary purposes. As individual spacecraft are limited by the size, mass and\npower constraints, mass-produced small satellites in large constellations or\nclusters could be useful in many science missions such as gravity mapping,\ntracking of forest fires, finding water resources, etc. Constellation of\nsatellites provide improved spatial and temporal resolution of the target.\nSmall satellite constellations contribute innovative applications by replacing\na single asset with several very capable spacecraft which opens the door to new\napplications. With increasing levels of autonomy, there will be a need for\nremote communication networks to enable communication between spacecraft. These\nspace based networks will need to configure and maintain dynamic routes, manage\nintermediate nodes, and reconfigure themselves to achieve mission objectives.\nHence, inter-satellite communication is a key aspect when satellites fly in\nformation. In this paper, we present the various researches being conducted in\nthe small satellite community for implementing inter-satellite communications\nbased on the Open System Interconnection (OSI) model. This paper also reviews\nthe various design parameters applicable to the first three layers of the OSI\nmodel, i.e., physical, data link and network layer. Based on the survey, we\nalso present a comprehensive list of design parameters useful for achieving\ninter-satellite communications for multiple small satellite missions. Specific\ntopics include proposed solutions for some of the challenges faced by small\nsatellite systems, enabling operations using a network of small satellites, and\nsome examples of small satellite missions involving formation flying aspects.\n", "versions": [{"version": "v1", "created": "Tue, 27 Sep 2016 19:07:14 GMT"}, {"version": "v2", "created": "Wed, 28 Sep 2016 00:59:38 GMT"}], "update_date": "2016-09-29", "authors_parsed": [["Radhakrishnan", "Radhika", ""], ["Edmonson", "William", ""], ["Afghah", "Fatemeh", ""], ["Rodriguez-Osorio", "R.", ""], ["Pinto", "Frank", ""], ["Burleigh", "Scott", ""]]}, {"id": "1609.08729", "submitter": "Mohammad Hosseini", "authors": "Mohammad Hosseini and Viswanathan Swaminathan", "title": "Adaptive 360 VR Video Streaming: Divide and Conquer!", "comments": "IEEE International Symposium on Multimedia 2016 (ISM '16), December\n  4-7, San Jose, California, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.GR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While traditional multimedia applications such as games and videos are still\npopular, there has been a significant interest in the recent years towards new\n3D media such as 3D immersion and Virtual Reality (VR) applications, especially\n360 VR videos. 360 VR video is an immersive spherical video where the user can\nlook around during playback. Unfortunately, 360 VR videos are extremely\nbandwidth intensive, and therefore are difficult to stream at acceptable\nquality levels. In this paper, we propose an adaptive bandwidth-efficient 360\nVR video streaming system using a divide and conquer approach. In our approach,\nwe propose a dynamic view-aware adaptation technique to tackle the huge\nstreaming bandwidth demands of 360 VR videos. We spatially divide the videos\ninto multiple tiles while encoding and packaging, use MPEG-DASH SRD to describe\nthe spatial relationship of tiles in the 360-degree space, and prioritize the\ntiles in the Field of View (FoV). In order to describe such tiled\nrepresentations, we extend MPEG-DASH SRD to the 3D space of 360 VR videos. We\nspatially partition the underlying 3D mesh, and construct an efficient 3D\ngeometry mesh called hexaface sphere to optimally represent a tiled 360 VR\nvideo in the 3D space. Our initial evaluation results report up to 72%\nbandwidth savings on 360 VR video streaming with minor negative quality impacts\ncompared to the baseline scenario when no adaptations is applied.\n", "versions": [{"version": "v1", "created": "Wed, 28 Sep 2016 02:07:12 GMT"}, {"version": "v2", "created": "Mon, 17 Oct 2016 17:05:33 GMT"}, {"version": "v3", "created": "Tue, 18 Oct 2016 18:45:41 GMT"}, {"version": "v4", "created": "Mon, 23 Jan 2017 17:18:33 GMT"}, {"version": "v5", "created": "Fri, 17 Nov 2017 17:03:33 GMT"}], "update_date": "2017-11-20", "authors_parsed": [["Hosseini", "Mohammad", ""], ["Swaminathan", "Viswanathan", ""]]}, {"id": "1609.08888", "submitter": "Maria Lema Rosas", "authors": "Maria A. Lema, Enric Pardo, Olga Galinina, Sergey Andreev and Mischa\n  Dohler", "title": "Flexible Dual-Connectivity Spectrum Aggregation for Decoupled Uplink and\n  Downlink Access in 5G Heterogeneous Systems", "comments": "Accepted for publication in JSAC Special issue on Spectrum\n  Aggregation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Maintaining multiple wireless connections is a promising solution to boost\ncapacity in fifth-generation (5G) networks, where user equipment is able to\nconsume radio resources of several serving cells simultaneously and potentially\naggregate bandwidth across all of them. The emerging dual connectivity paradigm\ncan be regarded as an attractive access mechanism in dense heterogeneous 5G\nnetworks, where bandwidth sharing and cooperative techniques are evolving to\nmeet the increased capacity requirements. Dual connectivity in the uplink\nremained highly controversial, since the user device has a limited power budget\nto share between two different access points, especially when located close to\nthe cell edge. On the other hand, in an attempt to enhance the uplink\ncommunications performance, the concept of uplink and downlink decoupling has\nrecently been introduced. Leveraging these latest developments, our work\nsignificantly advances prior art by proposing and investigating the concept of\nflexible cell association in dual connectivity scenarios, where users are able\nto aggregate resources from more than one serving cell. In this setup, the\npreferred association policies for the uplink may differ from those for the\ndownlink, thereby allowing for a truly decoupled access. With the use of\nstochastic geometry, the dual connectivity association regions for decoupled\naccess are derived and the resultant performance is evaluated in terms of\ncapacity gains over the conventional downlink received power access policies.\n", "versions": [{"version": "v1", "created": "Wed, 28 Sep 2016 12:35:35 GMT"}], "update_date": "2016-09-29", "authors_parsed": [["Lema", "Maria A.", ""], ["Pardo", "Enric", ""], ["Galinina", "Olga", ""], ["Andreev", "Sergey", ""], ["Dohler", "Mischa", ""]]}, {"id": "1609.09314", "submitter": "Benevid Felix Silva", "authors": "Benevid Felix, Aldri Santos, Michele Nogueira", "title": "A New Queue Discipline for Reducing Bufferbloat Effects in HetNet\n  Concurrent Multipath Transfer", "comments": "9 pages, 13 figuras", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heterogeneous wireless networks have evolved to reach application\nrequirements for low latency and high throughput on Internet access. Recent\nstudies have improved network performance employing the Multipath TCP, which\naggregates flows from heterogeneous wireless interfaces in a single connection.\nAlthough existing proposals are powerful, coupled congestion control algorithms\nare currently limited because of the high variation in path delays, bandwidth\nand loss rate, typical from heterogeneous wireless networks, even more over\nconcurrent multipath transmissions. These transmissions experience bufferbloat,\ni.e., high delays caused by long queues. Hence, to cope with the current\nlimitations, this work presents CoDel-LIFO, a new active queue management (AQM)\ndiscipline to reduce the dropped packet ratio in the Multipath TCP congestion\ncontrol mechanism. Differently from other approaches, CoDel-LIFO gives priority\nto the most recent packets, being then promising. This paper provides a\ndetailed simulation analysis over congestion control algorithms by comparing\nCoDel-LIFO to CoDel and DropTail disciplines. Results indicate that CoDel-LIFO\nreduces queue drops, diminishing the impact on congestion control; improving\nsubstantially the goodput; and keeping RTT low.\n", "versions": [{"version": "v1", "created": "Thu, 29 Sep 2016 12:19:21 GMT"}], "update_date": "2016-09-30", "authors_parsed": [["Felix", "Benevid", ""], ["Santos", "Aldri", ""], ["Nogueira", "Michele", ""]]}, {"id": "1609.09329", "submitter": "Olga Kieselmann", "authors": "Olga Kieselmann and Arno Wacker", "title": "k-rAC - a Fine-Grained k-Resilient Access Control Scheme for Distributed\n  Hash Tables", "comments": null, "journal-ref": "In Proceedings of the 12th International Conference on\n  Availability, Reliability and Security (ARES '17). ACM, New York, NY, USA,\n  Article 43, 2017", "doi": "10.1145/3098954.3103154", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed Hash Tables (DHT) are a common architecture for decentralized\napplications and, therefore, would be suited for privacy-aware applications.\nHowever, currently existing DHTs allow every peer to access any index. To build\nprivacy-aware applications, we need to control this access. In this paper, we\npresent k-rAC, a privacy-aware fine-grained AC for DHTs. For authentication, we\npresent three different mechanisms based on public-key cryptography,\nzero-knowledge-proofs, and cryptographic hashes. For authorization, we use\ndistributed AC lists. The security of our approach is based on k-resilience. We\nshow that our approach introduces an acceptable overhead and discuss its\nsuitability for different scenarios.\n", "versions": [{"version": "v1", "created": "Thu, 29 Sep 2016 13:32:01 GMT"}], "update_date": "2017-09-19", "authors_parsed": [["Kieselmann", "Olga", ""], ["Wacker", "Arno", ""]]}, {"id": "1609.09368", "submitter": "Yi Ren", "authors": "Tuan Phung-Duc, Yi Ren, Jyh-Cheng Chen, and Zheng-Wei Yu", "title": "Design and Analysis of Deadline and Budget Constrained Autoscaling\n  (DBCA) Algorithm for 5G Mobile Networks", "comments": "The short version is accepted by IEEE CloudCom 2016. arXiv admin\n  note: substantial text overlap with arXiv:1604.05803", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In cloud computing paradigm, virtual resource autoscaling approaches have\nbeen intensively studied recent years. Those approaches dynamically scale\nin/out virtual resources to adjust system performance for saving operation\ncost. However, designing the autoscaling algorithm for desired performance with\nlimited budget, while considering the existing capacity of legacy network\nequipment, is not a trivial task. In this paper, we propose a Deadline and\nBudget Constrained Autoscaling (DBCA) algorithm for addressing the\nbudget-performance tradeoff. We develop an analytical model to quantify the\ntradeoff and cross-validate the model by extensive simulations. The results\nshow that the DBCA can significantly improve system performance given the\nbudget upper-bound. In addition, the model provides a quick way to evaluate the\nbudget-performance tradeoff and system design without wide deployment, saving\non cost and time.\n", "versions": [{"version": "v1", "created": "Thu, 29 Sep 2016 14:43:49 GMT"}], "update_date": "2016-09-30", "authors_parsed": [["Phung-Duc", "Tuan", ""], ["Ren", "Yi", ""], ["Chen", "Jyh-Cheng", ""], ["Yu", "Zheng-Wei", ""]]}, {"id": "1609.09560", "submitter": "Michele Nogueira", "authors": "Michele Nogueira and Augusto Almeida Santos and Jos\\'e M. F. Moura", "title": "Early Signals from Volumetric DDoS Attacks: An Empirical Study", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed Denial of Service (DDoS) is a common type of Cybercrime. It can\nstrongly damage a company reputation and increase its costs. Attackers improve\ncontinuously their strategies. They doubled the amount of unleashed\ncommunication requests in volume, size, and frequency in the last few years.\nThis occurs against different hosts, causing resource exhaustion. Previous\nstudies focused on detecting or mitigating ongoing DDoS attacks. Yet,\naddressing DDoS attacks when they are already in place may be too late. In this\narticle, we consider network resilience by early prediction of attack trends.\nWe show empirically the advantage of using non-parametric leading indicators\nfor early prediction of volumetric DDoS attacks. We report promising results\nover a real dataset from CAIDA. Our results raise new questions and\nopportunities for further research in early predicting trends of DDoS attacks.\n", "versions": [{"version": "v1", "created": "Fri, 30 Sep 2016 01:17:07 GMT"}, {"version": "v2", "created": "Tue, 23 May 2017 22:48:04 GMT"}], "update_date": "2017-05-25", "authors_parsed": [["Nogueira", "Michele", ""], ["Santos", "Augusto Almeida", ""], ["Moura", "José M. F.", ""]]}, {"id": "1609.09682", "submitter": "Pavlos Sermpezis", "authors": "Thrasyvoulos Spyropoulos and Pavlos Sermpezis", "title": "Soft Cache Hits and the Impact of Alternative Content Recommendations on\n  Mobile Edge Caching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Caching popular content at the edge of future mobile networks has been widely\nconsidered in order to alleviate the impact of the data tsunami on both the\naccess and backhaul networks. A number of interesting techniques have been\nproposed, including femto-caching and \"delayed\" or opportunistic cache access.\nNevertheless, the majority of these approaches suffer from the rather limited\nstorage capacity of the edge caches, compared to the tremendous and rapidly\nincreasing size of the Internet content catalog. We propose to depart from the\nassumption of hard cache misses, common in most existing works, and consider\n\"soft\" cache misses, where if the original content is not available, an\nalternative content that is locally cached can be recommended. Given that\nInternet content consumption is increasingly entertainment-oriented, we believe\nthat a related content could often lead to complete or at least partial user\nsatisfaction, without the need to retrieve the original content over expensive\nlinks. In this paper, we formulate the problem of optimal edge caching with\nsoft cache hits, in the context of delayed access, and analyze the expected\ngains. We then show using synthetic and real datasets of related video contents\nthat promising caching gains could be achieved in practice.\n", "versions": [{"version": "v1", "created": "Fri, 30 Sep 2016 11:52:42 GMT"}], "update_date": "2016-10-03", "authors_parsed": [["Spyropoulos", "Thrasyvoulos", ""], ["Sermpezis", "Pavlos", ""]]}, {"id": "1609.09726", "submitter": "I\\~naki Ucar", "authors": "I\\~naki Ucar, Carlos Donato, Pablo Serrano, Andres Garcia-Saavedra,\n  Arturo Azcorra, Albert Banchs", "title": "Revisiting 802.11 Rate Adaptation from Energy Consumption's Perspective", "comments": "7 pages, 8 figures in ACM International Conference on Modeling,\n  Analysis and Simulation of Wireless and Mobile Systems (MSWiM), 2016", "journal-ref": "ACM International Conference on Modeling, Analysis and Simulation\n  of Wireless and Mobile Systems (MSWiM), Malta, 2016, pp. 27-34", "doi": "10.1145/2988287.2989149", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rate adaptation in 802.11 WLANs has received a lot of attention from the\nresearch community, with most of the proposals aiming at maximising throughput\nbased on network conditions. Considering energy consumption, an implicit\nassumption is that optimality in throughput implies optimality in energy\nefficiency, but this assumption has been recently put into question. In this\npaper, we address via analysis and experimentation the relation between\nthroughput performance and energy efficiency in multi-rate 802.11 scenarios. We\ndemonstrate the trade-off between these performance figures, confirming that\nthey may not be simultaneously optimised, and analyse their sensitivity towards\nthe energy consumption parameters of the device. Our results provide the means\nto design novel rate adaptation schemes that takes energy consumption into\naccount.\n", "versions": [{"version": "v1", "created": "Fri, 30 Sep 2016 13:39:54 GMT"}], "update_date": "2017-10-26", "authors_parsed": [["Ucar", "Iñaki", ""], ["Donato", "Carlos", ""], ["Serrano", "Pablo", ""], ["Garcia-Saavedra", "Andres", ""], ["Azcorra", "Arturo", ""], ["Banchs", "Albert", ""]]}, {"id": "1609.09773", "submitter": "Qingqing Wu", "authors": "Qingqing Wu, Geoffrey Ye Li, Wen Chen, Derrick Wing Kwan Ng, and\n  Robert Schober", "title": "An Overview of Sustainable Green 5G Networks", "comments": "Submitted for possible publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stringent requirements of a 1,000 times increase in data traffic and one\nmillisecond round trip latency have made limiting the potentially tremendous\nensuing energy consumption one of the most challenging problems for the design\nof the upcoming fifth-generation (5G) networks. To enable sustainable 5G\nnetworks, new technologies have been proposed to improve the system energy\nefficiency and alternative energy sources are introduced to reduce our\ndependence on traditional fossil fuels. In particular, various 5G techniques\ntarget the reduction of the energy consumption without sacrificing the\nquality-of-service. Meanwhile, energy harvesting technologies, which enable\ncommunication transceivers to harvest energy from various renewable resources\nand ambient radio frequency signals for communi- cation, have drawn significant\ninterest from both academia and industry. In this article, we provide an\noverview of the latest research on both green 5G techniques and energy\nharvesting for communication. In addition, some technical challenges and\npotential research topics for realizing sustainable green 5G networks are also\nidentified.\n", "versions": [{"version": "v1", "created": "Fri, 30 Sep 2016 15:26:03 GMT"}, {"version": "v2", "created": "Wed, 5 Oct 2016 03:40:26 GMT"}], "update_date": "2017-04-12", "authors_parsed": [["Wu", "Qingqing", ""], ["Li", "Geoffrey Ye", ""], ["Chen", "Wen", ""], ["Ng", "Derrick Wing Kwan", ""], ["Schober", "Robert", ""]]}]