[{"id": "0712.0084", "submitter": "Gilles Champenois", "authors": "Gilles Champenois", "title": "From vectors to mnesors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mnesor theory is the adaptation of vectors to artificial intelligence.\nThe scalar field is replaced by a lattice. Addition becomes idempotent and\nmultiplication is interpreted as a selection operation. We also show that\nmnesors can be the foundation for a linear calculus.\n", "versions": [{"version": "v1", "created": "Sat, 1 Dec 2007 14:37:07 GMT"}, {"version": "v2", "created": "Thu, 8 May 2008 21:26:54 GMT"}, {"version": "v3", "created": "Wed, 23 Jul 2008 07:38:39 GMT"}, {"version": "v4", "created": "Sun, 24 May 2009 17:12:25 GMT"}], "update_date": "2009-05-24", "authors_parsed": [["Champenois", "Gilles", ""]]}, {"id": "0712.0164", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "On Decidability Properties of Local Sentences", "comments": null, "journal-ref": "Theoretical Computer Science 364 (2) (2006) 196-211", "doi": null, "report-no": null, "categories": "cs.LO math.LO", "license": null, "abstract": "  Local (first order) sentences, introduced by Ressayre, enjoy very nice\ndecidability properties, following from some stretching theorems stating some\nremarkable links between the finite and the infinite model theory of these\nsentences. We prove here several additional results on local sentences. The\nfirst one is a new decidability result in the case of local sentences whose\nfunction symbols are at most unary: one can decide, for every regular cardinal\nk whether a local sentence phi has a model of order type k. Secondly we show\nthat this result can not be extended to the general case. Assuming the\nconsistency of an inaccessible cardinal we prove that the set of local\nsentences having a model of order type omega_2 is not determined by the\naxiomatic system ZFC + GCH, where GCH is the generalized continuum hypothesis\n", "versions": [{"version": "v1", "created": "Sun, 2 Dec 2007 18:34:00 GMT"}], "update_date": "2007-12-04", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "0712.0165", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "On the Accepting Power of 2-Tape B\\\"uchi Automata", "comments": null, "journal-ref": "23rd International Symposium on Theoretical Aspects of Computer\n  Science, STACS 2006, France (2006)", "doi": null, "report-no": null, "categories": "cs.CC cs.LO math.LO", "license": null, "abstract": "  We show that, from a topological point of view, 2-tape B\\\"uchi automata have\nthe same accepting power than Turing machines equipped with a B\\\"uchi\nacceptance condition. In particular, we show that for every non null recursive\nordinal alpha, there exist some Sigma^0_alpha-complete and some\nPi^0_alpha-complete infinitary rational relations accepted by 2-tape B\\\"uchi\nautomata. This very surprising result gives answers to questions of W. Thomas\n[Automata and Quantifier Hierarchies, in: Formal Properties of Finite automata\nand Applications, Ramatuelle, 1988, LNCS 386, Springer, 1989, p.104-119], of P.\nSimonnet [Automates et Th\\'eorie Descriptive, Ph. D. Thesis, Universit\\'e Paris\n7, March 1992], and of H. Lescow and W. Thomas [Logical Specifications of\nInfinite Computations, In: \"A Decade of Concurrency\", LNCS 803, Springer, 1994,\np. 583-621].\n", "versions": [{"version": "v1", "created": "Sun, 2 Dec 2007 18:36:34 GMT"}], "update_date": "2007-12-04", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "0712.0948", "submitter": "Stefan Woltran", "authors": "Stefan Woltran", "title": "A Common View on Strong, Uniform, and Other Notions of Equivalence in\n  Answer-Set Programming", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": null, "abstract": "  Logic programming under the answer-set semantics nowadays deals with numerous\ndifferent notions of program equivalence. This is due to the fact that\nequivalence for substitution (known as strong equivalence) and ordinary\nequivalence are different concepts. The former holds, given programs P and Q,\niff P can be faithfully replaced by Q within any context R, while the latter\nholds iff P and Q provide the same output, that is, they have the same answer\nsets. Notions in between strong and ordinary equivalence have been introduced\nas theoretical tools to compare incomplete programs and are defined by either\nrestricting the syntactic structure of the considered context programs R or by\nbounding the set A of atoms allowed to occur in R (relativized equivalence).For\nthe latter approach, different A yield properly different equivalence notions,\nin general. For the former approach, however, it turned out that any\n``reasonable'' syntactic restriction to R coincides with either ordinary,\nstrong, or uniform equivalence. In this paper, we propose a parameterization\nfor equivalence notions which takes care of both such kinds of restrictions\nsimultaneously by bounding, on the one hand, the atoms which are allowed to\noccur in the rule heads of the context and, on the other hand, the atoms which\nare allowed to occur in the rule bodies of the context. We introduce a general\nsemantical characterization which includes known ones as SE-models (for strong\nequivalence) or UE-models (for uniform equivalence) as special cases.\nMoreover,we provide complexity bounds for the problem in question and sketch a\npossible implementation method.\n  To appear in Theory and Practice of Logic Programming (TPLP).\n", "versions": [{"version": "v1", "created": "Thu, 6 Dec 2007 14:26:42 GMT"}], "update_date": "2007-12-07", "authors_parsed": [["Woltran", "Stefan", ""]]}, {"id": "0712.1182", "submitter": "Audun Josang", "authors": "Audun Josang", "title": "Cumulative and Averaging Fission of Beliefs", "comments": "7 pages, 4 figures, working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": null, "abstract": "  Belief fusion is the principle of combining separate beliefs or bodies of\nevidence originating from different sources. Depending on the situation to be\nmodelled, different belief fusion methods can be applied. Cumulative and\naveraging belief fusion is defined for fusing opinions in subjective logic, and\nfor fusing belief functions in general. The principle of fission is the\nopposite of fusion, namely to eliminate the contribution of a specific belief\nfrom an already fused belief, with the purpose of deriving the remaining\nbelief. This paper describes fission of cumulative belief as well as fission of\naveraging belief in subjective logic. These operators can for example be\napplied to belief revision in Bayesian belief networks, where the belief\ncontribution of a given evidence source can be determined as a function of a\ngiven fused belief and its other contributing beliefs.\n", "versions": [{"version": "v1", "created": "Fri, 7 Dec 2007 16:42:07 GMT"}], "update_date": "2007-12-10", "authors_parsed": [["Josang", "Audun", ""]]}, {"id": "0712.1279", "submitter": "Salvatore Caporaso", "authors": "Salvatore Caporaso and Nicola Corriero", "title": "Kleene, Rogers and Rice Theorems Revisited in C and in Bash", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": null, "abstract": "  The recursion theorem in the weak form {e}(z)=x(e,z) (universal function not\nneeded) and in Rogers form {n}(z)={{x}(n)}(z) and Rice theorem are proved a\nfirst time using programs in C, and a second time with scripts in Bash.\n", "versions": [{"version": "v1", "created": "Sat, 8 Dec 2007 12:05:40 GMT"}], "update_date": "2007-12-11", "authors_parsed": [["Caporaso", "Salvatore", ""], ["Corriero", "Nicola", ""]]}, {"id": "0712.1310", "submitter": "Lev Cherbanski Dr.", "authors": "Lev Cherbanski", "title": "About Algorithm for Transformation of Logic Functions (ATLF)", "comments": "25 pages, in English, German and Russian", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI", "license": null, "abstract": "  In this article the algorithm for transformation of logic functions which are\ngiven by truth tables is considered. The suggested algorithm allows the\ntransformation of many-valued logic functions with the required number of\nvariables and can be looked in this sense as universal.\n", "versions": [{"version": "v1", "created": "Sat, 8 Dec 2007 22:36:44 GMT"}], "update_date": "2007-12-11", "authors_parsed": [["Cherbanski", "Lev", ""]]}, {"id": "0712.1337", "submitter": "Zoltan Esik", "authors": "S. L. Bloom, Z. Esik", "title": "Axiomatizing rational power series", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Iteration semirings are Conway semirings satisfying Conway's group\nidentities. We show that the semirings $\\N^{\\rat}\\llangle \\Sigma^* \\rrangle$ of\nrational power series with coefficients in the semiring $\\N$ of natural numbers\nare the free partial iteration semirings. Moreover, we characterize the\nsemirings $\\N_\\infty^{\\rat}\\llangle \\Sigma^* \\rrangle$ as the free semirings in\nthe variety of iteration semirings defined by three additional simple\nidentities, where $\\N_\\infty$ is the completion of $\\N$ obtained by adding a\npoint of infinity. We also show that this latter variety coincides with the\nvariety generated by the complete, or continuous semirings. As a consequence of\nthese results, we obtain that the semirings $\\N_\\infty^{\\rat}\\llangle \\Sigma^*\n\\rrangle$, equipped with the sum order, are free in the class of symmetric\ninductive $^*$-semirings. This characterization corresponds to Kozen's\naxiomatization of regular languages.\n", "versions": [{"version": "v1", "created": "Sun, 9 Dec 2007 12:45:00 GMT"}, {"version": "v2", "created": "Tue, 9 Dec 2008 14:11:09 GMT"}], "update_date": "2008-12-09", "authors_parsed": [["Bloom", "S. L.", ""], ["Esik", "Z.", ""]]}, {"id": "0712.1345", "submitter": "Giorgi Japaridze", "authors": "Giorgi Japaridze", "title": "Sequential operators in computability logic", "comments": "To appear in \"Information and Computation\"", "journal-ref": "Information and Computation 206 (2008), pp. 1443-1475", "doi": "10.1016/j.ic.2008.10.001", "report-no": null, "categories": "cs.LO cs.AI math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computability logic (CL) (see http://www.cis.upenn.edu/~giorgi/cl.html) is a\nsemantical platform and research program for redeveloping logic as a formal\ntheory of computability, as opposed to the formal theory of truth which it has\nmore traditionally been. Formulas in CL stand for (interactive) computational\nproblems, understood as games between a machine and its environment; logical\noperators represent operations on such entities; and \"truth\" is understood as\nexistence of an effective solution, i.e., of an algorithmic winning strategy.\n  The formalism of CL is open-ended, and may undergo series of extensions as\nthe study of the subject advances. The main groups of operators on which CL has\nbeen focused so far are the parallel, choice, branching, and blind operators.\nThe present paper introduces a new important group of operators, called\nsequential. The latter come in the form of sequential conjunction and\ndisjunction, sequential quantifiers, and sequential recurrences. As the name\nmay suggest, the algorithmic intuitions associated with this group are those of\nsequential computations, as opposed to the intuitions of parallel computations\nassociated with the parallel group of operations: playing a sequential\ncombination of games means playing its components in a sequential fashion, one\nafter one.\n  The main technical result of the present paper is a sound and complete\naxiomatization of the propositional fragment of computability logic whose\nvocabulary, together with negation, includes all three -- parallel, choice and\nsequential -- sorts of conjunction and disjunction. An extension of this result\nto the first-order level is also outlined.\n", "versions": [{"version": "v1", "created": "Sun, 9 Dec 2007 16:59:35 GMT"}, {"version": "v2", "created": "Wed, 15 Oct 2008 07:44:55 GMT"}], "update_date": "2011-04-15", "authors_parsed": [["Japaridze", "Giorgi", ""]]}, {"id": "0712.1359", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "Borel Ranks and Wadge Degrees of Context Free Omega Languages", "comments": null, "journal-ref": "Mathematical Structures in Computer Science 16 (5) (2006) 813-840", "doi": null, "report-no": null, "categories": "cs.LO cs.GT math.LO", "license": null, "abstract": "  We show that, from a topological point of view, considering the Borel and the\nWadge hierarchies, 1-counter B\\\"uchi automata have the same accepting power\nthan Turing machines equipped with a B\\\"uchi acceptance condition. In\nparticular, for every non null recursive ordinal alpha, there exist some\nSigma^0_alpha-complete and some Pi^0_alpha-complete omega context free\nlanguages accepted by 1-counter B\\\"uchi automata, and the supremum of the set\nof Borel ranks of context free omega languages is the ordinal gamma^1_2 which\nis strictly greater than the first non recursive ordinal. This very surprising\nresult gives answers to questions of H. Lescow and W. Thomas [Logical\nSpecifications of Infinite Computations, In:\"A Decade of Concurrency\", LNCS\n803, Springer, 1994, p. 583-621].\n", "versions": [{"version": "v1", "created": "Sun, 9 Dec 2007 20:01:02 GMT"}], "update_date": "2007-12-11", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "0712.1363", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "Undecidable Problems About Timed Automata", "comments": null, "journal-ref": "Dans Proceedings of the 4th International Conference on Formal\n  Modelling and Analysis of Timed Systems - FORMATS'06, France (2006)", "doi": null, "report-no": null, "categories": "cs.LO cs.CC math.LO", "license": null, "abstract": "  We solve some decision problems for timed automata which were recently raised\nby S. Tripakis in [ Folk Theorems on the Determinization and Minimization of\nTimed Automata, in the Proceedings of the International Workshop FORMATS'2003,\nLNCS, Volume 2791, p. 182-188, 2004 ] and by E. Asarin in [ Challenges in Timed\nLanguages, From Applied Theory to Basic Theory, Bulletin of the EATCS, Volume\n83, p. 106-120, 2004 ]. In particular, we show that one cannot decide whether a\ngiven timed automaton is determinizable or whether the complement of a timed\nregular language is timed regular. We show that the problem of the minimization\nof the number of clocks of a timed automaton is undecidable. It is also\nundecidable whether the shuffle of two timed regular languages is timed\nregular. We show that in the case of timed B\\\"uchi automata accepting infinite\ntimed words some of these problems are Pi^1_1-hard, hence highly undecidable\n(located beyond the arithmetical hierarchy).\n", "versions": [{"version": "v1", "created": "Sun, 9 Dec 2007 20:11:42 GMT"}], "update_date": "2007-12-11", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "0712.1499", "submitter": "Klaus Aehlig", "authors": "Klaus Aehlig, Arnold Beckmann", "title": "On the computational complexity of cut-reduction", "comments": "41 pages, technical report (CS, Swansea University)", "journal-ref": null, "doi": null, "report-no": "CSR15-2007", "categories": "cs.LO cs.CC", "license": null, "abstract": "  Using appropriate notation systems for proofs, cut-reduction can often be\nrendered feasible on these notations, and explicit bounds can be given.\nDeveloping a suitable notation system for Bounded Arithmetic, and applying\nthese bounds, all the known results on definable functions of certain such\ntheories can be reobtained in a uniform way.\n", "versions": [{"version": "v1", "created": "Mon, 10 Dec 2007 14:58:27 GMT"}], "update_date": "2007-12-11", "authors_parsed": [["Aehlig", "Klaus", ""], ["Beckmann", "Arnold", ""]]}, {"id": "0712.1996", "submitter": "Walied Othman", "authors": "Bart Kuijpers, Walied Othman, Rafael Grimson", "title": "A case study of the difficulty of quantifier elimination in constraint\n  databases: the alibi query in moving object databases", "comments": "35 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.DB", "license": null, "abstract": "  In the constraint database model, spatial and spatio-temporal data are stored\nby boolean combinations of polynomial equalities and inequalities over the real\nnumbers. The relational calculus augmented with polynomial constraints is the\nstandard first-order query language for constraint databases. Although the\nexpressive power of this query language has been studied extensively, the\ndifficulty of the efficient evaluation of queries, usually involving some form\nof quantifier elimination, has received considerably less attention. The\ninefficiency of existing quantifier-elimination software and the intrinsic\ndifficulty of quantifier elimination have proven to be a bottle-neck for for\nreal-world implementations of constraint database systems. In this paper, we\nfocus on a particular query, called the \\emph{alibi query}, that asks whether\ntwo moving objects whose positions are known at certain moments in time, could\nhave possibly met, given certain speed constraints. This query can be seen as a\nconstraint database query and its evaluation relies on the elimination of a\nblock of three existential quantifiers. Implementations of general purpose\nelimination algorithms are in the specific case, for practical purposes, too\nslow in answering the alibi query and fail completely in the parametric case.\nThe main contribution of this paper is an analytical solution to the parametric\nalibi query, which can be used to answer this query in the specific case in\nconstant time. We also give an analytic solution to the alibi query at a fixed\nmoment in time. The solutions we propose are based on geometric argumentation\nand they illustrate the fact that some practical problems require creative\nsolutions, where at least in theory, existing systems could provide a solution.\n", "versions": [{"version": "v1", "created": "Wed, 12 Dec 2007 18:05:41 GMT"}], "update_date": "2007-12-13", "authors_parsed": [["Kuijpers", "Bart", ""], ["Othman", "Walied", ""], ["Grimson", "Rafael", ""]]}, {"id": "0712.2577", "submitter": "Maurice Margenstern", "authors": "Margenstern Maurice", "title": "Is the injectivity of the global function of a cellular automaton in the\n  hyperbolic plane undecidable?", "comments": "16 pages, 8 figures. A few words were missing in the initial version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.LO", "license": null, "abstract": "  In this paper, we look at the following question. We consider cellular\nautomata in the hyperbolic plane and we consider the global function defined on\nall possible configurations. Is the injectivity of this function undecidable?\nThe problem was answered positively in the case of the Euclidean plane by\nJarkko Kari, in 1994. In the present paper, we give a partial answer: when the\nconfigurations are restricted to a certain condition, the problem is\nundecidable.\n", "versions": [{"version": "v1", "created": "Sun, 16 Dec 2007 15:12:45 GMT"}, {"version": "v2", "created": "Thu, 20 Dec 2007 08:33:17 GMT"}], "update_date": "2007-12-20", "authors_parsed": [["Maurice", "Margenstern", ""]]}, {"id": "0712.2952", "submitter": "Zoltan Esik", "authors": "S. L. Bloom, Z. Esik, W. Kuich", "title": "Partial Conway and iteration semirings", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.LO", "license": null, "abstract": "  A Conway semiring is a semiring $S$ equipped with a unary operation $^*:S \\to\nS$, always called 'star', satisfying the sum star and product star identities.\nIt is known that these identities imply a Kleene type theorem. Some\ncomputationally important semirings, such as $N$ or $N^{\\rat}\\llangle \\Sigma^*\n\\rrangle$ of rational power series of words on $\\Sigma$ with coefficients in\n$N$, cannot have a total star operation satisfying the Conway identities. We\nintroduce here partial Conway semirings, which are semirings $S$ which have a\nstar operation defined only on an ideal of $S$; when the arguments are\nappropriate, the operation satisfies the above identities. We develop the\ngeneral theory of partial Conway semirings and prove a Kleene theorem for this\ngeneralization.\n", "versions": [{"version": "v1", "created": "Tue, 18 Dec 2007 13:14:38 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Bloom", "S. L.", ""], ["Esik", "Z.", ""], ["Kuich", "W.", ""]]}, {"id": "0712.3088", "submitter": "Zhaohua Luo", "authors": "Zhaohua Luo", "title": "Clones and Genoids in Lambda Calculus and First Order Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A genoid is a category of two objects such that one is the product of itself\nwith the other. A genoid may be viewed as an abstract substitution algebra. It\nis a remarkable fact that such a simple concept can be applied to present a\nunified algebraic approach to lambda calculus and first order logic.\n", "versions": [{"version": "v1", "created": "Wed, 19 Dec 2007 20:52:48 GMT"}, {"version": "v2", "created": "Wed, 19 Dec 2007 22:00:20 GMT"}, {"version": "v3", "created": "Fri, 7 Sep 2012 19:46:32 GMT"}], "update_date": "2012-09-10", "authors_parsed": [["Luo", "Zhaohua", ""]]}, {"id": "0712.3147", "submitter": "Pierre Lescanne", "authors": "Pierre Lescanne (LIP)", "title": "Common knowledge logic in a higher order proof assistant?", "comments": "11 p", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": null, "abstract": "  This paper presents experiments on common knowledge logic, conducted with the\nhelp of the proof assistant Coq. The main feature of common knowledge logic is\nthe eponymous modality that says that a group of agents shares a knowledge\nabout a certain proposition in a inductive way. This modality is specified by\nusing a fixpoint approach. Furthermore, from these experiments, we discuss and\ncompare the structure of theorems that can be proved in specific theories that\nuse common knowledge logic. Those structures manifests the interplay between\nthe theory (as implemented in the proof assistant Coq) and the metatheory.\n", "versions": [{"version": "v1", "created": "Wed, 19 Dec 2007 10:25:34 GMT"}, {"version": "v2", "created": "Tue, 15 Jan 2008 16:12:50 GMT"}], "update_date": "2008-01-16", "authors_parsed": [["Lescanne", "Pierre", "", "LIP"]]}, {"id": "0712.3380", "submitter": "Robert Brijder", "authors": "Robert Brijder, Hendrik Jan Hoogeboom", "title": "Extending the Overlap Graph for Gene Assembly in Ciliates", "comments": "12 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": "LIACS Technical Report 2007-05", "categories": "cs.LO", "license": null, "abstract": "  Gene assembly is an intricate biological process that has been studied\nformally and modeled through string and graph rewriting systems. Recently, a\nrestriction of the general (intramolecular) model, called simple gene assembly,\nhas been introduced. This restriction has subsequently been defined as a string\nrewriting system. We show that by extending the notion of overlap graph it is\npossible to define a graph rewriting system for two of the three types of rules\nthat make up simple gene assembly. It turns out that this graph rewriting\nsystem is less involved than its corresponding string rewriting system.\nFinally, we give characterizations of the `power' of both types of graph\nrewriting rules. Because of the equivalence of these string and graph rewriting\nsystems, the given characterizations can be carried over to the string\nrewriting system.\n", "versions": [{"version": "v1", "created": "Thu, 20 Dec 2007 12:08:33 GMT"}], "update_date": "2007-12-21", "authors_parsed": [["Brijder", "Robert", ""], ["Hoogeboom", "Hendrik Jan", ""]]}, {"id": "0712.3423", "submitter": "Alban Ponse", "authors": "J.A. Bergstra, A. Ponse, M.B. van der Zwaag", "title": "Tuplix Calculus", "comments": "22 pages", "journal-ref": "Scientific Annals of Computer Science, 18:35--61, 2008", "doi": null, "report-no": "PRG0713", "categories": "cs.LO cs.CE", "license": null, "abstract": "  We introduce a calculus for tuplices, which are expressions that generalize\nmatrices and vectors. Tuplices have an underlying data type for quantities that\nare taken from a zero-totalized field. We start with the core tuplix calculus\nCTC for entries and tests, which are combined using conjunctive composition. We\ndefine a standard model and prove that CTC is relatively complete with respect\nto it. The core calculus is extended with operators for choice, information\nhiding, scalar multiplication, clearing and encapsulation. We provide two\nexamples of applications; one on incremental financial budgeting, and one on\nmodular financial budget design.\n", "versions": [{"version": "v1", "created": "Thu, 20 Dec 2007 13:58:14 GMT"}], "update_date": "2009-03-03", "authors_parsed": [["Bergstra", "J. A.", ""], ["Ponse", "A.", ""], ["van der Zwaag", "M. B.", ""]]}, {"id": "0712.4222", "submitter": "Luca Roversi", "authors": "Luca Roversi", "title": "Weak Affine Light Typing: Polytime intensional expressivity, soundness\n  and completeness", "comments": "Updating: *) pag.29, line 527: index j --> index k. *) pag.29, line\n  544: point 6 canged. *) pag.30, line 547: p=max{m_1... --> p=max{m,m_1... *)\n  pag.30, line 548: the definition of the mapping of the linear composition of\n  QlSRN has been updated. *) pag.30, line 544: arguments of the iterator\n  changed. *) pag.30,31 occurences of wg: every occurrence of rho erased", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": null, "abstract": "  Weak affine light typing (WALT) assigns light affine linear formulae as types\nto a subset of lambda-terms in System F. WALT is poly-time sound: if a\nlambda-term M has type in WALT, M can be evaluated with a polynomial cost in\nthe dimension of the derivation that gives it a type. In particular, the\nevaluation can proceed under any strategy of a rewriting relation, obtained as\na mix of both call-by-name/call-by-value beta-reductions. WALT is poly-time\ncomplete since it can represent any poly-time Turing machine. WALT weakens,\nnamely generalizes, the notion of stratification of deductions common to some\nLight Systems -- we call as such those logical systems, derived from Linear\nlogic, to characterize FP, the set of Polynomial functions -- . A weaker\nstratification allows to define a compositional embedding of the Quasi-linear\nfragment QlSRN of Safe recursion on notation (SRN) into WALT. QlSRN is SRN,\nwhich is a recursive-theoretical system characterizing FP, where only the\ncomposition scheme is restricted to linear safe variables. So, the expressivity\nof WALT is stronger, as compared to the known Light Systems. In particular,\nusing the types, the embedding puts in evidence the stratification of normal\nand safe arguments hidden in QlSRN: the less an argument is impredicative, the\ndeeper, in a formal, proof-theoretical sense, gets its representation in WALT.\n", "versions": [{"version": "v1", "created": "Thu, 27 Dec 2007 14:35:16 GMT"}, {"version": "v2", "created": "Mon, 31 Mar 2008 16:00:54 GMT"}], "update_date": "2008-03-31", "authors_parsed": [["Roversi", "Luca", ""]]}, {"id": "0712.4341", "submitter": "Yongming Li", "authors": "Yongming Li", "title": "Finite Automata Based on Quantum Logic and Their Determinization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": null, "abstract": "  We give the quantum subset construction of orthomodular lattice-valued finite\nautomata, then we show the equivalence between orthomodular lattice-valued\nfinite automata, orthomodular lattice-valued deterministic finite automata and\northomodular lattice-valued finite automata with empty string-moves. Based on\nthese equivalences, we study the algebraic operations on orthomodular\nlattice-valued regular languages, then we establish Kleene theorem in the frame\nof quantum logic.\n", "versions": [{"version": "v1", "created": "Fri, 28 Dec 2007 11:48:44 GMT"}], "update_date": "2007-12-31", "authors_parsed": [["Li", "Yongming", ""]]}]