[{"id": "0908.0014", "submitter": "Mohamed Abdel Latif Mr", "authors": "Mohamed Abdel Latif, Ahmed Sultan, and Hesham El Gamal", "title": "Keys through ARQ", "comments": "21 Files 11 Figures Submitted to the IEEE Transactions on Information\n  Theory on July 31st, 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a novel framework for sharing secret keys using the\nwell-known Automatic Repeat reQuest (ARQ) protocol. The proposed key sharing\nprotocol does not assume any prior knowledge about the channel state\ninformation (CSI), but, harnesses the available opportunistic secrecy gains\nusing only the one bit feedback, in the form of ACK/NACK. The distribution of\nkey bits among multiple ARQ epochs, in our approach, allows for mitigating the\nsecrecy outage phenomenon observed in earlier works. We characterize the\ninformation theoretic limits of the proposed scheme, under different\nassumptions on the channel spatial and temporal correlation function, and\ndevelop low complexity explicit implementations. Our analysis reveals a novel\nrole of \"dumb antennas\" in overcoming the negative impact of spatial\ncorrelation, between the legitimate and eavesdropper channels, on the\nachievable secrecy rates. We further develop an adaptive rate allocation policy\nwhich achieves higher secrecy rates by exploiting the channel temporal\ncorrelation. Finally, our theoretical claims are validated by numerical results\nthat establish the achievability of non-zero secrecy rates even when the\neavesdropper channel is less noisy, on the average, than the legitimate\nchannel.\n", "versions": [{"version": "v1", "created": "Sat, 1 Aug 2009 00:40:37 GMT"}], "update_date": "2009-08-04", "authors_parsed": [["Latif", "Mohamed Abdel", ""], ["Sultan", "Ahmed", ""], ["Gamal", "Hesham El", ""]]}, {"id": "0908.0080", "submitter": "R Doomun", "authors": "Manas Paul, Tanmay Bhattacharya, Suvajit Pal, Ranit Saha", "title": "A Novel Generic Session Based Bit Level Encryption Technique to Enhance\n  Information Security", "comments": "7 Pages, International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 3, No. 1, July 2009, USA", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  - In this paper a session based symmetric key encryption system has been\nproposed and is termed as Permutated Cipher Technique (PCT). This technique is\nmore fast, suitable and secure for larger files. In this technique the input\nfile is broken down into blocks of various sizes (of 2 power n order) and\nencrypted by shifting the position of each bit by a certain value for a certain\nnumber of times. A key is generated randomly wherein the length of each block\nis determined. Each block length generates a unique value of number of bits to\nbe skipped. This value determines the new position of the bits within the block\nthat are to be shifted. After the shifting and inverting each block is XORed\nwith SHA 512 digest of the key. The resultant blocks from the cipher text. The\nkey is generated according to the binary value of the input file size.\nDecryption is done following the same process as the technique is symmetric.\n", "versions": [{"version": "v1", "created": "Sat, 1 Aug 2009 13:53:00 GMT"}], "update_date": "2009-08-04", "authors_parsed": [["Paul", "Manas", ""], ["Bhattacharya", "Tanmay", ""], ["Pal", "Suvajit", ""], ["Saha", "Ranit", ""]]}, {"id": "0908.0099", "submitter": "R Doomun", "authors": "Azeez Nureni Ayofe, Osunade Oluwaseyifunmitan", "title": "Approach To Solving Cybercrime And Cybersecurity", "comments": "11 Pages, International Journal of Computer Science and Information\n  Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, Vol. 3, No. 1, USA", "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cybercrime is becoming ever more serious. Findings from 2002 Computer Crime\nand Security Survey show an upward trend that demonstrates a need for a timely\nreview of existing approaches to fighting this new phenomenon in the\ninformation age. In this paper, we provide an overview of Cybercrime and\npresent an international perspective on fighting Cybercrime.\n  This work seeks to define the concept of cyber-crime, identify reasons for\ncyber-crime, how it can be eradicated, look at those involved and the reasons\nfor their involvement, we would look at how best to detect a criminal mail and\nin conclusion, proffer recommendations that would help in checking the\nincreasing rate of cyber-crimes and criminals.\n", "versions": [{"version": "v1", "created": "Sat, 1 Aug 2009 20:33:56 GMT"}], "update_date": "2009-08-04", "authors_parsed": [["Ayofe", "Azeez Nureni", ""], ["Oluwaseyifunmitan", "Osunade", ""]]}, {"id": "0908.0122", "submitter": "R Doomun", "authors": "Kalpana Sharma, M.K. Ghose, Kuldeep", "title": "Complete Security Framework for Wireless Sensor Networks", "comments": "7 pages, International Journal of Computer Science and Information\n  Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, Vol. 3 No. 1, USA", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security concern for a Sensor Networks and level of security desired may\ndiffer according to application specific needs where the sensor networks are\ndeployed. Till now, most of the security solutions proposed for sensor networks\nare layer wise i.e a particular solution is applicable to single layer itself.\nSo, to integrate them all is a new research challenge. In this paper we took up\nthe challenge and have proposed an integrated comprehensive security framework\nthat will provide security services for all services of sensor network. We have\nadded one extra component i.e. Intelligent Security Agent (ISA) to assess level\nof security and cross layer interactions. This framework has many components\nlike Intrusion Detection System, Trust Framework, Key Management scheme and\nLink layer communication protocol. We have also tested it on three different\napplication scenarios in Castalia and Omnet++ simulator.\n", "versions": [{"version": "v1", "created": "Sun, 2 Aug 2009 10:58:51 GMT"}], "update_date": "2009-08-04", "authors_parsed": [["Sharma", "Kalpana", ""], ["Ghose", "M. K.", ""], ["Kuldeep", "", ""]]}, {"id": "0908.0216", "submitter": "R Doomun", "authors": "A.W. Naji, Shihab A. Hameed,, B.B.Zaidan, Wajdi F. Al-Khateeb, Othman\n  O. Khalifa, A.A.Zaidan and Teddy S. Gunawan", "title": "Novel Framework for Hidden Data in the Image Page within Executable File\n  Using Computation between Advanced Encryption Standard and Distortion\n  Techniques", "comments": "6 Pages IEEE Format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, Vol. 3, No. 1, USA", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The hurried development of multimedia and internet allows for wide\ndistribution of digital media data. It becomes much easier to edit, modify and\nduplicate digital information. In additional, digital document is also easy to\ncopy and distribute, therefore it may face many threats. It became necessary to\nfind an appropriate protection due to the significance, accuracy and\nsensitivity of the information. Furthermore, there is no formal method to be\nfollowed to discover a hidden data. In this paper, a new information hiding\nframework is presented.The proposed framework aim is implementation of\nframework computation between advance encryption standard (AES) and distortion\ntechnique (DT) which embeds information in image page within executable file\n(EXE file) to find a secure solution to cover file without change the size of\ncover file. The framework includes two main functions; first is the hiding of\nthe information in the image page of EXE file, through the execution of four\nprocess (specify the cover file, specify the information file, encryption of\nthe information, and hiding the information) and the second function is the\nextraction of the hiding information through three process (specify the stego\nfile, extract the information, and decryption of the information).\n", "versions": [{"version": "v1", "created": "Mon, 3 Aug 2009 10:00:25 GMT"}], "update_date": "2009-08-04", "authors_parsed": [["Naji", "A. W.", ""], ["Hameed", "Shihab A.", ""], ["Zaidan", "B. B.", ""], ["Al-Khateeb", "Wajdi F.", ""], ["Khalifa", "Othman O.", ""], ["Zaidan", "A. A.", ""], ["Gunawan", "Teddy S.", ""]]}, {"id": "0908.0222", "submitter": "R Doomun", "authors": "E.A.Mary Anita, and V.Vasudevan", "title": "Performance Evaluation of Mesh based Multicast Reactive Routing Protocol\n  under Black Hole Attack", "comments": "6 Pages IEEE Format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, Vol. 3, No. 1, USA", "doi": null, "report-no": null, "categories": "cs.CR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A mobile ad-hoc network is an autonomous system of mobile nodes connected by\nwireless links in which nodes cooperate by forwarding packets for each other\nthereby enabling communication beyond direct wireless transmission range. The\nwireless and dynamic nature of ad-hoc networks makes them vulnerable to attacks\nespecially in routing protocols. Providing security in mobile ad-hoc networks\nhas been a major issue over the recent years. One of the prominent mesh base\nreactive multicast routing protocols used in ad-hoc networks is On Demand\nMulticast Routing protocol (ODMRP). The security of ODMRP is compromised by a\nprimary routing attack called black hole attack. In this attack a malicious\nnode advertises itself as having the shortest path to the node whose packets it\nwants to intercept. This paper discusses the impact of black hole attack on\nODMRP under various scenarios. The performance is evaluated using metrics such\nas packet delivery ratio and end to end delay for various numbers of senders\nand receivers via simulation. Simulations are carried out using network\nsimulator ns-2. The results enable us to propose solutions to counter the\neffect of black hole attack.\n", "versions": [{"version": "v1", "created": "Mon, 3 Aug 2009 10:47:42 GMT"}], "update_date": "2009-08-04", "authors_parsed": [["Anita", "E. A. Mary", ""], ["Vasudevan", "V.", ""]]}, {"id": "0908.0482", "submitter": "Shenghui Su", "authors": "Shenghui Su, Shuwang Lu", "title": "REESSE1+ . Reward . Proof by Experiment . A New Approach to Proof of P\n  != NP", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The authors discuss what is provable security in cryptography. Think that\nprovable security is asymptotic, relative, and dynamic, and only a supplement\nto but not a replacement of exact security analysis. Because the conjecture P\n!= NP has not been proven yet, and it is possible in terms of the two\nincompleteness theorems of Kurt Godel that there is some cryptosystem of which\nthe security cannot or only ideally be proven in the random oracle model, the\nsecurity of a cryptosystem is between provability and unprovability, and any\nacademic conclusion must be checked and verified with practices or experiments\nas much as possible. Extra, a new approach to proof of P != NP is pointed out.\nLastly, a reward is offered for the subexponential time solutions to the three\nREESSE1+ problems: MPP, ASPP, and TLP with n >= 80 and lg M >= 80, which may be\nregarded as a type of security proof by experiment.\n", "versions": [{"version": "v1", "created": "Tue, 4 Aug 2009 16:09:39 GMT"}, {"version": "v2", "created": "Sun, 10 Oct 2010 06:41:11 GMT"}, {"version": "v3", "created": "Thu, 15 Dec 2011 10:37:32 GMT"}, {"version": "v4", "created": "Thu, 7 Feb 2013 06:19:55 GMT"}, {"version": "v5", "created": "Tue, 26 Aug 2014 03:13:05 GMT"}], "update_date": "2014-08-27", "authors_parsed": [["Su", "Shenghui", ""], ["Lu", "Shuwang", ""]]}, {"id": "0908.0548", "submitter": "R Doomun", "authors": "Hanumanthappa J., Manjaiah D. H", "title": "IPv6 and IPv4 Threat reviews with Automatic Tunneling and Configuration\n  Tunneling Considerations Transitional Model:A Case Study for University of\n  Mysore Network", "comments": "12 Pages IEEE Format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, Vol. 3, No. 1, USA", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The actual transition from IPv4 to IPv6 requires network administrators to\nbecome aware of the next generation protocol and the associated risk\nproblems.Due to the scale and complexity of current internet architecture how\nto protect from the existing investment and reduce the negative influence to\nusers and service providers during the transition from IPv4 to IPv6 is a very\nimportant future topic for the advanced version of an internet\narchitecture.This paper summarizes and compares the IPv6 transition mechanism\nmethods like Dual Stack,Tunneling issues like IPv6 Automatic tunneling and\nmanually configured tunneling considerations, the IPv6 transition\nscenarios,IPv6 transition security problems,highlights IPv6 and IPv4 threat\nreview with automatic tunneling and configuration tunneling considerations.In\nthis paper we have proposed a transitional threat model for automatic tunneling\nand a configuration tunneling that could be followed by the University of\nMysore(UoM),to estimate automatic tunneling and a manually configured tunneling\nthreat review issues.Furthermore,there are different tunneling mechanisms such\nas IPv6 over IPv4 GRE Tunnel,Tunnel broker,Automatic IPv4 Compatible Tunnel and\nAutomatic 6 to 4 Tunnel and also outlines many of the common known threats\nagainst IPv6 and then it compares and contrast how these threats are similar\nones,might affect an IPv6 network.\n", "versions": [{"version": "v1", "created": "Tue, 4 Aug 2009 21:12:21 GMT"}], "update_date": "2009-08-06", "authors_parsed": [["J.", "Hanumanthappa", ""], ["H", "Manjaiah D.", ""]]}, {"id": "0908.0551", "submitter": "R Doomun", "authors": "Dr. Shishir Kumar, U.S. Rawat, Sameer Kumar Jasra, Akshay Kumar Jain", "title": "Efficient methodology for implementation of Encrypted File System in\n  User Space", "comments": "8 Pages IEEE Format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS July 2009, Vol. 3, No. 1, USA", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Encrypted File System (EFS) pushes encryption services into the file\nsystem itself. EFS supports secure storage at the system level through a\nstandard UNIX file system interface to encrypted files. User can associate a\ncryptographic key with the directories they wish to protect. Files in these\ndirectories (as well as their pathname components) are transparently encrypted\nand decrypted with the specified key without further user intervention; clear\ntext is never stored on a disk or sent to a remote file server. EFS can use any\navailable file system for its underlying storage without modifications,\nincluding remote file servers such as NFS. System management functions, such as\nfile backup, work in a normal manner and without knowledge of the key.\nPerformance is an important factor to users since encryption can be time\nconsuming. This paper describes the design and implementation of EFS in user\nspace using faster cryptographic algorithms on UNIX Operating system.\nImplementing EFS in user space makes it portable and flexible; Kernel size will\nalso not increase resulting in more reliable & efficient Operating System.\nEncryption techniques for file system level encryption are described, and\ngeneral issues of cryptographic system interfaces to support routine secure\ncomputing are discussed.\n", "versions": [{"version": "v1", "created": "Tue, 4 Aug 2009 21:30:18 GMT"}], "update_date": "2009-08-06", "authors_parsed": [["Kumar", "Dr. Shishir", ""], ["Rawat", "U. S.", ""], ["Jasra", "Sameer Kumar", ""], ["Jain", "Akshay Kumar", ""]]}, {"id": "0908.0898", "submitter": "Onur Ozan Koyluoglu", "authors": "O. Ozan Koyluoglu, C. Emre Koksal, and Hesham El Gamal", "title": "On Secrecy Capacity Scaling in Wireless Networks", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work studies the achievable secure rate per source-destination pair in\nwireless networks. First, a path loss model is considered, where the legitimate\nand eavesdropper nodes are assumed to be placed according to Poisson point\nprocesses with intensities $\\lambda$ and $\\lambda_e$, respectively. It is shown\nthat, as long as $\\lambda_e/\\lambda=o((\\log n)^{-2})$, almost all of the nodes\nachieve a perfectly secure rate of $\\Omega(\\frac{1}{\\sqrt{n}})$ for the\nextended and dense network models. Therefore, under these assumptions, securing\nthe network does not entail a loss in the per-node throughput. The\nachievability argument is based on a novel multi-hop forwarding scheme where\nrandomization is added in every hop to ensure maximal ambiguity at the\neavesdropper(s). Secondly, an ergodic fading model with $n$ source-destination\npairs and $n_e$ eavesdroppers is considered. Employing the ergodic interference\nalignment scheme with an appropriate secrecy pre-coding, each user is shown to\nachieve a constant positive secret rate for sufficiently large $n$. Remarkably,\nthe scheme does not require eavesdropper CSI (only the statistical knowledge is\nassumed) and the secure throughput per node increases as we add more legitimate\nusers to the network in this setting. Finally, the effect of eavesdropper\ncollusion on the performance of the proposed schemes is characterized.\n", "versions": [{"version": "v1", "created": "Thu, 6 Aug 2009 18:58:19 GMT"}, {"version": "v2", "created": "Sat, 10 Apr 2010 02:50:27 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Koyluoglu", "O. Ozan", ""], ["Koksal", "C. Emre", ""], ["Gamal", "Hesham El", ""]]}, {"id": "0908.0979", "submitter": "R Doomun", "authors": "A. Damodaram, H. Jayasri", "title": "Authentication Without Identification using Anonymous Credential System", "comments": "4 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS July 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 3, No. 1, July 2009, USA", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Privacy and security are often intertwined. For example, identity theft is\nrampant because we have become accustomed to authentication by identification.\nTo obtain some service, we provide enough information about our identity for an\nunscrupulous person to steal it (for example, we give our credit card number to\nAmazon.com). One of the consequences is that many people avoid e-commerce\nentirely due to privacy and security concerns. The solution is to perform\nauthentication without identification. In fact, all on-line actions should be\nas anonymous as possible, for this is the only way to guarantee security for\nthe overall system. A credential system is a system in which users can obtain\ncredentials from organizations and demonstrate possession of these credentials.\nSuch a system is anonymous when transactions carried out by the same user\ncannot be linked. An anonymous credential system is of significant practical\nrelevance because it is the best means of providing privacy for users.\n", "versions": [{"version": "v1", "created": "Fri, 7 Aug 2009 04:02:05 GMT"}], "update_date": "2009-08-10", "authors_parsed": [["Damodaram", "A.", ""], ["Jayasri", "H.", ""]]}, {"id": "0908.0981", "submitter": "R Doomun", "authors": "Syed S. Rizvi, and Khaled M. Elleithy", "title": "A New Scheme for Minimizing Malicious Behavior of Mobile Nodes in Mobile\n  Ad Hoc Networks", "comments": "10 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS July 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 3, No. 1, July 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of Mobile Ad hoc networks (MANET) depends on the cooperation\nof all active nodes. However, supporting a MANET is a cost-intensive activity\nfor a mobile node. From a single mobile node perspective, the detection of\nroutes as well as forwarding packets consume local CPU time, memory,\nnetwork-bandwidth, and last but not least energy. We believe that this is one\nof the main factors that strongly motivate a mobile node to deny packet\nforwarding for others, while at the same time use their services to deliver its\nown data. This behavior of an independent mobile node is commonly known as\nmisbehaving or selfishness. A vast amount of research has already been done for\nminimizing malicious behavior of mobile nodes. However, most of them focused on\nthe methods/techniques/algorithms to remove such nodes from the MANET. We\nbelieve that the frequent elimination of such miss-behaving nodes never allowed\na free and faster growth of MANET. This paper provides a critical analysis of\nthe recent research wok and its impact on the overall performance of a MANET.\nIn this paper, we clarify some of the misconceptions in the understating of\nselfishness and miss-behavior of nodes. Moreover, we propose a mathematical\nmodel that based on the time division technique to minimize the malicious\nbehavior of mobile nodes by avoiding unnecessary elimination of bad nodes. Our\nproposed approach not only improves the resource sharing but also creates a\nconsistent trust and cooperation (CTC) environment among the mobile nodes. The\nsimulation results demonstrate the success of the proposed approach that\nsignificantly minimizes the malicious nodes and consequently maximizes the\noverall throughput of MANET than other well known schemes.\n", "versions": [{"version": "v1", "created": "Fri, 7 Aug 2009 04:33:50 GMT"}, {"version": "v2", "created": "Sun, 9 Aug 2009 07:01:54 GMT"}], "update_date": "2009-08-10", "authors_parsed": [["Rizvi", "Syed S.", ""], ["Elleithy", "Khaled M.", ""]]}, {"id": "0908.0994", "submitter": "R Doomun", "authors": "Dr. Durgesh Kumar Mishra, Neha Koria, Nikhil Kapoor, Ravish Bahety", "title": "A Secure Multi-Party Computation Protocol for Malicious Computation\n  Prevention for preserving privacy during Data Mining", "comments": "6 Pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS July 2009, ISSN 1947 5500, Impact Factor 0.423", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Volume 3, Number 1, July 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Secure Multi-Party Computation (SMC) allows parties with similar background\nto compute results upon their private data, minimizing the threat of\ndisclosure. The exponential increase in sensitive data that needs to be passed\nupon networked computers and the stupendous growth of internet has precipitated\nvast opportunities for cooperative computation, where parties come together to\nfacilitate computations and draw out conclusions that are mutually beneficial;\nat the same time aspiring to keep their private data secure. These computations\nare generally required to be done between competitors, who are obviously weary\nof each-others intentions. SMC caters not only to the needs of such parties but\nalso provides plausible solutions to individual organizations for problems like\nprivacy-preserving database query, privacy-preserving scientific computations,\nprivacy-preserving intrusion detection and privacy-preserving data mining. This\npaper is an extension to a previously proposed protocol Encrytpo_Random, which\npresented a plain sailing yet effective approach to SMC and also put forward an\naptly crafted architecture, whereby such an efficient protocol, involving the\nparties that have come forward for joint-computations and the third party who\nundertakes such computations, can be developed. Through this extended work an\nattempt has been made to further strengthen the existing protocol thus paving\nthe way for a more secure multi-party computational process.\n", "versions": [{"version": "v1", "created": "Fri, 7 Aug 2009 07:22:06 GMT"}], "update_date": "2009-08-10", "authors_parsed": [["Mishra", "Dr. Durgesh Kumar", ""], ["Koria", "Neha", ""], ["Kapoor", "Nikhil", ""], ["Bahety", "Ravish", ""]]}, {"id": "0908.1185", "submitter": "Carlos Javier Hernandez-Castro", "authors": "Carlos Javier Hernandez-Castro, Arturo Ribagorda, Yago Saez", "title": "Side-channel attack on labeling CAPTCHAs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new scheme of attack on the Microsoft's ASIRRA CAPTCHA which\nrepresents a significant shortcut to the intended attacking path, as it is not\nbased in any advance in the state of the art on the field of image recognition.\nAfter studying the ASIRRA Public Corpus, we conclude that the security margin\nas stated by their authors seems to be quite optimistic. Then, we analyze which\nof the studied parameters for the image files seems to disclose the most\nvaluable information for helping in correct classification, arriving at a\nsurprising discovery. This represents a completely new approach to breaking\nCAPTCHAs that can be applied to many of the currently proposed image-labeling\nalgorithms, and to prove this point we show how to use the very same approach\nagainst the HumanAuth CAPTCHA. Lastly, we investigate some measures that could\nbe used to secure the ASIRRA and HumanAuth schemes, but conclude no easy\nsolutions are at hand.\n", "versions": [{"version": "v1", "created": "Sat, 8 Aug 2009 19:54:01 GMT"}], "update_date": "2009-08-11", "authors_parsed": [["Hernandez-Castro", "Carlos Javier", ""], ["Ribagorda", "Arturo", ""], ["Saez", "Yago", ""]]}, {"id": "0908.1805", "submitter": "Javad Ghaderi", "authors": "J. Ghaderi and R. Srikant", "title": "Towards a Theory of Anonymous Networking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of anonymous networking when an eavesdropper observes packet\ntimings in a communication network is considered. The goal is to hide the\nidentities of source-destination nodes, and paths of information flow in the\nnetwork. One way to achieve such an anonymity is to use mixers. Mixers are\nnodes that receive packets from multiple sources and change the timing of\npackets, by mixing packets at the output links, to prevent the eavesdropper\nfrom finding sources of outgoing packets. In this paper, we consider two simple\nbut fundamental scenarios: double input-single output mixer and double\ninput-double output mixer. For the first case, we use the information-theoretic\ndefinition of the anonymity, based on average entropy per packet, and find an\noptimal mixing strategy under a strict latency constraint. For the second case,\nperfect anonymity is considered, and maximal throughput strategies with perfect\nanonymity are found under a strict latency constraint and an average queue\nlength constraint.\n", "versions": [{"version": "v1", "created": "Wed, 12 Aug 2009 22:23:13 GMT"}, {"version": "v2", "created": "Sun, 20 Nov 2011 23:51:08 GMT"}, {"version": "v3", "created": "Mon, 12 Nov 2012 22:29:06 GMT"}], "update_date": "2012-11-14", "authors_parsed": [["Ghaderi", "J.", ""], ["Srikant", "R.", ""]]}, {"id": "0908.2042", "submitter": "Ryutaroh Matsumoto", "authors": "Ryutaroh Matsumoto", "title": "Problems in application of LDPC codes to information reconciliation in\n  quantum key distribution protocols", "comments": "10 pages, 1 figure. short survey article", "journal-ref": null, "doi": null, "report-no": "IT2009-41", "categories": "cs.IT cs.CR math.IT quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The information reconciliation in a quantum key distribution protocol can be\nstudied separately from other steps in the protocol. The problem of information\nreconciliation can be reduced to that of distributed source coding. Its\nsolution by LDPC codes is reviewed. We list some obstacles preventing the\nLDPC-based distributed source coding from becoming a more favorable alternative\nto the Cascade protocol for information reconciliation in quantum key\ndistribution protocols. This exposition does not require knowledge of the\nquantum theory.\n", "versions": [{"version": "v1", "created": "Fri, 14 Aug 2009 11:36:12 GMT"}, {"version": "v2", "created": "Sun, 13 Sep 2009 10:19:58 GMT"}], "update_date": "2009-09-13", "authors_parsed": [["Matsumoto", "Ryutaroh", ""]]}, {"id": "0908.2328", "submitter": "Yara Omar", "authors": "Yara Omar, Moustafa Youssef, Hesham El Gamal", "title": "ARQ Secrecy: From Theory to Practice", "comments": "5 pages, invited to ITW'09", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by our earlier work on Automatic Repeat reQuest (ARQ) secrecy, we\npropose a simple, yet efficient, security overlay protocol to existing 802.11\nnetworks. Our work targets networks secured by the Wired Equivalent Privacy\n(WEP) protocol because of its widespread use and vulnerability to a multitude\nof security threats. By exploiting the existing ARQ protocol in the 802.11\nstandard, our proposed opportunistic secrecy scheme is shown to defend against\nall known passive WEP attacks. Moreover, our implementation on the madwifi-ng\ndriver is used to establish the achievability of a vanishing secrecy outage\nprobability in several realistic scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 17 Aug 2009 11:23:30 GMT"}], "update_date": "2009-08-18", "authors_parsed": [["Omar", "Yara", ""], ["Youssef", "Moustafa", ""], ["Gamal", "Hesham El", ""]]}, {"id": "0908.2397", "submitter": "Xiaojun Tang", "authors": "Xiaojun Tang, Ruoheng Liu, Predrag Spasojevic, and H. Vincent Poor", "title": "Interference Assisted Secret Communication", "comments": "submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2121450", "report-no": "WINLAB-09-0817", "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless communication is susceptible to eavesdropping attacks because of its\nbroadcast nature. This paper illustrates how interference can be used to\ncounter eavesdropping and assist secrecy. In particular, a wire-tap channel\nwith a helping interferer (WT-HI) is considered. Here, a transmitter sends a\nconfidential message to its intended receiver in the presence of a passive\neavesdropper and with the help of an independent interferer. The interferer,\nwhich does not know the confidential message, helps in ensuring the secrecy of\nthe message by sending an independent signal. An achievable secrecy rate and\nseveral computable outer bounds on the secrecy capacity of the WT-HI are given\nfor both discrete memoryless and Gaussian channels.\n", "versions": [{"version": "v1", "created": "Mon, 17 Aug 2009 17:07:36 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Tang", "Xiaojun", ""], ["Liu", "Ruoheng", ""], ["Spasojevic", "Predrag", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0908.2462", "submitter": "Hyoungshick Kim", "authors": "Ji Won Yoon, Hyoungshick Kim and Jun Ho Huh", "title": "Hybrid Spam Filtering for Mobile Communication", "comments": "6 pages, 5 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spam messages are an increasing threat to mobile communication. Several\nmitigation techniques have been proposed, including white and black listing,\nchallenge-response and content-based filtering. However, none are perfect and\nit makes sense to use a combination rather than just one. We propose an\nanti-spam framework based on the hybrid of content-based filtering and\nchallenge-response. There is the trade-offs between accuracy of anti-spam\nclassifiers and the communication overhead. Experimental results show how,\ndepending on the proportion of spam messages, different filtering %%@\nparameters should be set.\n", "versions": [{"version": "v1", "created": "Mon, 17 Aug 2009 23:10:02 GMT"}], "update_date": "2009-08-19", "authors_parsed": [["Yoon", "Ji Won", ""], ["Kim", "Hyoungshick", ""], ["Huh", "Jun Ho", ""]]}, {"id": "0908.2496", "submitter": "Chengqing Li", "authors": "Chengqing Li, Shujun Li, Kowk-Tung Lo and Kyandoghere Kyamakya", "title": "A Differential Cryptanalysis of Yen-Chen-Wu Multimedia Cryptography\n  System (MCS)", "comments": "22 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  At ISCAS'2005, Yen et al. presented a new chaos-based cryptosystem for\nmultimedia transmission named \"Multimedia Cryptography System\" (MCS). No\ncryptanalytic results have been reported so far. This paper presents a\ndifferential attack to break MCS, which requires only seven chosen plaintexts.\nThe complexity of the attack is O(N), where $N$ is the size of plaintext.\nExperimental results are also given to show the real performance of the\nproposed attack.\n", "versions": [{"version": "v1", "created": "Tue, 18 Aug 2009 07:02:14 GMT"}], "update_date": "2009-08-19", "authors_parsed": [["Li", "Chengqing", ""], ["Li", "Shujun", ""], ["Lo", "Kowk-Tung", ""], ["Kyamakya", "Kyandoghere", ""]]}, {"id": "0908.2509", "submitter": "Mounita Saha", "authors": "Mounita Saha, Dipanwita Roy Chowdhury", "title": "A Secure and Efficient Protocol for Group Key agreement in Heterogeneous\n  Environment", "comments": "9 pages, 3 figures, Conference paper in Secrypt 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Secure group communication in heterogeneous environment is gaining popularity\ndue to the advent of wireless and ubiquitous computing. Although a number of\nprotocols for group key agreement have been proposed, most of them are not\napplicable in heterogeneous environment where a number of computationally\nlimited nodes coexist with one or more computationally efficient nodes. Among\nthe few existing protocols, where some fail to satisfy the key agreement\nproperties, some are unable to handle the agreement for dynamic group. In this\nwork, we propose a constant round group key agreement protocol for\nheterogeneous environment using polynomial interpolation. The protocol ensures\nboth communication and computation efficiency by shifting the major computation\nload on powerful users, achieves true contributory key agreement property and\ndynamic handling of user join and leave. The security of the protocol has been\nanalyzed under formal model. The comparison result shows considerable\nimprovement in protocol efficiency compared to the existing ones.\n", "versions": [{"version": "v1", "created": "Tue, 18 Aug 2009 07:34:17 GMT"}], "update_date": "2009-08-19", "authors_parsed": [["Saha", "Mounita", ""], ["Chowdhury", "Dipanwita Roy", ""]]}, {"id": "0908.2871", "submitter": "Bela Genge", "authors": "Bela Genge, Piroska Haller, Iosif Ignat, Ovidiu Ratoi", "title": "Informal specification-based performance evaluation of security\n  protocols", "comments": "4th IEEE International Conference on Intelligent Computer\n  Communication and Processing, Cluj-Napoca, Romania, pp. 193-200, Aug. 2008,\n  ISBN 978-1-4244-2673-7", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a performance evaluation method for security protocols. Based on\nthe informal specification, we construct a canonical model which includes,\nalongside protocol messages, cryptographic operations performed by participants\nin the process of message construction. Each cryptographic operation is\nassigned a cost modeled as a function of the size of processed message\ncomponents. We model not only the size of regular message components but also\nthe size of ciphertext produced by various cryptographic operations. We\nillustrate the applicability of our method by comparatively analyzing the\nperformance of the original CCITT X.509 protocol and a slightly modified\nversion of the same protocol.\n", "versions": [{"version": "v1", "created": "Thu, 20 Aug 2009 08:04:14 GMT"}], "update_date": "2009-08-21", "authors_parsed": [["Genge", "Bela", ""], ["Haller", "Piroska", ""], ["Ignat", "Iosif", ""], ["Ratoi", "Ovidiu", ""]]}, {"id": "0908.2905", "submitter": "Amitabh Saxena", "authors": "Octavian Catrina and Amitabh Saxena and Sebastiaan J Hoogh", "title": "Secure Linear Programming Using Privacy-Preserving Simplex", "comments": "The current version is withdrawn due to a error. An older version of\n  the paper is available on this archive. Please contact the author(s) for an\n  updated copy", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This version of the paper has been withdrawn due to an error. Please contact\none of the authors for an updated copy.\n", "versions": [{"version": "v1", "created": "Thu, 20 Aug 2009 11:20:01 GMT"}, {"version": "v2", "created": "Wed, 26 Aug 2009 10:16:08 GMT"}, {"version": "v3", "created": "Mon, 18 Jan 2010 03:01:47 GMT"}], "update_date": "2010-01-18", "authors_parsed": [["Catrina", "Octavian", ""], ["Saxena", "Amitabh", ""], ["Hoogh", "Sebastiaan J", ""]]}, {"id": "0908.3083", "submitter": "Bela Genge", "authors": "Bela Genge, Piroska Haller, Ovidiu Ratoi, Iosif Ignat", "title": "Term-based composition of security protocols", "comments": "2008 IEEE International Conference on Automation, Quality and\n  Testing, Robotics, Cluj-Napoca, Romania, May 2008, pp. 233-238, ISBN\n  978-1-4244-2576-1", "journal-ref": null, "doi": "10.1109/AQTR.2008.4588741", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of security protocol parallel composition, where messages\nbelonging to different protocols can intersect each other, we introduce a new\nparadigm: term-based composition (i.e. the composition of message components\nalso known as terms). First, we create a protocol specification model by\nextending the original strand spaces. Then, we provide a term composition\nalgorithm based on which new terms can be constructed. To ensure that security\nproperties are maintained, we introduce the concept of term connections to\nexpress the existing connections between terms and encryption contexts. We\nillustrate the proposed composition process by using two existing protocols.\n", "versions": [{"version": "v1", "created": "Fri, 21 Aug 2009 09:52:12 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Genge", "Bela", ""], ["Haller", "Piroska", ""], ["Ratoi", "Ovidiu", ""], ["Ignat", "Iosif", ""]]}, {"id": "0908.3090", "submitter": "Bela Genge", "authors": "Bela Genge, Piroska Haller", "title": "A Modeling Framework for Generating Security Protocol Specifications", "comments": "10th International Symposium on Symbolic and Numeric Algorithms for\n  Scientific Computing (SYNASC'08), Workshop on Global Computing Models and\n  Technologies, Timisoara, Romania, Sept. 2008, pp. 362-365, ISBN\n  978-0-7695-3523-4", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a modeling framework for generating security protocol\nspecifications. The generated protocol specifications rely on the use of a\nsequential and a semantical component. The first component defines protocol\nproperties such as preconditions, effects, message sequences and it is\ndeveloped as a WSDL-S specification. The second component defines the semantic\naspects corresponding to the messages included in the first component by the\nuse of ontological constructions and it is developed as an OWL-based\nspecification. Our approach was validated on 13 protocols from which we\nmention: the ISO9798 protocol, the CCITTX.509 data transfer protocol and the\nKerberos symmetric key protocol.\n", "versions": [{"version": "v1", "created": "Fri, 21 Aug 2009 10:16:25 GMT"}], "update_date": "2009-08-24", "authors_parsed": [["Genge", "Bela", ""], ["Haller", "Piroska", ""]]}, {"id": "0908.3587", "submitter": "R Doomun", "authors": "Siti Rahayu S., Robiah Y., Shahrin S., Faizal M. A., Mohd Zaki M, Irda\n  R", "title": "Tracing Technique for Blaster Attack", "comments": "8 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Volume 4, No. 1, August 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blaster worm of 2003 is still persistent, the infection appears to have\nsuccessfully transitioned to new hosts as the original systems are cleaned or\nshut off, suggesting that the Blaster worm, and other similar worms, will\nremain significant Internet threats for many years after their initial release.\nThis paper is to propose technique on tracing the Blaster attack from various\nlogs in different OSI layers based on fingerprint of Blaster attack on victim\nlogs, attacker logs and IDS alert log. The researchers intended to do a\npreliminary investigation upon this particular attack so that it can be used\nfor further research in alert correlation and computer forensic investigation.\n", "versions": [{"version": "v1", "created": "Tue, 25 Aug 2009 10:32:52 GMT"}], "update_date": "2009-08-26", "authors_parsed": [["S.", "Siti Rahayu", ""], ["Y.", "Robiah", ""], ["S.", "Shahrin", ""], ["A.", "Faizal M.", ""], ["M", "Mohd Zaki", ""], ["R", "Irda", ""]]}, {"id": "0908.3689", "submitter": "Renuka Kandregula", "authors": "Renuka Kandregula", "title": "A DHT Based Measure of Randomness", "comments": "15 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a new discrete Hilbert transform (DHT) based measure of\nrandomness for discrete sequences. The measure has been used to test three\ndifferent classes of sequences with satisfactory results.\n", "versions": [{"version": "v1", "created": "Tue, 25 Aug 2009 21:16:39 GMT"}], "update_date": "2009-08-27", "authors_parsed": [["Kandregula", "Renuka", ""]]}, {"id": "0908.3710", "submitter": "Moustafa Youssef", "authors": "Aly El Gamal, Moustafa Youssef, and Hesham El Gamal", "title": "Randomization for Security in Half-Duplex Two-Way Gaussian Channels", "comments": null, "journal-ref": "Globecom 2009", "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a new physical layer framework for secure two-way\nwireless communication in the presence of a passive eavesdropper, i.e., Eve.\nOur approach achieves perfect information theoretic secrecy via a novel\nrandomized scheduling and power allocation scheme. The key idea is to allow\nAlice and Bob to send symbols at random time instants. While Alice will be able\nto determine the symbols transmitted by Bob, Eve will suffer from ambiguity\nregarding the source of any particular symbol. This desirable ambiguity is\nenhanced, in our approach, by randomizing the transmit power level. Our\ntheoretical analysis, in a 2-D geometry, reveals the ability of the proposed\napproach to achieve relatively high secure data rates under mild conditions on\nthe spatial location of Eve. These theoretical claims are then validated by\nexperimental results using IEEE 802.15.4-enabled sensor boards in different\nconfigurations, motivated by the spatial characteristics of Wireless Body Area\nNetworks (WBAN).\n", "versions": [{"version": "v1", "created": "Wed, 26 Aug 2009 00:41:13 GMT"}], "update_date": "2009-08-27", "authors_parsed": [["Gamal", "Aly El", ""], ["Youssef", "Moustafa", ""], ["Gamal", "Hesham El", ""]]}, {"id": "0908.3731", "submitter": "Edlyn Teske", "authors": "Jennifer Balakrishnan, Juliana Belding, Sarah Chisholm, Kirsten\n  Eisentraeger, Katherine Stange, Edlyn Teske", "title": "Pairings on hyperelliptic curves", "comments": "v2: with corrections and improvements in sections 4 and 5", "journal-ref": "Fields Institute Communications 60 (2011) 87-120", "doi": null, "report-no": null, "categories": "math.NT cs.CR math.AG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We assemble and reorganize the recent work in the area of hyperelliptic\npairings: We survey the research on constructing hyperelliptic curves suitable\nfor pairing-based cryptography. We also showcase the hyperelliptic pairings\nproposed to date, and develop a unifying framework. We discuss the techniques\nused to optimize the pairing computation on hyperelliptic curves, and present\nmany directions for further research.\n", "versions": [{"version": "v1", "created": "Wed, 26 Aug 2009 06:28:35 GMT"}, {"version": "v2", "created": "Wed, 23 Sep 2009 04:13:02 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Balakrishnan", "Jennifer", ""], ["Belding", "Juliana", ""], ["Chisholm", "Sarah", ""], ["Eisentraeger", "Kirsten", ""], ["Stange", "Katherine", ""], ["Teske", "Edlyn", ""]]}, {"id": "0908.3930", "submitter": "Michael Sirivianos", "authors": "Michael Sirivianos, Xiaowei Yang, Kyungbaek Kim", "title": "SocialFilter: Collaborative Spam Mitigation using Social Networks", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spam mitigation can be broadly classified into two main approaches: a)\ncentralized security infrastructures that rely on a limited number of trusted\nmonitors to detect and report malicious traffic; and b) highly distributed\nsystems that leverage the experiences of multiple nodes within distinct trust\ndomains. The first approach offers limited threat coverage and slow response\ntimes, and it is often proprietary. The second approach is not widely adopted,\npartly due to the lack of guarantees regarding the trustworthiness of nodes\nthat comprise the system.\n  Our proposal, SocialFilter, aims to achieve the trustworthiness of\ncentralized security services and the wide coverage, responsiveness and\ninexpensiveness of large-scale collaborative spam mitigation. We propose a\nlarge-scale distributed system that enables clients with no email\nclassification functionality to query the network on the behavior of a host. A\nSocialFilter node builds trust for its peers by auditing their behavioral\nreports and by leveraging the social network of SocialFilter administrators.\nThe node combines the confidence its peers have in their own reports and the\ntrust it places on its peers to derive the likelihood that a host is spamming.\n  The simulation-based evaluation of our approach indicates its potential under\na real-world deployment: during a simulated spam campaign, SocialFilternodes\ncharacterized 92% of spam bot connections with confidence greater than 50%,\nwhile yielding no false positives\n", "versions": [{"version": "v1", "created": "Thu, 27 Aug 2009 02:34:11 GMT"}], "update_date": "2009-08-28", "authors_parsed": [["Sirivianos", "Michael", ""], ["Yang", "Xiaowei", ""], ["Kim", "Kyungbaek", ""]]}, {"id": "0908.4062", "submitter": "R Doomun", "authors": "Sushma Kejgir, and Manesh Kokare", "title": "Optimization of Bit Plane Combination for Efficient Digital Image\n  Watermarking", "comments": "10 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 4, No. 1 & No. 2, August 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In view of the frequent multimedia data transfer authentication and\nprotection of images has gained importance in todays world. In this paper we\npropose a new watermarking technique, based on bit plane, which enhances\nrobustness and capacity of the watermark, as well as maintains transparency of\nthe watermark and fidelity of the image. In the proposed technique, higher\nstrength bit plane of digital signature watermark is embedded in to a\nsignificant bit plane of the original image. The combination of bit planes\n(image and watermark) selection is an important issue. Therefore, a mechanism\nis developed for appropriate bit plane selection. Ten different attacks are\nselected to test different alternatives. These attacks are given different\nweightings as appropriate to user requirement. A weighted correlation\ncoefficient for retrieved watermark is estimated for each of the alternatives.\nBased on these estimated values optimal bit plane combination is identified for\na given user requirement. The proposed method is found to be useful for\nauthentication and to prove legal ownership. We observed better results by our\nproposed method in comparison with the previously reported work on pseudorandom\nwatermark embedded in least significant bit (LSB) plane.\n", "versions": [{"version": "v1", "created": "Thu, 27 Aug 2009 18:52:26 GMT"}], "update_date": "2009-08-28", "authors_parsed": [["Kejgir", "Sushma", ""], ["Kokare", "Manesh", ""]]}, {"id": "0908.4116", "submitter": "Nikos Triandopoulos", "authors": "Michael T. Goodrich, Roberto Tamassia, Nikos Triandopoulos", "title": "Efficient Authenticated Data Structures for Graph Connectivity and\n  Geometric Search Problems", "comments": "Full version of related paper appearing in CT-RSA 2003", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Authenticated data structures provide cryptographic proofs that their answers\nare as accurate as the author intended, even if the data structure is being\ncontrolled by a remote untrusted host. We present efficient techniques for\nauthenticating data structures that represent graphs and collections of\ngeometric objects. We introduce the path hash accumulator, a new primitive\nbased on cryptographic hashing for efficiently authenticating various\nproperties of structured data represented as paths, including any decomposable\nquery over sequences of elements. We show how to employ our primitive to\nauthenticate queries about properties of paths in graphs and search queries on\nmulti-catalogs. This allows the design of new, efficient authenticated data\nstructures for fundamental problems on networks, such as path and connectivity\nqueries over graphs, and complex queries on two-dimensional geometric objects,\nsuch as intersection and containment queries.\n", "versions": [{"version": "v1", "created": "Fri, 28 Aug 2009 00:18:06 GMT"}], "update_date": "2009-08-31", "authors_parsed": [["Goodrich", "Michael T.", ""], ["Tamassia", "Roberto", ""], ["Triandopoulos", "Nikos", ""]]}, {"id": "0908.4188", "submitter": "R Doomun", "authors": "Suman Saha", "title": "Consideration Points Detecting Cross-Site Scripting", "comments": "8 Pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact Factor 0.423,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 4, No. 1 & 2, August 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web application (WA) expands its usages to provide more and more services and\nit has become one of the most essential communication channels between service\nproviders and the users. To augment the users experience many web applications\nare using client side scripting languages such as JavaScript but this growing\nof JavaScript is increasing serious security vulnerabilities in web application\ntoo, such as cross site scripting (XSS). In this paper, I survey all the\ntechniques those have been used to detect XSS and arrange a number of analyses\nto evaluate performances of those methodologies. This paper points major\ndifficulties to detect XSS. I do not implement any solution of this\nvulnerability problem because my focus is for reviewing this issue. But, I\nbelieve that this assessment will be cooperative for further research on this\nconcern as this treatise figure out everything on this transcendent security\nproblem.\n", "versions": [{"version": "v1", "created": "Fri, 28 Aug 2009 11:01:27 GMT"}], "update_date": "2009-08-31", "authors_parsed": [["Saha", "Suman", ""]]}, {"id": "0908.4325", "submitter": "Bela Genge", "authors": "Bela Genge, Iosif Ignat and Piroska Haller", "title": "Automated Composition of Security Protocols", "comments": "2009 IEEE International Conference on Intelligent Communication and\n  Processing (ICCP 2009), Cluj-Napoca, Romania, pp. 251-258 (ISBN\n  978-1-4244-5007-7)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Determining if two protocols can be securely composed requires analyzing not\nonly their additive properties but also their destructive properties. In this\npaper we propose a new composition method for constructing protocols based on\nexisting ones found in the literature that can be fully automatized. The\nadditive properties of the composed protocols are ensured by the composition of\nprotocol preconditions and effects, denoting, respectively, the conditions that\nmust hold for protocols to be executed and the conditions that hold after\nexecuting the protocols. The non-destructive property of the final composed\nprotocol is verified by analyzing the independence of the involved protocols, a\nmethod proposed by the authors in their previous work. The fully automatized\nproperty is ensured by constructing a rich protocol model that contains\nexplicit description of protocol preconditions, effects, generated terms and\nexchanged messages. The proposed method is validated by composing 17 protocol\npairs and by verifying the correctness of the composed protocols with an\nexisting tool.\n", "versions": [{"version": "v1", "created": "Sat, 29 Aug 2009 07:13:36 GMT"}], "update_date": "2009-09-01", "authors_parsed": [["Genge", "Bela", ""], ["Ignat", "Iosif", ""], ["Haller", "Piroska", ""]]}]