[{"id": "0709.0896", "submitter": "Michael J. Kurtz", "authors": "Michael J. Kurtz, Edwin A. Henneken", "title": "Open Access does not increase citations for research articles from The\n  Astrophysical Journal", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY", "license": null, "abstract": "  We demonstrate conclusively that there is no \"Open Access Advantage\" for\npapers from the Astrophysical Journal. The two to one citation advantage\nenjoyed by papers deposited in the arXiv e-print server is due entirely to the\nnature and timing of the deposited papers. This may have implications for other\ndisciplines.\n", "versions": [{"version": "v1", "created": "Thu, 6 Sep 2007 16:00:43 GMT"}], "update_date": "2007-09-07", "authors_parsed": [["Kurtz", "Michael J.", ""], ["Henneken", "Edwin A.", ""]]}, {"id": "0709.2562", "submitter": "Paolo Laureti", "authors": "Marcel Blattner, Alexander Hunziker, Paolo Laureti", "title": "When are recommender systems useful?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.CY cs.DL cs.DS physics.data-an physics.soc-ph", "license": null, "abstract": "  Recommender systems are crucial tools to overcome the information overload\nbrought about by the Internet. Rigorous tests are needed to establish to what\nextent sophisticated methods can improve the quality of the predictions. Here\nwe analyse a refined correlation-based collaborative filtering algorithm and\ncompare it with a novel spectral method for recommending. We test them on two\ndatabases that bear different statistical properties (MovieLens and Jester)\nwithout filtering out the less active users and ordering the opinions in time,\nwhenever possible. We find that, when the distribution of user-user\ncorrelations is narrow, simple averages work nearly as well as advanced\nmethods. Recommender systems can, on the other hand, exploit a great deal of\nadditional information in systems where external influence is negligible and\npeoples' tastes emerge entirely. These findings are validated by simulations\nwith artificially generated data.\n", "versions": [{"version": "v1", "created": "Mon, 17 Sep 2007 09:27:07 GMT"}], "update_date": "2007-09-19", "authors_parsed": [["Blattner", "Marcel", ""], ["Hunziker", "Alexander", ""], ["Laureti", "Paolo", ""]]}]