[{"id": "0806.0081", "submitter": "Anna Zamansky", "authors": "Arnon Avron and Anna Zamansky", "title": "Canonical calculi with (n,k)-ary quantifiers", "comments": "Special Issue of IJCAR2006, edited by Prof. Natarajan Shankar, paper\n  LMCS-2007-204", "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 3 (August 6,\n  2008) lmcs:1139", "doi": "10.2168/LMCS-4(3:2)2008", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Propositional canonical Gentzen-type systems, introduced in 2001 by Avron and\nLev, are systems which in addition to the standard axioms and structural rules\nhave only logical rules in which exactly one occurrence of a connective is\nintroduced and no other connective is mentioned. A constructive coherence\ncriterion for the non-triviality of such systems was defined and it was shown\nthat a system of this kind admits cut-elimination iff it is coherent. The\nsemantics of such systems is provided using two-valued non-deterministic\nmatrices (2Nmatrices). In 2005 Zamansky and Avron extended these results to\nsystems with unary quantifiers of a very restricted form. In this paper we\nsubstantially extend the characterization of canonical systems to (n,k)-ary\nquantifiers, which bind k distinct variables and connect n formulas, and show\nthat the coherence criterion remains constructive for such systems. Then we\nfocus on the case of k&#8712;{0,1} and for a canonical calculus G show that it\nis coherent precisely when it has a strongly characteristic 2Nmatrix, which in\nturn is equivalent to admitting strong cut-elimination.\n", "versions": [{"version": "v1", "created": "Sat, 31 May 2008 15:35:40 GMT"}, {"version": "v2", "created": "Thu, 5 Jun 2008 20:04:14 GMT"}, {"version": "v3", "created": "Wed, 6 Aug 2008 15:34:52 GMT"}, {"version": "v4", "created": "Thu, 7 Aug 2008 17:23:35 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Avron", "Arnon", ""], ["Zamansky", "Anna", ""]]}, {"id": "0806.0103", "submitter": "Hans Adler", "authors": "Hans Adler and Isolde Adler", "title": "A note on clique-width and tree-width for structures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a simple proof that the straightforward generalisation of\nclique-width to arbitrary structures can be unbounded on structures of bounded\ntree-width. This can be corrected by allowing fusion of elements.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2008 10:41:48 GMT"}, {"version": "v2", "created": "Mon, 2 Jun 2008 21:35:39 GMT"}], "update_date": "2008-06-03", "authors_parsed": [["Adler", "Hans", ""], ["Adler", "Isolde", ""]]}, {"id": "0806.0250", "submitter": "Arjen Hommersom", "authors": "Arjen Hommersom, Peter J.F. Lucas, and Patrick van Bommel", "title": "Checking the Quality of Clinical Guidelines using Automated Reasoning\n  Tools", "comments": "To appear in Theory and Practice of Logic Programming", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO cs.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Requirements about the quality of clinical guidelines can be represented by\nschemata borrowed from the theory of abductive diagnosis, using temporal logic\nto model the time-oriented aspects expressed in a guideline. Previously, we\nhave shown that these requirements can be verified using interactive theorem\nproving techniques. In this paper, we investigate how this approach can be\nmapped to the facilities of a resolution-based theorem prover, Otter, and a\ncomplementary program that searches for finite models of first-order\nstatements, Mace. It is shown that the reasoning required for checking the\nquality of a guideline can be mapped to such fully automated theorem-proving\nfacilities. The medical quality of an actual guideline concerning diabetes\nmellitus 2 is investigated in this way.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2008 11:02:40 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Hommersom", "Arjen", ""], ["Lucas", "Peter J. F.", ""], ["van Bommel", "Patrick", ""]]}, {"id": "0806.0398", "submitter": "Wesley Calvert", "authors": "Wesley Calvert", "title": "Metric Structures and Probabilistic Computation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO math.FA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Continuous first-order logic is used to apply model-theoretic analysis to\nanalytic structures (e.g. Hilbert spaces, Banach spaces, probability spaces,\netc.). Classical computable model theory is used to examine the algorithmic\nstructure of mathematical objects that can be described in classical\nfirst-order logic. The present paper shows that probabilistic computation\n(sometimes called randomized computation) can play an analogous role for\nstructures described in continuous first-order logic. The main result of this\npaper is an effective completeness theorem, showing that every decidable\ncontinuous first-order theory has a probabilistically decidable model. Later\nsections give examples of the application of this framework to various classes\nof structures, and to some problems of computational complexity theory.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2008 21:15:00 GMT"}], "update_date": "2008-06-04", "authors_parsed": [["Calvert", "Wesley", ""]]}, {"id": "0806.0936", "submitter": "Roberto Amadio", "authors": "Roberto Amadio (PPS)", "title": "On convergence-sensitive bisimulation and the embedding of CCS in timed\n  CCS", "comments": null, "journal-ref": "Proceedings of the 15th Workshop on Expressiveness in Concurrency\n  (EXPRESS 2008), Canada (2008)", "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a notion of convergence-sensitive bisimulation that is built just\nover the notions of (internal) reduction and of (static) context. In the\nframework of timed CCS, we characterise this notion of `contextual'\nbisimulation via the usual labelled transition system. We also remark that it\nprovides a suitable semantic framework for a fully abstract embedding of\nuntimed processes into timed ones. Finally, we show that the notion can be\nrefined to include sensitivity to divergence.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2008 09:32:07 GMT"}, {"version": "v2", "created": "Thu, 18 Sep 2008 14:12:21 GMT"}], "update_date": "2010-07-01", "authors_parsed": [["Amadio", "Roberto", "", "PPS"]]}, {"id": "0806.1139", "submitter": "Miguel Andres", "authors": "Miguel E. Andres, Pedro D'Argenio, Peter van Rossum", "title": "Significant Diagnostic Counterexamples in Probabilistic Model Checking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a novel technique for counterexample generation in\nprobabilistic model checking of Markov Chains and Markov Decision Processes.\n(Finite) paths in counterexamples are grouped together in witnesses that are\nlikely to provide similar debugging information to the user. We list five\nproperties that witnesses should satisfy in order to be useful as debugging\naid: similarity, accuracy, originality, significance, and finiteness. Our\nwitnesses contain paths that behave similar outside strongly connected\ncomponents.\n  This papers shows how to compute these witnesses by reducing the problem of\ngenerating counterexamples for general properties over Markov Decision\nProcesses, in several steps, to the easy problem of generating counterexamples\nfor reachability properties over acyclic Markov Chains.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jun 2008 13:09:49 GMT"}], "update_date": "2008-06-09", "authors_parsed": [["Andres", "Miguel E.", ""], ["D'Argenio", "Pedro", ""], ["van Rossum", "Peter", ""]]}, {"id": "0806.1281", "submitter": "Wojciech Moczydlowski", "authors": "Robert Constable and Wojciech Moczydlowski", "title": "Extracting Programs from Constructive HOL Proofs via IZF\n  Set-Theoretic<br> Semantics", "comments": "17 pages", "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 3 (September\n  9, 2008) lmcs:1140", "doi": "10.2168/LMCS-4(3:5)2008", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Church's Higher Order Logic is a basis for influential proof assistants --\nHOL and PVS. Church's logic has a simple set-theoretic semantics, making it\ntrustworthy and extensible. We factor HOL into a constructive core plus axioms\nof excluded middle and choice. We similarly factor standard set theory, ZFC,\ninto a constructive core, IZF, and axioms of excluded middle and choice. Then\nwe provide the standard set-theoretic semantics in such a way that the\nconstructive core of HOL is mapped into IZF. We use the disjunction, numerical\nexistence and term existence properties of IZF to provide a program extraction\ncapability from proofs in the constructive core.\n  We can implement the disjunction and numerical existence properties in two\ndifferent ways: one using Rathjen's realizability for IZF and the other using a\nnew direct weak normalization result for IZF by Moczydlowski. The latter can\nalso be used for the term existence property.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jun 2008 13:43:46 GMT"}, {"version": "v2", "created": "Tue, 9 Sep 2008 14:47:24 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Constable", "Robert", ""], ["Moczydlowski", "Wojciech", ""]]}, {"id": "0806.1284", "submitter": "Chenggong Lv", "authors": "Chenggong Lv, Jun Wang, Lu Liu, and Weijia You", "title": "The Separation of Duty with Privilege Calculus", "comments": "RSKT2008 conference, LNAI 5009, pp.410-417, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents Privilege Calculus (PC) as a new approach of knowledge\nrepresentation for Separation of Duty (SD) in the view of process and intents\nto improve the reconfigurability and traceability of SD. PC presumes that the\nstructure of SD should be reduced to the structure of privilege and then the\nregulation of system should be analyzed with the help of forms of privilege.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jun 2008 15:13:45 GMT"}], "update_date": "2008-06-10", "authors_parsed": [["Lv", "Chenggong", ""], ["Wang", "Jun", ""], ["Liu", "Lu", ""], ["You", "Weijia", ""]]}, {"id": "0806.1413", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM, IMJ, LIP)", "title": "Topological Complexity of Context-Free omega-Languages: A Survey", "comments": null, "journal-ref": null, "doi": null, "report-no": "LIP Research Report RR 2008-17", "categories": "cs.LO cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey recent results on the topological complexity of context-free\nomega-languages which form the second level of the Chomsky hierarchy of\nlanguages of infinite words. In particular, we consider the Borel hierarchy and\nthe Wadge hierarchy of non-deterministic or deterministic context-free\nomega-languages. We study also decision problems, the links with the notions of\nambiguity and of degrees of ambiguity, and the special case of omega-powers.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2008 10:03:44 GMT"}, {"version": "v2", "created": "Tue, 12 Mar 2013 21:08:31 GMT"}], "update_date": "2013-03-14", "authors_parsed": [["Finkel", "Olivier", "", "ELM, IMJ, LIP"]]}, {"id": "0806.1602", "submitter": "Maurice Margenstern", "authors": "Margenstern Maurice", "title": "The injectivity of the global function of a cellular automaton in the\n  hyperbolic plane is undecidable", "comments": "9 figures this paper completely solves the problem tackled in\n  arXiv:0712.2577v2. This version is simply an improvement of the proof of the\n  result deposited in 0806.1602", "journal-ref": "The Injectivity of the Global Function of a Cellular Automaton in\n  the Hyperbolic Plane is Undecidable, Fundamenta Informaticae, 94(1), (2009),\n  63-99", "doi": null, "report-no": null, "categories": "cs.CG cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we look at the following question. We consider cellular\nautomata in the hyperbolic plane and we consider the global function defined on\nall possible configurations. Is the injectivity of this function undecidable?\nThe problem was answered positively in the case of the Euclidean plane by\nJarkko Kari, in 1994. In the present paper, we show that the answer is also\npositive for the hyperbolic plane: the problem is undecidable.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 10:58:30 GMT"}, {"version": "v2", "created": "Mon, 16 Jun 2008 15:14:03 GMT"}], "update_date": "2009-07-07", "authors_parsed": [["Maurice", "Margenstern", ""]]}, {"id": "0806.1636", "submitter": "Ian Pratt-Hartmann", "authors": "Ian Pratt-Hartmann", "title": "Data-Complexity of the Two-Variable Fragment with Counting Quantifiers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The data-complexity of both satisfiability and finite satisfiability for the\ntwo-variable fragment with counting is NP-complete; the data-complexity of both\nquery-answering and finite query-answering for the two-variable guarded\nfragment with counting is co-NP-complete.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 11:08:07 GMT"}], "update_date": "2008-06-11", "authors_parsed": [["Pratt-Hartmann", "Ian", ""]]}, {"id": "0806.1749", "submitter": "Jacek Chrz{\\ka}szcz", "authors": "Daria Walukiewicz-Chrzaszcz and Jacek Chrzaszcz", "title": "Consistency and Completeness of Rewriting in the Calculus of\n  Constructions", "comments": "20 pages", "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 3 (September\n  15, 2008) lmcs:1141", "doi": "10.2168/LMCS-4(3:8)2008", "report-no": null, "categories": "cs.LO cs.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adding rewriting to a proof assistant based on the Curry-Howard isomorphism,\nsuch as Coq, may greatly improve usability of the tool. Unfortunately adding an\narbitrary set of rewrite rules may render the underlying formal system\nundecidable and inconsistent. While ways to ensure termination and confluence,\nand hence decidability of type-checking, have already been studied to some\nextent, logical consistency has got little attention so far. In this paper we\nshow that consistency is a consequence of canonicity, which in turn follows\nfrom the assumption that all functions defined by rewrite rules are complete.\nWe provide a sound and terminating, but necessarily incomplete algorithm to\nverify this property. The algorithm accepts all definitions that follow\ndependent pattern matching schemes presented by Coquand and studied by McBride\nin his PhD thesis. It also accepts many definitions by rewriting, containing\nrules which depart from standard pattern matching.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 20:27:28 GMT"}, {"version": "v2", "created": "Mon, 15 Sep 2008 19:30:14 GMT"}, {"version": "v3", "created": "Mon, 15 Sep 2008 20:54:24 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Walukiewicz-Chrzaszcz", "Daria", ""], ["Chrzaszcz", "Jacek", ""]]}, {"id": "0806.1827", "submitter": "Fritz M\\\"uller", "authors": "Fritz M\\\"uller", "title": "Full Abstraction for a Recursively Typed Lambda Calculus with Parallel\n  Conditional", "comments": "54 pages", "journal-ref": null, "doi": null, "report-no": "revised Report 12/1993 of SFB 124, Informatik, Universitaet des\n  Saarlandes", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define the syntax and reduction relation of a recursively typed lambda\ncalculus with a parallel case-function (a parallel conditional). The reduction\nis shown to be confluent. We interpret the recursive types as information\nsystems in a restricted form, which we call prime systems. A denotational\nsemantics is defined with this interpretation. We define the syntactical normal\nform approximations of a term and prove the Approximation Theorem: The\nsemantics of a term equals the limit of the semantics of its approximations.\nThe proof uses inclusive predicates (logical relations). The semantics is\nadequate with respect to the observation of Boolean values. It is also fully\nabstract in the presence of the parallel case-function.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2008 15:29:47 GMT"}], "update_date": "2008-06-12", "authors_parsed": [["Müller", "Fritz", ""]]}, {"id": "0806.2264", "submitter": "Chantal Berline", "authors": "Chantal Berline (PPS), Giulio Manzonetto (PPS), Antonio Salibra", "title": "Effective lambda-models vs recursively enumerable lambda-theories", "comments": "34 p", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A longstanding open problem is whether there exists a non syntactical model\nof the untyped lambda-calculus whose theory is exactly the least lambda-theory\n(l-beta). In this paper we investigate the more general question of whether the\nequational/order theory of a model of the (untyped) lambda-calculus can be\nrecursively enumerable (r.e. for brevity). We introduce a notion of effective\nmodel of lambda-calculus calculus, which covers in particular all the models\nindividually introduced in the literature. We prove that the order theory of an\neffective model is never r.e.; from this it follows that its equational theory\ncannot be l-beta or l-beta-eta. We then show that no effective model living in\nthe stable or strongly stable semantics has an r.e. equational theory.\nConcerning Scott's semantics, we investigate the class of graph models and\nprove that no order theory of a graph model can be r.e., and that there exists\nan effective graph model whose equational/order theory is minimum among all\ntheories of graph models. Finally, we show that the class of graph models\nenjoys a kind of downwards Lowenheim-Skolem theorem.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jun 2008 15:02:03 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Berline", "Chantal", "", "PPS"], ["Manzonetto", "Giulio", "", "PPS"], ["Salibra", "Antonio", ""]]}, {"id": "0806.2448", "submitter": "Nobuko Yoshida Dr", "authors": "Nobuko Yoshida, Kohei Honda and Martin Berger", "title": "Logical Reasoning for Higher-Order Functions with Local State", "comments": "68 pages", "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 4 (October\n  20, 2008) lmcs:830", "doi": "10.2168/LMCS-4(4:2)2008", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an extension of Hoare logic for call-by-value higher-order\nfunctions with ML-like local reference generation. Local references may be\ngenerated dynamically and exported outside their scope, may store higher-order\nfunctions and may be used to construct complex mutable data structures. This\nprimitive is captured logically using a predicate asserting reachability of a\nreference name from a possibly higher-order datum and quantifiers over hidden\nreferences. We explore the logic's descriptive and reasoning power with\nnon-trivial programming examples combining higher-order procedures and\ndynamically generated local state. Axioms for reachability and local invariant\nplay a central role for reasoning about the examples.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jun 2008 14:43:25 GMT"}, {"version": "v2", "created": "Mon, 20 Oct 2008 08:47:19 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Yoshida", "Nobuko", ""], ["Honda", "Kohei", ""], ["Berger", "Martin", ""]]}, {"id": "0806.2517", "submitter": "Frederic Blanqui", "authors": "Fr\\'ed\\'eric Blanqui (INRIA Lorraine - LORIA), Jean-Pierre Jouannaud\n  (LIX, INRIA Saclay Ile de France), Albert Rubio", "title": "The computability path ordering: the end of a quest", "comments": "Dans CSL'08 (2008)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we first briefly survey automated termination proof methods\nfor higher-order calculi. We then concentrate on the higher-order recursive\npath ordering, for which we provide an improved definition, the Computability\nPath Ordering. This new definition appears indeed to capture the essence of\ncomputability arguments \\`a la Tait and Girard, therefore explaining the name\nof the improved ordering.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 11:39:25 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Blanqui", "Frédéric", "", "INRIA Lorraine - LORIA"], ["Jouannaud", "Jean-Pierre", "", "LIX, INRIA Saclay Ile de France"], ["Rubio", "Albert", ""]]}, {"id": "0806.2680", "submitter": "Joerg Endrullis", "authors": "Joerg Endrullis, Clemens Grabmayer, Dimitri Hendriks", "title": "Data-Oblivious Stream Productivity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are concerned with demonstrating productivity of specifications of\ninfinite streams of data, based on orthogonal rewrite rules. In general, this\nproperty is undecidable, but for restricted formats computable sufficient\nconditions can be obtained. The usual analysis disregards the identity of data,\nthus leading to approaches that we call data-oblivious. We present a method\nthat is provably optimal among all such data-oblivious approaches. This means\nthat in order to improve on the algorithm in this paper one has to proceed in a\ndata-aware fashion.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 22:02:56 GMT"}, {"version": "v2", "created": "Thu, 26 Jun 2008 16:06:16 GMT"}, {"version": "v3", "created": "Fri, 27 Jun 2008 14:18:25 GMT"}, {"version": "v4", "created": "Fri, 4 Jul 2008 15:05:51 GMT"}, {"version": "v5", "created": "Sat, 19 Jul 2008 22:45:16 GMT"}], "update_date": "2008-07-20", "authors_parsed": [["Endrullis", "Joerg", ""], ["Grabmayer", "Clemens", ""], ["Hendriks", "Dimitri", ""]]}, {"id": "0806.2802", "submitter": "Alexei Lisitsa", "authors": "Alexei Lisitsa", "title": "A logic with temporally accessible iteration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deficiency in expressive power of the first-order logic has led to developing\nits numerous extensions by fixed point operators, such as Least Fixed-Point\n(LFP), inflationary fixed-point (IFP), partial fixed-point (PFP), etc. These\nlogics have been extensively studied in finite model theory, database theory,\ndescriptive complexity. In this paper we introduce unifying framework, the\nlogic with iteration operator, in which iteration steps may be accessed by\ntemporal logic formulae. We show that proposed logic FO+TAI subsumes all\nmentioned fixed point extensions as well as many other fixed point logics as\nnatural fragments. On the other hand we show that over finite structures FO+TAI\nis no more expressive than FO+PFP. Further we show that adding the same\nmachinery to the logic of monotone inductions (FO+LFP) does not increase its\nexpressive power either.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2008 14:36:43 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Lisitsa", "Alexei", ""]]}, {"id": "0806.2923", "submitter": "Michael Luttenberger", "authors": "Michael Luttenberger", "title": "Strategy Iteration using Non-Deterministic Strategies for Solving Parity\n  Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article extends the idea of solving parity games by strategy iteration\nto non-deterministic strategies: In a non-deterministic strategy a player\nrestricts himself to some non-empty subset of possible actions at a given node,\ninstead of limiting himself to exactly one action. We show that a\nstrategy-improvement algorithm by by Bjoerklund, Sandberg, and Vorobyov can\neasily be adapted to the more general setting of non-deterministic strategies.\nFurther, we show that applying the heuristic of \"all profitable switches\" leads\nto choosing a \"locally optimal\" successor strategy in the setting of\nnon-deterministic strategies, thereby obtaining an easy proof of an algorithm\nby Schewe. In contrast to the algorithm by Bjoerklund et al., we present our\nalgorithm directly for parity games which allows us to compare it to the\nalgorithm by Jurdzinski and Voege: We show that the valuations used in both\nalgorithm coincide on parity game arenas in which one player can \"surrender\".\nThus, our algorithm can also be seen as a generalization of the one by\nJurdzinski and Voege to non-deterministic strategies. Finally, using\nnon-deterministic strategies allows us to show that the number of improvement\nsteps is bound from above by O(1.724^n). For strategy-improvement algorithms,\nthis bound was previously only known to be attainable by using randomization.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jun 2008 08:32:17 GMT"}, {"version": "v2", "created": "Thu, 19 Jun 2008 09:37:53 GMT"}, {"version": "v3", "created": "Fri, 27 Jun 2008 08:51:51 GMT"}, {"version": "v4", "created": "Mon, 19 Mar 2012 14:26:43 GMT"}], "update_date": "2012-03-20", "authors_parsed": [["Luttenberger", "Michael", ""]]}, {"id": "0806.2947", "submitter": "Rafee Ebrahim Kamouna Ph.D.", "authors": "Rafee Ebrahim Kamouna", "title": "The Kleene-Rosser Paradox, The Liar's Paradox & A Fuzzy Logic\n  Programming Paradox Imply SAT is (NOT) NP-complete", "comments": "Submitted to the ACM Transactions on Computation Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  After examining the {\\bf P} versus {\\bf NP} problem against the Kleene-Rosser\nparadox of the $\\lambda$-calculus [94], it was found that it represents a\ncounter-example to NP-completeness. We prove that it contradicts the proof of\nCook's theorem. A logical formalization of the liar's paradox leads to the same\nresult. This formalization of the liar's paradox into a computable form is a\n2-valued instance of a fuzzy logic programming paradox discovered in the system\nof [90]. Three proofs that show that {\\bf SAT} is (NOT) NP-complete are\npresented. The counter-example classes to NP-completeness are also\ncounter-examples to Fagin's theorem [36] and the Immermann-Vardi theorem\n[89,110], the fundamental results of descriptive complexity. All these results\nshow that {\\bf ZF$\\not$C} is inconsistent.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jun 2008 10:00:38 GMT"}, {"version": "v2", "created": "Thu, 19 Jun 2008 12:43:26 GMT"}, {"version": "v3", "created": "Mon, 23 Jun 2008 08:56:04 GMT"}, {"version": "v4", "created": "Mon, 22 Sep 2008 20:17:33 GMT"}, {"version": "v5", "created": "Mon, 29 Sep 2008 17:13:52 GMT"}, {"version": "v6", "created": "Mon, 29 Sep 2008 21:21:30 GMT"}, {"version": "v7", "created": "Fri, 3 Oct 2008 08:36:53 GMT"}, {"version": "v8", "created": "Fri, 10 Jul 2009 16:39:59 GMT"}], "update_date": "2011-11-10", "authors_parsed": [["Kamouna", "Rafee Ebrahim", ""]]}, {"id": "0806.3209", "submitter": "Russell O'Connor", "authors": "Russell O'Connor", "title": "A Computer Verified Theory of Compact Sets", "comments": "This paper is to be part of the proceedings of the Symbolic\n  Computation in Software Science Austrian-Japanese Workshop (SCSS 2008)", "journal-ref": null, "doi": null, "report-no": "RISC-Linz Report Series 08-08", "categories": "cs.LO", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Compact sets in constructive mathematics capture our intuition of what\ncomputable subsets of the plane (or any other complete metric space) ought to\nbe. A good representation of compact sets provides an efficient means of\ncreating and displaying images with a computer. In this paper, I build upon\nexisting work about complete metric spaces to define compact sets as the\ncompletion of the space of finite sets under the Hausdorff metric. This\ndefinition allowed me to quickly develop a computer verified theory of compact\nsets. I applied this theory to compute provably correct plots of uniformly\ncontinuous functions.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2008 18:09:01 GMT"}], "update_date": "2010-08-04", "authors_parsed": [["O'Connor", "Russell", ""]]}, {"id": "0806.3849", "submitter": "Etienne Lozes", "authors": "Daniel Hirschkoff, Etienne Lozes, Davide Sangiorgi", "title": "Separability in the Ambient Logic", "comments": "logical methods in computer science, 44 pages", "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 3 (September\n  4, 2008) lmcs:682", "doi": "10.2168/LMCS-4(3:4)2008", "report-no": null, "categories": "cs.LO cs.MA cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The \\it{Ambient Logic} (AL) has been proposed for expressing properties of\nprocess mobility in the calculus of Mobile Ambients (MA), and as a basis for\nquery languages on semistructured data. We study some basic questions\nconcerning the discriminating power of AL, focusing on the equivalence on\nprocesses induced by the logic $(=_L>)$. As underlying calculi besides MA we\nconsider a subcalculus in which an image-finiteness condition holds and that we\nprove to be Turing complete. Synchronous variants of these calculi are studied\nas well. In these calculi, we provide two operational characterisations of\n$_=L$: a coinductive one (as a form of bisimilarity) and an inductive one\n(based on structual properties of processes). After showing $_=L$ to be stricly\nfiner than barbed congruence, we establish axiomatisations of $_=L$ on the\nsubcalculus of MA (both the asynchronous and the synchronous version), enabling\nus to relate $_=L$ to structural congruence. We also present some\n(un)decidability results that are related to the above separation properties\nfor AL: the undecidability of $_=L$ on MA and its decidability on the\nsubcalculus.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2008 10:00:00 GMT"}, {"version": "v2", "created": "Thu, 4 Sep 2008 07:13:38 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Hirschkoff", "Daniel", ""], ["Lozes", "Etienne", ""], ["Sangiorgi", "Davide", ""]]}, {"id": "0806.4034", "submitter": "Kees Middelburg", "authors": "J. A. Bergstra, C. A. Middelburg", "title": "Data linkage dynamics with shedding", "comments": "22 pages; introduction improved. arXiv admin note: substantial text\n  overlap with arXiv:0804.4565", "journal-ref": "Fundamenta Informaticae, 103(1--4):31--52, 2010", "doi": "10.3233/FI-2010-317", "report-no": "PRG0809", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study shedding in the setting of data linkage dynamics, a simple model of\ncomputation that bears on the use of dynamic data structures in programming.\nShedding is complementary to garbage collection. With shedding, each time a\nlink to a data object is updated by a program, it is determined whether or not\nthe link will possibly be used once again by the program, and if not the link\nis automatically removed. Thus, everything is made garbage as soon as it can be\nviewed as garbage. By that, the effectiveness of garbage collection becomes\nmaximal.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jun 2008 07:15:35 GMT"}, {"version": "v2", "created": "Fri, 7 May 2010 15:11:57 GMT"}], "update_date": "2012-10-20", "authors_parsed": [["Bergstra", "J. A.", ""], ["Middelburg", "C. A.", ""]]}, {"id": "0806.4130", "submitter": "Thomas Schneider", "authors": "Martin Mundhenk (1), Thomas Schneider (2), Thomas Schwentick (3),\n  Volker Weber (3) ((1) University of Jena, (2) University of Manchester, (3)\n  University of Dortmund)", "title": "Complexity of Hybrid Logics over Transitive Frames", "comments": "21 pages, 6 figures (only 2 thereof are in external files)", "journal-ref": "Workshop \"Methods for Modalities\" (M4M-4), Informatik-Berichte,\n  194, pp. 62-78, 2005. ISSN 0863-095X", "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines the complexity of hybrid logics over transitive frames,\ntransitive trees, and linear frames. We show that satisfiability over\ntransitive frames for the hybrid language extended with the downarrow operator\nis NEXPTIME-complete. This is in contrast to undecidability of satisfiability\nover arbitrary frames for this language (Areces, Blackburn, Marx 1999). It is\nalso shown that adding the @ operator or the past modality leads to\nundecidability over transitive frames. This is again in contrast to the case of\ntransitive trees and linear frames, where we show these languages to be\nnonelementarily decidable. Moreover, we establish 2EXPTIME and EXPTIME upper\nbounds for satisfiability over transitive frames and transitive trees,\nrespectively, for the hybrid Until/Since language. An EXPTIME lower bound is\nshown to hold for the modal Until language over both frame classes.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jun 2008 15:38:43 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Mundhenk", "Martin", ""], ["Schneider", "Thomas", ""], ["Schwentick", "Thomas", ""], ["Weber", "Volker", ""]]}, {"id": "0806.4553", "submitter": "Viorica  Sofronie-Stokkermans", "authors": "Viorica Sofronie-Stokkermans", "title": "Interpolation in local theory extensions", "comments": "31 pages, 1 figure", "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 4 (October\n  17, 2008) lmcs:1143", "doi": "10.2168/LMCS-4(4:1)2008", "report-no": null, "categories": "cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study interpolation in local extensions of a base theory. We\nidentify situations in which it is possible to obtain interpolants in a\nhierarchical manner, by using a prover and a procedure for generating\ninterpolants in the base theory as black-boxes. We present several examples of\ntheory extensions in which interpolants can be computed this way, and discuss\napplications in verification, knowledge representation, and modular reasoning\nin combinations of local theories.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 15:51:02 GMT"}, {"version": "v2", "created": "Thu, 16 Oct 2008 22:01:02 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Sofronie-Stokkermans", "Viorica", ""]]}, {"id": "0806.4631", "submitter": "Anton Salikhmetov", "authors": "Anton Salikhmetov", "title": "The Heap Lambda Machine", "comments": "14 pages, 4 figures, source code appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a new machine architecture for evaluating lambda\nexpressions using the normal-order reduction, which guarantees that every\nlambda expression will be evaluated if the expression has its normal form and\nthe system has enough memory. The architecture considered here operates using\nheap memory only. Lambda expressions are represented as graphs, and all\nalgorithms used in the processing unit of this machine are non-recursive.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 23:22:38 GMT"}, {"version": "v2", "created": "Thu, 4 Nov 2010 18:10:02 GMT"}], "update_date": "2010-11-05", "authors_parsed": [["Salikhmetov", "Anton", ""]]}, {"id": "0806.4859", "submitter": "Stephane Lengrand", "authors": "St\\'ephane Lengrand (LIX)", "title": "Termination of lambda-calculus with the extra Call-By-Value rule known\n  as assoc", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we prove that any lambda-term that is strongly normalising for\nbeta-reduction is also strongly normalising for beta,assoc-reduction. assoc is\na call-by-value rule that has been used in works by Moggi, Joachimsky, Espirito\nSanto and others. The result has often been justified with incomplete or\nincorrect proofs. Here we give one in full details.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2008 11:29:21 GMT"}, {"version": "v2", "created": "Tue, 2 Sep 2008 19:17:17 GMT"}], "update_date": "2008-09-02", "authors_parsed": [["Lengrand", "Stéphane", "", "LIX"]]}, {"id": "0806.4956", "submitter": "Vishwanath Raman", "authors": "Luca de Alfaro, Rupak Majumdar, Vishwanath Raman, Mari\\\"elle Stoelinga", "title": "Game Refinement Relations and Metrics", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 3 (September\n  11, 2008) lmcs:781", "doi": "10.2168/LMCS-4(3:7)2008", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider two-player games played over finite state spaces for an infinite\nnumber of rounds. At each state, the players simultaneously choose moves; the\nmoves determine a successor state. It is often advantageous for players to\nchoose probability distributions over moves, rather than single moves. Given a\ngoal, for example, reach a target state, the question of winning is thus a\nprobabilistic one: what is the maximal probability of winning from a given\nstate?\n  On these game structures, two fundamental notions are those of equivalences\nand metrics. Given a set of winning conditions, two states are equivalent if\nthe players can win the same games with the same probability from both states.\nMetrics provide a bound on the difference in the probabilities of winning\nacross states, capturing a quantitative notion of state similarity.\n  We introduce equivalences and metrics for two-player game structures, and we\nshow that they characterize the difference in probability of winning games\nwhose goals are expressed in the quantitative mu-calculus. The quantitative\nmu-calculus can express a large set of goals, including reachability, safety,\nand omega-regular properties. Thus, we claim that our relations and metrics\nprovide the canonical extensions to games, of the classical notion of\nbisimulation for transition systems. We develop our results both for\nequivalences and metrics, which generalize bisimulation, and for asymmetrical\nversions, which generalize simulation.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2008 17:55:15 GMT"}, {"version": "v2", "created": "Wed, 10 Sep 2008 22:36:12 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["de Alfaro", "Luca", ""], ["Majumdar", "Rupak", ""], ["Raman", "Vishwanath", ""], ["Stoelinga", "Mariëlle", ""]]}]